{
  "date": "2025-12-02",
  "crawl_timestamp": "2025-12-02T01:31:43.211320",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 273,
    "total_gw_papers": 31,
    "by_category": {
      "gr-qc": {
        "total": 58,
        "gw_related": 10
      },
      "astro-ph": {
        "total": 170,
        "gw_related": 18
      }
    }
  },
  "crawl_verification": {
    "total_expected": 380,
    "total_actual": 380,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 104,
        "actual_crawled": 104,
        "page_source_info": "Total of 104 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 82,
        "actual_crawled": 82,
        "page_source_info": "Total of 82 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 41,
        "actual_crawled": 41,
        "page_source_info": "Total of 41 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 63,
        "actual_crawled": 63,
        "page_source_info": "Total of 63 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 40,
        "actual_crawled": 40,
        "page_source_info": "Total of 40 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 33,
        "actual_crawled": 33,
        "page_source_info": "Total of 33 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 17,
        "actual_crawled": 17,
        "page_source_info": "Total of 17 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.21786",
      "title": "Parity breaking reshapes black hole spectral dynamics",
      "authors": [
        "Han-Wen Hu",
        "Chen Lan",
        "Zong-Kuan Guo"
      ],
      "abstract": "Parity breaking reshapes black hole spectral dynamics Han-Wen Hu, Chen Lan, Zong-Kuan Guo General Relativity and Quantum Cosmology (gr-qc) We propose a dynamical amplification mechanism for detecting symmetry breaking in black holes through environmentally driven spectral instabilities of quasinormal modes. Focusing on dynamical Chern-Simons gravity as a paradigm for parity violation, we perturb the Schwarzschild background with a localized potential bump. Our analysis reveals three distinctive phenomena absent in general relativity: 1) topological reconnections of mode branches, 2) counterintuitive mode stabilization that delays overtaking transitions, and 3) scalar mode dominance emerging at intermediate coupling strengths. These dynamical features amplify weak static splittings into observable signatures, establishing a connection between gravitational symmetry breaking and non-Hermitian spectral physics. Our framework provides new pathways for testing modified gravity theories through gravitational wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.21786.pdf",
      "published": "2025-12-02T01:31:41.978412",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.21897",
      "title": "Gravitational waves from the late inspiral, transition, and plunge of small-mass-ratio eccentric binaries",
      "authors": [
        "Devin R. Becker",
        "Scott A. Hughes",
        "Gaurav Khanna"
      ],
      "abstract": "Gravitational waves from the late inspiral, transition, and plunge of small-mass-ratio eccentric binaries Devin R. Becker, Scott A. Hughes, Gaurav Khanna 27 pages, 13 figures; Submitted to Physical Review D General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Black hole binaries with small mass ratios will be important sources for the forthcoming Laser Interferometer Space Antenna (LISA) mission. Models of such binaries also serve as useful tools for understanding the dynamics of compact binary systems and the gravitational waves they emit. Using an eccentric Ori-Thorne procedure developed in previous work, we build worldlines that describe the full inspiral and plunge of a small body on an initially eccentric orbit of a Kerr black hole. We now calculate the gravitational waves associated with these trajectories using a code that solves the Teukolsky equation in the time domain. The final cycles of these waveforms, the ringdown, contains a superposition of Kerr quasinormal modes followed by a power-law tail. In this paper, we study how a binary's eccentricity and orbital anomaly angle affect the excitation of both quasinormal modes and late-time tails. We find that the relative excitation of quasinormal modes varies in an important and interesting way with these parameters. For some anomaly angles, the relative excitations of quasinormal modes are essentially indistinguishable from those excited in quasi-circular coalescences. Consistent with other recent studies, we find that eccentricity tends to amplify the late-time power-law tail, though the amount of this amplification varies significantly with orbital anomaly. We thus find that eccentricity has an important impact on the late-time coalescence waveform, but the interplay of eccentricity and orbit anomaly complicates this impact.",
      "pdf_url": "https://arxiv.org/pdf/2511.21897.pdf",
      "published": "2025-12-02T01:31:41.979066",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.21941",
      "title": "Searches for Post-Merger Gravitational Waves with CoCoA: Sensitivity Projections Across Large Template Banks for Current and Next-Generation Detectors",
      "authors": [
        "Tanazza Khanam",
        "Alessandra Corsi",
        "Robert Coyne",
        "Michael St. Pierre"
      ],
      "abstract": "Searches for Post-Merger Gravitational Waves with CoCoA: Sensitivity Projections Across Large Template Banks for Current and Next-Generation Detectors Tanazza Khanam (TTU/Rice U.), Alessandra Corsi (JHU), Robert Coyne (URI), Michael St. Pierre (URI) General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) The multi-messenger detection of the binary neutron star (NS) merger GW170817 has revolutionized the field of gravitational wave (GW) astronomy. However, several important questions remain to be answered. One of these is the nature of the compact remnant leftover by GW170817 (short- or long-lived NS versus black hole). A key goal going forward is to understand the diversity of NS-NS merger remnants, and how such diversity maps onto their viability as gamma-ray burst (GRB) central engines. Here, we present a study aimed at assessing the sensitivity of triggered searches for intermediate-duration, post-merger GWs powered by long-lived GRB remnants using networks of current and future ground-based GW detectors and the Cross-Correlation Algorithm (CoCoA). We develop a Python-based framework to efficiently estimate CoCoA distance horizons for a broad range of post merger secular bar-mode waveforms and for different GW detector networks. This framework can be used to identify the most promising regions of parameter space in which to concentrate search efforts, helping design future search strategies to optimally balance search sensitivity and related parameter space gridding schema against computational cost.",
      "pdf_url": "https://arxiv.org/pdf/2511.21941.pdf",
      "published": "2025-12-02T01:31:41.979550",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.22057",
      "title": "Measuring Cosmological Redshift Using Gravitational Waves from Compact Binaries with Mass Transfer",
      "authors": [
        "Zi-Han Zhang",
        "Tan Liu",
        "Shenghua Yu",
        "Zong-Kuan Guo"
      ],
      "abstract": "Measuring Cosmological Redshift Using Gravitational Waves from Compact Binaries with Mass Transfer Zi-Han Zhang, Tan Liu, Shenghua Yu, Zong-Kuan Guo General Relativity and Quantum Cosmology (gr-qc) The mass transfer process is prevalent during the inspiral phase of compact binary systems. Detection of gravitational waves from the inspiral phase of binaries with white dwarfs will allow us to measure the mass transfer rate. Mass transfer effects provide additional contributions to the phase of gravitational waves, which can break the degeneracy between binary masses and redshift. Based on the analytic mass transfer rate to the first order post-Newtonian evolution of orbital angular frequency, we use the Fisher matrix to forecast the ability of DECIGO to measure the redshift of compact binaries with mass transfer. We conclude that for compact binary systems containing white dwarfs, the redshift can be determined to an accuracy of $10\\%$ for $z=0.01$ with a $SNR\\thicksim 30$.",
      "pdf_url": "https://arxiv.org/pdf/2511.22057.pdf",
      "published": "2025-12-02T01:31:41.979716",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.23110",
      "title": "Strong-field Gravitational Wave Lensing in the Kerr Background",
      "authors": [
        "M. V. S. Saketh",
        "Rajes Ghosh",
        "Anuj Mishra"
      ],
      "abstract": "Strong-field Gravitational Wave Lensing in the Kerr Background M. V. S. Saketh, Rajes Ghosh, Anuj Mishra General Relativity and Quantum Cosmology (gr-qc) Gravitational lensing of gravitational waves (GWs) can encode valuable information about the properties of the intervening lens, yet most existing studies remain restricted to the small-deflection, weak-field regime. To bridge this crucial gap, this work presents the first systematic analysis of strong-field, wave-optical GW lensing by a Kerr black hole (BH), extending recent results for non-rotating lenses obtained in Chan et al. to the astrophysically more relevant case of spinning lens. Using the Mano-Suzuki-Takasugi formalism, we compute the strong-field scattering factor (SFSF) and show that the the spin produces characteristic modifications to the lensed waveform, and high-frequency incident radiation is not strongly absorbed by the BH lens, contrary to earlier claims in Chan et al. We further derive an explicit expression for the observed waveform for the general source-lens-observer configuration, showcasing the distortions produced by the scattering and quantifying their departure from the Schwarzschild case. Specializing to on-axis scattering, a mismatch analysis for a \\texttt{GW150914}-like source lensed by a Kerr BH of mass $M=10^2M_\\odot$ situated $100GM/c^2$ away from the source reveals percentage-level deviations from the direct (unscattered) wave at scattering angles near $30^\\circ$, across a range of lens spin values. The mismatch exhibits a sharp decrease at larger scattering angles. For a fixed scattering angle, however, the mismatch shows only a weak dependence on the BH spin in the case of on-axis scattering, which may improve for more general off-axis considerations. The framework developed here offers a unified treatment of strong-field GW scattering in Kerr spacetime and provides tools for interpreting future high-precision observations of compact-object lenses in the wave-optics regime.",
      "pdf_url": "https://arxiv.org/pdf/2511.23110.pdf",
      "published": "2025-12-02T01:31:41.982986",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.22597",
      "title": "The NANOGrav 12.5-year Data Set: Chromatic Noise Characterization & Mitigation with Time-Domain Kernels",
      "authors": [
        "Jeffrey S. Hazboun",
        "Joseph Simon",
        "Jeremy Baier",
        "Bjorn Larsen",
        "Daniel J. Oliver",
        "Paul T. Baker",
        "Bence Bécsy",
        "Siyuan Chen",
        "Alberto Diaz Hernandez",
        "Justin A. Ellis",
        "A. Miguel Holgado",
        "Kristina Islo",
        "Aaron Johnson",
        "Andrew R. Kaiser",
        "Nima Laal",
        "Alexander McEwen",
        "Nihan S. Pol",
        "Joey Shapiro Key",
        "Min Young Kim",
        "Matthew Samson",
        "Brent J. Shapiro-Albert",
        "Jerry P. Sun",
        "Stephen R. Taylor",
        "Caitlin A. Witt",
        "Jeremy Volpe",
        "Christine Ye",
        "Harsha Blumer",
        "Paul R. Brook",
        "Shami Chatterjee",
        "James M. Cordes",
        "Fronefield Crawford",
        "H. Thankful Cromartie",
        "Megan E. DeCesar",
        "Paul B. Demorest",
        "Timothy Dolch",
        "Robert D. Ferdman",
        "Elizabeth C. Ferrara",
        "William Fiore",
        "Emmanuel Fonseca",
        "Nathan Garver-Daniels",
        "Peter A. Gentile",
        "Deborah C. Good",
        "Ross J. Jennings",
        "Megan L. Jones",
        "David L. Kaplan",
        "Michael T. Lam",
        "T. Joseph W. Lazio",
        "Duncan R. Lorimer",
        "Jing Luo",
        "Ryan S. Lynch",
        "Dustin R. Madison",
        "Maura A. McLaughlin",
        "Chiara M. F. Mingarelli",
        "Cherry Ng",
        "David J. Nice",
        "Timothy T. Pennucci",
        "Scott M. Ransom",
        "Paul S. Ray",
        "Xavier Siemens",
        "Renée Spiewak",
        "Ingrid H. Stairs",
        "Daniel R. Stinebring",
        "Kevin Stovall",
        "Joseph K. Swiggum",
        "Jacob E. Turner",
        "Michele Vallisneri",
        "Sarah J. Vigeland"
      ],
      "abstract": "The NANOGrav 12.5-year Data Set: Chromatic Noise Characterization & Mitigation with Time-Domain Kernels Jeffrey S. Hazboun, Joseph Simon, Jeremy Baier, Bjorn Larsen, Daniel J. Oliver, Paul T. Baker, Bence Bécsy, Siyuan Chen, Alberto Diaz Hernandez, Justin A. Ellis, A. Miguel Holgado, Kristina Islo, Aaron Johnson, Andrew R. Kaiser, Nima Laal, Alexander McEwen, Nihan S. Pol, Joey Shapiro Key, Min Young Kim, Matthew Samson, Brent J. Shapiro-Albert, Jerry P. Sun, Stephen R. Taylor, Caitlin A. Witt, Jeremy Volpe, Christine Ye, Harsha Blumer, Paul R. Brook, Shami Chatterjee, James M. Cordes, Fronefield Crawford, H. Thankful Cromartie, Megan E. DeCesar, Paul B. Demorest, Timothy Dolch, Robert D. Ferdman, Elizabeth C. Ferrara, William Fiore, Emmanuel Fonseca, Nathan Garver-Daniels, Peter A. Gentile, Deborah C. Good, Ross J. Jennings, Megan L. Jones, David L. Kaplan, Michael T. Lam, T. Joseph W. Lazio, Duncan R. Lorimer, Jing Luo, Ryan S. Lynch, Dustin R. Madison, Maura A. McLaughlin, Chiara M. F. Mingarelli, Cherry Ng, David J. Nice, Timothy T. Pennucci, Scott M. Ransom, Paul S. Ray, Xavier Siemens, Renée Spiewak, Ingrid H. Stairs, Daniel R. Stinebring, Kevin Stovall, Joseph K. Swiggum, Jacob E. Turner, Michele Vallisneri, Sarah J. Vigeland Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Pulsar timing arrays (PTAs) have recently entered the detection era, quickly moving beyond the goal of simply improving sensitivity at the lowest frequencies for the sake of observing the stochastic gravitational wave background (GWB), and focusing on its accurate spectral characterization. While all PTA collaborations around the world use Fourier-domain Gaussian processes to model the GWB and intrinsic long time-correlated (red) noise, techniques to model the time-correlated radio frequency-dependent (chromatic) processes have varied from collaboration to collaboration. Here we test a new class of models for PTA data, Gaussian processes based on time-domain kernels that model the statistics of the chromatic processes starting from the covariance matrix. As we will show, these models can be effectively equivalent to Fourier-domain models in mitigating chromatic noise. This work presents a method for Bayesian model selection across the various choices of kernel as well as deterministic chromatic models for non-stationary chromatic events and the solar wind. As PTAs turn towards high frequency (>1/yr) sensitivity, the size of the basis used to model these processes will need to increase, and these time-domain models present some computational efficiencies compared to Fourier-domain models.",
      "pdf_url": "https://arxiv.org/pdf/2511.22597.pdf",
      "published": "2025-12-02T01:31:41.987333",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.22987",
      "title": "Incorporating neutron star physics into gravitational wave inference with neural priors",
      "authors": [
        "Thibeau Wouters",
        "Peter T. H. Pang",
        "Tim Dietrich",
        "Chris Van Den Broeck"
      ],
      "abstract": "Incorporating neutron star physics into gravitational wave inference with neural priors Thibeau Wouters, Peter T. H. Pang, Tim Dietrich, Chris Van Den Broeck High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Bayesian inference, widely used in gravitational-wave parameter estimation, depends on the choice of priors, i.e., on our previously existing knowledge. However, to investigate neutron star mergers, priors are often chosen in an agnostic way, leaving valuable information from nuclear physics and independent observations of neutron stars unused. In this work, we propose to encode information on neutron star physics into data-driven prior distributions constructed with normalizing flows, referred to as neural priors. These priors take input from constraints on the nuclear equation of state and neutron star population models. Applied to GW170817, GW190425, and GW230529, we highlight two contributions of the framework. First, we demonstrate its ability to provide source classification and to enable model selection of equation of state constraints for loud signals such as GW170817, directly from the gravitational-wave data. Second, we obtain narrower constraints on the source properties through these informed priors. As a result, the neural priors consistently recover higher luminosity distances compared to agnostic priors. Our method paves the way for classifying future ambiguous low-mass mergers observed through gravitational waves and for continuously incorporating advances in our understanding of neutron star properties into gravitational-wave data analysis.",
      "pdf_url": "https://arxiv.org/pdf/2511.22987.pdf",
      "published": "2025-12-02T01:31:41.988198",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.23182",
      "title": "Primordial Black Holes as Dark Matter and the Tachyonic Trap During Inflation",
      "authors": [
        "Yuma S. Furuta",
        "Mindaugas Karčiauskas",
        "Kazunori Kohri",
        "Alejandro Sáez"
      ],
      "abstract": "Primordial Black Holes as Dark Matter and the Tachyonic Trap During Inflation Yuma S. Furuta, Mindaugas Karčiauskas, Kazunori Kohri, Alejandro Sáez Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We show that resonant processes during multi-field inflation can generate a large curvature perturbation on small scales. This perturbation naturally leads to the formation of primordial black holes that may constitute dark matter, as well as to the production of stochastic induced gravitational waves in the deci-Hz band. Such waves are within reach of future space-based interferometers such as LISA, DECIGO and BBO. In addition, primordial black hole binaries formed at late times produce merger gravitational waves that can be probed by the resonant cavity experiments in addition to DECIGO and BBO.",
      "pdf_url": "https://arxiv.org/pdf/2511.23182.pdf",
      "published": "2025-12-02T01:31:41.988917",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.23228",
      "title": "SlotFlow: Amortized Trans-Dimensional Inference with Slot-Based Normalizing Flows",
      "authors": [
        "Niklas Houba",
        "Giovanni Giarda",
        "Lorenzo Speri"
      ],
      "abstract": "SlotFlow: Amortized Trans-Dimensional Inference with Slot-Based Normalizing Flows Niklas Houba, Giovanni Giarda, Lorenzo Speri Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); Data Analysis, Statistics and Probability (physics.data-an) Inferring the number of distinct components contributing to an observation, while simultaneously estimating their parameters, remains a long-standing challenge across signal processing, astrophysics, and neuroscience. Classical trans-dimensional Bayesian methods such as Reversible Jump Markov Chain Monte Carlo (RJMCMC) provide asymptotically exact inference but can be computationally expensive. Instead, modern deep learning provides a faster alternative to inference but typically assume fixed component counts, sidestepping the core challenge of trans-dimensionality. To address this, we introduce SlotFlow, a deep learning architecture for trans-dimensional amortized inference. The architecture processes time-series observations, which we represent jointly in the frequency and time domains through parallel encoders. A classifier produces a distribution over component counts K, and its MAP estimate specifies the number of slots instantiated. Each slot is parameterized by a shared conditional normalizing flow trained via permutation-invariant Hungarian matching. On sinusoidal decomposition with up to 10 overlapping components and Gaussian noise, SlotFlow achieves 99.85% cardinality accuracy and well-calibrated parameter posteriors, with systematic biases well below one posterior standard deviation. Direct comparison with RJMCMC shows close agreement in amplitude and phase, with Wasserstein distances $W_2 < 0.01$ and $< 0.03$, indicating that shared global context captures inter-component structure despite a factorized posterior. Frequency posteriors remain centered but exhibit 2-3x broader intervals, consistent with an encoder bottleneck in retaining long-baseline phase coherence. The method delivers a $\\sim 10^6\\times$ speedup over RJMCMC, suggesting applicability to time-critical workflows in gravitational-wave astronomy, neural spike sorting, and object-centric vision.",
      "pdf_url": "https://arxiv.org/pdf/2511.23228.pdf",
      "published": "2025-12-02T01:31:41.989401",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2501.01413",
      "title": "Post-adiabatic waveform-generation framework for asymmetric precessing binaries",
      "authors": [
        "Josh Mathews",
        "Adam Pound"
      ],
      "abstract": "Post-adiabatic waveform-generation framework for asymmetric precessing binaries Josh Mathews, Adam Pound 39 pages, 0 figures. Minor updates reflecting version published in PRD General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Recent years have seen rapid progress in calculations of gravitational waveforms from asymmetric compact binaries containing spinning secondaries. Here we outline a complete waveform-generation scheme, through first post-adiabatic order (1PA) in gravitational self-force theory, for generic secondary spin and generic (eccentric, precessing) orbital configurations around a generic Kerr primary. We emphasize the utility of a Fermi-Walker frame in parametrizing the secondary spin, and we analyse precession and nutation effects in the spin-orbit dynamics. We also explain convenient gauge choices within the waveform-generation scheme, and the gauge invariance of the resulting waveform. Finally, we highlight that, thanks to recent results due to Grant and Witzany et al., all relevant spin effects at 1PA order can now be computed without evaluating local self-forces or torques.",
      "pdf_url": "https://arxiv.org/pdf/2501.01413.pdf",
      "published": "2025-12-02T01:31:41.991438",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2504.18635",
      "title": "Waveform models for the gravitational-wave memory effect: II. Time-domain and frequency-domain models for nonspinning binaries",
      "authors": [
        "Arwa Elhashash",
        "David A. Nichols"
      ],
      "abstract": "Waveform models for the gravitational-wave memory effect: II. Time-domain and frequency-domain models for nonspinning binaries Arwa Elhashash, David A. Nichols General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) The nonlinear gravitational-wave (GW) memory effect$\\unicode{x2014}$a permanent shift in the GW strain that arises from nonlinear GW interactions in the wave zone$\\unicode{x2014}$is a prediction of general relativity which has not yet been observed. The amplitude of the GW memory effect from binary-black-hole (BBH) mergers is small compared to that of primary (oscillatory) GWs and is unlikely to be detected by current ground-based detectors. Evidence for its presence in the population of all the BBH mergers is more likely, once thousands of detections are made by these detectors. Having an accurate and computationally efficient waveform model of the memory signal will assist detecting the memory effect with current data-analysis pipelines. In this paper, we build on our prior work to develop analytical time-domain and frequency-domain models for the dominant nonlinear memory multipole signal ($l=2$, $m=0$) from nonspinning BBH mergers in quasicircular orbits. The model is calibrated for mass ratios between one and eight. There are three parts to the time-domain signal model: a post-Newtonian inspiral, a quasinormal-mode-based ringdown, and a phenomenological signal during the late inspiral and merger (which interpolates between the inspiral and ringdown). The time-domain model also has an analytical Fourier transform, which we compute in this paper. We assess the accuracy of our model using the mismatch between our waveform model and the memory signal computed from the oscillatory modes of a numerical-relativity surrogate model. We use the advanced LIGO sensitivity curve from the fourth observing run and find that the mismatch increases with the total mass of the system and is of order $10^{-2}\\unicode{x2013}10^{-4}$.",
      "pdf_url": "https://arxiv.org/pdf/2504.18635.pdf",
      "published": "2025-12-02T01:31:41.991872",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.06094",
      "title": "Gravitational waves in minimal Maxwell $f(R)$ gravity",
      "authors": [
        "Salvatore Capozziello",
        "Qingyu Gan"
      ],
      "abstract": "Gravitational waves in minimal Maxwell $f(R)$ gravity Salvatore Capozziello, Qingyu Gan Phys. Lett. B 872 (2026) 140038 General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We discuss the conversion mechanism from scalar field to gravitational waves in magnetic background in $f(R)$ gravity minimal coupled to the Maxwell electrodynamics. Applying the conversion in early universe with primordial magnetic field and the neutron star with strong magnetosphere, the generated gravitational waves, converted from the scalar field, exhibit distinct power spectra which can be potentially probed by future experiments such as DECIGO, BBO, CE and ET.",
      "pdf_url": "https://arxiv.org/pdf/2507.06094.pdf",
      "published": "2025-12-02T01:31:41.992608",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.12126",
      "title": "Strong Field Scattering of Two Black Holes: Exploring Gauge Flexibility",
      "authors": [
        "Adam Clark",
        "Geraint Pratten"
      ],
      "abstract": "Strong Field Scattering of Two Black Holes: Exploring Gauge Flexibility Adam Clark, Geraint Pratten 32 pages, 17 figures. v2: Published version, with minor typo in abstract fixed Phys. Rev. D 112, 104074 (2025) General Relativity and Quantum Cosmology (gr-qc) Recent advances in post-Minkowskian (PM) gravity provide new avenues for the high precision modeling of compact binaries. In conjunction with the effective one body (EOB) formalism, highly accurate PM informed models of binary black holes on scattering trajectories have emerged. Several complementary approaches currently exist, in particular the SEOB-PM model, the $w$_{\\rm EOB} framework and the recent Lagrange-EOB (LEOB) approach. These models incorporate PM results in fundamentally different ways, employing distinct resummation schemes and gauge choices. Notably, both SEOB-PM and LEOB have been used to compute gravitational waves of bound systems, showing excellent agreement with numerical relativity (NR). The essential component to all of the models is the EOB mass-shell condition describing the dynamics of the two-body spacetime. In this work we will investigate how this mass-shell condition is constructed, paying particular attention to the impact of gauge choices and how they interact with different resummation schemes, showing that there is a strong dependence on both coordinate choice and EOB gauge. For the region of parameter space considered, we find that the best performing gauges coincide with the choices made in SEOB-PM and $w$_{\\rm EOB}, with other choices exhibiting worse performance. The case of spinning black holes is also considered, where the current techniques for spinning EOB-PM are reviewed and compared. We also introduce a new gauge based upon the centrifugal radius, which improves upon previous models, particularly for large and negative spins. This offers a promising avenue for further resummation of spin information within the EOB-PM framework.",
      "pdf_url": "https://arxiv.org/pdf/2508.12126.pdf",
      "published": "2025-12-02T01:31:41.993320",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.07601",
      "title": "Covariant Carrollian Electric and Magnetic Limits of General Relativity",
      "authors": [
        "Tanmay Patil",
        "S. Shankaranarayanan"
      ],
      "abstract": "Covariant Carrollian Electric and Magnetic Limits of General Relativity Tanmay Patil, S. Shankaranarayanan (IIT Bombay) 43 pages, Version accepted in JHEP General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The Carrollian limit ($c \\to 0$) of General Relativity provides the geometric language for describing null hypersurfaces, such as black hole event horizons and null infinity. Motivated by the well-established electric and magnetic limits of Galilean electromagnetism, we perform a systematic analysis of the low-velocity limit of linearized gravity to derive its Carrollian counterparts. Using a 1+3 covariant decomposition, we study the transformation properties of linear tensor perturbations (gravitational waves) on a Friedmann-Lemaitre-Robertson-Walker background under Carrollian boosts. We demonstrate that, analogous to the electromagnetic case, the full set of linearized Einstein's equations is not Carrollian-invariant. Instead, the theory bifurcates into two distinct and consistent frameworks: a Carrollian Electric Limit and a Carrollian Magnetic Limit. In the electric limit, dynamics are frozen, leaving a static theory of tidal forces ($E_{ab}$) constrained by the matter distribution. In contrast, the Magnetic Limit yields a consistent dynamical theory where the magnetic part of the Weyl tensor ($H_{ab}$), which governs gravito-magnetic and radiative effects, remains well-defined and is sourced by the spacetime shear. This framework resolves ambiguities in defining Carrollian gravity and provides a robust theory for gravito-magnetic dynamics in ultra-relativistic regimes. Our results have direct implications for the study of black hole horizons, gravitational memory, and the holographic principle.",
      "pdf_url": "https://arxiv.org/pdf/2509.07601.pdf",
      "published": "2025-12-02T01:31:41.993517",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2410.14664",
      "title": "Stochastic gravitational wave background anisotropies from inflation with non-Bunch-Davies states",
      "authors": [
        "Shingo Akama",
        "Shin'ichi Hirano",
        "Shuichiro Yokoyama"
      ],
      "abstract": "Stochastic gravitational wave background anisotropies from inflation with non-Bunch-Davies states Shingo Akama, Shin'ichi Hirano, Shuichiro Yokoyama Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) It is known that stochastic gravitational wave backgrounds (SGWBs) have anisotropies generated by squeezed-type tensor non-Gaussianities originating from scalar-tensor-tensor (STT) and tensor-tensor-tensor cubic interactions. While the squeezed tensor non-Gaussianities in the standard slow-roll inflation with the Bunch-Davies vacuum state are suppressed due to the so-called consistency relation, those in extended models with the violation of the consistency relation can be enhanced. Among such extended models, we consider the inflation model with the non-Bunch-Davies state that is known to enhance the squeezed tensor non-Gaussianities. We explicitly formulate the primordial STT bispectrum induced during inflation in the context of Horndeski theory with the non-Bunch-Davies state and show that the induced SGWB anisotropies can be enhanced. We then discuss the detectability of those anisotropies in future gravitational wave experiments.",
      "pdf_url": "https://arxiv.org/pdf/2410.14664.pdf",
      "published": "2025-12-02T01:31:41.996178",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2504.18986",
      "title": "A multi-messenger window into galactic magnetic fields and black hole mergers with LISA",
      "authors": [
        "Anuraag Reddy",
        "Nathan Steinle",
        "Samar Safi-Harb",
        "Jo-Anne Brown"
      ],
      "abstract": "A multi-messenger window into galactic magnetic fields and black hole mergers with LISA Anuraag Reddy, Nathan Steinle, Samar Safi-Harb, Jo-Anne Brown High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) Large-scale (i.e., $\\gtrsim {\\rm kpc}$) and micro-Gauss scale magnetic fields have been observed throughout the Milky Way and nearby galaxies. These fields depend on the geometry and matter-energy composition, can display complicated behavior such as direction reversals, and are intimately related to the evolution of the source galaxy. Simultaneously, gravitational-wave astronomy offers a new probe into astrophysical systems, for example the Laser Interferometer Space Antenna (LISA) will observe the mergers of massive (i.e., $M ~> 10^6$ M$_{\\odot}$) black-hole binaries and provide extraordinary constraints on the evolution of their galactic hosts. In this work, we show how galactic, large-scale magnetic fields and their electromagnetic signatures are connected with LISA gravitational-wave observations via their common dependence on the massive black-hole binary formation scenario of hierarchical galaxy mergers. Combining existing codes, we astrophysically evolve a population of massive binaries from formation to merger and find that they are detectable by LISA with signal-to-noise ratio $\\sim 10^3$ which is correlated with quantities from the progenitors' phase of circumbinary disk migration such as the maximum magnetic field magnitude $|\\mathbf{B}| \\approx 7 \\,\\mu$G, polarized intensity, and Faraday rotation measure. Interesting correlations result between these observables arising from their dependencies on the black-hole binary total mass, suggesting a need for further analyses of the full parameter space. We conclude with a discussion on this new multi-messenger window into galactic magnetic fields.",
      "pdf_url": "https://arxiv.org/pdf/2504.18986.pdf",
      "published": "2025-12-02T01:31:41.997576",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.19466",
      "title": "Where did Heavy Binaries Go? Gravitational-wave Populations Using Delaunay Triangulation with Optimized Complexity",
      "authors": [
        "Rodrigo Tenorio",
        "Alexandre Toubiana",
        "Tristan Bruel",
        "Davide Gerosa",
        "Jonathan R. Gair"
      ],
      "abstract": "Where did Heavy Binaries Go? Gravitational-wave Populations Using Delaunay Triangulation with Optimized Complexity Rodrigo Tenorio, Alexandre Toubiana, Tristan Bruel, Davide Gerosa, Jonathan R. Gair Astrophys. J. Lett. 994, L52 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We investigate the joint mass-redshift evolution of the binary black-hole merger rate in the latest Gravitational-Wave Transient Catalog, GWTC-4.0. We present and apply a novel non-parametric framework for modeling multi-dimensional, correlated distributions based on Delaunay triangulation. Crucially, the complexity of the model -- namely, the number, positions, and weights of triangulation nodes -- is inferred directly from the data, resulting in a highly efficient approach that requires about one to two orders of magnitude fewer parameters and significantly less calibration than current state-of-the-art methods. We find no evidence for a peak at $M_{\\mathrm{tot}} \\sim 70\\,\\mathrm{M}_{\\odot}$ at low redshifts ($z \\sim 0.2$), where it would correspond to the $m_1 \\sim 35\\,\\mathrm{M}_{\\odot}$ feature reported in redshift-independent mass spectrum analyses, and we infer an increased merger rate at high redshifts ($z \\sim 1$) around those masses, compatible with such a peak. When related to the time-delay distribution from progenitor formation to binary black-hole merger, our results suggest that sources contributing to the $m_1 \\sim 35\\,\\mathrm{M}_{\\odot}$ feature follow a steeper (shallower) time-delay distribution at high (low) redshifts. This hints at contributions from different formation channels -- for example dense environments and isolated binary evolution, respectively -- although firm identification of specific formation pathways will require further observations and analyses.",
      "pdf_url": "https://arxiv.org/pdf/2509.19466.pdf",
      "published": "2025-12-02T01:31:42.000109",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.21949",
      "title": "The Atacama Cosmology Telescope: $B$-mode delensing with DR6 data and external tracers of large-scale structure",
      "authors": [
        "Emilie Hertig",
        "Antón Baleato Lizancos",
        "Frank J. Qu",
        "J. Richard Bond",
        "Erminia Calabrese",
        "Anthony Challinor",
        "Mark J. Devlin",
        "Jo Dunkley",
        "Thibaut Louis",
        "Mathew S. Madhavacheril",
        "Toshiya Namikawa",
        "Lyman A. Page",
        "Neelima Sehgal",
        "Blake Sherwin",
        "Cristóbal Sifón",
        "Suzanne T. Staggs",
        "Edward J. Wollack"
      ],
      "abstract": "The Atacama Cosmology Telescope: $B$-mode delensing with DR6 data and external tracers of large-scale structure Emilie Hertig, Antón Baleato Lizancos, Frank J. Qu, J. Richard Bond, Erminia Calabrese, Anthony Challinor, Mark J. Devlin, Jo Dunkley, Thibaut Louis, Mathew S. Madhavacheril, Toshiya Namikawa, Lyman A. Page, Neelima Sehgal, Blake Sherwin, Cristóbal Sifón, Suzanne T. Staggs, Edward J. Wollack 24 pages, 16 figures. Submitted to Physical Review D Cosmology and Nongalactic Astrophysics (astro-ph.CO) Large-scale $B$-mode polarization of the cosmic microwave background (CMB) is a prime target for current and future experiments in search of primordial gravitational waves (PGW). With increasingly sensitive instruments being deployed, secondary $B$-modes induced by the weak gravitational lensing of CMB photons are becoming an important limitation and need to be removed, a process known as delensing. In this work, we combine internally reconstructed CMB lensing maps from the Atacama Cosmology Telescope (ACT) DR6 with galaxy samples from unWISE and a map of the cosmic infrared background (CIB) fluctuations from Planck to produce a well-correlated tracer of the CMB lensing field. Our co-added tracer, shown to be 55-85% correlated with the true lensing convergence at multipoles $L \\leq 2000$, is then convolved with ACT DR6 $E$-mode polarization to yield a template of the lensing $B$-modes. We assess its performance on a wide range of scales by using it to delens ACT DR6 and Planck $B$-modes over 23% of the sky, removing around 39% of the lensing power at $100\\leq l \\leq 1500$ and 47% at $30 \\leq l \\leq 300$, respectively. Our template achieves the highest delensing efficiency to date and will be useful for the analysis of early polarization maps from the Simons Observatory (SO). We finally outline prospects for further improvements by including additional large-scale structure tracers from upcoming cosmological surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.21949.pdf",
      "published": "2025-12-02T01:31:42.171307",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.22309",
      "title": "Astrophysical constraints from future measurements of the kinetic Sunyaev-Zel'dovich power spectrum",
      "authors": [
        "Lisa McBride",
        "Adélie Gorce",
        "Marian Douspis",
        "Romain Meriot",
        "Benoît Semelin",
        "Lukas T. Hergt",
        "Stephane Ilić",
        "Miren Muñoz-Echeverría",
        "Etienne Pointecouteau",
        "Laura Salvati",
        "Matthieu Tristram"
      ],
      "abstract": "Astrophysical constraints from future measurements of the kinetic Sunyaev-Zel'dovich power spectrum Lisa McBride, Adélie Gorce, Marian Douspis, Romain Meriot, Benoît Semelin, Lukas T. Hergt, Stephane Ilić, Miren Muñoz-Echeverría, Etienne Pointecouteau, Laura Salvati, Matthieu Tristram Cosmology and Nongalactic Astrophysics (astro-ph.CO) High-precision measurements of the Cosmic Microwave Background (CMB) will soon allow for the unprecedented detection of small-scale secondary anisotropies, such as the kinetic Sunyaev-Zel'dovich (kSZ) effect. Linking the kSZ power spectrum to the properties of ionising sources would provide an opportunity to use such observations to access astrophysical and cosmological information from the Epoch of Reionisation, including the morphology of ionised regions, while simultaneously improving CMB analyses. The aim of this work is to assess this potential of the kSZ power spectrum to measure reionisation-era galaxy properties. We repurpose the publicly available LoReLi II simulations, which track the evolution of neutral hydrogen during reionisation, to generate a training set of patchy kSZ angular power spectra. We then train an emulator using neural network regression in order to allow for efficient Bayesian inference, and conduct forecasts assuming mock observations from current and future CMB experiments. We find that measurements of the kSZ power spectrum from such surveys can provide meaningful constraints on several of the astrophysical model parameters of the LoReLi II suite, including the ionising escape fraction for which we expect a 14% relative error, on average. They also provide an independent measurement of the CMB optical depth, marginalised over the astrophysics and with error bars competitive with the cosmic variance limit from large scale surveys. The kSZ power spectrum offers a promising avenue for probing the properties of reionisation-era galaxies and providing an independent measurement of the CMB optical depth with upcoming CMB experiments. Since the error budget of our mock observations is dominated by emulator reconstruction errors, we expect our results could be further improved with a more extended simulation training set.",
      "pdf_url": "https://arxiv.org/pdf/2511.22309.pdf",
      "published": "2025-12-02T01:31:42.172502",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.22949",
      "title": "Collapse of Axion Domain Wall Induced by Helical Primordial Magnetic Fields",
      "authors": [
        "Zizhuo Zhao",
        "Yuefeng Di",
        "Ligong Bian",
        "Jing Shu"
      ],
      "abstract": "Collapse of Axion Domain Wall Induced by Helical Primordial Magnetic Fields Zizhuo Zhao, Yuefeng Di, Ligong Bian, Jing Shu 7 pages + 9 pages, 14 figures, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Lattice (hep-lat); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Stable domain wall (DW) must decay to avoid overclose the Universe. A commonly used solution is to slightly break the PQ symmetry by introducing a bias term in the potential. In this work, we propose an alternative, symmetry-preserving mechanism: coupling the axion field to a helical primordial magnetic field (PMF) via the Chern-Simons term. Using three-dimensional lattice simulations, we evolve the DW network and demonstrate that it can successfully drive DW decay. Our quantitative results further show that the correlation length of the PMF plays a crucial role in determining the decay rate of the DW network and the resulting axion and gravitational wave radiation.",
      "pdf_url": "https://arxiv.org/pdf/2511.22949.pdf",
      "published": "2025-12-02T01:31:42.175770",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-lat",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.21933",
      "title": "Data span and frequency coverage requirements for robust detection and inference in PTAs: A case study with EPTA DR2",
      "authors": [
        "Irene Ferranti",
        "Mikel Falxa",
        "Federico Fantoccoli",
        "Alberto Sesana",
        "Golam Mohiuddin Shaifullah"
      ],
      "abstract": "Data span and frequency coverage requirements for robust detection and inference in PTAs: A case study with EPTA DR2 Irene Ferranti, Mikel Falxa, Federico Fantoccoli, Alberto Sesana, Golam Mohiuddin Shaifullah High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Pulsar Timing Arrays (PTAs) are approaching the sensitivity required for a $5\\sigma$ detection of the nanohertz stochastic gravitational-wave background (GWB). This makes it crucial to deeply understand the behaviour of our analysis pipelines. A counterintuitive feature of the European Pulsar Timing Array (EPTA) second data release is that restricting the dataset to the last 10.3 years (DR2new) increases the inferred GWB significance from $\\leq2\\sigma$ for the full 25-year dataset (DR2full) to $\\geq3.5\\sigma$. We investigate whether this behaviour indicates an anomaly or is a possible outcome of the pipeline. Using realistic, DR2-like simulations with varying timespans, we find that the first 10 years contribute little to the GWB evidence due to their limited frequency coverage. This produces substantial overlap between the HD S/N distributions of DR2full and DR2new. Random noise fluctuations therefore yield a higher GWB evidence in DR2new than in DR2full in $15\\%$ of cases. Furthermore, $5\\%$ of simulations match the HD S/N of the real data, indicating that the observed behaviour is consistent with being a $\\sim2\\sigma$ outcome due to noise fluctuations. Regardless of significance, DR2new simulations introduce biases in the GWB parameter estimation due to spectral leakage effects that are ignored in standard analyses and which flatten the inferred spectrum. Including leakage removes these biases, demonstrating the reliability of DR2new when the signal is properly modelled. Furthermore, we demonstrate that combining EPTA DR2full with long-baseline data from NANOGrav and PPTA, as well as low-frequency data from LOFAR and NenuFAR, significantly enhances GWB evidence and parameter accuracy. Finally, we examine the impact of the observation timespan and find that short-baseline datasets introduce strong amplitude biases and are ineffective at constraining the GWB.",
      "pdf_url": "https://arxiv.org/pdf/2511.21933.pdf",
      "published": "2025-12-02T01:31:42.192270",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2408.14531",
      "title": "Cosmological Parameter Estimation with a Joint-Likelihood Analysis of the Cosmic Microwave Background and Big Bang Nucleosynthesis",
      "authors": [
        "Cara Giovanetti",
        "Mariangela Lisanti",
        "Hongwan Liu",
        "Siddharth Mishra-Sharma",
        "Joshua T. Ruderman"
      ],
      "abstract": "Cosmological Parameter Estimation with a Joint-Likelihood Analysis of the Cosmic Microwave Background and Big Bang Nucleosynthesis Cara Giovanetti, Mariangela Lisanti, Hongwan Liu, Siddharth Mishra-Sharma, Joshua T. Ruderman Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We present the first joint-likelihood analysis of Big Bang Nucleosynthesis (BBN) and Cosmic Microwave Background (CMB) data. Bayesian inference is performed on the baryon abundance and the effective number of neutrino species, $N_{\\rm eff}$, using a CMB Boltzmann solver in combination with LINX, a new flexible and efficient BBN code. We marginalize over Planck nuisance parameters and nuclear rates to find $N_{\\rm{eff}} = 3.08_{-0.13}^{+0.13},\\,2.94 _{-0.16}^{+0.16},$ or $2.98_{-0.13}^{+0.14}$, for three separate reaction networks. This framework enables robust testing of the Lambda Cold Dark Matter paradigm and its variants with CMB and BBN data.",
      "pdf_url": "https://arxiv.org/pdf/2408.14531.pdf",
      "published": "2025-12-02T01:31:42.194536",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2408.14538",
      "title": "LINX: A Fast, Differentiable, and Extensible Big Bang Nucleosynthesis Package",
      "authors": [
        "Cara Giovanetti",
        "Mariangela Lisanti",
        "Hongwan Liu",
        "Siddharth Mishra-Sharma",
        "Joshua T. Ruderman"
      ],
      "abstract": "LINX: A Fast, Differentiable, and Extensible Big Bang Nucleosynthesis Package Cara Giovanetti, Mariangela Lisanti, Hongwan Liu, Siddharth Mishra-Sharma, Joshua T. Ruderman Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We introduce LINX (Light Isotope Nucleosynthesis with JAX), a new differentiable public Big Bang Nucleosynthesis (BBN) code designed for fast parameter estimation. By leveraging JAX, LINX achieves both speed and differentiability, enabling the use of Bayesian inference, including gradient-based methods. We discuss the formalism used in LINX for rapid primordial elemental abundance predictions and give examples of how LINX can be used. When combined with differentiable Cosmic Microwave Background (CMB) power spectrum emulators, LINX can be used for joint CMB and BBN analyses without requiring extensive computational resources, including on personal hardware.",
      "pdf_url": "https://arxiv.org/pdf/2408.14538.pdf",
      "published": "2025-12-02T01:31:42.194692",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2410.23210",
      "title": "A Catalog of First-Order Electroweak Phase Transitions in the Standard Model Effective Field Theory",
      "authors": [
        "Eliel Camargo-Molina",
        "Rikard Enberg",
        "Johan Löfgren"
      ],
      "abstract": "A Catalog of First-Order Electroweak Phase Transitions in the Standard Model Effective Field Theory Eliel Camargo-Molina, Rikard Enberg, Johan Löfgren High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We use modern dimensionally-reduced effective field theory methods, with careful attention to scale hierarchies, to analyze and catalog the types of first-order electroweak phase transitions that are possible in the Standard Model Effective Field Theory (SMEFT). Our calculations lay the necessary groundwork to perform gauge invariant, properly resummed perturbative expansions, and therefore address many of the theoretical problems with phase transition calculations. We find three types of configurations of the scalar potential that allow for a first-order phase transition, namely tree-level barriers, radiative barriers, or radiative symmetry breaking through the Coleman-Weinberg mechanism. We also find versions of these with significant supercooling. We perform a global likelihood scan over the Wilson coefficients of SMEFT operators involving only the Higgs field, to identify parameter regions that exhibit these first-order phase transitions and are consistent with experimental and theoretical constraints. We comment on the possibilities for electroweak baryogenesis within the SMEFT, and roughly estimate if the gravitational wave spectra generated by the phase transitions are detectable.",
      "pdf_url": "https://arxiv.org/pdf/2410.23210.pdf",
      "published": "2025-12-02T01:31:42.198362",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.14150",
      "title": "Hubble constant measurement from QPEs as electromagnetic counterparts to extreme mass ratio inspirals",
      "authors": [
        "Yejing Zhan",
        "Di Wang",
        "Shuang-Xi Yi",
        "Fa-Yin Wang"
      ],
      "abstract": "Hubble constant measurement from QPEs as electromagnetic counterparts to extreme mass ratio inspirals Yejing Zhan, Di Wang, Shuang-Xi Yi, Fa-Yin Wang 19 pages, 3 figures, 5 tables. Accepted by ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Gravitational waves (GWs) accompanied by electromagnetic (EM) counterparts provide a novel methodology to measure the Hubble constant ($H_0$), known as bright sirens. However, the rarity of such multi-messenger events limits the precision of the $H_0$ constraint. Recently, the newly-discovered nuclear transient, quasi-periodic eruptions (QPEs) show intriguing evidence of a stellar-mass companion captured by a supermassive black hole (SMBH) in an extreme/intermediate mass-ratio inspiral (EMRI/IMRI), which is the most promising sources of the space-based GW detectors, such as LISA. Here, we model the secular orbital evolution of known QPE systems using two frameworks: a stripping scenario in which periodic mass transfer at periapsis drives the evolution; and an orbiter-disk collision scenario in which the companion interacts with a misaligned accretion disk, modulated by coupled orbiter-disk precession. For each framework, we assess detectability by LISA, together with the resulting constraints on $H_0$. Our principal findings are: (i) in the stripping scenario, no currently known QPE reaches detectability within a four-year LISA mission. (ii) in the orbiter-disk scenario, two sources-eRO-QPE2 and eRO-QPE4-are detectable with signal-to-noise ratios $\\simeq 8.5-28.8$ and constrain $H_0$ with fractional uncertainty of 6.7-14.9\\%. QPE systems remain uncertain on the decade-long secular evolution. Therefore, they motivate continued time-domain monitoring of QPE candidates.",
      "pdf_url": "https://arxiv.org/pdf/2506.14150.pdf",
      "published": "2025-12-02T01:31:42.199040",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.27691",
      "title": "WallGo investigates: Theoretical uncertainties in the bubble wall velocity",
      "authors": [
        "Jorinde van de Vis",
        "Philipp Schicho",
        "Lauri Niemi",
        "Benoit Laurent",
        "Joonas Hirvonen",
        "Oliver Gould"
      ],
      "abstract": "WallGo investigates: Theoretical uncertainties in the bubble wall velocity Jorinde van de Vis, Philipp Schicho, Lauri Niemi, Benoit Laurent, Joonas Hirvonen, Oliver Gould 55 pages, 11 figures; v2 minor edits High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We examine theoretical uncertainties in state-of-the-art calculations of the bubble wall velocity during first-order cosmological phase transitions. By utilising the software WallGo for two extensions of the Standard Model, we find several $O(1)$ uncertainties arising from the number of particles taken out of equilibrium, the logarithmically and power enhanced collision integrals, the treatment of thermal masses, the nucleation temperature, the $\\tanh$ ansatz, and the perturbative order of the effective potential. However, we show that the linearisation of the Boltzmann equations is generally a good approximation with much smaller associated errors. We further clarify the limitations of the quasiparticle approximation in regions with negative mass squared. This study provides a detailed uncertainty budget and highlights where future efforts should be directed to improve the reliability of wall velocity and hence gravitational wave predictions.",
      "pdf_url": "https://arxiv.org/pdf/2510.27691.pdf",
      "published": "2025-12-02T01:31:42.200830",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.21895",
      "title": "Gravitational Waves as a Probe of Core Collapse Supernova Progenitor Structure",
      "authors": [
        "R. Daniel Murphy",
        "Elle Brinkman",
        "Colter J. Richardson",
        "Evan Semenak",
        "Anthony Mezzacappa",
        "Pedro Marronetti",
        "Eric J. Lentz",
        "Stephen W. Bruenn"
      ],
      "abstract": "Gravitational Waves as a Probe of Core Collapse Supernova Progenitor Structure R. Daniel Murphy, Elle Brinkman, Colter J. Richardson, Evan Semenak, Anthony Mezzacappa, Pedro Marronetti, Eric J. Lentz, Stephen W. Bruenn High Energy Astrophysical Phenomena (astro-ph.HE) We present the gravitational wave predictions from two-dimensional core collapse supernova (CCSN) simulations initiated from two nearly identical progenitors that have significantly different internal structures due to their late-stage stellar evolution. At the time of collapse, the 15.78 $M_{\\odot}$ and 15.79 $M_{\\odot}$ progenitors have compactness parameters $\\xi_{2.5}$ of 0.136 and 0.206, respectively. We connect several features of the gravitational wave signal from each model to its previously explored explosion dynamics. In particular, the greater accretion onto the PNS of the more compact model is evident in broad-band frequency features with larger amplitude gravitational wave strains and greater gravitational wave energy release when compared to the less compact model. Additionally, the faster contraction rate of the more compact model is reflected in the $\\sim$26% greater slope of the $g$-/$f$-mode feature (gfF) evolution of the gravitational wave signal. This work shows that in principle gravitational wave detection may provide information about interior stellar structure.",
      "pdf_url": "https://arxiv.org/pdf/2511.21895.pdf",
      "published": "2025-12-02T01:31:42.367643",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.23263",
      "title": "Macroscopic Dark Matter under siege: from White Dwarf Data to Gravitational Wave Detection",
      "authors": [
        "Siyu Jiang",
        "Aidi Yang",
        "Fa Peng Huang"
      ],
      "abstract": "Macroscopic Dark Matter under siege: from White Dwarf Data to Gravitational Wave Detection Siyu Jiang, Aidi Yang, Fa Peng Huang 8+12 pages, 3+6 figures, 0+1 table, comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) The nature of dark matter (DM) remains a profound mystery. Macroscopic candidates, such as Fermi-balls, offer a distinct alternative to conventional particle DM, yet their low number density makes terrestrial detection challenging. In this work, we present a unified search strategy for sub-saturated Fermi-ball DM. We first revisit and significantly update astrophysical constraints from compact objects, utilizing rigorous expressions and additional white dwarf data related to ignition and subsequent supernovae. Crucially, we then explore novel signatures of Fermi-balls in future gravitational wave experiments like LISA and TianQin, performing detailed signal-to-noise ratio and Fisher matrix analyses. By combining these updated white dwarf/neutron star limits with the projected gravitational wave sensitivities, we derive the most comprehensive constraints on Fermi-ball parameter space to date, demonstrating the power of multi-messenger approaches for probing macroscopic DM.",
      "pdf_url": "https://arxiv.org/pdf/2511.23263.pdf",
      "published": "2025-12-02T01:31:42.369619",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.23285",
      "title": "Properties of Core Collapse Supernovae from Binary Population Synthesis",
      "authors": [
        "Mark Martinez",
        "Anna O'Grady",
        "Katelyn Breivik",
        "Gina Chen"
      ],
      "abstract": "Properties of Core Collapse Supernovae from Binary Population Synthesis Mark Martinez, Anna O'Grady, Katelyn Breivik, Gina Chen 30 pages, 11 figures; to be submitted to ApJ; comments welcome! Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Core collapse supernovae (CCSNe) impact many areas of astrophysics, including compact object formation and gravitational waves, but many uncertainties remain in our understanding of the evolution of their progenitors. We use the binary population synthesis code COSMIC to simulate populations of CCSNe across a wide range of metallicities and binary evolution assumptions. Our models vary the prescriptions for mass transfer stability, common envelope ejection efficiency, natal kick strength, and remnant mass-limited explodability to assess their impact on the resulting population of CCSNe. We find that reproducing the observed Type I to Type II rate requires either low common envelope efficiency or modified prescriptions for common envelope survival, highlighting the importance of stellar mergers in shaping the CCSN population. We further classify our synthetic CCSNe into subtypes and present their relative abundances using several different sets of classification criteria, highlighting the large uncertainties that persist in mapping progenitor properties to spectral classes. Finally, we present delay time distributions (DTDs) for our overall populations, separated into Type I and II, and into the full set of observed subtypes. Our DTDs show that models reproducing the observed Type I to Type II rate produce a larger fraction of late CCSNe than is expected under standard assumptions.",
      "pdf_url": "https://arxiv.org/pdf/2511.23285.pdf",
      "published": "2025-12-02T01:31:42.372826",
      "updated": null,
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.SR",
        "cross_list_from": "astro-ph.SR"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.24396",
      "title": "Probing the nonstrange quark star equation of state with compact stars and gravitational waves",
      "authors": [
        "Shu-Peng Wang",
        "Zhen-Yan Lu",
        "Zhi-Jun Ma",
        "Rong-Yao Yang",
        "Jian-Feng Xu",
        "Xiangyun Fu"
      ],
      "abstract": "Probing the nonstrange quark star equation of state with compact stars and gravitational waves Shu-Peng Wang, Zhen-Yan Lu, Zhi-Jun Ma, Rong-Yao Yang, Jian-Feng Xu, Xiangyun Fu 12 pages, 6 figures. Matches published version High Energy Physics - Phenomenology (hep-ph); High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) A recent study shows that incorporating a new term into the thermodynamic potential density, as required by the thermodynamic consistency criterion, can effectively resolve the thermodynamic inconsistency problems of the conventional perturbative QCD model. This additional term plays a crucial role in resolving inconsistencies at relatively low densities and becomes negligible at extremely high densities. Within this revised perturbative QCD model, we find that if we require only that the energy per baryon of up-down ($ud$) quark matter exceeds 930 MeV so as not to contradict the standard nuclear physics, the maximum mass of an $ud$ quark star allowed by the revised perturbative QCD model can reach up to 2.17 $M_{\\odot}$. From this perspective, the observed 2.14 $M_{\\odot}$ pulsar PSR J0740+6620 may be an $ud$ quark star. However, if we further impose the constraint that the tidal deformability of a 1.4 $M_{\\odot}$ $ud$ quark star must be consistent with the GW170817 event, the maximum mass allowed by the revised perturbative QCD model would decrease to no more than 2.08 $M_{\\odot}$. Consequently, our results suggest that the compact object with a mass of 2.50-2.67 $M_{\\odot}$, as observed in the GW190814 event, cannot be an $ud$ quark star, according to the revised perturbative QCD model.",
      "pdf_url": "https://arxiv.org/pdf/2510.24396.pdf",
      "published": "2025-12-02T01:31:42.376352",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.05243",
      "title": "Rethinking mass transfer: a unified semi-analytical framework for circular and eccentric binaries. I. Orbital evolution due to conservative mass transfer",
      "authors": [
        "A. Parkosidis",
        "S. Toonen",
        "F. Dosopoulou",
        "E. Laplace"
      ],
      "abstract": "Rethinking mass transfer: a unified semi-analytical framework for circular and eccentric binaries. I. Orbital evolution due to conservative mass transfer A. Parkosidis, S. Toonen, F. Dosopoulou, E. Laplace Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Mass transfer (MT) is a fundamental process in stellar evolution. While MT in circular orbits is well studied, observations indicate that it also occurs in eccentric ones, where theoretical models are limited. We present a new semi-analytic framework for the secular orbital evolution of mass-transferring binaries, treating stars either as point-masses or as extended bodies. For the first time, a MT model is applicable to both circular and eccentric orbits and accommodates conservative and non-conservative MT across a broad range of mass ratios and stellar spins. We derive secular, orbit-averaged equations describing the orbital evolution by treating MT, mass loss, and angular momentum (AM) loss as perturbations to the general two-body problem. Assuming conservative MT, we compare our results to previous models and validate them against numerical integrations. Our model predicts eccentric post-MT systems in wider orbits than classical results. Compared to other eccentric MT frameworks we find a broader parameter space for orbital widening and eccentricity pumping. Accounting for extended bodies yields stronger semimajor axis and eccentricity growth at a given mass ratio, and further broadens the parameter space for orbital widening and eccentricity pumping. Whether extended bodies are considered or not, eccentric MT naturally predicts higher eccentricities at longer orbital periods, a correlation observed in numerous post-MT systems, providing a robust mechanism for their formation. Our model can be integrated into binary evolution and population synthesis codes to consistently treat conservative and non-conservative MT in arbitrarily eccentric orbits with applications ranging from MT on the main sequence to gravitational-wave progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2509.05243.pdf",
      "published": "2025-12-02T01:31:42.790747",
      "updated": null,
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}