{
  "date": "2026-01-08",
  "crawl_timestamp": "2026-01-08T01:32:01.726011",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 160,
    "total_gw_papers": 13,
    "by_category": {
      "gr-qc": {
        "total": 27,
        "gw_related": 3
      },
      "astro-ph": {
        "total": 111,
        "gw_related": 7
      }
    }
  },
  "crawl_verification": {
    "total_expected": 226,
    "total_actual": 226,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 48,
        "actual_crawled": 48,
        "page_source_info": "Total of 48 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 36,
        "actual_crawled": 36,
        "page_source_info": "Total of 36 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 42,
        "actual_crawled": 42,
        "page_source_info": "Total of 42 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 30,
        "actual_crawled": 30,
        "page_source_info": "Total of 30 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 29,
        "actual_crawled": 29,
        "page_source_info": "Total of 29 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 21,
        "actual_crawled": 21,
        "page_source_info": "Total of 21 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 20,
        "actual_crawled": 20,
        "page_source_info": "Total of 20 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.02468",
      "title": "Resonances in b-EMRIs: playing the black hole piano",
      "authors": [
        "João S. Santos",
        "Vitor Cardoso",
        "Alexandru Lupsasca",
        "José Natário",
        "Maarten van de Meent"
      ],
      "abstract": "Resonances in b-EMRIs: playing the black hole piano João S. Santos, Vitor Cardoso, Alexandru Lupsasca, José Natário, Maarten van de Meent 16 pages, 14 figures. Comments are welcome General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th); Classical Physics (physics.class-ph) Stellar-mass binaries evolving in the vicinity of supermassive black holes (SMBHs) may be common in the universe, either in active galactic nuclei or in other astrophysical environments. Here, we study in detail the resonant excitation of SMBH modes driven by a nearby stellar-mass binary. The resulting resonant energy fluxes vary with the orbital location and frequency of the binary, exhibiting a rich and complex structure. In particular, we find that the total energy flux radiated to infinity is maximized at a gravitational-wave frequency that is close to, but not exactly equal to, the real part of the corresponding quasinormal-mode frequency. Moreover, as the binary is moved farther away from the SMBH, this offset from the mode frequency becomes increasingly pronounced. In addition, for suitable orientations, the binary can effectively ``feed'' the light ring of the SMBH, selectively exciting particular oscillation modes. For rotating (Kerr) black holes, the mode spectrum is significantly more intricate; however, individual modes are also less strongly damped, leading to an enhanced - but more difficult to interpret - resonant response.",
      "pdf_url": "https://arxiv.org/pdf/2601.02468.pdf",
      "published": "2026-01-08T01:32:00.308666",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.02713",
      "title": "Utilizing anticoincidence veto in a search for gravitational-wave transients",
      "authors": [
        "Souradeep Pal"
      ],
      "abstract": "Utilizing anticoincidence veto in a search for gravitational-wave transients Souradeep Pal General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) We devise a technique to suppress the effect of noise transients occurring at gravitational-wave detectors based on temporal anticoincidence. Searches for gravitational-wave signals in the detector data are prone to spurious disturbances of terrestrial origin. The technique presented here benefits from the fact that such effects are generally non-coincident in time at geographically separated detectors. Therefore, abnormally loud triggers that are not time-coincident can be vetoed. We implement the veto technique in a matched-filter search for transient signals from binary black holes and observe search backgrounds to be generally close to the Gaussian limit. An improvement in the sensitivity of the search is demonstrated using simulated signals. The technique is expected to especially improve the detection efficiency of the search toward short duration transient signals.",
      "pdf_url": "https://arxiv.org/pdf/2601.02713.pdf",
      "published": "2026-01-08T01:32:00.309404",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.02904",
      "title": "Probing the nature of Einstein nonlinear Maxwell Yukawa black hole through gravitational wave forms from periodic orbits and quasiperiodic oscillations",
      "authors": [
        "Oreeda Shabbir",
        "Abubakir Shermatov",
        "Bushra Majeed",
        "Tehreem Zahra",
        "Mubasher Jamil",
        "Javlon Rayimbaev"
      ],
      "abstract": "Probing the nature of Einstein nonlinear Maxwell Yukawa black hole through gravitational wave forms from periodic orbits and quasiperiodic oscillations Oreeda Shabbir, Abubakir Shermatov, Bushra Majeed, Tehreem Zahra, Mubasher Jamil, Javlon Rayimbaev General Relativity and Quantum Cosmology (gr-qc) In this work, we study gravitational wave emission from periodic orbits of test particles, analyze quasi periodic oscillations, and constrain the parameters of the static, spherically symmetric Einstein nonlinear Maxwell Yukawa black hole. Using the Hamiltonian approach, we calculate the equations of motion of the particles. We analyze the effective potential to determine the innermost stable circular orbit and innermost bound circular orbit, illustrating how the Yukawa screening parameter and electric charge Q affect orbital stability and energy requirements. Periodic orbits are classified by integer triplets and exhibit characteristic zoom whirl behavior. Based on these orbits we compute the corresponding GW signals in both the polarizations. Finally, we perform Monte Carlo Markov Chain MCMC simulations to constrain the parameters of the ENLMY BH for four microquasars and the galactic center within the relativistic precession model.",
      "pdf_url": "https://arxiv.org/pdf/2601.02904.pdf",
      "published": "2026-01-08T01:32:00.310180",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.02458",
      "title": "Cosmic Collider Gravitational Waves sourced by Right-handed Neutrino production from Bubbles: Testing Seesaw, Leptogenesis and Dark Matter",
      "authors": [
        "Anish Ghoshal",
        "Pratyay Pal"
      ],
      "abstract": "Cosmic Collider Gravitational Waves sourced by Right-handed Neutrino production from Bubbles: Testing Seesaw, Leptogenesis and Dark Matter Anish Ghoshal, Pratyay Pal 55 pages, 15 figures + appendix + references Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We study a minimal type-I seesaw framework in which a first-order phase transition (FOPT), driven by a singlet scalar, produces right-handed neutrinos (RHNs) through bubble collisions, realizing a cosmic-scale collider that probes ultra-high energy scales. The resulting RHN distribution sources novel low-frequency gravitational-waves (GWs) in addition to the standard bubble-collision contribution. A stable lightest RHN can account for the observed dark matter (DM) relic abundance for masses as low as $M_{1} \\equiv m_{\\rm DM} \\gtrsim 10^{6}\\,\\mathrm{GeV}$, with the associated novel GW signal accessible in LISA, ET and upcoming LVK detectors. If the RHNs are unstable, their CP-violating decays generate the observed baryon asymmetry via leptogenesis for $M_{1} \\gtrsim 10^{11}\\,\\mathrm{GeV}$ and phase transition temperatures $T_* \\gtrsim 10^{6}\\,\\mathrm{GeV}$, for which the novel GW spectrum is detectable in ET, BBO and upcoming LVK. If RHN decays also populate a dark-sector fermion with mass $m_{\\chi} \\in [10^{-4},10^{4}],\\mathrm{GeV}$, successful co-genesis of baryons and asymmetric dark matter occurs for $T_* \\gtrsim 10^{7}\\,\\mathrm{GeV}$ and $M_{1} \\gtrsim 10^{9}\\,\\mathrm{GeV}$, naturally explaining $\\Omega_{\\rm DM} \\simeq 5\\Omega_{\\rm B}$. The corresponding GW signals are testable with LISA, ET, and BBO. Finally, we analyze a UV-complete multi-Majoron model, based on a global $U(1)_N \\times U(1)_{\\rm B-L}$ extension, motivated from the hierarchy of lepton masses, which we dub as Mojaron collider. The corresponding FOPT in this model leaves a distinctive GW signature arising from RHN production during $U(1)_N$ symmetry breaking detectable by BBO, ET and upcoming LVK. Successful leptogenesis is realized for heaviest RHN mass $M_3 \\sim 10^{10}\\,\\mathrm{GeV}$ and a $U(1)_N$ breaking vev $v_2 \\sim \\mathcal{O}(\\mathrm{TeV})$, which sets the seesaw scale.",
      "pdf_url": "https://arxiv.org/pdf/2601.02458.pdf",
      "published": "2026-01-08T01:32:00.312018",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.02467",
      "title": "On the exceptionality of exceptional gravitational-wave events",
      "authors": [
        "Rodrigo Tenorio",
        "Davide Gerosa"
      ],
      "abstract": "On the exceptionality of exceptional gravitational-wave events Rodrigo Tenorio, Davide Gerosa 4 pages, 4 figures, comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) In gravitational-wave astronomy, as in other scientific disciplines, ``exceptional'' sources attract considerable interest because they challenge our current understanding of the underlying (astro)physical processes. Crucially, ``exceptionality'' is defined only relative to the rest of the detected population. For instance, among all gravitational-wave events detected so far, GW231123 is the binary black hole with the largest total mass, while GW241110 is the binary black hole with the most strongly misaligned spin relative to the orbital angular momentum. Mandel [this http URL. 996 (2026) 1, L4] argued that apparent ``exceptionality'' may reflect measurement error rather than an extreme true value, and suggested that the total mass of GW231123 may be significantly overestimated. Here we present a quantitative analysis that supports this conceptual point. We find that claims of ``exceptionality'' obtained under agnostic priors should be critically questioned whenever measurement uncertainties are comparable to the width of the underlying population. Specifically, we find that the total mass of GW231123 is unlikely to be meaningfully affected by this effect while the spin of GW241110 is far less likely to be anti-aligned than initially claimed: about 70% of realizations that appear to yield an ``exceptionally anti-aligned'' spin are in fact consistent with either nonspinning or aligned configurations.",
      "pdf_url": "https://arxiv.org/pdf/2601.02467.pdf",
      "published": "2026-01-08T01:32:00.312215",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.03257",
      "title": "Heavy Black-Holes Also Matter in Standard Siren Cosmology",
      "authors": [
        "Grégoire Pierra",
        "Alexander Papadopoulos"
      ],
      "abstract": "Heavy Black-Holes Also Matter in Standard Siren Cosmology Grégoire Pierra, Alexander Papadopoulos Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) With the release of the Gravitational-Wave Transient Catalog GWTC-4.0 by the LIGO-Virgo-KAGRA (LVK) collaboration, 218 candidate detections of gravitational waves (GWs) from compact binary coalescences (CBCs) have been reported. This milestone represents a major advancement for GW cosmology, as many methods, particularly those employing the spectral siren approach, critically depend on the number of available sources. We investigate the impact of a novel parametric model describing the full population mass spectrum of CBCs on the estimation of the Hubble constant. This model is designed to test the impact of heavy black holes in GW cosmology. We perform a joint inference of cosmological and population parameters using 142 CBCs from GWTC-4.0 with a false alarm rate smaller than 0.25 per year, using both spectral and dark siren approaches. With spectral sirens, we estimate the Hubble constant to be $H_0 = 78.8^{+19.0}_{-15.3}\\,{\\rm km s^{-1} Mpc^{-1}}$ (68% CL), while the dark siren method yields $H_0 = 82.5^{+16.8}_{-14.3}\\,{\\rm km s^{-1} Mpc^{-1}}$ (68% CL). These results improve the uncertainty by approximately 30.4% and 36.2%, respectively. We show that this improvement is linked to the presence of a new mass scale in the binary black hole mass spectrum at $63.3^{+4.8}_{-4.8}\\,M_{\\odot}$, which provides additional constraints on the Hubble constant. Besides providing the tightest standard-siren constraints on $H_0$, this highlights the importance of a heavy-mass feature in the black hole spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2601.03257.pdf",
      "published": "2026-01-08T01:32:00.313380",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.20331",
      "title": "Supertranslation in the bulk for generic spacetime",
      "authors": [
        "Pujian Mao"
      ],
      "abstract": "Supertranslation in the bulk for generic spacetime Pujian Mao 5.5 pages, 2 figures; v2: many minor improvements, references added High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc) Supertranslations are usually defined as asymptotic symmetries associated with spacetime boundaries, such as null infinity and black hole horizons. In this Letter, we show that supertranslations admit a natural, coordinate-independent extension into the bulk of spacetime, realized as transitions between families of null hypersurfaces. This construction applies to generic spacetimes in arbitrary dimensions and unifies the realizations of supertranslations at null infinity and black hole horizons. The bulk supertranslation is connected to boundary supertranslation by characteristic flows. The associated symmetry algebra can be realized by light-ray operators defined on the null hypersurface. Within this framework, the gravitational wave memory effect corresponds to a shift of null hypersurfaces in the bulk. As explicit examples, we compute bulk supertranslations in Minkowski spacetime in arbitrary dimensions and in four-dimensional Schwarzschild spacetime, where we uncover a novel curvature-induced memory effect with observable consequences for light propagation.",
      "pdf_url": "https://arxiv.org/pdf/2512.20331.pdf",
      "published": "2026-01-08T01:32:00.316829",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.00980",
      "title": "Graviton-Photon Mixing by a Kerr-Newman Black Hole with Worldline EFT",
      "authors": [
        "Qinyuan Zheng"
      ],
      "abstract": "Graviton-Photon Mixing by a Kerr-Newman Black Hole with Worldline EFT Qinyuan Zheng High Energy Physics - Theory (hep-th); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) In black hole perturbation theory, the difficulty in separating electromagnetic and gravitational sectors of the coupled Teukolsky equations has prevented a general treatment of scattering processes involving both electromagnetic waves and gravitational waves in presence of a Kerr-Newman black hole. We present the first computation of the gauge-invariant, low-frequency scattering amplitude for graviton photoproduction by a Kerr-Newman black hole at tree level up to $\\mathcal{O}\\big((\\omega/m)^2\\big)$ or $\\mathcal{O}(S^2)$ and linear in $\\kappa$, using the worldline effective field theory. The relevant Wilson coefficients are determined by matching the graviton and photon one-point functions to the Kerr-Newman solution. We obtain the full angular dependence of the conversion cross section in the presence of spin and comment on the factorization relation between the graviton photoproduction amplitude and the photon Compton amplitude for a classical spinning source. The result provides a benchmark for future analyses of coupled gravitoelectromagnetic scattering in spinning charged compact object backgrounds.",
      "pdf_url": "https://arxiv.org/pdf/2601.00980.pdf",
      "published": "2026-01-08T01:32:00.317152",
      "updated": null,
      "categories": [
        "hep-th",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.02487",
      "title": "Thick Disks, Thin Hopes: Suppressed Capture and Merger Rates in AGN",
      "authors": [
        "Yashvardhan Tomar",
        "Philip F. Hopkins",
        "Kyle Kremer"
      ],
      "abstract": "Thick Disks, Thin Hopes: Suppressed Capture and Merger Rates in AGN Yashvardhan Tomar, Philip F. Hopkins, Kyle Kremer 11 pages, 2 figures. Submitted to Phys. Rev. D High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Multiple models have been suggested over the years to explain the structure and support of accretion disks around supermassive black holes, from the standard thin thermal-pressure-dominated $\\alpha$-disk model to more recent models that describe geometrically thicker radiation or magnetic or turbulence-dominated disks. In any case, objects embedded in the disk (e.g. compact objects, stars, gas, dust) can undergo gravitational and hydrodynamic interactions with each other leading to interesting processes such as binary interaction/capture, gravitational wave merger events, dynamical friction, accretion, gap opening, etc. It has long been argued that disks of active galactic nuclei (AGN) can enhance the rates for many of these events; however, almost all of that analysis has assumed specific thin-disk models (with aspect ratios $H/R \\lesssim 0.01$). We show here that the rates for processes such as these that are mediated by gravitational cross-sections has a very strong inverse dependence on the thickness $H/R$ (scaling as steeply as $(H/R)^{-8}$), and $H/R$ can vary in the outer disk (where these processes are often invoked) by factors $\\gtrsim 1000$ depending on the assumed source of pressure support in the disk. This predicts rates that can be lower by tens of orders-of-magnitude in some models, demonstrating that it is critical to account for disk parameters such as aspect ratio and different sources of disk pressure when computing any meaningful predictions for these rates. For instance, if magnetic pressure is important in the outer disk, as suggested in recent work, capture rates would be suppressed by factors $\\sim 10^{10}-10^{20}$ compared to previous studies where magnetic pressure was ignored.",
      "pdf_url": "https://arxiv.org/pdf/2601.02487.pdf",
      "published": "2026-01-08T01:32:00.552018",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.02556",
      "title": "The Lazuli Space Observatory: Architecture & Capabilities",
      "authors": [
        "Arpita Roy",
        "Stuart Feldman",
        "Pete Klupar",
        "John DiPalma",
        "Saul Perlmutter",
        "Ewan S. Douglas",
        "Greg Aldering",
        "Gabor Furesz",
        "Patrick Ingraham",
        "Gudmundur Stefansson",
        "Douglas Kelly",
        "Fan Yang Yang",
        "Thomas Wevers",
        "Nicole Arulanantham",
        "James Lasker",
        "Mickael Rigault",
        "Everett Schlawin",
        "Sander R. Zandbergen",
        "S. Pete Worden",
        "Ramya Anche",
        "Heejoo Choi",
        "Ian J. M. Crossfield",
        "Kevin Derby",
        "Jerry Edelstein",
        "Mike Eiklenborg",
        "Suvi Gezari",
        "Paul Giuliano",
        "Justin Hom",
        "Taylor J. Hoyt",
        "Hyukmo Kang",
        "Daewook Kim",
        "Keerthi Kunnumkai",
        "Leander Lacroix",
        "Jared R. Males",
        "Thomas J. Maccarone",
        "Kian Milani",
        "Timothy N. Miller",
        "Kelsey Lynn Miller",
        "Pierre Nicolas",
        "Antonella Palmese",
        "Jason Pero",
        "Laurent Pueyo",
        "Stephanie Rinaldi",
        "David J. Sand",
        "Christian Schneider",
        "Sanchit Sabhlok",
        "Arfon Smith",
        "Irina I. Stefan",
        "Saraswathi Kalyani Subramanian",
        "Kyle Van Gorkom",
        "Andre F. Wong",
        "Jaegun Yoo",
        "Md Abdullah Al Zaman",
        "the Lazuli Science Team"
      ],
      "abstract": "The Lazuli Space Observatory: Architecture & Capabilities Arpita Roy, Stuart Feldman, Pete Klupar, John DiPalma, Saul Perlmutter, Ewan S. Douglas, Greg Aldering, Gabor Furesz, Patrick Ingraham, Gudmundur Stefansson, Douglas Kelly, Fan Yang Yang, Thomas Wevers, Nicole Arulanantham, James Lasker, Mickael Rigault, Everett Schlawin, Sander R. Zandbergen, S. Pete Worden, Ramya Anche, Heejoo Choi, Ian J. M. Crossfield, Kevin Derby, Jerry Edelstein, Mike Eiklenborg, Suvi Gezari, Paul Giuliano, Justin Hom, Taylor J. Hoyt, Hyukmo Kang, Daewook Kim, Keerthi Kunnumkai, Leander Lacroix, Jared R. Males, Thomas J. Maccarone, Kian Milani, Timothy N. Miller, Kelsey Lynn Miller, Pierre Nicolas, Antonella Palmese, Jason Pero, Laurent Pueyo, Stephanie Rinaldi, David J. Sand, Christian Schneider, Sanchit Sabhlok, Arfon Smith, Irina I. Stefan, Saraswathi Kalyani Subramanian, Kyle Van Gorkom, Andre F. Wong, Jaegun Yoo, Md Abdullah Al Zaman, the Lazuli Science Team Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The Lazuli Space Observatory is a 3-meter aperture astronomical facility designed for rapid-response observations and precision astrophysics across visible to near-infrared wavelengths (400-1700 nm bandpass). An off-axis, freeform telescope delivers diffraction-limited image quality (Strehl $>$0.8 at 633 nm) to three instruments across a wide, flat focal plane. The three instruments provide complementary capabilities: a Wide-field Context Camera (WCC) delivers multi-band imaging over a 35' $\\times$ 12' footprint with high-cadence photometry; an Integral Field Spectrograph (IFS) provides continuous 400-1700 nm spectroscopy at R $\\sim$ 100-500 for stable spectrophotometry; and an ExtraSolar Coronagraph (ESC) enables high-contrast imaging expected to reach raw contrasts of $10^{-8}$ and post-processed contrasts approaching $10^{-9}$. Operating from a 3:1 lunar-resonant orbit, Lazuli will respond to targets of opportunity in under four hours--a programmatic requirement designed to enable routine temporal responsiveness that is unprecedented for a space telescope of this size. Lazuli's technical capabilities are shaped around three broad science areas: (1) time-domain and multi-messenger astronomy, (2) stars and planets, and (3) cosmology. These capabilities enable a potent mix of science spanning gravitational wave counterpart characterization, fast-evolving transients, Type Ia supernova cosmology, high-contrast exoplanet imaging, and spectroscopy of exoplanet atmospheres. While these areas guide the observatory design, Lazuli is conceived as a general-purpose facility capable of supporting a wide range of astrophysical investigations, with open time for the global community. We describe the observatory architecture and capabilities in the preliminary design phase, with science operations anticipated following a rapid development cycle from concept to launch.",
      "pdf_url": "https://arxiv.org/pdf/2601.02556.pdf",
      "published": "2026-01-08T01:32:00.552571",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.EP",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.00253",
      "title": "The Advanced X-ray Imaging Satellite (AXIS) Community Science Book",
      "authors": [
        "Michael Koss",
        "Nafisa Aftab",
        "Steven W. Allen",
        "Roberta Amato",
        "Hongjun An",
        "Igor Andreoni",
        "Timo Anguita",
        "Riccardo Arcodia",
        "Thomas Ayres",
        "Matteo Bachetti",
        "Maria Cristina Baglio",
        "Arash Bahramian",
        "Marco Balboni",
        "Ranieri D. Baldi",
        "Solen Balman",
        "Aya Bamba",
        "Eduardo Banados",
        "Tong Bao",
        "Iacopo Bartalucci",
        "Antara Basu-Zych",
        "Rebeca Batalha",
        "Lorenzo Battistini",
        "Franz Erik Bauer",
        "Andy Beardmore",
        "Werner Becker",
        "Ehud Behar",
        "Andrea Belfiore",
        "Paz Beniamini",
        "Elena Bertola",
        "Vinicius Bessa",
        "Henry Best",
        "Stefano Bianchi",
        "N. Biava",
        "Breanna A. Binder",
        "Elizabeth L. Blanton",
        "Arash Bodaghee",
        "Tamara Bogdanovic",
        "David Bogensberger",
        "A. Bonafede",
        "Matteo Bonetti",
        "Pol Bordas",
        "Alice Borghese",
        "Andrea Botteon",
        "Stella Boula",
        "Enrico Bozzo",
        "Marica Branchesi",
        "William Nielsen Brandt",
        "Joel Bregman",
        "Fabrizio Brighenti",
        "Ettore Bronzini",
        "Giulia Brunelli",
        "Marcella Brusa",
        "Esra Bulbul",
        "Kevin Burdge",
        "Alessandro Caccianiga",
        "Michael Calzadilla",
        "Sergio Campana",
        "Milvia Capalbi",
        "Fiamma Capitanio",
        "Nico Cappelluti",
        "Jonathan Carney",
        "Sabrina Casanova",
        "Daniel Castro",
        "S. Bradley Cenko",
        "Joheen Chakraborty",
        "Priyanka Chakraborty",
        "George Chartas",
        "Arka Chatterjee",
        "Prakriti Pal Choudhury",
        "Raven Cilley",
        "Francesca Civano",
        "Andrea Comastri",
        "Thomas Connor",
        "Michael F. Corcoran",
        "Lia Corrales",
        "Francesco Coti Zelati",
        "Weiguang Cui",
        "Filippo D'Ammando",
        "Kristen Dage",
        "Tansu Daylan",
        "Sabrina De Grandi",
        "Alessandra De Rosa",
        "Roberto Decarli",
        "Anne Decourchelle",
        "Nathalie Degenaar",
        "Antonino Del Popolo",
        "Alessandro Di Marco",
        "Tiziana Di Salvo",
        "Simone Dichiara",
        "Stephen DiKerby",
        "Steven Dillmann",
        "Neil Doerksen",
        "Paul Draghis",
        "Jeremy J. Drake",
        "Lorenzo Ducci",
        "Renato Dupke",
        "Joseph Durbak",
        "Girish M. Duvvuri",
        "Hannah Dykaar",
        "Dominique Eckert"
      ],
      "abstract": "The Advanced X-ray Imaging Satellite (AXIS) Community Science Book Michael Koss, Nafisa Aftab, Steven W. Allen, Roberta Amato, Hongjun An, Igor Andreoni, Timo Anguita, Riccardo Arcodia, Thomas Ayres, Matteo Bachetti, Maria Cristina Baglio, Arash Bahramian, Marco Balboni, Ranieri D. Baldi, Solen Balman, Aya Bamba, Eduardo Banados, Tong Bao, Iacopo Bartalucci, Antara Basu-Zych, Rebeca Batalha, Lorenzo Battistini, Franz Erik Bauer, Andy Beardmore, Werner Becker, Ehud Behar, Andrea Belfiore, Paz Beniamini, Elena Bertola, Vinicius Bessa, Henry Best, Stefano Bianchi, N. Biava, Breanna A. Binder, Elizabeth L. Blanton, Arash Bodaghee, Tamara Bogdanovic, David Bogensberger, A. Bonafede, Matteo Bonetti, Pol Bordas, Alice Borghese, Andrea Botteon, Stella Boula, Enrico Bozzo, Marica Branchesi, William Nielsen Brandt, Joel Bregman, Fabrizio Brighenti, Ettore Bronzini, Giulia Brunelli, Marcella Brusa, Esra Bulbul, Kevin Burdge, Alessandro Caccianiga, Michael Calzadilla, Sergio Campana, Milvia Capalbi, Fiamma Capitanio, Nico Cappelluti, Jonathan Carney, Sabrina Casanova, Daniel Castro, S. Bradley Cenko, Joheen Chakraborty, Priyanka Chakraborty, George Chartas, Arka Chatterjee, Prakriti Pal Choudhury, Raven Cilley, Francesca Civano, Andrea Comastri, Thomas Connor, Michael F. Corcoran, Lia Corrales, Francesco Coti Zelati, Weiguang Cui, Filippo D'Ammando, Kristen Dage, Tansu Daylan, Sabrina De Grandi, Alessandra De Rosa, Roberto Decarli, Anne Decourchelle, Nathalie Degenaar, Antonino Del Popolo, Alessandro Di Marco, Tiziana Di Salvo, Simone Dichiara, Stephen DiKerby, Steven Dillmann, Neil Doerksen, Paul Draghis, Jeremy J. Drake, Lorenzo Ducci, Renato Dupke, Joseph Durbak, Girish M. Duvvuri, Hannah Dykaar, Dominique Eckert 592 pages, 226 figures, version 2 High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) The AXIS Community Science Book represents the collective effort of 592 scientists worldwide to define the transformative science enabled by the Advanced X-ray Imaging Satellite (AXIS), a next-generation X-ray mission selected by NASA's Astrophysics Probe Program for Phase A study. AXIS will advance the legacy of high-angular-resolution X-ray astronomy with ~1.5'' imaging over a wide 24' field of view and an order of magnitude greater collecting area than Chandra in the 0.3-12 keV band. Combining sharp imaging, high throughput, and rapid response capabilities, AXIS will open new windows on virtually every aspect of modern astrophysics, exploring the birth and growth of supermassive black holes, the feedback processes that shape galaxies, the life cycles of stars and exoplanet environments, and the nature of compact stellar remnants, supernova remnants, and explosive transients. This book compiles 138 community-contributed science cases developed by five Science Working Groups focused on AGN and supermassive black holes, galaxy evolution and feedback, compact objects and supernova remnants, stellar physics and exoplanets, and time-domain and multi-messenger astrophysics. Together, these studies establish the scientific foundation for next-generation X-ray exploration in the 2030s and highlight strong synergies with facilities of the 2030s, such as JWST, Roman, Rubin/LSST, SKA, ALMA, ngVLA, and next-generation gravitational-wave and neutrino networks.",
      "pdf_url": "https://arxiv.org/pdf/2511.00253.pdf",
      "published": "2026-01-08T01:32:00.557828",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.05508",
      "title": "Beyond $ρ^{2/3}$ Scaling: Microscopic Origins and Multimessengers of High-Density Nuclear Symmetry Energy",
      "authors": [
        "Bao-An Li"
      ],
      "abstract": "Beyond $ρ^{2/3}$ Scaling: Microscopic Origins and Multimessengers of High-Density Nuclear Symmetry Energy Bao-An Li Accepted version of a 53-page invited contribution to the Euro. Phys. Jour. Special Topic on \"High-density nuclear matter\". This article is dedicated to the memory of Prof. Philip J. Siemens (1943-2023) Nuclear Theory (nucl-th); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th); Nuclear Experiment (nucl-ex) Nuclear symmetry energy $E_{\\mathrm{sym}}(\\rho)$ encoding the cost to make nuclear matter more neutron rich has been the most uncertain component of the EOS of dense neutron-rich nucleonic matter. It affects significantly the radii, tidal deformations, cooling rates and frequencies of various oscillation modes of isolated neutron stars as well as the strain amplitude and frequencies of gravitational waves from their mergers, besides its many effects on structures of nuclei as well as the dynamics and observables of their collisions. Siemens (1970s) observed that $E_{\\mathrm{sym}}(\\rho)$ scales as $(\\rho/\\rho_0)^{2/3}$ near the saturation density $\\rho_0$ of nuclear matter, since both the kinetic part and the potential contribution (quadratic in momentum) exhibit this dependence. The scaling holds if: (1) the nucleon isoscalar potential is quadratic in momentum, and (2) the isovector interaction is weakly density dependent. After examining many empirical evidences and understanding theoretical findings in the literature we conclude that: (1) Siemens' $\\rho^{2/3}$ scaling is robust and serves as a valuable benchmark for both nuclear theories and experiments up to $2\\rho_0$ but breaks down at higher densities, (2) Experimental and theoretical findings about $E_{\\mathrm{sym}}(\\rho)$ up to $2\\rho_0$ are broadly consistent, but uncertainties remain large for its curvature $K_{\\mathrm{sym}}$ and higher-order parameters, (3) Above $2\\rho_0$, uncertainties grow due to poorly constrained spin-isospin dependent tensor and three-body forces as well as the resulting nucleon short-range correlations. Looking forward, combining multimessengers from both observations of neutron stars and terrestrial heavy-ion reaction experiments is the most promising path to finally constraining precisely the high-density $E_{\\mathrm{sym}}(\\rho)$ and the EOS of supradense neutron-rich matter.",
      "pdf_url": "https://arxiv.org/pdf/2510.05508.pdf",
      "published": "2026-01-08T01:32:00.879915",
      "updated": null,
      "categories": [
        "nucl-th",
        "astro-ph.HE",
        "hep-ph",
        "hep-th",
        "nucl-ex"
      ],
      "primary_category": "nucl-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.02576",
      "title": "Optomechanical platform for high-frequency gravitational wave and vector dark matter detection",
      "authors": [
        "David Rousso",
        "Moritz Bjoern Kristiansson Kunze",
        "Christoph Reinhardt"
      ],
      "abstract": "Optomechanical platform for high-frequency gravitational wave and vector dark matter detection David Rousso, Moritz Bjoern Kristiansson Kunze, Christoph Reinhardt Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph); Instrumentation and Detectors (physics.ins-det) We present a proposal for a nanomechanical membrane resonator integrated into a moderate-finesse ($\\mathcal{F}\\sim 10$) optical cavity as a versatile platform for detecting high-frequency gravitational waves and vector dark matter. Gravitational-wave sensitivity arises from cavity-length modulation, which resonantly drives membrane motion via the radiation-pressure force. This force also enables in situ tuning of the membrane's resonance frequency by nearly a factor of two, allowing a frequency coverage from 0.5 to 40 kHz using six membranes. The detector achieves a peak strain sensitivity of $2\\times 10^{-23}/\\sqrt{\\text{Hz}}$ at 40 kHz. Using a silicon membrane positioned near a gallium-arsenide input mirror additionally provides sensitivity to vector dark matter via differential acceleration from their differing atomic-to-mass number ratios. The projected reach surpasses the existing limits in the range of $2\\times 10^{-12}$ to $2\\times 10^{-10}$ $\\text{eV}/c^2$ for a one-year measurement. Consequently, the proposed detector offers a unified approach to searching for physics beyond the Standard Model, probing both high-frequency gravitational waves and vector dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2601.02576.pdf",
      "published": "2026-01-08T01:32:01.579980",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    }
  ]
}