{
  "date": "2026-01-16",
  "crawl_timestamp": "2026-01-16T01:32:21.746232",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 133,
    "total_gw_papers": 14,
    "by_category": {
      "gr-qc": {
        "total": 26,
        "gw_related": 6
      },
      "astro-ph": {
        "total": 100,
        "gw_related": 8
      }
    }
  },
  "crawl_verification": {
    "total_expected": 190,
    "total_actual": 190,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 38,
        "actual_crawled": 38,
        "page_source_info": "Total of 38 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 27,
        "actual_crawled": 27,
        "page_source_info": "Total of 27 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 33,
        "actual_crawled": 33,
        "page_source_info": "Total of 33 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 30,
        "actual_crawled": 30,
        "page_source_info": "Total of 30 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 24,
        "actual_crawled": 24,
        "page_source_info": "Total of 24 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 16,
        "actual_crawled": 16,
        "page_source_info": "Total of 16 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 22,
        "actual_crawled": 22,
        "page_source_info": "Total of 22 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.09607",
      "title": "Confronting eikonal and post-Kerr methods with numerical evolution of scalar field perturbations in spacetimes beyond Kerr",
      "authors": [
        "Ciro De Simone",
        "Sebastian H. Völkel",
        "Kostas D. Kokkotas",
        "Vittorio De Falco",
        "Salvatore Capozziello"
      ],
      "abstract": "Confronting eikonal and post-Kerr methods with numerical evolution of scalar field perturbations in spacetimes beyond Kerr Ciro De Simone, Sebastian H. Völkel, Kostas D. Kokkotas, Vittorio De Falco, Salvatore Capozziello General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) The accurate computation of quasinormal modes from rotating black holes beyond general relativity is crucial for testing fundamental physics with gravitational waves. In this study, we assess the accuracy of the eikonal and post-Kerr approximations in predicting the quasinormal mode spectrum of a scalar field on a deformed Kerr spacetime. To obtain benchmark results and to analyze the ringdown dynamics from generic perturbations, we further employ a 2+1-dimensional numerical time-evolution framework. This approach enables a systematic quantification of theoretical uncertainties across multiple angular harmonics, a broad range of spin parameters, and progressively stronger deviations from the Kerr geometry. We then confront these modeling errors with simple projections of statistical uncertainties in quasinormal mode frequencies as a function of the signal-to-noise ratio, thereby exploring the domain of validity of approximate methods for prospective high-precision black-hole spectroscopy. We also report that near-horizon deformations can affect prograde and retrograde modes differently and provide a geometrical explanation.",
      "pdf_url": "https://arxiv.org/pdf/2601.09607.pdf",
      "published": "2026-01-16T01:32:20.601323",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.09678",
      "title": "The impact of waveform systematics and Gaussian noise on the interpretation of GW231123",
      "authors": [
        "Sophie Bini",
        "Krzysztof Król",
        "Katerina Chatziioannou",
        "Maximiliano Isi"
      ],
      "abstract": "The impact of waveform systematics and Gaussian noise on the interpretation of GW231123 Sophie Bini, Krzysztof Król, Katerina Chatziioannou, Maximiliano Isi General Relativity and Quantum Cosmology (gr-qc) GW231123 is an exceptional gravitational-wave event consistent with the merger of two massive, highly-spinning black holes. Reliable inference of the source properties is crucial for accurate interpretation of its astrophysical implications. However, characterization of GW231123 is challenging: only few signal cycles are observed and different signal models result in systematically different parameters. We investigate whether the interpretation of GW231123 is robust against model systematics and Gaussian detector noise. We show that the model systematics observed in GW231123 can be reproduced for a simulated signal based on the numerical-relativity surrogate model NRSur7dq4. Simulating data using the maximum-likelihood NRSur7dq4 waveform for GW231123 and no noise realization, we closely recover the systematics observed for the real signal. We then explore how the headline properties of GW231123 are impacted by Gaussian detector noise. Using the NRSur7dq4 maximum-likelihood waveform and different noise realizations, we consistently find support for large masses, high spin magnitudes (median $\\chi_1\\geq 0.7$), and high spin precession (median $\\chi_\\mathrm{p}\\geq 0.68$). The spin in the direction of the angular momentum ($\\chi_\\mathrm{eff}$) fluctuates more. Finally, again comparing to simulated signals, we show that any differences in the GW231123 inference based on each separate detector are not statistically significant. These results show that the properties of GW231123, and most importantly the high mass and high spin magnitudes inferred by NRSur7dq4, are robust.",
      "pdf_url": "https://arxiv.org/pdf/2601.09678.pdf",
      "published": "2026-01-16T01:32:20.601905",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08915",
      "title": "Note on pulsar timing array correlation functions induced by peculiar velocities",
      "authors": [
        "Neha Anil Kumar",
        "Keisuke Inomata",
        "Marc Kamionkowski"
      ],
      "abstract": "Note on pulsar timing array correlation functions induced by peculiar velocities Neha Anil Kumar, Keisuke Inomata, Marc Kamionkowski Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Several papers have recently calculated the contribution to pulsar timing array overlap reduction functions (ORFs) induced by our peculiar velocity with respect to the rest frame of the stochastic gravitational-wave background. Here we show that a harmonic-space calculation confirms the most recent result. We note that, with the harmonic-space calculation, the ORFs for spin-1 GWs and the correlations with astrometry measurements are also easily obtained.",
      "pdf_url": "https://arxiv.org/pdf/2601.08915.pdf",
      "published": "2026-01-16T01:32:20.602066",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.09054",
      "title": "Upper limits on microhertz gravitational waves from supermassive black-hole binaries using PSR J1909-3744 data from the second IPTA data release",
      "authors": [
        "Jing Zou",
        "Jingbo Wang Jianping Yuan",
        "De Zhao",
        "Yirong Wen",
        "Wei Li",
        "Na Wang",
        "Yong Xia"
      ],
      "abstract": "Upper limits on microhertz gravitational waves from supermassive black-hole binaries using PSR J1909-3744 data from the second IPTA data release Jing Zou, Jingbo Wang Jianping Yuan, De Zhao, Yirong Wen, Wei Li, Na Wang, Yong Xia High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We present the results of a search for gravitational waves (GWs) from individual sources using high-cadence observations of PSR J1909\\(-\\)3744 obtained during an intensive observing campaign with the International Pulsar Timing Array second data release (IPTA-DR2) between July 2010 and November 2012. The observations, conducted at three different radio frequencies with the Nançay Radio Telescope (NRT) and Parkes Telescope (PKS) and five frequencies with the Green Bank Telescope (GBT), enabled precise corrections for dispersion measure effects and scattering variations. After these corrections, the timing residuals showed an unmodeled periodic noise component with an amplitude of 340 ns. Our analysis yields upper limits on the GW strain from individual sources, constraining it to be below \\(1.9 \\times 10^{-14}\\) at 71 nHz and \\(2.3 \\times 10^{-13}\\) at 1 \\textmu Hz for average sky locations, while for optimal source locations the limits improve to \\(6.2 \\times 10^{-15}\\) and \\(8.9 \\times 10^{-14}\\) at the same frequencies, respectively. Our new limits are about a factor of 1.52 more stringent than those of Perera et al. based on an earlier EPTA data.",
      "pdf_url": "https://arxiv.org/pdf/2601.09054.pdf",
      "published": "2026-01-16T01:32:20.602289",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.09481",
      "title": "The NANOGrav 15 yr Data Set: Piecewise Power-Law Reconstruction of the Gravitational-Wave Background",
      "authors": [
        "Gabriella Agazie",
        "Akash Anumarlapudi",
        "Anne M. Archibald",
        "Zaven Arzoumanian",
        "Jeremy G. Baier",
        "Paul T. Baker",
        "Bence Bécsy",
        "Amit Bhoonah",
        "Laura Blecha",
        "Adam Brazier",
        "Paul R. Brook",
        "Sarah Burke-Spolaor",
        "Rand Burnette",
        "Robin Case",
        "J. Andrew Casey-Clyde",
        "Maria Charisi",
        "Shami Chatterjee",
        "Tyler Cohen",
        "James M. Cordes",
        "Neil J. Cornish",
        "Fronefield Crawford",
        "Thankful Cromartie",
        "Kathryn Crowter",
        "Megan E. DeCesar",
        "Paul B. Demorest",
        "Heling Deng",
        "Lankeswar Dey",
        "Timothy Dolch",
        "Elizabeth C. Ferrara",
        "William Fiore",
        "Emmanuel Fonseca",
        "Gabriel E. Freedman",
        "Emiko C. Gardiner",
        "Nate Garver-Daniels",
        "Peter A. Gentile",
        "Kyle A. Gersbach",
        "Joseph Glaser",
        "Brenda D. Gómez-Cortes",
        "Deborah C. Good",
        "Kayhan Gültekin",
        "C. J. Harris",
        "Jeffrey S. Hazboun",
        "Ross J. Jennings",
        "Aaron D. Johnson",
        "Megan L. Jones",
        "David L. Kaplan",
        "Luke Zoltan Kelley",
        "Matthew Kerr",
        "Joey S. Key",
        "Nima Laal",
        "Michael T. Lam",
        "William G. Lamb",
        "Bjorn Larsen",
        "T. Joseph W. Lazio",
        "Natalia Lewandowska",
        "Monica Leys",
        "Tingting Liu",
        "Duncan R. Lorimer",
        "Jing Luo",
        "Ryan S. Lynch",
        "Chung-Pei Ma",
        "Dustin R. Madison",
        "Cayenne Matt",
        "Alexander McEwen",
        "James W. McKee",
        "Maura A. McLaughlin",
        "Natasha McMann",
        "Bradley W. Meyers",
        "Patrick M. Meyers",
        "Chiara M. F. Mingarelli",
        "Andrea Mitridate",
        "Cherry Ng",
        "David J. Nice",
        "Stella Koch Ocker",
        "Ken D. Olum",
        "Timothy T. Pennucci",
        "Benetge B. P. Perera",
        "Polina Petrov",
        "Nihan S. Pol",
        "Henri A. Radovan",
        "Scott M. Ransom",
        "Paul S. Ray",
        "Joseph D. Romano",
        "Jessie C. Runnoe",
        "Alexander Saffer",
        "Shashwat C. Sardesai",
        "Ann Schmiedekamp",
        "Carl Schmiedekamp",
        "Kai Schmitz",
        "Brent J. Shapiro-Albert",
        "Xavier Siemens",
        "Joseph Simon",
        "Sophia V. Sosa Fiscella",
        "Ingrid H. Stairs",
        "Daniel R. Stinebring",
        "Kevin Stovall",
        "Abhimanyu Susobhanan",
        "Joseph K. Swiggum",
        "Jacob Taylor",
        "Stephen R. Taylor"
      ],
      "abstract": "The NANOGrav 15 yr Data Set: Piecewise Power-Law Reconstruction of the Gravitational-Wave Background Gabriella Agazie, Akash Anumarlapudi, Anne M. Archibald, Zaven Arzoumanian, Jeremy G. Baier, Paul T. Baker, Bence Bécsy, Amit Bhoonah, Laura Blecha, Adam Brazier, Paul R. Brook, Sarah Burke-Spolaor, Rand Burnette, Robin Case, J. Andrew Casey-Clyde, Maria Charisi, Shami Chatterjee, Tyler Cohen, James M. Cordes, Neil J. Cornish, Fronefield Crawford, Thankful Cromartie, Kathryn Crowter, Megan E. DeCesar, Paul B. Demorest, Heling Deng, Lankeswar Dey, Timothy Dolch, Elizabeth C. Ferrara, William Fiore, Emmanuel Fonseca, Gabriel E. Freedman, Emiko C. Gardiner, Nate Garver-Daniels, Peter A. Gentile, Kyle A. Gersbach, Joseph Glaser, Brenda D. Gómez-Cortes, Deborah C. Good, Kayhan Gültekin, C. J. Harris, Jeffrey S. Hazboun, Ross J. Jennings, Aaron D. Johnson, Megan L. Jones, David L. Kaplan, Luke Zoltan Kelley, Matthew Kerr, Joey S. Key, Nima Laal, Michael T. Lam, William G. Lamb, Bjorn Larsen, T. Joseph W. Lazio, Natalia Lewandowska, Monica Leys, Tingting Liu, Duncan R. Lorimer, Jing Luo, Ryan S. Lynch, Chung-Pei Ma, Dustin R. Madison, Cayenne Matt, Alexander McEwen, James W. McKee, Maura A. McLaughlin, Natasha McMann, Bradley W. Meyers, Patrick M. Meyers, Chiara M. F. Mingarelli, Andrea Mitridate, Cherry Ng, David J. Nice, Stella Koch Ocker, Ken D. Olum, Timothy T. Pennucci, Benetge B. P. Perera, Polina Petrov, Nihan S. Pol, Henri A. Radovan, Scott M. Ransom, Paul S. Ray, Joseph D. Romano, Jessie C. Runnoe, Alexander Saffer, Shashwat C. Sardesai, Ann Schmiedekamp, Carl Schmiedekamp, Kai Schmitz, Brent J. Shapiro-Albert, Xavier Siemens, Joseph Simon, Sophia V. Sosa Fiscella, Ingrid H. Stairs, Daniel R. Stinebring, Kevin Stovall, Abhimanyu Susobhanan, Joseph K. Swiggum, Jacob Taylor, Stephen R. Taylor High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The NANOGrav 15-year (NG15) data set provides evidence for a gravitational-wave background (GWB) signal at nanohertz frequencies, which is expected to originate either from a cosmic population of inspiraling supermassive black-hole binaries or new particle physics in the early Universe. A firm identification of the source of the NG15 signal requires an accurate reconstruction of its frequency spectrum. In this paper, we provide such a spectral characterization of the NG15 signal based on a piecewise power-law (PPL) ansatz that strikes a balance between existing alternatives in the literature. Our PPL reconstruction is more flexible than the standard constant-power-law model, which describes the GWB spectrum in terms of only two parameters: an amplitude A and a spectral index gamma. Concurrently, it better approximates physically realistic GWB spectra -- especially those of cosmological origin -- than the free spectral model, since the latter allows for arbitrary variations in the GWB amplitude from one frequency bin to the next. Our PPL reconstruction of the NG15 signal relies on individual PPL models with a fixed number of internal nodes (i.e., constant power law, broken power law, doubly broken power law, etc.) that are ultimately combined in a Bayesian model average. The data products resulting from our analysis provide the basis for fast refits of spectral GWB models.",
      "pdf_url": "https://arxiv.org/pdf/2601.09481.pdf",
      "published": "2026-01-16T01:32:20.603520",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.09521",
      "title": "Resolving Hubble tension and locating missing baryons: Synergies between fast radio bursts and emerging cosmological probes",
      "authors": [
        "Peng-Ju Wu",
        "Bo-Yang Zhang",
        "Ji-Guo Zhang",
        "Guo-Hong Du",
        "Shang-Jie Jin",
        "Xin Zhang"
      ],
      "abstract": "Resolving Hubble tension and locating missing baryons: Synergies between fast radio bursts and emerging cosmological probes Peng-Ju Wu, Bo-Yang Zhang, Ji-Guo Zhang, Guo-Hong Du, Shang-Jie Jin, Xin Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Two of the most pressing challenges in cosmology are the persistent discrepancy in measurements of the Hubble constant, referred to as the Hubble tension, and the deficit of baryons in the local Universe, known as the missing baryon problem. Fast radio bursts (FRBs) encode the integrated electron column density along their lines of sight, offering a unique probe of both the cosmic expansion rate ($H_0$) and the baryon density ($\\Omega_{\\rm b}$). However, constraints from FRBs alone suffer from a severe $H_0$-$\\Omega_{\\rm b}$ degeneracy that prevents them from resolving either problem independently. We show that this degeneracy can be broken by combining FRBs with other emerging probes whose degeneracy directions differ in the $H_0$-$\\Omega_{\\rm b}$ plane. Specifically, we quantify three multi-messenger approaches: FRBs paired with gravitational wave (GW) standard sirens, strong gravitational lensing (SGL) time delays, and 21 cm intensity mapping (IM). The combinations FRB+GW, FRB+SGL, and FRB+21 cm IM each deliver simultaneous constraints on $H_0$ and $\\Omega_{\\rm b}$ better than ($1\\%$, $1\\%$) in the $\\Lambda$CDM model, ($1.5\\%$, $2\\%$) in the $w$CDM model, and ($2\\%$, $3.5\\%$) in the CPL model. Moreover, in a model-independent framework, both FRB+GW and FRB+SGL constrain $H_0$ and $\\Omega_{\\rm b}$ to better than ($1\\%$, $2\\%$) precision. These results demonstrate that the synergy between FRBs and other emerging probes holds great promise for resolving the Hubble tension and locating the missing baryons.",
      "pdf_url": "https://arxiv.org/pdf/2601.09521.pdf",
      "published": "2026-01-16T01:32:20.603763",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.05153",
      "title": "Trust the process: mapping data-driven reconstructions to informed models using stochastic processes",
      "authors": [
        "Stefano Rinaldi",
        "Alexandre Toubiana",
        "Jonathan R. Gair"
      ],
      "abstract": "Trust the process: mapping data-driven reconstructions to informed models using stochastic processes Stefano Rinaldi, Alexandre Toubiana, Jonathan R. Gair 26 pages, 8 figures. Comments welcome General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM); Applications (stat.AP) Gravitational-wave astronomy has entered a regime where it can extract information about the population properties of the observed binary black holes. The steep increase in the number of detections will offer deeper insights, but it will also significantly raise the computational cost of testing multiple models. To address this challenge, we propose a procedure that first performs a non-parametric (data-driven) reconstruction of the underlying distribution, and then remaps these results onto a posterior for the parameters of a parametric (informed) model. The computational cost is primarily absorbed by the initial non-parametric step, while the remapping procedure is both significantly easier to perform and computationally cheaper. In addition to yielding the posterior distribution of the model parameters, this method also provides a measure of the model's goodness-of-fit, opening for a new quantitative comparison across models.",
      "pdf_url": "https://arxiv.org/pdf/2506.05153.pdf",
      "published": "2026-01-16T01:32:20.604304",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM",
        "stat.AP"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.13958",
      "title": "Stability Analysis of Cosmological Perturbations in the Bumblebee Model: Parameter Constraints and Gravitational Waves",
      "authors": [
        "Xiao-Bin Lai",
        "Yu-Qi Dong",
        "Yu-Zhi Fan",
        "Yu-Xiao Liu"
      ],
      "abstract": "Stability Analysis of Cosmological Perturbations in the Bumblebee Model: Parameter Constraints and Gravitational Waves Xiao-Bin Lai, Yu-Qi Dong, Yu-Zhi Fan, Yu-Xiao Liu General Relativity and Quantum Cosmology (gr-qc) We constrain the parameter space of the Bumblebee model in a cosmological background and then investigate the properties of gravitational waves within the constrained parameter space. Our analysis reveals seven perturbative degrees of freedom in the cosmological background: two tensor, two vector, and two scalar modes, along with an additional mode from the matter sector. The stability conditions for all these modes are derived. By incorporating the observed accelerated expansion of the universe and the observational constraints on tensor gravitational waves, we derive bounds on the parameter space of the Bumblebee model. Our results indicate that the non-minimal coupling parameter $\\xi$ must be non-positive, a constant background value $b_{t}$ of the Bumblebee field implies $\\sigma\\ne -\\tfrac{1}{2}\\xi$, and the Lorentz-violating parameter $\\xi b^2$ has a lower bound on the order of $10^{-15}$. We then investigate the propagation characteristics and polarization modes of gravitational waves in both the small-scale and Minkowski limits. The propagation modes of gravitational waves in the Bumblebee model consist of two tensor modes, two vector modes, and one scalar mode. Notably, the tensor modes travel at subluminal speeds, whereas the vector and scalar modes propagate at superluminal speeds, when $\\xi b_{t}^2\\ne 0$. These results provide a concrete theoretical framework and specific observational signatures for testing Lorentz invariance in the gravitational sector with future gravitational-wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2509.13958.pdf",
      "published": "2026-01-16T01:32:20.604891",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.07186",
      "title": "Identification and characterization of distorted gravitational waves by lensing using deep learning",
      "authors": [
        "Juno C. L. Chan",
        "Lorena Magaña Zertuche",
        "Jose María Ezquiaga",
        "Rico K. L. Lo",
        "Luka Vujeva",
        "Joey Bowman"
      ],
      "abstract": "Identification and characterization of distorted gravitational waves by lensing using deep learning Juno C. L. Chan, Lorena Magaña Zertuche, Jose María Ezquiaga, Rico K. L. Lo, Luka Vujeva, Joey Bowman 17 pages, 12 figures, matches PRD published version General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Gravitational waves (GWs) can be distorted by intervening mass distributions while propagating, leading to frequency-dependent modulations that imprint a distinct signature on the observed waveforms. Bayesian inference for GW lensing with conventional sampling methods is costly, and the problem is exacerbated by the rapidly growing GW catalog. Moreover, assessing the statistical significance of lensed candidates requires thousands, if not millions, of simulations to estimate the background from noise fluctuations and waveform systematics, which is infeasible with standard samplers. We present a novel method, DINGO-lensing, for performing inference on lensed GWs, extending the neural posterior estimation framework DINGO. By comparing our results with those using conventional samplers, we show that the compute time of parameter estimation of lensed GWs can be reduced from weeks to seconds, while preserving accuracy both in the posterior distributions and the evidence ratios. We train our neural networks with LIGO detector noise at design sensitivity and a lens model that accommodates two overlapping images with a constant $\\pi/2$ phase shift. We show that the lensing parameters are recovered with millisecond precision for the time delays. We also demonstrate that our network can identify signals diffracted by point masses, highlighting its flexibility for searches. By simulating thousands of lensed and nonlensed events, we determine how the detectability changes with different source properties. DINGO-lensing provides a scalable and efficient avenue for identifying and characterizing gravitationally lensed GW events in the upcoming observing runs.",
      "pdf_url": "https://arxiv.org/pdf/2511.07186.pdf",
      "published": "2026-01-16T01:32:20.605549",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.03340",
      "title": "Fast frequency-domain phenomenological modeling of eccentric aligned-spin binary black holes",
      "authors": [
        "Antoni Ramos-Buades",
        "Quentin Henry",
        "Maria Haney"
      ],
      "abstract": "Fast frequency-domain phenomenological modeling of eccentric aligned-spin binary black holes Antoni Ramos-Buades, Quentin Henry, Maria Haney General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We present the IMRPhenomXE frequency-domain phenomenological waveform model for the dominant mode of inspiral-merger-ringdown non-precessing binary black holes in elliptical orbits. IMRPhenomXE extends the quasi-circular IMRPhenomXAS waveform model for the dominant $(\\ell, |m|) =$ (2,2) modes to eccentric binaries. For the inspiral part, orbit-averaged equations of motion within the quasi-Keplerian parametrization up to third post-Newtonian order, including spin effects, are evolved, and the waveform modes are computed using the stationary phase approximation on eccentricity expanded expressions up to $\\mathcal{O}(e^{12})$. The model assumes circularization at merger-ringdown, where it adopts the underlying quasicircular IMRPhenomXAS baseline. We show that IMRPhenomXE reduces to the accurate IMPhenomXAS model in the quasi-circular limit. Compared against 186 public numerical relativity waveforms from the Simulating eXtreme Spacetimes catalog with initial eccentricities up to $~0.8$, IMRPhenomXE provides values of unfaithfulness below $3\\%$ for $72\\%$ of simulations with initial eccentricities below 0.4. For larger eccentricities, the unfaithfulness degrades up to $\\gtrsim 10\\%$ due to the underlying small eccentricity expansions and additional modelling approximations. In terms of speed, IMRPhenomXE outperforms any of the existing inspiral-merger-ringdown eccentric waveform models. We demonstrate the efficiency, robustness, and modularity of IMRPhenomXE through injections into zero noise and parameter-estimation analyses of gravitational-wave events, showing that IMRPhenomXE is a ready-to-use waveform model for gravitational-wave astronomy in the era of rapidly growing event catalogs.",
      "pdf_url": "https://arxiv.org/pdf/2601.03340.pdf",
      "published": "2026-01-16T01:32:20.605955",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2411.13673",
      "title": "Detecting electromagnetic counterparts to LIGO/Virgo/KAGRA gravitational wave events with DECam: Neutron Star Mergers",
      "authors": [
        "Keerthi Kunnumkai",
        "Antonella Palmese",
        "Amanda M Farah",
        "Mattia Bulla",
        "Tim Dietrich",
        "Peter T H Pang",
        "Shreya Anand",
        "Igor Andreoni",
        "Tomas Cabrera",
        "Brendan O Connor"
      ],
      "abstract": "Detecting electromagnetic counterparts to LIGO/Virgo/KAGRA gravitational wave events with DECam: Neutron Star Mergers Keerthi Kunnumkai, Antonella Palmese, Amanda M Farah, Mattia Bulla, Tim Dietrich, Peter T H Pang, Shreya Anand, Igor Andreoni, Tomas Cabrera, Brendan O Connor 24 pages, 12 figures, 10 tables High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) With GW170817 being the only multimessenger gravitational wave (GW) event with an associated kilonova detected so far, there exists a pressing need for realistic estimation of the GW localization uncertainties and rates, as well as optimization of available telescope time to enable the detection of new kilonovae. We simulate GW events assuming a data-driven distribution of binary parameters for the LIGO/Virgo/KAGRA (LVK) fourth and fifth observing runs (O4 and O5). We map the binary neutron star (BNS) and neutron star-black hole (NSBH) properties to the kilonova optical light curves. We use the simulated population of kilonovae to generate follow-up observing plans, with the primary goal of optimizing detection with the Gravitational Wave Multi-Messenger Astronomy DECam Survey (GW-MMADS). We explore the dependence of kilonova detectability on the mass, distance, inclination, and spin of the binaries. Assuming that no BNS was detected during O4 until the end of 2024, we present updated GW BNS (NSBH) merger detection rates. We expect to detect BNS (NSBH) kilonovae with DECam at a per-year rate of: $0$-$2.0$ ($0$) in O4, and $2.0$-$19$ ($0$-$1.0$) in O5. We expect the majority of BNS detections and also those accompanied by a detectable kilonova to produce a hypermassive NS remnant, with a significant fraction of the remaining BNSs promptly collapsing to a BH. We release GW simulations and depths required to detect kilonovae based on our predictions to support the astronomical community in their multimessenger follow-up campaigns and analyses.",
      "pdf_url": "https://arxiv.org/pdf/2411.13673.pdf",
      "published": "2026-01-16T01:32:20.606372",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.16534",
      "title": "The NANOGrav 15 yr Data Set: Targeted Searches for Supermassive Black Hole Binaries",
      "authors": [
        "Nikita Agarwal",
        "Gabriella Agazie",
        "Akash Anumarlapudi",
        "Anne M. Archibald",
        "Zaven Arzoumanian",
        "Jeremy G. Baier",
        "Paul T. Baker",
        "Bence Becsy",
        "Laura Blecha",
        "Adam Brazier",
        "Paul R. Brook",
        "Sarah Burke-Spolaor",
        "Rand Burnette",
        "Robin Case",
        "J. Andrew Casey-Clyde",
        "Yu-Ting Chang",
        "Maria Charisi",
        "Shami Chatterjee",
        "Tyler Cohen",
        "Paolo Coppi",
        "James M. Cordes",
        "Neil J. Cornish",
        "Fronefield Crawford",
        "H. Thankful Cromartie",
        "Kathryn Crowter",
        "Megan E. DeCesar",
        "Paul B. Demorest",
        "Heling Deng",
        "Lankeswar Dey",
        "Timothy Dolch",
        "Daniel J. D'Orazio",
        "Ellis Eisenberg",
        "Elizabeth C. Ferrara",
        "William Fiore",
        "Emmanuel Fonseca",
        "Gabriel E. Freedman",
        "Emiko C. Gardiner",
        "Nate Garver-Daniels",
        "Peter A. Gentile",
        "Kyle A. Gersbach",
        "Joseph Glaser",
        "Matthew J. Graham",
        "Deborah C. Good",
        "Kayhan Gultekin",
        "C. J. Harris",
        "Jeffrey S. Hazboun",
        "Forrest Hutchison",
        "Ross J. Jennings",
        "Aaron D. Johnson",
        "Megan L. Jones",
        "David L. Kaplan",
        "Luke Zoltan Kelley",
        "Matthew Kerr",
        "Joey S. Key",
        "Nima Laal",
        "Michael T. Lam",
        "William G. Lamb",
        "Bjorn Larsen",
        "T. Joseph W. Lazio",
        "Natalia Lewandowska",
        "Tingting Liu",
        "Duncan R. Lorimer",
        "Jing Luo",
        "Ryan S. Lynch",
        "Chung-Pei Ma",
        "Dustin R. Madison",
        "Cayenne Matt",
        "Alexander McEwen",
        "James W. McKee",
        "Maura A. McLaughlin",
        "Natasha McMann",
        "Bradley W. Meyers",
        "Patrick M. Meyers",
        "Chiara M. F. Mingarelli",
        "Andrea Mitridate",
        "Priyamvada Natarajan",
        "Cherry Ng",
        "David J. Nice",
        "Stella Koch Ocker",
        "Ken D. Olum",
        "Timothy T. Pennucci",
        "Benetge B. P. Perera",
        "Polina Petrov",
        "Nihan S. Pol",
        "Henri A. Radovan",
        "Scott M. Ransom",
        "Paul S. Ray",
        "Joseph D. Romano",
        "Jessie C. Runnoe",
        "Alexander Saffer",
        "Shashwat C. Sardesai",
        "Ann Schmiedekamp",
        "Carl Schmiedekamp",
        "Kai Schmitz",
        "Federico Semenzato",
        "Brent J. Shapiro-Albert",
        "Rohan Shivakumar",
        "Xavier Siemens",
        "Joseph Simon",
        "Sophia V. Sosa Fiscella"
      ],
      "abstract": "The NANOGrav 15 yr Data Set: Targeted Searches for Supermassive Black Hole Binaries Nikita Agarwal, Gabriella Agazie, Akash Anumarlapudi, Anne M. Archibald, Zaven Arzoumanian, Jeremy G. Baier, Paul T. Baker, Bence Becsy, Laura Blecha, Adam Brazier, Paul R. Brook, Sarah Burke-Spolaor, Rand Burnette, Robin Case, J. Andrew Casey-Clyde, Yu-Ting Chang, Maria Charisi, Shami Chatterjee, Tyler Cohen, Paolo Coppi, James M. Cordes, Neil J. Cornish, Fronefield Crawford, H. Thankful Cromartie, Kathryn Crowter, Megan E. DeCesar, Paul B. Demorest, Heling Deng, Lankeswar Dey, Timothy Dolch, Daniel J. D'Orazio, Ellis Eisenberg, Elizabeth C. Ferrara, William Fiore, Emmanuel Fonseca, Gabriel E. Freedman, Emiko C. Gardiner, Nate Garver-Daniels, Peter A. Gentile, Kyle A. Gersbach, Joseph Glaser, Matthew J. Graham, Deborah C. Good, Kayhan Gultekin, C. J. Harris, Jeffrey S. Hazboun, Forrest Hutchison, Ross J. Jennings, Aaron D. Johnson, Megan L. Jones, David L. Kaplan, Luke Zoltan Kelley, Matthew Kerr, Joey S. Key, Nima Laal, Michael T. Lam, William G. Lamb, Bjorn Larsen, T. Joseph W. Lazio, Natalia Lewandowska, Tingting Liu, Duncan R. Lorimer, Jing Luo, Ryan S. Lynch, Chung-Pei Ma, Dustin R. Madison, Cayenne Matt, Alexander McEwen, James W. McKee, Maura A. McLaughlin, Natasha McMann, Bradley W. Meyers, Patrick M. Meyers, Chiara M. F. Mingarelli, Andrea Mitridate, Priyamvada Natarajan, Cherry Ng, David J. Nice, Stella Koch Ocker, Ken D. Olum, Timothy T. Pennucci, Benetge B. P. Perera, Polina Petrov, Nihan S. Pol, Henri A. Radovan, Scott M. Ransom, Paul S. Ray, Joseph D. Romano, Jessie C. Runnoe, Alexander Saffer, Shashwat C. Sardesai, Ann Schmiedekamp, Carl Schmiedekamp, Kai Schmitz, Federico Semenzato, Brent J. Shapiro-Albert, Rohan Shivakumar, Xavier Siemens, Joseph Simon, Sophia V. Sosa Fiscella Accepted for publication in ApJ Letters High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present the first targeted searches for continuous gravitational waves (CWs) from 114 active galactic nuclei (AGN) that may host supermassive black hole binaries, using the NANOGrav 15 yr data set. By incorporating electromagnetic priors on sky location, distance, redshift, and CW frequency, our strain and chirp mass upper limits are typically improved by a factor of $\\sim 2$ (median 2.2) relative to all-sky limits at the same frequency. Bayesian comparisons against a model including only a Hellings-Downs correlated background disfavors a CW signal for all targets, with a mean Bayes factor of $0.73 \\pm 0.32$. Two targets have Bayes factors slightly above unity, but coherence tests, random targeting experiments, and a conservative accounting of the 114-target trials factor all indicate that they are consistent with noise. We use these two candidates as worked examples to illustrate an end-to-end targeted CW search analysis and a suite of follow up tests that future promising candidates would need to pass. We find that the electromagnetic interpretations of both candidates are ambiguous, and we update the constraints on a putative binary in 3C 66B, ruling out part of its previously allowed parameter space. Ultimately, our results demonstrate the current sensitivity of targeted pulsar timing array searches for CWs and define a roadmap for future multimessenger CW detections.",
      "pdf_url": "https://arxiv.org/pdf/2508.16534.pdf",
      "published": "2026-01-16T01:32:20.607483",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08622",
      "title": "Primordial Gravitational Waves from Scalar Backreaction in Axion-SU(2) Inflation",
      "authors": [
        "Mattia Cielo",
        "Ema Dimastrogiovanni",
        "Matteo Fasiello",
        "Alexandros Papageorgiou"
      ],
      "abstract": "Primordial Gravitational Waves from Scalar Backreaction in Axion-SU(2) Inflation Mattia Cielo, Ema Dimastrogiovanni, Matteo Fasiello, Alexandros Papageorgiou 13 pages, 7 figures, updated to rectify the author names Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) In this work, we perform the first numerical study of strong scalar backreaction in spectator chromo-natural inflation (SCNI) in the case where the spectator sector decays during inflation. The tachyonic instability in scalar fluctuations, activated as the system crosses the $m_Q = \\sqrt{2}$ threshold, amplifies perturbations and may significantly alter the background dynamics. The strong scalar backreaction regime introduces an effective quartic term in the potential for the gauge field background that rapidly drives it to zero, accelerating the axion-gauge system decay. We describe the dynamics of such decay and derive the gravitational wave spectrum for a set of benchmark parameters. Interestingly, the signal may peak at interferometer scales and lie within LISA's projected sensitivity.",
      "pdf_url": "https://arxiv.org/pdf/2601.08622.pdf",
      "published": "2026-01-16T01:32:20.755691",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08912",
      "title": "LUMOS : Linear programming Utility for Multi-messenger Optical Scheduling",
      "authors": [
        "Yogesh P. Wagh",
        "Michael W. Coughlin",
        "Leo P. Singer",
        "Varun Bhalerao"
      ],
      "abstract": "LUMOS : Linear programming Utility for Multi-messenger Optical Scheduling Yogesh P. Wagh, Michael W. Coughlin, Leo P. Singer, Varun Bhalerao Submitted to PASP. 9 pages, 5 figures Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) The detection of gravitational-wave events by LIGO-Virgo-KAGRA has opened new avenues for multi-messenger astrophysics; however, electromagnetic counterparts remain elusive due to large localization uncertainties. Wide-field optical surveys like the Zwicky Transient Facility (ZTF) play a crucial role in follow-up, but efficient scheduling is essential. In this work, we present LUMOS, a Mixed Integer Linear Programming (MILP) approach that selects fields via a maximum coverage problem and schedules observations to maximize cumulative probability while respecting observability constraints. Using 1199 GW events from O4, we compare the LUMOS scheduler with gwemopt, showing an 84.7 percent higher mean cumulative probability and better performance in nearly all cases. While designed for ZTF, LUMOS's framework parallels the M4OPT toolkit for space missions, highlighting the broader applicability of MILP-based scheduling to both ground- and space-based follow-up.",
      "pdf_url": "https://arxiv.org/pdf/2601.08912.pdf",
      "published": "2026-01-16T01:32:21.035681",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    }
  ]
}