{
  "date": "2025-10-03",
  "crawl_timestamp": "2025-10-03T01:30:55.498948",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 175,
    "total_gw_papers": 22,
    "by_category": {
      "gr-qc": {
        "total": 33,
        "gw_related": 10
      },
      "astro-ph": {
        "total": 122,
        "gw_related": 8
      }
    }
  },
  "crawl_verification": {
    "total_expected": 233,
    "total_actual": 233,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 52,
        "actual_crawled": 52,
        "page_source_info": "Total of 52 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 37,
        "actual_crawled": 37,
        "page_source_info": "Total of 37 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 40,
        "actual_crawled": 40,
        "page_source_info": "Total of 40 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 46,
        "actual_crawled": 46,
        "page_source_info": "Total of 46 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 23,
        "actual_crawled": 23,
        "page_source_info": "Total of 23 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 16,
        "actual_crawled": 16,
        "page_source_info": "Total of 16 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.00106",
      "title": "Eccentric binary black holes: A new framework for numerical relativity waveform surrogates",
      "authors": [
        "Peter James Nee",
        "Adhrit Ravichandran",
        "Scott E. Field",
        "Tousif Islam",
        "Harald P. Pfeiffer",
        "Vijay Varma",
        "Michael Boyle",
        "Andrea Ceja",
        "Noora Ghadiri",
        "Lawrence E. Kidder",
        "Prayush Kumar",
        "Akash Maurya",
        "Marlo Morales",
        "Antoni Ramos-Buades",
        "Abhishek Ravishankar",
        "Katie Rink",
        "Hannes R. Rüter",
        "Mark A. Scheel",
        "Md Arif Shaikh",
        "Daniel Tellez"
      ],
      "abstract": "Eccentric binary black holes: A new framework for numerical relativity waveform surrogates Peter James Nee, Adhrit Ravichandran, Scott E. Field, Tousif Islam, Harald P. Pfeiffer, Vijay Varma, Michael Boyle, Andrea Ceja, Noora Ghadiri, Lawrence E. Kidder, Prayush Kumar, Akash Maurya, Marlo Morales, Antoni Ramos-Buades, Abhishek Ravishankar, Katie Rink, Hannes R. Rüter, Mark A. Scheel, Md Arif Shaikh, Daniel Tellez General Relativity and Quantum Cosmology (gr-qc) Mounting evidence indicates that some of the gravitational wave signals observed by the LIGO/Virgo/KAGRA observatories might arise from eccentric compact object binaries, increasing the urgency for accurate waveform models for such systems. While for non-eccentric binaries, surrogate models are efficient and accurate, the additional features due to eccentricity have posed a challenge. In this letter, we present a novel method for decomposing eccentric numerical relativity waveforms which makes them amenable to surrogate modelling techniques. We parameterize the inspiral in the radial phase domain, factoring out eccentricity-induced dephasing and thus enhancing compressibility and accuracy. This is combined with a second surrogate for the merger-ringdown in the time-domain and a novel technique to take advantage of the approximate periodicity with radial oscillations during the inspiral. We apply this procedure to the $(2,2)$ mode for non-spinning black hole binaries, and demonstrate that the resulting surrogate, NRSurE_q4NoSpin_22, is able to faithfully reproduce the underlying numerical relativity waveforms, with maximum mismatches of $5\\times10^{-4}$ and median mismatches of $2\\times10^{-5}$. This technique paves the way for high-accuracy parameter estimation with eccentric models, a key ingredient for astrophysical inference and tests of general relativity.",
      "pdf_url": "https://arxiv.org/pdf/2510.00106.pdf",
      "published": "2025-10-03T01:30:53.717226",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.00116",
      "title": "Chase Orbits, not Time: A Scalable Paradigm for Long-Duration Eccentric Gravitational-Wave Surrogates",
      "authors": [
        "Akash Maurya",
        "Prayush Kumar",
        "Scott E. Field",
        "Chandra Kant Mishra",
        "Peter James Nee",
        "Kaushik Paul",
        "Harald P. Pfeiffer",
        "Adhrit Ravichandran",
        "Vijay Varma"
      ],
      "abstract": "Chase Orbits, not Time: A Scalable Paradigm for Long-Duration Eccentric Gravitational-Wave Surrogates Akash Maurya, Prayush Kumar, Scott E. Field, Chandra Kant Mishra, Peter James Nee, Kaushik Paul, Harald P. Pfeiffer, Adhrit Ravichandran, Vijay Varma General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Computational Physics (physics.comp-ph) Surrogate modeling of eccentric binary black hole waveforms has remained challenging. The complicated morphology of these waveforms due to the eccentric orbital timescale variations makes it difficult to construct accurate and efficient surrogate models, especially for waveforms long enough to cover the sensitivity band of the current ground-based gravitational wave detectors. We present a novel and scalable surrogate building technique which makes surrogate modeling of long-duration eccentric binary black hole waveforms both feasible and highly efficient. The technique aims to simplify the harmonic content of the intermediate eccentric surrogate data pieces by modeling them in terms of an angular orbital element called the mean anomaly, instead of time. We show that this novel parameterization yields an order of magnitude fewer surrogate basis functions than using the contemporary parameterization in terms of time. We show that variations in surrogate data-pieces across parameter space become much more regular when expressed in terms of the instantaneous waveform eccentricity and mean anomaly, greatly easing their parameter-space fitting. The methods presented in this work make it feasible to build long-duration eccentric surrogates for the current as well as future third-generation gravitational wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2510.00116.pdf",
      "published": "2025-10-03T01:30:53.717589",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.00673",
      "title": "Modified cosmology through generalized mass-to-horizon entropy: implications for structure growth and primordial gravitational waves",
      "authors": [
        "Giuseppe Gaetano Luciano"
      ],
      "abstract": "Modified cosmology through generalized mass-to-horizon entropy: implications for structure growth and primordial gravitational waves Giuseppe Gaetano Luciano Journal of High Energy Astrophysics 50 (2026) 100487 General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) In the framework of entropic cosmology, entropic forces arising at the cosmological horizon have been proposed as an alternative mechanism to explain the Universe's current accelerated phase. However, recent studies have shown that, under the Clausius relation and assuming a linear mass-to-horizon (MHR) relation, all entropic force models reduce to the original Bekenstein-Hawking formulation, regardless of the specific form of the horizon entropy. As a result, they inherit the same observational limitations in accounting for cosmic dynamics. To address this issue, a generalized MHR has been introduced, providing the foundation for a modified cosmological scenario rooted in the gravity-thermodynamics conjecture. In this work, we explore the implications of this generalized framework for early-Universe dynamics. Specifically, we analyze the growth of matter perturbations within the spherical Top-Hat formalism in the linear regime, showing that the density contrast profile is significantly influenced by the modified background dynamics predicted by the model. Moreover, considering the sensitivity of upcoming gravitational wave detectors in the sub-$10^3\\,\\mathrm{Hz}$ range, we examine the impact on the relic abundance of Primordial Gravitational Waves (PGWs), identifying parameter regions where deviations from standard cosmology may arise through an enhanced PGW spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2510.00673.pdf",
      "published": "2025-10-03T01:30:53.718662",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.01001",
      "title": "GW250114 reveals black hole horizon signatures",
      "authors": [
        "Neil Lu",
        "Sizheng Ma",
        "Ornella J. Piccinni",
        "Yanbei Chen",
        "Ling Sun"
      ],
      "abstract": "GW250114 reveals black hole horizon signatures Neil Lu, Sizheng Ma, Ornella J. Piccinni, Yanbei Chen, Ling Sun General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) The horizon of a black hole, the \"surface of no return,\" is characterized by its rotation frequency $\\Omega_H$ and surface gravity $\\kappa$. A striking signature is that any infalling object appears to orbit at $\\Omega_H$ due to frame dragging, while its emitted signals decay exponentially at a rate set by $\\kappa$ as a consequence of gravitational redshift. Recent theoretical work predicts that the merger phase of gravitational waves from binary black hole coalescences carries direct imprints of the remnant horizon's properties, via a \"direct wave\" component that (i) oscillates near $2\\Omega_H$, reflecting the horizon's frame dragging and the quadrupole nature of the gravitational radiation, and (ii) decays at an increasing rate characterized by $\\kappa$, with additional screening from the black hole's potential barrier. In this paper, we report observational evidence for the direct wave in GW250114 with a matched-filter signal-to-noise ratio of $14.0^{+0.2}_{-0.1}$ ($13.5^{+0.1}_{-0.2}$) in the LIGO Hanford (Livingston) detector. The measured properties are in full agreement with theoretical predictions. These findings establish a new observational channel to directly measure frame-dragging effects in black hole ergospheres and explore (near-)horizon physics in dynamical, strong-gravity regimes.",
      "pdf_url": "https://arxiv.org/pdf/2510.01001.pdf",
      "published": "2025-10-03T01:30:53.719744",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.00869",
      "title": "Gravitational Waves sourced by Gauge Fields during Inflation",
      "authors": [
        "Martin Teuscher",
        "Ruth Durrer",
        "Killian Martineau",
        "Aurélien Barrau"
      ],
      "abstract": "Gravitational Waves sourced by Gauge Fields during Inflation Martin Teuscher, Ruth Durrer, Killian Martineau, Aurélien Barrau Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We study the inflationary gravitational wave background induced by Abelian gauge fields generated by non-minimal kinetic and axial couplings to the inflaton. We show that the gravitational wave spectrum is scale invariant and derive its amplitude for generic gauge field coupling parameters, within the slow-roll approximation. We constrain the coupling values and the scale of inflation for which the induced gravitational wave background is observable, while ensuring that back-reaction on the inflationary dynamics remains negligible. We find that a sizeable axial coupling can boost this secondary gravitational wave signal above the standard inflationary background. In the course of our analysis, we also show how to analytically match tensor perturbations across an arbitrary number of eras with different equations of state.",
      "pdf_url": "https://arxiv.org/pdf/2510.00869.pdf",
      "published": "2025-10-03T01:30:53.771662",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.00989",
      "title": "Generalized Unitarity Method for Worldline Field Theory",
      "authors": [
        "Vincent F. He",
        "Julio Parra-Martinez"
      ],
      "abstract": "Generalized Unitarity Method for Worldline Field Theory Vincent F. He, Julio Parra-Martinez High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc) We present a generalized unitarity method for theories of point-particle worldlines coupled to gravity, analogous to that of scattering amplitudes in quantum field theory. This method allows the computation of perturbative observables from basic principles such as locality and unitarity, thus avoiding gauge redundancies and the use of Feynman diagrams. We illustrate the method with a variety of examples, including the gravitational waveform for the scattering of two point masses at next-to-leading order (or ${\\cal O}(G^{5/2})$), reproducing known results. Our method further streamlines the calculation of the scattering dynamics of compact binary systems and opens the door to further applications and systematical exploration of structure in this class of observables.",
      "pdf_url": "https://arxiv.org/pdf/2510.00989.pdf",
      "published": "2025-10-03T01:30:53.772030",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-th",
        "cross_list_from": "hep-th"
      }
    },
    {
      "id": "https://arxiv.org/abs/2412.02651",
      "title": "Costs of Bayesian Parameter Estimation in Third-Generation Gravitational Wave Detectors: an Assessment of Current Acceleration Methods",
      "authors": [
        "Qian Hu",
        "John Veitch"
      ],
      "abstract": "Costs of Bayesian Parameter Estimation in Third-Generation Gravitational Wave Detectors: an Assessment of Current Acceleration Methods Qian Hu, John Veitch 15 pages, 4 figures, 1 table. Accepted version General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Bayesian inference with stochastic sampling has been widely used to obtain the properties of gravitational wave (GW) sources. Although computationally intensive, its cost remains manageable for current second-generation GW detectors because of the relatively low event rate and signal-to-noise ratio (SNR). The third-generation (3G) GW detectors are expected to detect hundreds of thousands of compact binary coalescence (CBC) events every year with substantially higher SNR and longer signal duration, presenting significant computational challenges. In this study, we systematically evaluate the computational costs of CBC source parameter estimation (PE) in the 3G era by modeling the PE time cost as a function of SNR and signal duration. We examine the standard PE method alongside acceleration methods including relative binning, multibanding, and reduced order quadrature. We predict that PE for a one-month-observation catalog with 3G detectors could require at least billions of CPU core hours with the standard PE method, whereas acceleration techniques can reduce this demand to less than millions of core hours, which is as high as the cost of analyzing GW events in the past 10 years. These findings highlight the necessity for more efficient PE methods to enable cost-effective and environmentally sustainable data analysis for 3G detectors. In addition, we assess the accuracy of accelerated PE methods, emphasizing the need for careful treatment in high-SNR scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2412.02651.pdf",
      "published": "2025-10-03T01:30:53.772902",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.15979",
      "title": "Impact of Detector Calibration Accuracy on Black Hole Spectroscopy",
      "authors": [
        "Mallika R. Sinha",
        "Ling Sun",
        "Sizheng Ma"
      ],
      "abstract": "Impact of Detector Calibration Accuracy on Black Hole Spectroscopy Mallika R. Sinha, Ling Sun, Sizheng Ma General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Systematic errors in detector calibration can bias signal analyses and potentially lead to incorrect interpretations suggesting violations of general relativity. In this study, we investigate how calibration systematics affect black hole (BH) spectroscopy, a technique that uses the quasinormal modes (QNMs) emitted during the ringdown phase of gravitational waves (GWs) to study remnant BHs formed in compact binary coalescences. We simulate a series of physically motivated, tunable calibration errors and use them to intentionally miscalibrate numerical relativity waveforms. We then apply a QNM extraction method -- the rational QNM filter -- to quantify the impact of these calibration errors. We find that current calibration standards (errors within $10\\%$ in magnitude and $10^\\circ$ in phase across the most sensitive frequency range of 20--2000 Hz) are adequate for BH ringdown analyses with existing observations, but insufficient for the accuracy goals of future upgraded and next-generation observatories. Specifically, we show that for events with a high ringdown signal-to-noise ratio of $\\sim 120$, calibration errors must remain $\\lesssim 4\\%$ in magnitude and $\\lesssim 4^\\circ$ in phase to avoid introducing biases. While this analysis focuses on a particular aspect of BH spectroscopy, the results offer quantitative benchmarks for calibration standards crucial to fully realize the potential of precision tests of general relativity in the next-generation detector era.",
      "pdf_url": "https://arxiv.org/pdf/2506.15979.pdf",
      "published": "2025-10-03T01:30:53.773750",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.11663",
      "title": "Asymptotic quasinormal modes, echoes, and black hole spectral instability: a brief review",
      "authors": [
        "Shui-Fa Shen",
        "Guan-Ru Li",
        "Ramin G. Daghigh",
        "Jodin C. Morey",
        "Michael D. Green",
        "Wei-Liang Qian",
        "Rui-Hong Yue"
      ],
      "abstract": "Asymptotic quasinormal modes, echoes, and black hole spectral instability: a brief review Shui-Fa Shen, Guan-Ru Li, Ramin G. Daghigh, Jodin C. Morey, Michael D. Green, Wei-Liang Qian, Rui-Hong Yue 38 pages, 8 figures. arXiv admin note: text overlap with arXiv:2504.13265 General Relativity and Quantum Cosmology (gr-qc) We present a short review of the analytical aspects of recent progress in the study of black hole spectral instability and its potential observational consequences. This topic, inspired by earlier foundational works, has attracted considerable attention in the recent literature. It has been demonstrated that both the low-lying modes and high overtones of black hole quasinormal spectra can be substantially influenced by ultraviolet metric perturbations. The temporal evolution of gravitational wave signals is primarily governed by the first few low-lying quasinormal modes. In contrast, the asymptotic behavior of high overtones is closely associated with the phenomenon of black hole echoes. We review relevant studies on spectral instability in both regimes, highlighting their potential to produce substantial observational signatures in gravitational wave data. Additionally, recent proposals of Regge poles and reflectionless modes as alternative stable observables for probing black hole spacetimes are summarized.",
      "pdf_url": "https://arxiv.org/pdf/2507.11663.pdf",
      "published": "2025-10-03T01:30:53.773965",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.19331",
      "title": "Towards a few percent measurement of the Hubble constant with the current network of gravitational wave detectors without using electromagnetic information",
      "authors": [
        "Tom Bertheas",
        "Vasco Gennari",
        "Nicola Tamanini"
      ],
      "abstract": "Towards a few percent measurement of the Hubble constant with the current network of gravitational wave detectors without using electromagnetic information Tom Bertheas, Vasco Gennari, Nicola Tamanini General Relativity and Quantum Cosmology (gr-qc) Gravitational waves provide a novel and independent measurement of cosmological parameters, offering a promising avenue to address the Hubble tension alongside traditional electromagnetic observations. In the absence of electromagnetic counterparts or complete host galaxy catalogs, current measurements rely on population-based methods that statistically combine black hole merger events. Building on recent models that incorporate additional structure in the primary black hole mass distribution, using public data from the LIGO-Virgo-KAGRA (LVK) collaboration third observing run (O3), we obtain a 30% accuracy improvement on the measurement of the Hubble constant with respect to the result reported by LVK with the third GW transient catalog (GWTC-3). Employing a realistic simulation that includes full Bayesian single-event inference, we present forecasts for the upcoming LVK observational runs, O4 and O5. Using a three power-law mass model, we project a measurement of the Hubble constant with 20% accuracy at O4 sensitivity, improving to 2.7% accuracy at O5 sensitivity. Our findings demonstrate the potential for gravitational waves to provide a substantial contribution to solving the Hubble tension within the next decade of observations.",
      "pdf_url": "https://arxiv.org/pdf/2508.19331.pdf",
      "published": "2025-10-03T01:30:53.774706",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.14107",
      "title": "Hybrid waveforms for precessing quasi-circular binary systems",
      "authors": [
        "Joan Llobera-Querol",
        "Sascha Husa",
        "Maria de Lluc Planas"
      ],
      "abstract": "Hybrid waveforms for precessing quasi-circular binary systems Joan Llobera-Querol, Sascha Husa, Maria de Lluc Planas General Relativity and Quantum Cosmology (gr-qc) The demand for long and accurate gravitational waveforms is increasing as we prepare for the next generation of detectors and seek to improve current waveform models. However, numerical relativity waveforms, while highly accurate, are often too short for these applications due to their high computational cost. Hybrid waveforms, which stitch together gravitational wave signals from different modeling approaches, provide a way to generate complete inspiral-merger-ringdown signals. While hybridization is well-established for aligned-spin systems, precession introduces additional complexities due to gauge ambiguities, frame dependence, or spin dynamics. Here we study the challenges associated with alignment of precessing waveforms and present a systematic approach for constructing hybrid waveforms of precessing quasi-circular systems. Our approach relies on minimal assumptions about the merger waveforms and employs the quadrupole-aligned frame to mitigate mode-mixing. Our method is designed to be robust and broadly applicable, imposing minimal constraints on the input waveforms. This framework expands the applicability of hybridization techniques, facilitating flexible hybrid construction for parameter estimation, model calibration, and gravitational-wave data analysis.",
      "pdf_url": "https://arxiv.org/pdf/2509.14107.pdf",
      "published": "2025-10-03T01:30:53.774900",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.25952",
      "title": "Gravitational wave experiments: achievements and plans",
      "authors": [
        "Elisa Bigongiari",
        "Matteo Di Giovanni",
        "Giovanni Losurdo"
      ],
      "abstract": "Gravitational wave experiments: achievements and plans Elisa Bigongiari, Matteo Di Giovanni, Giovanni Losurdo General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) Gravitational wave (GW) experiments have transformed our understanding of the Universe by enabling direct observations of compact object mergers and other astrophysical phenomena. This chapter reviews the concepts of GW detectors, such as LIGO, Virgo, and KAGRA, and describes their operating principles, data acquisition and analysis techniques, and some of the methods used to extract source properties. The scientific impact of GW observations is discussed as well, including contributions to astrophysics, tests of general relativity, and cosmology. We also examine the role of multimessenger astronomy and the complementarity between different GW detectors and with other astroparticle experiments. Finally, we outline future prospects with next-generation detectors, like the Einstein Telescope and Cosmic Explorer, and space-based missions.",
      "pdf_url": "https://arxiv.org/pdf/2509.25952.pdf",
      "published": "2025-10-03T01:30:53.775250",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2501.14480",
      "title": "Memory and supertranslations on plane wave spacetimes: an on-shell perspective",
      "authors": [
        "Andrea Cristofoli",
        "Sonja Klisch"
      ],
      "abstract": "Memory and supertranslations on plane wave spacetimes: an on-shell perspective Andrea Cristofoli, Sonja Klisch 19 pages, 2 figures, v2: corrections, references added, format changed to JHEP style High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc) We revisit the computation of the classical gravitational waveform for a particle moving in a plane wave background using on-shell amplitudes. We emphasize the relationship between gravitational memory and the boundary conditions of external scattering states, which were neglected in previous works. We then provide the first tree-level expression for the waveform that captures all memory effects. The waveform is presented in terms of Synge's world function, with explicit tail terms, and a smooth weak memory limit. We also discuss the choice of BMS frame for the waveform on a plane wave background. In flat space, this corresponds to a choice of soft dressing of the initial state. We show that on a plane wave background, this dressing becomes a supertranslation of the waveform, in addition to a phase shift in the waveshape of the background.",
      "pdf_url": "https://arxiv.org/pdf/2501.14480.pdf",
      "published": "2025-10-03T01:30:53.775748",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.26152",
      "title": "Testing the nature of GW200105 by probing the frequency evolution of eccentricity",
      "authors": [
        "Avinash Tiwari",
        "Sajad A. Bhat",
        "Md Arif Shaikh",
        "Shasvath J. Kapadia"
      ],
      "abstract": "Testing the nature of GW200105 by probing the frequency evolution of eccentricity Avinash Tiwari, Sajad A. Bhat, Md Arif Shaikh, Shasvath J. Kapadia High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) GW200105 is a compact binary coalescence (CBC) event, consisting of a neutron star and a black hole, observed in LIGO-Virgo-KAGRA's (LVK's) third observing run (O3). Recent reanalyses of the event using state-of-the-art waveform models have claimed observation of signatures of an eccentric orbit. It has nevertheless been pointed out in the literature that certain physical or modified gravity effects could mimic eccentricity by producing a spurious non-zero eccentricity value, at a given reference frequency, when recovered with an eccentric waveform model. We recently developed a model-independent Eccentricity Evolution Consistency Test (EECT, S. A. Bhat et al. 2025) to identify such mimickers, by comparing the measured frequency $\\textit{evolution}$ of eccentricity, $e(f)$, with that expected from General Relativity (GR). In this $\\textit{Letter}$, we apply EECT to GW200105 and find that it satisfies EECT within 68% confidence. Our analysis therefore lends complementary support in favour of the eccentricity hypothesis, while also providing a novel test of the consistency of $e(f)$ with GR.",
      "pdf_url": "https://arxiv.org/pdf/2509.26152.pdf",
      "published": "2025-10-03T01:30:53.776868",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.00289",
      "title": "ELENA: a software for fast and precise computation of first order phase transitions and gravitational waves production in particle physics models",
      "authors": [
        "Francesco Costa",
        "Jaime Hoefken Zink",
        "Michele Lucente",
        "Silvia Pascoli",
        "Salvador Rosauro-Alcaraz"
      ],
      "abstract": "ELENA: a software for fast and precise computation of first order phase transitions and gravitational waves production in particle physics models Francesco Costa, Jaime Hoefken Zink, Michele Lucente, Silvia Pascoli, Salvador Rosauro-Alcaraz 50 pages, 25 figures. ELENA is available at this https URL High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present ELENA (EvaLuator of tunnElliNg Actions), an open-source Python package designed to compute the full evolution of first-order phase transitions in the early Universe generated by particle physics models, taking into account several refinements that go beyond commonly assumed simplifications. The core of ELENA is based on a vectorized implementation of the tunnelling potential formalism, which allows for a fast computation of the finite-temperature tunnelling action. This, in turn, enables the sampling of the full range of temperatures where two phases coexist and the use of integral expressions that track the complete evolution of the transition, providing a comprehensive picture of it. In addition, ELENA provides all the tools to compute the resulting stochastic gravitational waves spectrum, allowing for the full chain of computations - from the Lagrangian parameter inputs to the final gravitational waves spectrum - in a fast and self-contained implementation.",
      "pdf_url": "https://arxiv.org/pdf/2510.00289.pdf",
      "published": "2025-10-03T01:30:54.128879",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2401.09411",
      "title": "Slaying Axion-Like Particles via Gravitational Waves and Primordial Black Holes from Supercooled Phase Transition",
      "authors": [
        "Angela Conaci",
        "Luigi Delle Rose",
        "P. S. Bhupal Dev",
        "Anish Ghoshal"
      ],
      "abstract": "Slaying Axion-Like Particles via Gravitational Waves and Primordial Black Holes from Supercooled Phase Transition Angela Conaci, Luigi Delle Rose, P. S. Bhupal Dev, Anish Ghoshal 23 pages + references; matches version published in JHEP Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We study the formation of primordial black holes (PBHs) from density fluctuations due to supercooled phase transitions (PTs) triggered in an axion-like particle (ALP) model. We find that the mass of the PBHs is inversely correlated with the ALP decay constant $f_a$. For instance, for $f_a$ varying from ${\\cal O}$(100 MeV) to ${\\cal O}$($10^{12}$ GeV), the PBH mass varies between $(10^{3} - 10^{-24}) M_{\\odot}$. We then identify the ALP parameter space where the PBH can account for the entire (or partial) dark matter fraction of the Universe, in a single (multi-component) dark matter scenario, with the ALP being the other dark matter candidate. The PBH parameter space ruled out by current cosmological and microlensing observations can thus be directly mapped onto the ALP parameter space, thus providing new bounds on ALPs, complementary to the laboratory and astrophysical ALP constraints. Similarly, depending on the ALP couplings to other Standard Model particles, the ALP constraints on $f_a$ can be translated into a lower bound on the PBH mass scale. Moreover, the supercooled PT leads to a potentially observable stochastic gravitational wave (GW) signal at future GW observatories, such as aLIGO, LISA and ET, that acts as another complementary probe of the ALPs, as well as of the PBH dark matter. Finally, we show that the recent NANOGrav signal of stochastic GW in the nHz frequency range can be explained in our model with $f_a\\simeq (10~{\\rm GeV}-1~{\\rm TeV})$.",
      "pdf_url": "https://arxiv.org/pdf/2401.09411.pdf",
      "published": "2025-10-03T01:30:54.130200",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2504.00199",
      "title": "Supercooled Confinement",
      "authors": [
        "Prateek Agrawal",
        "Gaurang Ramakant Kane",
        "Vazha Loladze",
        "Mario Reig"
      ],
      "abstract": "Prateek Agrawal, Gaurang Ramakant Kane, Vazha Loladze, Mario Reig High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We study general properties of confinement phase transitions in the early universe. An observable gravitational wave signal from such transitions requires significant supercooling. However, in almost all understood examples of confining gauge theories the degree of supercooling is too small to give interesting gravitational wave signals. We review and highlight the evidence why supercooling is not generic in confining gauge theories. The exceptions are Randall-Sundrum models which define a strongly coupled gauge theory holographically by a 5D gravitational theory. We construct a simple illustrative model of a 4D gauge theory inspired by features of the Randall-Sundrum model. It is a large-$N$ gauge theory in the conformal window coupled to a weakly coupled scalar field which undergoes a supercooled phase transition that breaks the conformal symmetry and triggers confinement. We show that there are interesting features in the gravitational wave spectra that can carry the imprint of the confining gauge theory.",
      "pdf_url": "https://arxiv.org/pdf/2504.00199.pdf",
      "published": "2025-10-03T01:30:54.132344",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.00707",
      "title": "Addressing Selected Gamma-Ray Burst Science Topics with Future Space Instruments",
      "authors": [
        "Nicolas De Angelis"
      ],
      "abstract": "Addressing Selected Gamma-Ray Burst Science Topics with Future Space Instruments Nicolas De Angelis 12 pages, PoS paper from the Frontier Research in Astrophysics - IV (FRAPWS2024) workshop High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Gamma-ray bursts (GRBs) are among the most energetic events in the universe, offering insights into stellar collapse, extreme matter behavior, and cosmic evolution. The advent of multi-messenger astronomy, combining electromagnetic, gravitational wave, and neutrino observations, alongside advances in high-energy polarimetry, is revolutionizing GRB research, enabling deeper exploration of their physical mechanisms. This manuscript summarizes how upcoming and proposed space-based missions will tackle key challenges in GRB science, focusing on four areas: (i) identifying high-redshift GRBs to probe the early universe, (ii) enhancing multi-messenger detection and localization, (iii) improving multi-wavelength follow-up of GRB afterglows, and (iv) studying prompt emission polarization to understand jet dynamics and magnetic fields. Highlighting planned missions and their advancements, this work provides a snapshot of current GRB research frontiers, with updates on the evolving status of these missions.",
      "pdf_url": "https://arxiv.org/pdf/2510.00707.pdf",
      "published": "2025-10-03T01:30:54.483992",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.01142",
      "title": "Pan-STARRS follow-up of the gravitational-wave event S250818k and the lightcurve of SN 2025ulz",
      "authors": [
        "J. H. Gillanders",
        "M. E. Huber",
        "M. Nicholl",
        "S. J. Smartt",
        "K. W. Smith",
        "K. C. Chambers",
        "D. R. Young",
        "J. W. Tweddle",
        "S. Srivastav",
        "M. D. Fulton",
        "F. Stoppa",
        "G. S. H. Paek",
        "A. Aamer",
        "M. R. Alarcon",
        "A. Andersson",
        "A. Aryan",
        "K. Auchettl",
        "T.-W. Chen",
        "T. de Boer",
        "A. K. H. Kong",
        "J. Licandro",
        "T. Lowe",
        "D. Magill",
        "E. A. Magnier",
        "P. Minguez",
        "T. Moore",
        "G. Pignata",
        "A. Rest",
        "M. Serra-Ricart",
        "B. J. Shappee",
        "I. A. Smith",
        "M. A. Tucker",
        "R. Wainscoat"
      ],
      "abstract": "Pan-STARRS follow-up of the gravitational-wave event S250818k and the lightcurve of SN 2025ulz J. H. Gillanders, M. E. Huber, M. Nicholl, S. J. Smartt, K. W. Smith, K. C. Chambers, D. R. Young, J. W. Tweddle, S. Srivastav, M. D. Fulton, F. Stoppa, G. S. H. Paek, A. Aamer, M. R. Alarcon, A. Andersson, A. Aryan, K. Auchettl, T.-W. Chen, T. de Boer, A. K. H. Kong, J. Licandro, T. Lowe, D. Magill, E. A. Magnier, P. Minguez, T. Moore, G. Pignata, A. Rest, M. Serra-Ricart, B. J. Shappee, I. A. Smith, M. A. Tucker, R. Wainscoat 22 pages, 7 figures, 2 tables. Submitted. Comments welcome! High Energy Astrophysical Phenomena (astro-ph.HE) Kilonovae are the scientifically rich, but observationally elusive, optical transient phenomena associated with compact binary mergers. Only a handful of events have been discovered to date, all through multi-wavelength (gamma ray) and multi-messenger (gravitational wave) signals. Given their scarcity, it is important to maximise the discovery possibility of new kilonova events. To this end, we present our follow-up observations of the gravitational-wave signal, S250818k, a plausible binary neutron star merger at a distance of $237 \\pm 62$ Mpc. Pan-STARRS tiled 286 and 318 square degrees (32% and 34% of the 90% sky localisation region) within 3 and 7 days of the GW signal, respectively. ATLAS covered 70% of the skymap within 3 days, but with lower sensitivity. These observations uncovered 47 new transients; however, none were deemed to be linked to S250818k. We undertook an expansive follow-up campaign of AT 2025ulz, the purported counterpart to S250818k. The griz-band lightcurve, combined with our redshift measurement ($z = 0.0849 \\pm 0.0003$) all indicate that SN 2025ulz is a SN IIb, and thus not the counterpart to S250818k. We rule out the presence of a AT 2017gfo-like kilonova within $\\approx 27$% of the distance posterior sampled by our Pan-STARRS pointings ($\\approx 9.1$% across the total 90% three-dimensional sky localisation). We demonstrate that early observations are optimal for probing the distance posterior of the three-dimensional gravitational-wave skymap, and that SN 2025ulz was a plausible kilonova candidate for $\\lesssim 5$ days, before ultimately being ruled out.",
      "pdf_url": "https://arxiv.org/pdf/2510.01142.pdf",
      "published": "2025-10-03T01:30:54.485004",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2401.13993",
      "title": "Fundamental modes of rotating neutron stars with various degrees of differential rotation in dynamical spacetimes",
      "authors": [
        "Anson Ka Long Yip",
        "Patrick Chi-Kit Cheong",
        "Tjonnie Guang Feng Li"
      ],
      "abstract": "Fundamental modes of rotating neutron stars with various degrees of differential rotation in dynamical spacetimes Anson Ka Long Yip, Patrick Chi-Kit Cheong, Tjonnie Guang Feng Li Phys. Rev. D 112, 063057 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) Violent astrophysical events, including core-collapse supernovae and binary neutron star mergers, can result in rotating neutron stars with diverse degrees of differential rotation. Oscillation modes of these neutron stars could be excited and emit strong gravitational waves. Detecting these modes may provide information about neutron stars, including their structures and dynamics. Hence, dynamical simulations were employed to construct relations for quantifying the oscillation mode frequency in previous studies. Specifically, linear relations for the frequencies of fundamental $l=0$ quasi-radial mode $f_{F}$ and fundamental $l=2$ quadrupolar mode $f_{^2f}$ were constructed by simulations with the Cowling approximation. Nevertheless, these relations can overestimate $f_{F}$ and underestimate $f_{^2f}$ up to $\\sim 30\\%$. Furthermore, it has yet to be fully studied how the degree of differential rotation affects $f_{F}$ and $f_{^2f}$. Here, for the first time, we consider both various degrees of differential rotation $\\Tilde{A}$ and dynamical spacetime to construct linear relations for quantifying $f_{F}$ and $f_{^2f}$. Through 2D axisymmetric simulations, we first show that both $f_{F}$ and $f_{^2f}$ scale almost linearly with the stellar compactness $M/R$ for different values of $\\Tilde{A}$. We also observe the quasi-linear relations for both $f_{F}$ and $f_{^2f}$ with the kinetic-to-binding energy ratio $T/|W|$ for different $\\Tilde{A}$ values. Finally, we constructed linear fits that can quantify $f_{F}$ and $f_{^2f}$ by $T/|W|$. Consequently, this work updated the relations for the fundamental modes of rotating neutron stars with differential rotations in dynamical spacetime.",
      "pdf_url": "https://arxiv.org/pdf/2401.13993.pdf",
      "published": "2025-10-03T01:30:54.488632",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2504.04278",
      "title": "Atacama Cosmology Telescope: Observations of supermassive black hole binary candidates. Strong sinusoidal variations at 95, 147 and 225 GHz in PKS 2131$-$021 and PKS J0805$-$0111",
      "authors": [
        "Adam D. Hincks",
        "Xiaoyi Ma",
        "Przemek Mróz",
        "Sigurd K. Naess",
        "Sebastian Kiehlmann",
        "Roger D. Blandford",
        "J. Richard Bond",
        "Mark Devlin",
        "Jo Dunkley",
        "Allen Foster",
        "Matthew J. Graham",
        "Yilun Guan",
        "Carlos Hervías-Caimapo",
        "John C. Hood II",
        "Arthur Kosowsky",
        "Aretaios Lalakos",
        "Elias R. Most",
        "Michael D. Niemack",
        "John Orlowski-Scherer",
        "Lyman A. Page",
        "Bruce Partridge",
        "Anthony C. S. Readhead",
        "Cristóbal Sifón",
        "Suzanne T. Staggs",
        "Andrew G. Sullivan",
        "Cristian Vargas"
      ],
      "abstract": "Atacama Cosmology Telescope: Observations of supermassive black hole binary candidates. Strong sinusoidal variations at 95, 147 and 225 GHz in PKS 2131$-$021 and PKS J0805$-$0111 Adam D. Hincks, Xiaoyi Ma, Przemek Mróz, Sigurd K. Naess, Sebastian Kiehlmann, Roger D. Blandford, J. Richard Bond, Mark Devlin, Jo Dunkley, Allen Foster, Matthew J. Graham, Yilun Guan, Carlos Hervías-Caimapo, John C. Hood II, Arthur Kosowsky, Aretaios Lalakos, Elias R. Most, Michael D. Niemack, John Orlowski-Scherer, Lyman A. Page, Bruce Partridge, Anthony C. S. Readhead, Cristóbal Sifón, Suzanne T. Staggs, Andrew G. Sullivan, Cristian Vargas 20 pages, 11 figures, 9 tables. Revised version after referee's report, resubmitted to A&A on 17 Sept. 2025 High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Large sinusoidal variations in the radio light curves of the blazars PKS J0805$-$0111 and PKS 2131$-$021 have recently been discovered with an 18-year monitoring programme at the Owens Valley Radio Observatory, making these systems strong supermassive black hole binary (SMBHB) candidates. The sinusoidal variations in PKS 2131$-$021 dominate its light curves from 2.7 GHz to optical frequencies. We report sinusoidal variations observed in both objects with the Atacama Cosmology Telescope (ACT) at 95, 147 and 225 GHz consistent with the radio light curves. The ACT 95 GHz light curve of PKS 2131$-$021 agrees well with the contemporaneous 91.5 GHz ALMA light curve and is comparable in quality, while the ACT light curves of PKS J0805$-$0111, for which there are no ALMA or other millimetre light curves, show that PKS 2131$-$021 is not an isolated case, and that this class of AGN exhibits the following properties: (a) the sinusoidal pattern dominates over a broad range of frequencies; (b) the amplitude of the sine wave compared to its mean value is monochromatic (i.e., nearly constant across frequencies); (c) the phase of the sinusoid phase changes monotonically as a function of frequency; (d) the sinusoidal variations are intermittent. We describe a physical model for SMBHB systems, the modified Kinetic Orbital model, that explains all four of these phenomena. Monitoring of ${\\sim}8000$ blazars by the Simons Observatory over the next decade should provide a large number of SMBHB candidates that will shed light on the nature of the nanohertz gravitational-wave background.",
      "pdf_url": "https://arxiv.org/pdf/2504.04278.pdf",
      "published": "2025-10-03T01:30:54.489235",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.22516",
      "title": "Updated predictions for gravitational wave emission from TDEs for next generation observatories",
      "authors": [
        "Martina Toscani",
        "Luca Broggi",
        "Alberto Sesana",
        "Elena Maria Rossi"
      ],
      "abstract": "Updated predictions for gravitational wave emission from TDEs for next generation observatories Martina Toscani, Luca Broggi, Alberto Sesana, Elena Maria Rossi Main body: 10 figures, 10 pages. Appendix: 2 figures, 2 pages. Accepted for publication on A&A High Energy Astrophysical Phenomena (astro-ph.HE) In this paper, we investigate the gravitational wave (GW) emission from stars tidally disrupted by black holes (TDEs), using a semi-analytical approach. Contrary to previous works where this signal is modeled as a monochromatic burst, we here take into account all its harmonic components. On top of this, we also extend the analysis to a population of repeated-partial TDEs, where the star undergoes multiple passages around the black hole before complete disruption. For both populations, we estimate the rate of individual GW-detections considering future observatories like LISA and a potential deci-Hertz (dHz) mission, and derive the GW background from these sources. Our conclusions, even if more conservative, are consistent with previous results presented in literature. In fact, full disruptions of stars will not be seen by LISA but will be important targets for dHz observatories. In contrast, GWs from repeated disruptions will not be detectable in the near future.",
      "pdf_url": "https://arxiv.org/pdf/2505.22516.pdf",
      "published": "2025-10-03T01:30:54.489789",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}