{
  "date": "2025-12-12",
  "crawl_timestamp": "2025-12-12T01:32:05.007845",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 177,
    "total_gw_papers": 19,
    "by_category": {
      "gr-qc": {
        "total": 27,
        "gw_related": 8
      },
      "astro-ph": {
        "total": 127,
        "gw_related": 8
      }
    }
  },
  "crawl_verification": {
    "total_expected": 256,
    "total_actual": 256,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 47,
        "actual_crawled": 47,
        "page_source_info": "Total of 47 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 37,
        "actual_crawled": 37,
        "page_source_info": "Total of 37 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 42,
        "actual_crawled": 42,
        "page_source_info": "Total of 42 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 54,
        "actual_crawled": 54,
        "page_source_info": "Total of 54 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 31,
        "actual_crawled": 31,
        "page_source_info": "Total of 31 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 22,
        "actual_crawled": 22,
        "page_source_info": "Total of 22 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 23,
        "actual_crawled": 23,
        "page_source_info": "Total of 23 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.08972",
      "title": "Degenerate higher-order scalar-tensor theories in metric-affine gravity",
      "authors": [
        "Hamed Bouzari Nezhad"
      ],
      "abstract": "Degenerate higher-order scalar-tensor theories in metric-affine gravity Hamed Bouzari Nezhad General Relativity and Quantum Cosmology (gr-qc) We construct the metric-affine analogue of the quadratic degenerate higher-order scalar-tensor (DHOST) theories. We begin with a general metric-affine scalar-tensor action that is linear in curvature and contains all operators that are at most quadratic in the covariant second derivatives of the scalar field, ensuring that the connection enters only through curvature and through these second derivatives. Solving the connection equation by performing a full decomposition of the distortion tensor gives a closed-form effective metric theory. Imposing the standard metric DHOST degeneracy conditions then selects a Palatini Class Ia branch that is fully determined by two free functions in the original action. Analyzing the tensor sector shows that requiring gravitational waves to propagate at the speed of light further restricts the theory to a one-function family. These results provide a detailed and self-contained characterization of the quadratic metric-affine Class Ia sector within this operator basis and identify the theoretical conditions implied by gravitational wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2512.08972.pdf",
      "published": "2025-12-12T01:32:03.990657",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09197",
      "title": "Gravitational-Wave Signatures of Massive Black Hole Formation",
      "authors": [
        "Bernard J. Kelly",
        "Sarah Gossan",
        "Leonardo R. Werneck",
        "John Wise",
        "Zachariah B. Etienne",
        "Thiago Assumpção",
        "Aláine Lee",
        "John G. Baker"
      ],
      "abstract": "Gravitational-Wave Signatures of Massive Black Hole Formation Bernard J. Kelly, Sarah Gossan, Leonardo R. Werneck, John Wise, Zachariah B. Etienne, Thiago Assumpção, Aláine Lee, John G. Baker 19 pages, 6 figures. Accepted for publication in special issue of Classical and Quantum Gravity: \"Focus on the LISA Mission at the time of Adoption\" General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA) Direct-collapse black holes (DCBHs) are an important component of the massive black hole population of the early universe, and their formation and early mergers will be prominent in the data stream of the Laser Interferometer Space Antenna (LISA). However, the population and binary properties of these early black holes are poorly understood, with masses, mass ratios, spins, and orbital eccentricities strongly dependent on the details of their formation, and the properties of the remaining exterior material (baryonic and non-baryonic), which may be substantial to the point of merger. We report on initial work to simulate the formation, collapse, and/or merger of such DCBH regions in order to extract the resulting gravitational-wave signals.",
      "pdf_url": "https://arxiv.org/pdf/2512.09197.pdf",
      "published": "2025-12-12T01:32:03.991113",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.GA"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09554",
      "title": "Improving the inference of the stellar quantities using the extended $I$-Love-$Q$-$δM$ relations",
      "authors": [
        "Eneko Aranguren",
        "José A. Font",
        "Nicolas Sanchis-Gual",
        "Raül Vera"
      ],
      "abstract": "Improving the inference of the stellar quantities using the extended $I$-Love-$Q$-$δM$ relations Eneko Aranguren, José A. Font, Nicolas Sanchis-Gual, Raül Vera Presented at the 24th International Conference on General Relativity and Gravitation (GR24) and the 16th Edoardo Amaldi Conference on Gravitational Waves (Amaldi16) held from 14-18 July 2025 at the Scottish Event Campus, Glasgow General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) In relativistic Astrophysics the $I$-Love-$Q$ relations refer to approximately EoS-independent relations involving the moment of inertia, Love number, and quadrupole moment through some quantities that are normalised by the mass $M_0$ of the background configuration of the perturbative scheme. Since $M_0$ is not an observable quantity, this normalisation hinders the direct applicability of the relations. A common remedy assumes that $M_0$ coincides with the actual mass of the star $M_S$; however, this approximation is only adequate for very slow rotation (when the dimensionless spin parameter is $\\chi_S<0.1$). The more accurate alternative approach, based on the $I$-Love-$Q$-$\\delta M$ set of relations, circumvents this limitation by enabling the inference of $M_0$. Here we review both approaches and provide numerical comparisons.",
      "pdf_url": "https://arxiv.org/pdf/2512.09554.pdf",
      "published": "2025-12-12T01:32:03.992101",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09353",
      "title": "Bimetric MOND as a framework for variable-$G$ theories -- local systems and cosmology",
      "authors": [
        "Mordehai Milgrom"
      ],
      "abstract": "Bimetric MOND as a framework for variable-$G$ theories -- local systems and cosmology Mordehai Milgrom Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Bimetric MOND (BIMOND) is used as a platform for variable-$G$ theories that have MOND-specific idiosyncrasies. E.g., MOND premises dictate return to standard dynamics in the high-acceleration limit, predicting the standard value of $G$ for high-acceleration systems. This automatically ensures compliance of such theories with all the constraints on inconstancy of $G$ that emerge from the study of high-acceleration systems: geophysics, solar system, pulsars, supernovae, stellar evolution, emission of gravitational waves, etc. In MOND, constraints deduced from such phenomena have no bearing on possible $G$ variability in cosmology. My guiding motivation is to see if such theories may account for some roles of dark matter in cosmology; e.g., in accounting for the expansion history of the Universe in the matter-dominated era, by having a $G_e\\approx 2\\pi G$ govern the later stages of the expansion, instead of invoking matter density $\\approx 2\\pi\\times$ baryon density. Without adding degrees of freedom, or new dimensionful constants, BIMOND can be extended to a class of theories that entail what is best described as phenomenon-dependence of Newton's constant, $G$. I cannot yet present a consistent model that complies with all the observations in cosmology, including the expansion history, with all its details. Instead, I describe some examples of theories in the class that predict different values of $G_e$ in different circumstances, including one where $G$ takes its standard value for all subcosmological systems -- even if they are deep in the MOND regime. I also discuss scenarios in which $G_e\\approx G$ in the early Universe, as required by constraints from big-bang nucleosynthesis, but with $G_e> G$ setting in at later times, where it can affect the expansion history during the matter-dominated era.",
      "pdf_url": "https://arxiv.org/pdf/2512.09353.pdf",
      "published": "2025-12-12T01:32:03.993765",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09635",
      "title": "The impact of AGN environmental effects on testing general relativity with space-borne gravitational wave detector",
      "authors": [
        "Xiangyu Lyu",
        "Hongyu Chen",
        "En-Kun Li",
        "Yi-Ming Hu"
      ],
      "abstract": "The impact of AGN environmental effects on testing general relativity with space-borne gravitational wave detector Xiangyu Lyu, Hongyu Chen, En-Kun Li, Yi-Ming Hu High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The space-borne gravitational wave detectors such as TianQin offers a new window to test General Relativity by observing the early inspiral phase of stellar-mass binary black holes. A key concern arises if these stellar-mass binary black holes reside in gaseous environments such as active galactic nucleus accretion disks, where environmental effects imprint detectable modulations on the gravita- tional waveform. Using Bayesian inference on simulated signals containing both environmental and dipole deviation, we have assessed the extent to which the presence of environmental effects affects the detectability of dipole radiation. Our results demonstrate that even in the presence of strong environmental coupling, the dipole parameter can be recovered with high precision, and the evidence for dipole radiation remains distinguishable. Crucially, we find that the existence of environmental effects does not fundamentally impede the identification of dipole radiation, provided both effects are simultaneously modelled in the inference process. This study establishes that future tests of modified gravity with space-borne observatories can remain robust even for sources in astrophysical environments.",
      "pdf_url": "https://arxiv.org/pdf/2512.09635.pdf",
      "published": "2025-12-12T01:32:03.994353",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09759",
      "title": "Adding electromagnetic birefringence to pulsar timing and astrometry to detect gravitational waves",
      "authors": [
        "Keisuke Inomata",
        "Marc Kamionkowski"
      ],
      "abstract": "Adding electromagnetic birefringence to pulsar timing and astrometry to detect gravitational waves Keisuke Inomata, Marc Kamionkowski Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) It was recently shown that the time variation of the polarization of electromagnetic waves from pulsars can be used, in cross-correlation with pulsar timing, to probe the chirality of an isotropic gravitational wave background. Here, we show that the expression for the cross-correlation is derived efficiently with the total-angular-momentum formalism and use this framework to extend the formulation to cross-correlation with astrometry. We do so for spin-1 gravitational waves (that may arise in alternative-gravity theories) as well as the general-relativistic spin-2 gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2512.09759.pdf",
      "published": "2025-12-12T01:32:03.995668",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09878",
      "title": "GFH-v2 Pipeline for Searches of Long-Transient Gravitational Waves from Newborn Magnetars",
      "authors": [
        "Sandhya Sajith Menon",
        "Lorenzo Pierini",
        "Pia Astone",
        "Cristiano Palomba",
        "Lorenzo Silvestri",
        "Sabrina D'Antonio",
        "Simone Dall'Osso",
        "Francesco Safai Tehrani",
        "Stefano Dal Pra",
        "Gaetano Dinatale",
        "Sergio Frasca",
        "Dafne Guetta",
        "Paola Leaci",
        "Alessio Orlandi"
      ],
      "abstract": "GFH-v2 Pipeline for Searches of Long-Transient Gravitational Waves from Newborn Magnetars Sandhya Sajith Menon, Lorenzo Pierini, Pia Astone, Cristiano Palomba, Lorenzo Silvestri, Sabrina D'Antonio, Simone Dall'Osso, Francesco Safai Tehrani, Stefano Dal Pra, Gaetano Dinatale, Sergio Frasca, Dafne Guetta, Paola Leaci, Alessio Orlandi 13 pages, 10 figures ( +1 figure in appendix) Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) This paper presents an enhanced methodology for searching long transient gravitational waves associated with a newborn magnetar using a strongly improved version of the generalized Frequency Hough Transform algorithm, called GFH-v2. We describe the main developments introduced relative to the original implementation and outline the optimized parameter-space selection used in the search. We then compute the theoretical sensitivity of the method and compare it with an empirical sensitivity estimate obtained by injecting simulated signals into LIGO-Virgo-KAGRA O4a data. The updated framework achieves improved sensitivity and computational performance. These results provide a robust basis for future directed searches for long-transient gravitational-wave signals from core-collapse supernovae and other transient events in current and upcoming observing runs.",
      "pdf_url": "https://arxiv.org/pdf/2512.09878.pdf",
      "published": "2025-12-12T01:32:03.996157",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2503.12960",
      "title": "Initial acquisition requirements for optical cavities in the space gravitational wave antennae DECIGO and B-DECIGO",
      "authors": [
        "Yuta Michimura",
        "Koji Nagano",
        "Kentaro Komori",
        "Kiwamu Izumi",
        "Takahiro Ito",
        "Satoshi Ikari",
        "Tomotada Akutsu",
        "Masaki Ando",
        "Isao Kawano",
        "Mitsuru Musha",
        "Shuichi Sato"
      ],
      "abstract": "Initial acquisition requirements for optical cavities in the space gravitational wave antennae DECIGO and B-DECIGO Yuta Michimura, Koji Nagano, Kentaro Komori, Kiwamu Izumi, Takahiro Ito, Satoshi Ikari, Tomotada Akutsu, Masaki Ando, Isao Kawano, Mitsuru Musha, Shuichi Sato Classical and Quantum Gravity 42, 225027 (2025) General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det); Optics (physics.optics) DECIGO (DECi-hertz Interferometer Gravitational Wave Observatory) is a space-based gravitational wave antenna concept targeting the 0.1-10 Hz band. It consists of three spacecraft arranged in an equilateral triangle with 1,000 km sides, forming Fabry-Pérot cavities between them. A precursor mission, B-DECIGO, is also planned, featuring a smaller 100 km triangle. Operating these cavities requires ultra-precise formation flying, where inter-mirror distance and alignment must be precisely controlled. Achieving this necessitates a sequential improvement in precision using various sensors and actuators, from the deployment of the spacecraft to laser link acquisition and ultimately to the control of the Fabry-Pérot cavities to maintain resonance. In this paper, we derive the precision requirements at each stage and discuss the feasibility of achieving them. We show that the relative speed between cavity mirrors must be controlled at the sub-micrometer-per-second level and that relative alignment must be maintained at the sub-microradian level to obtain control signals from the Fabry-Pérot cavities of DECIGO and B-DECIGO.",
      "pdf_url": "https://arxiv.org/pdf/2503.12960.pdf",
      "published": "2025-12-12T01:32:03.996928",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.08071",
      "title": "Highly accurate simulations of asymmetric black-hole scattering and cross validation of effective-one-body models",
      "authors": [
        "Oliver Long",
        "Harald P. Pfeiffer",
        "Alessandra Buonanno",
        "Gustav Uhre Jakobsen",
        "Gustav Mogull",
        "Antoni Ramos-Buades",
        "Hannes R. Rüter",
        "Lawrence E. Kidder",
        "Mark A. Scheel"
      ],
      "abstract": "Highly accurate simulations of asymmetric black-hole scattering and cross validation of effective-one-body models Oliver Long, Harald P. Pfeiffer, Alessandra Buonanno, Gustav Uhre Jakobsen, Gustav Mogull, Antoni Ramos-Buades, Hannes R. Rüter, Lawrence E. Kidder, Mark A. Scheel 21 pages, 12 figures, 6 tables; v2 addition of App. B; v3 changes to match published version Phys. Rev. D 112 (2025), 124039 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The study of unbound binary-black-hole encounters provides a gauge-invariant approach to exploring strong-field gravitational interactions in two-body systems, which can subsequently inform waveform models for bound orbits. In this work, we present 60 new highly accurate numerical relativity (NR) simulations of black-hole scattering, generated using the Spectral Einstein Code (SpEC). Our simulations include 14 spin-aligned configurations, as well as 16 configurations with unequal masses, up to a mass ratio of 10. We perform the first direct comparison of scattering angles computed using different NR codes, finding good agreement. We compare our NR scattering angle results to the post-Minkowskian (PM)-based effective-one-body (EOB) closed-form models SEOB-PM and $w_{\\rm EOB}$, finding less than 5% deviation except near the scatter-capture separatrix. Comparisons with the post-Newtonian-based EOB evolution models SEOBNRv5 and TEOBResumS-Dalí reveal that the former agrees within 8% accuracy with non-spinning NR results across most parameter ranges, whereas the latter matches similarly at lower energies but diverges significantly at higher energies. Both evolution EOB models exhibit increased deviations for spinning systems, predicting a notably different location of the capture separatrix compared to NR. Our key result is the first measurement of disparate scattering angles from NR simulations due to asymmetric gravitational-wave emission. We compare these results to SEOB-PM models constructed to calculate the scattering angle of a single black hole in asymmetric systems.",
      "pdf_url": "https://arxiv.org/pdf/2507.08071.pdf",
      "published": "2025-12-12T01:32:03.997383",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.00533",
      "title": "Bayesian power spectral density estimation for LISA noise based on P-splines with a parametric boost",
      "authors": [
        "Nazeela Aimen",
        "Patricio Maturana-Russel",
        "Avi Vajpeyi",
        "Nelson Christensen",
        "Renate Meyer"
      ],
      "abstract": "Bayesian power spectral density estimation for LISA noise based on P-splines with a parametric boost Nazeela Aimen, Patricio Maturana-Russel, Avi Vajpeyi, Nelson Christensen, Renate Meyer General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM); Computational Physics (physics.comp-ph); Computation (stat.CO) Flexible and accurate noise characterization is crucial for the precise estimation of gravitational-wave parameters. We introduce a Bayesian method for estimating the power spectral density (PSD) of long, stationary time series, explicitly tailored for LISA data analysis. Our approach models the PSD as the geometric mean of a parametric and a nonparametric component, combining the knowledge from parametric models with the flexibility to capture deviations from theoretical expectations. The nonparametric component is expressed by a mixture of penalized B-splines. Adaptive, data-driven knot placement, performed once at initialization, removes the need for reversible-jump Markov chain Monte Carlo, while hierarchical roughness-penalty priors prevent overfitting. Validation on simulated autoregressive AR(4) data demonstrates estimator consistency and shows that well-matched parametric components reduce the integrated absolute error compared to an uninformative baseline, requiring fewer spline knots to achieve comparable accuracy. Applied to one year of simulated LISA X-channel (univariate) noise, our method achieves relative integrated absolute errors of $\\mathcal{O}(10^{-2})$, making it suitable for iterative analysis pipelines and multi-year mission data sets.",
      "pdf_url": "https://arxiv.org/pdf/2510.00533.pdf",
      "published": "2025-12-12T01:32:03.998293",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM",
        "stat.CO"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.09656",
      "title": "Photon counting readout for detection and inference of gravitational waves from neutron star merger remnants",
      "authors": [
        "Ethan Payne",
        "Lee McCuller",
        "Katerina Chatziioannou"
      ],
      "abstract": "Photon counting readout for detection and inference of gravitational waves from neutron star merger remnants Ethan Payne, Lee McCuller, Katerina Chatziioannou 15 pages, 7 figures, submitted to Phys. Rev. D, updated with Appendix on Fisher matrix General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Gravitational waves emitted after neutron star binary coalescences and the information they carry about dense matter are a high-priority target for next-generation detectors. Even though such detectors are expected to observe millions of signals, detectable post-merger emission will remain rare. In this work, we explore post-merger detectability and inference through an alternative detector readout scheme for data dominated by quantum-noise, which is the case above $1$\\,kHz: photon-counting. In such a readout, signals and noise become quantized into discrete distributions corresponding to the detection of single photons measured in a chosen basis of modes. Through simulated data, we demonstrate that photon counting can be efficient even for weak signals. We find ${\\sim}1$ in 100 signals with a post-merger signal-to-noise ratio of 0.2 can result in a single photon and thus be detected. Furthermore, after $2\\times10^4$ signals -- equivalent to $10^{-2}$ to $1.5$ years of observation -- photon counting results in a twofold improvement in the measurement of the radius of a $1.6\\,M_\\odot$ neutron star. Constraints can be further tightened if the detector classical noise is reduced. Photon counting offers a promising alternative to traditional homodyne readout techniques for extracting information from low signal-to-noise ratio post-merger signals.",
      "pdf_url": "https://arxiv.org/pdf/2511.09656.pdf",
      "published": "2025-12-12T01:32:03.998493",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09760",
      "title": "Reconciling ALP Dark Matter and Electroweak Baryogenesis through First-Order Electroweak Phase Transition",
      "authors": [
        "Dipendu Bhandari",
        "Soumen Kumar Manna",
        "Arunansu Sil"
      ],
      "abstract": "Reconciling ALP Dark Matter and Electroweak Baryogenesis through First-Order Electroweak Phase Transition Dipendu Bhandari, Soumen Kumar Manna, Arunansu Sil High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We show that an axionlike particle (ALP) can simultaneously generate the baryon asymmetry and constitute dark matter through dynamics triggered by a first-order electroweak phase transition (EWPT). In our proposal, the transition briefly reshapes the ALP potential via a temperature-dependent vacuum expectation value of a scalar field $S$, responsible for making the EWPT of first order, inducing a transient mass enhancement of ALP via higher-dimensional $U(1)$-breaking operator(s). This sudden kick generates a large ALP velocity near the onset of EWPT enabling the broadening of relic satisfied parameter space and predict a complementary stochastic gravitational-wave signal from the underlying first-order transition. We further show that the same ALP dynamics can naturally fuel electroweak baryogenesis through its coupling to electroweak anomaly.",
      "pdf_url": "https://arxiv.org/pdf/2512.09760.pdf",
      "published": "2025-12-12T01:32:04.169962",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2501.01542",
      "title": "Gravitational Wave Mountains: current-carrying domain walls",
      "authors": [
        "Anish Ghoshal",
        "Yu Hamada"
      ],
      "abstract": "Gravitational Wave Mountains: current-carrying domain walls Anish Ghoshal, Yu Hamada 16 pages, 8 figures; v2: added several sections and revised some calculations and plots, version matches the one published in PRD; v3: corrected some typos Phys.Rev.D 112 (2025) 11, 115019 High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Domain wall (DW) networks may have formed in the early universe following the spontaneous breaking of a discrete symmetry. Notably, several particle physics models predict the existence of current-carrying DWs, which can capture and store particles as zero modes on it. In this study, we demonstrate that gravitational waves (GWs) generated by current-carrying DWs with fermionic zeromodes exhibit a novel feature: an additional peak in the GW spectrum resembling mountains, arising from metastable topological remnants, which we term ``spherons.'' This distinct signature could be detectable in upcoming GW observatories such as LISA and ET. The results suggest that DW networks in beyond Standard Model scenarios could emit GW signals that are significantly stronger and with greater detectability than previously expected.",
      "pdf_url": "https://arxiv.org/pdf/2501.01542.pdf",
      "published": "2025-12-12T01:32:04.171668",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.25367",
      "title": "Cosmic domain walls on a lattice: illusive effects of initial conditions",
      "authors": [
        "I. Dankovsky",
        "S. Ramazanov",
        "E. Babichev",
        "D. Gorbunov",
        "A. Vikman"
      ],
      "abstract": "Cosmic domain walls on a lattice: illusive effects of initial conditions I. Dankovsky, S. Ramazanov, E. Babichev, D. Gorbunov, A. Vikman 31 pages, 11 figures; matches version published in PRD Phys. Rev. D 112, 123521 (2025) High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Evolution of cosmic domain walls (DWs) settles to the scaling solution, which is often assumed to be independent of initial conditions. However, lattice simulations performed in this work reveal a clear dependence of the scaling DW area on the initial configuration of the sourcing scalar field, specifically, its infrared (IR) properties. Namely, the DW area grows as one suppresses IR modes in the initial scalar field spectrum. This growth is saturated, when the area parameter $\\xi$ commonly used in the literature reaches the value $\\xi_{max} \\approx 1.2$. The dependence of $\\xi$ on IR modes is argued to be of non-physical origin: it is likely to be due to effects of the lattice boundary. Assuming that physically the memory of initial conditions is erased, one recognizes $\\xi \\approx 1.2$ obtained in the situation with maximally suppressed IR modes as a genuine universal value of the area parameter in the scaling regime. We demonstrate that ignorance about initial conditions may affect predictions for the energy density of gravitational waves by the factor five. The spectral shape of gravitational waves is also affected by the choice of initial conditions, most notably in the low-frequency part. Likewise, we revisit annihilation of DWs under the influence of a potential bias. It has been previously found in Ref. [19] that the annihilation happens significantly earlier compared to the estimate based on the simple balance between the potential bias and surface energy density. We further support this observation and show that the tendency towards an earlier annihilation gets even stronger upon removing IR modes in simulations.",
      "pdf_url": "https://arxiv.org/pdf/2509.25367.pdf",
      "published": "2025-12-12T01:32:04.172894",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09220",
      "title": "Frequency- and phase-resolved polarimetry of millisecond pulsars and its application to timing",
      "authors": [
        "Małgorzata Curyło",
        "Andrew Zic",
        "Shuangqiang Wang",
        "Eric Thrane",
        "Paul D. Lasky",
        "Jacob Cardinal Tremblay",
        "Zu-Cheng Chen",
        "Shi Dai",
        "Valentina Di Marco",
        "George Hobbs",
        "Agastya Kapur",
        "Wenhua Ling",
        "Marcus E. Lower",
        "Saurav Mishra",
        "Daniel J. Reardon",
        "Christopher J. Russell",
        "Ryan M. Shannon",
        "Xing-Jiang Zhu"
      ],
      "abstract": "Frequency- and phase-resolved polarimetry of millisecond pulsars and its application to timing Małgorzata Curyło, Andrew Zic, Shuangqiang Wang, Eric Thrane, Paul D. Lasky, Jacob Cardinal Tremblay, Zu-Cheng Chen, Shi Dai, Valentina Di Marco, George Hobbs, Agastya Kapur, Wenhua Ling, Marcus E. Lower, Saurav Mishra, Daniel J. Reardon, Christopher J. Russell, Ryan M. Shannon, Xing-Jiang Zhu 15 pages, 5 figures, 3 tables, submitted for publication to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Pulsar timing is used for a variety of applications including tests of fundamental physics, probing the structure of neutron stars, and detecting nanohertz gravitational waves. Development of robust methods and generation of high-quality timing data is therefore of utmost importance. In this paper, we present a new technique for creating high-fidelity templates that can be used to measure the pulse times of arrival with significantly increased precision compared to existing methods. Our framework makes use of all available polarimetric information to generate frequency-dependent models of pulse-shape evolution of all four Stokes parameters. We apply this method to millisecond pulsars observed by the Parkes Pulsar Timing Array and show that it results in timing measurement uncertainties reduced up to $\\sim$20-30\\%. We also present, for the first time, phase- and frequency-resolved polarimetric measurements of millisecond pulsars observed with the Parkes Murriyang ultra-widebandwith-low receiver. The data, plots and the code underlying this analysis are made publicly available.",
      "pdf_url": "https://arxiv.org/pdf/2512.09220.pdf",
      "published": "2025-12-12T01:32:04.301721",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09498",
      "title": "Dirac vs. Majorana Dark Matter Imprints on Neutron Star Observables",
      "authors": [
        "M. Bhuyan",
        "Jeet Amrit Pattnaik",
        "S. K. Patra",
        "Sudhanwa Patra"
      ],
      "abstract": "Dirac vs. Majorana Dark Matter Imprints on Neutron Star Observables M. Bhuyan (IOP BBSR), Jeet Amrit Pattnaik (IOP BBSR), S. K. Patra (SOA Univ.), Sudhanwa Patra (IIT Bhilai and IOP BBSR) 7 page, 4 figures, regular article High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) The fundamental character of a fermionic dark matter, whether it is a Dirac or Majorana particle remains a key unresolved issue whose answer would profoundly affect dark-sector phenomenology and detection strategies thereby motivates complementary probes across particle and astrophysical experiments. Compact stars, particularly neutron stars, offer unique astrophysical laboratories for probing such fundamental properties under extreme densities. The presence of a fermionic DM admixed with nuclear matter can modify the equation of state, thereby affecting observable quantities such as the mass-radius (M-R) relation and tidal deformability. In this work, we investigate how the intrinsic particle nature of fermionic DM influences neutron star structure. Within a relativistic mean-field framework extended by a scalar (or Higgs like) portal coupling between DM and nucleons, we construct self-consistent equation of states for both Dirac and Majorana cases and solve the Tolman-Oppenheimer-Volkoff equations to obtain stellar configurations. Owing to the difference in internal degrees of freedom, Dirac DM (four degrees of freedom) generally softens the equation of state more strongly than Majorana DM (two degrees of freedom), leading to smaller radii and lower maximum masses. We identify the parameter space consistent with current NICER and gravitational-wave constraints, highlighting the potential of compact-star observations to discriminate between Dirac and Majorana dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2512.09498.pdf",
      "published": "2025-12-12T01:32:04.302837",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.07959",
      "title": "Quasinormal ringing of Kerr black holes. III. Excitation coefficients for equatorial inspirals from the innermost stable circular orbit",
      "authors": [
        "Matteo Della Rocca",
        "Laura Pezzella",
        "Emanuele Berti",
        "Leonardo Gualtieri",
        "Andrea Maselli"
      ],
      "abstract": "Quasinormal ringing of Kerr black holes. III. Excitation coefficients for equatorial inspirals from the innermost stable circular orbit Matteo Della Rocca, Laura Pezzella, Emanuele Berti, Leonardo Gualtieri, Andrea Maselli General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) The remnant of a black hole binary merger settles into a stationary configuration by \"ringing down\" through the emission of gravitational waves that consist of a superposition of damped exponentials with discrete complex frequencies - the remnant black hole's quasinormal modes. While the frequencies themselves depend solely on the mass and spin of the remnant, the mode amplitudes depend on the merger dynamics. We investigate quasinormal mode excitation by a point particle plunging from the innermost stable circular orbit of a Kerr black hole. Our formalism is general, but we focus on computing the quasinormal mode excitation coefficients in the frequency domain for equatorial orbits, and we analyze their dependence on the remnant black hole spin. We find that higher overtones and subdominant multipoles of the radiation become increasingly significant for rapidly rotating black holes. This suggests that the prospects for detecting overtones and higher-order modes are considerably enhanced for highly spinning merger remnants.",
      "pdf_url": "https://arxiv.org/pdf/2512.07959.pdf",
      "published": "2025-12-12T01:32:04.304177",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from gr-qc",
        "cross_list_from": "gr-qc"
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.14883",
      "title": "A NICER view of the 1.4 solar-mass edge-on pulsar PSR J0614-3329",
      "authors": [
        "Lucien Mauviard",
        "Sebastien Guillot",
        "Tuomo Salmi",
        "Devarshi Choudhury",
        "Bas Dorsman",
        "Denis González-Caniulef",
        "Mariska Hoogkamer",
        "Daniela Huppenkothen",
        "Christine Kazantsev",
        "Yves Kini",
        "Jean-Francois Olive",
        "Pierre Stammler",
        "Anna L. Watts",
        "Melissa Mendes",
        "Nathan Rutherford",
        "Achim Schwenk",
        "Isak Svensson",
        "Slavko Bogdanov",
        "Matthew Kerr",
        "Paul S. Ray",
        "Lucas Guillemot",
        "Ismaël Cognard",
        "Gilles Theureau"
      ],
      "abstract": "A NICER view of the 1.4 solar-mass edge-on pulsar PSR J0614-3329 Lucien Mauviard, Sebastien Guillot, Tuomo Salmi, Devarshi Choudhury, Bas Dorsman, Denis González-Caniulef, Mariska Hoogkamer, Daniela Huppenkothen, Christine Kazantsev, Yves Kini, Jean-Francois Olive, Pierre Stammler, Anna L. Watts, Melissa Mendes, Nathan Rutherford, Achim Schwenk, Isak Svensson, Slavko Bogdanov, Matthew Kerr, Paul S. Ray, Lucas Guillemot, Ismaël Cognard, Gilles Theureau 25 pages, 12 figures and 4 tables. Accepted for publication in ApJ. Data files available in Zenodo High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); Nuclear Theory (nucl-th) Four neutron star radius measurements have already been obtained by modeling the X-ray pulses of rotation-powered millisecond pulsars observed by the Neutron Star Interior Composition ExploreR (NICER). We report here the radius measurement of PSR J0614-3329 employing the same method with NICER and XMM-Newton data using Bayesian Inference. For all different models tested, including one with unrestricted inclination prior, we retrieve very similar non-antipodal hot regions geometries and radii. For the preferred model, we infer an equatorial radius of $R_{\\rm eq}=10.29^{+1.01}_{-0.86}\\,$km for a mass of $M=1.44^{+0.06}_{-0.07} \\, M_{\\odot}$ (median values with equal-tailed $68\\%$ credible interval), the latter being essentially constrained from radio timing priors obtained by MeerKAT. A more complex model, fitting the data equally well, resulted in a consistent inferred radius. We find that, for all different models, the pulse emission originates from two hot regions, one at the pole and the other at the equator. The resulting radius constraint is consistent with previous X-ray and gravitational wave measurements of neutron stars in the same mass range. Equation of state inferences, including previous NICER and gravitational wave results, slightly soften the equation of state with PSR J0614$-$3329 included and shift the allowed mass-radius region toward lower radii by $\\sim 300\\,$m, which is compatible with previous analyses to within less than one standard deviation.",
      "pdf_url": "https://arxiv.org/pdf/2506.14883.pdf",
      "published": "2025-12-12T01:32:04.343999",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.09760",
      "title": "Precise Constraints on the Energy Budget of WASP-121 b from its JWST NIRISS/SOSS Phase Curve",
      "authors": [
        "Jared Splinter",
        "Louis-Philippe Coulombe",
        "Robert C. Frazier",
        "Nicolas B. Cowan",
        "Emily Rauscher",
        "Lisa Dang",
        "Michael Radica",
        "Sean Collins",
        "Stefan Pelletier",
        "Romain Allart",
        "Ryan J. MacDonald",
        "David Lafrenière",
        "Loïc Albert",
        "Björn Benneke",
        "René Doyon",
        "Ray Jayawardhana",
        "Doug Johnstone",
        "Vigneshwaran Krishnamurthy",
        "Caroline Piaulet-Ghorayeb",
        "Lisa Kaltnegger",
        "Michael R. Meyer",
        "Jake Taylor",
        "Jake D. Turner"
      ],
      "abstract": "Precise Constraints on the Energy Budget of WASP-121 b from its JWST NIRISS/SOSS Phase Curve Jared Splinter, Louis-Philippe Coulombe, Robert C. Frazier, Nicolas B. Cowan, Emily Rauscher, Lisa Dang, Michael Radica, Sean Collins, Stefan Pelletier, Romain Allart, Ryan J. MacDonald, David Lafrenière, Loïc Albert, Björn Benneke, René Doyon, Ray Jayawardhana, Doug Johnstone, Vigneshwaran Krishnamurthy, Caroline Piaulet-Ghorayeb, Lisa Kaltnegger, Michael R. Meyer, Jake Taylor, Jake D. Turner The Astronomical Journal 170 (2025) 323 Earth and Planetary Astrophysics (astro-ph.EP) Ultra-hot Jupiters exhibit day-to-night temperature contrasts upwards of 1000 K due to competing effects of strong winds, short radiative timescales, magnetic drag, and H2 dissociation/recombination. Spectroscopic phase curves provide critical insights into these processes by mapping temperature distributions and constraining the planet's energy budget across different pressure levels. Here, we present the first NIRISS/SOSS phase curve of an ultra-hot Jupiter, WASP-121 b. The instrument's bandpass [0.6 - 2.85 micron] captures an estimated 50-83% of the planet's bolometric flux, depending on orbital phase, allowing for unprecedented constraints on the planet's global energy budget; previous measurements with HST/WFC3 and JWST/NIRSpec/G395H captured roughly 20% of the planetary flux. Accounting for the unobserved regions of the spectrum, we estimate effective day and nightside temperatures of T_day = 2717 +/- 17 K and T_night = 1562 +/- 19 K corresponding to a Bond albedo of A_B = 0.277 +/- 0.016 and a heat recirculation efficiency of epsilon = 0.246 +/- 0.014. Matching the phase-dependent effective temperature with energy balance models yields a similar Bond albedo of 0.3 and a mixed layer pressure of 1 bar consistent with photospheric pressures, but unexpectedly slow winds of 0.2 km/s, indicative of inefficient heat redistribution. The shorter optical wavelengths of the NIRISS/SOSS Order 2 yield a geometric albedo of A_g = 0.093 +/- 0.029 (3 sigma upper limit of 0.175), reinforcing the unexplained trend of hot Jupiters exhibiting larger Bond albedos than geometric albedos. We also detect near-zero phase curve offsets for wavelengths above 1.5 micron, consistent with inefficient heat transport, while shorter wavelengths potentially sensitive to reflected light show eastward offsets.",
      "pdf_url": "https://arxiv.org/pdf/2509.09760.pdf",
      "published": "2025-12-12T01:32:05.004760",
      "updated": null,
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}