{
  "date": "2026-02-20",
  "crawl_timestamp": "2026-02-20T01:34:07.679957",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 134,
    "total_gw_papers": 11,
    "by_category": {
      "gr-qc": {
        "total": 26,
        "gw_related": 3
      },
      "astro-ph": {
        "total": 90,
        "gw_related": 8
      }
    }
  },
  "crawl_verification": {
    "total_expected": 180,
    "total_actual": 180,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 43,
        "actual_crawled": 43,
        "page_source_info": "Total of 43 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 31,
        "actual_crawled": 31,
        "page_source_info": "Total of 31 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 26,
        "actual_crawled": 26,
        "page_source_info": "Total of 26 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 28,
        "actual_crawled": 28,
        "page_source_info": "Total of 28 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 24,
        "actual_crawled": 24,
        "page_source_info": "Total of 24 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 13,
        "actual_crawled": 13,
        "page_source_info": "Total of 13 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 15,
        "actual_crawled": 15,
        "page_source_info": "Total of 15 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.16292",
      "title": "Gravitational Waves from Primordial Black Holes formed by Null Energy Condition Violation during Inflation",
      "authors": [
        "Dong-Hui Yu",
        "Jia-Zuo Zhang",
        "Yong Cai"
      ],
      "abstract": "Gravitational Waves from Primordial Black Holes formed by Null Energy Condition Violation during Inflation Dong-Hui Yu, Jia-Zuo Zhang, Yong Cai General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) A transient violation of the null energy condition (NEC) during inflation provides a novel mechanism for producing primordial black holes (PBHs) and stochastic gravitational wave (GW) backgrounds. In this work, we extend previous studies by computing the GW contributions from both the ringdown phase of PBH formation and subsequent binary mergers. Our results show that this scenario produces a rich, multi-component GW spectrum consisting of primordial GWs, scalar-induced GWs, and GW emissions from PBH ringdown and binary mergers. We demonstrate that these correlated signatures across different frequency bands provide a novel and powerful avenue to probe or constrain NEC violation during inflation through future multi-band GW observations.",
      "pdf_url": "https://arxiv.org/pdf/2602.16292.pdf",
      "published": "2026-02-20T01:34:06.750541",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.05207",
      "title": "Interacting Scalar Fields as Dark Energy and Dark Matter in Einstein scalar Gauss Bonnet Gravity",
      "authors": [
        "Saddam Hussain",
        "Simran Arora",
        "Yamuna Rana",
        "Benjamin Rose",
        "Anzhong Wang"
      ],
      "abstract": "Interacting Scalar Fields as Dark Energy and Dark Matter in Einstein scalar Gauss Bonnet Gravity Saddam Hussain, Simran Arora, Yamuna Rana, Benjamin Rose, Anzhong Wang 29 pages, 13 figures, 3 tables, updated new DES Supernova data, and added detailed explanation of model's stability at the background level General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) A Gauss-Bonnet (GB) coupled scalar field $\\phi$, responsible for the late-time cosmic acceleration and interacting with a coherent scalar field $\\psi$ through an interaction potential $W(\\phi,\\psi)$, is considered from the point of view of particle physics for two different models. The non-minimal coupling between the GB curvature term and the field $\\phi$ leads to a time-dependent speed of gravitational waves (GWs), which is fixed to unity in order to be consistent with current GW observations, rendering the GB coupling function model-independent. We investigate the dynamical stability of the system by formulating it as an autonomous system, and provide a detailed discussion on the choice of initial conditions required to obtain stable background evolution of the models. We constrain the model parameters using various sets of observational data, including both early- and late-time probes. We incorporate the improved Dark Energy Survey (DES) 5-year Type Ia supernova sample (DES-SN5YR), referred to as DES-Dovekie, which exhibits substantially lower tension with the Pantheon+ supernova sample. We find that both models are physically viable and closely follow the $\\Lambda$CDM trend for the Pantheon+ and DES samples. However, upon including the Roman mock data, a significant departure is observed at higher redshifts, yielding statistically strong preference over the flat $\\Lambda$CDM model.",
      "pdf_url": "https://arxiv.org/pdf/2507.05207.pdf",
      "published": "2026-02-20T01:34:06.753859",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.18637",
      "title": "Post-Newtonian Dynamics of Radiating Charges: Canonical Formulation and Binary Inspiral Laws",
      "authors": [
        "Suhani Verma",
        "Siddarth Mediratta",
        "Nanditha Kilari",
        "Prakhar Nigam",
        "Ishaan Singh",
        "Daksh Tamoli",
        "Aakash Palakurthi",
        "Valluru Ishaan",
        "Tanmay Golchha",
        "Sanjay Raghav R",
        "Sugapriyan S",
        "Yash Narayan",
        "Pasupuleti Devi",
        "Prathamesh Kapase",
        "G Prudhvi Raj",
        "Lakshya Sachdeva",
        "Shreya Meher",
        "K Nanda Kishore",
        "G Keshav",
        "Jetain Chetan",
        "Rickmoy Samanta"
      ],
      "abstract": "Post-Newtonian Dynamics of Radiating Charges: Canonical Formulation and Binary Inspiral Laws Suhani Verma, Siddarth Mediratta, Nanditha Kilari, Prakhar Nigam, Ishaan Singh, Daksh Tamoli, Aakash Palakurthi, Valluru Ishaan, Tanmay Golchha, Sanjay Raghav R, Sugapriyan S, Yash Narayan, Pasupuleti Devi, Prathamesh Kapase, G Prudhvi Raj, Lakshya Sachdeva, Shreya Meher, K Nanda Kishore, G Keshav, Jetain Chetan, Rickmoy Samanta Added brief discussions on recent Painleve-based universality arguments in binary black hole systems, added additional checks on binaries in Einstein Maxwell system General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) We construct an explicit electromagnetic analogue of the post-Newtonian Hamiltonian framework widely used in gravitational-wave physics. Starting from the Lorentz-Dirac equation and implementing Landau-Lifshitz order reduction, we derive the near-zone 1.5 PN dipole radiation-reaction force and combine it with the Darwin Hamiltonian through 1PN order to obtain a closed canonical N-body phase-space system. The equations are directly implementable, strictly conservative when dissipation is switched off, and exhibit monotonic energy loss, secular inspiral, and circularization when radiation reaction is included. For binaries we derive analytic circular and eccentric inspiral laws, including 1PN conservative corrections to the dipole-driven inspiral and merger time. Extending to charged compact binaries in Einstein-Maxwell theory, we combine the 2PN ADM-type conservative Hamiltonian with leading 1.5PN dipole dissipation and gravitational quadrupole flux, obtaining gauge-invariant energy--frequency relations, closed-form circular inspiral laws, and a dipole-quadrupole crossover scale that separates electromagnetic and gravitational flux dominated inspirals.",
      "pdf_url": "https://arxiv.org/pdf/2512.18637.pdf",
      "published": "2026-02-20T01:34:06.755092",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2307.11043",
      "title": "Adiabatic or Non-Adiabatic? Unraveling the Nature of Initial Conditions in the Cosmological Gravitational Wave Background",
      "authors": [
        "Lorenzo Valbusa Dall'Armi",
        "Alina Mierna",
        "Sabino Matarrese",
        "Angelo Ricciardone"
      ],
      "abstract": "Adiabatic or Non-Adiabatic? Unraveling the Nature of Initial Conditions in the Cosmological Gravitational Wave Background Lorenzo Valbusa Dall'Armi, Alina Mierna, Sabino Matarrese, Angelo Ricciardone Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The non-thermal nature of the cosmological gravitational wave background (CGWB) makes it difficult to define the initial condition for the graviton distribution, which determines the initial contribution to the CGWB anisotropies. Specifically, unlike Cosmic Microwave Background (CMB) photons, primordial gravitational waves (GWs) are not necessarily subject to adiabatic initial conditions. For the CGWB generated by quantum fluctuations of the metric during inflation the initial conditions are not adiabatic. The violation of adiabaticity arises from the presence of independent tensor perturbations during inflation, which behave as two extra fields that affect the standard single-clock argument. The non-adiabatic initial contribution enhances the total CGWB angular power spectrum compared to the standard adiabatic case. Given the high degree of correlation between the CGWB and Cosmic Microwave Background (CMB) anisotropies, we present the constrained realization maps of the CGWB built using the high-resolution CMB Planck maps for different initial conditions.",
      "pdf_url": "https://arxiv.org/pdf/2307.11043.pdf",
      "published": "2026-02-20T01:34:06.755721",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.10088",
      "title": "Can GW231123 have a stellar origin?",
      "authors": [
        "Djuna Croon",
        "Davide Gerosa",
        "Jeremy Sakstein"
      ],
      "abstract": "Can GW231123 have a stellar origin? Djuna Croon, Davide Gerosa, Jeremy Sakstein 5 pages, 2 figures. Updated to version published in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) The gravitational wave event GW231123 detected by the LIGO interferometers during their fourth observing run features two black holes with source-frame masses of $137^{+23}_{-18} M_\\odot$ and $101^{+22}_{-50} M_\\odot$ -- in the range of the pair-instability black hole mass gap predicted by standard stellar evolution theory. Both black holes are also inferred to be rapidly spinning ($\\chi_1 \\simeq 0.9$, $\\chi_2 \\simeq 0.8$). The primary object in GW231123 is the heaviest stellar mass black hole detected to date, which, together with its extreme rotation, raises questions about its astrophysical origin. Accounting for the unusually large spin of $\\sim 0.9$ with hierarchical mergers requires some degree of fine tuning. We investigate whether such a massive, highly spinning object could plausibly form from the collapse of a single rotating massive star. We simulate stars with an initial core mass of $160\\,M_\\odot$ -- sufficient to produce BH masses at the upper edge of the 90\\% credible interval for $m_1$ in GW231123 -- across a range of rotation rates and $^{12}\\mathrm{C}(\\alpha,\\gamma)^{16}\\mathrm{O}$ reaction rates. We allow for differential rotation to explore the high-spin regime. In this limit of weak angular momentum transport, we find that: (i) rotation shifts the pair-instability mass gap to higher masses, introducing an important correlation between masses and spins in gravitational wave predictions; and (ii) highly spinning BHs with masses $\\gtrsim 150 \\rm M_\\odot$ can form above the mass gap. Our results suggest that the primary object of GW231123 may be the first directly observed black hole that formed via direct core collapse following the photodisintegration instability.",
      "pdf_url": "https://arxiv.org/pdf/2508.10088.pdf",
      "published": "2026-02-20T01:34:06.756539",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.20967",
      "title": "A Universal CMB $B$-Mode Spectrum from Early Causal Tensor Sources",
      "authors": [
        "Kylar Greene",
        "Aurora Ireland",
        "Gordan Krnjaic",
        "Yuhsin Tsai"
      ],
      "abstract": "A Universal CMB $B$-Mode Spectrum from Early Causal Tensor Sources Kylar Greene, Aurora Ireland, Gordan Krnjaic, Yuhsin Tsai 15 pages, 5 figures; v2 added citations Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Many early universe scenarios predict post-inflationary tensor perturbations from causality-limited, sub-horizon sources. While the microphysical details may differ, as long as these sources are bounded in duration and correlation length, their tensor power spectra exhibit a universal scaling behavior at small wavenumber: $P_h(k) \\propto k^3$, corresponding to white noise on super-horizon scales at the time of production. If these early causal tensor sources (ECTs) exclusively produce gravitational waves before redshift $z \\sim 10^5$, this scaling is realized on all of the scales observed in the cosmic microwave background (CMB), and thus yields a universal multipole distribution for the $B$-mode angular power spectrum. Unlike the scale-invariant distributions of inflationary $B$ modes, ECTs generically predict enhanced power on small scales and suppressed power on large scales, which allows these source classes to be distinguished given measurements over a sufficient range of angular scales. In this paper, we introduce a unified framework for characterizing ECTs and demonstrate how their universal infrared scaling manifests in low-frequency observables, including CMB $B$ modes and stochastic gravitational wave spectral densities. We illustrate this mapping with representative case studies of this universality class involving first-order phase transitions, topological defects, and enhanced scalar perturbations, which source tensor modes at second order in perturbation theory.",
      "pdf_url": "https://arxiv.org/pdf/2601.20967.pdf",
      "published": "2026-02-20T01:34:06.757199",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.16575",
      "title": "Chiral gravitational waves from multi-phase magnetogenesis",
      "authors": [
        "H. V. Ragavendra",
        "Gianmassimo Tasinato",
        "L. Sriramkumar"
      ],
      "abstract": "Chiral gravitational waves from multi-phase magnetogenesis H. V. Ragavendra, Gianmassimo Tasinato, L. Sriramkumar Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmological vector fields are central to many early-Universe phenomena, including inflationary dynamics, primordial magnetogenesis, and dark-matter scenarios. However, constructing models able to generate cosmological magnetic fields while avoiding strong coupling, backreaction, and cosmic microwave background constraints remains challenging. We study a novel mechanism in which brief non--slow-roll phases during inflation amplify primordial magnetic fields at small scales, while maintaining theoretical consistency and observational viability. We incorporate parity-violating interactions in the vector sector and demonstrate, for the first time in a non--slow-roll framework, that chirality can significantly boost magnetic-field amplitudes and imprint distinctive polarization-dependent spectral features. We complement detailed numerical computations with an analytical treatment yielding compact expressions for chiral vector mode functions that reproduce the main spectral properties. We then develop a systematic formalism to evaluate the stochastic gravitational-wave background naturally induced at second order by these amplified fields, identifying both an intensity component and a circularly polarized contribution with characteristic frequency profiles. We discuss detection prospects with future multiband gravitational-wave observatories, showing that chiral signatures could provide a distinctive observational probe. Our results introduce new avenues for enhancing primordial magnetic fields and their associated gravitational-wave signals, opening promising possibilities for their future detection and interpretation, both with cosmological and gravitational wave probes.",
      "pdf_url": "https://arxiv.org/pdf/2602.16575.pdf",
      "published": "2026-02-20T01:34:06.911945",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.16559",
      "title": "GOTO identification and broadband modelling of the counterpart to the SVOM GRB 250818B",
      "authors": [
        "Sergey Belkin",
        "Gavin P. Lamb",
        "Kristian Ackley",
        "Matthew E. Wortley",
        "Stuart McGee",
        "Genevieve Schroeder",
        "Manor Shrestha",
        "Benjamin P. Gompertz",
        "Duncan K. Galloway",
        "Rebecca Starling",
        "Wen-fai Fong",
        "Tanmoy Laskar",
        "Chang Liu",
        "Alexander C. Gordon",
        "Nikolai Pankov",
        "Alexander E. Volvach",
        "Leonid N. Volvach",
        "Alexander Shein",
        "Andrey Pozanenko",
        "Matthew J. Dyer",
        "James Lyman",
        "Krzysztof Ulaczyk",
        "Danny Steeghs",
        "Vik Dhillon",
        "Paul O'Brien",
        "Gavin Ramsay",
        "K. Noysena",
        "Rubina Kotak",
        "Ryan P. Breton",
        "Laura K. Nuttall",
        "Danny Pollacco",
        "Supachai Awiphan",
        "Jorge Casares",
        "Patrick Chote",
        "Adam Chrimes",
        "Richard Eyles-Ferris",
        "Ben Godson",
        "P. Irawati",
        "David Jarvis",
        "Y. Julakanti",
        "Luke Kelsey",
        "Michael R. Kennedy",
        "Thomas Killestein",
        "A. Kumar",
        "Andrew Levan",
        "Sarah Littlefair",
        "Michael Magee",
        "S. Mandhai",
        "David Mata Sánchez",
        "Seppo Mattila",
        "James McCormac",
        "D. Mkrtichian",
        "S. Moran",
        "James Mullaney",
        "David O'Neill",
        "M. Patel",
        "Kevin Pu",
        "Matt Pursiainen",
        "A. Sahu",
        "U. Sawangwit",
        "Emma Stanway",
        "Y. Sun",
        "B. Warwick",
        "Katherine Wiersema"
      ],
      "abstract": "GOTO identification and broadband modelling of the counterpart to the SVOM GRB 250818B Sergey Belkin, Gavin P. Lamb, Kristian Ackley, Matthew E. Wortley, Stuart McGee, Genevieve Schroeder, Manor Shrestha, Benjamin P. Gompertz, Duncan K. Galloway, Rebecca Starling, Wen-fai Fong, Tanmoy Laskar, Chang Liu, Alexander C. Gordon, Nikolai Pankov, Alexander E. Volvach, Leonid N. Volvach, Alexander Shein, Andrey Pozanenko, Matthew J. Dyer, James Lyman, Krzysztof Ulaczyk, Danny Steeghs, Vik Dhillon, Paul O'Brien, Gavin Ramsay, K. Noysena, Rubina Kotak, Ryan P. Breton, Laura K. Nuttall, Danny Pollacco, Supachai Awiphan, Jorge Casares, Patrick Chote, Adam Chrimes, Richard Eyles-Ferris, Ben Godson, P. Irawati, David Jarvis, Y. Julakanti, Luke Kelsey, Michael R. Kennedy, Thomas Killestein, A. Kumar, Andrew Levan, Sarah Littlefair, Michael Magee, S. Mandhai, David Mata Sánchez, Seppo Mattila, James McCormac, D. Mkrtichian, S. Moran, James Mullaney, David O'Neill, M. Patel, Kevin Pu, Matt Pursiainen, A. Sahu, U. Sawangwit, Emma Stanway, Y. Sun, B. Warwick, Katherine Wiersema 24 pages, 20 figures (including Appendix), 9 tables. To be submitted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Rapid localisation and follow-up of gamma-ray bursts (GRBs) increasingly rely on low-latency triggers from new missions coupled to wide-field robotic optical facilities. We present the discovery and multi-wavelength follow-up of GRB 250818B, detected by the Space Variable Objects Monitor (SVOM) and localised optically by the Gravitational-wave Optical Transient Observer (GOTO). We compile and homogenise X-ray, optical/NIR, and radio data to build broadband light curves and spectral energy distributions. The afterglow is unusually luminous for a nominal short GRB, lying on the bright end of the short-GRB population in X-rays and optical and among the most luminous high-redshift short-GRB afterglows in the radio. MeerKAT detects the source at 3.1 GHz, while ALMA provides deep higher-frequency limits. Keck/LRIS spectroscopy shows continuum and metal absorption (Fe II, Mg II, Mg I), giving $z=1.216$. Synchrotron forward-shock modelling favours a constant-density medium and strongly prefers refreshed (energy-injection) emission, well described by a two-component jet with $E_{K,iso} \\sim 4\\times10^{52}$ erg, $n_0 \\sim 3.6$ cm$^{-3}$, $\\theta_j \\simeq 0.10$ rad ($\\sim 5.7$ deg), and $p \\simeq 1.64$. The host association is ambiguous: the nearest LS DR10 galaxy candidate ($r_{AB} \\sim 24.7$) is offset by $\\sim 4$ arcsec ($\\sim 34$ kpc) with chance-alignment probability $P_{cc} \\sim 0.2$, and current imaging does not exclude a fainter, near-coincident host. SED fitting of the candidate host suggests a low-mass galaxy. GRB 250818B highlights the power of rapid wide-field counterpart identification in the SVOM era, while host-association uncertainty can still limit offset-based interpretation.",
      "pdf_url": "https://arxiv.org/pdf/2602.16559.pdf",
      "published": "2026-02-20T01:34:07.066787",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.15938",
      "title": "Implications of the nanoHertz Gravitational-Wave Background for Galactic Feedback and Massive Black Hole Growth",
      "authors": [
        "Megan Taylor Tillman",
        "Blakesley Burkhart",
        "Chiara M. F. Mingarelli",
        "J. Andrew Casey-Clyde",
        "Lars Hernquist",
        "Sownak Bose",
        "Eniko Regos",
        "César Hernández-Aguayo"
      ],
      "abstract": "Implications of the nanoHertz Gravitational-Wave Background for Galactic Feedback and Massive Black Hole Growth Megan Taylor Tillman, Blakesley Burkhart, Chiara M. F. Mingarelli, J. Andrew Casey-Clyde, Lars Hernquist, Sownak Bose, Eniko Regos, César Hernández-Aguayo 19 pages, 7 figures, 2 tables, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate how pulsar timing array (PTA) measurements of the nanoHertz gravitational-wave background (GWB) can constrain models for the growth history of supermassive black holes (SMBHs) and how active galactic nucleus (AGN) and stellar feedback models can affect GWB predictions. Feedback regulates supermassive black hole (SMBH) growth, altering the black hole mass function (BHMF). Using BHMFs drawn from multiple cosmological simulation suites including IllustrisTNG, MillenniumTNG, Simba, and CAMELS, and combining these with a quasar-based SMBH binary population framework, we predict the resulting GWB amplitude under a range of different stellar and AGN feedback prescriptions. We find that the choice of both stellar and AGN feedback models alters the high-mass end of the BHMF and changes the predicted GWB amplitude by up to a factor of 2 for the fiducial simulations and a factor 10 for extreme feedback variations in CAMELS. Models with inefficient or absent AGN feedback produce abundant SMBHs and yield GWB amplitudes consistent with PTA data, yet fail in producing realistic galaxies. Fiducial models of AGN and stellar feedback suppress SMBH growth too much and under-predict the expected signal, an effect which could possibly be mitigated by more realistic black hole seeding and growth prescriptions. The mismatch between the GWB amplitudes predicted by cosmological simulations and those observed by PTAs suggests that SMBH growth is more efficient or occurs earlier than captured by current models. This demonstrates that PTA measurements provide a powerful new probe of feedback physics and the SMBH population.",
      "pdf_url": "https://arxiv.org/pdf/2602.15938.pdf",
      "published": "2026-02-20T01:34:07.067045",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.GA",
        "cross_list_from": "astro-ph.GA"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14300",
      "title": "Production of Jets before Neutron Star Mergers",
      "authors": [
        "Praveen Sharma",
        "Slava G. Turyshev",
        "Maxim V. Barkov",
        "Maxim Lyutikov"
      ],
      "abstract": "Production of Jets before Neutron Star Mergers Praveen Sharma, Slava G. Turyshev, Maxim V. Barkov, Maxim Lyutikov High Energy Astrophysical Phenomena (astro-ph.HE) We demonstrate that magnetospheric interactions between merging neutron stars (NSs) generate dual-jetted current outflows, analogous to the Alfvén wings observed during planetary interactions in the Solar System. Using 3D relativistic MHD simulations, we model the interaction as a conducting sphere moving through a highly magnetized plasma of the companion's magnetosphere. Unusually, the interaction operates in a regime that is relativistic yet sub-Alfvénic. Electromagnetic draping amplifies magnetic fields in a narrow layer near the stellar surface, leading to the generation of electric currents along the local magnetic field. The generation of beamed outflows enhances the instantaneous power of the pulsar-like radio and high-energy emission, produces spin/orbital modulations, and is likely to lead to observable precursor emission preceding the main gravitational wave event.",
      "pdf_url": "https://arxiv.org/pdf/2602.14300.pdf",
      "published": "2026-02-20T01:34:07.070134",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.16550",
      "title": "Searching for White Dwarf Candidates Formed Through Binary evolution in Star Clusters",
      "authors": [
        "Huahui Yan",
        "Li Wang",
        "David R. Miller",
        "Chenyu He",
        "Jiamao Lin",
        "Xiaoying Pang",
        "Jingkun Zhao",
        "Jincheng Guo",
        "Richard de Grijs",
        "Hongwei Ge",
        "Zhen Guo",
        "Bo Ma",
        "Dichang Chen",
        "Chengyuan Li"
      ],
      "abstract": "Searching for White Dwarf Candidates Formed Through Binary evolution in Star Clusters Huahui Yan, Li Wang, David R. Miller, Chenyu He, Jiamao Lin, Xiaoying Pang, Jingkun Zhao, Jincheng Guo, Richard de Grijs, Hongwei Ge, Zhen Guo, Bo Ma, Dichang Chen, Chengyuan Li Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) White dwarfs (WDs), the evolutionary endpoints of most stars, can form through both single-star and binary channels. While single-star evolutionary models enable reliable WD age estimates, binary evolution introduces interactions that can accelerate WD formation and result in a variety of exotic WDs, which may exhibit strong magnetic fields, rapid rotation, or even serve as potential gravitational wave sources. Such systems offer valuable insights into magnetic field generation, angular momentum evolution, and compact object physics. Star clusters, with their approximately coeval populations, allow precise age determination of member WDs. If a WD's total age derived from single-star evolution exceeds that of its host cluster, it likely indicates a binary origin. In this study, we use \\textit{Gaia} 5D astrometry to identify 439 WD candidates in 117 open clusters, with 244 likely formed via binary evolution. We discuss the possibility of dynamical ejection for WDs meeting only 2D (proper motion space) membership criteria. Spectroscopic observations further reveal a subset with strong magnetic fields and rapid rotation, supporting their binary evolutionary origin.",
      "pdf_url": "https://arxiv.org/pdf/2602.16550.pdf",
      "published": "2026-02-20T01:34:07.288527",
      "updated": null,
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.SR",
        "cross_list_from": "astro-ph.SR"
      }
    }
  ]
}