{
  "date": "2025-11-26",
  "crawl_timestamp": "2025-11-26T01:31:29.396796",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 245,
    "total_gw_papers": 30,
    "by_category": {
      "gr-qc": {
        "total": 51,
        "gw_related": 11
      },
      "astro-ph": {
        "total": 162,
        "gw_related": 14
      }
    }
  },
  "crawl_verification": {
    "total_expected": 348,
    "total_actual": 348,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 85,
        "actual_crawled": 85,
        "page_source_info": "Total of 85 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 63,
        "actual_crawled": 63,
        "page_source_info": "Total of 63 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 59,
        "actual_crawled": 59,
        "page_source_info": "Total of 59 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 45,
        "actual_crawled": 45,
        "page_source_info": "Total of 45 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 38,
        "actual_crawled": 38,
        "page_source_info": "Total of 38 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 34,
        "actual_crawled": 34,
        "page_source_info": "Total of 34 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 24,
        "actual_crawled": 24,
        "page_source_info": "Total of 24 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.17659",
      "title": "Gravitational Waves from the Big Bang",
      "authors": [
        "Lucas Martins Barreto Alves"
      ],
      "abstract": "Gravitational Waves from the Big Bang Lucas Martins Barreto Alves General Relativity and Quantum Cosmology (gr-qc) For millennia, humanity has relied exclusively on light$\\unicode{x2014}$initially visible light and, later, broader and broader portions of the electromagnetic spectrum$\\unicode{x2014}$to observe the universe. In the past decade, a remarkable chapter in extending astronomy beyond electromagnetic antennas has been concretized: the dawn of gravitational-wave astronomy has opened a new observational window into the cosmos. Among the many new astronomical sources we may now look for and study through their gravitational-wave signals, the Big Bang is surely among the most fascinating. Gravitational waves give us concrete hope of directly observing the primordial universe, whose light, emitted more than 13.7 billion years ago, is blocked from reaching our telescopes. This dissertation is aimed at the study of gravitational waves from cosmic inflation, the main scientific paradigm for the very early universe. Therefore, the text is divided into chapters on gravitational waves, inflationary cosmology, and inflationary gravitational waves. More specifically, our discussion will be steered by the endeavor to explain how the gravitational-wave signal sought by the NANOGrav observatory could have originated in the primordial universe.",
      "pdf_url": "https://arxiv.org/pdf/2511.17659.pdf",
      "published": "2025-11-26T01:31:27.928457",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.17758",
      "title": "Efficient Search for Detection Candidates Using a Peak Finder Strategy for All-Sky-All-Frequency Gravitational Wave Radiometer",
      "authors": [
        "Arindam Sharma",
        "Deepali Agarwal",
        "Sanjit Mitra"
      ],
      "abstract": "Efficient Search for Detection Candidates Using a Peak Finder Strategy for All-Sky-All-Frequency Gravitational Wave Radiometer Arindam Sharma, Deepali Agarwal, Sanjit Mitra General Relativity and Quantum Cosmology (gr-qc) The first all-sky-all-frequency (ASAF) radiometer search was conducted using data from the first three observing runs of the Advanced LIGO and Advanced Virgo detectors. The significance of this search lies in its fast and unmodeled approach, leveraging a cross-correlation technique to identify common signals across the detector network. As a result, this method serves as an excellent alternative to search for unknown or poorly modeled continuous wave sources and narrowband components of the gravitational wave (GW) background. For continuous wave sources whose waveform can be modeled, this method can serve as the first stage of a hierarchical scheme by identifying sub-threshold candidates to be followed up with more optimal but computationally expensive searches. The ASAF search, however, presently suffers from beam smearing, where multiple candidates may arise due to the same noise fluctuations, detector artifact, or a GW source. This can reduce the detection probability in follow-up analyzes, especially with limited computing resources. To mitigate this issue and reduce the number of correlated and unnecessary candidates, we introduce a novel Peak Finder algorithm. This algorithm helps identifying the most representative candidates while preserving detection sensitivity, thereby allowing follow up of a much larger number of independent candidates. The reduction in correlated samples leads to a significant reduction in False Dismissal Rate (FDR) using the Peak Finder method compared to the Full-sky method. For instance, following up 2 Peak Finder candidates at 30 Hz reduces FDR by a factor of 3.",
      "pdf_url": "https://arxiv.org/pdf/2511.17758.pdf",
      "published": "2025-11-26T01:31:27.929096",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.17893",
      "title": "Wave Front Sensing demodulated at the difference frequency between two phase-modulation sidebands in a compound interferometer configuration for a gravitational-wave detector",
      "authors": [
        "Chiaki Hirose",
        "Kenta Tanaka",
        "Osamu Miyakawa",
        "Takafumi Ushiba"
      ],
      "abstract": "Wave Front Sensing demodulated at the difference frequency between two phase-modulation sidebands in a compound interferometer configuration for a gravitational-wave detector Chiaki Hirose, Kenta Tanaka, Osamu Miyakawa, Takafumi Ushiba General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Precise alignment sensing and control are essential for maintaining the stability of laser interferometric gravitational-wave detectors. Conventional Wave Front Sensing technique (WFS), which relies on the beat between the carrier and phase-modulated (PM) sidebands, is dominated by arm-axis signals when the carrier resonates in the full interferometer. This dominance limits the detection of other optical axes, such as the Power Recycling Cavity (PRC) and incident beam axes. To address this problem, we propose a novel sensing technique, \"Phase-Modulated-sideband $\\times$ Phase-Modulated-sideband Wave Front Sensing\" (PMPMWFS), which demodulates the beat signal at the difference frequency between two anti-resonant PM sidebands. We derived the theoretical response of PMPMWFS and experimentally demonstrated it using the Power-Recycled X-arm (PRXARM) configuration of KAGRA. The results show that PMPMWFS effectively decouples angular fluctuation signals of the PRC and incident beam from those of the arm cavity and provides orthogonal signal components for the end mirror of the arm cavity. Furthermore, feedback control using PMPMWFS achieved stable interferometer locking for over one hour. These results demonstrate that PMPMWFS offers an effective sensing method for decoupling multiple alignment degrees of freedom in future gravitational-wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2511.17893.pdf",
      "published": "2025-11-26T01:31:27.929517",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.18110",
      "title": "Hawking-radiation-ignited autocatalytic formation of primordial black holes",
      "authors": [
        "Alexander Yakimenko"
      ],
      "abstract": "Hawking-radiation-ignited autocatalytic formation of primordial black holes Alexander Yakimenko General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Pattern Formation and Solitons (nlin.PS) We propose and analyze an autocatalytic mechanism in which bursts of Hawking radiation from evaporating micro-primordial black holes (PBHs) trigger the collapse of near-critical plasma overdensities. In a primordial plasma seeded with such patches, this feedback self organizes into a traveling ignition front that successively forms new PBHs and then self-quenches as the Universe expands. A minimal reaction-diffusion model yields conservative criteria for ignition and freeze-out and predicts a stochastic gravitational-wave background with a sharp causal low-frequency edge set by the freeze-out correlation length and largely insensitive to Planck-scale PBH endpoint microphysics. The resulting sub-Hz-to-audio band and amplitudes satisfy cosmological energy-injection bounds, providing a clean, testable target for forthcoming gravitational-wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2511.18110.pdf",
      "published": "2025-11-26T01:31:27.930889",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "nlin.PS"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.18435",
      "title": "Constraint on massive vector field with extreme-mass-ratio inspirals around a slowly rotating black hole",
      "authors": [
        "Tieguang Zi",
        "Peng-Cheng Li",
        "Bao-Min Gu",
        "Fu-Wen Shu"
      ],
      "abstract": "Constraint on massive vector field with extreme-mass-ratio inspirals around a slowly rotating black hole Tieguang Zi, Peng-Cheng Li, Bao-Min Gu, Fu-Wen Shu General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We study the influence of a massive vector (Proca) field on the energy fluxes from extreme-mass-ratio inspirals (EMRIs) around a slowly rotating Kerr black hole. The secondary compact object, carrying a Proca hair, emits additional dipolar radiation that alters total energy flux relative to general relativity (GR). These modifications induce a secular drift in the orbital evolution of circular geodesic orbits, leading to measurable dephasing in the resulting EMRIs waveforms. By evaluating waveform mismatches between the Einstein-Proca framework and its GR counterpart, we show that the Laser Interferometer Space Antenna (LISA) can distinguish the signatures of a light Proca field when black hole rotation is included. Furthermore, using a Fisher information matrix analysis, we forecast LISA's capability to place stringent constraints on the Proca mass with EMRIs signal from slowly rotating Kerr black holes. For representative EMRIs configurations, we find that LISA can detect or constrain Proca masses down to $\\mu_v\\sim 10^{-20}$eV, with typical fractional uncertainties at the level of tens percent, depending on the black-hole spin.",
      "pdf_url": "https://arxiv.org/pdf/2511.18435.pdf",
      "published": "2025-11-26T01:31:27.931290",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.16750",
      "title": "CLAWDIA: A dictionary learning framework for gravitational-wave data analysis",
      "authors": [
        "Miquel Llorens-Monteagudo",
        "Alejandro Torres-Forné",
        "José A. Font"
      ],
      "abstract": "CLAWDIA: A dictionary learning framework for gravitational-wave data analysis Miquel Llorens-Monteagudo, Alejandro Torres-Forné, José A. Font Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Deep-learning methods are becoming increasingly important in gravitational-wave data analysis, yet their performance often relies on large training datasets and models whose internal representations are difficult to interpret. Sparse dictionary learning (SDL) offers a complementary approach: it performs well in scarce-data regimes and yields physically interpretable representations of gravitational-wave morphology. Here we present CLAWDIA (Comprehensive Library for the Analysis of Waves via Dictionary-based Algorithms), an open-source Python framework that integrates SDL-based denoising and classification under realistic detector noise. We systematise previously isolated SDL workflows into a unified, modular environment with a consistent, user-friendly interface. The current release provides several time-domain denoising strategies based on LASSO-regularised sparse coding and a classifier based on Low-Rank Shared Dictionary Learning. A companion toolbox, GWADAMA, supports dataset construction and realistic conditioning of real and simulated interferometer data. We demonstrate CLAWDIA's performance by denoising the signal from binary neutron star event GW170817 and by classifying families of instrumental glitches from LIGO's third observing run, highlighting robustness at low signal-to-noise ratios. CLAWDIA is intended as a community-driven, interoperable library extensible to additional tasks, including detection and parameter estimation.",
      "pdf_url": "https://arxiv.org/pdf/2511.16750.pdf",
      "published": "2025-11-26T01:31:27.933785",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.17817",
      "title": "Search for high-frequency gravitational waves via re-analysis of cavity axion data",
      "authors": [
        "Younggeun Kim",
        "Jordan Gué",
        "Changhao Xu",
        "Diego Blas",
        "Dmitry Budker",
        "Sungjae Bae",
        "Claudio Gatti",
        "Junu Jeong",
        "Jihn E. Kim",
        "Kiwoong Lee",
        "Arjan F. van Loo",
        "Yasunobu Nakamura",
        "Seonjeong Oh",
        "Wolfram Ratzinger",
        "Taehyeon Seong",
        "Yannis K. Semertzidis",
        "Kristof Schmieden",
        "Mattias Schott",
        "Sergey Uchaikin",
        "SungWoo Youn"
      ],
      "abstract": "Search for high-frequency gravitational waves via re-analysis of cavity axion data Younggeun Kim, Jordan Gué, Changhao Xu, Diego Blas, Dmitry Budker, Sungjae Bae, Claudio Gatti, Junu Jeong, Jihn E. Kim, Kiwoong Lee, Arjan F. van Loo, Yasunobu Nakamura, Seonjeong Oh, Wolfram Ratzinger, Taehyeon Seong, Yannis K. Semertzidis, Kristof Schmieden, Mattias Schott, Sergey Uchaikin, SungWoo Youn High Energy Physics - Experiment (hep-ex); General Relativity and Quantum Cosmology (gr-qc) Monochromatic high-frequency gravitational waves (HFGW) provide a distinctive probe of new physics scenarios, most notably axion clouds around rotating black holes formed via superradiance. We reanalyzed data from the CAPP-12T MC (multi-cell) axion haloscope experiment [Phys. Rev. Lett. 133,051802 (2024)]. The study covers a continuous $2\\,$MHz frequency span centered at $5.311\\,$GHz. No rescan candidates were found, and we set 90% confidence-level exclusion limits on the gravitational-wave strain, reaching $h_0 \\approx 3.9 \\times 10^{-21}$ in the most sensitive regions of the sky. Interpreted in the context of black-hole superradiance from axion clouds, the results exclude black holes with mass $M_{\\mathrm{BH}} \\simeq 1.22 \\times 10^{-6}\\,M_\\odot$ within distances of $O(10^{-2})\\,$AU from Earth, under benchmark assumptions. This work demonstrates the potential of electromagnetic resonant cavities as novel detectors of monochromatic HFGW and motivates future searches for both long-lived and transient signals.",
      "pdf_url": "https://arxiv.org/pdf/2511.17817.pdf",
      "published": "2025-11-26T01:31:27.934238",
      "updated": null,
      "categories": [
        "hep-ex",
        "gr-qc"
      ],
      "primary_category": "hep-ex",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ex",
        "cross_list_from": "hep-ex"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.18529",
      "title": "From LIGO to Fiber- Compact Sagnac Interferometer for Gravitational-Wave Detection",
      "authors": [
        "Farhad Hakimi",
        "Hosain Hakimi"
      ],
      "abstract": "From LIGO to Fiber- Compact Sagnac Interferometer for Gravitational-Wave Detection Farhad Hakimi, Hosain Hakimi Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Gravitational wave detection has transformed astrophysics, granting us direct access to black hole mergers, neutron star collisions, and the cataclysms of stellar death. Yet the great observatories of today, LIGO, Virgo, KAGRA, and the planned Einstein Telescope, rest on Michelson interferometers that, despite their triumphs, confront fundamental barriers of scale, cost, and environmental vulnerability. We envision a new path, a Sagnac-based fiber interferometer that leverages reciprocity and inherent robustness. Its meter-scale, modular design compact enough to fit within a small facility, offers dramatic gains in scalability and affordability over kilometer scale Michelson systems. Tunable to frequency bands where conventional detectors lose sensitivity, it opens the door to compact, versatile, and accessible GW observatories, empowering universities and research centers worldwide. Linked together in a global network, such facilities could transcend mere detection, they could localize cosmic sources and reconstruct them into images, much as black holes were first directly revealed, ushering in a new era of gravitational-wave astronomy and multi-messenger discovery.",
      "pdf_url": "https://arxiv.org/pdf/2511.18529.pdf",
      "published": "2025-11-26T01:31:27.934846",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from physics.ins-det",
        "cross_list_from": "physics.ins-det"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.18681",
      "title": "Tracing the Trace Anomaly of Dense Matter inside Neutron Stars",
      "authors": [
        "Shiyue Ren",
        "Lap-Ming Lin"
      ],
      "abstract": "Tracing the Trace Anomaly of Dense Matter inside Neutron Stars Shiyue Ren, Lap-Ming Lin High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th) The trace anomaly $\\Delta$ is an important quantity that measures the broken conformal symmetry in neutron star matter. In this work, we present quasi-universal relations that connect the stellar profile of $\\Delta$ to the compactness, moment of inertia, and tidal deformability of neutron stars. We apply the quasi-universal relations to determine the trace anomaly profiles for PSR J0030+0451 and PSR J0740+6620 based on their mass-radius measurements. We also analyze PSR J0737-3039A according to its moment of inertia inferred from Bayesian modeling of nuclear equation of state. A recent multimessenger constraint on the tidal deformability is also studied, resulting in an estimate value of the trace anomaly $\\Delta_c = 0.1770^{+0.0365}_{-0.0432}$ at the center of a $1.4M_\\odot$ canonical neutron star. It is expected that more precise observations from both electromagnetic and gravitational-wave channels in the future will provide tighter constraints on the behavior of $\\Delta$ inside neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2511.18681.pdf",
      "published": "2025-11-26T01:31:27.935442",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19364",
      "title": "Neural surrogates for designing gravitational wave detectors",
      "authors": [
        "Carlos Ruiz-Gonzalez",
        "Sören Arlt",
        "Sebastian Lehner",
        "Arturs Berzins",
        "Yehonathan Drori",
        "Rana X Adhikari",
        "Johannes Brandstetter",
        "Mario Krenn"
      ],
      "abstract": "Neural surrogates for designing gravitational wave detectors Carlos Ruiz-Gonzalez, Sören Arlt, Sebastian Lehner, Arturs Berzins, Yehonathan Drori, Rana X Adhikari, Johannes Brandstetter, Mario Krenn Machine Learning (cs.LG); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) Physics simulators are essential in science and engineering, enabling the analysis, control, and design of complex systems. In experimental sciences, they are increasingly used to automate experimental design, often via combinatorial search and optimization. However, as the setups grow more complex, the computational cost of traditional, CPU-based simulators becomes a major limitation. Here, we show how neural surrogate models can significantly reduce reliance on such slow simulators while preserving accuracy. Taking the design of interferometric gravitational wave detectors as a representative example, we train a neural network to surrogate the gravitational wave physics simulator Finesse, which was developed by the LIGO community. Despite that small changes in physical parameters can change the output by orders of magnitudes, the model rapidly predicts the quality and feasibility of candidate designs, allowing an efficient exploration of large design spaces. Our algorithm loops between training the surrogate, inverse designing new experiments, and verifying their properties with the slow simulator for further training. Assisted by auto-differentiation and GPU parallelism, our method proposes high-quality experiments much faster than direct optimization. Solutions that our algorithm finds within hours outperform designs that take five days for the optimizer to reach. Though shown in the context of gravitational wave detectors, our framework is broadly applicable to other domains where simulator bottlenecks hinder optimization and discovery.",
      "pdf_url": "https://arxiv.org/pdf/2511.19364.pdf",
      "published": "2025-11-26T01:31:27.936575",
      "updated": null,
      "categories": [
        "cs.LG",
        "astro-ph.IM",
        "gr-qc",
        "quant-ph"
      ],
      "primary_category": "cs.LG",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from cs.LG",
        "cross_list_from": "cs.LG"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19393",
      "title": "Guesswork in the gap: the impact of uncertainty in the compact binary population on source classification",
      "authors": [
        "Utkarsh Mali",
        "Reed Essick"
      ],
      "abstract": "Guesswork in the gap: the impact of uncertainty in the compact binary population on source classification Utkarsh Mali, Reed Essick High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); Computational Physics (physics.comp-ph); Data Analysis, Statistics and Probability (physics.data-an); Space Physics (physics.space-ph) The nature of the compact objects within the supposed \"lower mass gap\" remains uncertain. Observations of GW190814 and GW230529 highlight the challenges gravitational waves face in distinguishing neutron stars from black holes. Interpreting these systems is especially difficult because classifications depend simultaneously on measurement noise, compact binary population models, and equation of state (EOS) constraints on the maximum neutron star mass. We analyze 66 confident events from GWTC-3 to quantify how the probability of a component being a neutron star, P(NS), varies across the population. The effects are substantial, the dominant drivers of classification are the pairing preferences of neutron stars with other compact objects, and the neutron star spin distributions. The data reveals that P(NS) varies between 1% - 67% for GW230529's primary and between 51% - 100% for GW190425's primary. By contrast, P(NS) for GW190814's secondary varies by <10%, demonstrating robustness from its high signal-to-noise ratio and small mass ratio. Analysis using EOS information tends to affect P(NS) through the inferred maximum neutron star mass rather than the maximum spin. As it stands, P(NS) remains sensitive to numerous population parameters, limiting its reliability and potentially leading to ambiguous classifications of future GW events.",
      "pdf_url": "https://arxiv.org/pdf/2511.19393.pdf",
      "published": "2025-11-26T01:31:27.936970",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2502.17400",
      "title": "Accounting for the Known Unknowns: A Parametric Framework to Incorporate Systematic Waveform Errors in Gravitational-Wave Parameter Estimation",
      "authors": [
        "Sumit Kumar",
        "Max Melching",
        "Frank Ohme"
      ],
      "abstract": "Accounting for the Known Unknowns: A Parametric Framework to Incorporate Systematic Waveform Errors in Gravitational-Wave Parameter Estimation Sumit Kumar, Max Melching, Frank Ohme 24 pages, 13 figures, 3 tables. Matches with the accepted version of the manuscript Phys. Rev. D 112, 104071 (2025) General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) The PE for GW merger events relies on a waveform model calibrated using numerical simulations. Within the Bayesian framework, this waveform model represents the GW signal produced during the merger and is crucial for estimating the likelihood function. However, these waveform models may possess systematic errors that can differ across the parameter space. Addressing these errors in the current data analysis pipeline is an active area of research. We introduce parametrizations for the uncertainties in the amplitude and phase of the reference waveform model. When the error budget in the amplitude and phase of the waveform model, as a function of frequency, is known, it can be used as a prior distribution in the Bayesian framework. We also show that conservative priors can be used to quantify uncertainties in waveform modeling without any knowledge of waveform uncertainty error budgets. Through zero-noise injections and PE recoveries, we demonstrate that even 1%-2% of errors in relative phase to the actual waveform model, for a GW150914-like signal and advanced LIGO detector sensitivity, can introduce biases in the recovered parameters. These biases can be corrected when we account for waveform uncertainties within the PE framework. By analyzing a series of simulated signals from mergers with precessing orbits and recovering them using a non-spinning waveform model, we demonstrate that we can reduce the ratio of systematic errors to statistical errors. This approach allows us to address scenarios where specific physical effects are missing in waveform modeling. The code that implements our parametrization for performing PE is available as a Python package \"pycbc_wferrors_plugin\", compatible with the PyCBC open source GW analysis library.",
      "pdf_url": "https://arxiv.org/pdf/2502.17400.pdf",
      "published": "2025-11-26T01:31:27.937443",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.18261",
      "title": "Frequency contamination from new fundamental fields in black hole ringdowns",
      "authors": [
        "Jacopo Lestingi",
        "Giovanni D'Addario",
        "Thomas P. Sotiriou"
      ],
      "abstract": "Frequency contamination from new fundamental fields in black hole ringdowns Jacopo Lestingi, Giovanni D'Addario, Thomas P. Sotiriou Phys. Rev. D 112, 064070 Published 24 September, 2025 General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) We revisit the modelling of black hole ringdown beyond General Relativity (GR), emphasizing the limitations of approaches that rely solely on shifted quasinormal mode (QNM) frequencies. Starting from modified Teukolsky equations in such scenarios, we classify the distinct types of deviations that can arise -- those shifting QNM frequencies, and those introducing additional frequencies associated with extra fields. We then construct the most general ansatz for metric perturbations in this context and discuss its implications for QNM modelling and theory-agnostic tests of GR using gravitational wave data.",
      "pdf_url": "https://arxiv.org/pdf/2505.18261.pdf",
      "published": "2025-11-26T01:31:27.938661",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.04905",
      "title": "Can Gravitational Wave Data Shed Light on Dark Matter Particles ?",
      "authors": [
        "Parthasarathi Majumdar"
      ],
      "abstract": "Can Gravitational Wave Data Shed Light on Dark Matter Particles ? Parthasarathi Majumdar 7 pages, no figures, Latex2e. Abstract slightly modified. A somewhat expanded version of the previous submission. Introduction and Section 3 substantially expanded and several physical arguments incorporated and technical issues addressed. Several references added General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Gravitational wave (GW) data from observed binary black hole coalescences (BBHC) have been demonstrated in recent analyses to validate the Hawking Area Theorem (HAT) for black hole horizons. The result of such analyses is imposed here as a criterion of {\\it absolute} consistency on the logarithmic (in horizon area) corrections to the Bekenstein-Hawking Area Formula (BHAF) for the black hole entropy, when these corrections are computed both from non-perturbative quantum fluctuations of spacetime in matter-free quantum general relativity, as well as arising due to perturbative quantum matter field fluctuations around a stationary classical black hole background spacetime. This criterion of absolute consistency is seen to be obeyed provided certain restrictions ensue on the spin-parity and number of species of the spectrum of quantum matter fluctuations. Such constraints appear to restrict the Beyond-Standard-Model (BSM) part of the matter fluctuation spectrum. Some species of the constrained, yet-unobserved BSM particle spectrum are currently under active consideration in particle cosmology as candidates for dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2506.04905.pdf",
      "published": "2025-11-26T01:31:27.938856",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.03490",
      "title": "Ring formation from black hole superradiance through repeated particle production on bound orbits",
      "authors": [
        "Zhen-Hong Lyu",
        "Rong-Gen Cai",
        "Zong-Kuan Guo",
        "Jian-Feng He",
        "Jing Liu"
      ],
      "abstract": "Ring formation from black hole superradiance through repeated particle production on bound orbits Zhen-Hong Lyu, Rong-Gen Cai, Zong-Kuan Guo, Jian-Feng He, Jing Liu 13 pages, 5 figures. Added minor corrections. Version accepted for publication in PRD General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Ultralight bosonic fields around a rotating black hole can extract energy and angular momentum through the superradiant instability and form a dense cloud. We investigate the scenario involving two scalar fields, $\\phi$ and $\\chi$, with a coupling term $\\frac{1}{2}\\lambda\\phi\\chi^2$, which is motivated by the multiple-axion framework. The ultralight scalar $\\phi$ forms a cloud that efficiently produces $\\chi$ particles nonperturbatively via parametric resonance, with a large mass hierarchy, $\\mu_\\chi \\gg \\mu_\\phi$. Rather than escaping the system as investigated by previous studies, these $\\chi$ particles remain bound, orbiting the black hole. Moreover, the particle production occurs primarily at the peak of the cloud's profile, allowing $\\chi$ particles in quasicircular orbits to pass repeatedly through resonant regions, leading to cumulative amplification. This selective process naturally forms a dense ring of $\\chi$ particles, with a mass ratio to the cloud fixed by $(\\mu_\\phi/\\mu_\\chi)^2$. Our findings reveal a novel mechanism for generating bound-state particles via parametric resonance, which also impacts the evolution of the cloud. This process can be probed through its imprint on binary dynamics and its gravitational-wave signatures.",
      "pdf_url": "https://arxiv.org/pdf/2507.03490.pdf",
      "published": "2025-11-26T01:31:27.939285",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.05370",
      "title": "Limiting geometry and spectral instability in Schwarzschild--de Sitter spacetimes",
      "authors": [
        "Yi Zhou",
        "Rodrigo Panosso Macedo"
      ],
      "abstract": "Limiting geometry and spectral instability in Schwarzschild--de Sitter spacetimes Yi Zhou, Rodrigo Panosso Macedo 19 pages, 9 figures; updated to match the published version General Relativity and Quantum Cosmology (gr-qc) We revisit the quasinormal mode (QNM) problem in Schwarzschild--de Sitter spacetimes providing a unified infrastructure tailored for studying limiting configurations. Geometrically, we employ the hyperboloidal framework to explicitly implement Geroch's rigorous limiting procedures for families of spacetimes. This enables a controlled transition between Schwarzschild, de Sitter, and Nariai geometries. Numerically, we introduce the analytical mesh refinement technique into quasinormal mode calculations, successfully recovering -- within the appropriate limiting scenarios -- both known families of quasinormal modes: complex light ring modes and purely imaginary de Sitter modes. We interpret these results in terms of spectral instability, where the notions of stable and unstable modes depends on the specific spacetime limit under consideration. In the Schwarzschild limit, de Sitter modes appear as a destabilizing effect on the continuous branch cut at $\\omega = 0$. Conversely, the branch cut can be understood as emerging from an infinite accumulation of discrete modes at $\\omega = 0$ in the transitional regime. We propose a heuristic measure of QNM density to characterize this accumulation and highlight the need for a more rigorous study of potential branch cut instabilities -- especially relevant in the context of late-time gravitational wave signals. The proposed infrastructure provides a general and extensible framework for investigations in more complex spacetimes, such as Reissner--Nordström--de Sitter or Kerr--Newman--de Sitter.",
      "pdf_url": "https://arxiv.org/pdf/2507.05370.pdf",
      "published": "2025-11-26T01:31:27.939482",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.07348",
      "title": "Nonlinear Ringdowns as Sources and Detectors of Quantum Gravitational Waves",
      "authors": [
        "Thiago Guerreiro"
      ],
      "abstract": "Nonlinear Ringdowns as Sources and Detectors of Quantum Gravitational Waves Thiago Guerreiro arXiv admin note: substantial text overlap with arXiv:2306.09974 2025 Class. Quantum Grav. 42 215022 General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) Is gravity quantum mechanical? If so, we argue that nonlinear effects in black hole ringdowns - notably second harmonic generation - generates gravitational waves in non-classical states. While quantum features of these states such as sub-Poissonian statistics or entanglement could in principle be measured at interferometric detectors, the tiny coupling of gravity to matter makes this extremely challenging. Drawing on ideas from quantum optics, we instead propose that the nonlinearities in ringdowns could be used as strongly coupled detectors of quantum gravitational radiation, potentially offering a new route to probing the quantum nature of gravity.",
      "pdf_url": "https://arxiv.org/pdf/2508.07348.pdf",
      "published": "2025-11-26T01:31:27.940287",
      "updated": null,
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2112.15478",
      "title": "Spinodal Gravitational Waves",
      "authors": [
        "Yago Bea",
        "Jorge Casalderrey-Solana",
        "Thanasis Giannakopoulos",
        "Aron Jansen",
        "Sven Krippendorf",
        "David Mateos",
        "Mikel Sanchez-Garitaonandia",
        "Miguel Zilhão"
      ],
      "abstract": "Yago Bea, Jorge Casalderrey-Solana, Thanasis Giannakopoulos, Aron Jansen, Sven Krippendorf, David Mateos, Mikel Sanchez-Garitaonandia, Miguel Zilhão High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We uncover a new gravitational-wave production mechanism in cosmological, first-order, thermal phase transitions. These are usually assumed to proceed via the nucleation of bubbles of the stable phase inside the metastable phase. However, if the nucleation rate is sufficiently suppressed, then the Universe may supercool all the way down the metastable branch and enter the spinodal region. In this case the transition proceeds via the exponential growth of unstable modes and the subsequent formation, merging and relaxation of phase domains. We use holography to follow the real-time evolution of this process in a strongly coupled, four-dimensional gauge theory. The resulting gravitational wave spectrum differs qualitatively from that in transitions mediated by bubble nucleation. We discuss the possibility that the spinodal dynamics may be preceded by a period of thermal inflation.",
      "pdf_url": "https://arxiv.org/pdf/2112.15478.pdf",
      "published": "2025-11-26T01:31:27.942161",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2401.02409",
      "title": "Gravitational waves from dark domain walls",
      "authors": [
        "Øyvind Christiansen",
        "Julian Adamek",
        "Farbod Hassani",
        "David F. Mota"
      ],
      "abstract": "Gravitational waves from dark domain walls Øyvind Christiansen, Julian Adamek, Farbod Hassani, David F. Mota 7 pages, 4 figures. Supplementary material and videos may be found at this https URL . The code is available at this https URL . New version adds missing reference Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) For most of cosmic history, the evolution of our Universe has been governed by the physics of a 'dark sector', consisting of dark matter and dark energy, whose properties are only understood in a schematic way. The influence of these constituents is mediated exclusively by the force of gravity, meaning that insight into their nature must be gleaned from gravitational phenomena. The advent of gravitational-wave astronomy has revolutionised the field of black hole astrophysics, and opens a new window of discovery for cosmological sources. Relevant examples include topological defects, such as domain walls or cosmic strings, which are remnants of a phase transition. Here we present the first simulations of cosmic structure formation in which the dynamics of the dark sector introduces domain walls as a source of stochastic gravitational waves in the late Universe. We study in detail how the spectrum of gravitational waves is affected by the properties of the model, and extrapolate the results to scales relevant to the recent evidence for a stochastic gravitational wave background. Our relativistic implementation of the field dynamics paves the way for optimal use of the next generation of gravitational experiments to unravel the dark sector.",
      "pdf_url": "https://arxiv.org/pdf/2401.02409.pdf",
      "published": "2025-11-26T01:31:27.942382",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2406.00422",
      "title": "Residual neural networks to classify the high frequency emission in core-collapse supernova gravitational waves",
      "authors": [
        "Manuel D. Morales",
        "Javier M. Antelis",
        "Claudia Moreno"
      ],
      "abstract": "Residual neural networks to classify the high frequency emission in core-collapse supernova gravitational waves Manuel D. Morales, Javier M. Antelis, Claudia Moreno Gen. Relativ. Gravit. 57, 162 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) We present a new methodology to explore the morphology of the High Frequency Feature (HFF), i.e., the dominant, rising-frequency GW emission from a proto-neutron star in core-collapse supernovae (CCSNe). We used a residual neural network (ResNet50) to perform multi-class classification of image samples constructed from time-frequency Morlet wavelet scalograms. We defined a three-class problem by categorizing the HFF slope as Steep, Moderate, or Low, according to physically informed ranges. The ResNet50 model was optimized with phenomenological waveforms injected into real noise from the LIGO-Virgo O3b observing run and then tested with numerically simulated CCSN waveforms embedded in the same real noise. At galactic distances of 1 kpc and 5 kpc with H1 and L1 data and 1 kpc with V1 data, we obtained highly accurate results (test accuracies from 0.8933 to 0.9867), which show the feasibility of our methodology. For further distances, we observed declines in test accuracy until 0.8000 with H1 and L1 data at 10 kpc and until 0.5933 with V1 data at 10 kpc, which we attribute to limitations in the input datasets. Our methodology is sufficiently general to enable early-stage characterization of the HFF in real interferometric data.",
      "pdf_url": "https://arxiv.org/pdf/2406.00422.pdf",
      "published": "2025-11-26T01:31:27.942595",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2412.02500",
      "title": "Study of primordial non-Gaussianity $f_{\\mathrm{NL}}$ and $g_{\\mathrm{NL}}$ with the cross-correlations between the scalar-induced gravitational waves and the cosmic microwave background",
      "authors": [
        "Zhi-Chao Zhao",
        "Sai Wang",
        "Jun-Peng Li",
        "Kazunori Kohri"
      ],
      "abstract": "Study of primordial non-Gaussianity $f_{\\mathrm{NL}}$ and $g_{\\mathrm{NL}}$ with the cross-correlations between the scalar-induced gravitational waves and the cosmic microwave background Zhi-Chao Zhao, Sai Wang, Jun-Peng Li, Kazunori Kohri 18 pages, 5 figures, one column, version accepted by EPJC. The code is available on GitHub at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The stochastic gravitational-wave background originating from cosmic sources contains vital information about the early universe. In this work, we comprehensively study the cross-correlations between the energy-density anisotropies in scalar-induced gravitational waves (SIGWs) and the temperature anisotropies and polarization in the cosmic microwave background (CMB). In our analysis of the angular power spectra for these cross-correlations, we consider all contributions of the local-type primordial non-Gaussianity $f_{\\mathrm{NL}}$ and $g_{\\mathrm{NL}}$ that can lead to large anisotropies. We show that the angular power spectra are highly sensitive to primordial non-Gaussianity. Furthermore, we project the sensitivity of future gravitational-wave detectors to detect such signals and, consequently, measure the primordial non-Gaussianity.",
      "pdf_url": "https://arxiv.org/pdf/2412.02500.pdf",
      "published": "2025-11-26T01:31:27.943180",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.14316",
      "title": "Machine learning classification of black holes in the mass--spin diagram",
      "authors": [
        "Nathan Steinle",
        "Samar Safi-Harb"
      ],
      "abstract": "Machine learning classification of black holes in the mass--spin diagram Nathan Steinle, Samar Safi-Harb High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present the mass--spin diagram for classifying black holes and studying their formation pathways providing an analogue to the Hertzsprung-Russell diagram. This allows for black hole evolutionary tracks as a function of redshift, combining formation, accretion, and merger histories for the variety of black hole populations. A realistic black hole continuum constructed from initial mass and spin functions and approximate redshift evolution reveals possible black hole main sequences, such as sustained coherent accretion through cosmic time or hierarchical merger trees. In the stellar-mass regime, we use a binary population synthesis software to compare three spin prescriptions for tidal evolution of Wolf-Rayet progenitors, showing how the mass--spin diagram exposes interesting modeling differences. We then classify black hole populations by applying supervised and unsupervised machine learning clustering methods to mass--spin datasets. While bare unsupervised clustering can nearly recover canonical population boundaries (stellar-mass, intermediate-mass, and supermassive), a more sophisticated approach utilizing deep learning via variational autoencoders for latent space representation learning aids in clustering of realistic datasets with subclasses that highly overlap in mass--spin space. We find that a supervised random forest can accurately recover the correct clusters from the learned latent space representation depending on the complexity of the underlying dataset, semi-supervised methods show potential for further development, and the performance of unsupervised classifiers is a great challenge. Our findings motivate future machine learning applications and demonstrate that the mass--spin diagram can be used to connect gravitational-wave and electromagnetic observations with theoretical models.",
      "pdf_url": "https://arxiv.org/pdf/2508.14316.pdf",
      "published": "2025-11-26T01:31:27.945013",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19386",
      "title": "Gravitational Wave Probe of Singlet-Doublet Dark Matter Induced Radiative Neutrino Mass",
      "authors": [
        "Ujjal Kumar Dey",
        "Santu Kumar Manna",
        "Partha Kumar Paul",
        "Sujit Kumar Sahoo",
        "Narendra Sahu"
      ],
      "abstract": "Gravitational Wave Probe of Singlet-Doublet Dark Matter Induced Radiative Neutrino Mass Ujjal Kumar Dey, Santu Kumar Manna, Partha Kumar Paul, Sujit Kumar Sahoo, Narendra Sahu 18+11 pages, 10+4 captioned figures, 3 tables High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Experiment (hep-ex); High Energy Physics - Theory (hep-th) We investigate an one loop radiative neutrino mass model, where the loop particles, notably a singlet fermion ($\\chi$), a doublet fermion ($\\Psi$) and three generations of singlet scalars ($\\phi_i, i=\\{1,2,3\\}$) are assumed to be odd under an additional $\\mathcal{Z}_2$-symmetry. In this setup, the singlet fermion mixes with the neutral component of the doublet to give rise singlet-doublet Majorana dark matter. The addition of $\\mathcal{Z}_2$ odd scalars in the model provides rich phenomenological implications. We find that the quartic interaction terms between the SM Higgs and $\\phi_i$s play a significant role in modifying the scalar potential to have a first-order phase transition (FOPT) leading to observable gravitational waves (GWs) spectra. We also examine the non-trivial role played by the singlet-doublet fermion DM and the scalars in loop-induced neutrino mass, $(g-2)_\\mu$, and lepton flavor violation. We find that the model is predictive due to the combined constraints and can be verified at different terrestrial experiments.",
      "pdf_url": "https://arxiv.org/pdf/2511.19386.pdf",
      "published": "2025-11-26T01:31:28.174726",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-ex",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19407",
      "title": "Probing the Formation Environment of Strongly Lensed Black Hole Mergers: Implications for the AGN-disk Channel",
      "authors": [
        "Johan Samsing",
        "Lorenz Zwick",
        "Pankaj Saini",
        "János Takátsy"
      ],
      "abstract": "Probing the Formation Environment of Strongly Lensed Black Hole Mergers: Implications for the AGN-disk Channel Johan Samsing, Lorenz Zwick, Pankaj Saini, János Takátsy High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The observation of multiple images from a strongly lensed gravitational wave (GW) source provides the observer with a stereoscopic view of the source. This allows for a measure of its relative proper motion by comparing the induced GW Doppler shifts between the different images. In addition, if the GW source is in a dynamical environment it will be subject to an acceleration, which will show up as a time dependent Doppler shift in each individual image. In this work we quantify for the first time how a joint detection of these effects can be used to constrain the underlying dynamics and environment of the lensed GW source. We consider a range of different astrophysical environments, from massive clusters to stellar triples, and find that binary black hole (BBH) mergers in Active Galactic Nuclei disks (AGN-disks) are particularly likely to have orbital parameters that can be constrained through our considered lensing setup. Applying these methods to the upcoming catalog of cosmologically strongly lensed GW sources will open up new possibilities for probing their origin and underlying formation mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2511.19407.pdf",
      "published": "2025-11-26T01:31:28.174911",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19429",
      "title": "Axion Cosmology with Multi-Branch Yang-Mills",
      "authors": [
        "Tsubasa Sugeno",
        "Wen Yin"
      ],
      "abstract": "Axion Cosmology with Multi-Branch Yang-Mills Tsubasa Sugeno, Wen Yin 31 pages, 6figures, 1table. Comments welcome High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) It is known that Yang-Mills theories, especially in the large-$N$ limit, exhibit a $\\theta$-vacuum structure with a multi-branched vacuum energy. In this work, we demonstrate that this multi-branch structure can play a crucial role in axion cosmology when the axion acquires its mass from the Yang-Mills sector, even when that sector is never reheated by the inflaton. The key observation is that the axion potential is directly tied to the tunneling rate between adjacent branches. We find qualitatively new phenomena, including a new class of first-order phase transitions, bouncing bubbles, and nested \"bubbles-within-bubbles.\" When the axion has a decay constant around the Planck scale, as motivated by the string Axiverse, the axion can be driven near the hilltop by inflationary dynamics, allowing the phase transition to be triggered. The associated energy release can be large enough to generate a significant stochastic gravitational-wave background, produce primordial black holes, or populate the Yang-Mills sector with particles. These phenomena represent novel predictions of the Axiverse and should be taken into account when assessing the cosmological impact of axions or axion-like particles. To recover conventional axion cosmology, one must suppress or avoid the dynamics discussed in this work.",
      "pdf_url": "https://arxiv.org/pdf/2511.19429.pdf",
      "published": "2025-11-26T01:31:28.175109",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.06648",
      "title": "Primordial black holes with mass ratio-modulated initial clustering: merger suppression and projected constraints",
      "authors": [
        "Gabriel Luis Dizon"
      ],
      "abstract": "Primordial black holes with mass ratio-modulated initial clustering: merger suppression and projected constraints Gabriel Luis Dizon (National Institute of Physics, University of the Philippines - Diliman) Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a modification of the expected local primordial black hole (PBH) count $N(y)$, typically seen in the context of the early PBH binary merger rate as a term in the merger rate suppression. We utilize recent results in small-scale PBH clustering to formulate $N(y)$ in such a way that accounts for variations in the binary mass ratio $q$. We then examine how this change affects the projected constraints on PBH abundance from simulated Einstein Telescope (ET) and LISA mergers. Our results indicate that for broadly extended mass distributions, the merger suppression is greatly reduced for binaries with $q \\gg 1$. This leads to an enhanced merger rate for binary distributions favoring a lighter average mass. This change is best reflected by an extension of the low mass end of the constraint windows derived from the resolvable merger channel, although this result is present as well in the stochastic gravitational wave background (SGWB) constraints. Our results imply that the assumption of PBH clustering is testable at abundances and mass ranges much lower than anticipated. Note however that we have only considered the two-body merger channel in this work; a more thorough analysis of our scenario will require a study on the dynamics involved in the three-body merger channel for broad mass distributions, which we leave to future work.",
      "pdf_url": "https://arxiv.org/pdf/2506.06648.pdf",
      "published": "2025-11-26T01:31:28.177821",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19243",
      "title": "What do gravitational-wave observations tell us about Luminous Red Novae?",
      "authors": [
        "Dhruv Jain",
        "Shasvath J. Kapadia",
        "Kuntal Misra",
        "Dimple",
        "L. Resmi",
        "Ajay Kumar Singh",
        "K. G. Arun"
      ],
      "abstract": "What do gravitational-wave observations tell us about Luminous Red Novae? Dhruv Jain, Shasvath J. Kapadia, Kuntal Misra, Dimple, L. Resmi, Ajay Kumar Singh, K. G. Arun 7 Pages, 3 figures, 1 Table; To be Submitted in ApJL High Energy Astrophysical Phenomena (astro-ph.HE) Luminous Red Novae (LRNe) have been argued to be related to the ejection of common envelopes (CEs) in binary star systems. Ejection of CEs leads to tightened stellar orbits capable of forming compact binaries that merge in Hubble time. As these mergers are seen by gravitational-wave (GW) detectors such as LIGO, Virgo and KAGRA (LVK), we ask what the merger rates of compact binaries in LVK tell us about the fraction of LRNe that lead to the formation of compact binaries that merge in Hubble time. Using the observed volumetric rates of LRNe from the Zwicky Transient Facility (ZTF) and of compact binary mergers from LVK observations, we derive limits on the fraction of LRNe that produce compact binaries that merge in Hubble time. Assuming the LRNe rate closely follows the star formation rate at any redshift, we use the delay time distribution models for compact binaries to compute the compact binary merger rate. A comparison of this merger rate with the latest volumetric rates of compact binary mergers from the fourth GW transient catalog (GWTC-4) at the present epoch of LVK allows us to constrain the above fraction. We find that only a fraction as small as $\\sim 10^{-3}$ (median) of the LRNe correspond to the GW-observed binary neutron star (BNS) and neutron star-black hole (NSBH) mergers. This potentially implies that the majority of the LRNe population will not lead to mergers of compact objects, but other end products, such as stellar mergers.",
      "pdf_url": "https://arxiv.org/pdf/2511.19243.pdf",
      "published": "2025-11-26T01:31:28.542295",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.18008",
      "title": "Outbursts in ultra-compact AM CVn binaries",
      "authors": [
        "Gavin Ramsay"
      ],
      "abstract": "Outbursts in ultra-compact AM CVn binaries Gavin Ramsay (Armagh Observatory and Planetarium) To be published in Proceedings of Science, 87th Fujihara Seminar: The 50th Anniversary Workshop of the Disk Instability Model in Compact Binary Stars Solar and Stellar Astrophysics (astro-ph.SR) AM CVn binaries are the most compact of accreting binaries having orbital periods in the range ~5-70 min. They consist of a white dwarf accreting hydrogen deficient material from a degenerate or semi-degenerate star and are predicted to be amongst the verification sources for future gravitational wave observatories such as LISA. Using the recent catalogue of Green et al (2025) I focus attention on the orbital period range in which outbursts are seen from AM CVn's. I examine in more detail the outburst properties of KL Dra which has an outburst every few months and has many sectors of TESS data as an open resource. Using observational data on the outbursting systems in general, I compare the outburst recurrence time, duration and amplitude as a function of orbital period with the predictions of the disc instability model. The recurrence time is well described, although there is some evidence that the amount of material in the disc at the end of the quiescence phase is less than earlier model assumptions. The distribution of the outburst duration appears to be dependent on the cadence of the observations and how it is defined. Similarly the amplitude distribution is dependent on cadence and the filter, which causes an apparent spread in distribution. Both of these features need to be systematically studied using consistent benchmarks. AM CVn binaries remain an excellent sources to test models which aim to predict the properties of disc accreting systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.18008.pdf",
      "published": "2025-11-26T01:31:28.983922",
      "updated": null,
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.09107",
      "title": "Detection of Lensed Gravitational Waves from dark matter halos with deep learning",
      "authors": [
        "Mengfei Sun",
        "Jie Wu",
        "Jin Li",
        "Nan Yang",
        "Xianghe Ma",
        "Borui Wang",
        "Minghui Zhang",
        "Yuanhong Zhong"
      ],
      "abstract": "Detection of Lensed Gravitational Waves from dark matter halos with deep learning Mengfei Sun, Jie Wu, Jin Li, Nan Yang, Xianghe Ma, Borui Wang, Minghui Zhang, Yuanhong Zhong Instrumentation and Methods for Astrophysics (astro-ph.IM) Lensed gravitational waves (GWs) provide a new window into the study of dark matter substructures, yet the faint interference signatures they produce are buried in detector noise. To address this challenge, we develop a deep learning framework based on a residual one-dimensional convolutional neural network for lensed GW identification under multiband observations. The model directly processes multiband waveforms from binary neutron star systems, covering the early inspiral observed by the DECi-hertz Interferometer Gravitational wave Observatory (DECIGO) and the late inspiral observed by the Einstein Telescope (ET), corresponding approximately to the wave-optics and geometrical-optics regimes, respectively. It enables end-to-end classification of five classes: pure noise, unlensed GWs, and three representative lensed GWs corresponding to singular isothermal sphere (SIS), cored isothermal sphere (CIS), and Navarro-Frenk-White (NFW) profiles. A dataset of 10^6 simulated samples was constructed with signal-to-noise ratios (SNR) ranging from 5 to 100. The deep learning model with multiband observations achieves an accuracy of 97.0% and a macro-averaged F1 score of 0.97, significantly exceeding the single-detector performance, where DECIGO and ET reach 72.8% and 62.3%, respectively. Even in the low-SNR regime (SNR < 20), the model maintains an accuracy above 63%, while in the high-SNR regime (SNR > 80), its accuracy approaches 99.8%. These results demonstrate that multiband GW observations effectively enhance the detection of lensed GWs within complex noise environments, providing a robust and efficient pathway for the automated identification of lensed GWs in future multiband observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.09107.pdf",
      "published": "2025-11-26T01:31:29.091774",
      "updated": null,
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.26739",
      "title": "Wavefront Curvature and Transverse Atomic Motion in Time-Resolved Atom Interferometry: Impact and Mitigation",
      "authors": [
        "Noam Mouelle",
        "Jeremiah Mitchell",
        "Valerie Gibson",
        "Ulrich Schneider"
      ],
      "abstract": "Wavefront Curvature and Transverse Atomic Motion in Time-Resolved Atom Interferometry: Impact and Mitigation Noam Mouelle, Jeremiah Mitchell, Valerie Gibson, Ulrich Schneider Atomic Physics (physics.atom-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Quantum Gases (cond-mat.quant-gas); High Energy Physics - Experiment (hep-ex); Quantum Physics (quant-ph) Time-resolved atom interferometry, as employed in applications such as gravitational wave detection and searches for ultra-light dark matter, requires precise control over systematic effects. In this work, we investigate phase noise arising from shot-to-shot fluctuations in the atoms' transverse motion in the presence of the wavefront curvature of the interferometer beam, and analyse its dependence on the laser-beam geometry in long-baseline, large-momentum-transfer atom interferometers. We use a semi-classical framework to derive analytical expressions for the effective phase perturbation in position-averaged measurements and validate them using Monte Carlo simulations. Applied to 100-m and 1-km atom gradiometers representative of next-generation experiments, the model shows that configurations maximizing pulse efficiency also amplify curvature-induced phase noise, requiring micron-level control of the atom cloud's centre-of-mass position and sub-micron-per-second control of its centre-of-mass velocity to achieve sub-$10^{-5}$ rad phase stability. Alternative beam geometries can suppress this noise by up to two orders of magnitude, but at the cost of reduced pulse efficiency. To address this limitation, we propose a mitigation strategy based on position-resolved phase-shift readout, which empirically learns and corrects the wavefront-induced bias from measurable quantities such as the phase-shift gradient and final cloud position. This approach restores high-sensitivity operation in the maximum-pulse-efficiency configuration without detailed beam characterisation, providing a practical route towards next-generation, time-resolved atom interferometers operating at the $10^{-5}$ rad noise level.",
      "pdf_url": "https://arxiv.org/pdf/2510.26739.pdf",
      "published": "2025-11-26T01:31:29.094462",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "hep-ex",
        "quant-ph"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}