{
  "date": "2026-01-15",
  "crawl_timestamp": "2026-01-15T01:32:12.498061",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 160,
    "total_gw_papers": 21,
    "by_category": {
      "gr-qc": {
        "total": 30,
        "gw_related": 9
      },
      "astro-ph": {
        "total": 110,
        "gw_related": 10
      }
    }
  },
  "crawl_verification": {
    "total_expected": 228,
    "total_actual": 228,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 51,
        "actual_crawled": 51,
        "page_source_info": "Total of 51 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 31,
        "actual_crawled": 31,
        "page_source_info": "Total of 31 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 38,
        "actual_crawled": 38,
        "page_source_info": "Total of 38 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 57,
        "actual_crawled": 57,
        "page_source_info": "Total of 57 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 17,
        "actual_crawled": 17,
        "page_source_info": "Total of 17 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 15,
        "actual_crawled": 15,
        "page_source_info": "Total of 15 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.07908",
      "title": "Signatures of a subpopulation of hierarchical mergers in the GWTC-4 gravitational-wave dataset",
      "authors": [
        "Cailin Plunkett",
        "Thomas Callister",
        "Michael Zevin",
        "Salvatore Vitale"
      ],
      "abstract": "Signatures of a subpopulation of hierarchical mergers in the GWTC-4 gravitational-wave dataset Cailin Plunkett, Thomas Callister, Michael Zevin, Salvatore Vitale 5 pages + 3 supplemental pages, 3 figures + 3 in supplemental material General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Repeated black-hole mergers in dense stellar clusters are a plausible mechanism to populate the predicted gap in black hole masses due to the pair-instability process. These hierarchical mergers carry distinct spin and tilt features relative to first-generation black holes, for which previous studies have found evidence at a population level by interpreting features in the effective inspiral spin domain. We introduce an astrophysically-motivated model in the joint space of effective inspiral and precessing spins, which captures the dominant spin dynamics expected for hierarchical mergers. We find decisive evidence both for a population transition above $\\sim 45M_\\odot$, consistent with the anticipated onset of the pair-instability gap, as well as a peak at $\\sim 15 M_\\odot$, which we interpret as the global peak in the hierarchical merger rate. The existence of low- and high-mass subpopulations of higher-generation black holes suggests the contribution of both near-solar-metallicity and metal-poor star clusters to the hierarchical merger population. Our results reinforce the growing evidence for detailed, mass-dependent substructure in the spin distribution of the binary black hole population.",
      "pdf_url": "https://arxiv.org/pdf/2601.07908.pdf",
      "published": "2026-01-15T01:32:11.606188",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.07931",
      "title": "General gravitational properties of neutron stars: curvature invariants, binding energy, and trace anomaly",
      "authors": [
        "Iván Garibay",
        "Christian Ecker",
        "Luciano Rezzolla"
      ],
      "abstract": "General gravitational properties of neutron stars: curvature invariants, binding energy, and trace anomaly Iván Garibay, Christian Ecker, Luciano Rezzolla 10 pages, 8 figures, submitted to PRD General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) We investigate the behavior of curvature invariants for a large ensemble of neutron stars built with equations of state (EOSs) that satisfy constraints from nuclear theory and perturbative QCD, as well as measurements of neutron-star masses, radii, and gravitational waves from binary neutron-star mergers. Surprisingly, our analysis reveals that stars with negative Ricci scalar $\\mathcal{R}$ are rather common and about $\\sim 50\\%$ of our EOSs produce one or more stars with Ricci curvature that is negative somewhere inside the star. The negative curvature is found mostly but not exclusively at the highest densities and pressures, and predominantly for stiff EOSs and for the most compact and most massive stars. Furthermore, we improve the quasi-universal relation between the stellar gravitational mass $M$ and the baryonic mass $M_\\mathrm{b}$, which allows us to express analytically one in terms of the other with a maximum variance of only $\\sim 3\\%$. Finally, using the relation between the Ricci scalar and the trace anomaly $\\Delta$, we determine the conditions under which $\\Delta$ vanishes or becomes negative in neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2601.07931.pdf",
      "published": "2026-01-15T01:32:11.606393",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08252",
      "title": "Resumming Scattering Amplitudes for Waveforms",
      "authors": [
        "Katsuki Aoki",
        "Andrea Cristofoli"
      ],
      "abstract": "Resumming Scattering Amplitudes for Waveforms Katsuki Aoki, Andrea Cristofoli High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc) We develop a formalism to compute non-perturbative 5-point scattering amplitudes and apply it to gravitational waveforms in the two-body problem for arbitrary trajectories. Drawing inspiration from Feshbach's projector formalism in nuclear physics, we introduce effective potentials governing graviton emission and relate them to perturbative scattering amplitudes at arbitrary order in the gravitational coupling and mass ratio. Once these potentials are determined, the corresponding non-perturbative amplitudes in the classical limit are obtained by iterative insertions and subsequently translated into gravitational waveforms using the KMOC formalism. As an application, we compute the gravitational waveform emitted by a two-body system moving along a generic, potentially highly bent, trajectory. Importantly, our formalism extends effective field theory matching of the gravitational two-body potential to radiative phenomena, enabling the extraction of gravitational-wave source terms directly from perturbative on-shell scattering amplitudes.",
      "pdf_url": "https://arxiv.org/pdf/2601.08252.pdf",
      "published": "2026-01-15T01:32:11.609811",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-th",
        "cross_list_from": "hep-th"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08675",
      "title": "One-Loop Tensor Power Spectrum from a Non-Minimally Coupled Spectator Field during Inflation",
      "authors": [
        "Zhe Li",
        "Chen Yuan",
        "Qing-Guo Huang"
      ],
      "abstract": "One-Loop Tensor Power Spectrum from a Non-Minimally Coupled Spectator Field during Inflation Zhe Li, Chen Yuan, Qing-Guo Huang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We compute the full one-loop corrections to the primordial tensor power spectrum in an inflationary scenario with a non-minimally coupled spectator field, using the in-in formalism. We derive semi-analytic results for the scalar-sourced one-loop tensor spectrum and the effective tensor-to-scalar ratio, $r_{\\mathrm{eff}}$ . We consider two representative coupling functions: a localized Gaussian dip (Model G), which leads to moderate loop corrections, and a rapidly oscillatory coupling (Model O), which can yield much larger loop contributions. For Model G, we find a $\\mathcal{O}(1)$ correction to $r_{\\mathrm{eff}}$ while Model O can significantly enhance $r_{\\mathrm{eff}}$ by several orders of magnitude (relative to the tree-level value). We further calculate the energy density of primordial gravitational waves. Assuming that primordial black holes with mass $10^{-12}M_{\\odot}$ generated in this scenario, constitute all of the dark matter, we find that the results are several orders of magnitude lower than the sensitivities of Taiji/TianQin/LISA.",
      "pdf_url": "https://arxiv.org/pdf/2601.08675.pdf",
      "published": "2026-01-15T01:32:11.610431",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2309.14473",
      "title": "Analysis of GWTC-3 with fully precessing numerical relativity surrogate models",
      "authors": [
        "Tousif Islam",
        "Avi Vajpeyi",
        "Feroz H. Shaik",
        "Carl-Johan Haster",
        "Vijay Varma",
        "Scott E. Field",
        "Jacob Lange",
        "Richard O'Shaughnessy",
        "Rory Smith"
      ],
      "abstract": "Analysis of GWTC-3 with fully precessing numerical relativity surrogate models Tousif Islam, Avi Vajpeyi, Feroz H. Shaik, Carl-Johan Haster, Vijay Varma, Scott E. Field, Jacob Lange, Richard O'Shaughnessy, Rory Smith Posteriors and animations are made publicly available at this https URL Phys. Rev. D 112, 044001 - Published 1 August, 2025 General Relativity and Quantum Cosmology (gr-qc) The third Gravitational-Wave Transient Catalog (GWTC-3) contains 90 binary coalescence candidates detected by the LIGO-Virgo-KAGRA Collaboration (LVK). We provide a re-analysis of binary black hole (BBH) events using a recently developed numerical relativity (NR) waveform surrogate model, NRSur7dq4, that includes all $\\ell \\leq 4$ spin-weighted spherical harmonic modes as well as the complete physical effects of precession. Properties of the remnant black holes' (BH's) mass, spin vector, and kick vector are found using an associated remnant surrogate model NRSur7dq4Remnant. Both NRSur7dq4 and NRSur7dq4Remnant models have errors comparable to numerical relativity simulations and allow for high-accuracy parameter estimates. We restrict our analysis to 47 BBH events that fall within the regime of validity of NRSur7dq4 (mass ratios greater than 1/6 and total masses greater than $60 M_{\\odot}$). While for most of these events our results match the LVK analyses that were obtained using the semi-analytical models such as IMRPhenomXPHM and SEOBNRv4PHM, we find that for more than 20\\% of events the NRSur7dq4 model recovers noticeably different measurements of black hole properties like the masses and spins, as well as extrinsic properties like the binary inclination and distance. For instance, GW150914_095045 exhibits noticeable differences in spin precession and spin magnitude measurements. Other notable findings include one event (GW191109_010717) that constrains the effective spin $\\chi_{eff}$ to be negative at a 99.3\\% credible level and two events (GW191109_010717 and GW200129_065458) with well-constrained kick velocities. Furthermore, compared to the models used in the LVK analyses, NRSur7dq4 recovers a larger signal-to-noise ratio and/or Bayes factors for several events.",
      "pdf_url": "https://arxiv.org/pdf/2309.14473.pdf",
      "published": "2026-01-15T01:32:11.610682",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2402.03984",
      "title": "Angular correlation and deformed Hellings-Downs curve from spin-2 ultralight dark matter",
      "authors": [
        "Rong-Gen Cai",
        "Jing-Rui Zhang",
        "Yun-Long Zhang"
      ],
      "abstract": "Angular correlation and deformed Hellings-Downs curve from spin-2 ultralight dark matter Rong-Gen Cai, Jing-Rui Zhang, Yun-Long Zhang 8 pages, 4 figures. v2: matching version published in PRD Physical Review D 110, 044052 (2024) General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The pulsar timings are sensitive to both the nanohertz gravitational-wave background and the oscillation of ultralight dark matter. The Hellings-Downs angular correlation curve provides a criterion to search for stochastic gravitational-wave backgrounds at nanohertz via pulsar timing arrays. We study the angular correlation of the timing residuals induced by the spin-2 ultralight dark matter, which is different from the usual Hellings-Downs correlation. At a typical frequency, we show that the spin-2 ultralight dark matter can give rise to the deformation of the Hellings-Downs correlation curve induced by the stochastic gravitational wave background.",
      "pdf_url": "https://arxiv.org/pdf/2402.03984.pdf",
      "published": "2026-01-15T01:32:11.610860",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2407.04682",
      "title": "Phenomenology and origin of late-time tails in eccentric binary black hole mergers",
      "authors": [
        "Tousif Islam",
        "Guglielmo Faggioli",
        "Gaurav Khanna",
        "Scott E. Field",
        "Maarten van de Meent",
        "Alessandra Buonanno"
      ],
      "abstract": "Phenomenology and origin of late-time tails in eccentric binary black hole mergers Tousif Islam, Guglielmo Faggioli, Gaurav Khanna, Scott E. Field, Maarten van de Meent, Alessandra Buonanno Phys. Rev. D 112, 024061 - Published 28 July, 2025 General Relativity and Quantum Cosmology (gr-qc) We investigate the late-time tail behavior in gravitational waves from merging eccentric binary black holes (BBH) using black hole perturbation theory. For simplicity, we focus only on the dominant quadrupolar mode of the radiation. We demonstrate that such tails become more prominent as eccentricity increases. Exploring the phenomenology of the tails in both spinning and non-spinning eccentric binaries, with the spin magnitude varying from $\\chi=-0.6$ to $\\chi=+0.6$ and eccentricity as high as $e=0.98$, we find that these tails can be well approximated by a slowly decaying power law. We study the power law for varying systems and find that the power law exponent lies close to the theoretically expected value $-4$. Finally, using both plunge geodesic and radiation-reaction-driven orbits, we perform a series of numerical experiments to understand the origin of the tails in BBH simulations. Our results suggest that the late-time tails are strongly excited in eccentric BBH systems when the smaller black hole is in the neighborhood of the apocenter, as opposed to any structure in the strong field of the larger black hole. Our analysis framework is publicly available through the \\texttt{gwtails} Python package.",
      "pdf_url": "https://arxiv.org/pdf/2407.04682.pdf",
      "published": "2026-01-15T01:32:11.611068",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2412.08852",
      "title": "Scalar perturbations on the normal and self-accelerating branch of a DGP brane and $σ_8$",
      "authors": [
        "Maribel Hernández-Márquez",
        "Celia Escamilla-Rivera"
      ],
      "abstract": "Scalar perturbations on the normal and self-accelerating branch of a DGP brane and $σ_8$ Maribel Hernández-Márquez, Celia Escamilla-Rivera General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work we constrain the value of $\\sigma_8$ for the normal and self-accelerating branch of a DGP brane embedded in a five-dimensional Minkowski space-time. For that purpose we first constrain the model parameters $H_0$, $\\Omega_{m0}$, $\\Omega_{r0}$ and $M$ by means of the Pantheon+ catalog and a mock catalog of gravitational waves. Then, we solve numerically the equation for dark matter scalar perturbations using the dynamical scaling solution for the master equation and assuming that $p=4$ for the matter dominated era. Finally, we found that the evolution of matter density perturbations in both branches is different from the $\\Lambda$CDM model and that the value of $\\sigma_8=0.774\\pm0.027$ for the normal branch and $\\sigma_8=0.913\\pm0.032$ for the self-accelerating branch.",
      "pdf_url": "https://arxiv.org/pdf/2412.08852.pdf",
      "published": "2026-01-15T01:32:11.611249",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2503.16649",
      "title": "Extreme mass ratio inspirals in dark matter halos: dynamics and distinguishability of halo models",
      "authors": [
        "Sara Gliorio",
        "Emanuele Berti",
        "Andrea Maselli",
        "Nicholas Speeney"
      ],
      "abstract": "Extreme mass ratio inspirals in dark matter halos: dynamics and distinguishability of halo models Sara Gliorio, Emanuele Berti, Andrea Maselli, Nicholas Speeney 12 pages, 8 figures. Discussion of results improved. Typos corrected to match the version published on Phys. Rev. D General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) The gravitational wave (GW) signals from extreme mass-ratio inspirals (EMRIs), a key target for the Laser Interferometer Space Antenna (LISA), will be affected in the presence of dark matter (DM) halos. In this paper we explore whether the effects of DM are detectable by LISA within a fully relativistic framework. We model the massive EMRI component as a nonrotating black hole (BH) surrounded by a DM halo. We compute axial and polar GW fluxes for circular orbits at linear order in the mass ratio for DM density profiles with varying mass and compactness. By comparing the phase evolution with vacuum systems, we find that DM halos can induce dephasings of tens to hundreds of radians over a one-year observation period. We demonstrate that even highly diluted DM distributions can significantly affect the emitted waveforms, and that the resulting GW signals can usually be distinguished from each other. While it is important to generalize these findings to more generic orbits and to spinning BHs, our results suggest that LISA could not only reveal the presence of DM halos, but also discriminate between different halo models.",
      "pdf_url": "https://arxiv.org/pdf/2503.16649.pdf",
      "published": "2026-01-15T01:32:11.611622",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.16762",
      "title": "Globally defined Carroll symmetry of gravitational waves",
      "authors": [
        "Mahmut Elbistan",
        "Peng-Ming Zhang",
        "Peter Horvathy"
      ],
      "abstract": "Globally defined Carroll symmetry of gravitational waves Mahmut Elbistan, Peng-Ming Zhang, Peter Horvathy Extended version. 22 pages, 11 figures. Further explanations and several new references added General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph) The local Carroll symmetry of a gravitational wave found in Baldwin-Jeffery-Rosen coordinates is extended to a globally defined one by switching to Brinkmann coordinates. Two independent globally defined solutions of a Sturm-Liouville equation allow us to describe both the symmetries (translations and Carroll boosts) and the geodesic motions. One of them satisfies particular initial conditions which imply zero initial momentum, while the other does not. Pure displacement arises when the latter is turned off by requiring the momentum to vanish and when the wave parameters take, in addition, some particular values which correspond to having an integer half-wave number. The relation to the Schwarzian derivative is highlighted. We illustrate our general statements by the Pöschl-Teller profile.",
      "pdf_url": "https://arxiv.org/pdf/2510.16762.pdf",
      "published": "2026-01-15T01:32:11.612355",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th",
        "math-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.04593",
      "title": "From Source Properties to Strong-Field Tests: a multipronged analysis of GW250114 with an effective one-body model for generic orbits",
      "authors": [
        "Koustav Chandra",
        "Rossella Gamba",
        "Danilo Chiaramello"
      ],
      "abstract": "From Source Properties to Strong-Field Tests: a multipronged analysis of GW250114 with an effective one-body model for generic orbits Koustav Chandra, Rossella Gamba, Danilo Chiaramello General Relativity and Quantum Cosmology (gr-qc) We present a detailed analysis of GW250114, the loudest gravitational-wave signal observed to date, using a waveform model capable of describing binary black holes in generic (eccentric and precessing) orbits. Our analysis builds on LIGO-Virgo-KAGRA (LVK)'s results, finding that the source is consistent at a probability of $\\geq 96\\%$ with the merger of two first-generation, nearly equal-mass, low-spin black holes, forming a remnant within the pair-instability mass gap. The signal's high signal-to-noise ratio ($\\gtrsim 75$) enables the detection of the subdominant $(4,\\pm4)$ multipoles, whose presence we confirm with higher evidence than previously reported by the LVK. Restricting the analysis even to post-peak data yields $\\log_{10}B\\gtrsim 1$ in favor of models including the $(4,\\pm4)$ mode, demonstrating that this contribution remains detectable well into the post-merger phase. We further perform three independent tests of general relativity, complementary to those performed by the LVK: a modified residual analysis confirms that our semi-analytical model fully describes the signal without detectable discrepancies; a subdominant mode test finds that the amplitude of the $(4,\\pm4)$ multipoles agrees with general-relativistic expectations; and a parameterised analysis of the plunge-merger-ringdown regime recovers the GR expectation within the 50\\% credible region for the remnant mass and spin, and within the 90\\% interval for the $(2,\\pm2)$ peak amplitude. Collectively, these results reinforce GW250114 as a landmark event for a precision test of gravity.",
      "pdf_url": "https://arxiv.org/pdf/2512.04593.pdf",
      "published": "2026-01-15T01:32:11.613041",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.10607",
      "title": "Bias in the tensor-to-scalar ratio from self-interacting dark radiation",
      "authors": [
        "Nahuel Mirón-Granese",
        "Claudia G. Scóccola"
      ],
      "abstract": "Bias in the tensor-to-scalar ratio from self-interacting dark radiation Nahuel Mirón-Granese, Claudia G. Scóccola 10 pages, 5 figures, minor changes, matches published version Phys. Rev. D 112, 123516 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We investigate the cosmological imprint of self-interacting dark radiation (DR) on the primordial $B$-mode angular power spectrum and its impact on the estimation of the tensor-to-scalar ratio $r$. We consider a minimal model in which DR is described as an effectively massless axion-like particle with quartic self-interactions. These interactions are incorporated into the Einstein-Boltzmann equations using the relaxation time approximation and implemented in the $\\texttt{CLASS}$ code. We show that increasing the strength of DR self-interactions suppresses anisotropic stress, thereby reducing the damping of gravitational waves and leading to an enhancement of the primordial $B$-mode signal relative to the free-streaming case. Using mock CMB data and Markov Chain Monte Carlo analyses, we show that neglecting DR self-interactions may bias the inferred value of $r$ by an amount comparable to the uncertainty expected in forthcoming CMB polarization experiments, such as the ground-based $\\textit{Simons Observatory}$ and the satellite missions $\\textit{LiteBIRD}$ and PICO. Our results emphasize the importance of properly modeling DR interactions in future precision searches for primordial $B$-modes in order to obtain unbiased constraints on inflationary gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2509.10607.pdf",
      "published": "2026-01-15T01:32:11.614490",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.08685",
      "title": "Hydrodynamic models of reheating",
      "authors": [
        "Juan Pablo Elía",
        "Lucas Cantarutti",
        "Nahuel Mirón-Granese",
        "Esteban Calzetta"
      ],
      "abstract": "Hydrodynamic models of reheating Juan Pablo Elía, Lucas Cantarutti, Nahuel Mirón-Granese, Esteban Calzetta 21 pages, 5 figures; enlarged Appendix A; updated references; accepted for publication in PRD High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We develop a causal hydrodynamic model that provides an effective macroscopic description of the field-theoretic dynamics during the early stages of reheating. The inflaton condensate is treated as a homogeneous background coupled to a relativistic fluid that represents its inhomogeneous fluctuations. Within the divergence-type theory framework derived from kinetic considerations, the model captures essential dissipative and non-equilibrium effects while remaining stable and causal. We find that the coupling between the oscillating condensate and the fluid induces a parametric resonance in the tensor sector, leading to the amplification of the viscous stress tensor and the generation of gravitational waves with a characteristic spectral peak. The predicted spectrum agrees with lattice simulations performed with CosmoLattice. This hydrodynamic approach offers an effective bridge between microscopic field dynamics and macroscopic cosmological observables.",
      "pdf_url": "https://arxiv.org/pdf/2510.08685.pdf",
      "published": "2026-01-15T01:32:11.614674",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.15028",
      "title": "Impact of Neutrino Flavor Conversions on Neutron Star Merger Dynamics, Ejecta, Nucleosynthesis, and Multi-Messenger Signals",
      "authors": [
        "Yi Qiu",
        "David Radice",
        "Sherwood Richers",
        "Federico Maria Guercilena",
        "Albino Perego",
        "Maitraya Bhattacharyya"
      ],
      "abstract": "Impact of Neutrino Flavor Conversions on Neutron Star Merger Dynamics, Ejecta, Nucleosynthesis, and Multi-Messenger Signals Yi Qiu, David Radice, Sherwood Richers, Federico Maria Guercilena, Albino Perego, Maitraya Bhattacharyya 19 pages, 13 figures, published on Physical Review D Phys.Rev.D 112 (2025) 12, 123039 High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We present numerical relativity simulations of binary neutron star mergers incorporating neutrino flavor transformations triggered by fast flavor instability, quantum many-body effects, or potential beyond standard model physics. In both long-lived and short-lived remnant scenarios, neutrino flavor conversions modify species-dependent neutrino luminosities and mean energies, and drive the matter towards more neutron rich conditions. They produce up to $300\\%$ more neutron rich ejecta and significantly boost the r-process yields, especially in low-density, near-equatorial outflows. We identify regions unstable to fast flavor instabilities and find that these instabilities persist despite flavor conversions. We further test the sensitivity to the equilibration timescale of the flavor conversions, finding that slower flavor conversions can interact with thermodynamic equilibration, and increase the neutron richness of the ejecta. Flavor conversions may also contribute to stronger gravitational wave and neutrino emissions, pointing to a correlation between neutrino transport and merger dynamics. These results highlight the potential impact of flavor conversions while motivating future work to improve on theoretical understanding of flavor instabilities in global simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.15028.pdf",
      "published": "2026-01-15T01:32:11.614889",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08524",
      "title": "Revisiting the Great Attractor: The Local Group's streamline trajectory, cosmic velocity and dynamical fate",
      "authors": [
        "Richard Stiskalek",
        "Harry Desmond",
        "Stuart McAlpine",
        "Guilhem Lavaux",
        "Jens Jasche",
        "Michael J. Hudson"
      ],
      "abstract": "Revisiting the Great Attractor: The Local Group's streamline trajectory, cosmic velocity and dynamical fate Richard Stiskalek, Harry Desmond, Stuart McAlpine, Guilhem Lavaux, Jens Jasche, Michael J. Hudson 13 pages, 8 figures. To be submitted to OJA Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We revisit the Great Attractor using the Manticore-Local suite of digital twins of the nearby Universe. The Great Attractor concept has been proposed as an answer to three distinct questions: what sources the Local Group velocity in the cosmic microwave background frame, where present-day velocity streamlines converge, and where the Local Group is moving to. Addressing the original motivation of the Great Attractor -- explaining the Local Group cosmic velocity -- we find that mass within $155~h^{-1}\\mathrm{Mpc}$ accounts for only ${\\sim}72\\%$ of that velocity magnitude with ${\\sim}38\\,°$ directional offset. We show that even in the purely linear regime convergence within this volume is not guaranteed, particularly when also accounting for small-scale contributions to the observer velocity; no single structure, including the proposed Great Attractor, would be expected to dominate the velocity budget. Streamline convergence is smoothing-scale-dependent, transitioning from Virgo at small scales through the Hydra--Centaurus region at intermediate scales to Shapley at large scales; at intermediate smoothing the convergence point lies near Abell 3565 with an asymmetric basin of mass $\\log( M / (h^{-1} \\mathrm{M}_\\odot)) = 16.4 \\pm 0.1$ that excludes Norma. To address the third question, we evolve the Manticore-Local realisations to scale factor $a = 10$ in a new Beyond-Present-Time simulation suite and identify the asymptotic future location of the Local Group. We find that the dominant motion is towards Virgo, but even it contributes at most one third of the Local Group velocity. Our results demonstrate that the classical Great Attractor is not a dynamically dominant structure but an artifact of the instantaneous velocity field, and that no single attractor is likely to account for the Local Group motion in the cosmic rest frame.",
      "pdf_url": "https://arxiv.org/pdf/2601.08524.pdf",
      "published": "2026-01-15T01:32:11.701137",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08622",
      "title": "Primordial Gravitational Waves from Scalar Backreaction in Axion-SU(2) Inflation",
      "authors": [
        "Mattia Cielo",
        "Matteo Fasiello",
        "Alexandros Papageorgiou"
      ],
      "abstract": "Primordial Gravitational Waves from Scalar Backreaction in Axion-SU(2) Inflation Mattia Cielo, Matteo Fasiello, Alexandros Papageorgiou Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) In this work, we perform the first numerical study of strong scalar backreaction in spectator chromo-natural inflation (SCNI) in the case where the spectator sector decays during inflation. The tachyonic instability in scalar fluctuations, activated as the system crosses the $m_Q = \\sqrt{2}$ threshold, amplifies perturbations and may significantly alter the background dynamics. The strong scalar backreaction regime introduces an effective quartic term in the potential for the gauge field background that rapidly drives it to zero, accelerating the axion-gauge system decay. We describe the dynamics of such decay and derive the gravitational wave spectrum for a set of benchmark parameters. Interestingly, the signal may peak at interferometer scales and lie within LISA's projected sensitivity.",
      "pdf_url": "https://arxiv.org/pdf/2601.08622.pdf",
      "published": "2026-01-15T01:32:11.701503",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08714",
      "title": "Evolution and afterglow emission of gamma-ray burst jets from binary neutron star mergers",
      "authors": [
        "Emma Dreas",
        "Om Sharan Salafia",
        "Andrea Pavan",
        "Riccardo Ciolfi",
        "Annalisa Celotti"
      ],
      "abstract": "Evolution and afterglow emission of gamma-ray burst jets from binary neutron star mergers Emma Dreas, Om Sharan Salafia, Andrea Pavan, Riccardo Ciolfi, Annalisa Celotti 17 pages, 17 figures, 2 tables, submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Relativistic jets launched in binary neutron star (BNS) mergers are widely accepted as the engines powering most of the population of short gamma-ray bursts (GRBs). Understanding their structure and dynamics-particularly during and after breakout from the merger ejecta-is crucial for interpreting GRB afterglows, especially for off-axis observers. Traditional models often assume simple angular or radial jet profiles, potentially missing key features emerging for jets piercing through realistic environments. This work aims to investigate the formation and evolution of the jet structure as it propagates through a non-homogeneous, anisotropic BNS merger environment. We focus on how the interaction with the ambient medium shapes the jet's angular and velocity distributions and assess the impact of this realistic structure on the resulting afterglow light curves. We perform a series of 3D relativistic magnetohydrodynamic simulations of jets launched in post-merger environments, exploring different injection conditions. Simulations are evolved to late times, approaching the ballistic regime, where further dynamical evolution becomes negligible. From the resulting outflows, we extract energy and velocity profiles and compute multi-wavelength afterglow light curves using a semi-analytic model that includes radial stratification and the full 3D jet geometry. More energetic or earlier-launched jets drill more efficiently through the ejecta, but all develop asymmetries that leave clear imprints in the off-axis afterglow light curves. All models exhibit a complex multi-shock breakout structure responsible for an early, dimmer peak in the afterglow. Despite structural differences, all simulated jets are consistent with the observational data of the multi-messenger BNS merger event GW170817.",
      "pdf_url": "https://arxiv.org/pdf/2601.08714.pdf",
      "published": "2026-01-15T01:32:11.830858",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08080",
      "title": "Long Term (250 years) Hydrodynamical Simulation of the Supermassive Black Hole Binary OJ287",
      "authors": [
        "Ariel Chitan",
        "Sarah C. Gallagher",
        "Shahram Abbassi"
      ],
      "abstract": "Long Term (250 years) Hydrodynamical Simulation of the Supermassive Black Hole Binary OJ287 Ariel Chitan, Sarah C. Gallagher, Shahram Abbassi 19 pages, 12 figures. Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) With upcoming facilities capable of detecting photometric and gravitational wave signals from supermassive black hole (SMBH) binaries, studying their long-term accretion-driven variability is timely. OJ287 is a bright, nearby ($z=0.3$), and well-studied candidate for a SMBH binary. As such, it is an excellent case study for how binary dynamics could influence observed active galactic nucleus (AGN) photometric variability. We present 3D hydrodynamic simulations of OJ287, using the code PHANTOM. We simulate two mass ratios: (i) M$_1$ $=$ 1.835$\\times$10$^{10}$ M$_\\odot$ with M$_2$ $=$ 1.4$\\times$10$^{8}$ M$_\\odot$, (ii) M$_1\\approx$ M$_2$ ($\\sim10^{8}$ M$_\\odot$) along and (iii) control of a single SMBH and accretion disc. We find that the simulation with masses 1.835$\\times$10$^{10}$ M$_\\odot$ and 1.4$\\times$10$^{8}$ M$_\\odot$ evolves consistently with the most currently accepted model of OJ287 as a precessing SMBH binary. The secondary's impacts with the disc result in the formation of spiral density waves and a corresponding $\\sim$10-20% increases in the mass accretion rate of the primary SMBH. The impact timings and the mass accretion rate spikes show quasi-periodic variability as a result of the precession of the secondary's orbit with intervals between impacts ranging from $\\sim$ 1 year to $\\sim$ 10 years. In the near-equal mass case, the disc of the primary becomes tidally disrupted after $\\sim$ 2 years. Consequently, the near-equal mass system with a period of 12 years is not a viable candidate for OJ287. This modeling provides insights into the potential signatures of SMBH binaries by both gravitational wave observatories and the Rubin Legacy Survey of Space and Time.",
      "pdf_url": "https://arxiv.org/pdf/2601.08080.pdf",
      "published": "2026-01-15T01:32:11.853060",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.GA",
        "cross_list_from": "astro-ph.GA"
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.00194",
      "title": "Bayesian Inference of Hybrid Star Properties from Future High-Precision Measurements of Their Radii",
      "authors": [
        "Bao-An Li",
        "Xavier Grundler",
        "Wen-Jie Xie",
        "Nai-Bo Zhang"
      ],
      "abstract": "Bayesian Inference of Hybrid Star Properties from Future High-Precision Measurements of Their Radii Bao-An Li, Xavier Grundler, Wen-Jie Xie, Nai-Bo Zhang Version accepted for publication by APJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph); Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th) Future high-precision X-ray and gravitational-wave observations of neutron stars (NSs) are expected to constrain NS radii with uncertainties as small as $\\sigma \\simeq 0.1$~km. Such unprecedented precision offers a unique opportunity to extract new information about the nature and equation of state (EOS) of supradense matter in NS cores. Using mock radius data with uncertainties ranging from $\\sigma = 1.0$ to $0.1$~km, together with a flexible meta-model NS EOS that allows for a first-order hadron-quark phase transition, we perform a Bayesian statistical analysis to assess the impact of radius measurements on EOS constraints. We find that high-precision radius measurements, particularly for massive NSs, significantly tighten constraints on the hadron-quark transition density $\\rho_t$, the quark matter mass fraction in NS cores, and several parameters characterizing the EOS of supranuclear hadronic matter, although the degree of improvement depends on the assumed prior range of $\\rho_t$. In contrast, even with the highest precision considered, NS radii -- including those of massive stars -- remain largely insensitive to the stiffness of quark matter, independent of the measurement accuracy or the prior range adopted for $\\rho_t$.",
      "pdf_url": "https://arxiv.org/pdf/2505.00194.pdf",
      "published": "2026-01-15T01:32:11.854365",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "hep-ph",
        "nucl-ex",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.10548",
      "title": "Coherence of Supermassive Black Hole Binary Demographics with the nHz Stochastic Gravitational Wave Background",
      "authors": [
        "Katsunori Kusakabe",
        "Yoshiyuki Inoue",
        "Daisuke Toyouchi"
      ],
      "abstract": "Coherence of Supermassive Black Hole Binary Demographics with the nHz Stochastic Gravitational Wave Background Katsunori Kusakabe, Yoshiyuki Inoue, Daisuke Toyouchi 14 pages, 4 figures; Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present a refined estimation of the stochastic gravitational wave background (SGWB) based on observed dual active galactic nuclei (AGNs) together with AGN X-ray luminosity functions, in light of recent Pulsar Timing Array detections of an nHz SGWB. We identify a characteristic luminosity dependence in dual AGN fractions by compiling recent observational datasets, providing crucial constraints on supermassive black hole binary (SMBHB) populations. Our AGN-based model reproduces the current SGWB measurements within PTA observational uncertainties of $2 - 4 \\sigma$ uncertainties, demonstrating consistency between electromagnetic and gravitational wave observations. These findings establish SMBHBs as the dominant source of the nHz gravitational wave signal, providing crucial insights into their demographics and evolution.",
      "pdf_url": "https://arxiv.org/pdf/2510.10548.pdf",
      "published": "2026-01-15T01:32:11.855623",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.07925",
      "title": "An eclipsing 8.56 minute orbital period mass-transferring binary",
      "authors": [
        "Emma T. Chickles , Joheen Chakraborty , Kevin B. Burdge , Vik S. Dhillon , Paul Draghis , Kareem El-Badry , Matthew J. Green , Aaron Householder , Sarah Hughes , Christopher Layden , Stuart P. Littlefair , James Munday , Ingrid Pelisoli , Maya S. Redden , John Tonry , Jan van Roestel , F. Elio Angile , Alex J. Brown , Noel Castro , Jack Dinsmore , Martin Dyer , Gabor Furesz , Michelle Gabutti , James Garbutt , Daniel Jarvis , Mark R. Kennedy , Paul Kerry , James McCormac , Geoffrey Mo , Dave Osip , Steven Parsons , Eleanor Pike , Jack Piotrowski , Roger W. Romani , David Sahman , Rob Simcoe Massachusetts Institute of Technology, Cambridge, USA, University of Sheffield, Sheffield, UK, Instituto de Astrofisica de Canarias, La Laguna, Spain, California Institute of Technology, Pasadena, USA, Max Planck Institute for Astronomy, Heidelberg, Germany, University of Warwick, Coventry, UK, Stanford University, Stanford, USA, University of Hawaii, Honolulu, USA, Institute of Science and Technology Austria, Klosterneuburg, Austria, University of Amsterdam, Amsterdam, The Netherlands, University of Hamburg, Hamburg, Germany, Research Software Engineering, University of Sheffield, Sheffield, UK, University College Cork, Cork, Ireland, Carnegie Observatories, Pasadena, USA, Las Campanas Observatory, La Serena, Chile)"
      ],
      "abstract": "An eclipsing 8.56 minute orbital period mass-transferring binary Emma T. Chickles (1), Joheen Chakraborty (1), Kevin B. Burdge (1), Vik S. Dhillon (2 and 3), Paul Draghis (1), Kareem El-Badry (4), Matthew J. Green (5), Aaron Householder (1), Sarah Hughes (1), Christopher Layden (1), Stuart P. Littlefair (2), James Munday (6), Ingrid Pelisoli (6), Maya S. Redden (7), John Tonry (8), Jan van Roestel (9 and 10), F. Elio Angile (1), Alex J. Brown (11), Noel Castro (6), Jack Dinsmore (7), Martin Dyer (2 and 12), Gabor Furesz (1), Michelle Gabutti (1), James Garbutt (2), Daniel Jarvis (2), Mark R. Kennedy (13), Paul Kerry (2), James McCormac (6), Geoffrey Mo (4 and 14), Dave Osip (15), Steven Parsons (2), Eleanor Pike (2), Jack Piotrowski (14), Roger W. Romani (7), David Sahman (2), Rob Simcoe (1) ((1) Massachusetts Institute of Technology, Cambridge, USA, (2) University of Sheffield, Sheffield, UK, (3) Instituto de Astrofisica de Canarias, La Laguna, Spain, (4) California Institute of Technology, Pasadena, USA, (5) Max Planck Institute for Astronomy, Heidelberg, Germany, (6) University of Warwick, Coventry, UK, (7) Stanford University, Stanford, USA, (8) University of Hawaii, Honolulu, USA, (9) Institute of Science and Technology Austria, Klosterneuburg, Austria, (10) University of Amsterdam, Amsterdam, The Netherlands, (11) University of Hamburg, Hamburg, Germany, (12) Research Software Engineering, University of Sheffield, Sheffield, UK, (13) University College Cork, Cork, Ireland, (14) Carnegie Observatories, Pasadena, USA, (15) Las Campanas Observatory, La Serena, Chile) Solar and Stellar Astrophysics (astro-ph.SR) We report the discovery of ATLAS J101342.5-451646.8 (hereafter ATLAS J1013-4516), an eclipsing, mass-transferring AM Canum Venaticorum binary with an 8.56-minute orbital period, identified via periodic variability in light curves from the Asteroid Terrestrial-impact Last Alert System survey of Gaia white dwarf candidates. Follow-up spectroscopy with the Large Lenslet Array Magellan Spectrograph reveals a helium-dominated accretion disk, while high-speed photometry with ULTRACAM shows pronounced primary and secondary eclipses. We construct a decade-long timing baseline using data from ATLAS, Gaia, ULTRACAM on the Gran Telescopio Canarias, and the proto-Lightspeed instrument on the Magellan Clay telescope. From this baseline, we measure an orbital period derivative of dP/dt = -1.60 +/- 0.07 x 10^-12 seconds per second. Interpreted in the context of stable mass transfer, the magnitude and sign of the period derivative indicate that the orbital evolution is governed by the interplay between gravitational-wave-driven angular momentum losses and mass transfer, directly probing the donor star's structural response to mass loss. Assuming angular momentum loss dominated by gravitational wave emission, we constrain the component masses and infer the characteristic gravitational wave strain of the system for future space-based observatories such as the Laser Interferometer Space Antenna. We predict a characteristic strain corresponding to a four-year signal-to-noise ratio greater than approximately 20, establishing ATLAS J1013-4516 as a strong prospective source for probing long-term orbital evolution in the mass-transferring regime.",
      "pdf_url": "https://arxiv.org/pdf/2601.07925.pdf",
      "published": "2026-01-15T01:32:12.110397",
      "updated": null,
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    }
  ]
}