{
  "date": "2026-02-18",
  "crawl_timestamp": "2026-02-18T01:34:21.333637",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 248,
    "total_gw_papers": 30,
    "by_category": {
      "gr-qc": {
        "total": 43,
        "gw_related": 9
      },
      "astro-ph": {
        "total": 177,
        "gw_related": 15
      }
    }
  },
  "crawl_verification": {
    "total_expected": 343,
    "total_actual": 343,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 72,
        "actual_crawled": 72,
        "page_source_info": "Total of 72 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 49,
        "actual_crawled": 49,
        "page_source_info": "Total of 49 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 60,
        "actual_crawled": 60,
        "page_source_info": "Total of 60 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 63,
        "actual_crawled": 63,
        "page_source_info": "Total of 63 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 36,
        "actual_crawled": 36,
        "page_source_info": "Total of 36 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 37,
        "actual_crawled": 37,
        "page_source_info": "Total of 37 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 26,
        "actual_crawled": 26,
        "page_source_info": "Total of 26 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.13621",
      "title": "Harmonic Analysis on Correlation for Gravitational-Wave Backgrounds of Arbitrary Polarization from Interfering Sources in Generic Dispersion Relation",
      "authors": [
        "Yan-Chen Bi",
        "Yu-Mei Wu",
        "Qing-Guo Huang"
      ],
      "abstract": "Harmonic Analysis on Correlation for Gravitational-Wave Backgrounds of Arbitrary Polarization from Interfering Sources in Generic Dispersion Relation Yan-Chen Bi, Yu-Mei Wu, Qing-Guo Huang General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) The Hellings-Downs (HD) correlation serves as the fundamental benchmark for detecting the gravitational-wave background (GWB) in pulsar timing arrays (PTAs) within General Relativity (GR). However, this canonical signature relies on the idealization of a continuum of sources without interference. In realistic astrophysical scenarios dominated by supermassive black hole binaries (SMBHBs), interference between discrete sources induces intrinsic deviations in the spatial correlation, which may mimic or obscure signatures of modified gravity. In this work, we derive the closed-form spatial correlation functions for a GWB with arbitrary polarization and generic GW dispersion relations, in the presence of source interference. Through a rigorous harmonic analysis, we demonstrate that source interference modifies the correlation shape but strictly preserves the lowest non-vanishing multipole moment characteristic of each polarization, specifically the quadrupole for tensor, dipole for vector, and monopole for scalar modes. The truncation at higher-order multipoles is governed by the interplay between pulsar distances and dispersion effects. Furthermore, we quantify the statistical degeneracy between interference-induced variation and modified gravity signatures. We conclude that access to only a single realization of the Universe imposes a fundamental theoretical limit on distinguishing modified gravity from GR using spatial correlations alone.",
      "pdf_url": "https://arxiv.org/pdf/2602.13621.pdf",
      "published": "2026-02-18T01:34:20.082680",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.13854",
      "title": "Bounding the graviton mass using non-linear density wave theory",
      "authors": [
        "M. Vukcevic"
      ],
      "abstract": "Bounding the graviton mass using non-linear density wave theory M. Vukcevic General Relativity and Quantum Cosmology (gr-qc) In this paper we use the Newtonian gravitational potential corrected by non-liner effects to obtain new bounds on graviton mass using non-linear density wave theory (NLDW). This potential differs from the gravitational potential obtained in other modified gravity theories (e.g. the weak field limit of Yukawa gravity, Modified Newtonian Dynamics, non-local theories, $\\Lambda$ cold dark matter..). Using this model, we are able to define wavelength of the non-linear wave as an analytical solution of integrable non-linear differential equation (namely, non-linear Schrodinger equation). Assuming that the wavelength of the non-linear wave represents the graviton Compton wavelength, we have found the corresponding upper bound of graviton mass. We compare obtained result with first assessments of LIGO $\\&$ Virgo collaboration and we find they are in a good agreement. Present model used to determine the upper limit of graviton mass is completely independent from other methods published until now. We have compared our result with results obtained using several chosen published methods.",
      "pdf_url": "https://arxiv.org/pdf/2602.13854.pdf",
      "published": "2026-02-18T01:34:20.083215",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14659",
      "title": "Investigating the impact of quasi-universal relations on neutron star constraints in third-generation detectors",
      "authors": [
        "Natalie Williams",
        "Anna Puecher",
        "Guilherme Grams",
        "César V. Flores",
        "Tim Dietrich"
      ],
      "abstract": "Investigating the impact of quasi-universal relations on neutron star constraints in third-generation detectors Natalie Williams, Anna Puecher, Guilherme Grams, César V. Flores, Tim Dietrich General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Gravitational-wave observations of binary neutron star systems can shed light on the currently unknown dense matter equation of state. The equation of state determines a large number of neutron star properties, such as tidal deformability, radius, and quadrupole moment, several of which directly affect the emitted gravitational-wave signals. To reduce the dimensionality when computing gravitational-waves and when interpreting observational data, quasi-universal relations are commonly employed to connect different neutron star properties. However, quasi-universal relations are not exact and their use may introduce uncertainty and bias. We explore the potential biases arising from different quasi-universal relations in the third generation era: (i) the Love-Q relation connecting the spin-induced quadrupole moment and the tidal deformability, (ii) the relation between the fundamental mode frequency and the tidal deformability, and (iii) the binary Love relation. We find that for the quadrupole relation biases are only present for rapidly rotating systems, for the binary-Love relation induces moderate biases only in the next-to-leading-order tidal parameters, which can however propagate into the inferred equation of state at low masses. Regarding fundamental mode frequencies, we find that the employed relation introduces only negligible biases, while waveform systematic effects can become comparatively large. Our results highlight that while quasi-universal relations remain a useful tool within gravitational-wave analyses, careful treatment is needed to avoid biases in equation of state measurements with next-generation detectors.",
      "pdf_url": "https://arxiv.org/pdf/2602.14659.pdf",
      "published": "2026-02-18T01:34:20.085368",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14898",
      "title": "Tarnished by Tools: Cost of Systematics in Golden Dark Siren Cosmology",
      "authors": [
        "Giovanni Benetti",
        "Koustav Chandra",
        "Bangalore S. Sathyaprakash"
      ],
      "abstract": "Tarnished by Tools: Cost of Systematics in Golden Dark Siren Cosmology Giovanni Benetti, Koustav Chandra, Bangalore S. Sathyaprakash General Relativity and Quantum Cosmology (gr-qc) Golden dark sirens - exceptionally well-localized gravitational-wave (GW) sources without electromagnetic counterparts - offer a powerful route to precision measurements of the Hubble constant, $H_0$, with next-generation (XG) detectors. The statistical promise of this method, however, places stringent demands on waveform accuracy and detector calibration, as even small systematic errors can dominate over statistical uncertainties at high signal-to-noise ratios. We investigate the impact of waveform-modeling systematics on golden dark siren cosmology using a synthetic population of binary black holes consistent with current GW observations and analyzed in the XG-detector era. By comparing state-of-the-art waveform models against numerical-relativity-based reference signals, we quantify modeling inaccuracies from both modeling and data-analysis perspectives and assess how they propagate into biases in luminosity distance, host-galaxy association, and single-event $H_0$ inference. We find that while current waveform models often allow recovery of statistically consistent $H_0$ posteriors, small waveform-induced biases can significantly affect three-dimensional localization and host galaxy ranking, occasionally leading to incorrect redshift assignments. We further derive order-of-magnitude requirements on detector calibration accuracy needed to ensure that calibration systematics remain subdominant for golden dark sirens observed with XG networks. To realize sub-percent $H_0$ measurements with golden dark sirens will require waveform and calibration accuracies that scale as $\\mathcal{O}(\\rho^{-2})$ with signal-to-noise ratio, motivating sustained advances in waveform modeling, numerical relativity, and detector calibration for the XG era.",
      "pdf_url": "https://arxiv.org/pdf/2602.14898.pdf",
      "published": "2026-02-18T01:34:20.085893",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14359",
      "title": "Effects of the symmetry energy slope on magnetized neutron stars",
      "authors": [
        "Luiz L. Lopes",
        "Cesar V. Flores",
        "Débora P. Menezes"
      ],
      "abstract": "Effects of the symmetry energy slope on magnetized neutron stars Luiz L. Lopes, Cesar V. Flores, Débora P. Menezes High Energy Physics - Phenomenology (hep-ph); General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th) In this work, we study the effect of the symmetry slope on the observables of weakly and strongly magnetized neutron stars within the chaotic magnetic field approximation. We investigate the impact of the symmetry energy slope in the equation of state, as well as on the observables of neutron stars, by calculating their masses, radii, redshifts, tidal deformabilities, and fundamental-mode gravitational-wave frequencies.",
      "pdf_url": "https://arxiv.org/pdf/2602.14359.pdf",
      "published": "2026-02-18T01:34:20.088025",
      "updated": null,
      "categories": [
        "hep-ph",
        "gr-qc",
        "nucl-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14389",
      "title": "Quintessence with tachyonic resonance and late-time cosmic-microwave-background and gravitational-wave signals",
      "authors": [
        "Shun Yoshioka",
        "Kiyotomo Ichiki",
        "Yuichiro Tada",
        "Takahiro Terada"
      ],
      "abstract": "Quintessence with tachyonic resonance and late-time cosmic-microwave-background and gravitational-wave signals Shun Yoshioka, Kiyotomo Ichiki, Yuichiro Tada, Takahiro Terada Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Combinations of recent cosmological observations, including Dark Energy Spectroscopic Instrument (DESI), show hints of a dynamical nature for dark energy. While the data suggest the possibility of the phantom crossing, it is worth thoroughly exploring quintessence models. Given that phenomenological parametrisations of the equation-of-state parameter $w(a)$ with a sharp transitional feature fit the data well, we study the realisation of such models in quintessence. In the late Universe, the quintessence field begins to oscillate abruptly, changing the behaviour of $w$. Naturally, such a model entails tachyonic instability, and particle production modifies $w$. We perform numerical lattice simulations to study the time dependence of $w$. In addition, the violent particle production produces significant density perturbations and the stochastic gravitational-wave background, whose characteristic scale depends on the mass scale of the quintessence around the minimum of the potential. We discuss the observability of these late-time cosmological signals through cosmic microwave background, quasar astrometry, pulsar timing arrays, and other observational probes.",
      "pdf_url": "https://arxiv.org/pdf/2602.14389.pdf",
      "published": "2026-02-18T01:34:20.088223",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2410.04562",
      "title": "Gravitational Wave Generation via the Einstein-Langevin Equation",
      "authors": [
        "Noah M. MacKay"
      ],
      "abstract": "Gravitational Wave Generation via the Einstein-Langevin Equation Noah M. MacKay (Version 5: CQG preprint): 29 pages (with 1 appendix), 1 figure General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Detections of gravitational waves (GWs) since GW150914 has gained a contemporary interest in a potential quantum-classical correspondence between GWs and hypothetical gravitons. One such correspondence theory is stochastic gravity, whereby graviton fluctuations are treated as the stochastic noise embedded in globally-flat manifolds and local gravitational interactions. Utilizing the Einstein-Langevin equation that describes graviton fluctuations, in attempt to form a correlation with GW generation, we utilize the hollow mass-shell model of coalescing compact binaries. This is to explore the second Newtonian postulate of neutralized internal gravitational fields, i.e. the stochastic noise of an enclosed, internal Minkowski manifold. This stochatic picture of GW formation implies the treatment of the enclosed gravitons as a Brownian bath. From the Einstein-Langevin equation, we establish a scaling relation where quanta dissipation depends inversely with the contracting volume (i.e., emission increases during coalescence). Using an Euler iteration scheme, we simulate the graviton fluctuations from inspiral to merger as a Wiener process, revealing a signal that qualitatively resembles macroscopic GW waveforms. While inherently heuristic and phenomenological, this approach provides a computational framework for exploring graviton-scale perturbations in GW formation. We discuss furthermore analytical waveform matching with the iteration scheme, as well as the justification of a Brownian analogy amidst current and state-of-the-art effective field theory frameworks.",
      "pdf_url": "https://arxiv.org/pdf/2410.04562.pdf",
      "published": "2026-02-18T01:34:20.090503",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.17947",
      "title": "Coherent State Description of Gravitational Waves from Binary Black Holes",
      "authors": [
        "Sugumi Kanno",
        "Jiro Soda",
        "Akira Taniguchi"
      ],
      "abstract": "Coherent State Description of Gravitational Waves from Binary Black Holes Sugumi Kanno, Jiro Soda, Akira Taniguchi Phys. Rev. Lett. 136, 061404 (2026) General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) Quantum mechanics is the fundamental framework of nature, and gravitational waves from binary black holes during the inspiral phase should likewise be analyzed quantum mechanically. It is commonly assumed that their classical description corresponds to a coherent state, so any deviation would signal genuinely quantum nature of gravity. We show that the coherent-state description reproduces classical gravitational waves at leading order, while next-order effects generate squeezed states of gravitons. For GW150914, we estimate the squeezing parameter to be $\\sim 10^{-4}$. We find that gravitational waves from binary black holes are well described by a coherent state.",
      "pdf_url": "https://arxiv.org/pdf/2508.17947.pdf",
      "published": "2026-02-18T01:34:20.091272",
      "updated": null,
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13957",
      "title": "Resonant Loop Interferometers for High-Frequency Gravitational Waves",
      "authors": [
        "Jan Heisig"
      ],
      "abstract": "Resonant Loop Interferometers for High-Frequency Gravitational Waves Jan Heisig 12 pages, 6 figures; v2: Substantial revision. Clarified suppression of rotational non-reciprocity and expanded discussion of response and sensitivity General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) Gravitational waves at kilohertz and higher frequencies offer a unique probe of the early Universe at temperatures well beyond the reach of the cosmic microwave background, corresponding to energy scales $\\gtrsim 10^9$GeV. Existing detector concepts fall many orders of magnitude short of the big-bang nucleosynthesis (BBN) bound on the stochastic background in this regime. We propose a new interferometric architecture based on closed optical loops, in which the gravitational-wave-induced phase shift accumulates coherently over many traversals. This produces sharp, narrowband resonances whose predictable comb structure provides a distinct experimental signature. For a folded loop with parameters compatible with the Einstein Telescope infrastructure, and finesse values of order 500, we project sensitivity that approaches and even surpasses the BBN bound up to tens of kilohertz after one year of integration. Such loop interferometers thus open a realistic and distinctive path toward exploring high-frequency stochastic gravitational-wave backgrounds.",
      "pdf_url": "https://arxiv.org/pdf/2510.13957.pdf",
      "published": "2026-02-18T01:34:20.092073",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.19547",
      "title": "Numerical simulations of Scalar Dark Matter Around Binary Neutron Star mergers",
      "authors": [
        "Rohan Srikanth",
        "Tim Dietrich",
        "Katy Clough"
      ],
      "abstract": "Numerical simulations of Scalar Dark Matter Around Binary Neutron Star mergers Rohan Srikanth, Tim Dietrich, Katy Clough General Relativity and Quantum Cosmology (gr-qc) Binary neutron star mergers provide a laboratory for probing fundamental physics through their gravitational-wave emission and electromagnetic counterparts. In particular, they may allow us to explore signatures of physics beyond the Standard Model in strong-gravity regimes, such as those of dark matter. In this work, we investigate the dynamics of light dark matter, modeled as a minimally coupled scalar field, surrounding a binary neutron star system. Our primary focus is to assess whether the scalar field remains bound to the binary over the late inspiral-merger timescales and to determine its potential impact on observable signatures. We find that, in a range of scenarios, the scalar field forms a common cloud around the binary that does not disperse. At sufficiently high densities, this leads to measurable effects, including a dephasing of the binary inspiral, a less compact post-merger remnant, and suppression of the dynamical ejecta. For densities motivated by astrophysical considerations, however, these effects remain small and are unlikely to be detectable with current or next-generation gravitational-wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2510.19547.pdf",
      "published": "2026-02-18T01:34:20.092419",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.24055",
      "title": "Kinematic Anisotropies in PTA Observations: Analytical Toolkit",
      "authors": [
        "Maximilian Blümke",
        "Kai Schmitz",
        "Tobias Schröder",
        "Deepali Agarwal",
        "Joseph D. Romano"
      ],
      "abstract": "Kinematic Anisotropies in PTA Observations: Analytical Toolkit Maximilian Blümke, Kai Schmitz, Tobias Schröder, Deepali Agarwal, Joseph D. Romano 20 pages, 4 figures. v2: matches version published in Symmetry General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) The reported evidence for an isotropic gravitational-wave background (GWB) from pulsar timing array (PTA) collaborations has motivated searches for extrinsic and intrinsic anisotropies. Kinematic anisotropies may arise as a consequence of a boosted observer moving with respect to the frame in which the GWB appears isotropic. In this work, we present an analytical toolbox to describe the effects of kinematic anisotropies on the overlap reduction function. Our analytical results differ from previous findings at the quadrupole order and are detailed in three appendices. For the first time, we also derive the corresponding auto-correlation using two approaches, taking the pulsar distances to be infinite or finite, respectively. Our formulas can be used in forecasts or Bayesian analysis pipelines.",
      "pdf_url": "https://arxiv.org/pdf/2512.24055.pdf",
      "published": "2026-02-18T01:34:20.093550",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2206.09965",
      "title": "Fate of false vacuum in non-perturbative regimes: Gravity effects",
      "authors": [
        "Gianluca Calcagni",
        "Marco Frasca",
        "Anish Ghoshal"
      ],
      "abstract": "Fate of false vacuum in non-perturbative regimes: Gravity effects Gianluca Calcagni, Marco Frasca, Anish Ghoshal 23 pages, 7 figures. Version accepted for publication in International Journal of Geometric Methods in Modern Physics High Energy Physics - Theory (hep-th); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) A recent analysis of the false-vacuum decay in non-perturbative regimes is here extended in the presence of Einstein gravity, computing the corresponding effective potential and decay rate. We consider a $\\lambda \\phi^4$ scalar field theory and we observe that, in comparison to the usual perturbative decay rate, the higher the coupling $\\lambda$, the greater the decay probability. We evaluate the running of the self-interaction coupling and obtain a weakly coupled theory at lower energies, proving that Einstein gravity grants an even more reliable weak coupling approximation with the universe cooling down. We also provide an extended study of a non-minimal coupling $\\xi$ of the scalar field with gravity showing how this term makes the false-vacuum decay more difficult. Minima can also disappear at large coupling $\\xi$. We discuss possible applications of these results to cosmological phase transitions, gravitational-wave astronomy, and condensed matter systems.",
      "pdf_url": "https://arxiv.org/pdf/2206.09965.pdf",
      "published": "2026-02-18T01:34:20.093947",
      "updated": null,
      "categories": [
        "hep-th",
        "astro-ph.CO",
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2406.14450",
      "title": "Hydrodynamics of Relativistic Superheated Bubbles",
      "authors": [
        "Yago Bea",
        "Jorge Casalderrey-Solana",
        "David Mateos",
        "Mikel Sanchez-Garitaonandia"
      ],
      "abstract": "Hydrodynamics of Relativistic Superheated Bubbles Yago Bea, Jorge Casalderrey-Solana, David Mateos, Mikel Sanchez-Garitaonandia 18 pages, 8 figures, 1 appendix. Updated to agree with published version High Energy Physics - Theory (hep-th); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Relativistic, charged, superheated bubbles may play an important role in neutron star mergers if first-order phase transitions are present in the phase diagram of Quantum Chromodynamics. We describe the properties of these bubbles in the hydrodynamic regime. We find two qualitative differences with supercooled bubbles. First, the pressure at the center of an expanding superheated bubble can be higher or lower than the pressure in the asymptotic, metastable phase. Second, some fluid flows develop metastable regions behind the bubble wall for any choice of the equation of state. We consider the possible role of a conserved charge akin to baryon number. The fluid flow profiles are unaffected by this charge if the speed of sound is constant in each phase, but they are modified for more general equations of state. We compute the efficiency factor relevant for gravitational wave production.",
      "pdf_url": "https://arxiv.org/pdf/2406.14450.pdf",
      "published": "2026-02-18T01:34:20.094838",
      "updated": null,
      "categories": [
        "hep-th",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.26042",
      "title": "Gravitational-Wave Constraints on Neutron-Star Pressure Anisotropy via Universal Relations",
      "authors": [
        "Victor Guedes",
        "Siddarth Ajith",
        "Shu Yan Lau",
        "Kent Yagi"
      ],
      "abstract": "Gravitational-Wave Constraints on Neutron-Star Pressure Anisotropy via Universal Relations Victor Guedes, Siddarth Ajith, Shu Yan Lau, Kent Yagi Phys.Rev.D 113 (2026) 4, 043025 High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Neutron stars may exhibit pressure anisotropy arising from various physical mechanisms, such as elasticity, magnetic fields, viscosity, and superfluidity. We compute the tidal deformability and the $f$-mode oscillation frequency of anisotropic neutron stars using a phenomenological quasi-local model characterized by a single dimensionless anisotropy parameter. We find that while the relation between the tidal deformability and the $f$-mode frequency depends on the degree of anisotropy, it remains largely insensitive to variations in the equation of state (the relation between radial pressure and energy density) for a fixed anisotropy parameter, similar to the isotropic case. Leveraging this anisotropy-dependent universal relation within a statistical framework, we place constraints on the anisotropy parameter using both the gravitational wave observation of GW170817 and simulated data for a GW170817-like event observed by a future network of detectors. We find that the anisotropy parameter can be constrained to order unity with current data, and the bounds remain comparable with future detector sensitivities. Importantly, these constraints are only weakly affected by uncertainties in the neutron-star equation of state.",
      "pdf_url": "https://arxiv.org/pdf/2510.26042.pdf",
      "published": "2026-02-18T01:34:20.096851",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14324",
      "title": "Gravitational waves from supercooled phase transitions and pulsar timing array signals",
      "authors": [
        "Jinzheng Li",
        "Pran Nath"
      ],
      "abstract": "Gravitational waves from supercooled phase transitions and pulsar timing array signals Jinzheng Li, Pran Nath Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The recent detection of a gravitational wave background in the nano-Hertz frequency range by Pulsar Timing Array (PTA) collaborations, including NANOGrav, EPTA, and PPTA, has opened a new avenue for exploring fundamental physics in the early universe. In this work, we analyze a supercooled first-order phase transition in a hidden sector with a spontaneously broken $U(1)_X$ gauge symmetry as a source for this signal. We demonstrate that the thermal history of the hidden and visible sectors plays a crucial role in the gravitational wave power spectrum analysis. Our analysis shows that supercooled phase transitions can generate gravitational waves strong enough to explain the PTA observations while satisfying cosmological constraints from Big Bang Nucleosynthesis.",
      "pdf_url": "https://arxiv.org/pdf/2602.14324.pdf",
      "published": "2026-02-18T01:34:20.274437",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14825",
      "title": "The impact of the formation channel on gravitational-wave-galaxy cross-correlations",
      "authors": [
        "Kabir Chakravarti",
        "Federico R. Urban"
      ],
      "abstract": "The impact of the formation channel on gravitational-wave-galaxy cross-correlations Kabir Chakravarti, Federico R. Urban Cosmology and Nongalactic Astrophysics (astro-ph.CO) The angular, harmonic cross-correlation between gravitational wave (GW) events and galaxy catalogues contains rich information on the large-scale structure and the origin of compact binary mergers. In this work, we study how uncertainties in the binary formation channel affect the predicted cross-correlation signal for both current-generation and next-generation networks of detectors. We generate five mock GW catalogues for which we vary the progenitor-to-remnant mass-transfer function and the time-delay probability distribution between progenitor and remnant. We then cross-correlate these catalogues with galaxy samples modelled on the 2MASS Photometric Redshift catalogue (2MPZ) and the Gaia-unWISE quasar catalogue (Quaia). We find that the mass-transfer function has negligible effect on the cross-correlation signal, with differences remaining within redshift uncertainties. In contrast, the time-delay distribution dramatically affects the redshift distribution of the GW events and, with it, the cross-correlation signal, particularly for shallow galaxy catalogues. In particular, current-generation facilities can achieve significant detections only for the longest time delays when cross-correlated with 2MPZ, whilst all cross-correlations with the deeper Quaia catalogue are marginally detectable or consistent with zero. Our exploratory results thus demonstrate that forecasts on cosmological or astrophysical parameters derived from GW-galaxy cross-correlations are, as expected, strongly sensitive to the assumed binary formation history.",
      "pdf_url": "https://arxiv.org/pdf/2602.14825.pdf",
      "published": "2026-02-18T01:34:20.275631",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.15023",
      "title": "Gravitational Wave Echoes of the First Order Phase Transition in a Kination-Induced Big Bang",
      "authors": [
        "Richard Casey",
        "Katherine Freese",
        "Evangelos I. Sfakianakis"
      ],
      "abstract": "Gravitational Wave Echoes of the First Order Phase Transition in a Kination-Induced Big Bang Richard Casey, Katherine Freese, Evangelos I. Sfakianakis Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Gravitational waves (GWs) produced during first-order phase transitions (FOPTs) in the early universe provide a powerful probe of nonstandard cosmological histories. We study GW production from a FOPT ending a kination-dominated epoch in the Kination-Induced Big Bang scenario, in which a period of kination domination terminates through a phase transition that reheats the universe into radiation domination. A rolling scalar field drives the kination epoch. In the specific model we consider, its derivative coupling to a second scalar (tunneling field) dynamically traps the latter in a false vacuum, with the phase transition triggered as the kination field slows due to Hubble friction. We compute the resulting stochastic GW background from bubble nucleation and collisions, presenting analytic estimates and numerical results for the peak amplitude and frequency. In all cases we find an upper bound $\\Omega_{\\rm GW} h^2\\lesssim 2\\times10^{-7}$ from the bubble percolation condition. In the case where the false vacuum energy dominates at the transition (yet the kination field drives the FOPT), we find $\\Omega_{\\rm GW}h^2\\gtrsim 10^{-12}$. We further find that the Hubble scale during the phase transition across a broad set of model parameters is bounded by $\\mathscr{O}(10^{-13})M^2/M_{\\rm Pl}\\lesssim H_* \\lesssim \\mathscr{O}(0.1)M^2/M_{\\rm Pl}$, where $M$ is the mass-scale controlling the strength of the interaction between the kination and tunneling fields. The predicted signal spans frequencies from nHz to MHz, allowing the model to explain the signal reported by Pulsar Timing Array experiments and to be constrained or probed by interferometers such as LISA, Advanced LIGO, Cosmic Explorer, and BBO. Interestingly, a FOPT can occur even if the bare tunneling potential has a single minimum, as metastability is generated dynamically by the coupling between the tunneling and the kination field.",
      "pdf_url": "https://arxiv.org/pdf/2602.15023.pdf",
      "published": "2026-02-18T01:34:20.276305",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.15026",
      "title": "Prospects of Indirect Detection of Dark Matter via Primordial Black Hole Induced Gravitational Waves",
      "authors": [
        "Debarun Paul",
        "Md Riajul Haque",
        "Supratik Pal"
      ],
      "abstract": "Prospects of Indirect Detection of Dark Matter via Primordial Black Hole Induced Gravitational Waves Debarun Paul, Md Riajul Haque, Supratik Pal 38 pages, 18 figures and 1 table Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Primordial black holes (PBHs), produced in the early Universe, can source a stochastic background of induced gravitational waves (GWs) and provide a non-thermal origin for dark matter (DM). We investigate DM production in a PBH-dominated cosmological framework, including contributions from PBH evaporation, gravitational production, and thermal freeze-in and freeze-out mechanisms, and determine the regions consistent with the observed DM relic abundance. We find that thermal freeze-in can compensate for the underabundance of PBH-sourced DM, while indirect detection remains largely insensitive due to the feeble interaction strength, making future GW observatories such as LISA and the Einstein Telescope (ET) unique probes of this scenario. For freeze-out DM, indirect detection experiments constrain regions with relatively large annihilation cross-sections, whereas GW observations probe complementary regions with heavier DM masses and smaller interaction strengths. Consequently, the same DM parameter space cannot be simultaneously probed by both indirect detection searches and GW missions. These results establish GW observations as a powerful and independent probe of DM production in PBH-dominated cosmologies, opening a new observational window into DM properties and the thermal history of the pre-BBN Universe.",
      "pdf_url": "https://arxiv.org/pdf/2602.15026.pdf",
      "published": "2026-02-18T01:34:20.276507",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.08524",
      "title": "Revisiting the Great Attractor: The Local Group's streamline trajectory, cosmic velocity and dynamical fate",
      "authors": [
        "Richard Stiskalek",
        "Harry Desmond",
        "Stuart McAlpine",
        "Guilhem Lavaux",
        "Jens Jasche",
        "Michael J. Hudson"
      ],
      "abstract": "Revisiting the Great Attractor: The Local Group's streamline trajectory, cosmic velocity and dynamical fate Richard Stiskalek, Harry Desmond, Stuart McAlpine, Guilhem Lavaux, Jens Jasche, Michael J. Hudson 14 pages, 8 figures. Published in the Open Journal of Astrophysics Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We revisit the Great Attractor using the Manticore-Local suite of digital twins of the nearby Universe. The Great Attractor concept has been proposed as an answer to three distinct questions: what sources the Local Group velocity in the cosmic microwave background frame, where present-day velocity streamlines converge, and where the Local Group is moving to. Addressing the original motivation of the Great Attractor -- explaining the Local Group cosmic velocity -- we find that mass within $155~h^{-1}\\mathrm{Mpc}$ accounts for only ${\\sim}72\\%$ of that velocity magnitude with ${\\sim}38\\,°$ directional offset. We show that even in the purely linear regime convergence within this volume is not guaranteed, particularly when also accounting for small-scale contributions to the observer velocity; no single structure, including the proposed Great Attractor, would be expected to dominate the velocity budget. Streamline convergence is smoothing-scale-dependent, transitioning from Virgo at small scales through the Hydra--Centaurus region at intermediate scales to Shapley at large scales; at intermediate smoothing the convergence point lies near Abell 3565 with an asymmetric basin of mass $\\log( M / (h^{-1} \\mathrm{M}_\\odot)) = 16.4 \\pm 0.1$ that excludes Norma. To address the third question, we evolve the Manticore-Local realisations to scale factor $a = 10$ in a new Beyond-Present-Time simulation suite and identify the asymptotic future location of the Local Group. We find that the dominant motion is towards Virgo, but even it contributes at most one third of the Local Group velocity. Our results demonstrate that the classical Great Attractor is not a dynamically dominant structure but an artefact of the instantaneous velocity field, and that no single attractor is likely to account for the Local Group motion in the cosmic rest frame.",
      "pdf_url": "https://arxiv.org/pdf/2601.08524.pdf",
      "published": "2026-02-18T01:34:20.280504",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2410.21509",
      "title": "Gravitational Waves from Phase Transitions",
      "authors": [
        "Djuna Croon",
        "David J. Weir"
      ],
      "abstract": "Gravitational Waves from Phase Transitions Djuna Croon, David J. Weir 27 pages, 10 figures; review aimed at advanced undergraduates, accepted for publication in Contemporary Physics. v2: corrected typos and added clarifications to original manuscript; see journal for refereed version with additional minor changes. v3: added previously-embargoed minor changes to wording in Section 1.3 Contemporary Physics, 65 (2024) 75 High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We summarise the physics of first-order phase transitions in the early universe, and the possible ways in which they might come about. We then focus on gravitational waves, emphasising general qualitative features of stochastic backgrounds produced by early universe phase transitions and the cosmology of their present-day appearance. Finally, we conclude by discussing some of the ways in which a stochastic background might be detected.",
      "pdf_url": "https://arxiv.org/pdf/2410.21509.pdf",
      "published": "2026-02-18T01:34:20.281851",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.13391",
      "title": "Constraining Binary Neutron Star Populations using Short Gamma-Ray Burst Observations",
      "authors": [
        "Alessio Ludovico De Santis",
        "Samuele Ronchini",
        "Filippo Santoliquido",
        "Marica Branchesi"
      ],
      "abstract": "Constraining Binary Neutron Star Populations using Short Gamma-Ray Burst Observations Alessio Ludovico De Santis, Samuele Ronchini, Filippo Santoliquido, Marica Branchesi High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) The landmark multi-messenger observations of the binary neutron star (BNS) merger GW170817 provided firm evidence that such mergers can produce short gamma-ray bursts (sGRBs). However, the limited number of BNS detections by current gravitational-wave (GW) observatories raises the question of whether BNS mergers alone can account for the full observed sGRB population. We analyze a comprehensive set of 64 BNS population synthesis models with a Monte Carlo-based framework to reproduce the properties of sGRBs detected by Fermi-GBM over the past 16 years. We consider three jet geometry scenarios: a universal structured jet calibrated to GW170817, a universal top-hat jet, and a non-universal top-hat jet with distributions of core opening angles. Our results show that models characterized by low local BNS merger rates ($R_{BNS}(0) \\lesssim 50$ Gpc$^{-3}$ yr$^{-1}$) predict too few observable sGRBs to reproduce the Fermi-GBM population, effectively disfavoring them as sole progenitors. Even when relaxing assumptions on jet geometry, low-rate models remain viable only for wide jets ($\\theta_c \\ge 15^\\circ$), in tension with the narrow jet cores ($\\theta_c \\approx 6^\\circ$) inferred from sGRB afterglow observations. In contrast, models with local merger rates of order $R_{BNS}(0) \\approx 100$ Gpc$^{-3}$ yr$^{-1}$ successfully reproduce the observed sGRB population, assuming a plausible fraction of BNS mergers launch relativistic jets and realistic jet geometries. This analysis highlights the power of combining GW observations of BNS mergers with electromagnetic observations of sGRBs to place robust constraints on the BNS merger population and to assess their role as progenitors of sGRBs.",
      "pdf_url": "https://arxiv.org/pdf/2602.13391.pdf",
      "published": "2026-02-18T01:34:20.534899",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.13471",
      "title": "Searching for Neutron Star Mergers in the Absence of Gravitational Waves with Optical Afterglow Emission",
      "authors": [
        "Haille M. L. Perkins",
        "Gautham Narayan",
        "Brian D. Fields",
        "Ved G. Shah",
        "Genevieve Schroeder"
      ],
      "abstract": "Searching for Neutron Star Mergers in the Absence of Gravitational Waves with Optical Afterglow Emission Haille M. L. Perkins, Gautham Narayan, Brian D. Fields, Ved G. Shah, Genevieve Schroeder Submitted to ApJ; 19 pages, 9 figures, comments welcome! High Energy Astrophysical Phenomena (astro-ph.HE) With the forth observing run of the LIGO-Virgo-KAGRA gravitational-wave network, which enabled the discovery of the kilonova (KN) counterpart to GW170817, ending with no new confirmed neutron star mergers, the intrinsic rate of these events must be even lower than previously estimated. As a result, building a sample of KNe will remain challenging even with continued GW observations, motivating complementary discovery strategies that do not rely on gravitational-wave triggers. In this work, we consider how leveraging bright short gamma-ray burst afterglows can aid in the discovery on KNe with the Rubin Observatory's upcoming Legacy Survey of Space and Time (LSST), whose unprecedented depth will make such detections feasible. We find that nearly on-axis (${\\theta}_{\\rm view} \\leq 30°$) afterglows can enhance KN detection rates in the LSST $g$-band from $29^{+51}_{-21} \\ \\rm yr^{-1}$ to $91^{+160}_{-65} \\ \\rm yr^{-1}$. We further show how the colors of the observed events can be used to distinguish between neutron star merger counterparts with and without KN emission. This study demonstrates how critical multi-wavelength and multi-survey observations are for these rare events, especially without context from gravitational waves. Fortunately, detectable events will likely be discovered near peak with LSST, allowing for rapid follow-up and confirmation. We discuss key uncertainties in our study, particularly volume rate of merger events, and the degeneracy between the empirically determined explosion energy and ambient medium density.",
      "pdf_url": "https://arxiv.org/pdf/2602.13471.pdf",
      "published": "2026-02-18T01:34:20.535880",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.13688",
      "title": "Pulsars and Millisecond Pulsars III: Tracing Compact Object Dynamics in Globular Clusters with NBODY6++GPU",
      "authors": [
        "M. Rah",
        "R. Spurzem",
        "F. Flammini Dotti",
        "A. Mickaelian"
      ],
      "abstract": "Pulsars and Millisecond Pulsars III: Tracing Compact Object Dynamics in Globular Clusters with NBODY6++GPU M. Rah, R. Spurzem, F. Flammini Dotti, A. Mickaelian 15 pages, published in Communications of BAO, Vol. 72, Issue 2 (2025) Communications of the Byurakan Astrophysical Observatory (CoBAO), Vol. 72, Issue 2, 2025, pp High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Neutron stars in globular clusters follow complex evolutionary pathways shaped by binary interactions, mass transfer, and dynamical exchanges. Direct N-body simulations such as NBODY6++GPU successfully model stellar dynamics and compact object formation, but they usually do not track pulsar spin evolution or magnetic field decay explicitly. Building on Papers I and II of this series, we identify this gap and present a case study from an existing simulation with N = 105000 particles, showing how a neutron star forms and evolves for 200 Myr without any pulsar-physics tracking. We compare this situation with recent implementations and outline a seven-scenario framework that includes magnetic dipole spin-down, exponential magnetic field decay, environmental torques, accretion-driven spin-up, gravitational-wave emission, and merger-driven evolution. As an example, the neutron star we label Pulsar973 forms at t = 800 Myr with a post-supernova mass of 5.35 solar masses and evolves to 2.52 solar masses by t = 1000 Myr, but still lacks period P, period derivative Pdot, magnetic field B, and scenario classification. We provide mathematical formulations and specific integration points within NBODY6++GPU (Hermite scheme, Ahmad-Cohen neighbors, KS regularization, and BSE stellar evolution) to enable scenario-based pulsar evolution within direct N-body simulations.",
      "pdf_url": "https://arxiv.org/pdf/2602.13688.pdf",
      "published": "2026-02-18T01:34:20.536285",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14014",
      "title": "Pulsar Timing Array in the past decade",
      "authors": [
        "Kuo Liu",
        "Siyuan Chen"
      ],
      "abstract": "Pulsar Timing Array in the past decade Kuo Liu, Siyuan Chen 72 pages, 13 figures. Submitted to IJMPD. Comments are welcomed High Energy Astrophysical Phenomena (astro-ph.HE) The past decade has been a transformative period for pulsar timing arrays (PTAs) and their search for nanohertz gravitational waves (GWs). This progress has been driven by collective advances in instrumentation for pulsar timing observations, increasingly sophisticated data-analysis techniques, and improved theoretical understanding of the origins of nanohertz GW signals. PTA sensitivity has steadily improved, leading first to progressively more stringent upper limits on the gravitational-wave background (GWB), and subsequently to the identification of a common red-noise process in pulsar timing data, the first hint of a GWB. In 2023, multiple PTA collaborations reported evidence for the Hellings-Downs correlation, widely regarded as the definitive signature of a GWB. These developments place PTAs on the threshold of a confident GW detection and the opening of a new low-frequency window on the GW Universe. In this article, we present an overview of PTA experiments, with particular emphasis on the rapid progress achieved during this pivotal period for PTA and nanohertz GW science.",
      "pdf_url": "https://arxiv.org/pdf/2602.14014.pdf",
      "published": "2026-02-18T01:34:20.537254",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14300",
      "title": "Production of Jets before Neutron Star Mergers",
      "authors": [
        "Praveen Sharma",
        "Maxim Lyutikov",
        "Slava G. Turyshev",
        "Maxim V. Barkov"
      ],
      "abstract": "Production of Jets before Neutron Star Mergers Praveen Sharma, Maxim Lyutikov, Slava G. Turyshev, Maxim V. Barkov High Energy Astrophysical Phenomena (astro-ph.HE) We demonstrate that magnetospheric interactions between merging neutron stars (NSs) generate dual-jetted current outflows, analogous to the Alfvén wings observed during planetary interactions in the Solar System. Using 3D relativistic MHD simulations, we model the interaction as a conducting sphere moving through a highly magnetized plasma of the companion's magnetosphere. Unusually, the interaction operates in a regime that is relativistic yet sub-Alfvénic. Electromagnetic draping amplifies magnetic fields in a narrow layer near the stellar surface, leading to the generation of electric currents along the local magnetic field. The generation of beamed outflows enhances instantaneous power of the pulsar-like radio and high energy emission, produces spin/orbital modulations, and is likely to lead to observable precursor emission preceding the main gravitational wave event.",
      "pdf_url": "https://arxiv.org/pdf/2602.14300.pdf",
      "published": "2026-02-18T01:34:20.538441",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14113",
      "title": "Quarkyonic matter and hadron-quark crossover from an ultracold atom perspective",
      "authors": [
        "Hiroyuki Tajima",
        "Kei Iida",
        "Toru Kojo",
        "Haozhao Liang"
      ],
      "abstract": "Quarkyonic matter and hadron-quark crossover from an ultracold atom perspective Hiroyuki Tajima, Kei Iida, Toru Kojo, Haozhao Liang 9 pages, 2 figures. Submitted to Focus on Insights from kHz Gravitational Waves in Classical and Quantum Gravity Nuclear Theory (nucl-th); High Energy Astrophysical Phenomena (astro-ph.HE); Quantum Gases (cond-mat.quant-gas); Superconductivity (cond-mat.supr-con); High Energy Physics - Phenomenology (hep-ph) The dense matter equation of state is of great interest due to the recent development of astrophysical observations for neutron stars. A rapid increase in pressure indicates a continuous crossover from a hadron phase to a quark phase without any phase transitions, yet its microscopic mechanism remains elusive. Recently, a peak in the speed of sound and a baryon momentum-shell structure, which are predicted from a quarkyonic matter picture, have been regarded as key features of the hadron-quark crossover. In this work, we explore a field-theoretical framework to describe the hadron-quark crossover, drawing an analogy with the Bose-Einstein condensate to Bardeen-Cooper-Schrieffer (BEC-BCS) crossover established in ultracold atomic experiments. Strikingly, a peak in the speed of sound and the baryon momentum-shell structure can simultaneously be explained by the tripling fluctuation effect arising from a different context of quantum many-body physics. We demonstrate these properties in a simplified model and provide a microscopic derivation of the quarkyonic matter model within our field-theoretical framework.",
      "pdf_url": "https://arxiv.org/pdf/2602.14113.pdf",
      "published": "2026-02-18T01:34:20.543109",
      "updated": null,
      "categories": [
        "nucl-th",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "nucl-th",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from nucl-th",
        "cross_list_from": "nucl-th"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.14866",
      "title": "Gauge-independent gravitational waves from a minimal dark $U(1)$ sector with viable dark matter candidates",
      "authors": [
        "Wan-Zhe Feng",
        "Zi-Hui Zhang"
      ],
      "abstract": "Gauge-independent gravitational waves from a minimal dark $U(1)$ sector with viable dark matter candidates Wan-Zhe Feng, Zi-Hui Zhang High Energy Physics - Phenomenology (hep-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Searches for stochastic gravitational wave backgrounds from first-order phase transitions offer a powerful probe of hidden sectors, but quantitative predictions in gauge theories are obstructed by the gauge dependence of the finite-temperature effective potential and the associated tunneling action. We study a minimal gauged $U(1)$ dark sector containing a dark Higgs and a dark photon, optionally supplemented by a vectorlike dark fermion, coupled to the Standard Model through Higgs portal or kinetic mixing. Using the Nielsen identity together with a controlled derivative expansion and power counting, we construct a gauge-independent effective action in the high- and low-temperature limits, enabling model-intrinsic nucleation dynamics and robust gravitational wave predictions. We perform dedicated Monte Carlo scans in both limits and map viable microscopic parameters to detector-facing peak frequencies and amplitudes, spanning bands relevant to pulsar timing arrays and planned space-based interferometers. In our scans, supercooled transitions typically produce the strongest signals, whereas parametrically high-temperature transitions are comparatively rare and tend to be weak. We further connect the phase transition phenomenology to viable dark matter candidates within the same minimal field content, providing benchmark targets for dark photon dark matter and dark fermion dark matter, and highlighting their complementarity with gravitational wave observables. Overall, our results provide an end-to-end, gauge-independent pipeline from a minimal hidden sector Lagrangian to gravitational wave spectra and cosmologically viable dark matter benchmarks, yielding the most reliable and concrete predictions to date for a minimal gauged $U(1)$ dark sector.",
      "pdf_url": "https://arxiv.org/pdf/2602.14866.pdf",
      "published": "2026-02-18T01:34:20.544249",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.HE"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2410.10579",
      "title": "Detecting prompt and afterglow jet emission of gravitational wave events from LIGO/Virgo/KAGRA and next generation detectors",
      "authors": [
        "Ravjit Kaur",
        "Brendan O'Connor",
        "Antonella Palmese",
        "Keerthi Kunnumkai"
      ],
      "abstract": "Detecting prompt and afterglow jet emission of gravitational wave events from LIGO/Virgo/KAGRA and next generation detectors Ravjit Kaur, Brendan O'Connor, Antonella Palmese, Keerthi Kunnumkai Accepted for publication in ApJ, 33 pages, 13 figures, 4 tables High Energy Astrophysical Phenomena (astro-ph.HE) Following the wealth of new results enabled by multimessenger observations of the binary neutron star (BNS) merger GW170817, the next goal is increasing the number of detections of electromagnetic (EM) counterparts to gravitational wave (GW) events. We study the detectability of the prompt emission and afterglows produced by the relativistic jets launched by BNS mergers that will be detected by LIGO-Virgo-KAGRA during their fifth observing run (O5), and by next generation (XG) GW detectors (Einstein Telescope and Cosmic Explorer). We quantify the impact of various BNS merger and jet afterglow parameters on the likelihood of detection, focusing on the impact of the observer's viewing angle and the jet's core half-opening angle. We explore detectability over a wide range of current state-of-the-art facilities (e.g., the James Webb Space Telescope, Chandra X-ray Observatory) as well as upcoming next-generation facilities (e.g., AXIS, NewAthena, ngVLA, SKA). We find that a few GW events (~0-4) per year may have a detectable afterglow component in O5, with the largest detection rates expected with SKA in the radio and JWST in the near-infrared. In the XG era, hundreds of multimessenger detections of afterglows per year may be possible with a range of instruments, such as NewAthena in the X-ray and ngVLA in the radio. While zero to a few GW events per year are expected to be accompanied by a detectable prompt emission in O5, dozens per year may be detectable in XG.",
      "pdf_url": "https://arxiv.org/pdf/2410.10579.pdf",
      "published": "2026-02-18T01:34:20.545273",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.09220",
      "title": "Frequency- and phase-resolved polarimetry of millisecond pulsars and its application to timing",
      "authors": [
        "Małgorzata Curyło",
        "Andrew Zic",
        "Shuangqiang Wang",
        "Eric Thrane",
        "Paul D. Lasky",
        "Jacob Cardinal Tremblay",
        "Zu-Cheng Chen",
        "Shi Dai",
        "Valentina Di Marco",
        "George Hobbs",
        "Agastya Kapur",
        "Wenhua Ling",
        "Marcus E. Lower",
        "Rami F. Mandow",
        "Saurav Mishra",
        "Daniel J. Reardon",
        "Christopher J. Russell",
        "Ryan M. Shannon",
        "Xing-Jiang Zhu"
      ],
      "abstract": "Frequency- and phase-resolved polarimetry of millisecond pulsars and its application to timing Małgorzata Curyło, Andrew Zic, Shuangqiang Wang, Eric Thrane, Paul D. Lasky, Jacob Cardinal Tremblay, Zu-Cheng Chen, Shi Dai, Valentina Di Marco, George Hobbs, Agastya Kapur, Wenhua Ling, Marcus E. Lower, Rami F. Mandow, Saurav Mishra, Daniel J. Reardon, Christopher J. Russell, Ryan M. Shannon, Xing-Jiang Zhu 15 pages, 5 figures, 3 tables, v2 (added missing coauthor), submitted for publication to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Pulsar timing is used for a variety of applications including tests of fundamental physics, probing the structure of neutron stars, and detecting nanohertz gravitational waves. Development of robust methods and generation of high-quality timing data is therefore of utmost importance. In this paper, we present a new technique for creating high-fidelity templates that can be used to measure the pulse times of arrival with significantly increased precision compared to existing methods. Our framework makes use of all available polarimetric information to generate frequency-dependent models of pulse-shape evolution of all four Stokes parameters. We apply this method to millisecond pulsars observed by the Parkes Pulsar Timing Array and show that it results in timing measurement uncertainties reduced up to $\\sim$20-30%. We also present, for the first time, phase- and frequency-resolved polarimetric measurements of millisecond pulsars observed with the Parkes Murriyang ultra-widebandwith-low receiver. The data, plots and the code underlying this analysis are made publicly available.",
      "pdf_url": "https://arxiv.org/pdf/2512.09220.pdf",
      "published": "2026-02-18T01:34:20.547273",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.16051",
      "title": "Graph Neural Networks for Interferometer Simulations",
      "authors": [
        "Sidharth Kannan",
        "Pooyan Goodarzi",
        "Evangelos E. Papalexakis",
        "Jonathan W. Richardson"
      ],
      "abstract": "Graph Neural Networks for Interferometer Simulations Sidharth Kannan, Pooyan Goodarzi, Evangelos E. Papalexakis, Jonathan W. Richardson 11 pages, 4 figures, Accepted and Presented to the 39th Conference on Neural Information Processing Systems (NeurIPS 2025): AI for Science Workshop Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) In recent years, graph neural networks (GNNs) have shown tremendous promise in solving problems in high energy physics, materials science, and fluid dynamics. In this work, we introduce a new application for GNNs in the physical sciences: instrumentation design. As a case study, we apply GNNs to simulate models of the Laser Interferometer Gravitational-Wave Observatory (LIGO) and show that they are capable of accurately capturing the complex optical physics at play, while achieving runtimes 815 times faster than state of the art simulation packages. We discuss the unique challenges this problem provides for machine learning models. In addition, we provide a dataset of high-fidelity optical physics simulations for three interferometer topologies, which can be used as a benchmarking suite for future work in this direction.",
      "pdf_url": "https://arxiv.org/pdf/2512.16051.pdf",
      "published": "2026-02-18T01:34:21.207743",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}