{
  "date": "2025-12-27",
  "crawl_timestamp": "2025-12-27T01:31:50.857445",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 102,
    "total_gw_papers": 9,
    "by_category": {
      "gr-qc": {
        "total": 24,
        "gw_related": 5
      },
      "astro-ph": {
        "total": 53,
        "gw_related": 4
      }
    }
  },
  "crawl_verification": {
    "total_expected": 142,
    "total_actual": 142,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 50,
        "actual_crawled": 50,
        "page_source_info": "Total of 50 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 24,
        "actual_crawled": 24,
        "page_source_info": "Total of 24 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 24,
        "actual_crawled": 24,
        "page_source_info": "Total of 24 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 15,
        "actual_crawled": 15,
        "page_source_info": "Total of 15 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 20,
        "actual_crawled": 20,
        "page_source_info": "Total of 20 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 4,
        "actual_crawled": 4,
        "page_source_info": "Total of 4 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 5,
        "actual_crawled": 5,
        "page_source_info": "Total of 5 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.20699",
      "title": "Comparing next-generation detector configurations for high-redshift gravitational wave sources with neural posterior estimation",
      "authors": [
        "Filippo Santoliquido",
        "Jacopo Tissino",
        "Ulyana Dupletsa",
        "Marica Branchesi",
        "Jan Harms"
      ],
      "abstract": "Comparing next-generation detector configurations for high-redshift gravitational wave sources with neural posterior estimation Filippo Santoliquido, Jacopo Tissino, Ulyana Dupletsa, Marica Branchesi, Jan Harms 23 pages, 12 figures, 5 tables. Comments are welcome General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) The coming decade will be crucial for determining the final design and configuration of a global network of next-generation (XG) gravitational-wave (GW) detectors, including the Einstein Telescope (ET) and Cosmic Explorer (CE). In this study and for the first time, we assess the performance of various network configurations using neural posterior estimation (NPE) implemented in Dingo-IS-a method based on normalizing flows and importance sampling that enables fast and accurate inference. We focus on a specific science case involving short-duration, massive and high-redshift binary black hole (BBH) mergers with detector-frame chirp masses $M_{\\mathrm{d}} > 100$ M$_\\odot$. These systems encompass early-Universe stellar and primordial black holes, as well as intermediate-mass black-hole binaries, for which XG observatories are expected to deliver major discoveries. Validation against standard Bayesian inference demonstrates that NPE robustly reproduces complex and disconnected posterior structures across all network configurations. For a network of two misaligned L-shaped ET detectors (2L MisA), the posterior distributions on luminosity distance can become multimodal and degenerate with the sky position, leading to less precise distance estimates compared to the triangular ET configuration. However, the number of sky-location multimodalities is substantially lower than the eight expected with the triangular ET, resulting in improved sky and volume localization. Adding CE to the network further reduces sky-position degeneracies, and the better performance of the 2L MisA configuration over the triangle remains evident.",
      "pdf_url": "https://arxiv.org/pdf/2512.20699.pdf",
      "published": "2025-12-27T01:31:49.128009",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.21151",
      "title": "Acoustic gravitational waves from primordial curvature perturbations",
      "authors": [
        "Zhuan Ning",
        "Zi-Yan Yuwen",
        "Xiang-Xi Zeng",
        "Rong-Gen Cai",
        "Shao-Jiang Wang"
      ],
      "abstract": "Acoustic gravitational waves from primordial curvature perturbations Zhuan Ning, Zi-Yan Yuwen, Xiang-Xi Zeng, Rong-Gen Cai, Shao-Jiang Wang 29 pages, 8 figures, a second companion paper (with direct numerical simulations for the acoustic gravitational waves) to the letter arXiv:2504.11275 and the long paper arXiv:2504.12243 General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Standard perturbative calculations of scalar-induced gravitational waves (SIGWs) have neglected nonperturbative effects in the large-amplitude regime. We develop a hybrid numerical framework to signify nonperturbative effects on the stochastic gravitational wave (GW) background sourced by primordial curvature perturbations, focusing on the acoustic channel (fluid motions). Fully general-relativistic, spherically symmetric simulations are used to extract nonperturbative sound-shell profiles from isolated curvature peaks; these profiles are then embedded into three-dimensional lattice evolutions of relativistic hydrodynamics coupled to transverse-traceless metric perturbations to compute the acoustic GW spectra. The acoustic signal has a peak frequency determined by the comoving shell thickness, and its amplitude is extremely sensitive to the mean comoving separation of peaks, scaling approximately as $R_{*c}^{-7}$. We find a robust causal low-frequency tail $\\propto k^{3}$, and the nonlinear hydrodynamic interactions can enhance the ultraviolet power. Comparing with SIGWs computed perturbatively from the same real-space configuration, we show that acoustic GWs can be amplified by an order of magnitude and display a peak shifted to a lower frequency in the large-amplitude regime. These results highlight the importance of nonperturbative effects for accurate predictions of stochastic GW signals induced from primordial curvature perturbations.",
      "pdf_url": "https://arxiv.org/pdf/2512.21151.pdf",
      "published": "2025-12-27T01:31:49.129856",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.21186",
      "title": "Preliminary forecasting constraint on scalar charge with LISA in non-vacuum environments",
      "authors": [
        "Tieguang Zi",
        "Chang-Qing Ye"
      ],
      "abstract": "Preliminary forecasting constraint on scalar charge with LISA in non-vacuum environments Tieguang Zi, Chang-Qing Ye 10 pages, 5 figures and 1 table will be published in EPJC (2026) General Relativity and Quantum Cosmology (gr-qc) We compute the gravitational wave signal from eccentric extreme-mass-ratio inspirals (EMRIs) embedded within beyond-vacuum environments, where the secondary object carries a scalar charge and evolves in the presence of both an accretion disk and a dark matter halo. The waveform modification is derived by incorporating the scalar charge correcting the fluxes and orbital trajectories of the secondary. Our results indicate that, under suitable parameter configurations, the influence of the scalar charge on EMRIs waveform in such environments can be distinguished from that in vacuum spacetime. For the EMRIs signal modified by the astrophysical environments, the future space-borne detector can determine the relative error of scalar charge constrained by LISA at the level of $\\sim0.1$, providing a preliminary prediction of detecting scalar charge in the beyond-vacuum spacetime.",
      "pdf_url": "https://arxiv.org/pdf/2512.21186.pdf",
      "published": "2025-12-27T01:31:49.130453",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.21328",
      "title": "When Geometry Radiates Review: Gravitational Waves in Theory, Cosmology, and Observation",
      "authors": [
        "Azadeh Maleknejad"
      ],
      "abstract": "When Geometry Radiates Review: Gravitational Waves in Theory, Cosmology, and Observation Azadeh Maleknejad 118 Pages, 41 Figs, Invited review for The Astronomy and Astrophysics Review. Comments are welcome General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Gravitational waves provide a unique window into gravity, cosmology, and high-energy physics, enabling the exploration of fundamental phenomena across a wide range of scales. This review presents a coherent and pedagogical framework that bridges foundational theory with observational frontiers. We begin by developing the theory of gravitational radiation within linearized general relativity, deriving gravitational waves as solutions to the linearized Einstein equations and clarifying their physical interpretation, polarization states, and key properties. We then deepen the discussion through a geometric perspective, tracing the connection between gravitational radiation and the algebraic structure of the Weyl tensor and its role in defining energy and angular momentum in asymptotically flat spacetimes. Extending beyond flat backgrounds, we examine gravitational waves in an expanding universe, following their evolution across cosmological epochs and their generation during inflation. Within this setting, we discuss adiabatic modes and consistency relations that reveal universal properties of long-wavelength perturbations, and derive the inflationary spectrum of vacuum gravitational waves together with their contribution to the integrated Sachs-Wolfe effect. We also survey the main observational strategies for detecting gravitational waves across a broad frequency range, including cosmic microwave background polarization, pulsar timing arrays, ground- and space-based laser interferometers, and resonant cavity detectors. We then discuss the astrophysical and cosmological mechanisms responsible for generating gravitational radiation. We conclude by summarizing the current status of the field and outlining promising directions for future theoretical and observational developments.",
      "pdf_url": "https://arxiv.org/pdf/2512.21328.pdf",
      "published": "2025-12-27T01:31:49.130843",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.20890",
      "title": "Considering lensing effect on gravitational wave signals from black holes in mass gap",
      "authors": [
        "Qiyuan Yang",
        "Zhi-Qiang You",
        "Xilong Fan"
      ],
      "abstract": "Considering lensing effect on gravitational wave signals from black holes in mass gap Qiyuan Yang, Zhi-Qiang You, Xilong Fan 10 pages,6 figures. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The pair-instability supernova (PISN) mechanism predicts a mass gap in the black hole population, where no stellar-origin black holes are expected to form. However, the binary black hole merger events GW190521 and GW231123 appear unusual, as current analyses place their component masses within the PISN mass gap. In this work, we investigate the relationship between different lensing magnifications and the inferred source-frame black hole masses for these two events. If the gravitational wave source is lensed, neglecting lensing effect can bias the inferred luminosity distance and hence the redshift, leading to an underestimation of the luminosity distance and consequently an overestimation of the source-frame masses, potentially placing them in the mass-gap region. For the two events in mass gap, when adopting a lower bound of $60 M_{\\odot}$ for the mass gap, the minimum magnifications required to shift the inferred source-frame masses below this gap boundary are found to be $\\mu=12.2$ for GW190521 and $\\mu=320.1$ for GW231123, corresponding to lensing-corrected luminosity distances of $11155\\, \\mathrm{Mpc}$ and $15207\\, \\mathrm{Mpc}$, respectively. These results provide a quantitative reference for assessing the lensing hypothesis as a possible explanation for the existence of black holes in the PISN mass gap.",
      "pdf_url": "https://arxiv.org/pdf/2512.20890.pdf",
      "published": "2025-12-27T01:31:49.133219",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.20965",
      "title": "GW241011 and GW241110: Hints of Hierarchical Mergers from the Merger Entropy Index",
      "authors": [
        "Guo-Peng Li",
        "Xi-Long Fan"
      ],
      "abstract": "GW241011 and GW241110: Hints of Hierarchical Mergers from the Merger Entropy Index Guo-Peng Li, Xi-Long Fan High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) GW241011 and GW241110 both exhibit extremely asymmetric masses, high primary spins, and significant spin-orbit misalignment, which challenge the formation of first-generation binary black hole mergers formed from stellar collapse. This implies that these two gravitational wave events might originate from the hierarchical merger mechanism, with at least one of the black holes being the remnant of a previous merger. Here we investigate the origin of hierarchical mergers for GW241011 and GW241110 using the merger entropy index which measures the efficiency of entropy transfer for binary black hole mergers in general relativity. We find that GW241011 is consistent with hierarchical mergers in dense star clusters. The origin of GW241110 remains under debate due to its large distribution uncertainty, which leads to method-dependent inference and should be taken into account when interpreting this event in terms of hierarchical mergers.",
      "pdf_url": "https://arxiv.org/pdf/2512.20965.pdf",
      "published": "2025-12-27T01:31:49.133406",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.23457",
      "title": "Black Holes as Non-Abelian Anyon Condensates: Implications for the Information Paradox",
      "authors": [
        "Sabin Roman"
      ],
      "abstract": "Black Holes as Non-Abelian Anyon Condensates: Implications for the Information Paradox Sabin Roman General Relativity and Quantum Cosmology (gr-qc) We model black holes as condensates of non-Abelian anyons forming a thin, topologically ordered, timelike shell located just outside the would-be horizon, while the interior settles into a regular, effectively empty constant-curvature vacuum. The horizon degrees of freedom are described by a finite, constrained fusion Hilbert space whose dimension, together with a quantized area spectrum, reproduces the Bekenstein-Hawking entropy and yields logarithmic and inverse-area corrections. To characterize the shell's thermodynamics, we introduce an effective collective Hamiltonian with global constraint modes; fluctuations of these constrained modes generate a logarithmic entropy correction that is consistent with the corrections obtained from area quantization. Combining the fusion-state degeneracy with the discrete area spectrum leads to a nonuniform, discrete black-hole mass spectrum and a corresponding thermally weighted emission profile. The Hawking temperature is recovered at leading order from classical equipartition on the shell, with systematic corrections controlled by the discrete spectrum. Quantum information is stored nonlocally in the fusion channels of the condensate, providing a finite microscopic Hilbert space for horizon degrees of freedom without explicitly invoking bulk trans-horizon entanglement. To address formation and consistency, we embed the shell in conformal gravity, used as an effective classical framework in the high-curvature regime, and construct a local, nonsingular matching between the regular interior, the shell, and a Schwarzschild-like exterior. The framework implies microscopic spectral discreteness and, for weak shell reflectivity, the possibility of late-time gravitational-wave echoes. Overall, our results provide a concrete microscopic model for black-hole thermodynamics and connect horizon microphysics to ideas from topological quantum computation.",
      "pdf_url": "https://arxiv.org/pdf/2507.23457.pdf",
      "published": "2025-12-27T01:31:49.135074",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.22534",
      "title": "Bayesian reconstruction of primordial perturbations from induced gravitational waves",
      "authors": [
        "Aya Ghaleb",
        "Ameek Malhotra",
        "Gianmassimo Tasinato",
        "Ivonne Zavala"
      ],
      "abstract": "Bayesian reconstruction of primordial perturbations from induced gravitational waves Aya Ghaleb, Ameek Malhotra, Gianmassimo Tasinato, Ivonne Zavala 34 pages, 15 figures. V3: version accepted PRD Phys. Rev. D 112, 123538 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The formation of primordial black holes or other dark matter relics from amplified density fluctuations in the early universe may also generate scalar-induced gravitational waves (GW), carrying vital information about the primordial power spectrum and the early expansion history of our universe. We present a Bayesian approach aimed at reconstructing both the shape of the scalar power spectrum and the universe's equation of state from GW observations, using interpolating splines to flexibly capture features in the GW data. The optimal number of spline nodes is chosen via Bayesian evidence, aiming at balancing complexity of the model and the fidelity of the reconstruction. We test our method using both representative mock data and recent Pulsar Timing Array measurements, demonstrating that it can accurately reconstruct the curvature power spectrum as well as the underlying equation of state, if different from radiation.",
      "pdf_url": "https://arxiv.org/pdf/2505.22534.pdf",
      "published": "2025-12-27T01:31:49.136055",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.20867",
      "title": "Universal relations between the quasinormal modes of neutron stars and magnetic tidal deformability",
      "authors": [
        "Hajime Sotani"
      ],
      "abstract": "Universal relations between the quasinormal modes of neutron stars and magnetic tidal deformability Hajime Sotani High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) Tidal deformabilities are one of the observable quantities characterizing neutron stars, which are strongly associated with the stellar compactness, the ratio of the stellar mass to the radius. In addition to the tidal deformability, the quasinormal modes excited in a neutron star are also an important property for extracting information about the neutron star interior, adopting gravitational wave asteroseismology. In this study, we especially focus on the magnetic tidal deformability, which acts on the gravitational waveform from a neutron star binary merger as a higher-order effect than the electric tidal deformability, and derive the universal relations expressing the quasinormal modes, such as the fundamental ($f$-), 1st pressure ($p_1$-), and 1st spacetime ($w_1$-) modes, as a function of the magnetic tidal deformability. The universal relations derived in this study exhibit accuracy more or less comparable to those of the electric tidal deformability.",
      "pdf_url": "https://arxiv.org/pdf/2512.20867.pdf",
      "published": "2025-12-27T01:31:49.640110",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    }
  ]
}