{
  "date": "2025-11-27",
  "crawl_timestamp": "2025-11-27T01:31:26.895662",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 187,
    "total_gw_papers": 20,
    "by_category": {
      "gr-qc": {
        "total": 37,
        "gw_related": 12
      },
      "astro-ph": {
        "total": 125,
        "gw_related": 7
      }
    }
  },
  "crawl_verification": {
    "total_expected": 272,
    "total_actual": 272,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 55,
        "actual_crawled": 55,
        "page_source_info": "Total of 55 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 50,
        "actual_crawled": 50,
        "page_source_info": "Total of 50 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 43,
        "actual_crawled": 43,
        "page_source_info": "Total of 43 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 51,
        "actual_crawled": 51,
        "page_source_info": "Total of 51 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 22,
        "actual_crawled": 22,
        "page_source_info": "Total of 22 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 28,
        "actual_crawled": 28,
        "page_source_info": "Total of 28 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 23,
        "actual_crawled": 23,
        "page_source_info": "Total of 23 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.19553",
      "title": "Quasinormal modes of scalar, electromagnetic, and gravitational perturbations in slowly rotating Kalb-Ramond black holes",
      "authors": [
        "Weike Deng",
        "Wentao Liu",
        "Kui Xiao",
        "Jiliang Jing"
      ],
      "abstract": "Quasinormal modes of scalar, electromagnetic, and gravitational perturbations in slowly rotating Kalb-Ramond black holes Weike Deng, Wentao Liu, Kui Xiao, Jiliang Jing General Relativity and Quantum Cosmology (gr-qc) We investigate quasinormal modes (QNMs) of scalar, electromagnetic, and axial gravitational perturbations in slowly rotating Kalb-Ramond (KR) black holes, where an antisymmetric tensor field induces spontaneous Lorentz symmetry breaking. Working consistently to first order in the dimensionless spin parameter, we derive the corresponding master equations and compute the QNM spectrum using both the continued-fraction and matrix methods, finding excellent agreement. Lorentz violation modifies the oscillation and damping rates in a unified manner across all perturbative sectors: the real part of the QNM frequency increases monotonically with the Lorentz-violating parameter $\\ell$, while the imaginary part becomes more negative. Axial gravitational modes exhibit the strongest response, revealing an intrinsic theoretical bound $\\ell< 0.5$, beyond which the spectrum approaches an extremal behavior. Our results highlight the potential of gravitational-wave spectroscopy to probe Lorentz-violating signatures in KR gravity.",
      "pdf_url": "https://arxiv.org/pdf/2511.19553.pdf",
      "published": "2025-11-27T01:31:25.865950",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19590",
      "title": "Searching Stochastic Gravitational Wave Background Landscape Across Frequency Bands",
      "authors": [
        "Yunjia Bao",
        "Tore Boybeyi",
        "Vuk Mandic",
        "Lian-Tao Wang"
      ],
      "abstract": "Searching Stochastic Gravitational Wave Background Landscape Across Frequency Bands Yunjia Bao, Tore Boybeyi, Vuk Mandic, Lian-Tao Wang 9+14 pages, 1+12 figures, 1 table General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Gravitational wave (GW) astrophysics is entering a multi-band era with upcoming GW detectors, enabling detailed mapping of the stochastic GW background across vast frequencies. We highlight this potential via a new physics scenario: hybrid topological defects from a two-step phase transition separated by inflation. We develop a general pipeline to analyze experimental exclusions and apply it to this model. The model offers a possible explanation of the pulsar timing array signal at low frequencies, and future experiments (LISA/Cosmic Explorer/Einstein Telescope) will confirm or rule it out via the higher-frequency probes, showcasing the power of multi-band constraints.",
      "pdf_url": "https://arxiv.org/pdf/2511.19590.pdf",
      "published": "2025-11-27T01:31:25.866286",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19593",
      "title": "A parametrized model for gravitational waves from eccentric, precessing binary black holes: theory-agnostic tests of General Relativity with pTEOBResumS",
      "authors": [
        "Danilo Chiaramello",
        "Nicolò Cibrario",
        "Jacob Lange",
        "Koustav Chandra",
        "Rossella Gamba",
        "Raffaella Bonino",
        "Alessandro Nagar"
      ],
      "abstract": "A parametrized model for gravitational waves from eccentric, precessing binary black holes: theory-agnostic tests of General Relativity with pTEOBResumS Danilo Chiaramello, Nicolò Cibrario, Jacob Lange, Koustav Chandra, Rossella Gamba, Raffaella Bonino, Alessandro Nagar General Relativity and Quantum Cosmology (gr-qc) Gravitational waves from binary black hole (BBH) mergers allow us to test general relativity in the strong-field, high-curvature regime. However, existing gravitational wave-based tests have so far assumed non-eccentric signal sources, limiting their applicability to more general astrophysical scenarios. In this work, we present pTEOBResumS, a new parametrized inspiral-merger-ringdown model for null tests of GR that incorporates both orbital eccentricity and spin precession. Building on the effective-one-body model TEOBResumS-Dalí, we introduce parametrized deviations from GR both in the inspiral and the merger-ringdown regimes. We validate the model via parameter estimation of synthetic signals, including from numerical relativity simulations of BBHs and a boson star binary. These allow us to establish the model's consistency, demonstrate its capability to identify beyond-GR effects, and gauge the impact of eccentricity in tests of GR. We then analyze a set of BBH events from the first three LIGO-Virgo-KAGRA observing runs, testing whether they are best explained by a GR or non-GR waveform, under either the eccentric, spin-aligned or precessing, quasi-circular hypotheses. We find no significant statistical evidence in favor of deviations from GR. Consistent with previous works, we infer a mild preference for longer remnant quasi-normal mode damping times than expected in GR, though the limited sample and potential systematics reduce its significance. In addition, when weighting by signal strength, joint posteriors combining the individual events are still compatible with GR. We find no strong evidence for imprints of orbital eccentricity in the analyzed events, with the exception of GW200129. For this, our analysis finds a strong preference for an eccentric, GR-consistent description, although as previous works have noted this result could be influenced by data quality issues.",
      "pdf_url": "https://arxiv.org/pdf/2511.19593.pdf",
      "published": "2025-11-27T01:31:25.866538",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19611",
      "title": "Effective-one-body modelling of eccentric supermassive black hole binaries for Pulsar Timing Array",
      "authors": [
        "Sara Manzini",
        "Stanislav Babak"
      ],
      "abstract": "Effective-one-body modelling of eccentric supermassive black hole binaries for Pulsar Timing Array Sara Manzini, Stanislav Babak General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Pulsar Timing Arrays (PTAs) observations will detect gravitational waves (GWs) from the early inspiral phase of supermassive black hole binaries (SMBHBs) with orbital periods of weeks to years. Current PTA analyses generally assume circular binaries; however, dynamical interactions with the surrounding environment can prevent complete circularisation, allowing SMBHBs to retain appreciable eccentricities. In this work, we present a gravitational waveform model for eccentric binaries based on the Effective-One-Body (EOB) formalism, designed for continuous GW searches in PTA data. The model is accurate up to the second post-Newtonian (2PN) order for the conservative dynamics and up to post-leading order for the radiation-reaction terms. We provide both a numerically precise and a computationally efficient approximate implementation and evaluate the latter's accuracy against the full model over a broad range of eccentricities and initial orbital frequencies. Our results show that a substantial region of the parameter space exhibits pronounced orbital evolution, much stronger than in the circular case. We demonstrate the rich harmonic structure of timing residuals induced by eccentric GWs. Properly characterising eccentric binaries is an essential step toward detecting GWs in PTA data and interpreting the results, ultimately improving our understanding of the supermassive black hole population in the local Universe.",
      "pdf_url": "https://arxiv.org/pdf/2511.19611.pdf",
      "published": "2025-11-27T01:31:25.866924",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19626",
      "title": "Universal Relations with Dynamical Tides",
      "authors": [
        "Jayana A. Saes",
        "Abhishek Hegade K. R.",
        "Nicolás Yunes"
      ],
      "abstract": "Universal Relations with Dynamical Tides Jayana A. Saes, Abhishek Hegade K. R., Nicolás Yunes General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th) Observations of neutron stars and the precise measurement of their macroscopic properties have provided valuable insights into fundamental physics, both by constraining the behavior of nuclear matter under extreme conditions and by enabling tests of general relativity in the strong-field regime. In this context, equation-of-state-insensitive or ``quasi-universal'' relations between key observables, such as the compactness, dimensionless static tidal deformability, and moment of inertia, play a crucial role in connecting different measurable observables while minimizing uncertainties due to the yet unknown equation of state. In this work, we identify new quasi-universal relations between the static, dimensionless tidal deformability ($\\Lambda^{(0)}$) and its leading-order dynamical correction ($\\Lambda^{(2)}$), as well as a combination of these parameters ($\\sqrt{\\Lambda^{(0)}/\\Lambda^{(2)}} \\equiv M\\omega_*$), obtained from the small-frequency expansion of the relativistic tidal response. We test these relations across a representative set of 63 equations of state, finding that the equation-of-state dependence does not exceed $\\sim 5\\%$ for the $\\Lambda^{(0)}$-$\\Lambda^{(2)}$ relation and $\\sim 2.5\\%$ for the $\\Lambda^{(0)}$-$M\\omega_*$ relation. This indicates a high degree of universality and offers a simplified framework for incorporating dynamical tidal effects into gravitational-wave modeling. Furthermore, we compare the fully dynamical tidal response against different recent strategies (a Taylor expansion and an effective-one-mode approximation) to model the dynamical tide. We find that both models are capable of capturing the frequency-dependent behavior of the fully dynamical tidal deformability, with the Taylor expansion outperforming the effective-one-mode approximation in most of the parameter space.",
      "pdf_url": "https://arxiv.org/pdf/2511.19626.pdf",
      "published": "2025-11-27T01:31:25.867146",
      "updated": null,
      "categories": [
        "gr-qc",
        "nucl-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19682",
      "title": "Microseismic Noise Mitigation with Machine Learning for Advanced LIGO",
      "authors": [
        "Christina Reissel",
        "Devin Lai",
        "Shivanshu Dwivedi",
        "Edgard Bonilla",
        "Claudia Geer",
        "Christopher Wipf",
        "Richard Mittleman",
        "Philip Harris",
        "Eyal Schwartz",
        "Dovi Poznanski",
        "Brian Lantz",
        "Erik Katsavounidis"
      ],
      "abstract": "Microseismic Noise Mitigation with Machine Learning for Advanced LIGO Christina Reissel, Devin Lai, Shivanshu Dwivedi, Edgard Bonilla, Claudia Geer, Christopher Wipf, Richard Mittleman, Philip Harris, Eyal Schwartz, Dovi Poznanski, Brian Lantz, Erik Katsavounidis General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) The unprecedented sensitivity of the Laser Interferometer Gravitational-Wave Observatory, which enables the detection of distant astrophysical sources, also renders the detectors highly susceptible to low-frequency ground motion. Persistent microseisms in the 0.1-0.3 Hz band couple into the instruments, degrade lock stability, and contribute substantially to detector downtime during observing runs. The multi-stage seismic isolation system has achieved remarkable success in mitigating such disturbances through active feedback control, yet residual platform motion remains a key factor limiting low-frequency sensitivity and duty cycle. Further reduction of this residual motion is therefore critical for improving the long-term stability and overall astrophysical reach of the observatories. In this work, we develop a data-driven approach that uses machine learning to model and suppress residual seismic motion within the isolation system. Ground and platform sensor data from the detectors are used to train a neural network that predicts platform motion driven by microseismic activity. When incorporated into the control scheme, the network's predictions yield up to an order-of-magnitude reduction in residual motion compared to conventional linear filtering methods, revealing that nonlinear couplings play a significant role in limiting current isolation performance. These results demonstrate that machine-learning-based control can provide a powerful new pathway for enhancing active seismic isolation, improving lock robustness, and extending the low-frequency observational capabilities of gravitational-wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2511.19682.pdf",
      "published": "2025-11-27T01:31:25.867394",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19898",
      "title": "Quintessential Inflation in Light of ACT DR6",
      "authors": [
        "Sayantan Choudhury",
        "Swapnil Kumar Singh",
        "Satish Kumar Sahoo"
      ],
      "abstract": "Quintessential Inflation in Light of ACT DR6 Sayantan Choudhury, Swapnil Kumar Singh, Satish Kumar Sahoo 10 pages, 5 figures, 1 table, Comments are welcome General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We perform a precision investigation of smooth quintessential inflation in which a single canonical scalar field unifies the two known phases of cosmic acceleration. Using a CMB-normalized runaway exponential potential, we obtain sharply predictive inflationary observables: a red-tilted spectrum with $n_s = 0.964241$ and an exceptionally suppressed tensor-to-scalar ratio $r = 7.48 \\times 10^{-5}$ at $N=60$, lying near the optimal region of current Planck+ACT constraints. Remarkably, all observable scales exit the horizon within an extremely narrow field interval $\\Delta\\phi \\simeq 0.03\\,M_{\\rm Pl}$, tightly linking early and late-time dynamics and reducing theoretical ambiguities. While inflationary tensors remain invisible to CMB B-mode surveys, the subsequent stiff epoch-an intrinsic hallmark of quintessential cosmology-imprints a blue-tilted stochastic gravitational-wave background within the discovery reach of future interferometers such as LISA, DECIGO, ALIA, and BBO. Our results demonstrate that this minimal, featureless model not only survives current bounds, but provides concrete, falsifiable predictions across gravitational-wave frequencies spanning over twenty orders of magnitude.",
      "pdf_url": "https://arxiv.org/pdf/2511.19898.pdf",
      "published": "2025-11-27T01:31:25.867955",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19911",
      "title": "Search for planetary-mass ultra-compact binaries using data from the first part of the LIGO--Virgo--KAGRA fourth observing run",
      "authors": [
        "The LIGO Scientific Collaboration",
        "Virgo Collaboration",
        "KAGRA Collaboration"
      ],
      "abstract": "Search for planetary-mass ultra-compact binaries using data from the first part of the LIGO--Virgo--KAGRA fourth observing run The LIGO Scientific Collaboration, Virgo Collaboration, KAGRA Collaboration 6 pages (main) + 7 pages (appendix) + refs; 8 figures General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a search for gravitational waves from inspiraling, planetary-mass ultra-compact binaries using data from the first part of the fourth observing run of LIGO, Virgo and KAGRA. Finding no evidence of such systems, we determine the maximum distance reach for such objects and their merger rate densities, independently of how they could have formed. Then, we identify classes of primordial black-hole mass distributions for which these rate limits can be translated into relevant constraints on the mass distribution of primordial black holes, assuming that they compose all of dark matter, in the mass range $[10^{-6},10^{-3}]M_\\odot$. Our constraints are consistent with existing microlensing results in the planetary-mass range, and provide a complementary probe to sub-solar mass objects.",
      "pdf_url": "https://arxiv.org/pdf/2511.19911.pdf",
      "published": "2025-11-27T01:31:25.868322",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.20301",
      "title": "Quasi-Normal Mode Ringing of Binary Black Hole Mergers in Scalar-Gauss-Bonnet Gravity",
      "authors": [
        "Zexin Hu",
        "Daniela D. Doneva",
        "Stoytcho S. Yazadjiev",
        "Lijing Shao"
      ],
      "abstract": "Quasi-Normal Mode Ringing of Binary Black Hole Mergers in Scalar-Gauss-Bonnet Gravity Zexin Hu, Daniela D. Doneva, Stoytcho S. Yazadjiev, Lijing Shao General Relativity and Quantum Cosmology (gr-qc) Observations of gravitational waves (GWs) generated by binary black hole (BBH) mergers provide us with a powerful way to explore the strong and highly dynamical regime of gravity theories. The ringdown of BBH merger, consisting of a series of quasi-normal modes (QNMs), is of particular interest for both the black hole (BH) spectroscopy and the inspiral-merger-ringdown consistency check. Unlike the QNM frequencies that only depend on the properties of the remnant BH, the excitation amplitudes and phases of QNMs depend on the progenitor system, and calculating them is beyond the perturbative approach. In this paper, by performing self-consistent fully non-linear simulations of BBH merger in shift-symmetric scalar-Gauss-Bonnet (sGB) gravity as well as in sGB gravity allowing for scalarization, and extracting the QNM excitation, we explore the possible deviations from GR at the ringdown stage. We numerically verify that the mode frequencies are consistent with the theory prediction, and provide the fitting results of mode amplitudes and phases. We find relatively small changes in the mode excitation, considering that the largest coupling we used in the simulations is close to the limit of loss of hyperbolicity. To demonstrate that our results are robust against the eccentricity caused by the imperfect initial data, we also perform eccentricity reduction and estimate the effect caused by the initial eccentricity. These studies are useful for understanding the ringdown in sGB gravity.",
      "pdf_url": "https://arxiv.org/pdf/2511.20301.pdf",
      "published": "2025-11-27T01:31:25.868878",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.20435",
      "title": "Resolving white dwarf binaries within globular clusters with LISA",
      "authors": [
        "Wouter G. J. van Zeist",
        "Gijs Nelemans",
        "Shu-Xu Yi",
        "Simon F. Portegies Zwart"
      ],
      "abstract": "Resolving white dwarf binaries within globular clusters with LISA Wouter G. J. van Zeist, Gijs Nelemans, Shu-Xu Yi, Simon F. Portegies Zwart 11 pages, 6 figures, 2 tables. Accepted by A&A General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA) Context: Globular clusters (GCs) around the Milky Way (MW) are expected to host white dwarf (WD) binaries emitting gravitational waves that could be detectable by LISA. Aims: Our aim is to investigate whether LISA can resolve WD binaries in GCs well enough in terms of sky location and distance that they can be distinguished from binaries in the MW disc. Methods: We used a sample of 20 of the most massive GCs around the MW and simulated LISA's sky location and distance measurement errors for WD binaries in these GCs using the software package GWToolbox. We did this in the context of a model of the LISA-detectable binaries in the MW from the population synthesis code SeBa. Results: We find that for five of the GCs in our sample, binaries in the GC could be easily distinguished from MW disc binaries using the sky location alone; for another five, binaries in the GCs could be distinguished using a combination of LISA's sky location and distance measurements; and for the final ten, binaries in the GCs could not be distinguished from overlapping MW disc binaries. The results depend strongly on the sky locations of the GCs, with GCs far away from the Galactic plane being easy to resolve, while GCs close to the Galactic centre overlap with many MW disc binaries. The most promising GC for finding a WD binary that could be resolved to that GC, based on sky location and GC mass, is 47 Tucanae.",
      "pdf_url": "https://arxiv.org/pdf/2511.20435.pdf",
      "published": "2025-11-27T01:31:25.869533",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.GA"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19243",
      "title": "What do gravitational-wave observations tell us about Luminous Red Novae?",
      "authors": [
        "Dhruv Jain",
        "Shasvath J. Kapadia",
        "Kuntal Misra",
        "Dimple",
        "L. Resmi",
        "Ajay Kumar Singh",
        "K. G. Arun"
      ],
      "abstract": "What do gravitational-wave observations tell us about Luminous Red Novae? Dhruv Jain, Shasvath J. Kapadia, Kuntal Misra, Dimple, L. Resmi, Ajay Kumar Singh, K. G. Arun 7 Pages, 3 figures, 1 Table; To be Submitted in ApJL High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Luminous Red Novae (LRNe) have been argued to be related to the ejection of common envelopes (CEs) in binary star systems. Ejection of CEs leads to tightened stellar orbits capable of forming compact binaries that merge in Hubble time. As these mergers are seen by gravitational-wave (GW) detectors such as LIGO, Virgo and KAGRA (LVK), we ask what the merger rates of compact binaries in LVK tell us about the fraction of LRNe that lead to the formation of compact binaries that merge in Hubble time. Using the observed volumetric rates of LRNe from the Zwicky Transient Facility (ZTF) and of compact binary mergers from LVK observations, we derive limits on the fraction of LRNe that produce compact binaries that merge in Hubble time. Assuming the LRNe rate closely follows the star formation rate at any redshift, we use the delay time distribution models for compact binaries to compute the compact binary merger rate. A comparison of this merger rate with the latest volumetric rates of compact binary mergers from the fourth GW transient catalog (GWTC-4) at the present epoch of LVK allows us to constrain the above fraction. We find that only a fraction as small as $\\sim 10^{-3}$ (median) of the LRNe correspond to the GW-observed binary neutron star (BNS) and neutron star-black hole (NSBH) mergers. This potentially implies that the majority of the LRNe population will not lead to mergers of compact objects, but other end products, such as stellar mergers.",
      "pdf_url": "https://arxiv.org/pdf/2511.19243.pdf",
      "published": "2025-11-27T01:31:25.870609",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19586",
      "title": "Stringent Constraints on Gravitational Wave Signatures of Dark Electromagnetism in Neutron Star Binaries",
      "authors": [
        "Ian Harris",
        "Yonatan Kahn"
      ],
      "abstract": "Stringent Constraints on Gravitational Wave Signatures of Dark Electromagnetism in Neutron Star Binaries Ian Harris, Yonatan Kahn High Energy Physics - Phenomenology (hep-ph); General Relativity and Quantum Cosmology (gr-qc) Gravitational wave interferometers have studied compact object mergers and solidified our understanding of strong gravity. Their increasing precision raises the possibility of detecting new physics, especially in a neutron star binary system that may contain hidden-sector particles. In particular, a new vector force between binary constituents, giving rise to dark electromagnetic phenomena, could measurably alter the inspiral waveforms and thus be constrained by gravitational wave observations. In this work, we critically examine the mechanisms for neutron stars to acquire enough hidden-sector particles with requisite couplings to furnish a detectable signature from dark electromagnetism. We demonstrate that the repulsive nature of vector forces imposes stringent constraints on any putative particle physics model or astrophysical environment which could give rise to such gravitational signatures. We argue that absent an extreme fine-tuning of parameters, such signatures are well out of reach of any current or near-future gravitational wave observatory.",
      "pdf_url": "https://arxiv.org/pdf/2511.19586.pdf",
      "published": "2025-11-27T01:31:25.871213",
      "updated": null,
      "categories": [
        "hep-ph",
        "gr-qc"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.19762",
      "title": "The Speed of Gravity and the Fate of Dark Energy",
      "authors": [
        "Jeremy Sakstein",
        "Bhuvnesh Jain"
      ],
      "abstract": "The Speed of Gravity and the Fate of Dark Energy Jeremy Sakstein, Bhuvnesh Jain Frontiers of Science Award, Proceedings of the International Congress of Basic Science, 2025 Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) On August 17$^{\\rm th}$ 2017, observatories worldwide made a landmark detection: gravitational waves and light from a binary neutron star merger. This event revolutionized our understanding of astrophysics, cosmology, and gravitation. In this proceeding of the 2025 International Congress of Basic Science, we describe how it transformed our view of cosmic acceleration (dark energy). The near-simultaneous arrival of light and gravitational waves shows that their speeds agree to within one part in $10^{15}$, excluding large classes of modified gravity theories and interactions between dark energy and matter.",
      "pdf_url": "https://arxiv.org/pdf/2511.19762.pdf",
      "published": "2025-11-27T01:31:25.872036",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2301.08319",
      "title": "Hamilton-Jacobi analysis of noncanonical inflation in $f(R, T)$ gravity: Constraints from Planck/ACT data, and theoretical bounds",
      "authors": [
        "Z. Ossoulian",
        "T. Golanbari",
        "Kh. Saaidi"
      ],
      "abstract": "Hamilton-Jacobi analysis of noncanonical inflation in $f(R, T)$ gravity: Constraints from Planck/ACT data, and theoretical bounds Z. Ossoulian, T. Golanbari, Kh. Saaidi General Relativity and Quantum Cosmology (gr-qc) The latest CMB data from ACT DR6, combined with Planck, DESI, and BICEP/Keck, indicate a slight upward shift in the scalar spectral index, placing several previously favored inflationary models under tension. We study an inflationary scenario within the framework of $f(R, T)$ gravity, featuring a nonminimal matter-curvature coupling, where the inflaton is a noncanonical scalar field with a generalized kinetic energy. Using the Hamilton-Jacobi formalism, we express the Hubble parameter as a function of the scalar field and consider two forms of $H(\\phi)$, a power-law and an exponential one, deriving the scalar spectral index $n_s$ and tensor-to-scalar ratio $r$. Comparison with ACT DR6 allows us to explore the parameter space, showing that the power-law case is compatible with the data across a wide range, while the exponential form requires a large number of e-folds. We then study reheating, noting its close link with the inflationary dynamics. By imposing the bound on overproduction of primordial gravitational waves encoded in the constraint on $\\Delta N_{\\text{eff}}$, we obtain a lower limit on the reheating temperature, which becomes particularly restrictive for the stiff reheating equation of state $\\omega_{\\text{re}}$. This bound implies that the total number of e-folds should not exceed $N\\lesssim 64(65)$. The predicted gravitational-wave spectrum shows an enhanced high-frequency amplitude, potentially observable by future detectors. We also examine consistency with the Swampland conjectures and the Trans-Planckian Censorship Conjecture, finding that combining $f(R, T)$ gravity with noncanonical dynamics provides a rich and testable framework for the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2301.08319.pdf",
      "published": "2025-11-27T01:31:25.872807",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.13642",
      "title": "Coupling between gravitational and electromagnetic perturbations on Kerr Spacetime",
      "authors": [
        "Fawzi Aly",
        "Dejan Stojkovic"
      ],
      "abstract": "Coupling between gravitational and electromagnetic perturbations on Kerr Spacetime Fawzi Aly, Dejan Stojkovic General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) We extend our previous Schwarzschild metric-based studies of gravitational--electromagnetic (GEM) coupling to rotating black holes by working directly in a curvature-based Newman--Penrose/Teukolsky framework on Kerr spacetime. Within a minimally coupled Einstein--Maxwell system, we derive explicit quadratic electromagnetic source terms for the spin-$-2$ Teukolsky equation, providing a foundation for future numerical studies of GEM interactions in the framework of black-hole spectroscopy. Moreover, we give order-of-magnitude arguments showing that GEM quadratic quasinormal modes (QQNMs) can become relevant in a range of charged and magnetized astrophysical scenarios. Finally, we show through a brief dilaton-theory example that the GEM QQNM spectrum is sensitive to how gravity couples to electromagnetism, thereby providing a model-based way to test minimal coupling and to constrain hidden $U(1)$ sectors with gravitational-wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.13642.pdf",
      "published": "2025-11-27T01:31:25.873944",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.20436",
      "title": "The effect of sound speed on the gravitational wave spectrum of first order phase transitions in the early universe",
      "authors": [
        "Mika Mäki"
      ],
      "abstract": "The effect of sound speed on the gravitational wave spectrum of first order phase transitions in the early universe Mika Mäki MSc thesis, 64 pages, 8 figures. This version has been updated from the original published thesis to provide an up-to-date reference manual for PTtools. This version uses PTtools 0.10.0. this http URL this https URL this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Gravitational waves from first-order phase transitions are a promising probe of physics beyond the Standard Model, as many extensions of the standard model result in first-order phase transitions in the early universe, from which the resulting gravitational waves could be detectable with the upcoming Laser Interferometer Space Antenna (LISA). The properties of the phase transition and the resulting gravitational wave spectrum are determined by five key parameters: the nucleation temperature $T_n$, phase transition strength at the nucleation temperature $\\alpha_n$, bubble wall speed $v_\\text{wall}$, transition rate $\\beta$ and the sound speed $c_s$. Of these, the sound speed $c_s$ is determined by the equation of state $p(T,\\phi)$. In most studies, the plasma of the early universe has been assumed to be ultrarelativistic and therefore following the bag equation of state with $c_s = \\frac{1}{\\sqrt{3}}$. In this thesis, the PTtools simulation framework for first-order phase transitions, based on the Sound Shell Model, has been extended to include support for arbitrary equations of state and therefore for a temperature- and phase-dependent sound speed $c_s(T,\\phi)$. The thesis also functions as a reference manual for PTtools. The framework has been tested with the constant sound speed model, in which the sound speed is a different constant in each phase. The sound speed has been shown to have a significant effect on the resulting gravitational wave spectrum, especially when changing the sound speed results in a change in the type of the solution. This has laid the groundwork for simulating cosmological phase transitions with realistic equations of state. This will result in in gravitational wave spectra that can be used in the LISA data analysis pipeline to search for the existence and parameters of a first-order phase transition in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2511.20436.pdf",
      "published": "2025-11-27T01:31:26.197492",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.12932",
      "title": "Strategy for identifying Vera C. Rubin Observatory kilonova candidates for targeted gravitational-wave searches",
      "authors": [
        "Simon Stevenson",
        "Anais Möller",
        "Jade Powell"
      ],
      "abstract": "Strategy for identifying Vera C. Rubin Observatory kilonova candidates for targeted gravitational-wave searches Simon Stevenson, Anais Möller, Jade Powell 17 pages, 7 figures, accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Since the observation of the binary neutron star merger GW170817 and the associated kilonova AT2017gfo, the next joint gravitational-wave/optical kilonova has been highly anticipated. Overlapping observations between the Vera C. Rubin Observatory and the international gravitational-wave detector network are expected soon. Wide-field survey facilities, such as Rubin, can serve dual roles in gravitational-wave astronomy: conducting dedicated optical counterpart searches following gravitational-wave triggers and, through surveys such as the Legacy Survey of Space and Time (LSST), providing opportunities for fortuitous kilonova discoveries during routine operations. We use simulations to develop a strategy for identifying kilonova candidates observed by Rubin and processed by the Fink broker. These candidates can be used as astrophysical triggers for a targeted gravitational-wave search. We simulate kilonovae light-curves for the first year of Rubin with the latest observing strategy for the Wide-Fast-Deep and the Deep Drilling Fields. Assuming a kilonova rate of 250 Gpc$^{-3}$ yr$^{-1}$, we find that Rubin brokers should observe $\\sim 4$ kilonovae per year with at least one alert above a signal-to-noise ratio of 5 within the gravitational-wave detector horizon ($\\sim 350$ Mpc). Most of these will be faint, and detected 1-2 days following the neutron star merger. Photometric and spectroscopic follow-up will be limited to large telescopes. Using archival data from the Zwicky Transient Facility (ZTF) and our proposed selection criteria, we estimate a minimum contamination of at least 30 events per month from other transients and variables, even under our strictest selection criteria. A deep gravitational-wave search targeting Rubin kilonova candidates may lead to the next multi-messenger discovery.",
      "pdf_url": "https://arxiv.org/pdf/2510.12932.pdf",
      "published": "2025-11-27T01:31:26.218938",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.20477",
      "title": "Rotational effects in quark stars: comparing different models",
      "authors": [
        "Adamu Issifu",
        "Andreas Konstantinou",
        "Franciele M. da Silva",
        "Tobias Frederico"
      ],
      "abstract": "Rotational effects in quark stars: comparing different models Adamu Issifu, Andreas Konstantinou, Franciele M. da Silva, Tobias Frederico High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the rotational properties of self-bound strange quark stars using two representative quark matter equations of state (EOS): the vector MIT bag model and the density-dependent quark mass (DDQM) model. Through general-relativistic calculations of uniformly rotating sequences, we analyze their mass--radius relations, moments of inertia, quadrupole moments, surface redshifts, Keplerian frequencies, and energy components. A central result of this work is the full decomposition of the stellar energy budget in rotating strange stars, separating gravitational, internal, rotational, and binding energy contributions. Rotation amplifies the intrinsic EOS differences: the MIT model supports more massive ($M_{\\max} \\gtrsim 3.3\\,M_\\odot$) compact stars with larger moments of inertia and greater resistance to deformation, while the DDQM model produces larger radii, less massive stars limited by mass-shedding at lower frequencies. Combined measurements of mass, radius, and frequency can thus break the EOS degeneracy; massive, rapidly rotating pulsars favors MIT-like EOS, whereas larger radii in canonical stars point to a DDQM-like model. These rotational observables, soon to be tightly constrained by NICER and next-generation gravitational-wave detectors, offer a means to test the existence and composition of self-bound quark matter in compact stars.",
      "pdf_url": "https://arxiv.org/pdf/2511.20477.pdf",
      "published": "2025-11-27T01:31:26.398211",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2504.05600",
      "title": "Gravitational Wave Evidence of Spin Energy Extraction from Stellar-Mass Black Holes",
      "authors": [
        "Shu-Xu Yi",
        "Tian-Yong Cao",
        "Shuang-Nan Zhang"
      ],
      "abstract": "Gravitational Wave Evidence of Spin Energy Extraction from Stellar-Mass Black Holes Shu-Xu Yi, Tian-Yong Cao, Shuang-Nan Zhang 17 pages, 6 figures. 3rd version of the manuscript originally titled \"A universal natal spin in stell-mass black holes\" High Energy Astrophysical Phenomena (astro-ph.HE) Relativistic jets have been found for decades as a key phenomenon in active galactic nuclei (AGNs), compact binary systems, and gamma-ray bursts (GRBs), yet their energy resources remain a mystery. Two competing ideas prevail: one attributes jet energy to accretion power of the black hole (BH), the other, more interestingly, to magnetic extraction of rotational energy from the BH. A decisive observational distinction between them is still elusive. We propose that BHs remnant from their natal GRB activity can serve as a critical testbed to discriminate between these two scenarios. Via analytical approaches, we demonstrate that extraction of rotational energy to power jets during the GRB phase drives the remnant BH to a universal equilibrium spin, independent of accretion history, initial spin, and mass. This model predicts a stellar-mass BH population with this universal spin, a hallmark of BH spin energy extraction. Testing against the 4th gravitational wave (GW) catalogue (GWTC-4.0), we find a statistically robust dominant population where secondary BH spins are narrowly centered at $\\sim0.05$. These findings provide strong new evidence for BH spin energy extraction.",
      "pdf_url": "https://arxiv.org/pdf/2504.05600.pdf",
      "published": "2025-11-27T01:31:26.402096",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02301",
      "title": "Relativistic Jets and Winds in Radio-Identified Supermassive Black Hole Binary Candidates",
      "authors": [
        "Andrew G. Sullivan",
        "Roger D. Blandford",
        "Anna Synani",
        "Philipe V. de la Parra",
        "Noémie Globus",
        "Mitchell C. Begelman",
        "Anthony C.S. Readhead"
      ],
      "abstract": "Relativistic Jets and Winds in Radio-Identified Supermassive Black Hole Binary Candidates Andrew G. Sullivan, Roger D. Blandford, Anna Synani, Philipe V. de la Parra, Noémie Globus, Mitchell C. Begelman, Anthony C.S. Readhead 13 pages, 8 figures, Accepted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Plasma Physics (physics.plasm-ph) Supermassive black hole binary systems (SMBHBs) are thought to emit the recently discovered nHz gravitational wave background; however, not a single individual nHz source has been confirmed to date. Long-term radio-monitoring at the Owens Valley Radio Observatory has revealed two potential SMBHB candidates: blazars PKS 2131-021 and PKS J0805-0111. These sources show periodic flux density variations across the electromagnetic spectrum, signaling the presence of a good clock. To explain the emission, we propose a generalizable jet model, where a mildly relativistic wind creates an outward-moving helical channel, along which the ultra-relativistic jet propagates. The observed flux variation from the jet is mostly due to aberration. The emission at lower frequency arises at larger radius and its variation is consequently delayed, as observed. Our model reproduces the main observable features of both sources and can be applied to other sources as they are discovered. We make predictions for radio polarization, direct imaging, and emission line variation, which can be tested with forthcoming observations. Our results motivate future numerical simulations of jetted SMBHB systems and have implications for the fueling, structure, and evolution of blazar jets.",
      "pdf_url": "https://arxiv.org/pdf/2510.02301.pdf",
      "published": "2025-11-27T01:31:26.402475",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}