{
  "date": "2025-09-11",
  "crawl_timestamp": "2025-09-11T13:48:33.538582",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 147,
    "total_gw_papers": 26,
    "by_category": {
      "gr-qc": {
        "total": 28,
        "gw_related": 10
      },
      "astro-ph": {
        "total": 98,
        "gw_related": 12
      }
    }
  },
  "crawl_verification": {
    "total_expected": 219,
    "total_actual": 219,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 51,
        "actual_crawled": 51,
        "page_source_info": "Total of 51 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 42,
        "actual_crawled": 42,
        "page_source_info": "Total of 42 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 38,
        "actual_crawled": 38,
        "page_source_info": "Total of 38 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 35,
        "actual_crawled": 35,
        "page_source_info": "Total of 35 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 20,
        "actual_crawled": 20,
        "page_source_info": "Total of 20 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 14,
        "actual_crawled": 14,
        "page_source_info": "Total of 14 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2509.08054",
      "title": "GW250114: testing Hawking's area law and the Kerr nature of black holes",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration: A. G. Abac",
        "I. Abouelfettouh",
        "F. Acernese",
        "K. Ackley",
        "C. Adamcewicz",
        "S. Adhicary",
        "D. Adhikari",
        "N. Adhikari",
        "R. X. Adhikari",
        "V. K. Adkins",
        "S. Afroz",
        "A. Agapito",
        "D. Agarwal",
        "M. Agathos",
        "N. Aggarwal",
        "S. Aggarwal",
        "O. D. Aguiar",
        "I.-L. Ahrend",
        "L. Aiello",
        "A. Ain",
        "P. Ajith",
        "T. Akutsu",
        "S. Albanesi",
        "W. Ali",
        "S. Al-Kershi",
        "C. Alléné",
        "A. Allocca",
        "S. Al-Shammari",
        "P. A. Altin",
        "S. Alvarez-Lopez",
        "W. Amar",
        "O. Amarasinghe",
        "A. Amato",
        "F. Amicucci",
        "C. Amra",
        "A. Ananyeva",
        "S. B. Anderson",
        "W. G. Anderson",
        "M. Andia",
        "M. Ando",
        "M. Andrés-Carcasona",
        "T. Andrić",
        "J. Anglin",
        "S. Ansoldi",
        "J. M. Antelis",
        "S. Antier",
        "M. Aoumi",
        "E. Z. Appavuravther",
        "S. Appert",
        "S. K. Apple",
        "K. Arai",
        "A. Araya",
        "M. C. Araya",
        "M. Arca Sedda",
        "J. S. Areeda",
        "N. Aritomi",
        "F. Armato",
        "S. Armstrong",
        "N. Arnaud",
        "M. Arogeti",
        "S. M. Aronson",
        "G. Ashton",
        "Y. Aso",
        "L. Asprea",
        "M. Assiduo",
        "S. Assis de Souza Melo",
        "S. M. Aston",
        "P. Astone",
        "F. Attadio",
        "F. Aubin",
        "K. AultONeal",
        "G. Avallone",
        "E. A. Avila",
        "S. Babak",
        "C. Badger",
        "S. Bae",
        "S. Bagnasco",
        "L. Baiotti",
        "R. Bajpai",
        "T. Baka",
        "A. M. Baker",
        "K. A. Baker",
        "T. Baker",
        "G. Baldi",
        "N. Baldicchi",
        "M. Ball",
        "G. Ballardin",
        "S. W. Ballmer",
        "S. Banagiri",
        "B. Banerjee",
        "D. Bankar",
        "T. M. Baptiste",
        "P. Baral",
        "M. Baratti",
        "J. C. Barayoga",
        "B. C. Barish",
        "D. Barker"
      ],
      "abstract": "GW250114: testing Hawking's area law and the Kerr nature of black holes The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration: A. G. Abac, I. Abouelfettouh, F. Acernese, K. Ackley, C. Adamcewicz, S. Adhicary, D. Adhikari, N. Adhikari, R. X. Adhikari, V. K. Adkins, S. Afroz, A. Agapito, D. Agarwal, M. Agathos, N. Aggarwal, S. Aggarwal, O. D. Aguiar, I.-L. Ahrend, L. Aiello, A. Ain, P. Ajith, T. Akutsu, S. Albanesi, W. Ali, S. Al-Kershi, C. Alléné, A. Allocca, S. Al-Shammari, P. A. Altin, S. Alvarez-Lopez, W. Amar, O. Amarasinghe, A. Amato, F. Amicucci, C. Amra, A. Ananyeva, S. B. Anderson, W. G. Anderson, M. Andia, M. Ando, M. Andrés-Carcasona, T. Andrić, J. Anglin, S. Ansoldi, J. M. Antelis, S. Antier, M. Aoumi, E. Z. Appavuravther, S. Appert, S. K. Apple, K. Arai, A. Araya, M. C. Araya, M. Arca Sedda, J. S. Areeda, N. Aritomi, F. Armato, S. Armstrong, N. Arnaud, M. Arogeti, S. M. Aronson, G. Ashton, Y. Aso, L. Asprea, M. Assiduo, S. Assis de Souza Melo, S. M. Aston, P. Astone, F. Attadio, F. Aubin, K. AultONeal, G. Avallone, E. A. Avila, S. Babak, C. Badger, S. Bae, S. Bagnasco, L. Baiotti, R. Bajpai, T. Baka, A. M. Baker, K. A. Baker, T. Baker, G. Baldi, N. Baldicchi, M. Ball, G. Ballardin, S. W. Ballmer, S. Banagiri, B. Banerjee, D. Bankar, T. M. Baptiste, P. Baral, M. Baratti, J. C. Barayoga, B. C. Barish, D. Barker 6 pages, 5 figures (plus supplement) General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) The gravitational-wave signal GW250114 was observed by the two LIGO detectors with a network matched-filter signal-to-noise ratio of 80. The signal was emitted by the coalescence of two black holes with near-equal masses $m_1 = 33.6^{+1.2}_{-0.8}\\,M_\\odot$ and $m_2 = 32.2^{+0.8}_{-1.3}\\,M_\\odot$, and small spins $\\chi_{1,2} \\leq 0.26$ (90% credibility) and negligible eccentricity $e \\leq 0.03$. Post-merger data excluding the peak region are consistent with the dominant quadrupolar $(\\ell = |m| = 2)$ mode of a Kerr black hole and its first overtone. We constrain the modes' frequencies to $\\pm 30\\%$ of the Kerr spectrum, providing a test of the remnant's Kerr nature. We also examine Hawking's area law, also known as the second law of black hole mechanics, which states that the total area of the black hole event horizons cannot decrease with time. A range of analyses that exclude up to 5 of the strongest merger cycles confirm that the remnant area is larger than the sum of the initial areas to high credibility.",
      "pdf_url": "https://arxiv.org/pdf/2509.08054.pdf",
      "published": "2025-09-11T13:48:31.258610",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08099",
      "title": "Black Hole Spectroscopy and Tests of General Relativity with GW250114",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration"
      ],
      "abstract": "Black Hole Spectroscopy and Tests of General Relativity with GW250114 The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration Associated data release at this https URL General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) The binary black hole signal GW250114, the loudest gravitational wave detected to date, offers a unique opportunity to test Einstein's general relativity (GR) in the high-velocity, strong-gravity regime and probe whether the remnant conforms to the Kerr metric. Upon perturbation, black holes emit a spectrum of damped sinusoids with specific, complex frequencies. Our analysis of the post-merger signal shows that at least two quasi-normal modes are required to explain the data, with the most damped remaining statistically significant for about one cycle. We probe the remnant's Kerr nature by constraining the spectroscopic pattern of the dominant quadrupolar ($\\ell = m = 2$) mode and its first overtone to match the Kerr prediction to tens of percent at multiple post-peak times. The measured mode amplitudes and phases agree with a numerical-relativity simulation having parameters close to GW250114. By fitting a parameterized waveform that incorporates the full inspiral-merger-ringdown sequence, we constrain the fundamental $(\\ell=m=4)$ mode to tens of percent and bound the quadrupolar frequency to within a few percent of the GR prediction. We perform a suite of tests -- spanning inspiral, merger, and ringdown -- finding constraints that are comparable to, and in some cases 2-3 times more stringent than those obtained by combining dozens of events in the fourth Gravitational-Wave Transient Catalog. These results constitute the most stringent single-event verification of GR and the Kerr nature of black holes to date, and outline the power of black-hole spectroscopy for future gravitational-wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.08099.pdf",
      "published": "2025-09-11T13:48:31.258732",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08273",
      "title": "New test of modified gravity with gravitational wave experiments",
      "authors": [
        "N. M. Jiménez Cruz",
        "Flavio C. Sánchez",
        "Gianmassimo Tasinato"
      ],
      "abstract": "New test of modified gravity with gravitational wave experiments N. M. Jiménez Cruz, Flavio C. Sánchez, Gianmassimo Tasinato General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We propose a new strategy to probe non-tensorial polarizations in the stochastic gravitational-wave (GW) background. Averaging over polarization angles, we find that three-point correlations of the GW signal vanish for tensor and vector modes, while scalar modes generically leave a nonzero imprint. This property makes the GW bispectrum a distinctive and robust diagnostic of scalar polarizations predicted in theories beyond General Relativity. We derive the corresponding response functions for ground-based interferometers, pulsar timing arrays, and astrometric observables, and we construct an optimal estimator together with simple Fisher forecasts for pulsar-timing sensitivity. As a proof of principle, we show that second-order GWs sourced by primordial magnetogenesis can be characterized by large three-point functions. Our results demonstrate that GW three-point correlations provide a novel observational window on physics beyond General Relativity.",
      "pdf_url": "https://arxiv.org/pdf/2509.08273.pdf",
      "published": "2025-09-11T13:48:31.258826",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08569",
      "title": "Gravitational radiation reaction around a static black hole surrounded by a Dehnen type dark matter halo",
      "authors": [
        "Amjad Ashoorioon",
        "Roberto Casadio",
        "Khadije Jafarzade",
        "Mohammad B. Jahani Poshteh",
        "Orlando Luongo"
      ],
      "abstract": "Gravitational radiation reaction around a static black hole surrounded by a Dehnen type dark matter halo Amjad Ashoorioon, Roberto Casadio, Khadije Jafarzade, Mohammad B. Jahani Poshteh, Orlando Luongo General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We consider the motion of a particle in the geometry of a Schwarzschild-like black hole embedded in a dark matter (DM) halo with Dehnen type density profile and calculate the orbital periods along with the evolution of the semi-latus rectum and eccentricity for extreme mass ratio inspirals (EMRIs). Such a system emits gravitational waves (GWs), and the particle's orbit evolves under radiation reaction. We also consider the effects of dynamical friction and accretion of DM on the orbital parameters. We find that the eccentricity and semi-latus rectum decrease faster with respect to the case in which EMRI is in empty spacetime.",
      "pdf_url": "https://arxiv.org/pdf/2509.08569.pdf",
      "published": "2025-09-11T13:48:31.259683",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08657",
      "title": "Decisive Evidence for the First Overtone Mode in the Ringdown Signal of GW231028",
      "authors": [
        "Hai-Tian Wang"
      ],
      "abstract": "Decisive Evidence for the First Overtone Mode in the Ringdown Signal of GW231028 Hai-Tian Wang General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) The properties of a remnant black hole can be probed by analyzing the gravitational waves emitted during its ringdown phase. This signal provides a direct test of general relativity in the strong-field regime. In this study, we apply a time-domain F-statistic framework to the ringdown of GW231028_153006 and find decisive evidence for the presence of the first overtone mode in the signal. The detection of the $\\ell|m|n=221$ mode is statistically significant, achieving a Bayes factor of $193$ for an analysis beginning at $10\\,M$ after the signal's peak amplitude--a time consistent with the linear perturbation regime. The inclusion of both the fundamental and overtone modes in our model allows for precise constraints on the remnant's properties. We infer a redshifted final mass of $243.0^{+22.7}_{-22.7}\\,M_{\\odot}$ and a final spin of $0.80_{-0.11}^{+0.07}$ (at $90\\%$ credibility), derived from a ringdown signal with a network signal-to-noise ratio of approximately $10.5$. A test of the no-hair theorem, enabled by this two-mode detection, shows consistency with the predictions of general relativity.",
      "pdf_url": "https://arxiv.org/pdf/2509.08657.pdf",
      "published": "2025-09-11T13:48:31.259872",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08664",
      "title": "Eikonal quasinormal modes of highly-spinning black holes in higher-curvature gravity: a window into extremality",
      "authors": [
        "Pablo A. Cano",
        "Marina David",
        "Guido van der Velde"
      ],
      "abstract": "Eikonal quasinormal modes of highly-spinning black holes in higher-curvature gravity: a window into extremality Pablo A. Cano, Marina David, Guido van der Velde General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We carry out the first computation of gravitational quasinormal modes of black holes with arbitrary rotation in a theory with higher-derivative corrections. Our analysis focuses on a recently identified quartic-curvature theory that preserves the isospectrality of quasinormal modes in the eikonal limit and that is connected to string theory. We find a master equation that governs large-momentum gravitational perturbations in this theory. By solving this equation with WKB methods, we provide complete results for the corrections to the Kerr quasinormal mode frequencies for arbitrary spin and arbitrary $\\mu=m/(\\ell+1/2)$, where $\\ell$ and $m$ are the harmonic numbers. Our results show that the corrections become orders of magnitude larger when the spin is close to extremality, with the modes close to the critical value of $\\mu$ that separates damped and zero-damped modes being particularly sensitive. We also perform a geometric-optics analysis of gravitational-wave propagation around black holes and relate the equatorial ``graviton-sphere'' orbits to quasinormal mode frequencies with $\\ell=m$. We find that the usual correspondence between the Lyapunov exponent of those orbits and the imaginary part of the frequency is modified.",
      "pdf_url": "https://arxiv.org/pdf/2509.08664.pdf",
      "published": "2025-09-11T13:48:31.259975",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08172",
      "title": "Short GRB 090510: a magnetized neutron star binary merger leading to a black hole",
      "authors": [
        "J. A. Rueda",
        "R. Ruffini",
        "Yu Wang"
      ],
      "abstract": "Short GRB 090510: a magnetized neutron star binary merger leading to a black hole J. A. Rueda, R. Ruffini, Yu Wang Accepted for publication in the Journal of High Energy Astrophysics (JHEAP) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We model the short gamma-ray bursts (GRB) 090510 as the product of a magnetized neutron star (NS) binary merger. Accounting for the NS critical mass constraint given by the mass of PSR J0952--0607, we infer that GRB 090510 was a highly-magnetized NS-NS merger that left as remnant a Kerr black hole (BH) of $2.4 M_\\odot$ with a low-mass accretion disk. The gamma-ray precursor is powered by the magnetic energy released during the merger of the NSs. The prompt emission originates at the transparency of an ultra-relativistic $e^+e^-$ pair-plasma produced by the overcritical electric field induced by the rotating strong magnetic field around the merged object before it reaches the critical mass, the GeV emission by the extractable energy of the newborn BH, and the X-ray afterglow by accretion onto it. We derive the masses of the merging NSs, their magnetic fields, the BH mass, spin, and irreducible mass, the strength of the magnetic field, the disk mass, and obtain an estimate of the gravitational-wave emission during the merger phase preceding the prompt short GRB emission. The inferred parameters agree with up-to-date numerical relativity simulations, confirming that strong magnetic fields above $10^{14}$ G develop in NS-NS mergers and that mergers leading to a central BH remnant have low-mass disks of $\\sim 10^{-2} M_\\odot$. We also advance the possibility that quasi-period oscillations of tens of Hz of frequency due to Lense-Thirring precession of the matter surrounding the merged object before BH formation can explain the successive spikes following the prompt emission peak.",
      "pdf_url": "https://arxiv.org/pdf/2509.08172.pdf",
      "published": "2025-09-11T13:48:31.260793",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08298",
      "title": "The Hierarchical Merger Scenario for GW231123",
      "authors": [
        "Guo-Peng Li",
        "Xi-Long Fan"
      ],
      "abstract": "The Hierarchical Merger Scenario for GW231123 Guo-Peng Li, Xi-Long Fan High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) GW231123 exhibits exceedingly massive components and high spins, which challenges the formation of first-generation (1G) black holes from stellar collapse and implies that this event might originate from hierarchical mergers. Here we show that the \\texttt{2G+2G} merger scenario for GW231123 is favored over a \\texttt{2G+1G} (or \\texttt{3G+2G}) merger, with odds ratios of $>$$\\mathcal{O}(10^3)$. The primary (secondary) black hole is consistent with merging binary black holes with masses of $75^{+7}_{-7}\\,M_\\odot$ and $66^{+4}_{-10}\\,M_\\odot$ ($64^{+8}_{-10}\\,M_\\odot$ and $59^{+7}_{-9}\\,M_\\odot$; 90\\% credible intervals), respectively. Our results reveal that the treatment of spin priors from the population level and waveform model choice are decisive in interpreting potential hierarchical gravitational-wave signals.",
      "pdf_url": "https://arxiv.org/pdf/2509.08298.pdf",
      "published": "2025-09-11T13:48:31.260982",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08766",
      "title": "Demonstration of a next-generation wavefront actuator for gravitational-wave detection",
      "authors": [
        "Tyler Rosauer",
        "Huy Tuong Cao",
        "Mohak Bhattacharya",
        "Peter Carney",
        "Luke Johnson",
        "Shane Levin",
        "Cynthia Liang",
        "Xuesi Ma",
        "Luis Martin Gutierrez",
        "Michael Padilla",
        "Liu Tao",
        "Aiden Wilkin",
        "Aidan Brooks",
        "Jonathan W. Richardson"
      ],
      "abstract": "Demonstration of a next-generation wavefront actuator for gravitational-wave detection Tyler Rosauer, Huy Tuong Cao, Mohak Bhattacharya, Peter Carney, Luke Johnson, Shane Levin, Cynthia Liang, Xuesi Ma, Luis Martin Gutierrez, Michael Padilla, Liu Tao, Aiden Wilkin, Aidan Brooks, Jonathan W. Richardson Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) In the last decade, the Laser Interferometer Gravitational-Wave Observatory (LIGO) and the European Virgo observatory have opened a new observational window on the universe. These cavity-enhanced laser interferometers sense spacetime strain, generated by distant astrophysical events such as black hole mergers, to an RMS fluctuation of a few parts in $10^{21}$ over a multi-kilometer baseline. Optical advancements in laser wavefront control are key to advancing the sensitivity of current detectors and enabling a planned next-generation 40-km gravitational wave observatory in the United States, known as Cosmic Explorer. We report the first experimental demonstration of a new wavefront control technique for gravitational-wave detection, obtained from testing a full-scale prototype on a 40-kg LIGO mirror. Our results indicate that this design can meet the unique and challenging requirements of providing higher-order precision wavefront corrections at megawatt laser power levels, while introducing extremely low effective displacement noise into the interferometer. This new technology will have a direct and enabling impact on the observational science, expanding the gravitational-wave detection horizon to very early times in the universe, before the first stars formed, and enabling new tests of gravity, cosmology, and dense nuclear matter.",
      "pdf_url": "https://arxiv.org/pdf/2509.08766.pdf",
      "published": "2025-09-11T13:48:31.261529",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2010.14529",
      "title": "Tests of General Relativity with Binary Black Holes from the second LIGO-Virgo Gravitational-Wave Transient Catalog",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration: R. Abbott",
        "T. D. Abbott",
        "S. Abraham",
        "F. Acernese",
        "K. Ackley",
        "A. Adams",
        "C. Adams",
        "R. X. Adhikari",
        "V. B. Adya",
        "C. Affeldt",
        "M. Agathos",
        "K. Agatsuma",
        "N. Aggarwal",
        "O. D. Aguiar",
        "L. Aiello",
        "A. Ain",
        "P. Ajith",
        "G. Allen",
        "A. Allocca",
        "P. A. Altin",
        "A. Amato",
        "S. Anand",
        "A. Ananyeva",
        "S. B. Anderson",
        "W. G. Anderson",
        "S. V. Angelova",
        "S. Ansoldi",
        "J. M. Antelis",
        "S. Antier",
        "S. Appert",
        "K. Arai",
        "M. C. Araya",
        "J. S. Areeda",
        "M. Arène",
        "N. Arnaud",
        "S. M. Aronson",
        "K. G. Arun",
        "Y. Asali",
        "S. Ascenzi",
        "G. Ashton",
        "S. M. Aston",
        "P. Astone",
        "F. Aubin",
        "P. Aufmuth",
        "K. AultONeal",
        "C. Austin",
        "V. Avendano",
        "S. Babak",
        "F. Badaracco",
        "M. K. M. Bader",
        "S. Bae",
        "A. M. Baer",
        "S. Bagnasco",
        "J. Baird",
        "M. Ball",
        "G. Ballardin",
        "S. W. Ballmer",
        "A. Bals",
        "A. Balsamo",
        "G. Baltus",
        "S. Banagiri",
        "D. Bankar",
        "R. S. Bankar",
        "J. C. Barayoga",
        "C. Barbieri",
        "B. C. Barish",
        "D. Barker",
        "P. Barneo",
        "S. Barnum",
        "F. Barone",
        "B. Barr",
        "L. Barsotti",
        "M. Barsuglia",
        "D. Barta",
        "J. Bartlett",
        "I. Bartos",
        "R. Bassiri",
        "A. Basti",
        "M. Bawaj",
        "J. C. Bayley",
        "M. Bazzan",
        "B. R. Becher",
        "B. Bécsy",
        "V. M. Bedakihale",
        "M. Bejger",
        "I. Belahcene",
        "D. Beniwal",
        "M. G. Benjamin",
        "R. Benkel",
        "T. F. Bennett",
        "J. D. Bentley",
        "F. Bergamin",
        "B. K. Berger",
        "G. Bergmann",
        "S. Bernuzzi",
        "C. P. L. Berry",
        "D. Bersanetti",
        "A. Bertolini"
      ],
      "abstract": "Tests of General Relativity with Binary Black Holes from the second LIGO-Virgo Gravitational-Wave Transient Catalog The LIGO Scientific Collaboration, the Virgo Collaboration: R. Abbott, T. D. Abbott, S. Abraham, F. Acernese, K. Ackley, A. Adams, C. Adams, R. X. Adhikari, V. B. Adya, C. Affeldt, M. Agathos, K. Agatsuma, N. Aggarwal, O. D. Aguiar, L. Aiello, A. Ain, P. Ajith, G. Allen, A. Allocca, P. A. Altin, A. Amato, S. Anand, A. Ananyeva, S. B. Anderson, W. G. Anderson, S. V. Angelova, S. Ansoldi, J. M. Antelis, S. Antier, S. Appert, K. Arai, M. C. Araya, J. S. Areeda, M. Arène, N. Arnaud, S. M. Aronson, K. G. Arun, Y. Asali, S. Ascenzi, G. Ashton, S. M. Aston, P. Astone, F. Aubin, P. Aufmuth, K. AultONeal, C. Austin, V. Avendano, S. Babak, F. Badaracco, M. K. M. Bader, S. Bae, A. M. Baer, S. Bagnasco, J. Baird, M. Ball, G. Ballardin, S. W. Ballmer, A. Bals, A. Balsamo, G. Baltus, S. Banagiri, D. Bankar, R. S. Bankar, J. C. Barayoga, C. Barbieri, B. C. Barish, D. Barker, P. Barneo, S. Barnum, F. Barone, B. Barr, L. Barsotti, M. Barsuglia, D. Barta, J. Bartlett, I. Bartos, R. Bassiri, A. Basti, M. Bawaj, J. C. Bayley, M. Bazzan, B. R. Becher, B. Bécsy, V. M. Bedakihale, M. Bejger, I. Belahcene, D. Beniwal, M. G. Benjamin, R. Benkel, T. F. Bennett, J. D. Bentley, F. Bergamin, B. K. Berger, G. Bergmann, S. Bernuzzi, C. P. L. Berry, D. Bersanetti, A. Bertolini 24 pages + appendices, 19 figures; updated with corrections published in the erratum Phys. Rev. D 103, 122002 (2021); Erratum: Phys. Rev. D 112, 049902 (2025) General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Gravitational waves enable tests of general relativity in the highly dynamical and strong-field regime. Using events detected by LIGO-Virgo up to 1 October 2019, we evaluate the consistency of the data with predictions from the theory. We first establish that residuals from the best-fit waveform are consistent with detector noise, and that the low- and high-frequency parts of the signals are in agreement. We then consider parametrized modifications to the waveform by varying post-Newtonian and phenomenological coefficients, improving past constraints by factors of ${\\sim}2$; we also find consistency with Kerr black holes when we specifically target signatures of the spin-induced quadrupole moment. Looking for gravitational-wave dispersion, we tighten constraints on Lorentz-violating coefficients by a factor of ${\\sim}2.6$ and bound the mass of the graviton to $m_g \\leq 3.09 \\times 10^{-23} \\mathrm{eV}/c^2$ with 90% credibility. We also analyze the properties of the merger remnants by measuring ringdown frequencies and damping times, constraining fractional deviations away from the Kerr frequency to $\\delta \\hat{f}_{220} = 0.03^{+0.38}_{-0.35}$ for the fundamental quadrupolar mode, and $\\delta \\hat{f}_{221} = 0.02^{+0.29}_{-0.33}$ for the first overtone; additionally, we find no evidence for postmerger echoes. Finally, we determine that our data are consistent with tensorial polarizations through a template-independent method. When possible, we assess the validity of general relativity based on collections of events analyzed jointly. We find no evidence for new physics beyond general relativity, for black hole mimickers, or for any unaccounted systematics.",
      "pdf_url": "https://arxiv.org/pdf/2010.14529.pdf",
      "published": "2025-09-11T13:48:31.262086",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2311.06416",
      "title": "TESLA-X: An effective method to search for sub-threshold lensed gravitational waves with a targeted population model",
      "authors": [
        "Alvin K. Y. Li",
        "Juno C.L. Chan",
        "Heather Fong",
        "Aidan H.Y. Chong",
        "Alan J. Weinstein",
        "Jose M. Ezquiaga"
      ],
      "abstract": "TESLA-X: An effective method to search for sub-threshold lensed gravitational waves with a targeted population model Alvin K. Y. Li, Juno C.L. Chan, Heather Fong, Aidan H.Y. Chong, Alan J. Weinstein, Jose M. Ezquiaga Mon Not R Astron Soc (2025) 998-1010 General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Strong gravitational lensing can produce copies of gravitational-wave signals from the same source with the same waveform morphologies but different amplitudes and arrival times. Some of these strongly-lensed gravitational-wave signals can be demagnified and become subthreshold. We present TESLA-X, an enhanced approach to the original GstLAL-based TargetEd Subthreshold Lensing seArch (TESLA) method, for improving the detection efficiency of these potential subthreshold lensed signals. TESLA-X utilizes lensed injections to generate a targeted population model and a targeted template bank. We compare the performance of a full template bank search, TESLA, and TESLA-X methods via a simulation campaign, and demonstrate the performance of TESLA-X in recovering lensed injections, particularly targeting a mock event. Our results show that the TESLA-X method achieves a maximum of $\\sim 10\\%$ higher search sensitivity compared to the TESLA method within the subthreshold regime, presenting a step towards detecting the first lensed gravitational wave. TESLA-X will be employed for the LIGO-Virgo-KAGRA's collaboration-wide analysis to search for lensing signatures in the fourth observing run.",
      "pdf_url": "https://arxiv.org/pdf/2311.06416.pdf",
      "published": "2025-09-11T13:48:31.262199",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2501.08261",
      "title": "GPU-accelerated LISA parameter estimation with full time domain response",
      "authors": [
        "Cecilio García-Quirós",
        "Shubhanshu Tiwari",
        "Stanislav Babak"
      ],
      "abstract": "GPU-accelerated LISA parameter estimation with full time domain response Cecilio García-Quirós, Shubhanshu Tiwari, Stanislav Babak Phys. Rev. D 112, 064017 (2025) General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) We conduct the first full Bayesian inference analysis for LISA parameter estimation incorporating the effects of subdominant harmonics and spin-precession through a full time domain response. The substantial computational demands of using time domain waveforms for LISA are significantly mitigated by implementing a novel Python version of the IMRPhenomT family of waveform models and the LISA response with GPU acceleration. This time domain response alleviates the theoretical necessity of developing specific transfer functions to approximate the LISA response in the Fourier domain for each specific type of system and allows for the use of unequal arms configurations and realistic LISA orbits. Our analysis includes a series of zero-noise injections for a Massive Black Hole Binary with aligned and precessing spins. We investigate the impact of including subdominant harmonics, compare equal and unequal arm configurations, and analyze different Time-Delay-Interferometry (TDI) configurations. We utilize full and uniform priors, with a lower frequency cutoff of 0.1mHz, and a signal duration of approximately two months, sampled every 5 seconds. The sampler is initialized based on Fisher estimates. Our results demonstrate LISA capability to measure the two spin magnitudes and the primary spin tilt angle, alongside sky localization, with percent-level precision, while component masses are determined with sub-percent accuracy.",
      "pdf_url": "https://arxiv.org/pdf/2501.08261.pdf",
      "published": "2025-09-11T13:48:31.262394",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.18192",
      "title": "Propagating Gravitational Waves in Teleparallel Gauss-Bonnet Gravity",
      "authors": [
        "Shivam Kumar Mishra",
        "Jackson Levi Said",
        "B. Mishra"
      ],
      "abstract": "Propagating Gravitational Waves in Teleparallel Gauss-Bonnet Gravity Shivam Kumar Mishra, Jackson Levi Said, B. Mishra Phys. Rev. D, 112, 064019 (2025) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Gravitational waves offer a key insight into the viability of classes of gravitational theories beyond general relativity. The observational constraints on their speed of propagation can provide strong constraints on generalized classes of broader gravitational frameworks. In this work, we reconsider the general class of Gauss-Bonnet theories in the context of teleparallel gravity, where the background geometry is expressed through torsion. We perform tensor perturbations on a flat FLRW background, and derive the gravitational wave propagation equation. We find that gravitational waves propagate at the speed of light in these classes of theories. We also derive the distance-duality relationship for radiation propagating in the gravitational wave and electromagnetic domains.",
      "pdf_url": "https://arxiv.org/pdf/2505.18192.pdf",
      "published": "2025-09-11T13:48:31.262859",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2503.02607",
      "title": "Gravitational wave probes of particle dark matter: a review",
      "authors": [
        "Andrew L. Miller"
      ],
      "abstract": "Gravitational wave probes of particle dark matter: a review Andrew L. Miller 54 pages + references, 28 figures, comments are welcome. Invited review article submitted to IJMP D; Revised and expanded to clarify dark-matter physics, constraints from gravitational-wave observations, and continuous-wave search methods High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Various theories of dark matter predict distinctive astrophysical signatures in gravitational-wave sources that could be observed by ground- and space-based laser interferometers. Different candidates-including axions, dark photons, macroscopic dark matter, WIMPs, and dark-matter spikes-may appear in interferometer data via their coupling to gravity or the Standard Model, altering the measured gravitational-wave strain in distinct ways. Despite their differences, these candidates share two key features: (1) they can be probed through their effects on gravitational waves from inspiraling compact objects, isolated black holes, and neutron stars, or via direct interactions with detectors, and (2) their signatures likely persist far longer than the seconds-long mergers detected today, necessitating new data analysis methods beyond matched filtering. This review outlines these dark matter candidates, their observational signatures, and approaches for their detection.",
      "pdf_url": "https://arxiv.org/pdf/2503.02607.pdf",
      "published": "2025-09-11T13:48:31.263264",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.15589",
      "title": "Cosmological pole-skipping, shock waves and quantum chaotic dynamics of de Sitter horizons",
      "authors": [
        "Yongjun Ahn",
        "Sašo Grozdanov",
        "Hyun-Sik Jeong",
        "Juan F. Pedraza"
      ],
      "abstract": "Cosmological pole-skipping, shock waves and quantum chaotic dynamics of de Sitter horizons Yongjun Ahn, Sašo Grozdanov, Hyun-Sik Jeong, Juan F. Pedraza 55 pages, 7 figures; v2: references added, minor edits High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc) We present a systematic analysis of pole-skipping for scalar, Maxwell, and gravitational waves in cosmological spacetimes. Specifically, working in empty de Sitter space and in Schwarzschild-de Sitter black hole geometries, we locate the tower of pole-skipping points of such fields and show that they impose nontrivial constraints on the corresponding bulk two-point functions. Focusing on the gravitational sound channel, we then extract the Lyapunov exponent and butterfly velocities that characterize hypothetical dual many-body quantum chaos at each horizon. These chaotic data precisely match the outcome of a gravitational shock wave calculation, confirming that the relevant pole-skipping points encode high-energy scattering of horizon quanta. Interestingly, the butterfly velocities can become superluminal or imaginary, with the latter signaling a spatially modulated propagation of chaos. Assuming that a holographic dual exists, we translate our results into field theory language and propose that the dual theory can be divided into two entangled sectors that capture the black hole and cosmological horizon degrees of freedom. Our results suggest that the black hole sector becomes increasingly nonlocal as the black hole shrinks and that the cosmological horizon sector exhibits behavior compatible with violations of Hermiticity. Finally, we outline simple microscopic toy models, built from long-range and non-Hermitian deformations of the Double Scaled Sachdev-Ye-Kitaev (DSSYK)-type chains, that realize these features, providing a concrete arena for future exploration.",
      "pdf_url": "https://arxiv.org/pdf/2508.15589.pdf",
      "published": "2025-09-11T13:48:31.263680",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.02696",
      "title": "Unitary and Analytic Renormalisation of Cosmological Correlators",
      "authors": [
        "Diksha Jain",
        "Enrico Pajer",
        "Xi Tong"
      ],
      "abstract": "Unitary and Analytic Renormalisation of Cosmological Correlators Diksha Jain, Enrico Pajer, Xi Tong 56 pages, 3 figures. v2: references added High Energy Physics - Theory (hep-th); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Loop contributions to cosmological correlators and to the associated wavefunction are of key theoretical and phenomenological interest. Here, we investigate and compare different renormalisation schemes proposed in the literature to handle ultraviolet divergences and develop new schemes adapting $\\eta$ regulators to de Sitter spacetime. We focus on one-loop contributions to the quadratic wavefunction coefficient of a shift-symmetric massless scalar in de Sitter spacetime, which is a good toy model of primordial curvature perturbations. We show that different implementations of dimensional regularisation agree with each other and with unitarity and scale invariance in the final renormalised result. Imposing unitarity in the form of the cosmological optical theorem, we define a class of unitary and analytic $\\eta$ regulators that agree with dim reg but feature considerable technical and conceptual simplifications. We show that the imaginary part of all one-loop wavefunction coefficients is universally fixed in terms of the logarithmic running of the real part, under the assumptions of scale invariance, Bunch-Davies vacuum and light bulk fields. Our work resolves discrepancies in the literature, establishes regulator-independent predictions for the imaginary part at one loop, and provides a practical framework for computing quantum contributions to cosmological correlators.",
      "pdf_url": "https://arxiv.org/pdf/2509.02696.pdf",
      "published": "2025-09-11T13:48:31.263785",
      "updated": null,
      "categories": [
        "hep-th",
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08066",
      "title": "The limits of cosmology",
      "authors": [
        "Joseph Silk"
      ],
      "abstract": "Lemaitre2024, International Conference on Black Holes, Gravitational Waves and Space-Time Singularities (June 17-21, 2024, Castel Gandolfo, Specola Vaticana) Gen Relativ Gravit 57, 127 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Moon is our future. It may seem like a chimera with a projected cost in excess of 100 billion\\$, and counting, dispensed on ARTEMIS with little to show to date. However it is the ideal site for the largest telescopes that we can dream about, at wavelengths spanning decimetric radio through optical to terahertz FIR. And it is these future telescopes that will penetrate the fundamental mysteries of the first hydrogen clouds, the first stars, the first galaxies, the first supermassive black holes, and the nearest habitable exoplanets. Nor does it stop there. Our lunar telescopes will take us back to the first months of the Universe, and even back to the first 10$^{-36}$ second after the Big Bang when inflation most likely occurred. Our lunar telescopes will provide high resolution images of exoplanets that are nearby Earth-like 'twins' and provide an unrivalled attempt to answer the ultimate cosmic question of whether we are alone in the universe. Here I will set out my vision of the case for lunar astronomy over the next several decades.",
      "pdf_url": "https://arxiv.org/pdf/2509.08066.pdf",
      "published": "2025-09-11T13:48:31.650373",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08041",
      "title": "Uncertainties in the supermassive black hole abundance and implications for the GW background",
      "authors": [
        "Gabriela Sato-Polito",
        "Matias Zaldarriaga"
      ],
      "abstract": "Uncertainties in the supermassive black hole abundance and implications for the GW background Gabriela Sato-Polito, Matias Zaldarriaga Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) The present-day mass function of supermassive black holes is the most important observable quantity for the prediction and theoretical interpretation of the gravitational wave background (GWB) measured by pulsar timing arrays (PTAs). Due to the limited sample size of galaxies with dynamically inferred SMBH masses, more readily measurable galaxy properties $X$ that correlate with the black hole mass are used as labels (via scaling relations $M_{\\bullet}-X$), which can then be counted in a larger galaxy catalog to produce a measurement of the mass function. Estimating the amplitude of the GWB from the local mass function is therefore simpler than general measurements of scaling relations and galaxy mass/luminosity functions for two reasons: the contribution to the characteristic strain is dominated by a narrow range of masses, and the mass proxy $X$ is always marginalized over. While consistent errors in $X$ in both catalogs are irrelevant, relatively small biases between them can produce significant shifts in the predicted SMBH abundance. In this work, we explore measurements of the SMBH mass function using different mass proxies through a set of catalogs with a number of redundant measurements between them. This enables us to investigate internal inconsistencies that lead to discrepancies in the final black hole abundance, while minimizing observational systematic biases induced by combining disparate sets of measurements. We focus on 3 proxies: the velocity dispersion $\\sigma$, K-band luminosity $L$, and a combination of $L$ and radius $R$ defined by the fundamental plane. We show that all three can be reconciled to some degree, but highlight the remaining dependence on poorly-quantified systematic corrections between the scaling relation catalogs and the mass function catalogs, as well as the potential impact of selection effects.",
      "pdf_url": "https://arxiv.org/pdf/2509.08041.pdf",
      "published": "2025-09-11T13:48:31.651332",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.GA",
        "cross_list_from": "astro-ph.GA"
      }
    },
    {
      "id": "https://arxiv.org/abs/2409.02886",
      "title": "Exploring cosmological gravitational wave backgrounds through the synergy of LISA and ET",
      "authors": [
        "Alisha Marriott-Best",
        "Debika Chowdhury",
        "Anish Ghoshal",
        "Gianmassimo Tasinato"
      ],
      "abstract": "Exploring cosmological gravitational wave backgrounds through the synergy of LISA and ET Alisha Marriott-Best, Debika Chowdhury, Anish Ghoshal, Gianmassimo Tasinato v1: 44 pages, 10 figures; v2: 45 pages, 12 figures, published in Phys. Rev. D Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The gravitational wave (GW) interferometers LISA and ET are expected to be functional in the next decade(s), possibly around the same time. They will operate over different frequency ranges, with similar integrated sensitivities to the amplitude of a stochastic GW background (SGWB). We investigate the synergies between these two detectors, in terms of a multi-band detection of a cosmological SGWB characterised by a large amplitude, and a broad frequency spectrum. We develop the notion of integrated sensitivity and propose a novel signal-to-noise (SNR) optimal for characterization of the geometrical properties of the interferometer systems of LISA and ET operating simultaneously. By investigating various examples of SGWBs, such as those arising from cosmological phase transition, cosmic string, primordial inflation, we show that LISA and ET operating together will have the opportunity to assess more effectively the characteristics of the GW spectrum produced by the same cosmological source, but at separate frequency scales. Moreover, the two experiments in tandem can be sensitive to features of early universe cosmic expansion before big-bang nucleosynthesis (BBN), which affects the SGWB frequency profile, and which would not be possible to detect otherwise, since two different frequency ranges correspond to two different pre-BBN (or post-inflationary) epochs. Besides considering the GW spectrum, we additionally undertake a preliminary study of the sensitivity of LISA and ET to soft limits of higher order tensor correlation functions. Given that these experiments operate at different frequency bands, their synergy constitutes an ideal direct probe of squeezed limits of higher order GW correlators, which can not be measured operating with a single instrument only.",
      "pdf_url": "https://arxiv.org/pdf/2409.02886.pdf",
      "published": "2025-09-11T13:48:31.652022",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2210.11241",
      "title": "SMEFT effects on gravitational wave spectrum from electroweak phase transition",
      "authors": [
        "Katsuya Hashino",
        "Daiki Ueda"
      ],
      "abstract": "SMEFT effects on gravitational wave spectrum from electroweak phase transition Katsuya Hashino, Daiki Ueda 32 pages, 16 figures; section 6 was added for more explanations High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Experiment (hep-ex); High Energy Physics - Theory (hep-th) Future gravitational wave observations are potentially sensitive to new physics corrections to the Higgs potential once the first-order electroweak phase transition arises. We study the SMEFT dimension-six operator effects on the Higgs potential, where three types of effects are taken into account: (i) SMEFT tree level effect on $\\varphi^6$ operator, (ii) SMEFT tree level effect on the wave function renormalization of the Higgs field, and (iii) SMEFT top-quark one-loop level effect. The sensitivity of future gravitational wave observations to these effects is numerically calculated by performing a Fisher matrix analysis. We find that the future gravitational wave observations can be sensitive to (ii) and (iii) once the first-order electroweak phase transition arises from (i). The dimension-eight $\\varphi^8$ operator effects on the first-order electroweak phase transition are also discussed. The sensitivities of the future gravitational wave observations are also compared with those of future collider experiments.",
      "pdf_url": "https://arxiv.org/pdf/2210.11241.pdf",
      "published": "2025-09-11T13:48:31.653144",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-ex",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.04794",
      "title": "Constraining the environment of compact binary mergers with self-lensing signatures",
      "authors": [
        "Helena Ubach",
        "Mark Gieles",
        "Jordi Miralda-Escudé"
      ],
      "abstract": "Constraining the environment of compact binary mergers with self-lensing signatures Helena Ubach, Mark Gieles, Jordi Miralda-Escudé Accepted for publication in PRD. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Gravitational waves (GWs) from coalescing binary black holes (BBHs) can come from different environments. GWs interact gravitationally with astrophysical objects, which makes it possible to use gravitational lensing by objects in the same gravitational system (self-lensing) to learn about their environments. We quantify the probability of self-lensing through the optical depth $\\tau$ for the main channels of detectable GWs at frequencies $f_{\\rm GW}\\sim (1-10^3)\\,{\\rm Hz}$. We then analyze the detectability of the lensing effect (imprint). In star clusters, the probability of self-lensing by stellar-mass black holes (BHs) is low, $\\tau\\simeq10^{-7}$, even when taking into account nearby BHs in resonant interactions, $\\tau\\simeq 10^{-5}$. Additionally, the lensing imprint of a stellar-mass lens (diffraction and interference) is too marginal to be detectable by the LIGO-Virgo-KAGRA detectors and most Einstein Telescope signals. For a massive BH lens in the center of a cluster, the probability can reach $\\tau\\simeq 10^{-4}$ either via von Zeipel-Lidov-Kozai induced mergers of BBHs orbiting a central massive BH, or BBHs formed as GW captures in single-single interactions in the Bahcall-Wolf cusp of a nuclear cluster. For self-lensing by a supermassive BH for BBHs in the migration trap of an active galactic nucleus (AGN) disk, $\\tau \\simeq 10^{-2}$. The imprint of these massive lenses are multiple images that are already detectable. Moreover, self-lensed signals from AGN disks have a distinct linear polarization. The probability depends on the extent of the detectability through the threshold impact parameter $y_{\\rm max}$, which can increase for future detectors. We conclude that constraining the environment of BBHs is possible by combining self-lensing imprints with other waveform signatures such as eccentricity and polarization.",
      "pdf_url": "https://arxiv.org/pdf/2505.04794.pdf",
      "published": "2025-09-11T13:48:31.653890",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.00774",
      "title": "A Novel Formation Channel for Supermassive Black Hole Binaries in the Early Universe via Primordial Black Holes",
      "authors": [
        "Saiyang Zhang",
        "Boyuan Liu",
        "Volker Bromm"
      ],
      "abstract": "A Novel Formation Channel for Supermassive Black Hole Binaries in the Early Universe via Primordial Black Holes Saiyang Zhang, Boyuan Liu, Volker Bromm 15 pages, 4 figures, accepted by ApJ, in press Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a novel formation channel for supermassive black hole (SMBH) binaries in the early Universe, driven by primordial black holes (PBHs). Using high-resolution hydrodynamical simulations, we explore the role of massive PBHs ($m_{BH} \\sim 10^6 M_\\odot$) in catalyzing the formation of direct-collapse black holes (DCBHs), providing a natural in situ pathway for binary SMBH formation. PBHs enhance local overdensities, accelerate structure formation, and exert thermal feedback on the surrounding medium via accretion. Lyman-Werner (LW) radiation from accreting PBHs suppresses H$2$ cooling, shifting the dominant gas coolant to atomic hydrogen. When combined with significant baryon-dark matter streaming velocities ($v_{b\\chi} \\gtrsim 0.8 \\sigma_{b\\chi}$, where $\\sigma_{b\\chi}$ is the root-mean-square streaming velocity), these effects facilitate the formation of dense, gravitationally unstable, atomically cooling gas clouds in the PBH's wake. These clouds exhibit sustained high inflow rates ($\\dot{M}_{infall} \\gtrsim 0.01 - 0.1 M_\\odot yr^{-1}$), providing ideal conditions for DCBH formation from rapidly growing supermassive stars of $\\sim 10^5 M_\\odot$ at redshifts $z \\sim 20 - 10$. The resulting systems form SMBH binaries with initial mass ratios $q \\sim O(0.1)$ and separations of $\\sim 10$ pc. Such PBH-DCBH binaries provide testable predictions for JWST and ALMA, potentially explaining select high-$z$ sources such as the Little Red Dots (LRDs), and represent gravitational-wave sources for future missions like LISA and TianQin-bridging early-Universe black hole physics, multi-messenger astronomy, and dark matter theory.",
      "pdf_url": "https://arxiv.org/pdf/2508.00774.pdf",
      "published": "2025-09-11T13:48:31.654086",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.08448",
      "title": "Black hole mass function shift in proto-stellar-clusters driven by gas accretion",
      "authors": [
        "Zacharias Roupas"
      ],
      "abstract": "Black hole mass function shift in proto-stellar-clusters driven by gas accretion Zacharias Roupas Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The James Webb Space Telescope (JWST) has observed compact, massive proto-stellar clusters of low metallicity in the Cosmic Gems arc galaxy at high redshift, which represent likely precursors to globular clusters. We model the mass growth of stellar black holes (BHs) during the first few Myr of the life of a massive, compact, gaseous stellar cluster before stellar feedback expels the primordial gas. At high redshift, in a lower metallicity environment stellar winds get weaker allowing for larger gas-depletion time-scales in the cluster despite of energetic pair-instability supernova (PISN) feedback for sufficiently compact clusters. Mass segregation drives the massive stellar progenitors of BHs in the center of the cluster where gas is most dense. We estimate the conditions for which the initial black hole mass function (BHMF), with a PISN-induced cut-off $<55{\\rm M}_\\odot$, gets shifted to values within the upper BH mass gap, $\\sim 60-130{\\rm M}_\\odot$, or higher, as observed by Gravitational Wave (GW) experiments LIGO-Virgo-KAGRA. We find that the BHs are shifted by the end of gas depletion to values within and above the mass gap, well within the range of BH components of the recent GW-signal GW231123, depending on total mass, star formation efficiency, metallicity and compactness. The individual BH mass increase follows approximately a surprisingly steep power law with respect to initial BH mass with an exponent in the range $\\approx 4-6$. This occurs in gaseous proto-stellar clusters that are sufficiently massive and compact, with typical values of total mass $\\sim 10^6{\\rm M}_\\odot$ and size $\\sim 1{\\rm pc}$. Our analysis suggests that proto-stellar clusters at high redshift such as Cosmic Gems arc clusters have generated through early gas accretion, BHs as heavy as $\\sim 10^2-10^3{\\rm M}_\\odot$.",
      "pdf_url": "https://arxiv.org/pdf/2509.08448.pdf",
      "published": "2025-09-11T13:48:32.071303",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.GA",
        "cross_list_from": "astro-ph.GA"
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.13074",
      "title": "RGE effects on new physics searches via gravitational waves",
      "authors": [
        "Katsuya Hashino",
        "Daiki Ueda"
      ],
      "abstract": "RGE effects on new physics searches via gravitational waves Katsuya Hashino, Daiki Ueda High Energy Physics - Phenomenology (hep-ph); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex); High Energy Physics - Theory (hep-th) Gravitational wave (GW) observations offer a promising probe of new physics associated with a first-order electroweak phase transition. Precision studies of the Higgs potential, including Fisher matrix analyses, have been extensively conducted in this context. However, significant theoretical uncertainties in the GW spectrum, particularly those due to renormalization scale dependence in the conventional daisy-resummed approach, have cast doubt on the reliability of such precision measurements. These uncertainties have been highlighted using the Standard Model Effective Field Theory (SMEFT) as a benchmark. To address these issues, we revisit Fisher matrix analyses based on the daisy-resummed approach, explicitly incorporating renormalization scale uncertainties. We then reassess the prospects for precise new physics measurements using GW observations. Adopting the SMEFT as a benchmark, we study the effects of one-loop RGE running of dimension-six operators on the Higgs effective potential via the Higgs self-couplings, top Yukawa coupling, and gauge couplings, in addition to the SMEFT tree-level effects. We find that future GW observations can remain sensitive to various dimension-six SMEFT effects, even in the presence of renormalization scale uncertainties, provided that the SMEFT $(H^{\\dagger}H)^3$ operator is precisely measured, e.g., by future collider experiments.",
      "pdf_url": "https://arxiv.org/pdf/2505.13074.pdf",
      "published": "2025-09-11T13:48:32.075309",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.HE",
        "hep-ex",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.07684",
      "title": "Benchmarking the Plane-Wave Born and Distorted Waves approximations for electron-impact collision strength computations: the sample case of Sr II",
      "authors": [
        "Jérôme Deprince",
        "Lucas Maison"
      ],
      "abstract": "Benchmarking the Plane-Wave Born and Distorted Waves approximations for electron-impact collision strength computations: the sample case of Sr II Jérôme Deprince, Lucas Maison Proceedings of the 22nd International Conference on Atomic Processes in Plasmas 2025 (Tokyo, Japan) Atomic Physics (physics.atom-ph); High Energy Astrophysical Phenomena (astro-ph.HE); Computational Physics (physics.comp-ph) The discovery of gravitational waves from a neutron star merger in 2017 (GW170817) and the associated kilonova (AT2017gfo) confirmed these events as key sites for heavy element production through the r-process. Subsequent observations, including late-time spectra with JWST, have highlighted the need for accurate modeling of kilonova ejecta. In the photospheric phase, atomic level populations can be estimated under LTE using Boltzmann and Saha relations, but about a week after the merger the ejecta enters the nebular phase where non-LTE effects dominate. Modeling nebular spectra therefore requires a detailed treatment of radiative and collisional processes that affect the population of atomic levels. This work focuses on electron-impact excitation in Sr II, a heavy ion relevant for kilonova spectra. Two computational approaches are employed: the Plane Wave Born approximation within the pseudo-relativistic Hartree-Fock method, and a Distorted Waves method using AUTOSTRUCTURE. The resulting collision strengths are compared against reference R-matrix data to evaluate the accuracy of these approximations and their suitability for large-scale applications to all heavy elements. In addition, radiative parameters for forbidden transitions are computed. These results provide an essential benchmark of approximations that could be used to compute atomic data for nebular-phase kilonova modeling.",
      "pdf_url": "https://arxiv.org/pdf/2509.07684.pdf",
      "published": "2025-09-11T13:48:32.075430",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.16810",
      "title": "Transformers for Stratified Spectropolarimetric Inversion: Proof of Concept",
      "authors": [
        "Ryan James Campbell",
        "Mihalis Mathioudakis",
        "Carlos Quintero Noda"
      ],
      "abstract": "Transformers for Stratified Spectropolarimetric Inversion: Proof of Concept Ryan James Campbell, Mihalis Mathioudakis, Carlos Quintero Noda Revision 1, submitted to the Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) Solar spectropolarimetric inversion -- inferring atmospheric conditions from the Stokes vector -- is a key diagnostic tool for understanding solar magnetism, but traditional inversion methods are computationally expensive and sensitive to local minima. Advances in artificial intelligence (AI) offer faster solutions, but are often restricted to shallow models or a few spectral lines. We present a proof-of-concept study using a transformer machine learning (ML) model for multi-line, full-Stokes inversion, to infer stratified parameters from synthetic spectra produced from 3D magnetohydrodynamic simulations. We synthesise a large set of Stokes vectors using forward modelling across 15 spectral lines spanning the deep photosphere towards the chromosphere. The model maps full-Stokes input to temperature, magnetic field strength, inclination, azimuth (encoded as $\\sin2\\phi$, $\\cos2\\phi$), and line-of-sight velocity as a function of optical depth. The transformer incorporates an attention mechanism that allows the model to focus on the most informative regions of the spectrum for each inferred parameter, and uses positional embedding to encode wavelength and depth order. We benchmark it against a multilayer perceptron (MLP), test robustness to noise, and assess generalisation. The transformer outperforms the MLP, especially in the higher layers and for magnetic parameters, yielding higher correlations and more regularised stratifications. The model retains strong performance across a range of noise levels typical for real observations, with magnetic parameter inference degrading predictably while temperature and velocity remain stable. We establish transformer architectures as a powerful tool for spectropolarimetric inversion. This approach paves the way for analysis of large datasets from large solar telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2506.16810.pdf",
      "published": "2025-09-11T13:48:32.821336",
      "updated": null,
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}