{
  "date": "2026-02-10",
  "crawl_timestamp": "2026-02-10T01:34:48.321702",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 151,
    "total_gw_papers": 18,
    "by_category": {
      "gr-qc": {
        "total": 21,
        "gw_related": 5
      },
      "astro-ph": {
        "total": 102,
        "gw_related": 6
      }
    }
  },
  "crawl_verification": {
    "total_expected": 204,
    "total_actual": 204,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 43,
        "actual_crawled": 43,
        "page_source_info": "Total of 43 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 30,
        "actual_crawled": 30,
        "page_source_info": "Total of 30 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 35,
        "actual_crawled": 35,
        "page_source_info": "Total of 35 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 44,
        "actual_crawled": 44,
        "page_source_info": "Total of 44 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 14,
        "actual_crawled": 14,
        "page_source_info": "Total of 14 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.06536",
      "title": "Continued fraction method for high overtone quasinormal modes in effective potentials with discontinuity",
      "authors": [
        "Guan-Ru Li",
        "Jodin C. Morey",
        "Wei-Liang Qian",
        "Ramin G. Daghigh",
        "Michael D. Green",
        "Kai Lin",
        "Rui-Hong Yue"
      ],
      "abstract": "Continued fraction method for high overtone quasinormal modes in effective potentials with discontinuity Guan-Ru Li, Jodin C. Morey, Wei-Liang Qian, Ramin G. Daghigh, Michael D. Green, Kai Lin, Rui-Hong Yue 46 pages, 7 figures, and 10 tables General Relativity and Quantum Cosmology (gr-qc) In this study, we extend Leaver's continued fraction method to evaluate black hole quasinormal modes (QNMs) in systems where the effective potential exhibits a discontinuity. Besides the low-lying modes, we particularly focus on high overtones, which are physically pertinent due to the substantial deformation of the QNM spectrum triggered by spectral instability. In our algorithm, we expand the wavefunction at the point of discontinuity, instead of the black hole horizon, and incorporate the Israel-Lanczos-Sen junction conditions. %As the wavefunction convergence condition becomes irrelevant, our proposed algorithm generalizes the original method by expanding the wavefunctions at the point of discontinuity, and the associated difficulty is mitigated by rectifying the recurrence relations between the expansion coefficients to incorporate the Israel-Lanczos-Sen junction conditions. We apply this algorithm to compute the QNMs of the modified Regge-Wheeler potential up to $2000$ modes with high precision. For the low-lying modes, the numerical results show excellent agreement with those obtained using the matrix and Prony methods. The high overtones are significantly deformed, owing to the presence of echoes due to the discontinuity. This deformation in the asymptotic QNM spectrum reveals universal features that are largely independent of the specific form of the discontinuity in the potential, seemingly coinciding with those observed in the modified Pöschl-Teller effective potential. We speculate on whether the collective effect of the high overtones has an observational impact on gravitational wave signals.",
      "pdf_url": "https://arxiv.org/pdf/2602.06536.pdf",
      "published": "2026-02-10T01:34:47.652167",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06731",
      "title": "Accelerating TTL noise post-processing via combined coefficients and alternative TDI configuration",
      "authors": [
        "Xue Wang",
        "Gang Wang"
      ],
      "abstract": "Accelerating TTL noise post-processing via combined coefficients and alternative TDI configuration Xue Wang, Gang Wang General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Tilt-to-length (TTL) noise induced by angular jitter of spacecraft and test masses can affect the sensitivity of space-based gravitational-wave detectors such as LISA, Taiji, and TianQin. Such angular jitter can be measured using the differential wavefront sensing technique, enabling the modeling and subtraction of TTL noise from the data. However, owing to the multiple degrees of freedom of the detector constellation, a linear TTL model requires at least 24 parameters, while a higher-fidelity quadratic model involves up to 60 coefficients, rendering parameter estimation computationally expensive. To accelerate parameter determination, we propose a modified parameter set obtained via a linear transformation of the original angular coupling coefficients, which effectively reduces correlations among TTL noise components. In addition, we perform parameter fitting using an alternative second-generation time-delay interferometry configuration, PD4L, rather than the fiducial Michelson configuration. These two improvements enhance the convergence speed of the fitting procedure by a factor of approximately 10 for the linear model and approximately 18 for the quadratic model. The proposed approach can therefore substantially improve the efficiency of TTL noise calibration in space-based gravitational-wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2602.06731.pdf",
      "published": "2026-02-10T01:34:47.652843",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06848",
      "title": "Chaos as a Possible Probe for Scalar Hair in Horndeski Gravity",
      "authors": [
        "Yang Yu",
        "Ruo-Ting Chen",
        "Shulan Li",
        "Dan Zhang",
        "Jian-Pin Wu"
      ],
      "abstract": "Chaos as a Possible Probe for Scalar Hair in Horndeski Gravity Yang Yu, Ruo-Ting Chen, Shulan Li, Dan Zhang, Jian-Pin Wu General Relativity and Quantum Cosmology (gr-qc) The detection of black hole scalar hair, a possible deviation from general relativity's \"no-hair\" theorem, requires sensitive probes beyond conventional methods. This study proposes chaotic dynamics as a novel indicator for scalar hair in Horndeski gravity. We investigate the motion of a spinning test particle in a static, spherically symmetric hairy black hole spacetime. Our results show that increasing scalar hair systematically suppresses orbital chaos, as evidenced by regularized precession, reduced Lyapunov exponents, and contracted Poincare sections. Furthermore, scalar hair enhances the correlation between the two gravitational wave polarization modes, restoring phase coherence. These findings demonstrate that chaotic observables and gravitational wave signatures can jointly serve as sensitive probes for black hole hair, offering a complementary approach to testing gravity in strong-field regimes.",
      "pdf_url": "https://arxiv.org/pdf/2602.06848.pdf",
      "published": "2026-02-10T01:34:47.653216",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06125",
      "title": "Gravitational Wave Scattering in Spinless WQFT",
      "authors": [
        "Yilber Fabian Bautista",
        "Mathias Driesse",
        "Kays Haddad",
        "Gustav Uhre Jakobsen"
      ],
      "abstract": "Gravitational Wave Scattering in Spinless WQFT Yilber Fabian Bautista, Mathias Driesse, Kays Haddad, Gustav Uhre Jakobsen v1: 24 pages, 3 figures, 3 appendices High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc) We develop the computational framework for gravitational wave - black hole scattering in worldline quantum field theory (WQFT) without spin. Crucially, we prove on general grounds that, in the absence of dissipation, the exponential representation of the $S$-matrix maps -- through a partial-wave transformation -- directly onto the scattering phase shift from black hole perturbation theory (BHPT), indicating an exponentiation of the WQFT amplitude itself in partial-wave space. Computing explicitly, we reproduce the BHPT phase shift without spin up to $O(G^{3})$ from WQFT. While this result is expected, it lays the groundwork for higher-precision analyses involving non-minimal effects. Along the way, we outline our efficient diagram generation technique and include a pedagogical discussion on the computation of the required two-loop integrals.",
      "pdf_url": "https://arxiv.org/pdf/2602.06125.pdf",
      "published": "2026-02-10T01:34:47.654415",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-th",
        "cross_list_from": "hep-th"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06562",
      "title": "Universality of Primordial Anisotropies in Gravitational Wave Background",
      "authors": [
        "Boyuan Jiang",
        "Ryo Saito",
        "Ying-li Zhang"
      ],
      "abstract": "Universality of Primordial Anisotropies in Gravitational Wave Background Boyuan Jiang, Ryo Saito, Ying-li Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We propose a model-independent formalism for describing anisotropies in the stochastic gravitational wave background (SGWB) originating from primordial perturbations. Despite their diverse physical origins -- such as Sachs-Wolfe effects, integrated Sachs-Wolfe effects, or fossil effects from primordial non-Gaussianity -- SGWB anisotropies exhibit a universal angular structure. We show that this universality arises from a single vertex function, the Cosmological Form Factor (CFF), which encodes the information on how long-wavelength modes modulate the SGWB statistics. Two fundamental principles -- statistical isotropy and locality -- uniquely determine the angular dependence of the CFF, resulting in a universal multipole scaling of the SGWB anisotropies. The CFF formalism provides a common language for classifying SGWB anisotropies and offers a powerful framework for interpreting upcoming observations.",
      "pdf_url": "https://arxiv.org/pdf/2602.06562.pdf",
      "published": "2026-02-10T01:34:47.654976",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06661",
      "title": "Chiral phase transition with primordial black holes: Distinct phase structure and catalysis",
      "authors": [
        "Masanori Tanaka",
        "Jun-Chen Wang",
        "Jing-Jun Zhang"
      ],
      "abstract": "Chiral phase transition with primordial black holes: Distinct phase structure and catalysis Masanori Tanaka, Jun-Chen Wang, Jing-Jun Zhang High Energy Physics - Phenomenology (hep-ph); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We study the impact of primordial black holes (PBHs) on the chiral phase transition and its associated stochastic gravitational-wave (GW) signals. Using the three-flavor Nambu-Jona-Lasinio model, we construct the chiral effective potential in a Schwarzschild spacetime background. We find that PBHs promote chiral symmetry restoration and induce a nontrivial local phase structure in the vicinity of the event horizon simultaneously. In particular, this structure exhibits a novel chiral symmetry breaking pattern involving both second- and first-order phase transitions, a feature absent in flat spacetime. We further demonstrate that PBHs act as genuine catalysts for the chiral phase transition by analyzing the bounce solution in curved spacetime. The presence of PBHs substantially enhances the inverse duration parameter $\\beta/H$ while leaving the overall transition strength comparable to that in flat spacetime. As a consequence, even a small population of PBHs can induce $\\mathcal{O}(1)$ shifts in both the peak frequency and the peak amplitude of the GW spectrum generated by the first-order dark chiral phase transition.",
      "pdf_url": "https://arxiv.org/pdf/2602.06661.pdf",
      "published": "2026-02-10T01:34:47.655164",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06951",
      "title": "Gravitational Raman Scattering: a Systematic Toolkit for Tidal Effects in General Relativity",
      "authors": [
        "Mikhail M. Ivanov",
        "Yue-Zhou Li",
        "Julio Parra-Martinez",
        "Zihan Zhou"
      ],
      "abstract": "Gravitational Raman Scattering: a Systematic Toolkit for Tidal Effects in General Relativity Mikhail M. Ivanov, Yue-Zhou Li, Julio Parra-Martinez, Zihan Zhou High Energy Physics - Theory (hep-th); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We present a framework for systematic computations of scattering amplitudes for gravitational Raman scattering, -- the inelastic scattering of massless fields off compact relativistic objects. We focus on the small-frequency (post-Minkowskian, PM) regime relevant for the study of tidal effects, which can be mapped onto gravitational wave observables during the inspiraling phase of a merger. We demonstrate that this setup is ideal for systematic studies of tidal effects, in a way that is free from coordinate, gauge, and field redefinition ambiguities. We use a combination of worldline effective field theory, the background field method, and advanced scattering amplitude techniques to derive phase shifts for scattering of spin-$0,1,2$ fields off generic compact objects at third PM order. We demonstrate that the inclusion of the recoil of the object is crucial for consistency of this calculation. Focusing on a particular case of black holes, we extract the leading static and dynamical Love numbers of the spin-0 field and the static Love number of the spin-1 field in four dimensions by matching our EFT amplitudes and calculations in General Relativity. We show, fully on-shell, that the leading static Love numbers vanish identically, while the dynamical Love numbers are not zero and run logarithmically. The latter resolves the ambiguities of previous off-shell matching calculations. We also extend our results to seven dimensions, where spin-2 Love numbers undergo a renormalization group running at 2PM, which we compute explicitly. In addition, we extract the leading static Love numbers of spin-0 and spin-1 fields in five dimensions, which also run.",
      "pdf_url": "https://arxiv.org/pdf/2602.06951.pdf",
      "published": "2026-02-10T01:34:47.655760",
      "updated": null,
      "categories": [
        "hep-th",
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-th",
        "cross_list_from": "hep-th"
      }
    },
    {
      "id": "https://arxiv.org/abs/2502.04059",
      "title": "Fundamental oscillations as a tool to distinguish boson stars from neutron stars and black holes",
      "authors": [
        "Swarnim Shirke",
        "Bikram Keshari Pradhan",
        "Debarati Chatterjee",
        "Laura Sagunski",
        "Jürgen Schaffner-Bielich"
      ],
      "abstract": "Fundamental oscillations as a tool to distinguish boson stars from neutron stars and black holes Swarnim Shirke, Bikram Keshari Pradhan, Debarati Chatterjee, Laura Sagunski, Jürgen Schaffner-Bielich 27 pages (single column), 3 figures. Accepted version of the manuscript. Published in Physics of the Dark Universe Journal Physics of the Dark Universe 50, 102170 (2025) General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Massive boson stars are self-gravitating configurations of self-interacting scalar fields and can be modeled by a massive scalar field with a quartic self-interaction potential. It has been shown that the equation of state and static structure properties, such as mass and radius, follow scaling relations independent of microscopic dark matter properties. In this work, we demonstrate for the first time that non-radial fundamental ($f$-)mode characteristics also follow a scaling in the strong interaction limit, opening up the outstanding prospect of evaluating the mode properties for boson stars for arbitrary masses spanning the scalar dark matter parameter space allowed by current observations. We provide the scaling relations within full general relativity and obtain the mode characteristics corresponding to the maximum boson star mass configuration. We apply these to determine the $f$-mode properties for boson stars solely as a function of their mass and compactness, which allows distinguishing them from those of neutron stars and black hole quasinormal modes in comparable mass range. In particular, we show that the frequencies are always lower than those of corresponding black holes of the same mass by a factor of 4.5. This provides a smoking gun for the distinguishability of boson stars from other compact objects using gravitational wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2502.04059.pdf",
      "published": "2026-02-10T01:34:47.656126",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.15168",
      "title": "Strong lensing cosmography using binary-black-hole mergers: Prospects for the near future",
      "authors": [
        "Koustav N. Maity",
        "Souvik Jana",
        "Tejaswi Venumadhav",
        "Ankur Barsode",
        "Parameswaran Ajith"
      ],
      "abstract": "Strong lensing cosmography using binary-black-hole mergers: Prospects for the near future Koustav N. Maity, Souvik Jana, Tejaswi Venumadhav, Ankur Barsode, Parameswaran Ajith General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) A small fraction of gravitational-wave (GW) signals from binary black holes (BBHs) will be gravitationally lensed by intervening galaxies and galaxy clusters. Strong lensing will produce multiple identical copies of the GW signal arriving at different times. Jana et al.~\\cite{Jana_2023} recently proposed a method to constrain cosmological parameters using strongly lensed GW events detected by next-generation (XG) detectors. The idea is that the number of strongly lensed GW events and the distribution of their lensing time delays encode imprints of the cosmological parameters. From the observed number of lensed GW events (tens of thousands) and their time delay distribution, this method can provide a new probe of cosmology, obtaining information at intermediate redshifts. In this work, we explore the possibility of doing lensing cosmography using upcoming observations of the upgraded LIGO-Virgo-KAGRA (LVK) network. This requires incorporating the detector network selection effects in the analysis, which was neglected earlier. We expect dozens of lensed GW events to be detected by upgraded LVK detectors, potentially enabling modest constraints on cosmological parameters. Even with relatively modest numbers of lensed detections, we demonstrate the potential of lensing cosmography. For XG detectors, our revised forecasts are consistent with the earlier forecasts that neglected the selection effects.",
      "pdf_url": "https://arxiv.org/pdf/2512.15168.pdf",
      "published": "2026-02-10T01:34:47.657768",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.21215",
      "title": "Reheating after the Supercooled Phase Transitions with Radiative Symmetry Breaking",
      "authors": [
        "Francesco Rescigno",
        "Alberto Salvio"
      ],
      "abstract": "Reheating after the Supercooled Phase Transitions with Radiative Symmetry Breaking Francesco Rescigno, Alberto Salvio 29 pages, 3 figures, some clarifying statements and references added High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Theories with radiative symmetry breaking (RSB) lead to first-order phase transitions and the production of gravitational waves as well as primordial black holes if the supercooling period lasted long enough. Here we explain how to efficiently reheat the universe after such period in the above-mentioned class of theories. Two cases are possible, depending on whether the RSB scale is much larger than the electroweak (EW) symmetry breaking scale or not. When it is, the dominant reheating mechanism can be the decays of the field responsible for RSB in the Standard Model (SM) sector. We point out that in a similar way dark matter (DM) can be produced and we analyze in some detail the case of a sterile-neutrino, finding that the full DM abundance is reproduced when this particle is at the $10^2$ MeV scale in a well-motivated SM completion. When the RSB scale is not much larger than the EW symmetry breaking scale, we find that efficient reheating always occurs when the energy density of the false vacuum is first entirely transferred to a dark photon and then to SM fermions via dark-photon decays.",
      "pdf_url": "https://arxiv.org/pdf/2507.21215.pdf",
      "published": "2026-02-10T01:34:47.658332",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06660",
      "title": "Rotational Behaviour of Exotic Compact Objects",
      "authors": [
        "Zakary Buras-Stubbs",
        "Ilídio Lopes"
      ],
      "abstract": "Rotational Behaviour of Exotic Compact Objects Zakary Buras-Stubbs, Ilídio Lopes 13 pages, 8 figures, Accepted for publication in PRD High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We construct exotic compact objects composed entirely of self-interacting asymmetric fermionic dark matter governed by a repulsive Yukawa potential with massive dark interaction boson. By considering the structural, tidal, and rotational properties of solar mass self-gravitating dark matter systems, and contrasting them against purely baryonic neutron stars, described by the well understood SLy4 equation of state, we hope to shed some light on the place of dark compact systems in the context of gravitational wave astronomy, specifically due to the difficulty parsing mass and radius data from events with no electromagnetic counterpart. Here we consider systems composed of 1 GeV and 10 GeV dark matter. Relevant compact objects are then analysed and simulated as both static bodies, and rotating systems governed by the Hartle-Thorne formalism to second order. Here within we highlight the differences in key tidal and rotational properties encoded in gravitational wave signals, and analyse how dark objects may mimic or distinguish themselves to current and future gravitational wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2602.06660.pdf",
      "published": "2026-02-10T01:34:47.752226",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.08546",
      "title": "Metastable Strings and Gravitational Waves in One-Scale Models",
      "authors": [
        "James Ingoldby",
        "Valentin V. Khoze",
        "Jessica Turner"
      ],
      "abstract": "Metastable Strings and Gravitational Waves in One-Scale Models James Ingoldby, Valentin V. Khoze, Jessica Turner 21 pages, 3 figures, refs added. To match published version High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Metastable cosmic strings provide a minimal and predictive origin for the stochastic gravitational-wave background reported by Pulsar Timing Array experiments. We analyse this possibility in electroweak-like dark sectors with a single-stage breaking $SU(2)\\times U(1)\\!\\to\\!U(1)$ driven by one Higgs field. In the regime with dark sector Higgs mass below the $Z'$ mass, and for sufficiently small $W'$ mass, the resulting $Z$-string is classically stable but undergoes quantum decay via nucleation of monopole--antimonopole pairs along the string. We compute the corresponding semiclassical bounce action in a thin-defect approximation, treating both the string core and the monopole endpoints as localised defects whose sizes are small relative to their separation in the tunnelling configuration. This yields a decay rate per unit length that depends on the gauge couplings and the mass hierarchy. We delineate the parameter space in which single-scale dark-sector models reproduce the PTA signal, demonstrating the applicability of the thin-defect approximation throughout the phenomenologically favoured region and without invoking extended Higgs sectors or multi-stage symmetry breaking.",
      "pdf_url": "https://arxiv.org/pdf/2511.08546.pdf",
      "published": "2026-02-10T01:34:47.755264",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06615",
      "title": "Studies on the spin and magnetic inclination evolution of magnetars Swift J1834.9-0846 under wind braking",
      "authors": [
        "Biaopeng Li",
        "Zhifu Gao",
        "Wenqi Ma",
        "Weifeng Zhang",
        "Quan Cheng",
        "L.C. Garcia de Andrade"
      ],
      "abstract": "Studies on the spin and magnetic inclination evolution of magnetars Swift J1834.9-0846 under wind braking Biaopeng Li, Zhifu Gao, Wenqi Ma, Weifeng Zhang, Quan Cheng, L.C. Garcia de Andrade 23 pages, 8 figures, Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) The magnetar Swift J1834.9-0846 presents a significant challenge to neutron star spin-down models. It exhibits two key anomalies: an insufficient rotational energy loss rate to power its observed X-ray luminosity, and a braking index of $ = 1.08\\pm 0.04$, which starkly contradicts the canonical magnetic dipole value of $n=3$. To explain these anomalies, we develop a unified spin-evolution model that self-consistently integrates magnetic dipole radiation, gravitational wave emission, and wind braking. Within this framework, we constrain the wind braking parameter to $\\kappa \\in [13, 37]$ from the nebular properties, finding it contributes substantially (17%-51%) to the current spin-down torque. Bayesian inference reveals that the birth period is poorly constrained by present data and is prior-dependent, indicating a millisecond birth is allowed but not required. Furthermore, we constrain the number of precession cycles to $\\xi \\sim 10^{4}$--$10^{5}$, and our analysis favors a toroidally-dominated internal magnetic field configuration as the most self-consistent explanation for the low braking index. Finally, we assess the continuous gravitational-wave detectability. The present-day signal is undetectable. However, the early-time signal might have reached the projected sensitivity of next-generation gravitational-wave observatories, such as the Advanced Laser Interferometer Gravitational-Wave Observatory (aLIGO) and the Einstein Telescope (ET), although a confident detection would require exceptionally stable rotation, an assumption considered highly optimistic for a young magnetar. This work establishes a unified framework that links magnetar spin-down with their interior physics and multi-messenger observables, providing a physically consistent interpretation for Swift J1834.9-0846 and a new tool for understanding similar extreme neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2602.06615.pdf",
      "published": "2026-02-10T01:34:47.852885",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06789",
      "title": "Forecasting Supermassive Black Hole Binary Gravitational Wave Probes: Prospects for Future Pulsar Timing Array and Space-Borne Detectors",
      "authors": [
        "Katsunori Kusakabe",
        "Yoshiyuki Inoue",
        "Daisuke Toyouchi",
        "Keitaro Takahashi"
      ],
      "abstract": "Forecasting Supermassive Black Hole Binary Gravitational Wave Probes: Prospects for Future Pulsar Timing Array and Space-Borne Detectors Katsunori Kusakabe, Yoshiyuki Inoue, Daisuke Toyouchi, Keitaro Takahashi High Energy Astrophysical Phenomena (astro-ph.HE) We present a comprehensive framework for predicting the detection prospects of supermassive black hole binaries (SMBHBs) by future gravitational wave (GW) observatories, examining both space-borne detectors (LISA, Taiji, TianQin) and next-generation pulsar timing array (PTA) combined with the Square Kilometre Array (SKA-PTA). Leveraging dual active galactic nucleus (AGN) fractions and AGN X-ray luminosity functions, we systematically evaluate the detectable SMBHB populations with a detection threshold of signal-to-noise ratio $\\geq 5$ for each GW observatory. Our analysis reveals that space-borne detectors are expected to identify approximately $\\sim 1 \\text{--} 2$ to $\\sim 20$ events per year, depending on the SMBHB orbital evolution prescriptions. On the other hand, SKA-PTA demonstrates the potential to reach the first GW detection from individual SMBHBs within a few years of observation and achieve detectable GW source counts of $10^2 \\text{--} 10^3$ after about 10 years, depending on PTA configurations. These facilities will significantly improve SMBHB detectability and enable characterization of their properties across different frequency bands.",
      "pdf_url": "https://arxiv.org/pdf/2602.06789.pdf",
      "published": "2026-02-10T01:34:47.853429",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06696",
      "title": "Bayesian Constraints on the Neutron Star Equation of State with a Smooth Hadron-Quark Crossover",
      "authors": [
        "Xavier Grundler",
        "Bao-An Li"
      ],
      "abstract": "Bayesian Constraints on the Neutron Star Equation of State with a Smooth Hadron-Quark Crossover Xavier Grundler, Bao-An Li Nuclear Theory (nucl-th); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th); Nuclear Experiment (nucl-ex) We perform a Bayesian inference of the dense-matter equation of state (EOS) within a unified framework that incorporates hadronic matter, quark matter, and a smooth hadron--quark crossover. The EOS is constrained using physical consistency filters, gravitational-wave data from GW170817, NICER mass--radius measurements, and hypothetical future high-precision radius data. We find that current observations strongly constrain the density dependence of the nuclear symmetry energy, particularly its slope and curvature, while the highest-density hadronic parameters and quark-matter parameters remain only weakly constrained. The posterior distributions favor a crossover centered at an energy density $\\overline{\\varepsilon}\\sim(4$--$6)\\varepsilon_0$ with a width $\\Gamma\\sim(0.5$--$1.0)\\varepsilon_0$, where $\\varepsilon_0$ is the energy density of symmetric nuclear matter at saturation. The most probable radius of a canonical neutron star is $R_{1.4}\\simeq 11.5-13.0$ km, and the maximum mass is $M_{\\rm TOV}\\simeq 2.2\\,M_\\odot$. Overall, present data primarily probe the low-to-intermediate density EOS and provide limited direct sensitivity to quark matter and genuinely high-density physics, highlighting the need for next-generation precision radius measurements.",
      "pdf_url": "https://arxiv.org/pdf/2602.06696.pdf",
      "published": "2026-02-10T01:34:47.855413",
      "updated": null,
      "categories": [
        "nucl-th",
        "astro-ph.HE",
        "hep-ph",
        "hep-th",
        "nucl-ex"
      ],
      "primary_category": "nucl-th",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from nucl-th",
        "cross_list_from": "nucl-th"
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.02866",
      "title": "Probing Boson Clouds with Supermassive Black Hole Binaries",
      "authors": [
        "Ximeng Li",
        "Jing Ren",
        "Xi-Li Zhang"
      ],
      "abstract": "Probing Boson Clouds with Supermassive Black Hole Binaries Ximeng Li, Jing Ren, Xi-Li Zhang High Energy Physics - Phenomenology (hep-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Rotating black holes can generate boson clouds via superradiance when the boson's Compton wavelength is comparable to the black hole's size. In binary systems, these clouds can produce distinctive observational imprints. Recent studies accounting for nonlinearities induced by orbital backreaction suggest that if the binary forms at a large separation, resonance transitions can significantly deplete the cloud, minimizing later observational consequences except for very specific orbital inclinations. In this paper, we extend this framework to supermassive black hole binaries (SMBHBs), considering the influence of their astrophysical evolutionary histories. We find that, before entering the gravitational wave (GW) radiation stage, the additional energy loss channels can accelerate orbital evolution. This acceleration makes hyperfine resonant transitions inefficient, allowing a sufficient portion of the cloud to remain for later direct observations. We further discuss the ionization effects and cloud depletion occurring at this stage. Based on these theoretical insights, we explore how multi-messenger observations for SMBHBs can be utilized to detect the ionization effects of boson clouds by examining changes in the orbital period decay rate via electromagnetic measurements and variations in GW strain over a wide frequency band. Our findings reveal a complex dependence on the binary's total mass, mass ratio, and boson mass, emphasizing the significant role of astrophysical evolution histories in detecting boson clouds within binaries.",
      "pdf_url": "https://arxiv.org/pdf/2505.02866.pdf",
      "published": "2026-02-10T01:34:47.858220",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.HE"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.16753",
      "title": "The WINTER Observatory: A One-Degree InGaAs Survey Camera to study the Transient Infrared Sky",
      "authors": [
        "Danielle Frostig",
        "Nathan Lourie",
        "Viraj Karambelkar",
        "Mansi M. Kasliwal",
        "Andrew Malonis",
        "Robert A. Simcoe",
        "Robert Stein",
        "John W. Baker",
        "Kevin Burdge",
        "Rick Burruss",
        "Curt Corcoran",
        "Kishalay De",
        "Gabor Furesz",
        "Nicolae Ganciu",
        "Kari Haworth",
        "Carolyn M. Heffner",
        "Erik Hinrichsen",
        "Jill Juneau",
        "Geoffrey Mo",
        "Josiah Purdum",
        "Sam Rose",
        "Cruz Soto",
        "Jeffry Zolkower"
      ],
      "abstract": "The WINTER Observatory: A One-Degree InGaAs Survey Camera to study the Transient Infrared Sky Danielle Frostig, Nathan Lourie, Viraj Karambelkar, Mansi M. Kasliwal, Andrew Malonis, Robert A. Simcoe, Robert Stein, John W. Baker, Kevin Burdge, Rick Burruss, Curt Corcoran, Kishalay De, Gabor Furesz, Nicolae Ganciu, Kari Haworth, Carolyn M. Heffner, Erik Hinrichsen, Jill Juneau, Geoffrey Mo, Josiah Purdum, Sam Rose, Cruz Soto, Jeffry Zolkower 24 Pages, 20 Figures, Submitted to PASP Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The Wide-field Infrared Transient Explorer (WINTER) is a near-infrared time-domain survey instrument operating on a dedicated 1-meter robotic telescope at Palomar Observatory. The project takes advantage of recent technology advances in time-domain astronomy, robotic telescopes, large-format sensors, and rapid data reduction and alert software for timely follow up of events. Since June of 2023, WINTER robotically surveys the sky each night to a median depth of J_AB = 18.5 mag, balancing a variety of science programs including searching for kilonovae from gravitational-wave alerts, blind surveys to study galactic and extragalactic transients and variables, and building up reference images of the near-infrared sky. The project also serves as a technology demonstration for new large-format Indium Gallium Arsenide (InGaAs) sensors for wide-field science in the near infrared without cryogenically cooled optics or detectors. WINTER's custom camera combines six InGaAs sensors with a novel tiled fly's-eye optical design to cover a >1 deg^2 field of view with 1 arcsecond pixels in the Y-, J-, and shortened-H-band filters (0.9 - 1.7 micron). This paper presents the design, performance, and early on-sky science of the WINTER observatory.",
      "pdf_url": "https://arxiv.org/pdf/2512.16753.pdf",
      "published": "2026-02-10T01:34:47.858553",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06878",
      "title": "Antenna for the detection of electromagnetic audio-band disturbances on-board LISA",
      "authors": [
        "D. Serrano , A. Pérez-Ortega , D. Roma-Dollase , J. Salvans-Tort , J. Ho-Zhang , J. Ramos-Castro , M. Nofrarias Institut de Ciències de l'Espai, Institut d'Estudis Espacials de Catalunya, Departament d'Enginyeria Electrònica, Universitat Politècnica de Catalunya)"
      ],
      "abstract": "Antenna for the detection of electromagnetic audio-band disturbances on-board LISA D. Serrano (1 and 2), A. Pérez-Ortega (1 and 2), D. Roma-Dollase (1 and 2), J. Salvans-Tort (1 and 2), J. Ho-Zhang (1 and 2), J. Ramos-Castro (2 and 3), M. Nofrarias (1 and 2) ((1) Institut de Ciències de l'Espai, (2) Institut d'Estudis Espacials de Catalunya, (3) Departament d'Enginyeria Electrònica, Universitat Politècnica de Catalunya) Class. Quantum Grav. 42 (2025) 245006 Instrumentation and Methods for Astrophysics (astro-ph.IM) The LISA mission will be the first observatory to detect gravitational waves from space within the millihertz frequency band. Magnetic forces have an important impact on the instrument's sensitivity below the millihertz. Hence, monitoring the magnetic environment within each of the LISA spacecrafts is of utmost importance. In this Letter we present the characterization of the coils that were used in LISA Pathfinder (LPF) when operating as magnetic sensors in the audio frequency band. The necessity of implementing this type of magnetometer is presented in order to monitor high frequency magnetic signals from the electronics on-board. We show that the LPF coils have a performance one order of magnitude better than the current requirements set by the LISA mission at the low end of the audio-band frequency. The LPF coils are able to measure a magnetic noise level of 1.45 $\\rm pT/\\sqrt{\\rm{Hz}}$ at 50 Hz and 0.17 $\\rm pT/\\sqrt{\\rm{Hz}}$ at 500 Hz. Additionally, the LPF coils can reach a magnetic noise floor of 0.1 $\\rm pT/\\sqrt{\\rm{Hz}}$ at frequencies above 1 kHz.",
      "pdf_url": "https://arxiv.org/pdf/2602.06878.pdf",
      "published": "2026-02-10T01:34:48.218807",
      "updated": null,
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    }
  ]
}