{
  "date": "2026-02-21",
  "crawl_timestamp": "2026-02-21T01:33:36.663157",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 140,
    "total_gw_papers": 16,
    "by_category": {
      "gr-qc": {
        "total": 27,
        "gw_related": 6
      },
      "astro-ph": {
        "total": 86,
        "gw_related": 7
      }
    }
  },
  "crawl_verification": {
    "total_expected": 183,
    "total_actual": 183,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 49,
        "actual_crawled": 49,
        "page_source_info": "Total of 49 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 23,
        "actual_crawled": 23,
        "page_source_info": "Total of 23 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 30,
        "actual_crawled": 30,
        "page_source_info": "Total of 30 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 33,
        "actual_crawled": 33,
        "page_source_info": "Total of 33 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 12,
        "actual_crawled": 12,
        "page_source_info": "Total of 12 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 17,
        "actual_crawled": 17,
        "page_source_info": "Total of 17 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.17154",
      "title": "Extreme-mass ratio inspirals in Schwarzschild - de Sitter spacetime I: Weak-field orbits",
      "authors": [
        "John Adrian N. Villanueva",
        "Ian Vega"
      ],
      "abstract": "Extreme-mass ratio inspirals in Schwarzschild - de Sitter spacetime I: Weak-field orbits John Adrian N. Villanueva, Ian Vega General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) The inspiral of a compact object into a black hole is a key source of low-frequency gravitational waves for future space-based detectors like LISA. While models of this process have advanced, they typically focus on asymptotically flat spacetimes. In this paper, we explore how the absence of asymptotic flatness affects the slow, adiabatic orbital evolution due to radiation reaction. This lack of asymptotic flatness can arise from external environments or an expanding universe. Using the Schwarzschild-de Sitter (SdS) spacetime, where the deviation from flatness is governed by the cosmological constant, we study bound orbits characterized by their semi-latus rectum $p$ and eccentricity $e$. We calculate how the cosmological constant shifts the separatrix between bound and plunging orbits and alters the relationship between the binary's binding energy, angular momentum, and orbital parameters. Assuming the orbital timescale is much shorter than the inspiral timescale, we apply a modified quadrupole formula to examine the impact of a small positive cosmological constant on the orbital evolution in the weak-field limit. We find that the cosmological constant accelerates the decrease in eccentricity, reducing inspiral plunge times, which could influence event rate estimates for space-based detectors.",
      "pdf_url": "https://arxiv.org/pdf/2602.17154.pdf",
      "published": "2026-02-21T01:33:35.827996",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.17343",
      "title": "Uncovering subdominant multipole asymmetries in binary black-hole mergers",
      "authors": [
        "Jannik Mielke",
        "Angela Borchers",
        "Frank Ohme"
      ],
      "abstract": "Uncovering subdominant multipole asymmetries in binary black-hole mergers Jannik Mielke, Angela Borchers, Frank Ohme General Relativity and Quantum Cosmology (gr-qc) In dynamically formed binaries, the spins of the black holes tend to be misaligned with the system's orbital angular momentum. This causes the spins to precess and leads to an asymmetric emission of gravitational waves. The resulting gravitational-wave multipole asymmetries directly source the recoil of the remnant black hole and are the critical element in fully describing precession. Recoil and precession are of significant astrophysical importance, but multipole asymmetries contribute only minimally to the overall signal strength. Consequently, most current gravitational-wave models either do not incorporate asymmetries at all, or only consider the dominant ones. Here we highlight the importance of subdominant multipole asymmetries for an accurate recoil velocity calculation and discuss their detectability with third generation detectors. Neglecting subdominant asymmetries leads to velocity differences of up to 210 km/s and can, in particular, introduce systematic biases in the inference of masses and the spin geometry. We further discuss universal characteristics of subdominant multipole asymmetries in order to prepare the ground for potential future asymmetry models. In the inspiral regime, the average antisymmetric frequencies can be described by a multiple of the orbital frequency. During ringdown, however, they become equal to their corresponding symmetric frequencies.",
      "pdf_url": "https://arxiv.org/pdf/2602.17343.pdf",
      "published": "2026-02-21T01:33:35.828186",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.17524",
      "title": "Inspiral tests of general relativity and waveform geometry",
      "authors": [
        "Brian C. Seymour",
        "Jacob Golomb",
        "Yanbei Chen"
      ],
      "abstract": "Inspiral tests of general relativity and waveform geometry Brian C. Seymour, Jacob Golomb, Yanbei Chen 17 pages, 11 figures, comments welcome General Relativity and Quantum Cosmology (gr-qc) The phase evolution of gravitational waves encodes critical information about the orbital dynamics of binary systems. In this work, we test the robustness of parameterized tests against unmodeled deviations from general relativity. We demonstrate that these parameterized tests are flexible and sensitive in detecting generic deviations in the waveform using the Cutler-Vallisneri bias formalism. This universality arises from examining the inherent geometry of the waveform signal and understanding how biases manifest. We show how Bayes factors are governed by the intrinsic geometry of the waveform signal manifold when parameterized tests are used to approximate generic violations of GR. We use the singular value decomposition to propose templates that are orthogonal to parameterized tests, identifying degeneracies and enhancing the detection of potential deviations. More broadly, the geometric framework developed here clarifies -- at a fundamental level -- how subtle waveform effects (including orbital eccentricity, spin precession, waveform systematics, and instrumental glitches) can mimic one another in data, and when they are intrinsically distinguishable.",
      "pdf_url": "https://arxiv.org/pdf/2602.17524.pdf",
      "published": "2026-02-21T01:33:35.828884",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.16792",
      "title": "Fast pre-merger detection of massive black-hole binaries in LISA based on time-frequency excess power",
      "authors": [
        "Francesco Nobili",
        "Malvina Bellotti",
        "Riccardo Buscicchio",
        "Massimo Dotti",
        "Alessandro Lupi"
      ],
      "abstract": "Fast pre-merger detection of massive black-hole binaries in LISA based on time-frequency excess power Francesco Nobili, Malvina Bellotti, Riccardo Buscicchio, Massimo Dotti, Alessandro Lupi Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The Laser Interferometer Space Antenna is expected to observe gravitational waves from massive black hole binaries across cosmic time. Many are anticipated to be detectable hours to weeks before coalescence. We present a fast algorithm for the pre-merger detection and preliminary characterization of such binaries. The method performs a search for excess power with a chirping time-frequency morphology in short-time Fourier transform spectrograms. By tiling the time-frequency plane with slices defined by the quadrupole frequency evolution, we define a signal significance relative to a fitted background distribution of instrumental noise and Galactic foreground. Individual search triggers are followed by a coherence tracker, which groups over time triggers consistent with the same physical signal . Doing so, our analysis provides progressively refined estimates of the chirp mass and coalescence time. We validate our algorithm on the Sangria LISA Data Challenge dataset, successfully detecting all 15 injected MBHBs: 14 of them hours-to-weeks before merger, while one is only detected after the binary coalescence. The algorithm yields chirp mass relative errors below $3\\%$ for high-SNR sources and coalescence time uncertainties of up to a few hours. With a computational cost of less than a second to process a 10-day data segment on single core, our approach is suitable for generating real-time alerts, trigger protected observational periods, and provide informative priors for Bayesian parameter estimation.",
      "pdf_url": "https://arxiv.org/pdf/2602.16792.pdf",
      "published": "2026-02-21T01:33:35.829803",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.16808",
      "title": "Analytical Estimates of Gravitational Wave Background Anisotropies from Shot Noise and Large-Scale Structure in Pulsar Timing Arrays",
      "authors": [
        "Meng-Xiang Lin",
        "Adam Lidz",
        "Chung-Pei Ma"
      ],
      "abstract": "Analytical Estimates of Gravitational Wave Background Anisotropies from Shot Noise and Large-Scale Structure in Pulsar Timing Arrays Meng-Xiang Lin, Adam Lidz, Chung-Pei Ma Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) An important next step for pulsar timing arrays (PTAs) is to measure anisotropies in the gravitational wave background (GWB) at $\\sim$ nano-Hz frequencies. We calculate the expected GWB anisotropies using empirically calibrated models for the merger rates of supermassive black hole binaries (SMBHBs). The anisotropies reflect both shot-noise in the discrete SMBHB populations while also tracing, in part, the large-scale structure (LSS) of the universe. The shot-noise term is sensitive to the high-mass end of the merging SMBH mass function, depends somewhat on the low-redshift tail of the merger distribution, and is a strong function of observing frequency. The precise frequency dependence provides a test of SMBHB residence times. In our models, the mean shot-noise anisotropy typically lies close to or above the broad frequency-band NANOGrav upper limits. Consequently, near-future PTA data, and potentially re-analyses of existing measurements using frequency-dependent shot-noise anisotropy templates, should be capable of detecting this signal or placing meaningful constraints on SMBHB merger models. A full interpretation, however, will require modeling the probability distribution of shot-noise amplitudes rather than relying solely on ensemble-averaged predictions. The LSS-induced anisotropies are at least two to three orders of magnitude smaller. Although the LSS contribution contains valuable information regarding the redshift distribution and clustering bias of the merging SMBHBs, detecting this component will be challenging.",
      "pdf_url": "https://arxiv.org/pdf/2602.16808.pdf",
      "published": "2026-02-21T01:33:35.830020",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.17188",
      "title": "Kolmogorov analysis of pulsar TOA",
      "authors": [
        "N. Galikyan",
        "A.A. Kocharyan",
        "V.G. Gurzadyan"
      ],
      "abstract": "Kolmogorov analysis of pulsar TOA N. Galikyan, A.A. Kocharyan, V.G. Gurzadyan 4 pages, 8 figs; A&A Lett. (in press) Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) The Kolmogorov stochasticity parameter (KSP) as a sensitive descriptor of degree of randomness of signals is used to analyze the properties of the NANOGrav pulsar timing data associated to a stochastic gravitational wave background. The time of arrival (TOA) data of white noise for 68 pulsars are analyzed regarding their KSP properties. The analysis enables to obtain the degree of randomness of the white noise for various pulsars and to reveal its inhomogeneity, i.e. pulsars with low and high randomness of the white noise. The time-dependence of the randomness in the white noise is also studied, indicating the existence of non-stationary physical processes influencing the pulsar timing. The KSP thus is acting as an indicator for the degree of the agreement between the observations and the timing models and as a test in revealing the contribution of various physical processes in the stochastic background signal.",
      "pdf_url": "https://arxiv.org/pdf/2602.17188.pdf",
      "published": "2026-02-21T01:33:35.830679",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.17267",
      "title": "Illuminating the Mass Gap Through Deep Optical Constraint on a Neutron Star Merger Candidate S250206dm",
      "authors": [
        "Zhengyan Liu",
        "Zelin Xu",
        "Ji-an Jiang",
        "Wen Zhao",
        "Zhiping Jin",
        "Zigao Dai",
        "Dezheng Meng",
        "Xuefeng Wu",
        "Daming Wei",
        "Runduo Liang",
        "Lei He",
        "Minxuan Cai",
        "Lulu Fan",
        "Weiyu Wu",
        "Junhan Zhao",
        "Ziqing Jia",
        "Kexin Yu",
        "Jinjun Geng",
        "Di Xiao",
        "Feng Li",
        "Jinlong Tang",
        "Yingxi Zuo",
        "Xiaoling Zhang",
        "Hao Liu",
        "Jian Wang",
        "Hongfei Zhang",
        "Ming Liang",
        "Hairen Wang",
        "Dazhi Yao",
        "Lei Hu",
        "Xu Kong",
        "Bin Li",
        "Ning Jiang",
        "Tinggui Wang",
        "Zhen Wan",
        "Yongquan Xue",
        "Qingfeng Zhu",
        "Xianzhong Zheng"
      ],
      "abstract": "Illuminating the Mass Gap Through Deep Optical Constraint on a Neutron Star Merger Candidate S250206dm Zhengyan Liu, Zelin Xu, Ji-an Jiang, Wen Zhao, Zhiping Jin, Zigao Dai, Dezheng Meng, Xuefeng Wu, Daming Wei, Runduo Liang, Lei He, Minxuan Cai, Lulu Fan, Weiyu Wu, Junhan Zhao, Ziqing Jia, Kexin Yu, Jinjun Geng, Di Xiao, Feng Li, Jinlong Tang, Yingxi Zuo, Xiaoling Zhang, Hao Liu, Jian Wang, Hongfei Zhang, Ming Liang, Hairen Wang, Dazhi Yao, Lei Hu, Xu Kong, Bin Li, Ning Jiang, Tinggui Wang, Zhen Wan, Yongquan Xue, Qingfeng Zhu, Xianzhong Zheng 20 pages, 10 figures, 6 tables, accepted by ApJL High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The gravitational wave (GW) event S250206dm, as the first well-localized neutron star merger candidate potentially located in the mass gap, presented a unique opportunity to probe the electromagnetic signatures from such a system. Here we report a deep, multiband search with the new 2.5-meter Wide Field Survey Telescope (WFST), covering about 64% of the localization region up to a 5-sigma limiting magnitude of 23 mag. In total, 12 potential candidates have been identified while none of them are likely related to S250206dm. This non-detection provides the most stringent constraint to date on any associated kilonova. Crucially, an AT 2017gfo-like event at 269 Mpc can be excluded by WFST observations alone. Based on ejecta mass limits, a neutron star-black hole with a large mass ratio (Q >= 3.2) is disfavored. This optical-derived constraint on the mass ratio reaches, for the first time, a precision comparable to that inferred from the GW signal. This work presents the best observation of this type of events until now, and demonstrates the power of rapid, deep follow-up observations to constrain the properties of compact binary progenitors, offering key insights into the constituents of the mass gap.",
      "pdf_url": "https://arxiv.org/pdf/2602.17267.pdf",
      "published": "2026-02-21T01:33:35.831042",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.18081",
      "title": "GWTC-4.0: Methods for Identifying and Characterizing Gravitational-wave Transients",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration: A. G. Abac",
        "I. Abouelfettouh",
        "F. Acernese",
        "K. Ackley",
        "S. Adhicary",
        "D. Adhikari",
        "N. Adhikari",
        "R. X. Adhikari",
        "V. K. Adkins",
        "S. Afroz",
        "D. Agarwal",
        "M. Agathos",
        "M. Aghaei Abchouyeh",
        "O. D. Aguiar",
        "S. Ahmadzadeh",
        "L. Aiello",
        "A. Ain",
        "P. Ajith",
        "S. Akcay",
        "T. Akutsu",
        "S. Albanesi",
        "R. A. Alfaidi",
        "A. Al-Jodah",
        "C. Alléné",
        "A. Allocca",
        "S. Al-Shammari",
        "P. A. Altin",
        "S. Alvarez-Lopez",
        "O. Amarasinghe",
        "A. Amato",
        "C. Amra",
        "A. Ananyeva",
        "S. B. Anderson",
        "W. G. Anderson",
        "M. Andia",
        "M. Ando",
        "T. Andrade",
        "M. Andrés-Carcasona",
        "T. Andrić",
        "J. Anglin",
        "S. Ansoldi",
        "J. M. Antelis",
        "S. Antier",
        "M. Aoumi",
        "E. Z. Appavuravther",
        "S. Appert",
        "S. K. Apple",
        "K. Arai",
        "A. Araya",
        "M. C. Araya",
        "M. Arca Sedda",
        "J. S. Areeda",
        "L. Argianas",
        "N. Aritomi",
        "F. Armato",
        "S. Armstrong",
        "N. Arnaud",
        "M. Arogeti",
        "S. M. Aronson",
        "G. Ashton",
        "Y. Aso",
        "M. Assiduo",
        "S. Assis de Souza Melo",
        "S. M. Aston",
        "P. Astone",
        "F. Attadio",
        "F. Aubin",
        "K. AultONeal",
        "G. Avallone",
        "S. Babak",
        "F. Badaracco",
        "C. Badger",
        "S. Bae",
        "S. Bagnasco",
        "E. Bagui",
        "L. Baiotti",
        "R. Bajpai",
        "T. Baka",
        "T. Baker",
        "M. Ball",
        "G. Ballardin",
        "S. W. Ballmer",
        "S. Banagiri",
        "B. Banerjee",
        "D. Bankar",
        "T. M. Baptiste",
        "P. Baral",
        "J. C. Barayoga",
        "B. C. Barish",
        "D. Barker",
        "N. Barman",
        "P. Barneo",
        "F. Barone",
        "B. Barr",
        "L. Barsotti",
        "M. Barsuglia",
        "D. Barta"
      ],
      "abstract": "GWTC-4.0: Methods for Identifying and Characterizing Gravitational-wave Transients The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration: A. G. Abac, I. Abouelfettouh, F. Acernese, K. Ackley, S. Adhicary, D. Adhikari, N. Adhikari, R. X. Adhikari, V. K. Adkins, S. Afroz, D. Agarwal, M. Agathos, M. Aghaei Abchouyeh, O. D. Aguiar, S. Ahmadzadeh, L. Aiello, A. Ain, P. Ajith, S. Akcay, T. Akutsu, S. Albanesi, R. A. Alfaidi, A. Al-Jodah, C. Alléné, A. Allocca, S. Al-Shammari, P. A. Altin, S. Alvarez-Lopez, O. Amarasinghe, A. Amato, C. Amra, A. Ananyeva, S. B. Anderson, W. G. Anderson, M. Andia, M. Ando, T. Andrade, M. Andrés-Carcasona, T. Andrić, J. Anglin, S. Ansoldi, J. M. Antelis, S. Antier, M. Aoumi, E. Z. Appavuravther, S. Appert, S. K. Apple, K. Arai, A. Araya, M. C. Araya, M. Arca Sedda, J. S. Areeda, L. Argianas, N. Aritomi, F. Armato, S. Armstrong, N. Arnaud, M. Arogeti, S. M. Aronson, G. Ashton, Y. Aso, M. Assiduo, S. Assis de Souza Melo, S. M. Aston, P. Astone, F. Attadio, F. Aubin, K. AultONeal, G. Avallone, S. Babak, F. Badaracco, C. Badger, S. Bae, S. Bagnasco, E. Bagui, L. Baiotti, R. Bajpai, T. Baka, T. Baker, M. Ball, G. Ballardin, S. W. Ballmer, S. Banagiri, B. Banerjee, D. Bankar, T. M. Baptiste, P. Baral, J. C. Barayoga, B. C. Barish, D. Barker, N. Barman, P. Barneo, F. Barone, B. Barr, L. Barsotti, M. Barsuglia, D. Barta As part of the Astrophysical Journal Letters Focus Issue on the Gravitational Wave Transient Catalog. Version accepted for publication General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) The Gravitational-Wave Transient Catalog (GWTC) is a collection of candidate gravitational-wave transient signals identified and characterized by the LIGO-Virgo-KAGRA Collaboration. Producing the contents of the GWTC from detector data requires complex analysis methods. These comprise techniques to model the signal; identify the transients in the data; evaluate the quality of the data and mitigate possible instrumental issues; infer the parameters of each transient; compare the data with the waveform models for compact binary coalescences; and handle the large amount of results associated with all these different analyses. In this paper, we describe the methods employed to produce the catalog's fourth release, GWTC-4.0, focusing on the analysis of the first part of the fourth observing run of Advanced LIGO, Advanced Virgo and KAGRA.",
      "pdf_url": "https://arxiv.org/pdf/2508.18081.pdf",
      "published": "2026-02-21T01:33:35.833202",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.20421",
      "title": "Self-regularized entropy: What does black hole entropy predict for tests of Kerr no-hair theorem?",
      "authors": [
        "Shokoufe Faraji",
        "Niayesh Afshordi"
      ],
      "abstract": "Self-regularized entropy: What does black hole entropy predict for tests of Kerr no-hair theorem? Shokoufe Faraji, Niayesh Afshordi General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We compute the canonical (brick-wall) entropy of Hawking radiation in a in a quantum black hole model whose strong-field exterior is modeled phenomenologically, to first order in a small quadrupole parameter, by the static q-metric, which is an exact vacuum solution of the Einstein equations. WKB counting of trapped near-horizon cavity modes shows that, within the perturbative small-deformation regime studied here, a modest quadrupolar deformation self-regularizes the ultraviolet divergence: the entropy becomes finite without an ad hoc cutoff. Adopting the Hawking temperature and the Bekenstein-Hawking entropy of a Schwarzschild black hole of the same mass as external thermodynamic inputs, matching this canonical entropy to that benchmark yields an entropy-motivated deformation scale which, when interpreted phenomenologically in a stationary extension, corresponds to percent-to-tens-of-percent violations of the Kerr multipole relations, and provides concrete observational targets for the Next Generation Event Horizon Telescope (ngEHT), the Laser Interferometer Space Antenna (LISA), and planned third-generation (3G) ground-based gravitational wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2508.20421.pdf",
      "published": "2026-02-21T01:33:35.833413",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.06536",
      "title": "Continued fraction method for high overtone quasinormal modes in effective potentials with discontinuity",
      "authors": [
        "Guan-Ru Li",
        "Jodin C. Morey",
        "Wei-Liang Qian",
        "Ramin G. Daghigh",
        "Michael D. Green",
        "Kai Lin",
        "Rui-Hong Yue"
      ],
      "abstract": "Continued fraction method for high overtone quasinormal modes in effective potentials with discontinuity Guan-Ru Li, Jodin C. Morey, Wei-Liang Qian, Ramin G. Daghigh, Michael D. Green, Kai Lin, Rui-Hong Yue 46 pages, 7 figures, and 10 tables General Relativity and Quantum Cosmology (gr-qc) In this study, we extend Leaver's continued fraction method to evaluate black hole quasinormal modes (QNMs) in systems where the effective potential exhibits a discontinuity. Besides the low-lying modes, we particularly focus on high overtones, which are physically pertinent due to the substantial deformation of the QNM spectrum triggered by spectral instability. In our algorithm, we expand the wavefunction at the point of discontinuity, instead of the black hole horizon, and incorporate the Israel-Lanczos-Sen junction conditions. %As the wavefunction convergence condition becomes irrelevant, our proposed algorithm generalizes the original method by expanding the wavefunctions at the point of discontinuity, and the associated difficulty is mitigated by rectifying the recurrence relations between the expansion coefficients to incorporate the Israel-Lanczos-Sen junction conditions. We apply this algorithm to compute the QNMs of the modified Regge-Wheeler potential up to $2000$ modes with high precision. For the low-lying modes, the numerical results show excellent agreement with those obtained using the matrix and Prony methods. The high overtones are significantly deformed, owing to the presence of echoes due to the discontinuity. This deformation in the asymptotic QNM spectrum reveals universal features that are largely independent of the specific form of the discontinuity in the potential, seemingly coinciding with those observed in the modified Pöschl-Teller effective potential. We speculate on whether the collective effect of the high overtones has an observational impact on gravitational wave signals.",
      "pdf_url": "https://arxiv.org/pdf/2602.06536.pdf",
      "published": "2026-02-21T01:33:35.834175",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.02653",
      "title": "A Bayesian Inference of Hybrid Stars with Large Quark Cores",
      "authors": [
        "Milena Albino",
        "Tuhin Malik",
        "Márcio Ferreira",
        "Constança Providência"
      ],
      "abstract": "A Bayesian Inference of Hybrid Stars with Large Quark Cores Milena Albino, Tuhin Malik, Márcio Ferreira, Constança Providência Nuclear Theory (nucl-th); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Neutron stars (NSs) are interesting objects capable of reaching densities unattainable on Earth. The properties of matter under these conditions remain a mystery. Exotic matter, including quark matter, may be present in the NS core. In this work, we explore the possible compositions of NS cores, in particular, the possible existence of large quark cores. We use the Relativistic Mean Field (RMF) model with nonlinear terms for the hadron phase and the Nambu-Jona-Lasinio (NJL) model and Mean Field Theory of Quantum Chromodynamics (MFTQCD) for the quark phase. Through Bayesian inference, we obtain different sets of equations: four sets with hybrid equations and one set with only the hadron phase. We impose constraints regarding the properties of nuclear matter, X-ray observational data from NICER, gravitational wave data from the binary neutron star merger GW170817, perturbative QCD (pQCD) calculations, and causality. The MFTQCD allows for a phase transition to quark matter at low densities, just above saturation density, while for the NJL sets, the phase transition occurs above twice the saturation density. As a result, the MFTQCD model predicts the presence of quark matter in the inner core of 1.4 M$_\\odot$ NSs, while NJL models suggest a low probability of quark matter in the interior of a 1.4 M$_\\odot$ NS. Both models predict the existence of quark matter in 2 M$_\\odot$ NSs. The slope of the mass-radius curve has been shown to carry information about the presence of quark matter. In particular, a positive slope at 1.8 M$_\\odot$ indicates the presence of non-nucleonic matter. A hybrid star with a stiff quark equation of state could explain a larger radius in more massive stars, such as two solar mass stars, compared to canonical NSs.",
      "pdf_url": "https://arxiv.org/pdf/2511.02653.pdf",
      "published": "2026-02-21T01:33:35.836018",
      "updated": null,
      "categories": [
        "nucl-th",
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "nucl-th",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.16822",
      "title": "Rescuing Overabundant Dark Matter with a Strongly First Order Phase Transition in the Dark Sector",
      "authors": [
        "Peisi Huang",
        "Anibal D. Medina",
        "Carlos E. M. Wagner"
      ],
      "abstract": "Rescuing Overabundant Dark Matter with a Strongly First Order Phase Transition in the Dark Sector Peisi Huang, Anibal D. Medina, Carlos E. M. Wagner High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We consider a dark sector consisting of fermionic dark matter (DM) charged under a broken dark $U(1)_D$ gauge symmetry, interacting with the Standard Model through kinetic mixing. In such models, the DM annihilation cross section is typically suppressed by the small kinetic mixing and or a heavy mediator, often leading to an overabundant relic density. We show that the observed DM abundance can be achieved if the dark Higgs undergoes a strong first order phase transition after DM freeze-out. In this scenario, the relic abundance is set by thermal freeze-out in the symmetric phase and subsequently reduced by entropy injection from the phase transition, rather than by annihilation in the broken phase. We find that to reproduce the observed relic abundance, the required phase transition is generically supercooled. The resulting stochastic gravitational wave signal lies within the sensitivity of future experiments, providing a complementary probe of this framework. Moreover, a strongly supercooled phase transition can potentially account for the NANOGrav signal for DM masses below $O(10)$ GeV.",
      "pdf_url": "https://arxiv.org/pdf/2602.16822.pdf",
      "published": "2026-02-21T01:33:35.938537",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.15292",
      "title": "Ultralight Dark Matter Constraints from NanoHertz Gravitational Waves",
      "authors": [
        "Shreyas Tiruvaskar",
        "Russell Boey",
        "Richard Easther",
        "Chris Gordon"
      ],
      "abstract": "Ultralight Dark Matter Constraints from NanoHertz Gravitational Waves Shreyas Tiruvaskar, Russell Boey, Richard Easther, Chris Gordon 14 pages; v2 typo in metadata fixed; v3 citations added and discussion of connection to other work improved; figures updated with new chains but no changes to conclusions; v4 minor edits and clarifications Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the impact of ultralight dark matter (ULDM) on the mergers of supermassive black holes (SMBH) and the resulting stochastic gravitational wave background. ULDM is based on exceptionally light particles and yields galactic halos with dense central solitons. This increases the drag experienced by binary SMBH, decreasing merger times and potentially suppressing gravitational radiation from the binary at low frequencies. We develop semi-analytic models for the decay of SMBH binaries in ULDM halos and use current pulsar timing array (PTA) measurements to constrain the ULDM particle mass and its fractional contribution to the dark matter content of the universe. We find a median ULDM particle mass of $7. \\times 10^{-22}$ eV and show that scaling relations suggest that the drag remains effective at relatively low ULDM fractions, which are consistent with all other constraints on the model. Consequently, future pulsar timing measurements will be a sensitive probe of any ULDM contribution to the overall dark matter content of the universe.",
      "pdf_url": "https://arxiv.org/pdf/2512.15292.pdf",
      "published": "2026-02-21T01:33:35.941096",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.11913",
      "title": "Gravitational Wave Signatures from Lepton Number Breaking Phase Transitions with Flat Potentials",
      "authors": [
        "Gabriela Barenboim",
        "Yeji Park",
        "Liliana Velasco-Sevilla"
      ],
      "abstract": "Gravitational Wave Signatures from Lepton Number Breaking Phase Transitions with Flat Potentials Gabriela Barenboim, Yeji Park, Liliana Velasco-Sevilla 40 pages, 12 figures (three figures added), appendices rewritten and added comments for clarity, together with some references. This version matches the JHEP version accepted for publication High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Extensions of the Standard Model typically contain ``flaton fields\" defined as fields with large vacuum expectation values and almost flat potentials where scalar self-coupling is small or vanishes at tree level. Such potentials have been used to drive a secondary inflationary epoch after a primary phase of inflation, in what are called thermal inflation models. Although the primordial, high-scale inflationary epoch can solve the horizon and flatness problems, it does not always resolve difficulties associated with late-time relics produced in extensions of the Standard Model. These relics typically decay too late, injecting entropy and energetic particles that spoil successful predictions like Big Bang Nucleosynthesis. It is here that thermal inflation plays a crucial role: diluting unwanted relics by many orders of magnitude without erasing the baryon asymmetry or the large-scale structure set up by the earlier phase of inflation. The preferred scale for this phenomenon is in the range $10^6-10^8$ GeV if one considers supergravity, but without it, any scale above the EW scale is valid. We investigate a typical form of these potentials and determine what are the conditions for the potentials to develop a barrier such that when the flatons settle to the true minimum, the associated Gravitational Waves can be observed, focusing on first-order phase transitions from spontaneous lepton number breaking.",
      "pdf_url": "https://arxiv.org/pdf/2510.11913.pdf",
      "published": "2026-02-21T01:33:35.941952",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.14266",
      "title": "Quarkyonic Neutron Stars as Candidates for the GW230529 Mass-Gap Object",
      "authors": [
        "Jeet Amrit Pattnaik",
        "S. K. Patra"
      ],
      "abstract": "Quarkyonic Neutron Stars as Candidates for the GW230529 Mass-Gap Object Jeet Amrit Pattnaik, S. K. Patra High Energy Astrophysical Phenomena (astro-ph.HE) We examine whether quarkyonic equations of state (EOS) can account for compact objects in the $2.5$-$4.5\\,M_\\odot$ mass range reported for the GW230529 gravitational-wave event. The pressure-energy density and mass-radius (M-R) relations obtained from quarkyonic EOS models indicate a significant stiffening at high densities, allowing stable configurations beyond $2.5\\,M_\\odot$. The predicted M-R sequences extend into the GW230529 mass window while maintaining radii in the range of $\\approx 13$-$15$~km, suggesting that quarkyonic stars can naturally populate the so-called compact object mass gap. These results imply that the heavier component of GW230529 could plausibly be a massive quarkyonic neutron star rather than a low-mass black hole.",
      "pdf_url": "https://arxiv.org/pdf/2511.14266.pdf",
      "published": "2026-02-21T01:33:36.228348",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.16559",
      "title": "GOTO identification and broadband modelling of the counterpart to the SVOM GRB 250818B",
      "authors": [
        "S. Belkin",
        "G. P. Lamb",
        "K. Ackley",
        "M. E. Wortley",
        "S. McGee",
        "G. Schroeder",
        "M. Shrestha",
        "B. P. Gompertz",
        "D. K. Galloway",
        "R. Starling",
        "W.-f. Fong",
        "T. Laskar",
        "C. Liu",
        "A. C. Gordon",
        "N. Pankov",
        "A. E. Volvach",
        "L. N. Volvach",
        "A. Shein",
        "A. Pozanenko",
        "M. J. Dyer",
        "J. Lyman",
        "K. Ulaczyk",
        "D. Steeghs",
        "V. S. Dhillon",
        "P. O'Brien",
        "G. Ramsay",
        "K. Noysena",
        "R. Kotak",
        "R. P. Breton",
        "L. K. Nuttall",
        "D. Pollacco",
        "S. Awiphan",
        "J. Casares",
        "P. Chote",
        "A. Chrimes",
        "R. Eyles-Ferris",
        "B. Godson",
        "P. Irawati",
        "D. Jarvis",
        "Y. Julakanti",
        "L. Kelsey",
        "M. R. Kennedy",
        "T. Killestein",
        "A. Kumar",
        "A. Levan",
        "S. Littlefair",
        "M. Magee",
        "S. Mandhai",
        "D. Mata S'anchez",
        "S. Mattila",
        "J. McCormac",
        "D. Mkrtichian",
        "S. Moran",
        "J. Mullaney",
        "D. O'Neill",
        "M. Patel",
        "K. Pu",
        "M. Pursiainen",
        "A. Sahu",
        "U. Sawangwit",
        "E. Stanway",
        "Y. Sun",
        "B. Warwick",
        "K. Wiersema"
      ],
      "abstract": "GOTO identification and broadband modelling of the counterpart to the SVOM GRB 250818B S. Belkin, G. P. Lamb, K. Ackley, M. E. Wortley, S. McGee, G. Schroeder, M. Shrestha, B. P. Gompertz, D. K. Galloway, R. Starling, W.-f. Fong, T. Laskar, C. Liu, A. C. Gordon, N. Pankov, A. E. Volvach, L. N. Volvach, A. Shein, A. Pozanenko, M. J. Dyer, J. Lyman, K. Ulaczyk, D. Steeghs, V. S. Dhillon, P. O'Brien, G. Ramsay, K. Noysena, R. Kotak, R. P. Breton, L. K. Nuttall, D. Pollacco, S. Awiphan, J. Casares, P. Chote, A. Chrimes, R. Eyles-Ferris, B. Godson, P. Irawati, D. Jarvis, Y. Julakanti, L. Kelsey, M. R. Kennedy, T. Killestein, A. Kumar, A. Levan, S. Littlefair, M. Magee, S. Mandhai, D. Mata S'anchez, S. Mattila, J. McCormac, D. Mkrtichian, S. Moran, J. Mullaney, D. O'Neill, M. Patel, K. Pu, M. Pursiainen, A. Sahu, U. Sawangwit, E. Stanway, Y. Sun, B. Warwick, K. Wiersema 24 pages, 20 figures (including Appendix), 9 tables. To be submitted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Rapid localisation and follow-up of gamma-ray bursts (GRBs) increasingly rely on low-latency triggers from new missions coupled to wide-field robotic optical facilities. We present the discovery and multi-wavelength follow-up of GRB 250818B, detected by the Space Variable Objects Monitor (SVOM) and localised optically by the Gravitational-wave Optical Transient Observer (GOTO). We compile and homogenise X-ray, optical/NIR, and radio data to build broadband light curves and spectral energy distributions. The afterglow is unusually luminous for a nominal short GRB, lying on the bright end of the short-GRB population in X-rays and optical and among the most luminous high-redshift short-GRB afterglows in the radio. MeerKAT detects the source at 3.1 GHz, while ALMA provides deep higher-frequency limits. Keck/LRIS spectroscopy shows continuum and metal absorption (Fe II, Mg II, Mg I), giving $z=1.216$. Synchrotron forward-shock modelling favours a constant-density medium and strongly prefers refreshed (energy-injection) emission, well described by a two-component jet with $E_{K,iso} \\sim 4\\times10^{52}$ erg, $n_0 \\sim 3.6$ cm$^{-3}$, $\\theta_j \\simeq 0.10$ rad ($\\sim 5.7$ deg), and $p \\simeq 1.64$. The host association is ambiguous: the nearest LS DR10 galaxy candidate ($r_{AB} \\sim 24.7$) is offset by $\\sim 4$ arcsec ($\\sim 34$ kpc) with chance-alignment probability $P_{cc} \\sim 0.2$, and current imaging does not exclude a fainter, near-coincident host. SED fitting of the candidate host suggests a low-mass galaxy. GRB 250818B highlights the power of rapid wide-field counterpart identification in the SVOM era, while host-association uncertainty can still limit offset-based interpretation.",
      "pdf_url": "https://arxiv.org/pdf/2602.16559.pdf",
      "published": "2026-02-21T01:33:36.229054",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}