{
  "date": "2026-01-23",
  "crawl_timestamp": "2026-01-23T01:32:19.996180",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 189,
    "total_gw_papers": 14,
    "by_category": {
      "gr-qc": {
        "total": 20,
        "gw_related": 5
      },
      "astro-ph": {
        "total": 144,
        "gw_related": 9
      }
    }
  },
  "crawl_verification": {
    "total_expected": 261,
    "total_actual": 261,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 45,
        "actual_crawled": 45,
        "page_source_info": "Total of 45 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 39,
        "actual_crawled": 39,
        "page_source_info": "Total of 39 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 49,
        "actual_crawled": 49,
        "page_source_info": "Total of 49 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 52,
        "actual_crawled": 52,
        "page_source_info": "Total of 52 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 27,
        "actual_crawled": 27,
        "page_source_info": "Total of 27 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 21,
        "actual_crawled": 21,
        "page_source_info": "Total of 21 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 28,
        "actual_crawled": 28,
        "page_source_info": "Total of 28 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.14578",
      "title": "Higher Harmonics of Double White Dwarfs in the Centihertz Band: Linking LISA and DECIGO",
      "authors": [
        "Naoki Seto"
      ],
      "abstract": "Higher Harmonics of Double White Dwarfs in the Centihertz Band: Linking LISA and DECIGO Naoki Seto General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the detectability of post-Newtonian higher harmonics from Galactic double white dwarfs in the centihertz band ($\\sim 0.01$ Hz). Using a synthetic population, we show that, unlike the quadrupole mode, higher harmonics remain undetectable with LISA except for rare nearby systems. In contrast, planned mid-band (decihertz) observatories such as DECIGO and BBO will be able to detect the third harmonic for about 10\\% of inspiral binaries above $\\sim 5$ mHz, enabling statistical constraints on mass ratios. These results highlight the successive roles of LISA and future decihertz missions in establishing a coherent strategy for space-based gravitational-wave astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2601.14578.pdf",
      "published": "2026-01-23T01:32:18.459821",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.14979",
      "title": "The relativistic restricted three-body problem: geometry and motion around tidally perturbed black holes",
      "authors": [
        "Takuya Katagiri",
        "Vitor Cardoso"
      ],
      "abstract": "The relativistic restricted three-body problem: geometry and motion around tidally perturbed black holes Takuya Katagiri, Vitor Cardoso General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the geometry of a tidally deformed, rotating black hole and timelike geodesics in its vicinity. Our framework provides a local picture of the structural evolution of a relativistic restricted three-body problem around a deformed black hole in an adiabatically evolving binary, motivated by various astrophysical settings including disk dynamics and extreme mass-ratio inspirals. As the tidal-field strength is increased, initially regular, bound geodesics undergo four stages: (i) weak chaos emerges within the bound motion; (ii) a subset of trajectories plunges into the black hole; (iii) a fraction of the remaining trajectories becomes unbound; and (iv) no bound trajectories persist. We provide semi-analytic estimates for the critical tidal amplitudes associated with each transition. Our estimates indicate that, within the frequency band of ground-based gravitational-wave detectors, the matter flow around black holes may already be depleted, whereas LISA and (B-)DECIGO could probe the earlier stages. Our results suggest that an object orbiting a tidally deformed massive BH may remain near resonances over a wide range of separations, indicating an accumulated, non-negligible impact on the gravitational-wave phase. Tidal perturbations can also introduce nonlinear couplings among epicyclic oscillations of geodesics, offering a potential avenue to resonant excitation of quasi-periodic oscillations in X-ray light curves from accreting black holes.",
      "pdf_url": "https://arxiv.org/pdf/2601.14979.pdf",
      "published": "2026-01-23T01:32:18.460449",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.15201",
      "title": "Effects of massive spin-2 fields on gravitational wave propagation",
      "authors": [
        "Jose A. R. Cembranos",
        "Álvaro Cendal",
        "Hector Villarrubia-Rojo"
      ],
      "abstract": "Effects of massive spin-2 fields on gravitational wave propagation Jose A. R. Cembranos, Álvaro Cendal, Hector Villarrubia-Rojo General Relativity and Quantum Cosmology (gr-qc) Massive spin-2 fields in addition to the standard massless graviton arise naturally in extensions of General Relativity, such as massive bigravity or models with extra dimensions. This work explores the observational signatures of these fields on the propagation of gravitational waves. Adopting a phenomenological framework consistent with such theories, we derive an analytical transfer function in the ultrarelativistic limit and establish detectability bounds. Finally, we provide forecasts for the accessible parameter space using current and future gravitational wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2601.15201.pdf",
      "published": "2026-01-23T01:32:18.460603",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.14326",
      "title": "Sample-efficient non-Gaussian noise reduction in gravitational wave data via learnable wavelets",
      "authors": [
        "Arush Pimpalkar",
        "Digvijay Wadekar",
        "Mark Ho-Yeuk Cheung",
        "Emanuele Berti"
      ],
      "abstract": "Sample-efficient non-Gaussian noise reduction in gravitational wave data via learnable wavelets Arush Pimpalkar, Digvijay Wadekar, Mark Ho-Yeuk Cheung, Emanuele Berti Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) We introduce $\\texttt{WaveletNet}$, a wavelet-based neural network architecture to identify and reduce non-Gaussian noise in gravitational wave data. Traditionally, convolutional neural networks (CNNs) have been widely used as a flexible machine learning method to mitigate non-Gaussian noise. However, training CNNs requires many data samples, especially when the input data segments are long. Glitches that mimic high-mass black hole signals are empirically known to have a wavelet-like structure. We exploit this property in $\\texttt{WaveletNet}$ by using simple neural networks to learn the best family of wavelets to model glitches in the LIGO-Virgo-KAGRA O3 data. Due to its simplicity, our framework is significantly more sample-efficient than CNNs. As a use case, we build upon the $\\texttt{TIER}$ method and show how $\\texttt{WaveletNet}$ can improve the performance of any search pipeline. We take potential GW candidates from the pipeline, and then downweight the candidates having noisy strain regions in their vicinity. We use our framework in a modular way: we provide an output score which can be added to the pipeline's existing detection statistic score for the candidates. We test our method using candidates from the $\\texttt{IAS-HM}$ search pipeline and show that it improves the search sensitive volume by up to 15% for high-mass, asymmetric binaries.",
      "pdf_url": "https://arxiv.org/pdf/2601.14326.pdf",
      "published": "2026-01-23T01:32:18.461491",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.14863",
      "title": "The First Upper Bound on the Nano-Hertz Gravitational Waves and Galaxy Cross-Correlation signal using 15-year NANOGrav Data and DESI Galaxy Survey",
      "authors": [
        "Mohit Raj Sah",
        "Suvodip Mukherjee"
      ],
      "abstract": "The First Upper Bound on the Nano-Hertz Gravitational Waves and Galaxy Cross-Correlation signal using 15-year NANOGrav Data and DESI Galaxy Survey Mohit Raj Sah, Suvodip Mukherjee Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) The recent detection of a common-spectrum stochastic signal by multiple pulsar timing array (PTA) collaborations has provided tentative evidence for a nanohertz (nHz) stochastic gravitational-wave background (SGWB). This signal can be widely interpreted as originating from a cosmic population of inspiraling supermassive black hole binaries (SMBHBs). Current PTA analyses primarily constrain the SGWB power spectrum and its auto-angular power spectrum. However, the supermassive black holes will produce an underlying correlation with the large-scale structure of the Universe, which can help in understanding the formation and evolution of the binaries. In this work, we develop a new analysis pipeline PyGxGW-PTA for studying the cross-correlation of nHz GW signal with galaxy surveys ($C^{\\rm g\\, GW}_\\ell$) and obtain the first constraint on the SGWB and galaxy distribution cross-correlation using the NANOGrav 15-year dataset in combination with the DESI galaxy catalog. We find no statistically significant correlation between the SGWB and the large-scale distribution of DESI galaxies and using an optimal estimator we put an upper bound on $C^{\\rm g\\, GW}_{\\ell=8} < 0.0083$ at $95\\%$ C.I. This yields the first observational upper limit on the spatial correlation between the nHz SGWB and the large-scale structure of the Universe, establishing the observational groundwork for future multi-tracer analyses that will combine PTA data with next-generation galaxy surveys to unveil the SMBHB-galaxy correlation.",
      "pdf_url": "https://arxiv.org/pdf/2601.14863.pdf",
      "published": "2026-01-23T01:32:18.462810",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.15198",
      "title": "Revealing massive black hole astrophysics: The potential of hierarchical inference with extreme mass-ratio inspiral observations",
      "authors": [
        "Shashwat Singh",
        "Christian E. A. Chapman-Bird",
        "Christopher P. L. Berry",
        "John Veitch"
      ],
      "abstract": "Revealing massive black hole astrophysics: The potential of hierarchical inference with extreme mass-ratio inspiral observations Shashwat Singh, Christian E. A. Chapman-Bird, Christopher P. L. Berry, John Veitch High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Gravitational waves from extreme mass-ratio inspirals (EMRIs) will enable sub-percent measurements of massive black hole parameters and provide access to the demographics of compact objects in galactic nuclei. During the LISA mission, multiple EMRIs are expected to be detected, allowing statistical studies of massive black hole populations and their formation pathways. We perform hierarchical Bayesian inference on simulated EMRI catalogues to assess how well LISA could constrain the astrophysical population using parametrised population models. We test our inference framework on a variety of populations, including heterogeneous and homogeneous mixtures of parametrised subpopulations, and scenarios in which the assumed model is deliberately misspecified. Our results show that population parameters governing distributions with sharp features can be tightly constrained. Mixed populations can be disentangled with as few as $\\sim20$ detections, and even with model misspecification, the inference retains sensitivity to key population features. These results demonstrate the capabilities and limitations of EMRI population inference, providing guidance for constructing realistic astrophysical population models for LISA analysis.",
      "pdf_url": "https://arxiv.org/pdf/2601.15198.pdf",
      "published": "2026-01-23T01:32:18.463202",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.10912",
      "title": "Transformer Networks for Continuous Gravitational-wave Searches",
      "authors": [
        "Prasanna. M. Joshi",
        "Reinhard Prix"
      ],
      "abstract": "Transformer Networks for Continuous Gravitational-wave Searches Prasanna. M. Joshi, Reinhard Prix General Relativity and Quantum Cosmology (gr-qc) Wide-parameter-space searches for continuous gravitational waves using semi-coherent matched-filter methods require enormous computing power, which limits their achievable sensitivity. Here we explore an alternative search method based on training neural networks as classifiers on detector strain data with minimal pre-processing. Contrary to previous studies using convolutional neural networks (CNNs), we investigate the suitability of the transformer architecture, specifically the Vision Transformer (ViT). We establish sensitivity benchmarks using the matched-filter $\\mathcal{F}$-statistic for ten targeted searches over a ten day timespan, and ten directed and six all-sky searches over a one day timespan. We train ViTs on each of these benchmark cases. The trained ViTs achieve essentially matched-filter sensitivity on the targeted benchmarks, and approach the $\\mathcal{F}$-statistic detection probability of $p_{\\mathrm{det}}$ = 90% on the directed ($p_{\\mathrm{det}} \\approx $ 85-89 %) and all-sky benchmarks ($p_{\\mathrm{det}} \\approx $ 78-88 %). Unlike the CNNs in our previous studies, which required extensive manual design and hyperparameter tuning, the ViT achieves better performance with a standard architecture and minimal tuning.",
      "pdf_url": "https://arxiv.org/pdf/2509.10912.pdf",
      "published": "2026-01-23T01:32:18.464479",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.17990",
      "title": "Constraints on gravitational waves from the 2024 Vela pulsar glitch",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration: A. G. Abac",
        "I. Abouelfettouh",
        "F. Acernese",
        "K. Ackley",
        "C. Adamcewicz",
        "S. Adhicary",
        "D. Adhikari",
        "N. Adhikari",
        "R. X. Adhikari",
        "V. K. Adkins",
        "S. Afroz",
        "A. Agapito",
        "D. Agarwal",
        "M. Agathos",
        "N. Aggarwal",
        "S. Aggarwal",
        "O. D. Aguiar",
        "I.-L. Ahrend",
        "L. Aiello",
        "A. Ain",
        "P. Ajith",
        "T. Akutsu",
        "S. Albanesi",
        "W. Ali",
        "S. Al-Kershi",
        "C. Alléné",
        "A. Allocca",
        "S. Al-Shammari",
        "P. A. Altin",
        "S. Alvarez-Lopez",
        "O. Amarasinghe",
        "A. Amato",
        "F. Amicucci",
        "C. Amra",
        "A. Ananyeva",
        "S. B. Anderson",
        "W. G. Anderson",
        "M. Andia",
        "M. Ando",
        "M. Andrés-Carcasona",
        "T. Andrić",
        "J. Anglin",
        "S. Ansoldi",
        "J. M. Antelis",
        "S. Antier",
        "M. Aoumi",
        "E. Z. Appavuravther",
        "S. Appert",
        "S. K. Apple",
        "K. Arai",
        "A. Araya",
        "M. C. Araya",
        "M. Arca Sedda",
        "J. S. Areeda",
        "N. Aritomi",
        "F. Armato",
        "S. Armstrong",
        "N. Arnaud",
        "M. Arogeti",
        "S. M. Aronson",
        "G. Ashton",
        "Y. Aso",
        "L. Asprea",
        "M. Assiduo",
        "S. Assis de Souza Melo",
        "S. M. Aston",
        "P. Astone",
        "F. Attadio",
        "F. Aubin",
        "K. AultONeal",
        "G. Avallone",
        "E. A. Avila",
        "S. Babak",
        "C. Badger",
        "S. Bae",
        "S. Bagnasco",
        "L. Baiotti",
        "R. Bajpai",
        "T. Baka",
        "A. M. Baker",
        "K. A. Baker",
        "T. Baker",
        "G. Baldi",
        "N. Baldicchi",
        "M. Ball",
        "G. Ballardin",
        "S. W. Ballmer",
        "S. Banagiri",
        "B. Banerjee",
        "D. Bankar",
        "T. M. Baptiste",
        "P. Baral",
        "M. Baratti",
        "J. C. Barayoga",
        "B. C. Barish",
        "D. Barker",
        "N. Barman"
      ],
      "abstract": "Constraints on gravitational waves from the 2024 Vela pulsar glitch The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration: A. G. Abac, I. Abouelfettouh, F. Acernese, K. Ackley, C. Adamcewicz, S. Adhicary, D. Adhikari, N. Adhikari, R. X. Adhikari, V. K. Adkins, S. Afroz, A. Agapito, D. Agarwal, M. Agathos, N. Aggarwal, S. Aggarwal, O. D. Aguiar, I.-L. Ahrend, L. Aiello, A. Ain, P. Ajith, T. Akutsu, S. Albanesi, W. Ali, S. Al-Kershi, C. Alléné, A. Allocca, S. Al-Shammari, P. A. Altin, S. Alvarez-Lopez, O. Amarasinghe, A. Amato, F. Amicucci, C. Amra, A. Ananyeva, S. B. Anderson, W. G. Anderson, M. Andia, M. Ando, M. Andrés-Carcasona, T. Andrić, J. Anglin, S. Ansoldi, J. M. Antelis, S. Antier, M. Aoumi, E. Z. Appavuravther, S. Appert, S. K. Apple, K. Arai, A. Araya, M. C. Araya, M. Arca Sedda, J. S. Areeda, N. Aritomi, F. Armato, S. Armstrong, N. Arnaud, M. Arogeti, S. M. Aronson, G. Ashton, Y. Aso, L. Asprea, M. Assiduo, S. Assis de Souza Melo, S. M. Aston, P. Astone, F. Attadio, F. Aubin, K. AultONeal, G. Avallone, E. A. Avila, S. Babak, C. Badger, S. Bae, S. Bagnasco, L. Baiotti, R. Bajpai, T. Baka, A. M. Baker, K. A. Baker, T. Baker, G. Baldi, N. Baldicchi, M. Ball, G. Ballardin, S. W. Ballmer, S. Banagiri, B. Banerjee, D. Bankar, T. M. Baptiste, P. Baral, M. Baratti, J. C. Barayoga, B. C. Barish, D. Barker, N. Barman main paper: 16 pages and 7 figures; total with appendices: 40 pages and 14 figures. Submitted to ApJ. Data release at this https URL General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Among known neutron stars, the Vela pulsar is one of the best targets for gravitational-wave searches. It is also one of the most prolific in terms of glitches, sudden frequency changes in a pulsar's rotation. Such glitches could cause a variety of transient gravitational-wave signals. Here we search for signals associated with a Vela glitch on 29 April 2024 in data of the two LIGO detectors from the fourth LIGO--Virgo--KAGRA observing run. We search both for seconds-scale burst-like emission, primarily from fundamental (f-)mode oscillations, and for longer quasi-monochromatic transients up to four months in duration, primarily from quasi-static quadrupolar deformations. We find no significant detection candidates, but for the first time we set direct observational upper limits on gravitational strain amplitude that are stricter than what can be indirectly inferred from the overall glitch energy scale. We discuss the short- and long-duration observational constraints in the context of specific emission models. These results demonstrate the potential of gravitational-wave probes of glitching pulsars as detector sensitivity continues to improve.",
      "pdf_url": "https://arxiv.org/pdf/2512.17990.pdf",
      "published": "2026-01-23T01:32:18.466004",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.02458",
      "title": "Cosmic Collider Gravitational Waves sourced by Right-handed Neutrino production from Bubbles: Testing Seesaw, Leptogenesis and Dark Matter",
      "authors": [
        "Anish Ghoshal",
        "Pratyay Pal"
      ],
      "abstract": "Cosmic Collider Gravitational Waves sourced by Right-handed Neutrino production from Bubbles: Testing Seesaw, Leptogenesis and Dark Matter Anish Ghoshal, Pratyay Pal 55 pages, 15 figures + appendix + references Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We study a minimal type-I seesaw framework in which a first-order phase transition (FOPT), driven by a singlet scalar, produces right-handed neutrinos (RHNs) through bubble collisions, realizing a cosmic-scale collider that probes ultra-high energy scales. The resulting RHN distribution sources novel low-frequency gravitational-waves (GWs) in addition to the standard bubble-collision contribution. A stable lightest RHN can account for the observed dark matter (DM) relic abundance for masses as low as $M_{1} \\equiv m_{\\rm DM} \\gtrsim 10^{6}\\,\\mathrm{GeV}$, with the associated novel GW signal accessible in LISA, ET and upcoming LVK detectors. If the RHNs are unstable, their CP-violating decays generate the observed baryon asymmetry via leptogenesis for $M_{1} \\gtrsim 10^{11}\\,\\mathrm{GeV}$ and phase transition temperatures $T_* \\gtrsim 10^{6}\\,\\mathrm{GeV}$, for which the novel GW spectrum is detectable in ET, BBO and upcoming LVK. If RHN decays also populate a dark-sector fermion with mass $m_{\\chi} \\in [10^{-4},10^{4}],\\mathrm{GeV}$, successful co-genesis of baryons and asymmetric dark matter occurs for $T_* \\gtrsim 10^{7}\\,\\mathrm{GeV}$ and $M_{1} \\gtrsim 10^{9}\\,\\mathrm{GeV}$, naturally explaining $\\Omega_{\\rm DM} \\simeq 5\\Omega_{\\rm B}$. The corresponding GW signals are testable with LISA, ET, and BBO. Finally, we analyze a UV-complete multi-Majoron model, based on a global $U(1)_N \\times U(1)_{\\rm B-L}$ extension, motivated from the hierarchy of lepton masses, which we dub as Mojaron collider. The corresponding FOPT in this model leaves a distinctive GW signature arising from RHN production during $U(1)_N$ symmetry breaking detectable by BBO, ET and upcoming LVK. Successful leptogenesis is realized for heaviest RHN mass $M_3 \\sim 10^{10}\\,\\mathrm{GeV}$ and a $U(1)_N$ breaking vev $v_2 \\sim \\mathcal{O}(\\mathrm{TeV})$, which sets the seesaw scale.",
      "pdf_url": "https://arxiv.org/pdf/2601.02458.pdf",
      "published": "2026-01-23T01:32:18.467782",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.14377",
      "title": "Cosmo-FOLD: Fast generation and upscaling of field-level cosmological maps with overlap latent diffusion",
      "authors": [
        "Satvik Mishra",
        "Roberto Trotta",
        "Matteo Viel"
      ],
      "abstract": "Cosmo-FOLD: Fast generation and upscaling of field-level cosmological maps with overlap latent diffusion Satvik Mishra, Roberto Trotta, Matteo Viel Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) We demonstrate the capabilities of probabilistic diffusion models to reduce dramatically the computational cost of expensive hydrodynamical simulations to study the relationship between observable baryonic cosmological probes and dark matter at field level and well into the non-linear regime. We introduce a novel technique, Cosmo-FOLD (Cosmological Fields via Overlap Latent Diffusion) to rapidly generate accurate and arbitrarily large cosmological and astrophysical 3-dimensional fields, conditioned on a given input field. We are able to generate TNG300-2 dark matter density and gas temperature fields from a model trained only on ~1% of the volume (a process we refer to as `upscaling'), reproducing both large scale coherent dark matter filaments and power spectra to within 10% for wavenumbers k <= 5 h Mpc^-1. These results are obtained within a small fraction of the original simulation cost and produced on a single GPU. Beyond one and two points statistics, the bispectrum is also faithfully reproduced through the inclusion of positional encodings. Finally, we demonstrate Cosmo-FOLD's generalisation capabilities by upscaling a CAMELS volume of 25 (Mpc h^-1)^3 to a full TNG300-2 volume of 205 (Mpc h^-1)^3$ with no fine-tuning. Cosmo-FOLD opens the door to full field-level simulation-based inference on cosmological scale.",
      "pdf_url": "https://arxiv.org/pdf/2601.14377.pdf",
      "published": "2026-01-23T01:32:18.834184",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.14395",
      "title": "Growth of Light Seed Black Holes in the Early Universe",
      "authors": [
        "Daxal H. Mehta",
        "John A. Regan",
        "Lewis Prole"
      ],
      "abstract": "Growth of Light Seed Black Holes in the Early Universe Daxal H. Mehta, John A. Regan, Lewis Prole 16 pages, 4 figures, 8 extended data figures. Published in Nature Astronomy Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Observations from the James Webb Space Telescope (JWST) have uncovered supermassive black holes (SMBHs) with masses exceeding $10^6 \\mathrm{M}_{\\odot}$ at redshifts $z > 8$, posing significant challenges to existing models of early black hole formation and growth. Here we show, in a fully cosmological setting, that light seed black holes (LSBHs), remnants of Population III stars, can grow rapidly to $\\sim10^4 \\mathrm{M}_{\\odot}$ in the early Universe. This growth is enabled by our novel black hole seeding prescription and the unprecedented resolution of our zoom-in cosmological simulations, which resolve the dense environments necessary for efficient accretion. Our results provide robust evidence that LSBHs can attain the masses required to serve as the dominant progenitors of the SMBH population observed at later cosmic epochs. These findings have far-reaching implications for the interpretation of JWST observations and future gravitational wave detections with LISA.",
      "pdf_url": "https://arxiv.org/pdf/2601.14395.pdf",
      "published": "2026-01-23T01:32:18.842462",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.GA",
        "cross_list_from": "astro-ph.GA"
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.14408",
      "title": "Erythrohenosis -- The crimson chronicles of two giants",
      "authors": [
        "Pau Amaro Seoane"
      ],
      "abstract": "Erythrohenosis -- The crimson chronicles of two giants Pau Amaro Seoane High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We investigate erythrohenosis -- the collision and merger of two red giants -- establishing an end-to-end model for this fundamental evolutionary channel in dense stellar environments. Combining three-dimensional SPH simulations of a binary with analytical modeling, we characterize the event from initial encounter to terminal explosion. We demonstrate that grazing encounters induce tidal capture and rapid orbital decay, accompanied by large-amplitude, nonlinear stellar oscillations. The subsequent inspiral spins up the common envelope into a stable, non-spherical equilibrium, powering a luminous precursor with quasi-periodic bursts. The terminal explosion, modeled with angular momentum conservation, produces an intrinsically flattened remnant that preserves a geometric memory, or morphomnesia, of its binary origin. The associated gravitational wave signal features a rapid, drag-dominated frequency evolution, identifiable by a unique time-varying apparent chirp mass. These results define a distinctive multi-stage observational fingerprint -- linking transient optical precursors, asymmetric nebulae, and anomalous gravitational wave chirps -- to guide identification in current and future multi-messenger surveys.",
      "pdf_url": "https://arxiv.org/pdf/2601.14408.pdf",
      "published": "2026-01-23T01:32:19.074669",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.14918",
      "title": "Towards gravitational wave parameter inference for binaries with an eccentric companion",
      "authors": [
        "Kai Hendriks",
        "Lorenz Zwick",
        "Pankaj Saini",
        "János Takátsy",
        "Johan Samsing"
      ],
      "abstract": "Towards gravitational wave parameter inference for binaries with an eccentric companion Kai Hendriks, Lorenz Zwick, Pankaj Saini, János Takátsy, Johan Samsing High Energy Astrophysical Phenomena (astro-ph.HE) We introduce a complete model for dephasing due to line-of-sight acceleration (LOSA) in gravitational wave (GW) signals from stellar-mass binary black holes (BBHs) in three-body systems. Our prescription provides curvature- and projection-dependent phase features that are not recovered by local-expansion-based treatments. We perform parameter-space surveys and mock parameter inferences assuming the nominal sensitivity of the Einstein Telescope (ET) to identify the regime where the time-varying LOSA allows for separate constraints on the outer orbital parameters, in particular the tertiary mass and distance. We estimate that ET may detect a few to tens of such systems per year, provided that all binaries merge dynamically, and demonstrate that these constraints can be used to directly discriminate between a dynamical and AGN origin for BBHs. Finally, we reanalyse the GW190814 event and four O4a events finding no evidence for LOSA, with the previously claimed LOSA in GW190814 disappearing when a sufficiently long data segment is used.",
      "pdf_url": "https://arxiv.org/pdf/2601.14918.pdf",
      "published": "2026-01-23T01:32:19.078042",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.14531",
      "title": "Control algorithms for dual-wavefront sensor single-conjugate adaptive optics",
      "authors": [
        "Aditya R. Sengupta",
        "Lisa A. Poyneer",
        "Benjamin L. Gerard",
        "Rebecca Jensen-Clem",
        "Aaron J. Lemmer"
      ],
      "abstract": "Control algorithms for dual-wavefront sensor single-conjugate adaptive optics Aditya R. Sengupta, Lisa A. Poyneer, Benjamin L. Gerard, Rebecca Jensen-Clem, Aaron J. Lemmer Instrumentation and Methods for Astrophysics (astro-ph.IM) High-contrast imaging systems using active control with adaptive optics (AO) are often limited by non-common path (NCP) aberrations that are seen only at the final science image. AO systems employing focal-plane wavefront sensors (FP-WFSs) are able to simultaneously correct NCP aberrations and measure science images, but they typically require a second stage of control that adds system cost and complexity. We present control algorithms to augment AO systems with FP-WFSs within their existing control setup. We demonstrate inter-arm NCP aberration transfer can be mitigated through temporal filtering, present frequency- and time-domain validation of controller stability and performance, and discuss the optimality of the chosen controllers. This work will enable the development, testing, and installation of FP-WFS technologies for direct imaging of exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2601.14531.pdf",
      "published": "2026-01-23T01:32:19.832499",
      "updated": null,
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    }
  ]
}