{
  "date": "2026-02-06",
  "crawl_timestamp": "2026-02-06T01:33:52.007567",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 138,
    "total_gw_papers": 23,
    "by_category": {
      "gr-qc": {
        "total": 30,
        "gw_related": 10
      },
      "astro-ph": {
        "total": 95,
        "gw_related": 13
      }
    }
  },
  "crawl_verification": {
    "total_expected": 207,
    "total_actual": 207,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 45,
        "actual_crawled": 45,
        "page_source_info": "Total of 45 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 38,
        "actual_crawled": 38,
        "page_source_info": "Total of 38 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 27,
        "actual_crawled": 27,
        "page_source_info": "Total of 27 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 46,
        "actual_crawled": 46,
        "page_source_info": "Total of 46 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 20,
        "actual_crawled": 20,
        "page_source_info": "Total of 20 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 12,
        "actual_crawled": 12,
        "page_source_info": "Total of 12 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.04642",
      "title": "Impact of Higher-Order Modes on Eccentricity Measurement in Binary Black Hole Gravitational Waves",
      "authors": [
        "Honglue Tang",
        "Jinzhao Yang",
        "Baoxiang Wang",
        "Tao Yang"
      ],
      "abstract": "Impact of Higher-Order Modes on Eccentricity Measurement in Binary Black Hole Gravitational Waves Honglue Tang, Jinzhao Yang, Baoxiang Wang, Tao Yang General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We investigate the systematic biases in measuring orbital eccentricity for binary black hole (BBH) mergers that arise when higher-order modes (HOMs) of gravitational waves are neglected in waveform modeling. Using Bayesian inference with the state-of-the-art eccentric, spin-aligned, higher-mode effective-one-body model SEOBNRv5EHM, we reanalyze six previously suggested eccentric gravitational-wave events--GW190521, GW190620, GW190701, GW191109, GW200129, and GW200208\\_222617. Comparing results with its dominant-mode-only counterpart SEOBNRv5E, we find no statistically significant HOM-induced bias in eccentricity for any of these events, including GW190521, whose eccentricity has been debated in the literature. To identify parameter regimes vulnerable to HOM omission, we perform a broad zero-noise injection campaign varying detector-frame total mass, mass ratio, eccentricity, inclination, and network SNR. We find that significant systematic biases ($\\Delta_e/\\sigma > 1$) arise predominantly in systems with high total mass ($M^{\\rm det}\\gtrsim120M_\\odot$), highly asymmetric mass ratios ($q \\gtrsim 4$), near edge-on orientations ($\\theta_\\textrm{JN} \\gtrsim 30^\\circ$), and high SNRs ($\\rho^N_\\textrm{mf}\\approx50$). Notably, for quasi-circular BBHs with $M^{\\rm det}\\gtrsim140M_\\odot$, neglecting HOMs may lead to strong false-positive evidence for nonzero eccentricity. By contrast, for lower-mass systems ($M^{\\rm det}\\sim100 M_\\odot$), HOM exclusion produces negligible eccentricity biases. Our results demonstrate that although current eccentric candidates are not impacted by HOM omission, future eccentricity measurements--particularly for massive, asymmetric, or edge-on systems--require HOM-inclusive waveforms to avoid substantial systematic errors.",
      "pdf_url": "https://arxiv.org/pdf/2602.04642.pdf",
      "published": "2026-02-06T01:33:51.257181",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.04055",
      "title": "A simple mechanism for the enhancement of the inflationary power spectrum",
      "authors": [
        "I. Dalianis",
        "A. Katsis",
        "N. Tetradis"
      ],
      "abstract": "A simple mechanism for the enhancement of the inflationary power spectrum I. Dalianis, A. Katsis, N. Tetradis Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The background evolution in two-field inflation can feature two distinct stages, corresponding to the evolution along two successive field directions. When the second stage occurs at a significantly lower energy scale, the inflationary trajectory includes a sharp transition, accompanied by a series of rapid turns in field space. Fluctuations crossing the Hubble horizon during this turning phase can experience amplification by several orders of magnitude. This mechanism is very intuitive and can be implemented even in simple two-field models. It produces a peak in the scalar power spectrum that can lead to significant abundances of primordial black holes and secondary gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2602.04055.pdf",
      "published": "2026-02-06T01:33:51.257933",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2502.18436",
      "title": "Reconstructing early universe evolution with gravitational waves from supercooled phase transitions",
      "authors": [
        "Adam Gonstal",
        "Marek Lewicki",
        "Bogumila Swiezewska"
      ],
      "abstract": "Reconstructing early universe evolution with gravitational waves from supercooled phase transitions Adam Gonstal, Marek Lewicki, Bogumila Swiezewska 14 pages + references, 5 figures, the data used to prepare the plots is available at this https URL (last accessed 11 March 2025); v3: extended acknowledgements, minor changes to match published version General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We study gravitational waves from supercooled cosmological first-order phase transitions. If such a transition is followed by inefficient reheating, the evolution history of the universe is modified by a period of early matter domination. This leaves an imprint on the predicted gravitational-wave spectra. Using Fisher analysis we show the parameter space in reach of upcoming gravitational wave observatories where reheating can be probed due to its impact on the stochastic background produced by the transition. We use both the simplified geometric parametrisation and the thermodynamical one explicitly including the decay rate of the field undergoing the transition as a parameter determining the spectrum. We show the expansion history following the transition can be probed provided the transition is very strong which is naturally realised in classically scale invariant models generically predicting supercooling. Moreover, in such a scenario the decay rate of the scalar undergoing the phase transition, a parameter most likely inaccessible to accelerators, can be determined through the spectrum analysis.",
      "pdf_url": "https://arxiv.org/pdf/2502.18436.pdf",
      "published": "2026-02-06T01:33:51.259141",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.09459",
      "title": "QuGrav: Bringing gravitational waves to light with Qumodes",
      "authors": [
        "Dmitri E. Kharzeev",
        "Azadeh Maleknejad",
        "Saba Shalamberidze"
      ],
      "abstract": "QuGrav: Bringing gravitational waves to light with Qumodes Dmitri E. Kharzeev, Azadeh Maleknejad, Saba Shalamberidze 6 pages, 2 figs, Final version to appear in Physical Review Research (v2) General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph); Quantum Physics (quant-ph) We propose using qumodes, quantum bosonic modes, for detecting high-frequency gravitational waves via the inverse Gertsenshtein effect, where a gravitational wave resonantly converts into a single photon in a magnetized cavity. For an occupation number $n$ of the photon field in a qumode, the conversion probability is enhanced by a factor of $n+1$ due to Bose-Einstein statistics. Unlocking this increased sensitivity entails the ability to continuously prepare the qumode and perform non-demolition measurement on the qumode-qubit system within the qumode coherence time. Our results indicate that, at microwave frequencies and with existing technology, the proposed setup can attain sensitivities within 1.7 orders of magnitude of the cosmological bound. With anticipated near-future improvements, it has the potential to surpass this limit and pave the way for the first exploration of high-frequency cosmological gravitational wave backgrounds. At optical frequencies, it can enhance the sensitivity of current detectors by one order of magnitude. That further enhances their potential in reaching the single-graviton level.",
      "pdf_url": "https://arxiv.org/pdf/2506.09459.pdf",
      "published": "2026-02-06T01:33:51.259798",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM",
        "hep-ex",
        "hep-ph",
        "quant-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.12392",
      "title": "Reheating and relic gravitational waves as remedies for degeneracies of non-canonical natural inflation",
      "authors": [
        "Karam Bahari",
        "Soma Heydari",
        "Kayoomars Karami"
      ],
      "abstract": "Reheating and relic gravitational waves as remedies for degeneracies of non-canonical natural inflation Karam Bahari, Soma Heydari, Kayoomars Karami General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Here, a natural non-canonical inflationary model based on a power-law Lagrangian is investigated. We analyze the scalar spectral index $n_{\\rm s}$ and the tensor-to-scalar ratio $r$ of the model and identify their degeneracies with respect to the free parameters. Notably, $n_{\\rm s}$ and $r$ show effective independence from the model parameters due to degeneracies in the slow-roll parameters that leads to unresolved parameter degeneracies. Employing the constraints on reheating parameters such as the reheating duration $N_{\\rm{reh}}$, the reheating temperature $T_{\\rm{reh}}$, and the equation of state parameter $\\omega_{\\rm{reh}}$, is found to be insufficient to fully break these degeneracies. However, the relic gravitational wave spectrum provides a way to break degeneracy with respect to the non-canonical parameter $\\alpha$, degeneracy with respect to the potential parameter $f$ persist. Finally, we specify the allowed ranges for the inflationary duration $N$ and the parameter $\\alpha$, in light of the latest observational data. These results highlight the role of relic gravitational waves in refining inflationary models and illustrate the challenges in fully resolving parameter degeneracies.",
      "pdf_url": "https://arxiv.org/pdf/2506.12392.pdf",
      "published": "2026-02-06T01:33:51.260007",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.18738",
      "title": "Common Envelope Evolution of Ultralight Boson Clouds",
      "authors": [
        "Ao Guo",
        "Qi-Yan Zhang",
        "Huan Yang",
        "Jun Zhang"
      ],
      "abstract": "Common Envelope Evolution of Ultralight Boson Clouds Ao Guo, Qi-Yan Zhang, Huan Yang, Jun Zhang General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Ultralight bosons can be excited around spinning black holes via black hole superradiance. These boson clouds may play an important role in the orbital evolution of binary black holes. In this work, we investigate the formation and evolution of common envelopes of ultralight boson clouds in comparable mass-ratio black hole binaries. We describe the cloud evolution using gravitational molecular eigenstates and analyze the possible level transitions during orbital decay, as well as the impact on orbital dynamics. We find that the cloud can generally lead to eccentricity growth. In particular, the eccentricity may vary significantly during level transition, leaving an eccentricity of ${\\cal O}(0.1)$ within the detection band of ground-based gravitational wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2508.18738.pdf",
      "published": "2026-02-06T01:33:51.260546",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.21200",
      "title": "Gravitational waves from two scalar fields unifying the dark sector with inflation",
      "authors": [
        "Orlando Luongo",
        "Tommaso Mengoni",
        "Paulo M. Sá"
      ],
      "abstract": "Gravitational waves from two scalar fields unifying the dark sector with inflation Orlando Luongo, Tommaso Mengoni, Paulo M. Sá 11 pages, 6 figures, published in Phys. Rev. D, this https URL General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the gravitational-wave background predicted by a two-scalar-field cosmological model that aims to unify primordial inflation with the dark sector, namely late-time dark energy and dark matter, in a single and self-consistent theoretical framework. The model is constructed from an action inspired by several extensions of general relativity and string-inspired scenarios and features a non-minimal interaction between the two scalar fields, while both remain minimally coupled to gravity. In this context, we derive the gravitational-wave energy spectrum over wavelengths ranging from today's Hubble horizon to those at the end of inflation. We employ the continuous Bogoliubov coefficient formalism, originally introduced to describe particle creation in an expanding Universe, in analogy to the well-established mechanism of gravitational particle production and, in particular, generalized to gravitons. Using this method, which enables an accurate description of graviton creation across all cosmological epochs, we find that inflation provides the dominant gravitational-wave contribution, while subdominant features arise at the inflation-radiation, radiation-matter, and matter-dark energy transitions, i.e., epochs naturally encoded inside our scalar field picture. The resulting energy density spectrum is thus compared with the sensitivity curves of the planned next-generation ground- and space-based gravitational-wave observatories. The comparison identifies frequency bands where the predicted signal could be probed, providing those windows associated with potentially detectable signals, bounded by our analyses. Consequences of our recipe are thus compared with numerical outcomes and the corresponding physical properties discussed in detail.",
      "pdf_url": "https://arxiv.org/pdf/2509.21200.pdf",
      "published": "2026-02-06T01:33:51.260993",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.24989",
      "title": "Periodic orbits and their gravitational waves in EMRIs: supermassive black hole affected by galactic dark matter halos",
      "authors": [
        "Guo-He Li",
        "Chen-Kai Qiao",
        "Jun Tao"
      ],
      "abstract": "Periodic orbits and their gravitational waves in EMRIs: supermassive black hole affected by galactic dark matter halos Guo-He Li, Chen-Kai Qiao, Jun Tao 38 pages, 18 figures, 3 tables, 2 appendices; V2 and V3: minor revision, some errors are corrected General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Periodic orbits exhibiting zoom-whirl behavior have become attractive topics for studying particle dynamics and gravitational wave emission in extreme-mass-ratio inspirals (EMRIs). This study systematically investigates periodic orbits around black holes and their gravitational wave radiation in three dark matter halo environments: NFW, Beta, and Moore models. The dark matter distribution in these models can be effectively incorporated using two parameters -- the dark matter characteristic mass and halo characteristic radius. Our results reveal that for a larger dark matter mass and a smaller characteristic radius, the shapes of the periodic orbits and the corresponding gravitational waveforms show more significant deviations from the Schwarzschild case. As the halo characteristic radius increases, the orbital shapes and waveform characteristics gradually converge with the Schwarzschild black hole results. Furthermore, our results also suggest that the NFW and Beta models produce nearly indistinguishable results, while the Moore model shows distinct signatures compared with Beta/NFW models. These findings deepen our understanding of dark matter halo effects on periodic motions and gravitational wave signatures. Keywords: GR black holes; Gravitational waves in GR and beyond: theory; dark matter theory; astrophysical black holes",
      "pdf_url": "https://arxiv.org/pdf/2510.24989.pdf",
      "published": "2026-02-06T01:33:51.261693",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.09659",
      "title": "Finite Populations & Finite Time: The Non-Gaussianity of a Gravitational Wave Background",
      "authors": [
        "William G. Lamb",
        "Jeremy M. Wachter",
        "Andrea Mitridate",
        "Shashwat C. Sardesai",
        "Bence Bécsy",
        "Emily L. Hagen",
        "Stephen R. Taylor",
        "Luke Zoltan Kelley"
      ],
      "abstract": "Finite Populations & Finite Time: The Non-Gaussianity of a Gravitational Wave Background William G. Lamb, Jeremy M. Wachter, Andrea Mitridate, Shashwat C. Sardesai, Bence Bécsy, Emily L. Hagen, Stephen R. Taylor, Luke Zoltan Kelley 19 pages, 8 figures. Submitted to Phys. Rev. D. Version 2 - corrected an equation and added comparison between analytical and numerical results General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Strong evidence for an isotropic, Gaussian gravitational wave background (GWB) has been found by multiple pulsar timing arrays (PTAs). The GWB is expected to be sourced by a finite population of supermassive black hole binaries (SMBHBs) emitting in the PTA sensitivity band, and astrophysical inference of PTA data sets suggests a GWB signal that is at the higher end of GWB spectral amplitude estimates. However, current inference analyses make simplifying assumptions, such as modeling the GWB as Gaussian, assuming that all SMBHBs only emit at frequencies that are integer multiples of the total observing time, and ignoring the interference between the signals of different SMBHBs. In this paper, we build analytical and numerical models of an astrophysical GWB without the above approximations, and compare the statistical properties of its induced PTA signal to those of a signal produced by a Gaussian GWB. We show that finite population and windowing effects introduce non-Gaussianities in the PTA signal, which are currently unmodeled in PTA analyses.",
      "pdf_url": "https://arxiv.org/pdf/2511.09659.pdf",
      "published": "2026-02-06T01:33:51.261934",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2512.16347",
      "title": "GWTC-4.0: Searches for Gravitational-Wave Lensing Signatures",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration: A. G. Abac",
        "I. Abouelfettouh",
        "F. Acernese",
        "K. Ackley",
        "C. Adamcewicz",
        "S. Adhicary",
        "D. Adhikari",
        "N. Adhikari",
        "R. X. Adhikari",
        "V. K. Adkins",
        "S. Afroz",
        "A. Agapito",
        "D. Agarwal",
        "M. Agathos",
        "N. Aggarwal",
        "S. Aggarwal",
        "O. D. Aguiar",
        "I.-L. Ahrend",
        "L. Aiello",
        "A. Ain",
        "P. Ajith",
        "T. Akutsu",
        "S. Albanesi",
        "W. Ali",
        "S. Al-Kershi",
        "C. Alléné",
        "A. Allocca",
        "S. Al-Shammari",
        "P. A. Altin",
        "S. Alvarez-Lopez",
        "W. Amar",
        "O. Amarasinghe",
        "A. Amato",
        "F. Amicucci",
        "C. Amra",
        "A. Ananyeva",
        "S. B. Anderson",
        "W. G. Anderson",
        "M. Andia",
        "M. Ando",
        "M. Andrés-Carcasona",
        "T. Andrić",
        "J. Anglin",
        "S. Ansoldi",
        "J. M. Antelis",
        "S. Antier",
        "M. Aoumi",
        "E. Z. Appavuravther",
        "S. Appert",
        "S. K. Apple",
        "K. Arai",
        "A. Araya",
        "M. C. Araya",
        "M. Arca Sedda",
        "J. S. Areeda",
        "N. Aritomi",
        "F. Armato",
        "S. Armstrong",
        "N. Arnaud",
        "M. Arogeti",
        "S. M. Aronson",
        "G. Ashton",
        "Y. Aso",
        "L. Asprea",
        "M. Assiduo",
        "S. Assis de Souza Melo",
        "S. M. Aston",
        "P. Astone",
        "F. Attadio",
        "F. Aubin",
        "K. AultONeal",
        "G. Avallone",
        "E. A. Avila",
        "S. Babak",
        "C. Badger",
        "S. Bae",
        "S. Bagnasco",
        "L. Baiotti",
        "R. Bajpai",
        "T. Baka",
        "A. M. Baker",
        "K. A. Baker",
        "T. Baker",
        "G. Baldi",
        "N. Baldicchi",
        "M. Ball",
        "G. Ballardin",
        "S. W. Ballmer",
        "S. Banagiri",
        "B. Banerjee",
        "D. Bankar",
        "T. M. Baptiste",
        "P. Baral",
        "M. Baratti",
        "J. C. Barayoga",
        "B. C. Barish",
        "D. Barker"
      ],
      "abstract": "GWTC-4.0: Searches for Gravitational-Wave Lensing Signatures The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration: A. G. Abac, I. Abouelfettouh, F. Acernese, K. Ackley, C. Adamcewicz, S. Adhicary, D. Adhikari, N. Adhikari, R. X. Adhikari, V. K. Adkins, S. Afroz, A. Agapito, D. Agarwal, M. Agathos, N. Aggarwal, S. Aggarwal, O. D. Aguiar, I.-L. Ahrend, L. Aiello, A. Ain, P. Ajith, T. Akutsu, S. Albanesi, W. Ali, S. Al-Kershi, C. Alléné, A. Allocca, S. Al-Shammari, P. A. Altin, S. Alvarez-Lopez, W. Amar, O. Amarasinghe, A. Amato, F. Amicucci, C. Amra, A. Ananyeva, S. B. Anderson, W. G. Anderson, M. Andia, M. Ando, M. Andrés-Carcasona, T. Andrić, J. Anglin, S. Ansoldi, J. M. Antelis, S. Antier, M. Aoumi, E. Z. Appavuravther, S. Appert, S. K. Apple, K. Arai, A. Araya, M. C. Araya, M. Arca Sedda, J. S. Areeda, N. Aritomi, F. Armato, S. Armstrong, N. Arnaud, M. Arogeti, S. M. Aronson, G. Ashton, Y. Aso, L. Asprea, M. Assiduo, S. Assis de Souza Melo, S. M. Aston, P. Astone, F. Attadio, F. Aubin, K. AultONeal, G. Avallone, E. A. Avila, S. Babak, C. Badger, S. Bae, S. Bagnasco, L. Baiotti, R. Bajpai, T. Baka, A. M. Baker, K. A. Baker, T. Baker, G. Baldi, N. Baldicchi, M. Ball, G. Ballardin, S. W. Ballmer, S. Banagiri, B. Banerjee, D. Bankar, T. M. Baptiste, P. Baral, M. Baratti, J. C. Barayoga, B. C. Barish, D. Barker 36 pages (including refs), 15 figures General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Gravitational waves can be gravitationally lensed by massive objects along their path. Depending on the lens mass and the lens--source geometry, this can lead to the observation of a single distorted signal or multiple repeated events with the same frequency evolution. We present the results for gravitational-wave lensing searches on the data from the first part of the fourth LIGO--Virgo--KAGRA observing run (O4a). We search for strongly lensed events in the newly acquired data by (1) searching for an overall phase shift present in an image formed at a saddle point of the lens potential, (2) looking for pairs of detected candidates with consistent frequency evolution, and (3) identifying sub-threshold counterpart candidates to the detected signals. Beyond strong lensing, we also look for lensing-induced distortions in all detected signals using an isolated point-mass model. We do not find evidence for strongly lensed gravitational-wave signals and use this result to constrain the rate of detectable strongly lensed events and the merger rate density of binary black holes at high redshift. In the search for single distorted lensed signals, we find one outlier: GW231123_135430, for which we report more detailed investigations. While this event is interesting, the associated waveform uncertainties make its interpretation complicated, and future observations of the populations of binary black holes and of gravitational lenses will help determine the probability that this event could be lensed.",
      "pdf_url": "https://arxiv.org/pdf/2512.16347.pdf",
      "published": "2026-02-06T01:33:51.263198",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.13863",
      "title": "Inverse Area Corrections to Black Hole Entropy Area Formula in F(R) Gravity and Gravitational Wave Observations",
      "authors": [
        "Rohit Das",
        "Parthasarathi Majumdar",
        "Debadrita Mukherjee"
      ],
      "abstract": "Inverse Area Corrections to Black Hole Entropy Area Formula in F(R) Gravity and Gravitational Wave Observations Rohit Das, Parthasarathi Majumdar, Debadrita Mukherjee 5 pages Latex 2e including references, no figures General Relativity and Quantum Cosmology (gr-qc) We consider corrections to the Bekenstein Hawking Area Formula for black hole entropy, which have inverse powers of the horizon area for very large horizon areas, for classical spherically symmetric black hole solutions of F(R) modified gravity theory, using the Wald formula for the entropy function with modifications suggested by Jacobson, Kang and Myers. Requiring that the coefficient of such corrections be absolutely consistent with gravitational wave observational results validating the Hawking Area Theorem for binary black hole coalescences, implies constraints on parameters of F(R) gravity. For the sake of comparison, we present a computation of inverse area corrections for quantum black holes in quantum general relativity, using the It from Bit approach of Wheeler modified by some tenets of Loop Quantum Gravity.",
      "pdf_url": "https://arxiv.org/pdf/2601.13863.pdf",
      "published": "2026-02-06T01:33:51.263956",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2411.05906",
      "title": "Inference on inner galaxy structure via gravitational waves from supermassive binaries",
      "authors": [
        "Yifan Chen",
        "Matthias Daniel",
        "Daniel J. D'Orazio",
        "Xuanye Fan",
        "Andrea Mitridate",
        "Laura Sagunski",
        "Xiao Xue",
        "Gabriella Agazie",
        "Akash Anumarlapudi",
        "Anne M. Archibald",
        "Zaven Arzoumanian",
        "Jeremy G. Baier",
        "Paul T. Baker",
        "Bence Bécsy",
        "Laura Blecha",
        "Adam Brazier",
        "Paul R. Brook",
        "Sarah Burke-Spolaor",
        "Rand Burnette",
        "J. Andrew Casey-Clyde",
        "Maria Charisi",
        "Shami Chatterjee",
        "Tyler Cohen",
        "James M. Cordes",
        "Neil J. Cornish",
        "Fronefield Crawford",
        "H. Thankful Cromartie",
        "Kathryn Crowter",
        "Megan E. DeCesar",
        "Paul B. Demorest",
        "Heling Deng",
        "Lankeswar Dey",
        "Timothy Dolch",
        "Elizabeth C. Ferrara",
        "William Fiore",
        "Emmanuel Fonseca",
        "Gabriel E. Freedman",
        "Emiko C. Gardiner",
        "Nate Garver-Daniels",
        "Peter A. Gentile",
        "Kyle A. Gersbach",
        "Joseph Glaser",
        "Deborah C. Good",
        "Kayhan Gültekin",
        "Jeffrey S. Hazboun",
        "Ross J. Jennings",
        "Aaron D. Johnson",
        "Megan L. Jones",
        "David L. Kaplan",
        "Luke Zoltan Kelley",
        "Matthew Kerr",
        "Joey S. Key",
        "Nima Laal",
        "Michael T. Lam",
        "William G. Lamb",
        "Bjorn Larsen",
        "T. Joseph W. Lazio",
        "Natalia Lewandowska",
        "Tingting Liu",
        "Duncan R. Lorimer",
        "Jing Luo",
        "Ryan S. Lynch",
        "Chung-Pei Ma",
        "Dustin R. Madison",
        "Alexander McEwen",
        "James W. McKee",
        "Maura A. McLaughlin",
        "Natasha McMann",
        "Bradley W. Meyers",
        "Patrick M. Meyers",
        "Chiara M. F. Mingarelli",
        "Cherry Ng",
        "David J. Nice",
        "Stella Koch Ocker",
        "Ken D. Olum",
        "Timothy T. Pennucci",
        "Benetge B. P. Perera",
        "Polina Petrov",
        "Nihan S. Pol",
        "Henri A. Radovan",
        "Scott M. Ransom",
        "Paul S. Ray",
        "Joseph D. Romano",
        "Jessie C. Runnoe",
        "Alexander Saffer",
        "Shashwat C. Sardesai",
        "Ann Schmiedekamp",
        "Carl Schmiedekamp",
        "Kai Schmitz",
        "Brent J. Shapiro-Albert",
        "Xavier Siemens",
        "Joseph Simon",
        "Magdalena S. Siwek",
        "Sophia V. Sosa Fiscella",
        "Ingrid H. Stairs",
        "Daniel R. Stinebring",
        "Kevin Stovall",
        "Abhimanyu Susobhanan",
        "Joseph K. Swiggum",
        "Jacob Taylor"
      ],
      "abstract": "Inference on inner galaxy structure via gravitational waves from supermassive binaries Yifan Chen, Matthias Daniel, Daniel J. D'Orazio, Xuanye Fan, Andrea Mitridate, Laura Sagunski, Xiao Xue, Gabriella Agazie, Akash Anumarlapudi, Anne M. Archibald, Zaven Arzoumanian, Jeremy G. Baier, Paul T. Baker, Bence Bécsy, Laura Blecha, Adam Brazier, Paul R. Brook, Sarah Burke-Spolaor, Rand Burnette, J. Andrew Casey-Clyde, Maria Charisi, Shami Chatterjee, Tyler Cohen, James M. Cordes, Neil J. Cornish, Fronefield Crawford, H. Thankful Cromartie, Kathryn Crowter, Megan E. DeCesar, Paul B. Demorest, Heling Deng, Lankeswar Dey, Timothy Dolch, Elizabeth C. Ferrara, William Fiore, Emmanuel Fonseca, Gabriel E. Freedman, Emiko C. Gardiner, Nate Garver-Daniels, Peter A. Gentile, Kyle A. Gersbach, Joseph Glaser, Deborah C. Good, Kayhan Gültekin, Jeffrey S. Hazboun, Ross J. Jennings, Aaron D. Johnson, Megan L. Jones, David L. Kaplan, Luke Zoltan Kelley, Matthew Kerr, Joey S. Key, Nima Laal, Michael T. Lam, William G. Lamb, Bjorn Larsen, T. Joseph W. Lazio, Natalia Lewandowska, Tingting Liu, Duncan R. Lorimer, Jing Luo, Ryan S. Lynch, Chung-Pei Ma, Dustin R. Madison, Alexander McEwen, James W. McKee, Maura A. McLaughlin, Natasha McMann, Bradley W. Meyers, Patrick M. Meyers, Chiara M. F. Mingarelli, Cherry Ng, David J. Nice, Stella Koch Ocker, Ken D. Olum, Timothy T. Pennucci, Benetge B. P. Perera, Polina Petrov, Nihan S. Pol, Henri A. Radovan, Scott M. Ransom, Paul S. Ray, Joseph D. Romano, Jessie C. Runnoe, Alexander Saffer, Shashwat C. Sardesai, Ann Schmiedekamp, Carl Schmiedekamp, Kai Schmitz, Brent J. Shapiro-Albert, Xavier Siemens, Joseph Simon, Magdalena S. Siwek, Sophia V. Sosa Fiscella, Ingrid H. Stairs, Daniel R. Stinebring, Kevin Stovall, Abhimanyu Susobhanan, Joseph K. Swiggum, Jacob Taylor 19 pages, 6 figures, accepted version in Nature Astronomy High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The detection of a stochastic gravitational wave background by pulsar-timing arrays indicates the presence of a population of supermassive black hole binaries. Although the observed spectrum generally matches predictions for orbital evolution driven by gravitational-wave emission in circular orbits, there is a preference for a spectral turnover at the lowest observed frequencies, which may point to substantial hardening during a transition from early environmental influences to later stages dominated by emission. In the vicinity of these binaries, the ejection of stars or dark matter particles through gravitational three-body slingshots efficiently extracts orbital energy, leading to a low-frequency turnover in the spectrum. Here we model how the gravitational-wave spectrum depends on the initial inner galactic profile before scouring by binary ejections while accounting for a range of initial binary eccentricities. By analysing the NANOGrav 15-year data, we find that a parsec-scale galactic-centre density of around $10^6 M_{\\odot} \\mathrm{pc}^{-3}$ is favoured across most of the parameter space, thus shedding light on the environmental effects that shape black hole evolution and the combined matter density near galaxy centres.",
      "pdf_url": "https://arxiv.org/pdf/2411.05906.pdf",
      "published": "2026-02-06T01:33:51.265385",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.10673",
      "title": "Time-dependent deflection reconstruction: new technique to search for gravitational waves with the cosmic microwave background",
      "authors": [
        "Alvin Leluc",
        "Joel Meyers",
        "Alexander van Engelen"
      ],
      "abstract": "Time-dependent deflection reconstruction: new technique to search for gravitational waves with the cosmic microwave background Alvin Leluc, Joel Meyers, Alexander van Engelen Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Gravitational waves (GWs) passing through the Earth cause a correlated pattern of time-dependent deflections of the apparent position of astronomical sources. We build upon standard lensing reconstruction techniques to develop a new time-dependent quadratic estimator, providing a novel technique to search for the deflections produced by GWs using observations of the cosmic microwave background (CMB). We find that the time-dependent deflection reconstruction is many orders of magnitude more sensitive than the ordinary static lensing estimator, and it can be employed with the data collected by existing and future CMB surveys, without requiring any modification to the experimental or survey design. We demonstrate that CMB surveys offer sensitivity to GWs across a broad frequency range: while the sensitivity will not be competitive over the frequency range covered by pulsar timing arrays, it does extend coverage to both lower and higher frequencies. Finally, we discuss how our methods can be extended to search for other time-varying signals, and also how it can be applied to surveys at other wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2508.10673.pdf",
      "published": "2026-02-06T01:33:51.265591",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2601.03456",
      "title": "The steep redshift evolution of the hierarchical binary black hole merger rate may cause the $z$-$χ_{\\rm eff}$ correlation",
      "authors": [
        "Amanda M. Farah",
        "Aditya Vijaykumar",
        "Maya Fishbach"
      ],
      "abstract": "The steep redshift evolution of the hierarchical binary black hole merger rate may cause the $z$-$χ_{\\rm eff}$ correlation Amanda M. Farah, Aditya Vijaykumar, Maya Fishbach 9 pages, 4 figures (with appendices: 18 pages, 12 figures). Also see Vijaykumar et al., posted simultaneously. v3 fixes an error with sensitivity estimates High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) There is growing evidence from gravitational-wave observations that some merging black holes are created from previous mergers. Using the prediction that these hierarchically-merged black holes have dimensionless spin magnitudes of $\\chi \\approx 0.69$, we identify a subpopulation in the gravitational-wave data consistent with a hierarchical-merger origin in dense star clusters. This subpopulation's primary mass distribution peaks at $17.0^{+18.3}_{-4.4},\\mathrm{M}_{\\odot}$, which is approximately twice as large as its secondary mass distribution's mode ($10.5^{+29.7}_{-4.7},\\mathrm{M}_{\\odot}$), and its spin tilt distribution is consistent with isotropy. Our inferred secondary mass distributions imply that isolated binary evolution may still be needed to explain the entirety of the $9\\,\\mathrm{M}_{\\odot}$ peak. Surprisingly, we find that the rate of hierarchical mergers may evolve more steeply with redshift than the rest of the population ($98.0\\%$ credibility): the fraction of all binary black holes that are hierarchically formed at $z=0.1$ is $0.03^{+0.05}_{-0.02}$, compared to $0.09^{+0.11}_{-0.07}$ at $z=1$. This provides an explanation for the previously-discovered broadening of the effective spin distribution with redshift. Our results have implications for star cluster formation histories, as they suggest the potential existence of a high-redshift population of massive, compact clusters.",
      "pdf_url": "https://arxiv.org/pdf/2601.03456.pdf",
      "published": "2026-02-06T01:33:51.266479",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.04497",
      "title": "A model-independent measurement of the Hubble constant from gravitational-wave standard sirens and electromagnetic observations",
      "authors": [
        "Gaurav N. Gadbail",
        "Kazuharu Bamba"
      ],
      "abstract": "A model-independent measurement of the Hubble constant from gravitational-wave standard sirens and electromagnetic observations Gaurav N. Gadbail, Kazuharu Bamba Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Hubble tension is one of the most significant challenges in modern cosmology. Developing new approaches to estimate the Hubble constant is therefore crucial, and in this work, we employ a Gaussian process, a fully model-independent method that relies solely on observational data. To determine the Hubble constant, we use not only electromagnetic observations but also include gravitational-wave standard siren data from GWTC3. Our measurements of the Hubble constant are strongly consistent with the SH0ES result, with tensions less than $2\\sigma$, indicating no statistically significant discrepancy. This approach quantifies the impact of gravitational-wave data on the determination of the Hubble constant, examines its consistency with electromagnetic measurements, and explores its potential role in addressing the Hubble tension.",
      "pdf_url": "https://arxiv.org/pdf/2602.04497.pdf",
      "published": "2026-02-06T01:33:51.388342",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.04528",
      "title": "Separation of polarized dust emission in Planck observations with Scattering Transforms",
      "authors": [
        "Alexandros Tsouros",
        "Elisa Russier",
        "Erwan Allys",
        "Constant Auclair",
        "François Boulanger",
        "Jacques Delabrouille"
      ],
      "abstract": "Separation of polarized dust emission in Planck observations with Scattering Transforms Alexandros Tsouros, Elisa Russier, Erwan Allys, Constant Auclair, François Boulanger, Jacques Delabrouille Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Polarized dust emission is a major astrophysical foreground contaminant of the cosmic microwave background polarization (CMB), which must be accurately measured to look for the faint primordial polarization B-modes of inflationary origin. The available maps to date, obtained from Planck space mission data, are noise-dominated in the high Galactic latitude regions that are most relevant for CMB observations. The goal of this work is to obtain better dust polarization maps from Planck observations, by exploiting both the dependence between polarization and total intensity, as well as the non-Gaussian filamentary structure of the dust emission. To this end, we use scattering transforms, which provide a stable and interpretable representation of complex non-Gaussian textures, allowing for a data-driven analysis approach requiring no explicit priors on dust. The analysis is performed locally on Cartesian patches of sky, where Stokes linear polarization parameters, redefined in a local reference frame, are modeled as the sum of a signal of interest and a nuisance term. Using multiple realizations of the random nuisance term, we recover the polarized dust maps by minimizing a composite objective function that enforces multiple statistical constraints in scattering space. The proposed algorithm reconstructs maps of polarized dust emission whose statistics are consistent with those expected from the Planck data once random nuisance realizations are added. This is confirmed in a validation test using a high signal-to-noise sky region as a test case. Comparisons with existing dust polarization maps and models show that our approach better recovers small-scale polarized dust emission, and that our reconstructed power and cross-spectra closely match those of the dust polarization maps. A second set of maps that deterministically reproduce the features of the dust polarized emission is also produced.",
      "pdf_url": "https://arxiv.org/pdf/2602.04528.pdf",
      "published": "2026-02-06T01:33:51.388772",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.04559",
      "title": "The Standard siren tests of viable $f(R)$ cosmologies",
      "authors": [
        "Yi Zhang",
        "Xuanjun Niu",
        "Xianfu Su",
        "Dong-Ze He"
      ],
      "abstract": "The Standard siren tests of viable $f(R)$ cosmologies Yi Zhang, Xuanjun Niu, Xianfu Su, Dong-Ze He Cosmology and Nongalactic Astrophysics (astro-ph.CO) We constrain the Hu-Sawicki and Starobinsky $f(R)$ gravity models utilizing current electromagnetic (PP+CC, Planck and DESI2) datasets and simulate standard siren catalogs based on the resulting best-fit parameters. We demonstrate that the simulated SS data provide complementary sensitivity to the modified gravitational wave propagation friction term, thereby enhancing the discriminating power between $f(R)$ gravity and the $\\Lambda$CDM model. However, we note that standard sirens do not offer a viable resolution to the Hubble tension in this analysis, as the inferred constraints are predominantly driven by the fiducial cosmologies adopted in the simulations. Regarding the specific models, we find that for the Hu-Sawicki scenario, several data combinations favor $F_{RR0}<0$, implying potential theoretical instabilities. And, for the Starobinsky model, while EM-only constraints are nearly symmetric between the two parameter branches ($b<0$ and $b>0$), the inclusion of SS constraints introduces mild asymmetries, revealing the sensitivity of SS observables to the curvature dependence of the theory. Future truly independent standard siren observations would be crucial for a definitive assessment of $f(R)$ gravity as an alternative to $\\Lambda$CDM.",
      "pdf_url": "https://arxiv.org/pdf/2602.04559.pdf",
      "published": "2026-02-06T01:33:51.388961",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.04766",
      "title": "Measurement of the Hubble constant using the Dark Energy Survey Year 6 Gold galaxy catalog and the fourth Gravitational-Wave Transient Catalog",
      "authors": [
        "Isaac McMahon",
        "Danny Laghi",
        "Marcelle Soares-Santos",
        "Kendall Ackley",
        "Gergely Dálya",
        "Yavuz Gençel",
        "David Sánchez-Cid",
        "Felipe Andrade-Oliveira",
        "Sean MacBride",
        "Christian Chapman-Bird",
        "Rachel Gray",
        "Alexander Papadopoulos"
      ],
      "abstract": "Measurement of the Hubble constant using the Dark Energy Survey Year 6 Gold galaxy catalog and the fourth Gravitational-Wave Transient Catalog Isaac McMahon, Danny Laghi, Marcelle Soares-Santos, Kendall Ackley, Gergely Dálya, Yavuz Gençel, David Sánchez-Cid, Felipe Andrade-Oliveira, Sean MacBride, Christian Chapman-Bird, Rachel Gray, Alexander Papadopoulos Cosmology and Nongalactic Astrophysics (astro-ph.CO) Gravitational wave standard sirens enable independent measurements of the Hubble constant $H_0$. In the absence of electromagnetic counterparts, the \"dark siren\" method statistically correlates GW events with potential host galaxies. We present a measurement of $H_0$ using 142 compact binary coalescences from the fourth Gravitational-Wave Transient Catalog (GWTC-4.0) combined with the Dark Energy Survey Year 6 Gold photometric galaxy catalog. Using the gwcosmo pipeline, we jointly infer cosmological and GW population parameters. We analyze the impact of galaxy catalog properties on the inference, identifying significant features in the galaxy redshift distribution which can introduce biases. By restricting the galaxy catalog to $0.05<z<0.35$ to maintain consistency with a uniform in comoving volume galaxy distribution, we obtain a result of $H_0 = 70.9^{+22.3}_{-18.6}\\;\\text{km}\\;\\text{s}^{-1}\\;\\text{Mpc}^{-1}$ from dark sirens and $H_0=73.1^{+11.7}_{-8.6}\\;\\text{km}\\;\\text{s}^{-1}\\;\\text{Mpc}^{-1}$ when combined with the bright siren GW170817. This study demonstrates the adaptation of deep galaxy catalogs for GW cosmology, highlighting key challenges and methodologies essential for maximizing the potential of next-generation galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.04766.pdf",
      "published": "2026-02-06T01:33:51.389420",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.04135",
      "title": "McFACTS IV: Electromagnetic Counterparts to AGN Disk Embedded Binary Black Hole Mergers",
      "authors": [
        "Emily McPike",
        "Rosalba Perna",
        "K.E. Saavik Ford",
        "Barry McKernan",
        "Vera Delfavero",
        "Miranda McCarthy",
        "Kaila Nathaniel",
        "Jake Postiglione",
        "Nicolas Posner",
        "Varun Pritmani",
        "Shawn Ray",
        "Richard O'Shaughnessy"
      ],
      "abstract": "McFACTS IV: Electromagnetic Counterparts to AGN Disk Embedded Binary Black Hole Mergers Emily McPike, Rosalba Perna, K.E. Saavik Ford, Barry McKernan, Vera Delfavero, Miranda McCarthy, Kaila Nathaniel, Jake Postiglione, Nicolas Posner, Varun Pritmani, Shawn Ray, Richard O'Shaughnessy 21 pages, 12 figures, 3 tables; submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) The accretion disks of active galactic nuclei (AGN) are promising environments for producing binary black hole (BBH) mergers, which have been detected via gravitational waves (GW) with LIGO-Virgo-KAGRA (LVK). BBH mergers embedded in AGN disks are unique among GW formation channels in their generic ability to produce electromagnetic (EM) counterparts, via interactions between the merger remnant and the surrounding disk gas (though these are not always observable). While such mergers represent valuable multi-messenger sources, the lack of predictive statistical models in existing literature currently limits our ability to select possible EM counterparts with GW detections in archival data and in real time using time-domain surveys such as ZTF or LSST. Here, we employ the Monte Carlo For AGN Channel Testing and Simulation code (\\texttt{McFACTS}\\footnote{this https URL}) to predict the bolometric luminosities of jets and shocks associated with LVK-detectable BBH merger remnants in AGN disks. \\texttt{McFACTS} predicts the distribution of GW observables for an underlying BH population and disk model. In this work we present a new capability that simultaneously generates the distribution of bolometric EM luminosities corresponding to these predicted GW detections. We show that (i) migration traps in dense, Sirko-Goodman-like AGN disks efficiently drive hierarchical BH mergers, yielding high-mass, high-spin BH remnants capable of powering observable EM counterparts across merger generations; and ii) mergers embedded in sufficiently dense disks with chirp mass $\\mathcal{M}\\gtrsim40M_\\odot$ are highly likely to yield observable EM counterparts for sufficiently long-lived disks and top-heavy BH initial mass functions.",
      "pdf_url": "https://arxiv.org/pdf/2602.04135.pdf",
      "published": "2026-02-06T01:33:51.538435",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.04421",
      "title": "From Main Sequence Binary to Blast: MESA Modeling of the Double-Detonation Progenitor PTF1~J2238+7430",
      "authors": [
        "Mercedes S. Hernandez",
        "Thomas Kupfer",
        "Diogo Belloni",
        "Matthias R. Schreiber"
      ],
      "abstract": "From Main Sequence Binary to Blast: MESA Modeling of the Double-Detonation Progenitor PTF1~J2238+7430 Mercedes S. Hernandez, Thomas Kupfer, Diogo Belloni, Matthias R. Schreiber Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Hot subdwarf B (sdB) stars in close binaries with white dwarf (WD) companions are potential progenitors of double-detonation thermonuclear supernovae. The recently discovered system PTF1 J2238+7430 is a candidate for this evolutionary channel, hosting a low-mass sdB and a comparatively massive WD in a compact orbit. We aim to reproduce the evolutionary history of PTF1 J2238+7430, in which the sdB forms first via stable mass transfer, followed by the formation of the WD through a subsequent common-envelope (CE) phase. Additionally, we seek to constrain the range of initial binary parameters that can lead to such double-detonation progenitors. Using the Modules for Experiments in Stellar Astrophysics (MESA), we performed detailed binary evolution simulations from the zero-age main sequence to the present-day configuration. We explored initial stellar masses, orbital periods, and mass-loss fractions, including the effects of angular momentum transfer, tidal synchronization, and gravitational-wave-driven orbital evolution. The post-CE binary properties were derived using the standard energy formalism. Our models successfully reproduce the observed properties of PTF1 J2238+7430, consisting of a 0.406 solar-mass sdB and a 0.72 solar-mass WD in a 76.34-minute orbit. Stable Roche-lobe overflow of an approximately 2.7 solar-mass donor produces the sdB, while the WD forms from the initially less massive companion during an episode of CE evolution. We find that the CE ejection efficiency must be high to match the observed orbit, exceeding canonical values for similar systems. We further delineate the allowed parameter space for initial binaries that can evolve into sdB+WD systems consistent with double-detonation progenitors. These limits are preliminary; a systematic exploration of all parameters is needed for robust constraints, but our results provide a useful starting point for future work.",
      "pdf_url": "https://arxiv.org/pdf/2602.04421.pdf",
      "published": "2026-02-06T01:33:51.540593",
      "updated": null,
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.SR",
        "cross_list_from": "astro-ph.SR"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.10821",
      "title": "Co-evolution of Nuclear Star Clusters and Massive Black Holes: Extreme Mass-Ratio Inspirals",
      "authors": [
        "Fupeng Zhang",
        "Pau Amaro Seoane"
      ],
      "abstract": "Co-evolution of Nuclear Star Clusters and Massive Black Holes: Extreme Mass-Ratio Inspirals Fupeng Zhang, Pau Amaro Seoane 31 pages, 15 figures, accepted for publication in ApJ. Modified according to the referee's report Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We explore extreme mass-ratio inspirals (EMRIs) in the co-evolution of massive black holes (MBHs) and nuclear star clusters (NSCs), which host diverse stellar populations across a wide range of masses. The dynamics are simulated self-consistently with GNC, which we have updated to incorporate gravitational wave orbital decay, the loss cone of a spinning MBH, and stellar evolution. Over $12$ Gyr, we investigate the evolution of the NSC with a mass-growing MBH, as well as the EMRIs of stellar black holes, neutron stars, white dwarfs, brown dwarfs (BDs), and low-mass main-sequence stars (MSs), along with tidal disruption events (TDEs) involving MSs, BDs, and post-MSs. The mass growth of the MBH contributed by TDEs is typically $\\sim 10^7\\,M_{\\odot}$, $\\sim 10^6\\,M_{\\odot}$, and $\\sim 5\\times10^4\\,M_{\\odot}$ for massive, Milky-Way-like, and smaller NSCs, respectively. Between $40\\%$ and $70\\%$ of the stellar mass is lost during stellar evolution, which dominates the mass growth of the MBH if a significant fraction of the lost mass is accreted. The evolution of EMRI rates is generally affected by the cluster's size expansion or contraction, stellar population evolution, MBH mass growth, and the stellar initial mass function. The EMRI rates for compact objects peak at early epochs ($\\lesssim 1$ Gyr) and then gradually decline over cosmic time. LISA-band ($0.1$ mHz) EMRIs involving compact objects around Milky-Way-like MBHs tend to have high eccentricities, while those around spinning MBHs preferentially occupy low-inclination (prograde) orbits. In contrast, MS- and BD-EMRIs usually have eccentricity and inclination distributions that are distinct from those of compact objects.",
      "pdf_url": "https://arxiv.org/pdf/2510.10821.pdf",
      "published": "2026-02-06T01:33:51.544614",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2602.04176",
      "title": "Intermediate-Mass Black Hole Formation from Hierarchical Mergers in Galactic Nuclei",
      "authors": [
        "Amanda Newton",
        "Sanaea C Rose",
        "Fulya Kiroglu",
        "Bao-Minh Hoang",
        "Frederic Rasio"
      ],
      "abstract": "Intermediate-Mass Black Hole Formation from Hierarchical Mergers in Galactic Nuclei Amanda Newton, Sanaea C Rose, Fulya Kiroglu, Bao-Minh Hoang, Frederic Rasio Astrophysics of Galaxies (astro-ph.GA) Dense stellar environments like nuclear star clusters (NSCs) can dynamically assemble gravitational wave (GW) sources. We consider a population of single stellar mass black holes (BHs) in the inner $0.1$~pc of a NSC surrounding a $4 \\times 10^6$~M$_\\odot$ supermassive black hole (SMBH). Using a semianalytic model, we account for direct collisions between BHs and stars and GW capture between BHs. We explore the effect of the initial BH mass and spin distributions on their final properties and the production of GW sources. Specifically, we consider upper and lower limits for the BH initial mass distribution, and we account for the possibility that a subset of our initial population are the merger products of primordial BH binaries. We find that $\\sim 500$ M$_{\\odot}$ intermediate mass black holes (IMBHs) can form for our upper limit mass distribution, while our lower limit mass distribution forms none. Most IMBHs $\\gtrsim 200$~M$_\\odot$ eventually sink towards the center of the cluster and merge with the SMBH. We also find that BH-star collisions create a more uniform spin distribution. Our results have implications for LIGO-Virgo-KAGRA sources. We find that the overall merger rate depends primarily on the upper limits of the initial BH mass distribution, ranging from $\\sim10^{-10}$ to $\\sim10^{-9}$~yr$^{-1}$ per galaxy. However, primordial binaries increase the number of second and higher generation mergers by an order of magnitude.",
      "pdf_url": "https://arxiv.org/pdf/2602.04176.pdf",
      "published": "2026-02-06T01:33:51.705675",
      "updated": null,
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.14613",
      "title": "The multimessenger view of Pulsar Timing Array black holes with the Horizon-AGN simulation",
      "authors": [
        "Hippolyte Quelquejay Leclere",
        "Kunyang Li",
        "Marta Volonteri",
        "Stanislav Babak",
        "Ricarda S. Beckmann",
        "Yohan Dubois",
        "Clotilde Laigle",
        "Natalie A. Webb"
      ],
      "abstract": "The multimessenger view of Pulsar Timing Array black holes with the Horizon-AGN simulation Hippolyte Quelquejay Leclere, Kunyang Li, Marta Volonteri, Stanislav Babak, Ricarda S. Beckmann, Yohan Dubois, Clotilde Laigle, Natalie A. Webb 25 pages, 16 figures, Data availability section added Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We use the Horizon-AGN cosmological simulation to study the properties of supermassive black hole binaries (MBHBs) contributing most to the gravitational wave background (GWB) signal expected in the pulsar timing array (PTA) band. We develop a pipeline to generate realistic populations of MBHBs, allowing us to estimate both the characteristic strain and GWB time series observable by PTA experiments. We identify potential continuous wave (CW) candidates standing above the background noise, using toy PTA sensitivities representing the current EPTA and future SKA. We estimate the probability of detecting at least one CW with signal-to-noise ratio $>3$ to be $4\\%$ ($20\\%$) for EPTA (SKA)-like sensitivities, assuming a 10-year baseline. We find the GWB to be dominated by hundreds to thousands of binaries at redshifts in the range $0.05-1$, with chirp masses of $10^{8.5}-10^{9.5}\\, M_\\odot$, hosted mainly in quiescent massive galaxies residing in halos of mass $\\sim 10^{13}\\, M_\\odot$. CW candidates have larger masses, lower redshifts and are found in even more massive halos, typical of galaxy groups and clusters. The majority of these systems would appear as AGN rather than quasars, because of their low Eddington ratios. Nevertheless, CW candidates with $f_{\\rm Edd}>10^{-3}$ can still outshine their hosts, particularly in radio and X-ray bands, suggesting them as the most promising route for identification. Our findings imply that optical and near-infrared searches based on light curve variability are challenging and biased toward more luminous systems. Finally, we highlight important caveats in the common method used to compare PTA observations with theoretical models. We find that GWB spectral inferences used by PTAs could be biased toward shallower slopes and higher amplitudes at $f=1/\\rm yr$, thereby reducing the apparent tension between astrophysical expectations and PTA observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.14613.pdf",
      "published": "2026-02-06T01:33:51.712097",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}