{
  "date": "2025-11-04",
  "crawl_timestamp": "2025-11-04T01:31:38.801048",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 141,
    "total_gw_papers": 15,
    "by_category": {
      "gr-qc": {
        "total": 24,
        "gw_related": 8
      },
      "astro-ph": {
        "total": 100,
        "gw_related": 5
      }
    }
  },
  "crawl_verification": {
    "total_expected": 192,
    "total_actual": 192,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 39,
        "actual_crawled": 39,
        "page_source_info": "Total of 39 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 38,
        "actual_crawled": 38,
        "page_source_info": "Total of 38 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 20,
        "actual_crawled": 20,
        "page_source_info": "Total of 20 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 37,
        "actual_crawled": 37,
        "page_source_info": "Total of 37 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 26,
        "actual_crawled": 26,
        "page_source_info": "Total of 26 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 13,
        "actual_crawled": 13,
        "page_source_info": "Total of 13 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.26848",
      "title": "Cosmological and High Energy Physics implications from gravitational-wave background searches in LIGO-Virgo-KAGRA's O1-O4a runs",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration"
      ],
      "abstract": "Cosmological and High Energy Physics implications from gravitational-wave background searches in LIGO-Virgo-KAGRA's O1-O4a runs The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration Main paper: 33 pages, 20 figures General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We search for gravitational-wave background signals produced by various early Universe processes in the Advanced LIGO O4a dataset, combined with the data from the earlier O1, O2, and O3 (LIGO-Virgo) runs. The absence of detectable signals enables powerful constraints on fundamental physics. We derive gravitational-wave background energy density upper limits from the O1-O4a data to constrain parameters associated with various possible processes in the early Universe: first-order phase transitions, cosmic strings, domain walls, stiff equation of state, axion inflation, second-order scalar perturbations, primordial black hole binaries, and parity violation. In our analyses, the presence of an astrophysical background produced by compact (black hole and neutron star) binary coalescences throughout the Universe is also considered. We address the implications for various cosmological and high energy physics models based on the obtained parameter constraints. We conclude that LIGO-Virgo data already yield significant constraints on numerous early Universe scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2510.26848.pdf",
      "published": "2025-11-04T01:31:37.948249",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.26883",
      "title": "On the adiabatic initial conditions for a particle gas in cosmology",
      "authors": [
        "Guillem Domènech"
      ],
      "abstract": "On the adiabatic initial conditions for a particle gas in cosmology Guillem Domènech General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) In view of recent interest in the role of \"dark\" radiation in cosmology, such as cosmic gravitational waves, sterile neutrinos, and dark photons, we clarify the definition of adiabatic initial conditions in the kinetic theory of gases in an expanding universe. Without assuming any form for the phase space distribution function, we identify two possibilities: a strong and a weak adiabatic initial condition. The strong one corresponds to the standard adiabatic initial conditions, while the weak one is related to the strong via internal isocurvature fluctuations. We show that both types of adiabatic initial conditions are consistent with the separate universe approach, although the latter requires initial internal isocurvature. In passing, we stress the importance of using the particle local momentum in the phase space to define the notion of adiabatic initial conditions. Doing so, we clarify that a gas of gravitons can have adiabatic initial conditions.",
      "pdf_url": "https://arxiv.org/pdf/2510.26883.pdf",
      "published": "2025-11-04T01:31:37.948790",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.26919",
      "title": "Scattered light noise due to dust particles contamination in the vacuum pipes of the Einstein Telescope",
      "authors": [
        "Andrea Moscatello",
        "Giacomo Ciani",
        "Livia Conti"
      ],
      "abstract": "Scattered light noise due to dust particles contamination in the vacuum pipes of the Einstein Telescope Andrea Moscatello, Giacomo Ciani, Livia Conti 16 pages, 14 figures, 1 table. To be submitted to PRD General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) High-sensitivity optical measurements such as those performed in interferometric gravitational wave detectors are prone to scattered light noise. To minimize it, optical components must meet tight requirements on surface roughness and bulk defects. Nonetheless, the effectiveness of these measures can be undermined by other sources of scattered light. In this article, we examine scattered light noise caused by particles deposited on surfaces, especially on the baffles inside the vacuum pipes of the Einstein Telescope's interferometer arms. First, we study light scattering by particles deposited on a surface and having diameters from about one tenth to hundred times the light wavelength: we discuss its angular distribution and dependence on particle size and refractive index, and on polarization. Then, we specialize to the case of the Einstein Telescope arms and quantify the maximum allowed density of particles on each arm baffle. We conclude with cleanliness guidelines for the assembly of the vacuum pipes, including the required cleanliness class of the installation environment.",
      "pdf_url": "https://arxiv.org/pdf/2510.26919.pdf",
      "published": "2025-11-04T01:31:37.949298",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.26963",
      "title": "Axial Gravitational Normal Modes of Uniform Density Star in Anti-de Sitter Spacetime",
      "authors": [
        "Kai Lin",
        "Alan B. Pavan",
        "Amilcar Rabelo de Queiroz",
        "Elcio Abdalla"
      ],
      "abstract": "Axial Gravitational Normal Modes of Uniform Density Star in Anti-de Sitter Spacetime Kai Lin, Alan B. Pavan, Amilcar Rabelo de Queiroz, Elcio Abdalla Nuclear Physics B, Vol.1020, November (2025) 117175 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The article studies the dynamical behavior of axial gravitational perturbations of homogeneous stars in Anti-de Sitter spacetime. Because the radial coordinate $r$ transforms into the tortoise coordinate $y = y(r)$, obeying $y(r=0)=0$ and $y(r\\rightarrow\\infty)=y_\\text{max}<\\infty$, the tortoise coordinates domain is finite, and the gravitational waves fail to reach out of the domain. Thus, from the perspective of tortoise coordinates, the perturbation equation of uniform density stars in Anti-de Sitter spacetime is analogous to the infinite deep potential well in quantum mechanics. Therefore, the perturbative behavior in this spacetime represents a standing wave vibration. Here we use shooting method and finite difference method to show the imagery of standing waves in this spacetime for $n=0,1,2$ as examples. On the other hand, by finite difference method, a Gaussian wave packet bounces back and forth within this potential well. Furthermore, due to the shape of the gravitational potential function $V$ within the range $0\\le y\\le y_\\text{max}$, an echo phenomenon occurs at the surface of the star. As the energy of the wave packet remains within the potential well, each time it traverses the surface of the star, a reflective echo is generated. Consequently, after multiple reflections, the Gaussian wave packet cannot maintain its original shape and ultimately disperses.",
      "pdf_url": "https://arxiv.org/pdf/2510.26963.pdf",
      "published": "2025-11-04T01:31:37.950032",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.27320",
      "title": "The quasinormal modes of the rotating quantum corrected black holes",
      "authors": [
        "Jia-Ning Chen",
        "Zong-Kuan Guo",
        "Liang-Bi Wu"
      ],
      "abstract": "The quasinormal modes of the rotating quantum corrected black holes Jia-Ning Chen, Zong-Kuan Guo, Liang-Bi Wu 16 pages, 5 figures and 1 table General Relativity and Quantum Cosmology (gr-qc) The quasinormal modes (QNMs) of a rotating quantum corrected black hole (RQCBH) are studied by employing the hyperboloidal framework for the scalar perturbation. This framework is used to cast the QNMs spectra problem into the two-dimensional eigenvalues problem, then the spectra are calculated by imposing two-dimensional pseudo-spectral method. Based on the resulting spectra, a parameter estimation pipeline for this RQCBH model with gravitational wave data is constructed by using \\texttt{pyRing} in the ringdown phase. We find that, even when the RQCBH spectra exhibits a small deviation from the Kerr spectra, the strong correlation between the extra parameter coming from the quantum gravity theory and the intrinsic parameter of black hole may significantly affect the posterior distributions of the mass $M$ and the dimensionless spin $\\bar{a}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.27320.pdf",
      "published": "2025-11-04T01:31:37.950396",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.27424",
      "title": "Extracting Properties of Dark Dense Environment Around Black Holes From Gravitational Waves",
      "authors": [
        "Qianhang Ding",
        "Minxi He",
        "Hui-Yu Zhu"
      ],
      "abstract": "Extracting Properties of Dark Dense Environment Around Black Holes From Gravitational Waves Qianhang Ding, Minxi He, Hui-Yu Zhu General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Dark matter (DM) can form dense condensates around black holes (BHs), such as superradiant clouds and ultracompact mini halos, which can significantly affect the orbital evolution of their companion objects through dynamical friction (DF). In this work, we define a novel quantity to quantify such effects in the emitted gravitational waves (GWs) in terms of GW amplitude, frequency, and their time derivatives. The information about the density profile can be extracted from this quantity, which characterizes the type of condensate and, therefore, the corresponding DM property. This quantity allows us to probe the dark dense environment by multi-wavelength GW observation with existing ground-based and future space-based GW detectors, potentially reveals the properties of the dark sector and sheds light on the primordial origin of the stellar mass BHs. A null detection can place strong constraints on the relevant DM parameters.",
      "pdf_url": "https://arxiv.org/pdf/2510.27424.pdf",
      "published": "2025-11-04T01:31:37.950751",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.27676",
      "title": "Renormalisation Group approach to General Relativity",
      "authors": [
        "F. Gutiérrez",
        "K. Falls",
        "A. Codello"
      ],
      "abstract": "Renormalisation Group approach to General Relativity F. Gutiérrez, K. Falls, A. Codello General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The detection of gravitational waves has intensified the need for efficient, high-precision modeling of the two-body problem in General Relativity. Current analytical methods, primarily the Post-Minkowskian and Post-Newtonian expansions, are inherently perturbative, while numerical relativity remains computationally expensive. In this Letter, we introduce a middle path: an exact renormalization group (RG) equation for classical gravitational systems. We demonstrate that our equation correctly reproduces the first three orders of the Post-Minkowskian expansion. Crucially, it provides a framework for non-perturbative approximations. As a first application, we show that our method efficiently recovers the 1PN two-body action, bypassing the need for complex three-graviton vertex calculations by leveraging the intrinsic nonlinearity of the RG flow. This establishes the exact RG as a powerful new tool for tackling strong-field dynamics in gravity.",
      "pdf_url": "https://arxiv.org/pdf/2510.27676.pdf",
      "published": "2025-11-04T01:31:37.951102",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.26874",
      "title": "Gravitational waveforms from restriction theory and rapid-decay homology",
      "authors": [
        "Giacomo Brunello",
        "Vsevolod Chestnov",
        "Giulio Crisanti",
        "Mathieu Giroux",
        "Sid Smith"
      ],
      "abstract": "Gravitational waveforms from restriction theory and rapid-decay homology Giacomo Brunello, Vsevolod Chestnov, Giulio Crisanti, Mathieu Giroux, Sid Smith High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph) We present a systematic framework for computing frequency-domain gravitational waveforms from relativistic binary scattering in different asymptotic regimes. The method yields a controlled series expansion that can in principle be extended to arbitrary order in the relevant kinematic parameter. By combining differential-equation techniques with restriction theory and algebraic-geometry methods for impact-parameter-space Fourier integrals, we derive recursion relations that generate the leading-order (tree-level) waveform in both the soft-emission and post-Newtonian regimes, establishing a proof of principle for extending the approach to higher-loop computations. Finally, following constraints from rapid-decay homology, we show that the Fourier integrals underlying the waveform satisfy epsilon-form differential equations mixing Bessel- and exponential-type kernels, marking a first step toward uncovering the analytic structure of the exact solution.",
      "pdf_url": "https://arxiv.org/pdf/2510.26874.pdf",
      "published": "2025-11-04T01:31:37.951284",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc",
        "math-ph"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-th",
        "cross_list_from": "hep-th"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.26931",
      "title": "GW241011 and GW241110: Exploring Binary Formation and Fundamental Physics with Asymmetric, High-Spin Black Hole Coalescence",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration: A. G. Abac",
        "I. Abouelfettouh",
        "F. Acernese",
        "K. Ackley",
        "C. Adamcewicz",
        "S. Adhicary",
        "D. Adhikari",
        "N. Adhikari",
        "R. X. Adhikari",
        "V. K. Adkins",
        "S. Afroz",
        "A. Agapito",
        "D. Agarwal",
        "M. Agathos",
        "N. Aggarwal",
        "S. Aggarwal",
        "O. D. Aguiar",
        "I.-L. Ahrend",
        "L. Aiello",
        "A. Ain",
        "P. Ajith",
        "T. Akutsu",
        "S. Albanesi",
        "W. Ali",
        "S. Al-Kershi",
        "C. Alléné",
        "A. Allocca",
        "S. Al-Shammari",
        "P. A. Altin",
        "S. Alvarez-Lopez",
        "W. Amar",
        "O. Amarasinghe",
        "A. Amato",
        "F. Amicucci",
        "C. Amra",
        "A. Ananyeva",
        "S. B. Anderson",
        "W. G. Anderson",
        "M. Andia",
        "M. Ando",
        "M. Andrés-Carcasona",
        "T. Andrić",
        "J. Anglin",
        "S. Ansoldi",
        "J. M. Antelis",
        "S. Antier",
        "F. Antonini",
        "M. Aoumi",
        "E. Z. Appavuravther",
        "S. Appert",
        "S. K. Apple",
        "K. Arai",
        "C. Araújo-Álvarez",
        "A. Araya",
        "M. C. Araya",
        "M. Arca Sedda",
        "J. S. Areeda",
        "N. Aritomi",
        "F. Armato",
        "S. Armstrong",
        "N. Arnaud",
        "M. Arogeti",
        "S. M. Aronson",
        "K. G. Arun",
        "G. Ashton",
        "Y. Aso",
        "L. Asprea",
        "M. Assiduo",
        "S. Assis de Souza Melo",
        "S. M. Aston",
        "P. Astone",
        "P. S. Aswathi",
        "F. Attadio",
        "F. Aubin",
        "K. AultONeal",
        "G. Avallone",
        "E. A. Avila",
        "S. Babak",
        "C. Badger",
        "S. Bae",
        "S. Bagnasco",
        "L. Baiotti",
        "R. Bajpai",
        "T. Baka",
        "A. M. Baker",
        "K. A. Baker",
        "T. Baker",
        "G. Baldi",
        "N. Baldicchi",
        "M. Ball",
        "G. Ballardin",
        "S. W. Ballmer",
        "S. Banagiri",
        "B. Banerjee",
        "D. Bankar",
        "T. M. Baptiste",
        "P. Baral"
      ],
      "abstract": "GW241011 and GW241110: Exploring Binary Formation and Fundamental Physics with Asymmetric, High-Spin Black Hole Coalescence The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration: A. G. Abac, I. Abouelfettouh, F. Acernese, K. Ackley, C. Adamcewicz, S. Adhicary, D. Adhikari, N. Adhikari, R. X. Adhikari, V. K. Adkins, S. Afroz, A. Agapito, D. Agarwal, M. Agathos, N. Aggarwal, S. Aggarwal, O. D. Aguiar, I.-L. Ahrend, L. Aiello, A. Ain, P. Ajith, T. Akutsu, S. Albanesi, W. Ali, S. Al-Kershi, C. Alléné, A. Allocca, S. Al-Shammari, P. A. Altin, S. Alvarez-Lopez, W. Amar, O. Amarasinghe, A. Amato, F. Amicucci, C. Amra, A. Ananyeva, S. B. Anderson, W. G. Anderson, M. Andia, M. Ando, M. Andrés-Carcasona, T. Andrić, J. Anglin, S. Ansoldi, J. M. Antelis, S. Antier, F. Antonini, M. Aoumi, E. Z. Appavuravther, S. Appert, S. K. Apple, K. Arai, C. Araújo-Álvarez, A. Araya, M. C. Araya, M. Arca Sedda, J. S. Areeda, N. Aritomi, F. Armato, S. Armstrong, N. Arnaud, M. Arogeti, S. M. Aronson, K. G. Arun, G. Ashton, Y. Aso, L. Asprea, M. Assiduo, S. Assis de Souza Melo, S. M. Aston, P. Astone, P. S. Aswathi, F. Attadio, F. Aubin, K. AultONeal, G. Avallone, E. A. Avila, S. Babak, C. Badger, S. Bae, S. Bagnasco, L. Baiotti, R. Bajpai, T. Baka, A. M. Baker, K. A. Baker, T. Baker, G. Baldi, N. Baldicchi, M. Ball, G. Ballardin, S. W. Ballmer, S. Banagiri, B. Banerjee, D. Bankar, T. M. Baptiste, P. Baral Data available from Zenodo (this https URL) or the Gravitational-Wave Open Science Center (this https URL) Astrophys. J. Letters, 993, L21 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We report the observation of gravitational waves from two binary black hole coalescences during the fourth observing run of the LIGO--Virgo--KAGRA detector network, GW241011 and GW241110. The sources of these two signals are characterized by rapid and precisely measured primary spins, non-negligible spin--orbit misalignment, and unequal mass ratios between their constituent black holes. These properties are characteristic of binaries in which the more massive object was itself formed from a previous binary black hole merger, and suggest that the sources of GW241011 and GW241110 may have formed in dense stellar environments in which repeated mergers can take place. As the third loudest gravitational-wave event published to date, with a median network signal-to-noise ratio of $36.0$, GW241011 furthermore yields stringent constraints on the Kerr nature of black holes, the multipolar structure of gravitational-wave generation, and the existence of ultralight bosons within the mass range $10^{-13}$--$10^{-12}$ eV.",
      "pdf_url": "https://arxiv.org/pdf/2510.26931.pdf",
      "published": "2025-11-04T01:31:37.952151",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.27022",
      "title": "Direct multi-model dark-matter search with gravitational-wave interferometers using data from the first part of the fourth LIGO-Virgo-KAGRA observing run",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration"
      ],
      "abstract": "Direct multi-model dark-matter search with gravitational-wave interferometers using data from the first part of the fourth LIGO-Virgo-KAGRA observing run The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration 10 pages, 1 figure (+1 figure in appendix) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational-wave detectors can probe the existence of dark matter with exquisite sensitivity. Here, we perform a search for three kinds of dark matter -- dilatons (spin-0), dark photons (spin-1) and tensor bosons (spin-2) -- using three independent methods on the first part of the most recent data from the fourth observing run of LIGO--Virgo--KAGRA. Each form of dark matter could have interacted with different standard-model particles in the instruments, causing unique differential strains on the interferometers. While we do not find any evidence for a signal, we place the most stringent upper limits to-date on each of these models. For scalars with masses between $[4\\times 10^{-14},1.5\\times 10^{-13}]$ eV that couple to photons or electrons, our constraints improve upon those from the third observing run by one order of magnitude, with the tightest limit of $\\sim 10^{-20}\\,\\text{GeV}^{-1}$ at a mass of $\\sim2\\times 10^{-13}\\text{ eV}$. For vectors with masses between $[7\\times 10^{-13},8.47\\times 10^{-12}]$ eV that couple to baryons, our constraints supersede those from MICROSCOPE and Eöt-Wash by one to two orders of magnitude, reaching a minimum of $\\sim 5\\times 10^{-24}$ at a mass of $\\sim 10^{-12}$ eV. For tensors with masses of $[4\\times 10^{-14},8.47\\times 10^{-12}]$ eV (the full mass range analyzed) that couple via a Yukawa interaction, our constraints surpass those from fifth-force experiments by four to five orders of magnitude, achieving a limit as low as $\\sim 8\\times 10^{-9}$ at $\\sim2\\times 10^{-13}$ eV. Our results show that gravitational-wave interferometers have become frontiers for new physics and laboratories for direct multi-model dark-matter detection.",
      "pdf_url": "https://arxiv.org/pdf/2510.27022.pdf",
      "published": "2025-11-04T01:31:37.952810",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.22994",
      "title": "Dynamical Love numbers of black holes: Theory and gravitational waveforms",
      "authors": [
        "Sumanta Chakraborty",
        "Valerio De Luca",
        "Leonardo Gualtieri",
        "Paolo Pani"
      ],
      "abstract": "Dynamical Love numbers of black holes: Theory and gravitational waveforms Sumanta Chakraborty, Valerio De Luca, Leonardo Gualtieri, Paolo Pani 17 pages, 1 figure, v2: matching version published in PRD General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) In General Relativity, the static tidal Love numbers of black holes vanish identically. Whether this remains true for time-dependent tidal fields -- i.e., in the case of dynamical tidal Love numbers -- is an open question, complicated by subtle issues in the definition and computation of the tidal response at finite frequency. In this work, we analyze the dynamical tidal perturbations of a Schwarzschild black hole to quadratic order in the tidal frequency. By employing the Teukolsky formalism in advanced null coordinates, which are regular at the horizon, we obtain a particularly clean perturbative scheme. Furthermore, we introduce a response function based on the full solution of the perturbation equation which does not depend on any arbitrary constant. Our analysis recovers known results for the dissipative response at linear order and the logarithmic running at quadratic order, associated with scale dependence in the effective theory. In addition, we find a finite, nonvanishing conservative correction at second order in frequency, thereby possibly demonstrating a genuine dynamical deformation of the black hole geometry. Although removing any ambiguity in the dynamical tidal response would require a matching with some gauge-invariant coefficient, we assess the impact of these effects on the gravitational-wave phase. These contributions enter at eighth post-Newtonian order, and can be expressed in terms of generic $\\mathcal{O}(1)$ coefficients, which have to be matched to the perturbative result. Regardless of the matching ambiguities, we argue that such corrections are too small to be observable even with future-generation gravitational wave detectors. Moreover, the corresponding phase shifts are degenerate with unknown point-particle contributions entering at the same post-Newtonian order.",
      "pdf_url": "https://arxiv.org/pdf/2507.22994.pdf",
      "published": "2025-11-04T01:31:37.954663",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.27579",
      "title": "String-induced vacuum decay",
      "authors": [
        "Aleksandr Chatrchyan",
        "Florian Niedermann",
        "Phoebe Richman-Taylor"
      ],
      "abstract": "Aleksandr Chatrchyan, Florian Niedermann, Phoebe Richman-Taylor Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) False vacuum decay typically proceeds via the nucleation of spherical bubbles of true vacuum, described by $O(4)$ symmetric field configurations in Euclidean time. In this work, we investigate how the presence of cosmic strings can catalyze the decay process. To this end, we consider a complex scalar field charged under a global or local $U(1)$ symmetry. Assuming a non-trivial vacuum manifold, realizable for example in a simple sextic potential, we derive relativistic bounce solutions with $O(2) \\times O(2)$ symmetry, corresponding to elongated bubbles seeded by a cosmic string of the same scalar field. Building up on earlier results in the literature, we identify the region of parameter space where vacuum decay predominantly proceeds via this alternative channel, thereby providing an explicit mechanism for the quantum decay of cosmic strings. Finally, we present an initial discussion of the gravitational wave signal associated with this type of vacuum decay and its possible connection to the recently observed stochastic signal in pulsar timing arrays.",
      "pdf_url": "https://arxiv.org/pdf/2510.27579.pdf",
      "published": "2025-11-04T01:31:38.077794",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.27586",
      "title": "Production of Gravitational Waves from Preheating and Tachyonic Instabilities",
      "authors": [
        "Khursid Alam",
        "Koushik Dutta",
        "Ahamadullah Khan"
      ],
      "abstract": "Production of Gravitational Waves from Preheating and Tachyonic Instabilities Khursid Alam, Koushik Dutta, Ahamadullah Khan Cosmology and Nongalactic Astrophysics (astro-ph.CO) We analyze GW production during preheating for an $\\alpha$-attractor potential terminating in the positive-curvature regime, with energy transfer via $\\phi\\chi^{2}$. Linear Floquet analysis and nonlinear simulations show that $\\phi$ fluctuations grow by parametric resonance, while $\\chi$ undergoes tachyonic bursts. The GW spectrum features two peaks: a dominant low-frequency peak from the parametric channel and a subdominant high-frequency peak from the tachyonic channel. Redshifted to today, the peak reaches $h^{2}\\Omega_{\\rm GW}^{(0)} \\sim 10^{-11}$ at $f^{(0)}_{p} \\sim 10^{7}$ Hz. This multi-peak structure is a characteristic imprint of trilinear preheating in $\\alpha$-attractors.",
      "pdf_url": "https://arxiv.org/pdf/2510.27586.pdf",
      "published": "2025-11-04T01:31:38.077952",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.27691",
      "title": "WallGo investigates: Theoretical uncertainties in the bubble wall velocity",
      "authors": [
        "Jorinde van de Vis",
        "Philipp Schicho",
        "Lauri Niemi",
        "Benoit Laurent",
        "Joonas Hirvonen",
        "Oliver Gould"
      ],
      "abstract": "WallGo investigates: Theoretical uncertainties in the bubble wall velocity Jorinde van de Vis, Philipp Schicho, Lauri Niemi, Benoit Laurent, Joonas Hirvonen, Oliver Gould High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We examine theoretical uncertainties in state-of-the-art calculations of the bubble wall velocity during first-order cosmological phase transitions. By utilising the software WallGo for two extensions of the Standard Model, we find several $\\mathcal{O}(1)$ uncertainties arising from the number of particles taken out of equilibrium, the logarithmically and power enhanced collision integrals, the treatment of thermal masses, the nucleation temperature, the $\\tanh$ ansatz, and the perturbative order of the effective potential. However, we show that the linearisation of the Boltzmann equations is generally a good approximation with much smaller associated errors. We further clarify the limitations of the quasiparticle approximation in regions with negative mass squared. This study provides a detailed uncertainty budget and highlights where future efforts should be directed to improve the reliability of wall velocity and hence gravitational wave predictions.",
      "pdf_url": "https://arxiv.org/pdf/2510.27691.pdf",
      "published": "2025-11-04T01:31:38.080627",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.26767",
      "title": "Unbiased Primordial Gravitational Wave Inference from the CMB with SMICA",
      "authors": [
        "Alexander Steier",
        "Shamik Ghosh",
        "Jacques Delabrouille"
      ],
      "abstract": "Unbiased Primordial Gravitational Wave Inference from the CMB with SMICA Alexander Steier, Shamik Ghosh, Jacques Delabrouille 17 pages, 9 figures, submitted to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) The detection of primordial gravitational waves in Cosmic Microwave Background B-mode polarization observations requires accurate and robust subtraction of astrophysical contamination. We show, using a blind Spectral Matching Independent Component Analysis, that it is possible to infer unbiased estimates of the primordial B-mode signal from ground-based observations of a small patch of sky even for highly complex foreground contamination. This work, originally performed in the context of configuration studies for a future CMB-S4 observatory, is highly relevant for the analysis of observations by the current generation of CMB experiments.",
      "pdf_url": "https://arxiv.org/pdf/2510.26767.pdf",
      "published": "2025-11-04T01:31:38.100938",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    }
  ]
}