{
  "date": "2025-10-18",
  "crawl_timestamp": "2025-10-18T01:30:46.215428",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 185,
    "total_gw_papers": 16,
    "by_category": {
      "gr-qc": {
        "total": 34,
        "gw_related": 6
      },
      "astro-ph": {
        "total": 132,
        "gw_related": 10
      }
    }
  },
  "crawl_verification": {
    "total_expected": 255,
    "total_actual": 255,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 56,
        "actual_crawled": 56,
        "page_source_info": "Total of 56 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 41,
        "actual_crawled": 41,
        "page_source_info": "Total of 41 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 40,
        "actual_crawled": 40,
        "page_source_info": "Total of 40 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 49,
        "actual_crawled": 49,
        "page_source_info": "Total of 49 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 29,
        "actual_crawled": 29,
        "page_source_info": "Total of 29 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 22,
        "actual_crawled": 22,
        "page_source_info": "Total of 22 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 18,
        "actual_crawled": 18,
        "page_source_info": "Total of 18 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.13954",
      "title": "The quasinormal mode content of binary black hole ringdown",
      "authors": [
        "Richard Dyer",
        "Christopher J. Moore"
      ],
      "abstract": "The quasinormal mode content of binary black hole ringdown Richard Dyer, Christopher J. Moore Main text: 5 pages, 2 figures. Supplemental material: 2 pages General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We present a fully Bayesian, data-driven framework for identifying quasinormal modes in high-accuracy Cauchy-Characteristic Evolution (CCE) gravitational waveforms. Applying this to a public catalog, we identify QNM overtones, retrograde modes, and nonlinear modes up to cubic order in the ringdown. The ringdown mode content is tabulated across a wide range of start times for all available simulations, providing a systematic reference for theoretical and observational studies. We also search for late-time power-law tails, which are, as expected, absent from the CCE waveforms.",
      "pdf_url": "https://arxiv.org/pdf/2510.13954.pdf",
      "published": "2025-10-18T01:30:45.433413",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13957",
      "title": "Resonant Loop Interferometers for High-Frequency Gravitational Waves",
      "authors": [
        "Jan Heisig"
      ],
      "abstract": "Resonant Loop Interferometers for High-Frequency Gravitational Waves Jan Heisig 4 pages, plus references and appendix General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) Gravitational waves at kilohertz and higher frequencies offer a unique probe of the early Universe at temperatures well beyond the reach of the cosmic microwave background, corresponding to energy scales $\\gtrsim 10^9$ GeV. Existing detector concepts fall many orders of magnitude short of the big-bang nucleosynthesis (BBN) bound on the stochastic background in this regime. We propose a new interferometric architecture based on closed optical loops, in which the gravitational-wave-induced phase shift accumulates coherently over many traversals. This produces sharp, narrowband resonances whose predictable comb structure provides a distinct experimental signature. For square or triangular loops with parameters compatible with the Einstein Telescope infrastructure, and finesse values of order 500, we project sensitivity that approaches and even surpasses the BBN bound up to tens of kilohertz after one year of integration. Such loop interferometers thus open a realistic and distinctive path toward exploring high-frequency stochastic gravitational-wave backgrounds.",
      "pdf_url": "https://arxiv.org/pdf/2510.13957.pdf",
      "published": "2025-10-18T01:30:45.433606",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13958",
      "title": "Transition-to-plunge self-force waveforms with a spinning primary",
      "authors": [
        "Loïc Honet",
        "Lorenzo Küchler",
        "Adam Pound",
        "Geoffrey Compère"
      ],
      "abstract": "Transition-to-plunge self-force waveforms with a spinning primary Loïc Honet, Lorenzo Küchler, Adam Pound, Geoffrey Compère General Relativity and Quantum Cosmology (gr-qc) With the upcoming third-generation gravitational-wave detectors comes the need to build complete, faithful, and fast waveform models for asymmetric-mass-ratio compact binaries. Most efforts within the self-force community have focused on modeling these binaries' inspiral regime, but for ground-based detectors the systems' final merger can represent the dominant part of the signal. Recent work by three of us has extended the multiscale self-force framework through the transition-to-plunge and merger-ringdown regimes for nonspinning binaries. In this paper, we generalize the next-to-next-to-leading-order transition-to-plunge waveform model to include the spin of the primary black hole. We also improve the construction of composite inspiral-transition waveform models by performing a change of variables on the binary's mechanical phase space during the transition to plunge. We provide detailed discussions of our numerical implementation and comparisons with numerical relativity simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.13958.pdf",
      "published": "2025-10-18T01:30:45.433797",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13963",
      "title": "$\\texttt{GR-Athena++}$ Simulations of Spinning Binary Black Hole Mergers",
      "authors": [
        "Estuti Shukla",
        "Alireza Rashti",
        "Rossella Gamba",
        "David Radice",
        "Koustav Chandra"
      ],
      "abstract": "$\\texttt{GR-Athena++}$ Simulations of Spinning Binary Black Hole Mergers Estuti Shukla, Alireza Rashti, Rossella Gamba, David Radice, Koustav Chandra General Relativity and Quantum Cosmology (gr-qc) We present the second release of the $\\texttt{GR-Athena++}$ waveform catalog, comprising four new quasi-circular, non-precessing, spinning binary black hole simulations. These simulations are performed at high resolutions and represent a step toward generating high-fidelity gravitational waveforms that can eventually meet the accuracy requirements of upcoming next-generation detectors, including LISA, Cosmic Explorer, and Einstein Telescope. Gravitational waves are extracted at future null infinity ( $\\mathscr{I}^{+}$) using both Cauchy characteristic extraction and finite-radius extraction. For each simulation, we provide strain data across multiple resolutions and analyze waveform accuracy via convergence studies and self-mismatch analyses. The absolute phase and relative amplitude differences reach their largest values near the merger, while the smallest errors are of order $\\mathscr{O}(10^{-2})$ and $\\mathscr{O}(10^{-3})$, respectively. A self-mismatch analysis of the dominant $(2,2)$ mode yields mismatches between $\\mathscr{O}(10^{-5})$ and $\\mathscr{O}(10^{-7})$ for a total binary mass of $10^{6}$ $M_{\\odot}$ over the frequency range $[0.002, 0.1]$ Hz using LISA noise curve. All waveforms are publicly available via $\\texttt{ScholarSphere}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.13963.pdf",
      "published": "2025-10-18T01:30:45.434005",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.14291",
      "title": "Glitch noise classification in KAGRA O3GK observing data using unsupervised machine learning",
      "authors": [
        "Shoichi Oshino",
        "Yusuke Sakai",
        "Marco Meyer-Conde",
        "Takashi Uchiyama",
        "Yousuke Itoh",
        "Yutaka Shikano",
        "Yoshikazu Terada",
        "Hirotaka Takahashi"
      ],
      "abstract": "Glitch noise classification in KAGRA O3GK observing data using unsupervised machine learning Shoichi Oshino, Yusuke Sakai, Marco Meyer-Conde, Takashi Uchiyama, Yousuke Itoh, Yutaka Shikano, Yoshikazu Terada, Hirotaka Takahashi 9 pages, 7 figures, accepted to Physics Letters B General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Gravitational wave interferometers are disrupted by various types of nonstationary noise, referred to as glitch noise, that affect data analysis and interferometer sensitivity. The accurate identification and classification of glitch noise are essential for improving the reliability of gravitational wave observations. In this study, we demonstrated the effectiveness of unsupervised machine learning for classifying images with nonstationary noise in the KAGRA O3GK data. Using a variational autoencoder (VAE) combined with spectral clustering, we identified eight distinct glitch noise categories. The latent variables obtained from VAE were dimensionally compressed, visualized in three-dimensional space, and classified using spectral clustering to better understand the glitch noise characteristics of KAGRA during the O3GK period. Our results highlight the potential of unsupervised learning for efficient glitch noise classification, which may in turn potentially facilitate interferometer upgrades and the development of future third-generation gravitational wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2510.14291.pdf",
      "published": "2025-10-18T01:30:45.435164",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.08699",
      "title": "Inferring cosmological parameters from galaxy and dark sirens cross-correlation",
      "authors": [
        "Giona Sala",
        "Alessandro Cuoco",
        "Julien Lesgourgues",
        "Kostantinos-Rafail Revis",
        "Lorenzo Valbusa Dall'Armi",
        "Santiago Casas"
      ],
      "abstract": "Inferring cosmological parameters from galaxy and dark sirens cross-correlation Giona Sala, Alessandro Cuoco, Julien Lesgourgues, Kostantinos-Rafail Revis, Lorenzo Valbusa Dall'Armi, Santiago Casas 31 pages, 12 figures, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The number of observed gravitational wave (GW) events is growing fast thanks to rapidly improving detector sensitivities. GWs from compact binary coalescences like Black Holes or Neutron Stars behave like standard sirens and can be used as cosmological probes. To this aim, generally, the observation of an electromagnetic counterpart and the measurement of the redshift are needed. However, even when those are not available, it is still possible to exploit these \"dark sirens\" via statistical methods. In this work, we explore a method that exploits the information contained in the cross-correlation of samples of GW events with matter over-density tracers like galaxy catalogues. Contrary to other currently employed dark-sirens methods, this approach does not suffer from systematic errors related to the incompleteness of the galaxy catalogue. To further enhance the technique, we implement tomography in redshift space for the galaxy catalogue and luminosity distance space for the GWs. We simulate future data collected by the array of currently existing detectors, namely LIGO, Virgo, and Kagra, as well as planned third-generation ones such as the Einstein Telescope and Cosmic Explorers. We cross-correlate these data with those from upcoming photometric galaxy surveys such as Euclid. We perform a sensitivity forecast employing a full-likelihood approach and explore the parameter space with Monte Carlo Markov Chains. We find that with this method, third-generation detectors will be able to determine the Hubble constant $H_0$ with an error of only 0.7%, which is enough to provide decisive information to shed light on the Hubble tension. Furthermore, for the other cosmological parameters, we find that the GWs and galaxy surveys information are highly complementary, and the use of both significantly improves the ability to constrain the underlying cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2510.08699.pdf",
      "published": "2025-10-18T01:30:45.436409",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.14850",
      "title": "General-relativistic radiation magnetohydrodynamics simulations of binary neutron star mergers: The influence of spin on the multi-messenger picture",
      "authors": [
        "Anna Neuweiler",
        "Henrique Gieg",
        "Henrik Rose",
        "Hauke Koehn",
        "Ivan Markin",
        "Federico Schianchi",
        "Liam Brodie",
        "Alexander Haber",
        "Vsevolod Nedora",
        "Mattia Bulla",
        "Tim Dietrich"
      ],
      "abstract": "General-relativistic radiation magnetohydrodynamics simulations of binary neutron star mergers: The influence of spin on the multi-messenger picture Anna Neuweiler, Henrique Gieg, Henrik Rose, Hauke Koehn, Ivan Markin, Federico Schianchi, Liam Brodie, Alexander Haber, Vsevolod Nedora, Mattia Bulla, Tim Dietrich High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The rich phenomenology of binary neutron star mergers offers a unique opportunity to test general relativity, investigate matter at supranuclear densities, and learn more about the origin of heavy elements. As multi-messenger sources, they emit both gravitational waves and electromagnetic radiation across several frequency bands. The interpretation of these signals relies heavily on accurate numerical-relativity simulations that incorporate the relevant microphysical processes. Using the latest updates of the BAM code, we perform general-relativistic radiation magnetohydrodynamic simulations of binary neutron star mergers with two different spin configurations. We adopt a state-of-the-art equation of state based on relativistic mean-field theory developed for dense matter in neutron star mergers. To capture both dynamical ejecta and secular outflows from magnetic and neutrino-driven winds, we evolve the systems up to $\\sim 100\\ \\rm ms$ after the merger at considerably high resolution with a grid spacing of $\\Delta x \\approx 93\\ \\rm m$ across the neutron stars. Our results show that the non-spinning configuration undergoes a more violent merger, producing more ejecta with lower electron fraction and higher velocities, while the spinning configuration forms a larger disk due to its higher angular momentum. Although the initial magnetic field amplification within $\\lesssim 10\\ \\rm ms$ after merger is similar in both systems, the non-spinning system reaches stronger magnetic fields and higher energies at later times. For a detailed view of the multi-messenger observables, we extract the gravitational-wave signal and compute nucleosynthesis yields, the expected kilonova and afterglow light curves from our ejecta profiles.",
      "pdf_url": "https://arxiv.org/pdf/2510.14850.pdf",
      "published": "2025-10-18T01:30:45.438213",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.14953",
      "title": "Dark Matter Subhalos and Higher Order Catastrophes in Gravitational Wave Lensing",
      "authors": [
        "Luka Vujeva",
        "Jose María Ezquiaga",
        "Daniel Gilman",
        "Srashti Goyal",
        "Miguel Zumalacárregui"
      ],
      "abstract": "Dark Matter Subhalos and Higher Order Catastrophes in Gravitational Wave Lensing Luka Vujeva, Jose María Ezquiaga, Daniel Gilman, Srashti Goyal, Miguel Zumalacárregui Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) Gravitational lensing is an invaluable probe of the nature of dark matter, and the structures it forms. Lensed gravitational waves in particular allow for unparalleled sensitivity to small scale structures within the lenses, due to the precise time resolution in combination with the continuous monitoring of the entire sky. In this work, we show two distinct ways of using strongly lensed gravitational waves to identify the presence of dark matter subhalos: \\emph{i)} through higher order caustics generating high relative magnification ($\\mu_r > 2$), short time delay image pairs that break the caustic universality relations of single dark matter halos, which occur for $\\sim 1-10$ percent of strongly lensed events in our cold dark matter models, and \\emph{ii)} through the presence of more than three highly magnified images, which occur for $\\sim 0.01-1$ percent of the same simulated events. We find that these results are highly sensitive to the concentrations of subhalos in our simulations, and more mildly to their number densities. The presence of low-mass subhalos increases the probability of observing wave-optics lensing in lensed gravitational waves, which is studied by solving the diffraction integral with the stationary phase approximation, as well as numerically. We also report distinct quantitative and qualitative differences in the distributions of relative magnifications and time delays for subhalo populations with increased number densities or concentrations. With the upcoming detection of strongly lensed events by ground- and space- based detectors, comparisons against these simulated distributions will provide insight into the nature of dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2510.14953.pdf",
      "published": "2025-10-18T01:30:45.438673",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.12929",
      "title": "Quantum Computing Tools for Fast Detection of Gravitational Waves in the Context of LISA Space Mission",
      "authors": [
        "Maria-Catalina Isfan",
        "Laurentiu-Ioan Caramete",
        "Ana Caramete",
        "Daniel Tonoiu",
        "Alexandru Nicolin-Żaczek"
      ],
      "abstract": "Quantum Computing Tools for Fast Detection of Gravitational Waves in the Context of LISA Space Mission Maria-Catalina Isfan, Laurentiu-Ioan Caramete, Ana Caramete, Daniel Tonoiu, Alexandru Nicolin-Żaczek Submitted to Classical and Quantum Gravity v2: corrected typo in axis label in Fig.4 v3: corrected typo in author name General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Data Analysis, Statistics and Probability (physics.data-an) The field of gravitational wave (GW) detection is progressing rapidly, with several next-generation observatories on the horizon, including LISA. GW data is challenging to analyze due to highly variable signals shaped by source properties and the presence of complex noise. These factors emphasize the need for robust, advanced analysis tools. In this context, we have initiated the development of a low-latency GW detection pipeline based on quantum neural networks (QNNs). Previously, we demonstrated that QNNs can recognize GWs simulated using post-Newtonian approximations in the Newtonian limit. We then extended this work using data from the LISA Consortium, training QNNs to distinguish between noisy GW signals and pure noise. Currently, we are evaluating performance on the Sangria LISA Data Challenge dataset and comparing it against classical methods. Our results show that QNNs can reliably distinguish GW signals embedded in noise, achieving classification accuracies above 98\\%. Notably, our QNN identified 5 out of 6 mergers in the Sangria blind dataset. The remaining merger, characterized by the lowest amplitude, highlights an area for future improvement in model sensitivity. This can potentially be addressed using additional mock training datasets, which we are preparing, and by testing different QNN architectures and ansatzes.",
      "pdf_url": "https://arxiv.org/pdf/2509.12929.pdf",
      "published": "2025-10-18T01:30:45.441100",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2407.15117",
      "title": "Profiling stellar environments of gravitational wave sources",
      "authors": [
        "Avinash Tiwari",
        "Aditya Vijaykumar",
        "Shasvath J. Kapadia",
        "Sourav Chatterjee",
        "Giacomo Fragione"
      ],
      "abstract": "Profiling stellar environments of gravitational wave sources Avinash Tiwari, Aditya Vijaykumar, Shasvath J. Kapadia, Sourav Chatterjee, Giacomo Fragione Phys. Rev. D 112, 084034 - Published 14 October, 2025 High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Gravitational waves (GWs) have enabled direct detections of compact binary coalescences (CBCs). However, their poor sky localisation and the typical lack of observable electromagnetic (EM) counterparts make it difficult to confidently identify their hosts, and study the environments that nurture their evolution. In this work, we show that $\\textit{detailed}$ information of the host environment (e.g. the mass and steepness of the host potential) can be directly inferred by measuring the kinematic parameters (acceleration and its time-derivatives) of the binary's center of mass using GWs alone, without requiring an EM counterpart. We consider CBCs in various realistic environments such as globular clusters, nuclear star clusters, and active galactic nuclei disks to demonstrate how orbit and environment parameters can be extracted for CBCs detectable by ground- and space-based observatories, including the LIGO detector at A+ sensitivity, Einstein Telescope of the XG network, LISA, and DECIGO, $\\textit{on a single-event basis}$. These constraints on host stellar environments promise to shed light on our understanding of how CBCs form, evolve, and merge.",
      "pdf_url": "https://arxiv.org/pdf/2407.15117.pdf",
      "published": "2025-10-18T01:30:45.441926",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2501.02096",
      "title": "Effects of Galaxy Cluster Structure on Lensed Gravitational Waves",
      "authors": [
        "Luka Vujeva",
        "Jose María Ezquiaga",
        "Rico K. L. Lo",
        "Juno C. L. Chan"
      ],
      "abstract": "Effects of Galaxy Cluster Structure on Lensed Gravitational Waves Luka Vujeva, Jose María Ezquiaga, Rico K. L. Lo, Juno C. L. Chan Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Strong gravitational lenses come in many forms, but are typically divided into two populations: galaxies, and groups and clusters of galaxies. The largest objects in the Universe (i.e. galaxy clusters) are highly irregular and composed of many components due to a history of (or active) hierarchical mergers. In this work, we analyze the discrepancies in the observables of strongly lensed gravitational wave transients in both scenarios, namely relative magnifications, time delays, and image multiplicities. We compare the detection rates between the single spherical dark matter halo models found in the literature, and publicly available state-of-the-art cluster lens models. We find there to be approximately an order of magnitude fewer detection of strongly lensed transients in the realistic model case, likely caused by their loss of overall strong lensing optical depth. We also report detection rates in the weak lensing or single-image regime. Additionally, we find a systemic shift towards lower time delays between the brightest image pairs in the cases of the realistic models, as well as higher fractions of positive versus negative parity images, which was previously reported in the literature. This deviation in the joint relative magnification factor-time delay distribution will hinder the feasibility of the reconstruction of cluster-scale lenses through gravitational wave transients alone, but can still provide a lower limit on the lens mass.",
      "pdf_url": "https://arxiv.org/pdf/2501.02096.pdf",
      "published": "2025-10-18T01:30:45.442344",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13997",
      "title": "Dynamic SBI: Round-free Sequential Simulation-Based Inference with Adaptive Datasets",
      "authors": [
        "Huifang Lyu",
        "James Alvey",
        "Noemi Anau Montel",
        "Mauro Pieroni",
        "Christoph Weniger"
      ],
      "abstract": "Dynamic SBI: Round-free Sequential Simulation-Based Inference with Adaptive Datasets Huifang Lyu, James Alvey, Noemi Anau Montel, Mauro Pieroni, Christoph Weniger 15 pages, 5 figures, software available at: this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG); Machine Learning (stat.ML) Simulation-based inference (SBI) is emerging as a new statistical paradigm for addressing complex scientific inference problems. By leveraging the representational power of deep neural networks, SBI can extract the most informative simulation features for the parameters of interest. Sequential SBI methods extend this approach by iteratively steering the simulation process towards the most relevant regions of parameter space. This is typically implemented through an algorithmic structure, in which simulation and network training alternate over multiple rounds. This strategy is particularly well suited for high-precision inference in high-dimensional settings, which are commonplace in physics applications with growing data volumes and increasing model fidelity. Here, we introduce dynamic SBI, which implements the core ideas of sequential methods in a round-free, asynchronous, and highly parallelisable manner. At its core is an adaptive dataset that is iteratively transformed during inference to resemble the target observation. Simulation and training proceed in parallel: trained networks are used both to filter out simulations incompatible with the data and to propose new, more promising ones. Compared to round-based sequential methods, this asynchronous structure can significantly reduce simulation costs and training overhead. We demonstrate that dynamic SBI achieves significant improvements in simulation and training efficiency while maintaining inference performance. We further validate our framework on two challenging astrophysical inference tasks: characterising the stochastic gravitational wave background and analysing strong gravitational lensing systems. Overall, this work presents a flexible and efficient new paradigm for sequential SBI.",
      "pdf_url": "https://arxiv.org/pdf/2510.13997.pdf",
      "published": "2025-10-18T01:30:45.558538",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13955",
      "title": "Radiation Magnetohydrodynamic Simulation of sub-Eddington Circumbinary Disk in a 10:1 Massive Black Hole Binary",
      "authors": [
        "Vishal Tiwari , Chi-Ho Chan , Tamara Bogdanović , Yan-Fei Jiang , Shane W. Davis Georgia Institute of Technology, Center for Computational Astrophysics, Flatiron Institute University of Virginia)"
      ],
      "abstract": "Radiation Magnetohydrodynamic Simulation of sub-Eddington Circumbinary Disk in a 10:1 Massive Black Hole Binary Vishal Tiwari (1), Chi-Ho Chan (1), Tamara Bogdanović (1), Yan-Fei Jiang (2), Shane W. Davis (3) ((1) Georgia Institute of Technology, (2) Center for Computational Astrophysics, Flatiron Institute (3) University of Virginia) 17 pages, 8 figures. Submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present a global three-dimensional radiation magnetohydrodynamic (RMHD) simulation of a circumbinary disk (CBD) around a massive black hole binary (MBHB) with a total mass $2 \\times 10^7\\,M_{\\odot}$ and mass ratio $0.1$, separated by $100\\, GM_{\\rm tot}/c^2$. The inclusion of radiation makes the disk thinner, denser, less eccentric at the inner edge, and more filamentary when compared to an otherwise identical locally isothermal MHD disk. The RMHD disk has accretion rate $\\sim 0.23\\,\\dot{M}_{\\mathrm{Edd}}$ and produces thermal emission peaking in the near-UV/optical with a luminosity of $\\sim 1\\, \\% L_{\\rm {Edd }}$. Compared with an equal-mass binary with the same total mass, the thermal emission of the CBD around the unequal-mass binary is several orders of magnitude brighter and much more variable at far-UV/soft X-rays frequencies. Similarly, we find that the light curve associated with the $0.1$ mass ratio binary exhibits dominant periodicity corresponding to 2 binary orbits, compared to the equal-mass binary that shows periodicity at 2.5-5 binary orbits. Our results highlight the importance of radiation for the structure and observational properties of MBHB circumbinary disks and have implications for detecting electromagnetic counterparts to LISA gravitational wave precursors and for the heavier binaries targeted by the Pulsar Timing Arrays.",
      "pdf_url": "https://arxiv.org/pdf/2510.13955.pdf",
      "published": "2025-10-18T01:30:45.746242",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.14363",
      "title": "Is GW231123 a hierarchical merger?",
      "authors": [
        "Lachlan Passenger",
        "Sharan Banagiri",
        "Eric Thrane",
        "Paul D. Lasky",
        "Angela Borchers",
        "Maya Fishbach",
        "Claire S. Ye"
      ],
      "abstract": "Is GW231123 a hierarchical merger? Lachlan Passenger, Sharan Banagiri, Eric Thrane, Paul D. Lasky, Angela Borchers, Maya Fishbach, Claire S. Ye High Energy Astrophysical Phenomena (astro-ph.HE) The binary black hole merger GW231123 is both the most massive gravitational-wave event observed and has the highest component spins measured to date. The dimensionless spins of the more massive (primary) and less massive (secondary) black holes are measured to be $\\chi_1 = 0.90^{+0.10}_{-0.19}$ and $\\chi_2 = 0.80^{+0.20}_{-0.51}$ ($90\\%$ credible intervals), respectively. Its large mass and extremal spins are challenging to explain through standard binary stellar physics, though a flurry of hypothetical scenarios have been proposed. Hierarchical assembly -- i.e., mergers of black holes that are themselves formed from previous generations of mergers -- is generally a promising way to explain massive and rapidly spinning black holes. Here, we investigate the possibility that both GW231123 was assembled hierarchically in a dense star cluster as the merger of two second-generation black holes. Taking the inferred spin values at face value, we find that it is possible, though unlikely ($p\\lesssim 1\\%$), that a compact binary with both component spins like GW231123 could form in a cluster from hierarchical assembly.",
      "pdf_url": "https://arxiv.org/pdf/2510.14363.pdf",
      "published": "2025-10-18T01:30:45.747451",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.14613",
      "title": "The multimessenger view of Pulsar Timing Array black holes with the Horizon-AGN simulation",
      "authors": [
        "Hippolyte Quelquejay Leclere",
        "Kunyang Li",
        "Marta Volonteri",
        "Stanislav Babak",
        "Ricarda S. Beckmann",
        "Yohan Dubois",
        "Clotilde Laigle",
        "Natalie A. Webb"
      ],
      "abstract": "The multimessenger view of Pulsar Timing Array black holes with the Horizon-AGN simulation Hippolyte Quelquejay Leclere, Kunyang Li, Marta Volonteri, Stanislav Babak, Ricarda S. Beckmann, Yohan Dubois, Clotilde Laigle, Natalie A. Webb 25 pages, 16 figures, submitted to A&A Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We use the Horizon-AGN cosmological simulation to study the properties of supermassive black hole binaries (MBHBs) contributing most to the gravitational wave background (GWB) signal expected in the pulsar timing array (PTA) band. We develop a pipeline to generate realistic populations of MBHBs, allowing us to estimate both the characteristic strain and GWB time series observable by PTA experiments. We identify potential continuous wave (CW) candidates standing above the background noise, using toy PTA sensitivities representing the current EPTA and future SKA. We estimate the probability of detecting at least one CW with signal-to-noise ratio $>3$ to be $4\\%$ ($20\\%$) for EPTA (SKA)-like sensitivities, assuming a 10-year baseline. We find the GWB to be dominated by hundreds to thousands of binaries at redshifts in the range $0.05-1$, with chirp masses of $10^{8.5}-10^{9.5}\\, M_\\odot$, hosted mainly in quiescent massive galaxies residing in halos of mass $\\sim 10^{13}\\, M_\\odot$. CW candidates have larger masses, lower redshifts and are found in even more massive halos, typical of galaxy groups and clusters. The majority of these systems would appear as AGN rather than quasars, because of their low Eddington ratios. Nevertheless, CW candidates with $f_{\\rm Edd}>10^{-3}$ can still outshine their hosts, particularly in radio and X-ray bands, suggesting them as the most promising route for identification. Our findings imply that optical and near-infrared searches based on light curve variability are challenging and biased toward more luminous systems. Finally, we highlight important caveats in the common method used to compare PTA observations with theoretical models. We find that GWB spectral inferences used by PTAs could be biased toward shallower slopes and higher amplitudes at $f=1/\\rm yr$, thereby reducing the apparent tension between astrophysical expectations and PTA observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.14613.pdf",
      "published": "2025-10-18T01:30:45.945658",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.14239",
      "title": "Estimation of gravitational wave from solar emerging magnetic flux tube",
      "authors": [
        "Siqi Guan",
        "Shangbin Yang",
        "Xiao Guo"
      ],
      "abstract": "Estimation of gravitational wave from solar emerging magnetic flux tube Siqi Guan, Shangbin Yang, Xiao Guo Accepted by Research in Astron. Astrophys. (RAA) Solar and Stellar Astrophysics (astro-ph.SR) This study investigates the gravitational waves (GWs) generated by the emergence of magnetic flux tubes in the solar convection zone. We focus on the upward buoyancy of magnetic flux tubes, which leads to significant magnetic activity and the formation of active region sunspots. This study adopts parameters representative of a moderate-sized solar active region to estimate the GWs generated by the emergence of magnetic flux tubes. Our results indicate that the GW strain amplitude, achievable through signal superposition and detection at close proximity (e.g., approximately one solar radius from the solar surface), may reach $\\sim$10$^{-29}$. The characteristic GW frequency is estimated at $\\sim$10$^{-5}$ Hz, placing it at the high-frequency end of the sensitivity band of Pulsar Timing Array (PTA) methods. However, the estimated strain amplitudes remain orders of magnitude below the sensitivity thresholds of current and foreseeable gravitational wave detectors. Notably, reducing the cadence $\\Delta t$ of Pulsar Timing Array (PTA) observations to approximately 2 hours ($\\Delta t = 2\\text{hours}$) would raise the maximum detectable frequency to about $5.8 \\times 10^{-5} \\text{Hz}$, thereby encompassing the dominant spectral component of solar activity-related GWs predicted in this study, offering a potential pathway for future detection. Successful detection in the future may help to predict the super solar active region emergence in space weather forecasting.",
      "pdf_url": "https://arxiv.org/pdf/2510.14239.pdf",
      "published": "2025-10-18T01:30:46.037820",
      "updated": null,
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    }
  ]
}