{
  "date": "2025-11-25",
  "crawl_timestamp": "2025-11-25T01:31:37.360490",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 139,
    "total_gw_papers": 15,
    "by_category": {
      "gr-qc": {
        "total": 22,
        "gw_related": 8
      },
      "astro-ph": {
        "total": 104,
        "gw_related": 7
      }
    }
  },
  "crawl_verification": {
    "total_expected": 194,
    "total_actual": 194,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 44,
        "actual_crawled": 44,
        "page_source_info": "Total of 44 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 41,
        "actual_crawled": 41,
        "page_source_info": "Total of 41 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 32,
        "actual_crawled": 32,
        "page_source_info": "Total of 32 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 33,
        "actual_crawled": 33,
        "page_source_info": "Total of 33 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 15,
        "actual_crawled": 15,
        "page_source_info": "Total of 15 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 19,
        "actual_crawled": 19,
        "page_source_info": "Total of 19 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 10,
        "actual_crawled": 10,
        "page_source_info": "Total of 10 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.16748",
      "title": "LISA as a probe of pre-big-bang physics: a nested sampling analysis",
      "authors": [
        "Xoán Vilas Currás",
        "Gianluca Calcagni"
      ],
      "abstract": "LISA as a probe of pre-big-bang physics: a nested sampling analysis Xoán Vilas Currás, Gianluca Calcagni General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Using a nested sampling analysis, we study the gravitational-wave background (GWB) predicted by pre-big-bang cosmology, both in its minimal and non-minimal version. Within the LISA sensitivity range, the GWB signal is a flat or a broken power law, parametrized by four fundamental quantities: the Hubble parameter at the curvature bounce $H_1$, the axion mass $m$, the initial amplitude of the axion field $\\sigma_i$ and the exponent $\\beta$ governing the high-energy growth of the dilaton and the dynamics of the internal dimensions. We determine the posterior distributions of these parameters based on how LISA would detect such signal. Including the galactic and extra-galactic foregrounds in the analysis, the most stringent constraints on $H_1$, $\\sigma_i$ and $\\beta$ are obtained when the signal exhibits a left-bend feature, while for $m$ this happens for a right-bend feature. Relative uncertainties reach $\\Delta H_1/H_1 ,\\,\\Delta m/m \\sim 18\\%$ at $68\\%$ confidence level under favourable conditions. LISA will thus be capable of placing significant constraints on the pre-big-bang model, potentially providing empirical hints of string theory in the case of detection.",
      "pdf_url": "https://arxiv.org/pdf/2511.16748.pdf",
      "published": "2025-11-25T01:31:36.208732",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.16863",
      "title": "All-sky search for continuous gravitational-wave signals from unknown neutron stars in binary systems in the first part of the fourth LIGO-Virgo-KAGRA observing run",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration"
      ],
      "abstract": "All-sky search for continuous gravitational-wave signals from unknown neutron stars in binary systems in the first part of the fourth LIGO-Virgo-KAGRA observing run The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration General Relativity and Quantum Cosmology (gr-qc) We present the results of a blind all-sky search for continuous gravitational-wave signals from neutron stars in binary systems using data from the first part of the fourth observing run (O4a) using LIGO detectors data. Rapidly rotating, non-axisymmetric neutron stars are expected to emit continuous gravitational waves, whose detection would significantly improve our understanding of the galactic neutron star population and matter under extreme conditions, while also providing valuable tests of general relativity. Neutron stars in binary systems likely constitute a substantial fraction of the unobserved galactic population and, due to potential mass accretion, may emit stronger gravitational-wave signals than their isolated counterparts. This search targets signals from neutron stars with frequencies in the 100-350 Hz range, with orbital periods between 7 and 15 days and projected semi-major axes between 5 and 15 light-seconds. The analysis employs the GPU-accelerated fasttracks pipeline. No credible astrophysical signals were identified, and, in the absence of a detection, we report search sensitivity estimates on the population of neutron stars in binary systems in the Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2511.16863.pdf",
      "published": "2025-11-25T01:31:36.209146",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.16879",
      "title": "Accelerating parameter estimation for parameterized tests of general relativity with gravitational-wave observations",
      "authors": [
        "Dhruv Kumar",
        "Ish Gupta",
        "Bangalore Sathyaprakash"
      ],
      "abstract": "Accelerating parameter estimation for parameterized tests of general relativity with gravitational-wave observations Dhruv Kumar, Ish Gupta, Bangalore Sathyaprakash 9 pages + Appendix. 7 figures. 3 tables General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Tests of general relativity (GR) with gravitational waves (GWs) introduce additional deviation parameters in the waveform model. The enlarged parameter space makes inference computationally costly, which has so far limited systematic, large-scale studies that are essential to quantify degeneracies, check effect of waveform systematics, and assess robustness across non-stationary and non-Gaussian noise effects. The need is even sharper for next-generation (XG) observatories where signals are longer, signal-to-noise ratios (SNRs) are higher, and likelihood evaluations increase substantially. We address this by applying relative binning to the TIGER framework for parameterized tests of GR. Relative binning replaces dense frequency evaluations with evaluations on adaptively chosen frequency bins, reducing the cost per likelihood call while preserving posterior accuracy. Using simulated binary black hole signals, we demonstrate unbiased recovery for GR-consistent cases and targeted non-GR deviations, and we map how bin resolution controls accuracy, with fine binning primarily required for the $-1$ post-Newtonian term. A high-SNR simulated signal at next-generation sensitivity further shows accurate recovery with tight posteriors. Applied to GW150914 and GW250114, both single and multi-parameter TIGER analyses finish within a day, yielding deviation bounds consistent with GR at 90\\% credibility and in agreement with previous results. Across analyses, the method reduces wall time by factors of $\\mathcal{O}(10)$ to $\\mathcal{O}(100)$, depending on frequency range and binning, without degrading parameter estimation accuracy.",
      "pdf_url": "https://arxiv.org/pdf/2511.16879.pdf",
      "published": "2025-11-25T01:31:36.209374",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.17341",
      "title": "Implications of GW241011 for rotating exotic compact objects",
      "authors": [
        "N. V. Krishnendu",
        "Tamara Evstafyeva",
        "Aditya Vijaykumar",
        "William E. East",
        "Rimo Das",
        "Sayantani Datta",
        "Nils Siemonsen",
        "Nami Uchikata",
        "Poulami Dutta Roy",
        "Anuradha Gupta",
        "Ish Gupta",
        "Syed U. Naqvi",
        "Manuel Piarulli",
        "Muhammed Saleem",
        "Elise M. Sänger",
        "Pratyusava Baral",
        "Sajad A. Bhat",
        "Thomas A. Callister",
        "Mattia Emma",
        "Carl-Johan Haster"
      ],
      "abstract": "Implications of GW241011 for rotating exotic compact objects N. V. Krishnendu, Tamara Evstafyeva, Aditya Vijaykumar, William E. East, Rimo Das, Sayantani Datta, Nils Siemonsen, Nami Uchikata, Poulami Dutta Roy, Anuradha Gupta, Ish Gupta, Syed U. Naqvi, Manuel Piarulli, Muhammed Saleem, Elise M. Sänger, Pratyusava Baral, Sajad A. Bhat, Thomas A. Callister, Mattia Emma, Carl-Johan Haster 3 figures in the main text, 5 in the Supplementary Material General Relativity and Quantum Cosmology (gr-qc) A number of theoretical proposals have been made for horizonless compact objects with masses and spins similar to those of black holes. While gravitational wave signatures from their mergers can resemble those of black holes, features like the spin-induced quadrupole moment may reveal their distinct nature. Using the tight bounds on the spin-induced quadrupole moment of GW241011, we place gravitational wave constraints on the nature of its primary. We find that large classes of exotic compact objects (including rotating boson stars) cannot explain its nature, however, models of sufficiently large compactness of $C \\gtrsim 0.24$ may still be viable contenders.",
      "pdf_url": "https://arxiv.org/pdf/2511.17341.pdf",
      "published": "2025-11-25T01:31:36.210393",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.17422",
      "title": "A battle of designs: triangular vs. L-shaped detectors and parity violation in the gravitational-wave background",
      "authors": [
        "Hannah Duval",
        "Charles Badger",
        "Mairi Sakellariadou"
      ],
      "abstract": "A battle of designs: triangular vs. L-shaped detectors and parity violation in the gravitational-wave background Hannah Duval, Charles Badger, Mairi Sakellariadou General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We investigate the prospects for detecting a parity-violating gravitational-wave background (GWB) with third-generation ground-based detector networks. We focus on a network consisting of one Einstein Telescope (ET) and two Cosmic Explorer (CE) detectors. In our analysis we vary the ET design, detector orientations, and arm lengths, in order to assess the impact of geometry and scale on detection capabilities. We demonstrate that networks with an L-shaped ET design have stronger parity violation constraining power than networks with a triangular ET design, particularly seen when studying ET designs on their own.",
      "pdf_url": "https://arxiv.org/pdf/2511.17422.pdf",
      "published": "2025-11-25T01:31:36.210752",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.16861",
      "title": "GSpyNetTreeS: a machine learning solution for glitch localization in time and frequency",
      "authors": [
        "Man Leong Chan",
        "Jess McIver",
        "Yannick Lecoeuche",
        "Dhatri Raghunathan",
        "Sofía Álvarez-López",
        "Julian Ding",
        "Annudesh Liyanage",
        "Raymond Ng",
        "Heather Fong"
      ],
      "abstract": "GSpyNetTreeS: a machine learning solution for glitch localization in time and frequency Man Leong Chan, Jess McIver, Yannick Lecoeuche, Dhatri Raghunathan, Sofía Álvarez-López, Julian Ding, Annudesh Liyanage, Raymond Ng, Heather Fong Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Data from ground-based gravitational wave detectors are often contaminated by non-Gaussian instrumental artifacts or detector noise transients. Unbiased source property estimation relies on the ability to correctly identify and characterize these artifacts and remove them if necessary. To this end, the LIGO-Virgo-KAGRA Collaboration has implemented candidate vetting for all significant candidates to identify the presence of artifacts and assess the need for mitigation. The current candidate vetting process requires human experts to identify the frequency ranges and the time windows associated with any data quality issues present. Differences in judgment between human experts may cause inconsistency, making results difficult to reproduce across gravitational wave events. We present GSpyNetTreeS, an extension to GSpyNetTree based on the You Only Look Once algorithm, for the automatic detection, classification, and time-frequency localization of detector noise transients. As a proof of concept, we tested GSpyNetTreeS's performance on the data collected by the LIGO detectors during the third observing run for gravitational waves as well as common detector glitch classes included in GSpyNetTree: Blip, Low frequency blip, Low frequency line and Scratchy. We also demonstrated that GSpyNetTreeS is capable of accurately identifying common glitch classes and capturing the frequency and time information associated with detected detector noise transients, establishing its potential as an automatic event validation tool for LIGO-Virgo-KAGRA's observing runs.",
      "pdf_url": "https://arxiv.org/pdf/2511.16861.pdf",
      "published": "2025-11-25T01:31:36.211410",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.IM",
        "cross_list_from": "astro-ph.IM"
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.17137",
      "title": "Magnetized particle motion and accretion process with shock cone morphology around a decoupled hairy black holes",
      "authors": [
        "G. Mustafa",
        "Faisal Javed",
        "S.K. Maurya",
        "A. Ditta",
        "Orhan Donmez",
        "Tayyab Naseer",
        "Abdelmalek Bouzenada",
        "Farruh Atamurotov"
      ],
      "abstract": "Magnetized particle motion and accretion process with shock cone morphology around a decoupled hairy black holes G. Mustafa, Faisal Javed, S.K. Maurya, A. Ditta, Orhan Donmez, Tayyab Naseer, Abdelmalek Bouzenada, Farruh Atamurotov High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Relativistic accretion onto compact objects such as black holes and neutron stars is one of the most efficient known mechanisms for converting gravitational potential energy into radiation. In the case of rapidly spinning black holes, up to $40\\%$ of the rest-mass energy of accreting matter can be released, far exceeding the efficiency of nuclear fusion. In this work, we investigate magnetized particle motion and relativistic accretion processes around a decoupled hairy black hole via extended geometric deformation. The developed geometry involves two hairy parameters that preserve the horizon structure with the additional feature of the fulfillment of weak energy conditions outside the event horizon. We provide the foundation with necessary formalism for magnetized particle motion around a decoupled black hole. The effective potential and innermost stable circular orbits are then derived, which demonstrate a significant reduction of the radius of the latter quantity under the hairy parameters for the magnetized particle. Afterwards, we obtain exact analytical expressions for radial velocity profiles, mass accretion rates, and a few others which reveal improved energy efficiency and emissivity as compared to the standard black hole. Furthermore, the decoupling parameter shows strong influence on oscillations, accretion presenting fantastic agreement between analytical predictions and numerical simulations, and thus offering noticeable observational signatures for future gravitational wave and X-ray astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2511.17137.pdf",
      "published": "2025-11-25T01:31:36.212248",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2404.09858",
      "title": "Finsler Geometry, Spacetime & Gravity -- From Metrizability of Berwald Spaces to Exact Vacuum Solutions in Finsler Gravity",
      "authors": [
        "Sjors Heefer"
      ],
      "abstract": "Finsler Geometry, Spacetime & Gravity -- From Metrizability of Berwald Spaces to Exact Vacuum Solutions in Finsler Gravity Sjors Heefer PhD thesis. ISBN: 978-90-386-6026-4 General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph); Differential Geometry (math.DG) This PhD dissertation covers a range of topics in Finsler geometry and Finsler gravity, most notably: (i) the characterization of Berwald spaces, (ii) pseudo-Riemann (non-)metrizability of Berwald spaces, (iii) $(\\alpha,\\beta)$-metrics, (iv) exact solutions to Pfeifer and Wohlfarth's vacuum field equation in Finsler gravity, and (v) Finsler gravitational waves and their observational signature. An extended abstract can be found in the dissertation itself.",
      "pdf_url": "https://arxiv.org/pdf/2404.09858.pdf",
      "published": "2025-11-25T01:31:36.213146",
      "updated": null,
      "categories": [
        "gr-qc",
        "math-ph",
        "math.DG"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2410.23839",
      "title": "Hair is complicated: Gravitational waves from stable and unstable boson-star mergers",
      "authors": [
        "Bo-Xuan Ge",
        "Eugene A. Lim",
        "Ulrich Sperhake",
        "Tamara Evstafyeva",
        "Daniela Cors",
        "Eloy de Jong",
        "Robin Croft",
        "Thomas Helfer"
      ],
      "abstract": "Hair is complicated: Gravitational waves from stable and unstable boson-star mergers Bo-Xuan Ge, Eugene A. Lim, Ulrich Sperhake, Tamara Evstafyeva, Daniela Cors, Eloy de Jong, Robin Croft, Thomas Helfer General Relativity and Quantum Cosmology (gr-qc) We explore the gravitational-wave emission from head-on collisions of equal-mass solitonic boson-star binaries from simulations spanning a two-dimensional parameter space, consisting of the central scalar-field amplitude of the stars and the solitonic potential parameter. We report the gravitational-wave energies emitted by boson-star binaries which, due to their combination of moderately high compactness with significant deformability, we often find to be louder by up to an order of magnitude than analogous black-hole collisions. The dependence of the radiated energy on the boson-star parameters exhibits striking needle-sharp features and discontinuous jumps to the value emitted by black-hole binaries. We explain these features in terms of the solitonic potential and the stability properties of the respective individual stars.",
      "pdf_url": "https://arxiv.org/pdf/2410.23839.pdf",
      "published": "2025-11-25T01:31:36.213655",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.24897",
      "title": "Observable signature of magnetic tidal coupling in hierarchical triple systems",
      "authors": [
        "Marta Cocco",
        "Gianluca Grignani",
        "Troels Harmark",
        "Marta Orselli",
        "Davide Panella",
        "Daniele Pica"
      ],
      "abstract": "Observable signature of magnetic tidal coupling in hierarchical triple systems Marta Cocco, Gianluca Grignani, Troels Harmark, Marta Orselli, Davide Panella, Daniele Pica 21 pages, 5 figures. Replacement with minor changes to the text General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Theory (hep-th) We study hierarchical triple systems formed by a compact binary orbiting a supermassive black hole (SMBH), focusing on the role of relativistic magnetic tidal interactions. Extending previous analyses of precession resonances to 0.5 post-Newtonian order, we incorporate quadrupolar magnetic tidal moments, which have no Newtonian counterpart. We find that magnetic tides introduce new resonances absent at lower order, leading to additional eccentricity excitations and significantly modifying the binary's long-term evolution. Numerical solutions of the Lagrange Planetary Equations confirm these analytical predictions and reveal how resonance strength depends on orbital eccentricity and inclination. The resulting dynamics accelerates the binary merger and imprints distinctive signatures on gravitational waves, potentially observable by LISA. Our findings identify magnetic tidal coupling as a novel strong-gravity effect and establish its importance for the resonant dynamics of compact-object binaries near SMBHs.",
      "pdf_url": "https://arxiv.org/pdf/2510.24897.pdf",
      "published": "2025-11-25T01:31:36.214413",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.GA",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2503.16317",
      "title": "Proto-neutron star oscillations including accretion flows",
      "authors": [
        "Dimitra Tseneklidou",
        "Raimon Luna",
        "Pablo Cerdá-Durán",
        "Alejandro Torres-Forné"
      ],
      "abstract": "Proto-neutron star oscillations including accretion flows Dimitra Tseneklidou, Raimon Luna, Pablo Cerdá-Durán, Alejandro Torres-Forné 23 pages, 10 figures, submitted to PRD Phys. Rev. D 112, 103032 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The gravitational wave signature from core-collapse supernovae (CCSNe) is dominated by quadrupolar oscillation modes of the newly born proto-neutron star (PNS), and could be detectable at galactic distances. We have developed a framework for computing the normal oscillation modes of a PNS in general relativity, including, for the first time, the presence of an accretion flow and a surrounding stalled accretion shock. These new ingredients are key to understand PNS oscillation modes, in particular those related to the standing-accretion-shock instability (SASI). Their incorporation is an important step towards accurate PNS asteroseismology. For this purpose, we perform linear and adiabatic perturbations of a spherically symmetric background, in the relativistic Cowling approximation, and cast the resulting equations as an eigenvalue problem. We discretize the eigenvalue problem using collocation Chebyshev spectral methods, which is then solved by means of standard and efficient linear algebra methods. We impose boundary conditions at the accretion shock compatible with the Rankine-Hugoniot conditions. We present several numerical examples to assess the accuracy and convergence of the numerical code, as well as to understand the effect of an accretion flow on the oscillation modes, as a stepping stone towards a complete analysis of the CCSNe case.",
      "pdf_url": "https://arxiv.org/pdf/2503.16317.pdf",
      "published": "2025-11-25T01:31:36.228797",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.16753",
      "title": "The ViSta method for stacking in the Fourier domain and its application to the dusty star-forming galaxies in the ALMA Science Archive",
      "authors": [
        "Martina Torsello",
        "Marcella Massardi",
        "Elisabetta Liuzzo",
        "Gayathri Gururaian",
        "Francesca Perrotta",
        "Andrea Lapi"
      ],
      "abstract": "The ViSta method for stacking in the Fourier domain and its application to the dusty star-forming galaxies in the ALMA Science Archive Martina Torsello, Marcella Massardi, Elisabetta Liuzzo, Gayathri Gururaian, Francesca Perrotta, Andrea Lapi Accepted by PASP, 23 pages, 16 figures, 3 tables Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present ViSta, a Visibility Stacking method to combine interferometric observations in the Fourier domain at radio to sub-millimeter wavelengths for galaxies. The goal of our method is to maximize the exploitation of available archival interferometric data. By stacking visibilities of galaxies with secure spectroscopic redshifts directly in the Fourier domain and transforming them into the rest-frame, we can enhance the stacked signal, suppress noise, and improve image reconstruction thanks to an extended coverage of the visibility domain. The ViSta method is highly flexible, allowing stacking of visibilities regardless of the array configuration or spectral setup. It is effective for both targeted sources and spurious detections offset from the phase center, whether unresolved or extended, within the field of view of the telescope. We validated the method using simulated interferometric datasets. For point-like sources, we can reconstruct the true emission with approximately 90% accuracy, obtaining similar results to classical image-plane stacking. In contrast, for faint and extended sources below the noise level, our method can provide a more accurate estimate of the signal compared to traditional image-based approaches. Finally, we applied ViSta to a sample of dusty star-forming galaxies (DSFGs) observed with the Atacama Large Millimeter/sub-millimeter Array (ALMA) to detect the CO(3-2) emission line. As for the simulated case, we demonstrated that our tool performs better than image-plane stacking when the signal from individual sources is no longer easily detectable, achieving higher SNR. Finally, we outline potential future applications of this stacking approach.",
      "pdf_url": "https://arxiv.org/pdf/2511.16753.pdf",
      "published": "2025-11-25T01:31:36.720188",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.16749",
      "title": "Validation of optical pathlength stability in a LISA test-bench demonstrator",
      "authors": [
        "Shivani Harer",
        "Maxime Vincent",
        "Hubert Halloin",
        "Ouali Acef",
        "Nisrine Arab",
        "Romain Arguel",
        "Axel Arhancet",
        "Damien Bachet",
        "Nathalie Besson",
        "Sébastien Bize",
        "Sara Bruhier",
        "Christelle Buy",
        "Michael Carle",
        "Jean-Pierre Coulon",
        "Nicoleta Dinu-Jaeger",
        "Mathieu Dupont",
        "Christophe Fabron",
        "Rémi Granelli",
        "David Holleville",
        "Dominique Huet",
        "Eric Kajfasz",
        "Mickael Lacroix",
        "Matthieu Laporte",
        "Michel Lintz",
        "Christophe Meessen",
        "Mourad Merzougui",
        "Alexis Mehlman",
        "Marco Nardello",
        "Laure Oudda",
        "Benjamin Pointard",
        "Pierre Prat",
        "Emmanuelle Rivière",
        "Jérôme Royon",
        "Aurélia Secroun",
        "Samuel Sube",
        "Thomas Zerguerras",
        "Julien Zoubian"
      ],
      "abstract": "Validation of optical pathlength stability in a LISA test-bench demonstrator Shivani Harer, Maxime Vincent, Hubert Halloin, Ouali Acef, Nisrine Arab, Romain Arguel, Axel Arhancet, Damien Bachet, Nathalie Besson, Sébastien Bize, Sara Bruhier, Christelle Buy, Michael Carle, Jean-Pierre Coulon, Nicoleta Dinu-Jaeger, Mathieu Dupont, Christophe Fabron, Rémi Granelli, David Holleville, Dominique Huet, Eric Kajfasz, Mickael Lacroix, Matthieu Laporte, Michel Lintz, Christophe Meessen, Mourad Merzougui, Alexis Mehlman, Marco Nardello, Laure Oudda, Benjamin Pointard, Pierre Prat, Emmanuelle Rivière, Jérôme Royon, Aurélia Secroun, Samuel Sube, Thomas Zerguerras, Julien Zoubian Instrumentation and Methods for Astrophysics (astro-ph.IM) The Laser Interferometer Space Antenna (LISA) observatory is a future L3 mission of the European Space Agency (ESA) to detect gravitational waves, set to launch in 2035. The detector constellation will conduct interferometry to picometer stability over an unprecedented arm length of 2.5 million km. In this paper, we present the development and testing results for the Zerodur interferometer (ZIFO), an optical demonstrator built to validate critical technology for the test setup of the interferometric core of LISA. Optical path length stability measurements on the ZIFO demonstrate successful reduction of bench noise to maintain the 10 pm/$\\sqrt{\\text{Hz}}$ specification across the 1 mHz to 1 Hz frequency band. We also identify and characterize dominant noise sources from phasemeters and correlations of beam tilt into the path length that were observed during the test campaign.",
      "pdf_url": "https://arxiv.org/pdf/2511.16749.pdf",
      "published": "2025-11-25T01:31:37.025153",
      "updated": null,
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.16750",
      "title": "CLAWDIA: A dictionary learning framework for gravitational-wave data analysis",
      "authors": [
        "Miquel Llorens-Monteagudo",
        "Alejandro Torres-Forné",
        "José A. Font"
      ],
      "abstract": "CLAWDIA: A dictionary learning framework for gravitational-wave data analysis Miquel Llorens-Monteagudo, Alejandro Torres-Forné, José A. Font Instrumentation and Methods for Astrophysics (astro-ph.IM) Deep-learning methods are becoming increasingly important in gravitational-wave data analysis, yet their performance often relies on large training datasets and models whose internal representations are difficult to interpret. Sparse dictionary learning (SDL) offers a complementary approach: it performs well in scarce-data regimes and yields physically interpretable representations of gravitational-wave morphology. Here we present CLAWDIA (Comprehensive Library for the Analysis of Waves via Dictionary-based Algorithms), an open-source Python framework that integrates SDL-based denoising and classification under realistic detector noise. We systematise previously isolated SDL workflows into a unified, modular environment with a consistent, user-friendly interface. The current release provides several time-domain denoising strategies based on LASSO-regularised sparse coding and a classifier based on Low-Rank Shared Dictionary Learning. A companion toolbox, GWADAMA, supports dataset construction and realistic conditioning of real and simulated interferometer data. We demonstrate CLAWDIA's performance by denoising the signal from binary neutron star event GW170817 and by classifying families of instrumental glitches from LIGO's third observing run, highlighting robustness at low signal-to-noise ratios. CLAWDIA is intended as a community-driven, interoperable library extensible to additional tasks, including detection and parameter estimation.",
      "pdf_url": "https://arxiv.org/pdf/2511.16750.pdf",
      "published": "2025-11-25T01:31:37.025357",
      "updated": null,
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2511.17141",
      "title": "Distributed Acoustic Fiber Sensing for Research Campuses and Large Scientific Infrastructures -- The Hamburg WAVE proto-network",
      "authors": [
        "Oliver Bölt",
        "Luigia Cristiano",
        "Sandy Croatto",
        "Dirk Gajewski",
        "Erik Genthe",
        "Oliver Gerberding",
        "Céline Hadziioannou",
        "Conny Hammer",
        "Markus Hoffmann",
        "Katharina-Sophie Isleif",
        "Antonia Kiel",
        "Charlotte M. Krawczyk",
        "Regina Maass",
        "Ingra Barbosa",
        "Norbert Meyners",
        "Reinhardt Rading",
        "Holger Schlarb",
        "Roman Schnabel",
        "Wanda Vossius",
        "Christopher Wollin"
      ],
      "abstract": "Distributed Acoustic Fiber Sensing for Research Campuses and Large Scientific Infrastructures -- The Hamburg WAVE proto-network Oliver Bölt, Luigia Cristiano, Sandy Croatto, Dirk Gajewski, Erik Genthe, Oliver Gerberding, Céline Hadziioannou, Conny Hammer, Markus Hoffmann, Katharina-Sophie Isleif, Antonia Kiel, Charlotte M. Krawczyk, Regina Maass, Ingra Barbosa, Norbert Meyners, Reinhardt Rading, Holger Schlarb, Roman Schnabel, Wanda Vossius, Christopher Wollin Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM); Accelerator Physics (physics.acc-ph); Geophysics (physics.geo-ph) Here, we demonstrate and investigate how Distributed Acoustic Sensing (DAS) can be utilized on research campuses and in large scientific infrastructures to study environmental vibrations and reduce their impact on high-precision experiments. We first discuss the potential of DAS in the context of particle accelerators, gravitational wave detection experiments and research campuses. Next, we present the results of our seismic measurement campaign conducted with our proto-network, which involved the probing of over 12 km of fiber, in May 2021. This campaign was conducted by the Hamburg WAVE initiative in Science City Hamburg Bahrenfeld and included DESY, the European XFEL, PETRA III and the University of Hamburg. Our proto-network confirms the ability to observe natural, anthropogenic, and infrastructural vibrations and how and where these couple into different parts of the heterogeneously set up fiber network. We also present results on a study of noise and motion coupling aspects of DAS probing double-redundant fiber loops in a unique environment, the European XFEL. Our results show that DAS greatly benefits research campuses and large scientific infrastructures and they highlight the opportunities and challenges of implementing and operating such seismic networks.",
      "pdf_url": "https://arxiv.org/pdf/2511.17141.pdf",
      "published": "2025-11-25T01:31:37.028376",
      "updated": null,
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from physics.ins-det",
        "cross_list_from": "physics.ins-det"
      }
    }
  ]
}