{
  "date": "2025-10-06",
  "crawl_timestamp": "2025-10-06T01:31:21.534862",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 160,
    "total_gw_papers": 21,
    "by_category": {
      "gr-qc": {
        "total": 29,
        "gw_related": 8
      },
      "astro-ph": {
        "total": 114,
        "gw_related": 13
      }
    }
  },
  "crawl_verification": {
    "total_expected": 223,
    "total_actual": 223,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 46,
        "actual_crawled": 46,
        "page_source_info": "Total of 46 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 25,
        "actual_crawled": 25,
        "page_source_info": "Total of 25 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 33,
        "actual_crawled": 33,
        "page_source_info": "Total of 33 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 49,
        "actual_crawled": 49,
        "page_source_info": "Total of 49 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 27,
        "actual_crawled": 27,
        "page_source_info": "Total of 27 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 26,
        "actual_crawled": 26,
        "page_source_info": "Total of 26 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 17,
        "actual_crawled": 17,
        "page_source_info": "Total of 17 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.02433",
      "title": "Extreme-mass-ratio inspirals in relativistic accretion discs",
      "authors": [
        "Francisco Duque",
        "Laura Sberna",
        "Andrew Spiers",
        "Rodrigo Vicente"
      ],
      "abstract": "Extreme-mass-ratio inspirals in relativistic accretion discs Francisco Duque, Laura Sberna, Andrew Spiers, Rodrigo Vicente General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We compute relativistic Lindblad torques for circular, equatorial extreme-mass-ratio inspirals (EMRIs) embedded in relativistic thin accretion discs, including spinning black hole configurations. We find that relativistic effects can amplify the magnitude of these torques by orders of magnitude in the strong-field regime, and that the torque can even reverse direction as the EMRI approaches the innermost stable circular orbit (ISCO). However, we show that the location of this reversal is highly spin-dependent, shifting progressively closer to the ISCO, where gravitational-wave emission completely dominates the inspiral, as the spin of the central black hole increases. Spin also modifies the radial dependence of the Lindblad torques. We investigate whether Lindblad torques can be approximated by parametrised power laws of the form T_LR = A(r_s / 10M)^n_r (or combinations thereof), and find significant spin- and disc-dependent variations in the slope parameter n_r. For instance, for spin a/M = 0.9, we find n_r = 3.6 in the strong-field regime, compared to the Newtonian value of n_r = 4.5. Given current forecasts of parameter recovery for ``golden'', loud EMRIs in accretion discs (\\Delta n_r ~ 0.5), we predict LISA could distinguish between different disc configurations through their relativistic Lindblad torque signatures, providing the first direct probe of the midplane structure of the inner region of accretion discs, which is inaccessible to electromagnetic observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.02433.pdf",
      "published": "2025-10-06T01:31:19.623748",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02447",
      "title": "Singularity resolution in the backreacted Schwarzschild geometry from 2D matter with negative central charge",
      "authors": [
        "F. J. Marañón-González",
        "A. del Río",
        "J. Navarro-Salas"
      ],
      "abstract": "Singularity resolution in the backreacted Schwarzschild geometry from 2D matter with negative central charge F. J. Marañón-González, A. del Río, J. Navarro-Salas To appear in the Proceedings of the 24th International Conference on General Relativity and Gravitation (GR24) and the 16th Edoardo Amaldi Conference on Gravitational Waves (Amaldi16) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Two-dimensional dilaton gravity provides a valuable framework to study the dynamics of quantum black holes. These models are often coupled to conformal scalar fields, which capture essential quantum effects such as the trace anomaly, while remaining analytically tractable. From the viewpoint of two-dimensional quantum field theory, unitary theories require a positive central charge. However, theories with a total negative central charge naturally arise from the contribution of the Faddeev-Popov ghosts to the effective action. Recent analyses of the Callan-Giddins-Harvey-Strominger (CGHS) model with a Russo-Susskin-Thorlacius (RST) counterterm have shown that a negative central charge can remove curvature singularities in the backreacted geometry. In this work, we argue that singularity resolution arises from the negative central charge itself, rather than the particular dynamics of a given model. To support this, we present analogous results in spherically reduced Einstein gravity.",
      "pdf_url": "https://arxiv.org/pdf/2510.02447.pdf",
      "published": "2025-10-06T01:31:19.623958",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02515",
      "title": "Neural Post-Einsteinian Test of General Relativity with the Third Gravitational-Wave Transient Catalog",
      "authors": [
        "Yiqi Xie",
        "Gautham Narayan",
        "Nicolás Yunes"
      ],
      "abstract": "Neural Post-Einsteinian Test of General Relativity with the Third Gravitational-Wave Transient Catalog Yiqi Xie, Gautham Narayan, Nicolás Yunes General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Gravitational waves (GWs) from compact binaries are excellent probes of gravity in the strong- and dynamical-field regime. We report a test of general relativity (GR) with the third GW Transient Catalog (GWTC-3) using the recently developed neural post-Einsteinian framework, both on individual events and at the population level through hierarchical modeling. We find no significant violation of GR and place a constraint that, for the first time, efficiently covers non-GR theories characterized by not only post-Newtonian deviations but also those beyond under the same theory-agnostic framework.",
      "pdf_url": "https://arxiv.org/pdf/2510.02515.pdf",
      "published": "2025-10-06T01:31:19.624472",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02858",
      "title": "PINNGraPE: Physics Informed Neural Network for Gravitational wave Parameter Estimation",
      "authors": [
        "Leigh Smith",
        "Matteo Scialpi",
        "Francesco di Clemente",
        "Michał Bejger"
      ],
      "abstract": "PINNGraPE: Physics Informed Neural Network for Gravitational wave Parameter Estimation Leigh Smith, Matteo Scialpi, Francesco di Clemente, Michał Bejger 4 pages, 2 figures. Proceedings contribution to Journal of Physics: Conference Series for the 24th International Conference on General Relativity and Gravitation (GR24) and the 16th Edoardo Amaldi Conference on Gravitational Waves (Amaldi16) General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Weakly-modelled searches for gravitational waves are essential for ensuring that all potential sources are accounted for in detection efforts, as they make minimal assumptions regarding source morphology. While these searches primarily target generic transient sources, they are also highly effective at identifying a broad range of compact binary coalescences, demonstrated by the weakly-modelled search algorithm coherent WaveBurst being the first to detect GW150914. Despite their ability to detect compact binaries with diverse properties, the accurate estimation of source parameters from their output remains to be a challenging task. To overcome this, we leverage physics-informed neural networks, which serve as a powerful tool for parameter estimation by applying physical constraints through the universal differential equation governing a compact binary system. With this approach, we rapidly infer the mass parameters of binary black hole merger systems to within 7% from only the time-frequency representation of the gravitational wave signal.",
      "pdf_url": "https://arxiv.org/pdf/2510.02858.pdf",
      "published": "2025-10-06T01:31:19.625009",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02881",
      "title": "3+1 GRHD simulations of NSBH mergers with light black holes using public codes",
      "authors": [
        "S. Gomez Lopez",
        "B. Giacomazzo",
        "F. Pannarale"
      ],
      "abstract": "3+1 GRHD simulations of NSBH mergers with light black holes using public codes S. Gomez Lopez, B. Giacomazzo, F. Pannarale General Relativity and Quantum Cosmology (gr-qc) Recent observations of compact binary systems have provided evidence for black holes with masses below standard expectations. When paired with neutron stars (NSs), such low-mass black holes (BHs) have the potential to be detected by future multimessenger campaigns and could unveil unknown features of the BH population in the universe. Given the importance of accurate models for matched-filtering searches and Bayesian parameter estimation in discoveries of this sort, attention has renewed on the limitations of low-mass NSBH merger models and on the downstream impact of such limitations on gravitational-wave data analysis. Previous numerical relativity (NR) studies have revealed discrepancies in the predicted merger time, as well as more general mismatches and dephasing between phenomenological models and high-resolution simulations. The simulation presented here was motivated by these findings and illustrates how publicly available tools can be applied to this specific science case, towards informing next-generation, more refined gravitational-wave and kilonovae models. Here, we summarize the setup of a high-resolution general relativistic hydrodynamics simulation of an equal-mass NSBH system performed entirely with public codes (Einstein Toolkit and FUKA) and a finite-temperature equation of state. The results we show include the $(\\ell,m)=(2,2)$ strain and 2D snapshots of the system undergoing tidal disruption and early postmerger disk formation. The system evolved for $\\sim 4$ orbits while the $L_2$ norm of the Hamiltonian constraint remained below $6\\times10^{-7}$ throughout the inspiral prior to growing near merger time.",
      "pdf_url": "https://arxiv.org/pdf/2510.02881.pdf",
      "published": "2025-10-06T01:31:19.625216",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02106",
      "title": "Scalar-induced gravitational waves including isocurvature perturbations with lattice simulations",
      "authors": [
        "Xiang-Xi Zeng"
      ],
      "abstract": "Scalar-induced gravitational waves including isocurvature perturbations with lattice simulations Xiang-Xi Zeng Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Scalar-induced gravitational waves (SIGWs) open a unique window into early-universe physics. While their generation from adiabatic perturbations has been extensively studied, the contribution from isocurvature perturbations remains poorly understood. In this work, we develop a lattice simulation framework to compute the stochastic gravitational wave background from both pure isocurvature and mixed initial conditions. Our numerical results show excellent agreement with semi-analytical predictions in the pure isocurvature case. We further analyze multi-peak structures under general initial conditions and find that they closely match those produced in purely adiabatic scenarios. Additionally, we examine SIGWs in early matter-dominated eras, revealing that the peak amplitude and spectral slope are sensitive to the microphysical properties of the dominant field, such as the primordial black hole mass, abundance, or soliton decay rate. This study establishes lattice simulations as a robust tool for predicting SIGW spectra from complex primordial perturbations, with important implications for interpreting current and future gravitational wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.02106.pdf",
      "published": "2025-10-06T01:31:19.625931",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.03118",
      "title": "BaBy Cosmic Tension",
      "authors": [
        "Christophe Ringeval"
      ],
      "abstract": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We show that the recently released B-mode polarisation data from the South Pole Telescope (SPT) favour a non-vanishing contribution of primordial gravitational waves of inflationary origin which is in tension with the previous BICEP-Keck (BK) measurements. Our analysis uses the third-order slow-roll primordial power spectra, with theoretically motivated priors, on the multifrequency SPT likelihoods complemented by the latest Planck satellite data products. The SPT measurements provide 1.0 bit of information gain on the first slow-roll parameter, which is higher than the 0.9 bit provided by BK even though the SPT sensitivity is five times lower. Moreover, the Bayesian dimensionality on the same parameter exceeds 1.5 for SPT versus 0.3 for BK showing that it is overconstrained by the SPT data. Even if this BB-tension could be the result of a yet to be understood foreground, our findings should motivate for a closer analysis of this unexpected B-modes excess.",
      "pdf_url": "https://arxiv.org/pdf/2510.03118.pdf",
      "published": "2025-10-06T01:31:19.626841",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2503.06503",
      "title": "Constraints on the Scale Parameter of Regular Black Hole in Asymptotically Safe Gravity from Extreme Mass Ratio Inspirals",
      "authors": [
        "Lai Zhao",
        "Meirong Tang",
        "Zhaoyi Xu"
      ],
      "abstract": "Constraints on the Scale Parameter of Regular Black Hole in Asymptotically Safe Gravity from Extreme Mass Ratio Inspirals Lai Zhao, Meirong Tang, Zhaoyi Xu General Relativity and Quantum Cosmology (gr-qc) This paper evaluates the potential for constraining the quantum scale parameter $\\xi$ of regular black hole within the asymptotically safe gravity framework using gravitational waves from extreme mass ratio inspirals (EMRIs). Since $\\xi$ cannot be precisely determined from first principles, observational constraints become crucial. We employ the Augmented Analytical Kludge (AAK) method to calculate gravitational waveforms in the equatorial plane and systematically analyze the influence of different $\\xi$ values on phase evolution. Comparison with the Schwarzschild case demonstrates that the corrective effects of $\\xi$ accumulate in the phase over observation time, thereby providing distinguishable observational signatures. Through waveform mismatch analysis, our results indicate that the LISA detector can effectively detect the presence of $\\xi$ at the $\\sim10^{-4}$ level for systems with a mass of $10^6M_\\odot$. Further assessment using the Fisher information matrix (FIM) confirms a measurement precision of $\\Delta\\xi\\approx3.225\\times10^{-4}$, which significantly surpasses existing observational methods, providing quantitative observational evidence for asymptotically safe quantum gravity theory in the strong-field regime.",
      "pdf_url": "https://arxiv.org/pdf/2503.06503.pdf",
      "published": "2025-10-06T01:31:19.627988",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2504.18669",
      "title": "$κ$-General-Relativity II: An Astrophysical Observable from a 2-Body system",
      "authors": [
        "Daniel Rozental",
        "Ofek Birnholtz"
      ],
      "abstract": "$κ$-General-Relativity II: An Astrophysical Observable from a 2-Body system Daniel Rozental, Ofek Birnholtz 15 pages, 3 figures. Any comments are welcome (email in the paper) Physical Review D 112, 064072 (2025) General Relativity and Quantum Cosmology (gr-qc) We examine gravitational waves (GWs) from Binary Black Holes (BBH) as possible suitable systems for investigating the physical validity of theories predicting the Relative Locality (RL) effect, an effect arising in the kappa-Minkowski non-commutative spacetime, a central property in theories of Quantum Gravity (QG) Phenomenology. Hence, we are taking a step towards realizing the purpose of the phenomenological effort of having observational evidence to put constraints on QG approaches. In particular, we show that the RL effect induces an uncertainty in the observed rotational frequency omega during the inspiral phase. This uncertainty becomes stronger with increasing observational distance. It also increases with decreasing orbital radius, and it statistically accumulates as an increasing variance of omega over successive cycles. In terms of the post-Newtonian deviations, the uncertainty contributes at 1.25th order, an order that has not yet been directly constrained in GW analyses.",
      "pdf_url": "https://arxiv.org/pdf/2504.18669.pdf",
      "published": "2025-10-06T01:31:19.628171",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.17143",
      "title": "Generic EFT-motivated beyond General Relativity gravitational wave tests and their curvature dependence: from observation to interpretation",
      "authors": [
        "Laura Bernard",
        "Suvendu Giri",
        "Luis Lehner",
        "Riccardo Sturani"
      ],
      "abstract": "Generic EFT-motivated beyond General Relativity gravitational wave tests and their curvature dependence: from observation to interpretation Laura Bernard, Suvendu Giri, Luis Lehner, Riccardo Sturani v2: References added, minor updates, published in Phys. Rev. D General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We present a \"dictionary\" to expedite the identification of potential deviations in gravitational waveforms from those predicted by General Relativity (GR) during the inspiral phase of black hole binaries. Assuming deviations from GR can be described by a local Effective Field Theory (EFT) formulated in terms of curvature operators (and possibly additional scalar fields), this dictionary characterizes how deviations scale with the masses of the binary components and identifies the leading order Post-Newtonian corrections in generic theories constructed within the EFT framework. By establishing a direct connection between observations and candidate theories beyond GR, this dictionary also aids in distinguishing genuine physical effects from systematic errors. These results can be readily incorporated into essentially all existing tests for the inspiral regime and, in particular, facilitate a more efficient combination of data from multiple events.",
      "pdf_url": "https://arxiv.org/pdf/2507.17143.pdf",
      "published": "2025-10-06T01:31:19.629055",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.GA",
        "astro-ph.HE",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.15841",
      "title": "Detecting milli-Hz gravitational waves with optical resonators",
      "authors": [
        "G. Barontini",
        "X. Calmet",
        "V. Guarrera",
        "A. Smith",
        "A. Vecchio"
      ],
      "abstract": "Detecting milli-Hz gravitational waves with optical resonators G. Barontini, X. Calmet, V. Guarrera, A. Smith, A. Vecchio Class. Quantum Grav. 42 20LT01 (2025) Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th); Atomic Physics (physics.atom-ph) We propose a gravitational wave detector based on ultrastable optical cavities enabling the detection of gravitational wave signals in the mostly unexplored $10^{-5}-1$ Hz frequency band. We illustrate the working principle of the detector and discuss that several classes of gravitational wave sources, both of astrophysical and cosmological origin, may be within the detection range of this instrument. Our work suggests that terrestrial gravitational wave detection in the milli-Hz frequency range is potentially within reach with current technology.",
      "pdf_url": "https://arxiv.org/pdf/2509.15841.pdf",
      "published": "2025-10-06T01:31:19.630836",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02481",
      "title": "Reheating with Thermal Dissipation and Primordial Gravitational Waves",
      "authors": [
        "Kazuma Minami",
        "Kyohei Mukaida",
        "Kazunori Nakayama"
      ],
      "abstract": "Reheating with Thermal Dissipation and Primordial Gravitational Waves Kazuma Minami, Kyohei Mukaida, Kazunori Nakayama Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) In order for an inflationary universe to evolve into a hot universe, a process known as reheating is required. However, the precise mechanism of reheating remains unknown. We show that if the reheating is triggered by thermal dissipation effects, distinctive features appear in the spectrum of primordial gravitational waves. This suggests a possible way to observationally probe the physics of reheating.",
      "pdf_url": "https://arxiv.org/pdf/2510.02481.pdf",
      "published": "2025-10-06T01:31:19.814541",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2312.00679",
      "title": "Euclid preparation. XLI. Galaxy power spectrum modelling in real space",
      "authors": [
        "Euclid Collaboration: A. Pezzotta",
        "C. Moretti",
        "M. Zennaro",
        "A. Moradinezhad Dizgah",
        "M. Crocce",
        "E. Sefusatti",
        "I. Ferrero",
        "K. Pardede",
        "A. Eggemeier",
        "A. Barreira",
        "R. E. Angulo",
        "M. Marinucci",
        "B. Camacho Quevedo",
        "S. de la Torre",
        "D. Alkhanishvili",
        "M. Biagetti",
        "M.-A. Breton",
        "E. Castorina",
        "G. D'Amico",
        "V. Desjacques",
        "M. Guidi",
        "M. Kärcher",
        "A. Oddo",
        "M. Pellejero Ibanez",
        "C. Porciani",
        "A. Pugno",
        "J. Salvalaggio",
        "E. Sarpa",
        "A. Veropalumbo",
        "Z. Vlah",
        "A. Amara",
        "S. Andreon",
        "N. Auricchio",
        "M. Baldi",
        "S. Bardelli",
        "R. Bender",
        "C. Bodendorf",
        "D. Bonino",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "S. Camera",
        "V. Capobianco",
        "C. Carbone",
        "V. F. Cardone",
        "J. Carretero",
        "S. Casas",
        "F. J. Castander",
        "M. Castellano",
        "S. Cavuoti",
        "A. Cimatti",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "L. Corcione",
        "F. Courbin",
        "H. M. Courtois",
        "A. Da Silva",
        "H. Degaudenzi",
        "A. M. Di Giorgio",
        "J. Dinis",
        "X. Dupac",
        "S. Dusini",
        "A. Ealet",
        "M. Farina",
        "S. Farrens",
        "P. Fosalba",
        "M. Frailis",
        "E. Franceschi",
        "S. Galeotta",
        "B. Gillis",
        "C. Giocoli",
        "B. R. Granett",
        "A. Grazian",
        "F. Grupp",
        "L. Guzzo",
        "S. V. H. Haugan",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "M. Kilbinger",
        "T. Kitching",
        "B. Kubik",
        "M. Kunz",
        "H. Kurki-Suonio",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "E. Maiorano",
        "O. Mansutti",
        "O. Marggraf",
        "K. Markovic",
        "N. Martinet"
      ],
      "abstract": "Euclid preparation. XLI. Galaxy power spectrum modelling in real space Euclid Collaboration: A. Pezzotta (1), C. Moretti (2 and 3 and 4 and 5 and 6), M. Zennaro (7), A. Moradinezhad Dizgah (8), M. Crocce (9 and 10), E. Sefusatti (5 and 6 and 11), I. Ferrero (12), K. Pardede (2 and 13 and 6 and 11 and 5), A. Eggemeier (14), A. Barreira (15 and 16), R. E. Angulo (17 and 18), M. Marinucci (19 and 20), B. Camacho Quevedo (21 and 9), S. de la Torre (22), D. Alkhanishvili (14), M. Biagetti (23 and 6 and 2 and 5), M.-A. Breton (9 and 10 and 24), E. Castorina (25 and 26), G. D'Amico (19 and 27), V. Desjacques (20), M. Guidi (28 and 29), M. Kärcher (22 and 30), A. Oddo (2 and 6), M. Pellejero Ibanez (17 and 4), C. Porciani (14), A. Pugno (14), J. Salvalaggio (5 and 11 and 31 and 6), E. Sarpa (2 and 11), A. Veropalumbo (32 and 33), Z. Vlah (34 and 35 and 36), A. Amara (37), S. Andreon (32), N. Auricchio (38), M. Baldi (39 and 38 and 40), S. Bardelli (38), R. Bender (1 and 41), C. Bodendorf (1), D. Bonino (42), E. Branchini (43 and 33 and 32), M. Brescia (44 and 45 and 46), J. Brinchmann (47), S. Camera (48 and 49 and 42), V. Capobianco (42), C. Carbone (50), V. F. Cardone (51 and 52), J. Carretero (53 and 54), S. Casas (55), F. J. Castander (9 and 21), M. Castellano (51), S. Cavuoti (45 and 46), A. Cimatti (56), G. Congedo (4), C. J. Conselice (57), L. Conversi (58 and 59), Y. Copin (60), L. Corcione (42), F. Courbin (61), H. M. Courtois (62), A. Da Silva (63 and 64), H. Degaudenzi (65), A. M. Di Giorgio (66), J. Dinis (64 and 63), X. Dupac (59), S. Dusini (67), A. Ealet (68), M. Farina (66), S. Farrens (69), P. Fosalba (21 and 10), M. Frailis (5), E. Franceschi (38), S. Galeotta (5), B. Gillis (4), C. Giocoli (38 and 70), B. R. Granett (32), A. Grazian (71), F. Grupp (1 and 72), L. Guzzo (25 and 32 and 26), S. V. H. Haugan (12), F. Hormuth (73), A. Hornstrup (74 and 75), K. Jahnke (76), B. Joachimi (77), E. Keihänen (78), S. Kermiche (79), A. Kiessling (80), M. Kilbinger (81), T. Kitching (82), B. Kubik (60), M. Kunz (8), H. Kurki-Suonio (83 and 84), S. Ligori (42), P. B. Lilje (12), V. Lindholm (83 and 84), I. Lloro (85), E. Maiorano (38), O. Mansutti (5), O. Marggraf (14), K. Markovic (80), N. Martinet Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the accuracy of the perturbative galaxy bias expansion in view of the forthcoming analysis of the Euclid spectroscopic galaxy samples. We compare the performance of an Eulerian galaxy bias expansion, using state-of-art prescriptions from the effective field theory of large-scale structure (EFTofLSS), against a hybrid approach based on Lagrangian perturbation theory and high-resolution simulations. These models are benchmarked against comoving snapshots of the Flagship I N-body simulation at $z=(0.9,1.2,1.5,1.8)$, which have been populated with H$\\alpha$ galaxies leading to catalogues of millions of objects within a volume of about $58\\,h^{-3}\\,{\\rm Gpc}^3$. Our analysis suggests that both models can be used to provide a robust inference of the parameters $(h, \\omega_{\\rm c})$ in the redshift range under consideration, with comparable constraining power. We additionally determine the range of validity of the EFTofLSS model in terms of scale cuts and model degrees of freedom. From these tests, it emerges that the standard third-order Eulerian bias expansion can accurately describe the full shape of the real-space galaxy power spectrum up to the maximum wavenumber $k_{\\rm max}=0.45\\,h\\,{\\rm Mpc}^{-1}$, even with a measurement precision well below the percent level. In particular, this is true for a configuration with six free nuisance parameters, including local and non-local bias parameters, a matter counterterm, and a correction to the shot-noise contribution. Fixing either tidal bias parameters to physically-motivated relations still leads to unbiased cosmological constraints. We finally repeat our analysis assuming a volume that matches the expected footprint of Euclid, but without considering observational effects, as purity and completeness, showing that we can get consistent cosmological constraints over this range of scales and redshifts.",
      "pdf_url": "https://arxiv.org/pdf/2312.00679.pdf",
      "published": "2025-10-06T01:31:19.817335",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2506.24030",
      "title": "Listening Across the Cosmic Time: Standard Sirens from Ground- and Space-Based Missions in the Next Decade",
      "authors": [
        "Alberto Salvarese",
        "Hsin-Yu Chen",
        "Alberto Mangiagli",
        "Nicola Tamanini"
      ],
      "abstract": "Listening Across the Cosmic Time: Standard Sirens from Ground- and Space-Based Missions in the Next Decade Alberto Salvarese, Hsin-Yu Chen, Alberto Mangiagli, Nicola Tamanini Invited article for the Classical and Quantum Gravity special issue \"Gravitational Wave Physics and Astrophysics Ten Years After GW150914\" Classical and Quantum Gravity, 42, 19, p.195002, 2025 Cosmology and Nongalactic Astrophysics (astro-ph.CO) Precise measurement of the Hubble parameter will enable stringent tests of the standard model for cosmology. Standard sirens, using the luminosity distances measured by gravitational-wave observations of compact binary mergers, are expected to provide such measurements independently in the next decade. With the ground- and space-based gravitational wave observatories, the LIGO-Virgo-KAGRA (LVK) network and the Laser Interferometer Space Antenna (LISA), different types of standard sirens altogether will place constraints across a wide redshift range. In this paper, we forecast the precisions of standard siren Hubble parameter measurements and compare various scenarios, accounting for the dominant sources of systematic uncertainty. Specifically, we find a $2\\%$ constraint on $H_0$, a $1.5-3\\%$ constraint on $H(z)$ at $z=1$, and a $3-5\\%$ constraint on $H(z)$ at $z=7$ when combining LVK and LISA standard sirens with precise redshift measurements from electromagnetic counterpart observations. We do not find a significant improvement when including standard sirens with no EM counterpart, but which rely on features in the black hole mass distribution, and the potential systematics introduced by the possible redshift evolution of such features could further degrade the measurement accuracy if not properly accounted for.",
      "pdf_url": "https://arxiv.org/pdf/2506.24030.pdf",
      "published": "2025-10-06T01:31:19.818182",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2503.15315",
      "title": "Euclid Quick Data Release (Q1). A probabilistic classification of quenched galaxies",
      "authors": [
        "Euclid Collaboration: P. Corcho-Caballero",
        "Y. Ascasibar",
        "G. Verdoes Kleijn",
        "C. C. Lovell",
        "G. De Lucia",
        "C. Cleland",
        "F. Fontanot",
        "C. Tortora",
        "L. V. E. Koopmans",
        "T. Moutard",
        "C. Laigle",
        "A. Nersesian",
        "F. Shankar",
        "N. Aghanim",
        "B. Altieri",
        "A. Amara",
        "S. Andreon",
        "H. Aussel",
        "C. Baccigalupi",
        "M. Baldi",
        "A. Balestra",
        "S. Bardelli",
        "P. Battaglia",
        "A. Biviano",
        "A. Bonchi",
        "D. Bonino",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "S. Casas",
        "F. J. Castander",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "A. Costille",
        "F. Courbin",
        "H. M. Courtois",
        "M. Cropper",
        "A. Da Silva",
        "H. Degaudenzi",
        "A. M. Di Giorgio",
        "C. Dolding",
        "H. Dole",
        "F. Dubath",
        "X. Dupac",
        "A. Ealet",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "S. Fotopoulou",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "B. R. Granett",
        "A. Grazian",
        "F. Grupp",
        "L. Guzzo",
        "S. Gwyn",
        "S. V. H. Haugan",
        "W. Holmes",
        "I. M. Hook",
        "F. Hormuth",
        "A. Hornstrup",
        "P. Hudelot",
        "K. Jahnke",
        "M. Jhabvala",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "B. Kubik",
        "K. Kuijken",
        "M. Kümmel",
        "M. Kunz",
        "H. Kurki-Suonio",
        "Q. Le Boulc'h",
        "A. M. C. Le Brun",
        "D. Le Mignant",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm"
      ],
      "abstract": "Euclid Quick Data Release (Q1). A probabilistic classification of quenched galaxies Euclid Collaboration: P. Corcho-Caballero, Y. Ascasibar, G. Verdoes Kleijn, C. C. Lovell, G. De Lucia, C. Cleland, F. Fontanot, C. Tortora, L. V. E. Koopmans, T. Moutard, C. Laigle, A. Nersesian, F. Shankar, N. Aghanim, B. Altieri, A. Amara, S. Andreon, H. Aussel, C. Baccigalupi, M. Baldi, A. Balestra, S. Bardelli, P. Battaglia, A. Biviano, A. Bonchi, D. Bonino, E. Branchini, M. Brescia, J. Brinchmann, G. Cañas-Herrera, V. Capobianco, C. Carbone, J. Carretero, S. Casas, F. J. Castander, M. Castellano, G. Castignani, S. Cavuoti, K. C. Chambers, A. Cimatti, C. Colodro-Conde, G. Congedo, C. J. Conselice, L. Conversi, Y. Copin, A. Costille, F. Courbin, H. M. Courtois, M. Cropper, A. Da Silva, H. Degaudenzi, A. M. Di Giorgio, C. Dolding, H. Dole, F. Dubath, X. Dupac, A. Ealet, S. Escoffier, M. Farina, R. Farinelli, F. Faustini, S. Ferriol, F. Finelli, S. Fotopoulou, M. Frailis, E. Franceschi, M. Fumana, S. Galeotta, K. George, B. Gillis, C. Giocoli, J. Gracia-Carpio, B. R. Granett, A. Grazian, F. Grupp, L. Guzzo, S. Gwyn, S. V. H. Haugan, W. Holmes, I. M. Hook, F. Hormuth, A. Hornstrup, P. Hudelot, K. Jahnke, M. Jhabvala, E. Keihänen, S. Kermiche, A. Kiessling, B. Kubik, K. Kuijken, M. Kümmel, M. Kunz, H. Kurki-Suonio, Q. Le Boulc'h, A. M. C. Le Brun, D. Le Mignant, S. Ligori, P. B. Lilje, V. Lindholm Paper accepted for publication as part of the A&A Special Issue `Euclid Quick Data Release (Q1)', 28 pages, 11 figures (+ 3 appendices) Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Investigating what drives the quenching of star formation in galaxies is key to understanding their evolution. The Euclid mission will provide rich data from optical to infrared wavelengths for millions of galaxies, and enable precise measurements of their star formation histories. Using the first Euclid Quick Data Release (Q1), we developed a probabilistic classification framework that combines the average specific star-formation rate inferred over two timescales ($10^8,10^9$ yr) to categorise galaxies as `ageing' (secularly evolving), `quenched' (recently halted star formation), or `retired' (dominated by old stars). Two classification methods were employed: a probabilistic approach, which integrates posterior distributions, and a model-driven method, which optimises sample purity and completeness using IllustrisTNG. At $z<0.1$ and $M_\\ast \\gtrsim 3\\times10^{8}\\,M_\\odot$, we obtain Euclid class fractions of 68-72\\%, 8-17\\%, and 14-19\\% for ageing, quenched, and retired populations, respectively. Ageing and retired galaxies dominate at the low- and high-mass end, respectively, while quenched galaxies surpass the retired fraction for $M_\\ast \\lesssim 10^{10}\\,\\rm M_\\odot$. The evolution with redshift shows increasing and decreasing fractions of ageing and retired galaxies, respectively. More massive galaxies usually undergo quenching episodes at earlier times than to their low-mass counterparts. In terms of the mass-size-metallicity relation, ageing galaxies generally exhibit disc morphologies and low metallicities. Retired galaxies show compact structures and enhanced chemical enrichment, while quenched galaxies form an intermediate population that is more compact and chemically evolved than ageing systems. This work demonstrates Euclid's great potential for elucidating the physical nature of the quenching mechanisms that govern galaxy evolution.",
      "pdf_url": "https://arxiv.org/pdf/2503.15315.pdf",
      "published": "2025-10-06T01:31:19.819968",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02687",
      "title": "The H.E.S.S. Gravitational Wave and Gamma-Ray Burst Follow-Up Programs",
      "authors": [
        "Bernardo Cornejo",
        "Halim Ashkar",
        "Matteo Cerruti",
        "Ilja Jaroschewski",
        "Pierre Pichard",
        "Santiago Pita",
        "Fabian Schussler"
      ],
      "abstract": "The H.E.S.S. Gravitational Wave and Gamma-Ray Burst Follow-Up Programs Bernardo Cornejo, Halim Ashkar, Matteo Cerruti, Ilja Jaroschewski, Pierre Pichard, Santiago Pita, Fabian Schussler (on behalf of the H.E.S.S. Collaboration) Work presented in ICRC 2025 on behalf of the H.E.S.S. Collaboration High Energy Astrophysical Phenomena (astro-ph.HE) Multi-wavelength and multi-messenger astrophysics have experienced rapid growth over the past decade, seeking a complete picture of different cosmic phenomena. Transient sources, in particular, benefit from the input of multi-messenger observations, offering complementary perspectives on the same event while maximizing the detection probability of a rapidly fading signal. In this context, Gravitational Wave (GW) detections serve as perfect triggers for potential counterpart detections. Notably, a GW alert could be associated with a Gamma-Ray Burst (GRB), jetted cataclysmic events produced either by the collision of a binary neutron star system or a core-collapse supernova. These sources also radiate across the electromagnetic spectrum, allowing detection by X- and gamma-ray instruments aboard various satellites and thus enabling multi-wavelength triggering opportunities. The strong interest in minimizing reaction time to capture the full-time evolution of the emission, together with the often challenging localization uncertainties of the alerts, underscores the need for rapid and well-coordinated follow-up programs such as the one developed by the H.E.S.S. Collaboration. This contribution will give an overview of the transient follow-up strategy carried out by the H.E.S.S. Collaboration, from the external alert trigger and the automatic reaction of the observatory to the various analysis steps of the obtained observations. To illustrate this comprehensive strategy, we will show two examples of follow-up observations of both GRBs and GWs, highlighting key results and challenges in the search for an associated high-energy gamma-ray emission.",
      "pdf_url": "https://arxiv.org/pdf/2510.02687.pdf",
      "published": "2025-10-06T01:31:20.261729",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.03139",
      "title": "Optimising the MeerKAT Pulsar Timing Array and towards precision pulsar timing with SKA-mid",
      "authors": [
        "Pratyasha Gitika",
        "Ryan M. Shannon",
        "Matthew Bailes",
        "Daniel J. Reardon",
        "Matthew T. Miles",
        "David J. Champion",
        "Kathrin Grunthal"
      ],
      "abstract": "Optimising the MeerKAT Pulsar Timing Array and towards precision pulsar timing with SKA-mid Pratyasha Gitika, Ryan M. Shannon, Matthew Bailes, Daniel J. Reardon, Matthew T. Miles, David J. Champion, Kathrin Grunthal 18 pages, 11 figures, 3 tables, accepted for publication in PASA High Energy Astrophysical Phenomena (astro-ph.HE) Pulsar timing arrays (PTAs) are Galactic-scale nanohertz-frequency gravitational wave (GW) detectors. Recently, several PTAs have found evidence for the presence of GWs in their datasets, but none of them have achieved a community-defined definitive (> 5$\\sigma$) detection. Here, we identify limiting noise sources for PTAs and quantify their impact on sensitivity to GWs under different observing and noise modelling strategies. First, we search for intrinsic pulse jitter in a sample of 89 MSPs observed by the MeerKAT Pulsar Timing Array and obtain new jitter measurements for 20 MSPs. We then forecast jitter noise in pulsars for the future SKA-Mid telescope, finding that the timing precision of many of the best-timed MSPs would be dominated by jitter noise. We then consider dispersion measure variations from the interstellar medium and find that their effects are best mitigated by modelling them as a stationary Gaussian process with a power-law spectrum. Improving upon the established hasasia code for PTA sensitivity analysis, we assess the timing potential of the lower frequency UHF-band (544$-$1088\\,MHz) of MeerKAT and find a potential increase in GW background sensitivity by $\\approx 8$\\%, relative to observing at L-band. We show that this improvement relies on assumptions on the propagation through the interstellar medium, and highlight that if observing frequency-dependent propagation effects, such as scattering noise, are present, where noise is not completely correlated across observing frequency, then the improvement is significantly diminished. Using the multi-frequency receivers and sub-arraying flexibility of MeerKAT, we find that focussed, high-cadence observations of the best MSPs can enhance the sensitivity of the array for both the continuous GWs and stochastic GWB. These results highlight the role of MeerKAT and the MPTA in the context of international GW search efforts.",
      "pdf_url": "https://arxiv.org/pdf/2510.03139.pdf",
      "published": "2025-10-06T01:31:20.264708",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.21203",
      "title": "The NANOGrav 15-Year Data Set: Improved Timing Precision With VLBI Astrometric Priors",
      "authors": [
        "Sofia V. Sosa Fiscella",
        "Michael T. Lam",
        "Gabriella Agazie",
        "Akash Anumarlapudi",
        "Anne M. Archibald",
        "Zaven Arzoumanian",
        "Paul T. Baker",
        "Paul R. Brook",
        "H. Thankful Cromartie",
        "Kathryn Crowter",
        "Maria Silvina De Biasi",
        "Megan E. DeCesar",
        "Paul B. Demorest",
        "Timothy Dolch",
        "Elizabeth C. Ferrara",
        "William Fiore",
        "Emmanuel Fonseca",
        "Gabriel E. Freedman",
        "Nate Garver-Daniels",
        "Peter A. Gentile",
        "Joseph Glaser",
        "Deborah C. Good",
        "Jeffrey S. Hazboun",
        "Ross J. Jennings",
        "Megan L. Jones",
        "David L. Kaplan",
        "Matthew Kerr",
        "Duncan R. Lorimer",
        "Jing Luo",
        "Ryan S. Lynch",
        "Alexander McEwen",
        "Maura A. McLaughlin",
        "Natasha McMann",
        "Bradley W. Meyers",
        "Cherry Ng",
        "David J. Nice",
        "Timothy T. Pennucci",
        "Benetge B. P. Perera",
        "Nihan S. Pol",
        "Henri A. Radovan",
        "Scott M. Ransom",
        "Paul S. Ray",
        "Ann Schmiedekamp",
        "Carl Schmiedekamp",
        "Brent J. Shapiro-Albert",
        "Ingrid H. Stairs",
        "Kevin Stovall",
        "Abhimanyu Susobhanan",
        "Joseph K. Swiggum",
        "Haley M. Wahl"
      ],
      "abstract": "The NANOGrav 15-Year Data Set: Improved Timing Precision With VLBI Astrometric Priors Sofia V. Sosa Fiscella, Michael T. Lam, Gabriella Agazie, Akash Anumarlapudi, Anne M. Archibald, Zaven Arzoumanian, Paul T. Baker, Paul R. Brook, H. Thankful Cromartie, Kathryn Crowter, Maria Silvina De Biasi, Megan E. DeCesar, Paul B. Demorest, Timothy Dolch, Elizabeth C. Ferrara, William Fiore, Emmanuel Fonseca, Gabriel E. Freedman, Nate Garver-Daniels, Peter A. Gentile, Joseph Glaser, Deborah C. Good, Jeffrey S. Hazboun, Ross J. Jennings, Megan L. Jones, David L. Kaplan, Matthew Kerr, Duncan R. Lorimer, Jing Luo, Ryan S. Lynch, Alexander McEwen, Maura A. McLaughlin, Natasha McMann, Bradley W. Meyers, Cherry Ng, David J. Nice, Timothy T. Pennucci, Benetge B. P. Perera, Nihan S. Pol, Henri A. Radovan, Scott M. Ransom, Paul S. Ray, Ann Schmiedekamp, Carl Schmiedekamp, Brent J. Shapiro-Albert, Ingrid H. Stairs, Kevin Stovall, Abhimanyu Susobhanan, Joseph K. Swiggum, Haley M. Wahl High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Accurate pulsar astrometric estimates play an essential role in almost all high-precision pulsar timing experiments. Traditional pulsar timing techniques refine these estimates by including them as free parameters when fitting a model to observed pulse time-of-arrival measurements. However, reliable sub-milliarcsecond astrometric estimations require years of observations and, even then, power from red noise can be inadvertently absorbed into astrometric parameter fits, biasing the resulting estimations and reducing our sensitivity to red noise processes, including gravitational waves (GWs). In this work, we seek to mitigate these shortcomings by using pulsar astrometric estimates derived from Very Long Baseline Interferometry (VLBI) as priors for the timing fit. First, we calibrated a frame tie to account for the offsets between the reference frames used in VLBI and timing. Then, we used the VLBI-informed priors and timing-based likelihoods of several astrometric solutions consistent with both techniques to obtain a maximum-posterior astrometric solution. We found offsets between our results and the timing-based astrometric solutions, which, if real, would lead to absorption of spectral power at frequencies of interest for single-source GW searches. However, we do not find significant power absorption due to astrometric fitting at the low-frequency domain of the GW background.",
      "pdf_url": "https://arxiv.org/pdf/2509.21203.pdf",
      "published": "2025-10-06T01:31:20.267683",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.00707",
      "title": "Addressing Selected Gamma-Ray Burst Science Topics with Future Space Instruments",
      "authors": [
        "Nicolas De Angelis"
      ],
      "abstract": "Addressing Selected Gamma-Ray Burst Science Topics with Future Space Instruments Nicolas De Angelis 12 pages, PoS paper from the Frontier Research in Astrophysics - IV (FRAPWS2024) workshop High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Gamma-ray bursts (GRBs) are among the most energetic events in the universe, offering insights into stellar collapse, extreme matter behavior, and cosmic evolution. The advent of multi-messenger astronomy, combining electromagnetic, gravitational wave, and neutrino observations, alongside advances in high-energy polarimetry, is revolutionizing GRB research, enabling deeper exploration of their physical mechanisms. This manuscript summarizes how upcoming and proposed space-based missions will tackle key challenges in GRB science, focusing on four areas: (i) identifying high-redshift GRBs to probe the early universe, (ii) enhancing multi-messenger detection and localization, (iii) improving multi-wavelength follow-up of GRB afterglows, and (iv) studying prompt emission polarization to understand jet dynamics and magnetic fields. Highlighting planned missions and their advancements, this work provides a snapshot of current GRB research frontiers, with updates on the evolving status of these missions.",
      "pdf_url": "https://arxiv.org/pdf/2510.00707.pdf",
      "published": "2025-10-06T01:31:20.267852",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.01142",
      "title": "Pan-STARRS follow-up of the gravitational-wave event S250818k and the lightcurve of SN 2025ulz",
      "authors": [
        "J. H. Gillanders",
        "M. E. Huber",
        "M. Nicholl",
        "S. J. Smartt",
        "K. W. Smith",
        "K. C. Chambers",
        "D. R. Young",
        "J. W. Tweddle",
        "S. Srivastav",
        "M. D. Fulton",
        "F. Stoppa",
        "G. S. H. Paek",
        "A. Aamer",
        "M. R. Alarcon",
        "A. Andersson",
        "A. Aryan",
        "K. Auchettl",
        "T.-W. Chen",
        "T. de Boer",
        "A. K. H. Kong",
        "J. Licandro",
        "T. Lowe",
        "D. Magill",
        "E. A. Magnier",
        "P. Minguez",
        "T. Moore",
        "G. Pignata",
        "A. Rest",
        "M. Serra-Ricart",
        "B. J. Shappee",
        "I. A. Smith",
        "M. A. Tucker",
        "R. Wainscoat"
      ],
      "abstract": "Pan-STARRS follow-up of the gravitational-wave event S250818k and the lightcurve of SN 2025ulz J. H. Gillanders, M. E. Huber, M. Nicholl, S. J. Smartt, K. W. Smith, K. C. Chambers, D. R. Young, J. W. Tweddle, S. Srivastav, M. D. Fulton, F. Stoppa, G. S. H. Paek, A. Aamer, M. R. Alarcon, A. Andersson, A. Aryan, K. Auchettl, T.-W. Chen, T. de Boer, A. K. H. Kong, J. Licandro, T. Lowe, D. Magill, E. A. Magnier, P. Minguez, T. Moore, G. Pignata, A. Rest, M. Serra-Ricart, B. J. Shappee, I. A. Smith, M. A. Tucker, R. Wainscoat 22 pages, 7 figures, 2 tables. Submitted. Comments welcome! High Energy Astrophysical Phenomena (astro-ph.HE) Kilonovae are the scientifically rich, but observationally elusive, optical transient phenomena associated with compact binary mergers. Only a handful of events have been discovered to date, all through multi-wavelength (gamma ray) and multi-messenger (gravitational wave) signals. Given their scarcity, it is important to maximise the discovery possibility of new kilonova events. To this end, we present our follow-up observations of the gravitational-wave signal, S250818k, a plausible binary neutron star merger at a distance of $237 \\pm 62$ Mpc. Pan-STARRS tiled 286 and 318 square degrees (32% and 34% of the 90% sky localisation region) within 3 and 7 days of the GW signal, respectively. ATLAS covered 70% of the skymap within 3 days, but with lower sensitivity. These observations uncovered 47 new transients; however, none were deemed to be linked to S250818k. We undertook an expansive follow-up campaign of AT 2025ulz, the purported counterpart to S250818k. The griz-band lightcurve, combined with our redshift measurement ($z = 0.0849 \\pm 0.0003$) all indicate that SN 2025ulz is a SN IIb, and thus not the counterpart to S250818k. We rule out the presence of a AT 2017gfo-like kilonova within $\\approx 27$% of the distance posterior sampled by our Pan-STARRS pointings ($\\approx 9.1$% across the total 90% three-dimensional sky localisation). We demonstrate that early observations are optimal for probing the distance posterior of the three-dimensional gravitational-wave skymap, and that SN 2025ulz was a plausible kilonova candidate for $\\lesssim 5$ days, before ultimately being ruled out.",
      "pdf_url": "https://arxiv.org/pdf/2510.01142.pdf",
      "published": "2025-10-06T01:31:20.268255",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.02974",
      "title": "Dynamical evolution timescales for the supermassive black hole system in the galaxy NGC 7727 (Arp 222)",
      "authors": [
        "P. Berczik",
        "M. Ishchenko",
        "O. Veles",
        "M. Sobolenko",
        "K. Voggel",
        "C.M. Boily",
        "E. Polyachenko",
        "R. State"
      ],
      "abstract": "Dynamical evolution timescales for the supermassive black hole system in the galaxy NGC 7727 (Arp 222) P. Berczik, M. Ishchenko, O. Veles, M. Sobolenko, K. Voggel, C.M. Boily, E. Polyachenko, R. State Contains 7 pages, 7 figures, and 4 Tables. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Context. A dual active galactic nucleus candidate with a separation of only 500 pc was recently found in NGC 7727. According to the hierarchical merging scenario, such objects would be expected to merge on a timescale of a few hundred Myr. However, estimating the accurate merging timescales for the two nuclei is still a complex challenge. Aims. Using our numerical N-body code, we can trace the full evolution of central black holes during all phases: dynamical friction of unbound black holes, binary black hole formation, hardening of the system due to two-body scattering, and emission of gravitational waves leading to the final merger. Methods. Our model has next components: the bulge contains two dense stellar nuclei, each of which hosts a black hole. The most massive black hole in the center of the galaxy has a mass of 1.54x10^8 Msol and the least massive black hole in the offset second stripped nucleus has a mass of 6.33x10^6 Msol. We followed the dynamical evolution of the system up to a final separation of four Schwarzschild radii. The black holes were added as special relativistic particles and their equation of motion contains a full post-Newtonian approximation - 2.5 term. Results. Initially, the black holes are not gravitationally bound and, thus, the system spends more than 60 Myr in the phase of dynamical friction while tightening the orbit. The two-body scattering phase takes place from 60 Myr up to 120 Myr. In the last 10 Myr, the black hole's separation is seen to be rapidly shrinking due to the gravitational wave emission. Starting from the physical separation observed today, the total merging time in our model is 130 (10) Myr. Conclusions. These results have implications for the statistics of strong sources of gravitational waves at low frequencies, namely, systems engaged in an advanced state of are expected to be prime sources for the LISA mission to observe.",
      "pdf_url": "https://arxiv.org/pdf/2510.02974.pdf",
      "published": "2025-10-06T01:31:20.493982",
      "updated": null,
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    }
  ]
}