{
  "date": "2025-10-17",
  "crawl_timestamp": "2025-10-17T01:31:11.923482",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 159,
    "total_gw_papers": 14,
    "by_category": {
      "gr-qc": {
        "total": 35,
        "gw_related": 8
      },
      "astro-ph": {
        "total": 108,
        "gw_related": 5
      }
    }
  },
  "crawl_verification": {
    "total_expected": 222,
    "total_actual": 222,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 51,
        "actual_crawled": 51,
        "page_source_info": "Total of 51 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 34,
        "actual_crawled": 34,
        "page_source_info": "Total of 34 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 41,
        "actual_crawled": 41,
        "page_source_info": "Total of 41 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 35,
        "actual_crawled": 35,
        "page_source_info": "Total of 35 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 24,
        "actual_crawled": 24,
        "page_source_info": "Total of 24 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 23,
        "actual_crawled": 23,
        "page_source_info": "Total of 23 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 14,
        "actual_crawled": 14,
        "page_source_info": "Total of 14 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.13677",
      "title": "APRIL: Auxiliary Physically-Redundant Information in Loss - A physics-informed framework for parameter estimation with a gravitational-wave case study",
      "authors": [
        "Matteo Scialpi",
        "Francesco Di Clemente",
        "Leigh Smith",
        "Michał Bejger"
      ],
      "abstract": "APRIL: Auxiliary Physically-Redundant Information in Loss - A physics-informed framework for parameter estimation with a gravitational-wave case study Matteo Scialpi, Francesco Di Clemente, Leigh Smith, Michał Bejger General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM); Neural and Evolutionary Computing (cs.NE); Computational Physics (physics.comp-ph) Physics-Informed Neural Networks (PINNs) embed the partial differential equations (PDEs) governing the system under study directly into the training of Neural Networks, ensuring solutions that respect physical laws. While effective for single-system problems, standard PINNs scale poorly to datasets containing many realizations of the same underlying physics with varying parameters. To address this limitation, we present a complementary approach by including auxiliary physically-redundant information in loss (APRIL), i.e. augment the standard supervised output-target loss with auxiliary terms which exploit exact physical redundancy relations among outputs. We mathematically demonstrate that these terms preserve the true physical minimum while reshaping the loss landscape, improving convergence toward physically consistent solutions. As a proof-of-concept, we benchmark APRIL on a fully-connected neural network for gravitational wave (GW) parameter estimation (PE). We use simulated, noise-free compact binary coalescence (CBC) signals, focusing on inspiral-frequency waveforms to recover the chirp mass $\\mathcal{M}$, the total mass $M_\\mathrm{tot}$, and symmetric mass ratio $\\eta$ of the binary. In this controlled setting, we show that APRIL achieves up to an order-of-magnitude improvement in test accuracy, especially for parameters that are otherwise difficult to learn. This method provides physically consistent learning for large multi-system datasets and is well suited for future GW analyses involving realistic noise and broader parameter ranges.",
      "pdf_url": "https://arxiv.org/pdf/2510.13677.pdf",
      "published": "2025-10-17T01:31:10.860657",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM",
        "cs.NE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.12984",
      "title": "When Tiny Halos Stir Spacetime: Gravitational Waves from Fifth-Force Mergers",
      "authors": [
        "Xinpeng Wang",
        "Yifan Lu",
        "Zachary S. C. Picker",
        "Alexander Kusenko",
        "Misao Sasaki"
      ],
      "abstract": "When Tiny Halos Stir Spacetime: Gravitational Waves from Fifth-Force Mergers Xinpeng Wang, Yifan Lu, Zachary S. C. Picker, Alexander Kusenko, Misao Sasaki Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Dark matter fermions interacting via attractive fifth forces mediated by a light mediator can form dark matter halos in the very early universe. We show that bound systems composed of these halos are capable of generating gravitational wave (GW) signals detectable today, even when the individual halos are very light. The Yukawa force dominates the dynamics of these halo binaries, rather than gravity. As a result, large GW signals can be produced at initially extremely high frequencies, which are then redshifted to frequency bands accessible to current or future GW observatories. In addition, the resulting GW signals carry distinctive features that enable future observations to distinguish them from conventional ones. Notably, even if only a tiny fraction of dark matter experiences strong fifth-force interactions, such effects provide a new avenue to discover self-interacting dark matter through GW observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.12984.pdf",
      "published": "2025-10-17T01:31:10.861749",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.CO",
        "cross_list_from": "astro-ph.CO"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13066",
      "title": "Gravitational-Wave Signatures of Highly Eccentric Stellar-Mass Binary Black Holes in Galactic Nuclei",
      "authors": [
        "Evgeni Grishin",
        "Isobel M. Romero-Shaw",
        "Alessandro A. Trani"
      ],
      "abstract": "Gravitational-Wave Signatures of Highly Eccentric Stellar-Mass Binary Black Holes in Galactic Nuclei Evgeni Grishin, Isobel M. Romero-Shaw, Alessandro A. Trani MNRAS submitted, comments welcome! High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) A significant fraction of compact-object mergers in galactic nuclei are expected to be eccentric in the Laser-Interferometer-Space-Antenna (LISA) frequency sensitivity range, $10^{-4} - 10^{-1}\\ \\rm Hz$. Several compact binaries detected by the LIGO-Virgo-KAGRA Collaboration may retain hints of residual eccentricity at $10$~Hz, suggesting dynamical or triple origins for a significant fraction of the gravitational-wave-observable population. In triple systems, von-Zeipel-Lidov-Kozai oscillations perturb both the eccentricity and the argument of pericentre, $\\omega$, of the inner black hole binary. The latter could be fully \\textit{circulating}, where $\\omega$ cycles through $2\\pi$, or may \\textit{librate}, with $\\omega$ ranges about a fixed value with small or large variation. We use \\texttt{TSUNAMI}, a regularised N-body code with up to 3.5 post-Newtonian (PN) term corrections, to identify four different families of orbits: (i) circulating, (ii) small and (iii) large amplitude librating, and (iv) merging orbits. We develop and demonstrate a new method to construct gravitational waveforms using the quadrupole formula utilising the instantaneous {\\it total} acceleration of each binary component in \\texttt{TSUNAMI}. We show that the four orbital families have distinct waveform phenomenologies, enabling them to be distinguished if observed in LISA. The orbits are also distinguishable from an isolated binary or from a binary perturbed by a different tertiary orbit, even if the secular timescale is the same. Future burst timing models will be able to distinguish the different orbital configurations. For efficient binary formation, about $\\sim 50$ binaries can have librating orbits in the Galactic Centre.",
      "pdf_url": "https://arxiv.org/pdf/2510.13066.pdf",
      "published": "2025-10-17T01:31:10.862099",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2411.11746",
      "title": "Impact of correlated magnetic noise on directional stochastic gravitational-wave background searches",
      "authors": [
        "Stavros Venikoudis",
        "Federico De Lillo",
        "Kamiel Janssens",
        "Jishnu Suresh",
        "Giacomo Bruno"
      ],
      "abstract": "Impact of correlated magnetic noise on directional stochastic gravitational-wave background searches Stavros Venikoudis, Federico De Lillo, Kamiel Janssens, Jishnu Suresh, Giacomo Bruno General Relativity and Quantum Cosmology (gr-qc) One potential factor that could impede searches for the stochastic gravitational-wave background (SGWB), arising from the incoherent superposition of a multitude of weak and unresolvable gravitational-wave signals in the Universe, is correlated magnetic noise at Earth-scale distances, such as the Schumann resonances. As the sensitivity of terrestrial detectors to SGWBs increases, these effects are expected to become even more pronounced, emphasizing the importance of considering correlated noise sources in SGWB searches. In this study, we explore for the first time the impact of this class of noise on anisotropic SGWB searches. We focus on the low-frequency range of 20-200 Hz with a resolution of 1/32 Hz, using data from the LEMI-120 and Metronix MFS-06e magnetometers, located at the sites of the Advanced LIGO and Advanced Virgo interferometers, respectively, during the third observing run. These measurements were then compared with the directional upper limit derived from gravitational-wave data collected during the third observing run of the LIGO-Virgo-KAGRA collaboration. The results indicate that the magnetic noise correlations are below the interferometers' sensitivity level during the O3 observing run. The potential impact of magnetic correlations on the Advanced LIGO detectors has also been investigated at the A+ design sensitivity level.",
      "pdf_url": "https://arxiv.org/pdf/2411.11746.pdf",
      "published": "2025-10-17T01:31:10.863624",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2411.13714",
      "title": "Gravitational-wave signatures of non-violent non-locality",
      "authors": [
        "Brian C. Seymour",
        "Yanbei Chen"
      ],
      "abstract": "Gravitational-wave signatures of non-violent non-locality Brian C. Seymour, Yanbei Chen 12 pages, 9 figures, small changes for PRL resubmission General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) Measurement of gravitational waves can provide precision tests of the nature of black holes and compact objects. In this work, we test Giddings' non-violent non-locality proposal, which posits that quantum information is transferred via a nonlocal interaction that generates metric perturbations around black holes. In contrast to firewalls, these quantum fluctuations would be spread out over a larger distance range -- up to a Schwarzschild radius away. In this letter, we model the modification to the gravitational waveform from non-violent non-locality. We modify the nonspinning EOBNRv2 effective one body waveform to include metric perturbations that are due to a random Gaussian process. We find that the waveform exhibits random deviations which are particularly important in the late inspiral-plunge phase. We find an optimal dephasing parameter for detecting this effect with a principal component analysis. This is particularly intriguing because it predicts random phase deviations across different gravitational wave events, providing theoretical support for hierarchical tests of general relativity. We estimate the constraint on the perturbations in non-violent non-locality with events for the LIGO-Virgo network and for a third-generation network.",
      "pdf_url": "https://arxiv.org/pdf/2411.13714.pdf",
      "published": "2025-10-17T01:31:10.863811",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2412.13379",
      "title": "Rapid inference for individual binaries and a stochastic background with pulsar timing array data",
      "authors": [
        "Aiden Gundersen",
        "Neil J. Cornish"
      ],
      "abstract": "Rapid inference for individual binaries and a stochastic background with pulsar timing array data Aiden Gundersen, Neil J. Cornish General Relativity and Quantum Cosmology (gr-qc) The analysis of pulsar timing array data has provided evidence for a gravitational wave background in the nanohertz band. This raises the question of what is the source of the signal, is it astrophysical or cosmological in origin? If the signal originates from a population of supermassive black hole binaries, as is generally assumed, we can expect to see evidence for both anisotropy and to be able to resolve signals from individual binaries as more data are collected. The anisotropy and resolvable systems are caused by a small number of loud signals that stand out from the crowd. Here we focus on the joint detection of individual signals and a stochastic background. While methods have previously been developed to perform such an analysis, they are currently held back by the cost of computing the joint likelihood function. Each individual source is described by $N=8+2N_p$ parameters, where $N_p$ are the number of pulsars in the array. With the latest combined datasets having over one hundred pulsars, the parameter space is very large, and consequently, it takes a large number of likelihood evaluations to explore these models. Here we present a new approach that extends the Fourier basis method, previously introduced to accelerate analyses for stochastic signals, to also include deterministic signals. Key elements of the method are that the likelihood evaluations are per-pulsar, avoiding expensive operations on large matrices, and the templates for individual binaries can be computed analytically or using fast Fourier methods on a sparsely sampled grid of time samples. This analysis method scales better than quadratically with the size of the dataset, while the approach currently being used in most analyses scales quartically or worse with the number of data points. As datasets grow with more observations, this analysis will be orders of magnitude faster than previous approaches.",
      "pdf_url": "https://arxiv.org/pdf/2412.13379.pdf",
      "published": "2025-10-17T01:31:10.864021",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2502.06451",
      "title": "Looking To The Horizon: Probing Evolution in the Black Hole Spectrum With Gravitational Wave Catalogs",
      "authors": [
        "Jam Sadiq",
        "Thomas Dent",
        "Ana Lorenzo-Medina"
      ],
      "abstract": "Looking To The Horizon: Probing Evolution in the Black Hole Spectrum With Gravitational Wave Catalogs Jam Sadiq, Thomas Dent, Ana Lorenzo-Medina Phys. Rev. D 112, 083028 (2025) General Relativity and Quantum Cosmology (gr-qc) The population of black holes observed via gravitational waves currently covers the local universe up to a redshift $z\\lesssim 1$, for the most massive merging binaries, or $z\\lesssim 0.25$ for low-mass BH binaries (BBH). Evolution of the BBH mass spectrum over cosmic time will be a significant probe of formation channels and environments. We demonstrate a reconstruction of the BBH merger rate, allowing for general dependence on binary masses and luminosity distance or redshift and accounting for selection effects, via iterative kernel density estimation (KDE) with optimized multidimensional bandwidths. Performing such reconstructions under a range of detailed assumptions, we see no significant evidence for the evolution of BBH masses with redshift, over the range where detected events are available. At most, possible trends towards increasing merger rate with redshift for primary masses $m_1\\gtrsim 50\\,M_\\odot$, or towards decreasing merger rate with redshift for primary masses $m_1 \\lesssim 40 M\\odot$ may be supported. We compare these findings with previous investigations and caution against over-interpreting the current, sparse, data. Significantly upgraded detectors and/or facilities, and longer observing times, are required to harness any correlations of the BBH mass distribution with redshift.",
      "pdf_url": "https://arxiv.org/pdf/2502.06451.pdf",
      "published": "2025-10-17T01:31:10.864211",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.05029",
      "title": "Inferring the spins of merging black holes in the presence of data-quality issues",
      "authors": [
        "Rhiannon Udall",
        "Sophie Bini",
        "Katerina Chatziioannou",
        "Derek Davis",
        "Sophie Hourihane",
        "Yannick Lecoeuche",
        "Jess McIver",
        "Simona Miller"
      ],
      "abstract": "Inferring the spins of merging black holes in the presence of data-quality issues Rhiannon Udall, Sophie Bini, Katerina Chatziioannou, Derek Davis, Sophie Hourihane, Yannick Lecoeuche, Jess McIver, Simona Miller General Relativity and Quantum Cosmology (gr-qc) Gravitational waves from black hole binary mergers carry information about the component spins, but inference is sensitive to analysis assumptions, which may be broken by terrestrial noise transients known as glitches. Using a variety of simulated glitches and gravitational wave signals, we study the conditions under which glitches can bias spin measurements. We confirm the theoretical expectation that inference and subtraction of glitches invariably leaves behind residual power due to statistical uncertainty, no matter the strength (signal-to-noise ratio; SNR) of the original glitch. Next we show that low-SNR glitches - including those below the threshold for flagging data-quality issues - can still significantly bias spin inference. Such biases occur for a range of glitch morphologies, even in cases where glitches and signals are not precisely aligned in phase. Furthermore, we find that residuals of glitch subtraction can result in biases as well. Our results suggest that joint inference of the glitch and gravitational wave parameters, with appropriate models and priors, is required to address these uncertainties inherent in glitch mitigation via subtraction.",
      "pdf_url": "https://arxiv.org/pdf/2510.05029.pdf",
      "published": "2025-10-17T01:31:10.866081",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.11790",
      "title": "False Alarm Rates in Detecting Gravitational Wave Lensing from Astrophysical Coincidences: Insights with Model-Independent Technique GLANCE",
      "authors": [
        "Aniruddha Chakraborty",
        "Suvodip Mukherjee"
      ],
      "abstract": "False Alarm Rates in Detecting Gravitational Wave Lensing from Astrophysical Coincidences: Insights with Model-Independent Technique GLANCE Aniruddha Chakraborty, Suvodip Mukherjee 18 pages, 10 figures (including appendices) General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The strong lensing gravitational waves (GWs) due to intervening massive astrophysical systems between the source and an observer are an inevitable consequence of the general theory of relativity, which can produce multiple GW events in overlapping sky localization error. However, the confirmed detection of such a unique astrophysical phenomenon is challenging due to several sources of contamination, arising from detector noise to astrophysical uncertainties. Robust model-independent search techniques that can mitigate noise contamination were developed in the past. In this study, we explore the astrophysical uncertainty associated with incorrectly classifying a pair of unlensed GW events as a lensed event, and the associated False Alarm Rate (FAR) depending on the GW source properties. To understand the effect of unlensed astrophysical GW sources in producing false lensing detections, we have performed a model-independent test using the pipeline GLANCE on a simulated population of merging binary-black holes (BBHs). We find that $\\sim$ 0.01\\% of the event pairs can be falsely classified as lensed with a lensing threshold signal-to-noise ratio of 1.5, appearing at a time delay between the event pairs of $\\sim$ 1000 days or more. We show the FAR distribution for the parameter space of GW source masses, delay time, and lensing magnification parameter over which the model-independent technique GLANCE can confidently detect lensed GW pair with the current LIGO detector sensitivity. In the future, this technique will be useful for understanding the FAR of the upcoming next-generation GW detectors, which can observe many more GW sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.11790.pdf",
      "published": "2025-10-17T01:31:10.866501",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13477",
      "title": "Probing Primordial black holes with the distortion of Stochastic Gravitational Wave Background",
      "authors": [
        "Mingqi Sun",
        "Liao Kai",
        "Xi-Long Fan"
      ],
      "abstract": "Probing Primordial black holes with the distortion of Stochastic Gravitational Wave Background Mingqi Sun, Liao Kai, Xi-Long Fan Cosmology and Nongalactic Astrophysics (astro-ph.CO) The stochastic gravitational-wave background (SGWB), arising from the incoherent superposition of numerous compact binary coalescences, serves as a powerful probe of both astrophysical populations and fundamental physics. In this work, we investigate the influence of gravitational lensing on the SGWB, focusing on primordial black holes (PBHs) as potential lenses. Assuming PBHs as dark matter candidates with a broad cosmic distribution, we show that their lensing optical depth can be significantly enhanced, producing pronounced effects with relative deviations at the 10^-1 level. By systematically varying the PBH mass (M_PBH) and abundance (f_PBH), we demonstrate that the mass predominantly determines the frequency-dependent diffraction features of the spectrum, while the abundance primarily amplifies the overall lensing-induced deviation. Although the SGWB from binary black holes has not yet been observed, our analytical results provide theoretical insight into the possible imprint of lensing on its spectrum and suggest that future detections could offer a novel avenue to constrain dark matter scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2510.13477.pdf",
      "published": "2025-10-17T01:31:10.964003",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.12932",
      "title": "Strategy for identifying Vera C. Rubin Observatory kilonova candidates for targeted gravitational-wave searches",
      "authors": [
        "Simon Stevenson",
        "Anais Möller",
        "Jade Powell"
      ],
      "abstract": "Strategy for identifying Vera C. Rubin Observatory kilonova candidates for targeted gravitational-wave searches Simon Stevenson, Anais Möller, Jade Powell High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Since the observation of the binary neutron star merger GW170817 and the associated kilonova AT2017gfo, the next joint gravitational-wave/optical kilonova has been highly anticipated. Overlapping observations between the Vera C. Rubin Observatory and the international gravitational-wave detector network are expected soon. Wide-field survey facilities, such as Rubin, can serve dual roles in gravitational-wave astronomy: conducting dedicated optical counterpart searches following gravitational-wave triggers and, through surveys such as the Legacy Survey of Space and Time (LSST), providing opportunities for fortuitous kilonova discoveries during routine operations. We use simulations to develop a strategy for identifying kilonova candidates observed by Rubin and processed by the Fink broker. These candidates can be used as astrophysical triggers for a targeted gravitational-wave search. We simulate kilonovae light-curves for the first year of Rubin with the latest observing strategy for the Wide-Fast-Deep and the Deep Drilling Fields. Assuming a kilonova rate of 250 Gpc$^{-3}$ yr$^{-1}$, we find that Rubin brokers should observe $\\sim 4$ kilonovae per year with at least one alert above a signal-to-noise ratio of 5 within the gravitational-wave detector horizon ($\\sim 350$ Mpc). Most of these will be faint, and detected 1-2 days following the neutron star merger. Photometric and spectroscopic follow-up will be limited to large telescopes. Using archival data from the Zwicky Transient Facility (ZTF) and our proposed selection criteria, we estimate a minimum contamination of at least 30 events per month from other transients and variables, even under our strictest selection criteria. A deep gravitational-wave search targeting Rubin kilonova candidates may lead to the next multi-messenger discovery.",
      "pdf_url": "https://arxiv.org/pdf/2510.12932.pdf",
      "published": "2025-10-17T01:31:10.966258",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.04751",
      "title": "Gravitational Wave Production and Baryogenesis in a Simple Left-Right model",
      "authors": [
        "Arnab Dasgupta",
        "Matthew Knauss",
        "Marc Sher"
      ],
      "abstract": "Gravitational Wave Production and Baryogenesis in a Simple Left-Right model Arnab Dasgupta, Matthew Knauss, Marc Sher 28 pages, 3 tables, 3 figures. Version published in this http URL. D High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The left-right model with the simplest Higgs structure has a $SU(2)_L$ doublet $H_L$, a $SU(2)_R$ doublet $H_R$, and a singlet $\\sigma$ that couples to the doublets as $\\sigma(|H_L|^2-|H_R|^2)$. The left-right symmetry has $H_L\\leftrightarrow H_R$ and $\\sigma\\leftrightarrow-\\sigma$. We study gravitational wave production and baryogenesis in the electroweak phase transitions in the model. For two benchmark points, $\\sigma$ first gets a vev, followed by $H_R$ and then $H_L$. An interesting feature is that the vev of $H_L$ is initially much higher than its zero temperature value, leading to a more strongly first-order transition and higher frequency gravitational waves. An unusual benchmark point has the $\\sigma$ vev at zero when the electroweak symmetry breaks. This results in both $H_L$ and $H_R$ vevs being equal and in the multi-TeV range. At a lower temperature, the $\\sigma$ vev turns on, breaking the left-right symmetry and $H_L$ drops to its standard model value. Since the electroweak symmetry is broken at the multi-TeV scale, the frequency of gravitational waves will be much higher than usual. Baryogenesis is also discussed.",
      "pdf_url": "https://arxiv.org/pdf/2505.04751.pdf",
      "published": "2025-10-17T01:31:10.969331",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.13074",
      "title": "Gravitational-Wave Signatures of Highly Eccentric Stellar Binary Black-Holes in Galactic Nuclei",
      "authors": [
        "Evgeni Grishin",
        "Isobel M. Romero-Shaw",
        "Alessandro A. Trani"
      ],
      "abstract": "Gravitational-Wave Signatures of Highly Eccentric Stellar Binary Black-Holes in Galactic Nuclei Evgeni Grishin, Isobel M. Romero-Shaw, Alessandro A. Trani 4 pages, 3 figures. Proceedings contribution to IAU Symposium 398 (MODEST-25, Seoul, June 2025); to appear in the IAU Proceedings Series High Energy Astrophysical Phenomena (astro-ph.HE) A significant fraction of gravitational-wave mergers are expected to be eccentric in the Laser-Interferometer-Space-Antenna (LISA) frequency band, $10^{-4} - 10^{-1}$ Hz. Several LIGO-Virgo-KAGRA events show potential hints of residual eccentricity at 10 Hz, pointing to dynamical or triple origins for part of the population, where von-Zeipel-Lidov-Kozai oscillations can perturb both the eccentricity and the inclination of the binary. Moreover, the argument of pericentre, $\\omega$ could be fully circulating, or librating, with a limited range for $\\omega$. We use TSUNAMI, a regularised N-body code with 3.5PN corrections to identify four different orbital families: (i) circulating, (ii) small-amplitude and (iii) large-amplitude librating, and (iv) merging. We develop a new method to construct gravitational-wave waveforms using the quadrupole formula from the instantaneous acceleration in TSUNAMI. The four orbital families have distinct waveform phenomenologies, enabling them to be distinguished if observed in LISA. In particular, the properties of the tertiary companion can be inferred and serve as an independent mass measurement and distinguish field triple dynamics from galactic dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2510.13074.pdf",
      "published": "2025-10-17T01:31:11.158770",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.11861",
      "title": "Impact of facility timing and coordination for next-generation gravitational-wave detectors",
      "authors": [
        "Ssohrab Borhanian",
        "Arianna Renzini",
        "Philippa S. Cole",
        "Costantino Pacilio",
        "Michele Mancarella",
        "Davide Gerosa"
      ],
      "abstract": "Impact of facility timing and coordination for next-generation gravitational-wave detectors Ssohrab Borhanian, Arianna Renzini, Philippa S. Cole, Costantino Pacilio, Michele Mancarella, Davide Gerosa General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) While the Einstein Telescope and Cosmic Explorer proposals for next-generation, ground-based detectors promise vastly improved sensitivities to gravitational-wave signals, only joint observations are expected to enable the full scientific potential of these facilities, making timing and coordination between the efforts crucial to avoid missed opportunities. This study investigates the impact of long-term delays on the scientific capabilities of next-generation detector networks. We use the Fisher information formalism to simulate the performance of a set of detector networks for large, fiducial populations of binary black holes, binary neutron stars, and primordial black-hole binaries. Bootstrapping the simulated populations, we map the expected observation times required to reach a number of observations fulfilling scientific targets for key sensitivity and localization metrics across various network configurations. We also investigate the sensitivity to stochastic backgrounds. We find that purely sensitivity-driven metrics such as the signal-to-noise ratio are not strongly affected by delays between facilities. This is contrasted by the localization metrics, which are very sensitive to the number of detectors in the network and, by extension, to delayed observation campaigns for a detector. Effectively, delays in one detector behave like network-wide interruptions for the localization metrics for networks consisting of two next-generation facilities. We examine the impact of a supporting, current-generation detector such as LIGO India operating concurrently with next-generation facilities and find such an addition will greatly mitigate the negative effects of delays for localization metrics, with important consequences on multi-messenger science and stochastic searches.",
      "pdf_url": "https://arxiv.org/pdf/2510.11861.pdf",
      "published": "2025-10-17T01:31:11.162499",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from gr-qc",
        "cross_list_from": "gr-qc"
      }
    }
  ]
}