{
  "date": "2025-10-10",
  "crawl_timestamp": "2025-10-10T01:31:07.509232",
  "query": "cat:gr-qc OR cat:astro-ph.* (filtered for gravitational waves)",
  "summary": {
    "total_crawled": 168,
    "total_gw_papers": 27,
    "by_category": {
      "gr-qc": {
        "total": 36,
        "gw_related": 13
      },
      "astro-ph": {
        "total": 108,
        "gw_related": 10
      }
    }
  },
  "crawl_verification": {
    "total_expected": 235,
    "total_actual": 235,
    "verification_passed": true,
    "category_details": [
      {
        "category": "gr-qc",
        "url": "https://arxiv.org/list/gr-qc/new",
        "expected_total": 54,
        "actual_crawled": 54,
        "page_source_info": "Total of 54 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.CO",
        "url": "https://arxiv.org/list/astro-ph.CO/new",
        "expected_total": 34,
        "actual_crawled": 34,
        "page_source_info": "Total of 34 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.HE",
        "url": "https://arxiv.org/list/astro-ph.HE/new",
        "expected_total": 35,
        "actual_crawled": 35,
        "page_source_info": "Total of 35 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.GA",
        "url": "https://arxiv.org/list/astro-ph.GA/new",
        "expected_total": 47,
        "actual_crawled": 47,
        "page_source_info": "Total of 47 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.SR",
        "url": "https://arxiv.org/list/astro-ph.SR/new",
        "expected_total": 29,
        "actual_crawled": 29,
        "page_source_info": "Total of 29 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.IM",
        "url": "https://arxiv.org/list/astro-ph.IM/new",
        "expected_total": 21,
        "actual_crawled": 21,
        "page_source_info": "Total of 21 entries",
        "success": true,
        "verification_passed": true
      },
      {
        "category": "astro-ph.EP",
        "url": "https://arxiv.org/list/astro-ph.EP/new",
        "expected_total": 15,
        "actual_crawled": 15,
        "page_source_info": "Total of 15 entries",
        "success": true,
        "verification_passed": true
      }
    ]
  },
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.06327",
      "title": "Bayesian Calibration of Gravitational-Wave Detectors Using Null Streams Without Waveform Assumptions",
      "authors": [
        "Isaac C. F. Wong",
        "Francesco Cireddu",
        "Milan Wils",
        "Tom Colemont",
        "Harsh Narola",
        "Chris Van Den Broeck",
        "Tjonnie G. F. Li"
      ],
      "abstract": "Bayesian Calibration of Gravitational-Wave Detectors Using Null Streams Without Waveform Assumptions Isaac C. F. Wong, Francesco Cireddu, Milan Wils, Tom Colemont, Harsh Narola, Chris Van Den Broeck, Tjonnie G. F. Li General Relativity and Quantum Cosmology (gr-qc) We introduce a Bayesian null-stream method to constrain calibration errors in closed-geometry gravitational-wave (GW) detector networks. Unlike prior methods requiring electromagnetic counterparts or waveform models, this method uses sky-independent null streams to calibrate the detectors with any GW signals, independent of general relativity or waveform assumptions. We show a proof-of-concept study to demonstrate the feasibility of the method. We discuss prospects for next-generation detectors like Einstein Telescope, Cosmic Explorer, and LISA, where enhanced calibration accuracy will advance low-frequency GW science.",
      "pdf_url": "https://arxiv.org/pdf/2510.06327.pdf",
      "published": "2025-10-10T01:31:06.358384",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06330",
      "title": "A Parametrized Test of General Relativity for LISA Massive Black Hole Binary Inspirals",
      "authors": [
        "Manuel Piarulli",
        "Sylvain Marsat",
        "Elise M. Sänger",
        "Alessandra Buonanno",
        "Jan Steinhoff",
        "Nicola Tamanini"
      ],
      "abstract": "A Parametrized Test of General Relativity for LISA Massive Black Hole Binary Inspirals Manuel Piarulli, Sylvain Marsat, Elise M. Sänger, Alessandra Buonanno, Jan Steinhoff, Nicola Tamanini General Relativity and Quantum Cosmology (gr-qc) Laser Interferometer Space Antenna (LISA) observations of massive black hole binaries (MBHBs) will provide long duration inspiral signals with high signal-to-noise ratio (SNR) data, ideal for testing general relativity (GR) in the strong-field and high-velocity regime. We present an extension of the Flexible Theory-Independent (FTI) framework, adapted to gravitational waves (GWs) from MBHBs observed with LISA, to perform parametrized inspiral tests of GR. This approach introduces generic deviations to the post-Newtonian (PN) coefficients of the frequency-domain GW phase while accounting for the time- and frequency-dependent instrument response, thus effectively identifying potential deviations from GR by constraining modifications to the PN phasing formula. Complementary analyses using Fisher matrix and full Bayesian approaches confirm that LISA observations could improve constraints on deviations from GR by at least two orders of magnitude compared to the most recent LIGO-Virgo-KAGRA measurements. Since LISA`s sensitivity to different GW phases -- inspiral, merger, and ringdown -- varies across the MBHB parameter space with masses between $10^4$ and $10^7M_{\\odot}$, the optimal regime for testing deviations is not known a priori. Our results illustrate how the strength of these constraints depends significantly on both the total mass and the SNR, reflecting the trade-off between inspiral and merger-ringdown contributions to the observed signal. We also investigate the interplay between inspiral-only versus inspiral-merger-ringdown analyses in constraining these inspiral deviation parameters. This work contributes to the development of robust tests of GR with LISA, enhancing our ability to probe the nature of gravity and BHs with GW observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.06330.pdf",
      "published": "2025-10-10T01:31:06.358654",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06393",
      "title": "A comprehensive look into the accuracy of SpEC binary black hole waveforms",
      "authors": [
        "Taylor Knapp",
        "Katerina Chatziioannou",
        "Keefe Mitman",
        "Mark A. Scheel",
        "Michael Boyle",
        "Lawrence E. Kidder",
        "Harald Pfeiffer"
      ],
      "abstract": "A comprehensive look into the accuracy of SpEC binary black hole waveforms Taylor Knapp, Katerina Chatziioannou, Keefe Mitman, Mark A. Scheel, Michael Boyle, Lawrence E. Kidder, Harald Pfeiffer 16 pages, 10 figures (submitting to PRD) General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Numerical relativity simulations provide a full description of the dynamics of binary systems, including gravitational radiation. The waveforms produced by these simulations have a number of applications in gravitational-wave detection and inference. In this work, we revisit the accuracy of the waveforms produced by the Spectral Einstein Code. Motivated by the wide range of waveform applications, we propose and explore three accuracy metrics between simulation resolutions: (i) the generalized frequency-weighted mismatch, (ii) the relative amplitude difference, and (iii) the phase difference at different times. We find that numerical errors accumulate over the binary evolution, but the error is not intrinsically larger during the latest, more dynamical stages. Studying errors across the parameter space, we identify a positive correlation between both the mismatch and the phase difference with precessing spin, but little correlation with aligned spin or eccentricity. Lastly, amplitude and phases differences are symmetric upon exchanging resolutions across the catalog, suggesting that there is no systematic error.",
      "pdf_url": "https://arxiv.org/pdf/2510.06393.pdf",
      "published": "2025-10-10T01:31:06.359035",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06948",
      "title": "When vacuum breaks: a self-consistency test for astrophysical environments in extreme mass ratio inspirals",
      "authors": [
        "Lorenzo Copparoni",
        "Rohit S. Chandramouli",
        "Enrico Barausse"
      ],
      "abstract": "When vacuum breaks: a self-consistency test for astrophysical environments in extreme mass ratio inspirals Lorenzo Copparoni, Rohit S. Chandramouli, Enrico Barausse General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA) Gravitational-wave signals are typically interpreted under the vacuum hypothesis, i.e. assuming negligible influence from the astrophysical environment. This assumption is expected to break down for low-frequency sources such as extreme mass ratio inspirals (EMRIs), which are prime targets for the Laser Interferometer Space Antenna (LISA) and are expected to form, at least in part, in dense environments such as Active Galactic Nuclei or dark-matter spikes/cores. Modeling environmental effects parametrically is challenging due to the large uncertainties in their underlying physics. We propose a non-parametric test for environmental effects in EMRIs, based on assessing the self-consistency of vacuum parameter posteriors inferred from different portions of the signal. Our results demonstrate that this approach can reveal the presence of astrophysical environments, or even deviations from General Relativity, without introducing additional parameters or assumptions about the underlying physics.",
      "pdf_url": "https://arxiv.org/pdf/2510.06948.pdf",
      "published": "2025-10-10T01:31:06.360380",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.GA"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.07228",
      "title": "GW231123: extreme spins or microglitches?",
      "authors": [
        "Anarya Ray",
        "Sharan Banagiri",
        "Eric Thrane"
      ],
      "abstract": "GW231123: extreme spins or microglitches? Anarya Ray, Sharan Banagiri, Eric Thrane General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) The recently reported binary black hole merger, GW231123, has unusual properties that make it hard to explain astrophysically. Parameter estimation studies are consistent with maximally spinning black holes and the dimensionless spin of the more massive component is constrained to be $\\chi_1\\gtrsim 0.8$. Analysis of data also revealed potential systematics that could not be fully replicated with simulated studies. We explore the possibility that these measurements are biased due to unmodeled non-Gaussian noise in the detectors, and that the actual black hole spins are more modest. We present evidence for a population of \\textit{microglitches} in LIGO gravitational-wave strain data that can lead to biases in the parameter estimation of short-duration signals such as GW231123. Using simulated data of a massive event like GW231123, we demonstrate how microglitches can bias our measurements of black hole spins toward $\\chi\\approx1$ with negligible posterior support for the true value of $\\chi\\approx0.7$. We develop a noise model to account for microglitches and show that this model successfully reduces biases in the recovery of signal parameters. We characterize the microglitch population in real interferometer data surrounding GW231123 and find a single detector glitch duty cycle of $0.57_{-0.19}^{+0.21}$, which implies nearly a $100\\%$ probability that at least one event through the fourth gravitational wave transient catalog coincides with microglitches in two detectors. We argue that further investigations are required before we can have a confident picture of the astrophysical properties of GW231123.",
      "pdf_url": "https://arxiv.org/pdf/2510.07228.pdf",
      "published": "2025-10-10T01:31:06.360935",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.07232",
      "title": "Can One Model Gravitational Nonlinear Memory with Fractional Derivative Operators?",
      "authors": [
        "Sercan Kaya",
        "Bayram Tekin"
      ],
      "abstract": "Can One Model Gravitational Nonlinear Memory with Fractional Derivative Operators? Sercan Kaya, Bayram Tekin General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph) We investigate whether fractional calculus, with its intrinsic long-tailed memory and nonlocal features, can provide a viable model for gravitational-wave memory effects. We consider two toy constructions: ($i$) a fractional modification of the linearized Einstein field equations using a sequential Caputo operator, and ($ii$) a fractionalized quadrupole formula where the source moment is acted upon by the same operator. Both constructions yield history-dependent responses with small memory-like offsets. However, in all cases, the signal decays to zero at late times, failing to reproduce the permanent displacement predicted by GR. Our results, therefore, constitute a no-go demonstration: naive fractionalization is insufficient to model nonlinear gravitational memory. We argue that any successful model must incorporate fractional kernels directly into the hereditary flux-balance integral of General Relativity, while preserving gauge invariance and dimensional consistency. We also discuss possible connections to modified gravity and the absence of memory in the spacetime with dimensions $D>4$.",
      "pdf_url": "https://arxiv.org/pdf/2510.07232.pdf",
      "published": "2025-10-10T01:31:06.361114",
      "updated": null,
      "categories": [
        "gr-qc",
        "hep-th",
        "math-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.07252",
      "title": "Gauge Dependence of Scalar-Induced Gravitational Waves from Isocurvature Perturbations: Analytical Results",
      "authors": [
        "Arshad Ali",
        "Yang Lei",
        "Mudassar Sabir"
      ],
      "abstract": "Gauge Dependence of Scalar-Induced Gravitational Waves from Isocurvature Perturbations: Analytical Results Arshad Ali, Yang Lei, Mudassar Sabir General Relativity and Quantum Cosmology (gr-qc) We analytically study the gauge dependence of scalar-induced gravitational waves (SIGWs) sourced by primordial isocurvature perturbations during radiation domination (RD), working across nine gauges. Through analytical integrations of the kernels supported by graphical comparison we identify a clear dichotomy. We find that in some gauges viz. the uniform-density (UD), total-matter (TM), uniform-curvature (UC), comoving-orthogonal (CO) and transverse-traceless (TT) gauges the energy density grows polynomially in conformal time $\\eta^n$, where $n$ varies from $2$ to $8$. While in rest of the gauges viz. the longitudinal (Long.), uniform-expansion (UE), Newtonian-motion (Nm), and N-body (Nb) gauges the late-time energy spectrum converges, and SIGWs behave as radiation. For subhorizon modes ($ k\\eta \\gg 1 $), the divergence becomes severe, showing that SIGWs are gauge-dependent observables in this regime. We resolve it through a kernel projection that isolates the luminal, freely propagating gravitational wave components (oscillating as $\\sin(k\\eta)$ and $\\cos(k\\eta)$), eliminating spurious contributions. The resulting kernel decays as $ (k\\eta)^{-1} $ and yields a finite, gauge-independent late-time spectrum, confirming that only luminal modes represent physical SIGWs.",
      "pdf_url": "https://arxiv.org/pdf/2510.07252.pdf",
      "published": "2025-10-10T01:31:06.361307",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06273",
      "title": "Vision Transformer for Transient Noise Classification",
      "authors": [
        "Divyansh Srivastava",
        "Andrzej Niedzielski"
      ],
      "abstract": "Vision Transformer for Transient Noise Classification Divyansh Srivastava, Andrzej Niedzielski Acta Astronomica Vol. 74 (2024), No. 3 pp. 231-238 Computer Vision and Pattern Recognition (cs.CV); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG); General Relativity and Quantum Cosmology (gr-qc) Transient noise (glitches) in LIGO data hinders the detection of gravitational waves (GW). The Gravity Spy project has categorized these noise events into various classes. With the O3 run, there is the inclusion of two additional noise classes and thus a need to train new models for effective classification. We aim to classify glitches in LIGO data into 22 existing classes from the first run plus 2 additional noise classes from O3a using the Vision Transformer (ViT) model. We train a pre-trained Vision Transformer (ViT-B/32) model on a combined dataset consisting of the Gravity Spy dataset with the additional two classes from the LIGO O3a run. We achieve a classification efficiency of 92.26%, demonstrating the potential of Vision Transformer to improve the accuracy of gravitational wave detection by effectively distinguishing transient noise. Key words: gravitational waves --vision transformer --machine learning",
      "pdf_url": "https://arxiv.org/pdf/2510.06273.pdf",
      "published": "2025-10-10T01:31:06.362017",
      "updated": null,
      "categories": [
        "cs.CV",
        "astro-ph.IM",
        "cs.LG",
        "gr-qc"
      ],
      "primary_category": "cs.CV",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from cs.CV",
        "cross_list_from": "cs.CV"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06359",
      "title": "Dynamics of Cosmic Superstrings and the Overshoot Problem",
      "authors": [
        "Luca Brunelli",
        "Michele Cicoli",
        "Francisco Gil Pedro"
      ],
      "abstract": "Dynamics of Cosmic Superstrings and the Overshoot Problem Luca Brunelli, Michele Cicoli, Francisco Gil Pedro High Energy Physics - Theory (hep-th); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We exploit the techniques of dynamical systems to study the cosmological evolution of cosmic fundamental strings and effective strings arising from branes wrapped on internal cycles. We also include the whole potential of the volume modulus characterised by an early time run-away towards a late time minimum. We analyse the overshoot problem with and without radiation, and find that the presence of an initial population of strings arising from NS5-branes wrapped around 4-cycles is enough to ensure that the modulus stabilises in its late time minimum, even in the absence of radiation. The reason is the transfer of energy between the modulus and the effective strings caused by the fact that their tension depends on the volume modulus. Interestingly, we find that the energy density of cosmic superstrings is generically very large when the modulus is oscillating around its minimum, opening up the possibility of a detectable gravitational wave signal. We also find no evidence of an efficient resonant enhancement of cosmic superstrings due to an oscillating tension in the late time minimum.",
      "pdf_url": "https://arxiv.org/pdf/2510.06359.pdf",
      "published": "2025-10-10T01:31:06.362351",
      "updated": null,
      "categories": [
        "hep-th",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "hep-th",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-th",
        "cross_list_from": "hep-th"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06463",
      "title": "Classification of $g$-modes for neutron stars with a strong transition: Novel universal relation including slow stable twin stars",
      "authors": [
        "M. C. Rodriguez",
        "José C. Jiménez",
        "Ignacio F. Ranea-Sandoval"
      ],
      "abstract": "Classification of $g$-modes for neutron stars with a strong transition: Novel universal relation including slow stable twin stars M. C. Rodriguez, José C. Jiménez, Ignacio F. Ranea-Sandoval High Energy Physics - Phenomenology (hep-ph); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th) We investigate the behavior of the non-radial gravity-pulsation discontinuity mode ($g$-mode) in hybrid compact stars with a strong first-order phase transition, which can give rise to twin-star configurations in some cases. These modes are of utmost relevance since they can be potentially excited in isolated as well as binary neutron star systems in the inspiral phase, thus allowing us to indirectly detect the presence of a deconfinement transition. In order to do this, we consider four categories of twin stars that present distinctive features in their equations of state. We employ the constant speed of sound parametrization, which accounts for a sharp phase transition between confined hadronic matter and deconfined quark matter. Then, working within the relativistic Cowling approximation to obtain the frequencies of non-radial oscillations, we find that, depending on the twin star category, the relations between $g$-mode frequencies and masses as well as tidal deformabilities display a highly distinct behavior across the diverse twin star categories that appear in the slow hadron-quark conversion regime. This distinct phenomenology provides smoking-gun evidence to clearly distinguish and further classify hybrid stars with a strong transition from purely hadronic stars using upcoming gravitational-wave data. In addition, we present for each of the categories studied the relation between the $g$-mode frequency and the normalized energy density jump. Finally, we present a novel universal relationship for the discontinuity $g$-mode able to encompass the four categories including long branches of slow stable twin stars and address its asteroseismological capability.",
      "pdf_url": "https://arxiv.org/pdf/2510.06463.pdf",
      "published": "2025-10-10T01:31:06.362572",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.HE",
        "gr-qc",
        "nucl-th"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from hep-ph",
        "cross_list_from": "hep-ph"
      }
    },
    {
      "id": "https://arxiv.org/abs/2402.13053",
      "title": "Sharpening the dark matter signature in gravitational waveforms I: Accretion and eccentricity evolution",
      "authors": [
        "Theophanes K. Karydas",
        "Bradley J. Kavanagh",
        "Gianfranco Bertone"
      ],
      "abstract": "Sharpening the dark matter signature in gravitational waveforms I: Accretion and eccentricity evolution Theophanes K. Karydas, Bradley J. Kavanagh, Gianfranco Bertone 20 pages, 14 figures + appendices. Companion paper to \"Sharpening the dark matter signature in gravitational waveforms II: Numerical simulations with the NbodyIMRI code\" (arXiv:2402.13762). v3: Minor updates to match version published in PRD General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Dark matter overdensities around black holes can alter the dynamical evolution of a companion object orbiting around it, and cause a dephasing of the gravitational waveform. Here, we present a refined calculation of the co-evolution of the binary and the dark matter distribution, taking into account the accretion of dark matter particles on the companion black hole, and generalizing previous quasi-circular calculations to the general case of eccentric orbits. These calculations are validated by dedicated N-body simulations. We show that accretion can lead to a large dephasing, and therefore cannot be neglected in general. We also demonstrate that dark matter spikes tend to circularize eccentric orbits faster than previously thought.",
      "pdf_url": "https://arxiv.org/pdf/2402.13053.pdf",
      "published": "2025-10-10T01:31:06.363571",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2504.15709",
      "title": "Gravitational Wave Backreaction in $f(R,G)$ Gravity",
      "authors": [
        "Farzad Milani"
      ],
      "abstract": "Gravitational Wave Backreaction in $f(R,G)$ Gravity Farzad Milani 39 pages, No figure, 6 appendices, 28 references General Relativity and Quantum Cosmology (gr-qc) We present a comprehensive theoretical framework for gravitational wave (GW) propagation and their \\textbf{nonlinear backreaction} in $f(R, G)$ modified gravity. By developing a scalar-tensor formulation with two auxiliary fields, we systematically investigate both the propagation and backreaction of high-frequency gravitational waves in cosmological backgrounds. Within this framework, we derive, for the first time, the complete effective energy-momentum tensor for GWs in $f(R, G)$ theory. The linearized field equations reveal how the Gauss-Bonnet term introduces new curvature-dependent couplings between tensor and scalar degrees of freedom, leading to modified dispersion relations and distinctive wave propagation effects. On de Sitter backgrounds, we obtain exact decoupled equations for the tensor and scalar modes, demonstrating how the additional $G$ dependence alters both the effective masses and energy transport mechanisms compared to the well-established framework of pure $f(R)$ theories. Our derivation of the effective energy-momentum tensor extends Isaacson's approach to incorporate the novel scalar field contributions, revealing a complex hierarchy of characteristic length scales ($\\lambda$, $\\ell$, and $\\mathcal{L}$) that govern the backreaction dynamics. The resulting formalism suggests potentially observable signatures in both the propagation (phase shifts, amplitude modulation) and stochastic background of gravitational waves. These effects could be probed by next-generation detectors, offering new constraints on the $f(R, G)$ coupling parameters. The theoretical framework developed here provides a foundation for future studies of gravitational wave generation in modified gravity scenarios and their role in the formation of cosmological structures.",
      "pdf_url": "https://arxiv.org/pdf/2504.15709.pdf",
      "published": "2025-10-10T01:31:06.364659",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.00169",
      "title": "Modeling Gravitational Wave Modes from the Inspiral of Binaries with Arbitrary Eccentricity",
      "authors": [
        "Gonzalo Morras"
      ],
      "abstract": "Modeling Gravitational Wave Modes from the Inspiral of Binaries with Arbitrary Eccentricity Gonzalo Morras 12 pages of main text, 7 figures, 14 pages of appendices Phys.Rev.D 112 (2025) 8, 084015 General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Eccentric binaries are key targets for current and future gravitational wave (GW) detectors, offering unique insights into the formation and environments of compact binaries. However, accurately and efficiently modeling eccentric waveforms remains challenging, in part due to their complex harmonic structure. In this work, we develop a post-Newtonian (PN) framework to compute the Fourier amplitudes of GWs from the inspiral of eccentric binaries, deriving simple expressions at 1PN order for all relevant $(l, m)$ multipoles, valid for arbitrary eccentricities. We then characterize the GW emission by analyzing the contribution of each $(l, m)$ mode to the strain, its mean frequency, frequency spread, and asymptotic behavior at high frequencies. Additionally, we introduce a method to determine the minimal set of Fourier modes needed to reconstruct the waveform to a given accuracy. Finally, we discuss how our framework can be extended to higher PN orders, obtaining closed-form expressions for the leading-order tail and spin contributions and outlining the steps required to include higher-order corrections. Our results provide both a deeper theoretical understanding of eccentric GW emission and practical tools for developing more accurate and efficient waveform models.",
      "pdf_url": "https://arxiv.org/pdf/2507.00169.pdf",
      "published": "2025-10-10T01:31:06.364842",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2507.14634",
      "title": "Universality of gravitational radiation from magnetar magnetospheres",
      "authors": [
        "Arthur G. Suvorov",
        "Petros Stefanou",
        "José A. Pons"
      ],
      "abstract": "Universality of gravitational radiation from magnetar magnetospheres Arthur G. Suvorov, Petros Stefanou, José A. Pons 12 pages, 7 figures. Accepted for publication in PRD General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) The intense magnetic fields inferred from magnetars suggest they may be strong gravitational-wave emitters. Although emissions due to hydromagnetic deformations are more promising from a detection standpoint, exterior fields also contribute a strain. However, numerical evidence suggests that the free energy of stable magnetospheric solutions cannot exceed a few tens of percent relative to the potential state, implying that the magnetospheric contribution to the gravitational-wave luminosity cannot differ significantly between models. This prompts 'universality', in the sense that the strain provides a direct probe of the near-surface field without being muddied by magnetospheric currents. Using a suite of three-dimensional, force-free, general-relativistic solutions for dipole and dipole-plus-quadrupole fields, we find that space-based interferometers may enable marginal detections out to $\\lesssim$ kpc distances for slowly-rotating magnetars with fields of $\\gtrsim 10^{15}$ G independently of internal deformations.",
      "pdf_url": "https://arxiv.org/pdf/2507.14634.pdf",
      "published": "2025-10-10T01:31:06.365224",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2508.05245",
      "title": "Regular black hole's impact on the gravitational waveforms from periodic orbits",
      "authors": [
        "Mirzabek Alloqulov",
        "Sanjar Shaymatov",
        "Bobomurat Ahmedov",
        "Tao Zhu"
      ],
      "abstract": "Regular black hole's impact on the gravitational waveforms from periodic orbits Mirzabek Alloqulov, Sanjar Shaymatov, Bobomurat Ahmedov, Tao Zhu 12 pages, 9 figures and 2 tables General Relativity and Quantum Cosmology (gr-qc) In this paper, we investigate periodic orbits exhibiting zoom-whirl behavior around a magnetically charged black hole (MCBH) within the framework of the regular black hole. We examine how the magnetic charge influences orbital dynamics by modifying the background spacetime geometry, thereby affecting the energy and angular momentum of particles. In particular, we calculate the radii of the marginally bound orbits (MBOs) and innermost stable circular orbits (ISCOs), demonstrating that the magnetic charge parameter reduces both radii. This provides valuable insight into the role of the charge parameter in shaping orbital behavior and altering spacetime geometry. We model the complex motion of a stellar-mass object as a timelike particle, inspiraling into a supermassive black hole (SMBH) in the MCBH background, with its trajectory described using periodic geodesic orbits. Based on this analysis of such periodic orbits, we further analyze the gravitational waveforms generated by extreme mass ratio inspirals (EMRIs), in which the SMBH's spacetime dominates the dynamics of the stellar-mass object. By combining particle trajectory analysis with waveform modeling in a semi-analytical approach, we show that the charge parameter significantly alters the zoom-whirl orbital dynamics and induces notable changes in the waveform structure. These results illustrate that future gravitational wave (GW) observations may constrain the properties of MCBHs, thereby deepening our understanding of the gravitational imprint of regular black holes.",
      "pdf_url": "https://arxiv.org/pdf/2508.05245.pdf",
      "published": "2025-10-10T01:31:06.365439",
      "updated": null,
      "categories": [
        "gr-qc"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.20658",
      "title": "Regression of Suspension Violin Modes in KAGRA O3GK Data with Kalman Filters",
      "authors": [
        "Lucas Moisset",
        "Marco Meyer-Conde",
        "Christopher Allene",
        "Yusuke Sakai",
        "Dan Chen",
        "Nobuyuki Kanda",
        "Hirotaka Takahashi"
      ],
      "abstract": "Regression of Suspension Violin Modes in KAGRA O3GK Data with Kalman Filters Lucas Moisset, Marco Meyer-Conde, Christopher Allene, Yusuke Sakai, Dan Chen, Nobuyuki Kanda, Hirotaka Takahashi General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) Suspension thermal modes in interferometric gravitational-wave detectors produce narrow, high-Q spectral lines that can contaminate gravitational searches and bias parameter estimation. In KAGRA, cryogenic mirrors are held by thick suspension fibers, designed to sustain such a low-temperature environment, which may further affect inharmonicity modes, fiber dimensions, and mechanical behavior compared to typical interferometers. As these modes remain a prominent source of narrowband contamination, we implement a Kalman filter to model and track violin lines, building on the methodology introduced in [1], and apply subtraction to KAGRA O3GK data. Using gravitational-wave template injections, we validate that the subtraction preserves matched-filter SNR while effectively suppressing line power. Comparisons of power spectral densities and residual analyses confirm that the method removes deterministic line contributions without introducing waveform distortions. This approach provides a cleaner strain channel for searches and parameter estimation and will become increasingly important for future low-temperature detectors with higher-Q suspensions, such as the Einstein Telescope.",
      "pdf_url": "https://arxiv.org/pdf/2509.20658.pdf",
      "published": "2025-10-10T01:31:06.366246",
      "updated": null,
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "primary_category": "gr-qc",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2505.01356",
      "title": "Gravitational Wave Memory of Primordial Black Hole Mergers",
      "authors": [
        "Silvia Gasparotto",
        "Gabriele Franciolini",
        "Valerie Domcke"
      ],
      "abstract": "Gravitational Wave Memory of Primordial Black Hole Mergers Silvia Gasparotto, Gabriele Franciolini, Valerie Domcke Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The gravitational wave signal of binary compact objects has two main contributions at frequencies below the characteristic merger frequency: the gravitational wave signal associated with the early inspiral stage of the binary and the non-linear gravitational wave memory. We compare the sensitivity of upcoming gravitational wave detectors to these two contributions, with a particular interest in events with a merger phase at frequencies higher than the detector's peak sensitivity. We demonstrate that for light primordial black holes, current and upcoming detectors are more sensitive to the inspiral signal. Our analysis incorporates the evolution history of primordial black hole binaries, key to accurately estimating the relevant event rates. We also discuss the waveform templates of the memory signal at ground- and space-based interferometers, and the implications for a matched filtering search. This allows us to compare the sensitivity of high-frequency gravitational wave detectors, sensitive to the merger phase, with the sensitivity of existing interferometers.",
      "pdf_url": "https://arxiv.org/pdf/2505.01356.pdf",
      "published": "2025-10-10T01:31:06.367132",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.01316",
      "title": "Expectations for the first supermassive black-hole binary resolved by PTAs II: Milestones for binary characterization",
      "authors": [
        "Polina Petrov",
        "Levi Schult",
        "Stephen R. Taylor",
        "Nihan Pol",
        "Nima Laal",
        "Maria Charisi",
        "Chung-Pei Ma"
      ],
      "abstract": "Expectations for the first supermassive black-hole binary resolved by PTAs II: Milestones for binary characterization Polina Petrov, Levi Schult, Stephen R. Taylor, Nihan Pol, Nima Laal, Maria Charisi, Chung-Pei Ma Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Following the recent evidence for a gravitational wave (GW) background found by pulsar timing array (PTA) experiments, the next major science milestone is resolving individual supermassive black hole binaries (SMBHBs). The detection of these systems could arise via searches using a power-based GW anisotropy model or a deterministic template model. In Schult et al. 2025, we compared the efficacy of these models in constraining the GW signal from a single SMBHB using realistic, near-future PTA datasets, and found that the full-signal deterministic continuous wave (CW) search may achieve detection and characterization first. Here, we continue our analyses using only the CW model given its better performance, focusing now on characterization milestones. We examine the order in which CW parameters are constrained as PTA data are accumulated and the signal-to-noise ratio (S/N) grows. We also study how these parameter constraints vary across sources of different sky locations and GW frequencies. We find that the GW frequency and strain are generally constrained at the same time (or S/N), closely followed by the sky location, and later the chirp mass (if the source is highly evolving) and inclination angle. At fixed S/N, sources at higher frequencies generally achieve better precision on the GW frequency, chirp mass, and sky location. The time (and S/N) at which the signal becomes constrained is dependent on the sky location and frequency of the source, with the effects of pulsar terms and PTA geometry playing crucial roles in source detection and localization.",
      "pdf_url": "https://arxiv.org/pdf/2510.01316.pdf",
      "published": "2025-10-10T01:31:06.367868",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06311",
      "title": "Modeling gravitational wave sources in the MillenniumTNG simulations",
      "authors": [
        "Federico Marinacci",
        "Marco Baldi",
        "Giuliano Iorio",
        "M. Celeste Artale",
        "Michela Mapelli",
        "Volker Springel",
        "Sownak Bose",
        "Lars Hernquist"
      ],
      "abstract": "Modeling gravitational wave sources in the MillenniumTNG simulations Federico Marinacci, Marco Baldi, Giuliano Iorio, M. Celeste Artale, Michela Mapelli, Volker Springel, Sownak Bose, Lars Hernquist 15 pages (+ 4 page Appendix), 10 figures (+ 9 figures in the Appendix). Submitted to A&A; comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) (Edited) We introduce a flexible framework for building gravitational wave (GW) event catalogs in hydrodynamic simulations of galaxy formation. Our framework couples the state-of-the-art binary population synthesis code SEVN with Arepo-GW -- a module fully integrated into the moving-mesh code Arepo -- to assign merger events of binary compact objects to stellar particles in simulations by stochastically sampling merger tables generated with SEVN. Arepo-GW supports both on-the-fly operation, producing event catalogs during simulations, and post-processing, using snapshots from existing runs. The algorithm is fully parallel and can be readily adapted to outputs from other simulation codes. To demonstrate the capabilities of our new framework, we applied Arepo-GW in post-processing to simulations from the MillenniumTNG suite, including its flagship box. We investigate key properties of the resulting GW event catalog, built on SEVN predictions, focusing on comoving merger rates, formation efficiencies, delay-time distributions, and progenitor mass and metallicity distributions. We also examine how these properties vary with simulated volume. We find that GW progenitor rates closely track simulated star formation histories and are generally consistent with current observational constraints at low redshift, aside from a factor of $\\sim 4.5$ excess in binary black hole mergers. Moreover, our binary black hole merger rates decline more slowly with redshift than current observational estimates for $z \\lesssim 1$. Finally, the analysis of progenitor mass functions across different formation channels reveals only mild redshift evolution, while the binary black hole mass function displays features compatible with current observational determinations. These findings highlight the potential of our novel framework to enable detailed predictions for upcoming GW surveys within a full cosmological context.",
      "pdf_url": "https://arxiv.org/pdf/2510.06311.pdf",
      "published": "2025-10-10T01:31:06.510002",
      "updated": null,
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06325",
      "title": "Preferential Accretion onto the Secondary Black Hole Strengthens Gravitational Wave Signals",
      "authors": [
        "Julia M. Comerford",
        "Joseph Simon"
      ],
      "abstract": "Preferential Accretion onto the Secondary Black Hole Strengthens Gravitational Wave Signals Julia M. Comerford, Joseph Simon Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Pulsar timing arrays have recently found evidence for nanohertz gravitational waves that are consistent with being produced by a cosmological population of binary supermassive black holes (SMBHs). However, the amplitude of this gravitational wave background is larger than predicted from theoretical and empirical models of SMBH binary populations. We investigate preferential accretion onto the secondary, less massive SMBH of the binary as a potential solution to this discrepancy. We carry out the first observationally-based analysis of the effect of preferential accretion on the SMBH binary population, and we find that preferential accretion onto the secondary SMBH increases the binary SMBH mass ratio, causing many minor galaxy mergers to lead to major SMBH mergers. The fraction of SMBH mergers that are major mergers increases by a factor of 2-3 when preferential accretion is included. Further, we find that only a small amount of preferential accretion (10% total SMBH mass growth) is needed to bring the predicted gravitational wave background amplitude into agreement with observations. Preferential accretion has an even larger effect on gravitational wave signals detected by LISA, which will probe SMBH binaries at higher redshifts where the environment is more gas-rich, and can also help explain the rapid build up of overmassive black holes at high redshifts observed by the James Webb Space Telescope. It also shortens the time to the first detection of an individual SMBH binary emitting continuous waves. Preferential accretion strengthens the gravitational wave signals produced by any binary embedded in a circumbinary disk, including LIGO sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.06325.pdf",
      "published": "2025-10-10T01:31:06.511873",
      "updated": null,
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.GA",
        "cross_list_from": "astro-ph.GA"
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06352",
      "title": "Are all Binary Black Holes Detected from LIGO-Virgo-KAGRA Follow the Universal Time-Delay Distributions? Likely Not",
      "authors": [
        "Samsuzzaman Afroz",
        "Navdha",
        "Suvodip Mukherjee"
      ],
      "abstract": "Are all Binary Black Holes Detected from LIGO-Virgo-KAGRA Follow the Universal Time-Delay Distributions? Likely Not Samsuzzaman Afroz, Navdha, Suvodip Mukherjee High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The delay time distribution (DTD) of binary black hole (BBH) mergers encodes the evolutionary link between the formation history and gravitational-wave (GW) emission. We present a non-parametric reconstruction of the mass-dependent DTD using the BBHs from the GWTC-4 that avoids restrictive assumptions of only power-law forms. Our analysis reveals for the first time the signature for mass-dependent evolutionary pathways: lower-mass systems ($20$-$40\\,M_\\odot$) are consistent with a scale-invariant DTD, whereas higher-mass BBHs ($40$-$100\\,M_\\odot$) provide the first direct tentative evidence of DTD that deviate from simple power laws, with a pronounced preference for rapid mergers around $2-6$ Gyrs. These findings reveal the advantage of the non-parametric technique in reconstructing the mass-dependent DTD and discovering for the first-time the presence of a potential time-scale associated with high-mass GW events.",
      "pdf_url": "https://arxiv.org/pdf/2510.06352.pdf",
      "published": "2025-10-10T01:31:06.512070",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "cross-list",
        "details": "cross-list from astro-ph.HE",
        "cross_list_from": "astro-ph.HE"
      }
    },
    {
      "id": "https://arxiv.org/abs/2502.17747",
      "title": "Dark sirens and the impact of redshift precision",
      "authors": [
        "Madeline L. Cross-Parkin",
        "Cullan Howlett",
        "Tamara M. Davis",
        "Nandita Khetan"
      ],
      "abstract": "Dark sirens and the impact of redshift precision Madeline L. Cross-Parkin, Cullan Howlett, Tamara M. Davis, Nandita Khetan Cosmology and Nongalactic Astrophysics (astro-ph.CO) With the growing number of gravitational wave detections, achieving a competitive measurement of $H_0$ with dark sirens is becoming increasingly feasible. The expansion of the Ligo-Virgo-KAGRA Collaboration into a four detector network will reduce both the localisation area and the luminosity distance uncertainty associated with each gravitational wave event. It is therefore essential to identify and mitigate other major sources of error that could increase the uncertainty in $H_0$. In this work, we explore three scenarios relevant to the dark siren method in future observing runs. First, we demonstrate that there is a precision gain offered by a catalogue of spectroscopic-like redshifts compared to photometric-like redshifts, with the greatest improvements observed in smaller localisation areas. Second, we show that redshift outliers (as occur in realistic photometric redshift catalogues), do not introduce bias into the measurement of $H_0$. Finally, we find that uniformly sub-sampling spectroscopic-like redshift catalogues increases the uncertainty in $H_0$ as the completeness fraction is decreased; at a completeness of 50% the benefit of spectroscopic redshift precision is outweighed by the degradation from incompleteness. In all three scenarios, we obtain unbiased estimates of $H_0$. We conclude that a competitive measurement of $H_0$ using the dark siren method will require a hybrid catalogue of both photometric and spectroscopic redshifts, at least until highly complete spectroscopic catalogues become available. This, however, will come at the cost of a more complex selection function.",
      "pdf_url": "https://arxiv.org/pdf/2502.17747.pdf",
      "published": "2025-10-10T01:31:06.528921",
      "updated": null,
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2509.14323",
      "title": "High-Quality Axion Dark Matter at Gravitational Wave Interferometers",
      "authors": [
        "Disha Bandyopadhyay",
        "Debasish Borah",
        "Nayan Das",
        "Rome Samanta"
      ],
      "abstract": "High-Quality Axion Dark Matter at Gravitational Wave Interferometers Disha Bandyopadhyay, Debasish Borah, Nayan Das, Rome Samanta Version 2: improved discussions, added references; 11 pages, 3 captioned figures High Energy Physics - Phenomenology (hep-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Gravitational effects are known to violate global symmetries, threatening the Peccei-Quinn (PQ) solution to the strong CP problem. Ultraviolet completions featuring a gauged $U(1)$ symmetry, where $U(1)_{\\rm PQ}$ arises as an accidental global symmetry, can suppress Planck-suppressed operators, enabling high-quality axions in a mass window where it can also account for the observed dark matter (DM) in the Universe. We show that in such models, the spontaneous breaking of the $U(1)$ gauge symmetry generates a strong stochastic gravitational wave background (SGWB) from gauge cosmic string loops. For breaking scales $\\gtrsim 10^{14}$ GeV, the SGWB signal strength exceeds astrophysical foregrounds across a broad frequency range. Contrary to conventional gauge cosmic string scenarios, such quality axion models have a characteristic IR break frequency originating from the collapse of string-wall network around axion oscillation temperature. We propose this characteristic SGWB frequency-amplitude region, identified as \\textit{Signature-Window-Axion-Gravitational waves} (SWAG), to be a novel probe of high-quality axion DM at future space and ground-based interferometers.",
      "pdf_url": "https://arxiv.org/pdf/2509.14323.pdf",
      "published": "2025-10-10T01:31:06.532418",
      "updated": null,
      "categories": [
        "hep-ph",
        "astro-ph.CO"
      ],
      "primary_category": "hep-ph",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.06741",
      "title": "Diagnosing the Properties and Evolutionary Fates of Black Hole and Wolf-Rayet X-ray Binaries as Potential Gravitational Wave Sources for the LIGO-Virgo-KAGRA Network",
      "authors": [
        "Zi-Yuan Wang",
        "Ying Qin",
        "Georges Meynet",
        "Qing-Zhong Liu",
        "Xin-Wen Shu",
        "Ya-Wen Xue",
        "Liang Yuan",
        "Jun-Qian Li",
        "Kun Jia",
        "Han-Feng Song"
      ],
      "abstract": "Diagnosing the Properties and Evolutionary Fates of Black Hole and Wolf-Rayet X-ray Binaries as Potential Gravitational Wave Sources for the LIGO-Virgo-KAGRA Network Zi-Yuan Wang, Ying Qin, Georges Meynet, Qing-Zhong Liu, Xin-Wen Shu, Ya-Wen Xue, Liang Yuan, Jun-Qian Li, Kun Jia, Han-Feng Song 16 pages, 19 figures, submitted on January 18 2025 High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) IC 10 X-1, NGC 300 X-1, and Cyg X-3 represent a unique class of X-ray binaries consisting of a stellar-mass black hole (BH) accreting material from a Wolf-Rayet (WR) star companion. These systems are particularly intriguing due to their short orbital periods (less than 1.5 d), making them promising progenitors of gravitational wave (GW) sources detectable by the LIGO-Virgo-KAGRA (LVK) network. With a newly implemented prescription for accretion efficiency in the standard Bondi-Hoyle-Lyttleton (BHL) framework and a corrected treatment of dynamical tides, we present for the \\textit{first} time detailed binary evolution models to diagnose their properties at different evolutionary states and evaluate their fates as potential GW sources detectable by the LVK network. With additional constraints on the observed properties of IC 10 X-1 and NGC 300 X-1, we determine that the upper limit of the BH mass in these systems (IC 10 X-1: $M_{\\rm BH} \\lesssim 25\\, M_\\odot$, NGC 300 X-1: $M_{\\rm BH} \\lesssim 15\\, M_\\odot$) is much lower than previously estimated. Both systems are expected to form binary black holes (BBHs) that will merge within a Hubble time, unless the BH in NGC 300 X-1 has a mass of $9\\,M_\\odot$, the lower limit estimated in a previous study based on the continuum-fitting method employing a relativistic slim-disc model. For Cyg X-3, we find that the upper limit on the BH spin magnitude cannot exceed 0.6. Interestingly, the WR star in Cyg X-3 is likely to form a lower-mass gap BH, and the resulting binary BH system will merge within the Hubble time.",
      "pdf_url": "https://arxiv.org/pdf/2510.06741.pdf",
      "published": "2025-10-10T01:31:06.799788",
      "updated": null,
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.07174",
      "title": "Archival Inference for Eccentric Stellar-Mass Binary Black Holes in Space-Based Gravitational Wave Observations",
      "authors": [
        "Han Wang",
        "Michael J. Williams",
        "Ian Harry",
        "Yi-Ming Hu"
      ],
      "abstract": "Archival Inference for Eccentric Stellar-Mass Binary Black Holes in Space-Based Gravitational Wave Observations Han Wang, Michael J. Williams, Ian Harry, Yi-Ming Hu 12 pages, 4 figures, comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) Space-based gravitational-wave observatories will detect the early inspiral of stellar-mass binary black holes and can track their eccentricity evolution. However, untargeted searches in the space band are computationally demanding and require relatively high detection thresholds (signal-to-noise ratio $\\sim 15$). Information from ground-based detections can significantly shrink the parameter space for space-band analyses and thereby substantially reduce the detection threshold. We present a Bayesian inference pipeline for ground-triggered archival space-band analyses that includes eccentricity. Using ground-informed priors, we demonstrate that with one year of LISA or TianQin data a GW190521-like source with signal-to-noise ratio $\\sim 7$ can be distinguished and tightly constrained. In this setup, space observations sharpened the redshifted chirp mass from $\\mathcal{O}(10^{-3})M_\\odot$ to $\\mathcal{O}(10^{-5})M_\\odot$, and constrain the eccentricity to $\\mathcal{O}(10^{-5})$ around the injected value $e_{0.01\\mathrm{Hz}}=0.1$. These results demonstrate that inference of eccentric stellar-mass binary black holes in noisy space-band data is practically feasible, supports an expanded yield of multiband detections, and strengthens prospects for future astrophysical and gravitational tests.",
      "pdf_url": "https://arxiv.org/pdf/2510.07174.pdf",
      "published": "2025-10-10T01:31:06.802368",
      "updated": null,
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.01317",
      "title": "Expectations for the first supermassive black-hole binary resolved by PTAs I: Model efficacy",
      "authors": [
        "Levi Schult",
        "Polina Petrov",
        "Stephen R. Taylor",
        "Nihan Pol",
        "Nima Laal",
        "Maria Charisi",
        "Chung-Pei Ma"
      ],
      "abstract": "Expectations for the first supermassive black-hole binary resolved by PTAs I: Model efficacy Levi Schult, Polina Petrov, Stephen R. Taylor, Nihan Pol, Nima Laal, Maria Charisi, Chung-Pei Ma 25 pages, 6 figures, 3 tables. Submitted to Physical Review D Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) One of the most promising targets for Pulsar Timing Arrays (PTAs) is identifying an individual supermassive black hole binary (SMBHB) out of the population of binaries theorized to produce a gravitational wave background (GWB). In this work, we emulate an evolving PTA dataset, complete with an increasing number of pulsars and timing baseline, into which we inject a single binary on top of a Gaussian GWB signal. We vary the binary's source parameters, including sky position and frequency, and create an ensemble of simulated datasets with which we assess current Bayesian binary search techniques. We apply two waveform-based template models and a frequency-resolved anisotropy search to these simulations to understand how they compare in their detection and characterization abilities. We find that a template-based search including the full gravitational-wave signal structure (i.e., both Earth and pulsar effects of an incident GW) returns the highest Bayes Factors (BF), exceeding our estimator's capabilities by (S/N)~9-19, and has the most robust parameter estimation. Our anisotropy model attains a realization-median BF>10 at 7<(S/N)<15. Interestingly, despite being a deterministic model, the Earth-term template struggles to detect and characterize low-frequency binaries (5 nHz). These binaries require higher (S/N)~16-19 to reach the same BF threshold. This is likely due to neglected confusion effects between the pulsar and Earth terms. By contrast, the frequency-resolved anisotropy model shows promise for parameter estimation despite treating a binary's GW signal as excess directional GW power without phase modeling. Sky location and frequency parameter constraints returned by the anisotropy model are only surpassed by the Earth term template model at (S/N)~12-13. Milestones for a first detection using the full-signal GW model are included in a companion paper (Petrov et al. 2025).",
      "pdf_url": "https://arxiv.org/pdf/2510.01317.pdf",
      "published": "2025-10-10T01:31:06.806874",
      "updated": null,
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "submission_info": {
        "type": "replaced",
        "details": "replaced",
        "cross_list_from": ""
      }
    },
    {
      "id": "https://arxiv.org/abs/2510.07021",
      "title": "The formation of Gaia BH3",
      "authors": [
        "Daniel Marín Pina",
        "Mark Gieles",
        "Sara Rastello",
        "Giuliano Iorio"
      ],
      "abstract": "Daniel Marín Pina, Mark Gieles, Sara Rastello, Giuliano Iorio 4 pages, 2 figures. Accepted for publication in IAU Conference proceedings of IAU Symposium 398 & MODEST-25: Compact Objects and Binaries in Dense Stellar Systems Astrophysics of Galaxies (astro-ph.GA) The Gaia collaboration announced the discovery of a massive black hole (BH) with a low-mass giant star companion, Gaia BH3, located in the ED-2 stellar stream. The properties of Gaia BH3 bridge the gap between known Milky Way BHs and extragalactic BHs found with gravitational waves (GWs). We aim to determine the most likely formation scenario for Gaia BH3 in the progenitor cluster of the ED-2 stream. We perform $N$-body simulations of that progenitor cluster and find that, most likely, Gaia BH3 formed from a stellar binary that formed during cluster formation, which then underwent multiple dynamical interactions that significantly altered its properties, including exchanging the companion star. We highlight the importance of cluster dynamics and discard a formation scenario where it evolved in quasi-isolation.",
      "pdf_url": "https://arxiv.org/pdf/2510.07021.pdf",
      "published": "2025-10-10T01:31:06.968731",
      "updated": null,
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "submission_info": {
        "type": "new",
        "details": "new submission",
        "cross_list_from": ""
      }
    }
  ]
}