{
  "date": "2026-02-10",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.IM",
    "astro-ph.EP",
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.HE",
    "astro-ph.SR"
  ],
  "total_papers": 102,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.06115",
      "title": "Consistency of standard cosmologies using Bayesian model comparison and tension quantification",
      "authors": [
        "Lukas Tobias Hergt",
        "Sophie Henrot-Versillé",
        "Matthieu Tristram",
        "Douglas Scott"
      ],
      "abstract": "Consistency of standard cosmologies using Bayesian model comparison and tension quantification Lukas Tobias Hergt, Sophie Henrot-Versillé, Matthieu Tristram, Douglas Scott 22 pages, 16 figures, 2 tables; to be submitted to PRD; data made available at this http URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We present a unified Bayesian assessment of model comparison and data-set consistency for LCDM (cold dark matter plus a cosmological constant) and minimal extensions (neutrino mass, spatial curvature, constant or evolving dark energy) using cosmic microwave background (CMB), baryon acoustic oscillation (BAO), and type Ia supernova (SN) data. The major results are summarized in the first three figures. We quantify model preference with Bayesian evidence and assess consistency with complementary evidence- and likelihood-based diagnostics applied uniformly across data-set combinations. For the models considered, updated Planck processing systematically improves internal CMB consistency (low-$\\ell$ versus high-$\\ell$, and primary CMB versus CMB lensing). The preference for a closed geometry and an associated ``curvature tension'' with BAO and/or CMB lensing are largely confined to earlier Planck likelihood implementations and weaken substantially when using updated CMB processing and more recent BAO measurements. Apparent evidence for evolving dark energy in CMB+BAO+SN combinations depends sensitively on the specific pairing of CMB and SN likelihoods: plausible alternatives shift inferred tensions by more than $1\\,\\sigma$ and can completely reverse the preferred model. Allowing a free neutrino mass tends to absorb residual shifts without introducing new inconsistencies, and we do not find robust evidence for a standalone $\\tau$-driven discrepancy once the full likelihood context is accounted for. We conclude that claims of a required update of our standard cosmological model from LCDM to $w_0w_a$CDM are premature.",
      "pdf_url": "https://arxiv.org/pdf/2602.06115.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06562",
      "title": "Universality of Primordial Anisotropies in Gravitational Wave Background",
      "authors": [
        "Boyuan Jiang",
        "Ryo Saito",
        "Ying-li Zhang"
      ],
      "abstract": "Universality of Primordial Anisotropies in Gravitational Wave Background Boyuan Jiang, Ryo Saito, Ying-li Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We propose a model-independent formalism for describing anisotropies in the stochastic gravitational wave background (SGWB) originating from primordial perturbations. Despite their diverse physical origins -- such as Sachs-Wolfe effects, integrated Sachs-Wolfe effects, or fossil effects from primordial non-Gaussianity -- SGWB anisotropies exhibit a universal angular structure. We show that this universality arises from a single vertex function, the Cosmological Form Factor (CFF), which encodes the information on how long-wavelength modes modulate the SGWB statistics. Two fundamental principles -- statistical isotropy and locality -- uniquely determine the angular dependence of the CFF, resulting in a universal multipole scaling of the SGWB anisotropies. The CFF formalism provides a common language for classifying SGWB anisotropies and offers a powerful framework for interpreting upcoming observations.",
      "pdf_url": "https://arxiv.org/pdf/2602.06562.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.25690",
      "title": "A Light-Cone Approach to Higher-Order Cosmological Observables",
      "authors": [
        "Pierre Béchaz",
        "Giuseppe Fanizza",
        "Giovanni Marozzi",
        "Matheus R. Medeiros Silva"
      ],
      "abstract": "A Light-Cone Approach to Higher-Order Cosmological Observables Pierre Béchaz, Giuseppe Fanizza, Giovanni Marozzi, Matheus R. Medeiros Silva 65 pages, no figures, 1 table. Comments, clarifications and one appendix with a table added, typos corrected. Version accepted for publication in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We develop a second-order cosmological perturbation theory on a background geometry expressed in terms of light-cone coordinates, extending the first-order analyses available in the literature. In particular, we investigate the gauge transformations of second-order perturbative quantities on the light-cone and establish their connection with standard perturbation theory. Through a consistent matching procedure, we identify the second-order gauge fixing that corresponds to the non-linear Geodesic Light-Cone gauge within standard perturbation theory, known as the Observational Synchronous Gauge. We then emphasize its conceptual similarities and differences wrt the standard Synchronous Gauge. Finally, within this new perturbative framework, and adopting a fully gauge-invariant approach, we compute the luminosity distance-redshift relation up to second order with anisotropic stress as seen by a free-falling observer. Remarkably, we show how divergences at the observer position can be eliminated in a completely model independent way. These results validate our perturbative framework and establish it as a novel formalism for evaluating cosmological observables at second order.",
      "pdf_url": "https://arxiv.org/pdf/2510.25690.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20156",
      "title": "A dynamical systems approach to studying the equivalence principle in dilaton gravity",
      "authors": [
        "A. M. Velásquez-Toribio"
      ],
      "abstract": "A dynamical systems approach to studying the equivalence principle in dilaton gravity A. M. Velásquez-Toribio Manuscript submitted to a scientific journal for peer review Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We study a string-inspired dilaton cosmology in the Damour--Polyakov (DP) regime using dynamical-systems methods, aiming to make explicit how cosmological relaxation controls deviations from the equivalence principle. Working in the Einstein frame, we consider a spatially flat FLRW universe filled with pressureless matter and a universally coupled dilaton. Expanding the conformal coupling function and the scalar potential around the least-coupling point, we obtain a closed and self-consistent autonomous system governing the late-time evolution of the scalar-matter sector. The resulting phase space contains a stable fixed point associated with least coupling, approached only asymptotically along cosmological trajectories. Therefore, at any finite epoch the solution typically retains a small displacement from the fixed point. In the DP regime this finite-epoch displacement sets the ambient coupling, and thus determines the magnitude of fifth-force effects and deviations from the equivalence principle in the nonrelativistic limit. By linearising the system around a finite-epoch reference state, we show that the damping of the displacement is controlled by the Jacobian eigenvalues of the DP fixed point. This yields a direct dynamical estimate of how rapidly deviations from the equivalence principle are reduced during cosmological evolution. The mechanism is global and cosmological in origin, and is conceptually distinct from local environmental screening as in chameleon or symmetron scenarios. Overall, our results illustrate how phase-space techniques provide a clear bridge between cosmological dynamics and weak-field departures from General Relativity.",
      "pdf_url": "https://arxiv.org/pdf/2601.20156.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06082",
      "title": "Revisiting the missing mass problem in MOND for nearby galaxy clusters",
      "authors": [
        "Dong Zhang",
        "Akram Hasani Zonoozi",
        "Pavel Kroupa"
      ],
      "abstract": "Revisiting the missing mass problem in MOND for nearby galaxy clusters Dong Zhang (Bonn), Akram Hasani Zonoozi (Bonn, Zanjan), Pavel Kroupa (Bonn, Prague) 31 pages, 26 figures. Accepted by PRD Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) In the framework of Milgromian dynamics (MOND), galaxy clusters are known to exhibit a residual missing mass problem, with the baryonic mass falling short of the dynamical mass by about a factor of two. The baryon content of clusters is dominated by the intracluster medium (ICM), while the stellar contribution depends sensitively on the assumed stellar initial mass function (IMF). We re-evaluate the stellar and remnant masses in galaxy clusters by adopting the integrated galaxy-wide initial mass function (IGIMF) theory, which accounts for the dependence of the IMF on galaxy properties and star formation histories. Massive elliptical galaxies, characterized by high metallicities and short formation timescales, are inferred to form with top-heavy IMFs, leading to a substantial population of stellar remnants. Using observational data from WINGS and 2MASS for 46 nearby (z < 0.1) galaxy clusters, we compute stellar, remnant, and intracluster light masses and combine them with previously derived ICM masses. The resulting total baryonic masses are compared to MOND dynamical masses inferred from hydrostatic equilibrium. We find that the baryonic mass in stars, remnants and the ICM accounts for at least $88^{+5+2}_{-4-1}\\%$ of the MOND dynamical mass. This constrains the kick velocities of the remnants and substantially alleviates the missing mass problem for galaxy clusters in MOND.",
      "pdf_url": "https://arxiv.org/pdf/2602.06082.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06092",
      "title": "Exploring Cosmological Tensions with Hubble Parameter Tomography via Linear Cosmography",
      "authors": [
        "Brett Bochner",
        "Aiden Jin"
      ],
      "abstract": "Exploring Cosmological Tensions with Hubble Parameter Tomography via Linear Cosmography Brett Bochner (Hofstra University), Aiden Jin Research presented at the 33rd Texas Symposium on Relativistic Astrophysics, Tempe, Arizona, December 9, 2025. 24 pages, 11 figures, 2 tables; All figures preliminary, undergoing revision for journal submission Cosmology and Nongalactic Astrophysics (astro-ph.CO) Given the persistence of various tensions in the \"Cosmic Concordance\" -- such as the \"Hubble Tension\", and the possible departure from LambdaCDM time evolution -- seen when combining complementary data sets (CMB studies, Baryon Acoustic Oscillations, Type Ia Supernovae, etc.), it remains an ongoing possibility for these to have a real cosmological origin. If one assumes such deviations to be real, a model-independent formalism (cosmography) is useful for locating the source of the problem with concordance cosmology. The extraordinarily good fit of LambdaCDM to the CMB data shows that it was a successful model of the universe at high redshift. Yet at lower redshift -- when the dark energy density becomes significant, and its precise physical nature becomes important -- the universe may have gone off the track of simple LambdaCDM. Here we use linear cosmography fits to binned Supernova data to reconstruct the detailed temporal history of the Hubble parameter, thus probing for interesting time-dependent behaviors of the expansion rate during and after the onset of cosmic acceleration. Using combined Type Ia supernovae from the Dark Energy Survey 5-Year data release and the Union2.1 compilation, we find intriguing hints of an oscillatory pattern in the Hubble parameter during the acceleration era. While these hints are low-significance, and not robust under different redshift binnings, we present this work as a proof-of-concept demonstration of this method for reconstructing the Hubble parameter evolution, which may be useful for the voluminous Supernova data sets anticipated to become available during the next few years.",
      "pdf_url": "https://arxiv.org/pdf/2602.06092.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06133",
      "title": "Dynamic Zoom Simulations of structure formation beyond standard cosmology",
      "authors": [
        "Riccardo Zangarelli",
        "Marco Baldi",
        "Federico Marinacci",
        "Enrico Garaldi"
      ],
      "abstract": "Dynamic Zoom Simulations of structure formation beyond standard cosmology Riccardo Zangarelli, Marco Baldi, Federico Marinacci, Enrico Garaldi 16 pages, 14 figures, 3 tables. Submitted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) (Abridged) A thorough interpretation of the current and upcoming generation of cosmological observations requires unprecedented large-scale, high-resolution simulations spanning multiple cosmological models and parameters. The realization of these computationally demanding simulations poses a crucial technical challenge. We present beyond - $\\Lambda$CDM implementations of the Dynamic Zoom Simulations (DZS) method, a performance-enhancing technique tailored for large-scale simulations that produce lightcone-like outputs. This approach dynamically decreases the resolution of a simulation in the regions that are not in causal connection with the observer, saving computational resources without directly affecting the physical properties within the lightcone. We implemented the DZS algorithm in two state-of-the-art codes supporting non-standard cosmologies, namely modified $f(R)$ gravity in Arepo and dark sector interactions in Gadget4. We analyzed result accuracy and performance gains across resolution, simulation volume and model by comparing runs performed with and without the DZS algorithm. Our DZS reproduce the lightcone halo mass function, sky-projected massmaps, and matter and weak lensing convergence power spectra with an accuracy of $\\simeq$ 0.1% or higher in most cases. In terms of performance, DZS runs in our test simulations can save up to $\\sim$ 50% runtime compared to the non-DZS counterparts. A scaling to larger simulated volumes suggests that performance gains could improve by an additional $\\sim$ 20% at the resolution levels of current state-of-the-art simulations. The validation of the DZS algorithm in non-standard models demonstrates that this technique can enable cost effective, large-scale ($\\gtrsim$ 1 cGpc/h) simulations with state-of-the-art resolution, providing the computational framework needed to constrain and help the interpretation of forthcoming data.",
      "pdf_url": "https://arxiv.org/pdf/2602.06133.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06293",
      "title": "On the Difficulties with Late-Time Solutions for the Hubble Tension",
      "authors": [
        "Prakhar Bansal",
        "Dragan Huterer"
      ],
      "abstract": "On the Difficulties with Late-Time Solutions for the Hubble Tension Prakhar Bansal, Dragan Huterer 16 pages, 6 figures and 3 tables plus appendices Cosmology and Nongalactic Astrophysics (astro-ph.CO) We explore the notion that cosmological models that modify the late-time expansion history cannot simultaneously fit the SH0ES collaboration's measurements of the Hubble constant, DESI baryon acoustic oscillations data, and Type Ia supernova distances. Adopting a few simple phenomenological models, we quantitatively demonstrate that a satisfactory fit with a model with late-time expansion history can only be achieved if one of the following is true: 1) there is a sharp step in the absolute magnitude of Type Ia supernovae at very low redshift, $z\\sim 0.01$, or 2) the distance duality relation, $d_L(z)=(1+z)^2d_A(z)$, is broken. Both solutions are trivial in that they effectively decouple the calibrated SNIa measurements from other data, and this qualitatively agrees with previous work built on studying specific dark-energy models. We also identify a less effective class of late-time solutions with a transition at $z\\simeq 0.15$ that lead to a more modest improvement in fit to the data than models with a very low-z transition. Our conclusions are largely unchanged when we include surface brightness fluctuation distance measurements, with their current systematic uncertainties, to our analysis. We finally illustrate our findings by studying a physical model which, when equipped with the ability to smoothly change the absolute magnitude of Type Ia supernovae, partially resolves the Hubble tension.",
      "pdf_url": "https://arxiv.org/pdf/2602.06293.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06334",
      "title": "Characterization of the Polarization Beam Response of SPT-3G Using Point Sources",
      "authors": [
        "T. de Haan",
        "M. Archipley",
        "N. Huang",
        "A. J. Anderson",
        "B. Ansarinejad",
        "L. Balkenhol",
        "D. R. Barron",
        "K. Benabed",
        "A. N. Bender",
        "B. A. Benson",
        "F. Bianchini",
        "L. E. Bleem",
        "S. Bocquet",
        "F. R. Bouchet",
        "L. Bryant",
        "E. Camphuis",
        "M. G. Campitiello",
        "J. E. Carlstrom",
        "J. Carron",
        "C. L. Chang",
        "P. Chaubal",
        "P. M. Chichura",
        "A. Chokshi",
        "T.-L. Chou",
        "A. Coerver",
        "T. M. Crawford",
        "C. Daley",
        "K. R. Dibert",
        "M. A. Dobbs",
        "M. Doohan",
        "A. Doussot",
        "D. Dutcher",
        "W. Everett",
        "C. Feng",
        "K. R. Ferguson",
        "N. C. Ferree",
        "K. Fichman",
        "A. Foster",
        "S. Galli",
        "A. E. Gambrel",
        "R. W. Gardner",
        "F. Ge",
        "N. Goeckner-Wald",
        "R. Gualtieri",
        "F. Guidi",
        "S. Guns",
        "N. W. Halverson",
        "E. Hivon",
        "A. Y. Q. Ho",
        "G. P. Holder",
        "W. L. Holzapfel",
        "J. C. Hood",
        "A. Hryciuk",
        "F. Keruzore",
        "A. R. Khalife",
        "L. Knox",
        "M. Korman",
        "K. Kornoelje",
        "C.-L. Kuo",
        "K. Levy",
        "Y. Li",
        "A. E. Lowitz",
        "C. Lu",
        "G. P. Lynch",
        "T. J. Maccarone",
        "A. S. Maniyar",
        "E. S. Martsen",
        "F. Menanteau",
        "M. Millea",
        "J. Montgomery",
        "Y. Nakato",
        "T. Natoli",
        "G. I. Noble",
        "Y. Omori",
        "A. Ouellette",
        "Z. Pan",
        "P. Paschos",
        "K. A. Phadke",
        "A. W. Pollak",
        "K. Prabhu",
        "W. Quan",
        "M. Rahimi",
        "A. Rahlin",
        "C. L. Reichardt",
        "M. Rouble",
        "J. E. Ruhl",
        "E. Schiappucci",
        "A. C. Silva Oliveira",
        "A. Simpson",
        "J. A. Sobrin",
        "A. A. Stark",
        "J. Stephen",
        "C. Tandoi",
        "B. Thorne",
        "C. Trendafilova",
        "C. Umilta",
        "J. D. Vieira",
        "A. G. Vieregg",
        "A. Vitrier",
        "Y. Wan"
      ],
      "abstract": "Characterization of the Polarization Beam Response of SPT-3G Using Point Sources T. de Haan, M. Archipley, N. Huang, A. J. Anderson, B. Ansarinejad, L. Balkenhol, D. R. Barron, K. Benabed, A. N. Bender, B. A. Benson, F. Bianchini, L. E. Bleem, S. Bocquet, F. R. Bouchet, L. Bryant, E. Camphuis, M. G. Campitiello, J. E. Carlstrom, J. Carron, C. L. Chang, P. Chaubal, P. M. Chichura, A. Chokshi, T.-L. Chou, A. Coerver, T. M. Crawford, C. Daley, K. R. Dibert, M. A. Dobbs, M. Doohan, A. Doussot, D. Dutcher, W. Everett, C. Feng, K. R. Ferguson, N. C. Ferree, K. Fichman, A. Foster, S. Galli, A. E. Gambrel, R. W. Gardner, F. Ge, N. Goeckner-Wald, R. Gualtieri, F. Guidi, S. Guns, N. W. Halverson, E. Hivon, A. Y. Q. Ho, G. P. Holder, W. L. Holzapfel, J. C. Hood, A. Hryciuk, F. Keruzore, A. R. Khalife, L. Knox, M. Korman, K. Kornoelje, C.-L. Kuo, K. Levy, Y. Li, A. E. Lowitz, C. Lu, G. P. Lynch, T. J. Maccarone, A. S. Maniyar, E. S. Martsen, F. Menanteau, M. Millea, J. Montgomery, Y. Nakato, T. Natoli, G. I. Noble, Y. Omori, A. Ouellette, Z. Pan, P. Paschos, K. A. Phadke, A. W. Pollak, K. Prabhu, W. Quan, M. Rahimi, A. Rahlin, C. L. Reichardt, M. Rouble, J. E. Ruhl, E. Schiappucci, A. C. Silva Oliveira, A. Simpson, J. A. Sobrin, A. A. Stark, J. Stephen, C. Tandoi, B. Thorne, C. Trendafilova, C. Umilta, J. D. Vieira, A. G. Vieregg, A. Vitrier, Y. Wan Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Precise measurements of cosmic microwave background polarization require rigorous control of instrumental systematics. For the South Pole Telescope's third-generation camera (SPT-3G), accurate characterization of the beam is critical for understanding the polarized mm-wave sky. Here, we present direct measurements of SPT-3G's polarized beam response using observations of 100 polarized extragalactic point sources. Previous SPT-3G CMB power spectrum analyses introduced a phenomenological parameter $\\beta_\\mathrm{pol}$ to describe the degree of polarization preserved in beam sidelobes. These analyses found evidence for significant depolarization driven by the requirement of polarization power spectrum consistency between different frequency bands. Our direct measurements yield $\\beta_\\mathrm{pol}=0.90\\pm0.10$ at 95 GHz, $1.01\\pm0.12$ at 150 GHz, and $0.81\\pm0.29$ at 220 GHz, indicating minimal sidelobe depolarization. We validate these results through extensive systematic tests including Bayesian posterior sampling versus frequentist bootstrap resampling, real-space versus Fourier-space analysis, and variations on temperature-to-polarization leakage handling, covariance determination, and source selection. When compared to values inferred from previous cosmological analyses, which favored significant depolarization to resolve inter-frequency power spectrum inconsistencies, we find a mild tension of $1.9\\sigma$. However, this apparent discrepancy is dependent on the beam modeling, as our point source-based analysis derives much of its constraining power on $\\beta_\\mathrm{pol}$ from higher multipoles than the power spectrum analysis. These measurements therefore admit three explanations for the frequency-dependent residuals observed in the power spectrum analysis: a statistical fluctuation, the need for more sophisticated polarized beam models, or systematics other than beam depolarization.",
      "pdf_url": "https://arxiv.org/pdf/2602.06334.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06434",
      "title": "The Massive and Distant Clusters of WISE Survey 2: Splashback Radii to z=1.65 from Galaxy Density Profiles",
      "authors": [
        "Khunanon Thongkham",
        "Anthony H. Gonzalez",
        "Mark Brodwin",
        "Ariane Trudeau",
        "Peter Eisenhardt",
        "S. A. Stanford",
        "Emily Moravec",
        "Thomas Connor",
        "Daniel Stern"
      ],
      "abstract": "The Massive and Distant Clusters of WISE Survey 2: Splashback Radii to z=1.65 from Galaxy Density Profiles Khunanon Thongkham, Anthony H. Gonzalez, Mark Brodwin, Ariane Trudeau, Peter Eisenhardt, S. A. Stanford, Emily Moravec, Thomas Connor, Daniel Stern 22 pages, 7 figures, 9 tables, submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The Massive and Distant Clusters of WISE Survey 2 (MaDCoWS2) is a WISE-selected catalog of galaxy clusters at $0.1<z<2$ covering an effective area of $>6000$ deg$^2$. In this paper, we derive splashback radii for this cluster ensemble from galaxy density profiles and constrain the mass threshold of the survey as a function of redshift. We use MaDCoWS2 cluster candidates at $0.4\\leq z \\leq 1.65$ divided into subsamples with different signal-to-noise (S/N$_{\\rm P}$) and redshifts, cross-correlated with galaxies from the CatWISE2020 catalog, to obtain average surface density profiles. We perform a Markov Chain Monte Carlo analysis to derive parameter estimates for theoretical models consisting of orbiting and infalling terms. A distinct splashback feature is detected in all subsamples. The measured splashback radii span from $0.89^{+0.02}_{-0.02}h^{-1}$ comoving Mpc/cMpc ($0.61^{+0.02}_{-0.02}h^{-1}$ proper Mpc/pMpc) at $\\overline{z}=0.45$ to $1.27^{+0.05}_{-0.05}h^{-1}$ cMpc ($0.53^{+0.04}_{-0.04}h^{-1}$ pMpc) at $\\overline{z}=1.54$. We also find that splashback radii increase with $S/N_{\\rm P}$ at fixed redshift. The resultant splashback radii constrain the redshift dependence of the mass of MaDCoWS2 clusters at fixed $S/N_{\\rm P}$. We calculate $M_{\\rm 200m}$ from the radii using a relation based on a cosmological simulation. MaDCoWS2 $M_{\\rm 200m}$ values derived from the simulation-based relation are lower than the expected values based on weak-lensing observations. More robust mass constraints will come from calibrating splashback radii derived from galaxy density profiles with weak lensing shear profiles from facilities such as $\\textit{Euclid}$, Rubin, and $\\textit{Roman}$.",
      "pdf_url": "https://arxiv.org/pdf/2602.06434.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06439",
      "title": "The Massive and Distant Clusters of WISE Survey 2: Detection of splashback radii in galaxy cluster total light stacks",
      "authors": [
        "A. Trudeau",
        "Anthony H. Gonzalez",
        "K. Thongkham",
        "M. Brodwin",
        "Thomas Connor",
        "Peter R. M. Eisenhardt",
        "Emily Moravec",
        "S. A. Stanford",
        "D. Stern"
      ],
      "abstract": "The Massive and Distant Clusters of WISE Survey 2: Detection of splashback radii in galaxy cluster total light stacks A. Trudeau, Anthony H. Gonzalez, K. Thongkham, M. Brodwin, Thomas Connor, Peter R. M. Eisenhardt, Emily Moravec, S. A. Stanford, D. Stern Accepted by ApJ; 16 pages, 6 figures, 3 table Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The splashback radius, the radius of the apocenter of the first orbit of infalling material, is a measurable quantity marking the boundary between a galaxy cluster and its infalling region. We report detections of splashback radii in total light stacks, i.e. image stacks centered on the cores of galaxy clusters. Our analysis uses Wide-field Infrared Survey Explorer (WISE) W1 and W2 images of 83,345 candidate clusters at $0.5 \\lesssim z \\lesssim 1.9$ from the Massive and Distant Clusters of WISE Survey 2 (MaDCoWS2). The clusters are organized in stacks by redshift and signal-to-noise ($S\\slash N$) ratios. We adopt a statistical approach, using 1000 bootstrap realizations to determine the median projected splashback radius and its confidence interval in a given bin. We compare our splashback radii with the measurements made by K. Thongkham et al. on a similar sample of MaDCoWS2 clusters using galaxy-cluster cross-correlation and find that they are consistent, although our method yields larger error bars. Our main systematic error is the accuracy of the background subtraction, but its impact remains small: the consistency of K. Thongkham et al. and our results suggests that neither method suffers from large systematics. The sensitivity of total light stacking to the contribution of faint galaxies can be advantageous to locate splashback radii when only the brightest galaxies are detected in individual images, such as at high redshifts. We present a potential application of this new technique to probe the evolution of the stellar mass in cluster infalling regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.06439.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06794",
      "title": "Primordial Black Hole Abundance from Reionization",
      "authors": [
        "Ziwen Yin",
        "Hanyu Cheng",
        "Luca Visinelli"
      ],
      "abstract": "Primordial Black Hole Abundance from Reionization Ziwen Yin, Hanyu Cheng, Luca Visinelli Cosmology and Nongalactic Astrophysics (astro-ph.CO) We derive robust constraints on the initial abundance of evaporating primordial black holes (PBHs) using the reionization history of the Universe as a cosmological probe. We focus on PBHs that inject electromagnetic (EM) energy into the intergalactic medium (IGM) after recombination, in the mass range $3.2\\times 10^{13}\\,\\mathrm{g} \\lesssim M_{\\rm PBH} \\lesssim 5\\times 10^{14}\\,\\mathrm{g}$. For each PBH mass, we compute the redshift-dependent energy injection from Hawking evaporation using \\texttt{BlackHawk}, fully accounting for the time evolution of the PBH mass and the complete spectrum of emitted Standard Model particles and gravitons. The resulting photons and electrons are propagated through the primordial plasma using \\texttt{DarkHistory}, which self-consistently models EM cascades and determines the fraction of injected energy deposited into ionization, excitation, and heating of the IGM. These modifications to the ionization and thermal histories are incorporated into a Gaussian Process reconstruction of the free-electron fraction based on low-$\\ell$ CMB polarization data from the \\textit{Planck} mission. This non-parametric approach allows for a statistically well-defined separation between exotic high-redshift energy injection and late-time astrophysical reionization, allowing PBH evaporation to be constrained through its contribution to the high-redshift optical depth. Requiring consistency with current CMB measurements, we obtain upper limits on the initial PBH abundance that are robust against reionization modeling uncertainties and systematically more conservative than existing bounds, reflecting the fully numerical and time-dependent treatment of Hawking evaporation and energy deposition. Our results demonstrate the power of reionization observables as a precision probe of PBH evaporation and other scenarios involving late-time energy injection.",
      "pdf_url": "https://arxiv.org/pdf/2602.06794.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06904",
      "title": "Non-spherical BUFFALOs: a weak lensing view of the Frontier Field clusters and associated systematics",
      "authors": [
        "A. Niemiec",
        "A. Acebron",
        "B. Beauchesne",
        "M. Jauzac",
        "J. M. Diego",
        "D. Eckert",
        "D. Harvey",
        "A. M. Koekemoer",
        "D. J. Lagattuta",
        "M. Limousin",
        "G. Mahler",
        "N. Patel",
        "S. Tam",
        "J. F. V. Allingham",
        "R. Cen",
        "A. Faisst",
        "D. Perera",
        "M. Sereno"
      ],
      "abstract": "Non-spherical BUFFALOs: a weak lensing view of the Frontier Field clusters and associated systematics A. Niemiec, A. Acebron, B. Beauchesne, M. Jauzac, J. M. Diego, D. Eckert, D. Harvey, A. M. Koekemoer, D. J. Lagattuta, M. Limousin, G. Mahler, N. Patel, S. Tam, J. F. V. Allingham, R. Cen, A. Faisst, D. Perera, M. Sereno Cosmology and Nongalactic Astrophysics (astro-ph.CO) Galaxy clusters are tracers of the large scale structures of the Universe, making the time evolution of their mass function dependent on key cosmological parameters, such as the cosmic matter density or the amplitude of density fluctuations $\\sigma_8$. Accurate measurements of cluster's total masses are therefore essential, yet they can be challenging, particularly for clusters with complex morphologies, as simple mass profiles are often adopted to fit the measurements. In this work, we focus on the Frontier Fields galaxy clusters: a sample of six extremely massive systems, that, in most cases, exhibit highly complex mass distributions. The BUFFALO survey extended the Hubble Space Telescope observations for the Frontier Fields galaxy clusters, providing high-resolution multi-band imaging within a few Mpc. Combining this high-quality imaging dataset with ancillary spectroscopy, we produce weak-lensing catalogues with very high source densities, about 50 sources/arcmin$^2$. This allows us to robustly estimate the individual weak-lensing cluster masses and quantify the sensitivity of these measurements on different factors, such as the cluster centring, the uncertainty on the redshift distribution or the foreground contamination and boost factor correction. This provides a data-driven analysis of the different sources of systematics that can impact such measurements. We find that the largest sources of systematic bias arise for the most disturbed clusters, such as the multi-modal, merging galaxy cluster Abell 2744. This analysis sets a comprehensive framework for assessing the impact of systematics on the weak-lensing estimates of cluster masses, and in particular, in the case of unrelaxed clusters. This can play a key role in forthcoming cosmological analyses based on wide-field surveys such as Euclid and the Legacy Survey of Space and Time of the Rubin Observatory.",
      "pdf_url": "https://arxiv.org/pdf/2602.06904.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06109",
      "title": "Correlation Calibration: A Hybrid Calibration Technique for Radio Interferometric Arrays",
      "authors": [
        "Robert Pascua",
        "Jonathan Sievers",
        "Adrian Liu"
      ],
      "abstract": "Correlation Calibration: A Hybrid Calibration Technique for Radio Interferometric Arrays Robert Pascua, Jonathan Sievers, Adrian Liu Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Calibrating out per-antenna signal chain effects is an essential step in analyzing radio interferometric data. For drift-scanning arrays, robustly calibrating the data is especially challenging due to the lack of the ability to track a calibration source. Consequently, calibration strategies for drift-scanning arrays are limited by our knowledge of the radio sky at large, as well as the direction-dependent instrument response. In the context of 21 cm cosmology, where small calibration errors can conspire to overwhelm the cosmological signal, it is therefore crucially important to develop calibration strategies that are capable of accurately calibrating the data in the presence of sky or instrument modeling errors. In this paper we present CorrCal, a covariance-based calibration strategy for redundant radio interferometric arrays. CorrCal is a hybrid calibration strategy that leverages the strengths of traditional sky-based calibration and redundant calibration in a computationally efficient framework that is fairly insensitive to modeling errors. We find that the calibration errors from CorrCal are unbiased and far below typical thermal noise thresholds across a wide range of modeling error scenarios. We show that CorrCal is computationally efficient: our implementation is capable of evaluating the likelihood and its gradient in less than a second for 1,000-element class arrays using just a single laptop core. Given CorrCal's computational efficiency and robustness to modeling errors, we anticipate that it will serve as a useful tool in the analysis of radio interferometric data from current and next-generation experiments targeting the cosmological 21 cm signal.",
      "pdf_url": "https://arxiv.org/pdf/2602.06109.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06660",
      "title": "Rotational Behaviour of Exotic Compact Objects",
      "authors": [
        "Zakary Buras-Stubbs",
        "Ilídio Lopes"
      ],
      "abstract": "Rotational Behaviour of Exotic Compact Objects Zakary Buras-Stubbs, Ilídio Lopes 13 pages, 8 figures, Accepted for publication in PRD High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We construct exotic compact objects composed entirely of self-interacting asymmetric fermionic dark matter governed by a repulsive Yukawa potential with massive dark interaction boson. By considering the structural, tidal, and rotational properties of solar mass self-gravitating dark matter systems, and contrasting them against purely baryonic neutron stars, described by the well understood SLy4 equation of state, we hope to shed some light on the place of dark compact systems in the context of gravitational wave astronomy, specifically due to the difficulty parsing mass and radius data from events with no electromagnetic counterpart. Here we consider systems composed of 1 GeV and 10 GeV dark matter. Relevant compact objects are then analysed and simulated as both static bodies, and rotating systems governed by the Hartle-Thorne formalism to second order. Here within we highlight the differences in key tidal and rotational properties encoded in gravitational wave signals, and analyse how dark objects may mimic or distinguish themselves to current and future gravitational wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2602.06660.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2412.00182",
      "title": "Investigating cosmic strings using large-volume hydrodynamical simulations in the context of JWST's massive UV-bright galaxies",
      "authors": [
        "Sonja M. Koehler",
        "Hao Jiao",
        "Rahul Kannan"
      ],
      "abstract": "Investigating cosmic strings using large-volume hydrodynamical simulations in the context of JWST's massive UV-bright galaxies Sonja M. Koehler, Hao Jiao, Rahul Kannan 14 pages, 9 figures. Version 2: new JWST data included in Figs. 2 and 3, relevant references to new literature added, concentration of lowest-mass halos corrected in Fig. 5, Appendix B (Convergence tests at higher numerical resolution) added, other minor revisions for clarity Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Recent observations from the James Webb Space Telescope (JWST) have uncovered an unexpectedly large abundance of massive, UV-bright galaxies at high redshifts, presenting a significant challenge to established galaxy formation models within the standard $\\Lambda$CDM cosmological framework. Cosmic strings, predicted by a wide range of particle physics theories beyond the Standard Model, provide a promising potential explanation for these observations. They may act as additional gravitational seeds in the early universe, enhancing the process of high-redshift structure formation, potentially resulting in a more substantial population of massive, efficiently star-forming galaxies. We numerically investigate this prediction in large-volume hydrodynamical simulations using the moving-mesh code AREPO and the well-tested IllustrisTNG galaxy formation model. We evaluate the simulation results in the context of recent JWST data and find that sufficiently energetic cosmic strings produce UV luminosity and stellar mass functions that are in slightly to substantially better agreement with observations at high redshifts. Moreover, we observe that the halos seeded by cosmic strings exhibit a greater efficiency of star formation and enhanced central concentrations. Interestingly, our findings indicate that the simulations incorporating cosmic strings converge with those from a baseline $\\Lambda$CDM model by redshift $z \\sim 6$. This convergence suggests that the modified cosmological framework effectively replicates the successful predictions of the standard $\\Lambda$CDM model at lower redshifts, where observational constraints are significantly stronger. Our results provide compelling evidence that cosmic strings may play a crucial role in explaining the galaxy properties observed by JWST at high redshifts while maintaining consistency with well-established models at later epochs.",
      "pdf_url": "https://arxiv.org/pdf/2412.00182.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.11762",
      "title": "ECHO21: a tool for modelling global 21-cm signal from dark ages to reionization",
      "authors": [
        "Shikhar Mittal",
        "Girish Kulkarni",
        "Peter Sims"
      ],
      "abstract": "ECHO21: a tool for modelling global 21-cm signal from dark ages to reionization Shikhar Mittal, Girish Kulkarni, Peter Sims Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We introduce a Python package called ECHO21 for modelling the global 21-cm signal from the dark ages through cosmic dawn to the end of reionization. Leveraging its analytical framework, ECHO21 generates a single model in $\\mathcal{O}(1)\\,$s, allowing a large number of signals to be generated efficiently by distributing models across multiple cores. Thus, it is ideal for performing astrophysical or cosmological inference from a given 21-cm dataset. We offer six astrophysical parameters that control the Lyman-$\\alpha$ (Ly$\\alpha$) emissivity, X-ray emissivity, emissivity of ionizing photons, and star formation rate. Beyond its efficiency some of the attractive and novel features in ECHO21 relative to previously published codes are inclusion of Ly$\\alpha$ heating, ability to vary the standard cosmological parameters as easily as the astrophysical parameters, and different models of star formation rate density (physically-motivated, a semi-empirical, and an empirically-motivated). With a number of 21-cm experiments soon to provide cosmic dawn 21-cm data, ECHO21 is a flexible and extensible new open-source package for making quick but sufficiently realistic astrophysical inferences. We make our code publicly available.",
      "pdf_url": "https://arxiv.org/pdf/2503.11762.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.08561",
      "title": "Tracing Missing Baryons in the Cosmic Filaments with tSZ and CMB-Lensing Stacking",
      "authors": [
        "Jianzhuo Li",
        "Yi Zheng",
        "Weishan Zhu"
      ],
      "abstract": "Tracing Missing Baryons in the Cosmic Filaments with tSZ and CMB-Lensing Stacking Jianzhuo Li, Yi Zheng, Weishan Zhu 31 pages, 15 figures, JCAP accepted. To address the potential impact of the Fingers-of-God (FoG) effect, an appendix is provided to evaluate its influence on filament properties and validate our main results Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the distribution of missing baryons in the cosmic filaments by stacking $\\sim 30,700$ filaments across the northern and southern SDSS sky regions using Planck Compton-$y$ and CMB lensing maps. Filaments are identified using the DisPerSE algorithm applied to the SDSS LOWZ-CMASS galaxy samples, selecting structures with lengths between 30-100 cMpc and redshifts in the range $0.2 < z < 0.6$. Radial profiles are extracted out to 25 cMpc from the filament spines, and galaxy clusters with halo masses above $\\sim 3 \\times 10^{13} M_\\odot$ are masked to reduce contamination. We detect the thermal Sunyaev-Zeldovich (tSZ) signal at $7.82\\sigma$ and the CMB lensing signal at $7.78\\sigma$. The stacked profiles are corrected by a geometric bias correction based on filament inclination with respect to the line-of-sight, and they are portrayed assuming isothermal, cylindrically symmetric models. We explore different gas and matter density distributions, focusing on the $\\beta$-models with $(\\alpha,\\beta) = (2,2/3)$ or $(1,1)$. By jointly fitting the Compton-$y$ and $\\kappa$ profiles, we constrain the central electron overdensity and temperature to be $\\delta = 4.18^{+2.01}_{-1.06}$ and $T_e = 2.74^{+0.65}_{-0.53}\\times 10^6 \\mathrm{K}$ for the standard $\\beta$-model. These results suggest that filamentary WHIM in our selected long filaments contributes a significant baryon fraction of $0.127^{+0.019}_{-0.021}\\times \\Omega_b$ to the cosmic baryon budget.",
      "pdf_url": "https://arxiv.org/pdf/2507.08561.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.11462",
      "title": "From Redshift to Real Space: Combining Linear Theory With Neural Networks",
      "authors": [
        "Edoardo Maragliano",
        "Punyakoti Ganeshaiah Veena",
        "Giulia Degni",
        "Enzo Franco Branchini"
      ],
      "abstract": "From Redshift to Real Space: Combining Linear Theory With Neural Networks Edoardo Maragliano, Punyakoti Ganeshaiah Veena, Giulia Degni, Enzo Franco Branchini Cosmology and Nongalactic Astrophysics (astro-ph.CO) Spectroscopic redshift surveys are key tools to trace the large-scale structure (LSS) of the Universe and test the $\\Lambda$CDM model. However, using redshifts as distance proxies introduces distortions in the 3D galaxy distribution. If uncorrected, these distortions lead to systematic errors in LSS analyses and cosmological parameter estimation. We present a new method that combines linear theory (LT) and a neural network (NN) to mitigate redshift space distortions (RSDs). The hybrid LT+NN approach is trained and validated on dark matter halo fields from z = 1 snapshots of the Quijote N-body simulations. LT corrects large-scale distortions in the linear regime, while the NN learns quasi-linear and small-scale features. The LT correction is applied first, then the NN is trained on the resulting fields to improve accuracy across scales. The method uses a Mean Squared Error (MSE) loss and yields significant performance gains: approximately 50% improvement over LT alone and 12% over NN alone. The reconstructed fields from the LT+NN method show stronger correlations with the true real-space fields than either LT or NN separately. The hybrid method also improves clustering statistics such as halo-halo and halo-void correlations, with benefits extending to BAO scales. Compared to NN-only, it provides better suppression of spurious anisotropies on large and quasi-linear scales, as measured by the quadrupole moments of correlation functions. This work shows that combining a physically motivated dynamical model with a machine learning algorithm leverages the strengths of both approaches. The LT+NN method achieves high accuracy with modest training data and computational cost, making it a promising tool for future applications to more realistic galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2507.11462.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.01759",
      "title": "Resolving the Planck-DESI tension by non-minimally coupled quintessence",
      "authors": [
        "Jia-Qi Wang",
        "Rong-Gen Cai",
        "Zong-Kuan Guo",
        "Shao-Jiang Wang"
      ],
      "abstract": "Resolving the Planck-DESI tension by non-minimally coupled quintessence Jia-Qi Wang, Rong-Gen Cai, Zong-Kuan Guo, Shao-Jiang Wang v3, 5 pages + 8 pages Supplemental Materials, 9 figures, 3 tables, extended discussions and analysis Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The Planck measurement of cosmic microwave background (CMB) has established the $\\Lambda$-cold-dark-matter ($\\Lambda$CDM) model as the concordant model along with other observations. However, recent measurements of baryon acoustic oscillations (BAO) from Dark Energy Spectroscopic Instrument (DESI) have renewed the matter fraction $\\Omega_\\mathrm{m}$ tension between Planck-$\\Lambda$CDM and DESI-$\\Lambda$CDM. Directly reconciling this CMB-BAO tension with a dynamical DE in Chevallier-Polarski-Linder (CPL) parametrization seems to imply a crossing of the equation-of-state (EoS) through $w=-1$ at low redshifts. In this letter, we resolve this $\\Omega_\\mathrm{m}$ tension by allowing for the DM non-minimally coupled to gravity via a quintessence field. This non-minimal coupling is preferred over $3\\sigma$ confidence level. Consequently, even though the usual effective EoS of the coupled quintessence apart from the standard CDM part never crosses but always above $w=-1$, a misidentification with the $w_0w_a$CDM model would exactly fake such a crossing behavior, and the tensions on neutrino mass and growth rate in the $\\Lambda$CDM model are also relieved in our model as a result of the resolved $\\Omega_\\mathrm{m}$ tension.",
      "pdf_url": "https://arxiv.org/pdf/2508.01759.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.05195",
      "title": "CLASH-VLT: The variance in the velocity anisotropy profiles of galaxy clusters",
      "authors": [
        "A. Biviano",
        "E.A. Maraboli",
        "L. Pizzuti",
        "P. Rosati",
        "A. Mercurio",
        "G. De Lucia",
        "C. Ragone-Figueroa",
        "C. Grillo",
        "G.L. Granato",
        "M. Girardi",
        "B. Sartoris",
        "M. Annunziatella"
      ],
      "abstract": "CLASH-VLT: The variance in the velocity anisotropy profiles of galaxy clusters A. Biviano, E.A. Maraboli, L. Pizzuti, P. Rosati, A. Mercurio, G. De Lucia, C. Ragone-Figueroa, C. Grillo, G.L. Granato, M. Girardi, B. Sartoris, M. Annunziatella Accepted for publication in A&A on Jan 31, 2026 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The velocity anisotropy profiles, $\\beta(r)$, of galaxy clusters are directly related to the shape of the orbits of their member galaxies. Knowledge of $\\beta(r)$ is important to understand the assembly process of clusters and the evolutionary processes of their galaxies, and to improve the determination of cluster masses based on cluster kinematics. We determined the $\\beta(r)$ of nine massive clusters at redshift $0.19 \\leq z \\leq 0.45$ from the CLASH-VLT data set, with 150 to 950 spectroscopic members each. We selected spectroscopic cluster members with the CLUMPS algorithm calibrated on cosmological simulations. We applied the MAMPOSSt code to the distribution of cluster members in projected phase-space to constrain the cluster mass profile, $M(r)$, using priors derived from a previous gravitational lensing analysis. Given the MAMPOSSt best-fit solution for $M(r)$, we then solved the inversion of the Jeans equation to determine $\\beta(r)$ without assumptions of its functional form. We also ran the DS+ code to identify subclusters and characterize the dynamical status of our clusters. The average $\\beta(r)$ is slightly radial, with the anisotropy increasing from $\\beta \\simeq 0.2$ at the cluster center, to $\\beta \\simeq 0.5$ at the virial radius. There is substantial variance in the $\\beta(r)$ of the individual clusters, that cannot be entirely accounted for by the observational uncertainties. Clusters of lower mass and with a low concentration per given mass have more tangential $\\beta(r)$. A comparison with cluster-sized halos in cosmological hydrodynamical simulations indicates a very good agreement for the average $\\beta(r)$, but a smaller variance in the profiles than observed. We conclude that massive clusters cannot be characterized by a unique universal $\\beta(r)$ and that the orbital distribution of cluster galaxies carries information on the merging history of the cluster.",
      "pdf_url": "https://arxiv.org/pdf/2508.05195.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.02431",
      "title": "Can an Anti-de Sitter Vacuum in the Dark Energy Sector Explain JWST High-Redshift Galaxy and Reionization Observations?",
      "authors": [
        "Anirban Chakraborty",
        "Tirthankar Roy Choudhury",
        "Anjan Ananda Sen",
        "Purba Mukherjee"
      ],
      "abstract": "Can an Anti-de Sitter Vacuum in the Dark Energy Sector Explain JWST High-Redshift Galaxy and Reionization Observations? Anirban Chakraborty, Tirthankar Roy Choudhury, Anjan Ananda Sen, Purba Mukherjee 19 pages, 10(+3) figures. Accepted for publication in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The unexpectedly large abundance of UV-bright galaxies at $z>10$ discovered by the James Webb Space Telescope poses a significant challenge to the standard $\\Lambda$CDM cosmology. This work tests whether modifying the cosmological background, and thereby the growth of structures, can resolve this tension without invoking significant evolution in the astrophysical properties of early galaxies. We investigate an alternative framework featuring an anti-de Sitter vacuum in the dark energy sector, which naturally arises in quantum gravity models like string theory and can enhance early structure formation. Using a self-consistent semi-analytical model that couples galaxy evolution with reionization, we confront this scenario with a wide range of observations. We show that while a model tailored to fit the high-$z$ UV luminosity functions (UVLFs) appears promising, it is in strong tension with cosmological constraints from the CMB and other low-redshift probes. Conversely, models within this framework that satisfy these constraints provide only a modest boost to structure formation and fail to reproduce the observed galaxy abundances at $z>10$. Although these models remain consistent with the cosmic reionization history, we find that this class of cosmological modifications is insufficient on its own to explain the galaxy excess. Our study underscores the importance of holistic testing for any beyond-$\\Lambda$CDM proposal; apparent success in one observational regime does not guarantee overall viability. By demonstrating the limitations of a purely cosmological solution, our results strengthen the case that evolving astrophysical properties are a necessary ingredient for solving the challenge of early galaxy formation.",
      "pdf_url": "https://arxiv.org/pdf/2509.02431.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21952",
      "title": "Modified Cosmology or Modified Galaxy Astrophysics is Driving the z>6 JWST Results? CMB Experiments can discover the Origin in the Near Future",
      "authors": [
        "Harsh Mehta",
        "Suvodip Mukherjee"
      ],
      "abstract": "Modified Cosmology or Modified Galaxy Astrophysics is Driving the z>6 JWST Results? CMB Experiments can discover the Origin in the Near Future Harsh Mehta, Suvodip Mukherjee 18 pages, 5 figures, 2 tables. Published in ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The massive and bright galaxies observed by the James Webb Space Telescope (JWST) at high redshifts ($z > 6$) have challenged our understanding of the Universe. This may require revisiting the physics of galaxy formation and evolution, or modifying the $\\Lambda$CDM cosmological model to explain these observations, or both. We show that high-resolution CMB experiments such as the Simons Observatory (or CMB-S4) can measure smoking-gun signatures jointly in weak lensing and kinematic Sunyaev-Zeldovich (kSZ) power spectra, which can shed light on both these scenarios. An increase in the matter power spectrum at small scales will enhance the number density of dark matter halos at high redshifts, thereby increasing the galaxy formation rate. This will cause enhanced weak lensing signal from these redshifts and also lead to enhanced patchy-kSZ signal from the epoch of reionization. However, if only galaxy astrophysics is modified, without any modification in the matter power spectrum, then the patchy-kSZ signal gets altered, while the weak lensing signal remains nearly unaltered. We show that we can measure the modified astrophysical and cosmological scenarios at a statistical significance of $10.4\\sigma$ (and $29.8\\sigma$) from Simons Observatory (and CMB-S4), which will enable a conclusive understanding on what physical process is driving the high-redshift observations of JWST.",
      "pdf_url": "https://arxiv.org/pdf/2509.21952.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06121",
      "title": "Searching for dark matter signals with high energy astrophysical neutrinos in IceCube",
      "authors": [
        "Khushboo Dixit",
        "Gopolang Mohlabeng",
        "Soebur Razzaque"
      ],
      "abstract": "Searching for dark matter signals with high energy astrophysical neutrinos in IceCube Khushboo Dixit, Gopolang Mohlabeng, Soebur Razzaque High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) High-energy neutrinos provide a potentially powerful and distinctive probe for dark matter (DM) - neutrino interactions, particularly in environments with enhanced DM densities, such as the DM spikes predicted to form around supermassive black holes (SMBHs) at the center of active galactic nuclei (AGN). Recent observations by the IceCube Neutrino Observatory, which identified four AGN, namely TXS 0506+056, NGC 1068, PKS 1424+240, and NGC 4151 as neutrino sources, provide a unique opportunity to search for signatures of these interactions. In this study, we use IceCube data to derive the most stringent constraints to date on both the energy-dependent and energy-independent DM-neutrino scattering cross-sections. We perform a statistical analysis using data from individual sources as well as a combined (stacked) analysis of all four sources. Our strongest limits arise from the stacking analysis, yielding an upper bound of $\\sigma_{0} \\le 8\\times 10^{-39}$ cm$^2$ for an energy-independent cross-section and $\\sigma_{0} \\le 10^{-39}$ cm$^2$ for a linearly energy-dependent cross-section, both at 90\\% confidence level, particularly in scenarios involving the adiabatic growth of black holes.",
      "pdf_url": "https://arxiv.org/pdf/2602.06121.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06132",
      "title": "Ne and Fe abundances in the ISM: Archival Study of Fe-L and Ne-K edges in Chandra and XMM-Newton",
      "authors": [
        "D. L. Moutard",
        "L. R. Corrales",
        "I. Psaradaki",
        "E. Temple",
        "M. Shi"
      ],
      "abstract": "Ne and Fe abundances in the ISM: Archival Study of Fe-L and Ne-K edges in Chandra and XMM-Newton D. L. Moutard, L. R. Corrales, I. Psaradaki, E. Temple, M. Shi Accepted for Publication in ApJ, 12 Pages, 4 Figures, 4 Tables High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) The abundance of elements in the interstellar medium (ISM) is a key facet for many fields of astrophysical study. In the soft X-ray spectra, absorption by interstellar gas can result in deep absorption features that affect continuum measurements. In this paper, we focus on measuring the abundance of interstellar iron and neon from the column densities observed in soft spectra from XMM-Newton and Chandra for various low mass X-ray binaries (LMXBs), which allows for a direct probe of elemental abundances. As a noble gas, neon will not deplete into solid form, thus providing a benchmark with abundances determined via UV spectroscopy. We find that, when assuming Fe is 90\\% depleted into grains, [Fe/Ne]$ = -0.523\\pm0.025$, [Fe/H]$ + 12 = 7.482\\pm0.016$, and [Ne/H]$ + 12 = 8.012\\pm0.022$, which are the tightest observational constraints on these abundances to date, while being consistent with literature which uses protosolar abundances. We also test how depletion into solid grains and scattering affect the results. The choice of depletion fraction can affect the abundance measurement by roughly $5\\%$, and that the inclusion of a scattering component can affect abundance measurements by $\\sim1-7\\%$.",
      "pdf_url": "https://arxiv.org/pdf/2602.06132.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06170",
      "title": "How Neutron Star Observations Point Towards Exotic Matter: Existing Explanations and a Prospective Proposal",
      "authors": [
        "Mauro Mariani",
        "Ignacio F. Ranea-Sandoval"
      ],
      "abstract": "How Neutron Star Observations Point Towards Exotic Matter: Existing Explanations and a Prospective Proposal Mauro Mariani, Ignacio F. Ranea-Sandoval This article belongs to the Special Issue 'Microphysics Meets Astrophysics: Understanding Dense Matter Through Compact Objects' of the Symmetry journal High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) Multi-messenger astronomical observations of neutron stars, together with more precise calculations and constraints coming from dense matter microphysics, are generating tension with regard to equations of state models used to describe neutron star cores. Assuming an abrupt first-order phase transition with a slow conversion speed between phases, we propose different slow stable hybrid star configurations aiming to reconcile all current constraints simultaneously; within this framework, we also introduce a novel non-CSS parametrization to the quark matter equation of state and discuss its strengths and limitations. We analyze our model results in conjunction with a review of other relevant theoretical possibilities existing in the literature. We found that modern neutron star observations seem to favor the existence of some type of exotic matter in the neutron star cores; in particular, our slow stable hybrid star scenario remains a proposal capable of satisfying these constraints. However, due both to the existing skepticism regarding some of the adopted hypotheses in most extreme neutron star measurements and to the precise adjustment needed for the equation-of-state parameters, significant tension and open questions remain.",
      "pdf_url": "https://arxiv.org/pdf/2602.06170.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06192",
      "title": "Hypersoft X-ray Sources: A New Class of Luminous Cosmic Emitters",
      "authors": [
        "Mustafa Muhibullah",
        "Jimmy A. Irwin",
        "R. Di Stefano"
      ],
      "abstract": "Hypersoft X-ray Sources: A New Class of Luminous Cosmic Emitters Mustafa Muhibullah, Jimmy A. Irwin, R. Di Stefano 31 pages, 6 figures, 2 tables, submitted to a Journal High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) X-ray binaries, powered by black holes, neutron stars, or white dwarfs accreting matter from a companion star, are among the brightest beacons in galaxies, outshining the Sun by a factor of millions. Most emit primarily above 0.3 keV in X-rays, but cooler thermal sources peaking in the extreme ultraviolet (EUV) would be much more difficult to detect due to astronomy's critical blind spot in EUV. Here, we report the discovery of a remarkable new class of luminous, point-like, non-nuclear X-ray objects in galaxies-hypersoft X-ray sources -- that have been missed by all previous surveys to date. Detected primarily or exclusively below 0.3 keV, with 0.15-0.3 keV to 0.3-1.0 keV photon ratios >8, the most luminous examples radiate >1E38 erg/s in the narrow X-ray band, with spectral models indicating even greater bolometric luminosities, largely emitted in the EUV. They rank among the most energetic sources in galaxies, yet their EUV-peaking spectra evaded earlier detections. We propose that hypersoft sources are X-ray binaries spanning multiple physical classes, including accreting white dwarfs or post-nova systems-potential Type Ia supernova progenitors-and systems hosting accreting black holes. Beyond their elusive nature, they may play crucial role in ionizing gas within galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2602.06192.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06321",
      "title": "An Archival Optical Counterpart Search for Extragalactic Fast X-Ray Transients Discovered by Einstein Probe",
      "authors": [
        "Run-Duo Liang",
        "Wen-Xiong Li",
        "Liang-Duan Liu",
        "Ken Smith",
        "Stephen Smartt",
        "Niu Li",
        "Arne Rau",
        "Ling-Zhi Wang",
        "Armin Rest",
        "Ezequiel Treister",
        "Jia-Sheng Huang",
        "Franz Bauer",
        "Jennifer Chacon",
        "Ning-Chen Sun",
        "Qin-Yu Wu",
        "Seán Brennan",
        "Matt Nicholl",
        "Ting-Wan Chen",
        "Amar Aryan",
        "Sheng Yang",
        "Albert K.H. Kong",
        "Sofia Rest",
        "Qinan Wang",
        "James Gillanders",
        "Dong-Yue Li",
        "An Li",
        "Jun Yang",
        "Qing-Chang Zhao",
        "Hui Sun",
        "Yun-Fei Xu",
        "Zhi-Xing Ling",
        "Thomas J. L. de Boer",
        "Chien-Cheng Lin",
        "Thomas B. Lowe",
        "Ken C. Chambers",
        "Eugene A. Magnier",
        "J. Quirola-Vásquez",
        "Xiaofeng Wang",
        "Jing-Wei Hu",
        "Yong Chen",
        "Chen Zhang",
        "Dong-Hua Zhao",
        "He-Yang Liu",
        "Hua-Qing Cheng",
        "Chen-Zhou Cui",
        "Shu-Mei Jia",
        "Cheng-Kui Li",
        "Ju Guan",
        "Mao-Hai Huang",
        "Hao-Wei Peng",
        "Samaporn Tinyanont",
        "Yuan Liu",
        "Wei-Min Yuan"
      ],
      "abstract": "An Archival Optical Counterpart Search for Extragalactic Fast X-Ray Transients Discovered by Einstein Probe Run-Duo Liang, Wen-Xiong Li, Liang-Duan Liu, Ken Smith, Stephen Smartt, Niu Li, Arne Rau, Ling-Zhi Wang, Armin Rest, Ezequiel Treister, Jia-Sheng Huang, Franz Bauer, Jennifer Chacon, Ning-Chen Sun, Qin-Yu Wu, Seán Brennan, Matt Nicholl, Ting-Wan Chen, Amar Aryan, Sheng Yang, Albert K.H. Kong, Sofia Rest, Qinan Wang, James Gillanders, Dong-Yue Li, An Li, Jun Yang, Qing-Chang Zhao, Hui Sun, Yun-Fei Xu, Zhi-Xing Ling, Thomas J. L. de Boer, Chien-Cheng Lin, Thomas B. Lowe, Ken C. Chambers, Eugene A. Magnier, J. Quirola-Vásquez, Xiaofeng Wang, Jing-Wei Hu, Yong Chen, Chen Zhang, Dong-Hua Zhao, He-Yang Liu, Hua-Qing Cheng, Chen-Zhou Cui, Shu-Mei Jia, Cheng-Kui Li, Ju Guan, Mao-Hai Huang, Hao-Wei Peng, Samaporn Tinyanont, Yuan Liu, Wei-Min Yuan 21 pages, 10 figures. Accepted by ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Extragalactic fast X-ray transients (eFXTs) represent a rapidly growing class of high-energy phenomena, whose physical origins remain poorly understood. With its wide-field, sensitive all-sky monitoring, the Einstein Probe (EP) has greatly increased the discovery rate of eFXTs. The search and identification of the optical counterparts of eFXT are vital for understanding their classification and constraining their physical origin. Yet, a considerable fraction of eFXTs still lack secure classifications due to the absence of timely follow-up observations. We carry out a systematic search of publicly available optical survey data and transient databases (including the Zwicky Transient Facility, ZTF, and the Transient Name Server, TNS) for optical counterparts to eFXT candidates detected by EP. In this paper, we describe our ongoing program and report the first results. Specifically, we identified the eFXT EP240506a to be associated with a UV/optical counterpart, AT 2024ofs. Spectroscopy of its host galaxy with VLT yields a redshift of $z = 0.120 \\pm 0.002$. By combining archival survey data with early-time multiwavelength observations, we find that the luminosity and light-curve evolution of AT~2024ofs are consistent with a core-collapse supernova origin. From detectability simulations, we estimate a local event rate density $\\rho_{0}=8.8^{+21.2}_{-3.9}\\ \\mathrm{yr^{-1}\\, Gpc^{-3}}$ for EP240506a-like events, and completeness-corrected rate of about $36$--$78\\ \\mathrm{yr^{-1}\\ Gpc^{-3}}$ for EP-detected X-ray transients associated with supernovae. Our results demonstrate the potential of EP to uncover prompt high-energy emission from core-collapse supernovae and underscore the critical importance of timely follow-up of future eFXT events.",
      "pdf_url": "https://arxiv.org/pdf/2602.06321.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06407",
      "title": "Primordial Black Hole signatures from femtolensing and spectral fringe of Gamma Ray Bursts",
      "authors": [
        "Chang-Yu Dai",
        "Po-Yan Tseng"
      ],
      "abstract": "Primordial Black Hole signatures from femtolensing and spectral fringe of Gamma Ray Bursts Chang-Yu Dai, Po-Yan Tseng High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Femtolensing of gamma ray bursts (GRBs) are vastly studied to constrain the primordial black hole (PBHs) lighter than $10^{-13}$ solar mass and may close the window for PBH dark matter. In this case, wave optics formalism is required and carefully implemented in our analysis. Incorporating the GRB observational data from Swift XRT, we perform the statistic analysis of PBH lensing, comparing with null hypothesis where BAND model is used to parametrize the GRB spectrum. We found few GRB data manifest the spectral fringe which characterize the feature of femtolensing by PBHs, and the analysis shows moderate statistical preference in terms of goodness of fit. Conversely, since most of the fitting to GRB spectral data do not improved with PBH lensing, we utilize to obtain upper bound on the PBH fractional abundance with respect to dark matter. However, the robust constraint cannot be achieved, unless the size of GRBs are smaller than $5\\times10^{7}$ m for PBH mass around $5\\times10^{-15}$ solar mass.",
      "pdf_url": "https://arxiv.org/pdf/2602.06407.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06410",
      "title": "Super-knee cosmic rays from interacting supernovae",
      "authors": [
        "Nick Ekanger",
        "Shigeo S. Kimura",
        "Kazumi Kashiyama"
      ],
      "abstract": "Super-knee cosmic rays from interacting supernovae Nick Ekanger, Shigeo S. Kimura, Kazumi Kashiyama 21 pages, 5+1 figures, 3 tables. Submitted to PRD High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) There is increasing evidence that, in the very late phase of stellar evolution before core collapse, massive stars have winds with large mass loss rates that give rise to a dense circumstellar medium (CSM) surrounding the progenitor star. After core collapse, a shock wave forms when the supernova ejecta interacts with this CSM. In such an interaction, the nuclei in the CSM can undergo diffusive shock acceleration and reach very high energies. We consider such a model, which includes magnetic field amplification from the non-resonant streaming instability, enhancement to the abundance of heavy-ions, and composition-dependent acceleration. Applying this to several supernova subclasses, we find that IIn supernovae can supply a dominant fraction of the observed super-knee cosmic-ray (CR) flux from $\\sim{\\rm few}\\times10^{15}\\,{\\rm eV}$ to $\\sim{\\rm few}\\times10^{17}\\,{\\rm eV}$ and is consistent with recent LHAASO measurements above the CR knee. This systematic model also explains the increasingly heavy nuclear composition in this energy range.",
      "pdf_url": "https://arxiv.org/pdf/2602.06410.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06615",
      "title": "Studies on the spin and magnetic inclination evolution of magnetars Swift J1834.9-0846 under wind braking",
      "authors": [
        "Biaopeng Li",
        "Zhifu Gao",
        "Wenqi Ma",
        "Weifeng Zhang",
        "Quan Cheng",
        "L.C. Garcia de Andrade"
      ],
      "abstract": "Studies on the spin and magnetic inclination evolution of magnetars Swift J1834.9-0846 under wind braking Biaopeng Li, Zhifu Gao, Wenqi Ma, Weifeng Zhang, Quan Cheng, L.C. Garcia de Andrade 23 pages, 8 figures, Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) The magnetar Swift J1834.9-0846 presents a significant challenge to neutron star spin-down models. It exhibits two key anomalies: an insufficient rotational energy loss rate to power its observed X-ray luminosity, and a braking index of $ = 1.08\\pm 0.04$, which starkly contradicts the canonical magnetic dipole value of $n=3$. To explain these anomalies, we develop a unified spin-evolution model that self-consistently integrates magnetic dipole radiation, gravitational wave emission, and wind braking. Within this framework, we constrain the wind braking parameter to $\\kappa \\in [13, 37]$ from the nebular properties, finding it contributes substantially (17%-51%) to the current spin-down torque. Bayesian inference reveals that the birth period is poorly constrained by present data and is prior-dependent, indicating a millisecond birth is allowed but not required. Furthermore, we constrain the number of precession cycles to $\\xi \\sim 10^{4}$--$10^{5}$, and our analysis favors a toroidally-dominated internal magnetic field configuration as the most self-consistent explanation for the low braking index. Finally, we assess the continuous gravitational-wave detectability. The present-day signal is undetectable. However, the early-time signal might have reached the projected sensitivity of next-generation gravitational-wave observatories, such as the Advanced Laser Interferometer Gravitational-Wave Observatory (aLIGO) and the Einstein Telescope (ET), although a confident detection would require exceptionally stable rotation, an assumption considered highly optimistic for a young magnetar. This work establishes a unified framework that links magnetar spin-down with their interior physics and multi-messenger observables, providing a physically consistent interpretation for Swift J1834.9-0846 and a new tool for understanding similar extreme neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2602.06615.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.06783",
      "title": "Sensipy: simulate gamma-ray observations of transient astrophysical sources",
      "authors": [
        "Jarred G. Green",
        "Barbara Patricelli",
        "Antonio Stamerra",
        "Monica Seglar-Arroyo"
      ],
      "abstract": "Sensipy: simulate gamma-ray observations of transient astrophysical sources Jarred G. Green, Barbara Patricelli, Antonio Stamerra, Monica Seglar-Arroyo High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present sensipy, an open-source Python toolkit for simulating observations of transient astrophysical sources, particularly in the high-energy (HE, keV-GeV) and very-high-energy (VHE, GeV-TeV) gamma-ray ranges. The most explosive events in our universe are often short-lived, emitting the bulk of their energy in a relatively narrow time window. Due to often rapidly fading emission profiles, understanding how and when to observe these sources is crucial both to test theoretical predictions and efficiently optimize available telescope time. The information extracted from the tools included in sensipy can be used to help astronomers investigate the detectability of sources considering various theoretical assumptions about their emission processes and mechanisms. This information can further help to justify the feasibility of proposed observations, estimate detection rates (events/year) for various classes of sources, and provide scheduling insight in realtime during gamma-ray and multi-messenger observational campaigns.",
      "pdf_url": "https://arxiv.org/pdf/2602.06783.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06789",
      "title": "Forecasting Supermassive Black Hole Binary Gravitational Wave Probes: Prospects for Future Pulsar Timing Array and Space-Borne Detectors",
      "authors": [
        "Katsunori Kusakabe",
        "Yoshiyuki Inoue",
        "Daisuke Toyouchi",
        "Keitaro Takahashi"
      ],
      "abstract": "Forecasting Supermassive Black Hole Binary Gravitational Wave Probes: Prospects for Future Pulsar Timing Array and Space-Borne Detectors Katsunori Kusakabe, Yoshiyuki Inoue, Daisuke Toyouchi, Keitaro Takahashi High Energy Astrophysical Phenomena (astro-ph.HE) We present a comprehensive framework for predicting the detection prospects of supermassive black hole binaries (SMBHBs) by future gravitational wave (GW) observatories, examining both space-borne detectors (LISA, Taiji, TianQin) and next-generation pulsar timing array (PTA) combined with the Square Kilometre Array (SKA-PTA). Leveraging dual active galactic nucleus (AGN) fractions and AGN X-ray luminosity functions, we systematically evaluate the detectable SMBHB populations with a detection threshold of signal-to-noise ratio $\\geq 5$ for each GW observatory. Our analysis reveals that space-borne detectors are expected to identify approximately $\\sim 1 \\text{--} 2$ to $\\sim 20$ events per year, depending on the SMBHB orbital evolution prescriptions. On the other hand, SKA-PTA demonstrates the potential to reach the first GW detection from individual SMBHBs within a few years of observation and achieve detectable GW source counts of $10^2 \\text{--} 10^3$ after about 10 years, depending on PTA configurations. These facilities will significantly improve SMBHB detectability and enable characterization of their properties across different frequency bands.",
      "pdf_url": "https://arxiv.org/pdf/2602.06789.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.06839",
      "title": "Merger Driven or Internal Evolution? A New Morphological Study of Tidal Disruption Event Host Galaxies",
      "authors": [
        "Janet N.Y. Chang",
        "Connor Bottrell",
        "Lixin Dai",
        "Rudrani Kar Chowdhury",
        "Meng Gu",
        "Renbin Yan",
        "Leonardio Ferreira",
        "Sara L. Ellison",
        "Scott Wilkinson",
        "Thomas de Boer"
      ],
      "abstract": "Merger Driven or Internal Evolution? A New Morphological Study of Tidal Disruption Event Host Galaxies Janet N.Y. Chang, Connor Bottrell, Lixin Dai, Rudrani Kar Chowdhury, Meng Gu, Renbin Yan, Leonardio Ferreira, Sara L. Ellison, Scott Wilkinson, Thomas de Boer High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Host galaxies of tidal disruption events (TDEs) show enhanced central stellar concentration and are preferentially found in post-starburst and green valley populations. This connection has led to the proposal that TDE host galaxies likely have gone through recent mergers. We conduct a new morphological study of 14 TDE host galaxies, using the r-band images from Sloan Digital Sky Survey (SDSS), Dark Energy Camera Legacy Survey (DECaLS), and Ultraviolet Near-Infrared Optical Northern Survey (UNIONS), with the images from the latter two surveys having much higher depth and resolution than SDSS. We examine galaxy structures using conventional methods and also apply diagnostics of merger activity from machine learning models. Consistent with previous studies, our results show that TDE host galaxies are ~16% more centrally concentrated when compared to non-TDE-host controls. However, surprisingly, TDE hosts lack any indication of recent merger activity from both morphological analysis and our machine learning merger classifier. Instead, our results reveal that TDE host galaxies are approximately 1.5 to 2.5 times more likely to have bar-like or ring-like structures than their controls. This enhancement is even more prominent for TDEs in the green valley, with the factor reaching almost 3. Based on these results, we propose that bar-driven secular evolution, instead of merger, likely dominates the recent evolution of TDE hosts found in the green valley, which can simultaneously explain their distinctive nuclear properties and enhanced TDE rates.",
      "pdf_url": "https://arxiv.org/pdf/2602.06839.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06919",
      "title": "Optical spectral characterization of OP 313. Constraining the contribution of thermal and non-thermal optical emission",
      "authors": [
        "J. Otero-Santos",
        "M. Nievas Rosillo",
        "J. A. Acosta-Pulido",
        "R. Clavero"
      ],
      "abstract": "Optical spectral characterization of OP 313. Constraining the contribution of thermal and non-thermal optical emission J. Otero-Santos, M. Nievas Rosillo, J. A. Acosta-Pulido, R. Clavero Accepted for publication in A&A. 10 pages (+5 pages of Appendix), 13 figures High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) The quasar OP 313 was discovered in December 2023 in very-high-energy $\\gamma$ rays above 100 GeV, enabling for the first time a complete characterization of its emission. However, the lack of updated measurements of its accretion disk, broad line region and dusty torus hampers a detailed interpretation of the role of accretion in the observed $\\gamma$-ray production. We intend to characterize, during high-activity states, the external photon fields contributing to the IR-to-UV emission$-$namely dusty torus, broad line region and accretion disk$-$and investigate potential variability and blurring effects on the broad emission lines. We present new spectroscopic observations of OP 313 with the NOT and TNG telescopes to characterize its optical spectrum and variability with respect to archival observations from SDSS. We measure the luminosity of different broad emission lines, characterizing the broad line region, accretion disk and dusty torus. We measure the Mg II emission line, with an average flux of $F_{\\mathrm{Mg \\ II}} = (0.85 \\pm 0.11)\\times 10^{-14}$ erg cm$^{-2}$ s$^{-1}$. Its equivalent width and luminosity are consistent with a constant line with a variable non-thermal continuum. From the stable Mg II line we derive a constant luminosity of the thermal components, $\\log(L_{\\mathrm{BLR}} \\ \\mathrm{[erg \\ s^{-1}]}) = 44.91 \\pm 0.19$, $\\log(L_{\\mathrm{disk}} \\ \\mathrm{[erg \\ s^{-1}]}) = 45.91 \\pm 0.19$ and $\\log(L_{\\mathrm{torus}} \\ \\mathrm{[erg \\ s^{-1}]}) = 44.70 \\pm 0.16$, and estimated a BH mass of $\\log(M_{BH}/M_{\\odot})=8.36 \\pm 0.18$, in line with with that derived from the C III] line. These characteristics and the indicator of the accretion rate from the disk/Eddington luminosity ratio $\\lambda =L_{AD}/L_{Edd} = 0.23 \\pm 0.10$, along with a high Compton dominance, favour a FSRQ-like nature, contrary to the argued changing-look nature.",
      "pdf_url": "https://arxiv.org/pdf/2602.06919.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06952",
      "title": "Mapping plasma properties of Cassiopeia A with XRISM/Resolve: a Bayesian analysis via UltraSPEX",
      "authors": [
        "Manan Agarwal",
        "Jacco Vink",
        "Liyi Gu",
        "Paul P. Plucinsky",
        "Aya Bamba",
        "Toshiki Sato",
        "Daniele Rogantini",
        "Yuken Ohshiro"
      ],
      "abstract": "Mapping plasma properties of Cassiopeia A with XRISM/Resolve: a Bayesian analysis via UltraSPEX Manan Agarwal, Jacco Vink, Liyi Gu, Paul P. Plucinsky, Aya Bamba, Toshiki Sato, Daniele Rogantini, Yuken Ohshiro Submitted version (33 pages, 21 figures). Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Mapping the physical conditions of the shocked plasma of young supernova remnants (SNR) is crucial for understanding their explosion mechanisms, ejecta structure, and large-scale asymmetries. Using $>350$ ks of XRISM/Resolve high spectral resolution observations of Cassiopeia A (Cas A), the youngest known Galactic core-collapse SNR, we present the first microcalorimeter-based plasma parameter maps of any SNR. We tessellate Cas A into $1'\\times1'$ regions and fit the broadband spectra as thermal emission from two pure-metal ejecta components -- corresponding to intermediate-mass elements (IMEs) and iron-group elements (IGEs) -- plus nonthermal synchrotron radiation. For robust inference, we introduce UltraSPEX, a Bayesian framework that couples the SPEX plasma code with the UltraNest nested-sampling algorithm, yielding full posterior distributions and exploration of parameter degeneracies. Key findings include enhanced Ar/Si and Ca/Si abundance ratios near the base of the Si-rich jets, and a high Ni/Fe mass ratio ($0.08\\pm0.015$) in the base of NE jet. IGEs ejecta exhibit systematically higher Doppler velocities and broadenings than IMEs ejecta in most regions, with maximum differences of $\\sim800$ km/s and $\\sim1200$ km/s, respectively; Ca shows distinct (faster) kinematics from other IMEs in several SE regions. The ionization timescale and electron temperature show a robust anti-correlation, particularly for IGEs. This relation and measured parameter values could be explained by semi-analytical models with significant ejecta clumping (overdensities of $\\sim10$ for IGEs and up to $\\sim100$ for IMEs) and reduced historical reverse-shock velocities. Nonthermal emission accounts for a substantial fraction, with at least 47% of the 4--6 keV continuum and dominates in the western regions, where the spectrum hardens.",
      "pdf_url": "https://arxiv.org/pdf/2602.06952.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06954",
      "title": "Spectral Appearance of Self-gravitating AGN Disks Powered by Stellar Objects: Universal Effective Temperature in the Optical Continuum and Application to Little Red Dots",
      "authors": [
        "Yi-Xian Chen",
        "Hanpu Liu",
        "Ruancun Li",
        "Bingjie Wang",
        "Yilun Ma",
        "Yan-Fei Jiang",
        "Jenny Greene",
        "Eliot Quataert",
        "Jeremy Goodman"
      ],
      "abstract": "Spectral Appearance of Self-gravitating AGN Disks Powered by Stellar Objects: Universal Effective Temperature in the Optical Continuum and Application to Little Red Dots Yi-Xian Chen, Hanpu Liu, Ruancun Li, Bingjie Wang, Yilun Ma, Yan-Fei Jiang, Jenny Greene, Eliot Quataert, Jeremy Goodman to be submitted. Comments welcome. Main arguments presented in Sections 1,2,5&6 High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We revisit the spectral appearance of extended self-gravitating accretion disks around supermassive black holes. Using dust-poor opacity tables, we show that all optically thick disk solutions possess a universal outer effective temperature of $T_{\\rm eff}\\sim 4000-4500$K, closely resembling compact, high-redshift sources known as Little Red Dots (LRDs). Assuming the extended disk is primarily heated by stellar sources, this ``disk Hayashi limit\" fixes the dominant optical continuum temperature of the disk spectrum independent of accretion rate $\\dot{M}$, black hole mass $M_\\bullet$, and disk viscosity $\\alpha$, and removes the parameter-tuning required in previous disk interpretations of LRDs. We construct global self-gravitating accretion disk models with radially varying accretion rates, suggesting that burning of embedded stellar objects can both efficiently power the emission of the outer disk and hollow out the inner disk, strongly suppressing variable UV/X-ray associated with a standard quasar. The resulting disk emission is dominated by a luminous optical continuum while a separate, non-variable UV component arises from stellar populations on the nuclear to galaxy scale. We map the optimal region of parameter space for such systems and show that LRD-like appearances are guaranteed for $\\dot{M}/\\alpha \\gtrsim 0.1 M_\\odot /{\\rm yr}$, a threshold insensitive to $M_\\bullet$, below which the system may transition into classical non-self-gravitating AGN disks, potentially a later evolution stage. We expect this transition to be accompanied by the enhancement of metallicity and production of dust, giving rise to far infrared emission. This picture offers a physically motivated and quantitative framework connecting LRDs with AGNs and their associated nuclear stellar population.",
      "pdf_url": "https://arxiv.org/pdf/2602.06954.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06124",
      "title": "Probing habitable regions with SRG/eROSITA",
      "authors": [
        "E. Gatuzz",
        "S. Rukdee",
        "S. Freund",
        "T. Kallman"
      ],
      "abstract": "Probing habitable regions with SRG/eROSITA E. Gatuzz, S. Rukdee, S. Freund, T. Kallman Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Stellar high-energy radiation is a key driver of atmospheric erosion and evolution in exoplanets, directly affecting their long-term habitability. We present a comprehensive study on stellar high-energy radiation and its impact on exoplanetary atmospheres, leveraging data from the \\textit{SRG/eROSITA} all-sky survey. Our sample consists of 3750 main-sequence stars identified by cross-matching with \\textit{Gaia} DR3. Utilizing X-ray spectral fits from the \\textit{eROSITA} catalog, we computed X-ray ($L_X$) and combined extreme-ultraviolet (EUV) luminosities ($L_{\\mathrm{EUV}}$), which we used to derive XUV fluxes at the habitable zone ($F_{\\mathrm{XUV,HZ}}$). We find that the majority of stars in our sample are significantly more XUV-active than the Sun, with habitable zone fluxes ranging from $10^0$ to $10^5$ erg~cm$^{-2}$~s$^{-1}$. The ratio of $L_{\\mathrm{XUV}}/L_{\\mathrm{bol}}$ is found to be higher for cooler, magnetically active stars, highlighting their potentially hazardous nature for planetary atmospheres. Applying the energy-limited escape model, we computed atmospheric mass-loss rates for hypothetical earth-like planets located at the habitable zone of each star. We also present local maps for distances up to $500$~pc of the average XUV flux, revealing ``hazard zones'' where stellar radiation could significantly influence planetary atmospheric evolution. This work demonstrates the power of X-ray surveys in constraining the high-energy environments of exoplanets and underscores the critical role of stellar activity in planetary habitability.",
      "pdf_url": "https://arxiv.org/pdf/2602.06124.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06589",
      "title": "Mobile neutron monitor for latitude cosmic ray monitoring",
      "authors": [
        "Kobelev P.G.",
        "Maurchev E.A.",
        "Yanke V.G"
      ],
      "abstract": "Mobile neutron monitor for latitude cosmic ray monitoring Kobelev P.G., Maurchev E.A., Yanke V.G Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) Neutron monitors are a standard tool for high-precision continuous monitoring of galactic cosmic ray flux variations arising from variations in heliospheric conditions and solar activity for space weather applications. These measurements form the basis for solving the inverse problem of determining the cosmic ray anisotropy vector beyond the magnetosphere. To support such studies, periodic latitude measurements are necessary to determine the coupling functions of primary and secondary cosmic rays variations. The aim of this work is to develop and characterize a modernized standard neutron monitor based on a CHM-15 boron thermal neutron counter and a data acquisition system designed for marine expeditionary studies of cosmic ray variations. Modern nuclear physics experimental methods and the principles of microprocessor-based data acquisition systems were used to solve this problem. The results of test trials and of continuous monitoring showed that the characteristics of the upgraded and standard neutron monitor are similar, and the ease of use, compactness, and stability allow us to conclude that the mobile neutron detector can be used in expeditionary conditions with limited access for maintenance personnel.",
      "pdf_url": "https://arxiv.org/pdf/2602.06589.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.04373",
      "title": "Investigating the role of nuclear parameters in Neutron Star oscillations: a model comparison",
      "authors": [
        "Rajesh Maiti",
        "Debarati Chatterjee"
      ],
      "abstract": "Investigating the role of nuclear parameters in Neutron Star oscillations: a model comparison Rajesh Maiti, Debarati Chatterjee High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) Recent studies based on the relativistic mean field (RMF) model found certain nuclear empirical parameters, in particular the nucleon effective mass, to be strongly correlated with observable properties of Neutron Stars (NSs), such as the frequencies of $f-$mode oscillations. This shows the potential to constrain the values of effective mass from future observations of $f-$modes. One of our primary goals of this work is to investigate whether such correlations are physical or an artifact of the underlying nuclear model. To test this, we perform a comparative study of the correlations between NS astrophysical observables and nuclear physics parameters using two different equation of state models based on RMF theory and non-relativistic Meta-Modelling (MM) scheme. The nuclear meta-model does not assume any underlying nuclear model and therefore allows us to test the model dependence of the results. The calculations of the $f-$mode characteristics are performed within the relativistic Cowling approximation. We use state-of-the-art nuclear microscopic calculations at low density and multi-messenger astrophysical data at high-density within a Bayesian-inspired scheme to constrain the parameter space of the nuclear models. From the posterior distribution, we probe the underlying correlations among nuclear parameters and with NS observables. We find that the correlation between the symmetry energy and its slope is physical, while that of the nucleon effective mass with NS observables is model-dependent. The study shows that the effective mass governs the high density behaviour in RMF models, while in the MM it is controlled by the higher order saturation parameters, and hence probes the possibility of constraining them from future $f$-mode observations. The findings of this investigation are interesting both for astrophysics as well as nuclear physics communities.",
      "pdf_url": "https://arxiv.org/pdf/2412.04373.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.13893",
      "title": "The spin-orbit alignment hypothesis in millisecond pulsars",
      "authors": [
        "Alexandra Lorange",
        "Jérôme Pétri",
        "Mattéo Sautron",
        "Vincent Vigon"
      ],
      "abstract": "The spin-orbit alignment hypothesis in millisecond pulsars Alexandra Lorange, Jérôme Pétri, Mattéo Sautron, Vincent Vigon This work has been submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE) Millisecond pulsars (MSPs) are spun up during their accretion phase in a binary system. The exchange of angular momentum between the accretion disk and the star tends to align the spin and orbital angular momenta on a very short time scale compared to the accretion stage. In this work, we study a subset of $\\gamma$-ray MSPs in binaries for which the orbital inclination angle $i$ has been accurately constrained thanks to the Shapiro delay measurements. Our goal is to constrain the observer viewing angle $\\zeta$ and to check whether it agrees with the orbital inclination angle $i$, in other words if $\\zeta \\approx i$. We use a Bayesian inference technique to fit the MSP $\\gamma$-ray light curves based on the third $\\gamma$-ray pulsar catalogue (3PC). The emission model relies on the striped wind model deduced from force-free neutron star magnetosphere simulations. We found good agreement between the two angles $i$ and $\\zeta$ for a significant fraction of our sample, about four fifth, confirming the spin-orbit alignment scenario during the accretion stage. However about one fifth of our sample deviates significantly from this alignment. The reasons are manifold: either the $\\gamma$-ray fit is not reliable or some precession and external torque avoid an almost perfect alignment.",
      "pdf_url": "https://arxiv.org/pdf/2507.13893.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.13263",
      "title": "The New Status Qvo? SN 2021qvo is Another 2003fg-like Type Ia Supernova with a Rising Light-Curve Bump",
      "authors": [
        "I. A. Abreu Paniagua",
        "W. B. Hoogendam",
        "D. O. Jones",
        "G. Dimitriadis",
        "R. J. Foley",
        "C. Gall",
        "J. O'Brien",
        "K. Taggart",
        "C. R. Angus",
        "C. Ashall",
        "K. Auchettl",
        "D. A. Coulter",
        "K. W. Davis",
        "T. de Boer",
        "A. Do",
        "H. Gao",
        "L. Izzo",
        "C.-C. Lin",
        "T. B. Lowe",
        "Z. Lai",
        "R. Kaur",
        "M. Y. Kong",
        "A. Rest",
        "M. R. Siebert",
        "S. K. Yadavalli",
        "Y. Zenati",
        "Q. Wang"
      ],
      "abstract": "The New Status Qvo? SN 2021qvo is Another 2003fg-like Type Ia Supernova with a Rising Light-Curve Bump I. A. Abreu Paniagua, W. B. Hoogendam, D. O. Jones, G. Dimitriadis, R. J. Foley, C. Gall, J. O'Brien, K. Taggart, C. R. Angus, C. Ashall, K. Auchettl, D. A. Coulter, K. W. Davis, T. de Boer, A. Do, H. Gao, L. Izzo, C.-C. Lin, T. B. Lowe, Z. Lai, R. Kaur, M. Y. Kong, A. Rest, M. R. Siebert, S. K. Yadavalli, Y. Zenati, Q. Wang The Astrophysical Journal, Volume 997, 2026, Number 2 High Energy Astrophysical Phenomena (astro-ph.HE) In recent years, multiple Type Ia supernovae (SNe Ia) have been observed with ''bumps'' in their rising light curves shortly after explosion. Here, we present SN 2021qvo: a SN Ia that exhibits a clear early bump in photometry obtained by the Young Supernova Experiment. Photometric and spectroscopic observations of SN 2021qvo show that it has a broader light curve, higher peak luminosity, shallower Si II $\\lambda$5972 pseudo-equivalent width, and lower ejecta velocities than normal SNe Ia, which are all consistent with the characteristics of the 2003fg-like (often called ''super-Chandrasekhar\") SN subtype. Including SN 2021qvo, just four known 2003fg-like SNe Ia have sufficient pre-peak data to reveal a rising light-curve bump, and all four have bump detections. Host-galaxy analysis reveals that SN 2021qvo exploded in a low-mass galaxy ${\\rm log}(M_{\\ast}/M_{\\odot}) = 7.83^{+0.17}_{-0.24}$, also consistent with other members of this class. The current leading early-bump 2003fg-like SN Ia progenitor model involves an interaction between the circumstellar material (CSM) and the SN ejecta. We test the validity of this theory by modeling the early bump and subsequent light-curve evolution of SN 2021qvo with the Modular Open Source Fitter for Transients. We find that the bump can be modeled with a best-fit CSM mass in the range $M_\\mathrm{CSM}=3.31-8.51 \\times 10^{-3} M_\\odot$. SN 2021qvo adds to the small but growing number of 2003fg-like SNe Ia with rising light-curve bumps; as the number of these SNe Ia with CSM estimates continues to grow, population-level inferences about the CSM distribution will be able to constrain the progenitor scenario for these SNe Ia.",
      "pdf_url": "https://arxiv.org/pdf/2508.13263.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.14544",
      "title": "Revisiting electron-capture decay for Galactic cosmic-ray data",
      "authors": [
        "M. Borchiellini",
        "D. Maurin",
        "M. Vecchi"
      ],
      "abstract": "Revisiting electron-capture decay for Galactic cosmic-ray data M. Borchiellini, D. Maurin, M. Vecchi 23 pages, 7 figures, 6 tables (submitted to Astropart. Phys.) Astroparticle Physics, 176, 103203 (2026) High Energy Astrophysical Phenomena (astro-ph.HE) Electron-capture (EC) unstable species in Galactic cosmic rays constrain the time elapsed between nucleosynthesis and acceleration. They have also been advocated as tracers of reacceleration or gas inhomogeneities during their transport. The number of EC-unstable species grows with mass, with an expected EC-decay impact more important for larger atomic number and lower energy. We revisit the modelling of EC decay and its detectability in the context of recent unmodulated low-energy (Voyager) and high-precision data for heavy (AMS-02) and very-heavy nuclei (ACE-CRIS, CALET and Super-TIGER). We solve the transport equation for a multi-level configuration (up to any number of electrons attached) in the diffusion and leaky-box models. Their decayed fractions are found to be qualitatively similar but with very different absolute fluxes. We check that the standard two-level approximation, wherein the cosmic-ray nucleus is fully ionised or with one electron attached, is sufficient for most situations. We find that the impact of EC-decay is negligible in current data, except possibly for fluxes or ratios involving $^{51}$Cr, $^{55}$Fe, and Co. These conclusions are robust against significant uncertainties in the attachment and stripping cross-sections. This first analysis calls for further investigation, as several forthcoming projects (e.g., TIGERISS) are targeting $Z>30$ cosmic rays.",
      "pdf_url": "https://arxiv.org/pdf/2510.14544.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.22453",
      "title": "Probing AGN-ISM Feedback through Extended X-ray Emission in ESO 137-G034",
      "authors": [
        "D.Ł. Król",
        "G. Fabbiano",
        "M. Elvis",
        "A. Trindade Falcão",
        "R. Middei",
        "D. Rosario",
        "R. Davies",
        "T. Shimizu",
        "D. Hill"
      ],
      "abstract": "Probing AGN-ISM Feedback through Extended X-ray Emission in ESO 137-G034 D.Ł. Król, G. Fabbiano, M. Elvis, A. Trindade Falcão, R. Middei, D. Rosario, R. Davies, T. Shimizu, D. Hill Accepted for publication in the ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present a detailed analysis of the X-ray emission of the Compton-thick (CT) AGN ESO\\,137-G034 based on deep ($\\sim230$\\,ks) Chandra observations. As in other CT AGNs, the morphology of the emission is elongated, approximately following the [O III] ionization bicone. With spatially resolved spectral modeling, we show that the extended emission within the bi-cone regions { is most readily explained} as from a mixture of photo-ionized gas and shock-heated plasma, reflecting the combined effects of radiative and kinematic AGN feedback. By comparing the morphology of the { X-ray emission in narrow spectral bands and that of the 3\\,cm radio jet, we find suggestive evidence of thermal, possibly shocked emission associated with the SE termination of the radio jet. This interpretation is also supported by the lack of [O~III] relative to the $0.3-3.0$ keV flux in the inner $3^{\\prime\\prime}$ ($\\sim600$\\,pc) of the SE cone, which would be consistent with an additional thermal X-ray component on top of the photonized emission of an outflowing wind. A similar effect is only seen within the inner $1^{\\prime\\prime}$ ($200$\\,pc) of the NW cone. In the radial profile of the [OIII]/X-ray flux ratio and the X-ray hardness ratio within the inner $\\sim3^{\\prime\\prime}$ ($\\sim600$\\,pc) of the SE cone we see an asymmetry, with no counterpart in the NW cone. We detect soft extended X-ray emission in the cross-cones which may originate from the interaction of an embedded radio jet with a clumpy interstellar medium (ISM). }These results highlight the { importance of both} radiative and mechanical feedback in shaping the circumnuclear environment of ESO\\,137-G034.",
      "pdf_url": "https://arxiv.org/pdf/2510.22453.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.03169",
      "title": "Magnetic Field Amplification and Particle Acceleration in Weakly Magnetized Trans-relativistic Electron-ion Shocks",
      "authors": [
        "Taiki Jikei",
        "Daniel Groselj",
        "Lorenzo Sironi"
      ],
      "abstract": "Magnetic Field Amplification and Particle Acceleration in Weakly Magnetized Trans-relativistic Electron-ion Shocks Taiki Jikei, Daniel Groselj, Lorenzo Sironi 17 pages, 13 figures, matches the journal version High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) We investigate the physics of quasi-parallel trans-relativistic shocks propagating in weakly magnetized plasmas by means of long-duration two-dimensional particle-in-cell simulations. The structure of the shock precursor is shaped by a competition between the Bell instability and the Weibel (filamentation) instability. The Bell instability is dominant at relatively high magnetizations $(\\sigma\\gtrsim10^{-3})$, whereas the Weibel instability prevails at lower magnetizations $(\\sigma\\lesssim10^{-4})$. Shocks with precursors shaped by Bell modes efficiently accelerate ions, converting a fraction $\\varepsilon_{\\mathrm{i}}\\sim0.2$ of the upstream flow energy into downstream nonthermal ion energy. The maximum energy of nonthermal ions exhibits a Bohm scaling in time, as $E_{\\max}\\propto t$. A much smaller fraction $\\varepsilon_{\\mathrm{e}}\\ll0.1$ of the upstream flow energy goes into downstream nonthermal electrons in the Bell regime. On the other hand, when the precursor is dominated by Weibel modes, the shock efficiently generates both nonthermal ions and electrons with $\\varepsilon_{\\mathrm{i}}\\sim\\varepsilon_{\\mathrm{e}}\\sim0.1$, albeit with a slower scaling for the maximum energy, $E_{\\mathrm{max}}\\propto t^{1/2}$. Our results are applicable to a wide range of trans-relativistic shocks, including the termination shocks of extragalactic jets, the late stages of gamma-ray burst afterglows, and shocks in fast blue optical transients.",
      "pdf_url": "https://arxiv.org/pdf/2512.03169.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.05404",
      "title": "The Double-Burst Nature and Early Afterglow Evolution of Long GRB 110801A",
      "authors": [
        "Qiu-Li Wang",
        "Hao Zhou",
        "Yun Wang",
        "Jia Ren",
        "Zhi-Ping Jin",
        "Da-Ming Wei"
      ],
      "abstract": "The Double-Burst Nature and Early Afterglow Evolution of Long GRB 110801A Qiu-Li Wang, Hao Zhou, Yun Wang, Jia Ren, Zhi-Ping Jin, Da-Ming Wei 16 pages, 12 figures. arXiv admin note: text overlap with arXiv:2501.04906 High Energy Astrophysical Phenomena (astro-ph.HE) We present a comprehensive temporal and spectral analysis of the long-duration gamma-ray burst GRB 110801A, utilizing multi-band data from the Neil Gehrels Swift Observatory and ground-based telescopes. The $\\gamma$-ray emission exhibits a distinct two-episode (``double-burst'') structure. Rapid follow-up observations in the optical and X-ray bands provide full coverage of the second burst. The optical light curve begins to rise approximately 135 s after the trigger, significantly preceding the second emission episode observed in X-rays and $\\gamma$-rays at $\\sim 320$ s. This chromatic behavior suggests different physical origins for the optical and high-energy emissions. Joint broadband spectral fitting (optical to $\\gamma$-rays) during the second episode reveals that a two-component model, consisting of a power-law plus a Band function, provides a superior fit compared to single-component models. We interpret the power-law component as the afterglow of the first burst (dominating the optical band), while the Band component is attributed to the prompt emission of the second burst (dominating the high-energy bands). A physical synchrotron model is also found to be a viable candidate to explain the high-energy emission. Regarding the afterglow, the early optical light curve displays a sharp transition from a rise of $\\sim t^{2.5}$ to $\\sim t^{6.5}$, which is well-explained by a scenario involving both reverse shock (RS) and forward shock (FS) components. We constrain the key physical parameters of the burst, deriving an initial Lorentz factor $\\Gamma_0 \\sim 60$, a jet half-opening angle $\\theta_j \\sim 0.09$, and an isotropic kinetic energy $E_{\\rm k,iso} \\sim 10^{54.8}$ erg.",
      "pdf_url": "https://arxiv.org/pdf/2602.05404.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16753",
      "title": "The WINTER Observatory: A One-Degree InGaAs Survey Camera to study the Transient Infrared Sky",
      "authors": [
        "Danielle Frostig",
        "Nathan Lourie",
        "Viraj Karambelkar",
        "Mansi M. Kasliwal",
        "Andrew Malonis",
        "Robert A. Simcoe",
        "Robert Stein",
        "John W. Baker",
        "Kevin Burdge",
        "Rick Burruss",
        "Curt Corcoran",
        "Kishalay De",
        "Gabor Furesz",
        "Nicolae Ganciu",
        "Kari Haworth",
        "Carolyn M. Heffner",
        "Erik Hinrichsen",
        "Jill Juneau",
        "Geoffrey Mo",
        "Josiah Purdum",
        "Sam Rose",
        "Cruz Soto",
        "Jeffry Zolkower"
      ],
      "abstract": "The WINTER Observatory: A One-Degree InGaAs Survey Camera to study the Transient Infrared Sky Danielle Frostig, Nathan Lourie, Viraj Karambelkar, Mansi M. Kasliwal, Andrew Malonis, Robert A. Simcoe, Robert Stein, John W. Baker, Kevin Burdge, Rick Burruss, Curt Corcoran, Kishalay De, Gabor Furesz, Nicolae Ganciu, Kari Haworth, Carolyn M. Heffner, Erik Hinrichsen, Jill Juneau, Geoffrey Mo, Josiah Purdum, Sam Rose, Cruz Soto, Jeffry Zolkower 24 Pages, 20 Figures, Submitted to PASP Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The Wide-field Infrared Transient Explorer (WINTER) is a near-infrared time-domain survey instrument operating on a dedicated 1-meter robotic telescope at Palomar Observatory. The project takes advantage of recent technology advances in time-domain astronomy, robotic telescopes, large-format sensors, and rapid data reduction and alert software for timely follow up of events. Since June of 2023, WINTER robotically surveys the sky each night to a median depth of J_AB = 18.5 mag, balancing a variety of science programs including searching for kilonovae from gravitational-wave alerts, blind surveys to study galactic and extragalactic transients and variables, and building up reference images of the near-infrared sky. The project also serves as a technology demonstration for new large-format Indium Gallium Arsenide (InGaAs) sensors for wide-field science in the near infrared without cryogenically cooled optics or detectors. WINTER's custom camera combines six InGaAs sensors with a novel tiled fly's-eye optical design to cover a >1 deg^2 field of view with 1 arcsecond pixels in the Y-, J-, and shortened-H-band filters (0.9 - 1.7 micron). This paper presents the design, performance, and early on-sky science of the WINTER observatory.",
      "pdf_url": "https://arxiv.org/pdf/2512.16753.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.06116",
      "title": "The Host Galaxies of Active Galactic Nuclei with Direct Black Hole Mass Measurements",
      "authors": [
        "Vardha N. Bennert",
        "Nico Winkel",
        "Tommaso Treu",
        "Xuheng Ding",
        "Vivian U",
        "Raymond P. Remigio",
        "Aaron J. Barth",
        "Matthew A. Malkan",
        "Lizvette Villafaña",
        "Samantha Allen",
        "Ellie Johnson",
        "Sebastian Contreras",
        "Minjin Kim",
        "Simon Birrer",
        "Knud Jahnke",
        "Shaoping Zheng"
      ],
      "abstract": "The Host Galaxies of Active Galactic Nuclei with Direct Black Hole Mass Measurements Vardha N. Bennert, Nico Winkel, Tommaso Treu, Xuheng Ding, Vivian U, Raymond P. Remigio, Aaron J. Barth, Matthew A. Malkan, Lizvette Villafaña, Samantha Allen, Ellie Johnson, Sebastian Contreras, Minjin Kim, Simon Birrer, Knud Jahnke, Shaoping Zheng 31 pages, 12 figures (figures 5-9 to appear as figure set in the online version), 5 tables, accepted by the Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) Reverberation mapping (RM) determines the mass of black holes (BH) in active galactic nuclei (AGNs) by resolving the BH gravitational sphere of influence in the time domain. Recent RM campaigns yielded direct BH masses through dynamical modeling for a sample of 32 objects, spanning a wide range of AGN luminosities and BH masses. In addition, accurate BH masses have been determined by spatially resolving the broad-line region with GRAVITY for a handful of AGNs. Here, we present a detailed analysis of Hubble Space Telescope images using surface-brightness profile fitting with state-of-the-art programs. We derive AGN luminosity and host-galaxy properties, such as radii and luminosities for spheroid, disk, and bar (if present). The spheroid effective radii were used to measure stellar velocity dispersion from integral-field spectroscopy. Since the BH masses of our sample do not depend on any assumption of the virial factor needed in single-epoch spectroscopic mass estimates, we can show that the resulting scaling relations between the mass of the supermassive BHs and their host galaxies match those of quiescent galaxies, naturally extending to lower masses in these (predominantly) spiral galaxies. We find that the inner AGN orientation, as traced by the broad-line region inclination angle, is uncorrelated with the host-galaxy disk. Our sample has the most direct and accurate MBH measurements of any AGN sample and provides a fundamental local benchmark for studies of the evolution of massive black holes and their host galaxies across cosmic time.",
      "pdf_url": "https://arxiv.org/pdf/2602.06116.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06119",
      "title": "Modelling the photometric and morphological evolution of disc galaxies in the cluster environment",
      "authors": [
        "A. Marasco",
        "B.M. Poggianti",
        "B. Vulcani",
        "A. Moretti",
        "M. Gullieuszik",
        "J. Fritz"
      ],
      "abstract": "Modelling the photometric and morphological evolution of disc galaxies in the cluster environment A. Marasco, B.M. Poggianti, B. Vulcani, A. Moretti, M. Gullieuszik, J. Fritz 16 pages, 11 Figures, 2 Tables. Accepted by A&A Astrophysics of Galaxies (astro-ph.GA) Observations indicate that the disc population in galaxy clusters has undergone rapid evolution, transitioning from a dominance of blue spirals to red S0s over the past $\\sim7$ Gyr. We build a simplified cluster evolutionary model in the $\\Lambda$CDM framework to constrain the characteristic timescales of this transformation. In our model, field spirals joining the cluster are subject to ram-pressure stripping (RPS), which removes their gas reservoir leading to the quenching of their star formation on a timescale $t_{\\rm s}$, and to an (initially) unspecified mechanism that transforms them into S0s on a timescale $t_{\\rm m}$. We assume that $t_{\\rm s}$ and $t_{\\rm m}$ are independent and both power-law functions of $M_\\star/M_{\\rm cl}$, the galaxy-to-cluster mass ratio. We constrain our model using the observed distribution of spirals and S0s in a color-mass plane from the OmegaWINGS and EDisCS cluster surveys at $z\\simeq0.055$ and $z\\simeq0.7$. Our best-fit model reproduces the data remarkably well and predicts evolutionary trends for the main morphological fractions in agreement with previous studies. We find typical $t_{\\rm s}$ between $0.1$ and $1$ Gyr, compatible with previous estimates. A surprisingly strong anti-correlation between $t_{\\rm s}$ and $M_\\star/M_{\\rm cl}$ is required in order to suppress the formation of red, low-mass spirals at low redshift, which we interpret as driven by orbit anisotropy. Conversely, $t_{\\rm m}$ depends very weakly on $M_\\star/M_{\\rm cl}$ and has typical values of a few Gyr. The inferred morphological evolution is compatible with that resulting from the ageing of the stellar populations in galaxies abruptly quenched by ram pressure stripping: we confirm spectrophotometric ageing as a key channel for the spiral-to-S0 transition in galaxy clusters, with secular evolution playing a secondary role.",
      "pdf_url": "https://arxiv.org/pdf/2602.06119.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06128",
      "title": "The imprint of AGN-driven outflows on the CGM: the case of Lyα nebulae around high-z quasars",
      "authors": [
        "Silvia C. Rueda-Vargas",
        "Vincenzo Mainieri",
        "Giulia Tozzi",
        "Darshan Kakkad",
        "Fabrizio Arrigoni-Battaia",
        "Tiago Costa",
        "Emanuele Paolo Farina",
        "Chris M. Harrison"
      ],
      "abstract": "The imprint of AGN-driven outflows on the CGM: the case of Lyα nebulae around high-z quasars Silvia C. Rueda-Vargas, Vincenzo Mainieri, Giulia Tozzi, Darshan Kakkad, Fabrizio Arrigoni-Battaia, Tiago Costa, Emanuele Paolo Farina, Chris M. Harrison 17 pages, 10 figures, 5 tables (+1 page, 2 figures in Appendix). Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Some cosmological hydrodynamical simulations predict that outflows driven by active galactic nuclei (AGN) play a key role in powering the Ly$\\alpha$ nebulae observed around high-redshift quasars. In such simulations, AGN feedback seeded as powerful outflows leads to extended and luminous nebulae whose morphology and surface-brightness profiles accurately reproduce the observations, while suppressing AGN feedback leads to compact and faint nebulae. This link might arise from outflows opening up a channel for Ly$\\alpha$ photons to escape from the galactic nucleus to the circumgalactic medium (CGM). The main aim of this paper is to test this theoretical prediction using observations, by comparing the physical properties of outflows and Ly$\\alpha$ nebulae. We analyze integral-field unit data obtained with VLT/ERIS and GEMINI/GNIRS to trace the ionized gas in the interstellar medium (ISM) of a sample of six quasars at $z\\sim2-3$, using the [O III] emission line. We detect powerful outflows in all the quasars of our sample, with velocities $>1500~\\mathrm{km~s^{-1}}$ and kinetic energies $ \\gtrsim 2\\times10^{43}~\\mathrm{erg~s^{-1}}$. Four of our quasars are spatially resolved and show signs of extended [O III] emission out to distances $>2$ kpc from the central supermassive black hole. When excluding one outlier, we find a positive monotonic correlation between the outflow power and the Ly$\\alpha$ nebulae size ($\\rho=0.89$, $p=0.03$) and luminosity ($\\rho=0.6$, $p=0.28$). Additionally, we find evidence of spatial alignment between the ionization cone and the inner and brightest regions of the Ly$\\alpha$ nebula. Our results provide tentative evidence in support of the theoretical prediction that AGN-driven outflows at ISM scales open a low-optical-depth path for central Ly$\\alpha$ photons to reach the CGM and create extended nebulae.",
      "pdf_url": "https://arxiv.org/pdf/2602.06128.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06182",
      "title": "On the radial velocity wave in the Galactic disk",
      "authors": [
        "Chris Hamilton",
        "Andrew Mummery",
        "Joss Bland-Hawthorn"
      ],
      "abstract": "On the radial velocity wave in the Galactic disk Chris Hamilton, Andrew Mummery, Joss Bland-Hawthorn Astrophysics of Galaxies (astro-ph.GA) Stars in the Galactic disk have mean radial velocities $\\overline{v}_R$ that oscillate as a function of angular momentum $J_\\varphi$. This `$J_\\varphi$-${\\overline{v}}_R$ wave' signal also exhibits a systematic phase shift when stars are binned by their dynamical temperatures. However, the origin of the wave is unknown. Here we use linear perturbation theory to derive a simple analytic formula for the $J_\\varphi$-$\\overline{v}_R$ signal that depends on the equilibrium properties of the Galaxy and the history of recent perturbations to it. The formula naturally explains the phase shift, but also predicts that different classes of perturbation should drive $J_\\varphi$-$\\overline{v}_R$ signals with very different morphologies. Ignoring the self-gravity of disk fluctuations, it suggests that neither a distant tidal kick (e.g., from the Sgr dwarf) nor a rigidly-rotating Galactic bar can produce a qualitatively correct $J_\\varphi$-$\\overline{v}_R$ wave signal. However, short-lived spiral arms can, and by performing an MCMC fit we identify a spiral perturbation that drives a $J_\\varphi$-${\\overline{v}}_R$ signal in reasonable agreement with the data. We verify the analytic formula with test particle simulations, finding it to be highly accurate when applied to dynamically cold stellar populations. More work is needed to deal with hotter orbits, and to incorporate the fluctuations' self-gravity and the role of interstellar gas.",
      "pdf_url": "https://arxiv.org/pdf/2602.06182.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06224",
      "title": "Dwarf Galaxy Number Counts within 25 Mpc: Predictions from Local Group Analogues in TNG50",
      "authors": [
        "Evangela E. Shread",
        "Joanna M. Piotrowska",
        "Daniel R. Weisz",
        "Michael Boylan-Kolchin",
        "Fiona A. Harrison"
      ],
      "abstract": "Dwarf Galaxy Number Counts within 25 Mpc: Predictions from Local Group Analogues in TNG50 Evangela E. Shread, Joanna M. Piotrowska, Daniel R. Weisz, Michael Boylan-Kolchin, Fiona A. Harrison submitted to ApJ; 32 pages, 16 figures, 2 tables Astrophysics of Galaxies (astro-ph.GA) The modern generation of wide-field galaxy surveys, such as LSST, Euclid and Roman, will enable studies of dwarf galaxies $(10^6 \\leq M_\\ast / M_\\odot \\leq 10^9)$ beyond the Local Group (LG) in unprecedented detail. Improved theoretical understanding of this population is necessary to guide these observations, since predictions in this regime are generally limited to specific environments like the LG. We present predictions for the population of dwarf galaxies from the TNG50 run of the IllustrisTNG suite of cosmological hydrodynamical simulations, focusing on the environments within $1 < D / \\mathrm{Mpc} < 25$ of LG analogues at $z = 0$. In the simulated sample, there are $\\sim 1,000$ and $\\sim 12,000$ dwarf galaxies within $10$ and $25$ Mpc, respectively. We compare our results with the 50 Mpc Galaxy Catalog and estimate that current observations are highly incomplete at low masses: for $10^6 \\leq M_\\ast / M_\\odot \\leq 10^7$ $(-13 \\lesssim M_r \\lesssim -10)$, we find completeness fractions of $\\sim 23 \\%$ within $10$ Mpc and $\\sim 4 \\%$ within $25$ Mpc. The simulated galaxies below the completeness limits of the observations exist in a range of environments, with notable populations of field dwarfs at all distances and satellites around centrals with masses $10^8 \\lesssim M_\\ast / M_\\odot \\lesssim 10^{11}$ within $10-25$ Mpc. We find that there are $\\sim 8$ times more quiescent dwarf galaxies in the TNG50 sample than are currently cataloged. Our results suggest that upcoming observations should uncover a substantial population of dwarf galaxies, and that $\\gtrsim 15 \\%$ of these will be red, currently quenched galaxies in the field.",
      "pdf_url": "https://arxiv.org/pdf/2602.06224.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06295",
      "title": "Treecode2: The Power of Pluralism. I. Static Tests",
      "authors": [
        "Joshua E. Barnes"
      ],
      "abstract": "Treecode2: The Power of Pluralism. I. Static Tests Joshua E. Barnes Accepted by MNRAS on 02-Feb-2026. 20 pages, 25 figures + supplementary material Astrophysics of Galaxies (astro-ph.GA) I describe an `oct-tree' N-body code which randomly shifts, reorients, and resizes the root cell at each time step. Averaging over a plurality of root cell positions and orientations statistically restores translational and rotational invariance. The potentials and forces which result can be much more accurate than those obtained from a single force calculation. In this paper, the principle of averaging is tested on static configurations. The next paper will show how this technique can substantially improve global energy, momentum, and angular momentum conservation at a negligible computational cost.",
      "pdf_url": "https://arxiv.org/pdf/2602.06295.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06463",
      "title": "ELUCID-DESI I: A Parallel MPI Implementation of the Initial Condition Solver for Large-Scale Reconstruction Simulations",
      "authors": [
        "Wensheng Hong",
        "Xiaohu Yang",
        "Junde Li",
        "Huiyuan Wang",
        "Zhao Chen",
        "Hong-Ming Zhu",
        "Qingyang Li",
        "Yizhou Gu",
        "Youcai Zhang",
        "Feng Shi",
        "Jiaxin Han",
        "Yu Yu",
        "Zhongxu Zhai"
      ],
      "abstract": "ELUCID-DESI I: A Parallel MPI Implementation of the Initial Condition Solver for Large-Scale Reconstruction Simulations Wensheng Hong, Xiaohu Yang, Junde Li, Huiyuan Wang, Zhao Chen, Hong-Ming Zhu, Qingyang Li, Yizhou Gu, Youcai Zhang, Feng Shi, Jiaxin Han, Yu Yu, Zhongxu Zhai Astrophysics of Galaxies (astro-ph.GA) We present a highly scalable, MPI-parallelized framework for reconstructing the initial cosmic density field, designed to meet the computational demands of next-generation cosmological simulations, particularly the upcoming ELUCID-DESI simulation based on DESI BGS data. Building upon the Hamiltonian Monte Carlo approach and the FastPM solver, our code employs domain decomposition to efficiently distribute memory between nodes. Although communication overhead increases the per-step runtime of the MPI version by roughly a factor of eight relative to the shared-memory implementation, our scaling tests-spanning different particle numbers, core counts, and node layouts-show nearly linear scaling with respect to both the number of particles and the number of CPU cores. Furthermore, to significantly reduce computational costs during the initial burn-in phase, we introduce a novel ``guess'' module that rapidly generates a high-quality initial density field. The results of the simulation test confirm substantial efficiency gains: for $256^3$ particles, 53 steps ($\\sim$54 CPU hours) are saved; for $1024^3$, 106 steps ($\\sim$7500 CPU hours). The relative gain grows with the number of particles, rendering large-volume reconstructions computationally practical for upcoming surveys, including our planned ELUCID-DESI reconstruction simulation with $8192^3$ particles, with a rough estimation of 720 steps ($\\sim$37,000,000 CPU hours).",
      "pdf_url": "https://arxiv.org/pdf/2602.06463.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06719",
      "title": "Galaxies caught in transition: the role of group environment in shaping the mass-size relation in the local Universe",
      "authors": [
        "Gissel P. Montaguth",
        "Claudia Mendes de Oliveira",
        "Ciria Lima-Dias",
        "Antonela Monachesi",
        "Sergio Torres-Flores",
        "Eduardo Telles",
        "Fábio R. Herpich",
        "Yolanda Jiménez-Teja",
        "Antonio Kanaan",
        "Tiago Ribeiro",
        "William Schoenell"
      ],
      "abstract": "Galaxies caught in transition: the role of group environment in shaping the mass-size relation in the local Universe Gissel P. Montaguth, Claudia Mendes de Oliveira, Ciria Lima-Dias, Antonela Monachesi, Sergio Torres-Flores, Eduardo Telles, Fábio R. Herpich, Yolanda Jiménez-Teja, Antonio Kanaan, Tiago Ribeiro, William Schoenell 15 pages, 7 figures. Accepted for publication in The Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) The stellar mass-size relation is a sensitive probe of how environment shapes galaxy structure. We analyse this relation in the local Universe for galaxies in compact groups (CGs), low-mass groups ($M_{\\rm vir} \\leq 10^{13}~M_{\\odot}$), and high-mass groups, comparing them to field galaxies using data from the Southern Photometric Local Universe Survey. Galaxies are classified as early types (ETGs; $n \\geq 2.5$, $(u-r)_0 \\geq 2.3$), late types (LTGs; $n < 2.5$, $(u-r)_0 < 2.3$), transition galaxies (TGs; $n < 2.5$, $(u-r)_0 \\geq 2.3$), and others (OGs; $n \\geq 2.5$, $(u-r)_0 < 2.3$). We find that ETGs and OGs show no significant environmental dependence: their mass-size slopes and intercepts are statistically consistent across CGs, groups, and the field. LTGs also follow similar relations in the field and in most groups, with only a modest tendency for LTGs in CGs to be smaller at fixed stellar mass. By contrast, TGs display a clear environmental signal: in groups the slope steepens to $\\alpha \\sim 0.4$ (versus $\\alpha \\sim 0.2$ in the field) and their sizes are smaller than in the field, with non-overlapping 95\\% posterior intervals. These trends suggest that TGs in denser environments are more structurally evolved, likely owing to enhanced bulge prominence and fading of the outer disc, consistent with the Sérsic-index distributions, which show an excess of TGs with $n_r \\gtrsim 1.5$ in groups and CGs. Our findings highlight TGs as an environmentally sensitive population, providing insight into the structural transformation of galaxies in group environments.",
      "pdf_url": "https://arxiv.org/pdf/2602.06719.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06785",
      "title": "Heavy interstellar scattering toward the near end of the Galactic bar",
      "authors": [
        "A. B. Pushkarev , A. Brunthaler , Y. Y. Kovalev , M. M. Lisakov , I. N. Pashchenko , A. V. Plavin , N. Roy , P. A. Voitsik , S. A. Dzib , T. A. Koryukova , A. Y. Yang Crimean Astrophysical Observatory, Max-Planck-Institut für Radioastronomie, Pontificia Universidad Catolica de Valparaiso, Lebedev Physical Institute, Moscow Institute of Physics and Technology, Harvard University, Indian Institute of Science, New Mexico Institute of Mining and Technology, National Astronomical Observatories, Key Laboratory of Radio Astronomy and Technology)"
      ],
      "abstract": "Heavy interstellar scattering toward the near end of the Galactic bar A. B. Pushkarev (1), A. Brunthaler (2), Y. Y. Kovalev (2), M. M. Lisakov (3), I. N. Pashchenko (4 and 5), A. V. Plavin (6), N. Roy (7 and 8), P. A. Voitsik (4), S. A. Dzib (2), T. A. Koryukova (4 and 1), A. Y. Yang (9 and 10) ((1) Crimean Astrophysical Observatory, (2) Max-Planck-Institut für Radioastronomie, (3) Pontificia Universidad Catolica de Valparaiso, (4) Lebedev Physical Institute, (5) Moscow Institute of Physics and Technology, (6) Harvard University, (7) Indian Institute of Science, (8) New Mexico Institute of Mining and Technology, (9) National Astronomical Observatories, (10) Key Laboratory of Radio Astronomy and Technology) 16 pages, 12 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We present results of a pilot observational wide-field VLBI campaign on probing scattering properties of the partly ionized interstellar medium towards the Galactic plane sky region between $28^\\circ<l<36^\\circ$ and $|b|<1^\\circ$. This covers the region where the Galactic bar connects to the spiral arms and where a lot of star formation is currently ongoing. The Very Long Baseline Array (VLBA) observations of the whole region were performed in a special mode with multiple phase centers at L-band (1.4 -- 1.8 GHz) during April-June 2022 and a year later complemented by sessions at S (2.2 -- 2.4 GHz) and C-band (4.6 -- 5.0 GHz) partially covering the pilot region. We found compelling evidence that target sources are subject to scattering. The total detection rate in L, S and C-bands is 1.5, 3.4 and 9.2 per cent, respectively, and approximately scales with the square of the observation frequency. The low rate values imply that scattering is strong. Its power is non-uniform across the Galactic plane and it can be approximated by a Gaussian with a width of about $2^\\circ$ peaking at the Galactic mid-plane. One of the brightest sources of the field shows anisotropic scattering, with a $\\lambda^2$ dependence of its observed angular size, along a position angle of $26^\\circ$ aligned with the line of constant Galactic latitude. We estimate the turbulence dissipation scale $r_\\text{in}\\approx1500$ km toward the source J1833+0015.",
      "pdf_url": "https://arxiv.org/pdf/2602.06785.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06793",
      "title": "The X-ray properties of the most luminous quasars with strong emission-line outflows",
      "authors": [
        "Anastasia Shlentsova",
        "Bartolomeo Trefoloni",
        "Matilde Signorini",
        "Guido Risaliti",
        "Elisabeta Lusso",
        "Emanuele Nardini",
        "Franz E. Bauer",
        "Matthew J. Temple",
        "Amy L. Rankine",
        "Gordon T. Richards"
      ],
      "abstract": "The X-ray properties of the most luminous quasars with strong emission-line outflows Anastasia Shlentsova, Bartolomeo Trefoloni, Matilde Signorini, Guido Risaliti, Elisabeta Lusso, Emanuele Nardini, Franz E. Bauer, Matthew J. Temple, Amy L. Rankine, Gordon T. Richards 12 pages, 8 figures, accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Strong outflows from active galactic nuclei are frequently observed in objects with lower coronal X-ray luminosity. This intrinsic X-ray weakness is considered a requirement for the formation of radiatively driven winds. To obtain an unbiased view on the connection between X-ray emission and the presence of powerful winds in the most luminous quasar phase, we present an X-ray analysis of a sample of extremely luminous, radio-quiet quasars with signatures of strong outflows in their rest-frame ultraviolet (UV) emission spectra. We study the $Chandra$ X-ray spectral properties of 10 objects, selected from the Sloan Digital Sky Survey Data Release 16 quasar catalogue based on their UV luminosities and ${\\rm C}_{\\rm IV}$ emission line blueshifts, comparing them to typical optically blue quasars. Our analysis reveals that seven out of 10 quasars in our sample have photon indices $\\Gamma>1.7$. Only two out of 10 objects exhibiting outflows with velocities exceeding 1400 km/s are X-ray 'weak', consistent with the fraction of X-ray 'weak' objects generally observed in quasar populations. Notably, one of the objects identified as X-ray 'weak' is likely an intrinsically X-ray 'normal' quasar that is heavily obscured. We observe a tentative indication at a $\\sim$2$\\sigma$ confidence level that the correlation between the excessively low X-ray flux level and the presence of ${\\rm C}_{\\rm IV}$ emission-line outflows might emerge at wind velocities greater than 3000 km/s. Our study provides additional evidence that the relationship between X-ray emission and the presence of winds is intricate. Our findings emphasise the need for X-ray observations of a larger sample of UV-selected quasars with confirmed strong emission-line outflows to unravel the nuanced interplay between winds and X-ray emission.",
      "pdf_url": "https://arxiv.org/pdf/2602.06793.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06870",
      "title": "Asteroseismic ages for 17,000 stars in Kepler, K2 and TESS",
      "authors": [
        "Emma Willett",
        "Andrea Miglio",
        "Saniya Khan",
        "Yvonne Elsworth",
        "Benoît Mosser",
        "Karsten Brogaard",
        "Giada Casali",
        "Cristina Chiappini",
        "Valeria Grisoni",
        "Amalie Stokholm",
        "Diego Bossini",
        "William J. Chaplin"
      ],
      "abstract": "Asteroseismic ages for 17,000 stars in Kepler, K2 and TESS Emma Willett, Andrea Miglio, Saniya Khan, Yvonne Elsworth, Benoît Mosser, Karsten Brogaard, Giada Casali, Cristina Chiappini, Valeria Grisoni, Amalie Stokholm, Diego Bossini, William J. Chaplin 15 pages, 27 figures. Accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The availability of asteroseismic constraints for tens of thousands of red giant (RG) stars has opened the door to robust age estimates, enabling time-resolved studies of different populations of stars in the Milky Way. This study leverages data from Kepler, K2, and TESS, in conjunction with astrometric data from Gaia DR3 and spectroscopic constraints from APOGEE DR17 and GALAH DR3, to infer parameters for over 17,000 RGs. We use the code PARAM to homogeneously infer stellar properties considering in detail the sensitivity of our results to different choices of observational constraints. We focus on age estimation, identifying potentially unreliable age determinations, and highlight stars with unreliable $\\Delta\\nu$ measurements based on comparisons using Gaia luminosities. These are particularly relevant in K2 data due to the short duration of the observations of each campaign, and therefore important to characterise for Galactic archaeology studies where the spatial range of K2 is a benefit. Thanks to the combination of data from different missions we explore trends in age, mass, and orbital parameters such as $R_\\mathrm{g}$ and $Z_\\mathrm{max}$, and examine time-resolved [$\\alpha$/M]-[Fe/H] planes across different Galactic regions. Additionally, we compare age distributions in low- and high-$\\alpha$ populations and chemically selected ex situ stars. The study also extends known mass-[C/N] ratio relationships to lower masses. The catalogues resulting from this work will be instrumental in addressing key questions in Galactic archaeology and stellar evolution, and to improve training sets for machine-learning-based age estimations.",
      "pdf_url": "https://arxiv.org/pdf/2602.06870.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2405.15859",
      "title": "The density-bounded twilight of starbursts in the early Universe",
      "authors": [
        "William McClymont",
        "Sandro Tacchella",
        "Francesco D'Eugenio",
        "Callum Witten",
        "Xihan Ji",
        "Aaron Smith",
        "Roberto Maiolino",
        "Santiago Arribas",
        "Jan Scholtz",
        "Charlotte Simmonds",
        "Joris Witstok"
      ],
      "abstract": "The density-bounded twilight of starbursts in the early Universe William McClymont, Sandro Tacchella, Francesco D'Eugenio, Callum Witten, Xihan Ji, Aaron Smith, Roberto Maiolino, Santiago Arribas, Jan Scholtz, Charlotte Simmonds, Joris Witstok 12 pages, 9 figures, accepted in MNRAS Astrophysics of Galaxies (astro-ph.GA) The peculiar nebular emission displayed by galaxies in the early Universe presents a unique opportunity to gain insight into the regulation of star formation in extreme environments. We investigate 500 (109) galaxies with deep NIRSpec/PRISM observations from the JADES survey at $z>2$ ($z>5.3$), finding 52 (26) galaxies with Balmer line ratios more than $1\\sigma$ inconsistent with Case B recombination. These anomalous Balmer emitters (ABEs) cannot be explained by dust attenuation, indicating a departure from Case B recombination. To address this discrepancy, we model density-bounded nebulae with the photoionisation code CLOUDY. Density-bounded nebulae show anomalous Balmer line ratios due to Lyman line pumping and a transition from the nebulae being optically thin to optically thick for Lyman lines with increasing cloud depth. The H$\\alpha$/H$\\beta$ versus H$\\gamma$/H$\\beta$ trend of density-bounded models is robust to changes in stellar age of the ionising source, gas density, and ionisation parameter; however, increasing the stellar metallicity drives a turnover in the trend. This is due to stronger stellar absorption features around Ly$\\gamma$ reducing H$\\beta$ fluorescence, allowing density-bounded models to account for all observed Balmer line ratios. ABEs show higher [OIII]/[OII], have steeper ultra-violet slopes, are fainter, and are more preferentially Ly$\\alpha$ emitters than galaxies which are consistent with Case B and little dust. These findings suggest that ABEs are galaxies that have become density bounded during extreme quenching events, representing a transient phase of $\\sim$20 Myr during a fast breathing mode of star formation.",
      "pdf_url": "https://arxiv.org/pdf/2405.15859.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.00106",
      "title": "The THESAN-ZOOM project: Burst, quench, repeat -- unveiling the evolution of high-redshift galaxies along the star-forming main sequence",
      "authors": [
        "William McClymont",
        "Sandro Tacchella",
        "Aaron Smith",
        "Rahul Kannan",
        "Ewald Puchwein",
        "Josh Borrow",
        "Enrico Garaldi",
        "Laura Keating",
        "Mark Vogelsberger",
        "Oliver Zier",
        "Xuejian Shen",
        "Filip Popovic",
        "Charlotte Simmonds"
      ],
      "abstract": "The THESAN-ZOOM project: Burst, quench, repeat -- unveiling the evolution of high-redshift galaxies along the star-forming main sequence William McClymont, Sandro Tacchella, Aaron Smith, Rahul Kannan, Ewald Puchwein, Josh Borrow, Enrico Garaldi, Laura Keating, Mark Vogelsberger, Oliver Zier, Xuejian Shen, Filip Popovic, Charlotte Simmonds 19 pages, 16 figures, 1 table, accepted in MNRAS Mon Not R Astron Soc (2025) 513-534 Astrophysics of Galaxies (astro-ph.GA) Characterizing the evolution of the star-forming main sequence (SFMS) at high redshift is crucial to contextualize the observed extreme properties of galaxies in the early Universe. We present an analysis of the SFMS and its scatter in the THESAN-ZOOM simulations, where we find a redshift evolution of the SFMS normalization scaling as $\\propto (1+z)^{2.64\\pm0.03}$, significantly stronger than is typically inferred from observations. We can reproduce the flatter observed evolution by filtering out weakly star-forming galaxies, implying that current observational fits are biased due to a missing population of lulling galaxies or overestimated star-formation rates. We also explore star-formation variability using the scatter of galaxies around the SFMS ($\\sigma_{\\mathrm{MS}}$). At the population level, the scatter around the SFMS increases with cosmic time, driven by the increased importance of long-term environmental effects in regulating star formation at later times. To study short-term star-formation variability, or ''burstiness'', we isolate the scatter on timescales shorter than 50 Myr. The short-term scatter is larger at higher redshift, indicating that star formation is indeed more bursty in the early Universe. We identify two starburst modes: (i) externally driven, where rapid large-scale inflows trigger and fuel prolonged, extreme star formation episodes, and (ii) internally driven, where cyclical ejection and re-accretion of the interstellar medium in low-mass galaxies drive bursts, even under relatively steady large-scale inflow. Both modes occur at all redshifts, but the increased burstiness of galaxies at higher redshift is due to the increasing prevalence of the more extreme external mode of star formation.",
      "pdf_url": "https://arxiv.org/pdf/2503.00106.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.04894",
      "title": "The THESAN-ZOOM project: central starbursts and inside-out quenching govern galaxy sizes in the early Universe",
      "authors": [
        "William McClymont",
        "Sandro Tacchella",
        "Aaron Smith",
        "Rahul Kannan",
        "Ewald Puchwein",
        "Josh Borrow",
        "Enrico Garaldi",
        "Laura Keating",
        "Mark Vogelsberger",
        "Oliver Zier",
        "Xuejian Shen",
        "Filip Popovic"
      ],
      "abstract": "The THESAN-ZOOM project: central starbursts and inside-out quenching govern galaxy sizes in the early Universe William McClymont, Sandro Tacchella, Aaron Smith, Rahul Kannan, Ewald Puchwein, Josh Borrow, Enrico Garaldi, Laura Keating, Mark Vogelsberger, Oliver Zier, Xuejian Shen, Filip Popovic 15 pages, 10 figures, 1 table, accepted in MNRAS Mon Not R Astron Soc (2025) 1732-1747 Astrophysics of Galaxies (astro-ph.GA) We explore the evolution of galaxy sizes at high redshift ($3 < z < 13$) using the high-resolution THESAN-ZOOM radiation-hydrodynamics simulations, focusing on the mass range of $10^6\\,\\mathrm{M}_{\\odot} < \\mathrm{M}_{\\ast} < 10^{10}\\,\\mathrm{M}_{\\odot}$. Our analysis reveals that galaxy size growth is tightly coupled to bursty star formation. Galaxies above the star-forming main sequence tend to form stars in a central starburst, which decreases their radial size. These galaxies quench inside-out, causing spatially extended star formation and increasing their radial size, leading to oscillatory behavior around the size-mass relation. Notably, we find a positive intrinsic size-mass relation at high redshift, consistent with observations but in tension with large-volume simulations. We attribute this discrepancy to the bursty star formation captured by our multi-phase interstellar medium framework, but missing from simulations using the effective equation-of-state approach with hydrodynamically decoupled feedback. We also find that the normalization of the size-mass relation follows a double power law as a function of redshift, with a break at $z\\approx6$, because the majority of galaxies at $z > 6$ show rising star-formation histories, and therefore are in a compaction phase. We demonstrate that H$\\alpha$ emission is systematically extended relative to the UV continuum by a median factor of 1.7, consistent with recent JWST studies. However, in contrast to previous interpretations that link extended H$\\alpha$ sizes to inside-out growth, we find that Lyman-continuum (LyC) emission is spatially disconnected from H$\\alpha$. Instead, a simple Strömgren sphere argument reproduces observed trends, suggesting that extreme LyC production during central starbursts is the primary driver of extended nebular emission.",
      "pdf_url": "https://arxiv.org/pdf/2503.04894.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.05612",
      "title": "The Shape of FIREbox Galaxies and a Potential Tension with Low-mass Disks",
      "authors": [
        "Courtney Klein",
        "Jenny D. Wang",
        "Luke Xia",
        "James S. Bullock",
        "Jorge Moreno",
        "Robert Feldmann",
        "Francisco J. Mercado",
        "Claude-André Faucher-Giguère",
        "Jonathan Stern",
        "N. Nicole Sanchez",
        "Abdelaziz Hussein",
        "Michelle S. Park"
      ],
      "abstract": "The Shape of FIREbox Galaxies and a Potential Tension with Low-mass Disks Courtney Klein, Jenny D. Wang, Luke Xia, James S. Bullock, Jorge Moreno, Robert Feldmann, Francisco J. Mercado, Claude-André Faucher-Giguère, Jonathan Stern, N. Nicole Sanchez, Abdelaziz Hussein, Michelle S. Park Astrophysics of Galaxies (astro-ph.GA) We study the intrinsic and observable shapes of approximately 700 star-forming galaxies with stellar masses of $10^8 - 10^{11}$ M$_\\odot$ from the FIREbox simulation at $z=0$. We calculate intrinsic axis ratios using inertia tensors weighted by three morphology types: \"All Stars,\" \"Young Stars,\" and \"Luminosity-weighted Stars.\" Young Stars shows mass-dependent 3D configurations, with spheroidal, elongated, and disky shapes dominant at stellar masses of $10^{8.5}$ M$_\\odot$, $10^{9.5}$ M$_\\odot$, and $10^{10.5}$ M$_\\odot$, respectively. Using the radiative transfer code SKIRT, we construct mock images for each galaxy and show that projected short-to-long axis ratios, $q$, inferred from 2D Sérsic fits are most closely related to Luminosity-weighted Stars tensor shapes and least resemble the All Stars' shapes. This suggests observed 2D shape distributions should not be compared to predictions based on 3D stellar mass shapes. Next, we construct a sample of mock images projected in random orientations and compare them to observed axis ratio distributions from the GAMA survey. At stellar masses below $10^{10}$ M$_\\odot$, we produce too few galaxies with observed $q<0.4$ and none with $q<0.2$, suggesting that FIREbox does not produce enough low-mass disk galaxies. At higher masses, $10^{10} - 10^{11}$ M$_\\odot$, we find that the predicted q distribution is sensitive to the dust-to-metal ratio; using our fiducial model, the distribution of $q$ values is formally consistent with observations, but there is tension with our ability to produce enough very thin systems with $q<0.2$. Future observational and theoretical programs aimed at understanding disk and thin-disk fractions will provide crucial tests of galaxy formation models.",
      "pdf_url": "https://arxiv.org/pdf/2503.05612.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.17318",
      "title": "Galaxy-scale lens search in the PEARLS NEP TDF and CEERS JWST fields",
      "authors": [
        "Giovanni Ferrami",
        "Nathan J. Adams",
        "Lewi Westcott",
        "Thomas Harvey",
        "Rolf A. Jansen",
        "Jose M. Diego",
        "Vince Estrada-Carpente",
        "Rogier A. Windhorst",
        "Christopher J. Conselice",
        "Anton M. Koekemoer",
        "Jordan C. J. D'Silva",
        "Christopher Willmer",
        "J. Stuart B. Wyithe",
        "Michael J. Rutkowski",
        "Seth H. Cohen",
        "Brenda L. Frye",
        "Norman A. Grogin"
      ],
      "abstract": "Galaxy-scale lens search in the PEARLS NEP TDF and CEERS JWST fields Giovanni Ferrami, Nathan J. Adams, Lewi Westcott, Thomas Harvey, Rolf A. Jansen, Jose M. Diego, Vince Estrada-Carpente, Rogier A. Windhorst, Christopher J. Conselice, Anton M. Koekemoer, Jordan C. J. D'Silva, Christopher Willmer, J. Stuart B. Wyithe, Michael J. Rutkowski, Seth H. Cohen, Brenda L. Frye, Norman A. Grogin 11 pages, 5 figures. Accepted in MNRAS Monthly Notices of the Royal Astronomical Society, Volume 545, Issue 2, January 2026 Astrophysics of Galaxies (astro-ph.GA) We present four galaxy scale lenses discovered in two JWST blank-fields: the ~ 54 arcmin^2 of the PEARLS North-Ecliptic-Pole Time-Domain Field (NEP TDF) and in the ~ 90 arcmin^2 of CEERS. We perform the search by visual inspection of NIRCam photometric data, obtaining an initial list of 16 lens candidates. We down-select this list to 5 high-confidence lens candidates, based on lens modelling of the image configuration and photometric redshift measurements for both the source and the deflector. We compare our results to samples of lenses obtained in ground-based and space-based lens searches and theoretical expectations. We expect that JWST observations of field galaxies will yield approximately 1 galaxy scale lens every three to four NIRCam pointings of comparable depth to these observations (~ 9 arcmin^2 each). This shows that JWST, compared to other lens searches, can yield an extremely high number of secure lenses per unit area, with redshift and size distributions complementary to lens samples obtained from ground-based and wide-area surveys. We estimate that a single JWST pure-parallel survey of comparable depth could yield $\\sim 80$ galaxy scale lenses, with a third of them having z_lens>1 and z_source>3.",
      "pdf_url": "https://arxiv.org/pdf/2505.17318.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.13852",
      "title": "Overmassive black holes in the early Universe can be explained by gas-rich, dark matter-dominated galaxies",
      "authors": [
        "William McClymont",
        "Sandro Tacchella",
        "Xihan Ji",
        "Rahul Kannan",
        "Roberto Maiolino",
        "Charlotte Simmonds",
        "Aaron Smith",
        "Ewald Puchwein",
        "Enrico Garaldi",
        "Mark Vogelsberger",
        "Francesco D'Eugenio",
        "Laura Keating",
        "Xuejian Shen",
        "Bartolomeo Trefoloni",
        "Oliver Zier"
      ],
      "abstract": "Overmassive black holes in the early Universe can be explained by gas-rich, dark matter-dominated galaxies William McClymont, Sandro Tacchella, Xihan Ji, Rahul Kannan, Roberto Maiolino, Charlotte Simmonds, Aaron Smith, Ewald Puchwein, Enrico Garaldi, Mark Vogelsberger, Francesco D'Eugenio, Laura Keating, Xuejian Shen, Bartolomeo Trefoloni, Oliver Zier 6 pages, 2 figures, accepted in MNRAS Astrophysics of Galaxies (astro-ph.GA) JWST has revealed the apparent evolution of the black hole (BH)-stellar mass ($M_\\mathrm{BH}$-$M_\\rm{\\ast}$) relation in the early Universe, while remaining consistent with the BH-dynamical mass ($M_\\mathrm{BH}$-$M_\\mathrm{dyn}$) relation. We predict BH masses for $z>3$ galaxies in the high-resolution THESAN-ZOOM simulations by assuming the $M_\\mathrm{BH}$-$M_\\mathrm{dyn}$ relation is fundamental. Even without live BH modelling, our approach reproduces the JWST-observed $M_\\mathrm{BH}$ distribution, including overmassive BHs relative to the local $M_\\mathrm{BH}$-$M_\\mathrm{\\ast}$ relation. We find that $M_\\mathrm{BH}/M_\\mathrm{\\ast}$ declines with $M_\\mathrm{\\ast}$, evolving from $\\sim$0.1 at $M_\\mathrm{\\ast}=10^6\\,\\mathrm{M_\\odot}$ to $\\sim$0.01 at $M_\\mathrm{\\ast}=10^{10.5}\\,\\mathrm{M_\\odot}$. This trend reflects the dark matter ($f_\\mathrm{DM}$) and gas fractions ($f_\\mathrm{gas}$), which decrease with $M_\\mathrm{\\ast}$ but show little redshift evolution down to $z=3$, resulting in small $M_\\mathrm{\\ast}/M_\\mathrm{dyn}$ ratios and thus overmassive BHs in low-mass galaxies. We use $\\texttt{Prospector}$-derived stellar masses and star-formation rates to infer $f_\\mathrm{gas}$ across 48,022 galaxies in JADES at $3<z<9$, finding excellent agreement with our simulation. Our results demonstrate that overmassive BHs would naturally result from a fundamental $M_\\mathrm{BH}$-$M_\\mathrm{dyn}$ relation and be typical of the gas-rich, dark matter-dominated nature of low-mass, high-redshift galaxies. Such overmassive BHs may strongly influence early galaxy formation, and we caution that our approach does not include the self-consistent BH-galaxy co-evolution required for a complete understanding.",
      "pdf_url": "https://arxiv.org/pdf/2506.13852.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.08787",
      "title": "The THESAN-ZOOM project: Mystery N/O more -- uncovering the origin of peculiar chemical abundances and a not-so-fundamental metallicity relation at $3<z<12$",
      "authors": [
        "William McClymont",
        "Sandro Tacchella",
        "Aaron Smith",
        "Rahul Kannan",
        "Enrico Garaldi",
        "Ewald Puchwein",
        "Yuki Isobe",
        "Xihan Ji",
        "Xuejian Shen",
        "Zihao Wang",
        "Vasily Belokurov",
        "Josh Borrow",
        "Francesco D'Eugenio",
        "Laura Keating",
        "Roberto Maiolino",
        "Stephanie Monty",
        "Mark Vogelsberger",
        "Oliver Zier"
      ],
      "abstract": "The THESAN-ZOOM project: Mystery N/O more -- uncovering the origin of peculiar chemical abundances and a not-so-fundamental metallicity relation at $3<z<12$ William McClymont, Sandro Tacchella, Aaron Smith, Rahul Kannan, Enrico Garaldi, Ewald Puchwein, Yuki Isobe, Xihan Ji, Xuejian Shen, Zihao Wang, Vasily Belokurov, Josh Borrow, Francesco D'Eugenio, Laura Keating, Roberto Maiolino, Stephanie Monty, Mark Vogelsberger, Oliver Zier 20 pages, 17 figures, accepted in MNRAS Astrophysics of Galaxies (astro-ph.GA) We present an analysis of metallicities and chemical abundances at $3<z<12$ in the THESAN-ZOOM simulations. We find that smoothly curved gas-phase and stellar mass-metallicity relations (MZR) are already in place at $z\\approx12$ and evolve slowly ($\\sim$0.2 dex increase for gas, $\\sim$0.4 dex increase for stars at a fixed stellar mass) down to $z=3$, governed largely by the efficiency with which galaxies retain their metals, rather than gas fraction. The canonical fundamental metallicity relation (FMR) survives in stars but breaks down and inverts for gas in low-mass galaxies ($M_\\ast\\lesssim10^{9}\\mathrm{M_\\odot}$) due to regular dilution by low-metallicity gas inflow. We find broad agreement of gas-phase N/O, Fe/O, and C/O with high-redshift observations, including the presence of nitrogen-rich galaxies (NRGs; $\\log(\\mathrm{N/O})>-0.6$) without the need for exotic yields in our chemical network. Instead, bursty star formation naturally generates order-of-magnitude excursions in N/O on $\\lesssim$100 Myr timescales due to temporally differential galactic winds; after a starburst, stellar feedback expels gas, leaving a large population of asymptotic-giant-branch stars to dominate the enrichment of the relatively low-mass interstellar medium. NRGs lie below the main sequence and typically exhibit $\\mathrm{EW}[H$\\beta$]\\lesssim40$ Å, in apparent tension with observed high-EW NRGs. This tension is reconciled if observed NRGs are in the initial stages of a subsequent starburst, illuminating previously enriched gas, which is supported by the finding of high SFR surface density nitrogen-rich giant molecular clouds.",
      "pdf_url": "https://arxiv.org/pdf/2507.08787.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.14483",
      "title": "VENUS: A Strongly Lensed Clumpy Galaxy at $z\\sim11-12$ behind the Galaxy Cluster MACS J0257.1-2325",
      "authors": [
        "Minami Nakane",
        "Vasily Kokorev",
        "Seiji Fujimoto",
        "Masami Ouchi",
        "Derek J. McLeod",
        "Miriam Golubchik",
        "Masamune Oguri",
        "Adi Zitrin",
        "Cecilia Bondestam",
        "Callum T. Donnan",
        "Gabriel Brammer",
        "Steven L. Finkelstein",
        "Chris Willott",
        "Gregor Rihtarsic",
        "Guillaume Desprez",
        "Angela Adamo",
        "Eros Vanzella",
        "Maruša Bradač",
        "Matteo Messa",
        "Hiroto Yanagisawa",
        "Fengwu Sun",
        "Henry C. Ferguson",
        "Ray A. Lucas",
        "Dan Coe",
        "Johan Richard",
        "Abdurro'uf",
        "Hollis B. Akins",
        "Joseph F. V. Allingham",
        "Ricardo O. Amorín",
        "Yoshihisa Asada",
        "Hakim Atek",
        "Rachel Bezanson",
        "Larry D. Bradley",
        "John Chisholm",
        "Christopher J. Conselice",
        "Pratika Dayal",
        "Miroslava Dessauges-Zavadsky",
        "Jose M. Diego",
        "Andreas L. Faisst",
        "Qinyue Fei",
        "Brenda L. Frye",
        "Yoshinobu Fudamoto",
        "Lukas J. Furtak",
        "Yuichi Harikane",
        "Tiger Yu-Yang Hsiao",
        "Yolanda Jiménez-Teja",
        "Jeyhan S. Kartaltepe",
        "Tomokazu Kiyota",
        "Anton M. Koekemoer",
        "Claudia del P. Lagos",
        "Georgios E. Magdis",
        "Ashish Kumar Meena",
        "Lamiya Mowla",
        "Gaël Noirot",
        "Pascal A. Oesch",
        "Yoshiaki Ono",
        "Rafael Ortiz III",
        "Richard Pan",
        "Casey Papovich",
        "Justin D. Pierel",
        "Massimo Ricotti",
        "Luke Robbins",
        "Daniel Schaerer",
        "Raffaella Schneider",
        "Tommaso Treu",
        "Francesco Valentino",
        "Rogier A. Windhorst",
        "Franz E. Bauer",
        "Volker Bromm",
        "Eiichi Egami",
        "Mauro González-Otero",
        "Kotaro Kohno",
        "Ivo Labbe",
        "Jorryt Matthee",
        "Marcie Mun",
        "Rohan P. Naidu",
        "Roberta Tripodi"
      ],
      "abstract": "VENUS: A Strongly Lensed Clumpy Galaxy at $z\\sim11-12$ behind the Galaxy Cluster MACS J0257.1-2325 Minami Nakane, Vasily Kokorev, Seiji Fujimoto, Masami Ouchi, Derek J. McLeod, Miriam Golubchik, Masamune Oguri, Adi Zitrin, Cecilia Bondestam, Callum T. Donnan, Gabriel Brammer, Steven L. Finkelstein, Chris Willott, Gregor Rihtarsic, Guillaume Desprez, Angela Adamo, Eros Vanzella, Maruša Bradač, Matteo Messa, Hiroto Yanagisawa, Fengwu Sun, Henry C. Ferguson, Ray A. Lucas, Dan Coe, Johan Richard, Abdurro'uf, Hollis B. Akins, Joseph F. V. Allingham, Ricardo O. Amorín, Yoshihisa Asada, Hakim Atek, Rachel Bezanson, Larry D. Bradley, John Chisholm, Christopher J. Conselice, Pratika Dayal, Miroslava Dessauges-Zavadsky, Jose M. Diego, Andreas L. Faisst, Qinyue Fei, Brenda L. Frye, Yoshinobu Fudamoto, Lukas J. Furtak, Yuichi Harikane, Tiger Yu-Yang Hsiao, Yolanda Jiménez-Teja, Jeyhan S. Kartaltepe, Tomokazu Kiyota, Anton M. Koekemoer, Claudia del P. Lagos, Georgios E. Magdis, Ashish Kumar Meena, Lamiya Mowla, Gaël Noirot, Pascal A. Oesch, Yoshiaki Ono, Rafael Ortiz III, Richard Pan, Casey Papovich, Justin D. Pierel, Massimo Ricotti, Luke Robbins, Daniel Schaerer, Raffaella Schneider, Tommaso Treu, Francesco Valentino, Rogier A. Windhorst, Franz E. Bauer, Volker Bromm, Eiichi Egami, Mauro González-Otero, Kotaro Kohno, Ivo Labbe, Jorryt Matthee, Marcie Mun, Rohan P. Naidu, Roberta Tripodi 21 pages, 9 figures, submitted to ApJ, revised version Astrophysics of Galaxies (astro-ph.GA) We present the discovery of a strongly lensed galaxy at $z\\sim11-12$, dubbed the ``Misty Moons'', identified in the JWST Treasury Survey, Vast Exploration for Nascent, Unexplored Sources (VENUS). The Misty Moons is gravitationally lensed by the galaxy cluster MACS J0257.1-2325 at $z=0.505$, and has five multiple images suggested by two independent lensing models. Two of the five images, ID1 and ID2 ($\\mu\\sim 20-30$), are very bright (F200W$\\sim26$ AB mag) and exhibit blue SEDs with prominent Ly$\\alpha$ breaks. In the source plane, the Misty Moons is a sub-$L^*$ galaxy ($M_{\\rm UV}\\sim-18.0$ mag) resolved into multiple stellar clumps, each of which has an effective radius of $r_\\mathrm{eff}\\sim 10-70$ pc and a stellar mass of $\\sim10^7\\ M_\\odot$. These clumps dominate the stellar mass budget of the Misty Moons ($\\gtrsim80\\%$), similar to other high-$z$ clumps, which suggests a highly clustered mode of star formation in the early Universe, unlike seen in local dwarf galaxies. We convolve the source-plane image with the JWST/NIRCam point-spread function to produce a mock NIRCam image of the Misty Moons without lensing magnification, and find that the intrinsic galaxy has a radial surface-brightness profile comparable to those of $z\\gtrsim10$ faint galaxies, such as JADES-GS-z13-0 and JADES-GS-z14-1, indicating that the Misty Moons represents a typical $z\\gtrsim10$ faint galaxy. The Misty Moons, a lensed galaxy with resolved internal structures, provides an ideal laboratory for exploring the early stages of galaxy formation at $z\\gtrsim10$.",
      "pdf_url": "https://arxiv.org/pdf/2511.14483.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.23314",
      "title": "Stellar streams around dwarf galaxies in the Local Universe",
      "authors": [
        "Joanna D. Sakowska",
        "David Martínez-Delgado",
        "Sarah Pearson",
        "Francisco J. Riquel-Castilla",
        "Tjitske K. Starkenburg",
        "Giuseppe Donatiello",
        "Alis Deason",
        "Denis Erkal",
        "Ethan D. Taylor"
      ],
      "abstract": "Stellar streams around dwarf galaxies in the Local Universe Joanna D. Sakowska, David Martínez-Delgado, Sarah Pearson, Francisco J. Riquel-Castilla, Tjitske K. Starkenburg, Giuseppe Donatiello, Alis Deason, Denis Erkal, Ethan D. Taylor 6 pages, 2 figures, accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) While mergers between massive galaxies and their dwarf satellites are well studied, the properties of dwarf - dwarf satellite mergers are not well constrained. Stellar streams trace satellite disruption and, in the dwarf galaxy regime, are predicted to provide novel constraints on low-mass galaxy evolution and dark matter. However, the mass ratios required to form these streams make them challenging to detect. We present a preview of the Stellar Stream Legacy Survey (SSLS) in the dwarf galaxy regime. The SSLS aims to produce a statistically large, homogeneous sample of stellar streams for comparison with galaxy evolution theory. We visually inspect dwarf galaxies using the DESI Legacy Imaging Survey (DES and DECaLS footprints, r-band 29 mag arcsec^-2 within 4 - 35 Mpc. We develop a classification metric to categorise accretion debris around dwarf galaxies, and measure the frequency of accretion features in the DES footprint only. We present the first release of accretion features around dwarf galaxies collected from the DES and DECaLS footprints, including 1 stream, 11 shells, and 8 asymmetric stellar halos, of which 17 constitute new identifications. In the DES footprint, we inspect 730 dwarfs and find that 5.1% (37/730) show accretion features. Although this frequency measurement is lower than the SSLS result for massive galaxies, we discuss the observational biases behind detecting streams in the dwarf galaxy regime. Our results highlight the difficulty of detecting streams around dwarfs, and identify the need for improved theoretical modelling of low-mass merger morphologies. Nevertheless, they place constraints on hierarchical mass assembly in this regime.",
      "pdf_url": "https://arxiv.org/pdf/2511.23314.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05914",
      "title": "ALMAGAL VI. The spatial distribution of dense cores during the evolution of cluster-forming massive clump",
      "authors": [
        "E.Schisano",
        "S.Molinari",
        "A.Coletta",
        "D.Elia",
        "P.Schilke",
        "A.Traficante",
        "Á.Sanchez-Monge",
        "H.Beuther",
        "M.Benedettini",
        "C.Mininni",
        "R.S.Klessen",
        "J.D.Soler",
        "A.Nucara",
        "S.Pezzuto",
        "F.van der Tak",
        "P.Hennebelle",
        "M.T.Beltrán",
        "L.Moscadelli",
        "K.L.J.Rygl",
        "P.Sanhueza",
        "P.M.Koch",
        "D.C.Lis",
        "R.Kuiper",
        "G.A.Fuller",
        "A.Avison",
        "L.Bronfman",
        "U.Lebreuilly",
        "T.Möller",
        "T.Liu",
        "V.-M.Pelkonen",
        "L.Testi",
        "Q.Zhang",
        "T.Zhang",
        "A.Ahmadi",
        "J.Allande",
        "C.Battersby",
        "J.Wallace",
        "C.L.Brogan",
        "S.Clarke",
        "F.De Angelis",
        "F.Fontani",
        "P.T.P.Ho",
        "T.R.Hunter",
        "B.Jones",
        "K.G.Johnston",
        "P.D.Klaassen",
        "S.J.Liu",
        "S.-Y.Liu",
        "Y.Maruccia",
        "A.J.Rigby",
        "Y.-N.Su",
        "Y.Tang",
        "S.Walch",
        "H.Zinnecker"
      ],
      "abstract": "ALMAGAL VI. The spatial distribution of dense cores during the evolution of cluster-forming massive clump E.Schisano, S.Molinari, A.Coletta, D.Elia, P.Schilke, A.Traficante, Á.Sanchez-Monge, H.Beuther, M.Benedettini, C.Mininni, R.S.Klessen, J.D.Soler, A.Nucara, S.Pezzuto, F.van der Tak, P.Hennebelle, M.T.Beltrán, L.Moscadelli, K.L.J.Rygl, P.Sanhueza, P.M.Koch, D.C.Lis, R.Kuiper, G.A.Fuller, A.Avison, L.Bronfman, U.Lebreuilly, T.Möller, T.Liu, V.-M.Pelkonen, L.Testi, Q.Zhang, T.Zhang, A.Ahmadi, J.Allande, C.Battersby, J.Wallace, C.L.Brogan, S.Clarke, F.De Angelis, F.Fontani, P.T.P.Ho, T.R.Hunter, B.Jones, K.G.Johnston, P.D.Klaassen, S.J.Liu, S.-Y.Liu, Y.Maruccia, A.J.Rigby, Y.-N.Su, Y.Tang, S.Walch, H.Zinnecker 32 pages, 22 figures, accepted for publication in the Astronomy & Astrophysics journal, abstract adapted from current version Astrophysics of Galaxies (astro-ph.GA) High-mass stars and star clusters form from the fragmentation of massive dense clumps driven by gravity, turbulence, and magnetic fields. The ALMAGAL project observed $\\sim1000$ clumps at $\\sim$1000\\,au resolution, enabling a statistically significant characterization of this process across a large range of clump physical parameters and evolutionary stages. In this work, we investigated the spatial distribution of dense cores in the 514 massive, potentially cluster-forming, clumps hosting at least 4 cores, to trace fragmentation's initial conditions and early evolution. We used quantitative descriptors, evaluated against the clump bolometric luminosity-to-mass ratio as an indicator of evolution. Core separations were measured with the minimum spanning tree method (MST) and compared with the Jeans gravitational fragmentation theory. We used the $Q$ parameter and the mass segregation ratio, $\\Lambda_{MSR}$, to evaluate whether cores have specific arrangements or differences depending on their masses. ALMAGAL cores are usually arranged in elliptical groups with an axis ratio $e\\sim2.2$, but $e\\geq$5 is also observed. A single characteristic core separation per clump is found in $\\sim76$% of cases, but signatures of multiple fragmentation lengths not rare. Typical core separations are compatible with the clump-averaged thermal Jeans length, $\\lambda^{th}_{J}$, though a population, typical of low-fragmented/young clumps, has wider separations with $l\\approx3\\times\\lambda^{th}_{J}$. The core separation decreases on average from $l\\sim22000$ au in younger systems to $l\\sim7000$ au in more evolved ones. Cores are typically distributed in fractal-type subclusters, with centrally concentrated patterns appearing only at later stages, but without a progressive evolutionary transition. Finally, mass segregation is found in 110 systems, with its occurrence increasing with evolution.",
      "pdf_url": "https://arxiv.org/pdf/2512.05914.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.19967",
      "title": "Lyman Continuum escaping from in-situ formed stars in a tidal bridge at z = 3",
      "authors": [
        "T. E. Rivera-Thorsen",
        "A. Le Reste",
        "M. J. Hayes",
        "S. Flury",
        "A. Saldana-Lopez",
        "B. Welch",
        "S. Choe",
        "K. Sharon",
        "K. Kim",
        "M. R. Owens",
        "E. Solhaug",
        "H. Dahle",
        "J. R. Rigby",
        "J. Melinder"
      ],
      "abstract": "Lyman Continuum escaping from in-situ formed stars in a tidal bridge at z = 3 T. E. Rivera-Thorsen, A. Le Reste, M. J. Hayes, S. Flury, A. Saldana-Lopez, B. Welch, S. Choe, K. Sharon, K. Kim, M. R. Owens, E. Solhaug, H. Dahle, J. R. Rigby, J. Melinder 4 pages, 2 figures. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) We present an analysis of archival JWST NIRSpec IFS and HST imaging observations of the z = 3 Lyman-Continuum Emitter (LCE) candidate LACES104037. We show that a nearby galaxy, denoted LACES104037-S, has a redshift offset from the main galaxy by only $\\sim 450$ km/s. Together with the identification of tidal bridge features between the galaxies, this indicates that the galaxies are interacting and most likely in the early stages of a merger. We show that the restframe LCE cluster sits in a tidal bridge towards the companion, about 2.7 kpc from the galaxy's core. It is faint in non-ionizing stellar continuum, and shows faint but non-negligible H{\\alpha} and [O III] emission, suggesting that much of the gas surrounding the LCE cluster has been dispersed by feedback in the shallower gravitational potential of the tidal bridge. From comparing the direct LyC escape and the local H{\\alpha} emission, we find a total ionizing LyC escape fraction of $f_{\\mathrm{esc}} = 57 \\pm 8\\%$ from the LCE cluster. We estimate the age of the LCE cluster to be $\\lesssim 6.5$ Myr, indicating that the cluster must have formed in situ in the tidal bridge well after the time of closest interaction. LyC escape from tidal stripping or in-situ formed stars in tidal features would depend less on intrinsic galaxy properties than typically observed in low-z LCE surveys, and could help explain the higher cosmic escape fraction as well as the enhanced diversity of LCE galaxy properties observed at Cosmic Noon.",
      "pdf_url": "https://arxiv.org/pdf/2512.19967.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20473",
      "title": "A quiescent galaxy in a gas-rich cosmic web node at z~3",
      "authors": [
        "Weichen Wang",
        "Sebastiano Cantalupo",
        "Marta Galbiati",
        "Andrea Travascio",
        "Antonio Pensabene",
        "Charles C. Steidel",
        "Gabriele Pezzulli",
        "Bingjie Wang",
        "Xiaohan Wang",
        "Rajeshwari Dutta",
        "Titouan Lazeyras",
        "Nicolas Ledos",
        "Huiyang Mao",
        "Giada Quadri"
      ],
      "abstract": "A quiescent galaxy in a gas-rich cosmic web node at z~3 Weichen Wang, Sebastiano Cantalupo, Marta Galbiati, Andrea Travascio, Antonio Pensabene, Charles C. Steidel, Gabriele Pezzulli, Bingjie Wang, Xiaohan Wang, Rajeshwari Dutta, Titouan Lazeyras, Nicolas Ledos, Huiyang Mao, Giada Quadri 15 pages, 13 figures; submitted to A&A Astrophysics of Galaxies (astro-ph.GA) Recent JWST observations have unveiled a large number of quiescent galaxies at $z\\gtrsim3$, bringing potential challenges to current galaxy formation models. Since star formation is expected to be fed by external gas accretion, the knowledge about the circumgalactic media (CGM) of these galaxies is essential to understanding how they quench. In this work, we present the discovery of a massive and passive galaxy ($M_\\star\\simeq10^{11}\\,M_\\odot$) within the MQN01 structure at z~3.25, containing one of the largest overdensities of galaxies and active galactic nuclei (AGN) found so far at $z\\gtrsim3$. The passive galaxy has a star-formation rate of $4^{+6}_{-2}~M_\\odot$/yr, placing it more than 1 dex below the star-forming main sequence, and has no detectable molecular gas ($M_\\mathrm{H2}<7\\times10^{9}\\,M_\\odot$). Surprisingly, it is located at the center of a large cool gas reservoir, as traced by bright Ly$\\alpha$ and H$\\alpha$ emission. By taking advantage of deep multi-wavelength information unique to this field, including deep Chandra X-ray data, we argue that the inefficient gas accretion from the CGM onto this galaxy over the last few hundreds of Myr, as suggested by the observations, could be caused by an AGN jet of a nearby star-forming galaxy located at a projected distance of 48 kpc. In particular, we argue that the jet feedback may have maintained a high level of CGM turbulence around the passive galaxy and thus caused a reduced gas accretion over the required time-scales. In addition, the elevated ionizing field provided by the AGN overdensity, including the nearby AGN, can illuminate the passive galaxy's cool CGM and make it visible through fluorescent emission. Our study demonstrates that the star formation rates of high-redshift galaxies could be substantially reduced and maintained at a low level even within gas-rich and overdense environments in particular situations.",
      "pdf_url": "https://arxiv.org/pdf/2601.20473.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.00321",
      "title": "Investigating the origin of radio emission in candidate super-Eddington accreting black holes",
      "authors": [
        "Marie-Lou Gendron-Marsolais",
        "Paola Marziani",
        "Marco Berton",
        "Emilia Järvelä",
        "Ascensión del Olmo",
        "Mark Sargent",
        "Mauro D'Onofrio",
        "Luca Crepaldi",
        "Ancor Damas-Segovia",
        "Brian Punsly",
        "Lourdes Verdes-Montenegro"
      ],
      "abstract": "Investigating the origin of radio emission in candidate super-Eddington accreting black holes Marie-Lou Gendron-Marsolais, Paola Marziani, Marco Berton, Emilia Järvelä, Ascensión del Olmo, Mark Sargent, Mauro D'Onofrio, Luca Crepaldi, Ancor Damas-Segovia, Brian Punsly, Lourdes Verdes-Montenegro 27 pages, 14 figures, Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Recent works show that the radio power of quasars accreting at very high rates can reach surprisingly high values. These studies suggest that this radio emission might originate from star formation, but lack of data leaves open the possibility that they could also contain a jetted active galactic nucleus (AGN). We investigate the origin of the radio emission of a sample of 18 super-Eddington candidates, over a wide range of redshifts. These sources are expected to have extreme radiative output per unit black hole mass, show high-velocity outflows and are therefore thought to be a prime mover of galactic evolution via radiative and mechanical feedback. We present new Karl G. Jansky Very Large Array (VLA) observations at L, C and X-band of these sources, which we combine with observations from the LOw-Frequency ARray (LOFAR) Two-metre Sky Survey (LoTSS) and the Very Large Array Sky Survey (VLASS). We also use optical and IR data to derive estimates of accretion and wind parameters, as well as star formation rates to compare with the ones derived from the radio emission. Based on the radio variability, luminosity, morphology, radio spectral properties, radio vs IR estimates of star formation rate and radio-to-mid IR flux ratio, we find that 7 of our 18 targets are likely to have their radio emission predominantly coming from SF, and 6 from a combination of SF and AGN-related mechanisms, while only three sources indicate a core or jetted AGN only origin for the detected radio emission. This is consistent with previous studies, and supports the prevalence of lower power radio structures associated with star-forming activity rather than relativistic jets in the high Eddington ratio regime. In the same sample, however, we find three sources for which the data suggest a concomitant presence of super-Eddington accretion and relativistic ejections.",
      "pdf_url": "https://arxiv.org/pdf/2602.00321.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.02702",
      "title": "Connecting the Dots: UV-Bright Companions of Little Red Dots as Lyman-Werner Sources Enabling Direct Collapse Black Hole Formation",
      "authors": [
        "Josephine F.W. Baggen",
        "Matthew T. Scoggins",
        "Pieter van Dokkum",
        "Zoltán Haiman",
        "Alberto Torralba",
        "Jorryt Matthee"
      ],
      "abstract": "Connecting the Dots: UV-Bright Companions of Little Red Dots as Lyman-Werner Sources Enabling Direct Collapse Black Hole Formation Josephine F.W. Baggen, Matthew T. Scoggins, Pieter van Dokkum, Zoltán Haiman, Alberto Torralba, Jorryt Matthee Submitted to Astrophysical Journals Astrophysics of Galaxies (astro-ph.GA) We compile a sample of 83 Little Red Dots (LRDs) with JWST imaging and find that a substantial fraction ($\\sim$43%, rising to $\\gtrsim$85% for the most luminous LRDs) host one or more spatially offset, UV-bright companions at projected separations of $0.5\\rm \\, kpc \\lesssim d\\lesssim 5 \\rm \\,kpc$, with median of $\\langle d \\rangle = 1.0\\,\\mathrm{kpc}$. This fraction is even higher when smaller spatial scales are probed at high S/N ratio: we show that the two most strongly lensed LRDs known to date, A383-LRD and the newly discovered A68-LRD, both have UV-bright companions at separations of only $d\\sim0.3$ kpc, below the resolution limit of most unlensed JWST samples. We explore whether these ubiquitous red/blue configurations may be physically linked to the formation of LRDs, in analogy with the \"synchronized pair\" scenario originally proposed for direct-collapse black hole formation. In this picture, ultraviolet radiation from the companions, which typically have modest stellar masses ($M_\\ast \\sim 10^{8-9}M_\\odot$), suppresses molecular hydrogen cooling in nearby gas, allowing nearly isothermal collapse and the formation of extremely compact objects, such as massive black holes or quasi-stars. Using component-resolved photometry and SED modeling, we infer Lyman-Werner radiation fields of $J_{21,LW} \\sim 10^{2.5}$-$10^{5}$ at the locations of the red components, comparable to those required in direct-collapse models, suggesting that the necessary photodissociation conditions are realized in many LRD systems. This framework provides a simple and self-consistent explanation for the extreme compactness and distinctive spectral properties of LRDs, and links long-standing theoretical models for early compact object formation directly to a population now observed with JWST in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2602.02702.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03651",
      "title": "Broadband infrared spectroscopy of methanol isotopologues in pure, H2O-rich, and CO-rich ice analogues",
      "authors": [
        "Adam Vyjidak",
        "Barbara Michela Giuliano",
        "Pavol Jusko",
        "Heidy M. Quitian-Lara",
        "Felipe Fantuzzi",
        "Giuseppe A. Baratta",
        "Maria Elisabetta Palumbo",
        "Paola Caselli"
      ],
      "abstract": "Broadband infrared spectroscopy of methanol isotopologues in pure, H2O-rich, and CO-rich ice analogues Adam Vyjidak, Barbara Michela Giuliano, Pavol Jusko, Heidy M. Quitian-Lara, Felipe Fantuzzi, Giuseppe A. Baratta, Maria Elisabetta Palumbo, Paola Caselli 15 pages, 15 figures, 14 tables, 5 appendix. Accepted for publication in Astronomy and Astrophysics (A&A) Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Deuterium fractionation is highly efficient during the early stages of star formation, particularly in starless and prestellar cores where temperatures are low (<10 K) and molecular freeze-out onto dust grains is significant. Methanol forms early in these environments following CO freeze-out via successive hydrogenation reactions on grain surfaces, while the production of deuterated methanol requires elevated gas-phase D/H ratios generated through dissociative recombination of deuterated H3+. Consequently, large abundances of deuterated methanol are observed toward young stellar objects where prestellar ices have recently sublimated. Here, we present laboratory infrared spectra of methanol and its deuterated isotopologues in astrophysical ice analogues, complemented by anharmonic vibrational calculations used to guide band assignments. Experiments were performed at the CASICE laboratory using a Bruker Vertex 70v spectrometer coupled to a closed-cycle helium cryostat, with isotopologue ices deposited at 10 K under high-vacuum conditions. Infrared transmission spectra were recorded over 6000-30 cm-1 (1.67-333 um) and compared with spectra of pure isotopologue ices. Distinctive mid-infrared band patterns are identified for each deuterated species. In particular, CH2DOH exhibits a characteristic doublet at 1293 and 1326 cm-1 (7.73 and 7.54 um), while CHD2OH shows a similar doublet at 1301 and 1329 cm-1 (7.69 and 7.52 um), both remaining largely invariant across all studied ice mixtures. These robust spectral signatures provide reliable tracers for identifying deuterated methanol in JWST observations and for constraining astrochemical gas-grain models of deuterium enrichment prior to star and planet formation.",
      "pdf_url": "https://arxiv.org/pdf/2602.03651.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04974",
      "title": "Clustering of z~6.6 Quasars and [O III] Emitters Constrains Host Halo Masses and Duty Cycles in 25 ASPIRE Fields",
      "authors": [
        "Jiamu Huang",
        "Joseph Hennawi",
        "Elia Pizzati",
        "Feige Wang",
        "Jinyi Yang",
        "Jaclyn B. Champagne",
        "Xiaohui Fan",
        "Eduardo Bañados",
        "Xiangyu Jin",
        "Koki Kakiichi",
        "Romain A. Meyer",
        "Fengwu Sun",
        "Yunjing Wu",
        "Haowen Zhang",
        "Chiara Mazzucchelli",
        "Anna-Christina Eilers",
        "Maria Pudoka",
        "Huanian Zhang",
        "Jan-Torge Schindler",
        "Matthieu Schaller",
        "Joop Schaye",
        "Ben Snyder",
        "Yi Kang",
        "Silvia Onorato"
      ],
      "abstract": "Clustering of z~6.6 Quasars and [O III] Emitters Constrains Host Halo Masses and Duty Cycles in 25 ASPIRE Fields Jiamu Huang, Joseph Hennawi, Elia Pizzati, Feige Wang, Jinyi Yang, Jaclyn B. Champagne, Xiaohui Fan, Eduardo Bañados, Xiangyu Jin, Koki Kakiichi, Romain A. Meyer, Fengwu Sun, Yunjing Wu, Haowen Zhang, Chiara Mazzucchelli, Anna-Christina Eilers, Maria Pudoka, Huanian Zhang, Jan-Torge Schindler, Matthieu Schaller, Joop Schaye, Ben Snyder, Yi Kang, Silvia Onorato 23 pages, 10 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) We use data from the JWST ASPIRE Wide Field Slitless Spectroscopy (WFSS) program to measure the auto-correlation function of [O,{\\sc iii}] emitters at 5.3$<z<$7.0 and the quasar--[O,{\\sc iii}] emitter cross-correlation around 25 ASPIRE quasars (6.51$<z<$6.82; $\\langle z\\rangle=6.6$). We use synthetic source injection to calibrate the selection function, which we combine with the large-volume FLAMINGO-10k simulation (2.8,cGpc box) to construct realistic mock observations. Our simulation-based approach captures nonlinear structure growth and scale-dependent bias on small scales and derives covariance matrices that include cosmic variance. The clustering yields correlation lengths of $r_0^{\\rm GG}=4.7^{+0.4}{-0.5},h^{-1}$,cMpc for the [O,{\\sc iii}] auto-correlation with fixed slope $\\gamma{\\rm GG}=1.8$, and $r_0^{\\rm QG}=8.7^{+0.8}{-0.9},h^{-1}$,cMpc for the quasar--[O,{\\sc iii}] cross-correlation with $\\gamma{\\rm QG}=2.0$. We infer $\\log(M_{h,{\\rm min}}^{[{\\rm O,III}]}/M_\\odot)=10.5^{+0.1}{-0.1}$ for [O,{\\sc iii}] emitters and $\\log(M{h,{\\rm min}}^{\\rm QSO}/M_\\odot)=12.1^{+0.3}{-0.4}$ for quasars. These imply duty cycles of $2.5^{+1.0}{-0.8}$,per,cent for [O,{\\sc iii}] emitters and $0.3^{+4.0}{-0.3}$,per,cent for quasars, corresponding to UV-bright lifetimes of $t{\\rm Q}=2.6^{+30}_{-2.5}$,Myr (less than 10,per,cent of a Salpeter $e$-folding time). The results indicate that the observed UV-luminous phase contributes little to total SMBH growth, placing tight constraints on early black-hole formation.",
      "pdf_url": "https://arxiv.org/pdf/2602.04974.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.09536",
      "title": "Ultimate large-$Rm$ regime of the solar dynamo",
      "authors": [
        "François Rincon"
      ],
      "abstract": "Ultimate large-$Rm$ regime of the solar dynamo François Rincon (IRAP, CNRS, UPS) 7 pages, 6 figures, to appear in A&A as a Letter Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); Fluid Dynamics (physics.flu-dyn); Plasma Physics (physics.plasm-ph) For more than 40 years the quest to understand how large-scale magnetic fields emerge from turbulent flows in rotating astrophysical systems, such as the Sun, has been a major focus of computational astrophysics research. Using a parameter scan and phenomenological analysis of maximally simplified three-dimensional cartesian magnetohydrodynamic simulations of large-scale non-linear helical turbulent dynamos, I present results in this Letter that strongly point to an asymptotic ultimate regime of the large-scale solar dynamo at large magnetic Reynolds numbers, $Rm$, involving helicity fluxes between hemispheres. I obtained corresponding numerical solutions at both $Pm>1$ and $Pm<1$, and show that they can currently only be achieved in clean, simplified numerical set-ups. The analysis further strongly suggests that all global simulations to date lie in non-asymptotic turbulent magnetohydrodynamic regimes highly sensitive to changes in kinetic and magnetic Reynolds numbers. Ideas are presented to attempt to reach the ultimate regime in such 'realistic' global spherical models at a reasonable numerical cost. Overall, the results clarify the current state, and some hard limitations of the brute-force numerical modelling approach applied to this, and other similar astrophysical turbulence problems.",
      "pdf_url": "https://arxiv.org/pdf/2512.09536.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15443",
      "title": "Perihelion Asymmetry in the Water Production Rate of the Interstellar Object 3I/ATLAS",
      "authors": [
        "Hanjie Tan , Xiaoran Yan , Jian-Yang Li Planetary Environmental and Astrobiological Research Laboratory , School of Atmospheric Sciences, Sun Yat-sen University, Zhuhai, China, National Research Council, Institute of Applied Physics \"Nello Carrara\" , FI, Italy, Xinjiang Astronomical Observatory, Chinese Academy of Sciences, Urumqi, China)"
      ],
      "abstract": "Perihelion Asymmetry in the Water Production Rate of the Interstellar Object 3I/ATLAS Hanjie Tan (1), Xiaoran Yan (2), Jian-Yang Li (1 and 3) ((1) Planetary Environmental and Astrobiological Research Laboratory (PEARL), School of Atmospheric Sciences, Sun Yat-sen University, Zhuhai, China, (2) National Research Council, Institute of Applied Physics \"Nello Carrara\" (IFAC-CNR), FI, Italy, (3) Xinjiang Astronomical Observatory, Chinese Academy of Sciences, Urumqi, China) 13 pages, 7 figures. Accepted for publication in The Astrophysical Journal Letters (ApJL) Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) 3I/ATLAS is an interstellar object whose activity provides critical insights into its composition and origin. However, due to its orbital geometry, the object is too close to the Sun near perihelion to be observed from the ground, and space-based measurements are therefore required. Here we characterize the water production rate of 3I/ATLAS using SOHO/SWAN Lyman-$\\alpha$ observations from 2025 November to December (heliocentric distances 1.4 to 2.2 au) with 3D Monte Carlo modeling. We report a peak post-perihelion water production rate of $Q_{\\mathrm{H_2O}} \\approx 4 \\times 10^{28}$ molecules~s$^{-1}$, corresponding to a minimum active fraction of $\\sim$30\\% (assuming a maximum nucleus radius of 2.8 km). Comparison of our post-perihelion measurements with published pre-perihelion results reveals a heliocentric asymmetry, with an $r^{-5.9 \\pm 0.8}$ scaling for the inbound rise, followed by a shallower $r^{-3.3 \\pm 0.3}$ scaling during the outbound decline, where $r$ is heliocentric distance. The post-perihelion behavior indicates that the water production of 3I/ATLAS was driven primarily by the varying solar insolation acting on a stable active area. Combined with other evidence, including comparison with the hyperactive comet 103P/Hartley 2, our findings suggest that its water production is likely dominated by a distributed source of icy grains. Furthermore, it displayed remarkable stability in the activity with no signs of outbursts or rapid depletion of water production.",
      "pdf_url": "https://arxiv.org/pdf/2601.15443.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06196",
      "title": "Compact HII Regions as Clocks of Massive-Star Formation: Evidence for Long Formation Timescales",
      "authors": [
        "Paolo Padoan",
        "Mark Gieles"
      ],
      "abstract": "Compact HII Regions as Clocks of Massive-Star Formation: Evidence for Long Formation Timescales Paolo Padoan, Mark Gieles 14 pages, 5 figures, submitted to Astrophysical Journal Letters Solar and Stellar Astrophysics (astro-ph.SR) We revisit the luminosity function (LF) of compact HII regions in the context of the inertial--inflow model, in which massive stars assemble over extended, mass-dependent timescales. The comparison of the compact-HII-region LF with that of OB stars is traditionally used to estimate the compact-HII-phase lifetime and is often cited as evidence for the classical ``lifetime problem\" of HII regions. We show that once stellar growth during the ionizing phase is included, the LF comparison instead constrains massive-star formation timescales, so the lifetime problem turns into evidence for prolonged growth. We illustrate the principle with a simple analytic model and then forward-model the two LFs with Monte Carlo realizations. We also derive revised Galactic LFs for compact HII regions and OB stars from the Red MSX Source survey and the Alma Luminous Star catalogue. The joint LF constraints imply a growth law where the formation time is about 2 Myr for a $60\\,M_\\odot$ star, with a square-root dependence on mass. The revised OB-star LF exhibits a statistically significant knee at $\\log_{10}(L_{\\rm k}/L_\\odot)=5.0$, while the HII-region LF knee occurs at lower luminosity, as expected in the interpretation that HII regions are powered by stars that are still growing in mass. We conclude that massive stars in the Milky Way form over Myr timescales that increase with their final mass.",
      "pdf_url": "https://arxiv.org/pdf/2602.06196.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06259",
      "title": "Disk-Regulated Mass Transfer Between Rotating Non-Degenerate Stars: Insights from Be and sdOB Binaries",
      "authors": [
        "Zepei Xing",
        "Tassos Fragos",
        "Vicky Kalogera",
        "Seth Gossage",
        "Kyle Akira Rocha",
        "Emmanouil Zapartas"
      ],
      "abstract": "Disk-Regulated Mass Transfer Between Rotating Non-Degenerate Stars: Insights from Be and sdOB Binaries Zepei Xing, Tassos Fragos, Vicky Kalogera, Seth Gossage, Kyle Akira Rocha, Emmanouil Zapartas 16 pages, 10 figures, submitted to ApJ, comments are welcome! Solar and Stellar Astrophysics (astro-ph.SR) Mass transfer between non-degenerate stars is a fundamental but still poorly understood process in binary evolution. The commonly used rotationally limited accretion prescription in detailed binary evolution simulations that account for stellar rotation generally yields low accretion efficiencies that are difficult to reconcile with several observational constraints. We present a physically-motivated mass-accretion prescription in which accretion or decretion disks regulate the angular momentum transported to the accretor, thereby allowing for continued accretion at near-critical rotation. The accretion efficiency can be calculated from the conservation of the mass and the angular momentum of the disk. Analytical estimates show that the accretion efficiency depends on stellar rotation and mass ratio for direct impact accretion, and additionally on stellar radius and orbital separation in the disk accretion regime. The overall mass-weighted accretion efficiencies are close to the values expected near the threshold rotation rate, where the accreted specific angular momentum declines sharply. Applying this model to binary evolution simulations, we find that rotationally limited accretion systematically underestimates Be-star masses in Be+subdwarf O/B-type star (sdOB) systems, whereas the disk-star coupling model can produce more massive Be stars that are consistent with observations. The final binary component masses depend not only on accretion efficiency but also core-envelope mass ratio, which itself depends sensitively on the assumed overshooting. We find that our new disk-star coupling model with reduced overshooting yields component masses for Be+sdOB systems that are in closer agreement with observations.",
      "pdf_url": "https://arxiv.org/pdf/2602.06259.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06465",
      "title": "The Walkaway Star HP Tau/G2: Evidence for a Stellar Merger",
      "authors": [
        "Bo Reipurth",
        "J. Bally",
        "P. Friberg",
        "D.M. Faes",
        "C. Briceno",
        "M.S. Connelley",
        "C. Flores",
        "A.M. Cody",
        "H. Zinnecker"
      ],
      "abstract": "The Walkaway Star HP Tau/G2: Evidence for a Stellar Merger Bo Reipurth, J. Bally, P. Friberg, D.M. Faes, C. Briceno, M.S. Connelley, C. Flores, A.M. Cody, H. Zinnecker 38 pages, 31 figures. Accepted by The Astronomical Journal Solar and Stellar Astrophysics (astro-ph.SR) HP~Tau/G2 is a luminous, short-period, fast-rotating G-type weak-line T Tauri star with a large radius, an oblate shape with gravity-darkening, little circumstellar material, and centered in a slowly expanding cloud cavity. It is an X-ray source and a variable nonthermal radio source. It forms, together with the late-type T Tauri star KPNO 15, a pair of oppositely directed walkaway stars launched when a multiple system broke apart ~5600 yr ago. Momentum conservation indicates a mass of G2 of only ~0.7 Msun, much lower than the ~1.9 Msun determined from evolutionary models. G2 is virtually a twin of FK Com, the prototype of a class of evolved stars resulting from coalescence of W UMa binaries. We suggest that G2 became a very close and highly eccentric binary during viscous evolution in the protostellar stage and with KPNO 15 formed a triple system, which again was part of a larger unstable group including the binary G3 and the single G1. Dynamical evolution led to multiple bound ejections of KPNO 15 before it finally escaped after ~2 Myr. As a result the G2 binary recoiled and contracted 5600 yr ago, became Darwin unstable and merged in a major outburst ~2000 yr ago. The nearby compact triple system G1+G3 was also disturbed, and broke up 4900 yr ago, forming another walkaway pair. The G5 star HD 283572 has similar unusual properties, indicating that G2 is not a pathological case. G2 is now fading towards a new stable configuration. YSO mergers may be rather common and could explain some FUor eruptions.",
      "pdf_url": "https://arxiv.org/pdf/2602.06465.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06522",
      "title": "The Non-Eruptive Reconfiguration of a Quiescent Filament After a Nearby Active Region Emergence",
      "authors": [
        "James McKevitt",
        "Louise Harra",
        "Gherardo Valori",
        "Deborah Baker",
        "Nils Janitzek",
        "Stephanie Yardley",
        "Sarah Matthews",
        "Hamish Reid",
        "Alexander W. James",
        "Muriel Stiefel",
        "David H. Brooks",
        "Ryan Dewey",
        "Jim M. Raines",
        "Susan T. Lepri",
        "Liang Zhao",
        "Juan Sebastián Castellanos Durán"
      ],
      "abstract": "The Non-Eruptive Reconfiguration of a Quiescent Filament After a Nearby Active Region Emergence James McKevitt, Louise Harra, Gherardo Valori, Deborah Baker, Nils Janitzek, Stephanie Yardley, Sarah Matthews, Hamish Reid, Alexander W. James, Muriel Stiefel, David H. Brooks, Ryan Dewey, Jim M. Raines, Susan T. Lepri, Liang Zhao, Juan Sebastián Castellanos Durán Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) The unpredictability of solar filament eruptions presents major challenges for forecasting space weather, as such eruptions frequently drive coronal mass ejections (CMEs) that impact the heliosphere. While nearby flux emergence is often linked to their destabilisation, the specific characteristics of both the emerging flux and the filament that determine whether an eruption occurs remain unclear. We report observations of a quiescent filament that did not erupt following the nearby emergence of active region NOAA 13270 and a subsequent C-class flare in April 2023. Our analysis combines multi-viewpoint extreme ultraviolet (EUV) imaging and X-ray imaging with EUV spectroscopy, radio imaging and measurements of, and extrapolations from, the photospheric magnetic field. We identify the formation of a coronal null point and fan-spine topology at the interface between the active region and filament which exhibited persistent slow reconnection, indicated by chromospheric brightenings, persistent radio emission, and plasma upflows. Our results indicate that ongoing reconnection and jets can relieve magnetic stress and enable filament stability, even when under strong perturbation. We suggest that the orientation of emerging flux relative to the ambient field is a critical parameter in filament evolution, and provide observational constraints for models of filament stability and eruption.",
      "pdf_url": "https://arxiv.org/pdf/2602.06522.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06738",
      "title": "Dilution of accreted planetary matter in hot DA white dwarfs according to their mass",
      "authors": [
        "M. Deal",
        "S. Vauclair",
        "S. Charpinet",
        "G. Vauclair"
      ],
      "abstract": "Dilution of accreted planetary matter in hot DA white dwarfs according to their mass M. Deal, S. Vauclair, S. Charpinet, G. Vauclair 8 pages, 3 figures, 1 table, accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) A large proportion of observed white dwarfs (WDs) show evidence of debris disks, remnants of the former planetary systems, and/or signatures of heavy elements in their atmospheres, induced by the accretion of planetary matter onto their surfaces. The observed abundances are the result of the balance between the accretion flux and the dilution of this planetary material by internal transport processes. A recent study showed that more massive DA WDs are less polluted than smaller mass ones. It was suggested that the reason could be related to the formation of planetary systems when these stars were on the main sequence. The aim of this work is to test how internal dilution processes, including thermohaline convection, change with WD masses, and whether such an effect could account for variations in the observed pollution. We computed the efficiency of atomic diffusion and thermohaline convection after the accretion of heavy elements onto WDs using static DA models with various masses, effective temperatures, and hydrogen contents. We confirm that thermohaline convection is always more efficient in diluting accreted elements than atomic diffusion, as previously shown in the literature. However, we find that element dilution by thermohaline convection is less efficient in massive WDs than in smaller mass ones, due to their larger internal density. We showed that the differences in observed heavy element pollution in WDs according to their masses cannot be explained by the dilution induced by atomic diffusion and thermohaline mixing alone. Indeed, the pollution by planetary system accretion should be more easily detectable in massive WDs than in low-mass ones. We discuss other processes that should be taken into account before drawing any conclusion about the occurrences of planetary systems according to the mass of the star on the main sequence.",
      "pdf_url": "https://arxiv.org/pdf/2602.06738.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06889",
      "title": "Magnetohydrodynamic instabilities in stellar radiative regions. I. Linear study of shear-driven instabilities",
      "authors": [
        "V. Durepaire , L. Petitdemange , K. Belkacem , A. Guseva , L. Manchon , R. Hollerbach , F. Daniel LIRA, Observatoire de Paris, Université PSL, CNRS, Sorbonne Université, Université Paris Cité, 5 place Jules Janssen, 92195 Meudon, France Department of Fluid Mechanics, Universitat Politècnica de Catalunya, BarcelonaTech , Barcelona 08019, Spain School of Mathematics, University of Leeds, Leeds LS2 9JT, UK Center for Interdisciplinary Exploration and Research in Astrophysics , Northwestern University, Evanston, IL, USA)"
      ],
      "abstract": "Magnetohydrodynamic instabilities in stellar radiative regions. I. Linear study of shear-driven instabilities V. Durepaire (1), L. Petitdemange (1), K. Belkacem (1), A. Guseva (2 and 1), L. Manchon (1), R. Hollerbach (3), F. Daniel (4) ((1) LIRA, Observatoire de Paris, Université PSL, CNRS, Sorbonne Université, Université Paris Cité, 5 place Jules Janssen, 92195 Meudon, France (2) Department of Fluid Mechanics, Universitat Politècnica de Catalunya, BarcelonaTech (UPC), Barcelona 08019, Spain (3) School of Mathematics, University of Leeds, Leeds LS2 9JT, UK (4) Center for Interdisciplinary Exploration and Research in Astrophysics (CIERA), Northwestern University, Evanston, IL, USA) Solar and Stellar Astrophysics (astro-ph.SR) This paper is the first in a series investigating magnetohydrodynamic instabilities that may contribute to angular-momentum transport and magnetic-field evolution in stellar radiative zones. We focus on shear-driven instabilities, specifically the Goldreich-Schubert-Fricke (GSF) instability and the magnetorotational instability (MRI), which are expected to play key roles in the internal dynamics of radiative regions. We carried out a local linear stability analysis using a numerical approach that extends beyond classical limiting cases and includes stabilizing effects such as stratification and magnetic tension, allowing the exploration of realistic flow regimes. These results were validated through a global mode analysis in a Taylor-Couette configuration. We recovered the standard MRI and azimuthal MRI stability criteria and quantified the effects of stratification, magnetic tension, and diffusion on their growth. In strongly sheared regimes, we derived a new criterion for the magnetised GSF (MGSF) instability and clarified the transition from SMRI to MGSF as stratification and magnetic effects narrow the unstable domain. We also provided approximate growth-time formulae that identify the dominant instability under given stellar conditions and can be implemented in 1D stellar evolution codes. Global Taylor-Couette calculations validate the local WKB analysis. Applied to subgiants and young red giants, our results show that shear-driven instabilities can grow rapidly for magnetic fields below 100 kG. Strong axial fields (100 kG) confined to the hydrogen-burning shell suppress instabilities unless the shear is sufficiently distant. These results support incorporating our criteria and growth estimates into stellar evolution models to assess the efficiency of shear-driven transport.",
      "pdf_url": "https://arxiv.org/pdf/2602.06889.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06926",
      "title": "Towards a Fully Automated Pipeline for Short-Term Forecasting of In Situ Coronal Mass Ejection Magnetic Field Structure",
      "authors": [
        "Hannah T. Rüdisser",
        "Emma E. Davies",
        "Ute V. Amerstorfer",
        "Christian Möstl",
        "Eva Weiler",
        "Andreas J. Weiss",
        "Justin Le Louëdec",
        "Martin A. Reiss",
        "Gautier Nguyen"
      ],
      "abstract": "Towards a Fully Automated Pipeline for Short-Term Forecasting of In Situ Coronal Mass Ejection Magnetic Field Structure Hannah T. Rüdisser, Emma E. Davies, Ute V. Amerstorfer, Christian Möstl, Eva Weiler, Andreas J. Weiss, Justin Le Louëdec, Martin A. Reiss, Gautier Nguyen 29 pages, 12 figures, 3 tables, submitted to ApJ on 6th February 2026 Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) We present an automated pipeline for operational short-term forecasting of coronal mass ejection (CME) magnetic field structure at L1, coupling arrival time prediction, in situ detection, and iterative flux rope reconstruction, following near-real-time remote-sensing CME identification. The system is triggered by new entries in the CCMC DONKI database and first applies the drag-based ELEvo model to determine whether an Earth impact is expected and estimate arrival time. This estimate defines a temporal window constraining the search for CME signatures in real-time L1 in situ solar wind data, where the magnetic obstacle (MO) is automatically detected using the deep learning model ARCANE. Upon MO onset, iterative reconstructions with the semi-empirical flux rope model 3DCORE are performed, using a Monte Carlo fitting scheme, producing continuously updated forecasts of the remaining magnetic field profile. We evaluate the pipeline using 3870 archived DONKI entries and archived NOAA real-time in situ data from 2013-2025, assessing forecast performance at different stages of MO observation. For 61 events with an associated ground-truth counterpart in the ICMECAT catalog, forecasts based on initial MO data already achieve performance comparable to full-event reconstructions. Typical errors are ~5 hours in timing of magnetic field extrema and ~10 nT in field strength metrics, with limited systematic improvement as more of the event is observed. Results show substantial event variability and systematic underestimation of extrema, indicating deviations from ideal flux rope assumptions. These findings demonstrate the potential of fully autonomous real-time forecasting while highlighting limitations imposed by event complexity and model representational capacity.",
      "pdf_url": "https://arxiv.org/pdf/2602.06926.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06551",
      "title": "AB Aur, a Rosetta stone for studies of planet formation (IV): C/O estimates from CS and SO interferometric observations",
      "authors": [
        "Pablo Rivière-Marichalar",
        "Asunción Fuente",
        "Romane le Gal",
        "Roberto Neri",
        "Gisela Esplugues",
        "Dmitry Semenov",
        "Richard Teague",
        "Alejandro Santamaría Miranda"
      ],
      "abstract": "AB Aur, a Rosetta stone for studies of planet formation (IV): C/O estimates from CS and SO interferometric observations Pablo Rivière-Marichalar, Asunción Fuente, Romane le Gal, Roberto Neri, Gisela Esplugues, Dmitry Semenov, Richard Teague, Alejandro Santamaría Miranda Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Context. Protoplanetary disks are the birthplace of planets. As such, they set the initial chemical abundances available for planetary atmosphere formation. Thus, studying elemental abundances, molecular compositions, and abundance ratios in protoplanetary disks is key to linking planetary atmospheres to their formation sites. Aims. We aim to derive the sulfur abundance and the C/O ratio in the AB Aur disk using interferometric observations of CS and SO. Methods. New NOEMA observations of CS 3-2 towards AB Aur are presented. We used velocity-integrated intensity maps to determine the inclination and position angles. Keplerian masks were constructed for all observed species to assess the presence of non-Keplerian motions. We use the CS/SO ratio to study the C/O ratio. We compare our present and previous interferometric observations of AB Aur with a NAUTILUS disk model to gain insight into the S elemental abundance and C/O ratio. Results. We derive an observational CS/SO ratio ranging from 1.8 to 2.6. Only NAUTILUS models with C/O > 1 can reproduce such ratios. The comparison with models points to strong sulfur depletion, with [S/H]=8e-8, but we note that no single model can simultaneously fit all observed species.",
      "pdf_url": "https://arxiv.org/pdf/2602.06551.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13949",
      "title": "An Explicit M1 Radiation-hydrodynamics Scheme for Three-dimensional Protostellar Evolution",
      "authors": [
        "Kazutaka Kimura",
        "Kazuyuki Sugimura",
        "Takashi Hosokawa",
        "Hajime Fukushima",
        "Kazuyuki Omukai"
      ],
      "abstract": "An Explicit M1 Radiation-hydrodynamics Scheme for Three-dimensional Protostellar Evolution Kazutaka Kimura, Kazuyuki Sugimura, Takashi Hosokawa, Hajime Fukushima, Kazuyuki Omukai 29 pages, 8 figures, 1 table, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) We present a radiation-hydrodynamics (RHD) scheme that enables three-dimensional simulations resolving both protostellar interiors and their surrounding accretion flows within a single framework, to clarify how a protostar evolves while interacting with the accretion flow. The method builds on an explicit two-moment M1 closure scheme with a reduced speed of light approximation (RSLA) for massively parallel computation. Our scheme introduces a complementary non-RSLA radiation component that dominates in optically thick regions. This hybrid treatment restores physical energy conservation inside protostars, which would otherwise be violated under the RSLA, while retaining the advantage of large time steps. To overcome the limitation of the conventional M1 closure in solving radiative transfer in extremely optically thick regions inside protostars and across steep optical-depth gradients near their surfaces, we incorporate the optical-depth information of neighboring cells into the radiative transfer calculation. We further evolve photon number densities in addition to radiation energy densities to reconstruct an effective local spectrum on the fly without resorting to costly multi-frequency transport. We implement this scheme in the adaptive mesh refinement code SFUMATO and verify its validity through a series of test calculations. As an application, we follow the early evolution of a massive protostar formed at high redshift, within a full cosmological context. The results reveal a continuous structure connecting the swollen protostar and its surrounding disk, which cannot be captured in conventional one-dimensional models. This RHD scheme opens a path to studies of protostellar evolution and its interaction with the accretion flow in realistic three-dimensional environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.13949.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.08214",
      "title": "The Birth of Be Star Disks II. A High-Resolution Spectroscopic Campaign and TESS Observations of an Outburst of the Classical Be star λ Pavonis",
      "authors": [
        "Sola S. Nova",
        "Noel D. Richardson",
        "Jonathan Labadie-Bartz",
        "Samantha Garcia Flores"
      ],
      "abstract": "The Birth of Be Star Disks II. A High-Resolution Spectroscopic Campaign and TESS Observations of an Outburst of the Classical Be star λ Pavonis Sola S. Nova, Noel D. Richardson, Jonathan Labadie-Bartz, Samantha Garcia Flores Solar and Stellar Astrophysics (astro-ph.SR) Be stars are rapidly-rotating B stars that have shown emission lines originating in a circumstellar disk. The mechanisms that lead to disk formation and dissipation are not known although progress has been made with some systems. We present a study of a disk outburst of the Be star lambda Pavonis. Our dataset comprises 698 high-resolution spectra contemporaneous with TESS photometry in 2023. Near the end of TESS monitoring, the star began disk building from a pristine diskless state. We find the disk built within 5 days in optical H I and He I lines, while the disk circularized in about 12 days. The disk began to decay in higher excitation He I first, then lower excitation transitions, with the decay ending last for H-alpha. We examine non-radial pulsations both through TESS photometry and the line profile variations (LPVs) in the spectroscopy. Our analysis indicates that two periodicities seen in TESS photometry (at 1.644 and 1.485 cycles/d) are not seen in the spectral lines before, during, or after the outburst. The strongest photometric signal is a periodicity at 0.163 cycles/d, which appears as a difference between the two weaker signals and is visible in the spectra without any apparent changes in amplitude or phase. We additionally find evidence for fast non-photometric pulsational variations over the course of spectroscopy obtained before, during, and after the outburst. These fast LPVs are strong, and interfere with the two weaker signals, hampering our ability to detect them in spectroscopy.",
      "pdf_url": "https://arxiv.org/pdf/2512.08214.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17364",
      "title": "Quantifying sunspot group nesting with density-based unsupervised clustering",
      "authors": [
        "Nurdan Karapinar",
        "Emre Isik",
        "Natalie A. Krivova",
        "Hakan V. Senavci"
      ],
      "abstract": "Quantifying sunspot group nesting with density-based unsupervised clustering Nurdan Karapinar, Emre Isik, Natalie A. Krivova, Hakan V. Senavci Revised version resubmitted to Solar Physics (§3.4.1, 3.4.2, 3.5 new) Solar and Stellar Astrophysics (astro-ph.SR) Sunspot groups often emerge in spatial-temporal clusters, known as nests or complexes of activity. Quantifying how frequently such nesting occurs is important for understanding the organisation and recurrence of solar magnetic fields. We introduce an automated approach based on kernel density estimation and DBSCAN clustering to identify nests in the longitude-time domain and to measure the fraction of sunspot groups that belong to them. The method combines a smooth representation of emergence patterns with a density-based clustering procedure, validated using synthetic solar-like cycles and corrected for variations in data density. We apply this method to 151 years of sunspot-group observations from the Royal Greenwich Observatory Photoheliographic Results (RGO, 1874-1976) and Kislovodsk Mountain Astronomical Station (KMAS, 1955-2025) catalogues. Across all cycles and latitude bands, the mean nesting degree is $\\langle D\\rangle = 0.61 \\pm 0.12$, implying that about 60 percent all sunspot groups emerge within nests. Nesting is strongest at mid-latitudes (10$^\\circ$-20$^\\circ$), and results from the two independent datasets agree in the period of overlap. The nesting degree significantly correlates with the solar activity level, with the correlation strengthening when small groups are excluded. The characteristic inter-nest spacing contracts from $\\sim$200-500~Mm at low activity to $\\sim$60-100~Mm at solar maximum, approaching typical sunspot-group dimensions. The identified nests range from compact clusters to long-lived, drifting structures, offering new quantitative constraints on the persistence and organisation of solar magnetic activity.",
      "pdf_url": "https://arxiv.org/pdf/2512.17364.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.00962",
      "title": "A comprehensive study of the relations between the properties of planetary systems and the chemical compositions of their host stars",
      "authors": [
        "Luan Ghezzi , Ellen Costa-Almeida , Verónica Loaiza-Tacuri , Katia Cunha Universidade Federal do Rio de Janeiro - Observatório do Valongo, Observatório Nacional, Departamento de Física - Universidade Federal de Sergipe, Steward Observatory)"
      ],
      "abstract": "A comprehensive study of the relations between the properties of planetary systems and the chemical compositions of their host stars Luan Ghezzi (1 and 2), Ellen Costa-Almeida (2), Verónica Loaiza-Tacuri (3), Katia Cunha (4 and 2) ((1) Universidade Federal do Rio de Janeiro - Observatório do Valongo, (2) Observatório Nacional, (3) Departamento de Física - Universidade Federal de Sergipe, (4) Steward Observatory) Accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) The giant planet-metallicity correlation revealed that planetary formation depends on the stellar properties. There is growing evidence that it is also valid for smaller hot planets, but it is not clear whether elements other than iron also influence the properties of planetary systems. To investigate this, we determined the abundances of 13 chemical elements (Na, Mg, Al, Si, Ca, Sc, Ti, V, Cr, Mn, Co, Ni and Cu) for a sample of 561 Kepler exoplanet-hosting stars using high-resolution Keck/HIRES spectra. We find that stars in systems having only large or hot planets are enriched in some elements relative to those having only small or warm planets, respectively, with this signature being related to the underlying stellar metallicity. This Kepler sample is composed of stars belonging to the Galactic low- and high-$\\alpha$ sequences, corresponding to the chemical thin and thick disks. Our results reveal that stars enhanced in $\\alpha$-elements may facilitate the formation of large planets in metal-poor environments although the iron abundance is still a limiting factor. We also investigated chemical abundances as a function of elemental condensation temperatures and found that there is a diversity of slopes regardless of the exoplanetary systems hosted by the star. We confirmed that the Sun is depleted in refractory elements relative to the solar twins in our sample, all of which host a diversity of exoplanets, suggesting that this depletion is caused by processes not related to planet formation.",
      "pdf_url": "https://arxiv.org/pdf/2601.00962.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.05658",
      "title": "On the stability of viscous Riemann ellipsoids",
      "authors": [
        "Joris Labarbe"
      ],
      "abstract": "On the stability of viscous Riemann ellipsoids Joris Labarbe Fluid Dynamics (physics.flu-dyn); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) The present study investigates the linear stability of Riemann ellipsoids in both the inviscid limit and in the presence of weak viscosity. In the inviscid regime, we derive a generalised Poincare equation governing small fluid oscillations and construct a family of polynomial solutions that extends the classical results of Cartan to flows with a uniform strain field. This formulation provides an analytic dispersion relation for three-dimensional ellipsoidal disturbances and remains computationally efficient at arbitrary harmonic degree, in contrast to the virial tensor method or to short-wavelength (WKB) approximations. The viscous effects are incorporated through a boundary-layer analysis based on Prandtls theory, leading to first-order viscous corrections to the inviscid spectrum and allowing a systematic investigation of viscosity-driven instabilities. Stability diagrams are presented over the space of admissible Riemann ellipsoids, illustrating the roles of rotation, internal strain, and diffusion, with implications for rotating shear flows in geophysical and astrophysical contexts.",
      "pdf_url": "https://arxiv.org/pdf/2602.05658.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06492",
      "title": "A Demonstration of a Neural Network as a Bridge Between Galaxy Simulations and Surveys",
      "authors": [
        "E. Elson"
      ],
      "abstract": "A Demonstration of a Neural Network as a Bridge Between Galaxy Simulations and Surveys E. Elson Instrumentation and Methods for Astrophysics (astro-ph.IM); Computational Physics (physics.comp-ph) This paper demonstrates that the stellar masses of galaxies in the Galaxy and Mass Assembly (GAMA) survey, originally derived via stellar population synthesis modelling, can be accurately predicted using only their absolute magnitudes and colour indices. A central contribution of this work is the demonstration that this long-standing inference problem can be solved using an exceptionally simple machine-learning model: a fully connected, feed-forward artificial neural network with a single hidden layer. The network is trained exclusively on synthetic galaxies generated by the SHARK semi-analytic model and is shown to transfer effectively to real observations. Across nearly 3.5 dex in stellar mass, the predicted values closely track the GAMA SED-derived masses, with a typical scatter of ~0.131 dex. These results demonstrate that complex deep-learning architectures are not a prerequisite for robust stellar mass estimation, and that simulation-trained, lightweight machine-learning models can capture the dominant physical information encoded in broad-band photometry. The method is further applied to 17,006 GAMA galaxies lacking SED-derived masses, with photometric uncertainties propagated through the network to provide corresponding error estimates on the inferred stellar masses. Overall, this work establishes a computationally efficient and conceptually transparent pathway for simulation-to-observation transfer learning in galaxy evolution studies.",
      "pdf_url": "https://arxiv.org/pdf/2602.06492.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06537",
      "title": "Joint optical-digital design strategy for adaptive optics systems: application to wavelength selection for satellite imaging",
      "authors": [
        "Florian Cheyssial",
        "Laurent Mugnier",
        "Cyril Petit"
      ],
      "abstract": "Joint optical-digital design strategy for adaptive optics systems: application to wavelength selection for satellite imaging Florian Cheyssial, Laurent Mugnier, Cyril Petit Optics Express, 2026, 34 (3), pp.4895 Instrumentation and Methods for Astrophysics (astro-ph.IM); Optics (physics.optics) Adaptive optics can be used to mitigate the effects of atmospheric turbulence on imaging systems, but the correction is only partial, and deconvolution is often required to improve the resolution. This results in entire optical/digital systems, which are traditionally designed sequentially, i.e. , the adaptive optics system is optimised first, and the restoration algorithms are designed a second time. Studies on optical/digital systems have shown that jointly optimizing the whole system is a better alternative. We propose to extend these co-design strategies to the design of an adaptive optics-assisted imaging system. We derive a simple criterion that takes into account the source properties and the entire optical/ digital system performance. To illustrate its interest, we use it to optimize the wavelength distribution between the wavefront sensor and the imaging camera. In addition, we explore the potential of using multiple imaging channels operating at different wavelengths as a means of making an imaging system robust to turbulence strength and source magnitude variations. Later, any parameter of the optical/digital system, if not the entire system itself, could be optimized this way.",
      "pdf_url": "https://arxiv.org/pdf/2602.06537.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06564",
      "title": "SF2A Environmental Transition Commission: Summary of the 2025 workshop",
      "authors": [
        "Faustine Cantalloube",
        "Jack Berat",
        "Naïs Fargette",
        "Pierre Larue",
        "N. Pourré",
        "Sarah E Anderson",
        "Julien Milli",
        "Jean-François Gonzalez",
        "Olivier Berné",
        "Didier Barret",
        "Angèle Mouinié",
        "Clarisse Picard",
        "Karine Dassas",
        "Jürgen Knödlseder",
        "David Redon"
      ],
      "abstract": "SF2A Environmental Transition Commission: Summary of the 2025 workshop Faustine Cantalloube (IPAG), Jack Berat (LPENS), Naïs Fargette (IRAP), Pierre Larue (IPAG), N. Pourré (IPAG), Sarah E Anderson (LAM), Julien Milli (IPAG), Jean-François Gonzalez (CRAL), Olivier Berné (IRAP), Didier Barret (IRAP, CESR, UT3, OMP), Angèle Mouinié (IRAP), Clarisse Picard, Karine Dassas (CESBIO), Jürgen Knödlseder (IRAP), David Redon Journ{\\'e}es annuelles de la Soci{\\'e}t{\\'e} Fran{\\c c}aise d'Astronomie et d'Astrophysique, SF2A, Jul 2026, Toulouse, France. pp.361-365 Instrumentation and Methods for Astrophysics (astro-ph.IM) During its annual conference in 2025, the French Society of Astronomy \\& Astrophysics (SF2A) hosted, for the fifth time, a special session dedicated to discussing the environmental transition within the French A\\&A research community. During the 2025 workshop, the goal was to review four contemporary topics within the context of environmental transition actions and discussions: (1) institutional actions, (2) the early-career researchers singularity, (3) research infrastructures and tools, and (4) the geopolitical conditions under which A\\&A research remains possible. The workshop concluded with a round-table discussion that brought together the various speakers so that every participant could express their ideas.",
      "pdf_url": "https://arxiv.org/pdf/2602.06564.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06688",
      "title": "Introducing a new generation Adaptive Optics simulation framework: from PASSATA to SPECULA",
      "authors": [
        "Fabio Rossi",
        "Alfio Puglisi",
        "Guido Agapito"
      ],
      "abstract": "Introducing a new generation Adaptive Optics simulation framework: from PASSATA to SPECULA Fabio Rossi, Alfio Puglisi, Guido Agapito Journal of Astronomical Telescopes, Instruments, and Systems, Vol. 12, Issue 1, 019001 (January 2026) Instrumentation and Methods for Astrophysics (astro-ph.IM) Numerical end-to-end simulation in Adaptive Optics (AO) is a key tool in the development of complex systems, from the initial design to the commissioning phase. Based on our previous experience with PASSATA, we decided to develop a new AO simulation framework in Python language, naming it SPECULA (short for: Scalable Parallel Execution of Computations Upscaling Large Adaptive optics simulations). Following an object-oriented approach, the physical entities are modeled as processing objects connected to each other to exchange data objects. A simulation is run by providing its description instead of writing and executing a specific script. The Python language and its library flexibility allowed us to write one single code that can be run on CPU and GPU platforms. We put a strong focus on computational efficiency, relying on CuPy and its interface to access the CUDA-stream mechanism. Moreover, SPECULA is capable of distributed computations over multiple processing nodes, making it suitable to run in an HPC environment, as tested on the Italian supercomputer Leonardo. SPECULA can also be used in laboratory environment to implement a hybrid simulation, allowing us to interface simulated and concrete objects: this feature was demonstrated in the Adaptive Optics laboratories at Arcetri Observatory. In this paper, we describe the main characteristics of SPECULA, show some relevant examples of its use, and finally draw our goals for the future.",
      "pdf_url": "https://arxiv.org/pdf/2602.06688.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06878",
      "title": "Antenna for the detection of electromagnetic audio-band disturbances on-board LISA",
      "authors": [
        "D. Serrano , A. Pérez-Ortega , D. Roma-Dollase , J. Salvans-Tort , J. Ho-Zhang , J. Ramos-Castro , M. Nofrarias Institut de Ciències de l'Espai, Institut d'Estudis Espacials de Catalunya, Departament d'Enginyeria Electrònica, Universitat Politècnica de Catalunya)"
      ],
      "abstract": "Antenna for the detection of electromagnetic audio-band disturbances on-board LISA D. Serrano (1 and 2), A. Pérez-Ortega (1 and 2), D. Roma-Dollase (1 and 2), J. Salvans-Tort (1 and 2), J. Ho-Zhang (1 and 2), J. Ramos-Castro (2 and 3), M. Nofrarias (1 and 2) ((1) Institut de Ciències de l'Espai, (2) Institut d'Estudis Espacials de Catalunya, (3) Departament d'Enginyeria Electrònica, Universitat Politècnica de Catalunya) Class. Quantum Grav. 42 (2025) 245006 Instrumentation and Methods for Astrophysics (astro-ph.IM) The LISA mission will be the first observatory to detect gravitational waves from space within the millihertz frequency band. Magnetic forces have an important impact on the instrument's sensitivity below the millihertz. Hence, monitoring the magnetic environment within each of the LISA spacecrafts is of utmost importance. In this Letter we present the characterization of the coils that were used in LISA Pathfinder (LPF) when operating as magnetic sensors in the audio frequency band. The necessity of implementing this type of magnetometer is presented in order to monitor high frequency magnetic signals from the electronics on-board. We show that the LPF coils have a performance one order of magnitude better than the current requirements set by the LISA mission at the low end of the audio-band frequency. The LPF coils are able to measure a magnetic noise level of 1.45 $\\rm pT/\\sqrt{\\rm{Hz}}$ at 50 Hz and 0.17 $\\rm pT/\\sqrt{\\rm{Hz}}$ at 500 Hz. Additionally, the LPF coils can reach a magnetic noise floor of 0.1 $\\rm pT/\\sqrt{\\rm{Hz}}$ at frequencies above 1 kHz.",
      "pdf_url": "https://arxiv.org/pdf/2602.06878.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.06314",
      "title": "Simulated LSST Observations of Real Metre-scale Impactors",
      "authors": [
        "Michael Frazer",
        "Hadrien Devillepoix",
        "Sophie Deam"
      ],
      "abstract": "Simulated LSST Observations of Real Metre-scale Impactors Michael Frazer, Hadrien Devillepoix, Sophie Deam 14 pages, 6 figures, Submitted to PASA. Comments welcome! Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Using real metre-sized asteroid Earth impactors from the last decade, we ask the question: ``If the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) had been operating over the last 10 years, how many imminent impactors would it have observed and discovered pre-impact?'' We feed 216 large impacts detected by global coverage orbital sensors through the LSST Solar System Survey Simulator Sorcha, and find that it would have made 99 observations of 28 unique objects, and discovered one object four days pre-impact. Recently proposed pipeline modifications would increase this discovery number to seven. Scaling our results to take into account the biases of our reference population, we estimate that LSST will discover 12 +/- 3 imminent impactors over its nominal 10 year survey, with an average warning time of 3.5 days. While this is at the low end of previous estimates of 1 - 10 discoveries per year, the significant increase in warning time compared to the current average (9 hours across 11 impactors) will bring significant opportunities for follow-up telescopic observations, deployment of specialised equipment for fireball observations, and planetary defence operations. We also show that the LSST will provide substantial precovery data for impactors discovered by other surveys, instantly lengthening observation arcs and thereby reducing the orbital and impact location uncertainties. In some cases, these observations may also enable the linkage of telescopic observations with observed fireballs post-impact, providing valuable pre-impact astrometric and photometric data. This has significant implications for both asteroid research and planetary defence.",
      "pdf_url": "https://arxiv.org/pdf/2602.06314.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06722",
      "title": "The effect of JWST/NIRSpec data reduction on the retrieval of WASP-39b atmospheric properties",
      "authors": [
        "J. Roy-Perez",
        "S. Pérez-Hoyos",
        "N. Barrado-Izagirre",
        "H. Chen-Chen"
      ],
      "abstract": "The effect of JWST/NIRSpec data reduction on the retrieval of WASP-39b atmospheric properties J. Roy-Perez, S. Pérez-Hoyos, N. Barrado-Izagirre, H. Chen-Chen Accepted for publication in A&A, 18 pages, 14 images Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The JWST provides exoplanet transit observations with unprecedented spectral coverage, enabling detailed atmospheric characterisation. However, systematics introduced during data reduction can lead to small but significant uncertainties that propagate into atmospheric retrievals, making it essential to assess their impact on inferred properties. We aim to quantify the impact of different JWST/NIRSpec PRISM data-reduction processes as well as the relevance of saturation on the retrieved atmospheric properties of WASP-39b. We also assess whether or not these biases are comparable to those introduced by assumptions made in atmospheric modelling, particularly in the treatment of aerosol extinction. We perform nested-sampling Bayesian retrievals using MultiNest and forward models generated with the Planetary Spectrum Generator. Six independently reduced spectra are analysed, considering both the full wavelength range and versions excluding the saturated region. We further test the effect of including three different cloud-opacity parameterisations. Differences among JWST/NIRSpec data-reduction pipelines lead to substantial variations in retrieved atmospheric properties of WASP-39b, often exceeding one order of magnitude, comparable to uncertainties from modelling assumptions. Excluding the saturated region reduces inter-pipeline dispersion but increases parameter degeneracies. This highlights the need for robust and homogeneous calibration strategies. The results also confirm that JWST data possess the sensitivity required to probe aerosol spectral behaviour, although such constraints remain strongly dependent on the adopted data-reduction strategy.",
      "pdf_url": "https://arxiv.org/pdf/2602.06722.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06890",
      "title": "Astrometric follow-up of near-Earth asteroid 2024 YR4 during a Torino scale level 3 alert",
      "authors": [
        "Marco Micheli",
        "Maxime Devogèle",
        "Larry Denneau",
        "Eileen V. Ryan",
        "William H. Ryan",
        "Petr Pravec",
        "Kamil Hornoch",
        "Hana Kučáková",
        "Petr Fatka",
        "Melissa J. Brucker",
        "Cassandra Lejoly",
        "Nicholas Moskovitz",
        "Mikael Granvik",
        "Zuri Gray",
        "Grigori Fedorets",
        "Anlaug Amanda Djupvik",
        "Carson Fuls",
        "David Rankin",
        "Kacper Wierzchoś",
        "Bill Gray",
        "Tim Lister",
        "Richard J. Wainscoat",
        "Robert Weryk",
        "Olivier R. Hainaut",
        "Federica Spoto",
        "Peter Veres",
        "Andrew S. Rivkin",
        "Bryan J. Holler",
        "Artem Y. Burdanov",
        "Julien de Wit",
        "Davide Farnocchia",
        "Regina Rudawska",
        "Eduardo Alonso Peleato",
        "Francisco Ocaña",
        "John Tonry",
        "Jeroen Audenaert",
        "Laura Faggioli",
        "Francesco Gianotto",
        "Marco Fenucci",
        "Luca Conversi",
        "Richard Moissl"
      ],
      "abstract": "Astrometric follow-up of near-Earth asteroid 2024 YR4 during a Torino scale level 3 alert Marco Micheli, Maxime Devogèle, Larry Denneau, Eileen V. Ryan, William H. Ryan, Petr Pravec, Kamil Hornoch, Hana Kučáková, Petr Fatka, Melissa J. Brucker, Cassandra Lejoly, Nicholas Moskovitz, Mikael Granvik, Zuri Gray, Grigori Fedorets, Anlaug Amanda Djupvik, Carson Fuls, David Rankin, Kacper Wierzchoś, Bill Gray, Tim Lister, Richard J. Wainscoat, Robert Weryk, Olivier R. Hainaut, Federica Spoto, Peter Veres, Andrew S. Rivkin, Bryan J. Holler, Artem Y. Burdanov, Julien de Wit, Davide Farnocchia, Regina Rudawska, Eduardo Alonso Peleato, Francisco Ocaña, John Tonry, Jeroen Audenaert, Laura Faggioli, Francesco Gianotto, Marco Fenucci, Luca Conversi, Richard Moissl Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The discovery of 2024 YR4 presented the planetary defense community with the most significant impact threat in almost two decades, reaching level 3 on the Torino scale. The community, now mature and well-organized, responded with a global observational effort. Astrometric measurements, forming the basis for orbital refinement and impact prediction, were a central component of this response. In this paper, we present the astrometric data collected by the international community, from the time of discovery until the object became too faint for all existing observational assets, including JWST. We also discuss the coordination role played by the International Asteroid Warning Network, and the importance of publicly available image archives to enable precovery searches.",
      "pdf_url": "https://arxiv.org/pdf/2602.06890.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22382",
      "title": "The Simons Observatory: Characterization of the 220/280 GHz TES Detector Modules",
      "authors": [
        "Daniel Dutcher",
        "Peter Dow",
        "Shannon M. Duff",
        "Shawn W. Henderson",
        "Johannes Hubmayr",
        "Bradley R. Johnson",
        "Michael J. Link",
        "Tammy J. Lucas",
        "Michael D. Niemack",
        "Yudai Seino",
        "Rita F. Sonka",
        "Suzanne Staggs",
        "Yuhan Wang",
        "Kaiwen Zheng"
      ],
      "abstract": "The Simons Observatory: Characterization of the 220/280 GHz TES Detector Modules Daniel Dutcher, Peter Dow, Shannon M. Duff, Shawn W. Henderson, Johannes Hubmayr, Bradley R. Johnson, Michael J. Link, Tammy J. Lucas, Michael D. Niemack, Yudai Seino, Rita F. Sonka, Suzanne Staggs, Yuhan Wang, Kaiwen Zheng 6 pages, 7 figures. Proceedings of the 21st International Conference on Low Temperature Detectors (LTD2025). Accepted version Instrumentation and Methods for Astrophysics (astro-ph.IM) The Simons Observatory (SO) is a new suite of cosmic microwave background telescopes in the Chilean Atacama Desert with an extensive science program spanning cosmology, Galactic and extragalactic astrophysics, and particle physics. SO will survey the millimeter-wave sky over a wide range of angular scales using six spectral bands across three types of dichroic, polarization-sensitive transition-edge sensor (TES) detector modules: Low-Frequency (LF) modules with bandpasses centered near 30 and 40 GHz, Mid-Frequency (MF) modules near 90 and 150 GHz, and Ultra-High-Frequency (UHF) modules near 220 and 280 GHz. Twenty-five UHF detector modules, each containing 1720 optically-coupled TESs connected to microwave SQUID multiplexing readout, have now been produced. This work summarizes the pre-deployment characterization of these detector modules in laboratory cryostats. Across all UHF modules, we find an average operable TES yield of 83%, equating to over 36,000 devices tested. The distributions of (220, 280) GHz saturation powers have medians of (24, 26) pW, near the centers of their target ranges. For both bands, the median optical efficiency is 0.6, the median effective time constant is 0.4 ms, and the median dark noise-equivalent power (NEP) is ~40 aW/rtHz. The expected photon NEPs at (220, 280) GHz are (64, 99) aW/rtHz, indicating these detectors will achieve background-limited performance on the sky. Thirty-nine UHF and MF detector modules are currently operating in fielded SO instruments, which are transitioning from the commissioning stage to full science observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.22382.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05935",
      "title": "Transformation of orientation and rotation angles of synchronous satellites: Application to the Galilean moons",
      "authors": [
        "Marie Yseboodt",
        "Rose-Marie Baland"
      ],
      "abstract": "Transformation of orientation and rotation angles of synchronous satellites: Application to the Galilean moons Marie Yseboodt, Rose-Marie Baland Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The orientation and rotation of a synchronous satellite can be referred to both its Laplace plane and the ICRF equatorial plane, in terms of Euler angles or spin axis Cartesian coordinates and Earth equatorial coordinates, respectively. We computed second-order analytical expressions to make the transformation between the two systems and applied them to the Galilean satellites (Io, Europa, Ganymede, and Callisto). If one term of the spin axis Cartesian coordinates series is dominant, trigonometric series can be generated for the inertial and orbital obliquities, node longitude and offset with respect to the Cassini plane. Since the transformation does not require any fit of amplitudes and frequencies on numerical series, the physical meaning of the frequencies is preserved from the input series and the amplitudes can be directly related to the geophysical parameters of interest. We provide tables for the coordinates and angles' series assuming that the satellites are entirely solid, and considering two different orbital theories. The possible amplitude ranges for the main terms are also examined in the case where a liquid layer is assumed in the interior model. We use our transformation method to propose an updated IAU WG solution which would result in an improvement with respect to zero obliquity models used so far. This method will also be useful for the interpretation of future Earth-based radar observations or JUICE data.",
      "pdf_url": "https://arxiv.org/pdf/2512.05935.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06126",
      "title": "Satellites and small bodies with ALMA: Insights into Solar System formation & evolution",
      "authors": [
        "Katherine de Kleer",
        "Michael E. Brown",
        "Martin Cordiner",
        "Richard Teague"
      ],
      "abstract": "Satellites and small bodies with ALMA: Insights into Solar System formation & evolution Katherine de Kleer, Michael E. Brown, Martin Cordiner, Richard Teague AGU Advances, Volume 6, Issue 6, id.e2025AV001778, 9 pp (2025) Earth and Planetary Astrophysics (astro-ph.EP) Our understanding of the formation and evolution of planetary systems has made major advances in the past decade. This progress has been driven in large part by the Atacama Large Millimeter/submillimeter Array (ALMA), which has given us an unprecedented view of Solar System bodies themselves, and of the structure and chemistry of forming exoplanetary systems. Within our own Solar System, ALMA has enabled the detection of new molecules and isotopologues across moons and comets, as well as placing new constraints on the compositions and histories of small bodies through thermal emission observations. In this article, we highlight some key areas where ALMA has contributed to a deeper understanding of our Solar System's formation and evolution, and place these discoveries in the context of our evolving understanding of protoplanetary disks.",
      "pdf_url": "https://arxiv.org/pdf/2602.06126.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06403",
      "title": "Reversal of Spin: Comet 41P/Tuttle-Giacobini-Kresak",
      "authors": [
        "David Jewitt"
      ],
      "abstract": "Reversal of Spin: Comet 41P/Tuttle-Giacobini-Kresak David Jewitt Earth and Planetary Astrophysics (astro-ph.EP) The rotations of cometary nuclei are known to change in response to outgassing torques. The nucleus of comet 41P/Tuttle-Giacobini-Kresak exhibited particularly dramatic rotational changes when near perihelion in 2017 April. Here, we use archival Hubble Space Telescope observations from 2017 December to study the post-perihelion lightcurve of the nucleus and to assess the nucleus size. From both Hubble photometry and non-gravitational acceleration measurements we find a diminutive nucleus with effective radius r = 500+/-100 m. Systematic optical variations are consistent with a two-peaked (i.e., rotationally symmetric) lightcurve with period 0.60+/-0.01 days, substantially different from periods measured earlier in 2017. The spin of the nucleus likely reversed between perihelion in 2017 April and December as a result of the strong outgassing torque. We infer a dimensionless moment arm k = 0.013, about twice the median value in short-period comets. The lightcurve range of 0.4 magnitudes indicates a projected nucleus axis ratio greater than 1.4:1, while the active fraction of the nucleus decreased from 2.4 in 2001 (suggesting augmentation of the gas production by sublimating coma ice grains) to 0.14 in 2017, a result of long-term modification of the surface. We find that the physical lifetime of this small nucleus to spin-up is short compared to the reported 1500 year dynamical time spent in the current orbit. Two limiting reconciliations of this inequality are suggested. The nucleus could be in a state of unusually strong activity, leading us to over-estimate the average mass loss rate and outgassing torque and so to under-estimate the physical lifetime. Alternatively, the nucleus could be the surviving remnant of a once larger body for which outgassing torques were less effective in changing the spin.",
      "pdf_url": "https://arxiv.org/pdf/2602.06403.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.05300",
      "title": "Sulfur Enrichment in Close-in Exoplanet Atmospheres Induced by Pebble Drift across the Salt Line",
      "authors": [
        "Kanon Nakazawa",
        "Kazumasa Ohno"
      ],
      "abstract": "Sulfur Enrichment in Close-in Exoplanet Atmospheres Induced by Pebble Drift across the Salt Line Kanon Nakazawa, Kazumasa Ohno Accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP) Observations of JWST have revealed that several close-in exoplanets have sulfur-rich atmospheres through SO$_2$ detections. Atmospheric sulfur is often thought to originate from solid accretion during planet formation, whereas recent simultaneous detections of SO$_2$ and NH$_3$ challenge this conventional scenario. In this study, we propose that ammonium salts, such as NH$_4$SH tentatively detected in comets and molecular clouds, play a significant role in producing sulfur-rich disk gases, which serve as the ingredient of giant planet atmospheres. We simulated the radial transport of dust containing volatile ices and ammonium salts, along with the dissociation, sublimation, and recondensation of these materials, thereby predicting the atmospheric chemical structures and transmission spectra of planets inheriting these compositions. Assuming that ammonium salts sequester 20% of the elemental nitrogen and sulfur budgets, our results reveal that they enhance sulfur and nitrogen abundances in disk gases to 2-10 times the solar values near the salt dissociation line. Photochemical simulations demonstrate that SO$_2$, NS, H$_2$S, NO, and NH$_3$ become the dominant N and S chemical species in the atmospheres on planets that inherited the gas compositions inside H$_2$O snowline. SO$_2$ features clearly appear in the infrared transmission spectra when the salt-bearing grains enhance the sulfur abundance of disk gas by pebble drift. Our model provides a novel scenario that explains the SO$_2$ detected in some exoplanet atmospheres solely from disk gas accretion. Volatile-element ratios, particularly N/S and C/O, would provide a key to disentangle our scenario from the conventional solid-accretion scenario.",
      "pdf_url": "https://arxiv.org/pdf/2602.05300.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}