{
  "date": "2025-11-18",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.IM",
    "astro-ph.SR",
    "astro-ph.HE",
    "astro-ph.CO",
    "astro-ph.GA"
  ],
  "total_papers": 102,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.10996",
      "title": "Accuracy and Applicability of the Hartle-Thorne and Komatsu-Eriguchi-Hachisu Methods for Modeling Rotating Neutron Stars",
      "authors": [
        "Hyukjin Kwon",
        "Kenta Yoshimura",
        "Tsuyoshi Miyatsu",
        "Kazuyuki Sekizawa",
        "Myung-Ki Cheoun"
      ],
      "abstract": "Accuracy and Applicability of the Hartle-Thorne and Komatsu-Eriguchi-Hachisu Methods for Modeling Rotating Neutron Stars Hyukjin Kwon, Kenta Yoshimura, Tsuyoshi Miyatsu, Kazuyuki Sekizawa, Myung-Ki Cheoun High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th) Neutron stars, which are composed of extremely dense nuclear matter, serve as natural laboratories to study nuclear interactions beyond the terrestrial experiments. Recent researches have actively explored how the equation of state (EoS) can be constrained by observed neutron star masses and radii, and how nuclear interactions affect their macroscopic properties. Most of these studies, however, rely on the Tolman-Oppenheimer-Volkoff (TOV) equations, which assumed static, spherically symmetric neutron stars. Since neutron stars are rotating objects and thus axisymmetrically deformed, the TOV calculation may be insufficient to capture their realistic structure. In this work, we investigate the influence of nuclear matter properties on the physical quantities of rotating neutron stars using two approaches: the perturbative Hartle-Thorne (HT) method and fully general relativistic Komatsu-Eriguchi-Hachisu (KEH) method. For nuclear EoS parameter sets, we emamine the OMEG series, in which the slope of the symmetry energy $L$ is systematically varied. We find that rotational effects lead to a noticeable increase in the stellar radius, which depends sensitively on values of $L$. Additionally, focusing on the rotational deformation, we show that the results obtained by these two methods deviate each other even for the slowly rotating case such as $\\Omega=200$ Hz. These results reveal that, for detailed discussions on the internal structure and stability of rotating neutron stars, the fully general relativistic method such as KEH is indispensable.",
      "pdf_url": "https://arxiv.org/pdf/2511.10996.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11339",
      "title": "Recalibrating Inflation: Insights from Starobinsky Gravity",
      "authors": [
        "Davood Momeni"
      ],
      "abstract": "Recalibrating Inflation: Insights from Starobinsky Gravity Davood Momeni letter, 5 pages, comments/suggestions/citations are welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Recent analyses of low-redshift supernova and Cepheid data reveal localized shifts in the distance modulus, often interpreted as calibration anomalies or hints of new physics. We propose that these features may emerge naturally from environment-dependent modifications to gravity. In particular, we examine the Starobinsky \\(f(R) = R + \\lambda R^2\\) model, which introduces a scalar degree of freedom that couples to ambient matter density and alters photon propagation in underdense regions. We derive the corresponding corrections to luminosity distance and show that they can reproduce the observed magnitude shifts without invoking discontinuities or empirical step functions. Statistical comparisons using AIC and BIC favor the Starobinsky framework over phenomenological models, supporting its role as a minimal, geometric explanation for emergent calibration transitions.",
      "pdf_url": "https://arxiv.org/pdf/2511.11339.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11534",
      "title": "Mutated Hilltop Inflation in the Era of Present and Future CMB Experiments",
      "authors": [
        "Barun Kumar Pal"
      ],
      "abstract": "Mutated Hilltop Inflation in the Era of Present and Future CMB Experiments Barun Kumar Pal Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) In this article we confront both large-field and small-field sectors of mutated hilltop inflation model with the recent observational results. We begin with confrontation of predictions from mutated hilltop inflation with the joint analysis of Planck-2018 and BICEP/Keck-2018 data. Subsequently, we extend our analysis by incorporating the ACT-DR6 data in combination with Planck-2018, BICEP/Keck-2018, and DESI-Y1 observations. In both cases, the predictions of mutated hilltop inflation show good consistency with the observational constraints. We have also forecasted the constraints on mutated hilltop inflation model from upcoming CMB experiments, LiteBIRD and Simons Observatory along with their combinations. Here also we find that the prediction from mutated hilltop inflation are in tune with those upcoming CMB experiments. The small-field sector of mutated hilltop inflation, in principle, can probe up to $r\\sim \\mathcal{O}(10^{-4})$, resulting in a tensor amplitude consistent with current bounds and potentially detectable by next-generation CMB missions. However, accommodating the high observational value of the scalar spectral index may demand relatively higher e-foldings in mutated hilltop inflation. A key appealing feature of the mutated hilltop inflation model turns out to be its ability to remain consistent with a potential non-detection of primordial gravitational waves by LiteBIRD and/or Simons Observatory.",
      "pdf_url": "https://arxiv.org/pdf/2511.11534.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.10730",
      "title": "The signature of major mergers on the hydrostatic mass bias of galaxy clusters",
      "authors": [
        "Isac Barranco-Llorca",
        "David Vallés-Pérez",
        "Susana Planelles",
        "Vicent Quilis"
      ],
      "abstract": "The signature of major mergers on the hydrostatic mass bias of galaxy clusters Isac Barranco-Llorca, David Vallés-Pérez, Susana Planelles, Vicent Quilis 14 pages, 10 figures (+ one appendix: 1 page, 1 figure). Proposed for acceptance in Astronomy & Astrophysics. Abstract shortened for publication in ArXiv Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) While galaxy cluster masses are fundamental cosmological observables, estimates based on intra-cluster medium observations rely on hydrostatic equilibrium, introducing a systematic bias. We investigate how mergers drive the time evolution of this hydrostatic mass bias, identifying the dominant physical mechanisms and their dependence on dynamical state and merger history. Using a high-resolution AMR Eulerian+$N$-body cosmological simulation, we analyse a sample of cluster mergers within $1.5 \\leq z \\leq 0$, comparing true and hydrostatic masses derived from gas density and temperature profiles, and tracing their evolution. At $z=0$, the hydrostatic mass bias shows a mild correlation with dynamical state. During major mergers, the bias follows a characteristic trend: a sharp negative dip around the merger time, a transient positive peak, and a gradual return to pre-merger levels. This behaviour is primarily driven by morphological and dynamical reconfigurations of the gas density within the ICM, while thermodynamical processes play a secondary role. The pattern shows no strong dependence on secondary parameters, such as mass ratio or impact parameter, but it can be fitted to a simple time-dependent functional form. This trend is present at radii $r\\le R_{\\mathrm{vir}}$, although with reduced amplitude and shorter timescales as the radius decreases. Hydrostatic mass bias is closely linked, albeit in a non-trivial way, with the merging history of galaxy clusters. We find that the bias values are weakly correlated with the dynamical state of clusters. Nevertheless, our results give a robust estimation of the hydrostatic mass bias values in the pre-merger, merging, and post-merger phases. These findings highlight the importance of delving deeper into the observational assessment of cluster assembly state in order to improve mass estimations for cosmological analyses.",
      "pdf_url": "https://arxiv.org/pdf/2511.10730.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10765",
      "title": "Jeans Model for the Shapes of Self-interacting Dark Matter Halos",
      "authors": [
        "Yilber Fabian Bautista",
        "Andrew Robertson",
        "Laura Sagunski",
        "Adam Smith-Orlik",
        "Sean Tulin"
      ],
      "abstract": "Jeans Model for the Shapes of Self-interacting Dark Matter Halos Yilber Fabian Bautista, Andrew Robertson, Laura Sagunski, Adam Smith-Orlik, Sean Tulin v1: 30 pages (plus 4 appendices), 17 figures, 4 supplementary files Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The Jeans model is a semi-analytical approach to modeling self-interacting dark matter (SIDM) that works remarkably well to reproduce the spherically-averaged halo profiles from observations and simulations of relaxed galaxies and galaxy clusters. However, SIDM halos are not spherically symmetric in general since they respond to nonspherical baryon distributions and retain nonsphericity from their initial collapse. In this work, we generalize the Jeans model to describe SIDM density profiles and halo shapes beyond spherical symmetry. Observational tests via halo shapes are especially important for testing SIDM in massive galaxies, $M_{\\rm 200} \\sim 10^{12} - 10^{13} \\; \\Msun$, where SIDM and collisionless dark matter halos can have indistinguishable spherically-averaged profiles but distinct halo shapes. We validate our model by comparing to cosmological simulations with baryons for both SIDM with $\\sigmam = 1 \\cmg$ and collisionless cold dark matter. Our approach differs from previous work in this direction, taking into account the fact that multiple scatterings are required to impact the shape of the halo, as well as being computationally inexpensive to implement. The nonspherical Jeans model can be used in conjunction with halo shape observations (e.g., from gravitational lensing or X-ray data) to directly constrain dark matter self-interactions.",
      "pdf_url": "https://arxiv.org/pdf/2511.10765.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10975",
      "title": "A proposal to construct the dark-matter-only counterpart of the observed Universe combining weak lensing and baryon censuses",
      "authors": [
        "Shuren Zhou",
        "Pengjie Zhang"
      ],
      "abstract": "A proposal to construct the dark-matter-only counterpart of the observed Universe combining weak lensing and baryon censuses Shuren Zhou, Pengjie Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO) Baryonic effects such as AGN feedback can significantly impact the matter clustering, are harder to model from first principles, and emerge as a severe limiting factor in weak lensing cosmology. To tackle this issue, we propose a generic relation of mapping the observed matter clustering to its counterpart in a dark-matter-only universe. We verify this relation to be accurate at better than $1\\%$ level at $k<1\\,h/$Mpc and $z\\in [0,3]$ in both TNG and Illustris simulations, demonstrating its model-independence to the underlying baryonic physics. Implementing this relation in observations will be made possible by the specifically designed cross-correlation statistics and baryon census (ionized diffuse gas through localized fast radio bursts, stellar mass through galaxy surveys, and neutral hydrogen through 21cm mapping). It is capable of correcting the baryonic effect not only in the matter power spectrum, but also at the field level, as demonstrated by tests on the scattering transform statistics. This approach paves the way for constructing the dark-matter-only counterpart of the observed Universe, establishing an ideal cosmological laboratory for probing the dark universe.",
      "pdf_url": "https://arxiv.org/pdf/2511.10975.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11147",
      "title": "Galactic foreground residual biases in CMB lensing convergence reconstruction and delensing of B-mode maps",
      "authors": [
        "Kishan Deka",
        "Pawel Bielewicz"
      ],
      "abstract": "Galactic foreground residual biases in CMB lensing convergence reconstruction and delensing of B-mode maps Kishan Deka, Pawel Bielewicz 15 pages, 15 figures, 3 tables, submitted for publication to A&A journal Cosmology and Nongalactic Astrophysics (astro-ph.CO) Diffused contamination from Galactic foreground emission is one of the main concern for reconstruction of the Cosmic Microwave Background (CMB) lensing potential for next-generation of CMB polarisation experiments. Using realistic simulations we investigate the impact of Galactic foreground residuals from multi-frequency foreground cleaning method on the lensing reconstruction, delensing CMB B-mode maps and constraints of the tensor-to-scalar ratio for CMB-S4-like experiment. We pay special attention to studies of the errors coming from small angular scale non-Gaussianity of the foreground residuals. We show that component separation is essential for the lensing reconstruction reducing Galactic emission contribution to the lensing reconstruction errors by one order of magnitude. The residual foreground contribution is dominated by terms coming from Gaussian components of the residual maps. Errors coming from non-Gaussian components are around three orders of magnitude smaller than the Gaussian one even for recent and the most complex models of the Galactic emission considered in this work. Although the bias in the reconstruction errors due to Gaussian component of the residuals is small, it is comparable to the cosmic variance limit for the lensing power spectrum. For this reason we correct for this bias in delensing of B-mode maps and constraining the tensor-to-scalar ratio. We show also that for the delensed B-mode maps with a simple quadratic estimator, residuals of the Galactic emission after component separation, errors are two orders of magnitude smaller than uncertainties from leftover of the lensing signal. However, for high-sensitivity CMB experiments and more efficient delensing algorithms that remove up to 90% of the lensing signal, the foreground residuals will become one of the main sources of errors.",
      "pdf_url": "https://arxiv.org/pdf/2511.11147.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11179",
      "title": "Constraints on the canonical single-field slow-roll inflation model from observations",
      "authors": [
        "Jun Li",
        "Guang-Hai Guo"
      ],
      "abstract": "Constraints on the canonical single-field slow-roll inflation model from observations Jun Li, Guang-Hai Guo Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this paper we use two methods to constrain the the canonical single-field slow-roll inflation model. The first method exploits the analytic slow-roll-parameter dependence of primordial perturbations, and the second consists of a phenomenological parameterization of the primordial spectra of both scalar and tensor perturbations. We constrain the slow-roll parameters directly by adopting the latest datasets, including Planck satellite data, BICEP2/Keck data and Baryon Acoustic Oscillation data. An advantage of this method is that we can work out the predictions of single-field slow-roll inflation model by using these constrained slow-roll parameters. We illustrate the predictions of the parameters characterizing the scalar power spectrum and constrain some inflation models. We find that the inflation model with monomial potential is disfavored, and the inflation models with a concave potential, such as the Starobinsky inflation model, brane inflation model are preferred. From the constraints on the slow-roll parameters, the derived tensor spectral index in the single-field slow-roll inflation model is quite small, namely $|n_t|\\lesssim 4.7\\times 10^{-3}$ which will be very difficult to be measured by CMB data only in the future, and the absolute value of derived running of tensor spectral index is not larger than $1.56\\times 10^{-4}$ at $95\\%$ confidence level.",
      "pdf_url": "https://arxiv.org/pdf/2511.11179.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11377",
      "title": "Boost operator approach to the relativistic polarized SZ effect",
      "authors": [
        "Erik Rosenberg",
        "Jens Chluba"
      ],
      "abstract": "Boost operator approach to the relativistic polarized SZ effect Erik Rosenberg, Jens Chluba 13 pages, 2 figures, submitted to MNRAS, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) We extend the recent boost operator formalism for relativistic Compton scattering calculations to also account for polarization. This allows us to provide general, exact expressions for the polarized Sunyaev-Zeldovich (SZ) effect sourced both kinematically and from intrinsic anisotropies of the Cosmic Microwave Background (CMB). The results are given in terms of rational operator functions that can be used to generate distortion spectra that describe the general SZ signal, reproducing the classical polarized SZ results in the appropriate limits. Our derivation allows for clear separation of physical effects in the generation of polarized SZ, and beyond the SZ application provides a general description of the Compton collision term in the Doppler-dominated regime. Through direct computation of important example cases we further illustrate the power of this new method.",
      "pdf_url": "https://arxiv.org/pdf/2511.11377.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11554",
      "title": "Testing the cosmological Euler equation: viscosity, equivalence principle, and gravity beyond general relativity",
      "authors": [
        "Ziyang Zheng",
        "Malte Schneider",
        "Luca Amendola"
      ],
      "abstract": "Testing the cosmological Euler equation: viscosity, equivalence principle, and gravity beyond general relativity Ziyang Zheng, Malte Schneider, Luca Amendola 28 pages, 2 figures, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate how the cosmological Euler equation can be tested in the presence of viscous dark matter, violations of the equivalence principle (EP), and modifications of gravity, while relying on minimal theoretical assumptions. Extending the previous analysis, we generalize the observable $E_P$, which quantifies EP violation, to $\\tilde{E}_P$, discuss the degeneracy between bulk and shear viscosities and EP-violating effects, and explicitly show that the EP can still be tested in the small-viscosity limit. In addition, we identify a model-independent observable, $C_{\\rm vis,0}$, which characterizes the present-day dark matter viscosity and can be measured from relativistic galaxy number counts by cross-correlating two galaxy populations. We perform forecasts for three forthcoming Stage-IV surveys: DESI, Euclid, and SKA Phase 2 (SKA2), and find that $C_{\\rm vis,0}$ can be tightly constrained, at the level of $\\mathcal{O}(10^{-6})$ or better in all cases. Among these surveys, SKA2 provides the tightest constraint, with a $1\\sigma$ uncertainty of $1.08 \\times 10^{-7}$ on $C_{\\rm vis,0}$.",
      "pdf_url": "https://arxiv.org/pdf/2511.11554.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11568",
      "title": "Implicit inference of the reionization history with higher-order statistics of the 21-cm signal",
      "authors": [
        "Nicolas Cerardi",
        "Sambit K. Giri",
        "Michele Bianco",
        "Davide Piras",
        "Emmanuel de Salis",
        "Massimo De Santis",
        "Merve Selcuk-Simsek",
        "Philipp Denzel",
        "Kelley M. Hess",
        "M. Carmen Toribio",
        "Franz Kirsten",
        "Hatem Ghorbel"
      ],
      "abstract": "Implicit inference of the reionization history with higher-order statistics of the 21-cm signal Nicolas Cerardi, Sambit K. Giri, Michele Bianco, Davide Piras, Emmanuel de Salis, Massimo De Santis, Merve Selcuk-Simsek, Philipp Denzel, Kelley M. Hess, M. Carmen Toribio, Franz Kirsten, Hatem Ghorbel 14 pages, 8 figures. Prepared for submission to MNRAS. Comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Epoch of Reionization (EoR), when the first luminous sources ionised the intergalactic medium, represents a new frontier in cosmology. The Square Kilometre Array Observatory (SKAO) will offer unprecedented insights into this era through observations of the redshifted 21-cm signal, enabling constraints on the Universe's reionization history. We investigate the information content of the average neutral hydrogen fraction ($\\bar{x}_{\\rm HI}$) in several Gaussian (spherical and cylindrical power spectra) and non-Gaussian (Betti numbers and bispectrum) summary statistics of the 21-cm signal. Mock 21-cm observations are generated using the AA* configuration of SKAO's low-frequency telescope, incorporating noise levels for 100 and 1000 hours. We employ a state-of-the-art implicit inference framework to learn posterior distributions of $\\bar{x}_{\\rm HI}$ in redshift bins centred at $z=8.0,7.2$ and $6.5$, for each statistic and noise scenario, validating the posteriors through calibration tests. Using the figure of merit to assess constraining power, we find that Betti numbers alone are on average more informative than the power spectra, while the bispectrum provides limited constraints. However, combining higher-order statistics with the cylindrical power spectrum improves the mean figure of merit by $\\sim$0.25 dex ($\\sim33\\%$ reduction in $\\sigma(\\bar{x}_{\\rm HI})$). The relative contribution of each statistic varies with the stage of reionization. With SKAO observations approaching, our results show that combining power spectra with higher-order statistics can significantly increase the information retrieved from the EoR, maximising the scientific return of future 21-cm observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.11568.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10723",
      "title": "Reaching for the Edge II: Stellar Halos out to Large Radii as a Tracer of Dark Matter Halo Mass",
      "authors": [
        "Katya Leidig",
        "Benedikt Diemer",
        "Song Huang",
        "Shuo Xu",
        "Conghao Zhou",
        "Alexie Leauthaud"
      ],
      "abstract": "Reaching for the Edge II: Stellar Halos out to Large Radii as a Tracer of Dark Matter Halo Mass Katya Leidig, Benedikt Diemer, Song Huang, Shuo Xu, Conghao Zhou, Alexie Leauthaud Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The diffuse outskirts of brightest cluster galaxies (BCGs) encode valuable information about the assembly history and mass of their host dark matter halos. However, the low surface brightness of these stellar halos has historically made them difficult to observe. Recent deep imaging, particularly with Hyper Suprime-Cam (HSC), has shown that the stellar mass within relatively large projected annuli, such as within $50$ and $100$ kpc, is a promising proxy for halo mass. However, the optimal radial definition of this \"outskirt mass\" remains uncertain. We construct an HSC-like mock observing pipeline to measure the stellar mass density profiles of BCGs in the IllustrisTNG simulations. Our mock observations closely reproduce HSC profiles across six orders of magnitude in surface density. We then systematically measure stellar masses within different annuli and how tightly they are connected to halo mass. We find that stellar masses measured within simple apertures exhibit considerably more scatter in the stellar mass-halo mass relation than those measured within projected ellipsoidal annuli. We identify an optimal range of definitions, with inner radii between $\\sim 70$-$200$ kpc and outer radii between $\\sim 125$-$500$ kpc. We also introduce two halo-mass-dependent Sérsic models for the average stellar halo profiles. We present a Sérsic-based fitting function that describes the profiles as a function of the halo mass, $M_{\\rm vir}$, with a median error of $54\\%$. Adding the central stellar mass of the BCG as a second parameter slightly improves the accuracy to a median error of $39\\%$. Together, these results provide fitting functions for BCG stellar halos that can be applied to future wide-field surveys to infer halo masses from deep imaging data.",
      "pdf_url": "https://arxiv.org/pdf/2511.10723.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10740",
      "title": "The Quiescent Merging Nature of the Coma Cluster Revealed by ICM Velocity Structure",
      "authors": [
        "E. Gatuzz",
        "J. Sanders",
        "A. Liu",
        "A. Fabian",
        "C. Pinto",
        "D. Eckert",
        "S. Walker"
      ],
      "abstract": "The Quiescent Merging Nature of the Coma Cluster Revealed by ICM Velocity Structure E. Gatuzz, J. Sanders, A. Liu, A. Fabian, C. Pinto, D. Eckert, S. Walker 5 pages, 4 figures, letter submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The hot gas permeating galaxy clusters-the intracluster medium (ICM)-is a key tracer of their assembly history and internal dynamics. Understanding the motion of this gas provides critical insight into processes such as mergers, turbulence, and energy dissipation in the largest gravitationally bound structures in the Universe. The Coma cluster is a nearby, massive system long suspected to be dynamically disturbed. Previous high-resolution X-ray spectroscopy with the XRISM mission revealed bulk motions in the cluster core and southern regions. Here we present new XRISM Resolve observations of a northern region in Coma, which reveal a coherent velocity gradient of nearly $530 km/s across the cluster from south to north. We find that the hot gas in this northern region exhibits modest line-of-sight motions and uniform thermodynamic properties, indicating relatively mild local disturbances. The consistent levels of turbulence throughout the cluster suggest that the energy from a past merger has been distributed on large scales. These findings provide compelling evidence for an off-axis merger event and demonstrate how high-resolution X-ray spectroscopy can uncover subtle dynamical signatures in the ICM, offering important constraints for simulations of cluster evolution.",
      "pdf_url": "https://arxiv.org/pdf/2511.10740.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10794",
      "title": "The impact of supermassive black holes on exoplanet habitability: I. Spanning the natural mass range",
      "authors": [
        "Jourdan Waas",
        "Eric S. Perlman",
        "Manasvi Lingam",
        "Emily Lohmann",
        "Jackson Kernan",
        "Francesco Tombesi",
        "Amadeo Balbi",
        "Alessandra Ambrifi"
      ],
      "abstract": "The impact of supermassive black holes on exoplanet habitability: I. Spanning the natural mass range Jourdan Waas, Eric S. Perlman, Manasvi Lingam, Emily Lohmann, Jackson Kernan, Francesco Tombesi, Amadeo Balbi, Alessandra Ambrifi Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE) While the influence of supermassive black hole (SMBH) activity on habitability has garnered attention, the specific effects of active galactic nuclei (AGN) winds, particularly ultrafast outflows (UFOs), on planetary atmospheres remain largely unexplored. This study aims to fill this gap by investigating the relationship between SMBH mass at the galactic center and exoplanetary habitability, given that SMBH masses are empirically confirmed to span approximately 5 orders of magnitude in galaxies. Through simplified models, we account for various results involving the relationships between the distance from the planet to the central SMBH and the mass of the SMBH. Specifically, we show that increased SMBH mass leads to higher atmospheric heating and elevated temperatures, greater molecular thermal velocities, and enhanced mass loss, all of which diminish with distance from the galactic center. Energy-driven winds consistently have a stronger impact than momentum-driven ones. Crucially, ozone depletion is shown to rise with SMBH mass and decrease with distance from the galactic center, with nearly complete ozone loss ($\\sim100\\%$) occurring across galactic scales for SMBHs $\\geq 10^8 M_\\odot$ in the energy-driven case. This study emphasizes that SMBH growth over cosmic time may have produced markedly different impacts on galactic habitability, depending on both the mass of the central black hole (BH) and the location of planetary systems within their host galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2511.10794.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.EP",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10805",
      "title": "Mock Observations for the CSST Mission: Main Surveys -- the Mock Catalogue",
      "authors": [
        "Cheng-Liang Wei",
        "Yu Luo",
        "Hao Tian",
        "Ming Li",
        "Yi-Sheng Qiu",
        "Guo-Liang Li",
        "Yue-Dong Fang",
        "Xin Zhang",
        "De-Zi Liu",
        "Nan Li",
        "Ran Li",
        "Huan-Yuan Shan",
        "Lin Nie",
        "Zizhao He",
        "Lei Wang",
        "Xi Kang",
        "Dongwei Fan",
        "Yang Chen",
        "Xiaoting Fu",
        "Chao Liu"
      ],
      "abstract": "Mock Observations for the CSST Mission: Main Surveys -- the Mock Catalogue Cheng-Liang Wei, Yu Luo, Hao Tian, Ming Li, Yi-Sheng Qiu, Guo-Liang Li, Yue-Dong Fang, Xin Zhang, De-Zi Liu, Nan Li, Ran Li, Huan-Yuan Shan, Lin Nie, Zizhao He, Lei Wang, Xi Kang, Dongwei Fan, Yang Chen, Xiaoting Fu, Chao Liu 17 pages, 17 figures, accepted in RAA. Our mock catalog is available upon request Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The Chinese Space Station Survey Telescope (CSST) is a flagship space mission, designed to carry out a large-area sky survey to explore the nature of dark matter and dark energy in the Universe. The onboard multi-band imaging and slitless spectroscopic modules will enable us to obtain photometric data for billions of galaxies and stars, as well as hundreds of millions of spectroscopic measurements, advancing various scientific analyses such as galaxy clustering and weak gravitational lensing. To support the image simulations for the main survey of the CSST mission, we present a mock catalogue of stars and galaxies. For stars, the mock catalogue is generated using either Galaxia or TRILEGAL, both of which provide a range of stellar properties to meet the requirements of CSST image simulations. For galaxies, we built a mock light-cone up to redshift z~3.5 from the cosmological Nbody simulation and populated the mock galaxy catalogue from the dark mater haloes using a semi-analytical galaxy formation model. We then performed a full-sky ray-tracing simulation of weak gravitational lensing to obtain lensing shear at the position of each galaxy in the light-cone. To support both multi-band imaging and slitless spectroscopic simulations, we computed the spectral energy distribution (SED) for each galaxy based on its star formation history using a supervised deep-learning model and determined the magnitudes in each band using the CSST throughputs. Finally, the properties of our mock galaxies include positions, redshifts, stellar masses, shapes, sizes, SEDs, lensing shears and magnifications. We have validated our mock catalogue against observational data and theoretical models, with results showing good overall agreement. The catalogue provides a flexible dataset for the development of CSST image processing and can support a wide range of cosmological analyses within the CSST mission.",
      "pdf_url": "https://arxiv.org/pdf/2511.10805.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10968",
      "title": "Discovery of an X-ray bridge between the comma-shaped gas and the main cluster in MCXC J0157.4-0550",
      "authors": [
        "Chong Yang",
        "Nobuhiro Okabe",
        "Yasushi Fukazawa"
      ],
      "abstract": "Discovery of an X-ray bridge between the comma-shaped gas and the main cluster in MCXC J0157.4-0550 Chong Yang, Nobuhiro Okabe, Yasushi Fukazawa Accepted for publication in PASJ, 8 pages, 5 figures, 2 tables High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We report the discovery of a faint X-ray bridge connecting between the comma-shaped gas and the main cluster in MCXC J0157.4-0550, using {\\it XMM-Newton} image. The filamentary structure is found in a model-independent manner in both topological features and Gaussian Gradient Magnitude filtering. The X-ray surface brightness profile perpendicular to the filament is detected at a $5.5\\sigma$ level. Weak-lensing (WL) analysis using the Subaru/HSC-SSP Survey archive data strongly supports the two mass components. Given a prior from the stellar masses, we obtain $M_{200}^{\\rm main}=2.68_{-0.92}^{+1.11}\\times 10^{14}\\,h_{70}^{-1}M_\\odot$ and $M_{200}^{\\rm sub}=0.46_{-0.22}^{+0.38}\\times 10^{14}\\,h_{70}^{-1}M_\\odot$. The main axis of the projected halo distribution is more likely to align with the direction of the main cluster than to be oriented perpendicularly. Similar X-ray distributions have been identified in the literature on numerical simulations. The filamentary structure forms in the following manner: as the gas is stripped by ram pressure near the pericenter, it gets dragged by tidal rotation. Once free from this rotation, the gas moves inertially in a direction parallel to the tangential velocity at the pericenter. The comma-shaped gas, with tails pointing in the opposite direction to the main cluster, is also formed by the current tidal rotation as it moves away from the main cluster. This warrants us that, although it is sometimes thought based on the X-ray morphology alone that the tail is pointing in the opposite direction to the merger motion, this is not necessarily the case. The information of the X-ray filamentary remnant from the cluster merger, together with the 2D WL shear data, provides constraints on the merger parameters, indicating an infalling velocity of approximately $1000\\, {\\rm km\\, s^{-1}}$ and an impact parameter of $0.9$ Mpc.",
      "pdf_url": "https://arxiv.org/pdf/2511.10968.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11314",
      "title": "Radiation magnetohydrodynamics simulations of Population III star formation during the Epoch of Reionization",
      "authors": [
        "Lisanne van Veenen",
        "Piyush Sharda",
        "Serena Viti",
        "Shyam H. Menon"
      ],
      "abstract": "Radiation magnetohydrodynamics simulations of Population III star formation during the Epoch of Reionization Lisanne van Veenen, Piyush Sharda, Serena Viti, Shyam H. Menon 8 pages, 11 figures, submitted to A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Solar and Stellar Astrophysics (astro-ph.SR) Cosmological simulations find that pockets of star-forming gas could remain pristine up until the Epoch of Reionization (EoR) due to the inhomogeneous nature of metal mixing and enrichment in the early Universe. Such pristine clouds could have formed Population III stars, which could have distinct properties compared to their very high redshift ($z \\geq 20$) counterparts. We investigate how Population III stars form and grow during the EoR, and whether the resulting mass distribution varies with environment or across cosmic time. We perform high-resolution ($7.5\\,\\rm{au}$) radiation-magnetohydrodynamics simulations of identical primordial clouds exposed to the CMB appropriate for $z=30$ and $z=6$, respectively, as part of the POPSICLE project. We also run a simulation at $z=6$ with a strong external Lyman-Werner (LW) background, to span across radiative environments which could host metal-free clumps during the EoR. In the limit of no external LW radiation, we find that while the evolution of the most massive star ($M_{\\star} \\approx 70\\,\\rm{M_{\\odot}}$) is almost identical between $z=30$ and $z=6$, the latter exhibits less fragmentation, leading to a smaller cluster of stars with a higher median stellar mass. In the limit of high external LW radiation, we see vigorous accretion and high star formation efficiencies, leading to the formation of very massive ($M_{\\star} > 100\\,\\rm{M_{\\odot}}$) stars. Our results suggest that Population III IMF could vary with redshift simply due to the CMB, independent of the environment. We find that less massive and more compact Pop III star clusters could form during the EoR as compared to $z \\geq 20$, with the formation of very massive and supermassive stars likely in strongly irradiated environments.",
      "pdf_url": "https://arxiv.org/pdf/2511.11314.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11501",
      "title": "Looking at infrared background radiation anisotropies with Spitzer II. Small scale anisotropies and their implications for new and upcoming space surveys",
      "authors": [
        "Aidan J. Kaminsky",
        "Alexander Kashlinsky",
        "Richard G. Arendt",
        "Nico Cappelluti"
      ],
      "abstract": "Looking at infrared background radiation anisotropies with Spitzer II. Small scale anisotropies and their implications for new and upcoming space surveys Aidan J. Kaminsky, Alexander Kashlinsky, Richard G. Arendt, Nico Cappelluti 26 pages, 14 figures, 3 tables. Submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Spitzer-based cosmic infrared background (CIB) fluctuations at arcminute-to-degree scales indicate the presence of new populations, whereas sub-arcminute power arises from known $z\\lesssim 6$ galaxies. We reconstruct the evolution of the near-IR CIB anisotropies on sub-arcminute scales by known galaxy populations. This method is based on, and significantly advanced over, the empirical reconstruction by \\cite{Helgason2012} which is combined with the halo model connecting galaxies to their host dark matter (DM) halos. The modeled CIB fluctuations from known galaxies produce the majority of the observed small-scale signal down to statistical uncertainties of $< 10\\%$ and we constrain the evolution of the halo mass regime hosting such galaxies. Thus the large-scale CIB fluctuations from new populations are produced by sources with negligible small-scale power. This appears to conflict with the presented Intra-halo light (IHL) models, but is accounted for if the new sources are at high $z$. Our analysis spanning several Spitzer datasets allows us to narrow the estimated contributions of remaining known galaxies to the CIB anisotropies to be probed potentially from surveys by new and upcoming space missions such as Euclid, SPHEREx, and Roman. Of these, the Roman surveys have the best prospects for measuring the source-subtracted CIB and probing the nature of the underlying new populations at $\\lambda <2\\ \\mu$m, followed by Euclid's surveys, while for SPHEREx the source-subtracted CIB signal from them appears significantly overwhelmed by the CIB from remaining known galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2511.11501.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.02931",
      "title": "Anatomy of Parity-violating Trispectra in Galaxy Surveys",
      "authors": [
        "Yunjia Bao",
        "Lian-Tao Wang",
        "Zhong-Zhi Xianyu",
        "Yi-Ming Zhong"
      ],
      "abstract": "Anatomy of Parity-violating Trispectra in Galaxy Surveys Yunjia Bao, Lian-Tao Wang, Zhong-Zhi Xianyu, Yi-Ming Zhong v2: matches PRD version, 54 pages, 11 figures, 1 table, v1: 56 pages, 10 figures, 1 table Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Parity-violating interactions are ubiquitous phenomena in particle physics. If they are significant during cosmic inflation, they can leave imprints on primordial perturbations and be observed in correlation functions of galaxy surveys. Importantly, parity-violating signals in the four-point correlation functions (4PCFs) cannot be generated by Einstein gravity in the late universe on large scales, making them unique and powerful probes of high-energy physics during inflation. However, the complex structure of the 4PCF poses challenges in diagnosing the underlying properties of parity-violating interactions from observational data. In this work, we introduce a general framework that provides a streamlined pipeline directly from a particle model in inflation to galaxy 4PCFs in position space. We demonstrate this framework with a series of toy models, effective-field-theory-like models, and full models featuring tree-level exchange-type processes with chemical-potential-induced parity violation. We further showed the detection sensitivity of these models from BOSS data and highlighted potential challenges in data interpretation and model prediction.",
      "pdf_url": "https://arxiv.org/pdf/2504.02931.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.06200",
      "title": "Accurate $N$-body simulations with local Primordial non-Gaussianities: initial conditions and aliasing",
      "authors": [
        "Adrian G. Adame",
        "Santiago Avila",
        "Violeta Gonzalez-Perez",
        "Oliver Hahn",
        "Gustavo Yepes",
        "Marc Manera"
      ],
      "abstract": "Accurate $N$-body simulations with local Primordial non-Gaussianities: initial conditions and aliasing Adrian G. Adame, Santiago Avila, Violeta Gonzalez-Perez, Oliver Hahn, Gustavo Yepes, Marc Manera 14 pages, 7 figures. Accepted in A\\&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) New generation galaxy surveys targeting constraints on local primordial non-Gaussianity (PNG) demand $N$-body simulations that accurately reproduce its effects. In this work, we explore various prescriptions for the initial conditions of simulations with PNG, aiming to optimise accuracy and minimise numerical errors, particularly due to aliasing. We have used $186$ runs that vary the starting redshift, LPT order, and non-Gaussianities ($f^{\\rm local}_{\\rm NL}$ and $g^{\\rm local}_{\\rm NL}$). Starting with $3$LPT at a redshift as low as $z_{\\rm ini}\\simeq 11.5$ reproduces to $<1 \\%$ the power spectrum, bispectrum and halo mass function of a high-resolution reference simulation. The aliasing induced by the PNG terms in the power spectrum produces a $ \\leq 3 \\%$ excess small-scale power at the initial conditions, dropping below $0.1\\%$ by $z=0$. State-of-the-art initial condition generators show a sub-percent agreement. We show that initial conditions for simulations with PNG should be established at a lower redshift using higher-order LPT schemes. We also show that removing the PNG aliasing signal is unnecessary for current simulations. The methodology proposed here can accelerate the generation of simulations with PNG while enhancing their accuracy.",
      "pdf_url": "https://arxiv.org/pdf/2506.06200.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.21182",
      "title": "The Impact of Spectroscopic Redshift Errors on Cosmological Measurements",
      "authors": [
        "Shengyu He",
        "Jiaxi Yu",
        "Antoine Rocher",
        "Daniel Forero-Sánchez",
        "Jean-Paul Kneib",
        "Cheng Zhao",
        "Etienne Burtin",
        "Jiamin Hou"
      ],
      "abstract": "The Impact of Spectroscopic Redshift Errors on Cosmological Measurements Shengyu He, Jiaxi Yu, Antoine Rocher, Daniel Forero-Sánchez, Jean-Paul Kneib, Cheng Zhao, Etienne Burtin, Jiamin Hou 25 pages, 10 figures, submitted to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) Spectroscopic redshift errors, including redshift uncertainty and catastrophic failures, can bias cosmological measurements from galaxy redshift surveys at sub-percent level. In this work, we investigate their impact on the full-shape analysis using contaminated mock catalogs. We find that redshift uncertainty introduces a scale-dependent damping effect on the power spectrum, which is absorbed by counterterms in clustering model, keeping parameter biases below $5\\%$. Catastrophic failures suppress the power spectrum amplitude by an approximately constant factor that scales with the catastrophic rate $f_c$. While this effect is negligible for DESI galaxy populations ($f_c=1\\%$), the slitless-like errors, combining redshift uncertainty with $f_c=5\\%$ catastrophics, introduce significant biases in cosmological constraints. In this case, we observe $6\\%$ to $16\\%$ shifts ($\\sim1.5\\sigma$ level) in estimating the fractional growth rate $df\\equiv f/f^{\\rm{fid}}$ and the log primordial amplitude $\\ln(10^{10} A_{s})$. Applying the correction factor $(1-f_c)^2$ on the galaxy power spectrum mitigates the bias but weakens the parameter constraints due to new degeneracies. Alternatively, fixing $f_c$ to its expected value restores the constraining power with a modest bias of $0.7\\sigma$. Our results indicate that for space-based slitless surveys such as \\textit{Euclid}, at minimum accurate estimation of $f_c$ and its incorporation into the clustering model are essential to get unbiased cosmological inference. Extending to evolving dark energy and massive neutrino cosmologies, redshift errors do not bias the dark energy properties parametrized by $w_0$ and $w_a$, but can degrade constraints on the summed neutrino mass $\\sum m_\\nu$ by up to 80% in the worst case.",
      "pdf_url": "https://arxiv.org/pdf/2508.21182.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07259",
      "title": "Probing the Cosmological Principle with CMB lensing and cosmic shear",
      "authors": [
        "James Adam",
        "Roy Maartens",
        "Julien Larena",
        "Chris Clarkson",
        "Ruth Durrer"
      ],
      "abstract": "Probing the Cosmological Principle with CMB lensing and cosmic shear James Adam, Roy Maartens, Julien Larena, Chris Clarkson, Ruth Durrer Added clarifying remarks on masking effects, the Limber approximation, and axisymmetry. Added Table 3.1 summarising survey inputs. Fixed minor typos. Text matches the version accepted for publication by JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) The standard cosmological model assumes the Cosmological Principle. However, recent observations hint at possible violations of isotropy on large scales, possibly through late-time anisotropic expansion. Here we investigate the potential of cross-correlations between CMB lensing convergence $\\kappa$ and galaxy cosmic shear $B$-modes as a novel probe of such late-time anisotropies. Our signal-to-noise forecasts reveal that information from the $\\kappa$-$B$ cross-correlation is primarily contained on large angular scales ($\\ell \\lesssim 200$). We find that this cross-correlation for a Euclid-like galaxy survey is sensitive to anisotropy at the percent level. Making use of tomography yields a modest improvement of $\\sim 20\\%$ in detection power. Incorporating the galaxy $E$-$B$ cross-correlations would further enhance these constraints.",
      "pdf_url": "https://arxiv.org/pdf/2509.07259.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.13920",
      "title": "Recovering the Coupled Treatment of Redshift-Space Distortions and the Lightcone Effect after Diffuse Foreground Removal",
      "authors": [
        "Jennifer Feron",
        "Emma Chapman"
      ],
      "abstract": "Recovering the Coupled Treatment of Redshift-Space Distortions and the Lightcone Effect after Diffuse Foreground Removal Jennifer Feron, Emma Chapman 13 pages, 14 figures, accepted for publication in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO) The 21 cm brightness temperature during the Epoch of Reionisation is widely modelled using semi-numeric simulations, used for their computational speed and flexibility in testing astrophysical and cosmological parameters. However, it is common practice to simulate coeval brightness temperature boxes, and then apply post-processing algorithms that treat the lightcone effect and redshift-space distortions separately, assuming they can be added in sequence. We instead model them together, allowing for partial coeval cell contributions, and ensuring that velocity-induced frequency shifts are computed at the correct cosmic time for every position along the line of sight. We show that considering these effects simultaneously creates a difference in the shape of the power spectrum over all Fourier scales, and remains recoverable after semi-blind foreground removal. We show that our lightcones consist of an average of 8% and maximum of 120% of a coeval cell length. These contributions to a 21cm brightness temperature lightcone voxel are shifted from within a +/- 0.5 MHz range of the emitted frequency. The boost in the power spectrum seen over small scales (k>1.5 Mpc) of our robust 21 cm lightcone method compared to basic methods is recoverable after the addition and removal of diffuse radio foregrounds. The largest differences during the Epoch of Reionisation lie in the k-space, where the noise sensitivity for a 1000-hour SKAO-low observation is greater than the signal. However, in the cosmic dawn, we have shown that the major differences lie outside of this noise-dominated region.",
      "pdf_url": "https://arxiv.org/pdf/2509.13920.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07928",
      "title": "Probing Anisotropic Cosmic Birefringence with Foreground-Marginalised SPT B-mode Likelihoods",
      "authors": [
        "L. Balkenhol",
        "A. Coerver",
        "C. L. Reichardt",
        "J. A. Zebrowski"
      ],
      "abstract": "Probing Anisotropic Cosmic Birefringence with Foreground-Marginalised SPT B-mode Likelihoods L. Balkenhol, A. Coerver, C. L. Reichardt, J. A. Zebrowski 8 pages, 6 figures, published in the Open Journal of Astrophysics Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work, we construct foreground-marginalised versions of the SPT-3G D1 and SPTpol cosmic microwave background (CMB) B-mode polarisation likelihoods. The compression is performed using the CMB-lite framework and we use the resulting data sets to constrain anisotropic cosmic birefringence, parametrised by the amplitude of a scale-invariant anisotropic birefringence spectrum, $A_{\\rm CB}$. Using the new SPT-3G data we report a $95\\%$ upper limit on $A_{\\rm CB}$ of $ 1.2\\times 10^{-4}$, which tightens to $0.53\\times 10^{-4}$ when imposing a prior on the amplitude of gravitational lensing based on CMB lensing reconstruction analyses. These are the tightest constraints on anisotropic birefringence from BB power spectrum measurements to-date, demonstrating the constraining power of the South Pole Telescope. The likelihoods used in this work are made publicly available at this https URL",
      "pdf_url": "https://arxiv.org/pdf/2510.07928.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25489",
      "title": "Constraints on Cosmic Birefringence from SPIDER, Planck, and ACT observations",
      "authors": [
        "Lu Yin",
        "Shuhang Xiong",
        "Joby Kochappan",
        "Bum-Hoon Lee",
        "Tuhin Ghosh"
      ],
      "abstract": "Constraints on Cosmic Birefringence from SPIDER, Planck, and ACT observations Lu Yin, Shuhang Xiong, Joby Kochappan, Bum-Hoon Lee, Tuhin Ghosh Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Early Dark Energy (EDE) model has been proposed as a candidate mechanism to generate cosmic birefringence through a Chern-Simons coupling between a dynamical scalar field and the cosmic microwave background (CMB) photon. Such birefringence induces a nonzero cross-correlation between the CMB $E$- and $B$-modes, providing a direct observational signature of parity violation. Recent measurements of the $EB$ and $TB$ power spectra, however, cannot yet unambiguously separate instrumental miscalibration ($\\alpha$) from a true cosmic-rotation angle ($\\beta$). For this reason, we perform a model-independent analysis in terms of the total effective rotation angle $\\alpha+\\beta$. We analyze the latest $EB$ and $TB$ measurements from the SPIDER, Planck, and ACT experiments and derive constraints on the Chern-Simons coupling constant $gM_{Pl}$ and on the polarization rotation angle $\\alpha+\\beta$. We find that the coupling $gM_{Pl}$ is not compatible with the SPIDER data, while it provides reasonable fits to the Planck and ACT measurements. The fits for $\\alpha+\\beta$ prefer a value larger than zero: when combined, Planck+ACT yield a detection significance of approximately 7$\\sigma$. We also find that ACT data alone do not provide sufficiently tight constraints on either $gM_{Pl}$ or $\\alpha+\\beta$, whereas the combination Planck+ACT improves the statistical consistency of ACT's high-$\\ell$ results and leads to a better PTE for those measurements.",
      "pdf_url": "https://arxiv.org/pdf/2510.25489.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09630",
      "title": "Dark Photons in the Radio Sky: I. Resonant Conversions in Halos",
      "authors": [
        "Ethan Baker",
        "Hongwan Liu"
      ],
      "abstract": "Dark Photons in the Radio Sky: I. Resonant Conversions in Halos Ethan Baker, Hongwan Liu 6 pages, 3 figures, updated link to companion paper Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Mixing between dark photons and visible photons leads to substantial anisotropies in the cosmic microwave background due to resonant conversions of visible photons into dark photons in baryonic matter found in dark matter halos. In this Letter, we forecast the sensitivity of the Square Kilometre Array (SKA) to this signal. We find that SKA could be the first experiment to discover dark photons with a mass between $10^{-13}$ and $5\\times 10^{-12}$ eV and kinetic mixing parameter $\\epsilon$ as small as $\\sim 10^{-8}$ by cross-correlating their data with a low-redshift galaxy survey, potentially improving on the sensitivity from a similar analysis using Planck data by a factor of 4 in $\\epsilon$. This improvement is largely due to an enhancement of the signal at low frequencies and the unique experimental advantages of radio telescopes such as small beam sizes.",
      "pdf_url": "https://arxiv.org/pdf/2511.09630.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09637",
      "title": "Dark Photons in the Radio Sky: II. Resonant Conversions in the Intergalactic Medium",
      "authors": [
        "Ethan Baker",
        "Hongwan Liu"
      ],
      "abstract": "Dark Photons in the Radio Sky: II. Resonant Conversions in the Intergalactic Medium Ethan Baker, Hongwan Liu 20+14 pages, 9+2 figures, updated link to companion paper Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) This is the second part in a pair of papers forecasting the sensitivity of the Square Kilometre Array (SKA) to dark photons, a highly motivated, simple extension of the Standard Model. Through a kinetic mixing term, visible photons from the cosmic microwave background can resonantly convert into dark photons, generating new temperature anisotropies in the sky. In this work, we detail the entire analysis pipeline that we use to compute SKA's sensitivity, focusing on resonant conversions that occur in the intergalactic medium. We also discuss the sensitivity of 21-cm experiments to dark photons. Our results show that both SKA in combination with galaxy surveys and 21-cm experiments could discover dark photons with masses between $5\\times 10^{-15}$ and $5\\times 10^{-12}$ eV, and kinetic mixing parameter $\\epsilon$ as low as $10^{-8}$.",
      "pdf_url": "https://arxiv.org/pdf/2511.09637.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10631",
      "title": "A Bayesian Perspective on Evidence for Evolving Dark Energy",
      "authors": [
        "Dily Duan Yi Ong",
        "David Yallup",
        "Will Handley"
      ],
      "abstract": "A Bayesian Perspective on Evidence for Evolving Dark Energy Dily Duan Yi Ong, David Yallup, Will Handley 5 pages, 1 figure, 1 table, version 2 typographical correction to prior and neutrino setup Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) The DESI collaboration reports a significant preference for a dynamic dark energy model ($w_0w_a$CDM) over the cosmological constant ($\\Lambda$CDM) when their data are combined with other frontier cosmological probes. We present a direct Bayesian model comparison using nested sampling to compute the Bayesian evidence, revealing a contrasting conclusion: for the key combination of the DESI DR2 BAO and the Planck CMB data, we find the Bayesian evidence modestly favours $\\Lambda$CDM (log-Bayes factor $\\ln B = -0.57{\\scriptstyle\\pm0.26}$), in contrast to the collaboration's 3.1$\\sigma$ frequentist significance in favoring $w_0w_a$CDM. Extending this analysis to also combine with the DES-Y5 supernova catalogue, our Bayesian analysis reaches a significance of $3.07{\\scriptstyle\\pm0.10}\\,\\sigma$ in favour of $w_0w_a$CDM. By performing a comprehensive tension analysis, employing five complementary metrics, we pinpoint the origin: a significant ($\\approx 2.95\\sigma$), low-dimensional tension between DESI DR2 and DES-Y5 that is present only within the $\\Lambda$CDM framework. The $w_0w_a$CDM model is preferred precisely because its additional parameters act to resolve this specific dataset conflict. The convergence of our findings with independent geometric analyses suggests that the preference for dynamic dark energy is primarily driven by the resolution of inter-dataset tensions, warranting a cautious interpretation of its statistical significance.",
      "pdf_url": "https://arxiv.org/pdf/2511.10631.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.23681",
      "title": "Multi-Model Framework for Reconstructing Gamma-Ray Burst Light Curves",
      "authors": [
        "A. Kaushal",
        "A. Manchanda",
        "M. G. Dainotti",
        "K. Gupta",
        "Z. Nogala",
        "A. Madhan",
        "S. Naqi",
        "Ritik Kumar",
        "V. Oad",
        "N. Indoriya",
        "Krishnanjan Sil",
        "D. H. Hartmann",
        "M. Bogdan",
        "A. Pollo",
        "JX. Prochaska",
        "N. Fraija"
      ],
      "abstract": "Multi-Model Framework for Reconstructing Gamma-Ray Burst Light Curves A. Kaushal, A. Manchanda, M. G. Dainotti, K. Gupta, Z. Nogala, A. Madhan, S. Naqi, Ritik Kumar, V. Oad, N. Indoriya, Krishnanjan Sil, D. H. Hartmann, M. Bogdan, A. Pollo, JX. Prochaska, N. Fraija 23 pages, 14 figures, 64 panels, 4 Tables. Submitted to JHEAPS. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Mitigating data gaps in Gamma-ray bursts (GRBs) light curves (LCs) is crucial for cosmological research, enhancing the precision of parameters, assuming perfect satellite conditions for complete LC coverage with no gaps. This analysis improves the applicability of the two-dimensional Dainotti relation, which connects the rest-frame end time of the plateau emission (Ta) and its luminosity (La), derived from the fluxes (Fa). The study expands on a previous 521 GRB sample by incorporating seven models: Deep Gaussian Process (DGP), Temporal Convolutional Network (TCN), Hybrid CNN with Bidirectional Long Short-Term Memory (CNN-BiLSTM), Bayesian Neural Network (BNN), Polynomial Curve Fitting, Isotonic Regression, and Quartic Smoothing Spline (QSS). Results indicate that QSS significantly reduces uncertainty across parameters: 43.5% for log Ta, 43.2% for log Fa, and 48.3% for alpha, outperforming the other models where alpha denotes the slope post-plateau based on Willingale 2007 functional form. The Polynomial Curve Fitting model demonstrates moderate uncertainty reduction across parameters, while CNN-BiLSTM has the lowest outlier rate for alpha at 0.77%. These models broaden the application of machine-learning techniques in GRB LC analysis, enhancing uncertainty estimation and parameter recovery, and complement traditional methods like the Attention U-Net and Multilayer Perceptron (MLP). These advancements highlight the potential of GRBs as cosmological probes, supporting their role in theoretical model discrimination via LC parameters, serving as standard candles, and facilitating GRB redshift predictions through advanced machine-learning approaches.",
      "pdf_url": "https://arxiv.org/pdf/2506.23681.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20962",
      "title": "Survival of higher overdensity cold gas in a turbulent, multiphase medium",
      "authors": [
        "Ashwin Vergis George",
        "Hitesh Kishore Das",
        "Max Gronke"
      ],
      "abstract": "Survival of higher overdensity cold gas in a turbulent, multiphase medium Ashwin Vergis George, Hitesh Kishore Das, Max Gronke Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cold gas clouds embedded in a hot, turbulent medium are expected to be short-lived due to disruptive hydrodynamic instabilities. However, radiative cooling might allow such clouds to survive and grow. We present 3D \\texttt{Athena++} simulations of clouds with a density contrast of $\\chi = 1000$, exploring turbulent Mach numbers $\\mathcal{M}\\in (0.25, 0.75)$ and cloud radii chosen to span cooling-to-crushing ratios $\\alpha \\in [0.001, 10]$. We find a shift in the survival boundary, with cloud survival occurring only when the cooling-to-cloud-crushing ratio ($t_{\\text{cool,mix}} / t_{\\text{cc}}$) $\\lesssim 0.01$, which is lower than the expected boundary of $\\sim 1$. This result shows that it is more difficult for higher over-density cold clouds to survive in a turbulent, hot medium, and suggests another `survival criterion'.",
      "pdf_url": "https://arxiv.org/pdf/2507.20962.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08685",
      "title": "Kinematic scaling relations of disc galaxies from ionised gas at $z\\sim~1$ and their connection with dark matter halos",
      "authors": [
        "Pavel E. Mancera Piña",
        "Enrico M. Di Teodoro",
        "S. Michael Fall",
        "Antonino Marasco",
        "Mariska Kriek",
        "Marco Martorano"
      ],
      "abstract": "Kinematic scaling relations of disc galaxies from ionised gas at $z\\sim~1$ and their connection with dark matter halos Pavel E. Mancera Piña, Enrico M. Di Teodoro, S. Michael Fall, Antonino Marasco, Mariska Kriek, Marco Martorano Submitted to A&A. Version after addressing referee report Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We derive the Tully-Fisher (TFR, $M_\\ast-V_{\\rm circ, f}$) and Fall (FR, $j_\\ast-M_\\ast$) relations at redshift $z = 0.9$ using a sample of 43 main-sequence disc galaxies with H$\\alpha$ IFU data and JWST/HST imaging. The strength of our analysis lies in the use of state-of-the-art 3D kinematic models to infer galaxy rotation curves, the inclusion and morphological modelling of NIR bands, and the use of SED modelling applied to our photometry measurements to estimate stellar masses. After correcting the inferred H$\\alpha$ velocities for asymmetric drift, we find a TFR of the form $\\log(M_\\ast / M_\\odot) = a \\log(V_{\\rm circ,f} / 150~\\mathrm{km\\,s^{-1}}) + b$, with $a=3.82^{+0.55}_{-0.40}$ and $b=10.27^{+0.06}_{-0.07}$, as well as a FR of the form $\\log(j_\\ast / \\mathrm{kpc\\,km\\,s^{-1}}) = a \\log(M_\\ast / 10^{10.5} M_\\odot) + b$, with $a=0.44^{+0.06}_{-0.06}$ and $b=2.86^{+0.02}_{-0.02}$. When compared to their $z=0$ counterparts, we find moderate evolution in the TFR and strong evolution in the FR over the past $8$ Gyr. We interpret our findings in the context of the galaxy-to-halo scaling parameters $f_{\\rm M}=M_\\ast/M_{\\rm vir}$ and $f_{\\rm j}=j_\\ast/j_{\\rm vir}$. We infer that at $z=0.9$ both $f_{\\rm M}$ and $f_{\\rm j}$ are higher and less mass-dependent than at $z=0$. We speculate that the evolution of $f_{\\rm j}$ can be driven by more efficient and centrally concentrated stellar feedback at $z=0.9$, or by an appreciable dry merger history. We also show that assuming the galaxies populating our $z=0.9$ relations evolve into those populating the $z=0$ relations leads to an apparent discrepancy with the hierarchical growth of dark matter halos. To solve this issue, one needs to evoke a progenitor bias scenario, unknown systematics affecting our and previous measurements, or consider the possibility that H$\\alpha$ kinematics is not a reliable dynamical tracer.",
      "pdf_url": "https://arxiv.org/pdf/2511.08685.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10640",
      "title": "Flexible Simulation Based Inference for Galaxy Photometric Fitting with Synthesizer",
      "authors": [
        "Thomas Harvey",
        "Christopher C. Lovell",
        "Sophie Newman",
        "Christopher J. Conselice",
        "Duncan Austin",
        "William J. Roper",
        "Aswin P. Vijayan",
        "Stephen M. Wilkins",
        "Patricia Iglesias-Navarro",
        "Vadim Rusakov",
        "Qiong Li",
        "Nathan Adams",
        "Kai Magdwick",
        "Caio M. Goolsby",
        "Marc Huertas-Company",
        "Matthew Ho"
      ],
      "abstract": "Flexible Simulation Based Inference for Galaxy Photometric Fitting with Synthesizer Thomas Harvey, Christopher C. Lovell, Sophie Newman, Christopher J. Conselice, Duncan Austin, William J. Roper, Aswin P. Vijayan, Stephen M. Wilkins, Patricia Iglesias-Navarro, Vadim Rusakov, Qiong Li, Nathan Adams, Kai Magdwick, Caio M. Goolsby, Marc Huertas-Company, Matthew Ho 23 pages, 12 figures. Submitted to MNRAS. Comments welcome. The Synference package is available at this https URL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We introduce Synference, a new, flexible Python framework for galaxy SED fitting using simulation-based inference (SBI). Synference leverages the Synthesizer package for flexible forward-modelling of galaxy SEDs and integrates the LtU-ILI package to ensure best practices in model training and validation. In this work we demonstrate Synference by training a neural posterior estimator on $10^6$ simulated galaxies, based on a flexible 8-parameter physical model, to infer galaxy properties from 14-band HST and JWST photometry. We validate this model, demonstrating excellent parameter recovery (e.g. R$^2>$0.99 for M$_\\star$) and accurate posterior calibration against nested sampling results. We apply our trained model to 3,088 spectroscopically-confirmed galaxies in the JADES GOODS-South field. The amortized inference is exceptionally fast, having nearly fixed cost per posterior evaluation and processing the entire sample in $\\sim$3 minutes on a single CPU (18 galaxies/CPU/sec), a $\\sim$1700$\\times$ speedup over traditional nested sampling or MCMC techniques. We demonstrate Synference's ability to simultaneously infer photometric redshifts and physical parameters, and highlight its utility for rapid Bayesian model comparison by demonstrating systematic stellar mass differences between two commonly used stellar population synthesis models. Synference is a powerful, scalable tool poised to maximise the scientific return of next-generation galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.10640.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10700",
      "title": "Spectropolarimetric Evolution Reveals Dual-Axis Ejecta in the Atypical Magnetar-Powered SN 2012au",
      "authors": [
        "Sabrina DeSoto",
        "JenniferL.Hoffman",
        "G. Grant Williams",
        "Christopher Bilinski",
        "Douglas C. Leonard",
        "Peter A. Milne",
        "Christopher Pickens",
        "Manisha Shrestha",
        "Nathan Smith",
        "Paul S.Smith"
      ],
      "abstract": "Spectropolarimetric Evolution Reveals Dual-Axis Ejecta in the Atypical Magnetar-Powered SN 2012au Sabrina DeSoto, JenniferL.Hoffman, G. Grant Williams, Christopher Bilinski, Douglas C. Leonard, Peter A. Milne, Christopher Pickens, Manisha Shrestha, Nathan Smith, Paul S.Smith High Energy Astrophysical Phenomena (astro-ph.HE) We present six epochs of optical spectropolarimetric observations of the unique and slow-evolving Type Ib supernova (SN) 2012au, between 0 and 295 days post R-band maximum. The polarization levels seen throughout our observations are on average 0.87% +/- 0.05% higher than those of any Type Ib SN~yet studied, suggesting either that it is the most asymmetric of the sample, or if all SNe Ib have similar asymmetry, that it is viewed at a more optimum angle. Significant continuum polarization indicates that the photosphere exhibited a global departure from spherical symmetry at the level of 10%-40% at the earliest times (days 0--40), which decreased to 0%-20% by days 57--90. During the early photospheric phase, the ejecta maintained a near-constant orientation of 12°-20° on the sky, as shown by the dominant axis in the Stokes q-u plane. Polarization signatures in the Fe II {\\lambda}{\\lambda}{\\lambda}4924, 5018, 5169 lines shared this axis. Meanwhile, high levels of polarization associated with the He I lines traced distinct q-u loops with a dramatic rotation away from the dominant axis, indicating that the early-time ejecta were also characterized by hot, fast, helium-rich material concentrated near the poles. At day 295, during the transition to the nebular phase, a new, highly elongated structure became prominent in the ejecta, with an axis orthogonal to the dominant axis that defined the photospheric phase. This dual-axis geometry may link SN 2012au's high luminosity and asymmetric structure to a magnetar powering mechanism.",
      "pdf_url": "https://arxiv.org/pdf/2511.10700.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10728",
      "title": "Widening of Binaries via Non-conservative Mass Transfer as a Formation Channel for Gaia Black Hole System",
      "authors": [
        "Aleksandra Olejak",
        "Jakub Klencki",
        "Alejandro Vigna-Gomez",
        "Selma E. de Mink",
        "Lieke van Son",
        "Jakob Stegmann",
        "Taeho Ryu",
        "David D. Hendriks"
      ],
      "abstract": "Widening of Binaries via Non-conservative Mass Transfer as a Formation Channel for Gaia Black Hole System Aleksandra Olejak, Jakub Klencki, Alejandro Vigna-Gomez, Selma E. de Mink, Lieke van Son, Jakob Stegmann, Taeho Ryu, David D. Hendriks 12 pages, comments are very welcome High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The detected Gaia systems hosting compact objects challenge standard models of binary star evolution. In particular, if the observed black hole (BH) systems evolved in isolation, it is expected that they underwent a mass transfer phase. Given their highly unequal mass ratios, such mass transfer is dynamically unstable within standard models, leading to either a stellar merger or a final binary with a very short orbital period. In contrast, the observed systems have much wider orbits than predicted, making their formation within conventional evolutionary frameworks difficult to reconcile. With the aid of detailed binary evolution calculations, we test whether fully non-conservative mass transfer, where mass is lost from the system carrying the specific angular momentum of the donor's center of mass, can explain the properties of two of the Gaia BH systems. This mass-loss geometry differs from the standard isotropic re-emission model, which assumes mass loss from the accretor's vicinity. We find that our mass-loss model, without the need for fine-tuning, reproduces the observed orbital periods of the two Gaia BH systems remarkably well across a wide range of initial conditions. This scenario, therefore, offers a plausible formation pathway for these systems. We speculate that orbital widening during mass loss could result from the unequal Roche-lobe sizes of the components and eruptive mass loss driven by the donor's high-opacity subsurface layers. Similar mass loss may also be relevant for all other classes of post-mass-transfer binaries that face analogous evolutionary challenges, including Gaia neutron star and white dwarf systems, binaries hosting stripped-envelope Wolf-Rayet stars, and low-mass X-ray binaries.",
      "pdf_url": "https://arxiv.org/pdf/2511.10728.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10736",
      "title": "Intra-night optical polarization monitoring of blazars",
      "authors": [
        "Aristeidis Polychronakis",
        "Ioannis Liodakis",
        "Anastasia Glykopoulou",
        "Dmitry Blinov",
        "Ivan Agudo",
        "Svetlana G. Jorstad",
        "Beatriz Agis-Gonzalez",
        "Sara Capecchiacci",
        "Alberto Floris",
        "Sebastian Kielhmann",
        "John A. Kypriotakis",
        "Dimitrios A. Langis",
        "Nikos Mandarakas",
        "Karan Pal",
        "Francisco J. Aceituno",
        "Giacomo Bonnoli",
        "Victor Casanova",
        "Gabriel Emery",
        "Juan Escudero Pedrosa",
        "Jorge Otero-Santos",
        "Daniel Morcuende",
        "Alfredo Sota",
        "Vilppu Piirola"
      ],
      "abstract": "Intra-night optical polarization monitoring of blazars Aristeidis Polychronakis, Ioannis Liodakis, Anastasia Glykopoulou, Dmitry Blinov, Ivan Agudo, Svetlana G. Jorstad, Beatriz Agis-Gonzalez, Sara Capecchiacci, Alberto Floris, Sebastian Kielhmann, John A. Kypriotakis, Dimitrios A. Langis, Nikos Mandarakas, Karan Pal, Francisco J. Aceituno, Giacomo Bonnoli, Victor Casanova, Gabriel Emery, Juan Escudero Pedrosa, Jorge Otero-Santos, Daniel Morcuende, Alfredo Sota, Vilppu Piirola Accepted for publication in A&A, comments welcome, 7 pages, 5 figures High Energy Astrophysical Phenomena (astro-ph.HE) Blazars are known for their extreme variability across the electromagnetic spectrum. Variability at very short timescales can push the boundaries between competing models offering us much needed discriminating power. This is particularly true for polarization variability that allows us to probe particle acceleration and high-energy emission models in blazars. Here we present results from the first pilot study of intra-night optical polarization monitoring conducted using RoboPol at the Skinakas Observatory and supplemented by observations from the Calar Alto, Perkins, and Sierra Nevada observatories. Our results show that while variability patterns can widely vary between sources, variability on timescales as short as minutes is prevalent in blazar jets. The amplitude of variations are typically small, a few percent for the polarization degree and less than 20 degrees for the polarization angle, pointing to a significant contribution to the optical emission from a turbulent magnetic field component, while the overall stability of the polarization angle over time points to a preferred magnetic field orientation.",
      "pdf_url": "https://arxiv.org/pdf/2511.10736.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10739",
      "title": "Hybrid Simulations of Supersonic Shear Flows: I) Particle Acceleration",
      "authors": [
        "Naixin Liang",
        "Damiano Caprioli"
      ],
      "abstract": "Hybrid Simulations of Supersonic Shear Flows: I) Particle Acceleration Naixin Liang, Damiano Caprioli High Energy Astrophysical Phenomena (astro-ph.HE) Supersonic flows are ubiquitous in warm and cool media; their dissipation leads to heating, generation of nonthermal particles, and amplification of background magnetic fields. We present 2D hybrid (kinetic ions - fluid electrons) simulations of decaying shear flows across the subsonic-to-supersonic transition, finding that the canonical Kelvin-Helmholtz instability in subsonic cases gives way to the formation of shocklets in supersonic shears, where dissipation is faster and nonthermal particles are produced. We discuss the dependence on the flow Mach number of particle acceleration, the viscosity induced by kinetic effects, and the production of magnetic turbulence. We outline the potential impact of these findings for turbulence in the warm interstellar medium, for molecular clouds, and for accretion disks, leaving to a companion paper the discussion of the effects on the shear of self-generated and pre-existing energetic particles.",
      "pdf_url": "https://arxiv.org/pdf/2511.10739.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10744",
      "title": "XSNAP: An X-ray Supernova Analysis Pipeline with Application to the Type II Supernova 2024ggi",
      "authors": [
        "Ferdinand",
        "W. V. Jacobson-Galán",
        "M. M. Kasliwal",
        "Erez A. Zimmerman"
      ],
      "abstract": "XSNAP: An X-ray Supernova Analysis Pipeline with Application to the Type II Supernova 2024ggi Ferdinand, W. V. Jacobson-Galán, M. M. Kasliwal, Erez A. Zimmerman 12 pages, 4 figures, submitted to ApJ. Software code is available at this https URL or this https URL High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) X-ray observations of Type II supernovae (SNe II) probe the physics of supernova (SN) shocks and the mass-loss histories of their progenitor stars. We present multi-epoch, X-ray observations of SN II 2024ggi ($D \\approx 7.2 \\ \\rm Mpc$) from ${\\it Swift}$-XRT, ${\\it Chandra}$ and ${\\it XMM}$, which cover $\\sim 1 - 344$ days since first light. We analyze these observations using a new open-source Python package called $\\texttt{XSNAP}$, which standardizes a unified command-line interface for instrument-specific reduction and spectral extraction. $\\texttt{XSNAP}$ introduces application programming interfaces for per-epoch spectral modeling through $\\texttt{PyXspec}$ and $\\texttt{emcee}$ Markov chain Monte Carlo fitting. We employ ${\\tt XSNAP}$ to model the multi-epoch X-ray spectra of SN 2024ggi with an absorbed thermal bremsstrahlung model and calculate a steady progenitor mass-loss rate of $(6.2\\pm0.2)\\times10^{-5}\\,M_{\\odot}\\,\\mathrm{yr^{-1}}$ $(v_{\\rm wind} = 20 \\ \\rm km \\ s^{-1})$, for which the detected X-ray emission traces the final 117 years before explosion. The software is publicly available on GitHub, with a released package on the Python Package Index (PyPI).",
      "pdf_url": "https://arxiv.org/pdf/2511.10744.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10747",
      "title": "Hydrogen-Poor Superluminous Supernovae in the Nebular Phase: Spectral Diversity Due to Ejecta Ionization as a Probe of the Power Source",
      "authors": [
        "Peter K. Blanchard",
        "Edo Berger",
        "Sebastian Gomez",
        "Matt Nicholl",
        "Ryan Chornock",
        "Harsh Kumar",
        "Raffaella Margutti",
        "Daichi Hiramatsu",
        "Huei Sears"
      ],
      "abstract": "Hydrogen-Poor Superluminous Supernovae in the Nebular Phase: Spectral Diversity Due to Ejecta Ionization as a Probe of the Power Source Peter K. Blanchard, Edo Berger, Sebastian Gomez, Matt Nicholl, Ryan Chornock, Harsh Kumar, Raffaella Margutti, Daichi Hiramatsu, Huei Sears 24 pages, 17 figures, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present a large sample of 39 nebular-phase optical spectra of 25 hydrogen-poor superluminous supernovae (SLSNe-I) and jointly analyze them with previously published spectra of 12 events. We measure the properties of key emission features, namely those at 6300, 7300, and 7774 angstroms (associated with [O I], [Ca II]/[O II], and O I, respectively), and find that SLSNe exhibit much wider spectral diversity than normal SNe Ic, primarily in the line ratio $L_{7300}/L_{6300}$, which is highly sensitive to ejecta ionization. Some events exhibit weak [O I] and a clear [O II] contribution to the 7300 angstrom feature, enhancing the ratio, along with [O III] lines at 4363 and 5007 angstroms. Other SLSNe show weak or no lines of ionized oxygen. Moreover, we find that the population exhibits decreasing $L_{7300}/L_{6300}$ over time, while a few outliers instead display sustained high or increasing ratios for extended periods. The ratio $L_{7300}/L_{6300}$ is also correlated with the rise and decline times of the light curves, with slower events exhibiting higher ionization, the first robust connection between early light curve and late-time spectral properties, likely due to the magnetar's impact: slower-evolving SLSNe are generally powered by engines with longer spin-down timescales, which deposit more energy at later phases. Among the events with decreasing $L_{7300}/L_{6300}$, SLSNe with high ionization are on average powered by magnetars with higher thermalized spin-down power, a correlation that is most significant for events with $M_{\\rm ej}\\lesssim12$ M$_{\\odot}$. The ionization in the outliers with increasing $L_{7300}/L_{6300}$ may be due to late CSM interaction. $L_{7300}/L_{6300}$ and its evolution are therefore key diagnostics of SLSN engines and progenitor mass loss.",
      "pdf_url": "https://arxiv.org/pdf/2511.10747.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10944",
      "title": "EUSO-SPB2 Cherenkov Telescope: Overview and First Neutrino Constraints",
      "authors": [
        "Tobias Heibges",
        "Diksha Garg",
        "Claire Guépin",
        "Julia Burton-Heibges",
        "John F. Krizmanic",
        "Mary Hall Reno",
        "Tonia M. Venters",
        "Lawrence Wiencke"
      ],
      "abstract": "EUSO-SPB2 Cherenkov Telescope: Overview and First Neutrino Constraints Tobias Heibges, Diksha Garg, Claire Guépin, Julia Burton-Heibges, John F. Krizmanic, Mary Hall Reno, Tonia M. Venters, Lawrence Wiencke (for the JEM-EUSO Collaboration) 11 pages, 4 figures, 39th International Cosmic Ray Conference (ICRC 2025) High Energy Astrophysical Phenomena (astro-ph.HE) Earth-skimming tau neutrinos with energies above $\\sim 10$ PeV can convert to tau leptons that decay in the atmosphere and initiate upward-going extensive air showers that generate optical Cherenkov signals. On a curtailed NASA balloon flight in May 2023, the Cherenkov telescope (CT) on the Extreme Universe Space Observatory on a Super Pressure Balloon 2 (EUSO-SPB2) was launched and had a short flight at $\\sim 30$ km altitude. With some time pointing below the Earth's limb, EUSO-SPB2 CT data allow searches for neutrino events that yield optical flashes from the forward-beamed Cherenkov light. We present an overview of the CT and provide upper limits for the diffuse astrophysical neutrino flux from flight data as a proof-of-principle demonstration. We also briefly describe how the methodology is extended to potential transient neutrino point sources.",
      "pdf_url": "https://arxiv.org/pdf/2511.10944.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11050",
      "title": "Measurement of cosmic-ray muon flux at CJPL-II",
      "authors": [
        "P. Zhang",
        "H. Ma",
        "W. Dai",
        "M. Jing",
        "L. Yang",
        "Q. Yue",
        "Z. Zeng",
        "J.Cheng"
      ],
      "abstract": "Measurement of cosmic-ray muon flux at CJPL-II P. Zhang, H. Ma, W. Dai, M. Jing, L. Yang, Q. Yue, Z. Zeng, J.Cheng Astroparticle Physics 172 (2025) 103147 High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) In China Jinping Underground Laboratory (CJPL), the deepest and largest underground laboratory globally, the cosmic-ray muon flux is significantly reduced due to the substantial shielding provided by the overlying mountain. From 2016 to 2020, we measured the muon flux in the second phase of CJPL (CJPL-II) with a plastic scintillator muon telescope system, detecting 161 muon events over an effective live time of 1098 days. The detection efficiency was obtained by simulating the underground muon energy and angular distributions and the telescope system's response to underground muons. The cosmic-ray muon flux is determined to be (3.03 $\\pm$ 0.24 (stat) $\\pm$ 0.18 (sys)) $\\times$ 10$^{-10}$ cm$^{-2}$s$^{-1}$, which is the lowest among underground laboratories worldwide.",
      "pdf_url": "https://arxiv.org/pdf/2511.11050.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11075",
      "title": "Highly Polarized Intrinsic Emission and its Orthogonal Counterpart in Vela X-1",
      "authors": [
        "WanYun Wu",
        "Fei Xie",
        "Long Ji",
        "Mingyu Ge",
        "Fabio La Monaca"
      ],
      "abstract": "Highly Polarized Intrinsic Emission and its Orthogonal Counterpart in Vela X-1 WanYun Wu, Fei Xie, Long Ji, Mingyu Ge, Fabio La Monaca 14 pages, 8 figures. Accepted for publication in APJ High Energy Astrophysical Phenomena (astro-ph.HE) Vela X-1 is one of the most archetypal wind-fed X-ray pulsars (XRPs), and the emergence of its orthogonal polarization states reveals distinctive polarimetric properties. Using data from Imaging X-ray Polarimetry Explorer (IXPE) observations of Vela X-1, we perform a polarization analysis of Vela X-1 using a triple power-law spectral model absorbed by varying column densities, successfully isolating two physically distinct orthogonal polarized components. The first polarized component corresponds to emission from the accretion mound surface that is not obscured by the wind clumps, with its polarization degree (PD) exceeding 30\\%. In specific phase intervals, the PD reaches \\(50.9 \\pm 10.7\\%\\). This marks the first detection of such highly polarized neutron star emission in an XRP. The second polarized component likely originates from complex physical processes within or near the accretion mound, with its PD showing a potential negative correlation with column density. Furthermore, by rotating the predicted polarization angle (PA) of the first polarized component by 90$^\\circ$, we successfully achieve separate fitting and simultaneous fitting of the two orthogonal polarization states using the rotating vector model (RVM).",
      "pdf_url": "https://arxiv.org/pdf/2511.11075.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11336",
      "title": "A glitch in the millisecond pulsar J0900$-$3144",
      "authors": [
        "Bhavnesh Bhat",
        "Michael J. Keith",
        "Ismaël Cognard",
        "Lucas Guillemot",
        "Marcus E. Lower",
        "Matthew T. Miles",
        "Daniel J. Reardon",
        "Golam Shaifullah",
        "Ryan M. Shannon",
        "Benjamin W. Stappers",
        "Gilles Theureau",
        "Shuangqiang Wang",
        "Andrew Zic",
        "Benjamin Shaw"
      ],
      "abstract": "A glitch in the millisecond pulsar J0900$-$3144 Bhavnesh Bhat, Michael J. Keith, Ismaël Cognard, Lucas Guillemot, Marcus E. Lower, Matthew T. Miles, Daniel J. Reardon, Golam Shaifullah, Ryan M. Shannon, Benjamin W. Stappers, Gilles Theureau, Shuangqiang Wang, Andrew Zic, Benjamin Shaw Accepted for Publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) We report the detection of a glitch in the millisecond pulsar (MSP) PSR J0900$-$3144, which is included in the European, MeerKAT and Parkes pulsar timing array experiments. The dataset combines observations from the MeerKAT, Nançay, Lovell, and Murriyang telescopes, spanning a total baseline of approximately 14 years. The glitch occurred on MJD~59942(17), with a measured fractional spin frequency step of $\\Delta \\nu_g / \\nu=1.15(13) \\times 10^{-12}$. This event represents the third glitch detected in a MSP, following those in PSRs B1821$-$24A and J0613$-$0200. Although smaller in amplitude than the previous two, the glitch in PSR J0900$-$3144 is of a comparable order of magnitude. The updated MSP glitch rate is $2.5(1)\\times 10^{-3}$ glitches per pulsar per year, which suggests it is likely current PTAs will detect another MSP glitch within five years. Using simulations, we demonstrate that such small glitches can go undetected, especially in short datasets such as those from new PTAs, and can bias the inferred achromatic noise model parameters, potentially leading to the down-weighting of the pulsar in gravitational wave background searches.",
      "pdf_url": "https://arxiv.org/pdf/2511.11336.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.11396",
      "title": "Modeling the Multi-Wavelength Afterglow of Short Gamma-Ray Bursts with a Plateau Phase",
      "authors": [
        "Chen Deng",
        "Yong-Feng Huang",
        "Abdusattar Kurban",
        "Jin-Jun Geng",
        "Fan Xu",
        "Xiao-Fei Dong",
        "Hao-Xuan Gao",
        "En-Wei Liang",
        "Liang Li"
      ],
      "abstract": "Modeling the Multi-Wavelength Afterglow of Short Gamma-Ray Bursts with a Plateau Phase Chen Deng, Yong-Feng Huang, Abdusattar Kurban, Jin-Jun Geng, Fan Xu, Xiao-Fei Dong, Hao-Xuan Gao, En-Wei Liang, Liang Li High Energy Astrophysical Phenomena (astro-ph.HE) Short gamma-ray bursts (GRBs) exhibiting a plateau phase provide valuable insights into the post-merger activity of their central engines. Although the physical origin of the plateau remains uncertain, the magnetar energy injection model offers a compelling explanation that reproduces the observed temporal and luminosity features. However, previous studies relying solely on X-ray data have suffered from strong parameter degeneracies when constraining the magnetar parameters. Here we perform broadband afterglow modeling on seven short GRBs with plateau features by combining X-ray, optical, and radio observations within the framework of the magnetar energy injection model. Key model parameters are derived by using the Markov Chain Monte Carlo method. It is found that the energy injection substantially modifies the afterglow dynamics in most events. Compared with X-ray--only analyses, our broadband modeling yields systematically a lower magnetic field strength and a shorter spin period for the central magnetar, corresponding to a higher injection luminosity. The study clearly shows that incorporating multi-wavelength data effectively alleviates the degeneracy between the magnetar parameters and X-ray radiative efficiency. In addition, the distribution of our short GRBs differs markedly from long GRBs when they are plotted on the initial Lorentz factor versus gamma-ray energy plane. This offset, consistent with the observed harder spectrum of short GRBs, may serve as a useful diagnostic for investigating the progenitor as larger samples are available.",
      "pdf_url": "https://arxiv.org/pdf/2511.11396.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11432",
      "title": "Star clusters in the gamma-ray sky",
      "authors": [
        "Giada Peron"
      ],
      "abstract": "Star clusters in the gamma-ray sky Giada Peron Plenary highlight talk presented at the 39th International Cosmic Ray Conference 2025 High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Massive Star Clusters (SCs) have been proposed as additional contributors to Galactic Cosmic rays (CRs), to overcome the limitations of supernova remnants (SNRs) to reach the highest energy end of the CR spectrum. Thanks to fast mass losses due to the collective stellar winds, the environment around SCs is potentially suitable for particle acceleration up to PeV energies, and their energetics is enough to account for a non-negligible fraction of the Galactic CRs. Anyhow, the theoretical expectations need to be corroborated by clear observations. Despite the increasing number of detections at different energies, the contamination of other sources often makes it difficult to constrain the contribution arising from stellar winds only, unless one selects objects younger than a few million years, namely before stars start to explode inside clusters. I will review the results obtained with gamma-ray data towards a few massive young star clusters and discuss what implications these result have, especially concerning their contribution to the bulk of Galactic CRs.",
      "pdf_url": "https://arxiv.org/pdf/2511.11432.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10785",
      "title": "The Dawes Review 13: A New Look at The Dynamic Radio Sky",
      "authors": [
        "Tara Murphy",
        "David L. Kaplan"
      ],
      "abstract": "The Dawes Review 13: A New Look at The Dynamic Radio Sky Tara Murphy, David L. Kaplan 59 pages, 11 figures. Accepted for publication in Publications of the Astronomical Society of Australia (PASA) Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Astronomical objects that change rapidly give us insight into extreme environments, allowing us to identify new phenomena, test fundamental physics, and probe the Universe on all scales. Transient and variable radio sources range from the cosmological, such as gamma-ray bursts, to much more local events, such as massive flares from stars in our Galactic neighbourhood. The capability to observe the sky repeatedly, over many frequencies and timescales, has allowed us to explore and understand dynamic phenomena in a way that has not been previously possible. In the past decade, there have been great strides forward as we prepared for the revolution in time domain radio astronomy that is being enabled by the SKA Observatory telescopes, the SKAO pathfinders and precursors, and other `next generation' radio telescopes. Hence it is timely to review the current status of the field, and summarise the developments that have happened to get to our current point. This review focuses on image domain (or `slow') transients, on timescales of seconds to years. We discuss the physical mechanisms that cause radio variability, and the classes of radio transients that result. We then outline what an ideal image domain radio transients survey would look like, and summarise the history of the field, from targeted observations to surveys with existing radio telescopes. We discuss methods and approaches for transient discovery and classification, and identify some of the challenges in scaling up current methods for future telescopes. Finally, we present our current understanding of the dynamic radio sky, in terms of source populations and transient rates, and look at what we can expect from surveys on future radio telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2511.10785.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10927",
      "title": "PRIMA General Observer Science Book Volume 2",
      "authors": [
        "A. Moullet",
        "D. Burgarella",
        "T. Kataria",
        "H. Beuther",
        "C. Battersby",
        "M. Cheng",
        "T. Essinger-Hileman",
        "H. Inami",
        "E. Mills",
        "T. Nagao",
        "S. Unwin"
      ],
      "abstract": "PRIMA General Observer Science Book Volume 2 A. Moullet (NRAO), D. Burgarella (Laboratoire d'Astrophysique de Marseille), T. Kataria (Jet Propulsion Laboratory, California Institute of Technology), H. Beuther (Max Planck Institute for Astronomy), C. Battersby (University of Connecticut), M. Cheng (UC Irvine), T. Essinger-Hileman (NASA Goddard Space Flight Center), H. Inami (Hiroshima University), E. Mills (University of Kansas), T. Nagao (Ehime University), S. Unwin (Jet Propulsion Laboratory, California Institute of Technology) A. Moullet, D. Burgarella, T. Kataria, H. Beuther, C. Battersby, M. Cheng, T. Essinger-Hileman, H. Inami, E. Mills, T. Nagao, S. Unwin are the editors of the GO Science Book. 664 pages Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) This PRobe far-Infrared Mission for Astrophysics (PRIMA) mission concept is a proposed mission to NASA's Astrophysics Probe Explorer (APEX) call. The concept features a cryogenically cooled 1.8 m diameter telescope, and is designed to carry two science instruments covering the 24 to 264 $\\mu$m wavelength range: an imaging polarimeter (PRIMAger) and a spectrometer (FIRESS). The majority of PRIMA's time (75%) will be open to observations proposed by the community (General Observer science / GO), and all of data will be publicly available for archival research (Guest Investigator science / GI). Following up on the successful community engagement created by the first volume of the GO PRIMA Science Book (arXiv:2310.20572), Volume 2 gathers 120 new and updated contributed science cases which could be performed within the context of the PRIMA GO/GI program. This volume reflects the strong development of the community interest, awareness and involvement in PRIMA, and further develops how PRIMA's unprecedented capabilities can be leveraged for an impactful and innovative GO/GI program covering most areas of astrophysics and over 90% of the scientific questions and discovery areas in the Astro2020 decadal survey.",
      "pdf_url": "https://arxiv.org/pdf/2511.10927.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11358",
      "title": "Shadow-Induced Warps in Protoplanetary disks",
      "authors": [
        "Shangjia Zhang",
        "Zhaohuan Zhu",
        "Callum W. Fairbairn"
      ],
      "abstract": "Shadow-Induced Warps in Protoplanetary disks Shangjia Zhang, Zhaohuan Zhu, Callum W. Fairbairn 39 pages, 20 figures, accepted to ApJ, simulation rendering can be downloaded at this https URL Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Shadows are commonly observed in protoplanetary disks in near-infrared and (sub)millimeter images, often cast by misaligned inner disks or other obscuring material. While recent studies show that shadows can alter disk dynamics, only the case symmetric across the midplane (e.g., from a polar-aligned inner disk) has been studied. Here we study shadows cast by an inner disk with a $30^\\circ$ mutual inclination using 3D radiation-hydrodynamical simulations. Given the same shadow shape and amplitude, the $30^\\circ$ inclined shadow leads to a much stronger accretion compared with the polar case, reaching $\\alpha \\sim$ 1, because the disk is squeezed twice in one azimuth, leading to shocks and strong radial flows near the midplane. The outer disk develops a warp: the inner disk region tilts toward alignment with the shadow, while the outer, exponentially tapered disk tilts and twists in a different direction, inclined $\\sim$ 32$^\\circ$ relative to the inner region. Locally isothermal simulations with a prescribed temperature structure reproduce the effect, confirming that it is thermally driven. Fourier-Hermite analysis shows that it is the m=1, n=1 temperature perturbation that drives the warp by launching bending waves, with the tilting response of the disk approximately proportional to the modal amplitude. This mode always exists unless the shadow is coplanar or polar. Given a fixed temperature contrast, the m=1,n=1 mode peaks at $\\sim$15$^\\circ$ mutual inclination, but still contributes substantially across 3$^\\circ$ to 30$^\\circ$. Shadows cause disk warps--they are not only a consequence of them. We discuss testable predictions for current and future ALMA and NIR observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.11358.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11541",
      "title": "An optical--mid-infrared color evolution tool for nova identification using WISE data",
      "authors": [
        "Joseph Onuegbu",
        "Dafne Guetta",
        "Yael Hillman",
        "Volker Perdelwitz",
        "Massimo Della Valle"
      ],
      "abstract": "An optical--mid-infrared color evolution tool for nova identification using WISE data Joseph Onuegbu, Dafne Guetta, Yael Hillman, Volker Perdelwitz, Massimo Della Valle Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a novel approach for characterizing nova candidates by exploiting the infrared capabilities of the Wide-field Infrared Survey Explorer (WISE) catalog. We developed a pipeline to identify novae based on well-defined infrared criteria, and leveraging this pipeline, we successfully identified 41 optically confirmed novae in the WISE catalog. In particular, we focus on the color difference between the optical V band and the WISE 3.4 microns W1 band as a diagnostic. We compared their infrared light curves with their optical counterparts. We identified a strong correlation from which we proposed a color difference model that can be used for further identification and characterization of novae. Our analysis validates the mass-loss timescale theory, which predicts that systems with lower accretion rates accumulate larger envelopes and produce more massive ejecta. We also confirm models' prediction that the early color evolution of novae is governed by ejecta expansion and cooling. From our sample statistics, we infer a Galactic nova rate of approximately 40 to 50 novae per year, consistent with modern and infrared-corrected estimates. The resultant model from this work paves the way for future large-scale investigations of nova candidates.",
      "pdf_url": "https://arxiv.org/pdf/2511.11541.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.20091",
      "title": "Gamma-Ray Burst Light Curve Reconstruction: A Comparative Machine and Deep Learning Analysis",
      "authors": [
        "A. Manchanda",
        "A. Kaushal",
        "M. G. Dainotti",
        "A. Deepu",
        "S. Naqi",
        "J. Felix",
        "N. Indoriya",
        "S. P. Magesh",
        "H. Gupta",
        "K. Gupta",
        "A. Madhan",
        "D. H. Hartmann",
        "A. Pollo",
        "M. Bogdan",
        "J. X. Prochaska",
        "N. Fraija",
        "D. Debnath"
      ],
      "abstract": "Gamma-Ray Burst Light Curve Reconstruction: A Comparative Machine and Deep Learning Analysis A. Manchanda, A. Kaushal, M. G. Dainotti, A. Deepu, S. Naqi, J. Felix, N. Indoriya, S. P. Magesh, H. Gupta, K. Gupta, A. Madhan, D. H. Hartmann, A. Pollo, M. Bogdan, J. X. Prochaska, N. Fraija, D. Debnath 37 pages, 10 figures (105 panels), 5 Tables, Accepted in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Gamma-Ray Bursts (GRBs), observed at high-z, are probes of the evolution of the Universe and can be used as cosmological tools. Thus, we need correlations with small dispersion among key parameters. To reduce such a dispersion, we mitigate gaps in light curves (LCs), including the plateau region, key to building the two-dimensional Dainotti relation between the end time of plateau emission (Ta) and its luminosity (La). We reconstruct LCs using nine models: Multi-Layer Perceptron (MLP), Bi-Mamba, Fourier Transform, Gaussian Process-Random Forest Hybrid (GP-RF), Bidirectional Long Short-Term Memory (Bi-LSTM), Conditional GAN (CGAN), SARIMAX-based Kalman filter, Kolmogorov-Arnold Networks (KANs), and Attention U-Net. These methods are compared to the Willingale model (W07) over a sample of 521 GRBs. MLP and Attention U-Net outperform other methods, with MLP reducing the plateau parameter uncertainties by 37.2% for log Ta, 38.0% for log Fa, and 41.2% for alpha (the post-plateau slope in the W07 model), achieving the lowest 5-fold cross-validation (CV) mean squared error (MSE) of 0.0275. Attention U-Net achieved the lowest uncertainty of parameters, a 37.9% reduction in log Ta, a 38.5% reduction in log Fa and a 41.4% reduction in alpha, but with a higher MSE of 0.134. Although Attention U-Net achieves the largest uncertainty reduction, the MLP attains the lowest test MSE while maintaining comparable uncertainty performance, making it the more reliable model. The other methods yield MSE values ranging from 0.0339 to 0.174. These improvements in parameter precision are needed to use GRBs as standard candles, investigate theoretical models, and predict GRB redshifts through machine learning.",
      "pdf_url": "https://arxiv.org/pdf/2412.20091.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.07962",
      "title": "Establishing a Connection Between the Jet and the Corona in Black Hole Low Mass X-Ray Binaries",
      "authors": [
        "Eric Davidson",
        "Jaiverdhan Chauhan",
        "Anne Lohfink",
        "Thomas D. Russell",
        "Rhaana Starling",
        "Charlotte Johnson"
      ],
      "abstract": "Establishing a Connection Between the Jet and the Corona in Black Hole Low Mass X-Ray Binaries Eric Davidson, Jaiverdhan Chauhan, Anne Lohfink, Thomas D. Russell, Rhaana Starling, Charlotte Johnson 14 pages, 6 figures, 1 table, submitted for publication The Astrophysical Journal Letters High Energy Astrophysical Phenomena (astro-ph.HE) Low-mass black hole X-ray Binaries (LMXBs) undergo outbursts, during which their brightness increases greatly for timescales of months. The X-ray accretion and radio jet properties change dramatically throughout an outburst in a broadly consistent way between sources. Changes to the accretion flow and the corona are evident through X-ray spectral variations, while the jet's evolution produces changes in the radio. Typically, high energy emission from the corona initially dominate the X-ray spectrum, and quasi-steady compact jets are observed in the radio. As the outburst progresses, emission from the corona fades and is superseded by lower energy X-ray accretion disk emission. During this transition, the compact jets are quenched and discrete ejecta, called transient jets, are launched. The concurrence of the corona's weakening and the jet's transition from compact to transient implies a connection, but the precise relationship has not been established. Motivated by this, we aim to investigate the corona-jet connection. We perform spectral modeling in the hard and soft X-ray, utilizing $NuSTAR$, $NICER$, and $Swift$/XRT observations to track the evolving X-ray corona for three LMXBs: MAXI J1348-630, MAXI J1535-571 and MAXI J1820+070. We use prior work to mark the presence of compact jets and the dates of discrete jet ejections. We find a clear connection between the evolution of the corona and the jet: across all three sources an increase in the distance of the corona from the black hole occurs near the time that the compact jet is quenched and the transient jet is launched.",
      "pdf_url": "https://arxiv.org/pdf/2505.07962.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.22936",
      "title": "Braking index of the frequently glitching PSR J0537$-$6910",
      "authors": [
        "Erbil Gügercinoğlu",
        "Onur Akbal",
        "M. Ali Alpar",
        "Danai Antonopoulou",
        "Cristóbal M. Espinoza"
      ],
      "abstract": "Braking index of the frequently glitching PSR J0537$-$6910 Erbil Gügercinoğlu, Onur Akbal, M. Ali Alpar, Danai Antonopoulou, Cristóbal M. Espinoza Resubmitted to Astronomy & Astrophysics after addressing the referee's comments. 8 pages, 1 figure High Energy Astrophysical Phenomena (astro-ph.HE) The pulsar J0537$-$6910 undergoes spin-up glitches more frequently than any other known pulsar, at a rate of roughly thrice per year. Its glitches are typically large and accompanied by spin-down rate changes $\\Delta\\dot\\nu$ that partially recover with a nearly constant positive frequency second derivative $\\ddot\\nu$ for the post-glitch intervals. The long-term value of $\\ddot\\nu$, however, is negative because $\\dot\\nu$ has decreased over the years of observations. We wish to determine if permanent shifts (non-relaxing parts of the glitch change $\\Delta\\dot\\nu$ in the spin-down rate, like those observed in the Crab pulsar) can explain the long-term enhancement of the spin-down rate which results in an effective negative braking index. We demonstrate, as a proof of concept, that the actual braking index associated with the pulsar's braking torque can be n~3 if the internal superfluid torque and permanent shifts are considered. We use published RXTE and NICER data to calculate the average permanent shift per glitch needed to bring an underlying braking index $n$ to the effective long-term value n' =-1.2 inferred from the data. We use this average value as the actual permanent shift in each glitch and extract the contributions of the internal and external torques to $\\ddot\\nu$, under the assumption that the next glitch occurs when all glitch-induced offsets to internal torques are fully restored. We find that if the braking index of the magnetospheric torque is close to n~3, moderate permanent changes of the spin-down rate are required, similar to those inferred for the Crab pulsar. The natural mechanism to produce such permanent changes is crustquakes. Crustal failure associated with PSR J0537$-$6910 glitches can have interesting and potentially observable consequences, such as transient changes of the X-ray emission, activation of radio emission, or emission of gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2506.22936.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.13039",
      "title": "EP250207b is not a collapsar fast X-ray transient. Is it due to a compact object merger?",
      "authors": [
        "P.G. Jonker",
        "A.J. Levan",
        "Xing Liu",
        "Dong Xu",
        "Yuan Liu",
        "Xinpeng Xu",
        "An Li",
        "N. Sarin",
        "N.R. Tanvir",
        "G.P. Lamb",
        "M.E. Ravasio",
        "J. Sánchez-Sierras",
        "J.A. Quirola-Vásquez",
        "B.C. Rayson",
        "J.N.D. van Dalen",
        "D.B. Malesani",
        "A.P.C. van Hoof",
        "F. E. Bauer",
        "J. Chacón",
        "S.J. Smartt",
        "A. Martin-Carrillo",
        "G. Corcoran",
        "L. Cotter",
        "A. Rossi",
        "F. Onori",
        "M. Fraser",
        "P.T. O'Brien",
        "R.A.J. Eyles-Ferris",
        "J. Hjorth",
        "T.-W. Chen",
        "G. Leloudas",
        "L. Tomasella",
        "S. Schulze",
        "M. De Pasquale",
        "F. Carotenuto",
        "J. Bright",
        "Chenwei Wang",
        "Shaolin Xiong",
        "Jinpeng Zhang",
        "Wangchen Xue",
        "Jiacong Liu",
        "Chengkui Li",
        "D. Mata Sanchez",
        "M.A.P. Torres"
      ],
      "abstract": "EP250207b is not a collapsar fast X-ray transient. Is it due to a compact object merger? P.G. Jonker, A.J. Levan, Xing Liu, Dong Xu, Yuan Liu, Xinpeng Xu, An Li, N. Sarin, N.R. Tanvir, G.P. Lamb, M.E. Ravasio, J. Sánchez-Sierras, J.A. Quirola-Vásquez, B.C. Rayson, J.N.D. van Dalen, D.B. Malesani, A.P.C. van Hoof, F. E. Bauer, J. Chacón, S.J. Smartt, A. Martin-Carrillo, G. Corcoran, L. Cotter, A. Rossi, F. Onori, M. Fraser, P.T. O'Brien, R.A.J. Eyles-Ferris, J. Hjorth, T.-W. Chen, G. Leloudas, L. Tomasella, S. Schulze, M. De Pasquale, F. Carotenuto, J. Bright, Chenwei Wang, Shaolin Xiong, Jinpeng Zhang, Wangchen Xue, Jiacong Liu, Chengkui Li, D. Mata Sanchez, M.A.P. Torres 15 pages, 11 Figures (+2 in an Appendix), accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Fast X-ray Transients (FXTs) are short-lived extra-galactic X-ray sources. Recent progress through multi-wavelength follow-up of Einstein Probe discovered FXTs has shown that several are related to collapsars, which can also produce gamma-ray bursts (GRBs). In this paper we investigate the nature of the FXT EP250207b. The VLT/MUSE spectra of a nearby (15.9 kpc in projection) lenticular galaxy reveal no signs of recent star formation. If this galaxy is indeed the host, EP250207b lies at a redshift of z=0.082, implying a peak observed absolute magnitude for the optical counterpart of M_r=-14.5. At the time when supernovae (SNe) would peak, it is substantially fainter than all SN types. These results are inconsistent with a collapsar origin for EP250207b. The properties favour a binary compact object merger driven origin. The X-ray, optical and radio observations are compared with predictions of several types of extra-galactic transients, including afterglow and kilonova models. The data can be fit with a slightly off-axis viewing angle afterglow. However, the late-time (~30 day) optical/NIR counterpart is too bright for the afterglow and also for conventional kilonova models. This could be remedied if that late emission is due to a globular cluster or the core of a (tidally disrupted) dwarf galaxy. If confirmed, this would be the first case where the multi-wavelength properties of an FXT are found to be consistent with a compact object merger origin, increasing the parallels between FXTs and GRBs. We finally discuss if the source could originate in a higher redshift host galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2508.13039.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09827",
      "title": "Discovery and Analysis of Afterglows from Poorly Localised GRBs with the Gravitational-wave Optical Transient Observer (GOTO) All-sky Survey",
      "authors": [
        "Amit Kumar",
        "B. P. Gompertz",
        "B. Schneider",
        "S. Belkin",
        "M. E. Wortley",
        "A. Saccardi",
        "D. O'Neill",
        "K. Ackley",
        "B. Rayson",
        "A. de Ugarte Postigo",
        "A. Gulati",
        "D. Steeghs",
        "D. B. Malesani",
        "J. R. Maund",
        "M. J. Dyer",
        "S. Giarratana",
        "M. Serino",
        "Y. Julakanti",
        "B. Kumar",
        "D. Xu",
        "R. A. J. Eyles-Ferris",
        "Z.-P. Zhu",
        "B. Warwick",
        "Y.-D. Hu",
        "I. Allen",
        "G. Ramsay",
        "R. L. C. Starling",
        "J. Lyman",
        "K. Ulaczyk",
        "B. Godson",
        "D. K. Galloway",
        "V. S. Dhillon",
        "P. O'Brien",
        "K. Noysena",
        "R. Kotak",
        "R. P. Breton",
        "L. K. Nuttall",
        "D. Pollacco",
        "J. Casares",
        "T. L. Killestein",
        "M. R. Kennedy",
        "N. Habeeb",
        "S. Moran",
        "K. Wiersema",
        "I. Worssam",
        "D. L. Coppejans",
        "C. A. Phillips",
        "A. Martin-Carrillo",
        "N. S. Pankov",
        "J. F. Agüí Fernández",
        "M. A. Aloy",
        "J. An",
        "G. E. Anderson",
        "A. Bochenek",
        "A. J. Castro-Tirado",
        "X. Chen",
        "L. Cotter",
        "R. Dastidar",
        "M. De Pasquale",
        "V. D'Elia",
        "Y. Fang",
        "S. Y. Fu",
        "J. P. U. Fynbo",
        "D. H. Hartmann",
        "L. B. He",
        "L. Izzo",
        "S. Q. Jiang",
        "Y. Kawakubo",
        "E. V. Klunko",
        "A. J. Levan",
        "X.-W. Liu",
        "X. Liu",
        "G. Lombardi",
        "E. Maiorano",
        "J. T. Palmerio",
        "D. A. Perley",
        "D. L. A. Pieterse",
        "A. S. Pozanenko",
        "G. Pugliese",
        "A. Rossi",
        "B. Sbarufatti",
        "S. Bijavara Seshashayana",
        "N. R. Tanvir",
        "C. C. Thöne",
        "A. J. van der Horst",
        "S. D. Vergani",
        "A. A. Volnova",
        "R. A. M. J. Wijers",
        "J. L. Wise"
      ],
      "abstract": "Discovery and Analysis of Afterglows from Poorly Localised GRBs with the Gravitational-wave Optical Transient Observer (GOTO) All-sky Survey Amit Kumar, B. P. Gompertz, B. Schneider, S. Belkin, M. E. Wortley, A. Saccardi, D. O'Neill, K. Ackley, B. Rayson, A. de Ugarte Postigo, A. Gulati, D. Steeghs, D. B. Malesani, J. R. Maund, M. J. Dyer, S. Giarratana, M. Serino, Y. Julakanti, B. Kumar, D. Xu, R. A. J. Eyles-Ferris, Z.-P. Zhu, B. Warwick, Y.-D. Hu, I. Allen, G. Ramsay, R. L. C. Starling, J. Lyman, K. Ulaczyk, B. Godson, D. K. Galloway, V. S. Dhillon, P. O'Brien, K. Noysena, R. Kotak, R. P. Breton, L. K. Nuttall, D. Pollacco, J. Casares, T. L. Killestein, M. R. Kennedy, N. Habeeb, S. Moran, K. Wiersema, I. Worssam, D. L. Coppejans, C. A. Phillips, A. Martin-Carrillo, N. S. Pankov, J. F. Agüí Fernández, M. A. Aloy, J. An, G. E. Anderson, A. Bochenek, A. J. Castro-Tirado, X. Chen, L. Cotter, R. Dastidar, M. De Pasquale, V. D'Elia, Y. Fang, S. Y. Fu, J. P. U. Fynbo, D. H. Hartmann, L. B. He, L. Izzo, S. Q. Jiang, Y. Kawakubo, E. V. Klunko, A. J. Levan, X.-W. Liu, X. Liu, G. Lombardi, E. Maiorano, J. T. Palmerio, D. A. Perley, D. L. A. Pieterse, A. S. Pozanenko, G. Pugliese, A. Rossi, B. Sbarufatti, S. Bijavara Seshashayana, N. R. Tanvir, C. C. Thöne, A. J. van der Horst, S. D. Vergani, A. A. Volnova, R. A. M. J. Wijers, J. L. Wise 51 pages, 27 figures, 15 tables. Matches the published version in MNRAS. Accepted on 26 September 2025; originally submitted on 11 September 2025 MNRAS, Volume 544, Issue 2, December 2025, Pages 1541-1587 High Energy Astrophysical Phenomena (astro-ph.HE) Gamma-ray bursts (GRBs), particularly those detected by wide-field instruments such as the Fermi/GBM, pose a challenge for optical follow-up due to their large initial localisation regions, leaving many GRBs without identified afterglows. The Gravitational-wave Optical Transient Observer (GOTO), with its wide field of view, dual-site coverage, and robotic rapid-response capability, bridges this gap by rapidly identifying and localising afterglows from alerts issued by space-based facilities, including Fermi, SVOM, Swift, and EP, providing early optical positions for coordinated multiwavelength follow-up. In this paper, we present optical afterglow localisation and multiband follow-up of five Fermi/GBM (240619A, 240910A, 240916A, 241002B, and 241228B) and two MAXI/GSC (240122A and 240225B) triggered long GRBs (LGRBs) discovered by GOTO in 2024. Spectroscopy for six GRBs (no spectroscopic data for GRB 241002B) with VLT/X-shooter and GTC/OSIRIS yields precise redshifts spanning $z\\approx0.40-$3.16 and absorption-line diagnostics of host and intervening systems. Radio detections for four events confirm the presence of long-lived synchrotron emission. Prompt-emission analysis with Fermi and MAXI data reveals a spectrally hard population, with two bursts lying $>3\\sigma$ above the Amati relation. Although their optical afterglows resemble those of typical LGRBs, the prompt spectra are consistently harder than the LGRBs' average. Consistent modelling of six GOTO-discovered GRB afterglows yields jet half-opening angles of a few degrees and beaming-corrected kinetic energies ($E_{jet}\\sim10^{51-52}$)erg, consistent with the canonical LGRB population. These findings suggest that optical discovery of poorly localised GRBs may be subject to observational biases favouring luminous events with high spectral peak energy, while also providing insight into jet microphysics and central engine diversity.",
      "pdf_url": "https://arxiv.org/pdf/2509.09827.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.12982",
      "title": "Galactic X-ray Transients in the First eROSITA All Sky Survey",
      "authors": [
        "Vikash Maan",
        "Aman Katira",
        "Kunal. P. Mooley"
      ],
      "abstract": "Galactic X-ray Transients in the First eROSITA All Sky Survey Vikash Maan, Aman Katira, Kunal. P. Mooley 12 pages (Excluding appendix), 18 figures, Published in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Although a multitude of studies have focused on targeted observations of Galactic X-ray transients, blind surveys and population studies have been limited. We have used the ROSAT, eROSITA and Gaia source catalogs to find Galactic X-ray transients having timescales $<$30 years. We report the properties of 738 transients found in our search, majority of which are active stars or interacting binaries. We have also found $\\sim$40 compact object systems among which are at least 8 newly-identified white-dwarf systems, 3 known X-ray binaries, and one known pulsar. We use eROSITA (soft X-ray) spectra of the Galactic transients to show that two distinct types of flaring systems are prevalent: one having peak around 1 keV, well fit by thermal models, and another having peak below 0.2 keV and requiring a power-law component. Our study also reveals that single star or interacting binary systems (X-ray transients) involving giant stars exhibit significantly higher X-ray luminosities than systems involving only main-sequence stars or young stellar objects. Finally, we discuss the properties of the transients in the context of their putative emission mechanisms, the fraction of transients with respect to the total population, and the rates of Galactic transients expected in blind searches of the X-ray sky.",
      "pdf_url": "https://arxiv.org/pdf/2510.12982.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23732",
      "title": "ZTF25abjmnps (AT2025ulz) and S250818k: A Candidate Superkilonova from a Sub-threshold Sub-Solar Gravitational Wave Trigger",
      "authors": [
        "Mansi M. Kasliwal",
        "Tomas Ahumada",
        "Robert Stein",
        "Viraj Karambelkar",
        "Xander J. Hall",
        "Avinash Singh",
        "Christoffer Fremling",
        "Brian D. Metzger",
        "Mattia Bulla",
        "Vishwajeet Swain",
        "Sarah Antier",
        "Marion Pillas",
        "Malte Busmann",
        "James Freeburn",
        "Sergey Karpov",
        "Aleksandra Bochenek",
        "Brendan O'Connor",
        "Daniel A. Perley",
        "Dalya Akl",
        "Shreya Anand",
        "Andrew Toivonen",
        "Sam Rose",
        "Theophile Jegou du Laz",
        "Chang Liu",
        "Kaustav Das",
        "Sushant Sharma Chaudhary",
        "Tyler Barna",
        "Aditya Pawan Saikia",
        "Igor Andreoni",
        "Eric C. Bellm",
        "Varun Bhalerao",
        "S. Bradley Cenko",
        "Michael W. Coughlin",
        "Daniel Gruen",
        "Daniel Kasen",
        "Adam A. Miller",
        "Samaya Nissanke",
        "Antonella Palmese",
        "Jesper Sollerman",
        "Niharika Sravan",
        "G.C. Anupama",
        "Smaranika Banerjee",
        "Sudhanshu Barway",
        "Joshua S. Bloom",
        "Tomas Cabrera",
        "Tracy Chen",
        "Chris Copperwheat",
        "Alessandra Corsi",
        "Richard Dekany",
        "Nicholas Earley",
        "Matthew Graham",
        "Patrice Hello",
        "George Helou",
        "Lei Hu",
        "Yves Kini",
        "Ashish Mahabal",
        "Frank Masci",
        "Tanishk Mohan",
        "Natalya Pletskova",
        "Josiah Purdum",
        "Yu-Jing Qin",
        "Nabeel Rehemtulla",
        "Anirudh Salgundi",
        "Yuankun Wang"
      ],
      "abstract": "ZTF25abjmnps (AT2025ulz) and S250818k: A Candidate Superkilonova from a Sub-threshold Sub-Solar Gravitational Wave Trigger Mansi M. Kasliwal, Tomas Ahumada, Robert Stein, Viraj Karambelkar, Xander J. Hall, Avinash Singh, Christoffer Fremling, Brian D. Metzger, Mattia Bulla, Vishwajeet Swain, Sarah Antier, Marion Pillas, Malte Busmann, James Freeburn, Sergey Karpov, Aleksandra Bochenek, Brendan O'Connor, Daniel A. Perley, Dalya Akl, Shreya Anand, Andrew Toivonen, Sam Rose, Theophile Jegou du Laz, Chang Liu, Kaustav Das, Sushant Sharma Chaudhary, Tyler Barna, Aditya Pawan Saikia, Igor Andreoni, Eric C. Bellm, Varun Bhalerao, S. Bradley Cenko, Michael W. Coughlin, Daniel Gruen, Daniel Kasen, Adam A. Miller, Samaya Nissanke, Antonella Palmese, Jesper Sollerman, Niharika Sravan, G.C. Anupama, Smaranika Banerjee, Sudhanshu Barway, Joshua S. Bloom, Tomas Cabrera, Tracy Chen, Chris Copperwheat, Alessandra Corsi, Richard Dekany, Nicholas Earley, Matthew Graham, Patrice Hello, George Helou, Lei Hu, Yves Kini, Ashish Mahabal, Frank Masci, Tanishk Mohan, Natalya Pletskova, Josiah Purdum, Yu-Jing Qin, Nabeel Rehemtulla, Anirudh Salgundi, Yuankun Wang High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) On August 18, 2025, the LIGO-Virgo-KAGRA collaboration reported gravitational waves from a sub-threshold binary neutron star merger. If astrophysical, this event would have a surprisingly low chirp mass, suggesting that at least one neutron star was below a solar mass. The Zwicky Transient Facility mapped the coarse localization and discovered a transient, ZTF25abjmnps (AT2025ulz), that was spatially and temporally coincident with the gravitational wave trigger. The first week of follow-up suggested properties reminiscent of a GW170817-like kilonova. Subsequent follow-up suggests properties most similar to a young, stripped-envelope, Type IIb supernova. Although we cannot statistically rule out chance coincidence, we undertake due diligence analysis to explore the possible association between ZTF25abjmnps and S250818k. Theoretical models have been proposed wherein sub-solar neutron star(s) may form (and subsequently merge) via accretion disk fragmentation or core fission inside a core-collapse supernova i.e. a ``superkilonova\". Here, we qualitatively discuss our multi-wavelength dataset in the context of the superkilonova picture. Future higher significance gravitational wave detections of sub-solar neutron star mergers with extensive electromagnetic follow-up would conclusively resolve this tantalizing multi-messenger association.",
      "pdf_url": "https://arxiv.org/pdf/2510.23732.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.10682",
      "title": "Variations of angular momentum $L_z$ as an indicator of orbital chaos of globular clusters in the central region of the Galaxy with a bar",
      "authors": [
        "A. T.Bajkova",
        "A. A.Smirnov",
        "V. V.Bobylev"
      ],
      "abstract": "Variations of angular momentum $L_z$ as an indicator of orbital chaos of globular clusters in the central region of the Galaxy with a bar A. T.Bajkova, A. A.Smirnov, V. V.Bobylev Publications of the Pulkovo Observatory, N 238, 2025 Astrophysics of Galaxies (astro-ph.GA) It is shown how the violation of the invariance of the $Z$-component of the orbital angular momentum $L_z$ in the axially symmetric potential of the Galaxy with a bar can serve as an indicator of the degree of orbital chaos of globular clusters in the central region of the Galaxy. In this case, the higher the variations of $L_z$ of the orbit over a certain period of time, the higher the chaos of the orbit. In essence, a new method for analyzing orbital dynamics -- regular or chaotic -- is proposed. A high level of correlation between the results of orbit classification by the proposed method and the results of classification by other methods is shown. As a result, a sample of 45 globular clusters in the central region of the Galaxy with a radius of 3.5 kpc is divided into regular, chaotic, and weakly chaotic.",
      "pdf_url": "https://arxiv.org/pdf/2511.10682.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10725",
      "title": "Back to basics: Little Red Dots as galaxies and dust-obscured AGNs in a synthetic NIRCam sky simulated with L-GalaxiesBH",
      "authors": [
        "Diego Herrero-Carrión",
        "Daniele Spinoso",
        "David Izquierdo-Villalba",
        "Tong Su",
        "Silvia Bonoli",
        "Pablo Renard"
      ],
      "abstract": "Back to basics: Little Red Dots as galaxies and dust-obscured AGNs in a synthetic NIRCam sky simulated with L-GalaxiesBH Diego Herrero-Carrión, Daniele Spinoso, David Izquierdo-Villalba, Tong Su, Silvia Bonoli, Pablo Renard 28 pages (5 appendix), 20 figures. Submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) The enigmatic Little Red Dots (LRDs) discovered by the James Webb Space Telescope (JWST) exhibit properties challenging their interpretation as common galaxies or Active Galactic Nuclei (AGN). Understanding their nature is key to placing them within our picture of early galaxy and massive black hole (MBH) evolution. To this aim, we build a realistic comparison between LRD observations with photometric properties of galaxies and AGN simulated by the L-GalaxiesBH model in a NIRCam mock sky. We model stellar continua and emission lines, the MBH emission from accretion disk, infrared radiation from dusty torus, and lines from narrow and broad line regions, accounting for dust attenuation and obscuration. Using realistic photometric cuts, we select a population of LRDs including both AGN and galaxies. The LRD fraction peaks at 40% ($\\sim10^{-4}\\rm Mpc^{-3}$) at $z\\sim4$. Our LRDs are central galaxies spanning $M_*=10^8-10^{10.5}\\rm M_\\odot$. A population of galaxies with $M_*<10^9\\rm M_\\odot$ appear as LRDs due to older stellar populations. At higher masses, LRDs dominate the halo and stellar mass functions ($M_{\\rm vir} > 10^{11.5}\\rm M_\\odot$, $M_* > 10^{9.5}\\rm M_\\odot$), and the interplay between AGN and galaxy emission drives the LRD selection. AGN dominate rest-frame UV-optical emission, while dust obscuration is secondary. LRDs host lighter MBHs ($\\sim 10^{6.5}\\rm M_\\odot$) than non-LRDs ($\\sim 10^{7.5}\\rm M_\\odot$), with fainter emission unable to balance their hosts Balmer breaks. We find no evidence for dominant heavy-seed origin of MBHs. LRD Galaxies (97% hosting MBHs) and LRD AGNs are disk-dominated, with LRD AGNs showing larger bulges formed mainly via disk instabilities.",
      "pdf_url": "https://arxiv.org/pdf/2511.10725.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10727",
      "title": "Large-Scale Structure in COSMOS-Web: Tracing Galaxy Evolution in the Cosmic Web up to $z \\sim 7$ with the Largest JWST Survey",
      "authors": [
        "Hossein Hatamnia",
        "Bahram Mobasher",
        "Sina Taamoli",
        "Jeyhan S. Kartaltepe",
        "Caitlin M. Casey",
        "Hollis B. Akins",
        "Malte Brinch",
        "Nima Chartab",
        "Nicole E. Drakos",
        "Andreas L. Faisst",
        "Steven L. Finkelstein",
        "Maximilien Franco",
        "Finn Giddings",
        "Ghassem Gozaliasl",
        "Ali Hadi",
        "Aryana Haghjoo",
        "Santosh Harish",
        "Olivier Ilbert",
        "Pascale L. Jablonka",
        "Shuowen Jin",
        "Ali Ahmad Khostovan",
        "Anton M. Koekemoer",
        "Ronaldo Laishram",
        "Daizhong Liu",
        "Matteo Maturi",
        "Henry Joy McCracken",
        "Crystal L. Martin",
        "Lauro Moscardini",
        "Diana Scognamiglio",
        "Marko Shuntov",
        "Greta Toni",
        "Alexander de la Vega",
        "John R. Weaver",
        "Lilan Yang"
      ],
      "abstract": "Large-Scale Structure in COSMOS-Web: Tracing Galaxy Evolution in the Cosmic Web up to $z \\sim 7$ with the Largest JWST Survey Hossein Hatamnia, Bahram Mobasher, Sina Taamoli, Jeyhan S. Kartaltepe, Caitlin M. Casey, Hollis B. Akins, Malte Brinch, Nima Chartab, Nicole E. Drakos, Andreas L. Faisst, Steven L. Finkelstein, Maximilien Franco, Finn Giddings, Ghassem Gozaliasl, Ali Hadi, Aryana Haghjoo, Santosh Harish, Olivier Ilbert, Pascale L. Jablonka, Shuowen Jin, Ali Ahmad Khostovan, Anton M. Koekemoer, Ronaldo Laishram, Daizhong Liu, Matteo Maturi, Henry Joy McCracken, Crystal L. Martin, Lauro Moscardini, Diana Scognamiglio, Marko Shuntov, Greta Toni, Alexander de la Vega, John R. Weaver, Lilan Yang 28 pages, 17 figures, 2 tables, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) We present a reconstruction of the large-scale structure using the James Webb Space Telescope's (JWST) COSMOS-Web program to trace environmentally driven galaxy evolution up to $z\\sim7$. We applied a weighted kernel density estimation method to 160,000 galaxies with robust photometric redshifts. We find that stellar mass has a positive correlation with density at all redshifts, stronger for quiescent galaxies (QGs) at $z\\lesssim2.5$, while at higher redshifts ($2.5\\lesssim z\\lesssim5.5$) this trend is confined to extreme overdense environments, consistent with early mass assembly in proto-clusters. The star-formation rate (SFR) shows a negative trend with density for QGs at $z\\lesssim1.2$, reversing at $z\\gtrsim1.8$, while star-forming galaxies (SFGs) show a mild positive correlation up to $z\\sim5.5$. The specific SFR remains nearly flat for SFGs and declines with density for QGs at $z\\lesssim1.2$. Moreover, mass and environmental quenching efficiencies show that mass-driven processes dominate at $z\\gtrsim2.5$, the two processes act with comparable strength between $0.8\\lesssim z\\lesssim2.5$, and environmental quenching becomes stronger for low-mass galaxies ($M_\\star\\lesssim10^{10} M_\\odot$) at $z\\lesssim0.8$. These findings reveal that large-scale structure drives galaxy evolution by enhancing early mass assembly in dense regions and increasingly suppressing star formation in low-mass systems at later times, establishing the environmental role of the cosmic web across cosmic history. COSMOS-Web, the largest JWST survey, provides accurate and deep photometric redshifts, reaching 80% mass completeness at $\\log(M_\\star/M_\\odot)\\sim8.7$ at $z\\sim7$, enabling the first view of how environments shaped galaxy evolution from the epoch of reionization to the present day.",
      "pdf_url": "https://arxiv.org/pdf/2511.10727.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10741",
      "title": "REBELS-IFU: Steeply rising star formation histories and the importance of dust obscuration in massive $z \\simeq7$ galaxies revealed by multi-wavelength observations",
      "authors": [
        "R. Fisher",
        "R. A. A. Bowler",
        "R. K. Cochrane",
        "L. E. Rowland",
        "M. Stefanon",
        "H. S. B. Algera",
        "M. Aravena",
        "R. Bouwens",
        "E. da Cunha",
        "P. Dayal",
        "A. Ferrara",
        "J. A. Hodge",
        "H. Inami",
        "L. Komarova",
        "R. Smit",
        "L. Sommovigo",
        "D. P. Stark",
        "P. P. van der Werf"
      ],
      "abstract": "REBELS-IFU: Steeply rising star formation histories and the importance of dust obscuration in massive $z \\simeq7$ galaxies revealed by multi-wavelength observations R. Fisher, R. A. A. Bowler, R. K. Cochrane, L. E. Rowland, M. Stefanon, H. S. B. Algera, M. Aravena, R. Bouwens, E. da Cunha, P. Dayal, A. Ferrara, J. A. Hodge, H. Inami, L. Komarova, R. Smit, L. Sommovigo, D. P. Stark, P. P. van der Werf 19 Pages, 13 Figures, Submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) Reliable star formation rate (SFR) measurements are essential for understanding early galaxy evolution, yet derived values rely on several assumptions. To address this problem, we investigate the SFRs of 12 massive ($9~<~\\log(M_{\\star}/{\\rm M}_{\\odot})~<~10$) Lyman-break galaxies at $z=6.5-7.7$, drawn from the Atacama Large Millimeter/submillimeter Array (ALMA) Reionization Era Bright Emission Line Survey (REBELS) program. The multi-wavelength data, including JWST NIRSpec IFU spectroscopy and ALMA observations, make this a unique sample for investigating SFR tracers at this epoch. We compare SFRs derived from the rest-UV, H$\\alpha$, and far-infrared emission, and from spectral energy distribution (SED) fits. We apply robust dust attenuation corrections, which are crucial since between $50-80$ per cent of the star formation is obscured, and find a stellar-to-nebular attenuation ratio of $f=0.50\\pm0.08$, consistent with local star-forming galaxies. The majority of the derived total SFRs (medians $25-120$ ${\\rm M}_{\\odot}$ yr$^{-1}$) place the REBELS galaxies systematically above $z=7$ literature star-forming main-sequence relations, and our best-fit star formation histories (SFHs) rise more steeply than lower-mass galaxies at the same redshift. We show that these rising SFHs mean commonly used luminosity-to-SFR conversion factors, derived assuming a constant SFH over given timescales, overestimate the SFRs averaged over these timescales for our galaxies. We provide updated luminosity-to-SFR calibrations for $z\\simeq7$ galaxies with rising SFHs, showing that commonly assumed rest-UV conversion factors overestimate the $100$ Myr average SFR by a factor of $\\simeq3$. Finally, we investigate burstiness indicators in the REBELS-IFU galaxies, finding that the rising SFHs imply that the H$\\alpha$-to-UV luminosity ratio is an unreliable probe of bursty star formation.",
      "pdf_url": "https://arxiv.org/pdf/2511.10741.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10743",
      "title": "REBELS-IFU: Spatially Resolved Ionizing Photon Production Efficiencies of 12 Bright Galaxies in the Epoch of Reionization",
      "authors": [
        "Lena Komarova",
        "Mauro Stefanon",
        "Andres Laza-Ramos",
        "Hiddo S. Algera",
        "Manuel Aravena",
        "Rychard J. Bouwens",
        "Rebecca Bowler",
        "Elisabete da Cunha",
        "Pratika Dayal",
        "Andrea Ferrara",
        "Rebecca Fisher",
        "Themiya Nanayakkara",
        "Lucie E. Rowland",
        "Sander Schouws",
        "Renske Smit",
        "Laura Sommovigo",
        "Daniel P. Stark",
        "Paul van der Verf"
      ],
      "abstract": "REBELS-IFU: Spatially Resolved Ionizing Photon Production Efficiencies of 12 Bright Galaxies in the Epoch of Reionization Lena Komarova, Mauro Stefanon, Andres Laza-Ramos, Hiddo S. Algera, Manuel Aravena, Rychard J. Bouwens, Rebecca Bowler, Elisabete da Cunha, Pratika Dayal, Andrea Ferrara, Rebecca Fisher, Themiya Nanayakkara, Lucie E. Rowland, Sander Schouws, Renske Smit, Laura Sommovigo, Daniel P. Stark, Paul van der Verf 18 pages, 7 figures. Submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Measuring the ionizing photon production efficiency $\\xi_{\\mathrm{ion,0}}$ -- the ratio of ionizing photon output rate $Q_{\\rm H^0}$ to UV continuum luminosity $L_{\\rm UV}$ -- in galaxies at $z > 6$ is crucial for constraining their contribution to cosmic reionization. We present integrated and spatially resolved measurements of $\\xi_{\\mathrm{ion,0}}$ for 12 exceptionally bright ($M_\\mathrm{UV} \\sim -22$ mag) star-forming galaxies at $z \\sim 7$ from the REBELS survey. These measurements are based on JWST NIRSpec/IFU PRISM spectroscopy, probing the rest-frame UV and optical regime. Notably, in 8 of the 12 galaxies, the spectral coverage includes H$\\alpha$, enabling self-consistent dust attenuation estimates in both the ionized gas and stellar continuum via the Balmer decrement and rest-UV slope, respectively. We find global $\\log\\xi_{\\mathrm{ion,0}}$ values ranging from $25.19\\pm0.11$ to $25.61\\pm0.11$, with a weighted mean of $25.44\\pm0.15$, consistent with the canonical value of $\\sim25.3$. Using a sample of 25 star-forming clumps within these galaxies, we explore local variations in LyC production efficiency, finding a broader range, from $24.52\\pm0.21$ to $26.18\\pm0.61$. We identify strong correlations between $\\xi_{\\mathrm{ion,0}}$ and specific star formation rate, star formation surface density, H$\\beta$ equivalent width, and stellar mass. Clumps with the highest $\\xi_{\\mathrm{ion,0}}$ exhibit $\\mathrm{EW}_0(\\mathrm{H}\\beta) \\ge 150$ Angstrom, consistent with young stellar ages. From previous Ly$\\alpha$ measurements in three galaxies, we estimate a typical Ly$\\alpha$ escape fraction of $f_{\\rm esc, Ly\\alpha} \\sim 2\\%$, suggesting similar or lower escape fractions for LyC photons. Combining this with our H$\\alpha$ measurements, we infer ionized bubble sizes $\\sim 1$ pMpc, aligned with expectations from Ly$\\alpha$-detected systems and reionization models.",
      "pdf_url": "https://arxiv.org/pdf/2511.10743.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10825",
      "title": "ALMAGAL V. Relations between the core populations and the parent clump physical properties",
      "authors": [
        "D. Elia",
        "A. Coletta",
        "S. Molinari",
        "E. Schisano",
        "M. Benedettini",
        "Á. Sánchez-Monge",
        "A. Traficante",
        "C. Mininni",
        "A. Nucara",
        "S. Pezzuto",
        "P. Schilke",
        "J. D. Soler",
        "A. Avison",
        "M. T. Beltrán",
        "H. Beuther",
        "S. Clarke",
        "G. A. Fuller",
        "R. S. Klessen",
        "R. Kuiper",
        "U. Lebreuilly",
        "D. C. Lis",
        "T. Möller",
        "L. Moscadelli",
        "A. J. Rigby",
        "P. Sanhueza",
        "F. van der Tak",
        "Q. Zhang",
        "K. L. J. Rygl",
        "M. Merello",
        "C. D. Battersby",
        "P. T. P. Ho",
        "P. D. Klaassen",
        "P. M. Koch",
        "J. Allande",
        "L. Bronfman",
        "F. Fontani",
        "P. Hennebelle",
        "B. Jones",
        "T. Liu",
        "G. Stroud",
        "M. R. A. Wells",
        "A. Ahmadi",
        "C. L. Brogan",
        "F. De Angelis",
        "T. R. Hunter",
        "K. G. Johnston",
        "C. Y. Law",
        "S. J. Liu",
        "S.-Y. Liu",
        "Y. Maruccia",
        "V. -M. Pelkonen",
        "Y.-N. Su",
        "Y. Tang",
        "L. Testi",
        "S. Walch",
        "T. Zhang",
        "H. Zinnecker"
      ],
      "abstract": "ALMAGAL V. Relations between the core populations and the parent clump physical properties D. Elia, A. Coletta, S. Molinari, E. Schisano, M. Benedettini, Á. Sánchez-Monge, A. Traficante, C. Mininni, A. Nucara, S. Pezzuto, P. Schilke, J. D. Soler, A. Avison, M. T. Beltrán, H. Beuther, S. Clarke, G. A. Fuller, R. S. Klessen, R. Kuiper, U. Lebreuilly, D. C. Lis, T. Möller, L. Moscadelli, A. J. Rigby, P. Sanhueza, F. van der Tak, Q. Zhang, K. L. J. Rygl, M. Merello, C. D. Battersby, P. T. P. Ho, P. D. Klaassen, P. M. Koch, J. Allande, L. Bronfman, F. Fontani, P. Hennebelle, B. Jones, T. Liu, G. Stroud, M. R. A. Wells, A. Ahmadi, C. L. Brogan, F. De Angelis, T. R. Hunter, K. G. Johnston, C. Y. Law, S. J. Liu, S.-Y. Liu, Y. Maruccia, V. -M. Pelkonen, Y.-N. Su, Y. Tang, L. Testi, S. Walch, T. Zhang, H. Zinnecker Astrophysics of Galaxies (astro-ph.GA) Context. The fragmentation of massive molecular clumps into smaller, potentially star-forming cores plays a key role in the processes of high-mass star formation. The ALMAGAL project offers high-resolution data to investigate these processes across various evolutionary stages in the Galactic plane. Aims. This study aims at correlating the fragmentation properties of massive clumps, obtained from ALMA observations, with their global physical parameters (e.g., mass, surface density, and temperature) and evolutionary indicators (such as luminosity-to-mass ratio and bolometric temperature) obtained from Herschel observations. It seeks to assess whether the cores evolve in number and mass in tandem with their host clumps, and to determine the possible factors influencing the formation of massive cores (M > 24M_\\odot). Methods. We analyzed the masses of 6348 fragments, estimated from 1.4 mm continuum data for 1007 ALMAGAL clumps. Leveraging this unprecedentedly large data set, we evaluated statistical relationships between clump parameters, estimated over about 0.1 pc scales, and fragment properties, corresponding to scales of a few 1000 au, while accounting for potential biases related to distance and observational resolution. Our results were further compared with predictions from numerical simulations. Results. The fragmentation level correlates preferentially with clump surface density, supporting a scenario of density-driven fragmentation, whereas it does not show any clear dependence on total clump mass. Both the mass of the most massive core and the core formation efficiency show a broad range and increase on average by an order of magnitude in the intervals spanned by evolutionary indicators such as clump dust temperature and the luminosity-to-mass ratio. This suggests that core growth continues throughout the clump evolution, favoring clump-fed over core-fed theoretical scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2511.10825.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11115",
      "title": "The Spatial Evolution of Star Clusters in NGC 628 with JWST",
      "authors": [
        "Anne S. M. Buckner",
        "Ana Duarte-Cabral",
        "Angela Adamo",
        "Sean Linden",
        "Michele Cignoni",
        "Varun Bajaj",
        "Arjan Bik",
        "Giacomo Bortolini",
        "Daniela Calzetti",
        "Matteo Correnti",
        "Bruce G. Elmegreen",
        "Debra M. Elmegreen",
        "Helena Faustino Vieira",
        "John S. Gallagher III",
        "Kathryn Grasha",
        "Benjamin Gregg",
        "Rob A. Gutermuth",
        "Kelsey Johnson",
        "Mark Krumholz Drew Lapeer",
        "Matteo M. Messa",
        "Göran Östlin",
        "Alex Pedrini",
        "Jenna E. Ryon",
        "Linda J. Smith",
        "Monica Tosi"
      ],
      "abstract": "The Spatial Evolution of Star Clusters in NGC 628 with JWST Anne S. M. Buckner, Ana Duarte-Cabral, Angela Adamo, Sean Linden, Michele Cignoni, Varun Bajaj, Arjan Bik, Giacomo Bortolini, Daniela Calzetti, Matteo Correnti, Bruce G. Elmegreen, Debra M. Elmegreen, Helena Faustino Vieira, John S. Gallagher III, Kathryn Grasha, Benjamin Gregg, Rob A. Gutermuth, Kelsey Johnson, Mark Krumholz Drew Lapeer, Matteo M. Messa, Göran Östlin, Alex Pedrini, Jenna E. Ryon, Linda J. Smith, Monica Tosi 17 pages, 13 figures, 4 tables, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We examine the spatial distribution of star clusters in NGC 628 using the statistical tool INDICATE to quantify clustering tendencies. Our sample, based on HST and JWST observations, is the most complete to date, spanning ages from 1 Myr to >100 Myr. We find cluster spatial behaviour varies with galactic position, age, and mass. Most emerging young clusters are tightly spatially associated with each other, while fully emerged clusters are in \\sim1.5 times looser spatial associations, irrespective of age. Young Massive Clusters (YMCs \\ge 10^4 M_{\\odot}) tend to associate with lower-mass clusters but not strongly with other YMCs, implying that intense star formation regions produce a few YMCs alongside many lower-mass clusters rather than multiple YMCs together. Young concentrated clusters show a wide radial distribution in the galactic disk, which narrows with age; with concentrated clusters >100 Myr mostly residing between 2-6 kpc. This pattern may reflect either faster dispersal of isolated tight cluster spatial \"structure\" in a lower gas density outer disk or gradual inside-out growth, with the formation of this structure shifting outward over time. We also detect distinct spatial behaviours for clusters within 2 kpc, linked to the inner Lindblad resonance (\\le1 kpc), nuclear ring (\\sim0.5-1 kpc), and the start of spiral arms (\\sim1.25-2 kpc), suggesting these regions exhibit strong radial motions that could hinder clusters from forming and remaining in tight concentrations. Our results highlight how spatially-resolved studies of clusters can reveal the influence of galactic dynamics on star formation and cluster evolution.",
      "pdf_url": "https://arxiv.org/pdf/2511.11115.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11479",
      "title": "Planetary nebulae as tracers of stellar population properties: a pilot study with MUSE",
      "authors": [
        "Ana Inés Ennis",
        "Johanna Hartke",
        "Fuyan Bian",
        "Claudia Pulsoni",
        "Chiara Spiniello",
        "Magda Arnaboldi",
        "Roberto de Propris"
      ],
      "abstract": "Planetary nebulae as tracers of stellar population properties: a pilot study with MUSE Ana Inés Ennis, Johanna Hartke, Fuyan Bian, Claudia Pulsoni, Chiara Spiniello, Magda Arnaboldi, Roberto de Propris 14 pages + Appendix, 19 Figures, accepted to MNRAS Astrophysics of Galaxies (astro-ph.GA) Planetary nebulae (PNe) are the only single stars in galaxies outside the Local Group that can be used as kinematic tracers of the diffuse light in the extended halo. Analysing their luminosity-specific number density across galaxies of different morphologies has also shown hints that they may be used as tracers of the age and metallicity of stellar populations. A proper understanding of this relation has been hindered by the fact that simultaneously detecting PNe and accurately measuring stellar properties is extremely difficult using classical narrow-band imaging methods, which cannot detect PNe in the bright centres of galaxies. In this work, we use integral-field spectroscopy to overcome this challenge, analysing the inner regions of a sample of ten early-type galaxies from the Extended Planetary Nebulae Survey (ePN.S) for which archival MUSE data was available. With the Diffuse Emission-Line Filter (DELF) technique, we automate the detection of PNe, and perform spectral fitting on the diffuse light to infer kinematics and stellar population parameters. We compare the PN number density profile and its associated alpha-parameter with multiple properties of the host galaxies. We find that our sample follows the previously observationally constrained correlation with the metallicity of the host galaxy. We find a weak anti-correlation between the alpha-parameter and the FUV excess, highlighting the possible relation between the visibility lifetime of PNe on the spectral energy distribution of their host galaxies, with fewer PNe detected in association with stellar populations characterized by a UV excess.",
      "pdf_url": "https://arxiv.org/pdf/2511.11479.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10882",
      "title": "Unveiling the Chemical Complexity and C/O Ratio of the HD 163296 Protoplanetary Disk: Constraints from Multi-line ALMA Observations of Organics, Nitriles, Sulfur-bearing, and Deuterated Molecules",
      "authors": [
        "Parashmoni Kashyap",
        "Liton Majumdar",
        "Edwin A. Bergin",
        "Geoffrey A. Blake",
        "Karen Willacy",
        "Stéphane Guilloteau",
        "Anne Dutrey",
        "Sheng-Yuan Liu",
        "Thomas Henning",
        "Paul F. Goldsmith",
        "Dariusz C. Lis",
        "S. Maitrey",
        "Neal Turner",
        "Raghvendra Sahai",
        "Chin-Fei Lee",
        "Masao Saito"
      ],
      "abstract": "Unveiling the Chemical Complexity and C/O Ratio of the HD 163296 Protoplanetary Disk: Constraints from Multi-line ALMA Observations of Organics, Nitriles, Sulfur-bearing, and Deuterated Molecules Parashmoni Kashyap, Liton Majumdar, Edwin A. Bergin, Geoffrey A. Blake, Karen Willacy, Stéphane Guilloteau, Anne Dutrey, Sheng-Yuan Liu, Thomas Henning, Paul F. Goldsmith, Dariusz C. Lis, S. Maitrey, Neal Turner, Raghvendra Sahai, Chin-Fei Lee, Masao Saito Accepted for publication in The Astrophysical Journal Supplement Series (ApJS). 43 pages, 21 figures, 4 tables Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The physical and chemical conditions within a protoplanetary disk play a crucial role in determining its chemical composition, which is subsequently inherited by any forming planets. To probe these conditions, high-resolution molecular line observations, coupled with modelling, are essential. In this study, we investigate the chemistry of the nearby, massive, and relatively line-rich protoplanetary disk around HD 163296 using high-resolution observations from ALMA across Bands 3, 4, 6, and 7. We constrain the disk-averaged and radial distributions of column density and excitation temperature for the detected molecules using the new retrieval code DRive. The disk chemistry is modelled using the astrochemical code PEGASIS, with variations in the initial elemental C/O ratio. Our modelling, informed by molecular observations of HCO+, DCO+, HCN, DCN, CS, HC3N, H2CO, CH3OH, HNCO, and NH2CHO, allows us to place strong constraints on the C/O ratio, with a best-fit value of 1.1 that is broadly consistent with previous estimates. We present the highest-resolution DCO+ emission map of this disk to date, revealing triple-ringed chemical substructures that closely align with the dust continuum rings. Additionally, our results provide the first and most stringent upper limits on the column densities of NH2CHO and HNCO in this protoplanetary disk, measured at < 7e11 cm-2 and < 1e11 cm-2, respectively. Our chemical models suggest that NH2CHO and HNCO predominantly form on grain surfaces within the disk. However, physico-chemical desorption mechanisms are inefficient at releasing these species into detectable gas-phase abundances, yet they remain promising targets for future ALMA observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.10882.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.13163",
      "title": "Euclid preparation LXXIX. Using mock low surface brightness dwarf galaxies to probe Euclid Wide Survey detection capabilities",
      "authors": [
        "Euclid Collaboration: M. Urbano",
        "P.-A. Duc",
        "M. Poulain",
        "A. A. Nucita",
        "A. Venhola",
        "O. Marchal",
        "M. Kümmel",
        "H. Kong",
        "F. Soldano",
        "E. Romelli",
        "M. Walmsley",
        "T. Saifollahi",
        "K. Voggel",
        "A. Lançon",
        "F. R. Marleau",
        "E. Sola",
        "L. K. Hunt",
        "J. Junais",
        "D. Carollo",
        "P. M. Sanchez-Alarcon",
        "M. Baes",
        "F. Buitrago",
        "Michele Cantiello",
        "J.-C. Cuillandre",
        "H. Domínguez Sánchez",
        "A. Ferré-Mateu",
        "A. Franco",
        "J. Gracia-Carpio",
        "R. Habas",
        "M. Hilker",
        "E. Iodice",
        "J. H. Knapen",
        "M. N. Le",
        "D. Martínez-Delgado",
        "O. Müller",
        "F. De Paolis",
        "P. Papaderos",
        "R. Ragusa",
        "J. Román",
        "E. Saremi",
        "V. Testa",
        "B. Altieri",
        "L. Amendola",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "P. Battaglia",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H. M. Courtois",
        "M. Cropper",
        "A. Da Silva",
        "H. Degaudenzi",
        "G. De Lucia",
        "H. Dole",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "S. Dusini",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "S. Ferriol",
        "F. Finelli",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "A. Grazian",
        "F. Grupp",
        "L. Guzzo",
        "S. V. H. Haugan",
        "W. Holmes",
        "I. M. Hook",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke"
      ],
      "abstract": "Euclid preparation LXXIX. Using mock low surface brightness dwarf galaxies to probe Euclid Wide Survey detection capabilities Euclid Collaboration: M. Urbano (1), P.-A. Duc (1), M. Poulain (2), A. A. Nucita (3 and 4 and 5), A. Venhola (2), O. Marchal (1), M. Kümmel (6), H. Kong (7), F. Soldano (8), E. Romelli (9), M. Walmsley (10 and 11), T. Saifollahi (1), K. Voggel (1), A. Lançon (1), F. R. Marleau (12), E. Sola (13), L. K. Hunt (14), J. Junais (15 and 16), D. Carollo (9), P. M. Sanchez-Alarcon (15 and 16), M. Baes (17), F. Buitrago (18 and 19 and 20), Michele Cantiello (21), J.-C. Cuillandre (22), H. Domínguez Sánchez (23), A. Ferré-Mateu (15 and 16), A. Franco (4 and 3 and 5), J. Gracia-Carpio (24), R. Habas (21), M. Hilker (25), E. Iodice (26), J. H. Knapen (15 and 16), M. N. Le (15 and 16), D. Martínez-Delgado (27), O. Müller (28 and 13 and 29), F. De Paolis (3 and 4 and 5), P. Papaderos (30), R. Ragusa (26), J. Román (31), E. Saremi (32), V. Testa (33), B. Altieri (34), L. Amendola (35), S. Andreon (36), N. Auricchio (37), C. Baccigalupi (38 and 9 and 39 and 40), M. Baldi (41 and 37 and 42), S. Bardelli (37), P. Battaglia (37), A. Biviano (9 and 38), E. Branchini (43 and 44 and 36), M. Brescia (45 and 26), S. Camera (46 and 47 and 48), G. Cañas-Herrera (49 and 50), V. Capobianco (48), C. Carbone (51), J. Carretero (52 and 53), S. Casas (54), M. Castellano (33), G. Castignani (37), S. Cavuoti (26 and 55), A. Cimatti (56), C. Colodro-Conde (15), G. Congedo (57), C. J. Conselice (11), L. Conversi (58 and 34), Y. Copin (59), F. Courbin (60 and 61), H. M. Courtois (62), M. Cropper (63), A. Da Silva (64 and 65), H. Degaudenzi (66), G. De Lucia (9), H. Dole (67), F. Dubath (66), C. A. J. Duncan (57), X. Dupac (34), S. Dusini (68), S. Escoffier (69), M. Farina (70), R. Farinelli (37), S. Ferriol (59), F. Finelli (37 and 71), M. Frailis (9), E. Franceschi (37), M. Fumana (51), S. Galeotta (9), K. George (72), B. Gillis (57), C. Giocoli (37 and 42), A. Grazian (73), F. Grupp (24 and 6), L. Guzzo (74 and 36 and 75), S. V. H. Haugan (76), W. Holmes (77), I. M. Hook (78), F. Hormuth (79), A. Hornstrup (80 and 81), K. Jahnke Accepted for publication in Astronomy & Astrophysics (acceptance date: 30/10/2025). 22 pages, 19 figures, 7 tables Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Local Universe dwarf galaxies can serve as both cosmological and mass assembly probes. Deep surveys have enabled the study of these objects down to the low surface brightness (LSB) regime. In this paper, we estimate Euclid's dwarf detection capabilities as well as limits of its MERge processing function (MER pipeline), which is responsible for producing the stacked mosaics and final catalogues. To do this, we injected mock dwarf galaxies in a real Euclid Wide Survey (EWS) field in the VIS band and compared the input catalogue to the final MER catalogue. The mock dwarf galaxies were generated using simple Sersic models with structural parameters (including size and surface brightness) drawn from observed dwarf galaxy catalogues. These simulations represent an idealised case in the sense they do not account for additional factors such as ellipticity, morphology, or crowding. To characterise the detected dwarfs, we used the mean surface brightness inside the effective radius SB_e (in mag arcsec^-2). The final MER catalogues achieve completenesses of 91% for SB_e in [21,24] and 54% for SB_e in [24,28]. These numbers do not take into account possible contaminants, including confusion with background galaxies at the location of the dwarfs. After taking those effects into account, they respectively became 86% and 38%. The MER pipeline performs a final local background subtraction with a small mesh size, leading to a flux loss for galaxies with R_e > 10 arcsec. By using the final MER mosaics and reinjecting this local background, we obtained an image in which we recover reliable photometric properties for objects under the arcminute scale. This background-reinjected product is thus suitable for the study of Local Universe dwarf galaxies. Euclid's data reduction pipeline serves as a test bed for other deep surveys, particularly regarding background subtraction methods, a key issue in LSB science.",
      "pdf_url": "https://arxiv.org/pdf/2509.13163.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25070",
      "title": "Interstellar Dust-Catalyzed Molecular Hydrogen Formation Enabled by Nuclear Quantum Effects",
      "authors": [
        "Xiaolong Yang",
        "Lile Wang",
        "Di Li",
        "Shenzhen Xu"
      ],
      "abstract": "Interstellar Dust-Catalyzed Molecular Hydrogen Formation Enabled by Nuclear Quantum Effects Xiaolong Yang, Lile Wang, Di Li, Shenzhen Xu 43 pages, 17 figures, submitted to PhRevLett Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR); Chemical Physics (physics.chem-ph) Molecular hydrogen (H$_2$) plays a critical role in astrophysical processes from galaxy evolution to the formation of planets. While the dominant formation channel in the interstellar medium is considered as dust-catalyzed H$_2$ formation, this process could become inefficient at low temperatures suppressed by the Boltzmann factor. This work demonstrates that quantum tunneling can dominate the formation of H$_2$, resolving the long-standing problem of formation efficiency. Path integral Monte Carlo simulations reveals that the quantum tunneling of hydrogen atoms maintains stable reaction rates at temperatures below 50 K on both graphitic and silicate grain surfaces. Kinetic Monte Carlo calculations further indicate that the actual H$_2$ formation efficiency is governed not by atomic diffusion, but rather by the energy barriers associated with chemisorption, desorption, and the association of two hydrogen atoms. These findings establish a robust physical basis for dust-catalyzed H$_2$ formation, offer quantitative reaction rates for refining astrophysical models, and provide a framework for interpreting observations of interstellar molecular materials.",
      "pdf_url": "https://arxiv.org/pdf/2509.25070.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.26556",
      "title": "CHEMOUT: CHEMical complexity in star-forming regions of the OUTer Galaxy. V. Chemical composition gradients as a function of the galactocentric radius",
      "authors": [
        "D. Gigli",
        "F. Fontani",
        "L. Colzi",
        "G. Vermariën",
        "S. Viti",
        "V. M. Rivilla",
        "A. Sánchez-Monge"
      ],
      "abstract": "CHEMOUT: CHEMical complexity in star-forming regions of the OUTer Galaxy. V. Chemical composition gradients as a function of the galactocentric radius D. Gigli, F. Fontani, L. Colzi, G. Vermariën, S. Viti, V. M. Rivilla, A. Sánchez-Monge 23 pages, 14 figures; accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The outer Galaxy is characterized by a lower metallicity than regions near the Sun, suggesting differences in the formation and survival of molecules in star-forming regions. To understand chemical evolution across the Milky Way, deriving molecular abundances in star-forming regions in the outer Galaxy is essential for refining models of sub-Solar metallicity environments. We analyzed IRAM 30 m observations at 3 and 2 mm toward 35 sources at Galactocentric distances of 9$-$24 kpc, within the \"CHEMical complexity in star-forming regions of the outer Galaxy\" (CHEMOUT) project. We focused on species with the highest detection rates (i.e., HCN, HCO$^+$, c-C$_3$H$_2$, H$^{13}$CO$^+$, HCO, SO) and searched for trends in column densities, abundances, and line widths with Galactocentric distance. Abundances for H$_2$CO and CH$_3$OH were updated using H$_2$ column densities from new NIKA2 dust maps. Fractional abundances relative to H$_2$ of most species (HCN, HCO$^+$, c-C$_3$H$_2$, HCO, H$_2$CO, CH$_3$OH) scale at most with the elemental carbon abundance ([C/H]) up to $\\sim$24 kpc. SO shows a steeper gradient than sulfur abundance ([S/H]), while H$^{13}$CO$^+$ shows a shallower gradient than [$^{13}$C/H]. Gas turbulence, inferred from line widths, decreases with Galactocentric distance, suggesting a more quiescent environment in the outer Galaxy with respect to the inner Galaxy. In the outer Galaxy, the formation efficiency of most molecules, following the parent element availability, is comparable or higher (e.g., for H$^{13}$CO$^+$) than in the local Galaxy, whereas SO forms less efficiently. These results have significant implications for chemical models of the outermost star-forming regions and for understanding molecule formation under lower metallicity conditions.",
      "pdf_url": "https://arxiv.org/pdf/2509.26556.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07407",
      "title": "The evolution of the bar fraction and bar lengths in the last 12 billion years",
      "authors": [
        "Zoe A. Le Conte",
        "Dimitri A. Gadotti",
        "Leonardo Ferreira",
        "Christopher J. Conselice",
        "Camila de Sá-Freitas",
        "Taehyun Kim",
        "Justus Neumann",
        "Francesca Fragkoudi",
        "E. Athanassoula",
        "Nathan J. Adams"
      ],
      "abstract": "The evolution of the bar fraction and bar lengths in the last 12 billion years Zoe A. Le Conte, Dimitri A. Gadotti, Leonardo Ferreira, Christopher J. Conselice, Camila de Sá-Freitas, Taehyun Kim, Justus Neumann, Francesca Fragkoudi, E. Athanassoula, Nathan J. Adams 18 pages, 12 figures. Accepted in MNRAS MNRAS, 2025, staf2010, 10.1093/mnras/staf2010 Astrophysics of Galaxies (astro-ph.GA) We investigate the evolution of the bar fraction and length using an extended JWST NIRCam imaging dataset of galaxies at $1 \\leq z \\leq 4$. We assess the wavelength dependence of the bar fraction and bar length evolution by selecting a nearly mass-complete CEERS disc sample and performing visual classifications on the short (F200W) and long (F356W+F444W) wavelength channels. A similar bar fraction is observed for both samples, and combined, we find a declining bar fraction from $0.16^{+0.03}_{-0.03}$ to $0.07^{+0.03}_{-0.01}$ over the redshift range. No evolution in the F356W+F444W bar length is measured, with a mean of 3.6 kpc. A slight increase of $\\sim 1$ kpc towards $z = 1$ is measured in the F200W sample, with a mean of 2.9 kpc. We find that the correlation between bar length and galaxy mass, for massive galaxies at $z < 1$, is unseen at $z > 1$. By incorporating barred galaxies at $z<1$, we show that there is a modest increase in the bar length ($\\approx 2$ kpc) towards $z=0$, but bars longer than $\\approx8$ kpc are only found at $z<1$. We show that bars and discs grow in tandem, for the bar length normalised by disc size does not evolve. Not only is a significant population of bars forming beyond $z = 1$, but our results also show that some of these bars are as long and strong as the average bar at $z\\approx0$.",
      "pdf_url": "https://arxiv.org/pdf/2510.07407.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.14152",
      "title": "Connecting outflows with radio emission in active galactic nuclei at cosmic noon",
      "authors": [
        "Gabriele S. Ilha",
        "C. M. Harrison",
        "V. Mainieri",
        "Ann Njeri",
        "E. Bertola",
        "M. Bischetti",
        "C. Circosta",
        "C. Cicone",
        "G. Cresci",
        "V. A. Fawcett",
        "A. Georgakakis",
        "D. Kakkad",
        "I. Lamperti",
        "A. Marconi",
        "M. Perna",
        "A. Puglisi",
        "D. Rosario",
        "G. Tozzi",
        "C. Vignali",
        "G. Zamorani"
      ],
      "abstract": "Connecting outflows with radio emission in active galactic nuclei at cosmic noon Gabriele S. Ilha, C. M. Harrison, V. Mainieri, Ann Njeri, E. Bertola, M. Bischetti, C. Circosta, C. Cicone, G. Cresci, V. A. Fawcett, A. Georgakakis, D. Kakkad, I. Lamperti, A. Marconi, M. Perna, A. Puglisi, D. Rosario, G. Tozzi, C. Vignali, G. Zamorani 17 pages, accepted for publication in Astronomy and Astrophysics. Revised version after including the referee's comments. The VLA radio images underlying this article are available at this https URL Astrophysics of Galaxies (astro-ph.GA) AGN feedback is a well known mechanism in the evolution of galaxies. One open question is the driving mechanism of galaxy-scale outflows. At low redshift, radio jets often interact with the ISM, generating turbulence and driving ionized outflows. Despite this evidence at low redshift, relatively few studies have investigated the radio-ionized gas connection at cosmic noon. Thus, our main goal is to conduct a pilot study using VLA data for three quasars with moderate/high radio power, which have ionized outflows identified in observations from the SUPER survey. We used [OIII] data from SINFONI analyzed in earlier studies, along with new 6.2 GHz VLA radio observations, at comparable spatial resolution. We also incorporate radio data from the literature to explore the radio emission. We detected extended radio structure in our VLA A-array data for two quasars. The extended structure in J1333+1649 aligns with the smaller-scale emission seen in archival images, suggesting a jet propagating from nuclear to galaxy-wide scales. In all three quasars, we found that the brightest radio emission and ionized gas have comparable spatial scales. Furthermore, the position angles of the radio emission and ionized gas present small offsets for the two targets with extended structures. Given that the kinematics of the ionized gas in all three quasars is dominated by outflows, our results suggest a strong connection between radio emission and ionized outflows in typical AGN at cosmic noon. Based on energetic considerations and comparisons with archival data, radio jets could be a significant mechanism for driving outflows in AGN from cosmic noon to low redshifts. However, with the exception of one object (J1333+1649), we cannot rule out the possibility that the radio emission arises from shocks in the interstellar medium caused by disk winds or radiatively driven outflows.",
      "pdf_url": "https://arxiv.org/pdf/2510.14152.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10737",
      "title": "KOALA, a new ATLAS9 database -- I. Model atmospheres, opacities, fluxes, bolometric corrections, magnitudes and colours",
      "authors": [
        "A. Mucciarelli",
        "P. Bonifacio",
        "C. Lardo"
      ],
      "abstract": "KOALA, a new ATLAS9 database -- I. Model atmospheres, opacities, fluxes, bolometric corrections, magnitudes and colours A. Mucciarelli, P. Bonifacio, C. Lardo Accepted for Publication in Astronomy & Astrophysics, 13 pages, 8 figures, 1 table. All the data at this https URL Solar and Stellar Astrophysics (astro-ph.SR) We present the KOALA database, a new set of LTE, line-blanketed model atmospheres calculated with the code ATLAS9, together with the corresponding Opacity Distribution Functions and emergent fluxes. The latter were used also to calculated G-band bolometric corrections and theoretical magnitudes and colours for several photometric systems, i.e. UBVRI, 2MASS, Hypparcos-Tycho, SDSS, Galex, Euclid and Gaia DR3. With respect to the previous grids of ATLAS9 model atmospheres, we adopted the solar mixture by Caffau/Lodders and we extend the sampling in metallicity (from -5.0 to -2.5 dex with step of 0.5 dex, and from -2.5 dex to +0.5 dex with step of 0.25 dex) and in [alfa/Fe] (from -0.4 to +0.4 dex with a step of 0.2 dex). Also, we provide a finer sampling in Teff for Teff lower than 7000 K. This finer grid allows for more accurate interpolation of colours and in many cases it makes not necessary to compute a new model atmosphere, since one of the grid can be used directly. A total of 51663 model atmospheres and emergent fluxes have been computed. Finally, we discuss the impact of [M/H] and [alfa/Fe] on the thermal and pressure structures of the model atmospheres and on theoretical colours.",
      "pdf_url": "https://arxiv.org/pdf/2511.10737.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10880",
      "title": "Ubiquitous high-frequency waves and disturbances in the active region corona observed with DKIST/Cryo-NIRSP",
      "authors": [
        "Momchil E. Molnar",
        "Richard Morton",
        "Alin Paraschiv",
        "Chris Gilly",
        "Steven R. Cranmer",
        "Kevin Reardon",
        "Thomas Schad"
      ],
      "abstract": "Ubiquitous high-frequency waves and disturbances in the active region corona observed with DKIST/Cryo-NIRSP Momchil E. Molnar, Richard Morton, Alin Paraschiv, Chris Gilly, Steven R. Cranmer, Kevin Reardon, Thomas Schad Submitted to ApJ, comments welcome Solar and Stellar Astrophysics (astro-ph.SR) The plasma of the solar corona harbors a multitude of coronal wave modes, some of which could be dissipated to provide the required energy and momentum to heat the corona and accelerate the solar wind. We present observations of the corona acquired with the newly commissioned infrared slit spectropolarimeter Cryo-NIRSP at the Daniel K. Inouye Solar Telescope (DKIST), Haleakala, Hawaii to study the high frequency wave behavior in closed, active-region structures. Cryo-NIRSP observes the corona off the limb in the Fe XIII 1074 and 1079 nm forbidden atomic lines. The large aperture of DKIST allows us to explore the active region corona with temporal resolution faster than a second with an achieved spatial resolution of 2-5 arcseconds. Enhanced wave power is observed in the power spectra up to 100 mHz. Furthermore, we report on a statistically significant anti-correlation between the Fe XIII 1074 nm peak line intensity and line width in our data, possibly pointing to the presence of compressive magnetohydrodynamic (MHD) wave modes. These observations show how the powerful spectropolarimetric capabilities of DKIST offer great promise for furthering our knowledge of coronal MHD waves.",
      "pdf_url": "https://arxiv.org/pdf/2511.10880.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10906",
      "title": "In situ Evidence of 5-minute Oscillations from Parker Solar Probe",
      "authors": [
        "Zesen Huang",
        "Marco Velli",
        "Olga Panasenco",
        "Richard J. Morton",
        "Chen Shi",
        "Yeimy J. Rivera",
        "Benjamin Chandran",
        "Samuel T. Badman",
        "Yuliang Ding",
        "Nour Raouafi",
        "Stuart D. Bale",
        "Michael Stevens",
        "Tamar Ervin",
        "Chuanpeng Hou",
        "Kristopher G. Klein",
        "Orlando Romeo",
        "Jia Huang",
        "Mingzhe Liu",
        "Davin E. Larson",
        "Marc Pulupa",
        "Roberto Livi",
        "Federico Fraschetti"
      ],
      "abstract": "In situ Evidence of 5-minute Oscillations from Parker Solar Probe Zesen Huang, Marco Velli, Olga Panasenco, Richard J. Morton, Chen Shi, Yeimy J. Rivera, Benjamin Chandran, Samuel T. Badman, Yuliang Ding, Nour Raouafi, Stuart D. Bale, Michael Stevens, Tamar Ervin, Chuanpeng Hou, Kristopher G. Klein, Orlando Romeo, Jia Huang, Mingzhe Liu, Davin E. Larson, Marc Pulupa, Roberto Livi, Federico Fraschetti Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) The Sun's surface vibrates in characteristic 5-minute oscillations, known as p-modes, generated by sound waves trapped within the convection zone. Although these oscillations have long been hypothesized to reach into the solar wind, direct in situ evidence has remained elusive, even during previous close encounters by Parker Solar Probe (PSP). Here, we present the first promising in situ detection of 5-minute oscillations in the upper solar corona, based on observations from PSP's three closest perihelia. In two events at 9.9 solar radii, we identify statistically significant ($\\sim$ 6 $\\sigma$) 3.1-3.2 mHz peaks in the magnetic field power spectrum, each appearing as a large-amplitude, spherically polarized Alfvénic wave train lasting approximately 35 minutes. These results demonstrate that global solar oscillations can reach and potentially influence the solar wind.",
      "pdf_url": "https://arxiv.org/pdf/2511.10906.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10998",
      "title": "SPICE -- modelling synthetic spectra of stars with non-homogeneous surfaces",
      "authors": [
        "M. Jabłońska",
        "T. Różański",
        "L. Casagrande",
        "H. Shah",
        "P. A. Kołaczek-Szymański",
        "M. Rychlicki",
        "Yuan-Sen Ting"
      ],
      "abstract": "SPICE -- modelling synthetic spectra of stars with non-homogeneous surfaces M. Jabłońska, T. Różański, L. Casagrande, H. Shah, P. A. Kołaczek-Szymański, M. Rychlicki, Yuan-Sen Ting Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) In the era of large time-domain spectro-photometric surveys, surface variations such as starspots, chemical inhomogeneities, pulsations, rotational distortions, and binary interactions can now be directly detected and modelled. Accurately interpreting these phenomena requires stellar spectral synthesis frameworks that go beyond the assumption of homogeneous surface properties. Yet most existing tools remain limited by this simplification, hindering their applicability to stars with complex surface structures. To address this need, we present SPICE (SPectral Integration Compiled Engine), an open-source Python package for generating high-resolution spectra and photometry from non-homogeneous stellar surface models. SPICE integrates angle-dependent specific intensities from each surface element, enabling forward modelling of both photometric and spectroscopic variability. Case studies demonstrate applications to spotted stars, Cepheid pulsations, and eclipsing binaries, making SPICE well-suited for analysing current and upcoming survey data. In addition, SPICE can directly import meshes from PHOEBE, enabling the modelling of complex binary configurations beyond these case studies.",
      "pdf_url": "https://arxiv.org/pdf/2511.10998.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11220",
      "title": "Empirical prediction of plasma emission measure distributions and X-EUV spectra of late-type stars",
      "authors": [
        "Antonio Maggio",
        "Ignazio Pillitteri",
        "Jorge Sanz-Forcada",
        "Giuseppina Micela"
      ],
      "abstract": "Empirical prediction of plasma emission measure distributions and X-EUV spectra of late-type stars Antonio Maggio, Ignazio Pillitteri, Jorge Sanz-Forcada, Giuseppina Micela 16 pages, 9 figures, 4 tables. Accepted for publication in The Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR) High-energy emission spectra from the outer atmospheres of late-type stars represent an important feature of the stellar activity in several contexts, such as the photoevaporation and photochemistry of planetary atmospheres or the modeling of irradiated circumstellar disks in young objects. An accurate determination of these spectra in the EUV and soft X-ray (XUV) band requires high-resolution spectroscopy, that is rarely feasible with current instrumentation. We employed a relatively large set of plasma emission measure distributions (EMDs) as a function of temperature, derived from FUV and X-ray emission line spectra acquired with the Hubble Space Telescope and Chandra or XMM-Newton, in order to devise a relatively simple recipe for predicting EMDs and XUV spectra of stars of different spectral types, activity levels, and plasma metallicity. We show that the EMDs in the range of temperatures between 10^4 K and 10^7.5 K can be described using the stellar surface X-ray flux as a control parameter, but this parameterization also depends on the spectral type. In particular, we find that M-type stars show slightly lower emission measure at temperatures below ~10^5 K and higher emission measures for T > ~10^6.5 K with respect to FGK stars with similar surface X-ray fluxes. We evaluated the uncertainties in the broad-band EUV and X-ray fluxes derived from synthetic EMDs and spectra, considering in the error budget also the limited knowledge of the chemical abundances in stellar outer atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2511.11220.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11247",
      "title": "Evidence for the Keplerian orbit of a close companion around a giant star",
      "authors": [
        "Mats Esseldeurs",
        "Leen Decin",
        "Joris De Ridder",
        "Yoshiya Mori",
        "Amanda I. Karakas",
        "Jolien Malfait",
        "Taïssa Danilovich",
        "Stéphane Mathis",
        "Anita M. S. Richards",
        "Raghvendra Saha",
        "Jeremy Yates",
        "Marie Van de Sande",
        "Maarten Baes",
        "Alain Baudry",
        "Jan Bolte",
        "Thomas Ceulemans",
        "Frederik De Ceuster",
        "Ileyk El Mellah",
        "Sandra Etoka",
        "Carl Gottlieb",
        "Fabrice Herpin",
        "Pierre Kervella",
        "Camille Landri",
        "Louise Marinho",
        "Iain McDonald",
        "Karl Menten",
        "Tom Millar",
        "Zara Osborn",
        "Bannawit Pimpanuwat",
        "John Plane",
        "Daniel J. Price",
        "Lionel Siess",
        "Owen Vermeulen",
        "Ka Tat Wong"
      ],
      "abstract": "Evidence for the Keplerian orbit of a close companion around a giant star Mats Esseldeurs, Leen Decin, Joris De Ridder, Yoshiya Mori, Amanda I. Karakas, Jolien Malfait, Taïssa Danilovich, Stéphane Mathis, Anita M. S. Richards, Raghvendra Saha, Jeremy Yates, Marie Van de Sande, Maarten Baes, Alain Baudry, Jan Bolte, Thomas Ceulemans, Frederik De Ceuster, Ileyk El Mellah, Sandra Etoka, Carl Gottlieb, Fabrice Herpin, Pierre Kervella, Camille Landri, Louise Marinho, Iain McDonald, Karl Menten, Tom Millar, Zara Osborn, Bannawit Pimpanuwat, John Plane, Daniel J. Price, Lionel Siess, Owen Vermeulen, Ka Tat Wong published in Nature Astronomy: this https URL Solar and Stellar Astrophysics (astro-ph.SR) Close companions influence stellar evolution through tidal interactions, mass transfer, and mass loss effects. While such companions are detected around young stellar objects, main-sequence stars, red giants, and compact objects, direct observational evidence of close-in companions around asymptotic giant branch (AGB) stars has remained elusive. Here, we present (sub)millimeter time-domain imaging spectroscopy revealing the Keplerian motion of a close-in companion around the AGB star pi1 Gruis. The companion, slightly more massive than the AGB star, is likely a main-sequence star. Unlike more evolved stars with companions at comparable distances, pi1 Gru's companion follows a circular orbit, suggesting an eccentricity-generating mechanism late- or post-AGB. Our analysis suggests that model-predicted circularization rates may be underestimated. Our results highlight the potential of multi-epoch (sub)millimeter interferometry in detecting the Keplerian motion of close companions to giant stars and open avenues for our understanding of tidal interaction physics and binary evolution.",
      "pdf_url": "https://arxiv.org/pdf/2511.11247.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.16810",
      "title": "Transformers for Stratified Spectropolarimetric Inversion: Proof of Concept",
      "authors": [
        "Ryan James Campbell",
        "Mihalis Mathioudakis",
        "Carlos Quintero Noda"
      ],
      "abstract": "Transformers for Stratified Spectropolarimetric Inversion: Proof of Concept Ryan James Campbell, Mihalis Mathioudakis, Carlos Quintero Noda Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) Solar spectropolarimetric inversion -- inferring atmospheric conditions from the Stokes vector -- is a key diagnostic tool for understanding solar magnetism, but traditional inversion methods are computationally expensive and sensitive to local minima. Advances in artificial intelligence (AI) offer faster solutions, but are often restricted to shallow models or a few spectral lines. We present a proof-of-concept study using a transformer machine learning (ML) model for multi-line, full-Stokes inversion, to infer stratified parameters from synthetic spectra produced from 3D magnetohydrodynamic simulations. We synthesise a large set of Stokes vectors using forward modelling across 15 spectral lines spanning the deep photosphere towards the chromosphere. The model maps full-Stokes input to temperature, magnetic field strength, inclination, azimuth (encoded as $\\sin2\\phi$, $\\cos2\\phi$), and line-of-sight velocity as a function of optical depth. The transformer incorporates an attention mechanism that allows the model to focus on the most informative regions of the spectrum for each inferred parameter, and uses positional embedding to encode wavelength and depth order. We benchmark it against a multilayer perceptron (MLP), test robustness to noise, and assess generalisation. The transformer outperforms the MLP, especially in the higher layers and for magnetic parameters, yielding higher correlations and more regularised stratifications. The model retains strong performance across a range of noise levels typical for real observations, with magnetic parameter inference degrading predictably while temperature and velocity remain stable. We explore attention maps, linking the transformer's learned behaviour to line-formation physics.",
      "pdf_url": "https://arxiv.org/pdf/2506.16810.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.10722",
      "title": "Practical Author Name Disambiguation under Metadata Constraints: A Contrastive Learning Approach for Astronomy Literature",
      "authors": [
        "Vicente Amado Olivo",
        "Wolfgang Kerzendorf",
        "Bangjing Lu",
        "Joshua V. Shields",
        "Andreas Flörs",
        "Nutan Chen"
      ],
      "abstract": "Practical Author Name Disambiguation under Metadata Constraints: A Contrastive Learning Approach for Astronomy Literature Vicente Amado Olivo, Wolfgang Kerzendorf, Bangjing Lu, Joshua V. Shields, Andreas Flörs, Nutan Chen Instrumentation and Methods for Astrophysics (astro-ph.IM); Digital Libraries (cs.DL); Physics and Society (physics.soc-ph) The ability to distinctly and properly collate an individual researcher's publications is crucial for ensuring appropriate recognition, guiding the allocation of research funding and informing hiring decisions. However, accurately grouping and linking a researcher's entire body of work with their individual identity is challenging because of widespread name ambiguity across the growing literature. Algorithmic author name disambiguation provides a scalable approach to disambiguating author identities, yet existing methods have limitations. Many modern author name disambiguation methods rely on comprehensive metadata features such as venue or affiliation. Despite advancements in digitally indexing publications, metadata is often unavailable or inconsistent in large digital libraries(e.g. NASA/ADS). We introduce the Neural Author Name Disambiguator, a method that disambiguates author identities in large digital libraries despite limited metadata availability. We formulate the disambiguation task as a similarity learning problem by employing a Siamese neural network to disambiguate author names across publications relying solely on widely available publication metadata-author names, titles and abstracts. We construct the Large-Scale Physics ORCiD Linked dataset to evaluate the Neural Author Name Disambiguator by cross-matching NASA/ADS publications ORCiD. By leveraging foundation models to embed metadata into features, our model achieves up to 94% accuracy in pairwise disambiguation and over 95% F1 in clustering publications into their researcher identities. We release the testing dataset as a benchmark for physics and astronomy, providing realistic evaluation conditions for future disambiguation methods. The Neural Author Name Disambiguator algorithm demonstrates effective disambiguation with minimal metadata, offering a scalable solution for name ambiguity in large digital libraries.",
      "pdf_url": "https://arxiv.org/pdf/2511.10722.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.DL"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10773",
      "title": "Optimization of lenslet arrays for PRIMA Kinetic Inductance Detectors",
      "authors": [
        "Sumit Dahal",
        "Thomas R. Stevenson",
        "Nicholas P. Costen",
        "Nat DeNigris",
        "Jason Glenn",
        "Gang Hu",
        "Christine A. Jhabvala",
        "Ricardo Morales-Sanchez",
        "Jessica B. Patel",
        "Manuel A. Quijada",
        "Ian Schrock",
        "Frederick H. Wang",
        "Edward J. Wollack"
      ],
      "abstract": "Optimization of lenslet arrays for PRIMA Kinetic Inductance Detectors Sumit Dahal, Thomas R. Stevenson, Nicholas P. Costen, Nat DeNigris, Jason Glenn, Gang Hu, Christine A. Jhabvala, Ricardo Morales-Sanchez, Jessica B. Patel, Manuel A. Quijada, Ian Schrock, Frederick H. Wang, Edward J. Wollack 5 pages, 5 figures, submitted to IEEE Transactions on Applied Superconductivity Instrumentation and Methods for Astrophysics (astro-ph.IM) The PRobe far-Infrared Mission for Astrophysics (PRIMA) is a cryogenically cooled 1.8-m space telescope designed to address fundamental questions about the evolution of galactic ecosystems, the origins of planetary atmospheres, and the buildup of dust and metals over cosmic time. PRIMA will achieve unprecedented sensitivity in the 24 - 261 $\\mu$m wavelength range, enabled by background-limited kinetic inductance detectors (KIDs) cooled to 120 mK. For PRIMA's Far-InfraRed Enhanced Survey Spectrometer (FIRESS) instrument, we have developed monolithic kilopixel silicon lenslet arrays to efficiently couple incident radiation from the telescope's fore-optics onto the KID absorber elements. These three-dimensional lenslet arrays are fabricated using grayscale lithography, followed by deep reactive ion etching (DRIE), and are anti-reflection (AR) coated with a quarter-wavelength thick deposition of Parylene-C. The lenslet arrays are aligned and bonded to the KID arrays using a thin layer of epoxy through a flip-chip bonder. In this work, we report on the optimized fabrication, lens design, AR coating, and bonding processes developed for the FIRESS lenslet arrays. We characterize brassboard lenslet arrays fabricated to meet the specifications of the FIRESS low and high spectral bands, demonstrate stepped-thickness AR-coatings to achieve high efficiency across broad wavelength ranges, and present spectral transmission measurements of the AR coating and the epoxy bonding layers.",
      "pdf_url": "https://arxiv.org/pdf/2511.10773.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10886",
      "title": "Evolutionary Map of the Universe: A pilot survey to detect high Galactic latitude pulsars in variance images with ASKAP",
      "authors": [
        "A. Ahmad",
        "S. Dai",
        "E. Lenc",
        "M. D. Filipović",
        "B. S. Koribalski",
        "S. Johnston",
        "G. Hobbs",
        "S. W. Duchesne",
        "S. Lazarević",
        "J. T. Bai",
        "L. Toomey",
        "N. D. R. Bhat",
        "D. A. Leahy",
        "A. M. Hopkins",
        "T. Zafar",
        "S. F. Rahman"
      ],
      "abstract": "Evolutionary Map of the Universe: A pilot survey to detect high Galactic latitude pulsars in variance images with ASKAP A. Ahmad, S. Dai, E. Lenc, M. D. Filipović, B. S. Koribalski, S. Johnston, G. Hobbs, S. W. Duchesne, S. Lazarević, J. T. Bai, L. Toomey, N. D. R. Bhat, D. A. Leahy, A. M. Hopkins, T. Zafar, S. F. Rahman Instrumentation and Methods for Astrophysics (astro-ph.IM) It has been proposed that radio pulsars can be distinguished from other point-like radio sources in continuum images by their unique interstellar scintillation signatures. Using data from the Australian Square Kilometre Array Pathfinder (ASKAP) Evolutionary Map of the Universe (EMU) survey, we conducted a pilot survey of radio pulsars at high Galactic latitude regions via the variance imaging method. Out of approximately 59,800 compact radio sources detected in a ~480 square degree survey area, we identified 20 highly variable sources. Among them, 9 are known pulsars, 1 is a known radio star, 1 is an ultra-long period source, 3 are radio star candidates, and the remaining 6 are pulsar candidates. Notably, we discovered two strongly scintillating pulsars: one with a period of 85.707 ms and a dispersion measure (DM) of 19.4 pc/cm^3, and another with a period of 5.492 ms and a DM of 29.5 pc/cm^3. In addition, a third pulsar was discovered in the variance images, with a period of 14.82 ms and a DM of 39.0 pc/cm^3. This source shows a steep radio spectrum and a high degree of circular polarisation. These results underscore the strong potential of variance imaging for pulsar detection in full EMU and future radio continuum surveys planned with Square Kilometre Array (SKA).",
      "pdf_url": "https://arxiv.org/pdf/2511.10886.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11049",
      "title": "Surface figure metrology for reflective membrane mirrors based on phase-measuring deflectometry",
      "authors": [
        "Xin Yan",
        "Zhi-Kang Zhuang",
        "Fu-Jia Du",
        "Wen Duan",
        "Peilin Yin",
        "Mo-Nong Yu",
        "Guang Yang"
      ],
      "abstract": "Surface figure metrology for reflective membrane mirrors based on phase-measuring deflectometry Xin Yan, Zhi-Kang Zhuang, Fu-Jia Du, Wen Duan, Peilin Yin, Mo-Nong Yu, Guang Yang 16 pages and 14 figures. Front. Astron. Space Sci. in press Instrumentation and Methods for Astrophysics (astro-ph.IM); Optics (physics.optics) Reflective membrane mirrors provide a lightweight, low-cost alternative to traditional optics for next-generation large-aperture telescopes, but their non-rigid, thin structure poses challenges for surface metrology. We present a phase-measuring deflectometry (PMD) system enhanced with tailored ray-tracing and iterative reconstruction to enable non-contact measurement of large membrane optics. The system successfully characterizes the surface figure and evaluates the dynamic stability of a 1-meter Hencky-type membrane mirror. Our results demonstrate the effectiveness of PMD as a practical metrology tool for future membrane-based telescope systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.11049.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11121",
      "title": "A Simulation Platform for Small Solar System Bodies using the Einstein-Elevator",
      "authors": [
        "E. Tahtali",
        "C. Kreuzig",
        "G. Meier",
        "J. Blum",
        "L. Overmeyer",
        "C. Lotz"
      ],
      "abstract": "A Simulation Platform for Small Solar System Bodies using the Einstein-Elevator E. Tahtali, C. Kreuzig, G. Meier, J. Blum, L. Overmeyer, C. Lotz The following article has been submitted to Review of Scientific Instruments. After it is published, it will be found at this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM) Small solar system bodies are becoming increasingly important as missions like NASA's OSIRIS-REx show. However, the study of the characteristics and behavior of these objects on Earth is a challenge as the simulation of their environmental conditions is difficult. We present in this paper an approach to enable the simulation of SSSB conditions in a drop tower facility on Earth, which is being addressed as part of the AKUS (\"Activity of Comets under Partial Gravity\") project. This especially concerns their prevailing gravity levels, which range between 10^-2 g and 10^-4 g. In order to simulate the conditions of SSSB as accurately as possible, an acceleration system based on servo motors and spindle axes has been developed. The accelerations are transferred from the motors to the spindle axes containing a comet-like sample. These are together placed inside a vacuum chamber providing a vacuum quality of 10^-6 mbar. The whole setup is installed inside the Einstein-Elevator. Our results show that, with the current setup, we are able to generate conditions from 10^-2 g down to 10^-3 g. The maximum deviations under these conditions are +/-5x10^-4 g. Additionally, this setup offers the opportunity to conduct different kinds of experiments in which the described gravity levels and vacuum conditions are needed.",
      "pdf_url": "https://arxiv.org/pdf/2511.11121.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10745",
      "title": "Indirect forces in disc-planet interaction",
      "authors": [
        "Roman R. Rafikov",
        "Nicolas P. Cimerman",
        "Callum W. Fairbairn",
        "Alexander J. Dittmann"
      ],
      "abstract": "Indirect forces in disc-planet interaction Roman R. Rafikov, Nicolas P. Cimerman, Callum W. Fairbairn, Alexander J. Dittmann 19 pages, 13 figures, submitted to MNRAS, comments welcome Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Gravitational coupling between a protoplanetary disc and an embedded planet is often studied in a frame attached to a central star. This frame is non-inertial because of the stellar reflex motion, leading to indirect forces arising in the star-planet-disc system. Here we examine the impact produced by these forces on several aspects of disc-planet coupling using analytical and numerical means. We explore how neglecting indirect forces changes (1) the spatial pattern of the surface density perturbation in the disc, (2) the calculation of the torque exerted on the disc by the planet, and (3) the torque on the planet exerted by the disc. For low-mass planets, in the linear regime, the differences in the perturbation pattern are only in its $m=1$ azimuthal harmonic, with an amplitude increasing with the distance from the star. In this regime both the torque on the planet and the deposition torque density in the disc are only weakly affected by non-inclusion of indirect forces, corroborating some results of studies neglecting indirect forces altogether. For higher mass planets, a broader range of azimuthal harmonics of the perturbation are affected. Also, indirect forces have a stronger effect on the planetary torque and on planet migration in the Type II regime. We highlight the importance of including the planetary indirect force in the calculation of the torque on the disc (if disc evolution accounts for indirect force) to ensure conservation of angular momentum carried by the planet-driven density waves. The corresponding indirect torque has an oscillatory, radially-diverging character.",
      "pdf_url": "https://arxiv.org/pdf/2511.10745.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10782",
      "title": "Historical Surveys to Rubin First Look: Absolute Colors of trans-Neptunian objects",
      "authors": [
        "Milagros Colazo",
        "Alvaro Alvarez-Candal"
      ],
      "abstract": "Historical Surveys to Rubin First Look: Absolute Colors of trans-Neptunian objects Milagros Colazo, Alvaro Alvarez-Candal Submitted to The Planetary Science Journal (PSJ) on November 13, 2025 Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a comprehensive photometric study of transNeptunian objects (TNOs) by combining data from SDSS, Col-OSSOS, DES, and the recent Rubin First Look (RFL) data. Our database comprises 43 878 measurements in the u, g, r, i, z, and J filters, from which we derived 8 738 phase curves for 1 921 unique objects. From these data, we computed 12 852 absolute color measurements and spectral slope differences for 1 761 objects, allowing a statistical characterization of phase coloring effects. The colors show no strong bimodality or correlation with orbital parameters, emphasizing the importance of phase correction even for small phase angles. The increase in sample size and application of phase corrections fill previously empty regions in color magnitude space likely affected by observational biases, as redder (and thus darker) objects are preferentially lost near detection limits. Notably, our dataset includes the first photometric measurements from Rubin Observatory during RFL, covering eight objects (five newly discovered TNOs and three previously known). These early LSST observations occupy sparsely sampled regions of parameter space, particularly at faint magnitudes, highlighting the discovery and characterization potential of the full survey. We confirm previous results showing that TNO colors vary with phase angle, exhibiting both reddening and bluening trends. Correlations between (dS'/dalpha) and (alpha) strengthen with increasing (Delta lambda), except for Hi - Hz, which tends to neutralize, consistent with the spectral flattening previously reported in visible wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2511.10782.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11044",
      "title": "In-situ environmental radiation background measurement in the second phase of CJPL",
      "authors": [
        "P. Zhang",
        "Z. Zeng",
        "J. Cheng",
        "H. Ma"
      ],
      "abstract": "In-situ environmental radiation background measurement in the second phase of CJPL P. Zhang, Z. Zeng, J. Cheng, H. Ma 4 pages, 2 figures, conference paper of TAUP2025 Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM); Data Analysis, Statistics and Probability (physics.data-an) China Jinping Underground Laboratory (CJPL), the deepest and largest underground laboratory worldwide, provides a low radiation background environment, which is necessary to frontier scientific research, such as the experimental studies of rare-event physics. Due to the almost filled space of CJPL-I and the requirement of future physics experiments, the construction of the second phase of CJPL (CJPL-II) was started in 2020 and all finished in 2024. In this work, we report the measured results of major environmental radiation in CJPL-II, including cosmic-ray muons, radon, gamma rays, and neutrons. Results indicate that the rock overburden and the radioactive background control effectively minimize the environmental radiation background. The scientific data presented also serve as an important basis to detector background modeling for the physics experiments in CJPL-II.",
      "pdf_url": "https://arxiv.org/pdf/2511.11044.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11425",
      "title": "Smoothed Particle Hydrodynamics in pkdgrav3 for Shock Physics Simulations I: Hydrodynamics",
      "authors": [
        "Thomas Meier",
        "Douglas Potter",
        "Christian Reinhardt",
        "Joachim Stadel"
      ],
      "abstract": "Smoothed Particle Hydrodynamics in pkdgrav3 for Shock Physics Simulations I: Hydrodynamics Thomas Meier, Douglas Potter, Christian Reinhardt, Joachim Stadel 24 pages, 18 figures, submitted to ApJ Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present pkdgrav3, a high-performance, fully parallel tree-SPH code designed for large-scale hydrodynamic simulations including self-gravity. Building upon the long development history of pkdgrav, the code combines an efficient hierarchical tree algorithm for gravity and neighbor finding with a modern implementation of Smoothed Particle Hydrodynamics (SPH) optimized for massively parallel hybrid CPU/GPU architectures. Its hybrid shared/distributed memory model, combined with an asynchronous communication scheme, allows pkdgrav3 to scale efficiently to thousands of CPU cores and GPUs. We validate the numerical accuracy of pkdgrav3 using a suite of standard tests, demonstrating excellent agreement with analytic or reference solutions. The code was already used in several peer-reviewed publications to model planetary-scale impacts, where SPH's Lagrangian nature allows accurate tracking of material origin and thermodynamic evolution. These examples highlight pkdgrav3's robustness and efficiency in simulating highly dynamical, self-gravitating systems. pkdgrav3 thus provides a powerful, flexible, and scalable platform for astrophysical and planetary applications, capable of exploiting the full potential of modern heterogeneous high-performance computing systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.11425.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.06144",
      "title": "First Use of GPS Satellites for Beam Calibration of Radio Dish Telescopes",
      "authors": [
        "Sabrina Berger",
        "Arianna Lasinski",
        "Vincent MacKay",
        "Eamon Egan",
        "Dallas Wulf",
        "Aman Chokshi",
        "Jonathan Sievers"
      ],
      "abstract": "First Use of GPS Satellites for Beam Calibration of Radio Dish Telescopes Sabrina Berger, Arianna Lasinski, Vincent MacKay, Eamon Egan, Dallas Wulf, Aman Chokshi, Jonathan Sievers Revised version with simulations and one new author (V. MacKay); resubmitted to PASA following referee feedback Instrumentation and Methods for Astrophysics (astro-ph.IM) We present results from the first application of the Global Navigation Satellite System (GNSS; e.g., the Global Positioning System, GPS) for radio beam calibration using a commercial GNSS receiver with the Deep Dish Development Array (D3A) at the Dominion Radio Astrophysical Observatory (DRAO). Several GNSS satellites pass through the main and sidelobes of the beam each day, enabling efficient mapping of the 2D beam structure. Due to the high SNR and abundance of GNSS satellites, we find evidence that GNSS can probe several sidelobes of the beam through repeatable measurements of the beam over several days. Over three days of measurements, the smallest observed difference in the primary beam's main lobe was 0.56 dB-Hz. We also compare our results in the sidelobes to simulations and find rough agreement in shape. When scaling the observations and simulations to match in the main lobe power levels, we find deviations in at least one of the first few nulls of approximately 5 dB or less. There is saturation in the main lobe for most satellites, which can likely be mitigated by better attenuation before the receiver input. We compare our work to other satellite systems that have been successful and are likely complementary to this technique. However, GNSS offers key advantages, including continuous transmission, broader frequency coverage relevant to CHORD, SKA-mid, and the DSA-2000, as well as more frequent satellite passes, making it a promising calibration method. These results also motivate further development of this technique for radio astronomy applications.",
      "pdf_url": "https://arxiv.org/pdf/2411.06144.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.03810",
      "title": "Molecular Dynamics Simulations on Nuclear Recoils in Silicon Crystals towards Single Electron-Hole Pair Ionization Yields",
      "authors": [
        "Chang-Hao Fang",
        "Shin-Ted Lin",
        "Shu-Kui Liu",
        "Henry Tsz-King Wong",
        "Hao-Yang Xing",
        "Li-Tao Yang",
        "Qian Yue",
        "Jing-Jun Zhu"
      ],
      "abstract": "Molecular Dynamics Simulations on Nuclear Recoils in Silicon Crystals towards Single Electron-Hole Pair Ionization Yields Chang-Hao Fang, Shin-Ted Lin, Shu-Kui Liu, Henry Tsz-King Wong, Hao-Yang Xing, Li-Tao Yang, Qian Yue, Jing-Jun Zhu 7 pages, 5 figures, revised manuscript Phys. Rev. D 112, L101303 (2025) Instrumentation and Methods for Astrophysics (astro-ph.IM); Materials Science (cond-mat.mtrl-sci) We have developed a novel methodology utilizing molecular dynamics simulations to evaluate the ionization yields of nuclear recoils in crystalline silicon. This approach enables analytical exploration of atomic-scale transport within the lattice without necessitating parameterization. The quenching factors across the nuclear recoil energy range from 20 eV to 10 keV have been thoroughly investigated. A remarkable agreement with experimental data is achieved, particularly for the minimal energy regime conducted to date, reaching the level of a single electron-hole pair. This work presents evidence of a crucial and fundamental distribution of the quenching factor, which can be associated to the collisional interactions underlying the transport phenomena. The region below 4 keV of the quenching factor, where discrepancies have been observed with the Lindhard's model, is found to be significantly attributed to the lattice binding effect and the specific crystal structure. In contrast, a gradual functional relationship is identified below approximately 100 eV, indicating that the quenching factor is influenced by the crystallographic orientation of the target material. From a distributional perspective, our analysis allows for the determination of the minimum exclusion mass for the dark matter nucleon elastic scattering channel at 0.29 $\\mathrm{GeV}/c^2$, thereby significantly enhancing sensitivity for the sub-$\\mathrm{GeV}/c^2$ mass region.",
      "pdf_url": "https://arxiv.org/pdf/2506.03810.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07878",
      "title": "FlowLensing: Simulating Gravitational Lensing with Flow Matching",
      "authors": [
        "Hamees Sayed",
        "Pranath Reddy",
        "Michael W. Toomey",
        "Sergei Gleyzer"
      ],
      "abstract": "FlowLensing: Simulating Gravitational Lensing with Flow Matching Hamees Sayed, Pranath Reddy, Michael W. Toomey, Sergei Gleyzer Instrumentation and Methods for Astrophysics (astro-ph.IM); Computer Vision and Pattern Recognition (cs.CV) Gravitational lensing is one of the most powerful probes of dark matter, yet creating high-fidelity lensed images at scale remains a bottleneck. Existing tools rely on ray-tracing or forward-modeling pipelines that, while precise, are prohibitively slow. We introduce FlowLensing, a Diffusion Transformer-based compact and efficient flow-matching model for strong gravitational lensing simulation. FlowLensing operates in both discrete and continuous regimes, handling classes such as different dark matter models as well as continuous model parameters ensuring physical consistency. By enabling scalable simulations, our model can advance dark matter studies, specifically for probing dark matter substructure in cosmological surveys. We find that our model achieves a speedup of over 200$\\times$ compared to classical simulators for intensive dark matter models, with high fidelity and low inference latency. FlowLensing enables rapid, scalable, and physically consistent image synthesis, offering a practical alternative to traditional forward-modeling pipelines.",
      "pdf_url": "https://arxiv.org/pdf/2510.07878.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.CV"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10726",
      "title": "An Analytical Model for the Eccentricity Cascade: Hot Jupiter Formation via S-type Instability",
      "authors": [
        "Eritas Yang",
        "Yubo Su"
      ],
      "abstract": "An Analytical Model for the Eccentricity Cascade: Hot Jupiter Formation via S-type Instability Eritas Yang, Yubo Su 19 pages, 11 figures. Under review at ApJ. Comments welcome! Earth and Planetary Astrophysics (astro-ph.EP) A widely explored pathway for hot Jupiter (HJ) formation is high-eccentricity migration driven by von Zeipel-Lidov-Kozai cycles induced by an exterior companion. However, for a distant or low-mass companion, this mechanism typically demands that the planet's initial orbit be very nearly perpendicular to that of the companion. In previous work (Yang et al. 2025), we demonstrated that such fine-tuning can be circumvented in the HAT-P-7 system due to the presence of an intermediate body that efficiently couples the orbits of the planet and the distant companion -- a mechanism we termed the eccentricity cascade (EC). In this work, we analytically characterize the dynamics governing the EC and delineate the parameter space within which it effectively operates. Our qualitative results are as follows: (i) The proto-HJ's eccentricity is most efficiently excited when the inner triple is on the verge of dynamical instability, (ii) the addition of a distant fourth body allows this instability to be approached gradually, and (iii) the instability mechanism is closely related to the stability of circumstellar (S-type) planets in binaries. By deriving an analytic criterion for S-type instability, we obtain closed-form expressions describing the onset of the EC. Our results show that efficient HJ formation via the EC occurs across a broad range of intermediate perturbers, highlighting its potential as a robust migration channel.",
      "pdf_url": "https://arxiv.org/pdf/2511.10726.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10734",
      "title": "TESS Investigation -- Demographics of Young Exoplanets (TI-DYE) IV: a Jovian radius planet orbiting a 34 Myr Sun-like star in the Vela association",
      "authors": [
        "Madyson G. Barber",
        "Andrew W. Mann",
        "Andrew Vanderburg",
        "Khalid Barkaoui",
        "Karen A. Collins",
        "Sebastian Carrazco-Gaxiola",
        "Phil Evans",
        "Matthew J. Fields",
        "Michael Gillon",
        "Todd J. Henry",
        "Katharine M. Hesse",
        "Wei-Chun Jao",
        "Emmanuel Jehin",
        "Sydney Jenkins",
        "Tim Johns",
        "David R. Rodriguez",
        "Richard P. Schwarz",
        "William C. Storch",
        "Cristilyn N. Watkins",
        "Francis P. Wilkin"
      ],
      "abstract": "TESS Investigation -- Demographics of Young Exoplanets (TI-DYE) IV: a Jovian radius planet orbiting a 34 Myr Sun-like star in the Vela association Madyson G. Barber, Andrew W. Mann, Andrew Vanderburg, Khalid Barkaoui, Karen A. Collins, Sebastian Carrazco-Gaxiola, Phil Evans, Matthew J. Fields, Michael Gillon, Todd J. Henry, Katharine M. Hesse, Wei-Chun Jao, Emmanuel Jehin, Sydney Jenkins, Tim Johns, David R. Rodriguez, Richard P. Schwarz, William C. Storch, Cristilyn N. Watkins, Francis P. Wilkin Accepted for publication in Journals of the AAS Earth and Planetary Astrophysics (astro-ph.EP) The discovery of infant (< 50 Myr), close-in (<30-day period) planets is vital in understanding the formation mechanisms that lead to the distribution of mature transiting planets as discovered by Kepler. Despite several discoveries in this age bin, the sample is still too small for a robust statistical comparison to older planets. Here we report the validation of TOI-6448 b, an 8.8 +/- 0.8 Re planet on a 14.8 day orbit. TOI-6448 was previously identified to be a likely member of Vela Population IV. We confirm the star's membership and re-derive the age of the cluster using isochrones, variability, and gyrochronology. We find the star, and thus planet, to be 34 +/- 3 Myr. Like other young planets, TOI-6448 b lands in a region of parameter space with few older planets. While just one data point, this fits with prior findings of an excess of 5-11Re planets around young stars far beyond what can be explained by reduced sensitivity at young ages. Our ongoing search of Vela, Taurus-Auriga, Sco-Cen, and Orion are expected to reveal dozens more < 50 Myr transiting planets.",
      "pdf_url": "https://arxiv.org/pdf/2511.10734.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10751",
      "title": "Hydrogen-line profiles from accreting gas giants and their CPDs",
      "authors": [
        "Gabriel-Dominique Marleau",
        "Thomas Henning",
        "Roy van Boekel",
        "Myriam Benisty",
        "Yuhiko Aoyama",
        "Inga Kamp"
      ],
      "abstract": "Hydrogen-line profiles from accreting gas giants and their CPDs Gabriel-Dominique Marleau, Thomas Henning, Roy van Boekel, Myriam Benisty, Yuhiko Aoyama, Inga Kamp 16 pages, 10 figures, appendixes. Submitted to A&A Earth and Planetary Astrophysics (astro-ph.EP) Few gas giants have been observed in their accretion phase. ELT instruments will have a higher sensitivity and a smaller inner working angle than instruments up to now, allowing detailed characterisation. We study the observability of accreting gas giants with METIS, the first-generation ELT spectrograph with a resolution R = 1e5. We focus on the accretion-tracing hydrogen recombination lines accessible to METIS, mainly Brackett alpha and Pfund-series lines. Our approach is general but we take PDS 70 b as a fiducial case. To calculate high-resolution line profiles, we combine a semianalytical multidimensional description of the flow onto an accreting planet and its circumplanetary disc (CPD) with local NLTE shock-emission calculations. We assume the limiting scenario of no extinction, appropriate for gas giants in gaps, and negligible contribution from magnetospheric accretion. We use resolved photospheric models, and include detector sensitivities to compute required observing times. Both the planet surface and the CPD surface shocks contribute to the total line profile, which is non-Gaussian and much narrower than the free-fall velocity. When the accretion onto PDS 70 b is at its maximum observed strength, the Br a line peak is equal to the photospheric continuum, which is modulated mostly by water features. However, the rotation of the planet broadens the features, making the shock excess stand out. At Br a, already only the continuum of PDS 70 b should yield SNR = 12 in 4 h, and for the fiducial accretion rate, the line peak will have a per-bin SNR = 28 in 4 h. The peak excess should require only about 10 min to reach SNR = 3. Br a is a potent planet formation tracer accessible to ELT/METIS in little integration time. Resolved line profiles will place independent constraints especially on the mass and radius of accreting planets, and help identify the accretion mechanism(s) at work.",
      "pdf_url": "https://arxiv.org/pdf/2511.10751.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10801",
      "title": "What's Inside Matters: The Effect of Oxygen Fugacity and Initial Volatile Abundance on the Atmospheres of the TRAPPIST-1 Planets",
      "authors": [
        "Junellie Perez",
        "Laura K. Schaefer",
        "Edward Schwieterman",
        "Kevin B. Stevenson",
        "Howard Chen",
        "Jacob Lustig-Yaeger"
      ],
      "abstract": "What's Inside Matters: The Effect of Oxygen Fugacity and Initial Volatile Abundance on the Atmospheres of the TRAPPIST-1 Planets Junellie Perez, Laura K. Schaefer, Edward Schwieterman, Kevin B. Stevenson, Howard Chen, Jacob Lustig-Yaeger Earth and Planetary Astrophysics (astro-ph.EP) The TRAPPIST-1 planets have become prime targets for studying the atmospheric and geophysical properties of planets around M-dwarf stars. To effectively identify their atmospheric composition, we first must understand their geological evolution. For this study, we focus on enhancing an existing atmosphere-interior exchange model by incorporating additional geological processes relevant to rocky planets. We have extended the model to include the carbon cycle, which enables the model to track four key gas species - CO$_2$, CO, H$_2$O, and H$_2$ - across four planetary reservoirs: the mantle, plate, ocean, and atmosphere. Major features added include surface temperature calculations which are crucial for the carbon cycle, oxygen fugacity as a planetary interior parameter in the model, and oxidation reactions and diffusion-limited escape calculations to the atmosphere portion of the model. We successfully validated the model for Earth and applied this model to study the effect of oxygen fugacity and initial water abundance on TRAPPIST-1 d, e and f. Our results for present-day abundances show that oxygen fugacity significantly affects the partial pressures of H$_2$ and CO$_2$ for all three planets with minor effects for CO on two of the planets. We also found that H$_2$ is strongly dependent on water mass fraction (WMF). The addition of atmospheric processes produced a significant difference in the H$_2$ and CO abundances at present-day. These results highlight the importance of considering interior parameters to be able to further constrain the geological evolution of these planets and effectively put atmosphere observations into context.",
      "pdf_url": "https://arxiv.org/pdf/2511.10801.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10929",
      "title": "A High-Precision Dynamical Model of Callisto: Incorporating Rotation Effects within Multi-Layer Internal Structure Models",
      "authors": [
        "Kai Huang",
        "Yongzhang Yang",
        "Yuhao Chen",
        "Yining Zhang",
        "Yuqiang Li"
      ],
      "abstract": "A High-Precision Dynamical Model of Callisto: Incorporating Rotation Effects within Multi-Layer Internal Structure Models Kai Huang, Yongzhang Yang, Yuhao Chen, Yining Zhang, Yuqiang Li Earth and Planetary Astrophysics (astro-ph.EP) China is planing to launch the Tianwen-4 mission around the year 2030, with its aim being the exploration of Jupiter and its moon, Callisto. Within the realm of deep space exploration, the accuracy of ephemerides is of great importance. Current ephemerides employ a simplified rotation model for Callisto, which this study addresses by proposing a novel dynamical model. This model enhancesthe existing orbital dynamics by integrating Callisto's rotational motions influenced by gravitational torques from the Sun, Jupiter, and other Galilean moons within an inertial frame, capturing the intricate coupling between Callisto's orbital and rotational dynamics. The study establishes a full dynamical model by deriving analytical expressions for this coupling and developing an adjustment model for data fitting using precise orbit determination methods. Furthermore, the influence of tidal effects on Callisto's motion is investigated, considering its multi-layered internal structure. Results demonstrate that the difference between the newly established full model and the model in current ephemerides is on the order of tens of meters. When calculating the impact of different internal structures of Callisto on its orbit, the influence of three-layered and two-layered structures is on the order of meters, suggesting that the development of a high-precision dynamical model requires additional constraints on the internal structure of Callisto. This research provides a novel alternative for a new generation of precise numerical ephemerides for Callisto. Additionally, these findings provide a testing platform for the data from the Tianwen-4 mission.",
      "pdf_url": "https://arxiv.org/pdf/2511.10929.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11328",
      "title": "Formation and disruption of resonant chains of super-Earths: Secular perturbations from outer eccentric embryos",
      "authors": [
        "Masahiro Ogihara",
        "Masanobu Kunitomo"
      ],
      "abstract": "Formation and disruption of resonant chains of super-Earths: Secular perturbations from outer eccentric embryos Masahiro Ogihara, Masanobu Kunitomo 15 pages, 8 figures, accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP) Recent observations have revealed the distribution of orbital period ratios of adjacent planets in multiple super-Earth systems and how these distributions change with time. The aim of this study is to clarify under what conditions the observed features of orbital period ratios of super-Earths can be explained, and to identify what causes the dynamical instability of super-Earths captured into resonant chains. We perform N-body simulations for 100 Myr that follow the formation and orbital evolution of super-Earths originating from a ring of planetary embryos at 1 au from the star. The simulations show that super-Earths undergo inward migration in the disk and are captured into mean-motion resonances with their neighbors. As a result, several resonant pairs form a resonant chain. After disk dispersal, some of these chains become dynamically unstable. In such cases, the final distribution of orbital period ratios and their time evolution can be consistent with recent observations. The instabilities of resonant chains are likely triggered by secular perturbations from embryos that remain on outer orbits beyond 1 au, indicating that not only giant planets but also small embryos can disrupt the resonances among inner super-Earths. We therefore further investigate the secular perturbations from outer embryos using analytic formulas and additional orbital calculations. We discuss the conditions required to excite the eccentricities of inner super-Earths on a timescale of about 100 Myr. These conditions include the need for large eccentricities of the outer embryos, as well as constraints on their masses and semimajor axes.",
      "pdf_url": "https://arxiv.org/pdf/2511.11328.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11329",
      "title": "Close-in compact super-Earth systems emerging from resonant chains: slow destabilization by unseen remnants of formation",
      "authors": [
        "Max Goldberg",
        "Antoine C. Petit"
      ],
      "abstract": "Close-in compact super-Earth systems emerging from resonant chains: slow destabilization by unseen remnants of formation Max Goldberg, Antoine C. Petit Earth and Planetary Astrophysics (astro-ph.EP) Planet formation simulations consistently predict compact systems of numerous small planets in chains of mean motion resonances formed by planet-disk interaction, but transiting planet surveys have found most systems to be non-resonant and somewhat dynamically excited. A scenario in which nearly all of the primordial resonant chains undergo dynamical instabilities and collisions has previously been found to closely match many features of the observed planet sample. However, existing models have not been tested against new observations that show a steep decline in the resonant fraction as a function of stellar age on a timescale of ~100 Myr. We construct a simplified model incorporating Type I migration, growth from embryos, and N-body integrations continued to 500 Myr and use it to generate a synthetic planet population. Nearly all systems exit the disk phase in a resonant configuration but begin slowly diffusing away from the center of the resonance. Dynamical instabilities can arise on timescales of tens or hundreds of Myr, especially when systems formed in disks with a convergent migration trap. In this case, a secondary chain of smaller planets that remained at their birth location eventually breaks, destabilizing the inner resonant chain. We also show that the instability statistics are well modeled by a Weibull distribution, and use this to extrapolate our population to Gyr ages. The close match of our modeled systems to the observed population implies that the high resonance fraction predicted by this class of models is in fact consistent with the data, and the previously-reported overabundance of resonant systems was a consequence of comparing simulations of early evolution to mature Gyr-old systems. This result also suggests that instabilities triggered by disk dissipation or other very early mechanisms are unlikely to be consistent with observed young systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.11329.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11492",
      "title": "A 34.6-day transiting sub-Neptune in the TOI-1422 planetary system",
      "authors": [
        "L. Naponiello",
        "P. Leonardi",
        "M. Damasso",
        "M.-L. Steinmeyer",
        "M. Stalport",
        "C. Dorn",
        "A. S. Bonomo",
        "L. Mancini",
        "A. Sozzetti",
        "S. Benatti",
        "S. Colombo",
        "R. Cosentino"
      ],
      "abstract": "A 34.6-day transiting sub-Neptune in the TOI-1422 planetary system L. Naponiello, P. Leonardi, M. Damasso, M.-L. Steinmeyer, M. Stalport, C. Dorn, A. S. Bonomo, L. Mancini, A. Sozzetti, S. Benatti, S. Colombo, R. Cosentino Accepted by MNRAS on 2025 November 13 Earth and Planetary Astrophysics (astro-ph.EP) TOI-1422 is a G2 V star ($V = 10.6$ mag) known to host a warm Neptune-sized planet, TOI-1422 b, with a mass and radius of about $9M_{\\oplus}$ and $4R_{\\oplus}$, on a circular orbit with a period of $12.997$ days. An outer planetary candidate in this system had previously been suggested on the basis of a residual signal in the radial velocity (RV) data with a tentative period of $\\sim$29 days, along with a possible single transit-like event, although it was not clear at the time whether the two signals belonged to the same companion. In this work, we confirm the presence of a second transiting planet, TOI-1422 c, a sub-Neptune ($R=2.61\\pm0.14 R_{\\oplus}$) that orbits with a longer period of 34.563 days. This confirmation is based on the detection of three TESS transits, two from newly available sectors, combined with new and archival RV measurements. The sub-Neptune ($\\rho_{\\rm c}=4.3^{+1.3}_{-1.0}$ g cm$^{-3}$) is more massive than the inner Neptune ($\\rho_{\\rm b}=0.93^{+0.21}_{-0.20}$ g cm$^{-3}$), having a mass of $M_{\\rm c}=14\\pm3 M_{\\oplus}$, making TOI-1422 a rare anti-ordered system. Furthermore, we detect transit timing variations (TTVs) on the inner planet, with amplitudes of up to 5 hours, suggesting ongoing dynamical interactions. A dynamical analysis that combined TTVs and RVs indicates that planet c alone is unlikely to account for the full TTV amplitude observed on TOI-1422 b. We investigated whether an additional, as yet undetected companion could account for the observed signal, exploring a range of plausible orbital configurations and finding that a low-mass planet located between the two known orbits may be responsible.",
      "pdf_url": "https://arxiv.org/pdf/2511.11492.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11535",
      "title": "Probing the era of giant collisions: millimeter observations of the HD 166191 system",
      "authors": [
        "Kadin Worthen",
        "Christine H. Chen",
        "A. Meredith Hughes",
        "Brandon C. Johnson",
        "Isabel Rebollido",
        "Diego E. Garcia",
        "Jamar Kittling",
        "Carey M. Lisse"
      ],
      "abstract": "Probing the era of giant collisions: millimeter observations of the HD 166191 system Kadin Worthen, Christine H. Chen, A. Meredith Hughes, Brandon C. Johnson, Isabel Rebollido, Diego E. Garcia, Jamar Kittling, Carey M. Lisse Accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP) We present non-simultaneous ALMA band 7 and SMA observations of the HD 166191 disk, which was recently thought to have a collision in its terrestrial planet zone. Both observations detect dust continuum emission and the ALMA observations detect the 12CO J=3-2 line from the circumstellar disk. We do not detect SiO, a potential indicator of giant collisions, but place a limit on the total SiO mass in the system. Unlike previously observed in the infrared, we do not find evidence for variability at millimeter wavelengths when comparing the ALMA continuum observations from 2024 to the pre-collision SMA observations from 2014. We perform modeling of the CO and continuum visibilities and find that both the CO and dust are marginally spatially resolved and are contained to within 20 au from the central star. The modeling of the CO suggests that the outer regions of the disk are gas rich, although further observations are needed to confirm the total gas mass. The evolutionary state of this system has been debated in the literature, and our observations, while not definitive, are generally consistent with the idea that this disk is similar to an evolved protoplanetary or transition/hybrid disk. This could suggest that collisions in the terrestrial planet zone of HD 166191 are occurring while the disk is in a transitional phase, where the inner few au are depleted of gas. This makes HD 166191 an important object for understanding the transition between protoplanetary and debris disks and the stages at which collisions occur.",
      "pdf_url": "https://arxiv.org/pdf/2511.11535.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11442",
      "title": "Influence of Rotation on Fingering Convection in Planetary Cores",
      "authors": [
        "Martin Gray",
        "Celine Guervilly",
        "Graeme Sarson"
      ],
      "abstract": "Influence of Rotation on Fingering Convection in Planetary Cores Martin Gray, Celine Guervilly, Graeme Sarson Fluid Dynamics (physics.flu-dyn); Earth and Planetary Astrophysics (astro-ph.EP); Geophysics (physics.geo-ph) Stably stratified layers are thought to develop at the top of the liquid metallic cores of many terrestrial planets. We consider the case where the thermal gradient is stable but the compositional gradient is unstable, a situation particularly relevant to Mercury. The strong contrast between molecular diffusivities of temperature and composition leads to fingering convection. We investigate this process using hydrodynamical simulations in a rotating spherical shell, systematically varying the stratification strength N relative to the rotation rate $\\Omega$. In all regimes, the primary fingering mode forms narrow, elongated structures that shift orientation from the rotation axis to the direction of gravity as $N^2/\\Omega^2$ exceeds 10. The fingers remain laminar, with transverse scales proportional to thermal stratification but independent of rotation. Fingering convection also drives secondary large-scale flows across most of the explored parameter space, producing diverse dynamics including zonal flows, hemispherical convection, axisymmetric poloidal bands, finger clusters, and toroidal gyres. In the rapidly-rotating regime, laterally inhomogeneous mixing generates zonal flows in thermo-compositional wind balance; zonal flow direction and amplitude depend on $N^2/\\Omega^2$, with amplitude weakening for strong stratification $N^2/\\Omega^2>10$. In the intermediate regime ($N^2/\\Omega^2\\sim 1$), axisymmetric or spiraling poloidal bands emerge within the tangent cylinder, gradually overtaking the primary fingers. For stronger stratification, finger clusters and weak, large-scale density anomalies surrounded by toroidal gyres form in the upper domain. These diverse large-scale flows may interact with the dynamo-generated magnetic field in the deeper core, potentially influencing surface magnetic fields.",
      "pdf_url": "https://arxiv.org/pdf/2511.11442.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25338",
      "title": "Multi-modal atmospheric characterization of $β$ Pictoris b: Adding high-resolution continuum spectra from GRAVITY",
      "authors": [
        "M. Ravet",
        "M. Bonnefoy",
        "G. Chauvin",
        "S. Lacour",
        "M. Nowak",
        "B. Charnay",
        "P. Tremblin",
        "D. Homeier",
        "C. Morley",
        "J. Fortney",
        "A. Denis",
        "S. Petrus",
        "P. Palma-Bifani",
        "R. Landman",
        "L. T. Parker",
        "M. Houllé",
        "A. Chomez",
        "K. Worthen",
        "F. Kiefer",
        "G.-D. Marleau",
        "Z. Zhang",
        "J. L. Birkby",
        "F. Millour",
        "A.-M. Lagrange",
        "A. Vigan",
        "G.P.P.L. Otten",
        "J. Shangguan"
      ],
      "abstract": "Multi-modal atmospheric characterization of $β$ Pictoris b: Adding high-resolution continuum spectra from GRAVITY M. Ravet, M. Bonnefoy, G. Chauvin, S. Lacour, M. Nowak, B. Charnay, P. Tremblin, D. Homeier, C. Morley, J. Fortney, A. Denis, S. Petrus, P. Palma-Bifani, R. Landman, L. T. Parker, M. Houllé, A. Chomez, K. Worthen, F. Kiefer, G.-D. Marleau, Z. Zhang, J. L. Birkby, F. Millour, A.-M. Lagrange, A. Vigan, G.P.P.L. Otten, J. Shangguan Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) We present the first VLTI/GRAVITY observations at R$_\\lambda \\sim 4000$ of $\\beta$ Pic b. These four high S/N ($\\sim$20) K-band spectra conserve both the pseudo-continuum and molecular absorption patterns. We analyze them with four self-consistent forward model grids (Exo-REM, ATMO, BT-Settl, Sonora) exploring $T_{\\mathrm{eff}}$, log(g), metallicity, C/O, and $^{12}$CO/$^{13}$CO ratio. We also upgrade our forward modeling code ForMoSA to account for the data multi-modality and combine the GRAVITY epochs with published 1-5 $\\mu$m photometry, low- to medium-resolution spectra (0.9-7 $\\mu$m), and high-resolution echelle spectra (2.1-5.2 $\\mu$m). Sonora and Exo-REM are statistically preferred. Exo-REM yields $T_{\\mathrm{eff}}$ $=1607.45^{+4.85}_{-6.20}$ K and log(g) $=4.46^{+0.02}_{-0.04}$ dex from GRAVITY alone, and $T_{\\mathrm{eff}}$ $=1502.74^{+2.32}_{-2.14}$ K and log(g) $=4.00\\pm0.01$ dex when including all datasets. Archival data significantly affect the retrieved parameters. C/O remains solar ($0.552^{+0.003}_{-0.002}$) while [M/H] reaches super-solar values (0.50$\\pm$0.01). We report the first tentative constraint on log($^{12}$CO/$^{13}$CO) $\\sim$1.12, though this remains inconclusive due to telluric residuals. Additionally, we estimate the luminosity to be log(L/L$_\\odot$) $=-4.01^{+0.04}_{-0.05}$, implying a heavy-element content of up to $\\sim$5% (20-80 M$_\\oplus$) given the system age and dynamical mass measurements. Access to both continuum and molecular lines at K-band significantly impacts the metallicity, possibly owing to collision-induced absorption shaping the continuum. Echelle spectra do not dominate the final fit with respect to lower resolution data. Future multi-modal frameworks should include weighting schemes reflecting bandwidth and central wavelength coverage.",
      "pdf_url": "https://arxiv.org/pdf/2509.25338.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01548",
      "title": "Exoplanet climate characterization with transit asymmetries -- A comprehensive population study from the optical to the infrared",
      "authors": [
        "Ludmila Carone",
        "Christiane Helling",
        "Sebastian Gernjak",
        "Hanna Leitner",
        "Tamara Janz"
      ],
      "abstract": "Exoplanet climate characterization with transit asymmetries -- A comprehensive population study from the optical to the infrared Ludmila Carone, Christiane Helling, Sebastian Gernjak, Hanna Leitner, Tamara Janz Accepted for publication in A&A, 32 pages, 29 figures (Description of PLATO band used in the work updated and additional acknowledgements added.) Earth and Planetary Astrophysics (astro-ph.EP) Space missions (CHEOPS, JWST, PLATO) facilitate detailed characterization of exoplanets. This work provides a framework to characterize cloud and climate properties of close-in gas giants via transit depth asymmetries from the optical to the infrared (0.33 ...10 $\\mu$m). The AFGKM ExoRad 3D GCM grid provides gas temperature profiles for an ensemble of 50 tidally locked gaseous planets orbiting diverse host stars. It is combined with a detailed kinetic cloud formation model. The end result is a set of synthetic transit spectra and evening-to-morning transit asymmetries that span climate regimes: warm (T=800 K ... 1000K), intermediately hot (T=1200 K ... 2000 K) and ultrahot (T =2200 K ... 2600 K). WASP-39b observations suggest iron-free clouds with less abundant cloud condensation nuclei than previously expected. The ensemble study shows that clouds increase transit limb differences due to asymmetries in cloud coverage and by enhancing horizontal differences in the gas temperatures. For hot planets, evening-to-morning differences of up to 150 ppm are suggested in the optical and 100 ppm in the infrared (2-8 micron). For ultra-hot Jupiters, evening-to-morning transit differences are dominated by the morning cloud for a cloud-free evening limb: They are strongly negative in the PLATO band (0.5-1~$\\mu$m, -500 ppm), moderately negative in the near-infrared (1-1.5~$\\mu$m, -200 ppm) and moderately positive (+100 ppm) for $\\lambda > 2\\mu$m. For a partly cloudy evening terminator, the evening-to-morning transit asymmetry is moderately positive in the whole wavelength range. Warm Jupiter planets exhibit negligible transit asymmetries. PLATO and JWST transit asymmetry observations between 1-2 $\\mu$m are optimal to characterize cloudy planetary atmospheres around K -A stars. JWST observations are most effective for M star planets with transit differences > +500 ppm for 8-10 $\\mu$m.",
      "pdf_url": "https://arxiv.org/pdf/2511.01548.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09489",
      "title": "Global Distribution of the Key Species on the Surface of Europa",
      "authors": [
        "Jiazheng Li",
        "Yinsi Shou",
        "Cheng Li",
        "Xianzhe Jia"
      ],
      "abstract": "Global Distribution of the Key Species on the Surface of Europa Jiazheng Li, Yinsi Shou, Cheng Li, Xianzhe Jia Earth and Planetary Astrophysics (astro-ph.EP) The icy surface of Europa is continuously bombarded by ions and electrons from Jupiter's magnetosphere. The bombardment of the particles dissociates water molecules on the surface of Europa and introduces impurities to the icy surface. Such processes lead to the generation of the nonwater species on the surface of Europa. These chemical species are closely related to the chemistry of the icy crust and the subsurface ocean, as well as Europa's habitability. However, our knowledge of the global distribution of these species is limited due to the sparse satellite and telescope observations on Europa. In this study, we combine a Europa plasma model and a chemical-transport model to simulate the global distribution of the key nonwater species on the surface of Europa. The initial results from our model agree well with the existing observations on the distributions of H2SO4 and SO2 but they show a significant discrepancy with the observed distribution of H2O2. Sensitivity tests on the reaction rate coefficients indicate that the simulated global distribution of all three species fit the observations well if the reaction rate coefficients in the ice are reduced by one order of magnitude. This finding provides a useful constraint on the rate coefficient of the chemical reactions in the ice. Furthermore, our model predicts that the O2 on the surface ice of Europa is concentrated on the leading hemisphere. The simulated global distribution of the key species on Europa may provide useful guidance for future missions to Europa, such as Europa Clipper and JUICE.",
      "pdf_url": "https://arxiv.org/pdf/2511.09489.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2409.08536",
      "title": "Bridging the Rossby number gap in rapidly rotating thermal convection",
      "authors": [
        "Adrian van Kan",
        "Keith Julien",
        "Benjamin Miquel",
        "Edgar Knobloch"
      ],
      "abstract": "Bridging the Rossby number gap in rapidly rotating thermal convection Adrian van Kan, Keith Julien, Benjamin Miquel, Edgar Knobloch Fluid Dynamics (physics.flu-dyn); Earth and Planetary Astrophysics (astro-ph.EP); Atmospheric and Oceanic Physics (physics.ao-ph); Computational Physics (physics.comp-ph); Geophysics (physics.geo-ph) Geophysical and astrophysical fluid flows are typically driven by buoyancy and strongly constrained at large scales by planetary rotation. Rapidly rotating Rayleigh-Bénard convection (RRRBC) provides a paradigm for experiments and direct numerical simulations (DNS) of such flows, but the accessible parameter space remains restricted to moderately fast rotation rates (Ekman numbers $Ek \\gtrsim 10^{-8}$), while realistic $Ek$ for astro-/geophysical applications are orders of magnitude smaller. On the other hand, previously derived reduced equations of motion describing the leading-order behaviour in the limit of very rapid rotation ($Ek\\to 0$) cannot capture finite rotation effects, and the physically most relevant part of parameter space with small but finite $Ek$ has remained elusive. Here, we employ the rescaled incompressible Navier-Stokes equations (RiNSE) -- a reformulation of the Navier-Stokes-Boussinesq equations informed by the scalings valid for $Ek\\to 0$, recently introduced by Julien et al. (2024) -- to provide full DNS of RRRBC at unprecedented rotation strengths down to $Ek=10^{-15}$ and below, revealing the disappearance of cyclone-anticyclone asymmetry at previously unattainable Ekman numbers ($Ek \\approx 10^{-9}$). We also identify an overshoot in the heat transport as $Ek$ is varied at fixed $\\widetilde{Ra}= Ra Ek^{4/3}$, associated with dissipation due to ageostrophic motions in the boundary layers. The simulations validate theoretical predictions based on thermal boundary layer theory for RRRBC and show that the solutions of RiNSE agree with the reduced equations at very small $Ek$. These results represent a first foray into the vast, largely unexplored parameter space of very rapidly rotating convection rendered accessible by RiNSE.",
      "pdf_url": "https://arxiv.org/pdf/2409.08536.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}