{
  "date": "2025-11-06",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.SR",
    "astro-ph.CO",
    "astro-ph.HE",
    "astro-ph.IM",
    "astro-ph.GA"
  ],
  "total_papers": 114,
  "gw_related_papers": 11,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.01919",
      "title": "Optimal strategies for continuous wave detection in pulsar timing arrays: Realistic pulsar noise and a gravitational wave background",
      "authors": [
        "Shashwat C. Sardesai",
        "Gabriel E. Freedman",
        "Sarah J. Vigeland",
        "Caitlin A. Witt"
      ],
      "abstract": "Optimal strategies for continuous wave detection in pulsar timing arrays: Realistic pulsar noise and a gravitational wave background Shashwat C. Sardesai, Gabriel E. Freedman, Sarah J. Vigeland, Caitlin A. Witt High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Pulsar timing arrays are sensitive to low-frequency gravitational waves (GWs), such as those produced by supermassive binary black holes at subparsec separations. The incoherent superposition of GWs emitted by a cosmological population of these sources produces a gravitational wave background (GWB), while some individual sources may be resolvable as deterministic signals with slowly varying GW frequencies, which are often referred to as \"continuous waves\" (CWs). The Fp-statistic is a frequentist method of detecting these CWs. In this paper, we study how the presence of pulsar red noise and a GWB affect the Fp-statistic. We compare results when marginalizing over the red noise and using the maximum-likelihood values of the red noise, and find little difference between the two. We also present results of using the Fp-statistic to analyze the NANOGrav 12.5-year data set, where we find no evidence for CWs in agreement with the previously published Bayesian results.",
      "pdf_url": "https://arxiv.org/pdf/2511.01919.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.02057",
      "title": "Plasma flow in force-free magnetospheres: two-fluid model near pulsars and black holes",
      "authors": [
        "Morifumi Mizuno",
        "Samuel E. Gralla",
        "Alexander Philippov"
      ],
      "abstract": "Plasma flow in force-free magnetospheres: two-fluid model near pulsars and black holes Morifumi Mizuno, Samuel E. Gralla, Alexander Philippov High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Force-free electrodynamics describes the electromagnetic field of the magnetically dominated plasma found near pulsars and active black holes, but gives no information about the underlying particles that ultimately produce the observable emission. Working in the two-fluid approximation, we show how particles can be \"painted on\" to a force-free solution as a function of boundary conditions that encode the particle output of \"gap regions\" where the force-free approximation does not hold. These boundary conditions also determine the leading parallel electric field in the entire magnetosphere. Our treatment holds in a general (possibly curved) spacetime and is phrased in language intrinsic to the 1+1 dimensional \"field sheet spacetimes\" experienced by particles stuck to magnetic field lines. Besides the new results, this provides an elegant formulation of some standard equations; for example, we show that the zero-gyroradius guiding center approximation is just the Lorentz force law on the field sheet. We derive a general perturbative method and apply it to pulsar and black hole magnetospheres with radial magnetic fields to produce fully analytic models that capture key features of the full problem. When applied to more realistic magnetic field configurations together with simulation-informed boundary conditions for the gap regions, this approach has the potential to provide global magnetosphere models without the need for global particle-in-cell simulations.",
      "pdf_url": "https://arxiv.org/pdf/2511.02057.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02059",
      "title": "Primordial Black Holes from Kinetic Preheating",
      "authors": [
        "Peter Adshead",
        "Eve Currens",
        "John T. Giblin Jr"
      ],
      "abstract": "Primordial Black Holes from Kinetic Preheating Peter Adshead, Eve Currens, John T. Giblin Jr Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We demonstrate that violent kinetic preheating following inflation can lead to the formation of black holes in the early Universe. In $\\alpha$-attractor models with derivative inflaton couplings, nonlinear amplification of field fluctuations drives large spacetime curvature and gravitational collapse shortly after inflation ends. Using fully general-relativistic lattice simulations, we find that these dynamics produce black holes with masses of order tens of grams at sub-horizon scales, without requiring large primordial curvature perturbations. Although such micro-black holes evaporate rapidly via Hawking radiation, their formation modifies the post-inflationary equation of state and their evaporation can successfully reheat the Universe before Big Bang nucleosynthesis. These results identify kinetic preheating as a new, efficient channel for black-hole production and establish a direct connection between inflationary symmetries and strong-gravity phenomena at reheating.",
      "pdf_url": "https://arxiv.org/pdf/2511.02059.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02155",
      "title": "Measurement of angular cross-correlation between the cosmological dispersion measure and the thermal Sunyaev--Zeldovich effect",
      "authors": [
        "Ryuichi Takahashi",
        "Kunihito Ioka",
        "Masato Shirasaki",
        "Ken Osato"
      ],
      "abstract": "Measurement of angular cross-correlation between the cosmological dispersion measure and the thermal Sunyaev--Zeldovich effect Ryuichi Takahashi, Kunihito Ioka, Masato Shirasaki, Ken Osato submitted to PASJ; 19 pages, 14 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The dispersion measures (${\\rm DMs}$) from fast radio bursts (FRBs) and the thermal Sunyaev--Zeldovich (tSZ) effect probe the free-electron density and pressure, respectively, in the intergalactic medium (IGM) and the intervening galaxies and clusters. Their combination enables disentangling the gas density and temperature. In this work, we present the first detection of an angular cross-correlation between the ${\\rm DMs}$ and the Compton $y$ parameter of the tSZ effect. The theoretical expectation is calculated using the halo model $\\texttt{HMx}$, calibrated with hydrodynamic simulations. The observational cross-correlation is measured over angular separations of $1^\\prime$--$1000^\\prime$ using the ${\\rm DMs}$ from $133$ localized FRBs and the $y$-maps from the Planck satellite and the Atacama Cosmology Telescope (ACT). We detect a positive correlation with amplitudes of $\\mathcal{A}=2.26 \\pm 0.56$ ($4.0 \\sigma$) for Planck and $\\mathcal{A}=1.38 \\pm 0.92$ ($1.5 \\sigma$) for ACT, where $\\mathcal{A}=1$ corresponds to the theoretical prediction of the Planck 2018 $\\Lambda$CDM cosmology. Assuming an isothermal gas, the measured amplitude implies an average electron temperature of $\\approx 2 \\times 10^7 \\, {\\rm K}$. The correlation is highly sensitive to the matter clustering parameter $\\sigma_8$, and its dependence on other cosmological and astrophysical parameters -- such as the ionized fraction, the Hubble constant, and baryon feedback -- differs from that of the ${\\rm DM}$ alone. This suggests that future joint analyses of the ${\\rm DMs}$ and the tSZ effect could help break degeneracies among these parameters.",
      "pdf_url": "https://arxiv.org/pdf/2511.02155.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02709",
      "title": "Lunar Time",
      "authors": [
        "Pascale Defraigne",
        "Frédéric Meynadier",
        "Adrien Bourgoin"
      ],
      "abstract": "Pascale Defraigne, Frédéric Meynadier, Adrien Bourgoin Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) The regain of interest in Moon exploration has substantially grown in the last years. For this reason, the space agencies consider the development of a precise navigation and positioning service similar to the Earth GNSS. Aiming at some meter accuracy, this requires to set up a relativistic lunar reference frame, with an associated coordinate time. If the IAU already defined the Lunar Coordinate Time TCL, there is still some freedom in the choice of the coordinate timescale to be adopted as reference on or around the Moon. This paper proposes a trade-off analysis of different possible options for this reference time scale. It shows that TCL is the best option to be used as practical time reference on the Moon, without the need to define a new time scale based on a scaling of TCL.",
      "pdf_url": "https://arxiv.org/pdf/2511.02709.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2404.16428",
      "title": "Costless correction of chain based nested sampling parameter estimation in gravitational wave data and beyond",
      "authors": [
        "Metha Prathaban",
        "Will Handley"
      ],
      "abstract": "Costless correction of chain based nested sampling parameter estimation in gravitational wave data and beyond Metha Prathaban, Will Handley Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Nested sampling parameter estimation differs from evidence estimation, in that it incurs an additional source of uncertainty. This uncertainty affects estimates of parameter means and credible intervals in gravitational wave analyses and beyond, and yet, it is typically not accounted for in standard uncertainty estimation methods. In this paper, we present two novel methods to quantify this uncertainty more accurately for any chain based nested sampler, using the additional likelihood calls made at runtime in producing independent samples. Using injected signals of black hole binary coalescences as an example, we first show concretely that the usual uncertainty estimation method is insufficient to capture the true error bar on parameter estimates. We then demonstrate how the extra points in the chains of chain based samplers may be carefully utilised to estimate this uncertainty correctly, and provide a way to check the accuracy of the resulting error bars. Finally, we discuss how this uncertainty affects $p$-$p$ plots and coverage assessments.",
      "pdf_url": "https://arxiv.org/pdf/2404.16428.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2411.17663",
      "title": "Accelerated nested sampling with posterior repartitioning and $β$-flows for gravitational waves",
      "authors": [
        "Metha Prathaban",
        "Harry Bevins",
        "Will Handley"
      ],
      "abstract": "Accelerated nested sampling with posterior repartitioning and $β$-flows for gravitational waves Metha Prathaban, Harry Bevins, Will Handley Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) There is an ever-growing need in the gravitational wave community for fast and reliable inference methods, accompanied by an informative error bar. Nested sampling satisfies the last two requirements, but its computational cost can become prohibitive when using the most accurate waveform models. In this paper, we demonstrate the acceleration of nested sampling using a technique called posterior repartitioning. This method leverages nested sampling's unique ability to separate prior and likelihood contributions at the algorithmic level. Specifically, we define a `repartitioned prior' informed by the posterior from a low-resolution run. To construct this repartitioned prior, we use a $\\beta$-flow, a novel type of conditional normalizing flow designed to better learn deep tail probabilities. $\\beta$-flows are trained on the entire nested sampling run and conditioned on an inverse temperature $\\beta$. Applying our methods to simulated and real binary black hole mergers, we demonstrate how they can reduce the number of likelihood evaluations required for a given evidence precision by up to an order of magnitude, enabling faster model comparison and parameter estimation. Furthermore, we highlight the robustness of using $\\beta$-flows over standard normalizing flows for posterior repartitioning. Notably, $\\beta$-flows are able to recover posteriors and evidences which are generally consistent with those from traditional nested sampling, even in cases where standard normalizing flows fail.",
      "pdf_url": "https://arxiv.org/pdf/2411.17663.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2501.18336",
      "title": "Gaussian-process reconstructions and model building of quintom dark energy from latest cosmological observations",
      "authors": [
        "Yuhang Yang",
        "Qingqing Wang",
        "Chunyu Li",
        "Peibo Yuan",
        "Xin Ren",
        "Emmanuel N. Saridakis",
        "Yi-Fu Cai"
      ],
      "abstract": "Gaussian-process reconstructions and model building of quintom dark energy from latest cosmological observations Yuhang Yang, Qingqing Wang, Chunyu Li, Peibo Yuan, Xin Ren, Emmanuel N. Saridakis, Yi-Fu Cai Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) In this article we use the latest cosmological observations, including SNe, BAO, CC and RSD, to reconstruct the cosmological evolution via the Gaussian process. At the background level, we find consistency with the quintom dynamics for different data combinations and divide the characteristics of dark energy into three different categories, which are negative-energy dark energy, late-dominated dark energy and oscillating dark energy, respectively. Considering the effect of modified gravity on the growth of matter perturbations, the reconstruction results at the perturbative level show that we only need minor corrections to general relativity. Furthermore, we provide theoretical interpretation for the three different types of dynamical dark-energy behavior, in the framework of modified gravity, scalar fields, and dark-energy equation-of-state parametrizations. Finally, we show that all of these models can be unified in the framework of effective field theory.",
      "pdf_url": "https://arxiv.org/pdf/2501.18336.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.02034",
      "title": "Accelerating the standard siren method: Improved constraints on modified gravitational-wave propagation with future data",
      "authors": [
        "Matteo Tagliazucchi",
        "Michele Moresco",
        "Nicola Borghi",
        "Manfred Fiebig"
      ],
      "abstract": "Accelerating the standard siren method: Improved constraints on modified gravitational-wave propagation with future data Matteo Tagliazucchi, Michele Moresco, Nicola Borghi, Manfred Fiebig 13 pages, 10 figures, 2 tables. CHIMERA 2.0 is be publicly available at this https URL. v2 matches the version published by A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational waves (GWs) from compact binary mergers have emerged as one of the most promising probes of cosmology and General Relativity (GR). However, a major challenge in fully exploiting GWs as standard sirens with current and future GW observatories is developing efficient and robust codes capable of analyzing the increasing data volumes that are, and will be, acquired. We present here CHIMERA 2.0, an advanced computational framework for hierarchical Bayesian inference of cosmological, modified gravity, and population hyperparameters using standard sirens and galaxy catalogs. This upgrade introduces novel GPU-accelerated algorithms to estimate the hierarchical likelihood, enabling the analysis of thousands of events - crucial for next-generation experiments - and includes the two-parameter ($\\Xi_0-n$) modified GW propagation model. Using CHIMERA 2.0, we forecast cosmological and modified GW propagation constraints for the future LIGO-Virgo-KAGRA O5-like run. We analyze three binary black hole populations of 300 events at SNR>20, each with a different value of $\\Xi_0$: 0.6, 1 (corresponding to GR), and 1.8. Multiple analyses were performed each catalog, comprising a population of approximately 5000 events, thanks to CHIMERA 2.0, which is 10-1000 times faster depending on the settings and catalog size. We jointly infer cosmological, modified GW propagation, and population hyperparameters. With spectroscopic galaxy catalogs, the fiducial $\\Xi_0$ is recovered with a precision of $22\\%$, $7.5\\%$, and $10\\%$ for $\\Xi_0$ = 0.6, 1, and 1.8, respectively; while the precision on $H_0$ is 2-7 times worse than when $\\Xi_0$ is not inferred. Finally,in the case of photometric redshifts the constraints degrade on average by 3.5 times in all cases, underscoring the importance of future spectroscopic surveys in maximizing the constraining power of standard sirens.",
      "pdf_url": "https://arxiv.org/pdf/2504.02034.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.23387",
      "title": "Ultra High Energy Neutrino Event KM3-230213A as a Signal of Electroweak Vacuum Turbulence in Merging Black Hole Binaries",
      "authors": [
        "Alexander S. Sakharov",
        "Rostislav Konoplich",
        "Merab Gogberashvili"
      ],
      "abstract": "Ultra High Energy Neutrino Event KM3-230213A as a Signal of Electroweak Vacuum Turbulence in Merging Black Hole Binaries Alexander S. Sakharov, Rostislav Konoplich, Merab Gogberashvili 27 pages, 1 figure, 7 tables, aligned with version published in Physical Review D Phys. Rev. D 112, 083061 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The recent detection of the ultra-high-energy neutrino event KM3-230213A ($\\sim$220 PeV) by KM3NeT telescope poses a challenge to conventional astrophysical models, particularly in light of the absence of similar $\\gtrsim$100 PeV events in IceCube data, despite its larger exposure. We propose a novel mechanism in which binary black hole mergers act as transient neutrino sources via gravitationally induced electroweak vacuum instability. In this scenario, the extreme spacetime curvature near the horizons during the final inspiral phase destabilizes the Higgs vacuum, triggering nucleation of true-vacuum bubbles. Collisions between these bubbles produce microscopic black holes that rapidly evaporate via Hawking radiation, emitting intense, short-lived bursts of neutrinos with energies exceeding 100 PeV. The resulting neutrino fluence follows a heavy-tailed distribution, allowing rare but highly luminous sources to account for events like KM3-230213A while remaining consistent with IceCube's non-detections. This framework links gravitational wave sources to ultra-high-energy neutrino production and suggests that future multi-messenger observations may detect electromagnetic signatures from microscopic black hole evaporation.",
      "pdf_url": "https://arxiv.org/pdf/2506.23387.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.09161",
      "title": "Machine Learning Confirms GW231123 is a \"Lite\" Intermediate Mass Black Hole Merger",
      "authors": [
        "Chayan Chatterjee",
        "Kaylah McGowan",
        "Suyash Deshmukh",
        "Karan Jani"
      ],
      "abstract": "Machine Learning Confirms GW231123 is a \"Lite\" Intermediate Mass Black Hole Merger Chayan Chatterjee, Kaylah McGowan, Suyash Deshmukh, Karan Jani High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The LIGO-Virgo-KAGRA Collaboration recently reported GW231123, a black hole merger with total mass of around 190-265 solar mass. This event adds to the growing evidence of \"lite\" intermediate mass black hole (IMBH) discoveries of post-merger black holes >100 solar mass. GW231123 posed several data analysis challenges owing to waveform-model systematics and presence of noise artifacts called glitches. We present the first comprehensive machine learning analysis to further validate this event, strengthen its astrophysical inference, and characterize instrumental noise in its vicinity. Our approach uses a combination of tools tailored for specific analyses: GW-Whisper, an adaptation of OpenAI's audio transformer, ArchGEM, a Gaussian mixture model-based soft clustering and density approximation software and AWaRe, a convolutional autoencoder. We identify the data segment containing the merger with >70% confidence in both detectors and verify its astrophysical origin. We then characterize the scattered light glitch around the event, providing the first physically interpretable parameters for the glitch. We also reconstruct the real waveforms from the data with slightly better agreement to model-agnostic reconstructions than to quasi-circular models, hinting at possible astrophysics beyond current waveform families (such as non-circular orbits or environmental imprints). Finally, by demonstrating high-fidelity waveform reconstructions for simulated mergers with total masses between 100-1000 solar mass, we show that our method can confidently probe the IMBH regime. Our integrated framework offers a powerful complementary tool to traditional pipelines for rapid, robust analysis of massive, glitch-contaminated events.",
      "pdf_url": "https://arxiv.org/pdf/2509.09161.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.09190",
      "title": "Hubble Constant and Mass Determination of Centaurus A & M83 from TRGB Distances",
      "authors": [
        "Adrian Faucher",
        "David Benisty",
        "David F. Mota"
      ],
      "abstract": "Hubble Constant and Mass Determination of Centaurus A & M83 from TRGB Distances Adrian Faucher, David Benisty, David F. Mota Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) An independent determination of the Hubble constant is crucial given the persistent tension between early- and late-Universe measurements. In this study, we analyze the dynamics of the Centaurus~A (CenA) and M83 galaxies, along with their associated dwarf companions identified via Tip of the Red Giant Branch (TRGB) distance measurements, to constrain both the group mass and the local value of the Hubble constant ($H_0$). By examining the motions of these galaxies relative to the system's barycenter, we apply both the minor and major infall models, which provide bounds on the true radial velocity dispersion. From the overlap of these approaches, we obtain a virial mass estimate of $(7.3 \\pm 2.0) \\times 10^{12}\\,M_{\\odot}$ and a Hubble flow-based mass of $(2.6 \\pm 1.4) \\times 10^{12}\\,M_{\\odot}$. Modeling the cold Hubble flow around the group center of mass yields a corresponding Hubble constant of $(64.0 \\pm 4.6)\\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$. These results offer an independent, dynamically motivated constraint on the local value of $H_0$, explicitly accounting for the impact of peculiar velocities in the nearby Universe. We also discuss the $\\sim 2\\sigma$ tension between the virial and Hubble flow-based mass estimates, which likely arises from the proximity of M83 to the velocity surface, breaking the assumptions of the Hubble flow model. While the Hubble flow fit emphasizes galaxies that follow smooth expansion on the lower branch of the velocity-distance relation, the virial mass estimate is in good agreement with the group mass derived from the $K$-band luminosity of its brightest members and from projected mass methods.",
      "pdf_url": "https://arxiv.org/pdf/2510.09190.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01967",
      "title": "A short blanket for cosmology: the CMB lensing anomaly behind the preference for a negative neutrino mass",
      "authors": [
        "Andrea Cozzumbo",
        "Mattia Atzori Corona",
        "Riccardo Murgia",
        "Maria Archidiacono",
        "Matteo Cadeddu"
      ],
      "abstract": "A short blanket for cosmology: the CMB lensing anomaly behind the preference for a negative neutrino mass Andrea Cozzumbo, Mattia Atzori Corona, Riccardo Murgia, Maria Archidiacono, Matteo Cadeddu Main text: 10 pages, 6 figures, 1 table. Appendices: 7 pages, 5 figures, 2 tables Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Recent analyses combining cosmic microwave background (CMB) and baryon acoustic oscillation (BAO) challenge particle physics constraints on the total neutrino mass, pointing to values smaller than the lower limit from neutrino oscillation experiments. To examine the impact of different CMB likelihoods from $\\mathit{Planck}$, lensing potential measurements from $\\mathit{Planck}$ and ACT, and BAO data from DESI, we introduce an effective neutrino mass parameter ($\\sum \\tilde{m}_{\\nu}$) which is allowed to take negative values. We investigate its correlation with two extra parameters capturing the impact of gravitational lensing on the CMB: one controlling the smoothing of the peaks of the temperature and polarization power spectra; one rescaling the lensing potential amplitude. In this configuration, we infer $\\sum \\tilde{m}_{\\nu}=-0.018^{+0.085}_{-0.089}~\\text{eV}~(68\\% ~\\text{C.L.})$, which is fully consistent with the minimal value required by neutrino oscillation experiments. We attribute the apparent preference for negative neutrino masses to an excess of gravitational lensing detected by late-time cosmological probes compared to that inferred from $\\mathit{Planck}$ CMB angular power spectra. We discuss implications in light of the DESI BAO measurements and the CMB lensing anomaly.",
      "pdf_url": "https://arxiv.org/pdf/2511.01967.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02190",
      "title": "Exploring One-point Statistics in HERA Phase I Data: Effects of Foregrounds and Systematics on Measuring One-Point Statistics",
      "authors": [
        "Honggeun Kim",
        "Jacqueline N. Hewitt",
        "Nicholas S. Kern",
        "Joshua S. Dillon",
        "Kai-Feng Chen",
        "Zhilei Xu",
        "Eleanor Rath",
        "Vincent MacKay",
        "Tyrone Adams",
        "James E. Aguirre",
        "Rushelle Baartman",
        "Adam P. Beardsley",
        "Gianni Bernardi",
        "Tashalee S. Billings",
        "Judd D. Bowman",
        "Richard F. Bradley",
        "Philip Bull",
        "Jacob Burba",
        "Steven Carey",
        "Chris L. Carilli",
        "David R. DeBoer",
        "Eloy de Lera Acedo",
        "Matt Dexter",
        "Nico Eksteen",
        "John Ely",
        "Aaron Ewall-Wice",
        "Nicolas Fagnoni",
        "Steven R. Furlanetto",
        "Kingsley Gale-Sides",
        "Brian Glendenning",
        "Deepthi Gorthi",
        "Bradley Greig",
        "Jasper Grobbelaar",
        "Ziyaad Halday",
        "Bryna J. Hazelton",
        "Jack Hickish",
        "Daniel C. Jacobs",
        "Joshua Kerrigan",
        "Piyanat Kittiwisit",
        "Matthew Kolopanis",
        "Adam Lanman",
        "Paul La Plante",
        "Adrian Liu",
        "David H. E. MacMahon",
        "Lourence Malan",
        "Cresshim Malgas",
        "Keith Malgas",
        "Bradley Marero",
        "Zachary E. Martinot",
        "Andrei Mesinger",
        "Mathakane Molewa",
        "Miguel F. Morales",
        "Tshegofalang Mosiane",
        "Steven G. Murray",
        "Hans Nuwegeld",
        "Aaron R. Parsons",
        "Nima Razavi-Ghods",
        "James Robnett",
        "Peter Sims",
        "Craig Smith",
        "Hilton Swarts",
        "Nithyanandan Thyagarajan",
        "Pieter van Wyngaarden",
        "Haoxuan Zheng"
      ],
      "abstract": "Exploring One-point Statistics in HERA Phase I Data: Effects of Foregrounds and Systematics on Measuring One-Point Statistics Honggeun Kim, Jacqueline N. Hewitt, Nicholas S. Kern, Joshua S. Dillon, Kai-Feng Chen, Zhilei Xu, Eleanor Rath, Vincent MacKay, Tyrone Adams, James E. Aguirre, Rushelle Baartman, Adam P. Beardsley, Gianni Bernardi, Tashalee S. Billings, Judd D. Bowman, Richard F. Bradley, Philip Bull, Jacob Burba, Steven Carey, Chris L. Carilli, David R. DeBoer, Eloy de Lera Acedo, Matt Dexter, Nico Eksteen, John Ely, Aaron Ewall-Wice, Nicolas Fagnoni, Steven R. Furlanetto, Kingsley Gale-Sides, Brian Glendenning, Deepthi Gorthi, Bradley Greig, Jasper Grobbelaar, Ziyaad Halday, Bryna J. Hazelton, Jack Hickish, Daniel C. Jacobs, Joshua Kerrigan, Piyanat Kittiwisit, Matthew Kolopanis, Adam Lanman, Paul La Plante, Adrian Liu, David H. E. MacMahon, Lourence Malan, Cresshim Malgas, Keith Malgas, Bradley Marero, Zachary E. Martinot, Andrei Mesinger, Mathakane Molewa, Miguel F. Morales, Tshegofalang Mosiane, Steven G. Murray, Hans Nuwegeld, Aaron R. Parsons, Nima Razavi-Ghods, James Robnett, Peter Sims, Craig Smith, Hilton Swarts, Nithyanandan Thyagarajan, Pieter van Wyngaarden, Haoxuan Zheng Cosmology and Nongalactic Astrophysics (astro-ph.CO) Measuring one-point statistics in redshifted 21 cm intensity maps offers an opportunity to explore non-Gaussian features of the early universe. We assess the impact of instrumental effects on measurements made with the Hydrogen Epoch of Reionization Array (HERA) by forward modeling observational and simulation data. Using HERA Phase I observations over 94 nights, we examine the second (m2, variance) and third (m3) moments of images. We employ the DAYENU-filtering method for foreground removal and reduce simulated foreground residuals to 10% of the 21 cm signal residuals. In noiseless cosmological simulations, the amplitudes of one-point statistics measurements are significantly reduced by the instrument response and further reduced by wedge-filtering. Analyses with wedge-filtered observational data, along with expected noise simulations, show that systematics alter the probability distribution of the map pixels. Likelihood analysis based on the observational data shows m2 measurements disfavor the cold reionization model characterized by inefficient X-ray heating, in line with other power spectra measurements. Small signals in m3 due to the instrument response of the Phase I observation and wedge-filtering make it challenging to use these non-Gaussian statistics to explore model parameters. Forecasts with the full HERA array predict high signal-to-noise ratios for m2, m3, and S3 assuming no foregrounds, but wedge-filtering drastically reduces these ratios. This work demonstrates conclusively that a comprehensive understanding of instrumental effects on m2 and m3 is essential for their use as a cosmological probe, given their dependence on the underlying model.",
      "pdf_url": "https://arxiv.org/pdf/2511.02190.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02220",
      "title": "Reconstruction of dark energy using DESI DR2",
      "authors": [
        "Xue Zhang",
        "Yin-Hao Xu",
        "Yu Sang"
      ],
      "abstract": "Reconstruction of dark energy using DESI DR2 Xue Zhang, Yin-Hao Xu, Yu Sang Cosmology and Nongalactic Astrophysics (astro-ph.CO) Using a model-independent Gaussian process (GP) method to reconstruct the dimensionless luminosity distance $D$ and its derivatives, we derive the evolution of the dimensionless Hubble parameter $E$, the deceleration parameter $q$, and the state parameter $w$ of dark energy. We utilize the PantheonPlus, SH0ES, and Gamma Ray Burst (GRB) data to derive the dimensionless luminosity distance $D$. Additionally, we employ observational $H(z)$ data (OHD) and baryon acoustic oscillations (BAO) from Dark Energy Spectroscopic Instrument (DESI) Data Release 2 (DR2) to obtain the first derivative of the dimensionless luminosity distance $D^{'}$. To obtain the reconstructed $D$ and $D^{'}$, we utilize the fiducial value from each dataset, with particular emphasis on the varying $H_0$. According to the reconstruction results obtained from PantheonPlus+SH0ES+GRB+OHD and PantheonPlus+SH0ES+GRB+OHD+DESI data, we find that $E$ are consistent with the predictions of the $\\Lambda$CDM model at a $2\\sigma$ confidence level within the redshift range of $z<2$. However, the reconstruction results for $q$ exhibit deviations from the $\\Lambda$CDM model in the range of $z<0.3$. Furthermore, we observe that the mean value of $w$ exhibits evolving behavior, transiting from $w < -1$ to $w > -1$ around $z_{\\rm wt}=0.464^{+0.235}_{-0.120}$. Combining data from DESI DR2 can slightly enhance the accuracy of our constraints.",
      "pdf_url": "https://arxiv.org/pdf/2511.02220.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02323",
      "title": "Weak-Lensing Analysis of the Galaxy Cluster Abell 85: Constraints on the Merger Scenarios of Its Southern Subcluster",
      "authors": [
        "Soojin Kim",
        "Kim HyeongHan",
        "Wonki Lee",
        "Jong In Park",
        "Myungkook James Jee",
        "Ho Seong Hwang"
      ],
      "abstract": "Weak-Lensing Analysis of the Galaxy Cluster Abell 85: Constraints on the Merger Scenarios of Its Southern Subcluster Soojin Kim, Kim HyeongHan, Wonki Lee, Jong In Park, Myungkook James Jee, Ho Seong Hwang 20 pages, 11 figures, 1 table, submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) Abell 85 is a nearby (z=0.055) galaxy cluster that hosts a sloshing cool core, a feature commonly reported in relaxed clusters. However, the presence of multiple past and ongoing mergers indicates that it is an active node within the Abell 85/87/89 complex. We present a weak gravitational lensing (WL) analysis using Subaru Hyper Suprime-Cam imaging data to understand its assembly history by investigating the dark matter components of the substructures. Our mass reconstruction resolves three substructures associated with the brightest cluster galaxy (main), the southern (S) subcluster, and the southwestern (SW) subcluster, with WL peak significances of $> 6\\sigma$, $> 5\\sigma$, and $> 4\\sigma$, respectively. The locations of these mass peaks are consistent with those of the member galaxies. We estimate the masses of the main cluster ($M_{200c,main} = 2.91 \\pm 0.72 \\times 10^{14}\\ M_\\odot$) and the S subcluster ($M_{200c,S} = 1.23 \\pm 0.52 \\times 10^{14}\\ M_\\odot$) by fitting a multi-halo Navarro-Frenk-White profile. This $\\sim$2:1 mass ratio indicates that the system is undergoing a major merger that is actively shaping the current dynamical state of Abell 85. Incorporating X-ray observations, we discuss the merger phase of the S subcluster and further examine the star-forming activity along the putative filament extending southeast of Abell 85.",
      "pdf_url": "https://arxiv.org/pdf/2511.02323.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02357",
      "title": "Redshift-dependent Distance Duality Violation in Resolving Multidimensional Cosmic Tensions",
      "authors": [
        "Zhihuan Zhou",
        "Zhuang Miao",
        "Rong Zhang",
        "Hanbing Yang",
        "Penghao Fu",
        "Chaoqian Ai"
      ],
      "abstract": "Redshift-dependent Distance Duality Violation in Resolving Multidimensional Cosmic Tensions Zhihuan Zhou, Zhuang Miao, Rong Zhang, Hanbing Yang, Penghao Fu, Chaoqian Ai Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work, we investigate whether violations of the distance-duality relation (DDR) can resolve the multidimensional cosmic tensions characterized by the $H_0$ and $S_8$ discrepancies. Using the Fisher-bias formalism, we reconstruct minimal, data-driven $\\eta(z)$ profiles that capture the late-time deviations required to reconcile early- and late-Universe calibrations. While a constant DDR offset preserves the Pantheon-inferred matter density $\\Omega_m = 0.334 \\pm 0.018$--leaving its inconsistency with the Planck best-fit $\\Lambda$CDM model and weak-lensing surveys unresolved--a time-varying DDR substantially reduces cross-dataset inconsistencies and improves the global fit, yielding $\\Delta\\chi^2 \\simeq -10$ relative to $\\Lambda$CDM when the SH0ES prior is excluded. This result suggests that the $\\Omega_m$ discrepancy may represent indirect evidence for a time-varying DDR. A hybrid scenario combining a time-dependent DDR with a phantom-like dark energy transition achieves the most consistent global reconciliation, reducing the tension with DES-Y3 measurements to below $2\\sigma$. These findings indicate that a mild DDR violation, coupled with evolving dark energy, offers a coherent pathway toward jointly addressing the $H_0$ and $S_8$ tensions.",
      "pdf_url": "https://arxiv.org/pdf/2511.02357.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02631",
      "title": "Supernova Classification using the Recurrent Neural Network in the CSST Ultra-Deep Field Survey",
      "authors": [
        "Minglin Wang",
        "Yan Gong",
        "Dejia Zhou",
        "Xuelei Chen"
      ],
      "abstract": "Supernova Classification using the Recurrent Neural Network in the CSST Ultra-Deep Field Survey Minglin Wang, Yan Gong, Dejia Zhou, Xuelei Chen Cosmology and Nongalactic Astrophysics (astro-ph.CO) We study supernova (SN) classification using the machine learning method of the Recurrent Neural Network (RNN) in the Chinese Space Station Survey Telescope Ultra-Deep Field (CSST-UDF) photometric survey, and explore the improvement of the cosmological constraint. We generate the mock light curve data of Type Ia supernova (SN Ia) and core collapse supernova (CCSN) using SNCosmo with SALT3 SN Ia model and CCSN templates, and apply the SuperNNova (SNN) program for classifying SNe. Our study indicates that the SNN combined with the Joint Light-curve Analysis like (JLA-like) cuts can enhance the purity of the CSST-UDF SN Ia sample up to over 99.5% with 2,193 SNe Ia and 4 CCSNe, which can significantly increase the reliability of the cosmological constraint results. The method based on the Bayesian Estimation Applied to Multiple Species (BEAMS) with Bias Corrections (BBC) framework is used to correct the SN Ia magnitude bias caused by the selection effect and CCSN contamination, and the Markov Chain Monte Carlo (MCMC) method is employed for cosmological constraints. We find that the accuracy of the constraints on the matter density $\\Omega_{\\rm M}$ and the equation of state of dark energy $w$ can achieve 14% and 18%, respectively, assuming the flat $w$CDM model. This result is comparable to that from the current surveys that relied on spectroscopic confirmation. It indicates that our data analysis method is effective, and the CSST-UDF SN photometric survey is powerful in exploring the expansion history of the Universe.",
      "pdf_url": "https://arxiv.org/pdf/2511.02631.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02730",
      "title": "Measuring the expansion history of the Universe with DESI Cosmic Chronometers",
      "authors": [
        "S.I. Loubser"
      ],
      "abstract": "Measuring the expansion history of the Universe with DESI Cosmic Chronometers S.I. Loubser Accepted for publication in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Studying large samples of massive, passively evolving galaxies (called cosmic chronometers, CC) provides us with the unique ability to measure the Universe's expansion history without assuming a cosmological model. The Dark Energy Spectroscopic Instrument (DESI) DR1 is currently the largest, publicly available, homogeneous set of galaxies with reliable spectroscopic redshifts, and covers a wide range in redshift. We extracted all massive galaxies (stellar mass $\\log M_{\\star}/M_{\\odot} > 10.75$, and velocity dispersion $\\sigma > 280$ km s$^{-1}$), with no emission in [OII] $\\lambda$ 3727 $Å$, with reliable redshifts as well as reliable D4000$_{\\rm n}$ measurements from DR1. From this sample of 360 000 massive, passive galaxies, we used D4000$_{\\rm n}$ and the method of cosmic chronometers to get three new direct, independent measurements of $H(z)=$ 88.48 $\\pm\\ 0.57(\\rm stat) \\pm 12.32(\\rm syst)$, $H(z)=$ 119.45 $\\pm\\ 6.39(\\rm stat) \\pm 16.64(\\rm syst)$, and $H(z)= 108.28 \\pm 10.07(\\rm stat) \\pm 15.08(\\rm syst)$ $\\rm km\\ s^{-1}\\ Mpc^{-1}$ at $z=0.46$, $z=0.67$, and $z=0.83$, respectively. This sample, which covers $0.3 < z < 1.0$, is the largest CC sample to date, and we reach statistical uncertainties of 0.65$\\%$, 5.35$\\%$, and 9.30$\\%$ on our three measurements. Our measurements show no significant tension with the $\\textit{Planck}$ $\\Lambda$CDM cosmology. In our analysis, we also illustrate that even amongst samples of massive, passive galaxies, the effect of downsizing can clearly be seen.",
      "pdf_url": "https://arxiv.org/pdf/2511.02730.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02808",
      "title": "Reliable Parameter Inference for the Epoch of Reionization using Balanced Neural Ratio Estimation",
      "authors": [
        "Diego González-Hernández",
        "Molly Wolfson",
        "Joseph F. Hennawi"
      ],
      "abstract": "Reliable Parameter Inference for the Epoch of Reionization using Balanced Neural Ratio Estimation Diego González-Hernández, Molly Wolfson, Joseph F. Hennawi Machine Learning and the Physical Sciences Workshop, NeurIPS 2025 Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present an application of the Balanced Neural Ratio Estimation (BNRE) algorithm to improve the statistical validity of parameter estimates used to characterize the Epoch of Reionization, where the common assumption of a multivariate Gaussian likelihood leads to overconfident and biased posterior distributions. Using a two-parameter model of the Ly$\\alpha$ forest autocorrelation function, we show that BNRE yields posterior distributions that are significantly better calibrated than those obtained under the Gaussian likelihood assumption, as verified through the Test of Accuracy with Random Points (TARP) and Simulation-Based Calibration (SBC) diagnostics. These results demonstrate the potential of Simulation-Based Inference (SBI) methods, and in particular BNRE, to provide statistically robust parameter constraints within existing astrophysical modeling frameworks.",
      "pdf_url": "https://arxiv.org/pdf/2511.02808.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25018",
      "title": "Physical properties of long-rising type II Supernovae -- Bayesian Analytic Modelling and Spectrophotometric Correlations",
      "authors": [
        "S. P. Cosentino",
        "C. Inserra",
        "M. L. Pumo"
      ],
      "abstract": "Physical properties of long-rising type II Supernovae -- Bayesian Analytic Modelling and Spectrophotometric Correlations S. P. Cosentino, C. Inserra, M. L. Pumo High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Supernova (SN) 1987A, with its long-rising ($\\gtrsim$40~days) light curve, defines a rare subclass of type II SNe known as 1987A-like events. Representing only $\\sim$1-3\\% of all core-collapse SNe and often found in low-metallicity environments, their large diversity suggests a wide range of progenitor and explosion properties. This study aims to improve the understanding of 1987A-like SNe by characterizing their explosion parameters, including kinetic energy, ejected mass, progenitor radius at explosion, and synthesized $^{56}$Ni mass. Additionally, it seeks to identify systematic trends in both the physical properties and the observed features of these peculiar events. A new Bayesian parameter estimation method, based on our $^{56}$Ni-dependent analytical model for hydrogen-rich SNe, is applied to derive explosion parameters from the light curves and expansion velocities of one of the largest and most comprehensive 1987A-like SN samples to date. These data are measured through a consistent analysis of observations available in the literature. The analysis reveals a heterogeneous population that nevertheless clusters into two main groups: (i) lower-energy explosions with modest $^{56}$Ni yields ($\\sim$0.07~M$_\\odot$), similar to SN~1987A, and (ii) more energetic events (up to $\\sim$5~foe) with larger nickel production and, in some cases, unusually extended progenitors. We confirm a robust correlation between $^{56}$Ni mass, peak luminosity, and explosion energy, as well as between ejecta mass and recombination timescale. An anti-correlation between Ba~II line strength and photospheric velocity indicates that stronger Ba~II absorptions in 1987A-like SNe arise from more compact, slowly expanding ejecta. Our study underscores the need to extend analytical frameworks to include additional power sources, enabling scalable and accurate modelling of the growing number of peculiar transients.",
      "pdf_url": "https://arxiv.org/pdf/2510.25018.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01958",
      "title": "Improving Bayesian inference in PTA data analysis: importance nested sampling with Normalizing Flows",
      "authors": [
        "Eleonora Villa",
        "Golam Mohiuddin Shaifullah",
        "Andrea Possenti",
        "Carmelita Carbone"
      ],
      "abstract": "Improving Bayesian inference in PTA data analysis: importance nested sampling with Normalizing Flows Eleonora Villa, Golam Mohiuddin Shaifullah, Andrea Possenti, Carmelita Carbone 37 pages, 7 figures, 3 tables. Submitted to the Astronomy and Computing special issue HPC in Cosmology and Astrophysics Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Machine Learning (cs.LG) We present a detailed study of Bayesian inference workflows for pulsar timing array data with a focus on enhancing efficiency, robustness and speed through the use of normalizing flow-based nested sampling. Building on the Enterprise framework, we integrate the i-nessai sampler and benchmark its performance on realistic, simulated datasets. We analyze its computational scaling and stability, and show that it achieves accurate posteriors and reliable evidence estimates with substantially reduced runtime, by up to three orders of magnitude depending on the dataset configuration, with respect to conventional single-core parallel-tempering MCMC analyses. These results highlight the potential of flow-based nested sampling to accelerate PTA analyses while preserving the quality of the inference.",
      "pdf_url": "https://arxiv.org/pdf/2511.01958.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.HE",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01959",
      "title": "Addressing prior dependence in hierarchical Bayesian modeling for PTA data analysis II: Noise and SGWB inference through parameter decorrelation",
      "authors": [
        "Eleonora Villa",
        "Luigi D'Amico",
        "Aldo Barca",
        "Fatima Modica Bittordo",
        "Francesco Alì",
        "Massimo Meneghetti",
        "Luca Naso"
      ],
      "abstract": "Addressing prior dependence in hierarchical Bayesian modeling for PTA data analysis II: Noise and SGWB inference through parameter decorrelation Eleonora Villa, Luigi D'Amico, Aldo Barca, Fatima Modica Bittordo, Francesco Alì, Massimo Meneghetti, Luca Naso 18 pages, 7 figures. Submitted to the Astronomy and Computing special issue HPC in Cosmology and Astrophysics Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Machine Learning (cs.LG) Pulsar Timing Arrays provide a powerful framework to measure low-frequency gravitational waves, but accuracy and robustness of the results are challenged by complex noise processes that must be accurately modeled. Standard PTA analyses assign fixed uniform noise priors to each pulsar, an approach that can introduce systematic biases when combining the array. To overcome this limitation, we adopt a hierarchical Bayesian modeling strategy in which noise priors are parametrized by higher-level hyperparameters. We further address the challenge posed by the correlations between hyperparameters and physical noise parameters, focusing on those describing red noise and dispersion measure variations. To decorrelate these quantities, we introduce an orthogonal reparametrization of the hierarchical model implemented with Normalizing Flows. We also employ i-nessai, a flow-guided nested sampler, to efficiently explore the resulting higher-dimensional parameter space. We apply our method to a minimal 3-pulsar case study, performing a simultaneous inference of noise and SGWB parameters. Despite the limited dataset, the results consistently show that the hierarchical treatment constrains the noise parameters more tightly and partially alleviates the red-noise-SGWB degeneracy, while the orthogonal reparametrization further enhances parameter independence without affecting the correlations intrinsic to the power-law modeling of the physical processes involved.",
      "pdf_url": "https://arxiv.org/pdf/2511.01959.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.HE",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.02375",
      "title": "ELAIS-N1 Deep Field uGMRT Band-2: Constraints on Diffuse Galactic Synchrotron Emission Power Spectrum",
      "authors": [
        "Rashmi Sagar",
        "Abhirup Datta",
        "Arnab Chakraborty",
        "Nirupam Roy",
        "Akriti Sinha",
        "Aishrila Mazumder",
        "Prasun Dutta",
        "Kh. Md. Asif Elahi",
        "Kanan K. Datta",
        "Samir Choudhuri",
        "Somnath Bharadwaj",
        "Srijita Pal",
        "Anshuman Tripathi",
        "Suman Majumdar",
        "Tirthankar Roy Choudhury",
        "Sk. Saiyad Ali"
      ],
      "abstract": "ELAIS-N1 Deep Field uGMRT Band-2: Constraints on Diffuse Galactic Synchrotron Emission Power Spectrum Rashmi Sagar, Abhirup Datta, Arnab Chakraborty, Nirupam Roy, Akriti Sinha, Aishrila Mazumder, Prasun Dutta, Kh. Md. Asif Elahi, Kanan K. Datta, Samir Choudhuri, Somnath Bharadwaj, Srijita Pal, Anshuman Tripathi, Suman Majumdar, Tirthankar Roy Choudhury, Sk. Saiyad Ali 17 pages, 11 figures, 8 tables, Accepted in MNRAS for publication High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present high sensitivity, low radio frequency continuum observations of the ELAIS-N1 field with 32 hours of observations of the uGMRT Band-2 ($120-250$ MHz) covering $5.86\\,\\text{deg}^2$ area, achieving a central off-source RMS noise of $237\\,\\mu\\mathrm{Jy}/\\mathrm{beam}$ with a resolution of $11.45''$ at the central frequency of 183 MHz. A radio source catalogue of 1027 sources statistically matches with similar observations at different frequencies within the sensitivity range of the uGMRT. The calibrated data is further used to characterise the dominant foreground, the Diffuse Galactic Synchrotron Emission (DGSE), in angular scale and frequency regime. We derived the angular power spectrum (APS) of DGSE in two ways: image-based estimator (i-APS) and visibility-based Tapered Gridded Estimator (TGE; hereafter as t-APS). We assess the characteristics of DGSE with a power-law form of $C_{\\ell} = A({1000}/{\\ell})^{\\beta}$. Combining data from Band-2 and earlier Band-3 observations, we derived a spectral variation of $C_{\\ell}$ in the form of $C_{\\ell} = A{\\nu^{-2{\\alpha}}}{\\ell^{-{\\beta}}}$. Our result indicates a spectral break at $\\nu = 230\\,{\\pm}\\,5$ MHz, corresponding to a synchrotron age of $t_\\text{syn} = 106\\,{\\pm}\\,1$ Myr for the cosmic-ray electrons (CRe). This break result suggests a low-energy cutoff in the CRe population, leading to spectral curvature at low frequencies. Using both of the techniques, i-APS and t-APS, we find that the mean spectral index $\\alpha$ and power-law index $\\beta$ are consistent within the frequency range $120-500$ MHz.",
      "pdf_url": "https://arxiv.org/pdf/2511.02375.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.21925",
      "title": "Redshift-Space Distortion constraints on neutrino mass and models to alleviate the Hubble tension",
      "authors": [
        "Yo Toda",
        "Osamu Seto"
      ],
      "abstract": "Redshift-Space Distortion constraints on neutrino mass and models to alleviate the Hubble tension Yo Toda, Osamu Seto Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We discuss the neutrino mass and Hubble tension solutions and examine their effects on the Redshift-Space Distortion (RSD) observations. An analysis with RSD data indicates smaller amplitude of perturbation. Including RSD data results in a slightly weaker upper limit on the neutrino mass than that derived for data without RSD, which is common in other extended models too. We have evaluated the impacts of RSD observations on some extended models, including the varying electron mass model, a time-dependent dark energy model with two parameter equations of state (EOS), and a model where the number of neutrino species is free. When we estimate the cosmological parameters for data including RSD, we found that the EOS parameter for dark energy is larger than that of the cosmological constant, and the effective number of neutrino species is smaller than the standard value, which infers a smaller present Hubble parameter $H_0$. From the viewpoint of cosmological tensions, the varying electron mass model with non-zero neutrino mass option looks promising to relax the Hubble tension and the $S_8$ tension simultaneously.",
      "pdf_url": "https://arxiv.org/pdf/2410.21925.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.12026",
      "title": "Modified Gravity Constraints from the Full Shape Modeling of Clustering Measurements from DESI 2024",
      "authors": [
        "M. Ishak",
        "J. Pan",
        "R. Calderon",
        "K. Lodha",
        "G. Valogiannis",
        "A. Aviles",
        "G. Niz",
        "L. Yi",
        "C. Zheng",
        "C. Garcia-Quintero",
        "A. de Mattia",
        "L. Medina-Varela",
        "J. L. Cervantes-Cota",
        "U. Andrade",
        "D. Huterer",
        "H. E. Noriega",
        "G. Zhao",
        "A. Shafieloo",
        "W. Fang",
        "S. Ahlen",
        "D. Bianchi",
        "D. Brooks",
        "E. Burtin",
        "E. Chaussidon",
        "T. Claybaugh",
        "S. Cole",
        "A. de la Macorra",
        "Arjun Dey",
        "K. Fanning",
        "S. Ferraro",
        "A. Font-Ribera",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "H. Gil-Marín",
        "S. Gontcho A Gontcho",
        "G. Gutierrez",
        "C. Hahn",
        "K. Honscheid",
        "C. Howlett",
        "S. Juneau",
        "D. Kirkby",
        "T. Kisner",
        "A. Kremin",
        "M. Landriau",
        "L. Le Guillou",
        "A. Leauthaud",
        "M. E. Levi",
        "A. Meisner",
        "R. Miquel",
        "J. Moustakas",
        "J. A. Newman",
        "N. Palanque-Delabrouille",
        "W. J. Percival",
        "C. Poppett",
        "F. Prada",
        "I. Pérez-Ràfols",
        "A. J. Ross",
        "G. Rossi",
        "E. Sanchez",
        "D. Schlegel",
        "M. Schubnell",
        "H. Seo",
        "D. Sprayberry",
        "G. Tarlé",
        "M. Vargas-Magana",
        "B. A. Weaver",
        "R. H. Wechsler",
        "C. Yèche",
        "P. Zarrouk",
        "R. Zhou",
        "H. Zou"
      ],
      "abstract": "Modified Gravity Constraints from the Full Shape Modeling of Clustering Measurements from DESI 2024 M. Ishak, J. Pan, R. Calderon, K. Lodha, G. Valogiannis, A. Aviles, G. Niz, L. Yi, C. Zheng, C. Garcia-Quintero, A. de Mattia, L. Medina-Varela, J. L. Cervantes-Cota, U. Andrade, D. Huterer, H. E. Noriega, G. Zhao, A. Shafieloo, W. Fang, S. Ahlen, D. Bianchi, D. Brooks, E. Burtin, E. Chaussidon, T. Claybaugh, S. Cole, A. de la Macorra, Arjun Dey, K. Fanning, S. Ferraro, A. Font-Ribera, J. E. Forero-Romero, E. Gaztañaga, H. Gil-Marín, S. Gontcho A Gontcho, G. Gutierrez, C. Hahn, K. Honscheid, C. Howlett, S. Juneau, D. Kirkby, T. Kisner, A. Kremin, M. Landriau, L. Le Guillou, A. Leauthaud, M. E. Levi, A. Meisner, R. Miquel, J. Moustakas, J. A. Newman, N. Palanque-Delabrouille, W. J. Percival, C. Poppett, F. Prada, I. Pérez-Ràfols, A. J. Ross, G. Rossi, E. Sanchez, D. Schlegel, M. Schubnell, H. Seo, D. Sprayberry, G. Tarlé, M. Vargas-Magana, B. A. Weaver, R. H. Wechsler, C. Yèche, P. Zarrouk, R. Zhou, H. Zou (DESI Collaboration) 57 pages, 14 figures. This DESI Collaboration Publication is part of the 2024 publication series using the first year of observations and the full shape modeling (see this https URL). Expanded discussions; added comments about EFT MG results. JCAP published version Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present cosmological constraints on deviations from general relativity (GR) from the first-year of clustering observations from Dark Energy Spectroscopic Instrument (DESI) in combination with other datasets. We first consider $\\mu(a,k)$-$\\Sigma(a,k)$ modified gravity (MG) parametrization (as well as $\\eta(a,k)$) in flat $\\Lambda$CDM and $w_0 w_a$CDM backgrounds. Using a functional form for time-only evolution gives $\\mu_0=0.11^{+0.44}_{-0.54}$ from DESI(FS+BAO)+BBN and a wide prior on $n_{s}$. Using DESI(FS+BAO)+CMB+DESY3+DESY5-SN, we obtain $\\mu_0=0.05\\pm 0.22$ and $\\Sigma_0=0.008\\pm 0.045$ in the $\\Lambda$CDM background. In $w_0 w_a$CDM, we obtain $\\mu_0=-0.24^{+0.32}_{-0.28}$ and $\\Sigma_0=0.006\\pm 0.043$, consistent with GR, and still find a preference for dynamical dark energy with $w_0>-1$ and $w_a<0$. We then use binned forms in the 2 backgrounds starting with 2 bins in redshift and then adding 2 bins in scale for a total of 4 and 8 MG parameters, respectively. All MG parameters are found consistent with GR. We also find that the tension reported for $\\Sigma_0$ with GR from Planck PR3 goes away when using LoLLiPoP+HiLLiPoP likelihoods. As noted previously, this seems to indicate the tension is related to CMB lensing anomaly in PR3 which is also resolved when using these likelihoods. We then constrain the class of Horndeski theory in both EFT-basis and $\\alpha$-basis. Assuming a power law for the non-minimal coupling function $\\Omega$, we obtain $\\Omega_0=0.012^{+0.001}_{-0.012}$ and $s_0=0.996^{+0.54}_{-0.20}$ from DESI(FS+BAO)+DESY5SN+CMB in a $\\Lambda$CDM background, consistent with GR. Using the $\\alpha$-basis with no-braiding ($\\alpha_B=0$) gives $c_M<1.14$, in agreement with GR. However, we see a mild yet consistent indication for $c_B>0$ when $\\alpha_B$ is varied which will require further study to determine whether this is due to systematics or new physics. [Abridged]",
      "pdf_url": "https://arxiv.org/pdf/2411.12026.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.16122",
      "title": "BrahMap: A scalable and modular map-making framework for the CMB experiments",
      "authors": [
        "Avinash Anand",
        "Giuseppe Puglisi"
      ],
      "abstract": "BrahMap: A scalable and modular map-making framework for the CMB experiments Avinash Anand, Giuseppe Puglisi Submitted to 33rd Euromicro International Conference on Parallel, Distributed, and Network-Based Processing (PDP 2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) The cosmic microwave background (CMB) experiments have reached an era of unprecedented precision and complexity. Aiming to detect the primordial B-mode polarization signal, these experiments will soon be equipped with $10^{4}$ to $10^{5}$ detectors. Consequently, future CMB missions will face the substantial challenge of efficiently processing vast amounts of raw data to produce the initial scientific outputs - the sky maps - within a reasonable time frame and with available computational resources. To address this, we introduce BrahMap, a new map-making framework that will be scalable across both CPU and GPU platforms. Implemented in C++ with a user-friendly Python interface for handling sparse linear systems, BrahMap employs advanced numerical analysis and high-performance computing techniques to maximize the use of super-computing infrastructure. This work features an overview of the BrahMap's capabilities and preliminary performance scaling results, with application to a generic CMB polarization experiment.",
      "pdf_url": "https://arxiv.org/pdf/2501.16122.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.18245",
      "title": "Multi-tracer beyond linear theory",
      "authors": [
        "Henrique Rubira",
        "Francesco Conteddu"
      ],
      "abstract": "Multi-tracer beyond linear theory Henrique Rubira, Francesco Conteddu Cosmology and Nongalactic Astrophysics (astro-ph.CO) The multi-tracer (MT) technique has been shown to outperform single-tracer analyses in the context of galaxy clustering. In this paper, we conduct a series of Fisher analyses to further explore MT information gains within the framework of non-linear bias expansion. We examine how MT performance depends on the bias parameters of the subtracers, showing that directly splitting the non-linear bias generally leads to smaller error bars in $A_s$, $h$, and $\\omega_{\\rm cdm}$ compared to a simple split in $b_1$. This finding opens the door to identifying subsample splits that do not necessarily rely on very distinct linear biases. We discuss different total and subtracer number density scenarios, as well as the possibility of splitting into more than two tracers. Additionally, we consider how different Fingers-of-God suppression scales for the subsamples can be translated into different $k_{\\rm max}$ values. Finally, we present forecasts for ongoing and future galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2504.18245.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.04767",
      "title": "Effective Field Theory Constraints on Primordial Black Holes from the High-Redshift Lyman-$α$ Forest",
      "authors": [
        "Mikhail M. Ivanov",
        "Sokratis Trifinopoulos"
      ],
      "abstract": "Effective Field Theory Constraints on Primordial Black Holes from the High-Redshift Lyman-$α$ Forest Mikhail M. Ivanov, Sokratis Trifinopoulos 8 pages, 3 figures. Added Supplemental Material Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We present updated constraints on the abundance of primordial black holes (PBHs) dark matter from the high-redshift Lyman-$\\alpha$ forest data from MIKE/HIRES experiments. Our analysis leverages an effective field theory (EFT) description of the 1D flux power spectrum, allowing us to analytically predict the Lyman-$\\alpha$ fluctuations on quasi-linear scales from first principles. Our EFT-based likelihood enables robust inference across redshifts $z = 4.2-5.4$ and down to scales of 100 kpc, within previously unexplored regions of parameter space for this dataset. We derive new bounds on the PBH fraction with respect to the total dark matter $f_{\\text{PBH}}$, excluding populations with $f_{\\text{PBH}} \\gtrsim 10^{-3}$ for masses $M_{\\text{PBH}} \\sim 10^{4}-10^{16} M_{\\odot}$. This offers the leading constraint for PBHs heavier than $10^{9} M_{\\odot}$ and highlights the Lyman-$\\alpha$ forest as a uniquely sensitive probe of new physics models that modify the structure formation history of our universe.",
      "pdf_url": "https://arxiv.org/pdf/2508.04767.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.15012",
      "title": "Constraining Cosmology with Double-source-plane Strong Gravitational Lenses from the AGEL Survey",
      "authors": [
        "Duncan J. Bowden",
        "Nandini Sahu",
        "Anowar J. Shajib",
        "Kim-Vy Tran",
        "Tania M. Barone",
        "Keerthi Vasan G.C.",
        "Daniel J. Ballard",
        "Thomas E. Collett",
        "Faith Dalessandro",
        "Giovanni Ferrami",
        "Karl Glazebrook",
        "William J. Gottemoller",
        "Leena Iwamoto",
        "Tucker Jones",
        "Glenn G. Kacprzak",
        "Geraint F. Lewis",
        "Haven McIntosh-Lombardo",
        "Hannah Skobe",
        "Sherry H. Suyu",
        "Sarah M. Sweet"
      ],
      "abstract": "Constraining Cosmology with Double-source-plane Strong Gravitational Lenses from the AGEL Survey Duncan J. Bowden, Nandini Sahu, Anowar J. Shajib, Kim-Vy Tran, Tania M. Barone, Keerthi Vasan G.C., Daniel J. Ballard, Thomas E. Collett, Faith Dalessandro, Giovanni Ferrami, Karl Glazebrook, William J. Gottemoller, Leena Iwamoto, Tucker Jones, Glenn G. Kacprzak, Geraint F. Lewis, Haven McIntosh-Lombardo, Hannah Skobe, Sherry H. Suyu, Sarah M. Sweet 14 pages, 10 figures, Updated final version published in the Astrophysical Journal (ApJ) Duncan J. Bowden et al 2025 ApJ 993 124 Cosmology and Nongalactic Astrophysics (astro-ph.CO) Double-source-plane strong gravitational lenses (DSPLs), with two sources at different redshifts, are independent cosmological probes of the dark energy equation of state parameter $w$ and the matter density parameter $\\Omega_{\\rm m}$. We present the lens model for the DSPL AGEL035346$-$170639 and infer cosmological constraints from this system for flat $\\Lambda$ cold dark matter and flat $w$CDM cosmologies. From the joint posterior of $w$ and $\\Omega_{\\rm m}$ in the flat $w$CDM cosmology, we extract the following median values and 1$\\sigma$ uncertainties: $w = -1.52^{+0.49}_{-0.33}$ and $\\Omega_{\\rm m} = 0.192^{+0.305}_{-0.131}$ from AGEL0353 alone. Combining our measurements with two previously analyzed DSPLs, we present the joint constraint on these parameters from a sample of three, the largest galaxy-scale DSPL sample used for cosmological measurement to date. The combined precision of $w$ from three DSPLs is higher by 15% over AGEL0353 alone. Combining DSPL and cosmic microwave background (CMB) measurements improves the precision of $w$ from CMB-only constraints by 39%, demonstrating the complementarity of DSPLs with the CMB. Despite their promising constraining power, DSPLs are limited by sample size, with only a handful discovered so far. Although ongoing and near-future wide-area sky surveys will increase the number of known DSPLs by up to two orders of magnitude, these systems will still require dedicated high-resolution imaging and spectroscopic follow-ups like those presented in this paper. Our ASTRO 3D Galaxy Evolution with Lenses collaboration is undertaking such follow-up campaigns for several newly discovered DSPLs and will provide cosmological measurements from larger samples of DSPLs in the future.",
      "pdf_url": "https://arxiv.org/pdf/2509.15012.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.08778",
      "title": "Modeling spatially-resolved galactic H$α$ emission for galaxy clustering",
      "authors": [
        "Ivan Rapoport",
        "Vincent Desjacques",
        "Gabriele Parimbelli",
        "Ehud Behar",
        "Martin Crocce"
      ],
      "abstract": "Modeling spatially-resolved galactic H$α$ emission for galaxy clustering Ivan Rapoport, Vincent Desjacques, Gabriele Parimbelli, Ehud Behar, Martin Crocce 19 pages, 13 figures. Comments welcome Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Near-infrared spectroscopic surveys target high-redshift emission-line galaxies (ELGs) to probe cosmological scenarios. Understanding the clustering properties of ELGs is essential to derive optimal constraints. We present a simple radiative transfer model for spatially resolved galactic H$\\alpha$ emission, which includes emission from the warm-hot diffuse interstellar medium. The atomic level populations are in steady-state and computed in the coronal approximation. The model is applied to multiple IllustrisTNG simulations in the redshift range $1\\leq z \\leq 2$ to produce the luminosity function (LF) and the halo occupation distribution (HOD). Collisional processes account for a significant fraction of $\\approx 40\\%$ of the total ${\\rm H}\\alpha$ luminosity ($L_{{\\rm H}\\alpha}$). Our LFs are in reasonable agreement with measurements from H$\\alpha$ surveys if a uniform extinction of $0.3<A_{{\\rm H}\\alpha}<0.85$ mag is assumed. Our HOD is consistent with that of the ${\\it Euclid}$ Flagship galaxy mock up to differences that can be attributed to baryonic feedback, which is absent from the latter. When H$\\alpha$ luminosities are computed from an empirical relation between $L_{{\\rm H}\\alpha}$ and the total star formation rate (SFR) the resulting LFs are in tension with previous observations. Our approach can be extended to other atomic lines, which should be helpful for the mining of high-redshift galaxy spectra in forthcoming surveys.",
      "pdf_url": "https://arxiv.org/pdf/2502.08778.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.12111",
      "title": "Insights from leptohadronic modelling of the brightest blazar flare",
      "authors": [
        "Egor Podlesnyi",
        "Foteini Oikonomou"
      ],
      "abstract": "Insights from leptohadronic modelling of the brightest blazar flare Egor Podlesnyi, Foteini Oikonomou Accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The blazar 3C 454.3 experienced a major flare in November 2010, making it the brightest $\\gamma$-ray source in the sky of the Fermi Large Area Telescope (LAT). We obtain seven daily consecutive spectral-energy distributions (SEDs) of the flare in the infrared, optical, ultraviolet, X-ray and $\\gamma$-ray bands with publicly available data. We simulate the physical conditions in the blazar and show that the observed SEDs are well reproduced in the framework of a \"standing feature\" where the position of the emitting region is almost stationary, located beyond the outer radius of the broad-line region and into which fresh blobs of relativistically moving magnetised plasma are continuously injected. Meanwhile, a model with a single \"moving blob\" does not describe the data well. We obtain a robust upper limit to the amount of high-energy protons in the jet of 3C 454.3 from the electromagnetic SED. We construct a neutrino light curve of 3C 454.3 and estimate the expected neutrino yield at energies $\\geq 100$ TeV for 3C 454.3 to be up to $6 \\times 10^{-3}$ $\\nu_{\\mu}$ per year. Finally, we extrapolate our model findings to the light curves of all Fermi-LAT flat-spectrum radio quasars. We find that next-generation neutrino telescopes are expected to detect approximately one multimessenger ($\\gamma + \\nu_{\\mu}$) flare per year from bright blazars with neutrino peak energy in the hundreds TeV -- hundreds PeV energy range and show that the electromagnetic flare peak can precede the neutrino arrival by months to years.",
      "pdf_url": "https://arxiv.org/pdf/2502.12111.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.17828",
      "title": "Dark Matter Density Profile Around a Newborn First Star",
      "authors": [
        "Shingo Hirano",
        "Naoki Yoshida"
      ],
      "abstract": "Dark Matter Density Profile Around a Newborn First Star Shingo Hirano, Naoki Yoshida 17 pages, 1 table, 9 figures, accepted for publication in JCAP Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Ambient dark matter (DM) around binary black holes can imprint characteristic signatures on gravitational waves emitted from their merger. The exact signature depends sensitively on the DM density profile around the black holes. We run very high resolution cosmological hydrodynamics simulations of first star formation that follow the collapse of a $3\\times10^{5}\\,M_\\odot$ mini-halo from $z=49$ to $z\\simeq22$. Our flagship model achieves a DM particle mass of $3.7\\times10^{-4}\\,M_\\odot$ and resolves the inner-most structure down to $0.02\\,$pc. We show that the halo experiences a two-stage gravitational collapse, where a rotating, constant-density core with $r\\lesssim3\\,$pc is formed first, surrounded by an extended outskirts. Baryonic infall toward the center continues to raise the local Keplerian velocity and promotes adiabatic contraction of DM. The resulting density profile has an approximately power-law shape of $\\rho_{\\rm dm} \\propto r^{-0.6}$ inside $\\sim\\!1\\,$this http URL find that a piecewise power-law fit reproduces the simulation result to better than 10\\%, and also find numerical convergence down to $\\simeq\\!0.01\\,$pc. The DM density profile is typical for ordinary Pop~III halos, but our additional simulations reveal that inner slope varies significantly with halo-to-halo scatter, and the effect of Lyman-Werner irradiation and of supersonic baryon-DM streaming velocities, implying a wide distribution of slopes rather than a single universal curve. The large variation should be considered when calculating the predicted DM-induced dephasing of gravitational waves by up to an order of magnitude relative to the classical analytic model of the DM spike.",
      "pdf_url": "https://arxiv.org/pdf/2505.17828.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.01883",
      "title": "A continuous transition from Type-C Quasi Periodic Oscillations to the Heartbeat state in the Black hole X-ray binary 4U 1630-47",
      "authors": [
        "Chintan Patel",
        "Sayantan Bhattacharya",
        "Karan Akbari",
        "Sudip Bhattacharyya",
        "Manojendu Choudhury"
      ],
      "abstract": "A continuous transition from Type-C Quasi Periodic Oscillations to the Heartbeat state in the Black hole X-ray binary 4U 1630-47 Chintan Patel (St. Xavier's College Mumbai), Sayantan Bhattacharya (TIFR Mumbai), Karan Akbari (St. Xavier's College Mumbai), Sudip Bhattacharyya (TIFR Mumbai), Manojendu Choudhury (St. Xavier's College Mumbai) High Energy Astrophysical Phenomena (astro-ph.HE) We present a timing analysis of the black hole X-ray binary (BHXRB) 4U 1630-47 using AstroSat observations from 10-19 March 2023, for the first time capturing a rare and rapid transition in variability properties. Within less than a day, the source evolved from a type-C quasi-periodic oscillation (QPO) state, with centroid frequencies between 3-5 Hz, to the Heartbeat state, characterized by a broad peak in the power density spectrum at ~25 mHz, corresponding to a ~40 s modulation period. As the source evolved, it passed through a transition track where the QPO features weakened and ultimately disappeared in the Heartbeat state. In the hardness-intensity Diagram, the QPOs occur at higher hardness and lower intensity, followed by a brightening phase as the source moved towards the soft intermediate state, and finally reached the Heartbeat state through a transition towards lower hardness. In the power-color diagram, this transition is marked by a clear shift to a distinct region of power color space, separate from the range occupied by other observed states. This work establishes 4U 1630-47 as another system, apart from GRS 1915+105, where a continuous transition from QPO to Heartbeat state has been observed. Notably, 4U 1630-47 is the only system where the QPO is absent during the heartbeat state. This provides us with another probe to understand the physical mechanism governing this transition and the overall accretion mechanism in BHXRBs.",
      "pdf_url": "https://arxiv.org/pdf/2511.01883.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01969",
      "title": "Identification and characterization of optical companions to the population of millisecond pulsars in the globular cluster M3",
      "authors": [
        "Greta Ettorre",
        "Emanuele Dalessandro",
        "Mario Cadelano",
        "Cristina Pallanca",
        "Paulo C. C. Freire",
        "Alessandro Ridolfi"
      ],
      "abstract": "Identification and characterization of optical companions to the population of millisecond pulsars in the globular cluster M3 Greta Ettorre, Emanuele Dalessandro, Mario Cadelano, Cristina Pallanca, Paulo C. C. Freire, Alessandro Ridolfi Accepted for publication in Astronomy and Astrophysics. 14 pages, 11 figures, 3 tables (additional 2 pages, 1 figure and 1 table in the Appendix) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The study of binary millisecond pulsars (MSPs) in globular clusters (GCs) is a key ingredient to study binary and stellar evolution under extreme conditions. In this context, an accurate analysis of the optical emission, which is mostly dominated by the companion star, is essential for a comprehensive characterization of these systems and their role within their environment. In this work, we present a multi-wavelength investigation of five binary MSPs in the Galactic GC M3 (NGC 5272) using archival Hubble Space Telescope (HST) data. Our analysis builds on the timing solutions obtained with the FAST radio Telescope by Li et al. (2024). For each MSP, we carry out precise astrometric cross-matching with the accurate radio positions to identify potential counterparts. When a match is found, we analyse its location in the colour-magnitude diagrams and compare the results with updated binary evolution models to infer the system properties. We confirm the identification of the optical companion to M3B, matching the source previously reported by Cadelano et al. (2019), and successfully identify and characterize the optical companions to M3D and M3F. All three are consistent with helium white dwarfs, as expected from the canonical formation scenario. For M3A and M3E, no reliable counterparts are found, but we place strong upper limits on the brightness and mass of the undetected companion. In the case of M3E, we detect a red object near the radio position in two F814W observations; however, astrometric measurements over a 15-year baseline reveal a significant proper motion inconsistent with cluster membership, identifying the source as a foreground contaminant. This study highlights the effectiveness of combining precise radio timing with deep, multi-band HST images to uncover and constrain the nature of MSP companions in GCs, offering insights into their formation and evolutionary histories.",
      "pdf_url": "https://arxiv.org/pdf/2511.01969.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02037",
      "title": "The complicated nature of the X-ray emission from the field of the strongly lensed hyperluminous infrared galaxy PJ1053+60 at z=3.549",
      "authors": [
        "Carlos Garcia Diaz",
        "Q. Daniel Wang",
        "Kevin C. Harrington",
        "James D. Lowenthal",
        "Patrick S. Kamieneski",
        "Eric F. Jimenez-Andrade",
        "Nicholas Foo",
        "Min S. Yun",
        "Brenda L. Frye",
        "Dazhi Zhou",
        "Amit Vishwas",
        "Ilsang Yoon",
        "Belen Alcalde Pampliega",
        "Daizhong Liu",
        "Massimo Pascale"
      ],
      "abstract": "The complicated nature of the X-ray emission from the field of the strongly lensed hyperluminous infrared galaxy PJ1053+60 at z=3.549 Carlos Garcia Diaz, Q. Daniel Wang, Kevin C. Harrington, James D. Lowenthal, Patrick S. Kamieneski, Eric F. Jimenez-Andrade, Nicholas Foo, Min S. Yun, Brenda L. Frye, Dazhi Zhou, Amit Vishwas, Ilsang Yoon, Belen Alcalde Pampliega, Daizhong Liu, Massimo Pascale 12 pages, 9 figures, Monthly Notices of the Royal Astronomical Society High Energy Astrophysical Phenomena (astro-ph.HE) We present an analysis of XMM-Newton X-ray observations of PJ1053+60, a hyperluminous infrared galaxy (HyLIRG) at z=3.549 that is strongly lensed by a foreground group at z=0.837. We also present GNIRS spectroscopy confirming the presence of an active galactic nucleus (AGN) to the southwest of PJ1053+60 ($AGN_{SW}$) at $z_{SW}$ = 1.373 $\\pm$ 0.006. Using this redshift prior, we decompose the X-ray spectrum of PJ1053+60 into $AGN_{SW}$ and high-mass X-ray binary (HMXB) components from the HyLIRG. The HMXB component has an unusually high luminosity, $\\sim$ 50 times higher than calibration derived from local galaxies, and a characteristic photon index likely too flat to be caused by high-mass X-ray binaries at rest frame energies above a few keV. Our 2-D spatial decomposition also suggests a similarly high X-ray HMXB luminosity, although the limited spatial resolution prevents meaningful morphological constraints on the component. We conclude that the enhanced X-ray emission may only be explained by the presence of another AGN ($AGN_{FG}$) embedded in the foreground group lensing the PJ1053+60 system. The presence of $AGN_{FG}$ is further supported by the detection of a point-like radio continuum source that coincides with the brightest group galaxy (BGG) of the foreground lens. Our study demonstrates the limited capability of current X-ray observatories while highlighting the need for higher angular resolution observations to definitively characterize the nature of X-ray emission in distant, strongly lensed HyLIRGs.",
      "pdf_url": "https://arxiv.org/pdf/2511.02037.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02186",
      "title": "A Face-on Accretion Disk Geometry Revealed by Millimeter-wave Periodicity in Sgr A$^*$",
      "authors": [
        "Kazuki Yanagisawa",
        "Tomoharu Oka",
        "Ryo Ariyama",
        "Kazuki Yanagihara",
        "Yuhei iwata",
        "Mikiya M. Takahashi"
      ],
      "abstract": "A Face-on Accretion Disk Geometry Revealed by Millimeter-wave Periodicity in Sgr A$^*$ Kazuki Yanagisawa, Tomoharu Oka, Ryo Ariyama, Kazuki Yanagihara, Yuhei iwata, Mikiya M. Takahashi High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We analyzed 77 epochs of Atacama Large Millimeter/submillimeter Array (ALMA) archival data to investigate flux variability in Sagittarius A$^*$ (Sgr A$^*$), the supermassive black hole at the Galactic Center. Among these, we identified a rare but unusually clear and coherent ~52-minute sinusoidal modulation at 230 GHz, with a statistical significance exceeding 5{\\sigma}. Modeling with a Doppler-boosted hotspot scenario yields an orbital radius of ~4 Schwarzschild radii and a disk inclination of 8$^\\circ$ (or 172$^\\circ$), providing the first direct millimeter wavelength constraint on the inner accretion flow geometry. This nearly face-on inclination is in good agreement with previous constraints from GRAVITY and EHT observations. These findings provide robust, independent evidence that millimeter-wave periodicity can directly probe the innermost accretion flow geometry, offering a powerful complement to variability studies at infrared and X-ray wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2511.02186.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02222",
      "title": "Search for Diffuse Supernova Neutrino Background with 956.2 days of Super-Kamiokande Gadolinium Dataset",
      "authors": [
        "K. Abe",
        "S. Abe",
        "Y. Asaoka",
        "M. Harada",
        "Y. Hayato",
        "K. Hiraide",
        "K. Hosokawa",
        "T. H. Hung",
        "K. Ieki",
        "M. Ikeda",
        "J. Kameda",
        "Y. Kanemura",
        "Y. Kataoka",
        "S. Miki",
        "S. Mine",
        "M. Miura",
        "S. Moriyama",
        "M. Nakahata",
        "S. Nakayama",
        "Y. Noguchi",
        "G. Pronost",
        "K. Sato",
        "H. Sekiya",
        "R. Shinoda",
        "M. Shiozawa",
        "Y. Suzuki",
        "A. Takeda",
        "Y. Takemoto",
        "H. Tanaka",
        "T. Yano",
        "Y. Itow",
        "T. Kajita",
        "R. Nishijima",
        "K. Okumura",
        "T. Tashiro",
        "T. Tomiya",
        "X. Wang",
        "P. Fernandez",
        "L. Labarga",
        "D. Samudio",
        "B. Zaldivar",
        "C. Yanagisawa",
        "E. Kearns",
        "L. Wan",
        "T. Wester",
        "B. W. Pointon",
        "J. Bian",
        "B. Cortez",
        "N. J. Griskevich",
        "Y. Jiang",
        "M. B. Smy",
        "H. W. Sobel",
        "V. Takhistov",
        "A. Yankelevich",
        "J. Hill",
        "M. C. Jang",
        "S. H. Lee",
        "D. H. Moon",
        "R. G. Park",
        "B. S. Yang",
        "B. Bodur",
        "K. Scholberg",
        "C. W. Walter",
        "A. Beauch'ene",
        "E. Le Bl'evec",
        "O. Drapier",
        "A. Ershova",
        "M. Ferey",
        "Th. A. Mueller",
        "A. D. Santos",
        "P. Paganini",
        "C. Quach",
        "R. Rogly",
        "T. Nakamura",
        "J. S. Jang",
        "R. P. Litchfield",
        "L. N. Machado",
        "F. J. P. Soler",
        "J. G. Learned",
        "K. Choi",
        "S. Cao",
        "L. H. V. Anthony",
        "N. W. Prouse",
        "M. Scott",
        "Y. Uchida",
        "V. Berardi",
        "N. F. Calabria",
        "M. G. Catanesi",
        "N. Ospina",
        "E. Radicioni",
        "A. Langella",
        "G. De Rosa",
        "G. Collazuol",
        "M. Feltre",
        "M. Mattiazzi",
        "L. Ludovici",
        "M. Gonin",
        "L. P'eriss'e",
        "B. Quilain",
        "S. Horiuchi"
      ],
      "abstract": "Search for Diffuse Supernova Neutrino Background with 956.2 days of Super-Kamiokande Gadolinium Dataset K. Abe, S. Abe, Y. Asaoka, M. Harada, Y. Hayato, K. Hiraide, K. Hosokawa, T. H. Hung, K. Ieki, M. Ikeda, J. Kameda, Y. Kanemura, Y. Kataoka, S. Miki, S. Mine, M. Miura, S. Moriyama, M. Nakahata, S. Nakayama, Y. Noguchi, G. Pronost, K. Sato, H. Sekiya, R. Shinoda, M. Shiozawa, Y. Suzuki, A. Takeda, Y. Takemoto, H. Tanaka, T. Yano, Y. Itow, T. Kajita, R. Nishijima, K. Okumura, T. Tashiro, T. Tomiya, X. Wang, P. Fernandez, L. Labarga, D. Samudio, B. Zaldivar, C. Yanagisawa, E. Kearns, L. Wan, T. Wester, B. W. Pointon, J. Bian, B. Cortez, N. J. Griskevich, Y. Jiang, M. B. Smy, H. W. Sobel, V. Takhistov, A. Yankelevich, J. Hill, M. C. Jang, S. H. Lee, D. H. Moon, R. G. Park, B. S. Yang, B. Bodur, K. Scholberg, C. W. Walter, A. Beauch'ene, E. Le Bl'evec, O. Drapier, A. Ershova, M. Ferey, Th. A. Mueller, A. D. Santos, P. Paganini, C. Quach, R. Rogly, T. Nakamura, J. S. Jang, R. P. Litchfield, L. N. Machado, F. J. P. Soler, J. G. Learned, K. Choi, S. Cao, L. H. V. Anthony, N. W. Prouse, M. Scott, Y. Uchida, V. Berardi, N. F. Calabria, M. G. Catanesi, N. Ospina, E. Radicioni, A. Langella, G. De Rosa, G. Collazuol, M. Feltre, M. Mattiazzi, L. Ludovici, M. Gonin, L. P'eriss'e, B. Quilain, S. Horiuchi High Energy Astrophysical Phenomena (astro-ph.HE) We report the search result for the Diffuse Supernova Neutrino Background (DSNB) in neutrino energies beyond 9.3~MeV in the gadolinium-loaded Super-Kamiokande (SK) detector with $22,500\\times956.2$$~\\rm m^3\\cdot day$ exposure. %$22.5{\\rm k}\\times956.2$$~\\rm m^3\\cdot day$ exposure. Starting in the summer of 2020, SK introduced 0.01\\% gadolinium (Gd) by mass into its ultra-pure water to enhance the neutron capture signal, termed the SK-VI phase. This was followed by a 0.03\\% Gd-loading in 2022, a phase referred to as SK-VII. We then conducted a DSNB search using 552.2~days of SK-VI data and 404.0~days of SK-VII data through September 2023. This analysis includes several new features, such as two new machine-learning neutron detection algorithms with Gd, an improved atmospheric background reduction technique, and two parallel statistical approaches. No significant excess over background predictions was found in a DSNB spectrum-independent analysis, and 90\\% C.L. upper limits on the astrophysical electron anti-neutrino flux were set. Additionally, a spectral fitting result exhibited a $\\sim1.2\\sigma$ disagreement with a null DSNB hypothesis, comparable to a previous result from 5823~days of all SK pure water phases.",
      "pdf_url": "https://arxiv.org/pdf/2511.02222.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02236",
      "title": "Magnetic-type Love number differentiating quark stars from neutron stars",
      "authors": [
        "Kenji Fukushima",
        "Josuke Minamiguchi",
        "Tomoya Uji"
      ],
      "abstract": "Magnetic-type Love number differentiating quark stars from neutron stars Kenji Fukushima, Josuke Minamiguchi, Tomoya Uji High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) The quark star (QS) is a hypothetical and yet undiscovered stellar object, and its existence would mark a paradigm shift in research on nuclear and quark matter. Although compactness is a well-known signature for distinguishing between two branches of QSs and neutron stars (NSs), some QSs can overlap with NSs in the radius-mass plane. To manifest their evident differences, we investigate the tidal properties of QSs and NSs. We then find that the magnetic-type Love number is a robust indicator for differentiating between QSs and NSs, whereas the electric-type one is insufficient when QSs and NSs have similar masses and radii. Finally, we show that gravitational waves from binary star mergers can be sensitive to differences between QSs and NSs to the detectable level.",
      "pdf_url": "https://arxiv.org/pdf/2511.02236.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.02562",
      "title": "Characterising EP241107a: Multiwavelength Observations of an Einstein Probe-detected Fast X-ray Transient",
      "authors": [
        "D. Eappachen",
        "A. Balasubramanian",
        "Vishwajeet Swain",
        "G. C. Anupama",
        "D. K. Sahu",
        "V. Bhalerao",
        "T. Ahumada",
        "I. Andreoni",
        "Sudhanshu Barway",
        "J. Carney",
        "J. Freeburn",
        "M. M. Kasliwal",
        "Tanishk Mohan",
        "A. C. Rodriguez",
        "G. Waratkar"
      ],
      "abstract": "Characterising EP241107a: Multiwavelength Observations of an Einstein Probe-detected Fast X-ray Transient D. Eappachen, A. Balasubramanian, Vishwajeet Swain, G. C. Anupama, D. K. Sahu, V. Bhalerao, T. Ahumada, I. Andreoni, Sudhanshu Barway, J. Carney, J. Freeburn, M. M. Kasliwal, Tanishk Mohan, A. C. Rodriguez, G. Waratkar 13 pages, 9 figures, 2 tables. Submitted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Fast X-ray Transients (FXTs) represent a new class of highly luminous transients in soft X-rays ($\\sim$0.3-10 keV) associated with violent astrophysical processes. They manifest as short, singular flashes of X-ray photons with durations lasting from minutes to hours. Their origin remains unclear, and they have been associated with various progenitor mechanisms. The newly launched X-ray survey, Einstein-Probe (EP), is revolutionising this field by enabling the discovery and immediate follow-up of FXTs. Here we present the multiwavelength observations of EP-discovered FXT EP241107a and the discovery of its radio counterpart. Comparison of the optical and radio observations of EP241107a and its host properties with other extragalactic transients suggests a gamma-ray burst (GRB) origin. Through our afterglow modelling, we infer the GRB jet properties for EP241107a, yielding a jet of the isotropic-equivalent kinetic energy $E_{\\mathrm{K,iso}} \\sim10^{51}$ erg, with a half opening angle $\\theta_{c}$ $\\approx$15$^{\\circ}$, viewed at an angle of $\\theta_{\\rm obs}$~$\\approx$9$^{\\circ}$. We also evaluate EP241107a in the landscape of both EP-discovered FXTs as well as the FXTs discovered from Chandra, XMM-Newton, and Swift-XRT.",
      "pdf_url": "https://arxiv.org/pdf/2511.02562.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02634",
      "title": "Using Deep Learning for Robust Classification of Fast Radio Bursts",
      "authors": [
        "Rohan Arni",
        "Carlos Blanco",
        "Anirudh Prabhu"
      ],
      "abstract": "Using Deep Learning for Robust Classification of Fast Radio Bursts Rohan Arni, Carlos Blanco, Anirudh Prabhu 15 pages, 4 figures, 9 tables. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) While the nature of fast radio bursts (FRBs) remains unknown, population-level analyses can elucidate underlying structure in these signals. In this study, we employ deep learning methods to both classify FRBs and analyze structural patterns in the latent space learned from the first CHIME catalog. We adopt a Supervised Variational Autoencoder (sVAE) architecture which combines the representational learning capabilities of Variational Autoencoders (VAEs) with a supervised classification task, thereby improving both classification performance and the interpretability of the latent space. We construct a learned latent space in which we perform further dimensionality reduction to find underlying structure in the data. Our results demonstrate that the sVAE model achieves high classification accuracy for FRB repeaters and reveals separation between repeater and non-repeater populations. Upon further analysis of the latent space, we observe that dispersion measure excess, spectral index, and spectral running are the dominant features distinguishing repeaters from non-repeaters. We also identify four non-repeating FRBs as repeater candidates, two of which have been independently flagged in previous studies.",
      "pdf_url": "https://arxiv.org/pdf/2511.02634.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02178",
      "title": "An Extremely Luminous Flare Recorded from a Supermassive Black Hole",
      "authors": [
        "Matthew J. Graham",
        "Barry McKernan",
        "K. E. Saavik Ford",
        "Daniel Stern",
        "Matteo Cantiello",
        "Andrew J. Drake",
        "Yuanze Ding",
        "Mansi Kasliwal",
        "Mike Koss",
        "Raffaella Margutti",
        "Sam Rose",
        "Jean Somalwar",
        "Phil Wiseman",
        "S. G. Djorgovski",
        "Patrik M. Veres",
        "Eric C. Bellm",
        "Tracy X. Chen",
        "Steven L. Groom",
        "Shrinivas R. Kulkarni",
        "Ashish Mahabal"
      ],
      "abstract": "An Extremely Luminous Flare Recorded from a Supermassive Black Hole Matthew J. Graham, Barry McKernan, K. E. Saavik Ford, Daniel Stern, Matteo Cantiello, Andrew J. Drake, Yuanze Ding, Mansi Kasliwal, Mike Koss, Raffaella Margutti, Sam Rose, Jean Somalwar, Phil Wiseman, S. G. Djorgovski, Patrik M. Veres, Eric C. Bellm, Tracy X. Chen, Steven L. Groom, Shrinivas R. Kulkarni, Ashish Mahabal 41 pages, 12 figures, accepted by Nature Astronomy Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Since their discovery more than 60 years ago, accreting supermassive black holes in active galactic nuclei (AGN) were recognized as highly variable sources, requiring an extremely compact, dynamic environment. Their variability traces to multiple phenomena, including changing accretion rates, temperature changes, foreground absorbers, and structural changes to the accretion disk. Spurred by a new generation of time-domain surveys, the extremes of black hole variability are now being probed. We report the discovery of an extreme flare by the AGN J224554.84+374326.5, which brightened by more than a factor of 40 in 2018. The source has slowly faded since then. The total emitted UV/optical energy to date is $\\sim10^{54}$ erg, i.e., the complete conversion of approximately one solar mass into electromagnetic radiation. This flare is 30 times more powerful than the previous most powerful AGN transient. Very few physical events in the Universe can liberate this much electromagnetic energy. We discuss potential mechanisms, including the tidal disruption of a high mass $(>30\\, M_\\odot)$ star, gravitational lensing of an AGN flare or supernova, or a supermassive (pair instability) supernova in the accretion disk of an AGN. We favor the tidal disruption of a massive star in a prograde orbit in an AGN disk.",
      "pdf_url": "https://arxiv.org/pdf/2511.02178.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02328",
      "title": "ASTROFLOW: A Real-Time End-to-End Pipeline for Radio Single-Pulse Searches",
      "authors": [
        "Guanhong Lin",
        "Dejia Zhou",
        "Jianli Zhang",
        "Jialang Ding",
        "Fei Liu",
        "Xiaoyun Ma",
        "Yuan Liang",
        "Ruan Duan",
        "Liaoyuan Liu",
        "Xuanyu Wang",
        "Xiaohui Yan",
        "Yingrou Zhan",
        "Yuting Chu",
        "Jing Qiao",
        "Wei Wang",
        "Jie Zhang",
        "Zerui Wang",
        "Meng Liu",
        "Chenchen Miao",
        "Menquan Liu",
        "Meng Guo",
        "Di Li",
        "Pei Wang"
      ],
      "abstract": "ASTROFLOW: A Real-Time End-to-End Pipeline for Radio Single-Pulse Searches Guanhong Lin, Dejia Zhou, Jianli Zhang, Jialang Ding, Fei Liu, Xiaoyun Ma, Yuan Liang, Ruan Duan, Liaoyuan Liu, Xuanyu Wang, Xiaohui Yan, Yingrou Zhan, Yuting Chu, Jing Qiao, Wei Wang, Jie Zhang, Zerui Wang, Meng Liu, Chenchen Miao, Menquan Liu, Meng Guo, Di Li, Pei Wang Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs) are extremely bright, millisecond duration cosmic transients of unknown origin. The growing number of wide-field and high-time-resolution radio surveys, particularly with next-generation facilities such as the SKA and MeerKAT, will dramatically increase FRB discovery rates, but also produce data volumes that overwhelm conventional search pipelines. Real-time detection thus demands software that is both algorithmically robust and computationally efficient. We present Astroflow, an end-to-end, GPU-accelerated pipeline for single-pulse detection in radio time-frequency data. Built on a unified C++/CUDA core with a Python interface, Astroflow integrates RFI excision, incoherent dedispersion, dynamic-spectrum tiling, and a YOLO-based deep detector. Through vectorized memory access, shared-memory tiling, and OpenMP parallelism, it achieves 10x faster-than-real-time processing on consumer GPUs for a typical 150 s, 2048-channel observation, while preserving high sensitivity across a wide range of pulse widths and dispersion measures. These results establish the feasibility of a fully integrated, GPU-accelerated single-pulse search stack, capable of scaling to the data volumes expected from upcoming large-scale surveys. Astroflow offers a reusable and deployable solution for real-time transient discovery, and provides a framework that can be continuously refined with new data and models.",
      "pdf_url": "https://arxiv.org/pdf/2511.02328.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.17908",
      "title": "Flat Spectrum Radio Quasars as high-energy neutrino sources",
      "authors": [
        "Alberto Moretti",
        "Alessandro Caccianiga"
      ],
      "abstract": "Flat Spectrum Radio Quasars as high-energy neutrino sources Alberto Moretti, Alessandro Caccianiga 9 pages, 7 figures; Accepted for publication in Astronomy and Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) The astrophysical sources responsible for the production of high-energy neutrinos remain largely uncertain. The strongest associations suggest a correlation between neutrinos and active galactic nuclei. However, it is still unclear which specific regions and mechanisms of the accreting supermassive black hole are responsible for their production. In this paper we investigate the correlation between the positions of IceCat-1 neutrino events and a large, optically selected quasar catalogue extracted from the Sloan Digital Sky Survey. Within this sample, we distinguish radio-quiet quasars from flat-spectrum radio quasars (FSRQs) based on radio emission data from the Cosmic Lens All Sky Survey (CLASS) catalogue. While all the associations between neutrino events and radio-quiet quasars are consistent with being random matches, FSRQs exhibit a moderately significant correlation (2.7 sigma) with neutrino positions. Additionally, we observe that the distribution of minimum distances between neutrino events and FSRQs differs significantly for events at declinations above and below 20 deg. In particular, using the Kolmogorov-Smirnov test, we find that the high-declination event distribution deviates strongly (4 sigma) from a random distribution. We interpret all these results as an indication that a large fraction of the neutrino events (>60%) observed by IceCube could be produced by the FSRQs and that the emission mechanism is likely related to the relativistic jets rather than the radio-quiet component of these sources, such as the accretion disk or corona.",
      "pdf_url": "https://arxiv.org/pdf/2507.17908.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20334",
      "title": "Predicting the X-ray signatures of the imminent T Coronae Borealis outburst through 3D hydrodynamic modeling",
      "authors": [
        "S. Orlando",
        "L. Chomiuk",
        "J. Drake",
        "M. Miceli",
        "F. Bocchino",
        "O. Petruk"
      ],
      "abstract": "Predicting the X-ray signatures of the imminent T Coronae Borealis outburst through 3D hydrodynamic modeling S. Orlando, L. Chomiuk, J. Drake, M. Miceli, F. Bocchino, O. Petruk Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE) T Coronae Borealis (T CrB) is a symbiotic recurrent nova with eruptions in 1866 and 1946. Mounting evidence suggests an imminent outburst, offering a rare opportunity to observe a nearby nova in detail. We constrain the circumbinary medium (CBM) by modeling inter-eruption radio observations and simulate the hydrodynamic evolution of the upcoming outburst to predict its X-ray signatures, focusing on the roles of the red giant companion, accretion disk, and equatorial density enhancement (EDE). We model thermal radio emission from a CBM composed of a spherical wind and a torus-like EDE to estimate its density. We then perform 3D hydrodynamic simulations of the nova outburst, varying explosion energy, ejecta mass, and CBM configuration. From these, we synthesize X-ray light curves and spectra as they would appear to XMM-Newton and XRISM. The CBM in T CrB is significantly less dense than in other symbiotic novae, with a mass-loss rate of $\\dot{M} \\approx 4 \\times 10^{-9}$ M$_{\\odot}$ yr$^{-1}$ for a 10 km s$^{-1}$ wind. Despite the low-density EDE, the blast is collimated along the poles by the accretion disk and EDE, producing a bipolar shock. The red giant partially shields the ejecta, forming a bow shock and hot wake. X-ray evolution proceeds through three phases: an early phase (first few hours) dominated by shocked disk material; an intermediate phase ($\\sim 1$ week-1 month) driven by reverse-shocked ejecta; and a late phase dominated by shocked EDE. Soft X-rays trace shocked ejecta, hard X-rays arise from shocked ambient gas, and synthetic spectra show asymmetric, blueshifted lines due to absorption by expanding ejecta. The X-ray evolution resembles that of RS Oph and V745 Sco, with a peak luminosity of $L_\\mathrm{X} \\approx 10^{36}$ erg s$^{-1}$, but features a more prolonged soft X-ray phase, reflecting the lower CBM density and distinct ejecta-environment interaction.",
      "pdf_url": "https://arxiv.org/pdf/2507.20334.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.17211",
      "title": "The changing look of the neutrino-emitter blazar candidate 5BZQ J1243+4043",
      "authors": [
        "Alessandra Azzollini",
        "Sara Buson",
        "Alexis Coleiro"
      ],
      "abstract": "The changing look of the neutrino-emitter blazar candidate 5BZQ J1243+4043 Alessandra Azzollini, Sara Buson, Alexis Coleiro 5 pages, 6 figures, 2 tables. Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) In recent years, changing-look blazars have called the traditional view of BL Lacs-flat spectrum radio quasars into question within the empirical classification of blazars. Based on the intensity of optical lines, they appear to transition between the two classes over time. We focus on the blazar 5BZQ J1243+4043, recently proposed as a promising candidate for the emission of high-energy neutrinos observed by the IceCube Neutrino Observatory and reported as a changing-look blazar in the literature. We study the spectral properties of this blazar, inferring its radiation field and accretion regime across different epochs. This study presents new optical spectroscopy observations of 5BZQ J1243+4043 taken with Gran Telescopio Canarias. We used this new dataset and two optical spectra available from the literature to investigate the continuum and line emissions and pinpoint the physical properties of the source. In particular, we used the emission lines to probe the accretion regime. The newly collected data for 5BZQ J1243+4043 shows broad emission lines, consistent with the spectrum of the first epoch and the redshift z = 1.5181$\\pm$0.0002 known from the literature. For the second epoch, the spectrum appears featureless and so, we placed limits on the emission lines and related properties. We observed spectral variability for both the continuum and line emissions among the three spectra. Nonetheless, the accretion properties of the blazar generally remain unvaried, indicating that the intrinsic physics stays the same across the three epochs. In the broader multi-messenger context, this suggests that, despite the changing look in the optical band, the candidate neutrino-emitter blazar 5BZQ J1243+4043 is still characterized by the presence of intense external radiation fields and radiatively efficient accretion, typical of high-excitation radio galaxies, which may foster neutrino production.",
      "pdf_url": "https://arxiv.org/pdf/2509.17211.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07534",
      "title": "Evidence for Supermassive Black Hole Binaries",
      "authors": [
        "Martin G. H. Krause",
        "Martin A. Bourne",
        "Silke Britzen",
        "Adi Foord",
        "Jenny E. Greene",
        "Melanie Habouzit",
        "Maya A. Horton",
        "Lucio Mayer",
        "Hannah Middleton",
        "Rebecca Nealon",
        "Julia M. Sisk-Reynés",
        "Christopher S. Reynolds",
        "Debora Sijacki"
      ],
      "abstract": "Evidence for Supermassive Black Hole Binaries Martin G. H. Krause, Martin A. Bourne, Silke Britzen, Adi Foord, Jenny E. Greene, Melanie Habouzit, Maya A. Horton, Lucio Mayer, Hannah Middleton, Rebecca Nealon, Julia M. Sisk-Reynés, Christopher S. Reynolds, Debora Sijacki 20 pages, 8 figures, PASA, accepted, minor updates (one afil., a clarification in Sect. 7 and a few references added) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We review the state of the evidence for the existence and observational appearance of supermassive black hole binaries. Such objects are expected from standard hierarchical galaxy evolution to form after two galaxies, each containing a supermassive black hole, have merged, in the centre of the merger remnant. A complex interaction is predicted to take place with stars and gas in the host galaxy, leading to observable signatures in weakly as well as actively accreting phases. Direct observational evidence is available and shows examples of dual active galactic nuclei from kpc scales down to parsec scales. Signatures of possibly closer supermassive black hole binaries may be seen in jetted black holes. The interaction with stars and gas in a galaxy significantly affects the hardening of the binary and hence contributes to uncertainties of the expected gravitational wave signal. The Laser Interferometer Space Antenna (LISA) should in the future detect actual mergers. Before the launch of LISA, pulsar timing arrays may have the best chance to detect a gravitational wave signal from supermassive black hole binaries. The first signs of the combined background of inspiralling objects might have been seen already.",
      "pdf_url": "https://arxiv.org/pdf/2510.07534.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.25762",
      "title": "Radiation-dominated polar emitting region of an accreting X-ray pulsar -- I. Polarization- and spectrum-dependent structure, and the emergent continuum",
      "authors": [
        "M. I. Gornostaev"
      ],
      "abstract": "Radiation-dominated polar emitting region of an accreting X-ray pulsar -- I. Polarization- and spectrum-dependent structure, and the emergent continuum M. I. Gornostaev High Energy Astrophysical Phenomena (astro-ph.HE) The radiation-dominated polar emitting region of an accreting X-ray pulsar is simulated numerically in the framework of a three-dimensional (geometrically two-dimensional) model. The radiative transfer within the emitting region and the structure of the latter are calculated with the use of the self-consistent algorithm developed earlier. The magnetic scattering cross sections dependent on the photon energy and polarization have been incorporated. Second-order bulk Comptonization over entire emitting region, induced Compton scattering, the switching of the polarization modes, free-free processes, the cyclotron emission because of electron-proton collisions, and a realistic shape of the accretion channel have been taken into account. The case of a dipole magnetic field is considered. It is shown that the induced Compton effect can play a notable role in establishing the electron temperature in the post-shock zone. Within the model shock wave, a higher electron temperature is achieved than in the post-shock zone by means of the bulk-heating mechanism. The photons gaining the energy in the shock wave and above it due to bulk motion effects and the thermal Doppler effect are responsible for the formation of high-energy regions in the emergent continuum of the polarization modes.",
      "pdf_url": "https://arxiv.org/pdf/2510.25762.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.23212",
      "title": "Hierarchical Triples vs. Globular Clusters: Binary black hole merger eccentricity distributions compete and evolve with redshift",
      "authors": [
        "Andris Dorozsmai",
        "Isobel M. Romero-Shaw",
        "Aditya Vijaykumar",
        "Silvia Toonen",
        "Fabio Antonini",
        "Kyle Kremer",
        "Michael Zevin",
        "Evgeni Grishin"
      ],
      "abstract": "Hierarchical Triples vs. Globular Clusters: Binary black hole merger eccentricity distributions compete and evolve with redshift Andris Dorozsmai, Isobel M. Romero-Shaw, Aditya Vijaykumar, Silvia Toonen, Fabio Antonini, Kyle Kremer, Michael Zevin, Evgeni Grishin 22 pages, 9 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The formation mechanisms of merging binary black holes (BBHs) observed by the LIGO-Virgo-KAGRA collaboration remain uncertain. Detectable eccentricity provides a powerful diagnostic for distinguishing between different formation channels, but resolving their eccentricity distributions requires the detection of a large number of eccentric mergers. Future gravitational wave detectors such as the Einstein Telescope and Cosmic Explorer will detect tens of thousands of BBH mergers out to redshifts $z \\ge 10$, making it critical to understand the redshift-dependent evolution of eccentricity distributions. We simulate this evolution for two key channels: dynamical assembly in globular clusters (GCs), which leads to rapid, eccentric mergers; and hierarchical triples in the field, where three-body dynamics can induce eccentricity in the inner binary. When considering all BBH mergers, the GC channel dominates overall, consistent with previous studies. However, when focusing on mergers with detectable eccentricity in next-generation detectors, we find that hierarchical triples dominate the eccentric merger rate at $0\\le z \\le 4$, with GC mergers becoming competitive at higher redshifts. Across all model variations, eccentric mergers in the local Universe ($z\\lesssim 1$) have significant contributions from field triples, challenging the common view that such systems primarily form in dense environments. We show that, regardless of cluster and stellar evolution uncertainties, hierarchical triples contribute at least 30 per cent of eccentric mergers across a large range of redshifts.",
      "pdf_url": "https://arxiv.org/pdf/2507.23212.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.01977",
      "title": "The lives and deaths of faint satellite galaxies around M31",
      "authors": [
        "Alex Merrow , Kyle A. Oman , Azadeh Fattahi Astrophysics Research Institute Liverpool John Moores University, Department of Physics Durham University, Institute for Computational Cosmology Department of Physics Durham University, Centre for Extragalactic Astronomy Department of Physics Durham University, The Oskar Klein Centre Department of Physics Stockholm University)"
      ],
      "abstract": "The lives and deaths of faint satellite galaxies around M31 Alex Merrow (1 and 2), Kyle A. Oman (3 and 4), Azadeh Fattahi (3 and 5) ((1) Astrophysics Research Institute Liverpool John Moores University, (2) Department of Physics Durham University, (3) Institute for Computational Cosmology Department of Physics Durham University, (4) Centre for Extragalactic Astronomy Department of Physics Durham University, (5) The Oskar Klein Centre Department of Physics Stockholm University) 12 pages, 6 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) We present predictions for proper motions, infall times and times of first pericentric passage for 39 of M31's satellite galaxies. We estimate these by sampling satellite orbits from cosmological N-body simulations matched on mass, distance and velocity along the line of sight, in addition to properties of the host system. Our predictions are probabilistic based on repeated sampling from the uncertainty distributions of all quantities involved. We use these constraints on the satellites' orbital histories in conjunction with their published star formation histories to investigate the dominant environmental mechanisms for quenching satellites of M31-like hosts. Around half of the satellites appear to have quenched before their first pericentric passage around M31. Only the most massive satellites (with stellar masses > 10^8 M_sun) are able to maintain star formation for up to billions of years after infall. The majority of faint satellites, with stellar masses < 10^8 M_sun , were likely quenched before entering the M31 system. We compare our results for M31 against predictions for the Milky Way's satellites from the literature; M31's has a more active recent accretion history with more recently quenched satellites than the Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2511.01977.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01981",
      "title": "ODIN: Using multiplicity of Lyman-Alpha Emitters to assess star formation activity in dark matter halos",
      "authors": [
        "M. Candela Cerdosino",
        "Nelson Padilla",
        "Ana Laura O'Mill",
        "Eric Gawiser",
        "Nicole M. Firestone",
        "M. Celeste Artale",
        "Kyoung-Soo Lee",
        "Changbom Park",
        "Yujin Yang",
        "Caryl Gronwall",
        "Lucia Guaita",
        "Sungryong Hong",
        "Ho Seong Hwang",
        "Woong-Seob Jeong",
        "Ankit Kumar",
        "Jaehyun Lee",
        "Seong-Kook Joshua Lee",
        "Paulina Troncoso Iribarren",
        "Ann Zabludoff"
      ],
      "abstract": "ODIN: Using multiplicity of Lyman-Alpha Emitters to assess star formation activity in dark matter halos M. Candela Cerdosino, Nelson Padilla, Ana Laura O'Mill, Eric Gawiser, Nicole M. Firestone, M. Celeste Artale, Kyoung-Soo Lee, Changbom Park, Yujin Yang, Caryl Gronwall, Lucia Guaita, Sungryong Hong, Ho Seong Hwang, Woong-Seob Jeong, Ankit Kumar, Jaehyun Lee, Seong-Kook Joshua Lee, Paulina Troncoso Iribarren, Ann Zabludoff 12 pages (+3 pages Appendix), 5 figures (+3 figures in the Appendix), submitted to A&A Astrophysics of Galaxies (astro-ph.GA) We investigate if systems of multiple Lyman-alpha emitters (LAEs) can serve as a proxy for dark matter halo mass, assess how their radiative properties relate to the underlying halo conditions, and explore the physics of star formation activity in LAEs and its relation to possible physically related companions. We use data from the One-hundred-deg$^2$ DECam Imaging in Narrowbands (ODIN) survey, which targets LAEs in three narrow redshift slices. We identify physically associated LAE multiples in the COSMOS field at $z = 2.4$, $z = 3.1$, and $z=4.5$, and use a mock catalog from the IllustrisTNG100 simulation to assess the completeness and contamination affecting the resulting sample of LAE multiples. We then study their statistical and radiative properties as a function of multiplicity, where we adopt the term multiplicity to refer to the number of physically associated LAEs. We find a strong correlation between LAE multiplicity and host halo mass in the mocks, with higher multiplicity systems preferentially occupying more massive halos. In both ODIN and the mock sample, we find indications that the mean Ly$\\alpha$ luminosity and UV magnitude of LAEs in multiples increase with multiplicity. The halo-wide LAE surface brightness densities in Ly$\\alpha$ and UV increase with multiplicity, reflecting more compact and actively star-forming environments. The close agreement between the model and ODIN observations supports the validity of the Ly$\\alpha$ emission model in capturing key physical processes in LAE environments. Finally, a subhalo-based perturbation induced star formation model reproduces the minimum subhalo mass distribution in simulations at $z=2.4$, suggesting that local perturbations, rather than the presence of LAE companions, drive star formation in these systems. For the higher redshifts, neighbor perturbations do not seem to be the main driver that triggers star formation.",
      "pdf_url": "https://arxiv.org/pdf/2511.01981.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01986",
      "title": "Star Formation Histories and Stellar Dynamics in the Central Galaxies of RX J0820.9+0752, A1835, and PKS 0745-191",
      "authors": [
        "Marie-Joëlle Gingras",
        "B.R. McNamara",
        "Alison L. Coil",
        "Serena Perrotta",
        "Fabrizio Brighenti",
        "H.R. Russell",
        "S. Peng Oh",
        "Wenmeng Ning"
      ],
      "abstract": "Star Formation Histories and Stellar Dynamics in the Central Galaxies of RX J0820.9+0752, A1835, and PKS 0745-191 Marie-Joëlle Gingras, B.R. McNamara, Alison L. Coil, Serena Perrotta, Fabrizio Brighenti, H.R. Russell, S. Peng Oh, Wenmeng Ning 21 pages, 14 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) We present Keck Cosmic Web Imager observations of stellar populations in three galaxies at the centers of cooling flow clusters. All three host rich molecular gas reservoirs and show prominent Balmer absorption from $30-100$ Myr-old stars consistent with long lasting star formation. Two systems, A1835 and PKS 0745-191, have extended young stellar populations in their centers with recent star formation rates of 100 M$_{\\odot}$ yr$^{-1}$ and 8 M$_{\\odot}$ yr$^{-1}$, respectively. In A1835 we uncover a massive blueshifted clump of young stars moving at high speed with respect to the gas and central galaxy. We suggest this feature is a young population that formed in a gaseous outflow that has detached from its natal gas and is falling back toward the galaxy. This result, combined with a companion study (arXiv:2404.02212) tracing nebular emission which presumably cooled from the hot X-ray atmosphere, indicates that star formation is proceeding in a dynamically complex environment resulting from the central galaxy's motion with respect to the cooling clouds and motion induced by feedback from the central radio jets. In RX J0820.9+0752 intermediate age stars are found in a filament outside of the nucleus with no discernible star formation at the center of the galaxy. All projected galaxies are composed of old stellar populations with deep D4000 breaks and are devoid of detectable warm gas. While in some instances they may be interacting gravitationally with the central galaxy, they cannot have donated the upward of $10^{10}$ M$_{\\odot}$ of molecular gas found in these systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.01986.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01993",
      "title": "An Extended, Physically Calibrated FP for Elliptical Galaxies",
      "authors": [
        "Tarek Yehia"
      ],
      "abstract": "An Extended, Physically Calibrated FP for Elliptical Galaxies Tarek Yehia Accepted for publication in 'astrophysics and space science' Astrophysics of Galaxies (astro-ph.GA) We present a physically motivated extension of the FP for elliptical galaxies, derived from the scalar virial theorem and calibrated using observational data. Starting from the basic equilibrium condition, we incorporate key physical parameters that govern galaxy structure and dynamics, namely stellar mass-to-light ratio, central dark matter fraction, and structural non-homology as traced by the Sersic profile. The resulting model retains the original dependencies on velocity dispersion and surface brightness, but introduces physically interpretable corrections that significantly improve the fit to real data. Using a large galaxy sample, we demonstrate that this extended FP achieves a higher level of accuracy than the classical form, with all parameters showing strong statistical significance. Our results indicate that the observed FP can be understood as an empirical refinement of the virial prediction, once variations in stellar populations, dark matter content, and internal structure are taken into account. This work provides a unified framework that bridges theoretical expectations with observed scaling relations in elliptical systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.01993.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02009",
      "title": "Quasars acting as Strong Lenses Found in DESI DR1",
      "authors": [
        "Everett McArthur",
        "Martin Millon",
        "Meredith Powell",
        "Risa H. Wechsler",
        "Zhiwei Pan",
        "Małgorzata Siudek",
        "Jonas Spiller",
        "Jessica Nicole Aguilar",
        "Steven Ahlen",
        "Abhijeet Anand",
        "Segev BenZvi",
        "Davide Bianchi",
        "David Brooks",
        "Todd Claybaugh",
        "Andrei Cuceu",
        "Axel de la Macorra",
        "Arjun Dey",
        "Peter Doel",
        "Andreu Font-Ribera",
        "Jaime E. Forero-Romero",
        "Enrique Gaztañaga",
        "Satya Gontcho A Gontcho",
        "Gaston Gutierrez",
        "Hiram K. Herrera-Alcantar",
        "Klaus Honscheid",
        "Mustapha Ishak",
        "Dick Joyce",
        "Stephanie Juneau",
        "David Kirkby",
        "Theodore Kisner",
        "Anthony Kremin",
        "Ofer Lahav",
        "Claire Lamman",
        "Martin Landriau",
        "Laurent Le Guillou",
        "Marc Manera",
        "Aaron Meisner",
        "Ramon Miquel",
        "Seshadri Nadathur",
        "Nathalie Palanque-Delabrouille",
        "Will Percival",
        "Claire Poppett",
        "Francisco Prada",
        "Ignasi Pérez-Ràfols",
        "Graziano Rossi",
        "Eusebio Sanchez",
        "David Schlegel",
        "Michael Schubnell",
        "Hee-Jong Seo",
        "Joseph Harry Silber",
        "David Sprayberry",
        "Gregory Tarlé",
        "Benjamin Alan Weaver",
        "Rongpu Zhou",
        "Hu Zou"
      ],
      "abstract": "Quasars acting as Strong Lenses Found in DESI DR1 Everett McArthur, Martin Millon, Meredith Powell, Risa H. Wechsler, Zhiwei Pan, Małgorzata Siudek, Jonas Spiller, Jessica Nicole Aguilar, Steven Ahlen, Abhijeet Anand, Segev BenZvi, Davide Bianchi, David Brooks, Todd Claybaugh, Andrei Cuceu, Axel de la Macorra, Arjun Dey, Peter Doel, Andreu Font-Ribera, Jaime E. Forero-Romero, Enrique Gaztañaga, Satya Gontcho A Gontcho, Gaston Gutierrez, Hiram K. Herrera-Alcantar, Klaus Honscheid, Mustapha Ishak, Dick Joyce, Stephanie Juneau, David Kirkby, Theodore Kisner, Anthony Kremin, Ofer Lahav, Claire Lamman, Martin Landriau, Laurent Le Guillou, Marc Manera, Aaron Meisner, Ramon Miquel, Seshadri Nadathur, Nathalie Palanque-Delabrouille, Will Percival, Claire Poppett, Francisco Prada, Ignasi Pérez-Ràfols, Graziano Rossi, Eusebio Sanchez, David Schlegel, Michael Schubnell, Hee-Jong Seo, Joseph Harry Silber, David Sprayberry, Gregory Tarlé, Benjamin Alan Weaver, Rongpu Zhou, Hu Zou Link to data is included, 19 pages 9 figures 4 Tables Astrophysics of Galaxies (astro-ph.GA) Quasars acting as strong gravitational lenses offer a rare opportunity to probe the redshift evolution of scaling relations between supermassive black holes and their host galaxies, particularly the $M_{\\mathrm{BH}}$--$M_{\\mathrm{host}}$ relation. Using these powerful probes, the mass of the host galaxy can be precisely inferred from the Einstein radius $\\theta_{\\mathrm{E}}$. Using 812{,}118 quasars from DESI DR1 ($0.03 \\leq z \\leq 1.8$), we searched for quasars lensing higher-redshift galaxies by identifying background emission-line features in their spectra. To detect these rare systems, we trained a convolutional neural network (CNN) on mock lenses constructed from real DESI spectra of quasars and emission-line galaxies (ELGs), achieving a high classification performance (AUC = 0.99). We also trained a regression network to estimate the redshift of the background ELG. Applying this pipeline, we identified seven high-quality (Grade~A) lens candidates, each exhibiting a strong [O\\,\\textsc{ii}] doublet at a higher redshift than the foreground quasar; four candidates additionally show H$\\beta$ and [O\\,\\textsc{iii}] emission. These results significantly expand the sample of quasar lens candidates beyond the twelve identified and three confirmed in previous work, and demonstrate the potential for scalable, data-driven discovery of quasars as strong lenses in upcoming spectroscopic surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.02009.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02031",
      "title": "Shaping the Milky Way. II. The dark matter halo's response to the LMC's passage in a cosmological context",
      "authors": [
        "Elise Darragh-Ford",
        "Nicolas Garavito-Camargo",
        "Arpit Arora",
        "Risa H. Wechsler",
        "Phil Mansfield",
        "Gurtina Besla",
        "Michael S. Petersen",
        "Martin D. Weinberg",
        "Silvio Varela-Lavin",
        "Deveshi Buch",
        "Emily C. Cunningham",
        "Kathryne J. Daniel",
        "Facundo A. Gomez",
        "Kathryn V. Johnston",
        "Chervin F. P. Laporte",
        "Yao-Yuan Mao",
        "Ethan O. Nadler",
        "Robyn Sanderson"
      ],
      "abstract": "Shaping the Milky Way. II. The dark matter halo's response to the LMC's passage in a cosmological context Elise Darragh-Ford, Nicolas Garavito-Camargo, Arpit Arora, Risa H. Wechsler, Phil Mansfield, Gurtina Besla, Michael S. Petersen, Martin D. Weinberg, Silvio Varela-Lavin, Deveshi Buch, Emily C. Cunningham, Kathryne J. Daniel, Facundo A. Gomez, Kathryn V. Johnston, Chervin F. P. Laporte, Yao-Yuan Mao, Ethan O. Nadler, Robyn Sanderson 18 pages of main text with 12 figures and 6 pages of appendix with 3 Figures and references. Comments are welcome. Submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) The distribution of dark matter in the Milky Way (MW) is expected to exhibit a large-scale dynamical response to the recent infall of the LMC. This event produces a dynamical friction wake and shifts the MW's halo density center. The structure of this response encodes information about the LMC- MW mass ratio, the LMC's orbit, the MW halo's pre-infall structure and could provide constraints on dark matter physics. To extract this information, a method to separate these effects and recover the initial shape of the MW's halo is required. Here, we use basis function expansions to analyze the halo response in eighteen simulations of MW-LMC-like interactions from the MWest cosmological, dark-matter-only zoom-in simulations. The results show that mergers similar to the LMC consistently generate a significant dipole and a secondary quadrupole response in the halo. The dipole arises from the host density center displacement and halo distortions, and its amplitude scales as the square of the MW-LMC mass ratio, peaking 0.2-0.7 Gyr after the LMC's pericenter. The quadrupole's strength depends primarily on the original axis ratios of the host halo, though contributions from the dynamical friction wake cause it to peak less than 0.3 Gyr before pericenter. Future measurements of both the dipole and quadrupole imprints of the LMC's passage in the density of the MW's stellar halo should be able to disentangle these effects and provide insight into the initial structure of the MW's halo, the MW's response, and the mass of the LMC.",
      "pdf_url": "https://arxiv.org/pdf/2511.02031.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02045",
      "title": "The origin of ionized gas in retired galaxies: dynamical clues",
      "authors": [
        "Greique A. Valk",
        "Sandro B. Rembold"
      ],
      "abstract": "The origin of ionized gas in retired galaxies: dynamical clues Greique A. Valk, Sandro B. Rembold 23 pages, 15 figures. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We investigate the kinematical and dynamical properties of quiescent cluster galaxies with weak emission lines, referred to as retired (R), and those without emission lines, dubbed passive (P), to better understand the origin of the ionized gas in R galaxies and what drives the differences between these populations. We stack 2,907 P and 2,387 R galaxies from 336 relaxed galaxy clusters to build an ensemble cluster and estimate their projected number density and velocity dispersion profiles, $\\sigma_P(R)$, as well as their projected phase-space (PPS) distributions. Additionally, we apply the MAMPOSSt code and the Jeans equation inversion technique to constrain the velocity anisotropy profiles, $\\beta(r)$. We find that P galaxies tend to reside closer to the cluster centres than R galaxies, and that both populations exhibit similar $\\sigma_P(R)$ and $\\beta(r)$ profiles, regardless of their stellar mass, stellar age, or morphology. The only exception is elliptical R galaxies, which are marginally more concentrated and display more radial orbits than their P counterparts. PPS analyses indicate that R galaxies were, on average, accreted later than P galaxies, except for those with $D_n4000 > 1.86$ or elliptical morphology. These results suggest that R galaxies, though accreted more recently, have already had enough time to evolve towards a dynamical state more consistent with that of the dynamically relaxed P population. Finally, our findings suggest that the ionized gas in early-type R galaxies likely originates from accretion from their own hot gas haloes, and that its removal triggers the transition toward the P phase over relatively long timescales.",
      "pdf_url": "https://arxiv.org/pdf/2511.02045.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02054",
      "title": "Bars in low-density environments rotate faster than bars in dense regions",
      "authors": [
        "Natalia Puczek , Tobias Géron , Rebecca J. Smethurst , Chris J. Lintott Oxford Astrophysics, Department of Physics, University of Oxford, Denys Wilkinson Building, Oxford, UK, Dunlap Institute for Astronomy and Astrophysics, University of Toronto, Toronto, Canada)"
      ],
      "abstract": "Bars in low-density environments rotate faster than bars in dense regions Natalia Puczek (1), Tobias Géron (1 and 2), Rebecca J. Smethurst (1), Chris J. Lintott (1) ((1) Oxford Astrophysics, Department of Physics, University of Oxford, Denys Wilkinson Building, Oxford, UK, (2) Dunlap Institute for Astronomy and Astrophysics, University of Toronto, Toronto, Canada) Astrophysics of Galaxies (astro-ph.GA) Does the environment of a galaxy directly influence the kinematics of its bar? We present observational evidence that bars in high-density environments exhibit significantly slower rotation rates than bars in low-density environments. Galactic bars are central, extended structures composed of stars, dust and gas, present in approximately 30 to 70 per cent of luminous spiral galaxies in the local Universe. Recent simulation studies have suggested that the environment can influence the bar rotation rate, $R$, which is used to classify bars as either fast ($1\\leq R \\leq1.4$) or slow ($R \\gt 1.4$). We use estimates of $R$ obtained with the Tremaine-Weinberg method applied to Integral Field Unit spectroscopy from MaNGA and CALIFA. After cross-matching these with the projected neighbour density, $\\log\\Sigma$, we retain 286 galaxies. The analysis reveals that bars in high-density environments are significantly slower (median $R = 1.67^{+0.72}_{-0.42}$) compared to bars in low-density environments (median $R = 1.37^{+0.51}_{-0.34}$); Anderson-Darling $\\textit{p}$-value of $p_{\\mathrm{AD}}= 0.002$ ($3.1\\,\\sigma$). This study marks the first empirical test of the hypothesis that fast bars are formed by global instabilities in isolated galaxies, while slow bars are triggered by tidal interactions in dense environments, in agreement with predictions from numerous $\\textit{N}$-body simulations. Future studies would benefit from a larger sample of galaxies with reliable Integral Field Unit data, required to measure bar rotation rates. Specifically, more data are necessary to study the environmental influence on bar formation within dense settings (i.e. groups, clusters and filaments).",
      "pdf_url": "https://arxiv.org/pdf/2511.02054.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02061",
      "title": "GMCs and Star Formation in the Galaxy: I. Effects of an HII region on a GMC",
      "authors": [
        "David Hollenbach",
        "Antonio Parravano",
        "Christopher McKee"
      ],
      "abstract": "GMCs and Star Formation in the Galaxy: I. Effects of an HII region on a GMC David Hollenbach, Antonio Parravano, Christopher McKee Astrophysics of Galaxies (astro-ph.GA) The destruction of Giant Molecular Clouds is a key component in galaxy evolution. We theoretically model the destruction of GMCs by HII regions, which evaporate ionized gas and eject neutral gas during their expansion. HII regions follow one of three tracks, depending on the EUV luminosity, $S$, of the ionizing OB association: the expansion can stall inside the cloud; it can break out, forming a blister (champagne) flow; or, for $S>S_{\\rm com}$, it can result in the formation of a cometary cloud. We present results for the accumulated mass loss, $M_{\\rm loss}(t)$, and the final mass loss, $M_{{\\rm loss},f}$, by evaporation and ejection for a range of cloud masses ($10^4<M<10^{7}$ M$_\\odot$), cloud surface densities ($50<\\Sigma<1000$ M$_\\odot$ pc$^{-2}$), OB association luminosities ($10^{44}<S<10^{52}$ s$^{-1}$), and off-center position of the association. We do not consider starbursts; our neglect of radiation pressure restricts our treatment to $S<10^{52} [(M/10^6$ M$_\\odot)^{0.3})/(\\Sigma /100$ M$_\\odot$ pc$^{-2}$)] s$^{-1}$, and our neglect of gravity restricts $(M/10^6$ M$_\\odot$)($\\Sigma/ 100$ M$_\\odot$ pc$^{-2}) < 10$. We find that $M_{{\\rm loss},f}$ for the range $0.1 < M_{{\\rm loss},f}/M < 0.7$ , is proportional to $S^p$, where $p\\sim 0.45-0.75$ depends on $M$, $\\Sigma$, and association position. We find analytic fits to $S_{\\rm com}$ as a function of $\\Sigma$, $M$, and association position. $S> S_{\\rm com}$ associations destroy at least 70% of the initial cloud. We find a critical cloud mass $M_{\\rm survive}$ above which clouds never become cometary and lose $<$ 70% of their mass via a single association. Low mass clouds mostly lose mass via ejection of neutral gas.",
      "pdf_url": "https://arxiv.org/pdf/2511.02061.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02204",
      "title": "Characterizing the astrometric quality of AGNs in Gaia-CRF3",
      "authors": [
        "Shilong Liao",
        "Qiqi Wu",
        "Ye Ding",
        "Qi Xu",
        "Zhaoxiang Qi"
      ],
      "abstract": "Characterizing the astrometric quality of AGNs in Gaia-CRF3 Shilong Liao, Qiqi Wu, Ye Ding, Qi Xu, Zhaoxiang Qi 6 pages, 3 figures. To be published at PROCEEDINGS of the IAUs 401 \"Advancing Reference Systems, Ephemeris, and Standards\" held in 04 to 09 August, 2025 at La Plata, Buenos Aires, Argentina Astrophysics of Galaxies (astro-ph.GA) Active Galactic Nuclei (AGNs), owing to their great distances and compact sizes, serve as fundamental anchors for defining the celestial reference frame. With about 1.9 million AGNs observed in Gaia DR3 at optical precision comparable to radio wavelengths, Gaia provides a solid foundation for constructing the next-generation, kinematically non-rotating optical reference frame. Accurate assessment of systematic residuals in AGN astrometry is therefore crucial. In this talk, we analysed the parallaxes and proper motions of Gaia DR3 AGNs to characterize systematic errors and their correlations with various physical and observational properties. A subset of Gaia-CRF3 AGNs exhibits significant astrometric offsets, mainly arising from dual or lensed quasars whose structural variations induce photocenter jitter, mimicking parallax and proper motion. Such sources must be carefully excluded from reference frame construction. To this end, we introduce an astrometric quality index for each source to quantify its astrometric reliability. The results reveal a strong correlation between lower quality index values and increasing errors in position, proper motion, and parallax, demonstrating that the proposed index provides an effective metric for selecting high-fidelity AGNs as primary reference sources.",
      "pdf_url": "https://arxiv.org/pdf/2511.02204.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02231",
      "title": "Stellar Birth Radii in the LMC: Insights into Chemodynamics, Radial Migration, and Star Formation Across the Disk",
      "authors": [
        "Yuxi Lu",
        "Bethany Garver",
        "David L. Nidever",
        "Joshua T. Povick",
        "Nicolás Garavito-Camargo",
        "Maria-Rosa L. Cioni",
        "Danny Horta"
      ],
      "abstract": "Stellar Birth Radii in the LMC: Insights into Chemodynamics, Radial Migration, and Star Formation Across the Disk Yuxi Lu, Bethany Garver, David L. Nidever, Joshua T. Povick, Nicolás Garavito-Camargo, Maria-Rosa L. Cioni, Danny Horta Astrophysics of Galaxies (astro-ph.GA) The LMC and SMC are interacting dwarf galaxies that offer a valuable testbed for studying the effects of galactic mergers. We investigate the chemodynamic history of the LMC in the context of its interaction with the SMC by inferring stellar birth radii, first validated on a hydrodynamical simulation tailored to reproduce their interaction history. Using inferred birth radii and stellar ages, we identify signatures of dynamical and chemical evolution across the LMC disk. We find that the LMC's metallicity gradient steepened around 5, 3, and 1 Gyr ago, coinciding with enhanced star formation (SF) episodes. These events exhibit distinct spatial patterns -- initially concentrated in the inner disk at 5 Gyr, expanding outward by 3 Gyr, and becoming widespread with renewed central activity at 1 Gyr -- likely reflecting changes in spin alignment between the interacting disks if the enhancements of SF tracks the pericenter passages of the SMC to the LMC. The inferred radial migration strength of the LMC shows notable enhancements at 0.5, 2, and 5 Gyr. The most $\\alpha$-enriched stars form 2-3 Gyr ago at birth radii of 2-4 kpc, the only epoch when star formation is broadly distributed across the disk. Finally, unlike the Milky Way, the LMC lacks a clear [$\\alpha$/M]-[Fe/H] bimodality. This is likely due to its more centrally concentrated star formation during these periods, compared to the MW's more extended outer-disk star formation enhancements. These findings place strong constraints on the LMC's assembly history and its interaction with the SMC.",
      "pdf_url": "https://arxiv.org/pdf/2511.02231.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02334",
      "title": "Hierarchical Structure and Self-gravity in the Rosette Molecular Cloud",
      "authors": [
        "Suziye He",
        "Yuehui Ma",
        "Hongchi Wang",
        "Renjie Shen",
        "Miaomiao Zhang",
        "Chong Li",
        "Zhenyi Yue",
        "Xiangyu Ou",
        "Xuepeng Chen"
      ],
      "abstract": "Hierarchical Structure and Self-gravity in the Rosette Molecular Cloud Suziye He, Yuehui Ma, Hongchi Wang, Renjie Shen, Miaomiao Zhang, Chong Li, Zhenyi Yue, Xiangyu Ou, Xuepeng Chen 23 pages, 15 figures. Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We analyze the hierarchical structure in the Rosette Molecular Cloud (RMC) using $^{13}$CO J=1-0 data from the Milky Way Imaging Scroll Painting (MWISP) survey with a non-binary Dendrogram algorithm that allows multiple branches to emerge from parent structures. A total of 588 substructures are identified, including 458 leaves and 130 branches. The physical parameters of the substructures, including peak brightness temperature ($T_{\\rm peak}$), brightness temperature difference ($T_{\\rm diff}$), radius ($R$), mass ($M$), velocity dispersion ($\\sigma_v$), and surface density ($\\Sigma$), are characterized. The $T_{\\rm peak}$ and $T_{\\rm diff}$ distributions follow exponential functions with characteristic values above $5\\sigma_{\\rm RMS}$. The statistical properties and scaling relations, i.e., $\\sigma_v$-$R$, $M$-$R$, and $\\sigma_v$-$R\\Sigma$ relations are in general consistent with those from traditional segmentation methods. The mass and radius follow power-law distributions with exponents of 2.2-2.5, with slightly flatter slopes for substructures inside the HII region. The velocity dispersion scales weakly with radius ($\\sigma_v \\propto R^{0.45\\pm 0.03}$, $r = 0.58$), but shows a tighter correlation with the product of surface density and size ($\\sigma_v \\propto (\\Sigma R)^{0.29\\pm 0.01}$, $r = 0.73$). Self-gravitating substructures are found across scales from $\\sim$0.2 to 10 pc, and nearly all structures with peak brightness above 4 K are gravitationally bound ($\\alpha_{\\rm vir} < 2$). The fraction of bound structures increases with mass, size, and surface density, supporting the scenario of global hierarchical collapse (GHC) for the evolution of molecular clouds, in which molecular clouds and their substructures are undergoing multiscale collapse.",
      "pdf_url": "https://arxiv.org/pdf/2511.02334.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02547",
      "title": "Anisotropy ansatz for the Jeans equations: oblate galaxies",
      "authors": [
        "Leonardo De Deo , Luca Ciotti , Silvia Pellegrini Department of Physics and Astronomy, University of Bologna, INAF-Osservatorio di Astrofisica e Scienza dello Spazio di Bologna)"
      ],
      "abstract": "Anisotropy ansatz for the Jeans equations: oblate galaxies Leonardo De Deo (1,2), Luca Ciotti (1), Silvia Pellegrini (1,2) ((1) Department of Physics and Astronomy, University of Bologna, (2) INAF-Osservatorio di Astrofisica e Scienza dello Spazio di Bologna) 15 pages, 8 figures. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) In the solution of the Jeans equations for axisymmetric galaxy models the ``$b$-ansatz\" is often adopted to prescribe the relation between the vertical and radial components of the velocity dispersion tensor, and close the equations. However, $b$ affects the resulting azimuthal velocity fields quite indirectly, so that the analysis of the model kinematics is usually performed after numerically solving the Jeans equations, a time consuming approach. In a previous work we presented a general method to determine the main properties of the kinematical fields resulting in the $b$-ansatz framework before solving the Jeans equations; results were illustrated by means of disk galaxy models. In this paper we focus more specifically on realistic ellipsoidal galaxy models. It is found that how and where $b$ affects the galaxy kinematical fields is mainly dependent on the flattening of the stellar density distribution, moderately on the presence of a Dark Matter halo, and much less on the specific galaxy density profile. The main trends revealed by the numerical exploration, in particular the fact that more flattened systems can support larger $b$-anisotropy, are explained with the aid of simple ellipsoidal galaxy models, for which most of the analysis can be conducted analytically. The obtained results can be adopted as guidelines for model building and in the interpretation of observational data.",
      "pdf_url": "https://arxiv.org/pdf/2511.02547.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02665",
      "title": "Benchmarking differential reddening in front of globular clusters",
      "authors": [
        "Csilla Kalup",
        "László Molnár"
      ],
      "abstract": "Benchmarking differential reddening in front of globular clusters Csilla Kalup, László Molnár Accepted for publication in The Astronomical Journal Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Interstellar extinction is a major obstacle in determining accurate stellar parameters from photometry near the Galactic disk. It is especially true for globular clusters at low galactic latitudes, which suffer from significant amounts of, and spatially variable reddening. Although differential reddening maps are available for tens of clusters, establishing and validating the absolute zero point of relative maps is a challenge. In this study, we present a new approach to determine and evaluate absolute reddening zero-points for Galactic globular clusters by combining three-dimensional reddening maps with Gaia DR3 RR Lyrae data. As a first case study, we investigate the low-latitude globular cluster M9. We compare the Gaia photometry and color data of the cluster member RR Lyrae stars to field RR Lyrae stars with accurate parallaxes and whose photometric metallicities match that of M9, as well as to theoretical models. We calculate the dereddened Gaia colors for the M9 stars based on three zero points. We confirm that the original SFD map appears to be overcorrecting the reddening for at least some RR Lyrae stars, albeit not excessively. In contrast, the 3D Bayestar map and the recalibrated version of the SFD map provide physically plausible reddenings, which we accept as lower and upper limits for M9, respectively. Our results provide a physically motivated reddening range for M9, and outline a methodology that can be directly extended to other globular clusters that are accessible to the Gaia mission, and to other multicolor sky surveys, such as the Rubin Observatory.",
      "pdf_url": "https://arxiv.org/pdf/2511.02665.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02715",
      "title": "The effect of mass and morphology on the mass assembly of galaxies",
      "authors": [
        "A. Camps-Fariña",
        "R. M. Mérida",
        "P. Sánchez Blázquez",
        "S. F. Sánchez"
      ],
      "abstract": "The effect of mass and morphology on the mass assembly of galaxies A. Camps-Fariña, R. M. Mérida, P. Sánchez Blázquez, S. F. Sánchez Astrophysics of Galaxies (astro-ph.GA) The pace at which galaxies grew into their current stellar masses and how this growth is regulated is still not fully understood, nor is the role that morphology plays in this process. We applied full spectral fitting techniques with pyPipe3D to the MaNGA sample to obtain its star formation and stellar mass histories and used these to investigate the mass assembly of galaxies by measuring how their specific star formation correlates to their stellar mass at different look-back times. We find that the correlation between these two parameters was shallower in the past. Galaxies used to have similar mass doubling times and the current negative correlation between the specific star formation and M* is primarily due to more massive galaxies 'dropping' off the main sequence earlier than less massive ones. Additionally, selecting the galaxies into bins based on their present-day morphology shows a segregation in specific star formation rate (sSFR) that is maintained even at high look-back times, showing that the factors that determine which morphology a galaxy ends up in are in place at very early times. Similarly, selecting them based on their current star formation status shows that, on average, currently retired galaxies used to have slightly a higher sSFR before the drop-off, whereas galaxies that have continued to form stars until today had a lower sSFR initially. We compare our results to a set of cosmic surveys, finding partial agreement in our results with several of them, though with significant offsets in redshift. Finally, we discuss how our results fit with certain theoretical models on galaxy evolution as well as cosmological simulations.",
      "pdf_url": "https://arxiv.org/pdf/2511.02715.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02796",
      "title": "Solving the cooling flow problem with combined jet-wind AGN feedback",
      "authors": [
        "Aoyun He",
        "Minhang Guo",
        "Feng Yuan",
        "Suoqing Ji",
        "Yuan Li",
        "Haiguang Xu",
        "Ming Sun",
        "Haojie Xia",
        "Yuanyuan Zhao"
      ],
      "abstract": "Solving the cooling flow problem with combined jet-wind AGN feedback Aoyun He, Minhang Guo, Feng Yuan, Suoqing Ji, Yuan Li, Haiguang Xu, Ming Sun, Haojie Xia, Yuanyuan Zhao Astrophysics of Galaxies (astro-ph.GA) Active galactic nucleus (AGN) feedback is widely viewed as the most promising solution to the long-standing cooling flow problem in galaxy clusters, yet previous models prescribe jet properties inconsistent with accretion physics. We perform high-resolution hydrodynamic simulations of a Perseus-like cluster using the MACER framework, incorporating both jets and winds constrained by general relativistic magnetohydrodynamic simulations and observations. The combined feedback reproduces key observables--including cold gas mass, star formation rate, thermodynamic radial profiles, and black hole growth--while jet-only or wind-only models fail. The success arises from turbulence driven by jet-wind shear that enhances kinetic-to-thermal energy conversion, boosting heating efficiency by factors of three and six relative to wind-only and jet-only cases, respectively, yielding a self-consistent solution to cluster cooling flows.",
      "pdf_url": "https://arxiv.org/pdf/2511.02796.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02828",
      "title": "Searching Within Galaxies for the Earliest Signs of Quenching With Spatially Resolved Star Formation Histories in UVCANDELS",
      "authors": [
        "Charlotte Olsen",
        "Eric Gawiser",
        "Charlotte Welker",
        "Harry Teplitz",
        "Kartheik Iyer",
        "Xin Wang",
        "Marc Rafelski",
        "Rogier A. Windhorst",
        "Anton Koekemoer",
        "Anahita Alavi",
        "Ben Sunnquist",
        "Norman Grogin",
        "Yicheng Guo",
        "Christopher J. Conselice",
        "L. Y. Aaron Yung",
        "Kalina Nedkova",
        "Bahram Mobasher",
        "Ray A. Lucas",
        "Vihang Mehta",
        "Y. Sophia Dai",
        "Jonathan P. Gardner"
      ],
      "abstract": "Searching Within Galaxies for the Earliest Signs of Quenching With Spatially Resolved Star Formation Histories in UVCANDELS Charlotte Olsen, Eric Gawiser, Charlotte Welker, Harry Teplitz, Kartheik Iyer, Xin Wang, Marc Rafelski, Rogier A. Windhorst, Anton Koekemoer, Anahita Alavi, Ben Sunnquist, Norman Grogin, Yicheng Guo, Christopher J. Conselice, L. Y. Aaron Yung, Kalina Nedkova, Bahram Mobasher, Ray A. Lucas, Vihang Mehta, Y. Sophia Dai, Jonathan P. Gardner 31 pages, 28 figures. Submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Understanding the complicated processes that regulate star formation and cause a galaxy to become quiescent is key to our comprehension of galaxy evolution. We used nine well resolved star-forming z<1 galaxies from the UVCANDELS survey, where a total of 10 HST bands including UV follow up in UVIS/F275W allow us to reconstruct the star formation histories (SFHs) of regions across each galaxy. This approach provides a powerful tool to explore the spatio-temporal connection between star formation and galaxy evolution. The spatial and temporal profiles of stellar mass and star formation rate surface density were obtained from the SFHs of these regions. We measure scaling relations and projected radial profiles of regions within each galaxy at the time of observation and at 1 Gyr lookback time, noting possible trends in the evolution. By comparing the change in star formation over time we can infer the timing and location of star formation and see early signs of star formation shut off before quenching occurs. We compared the star formation rate density -- stellar mass density scaling relations for individual galaxies as they evolve from 1 Gyr lookback time. The correlation lines pivot around a log-stellar mass surface density of 7.25 [$M_\\odot$ $kpc^{-2}$] may be evidence of a self-regulating process on these scales. Radial profiles of galaxy Log sSFR show an overall decrease over 1 Gyr, but five galaxies show a greater change in Log sSFR at the outskirts than the center indicating a possible early onset of quenching in these galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2511.02828.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01957",
      "title": "The interstellar flux gap: From dust to kilometer-scale objects",
      "authors": [
        "Eloy Peña-Asensio",
        "Darryl Z. Seligman"
      ],
      "abstract": "The interstellar flux gap: From dust to kilometer-scale objects Eloy Peña-Asensio, Darryl Z. Seligman Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) Context. Three kilometer-sized interstellar objects (ISOs) have been detected transiting the Solar System, and spacecraft have directly measured micrometer-scale interstellar dust (ISD). Yet no intermediate-size interstellar meteoroids have been identified in current meteor surveys. Aims. We test whether a power-law flux extrapolation connecting spacecraft ISD and kilometer-scale ISOs is consistent with meteor surveys, and we quantify the expected interstellar impacting flux based on various observational reports. Methods. We compiled differential fluxes and limits from spacecraft ISD, radar and optical meteor surveys, and theoretical estimates. We evaluated the power-law size-frequency fits, computed the 3I-like flux, and compared measured fluxes to predictions. Results. The spacecraft-measured dust flux exceeds extrapolations constrained by meteor surveys and kilometer-scale ISOs by $\\sim$2-7 orders of magnitude. An $r^{-3.0}$ fit combining spacecraft ISD detections with kilometer-scale ISOs overpredicts the number of meteors with hyperbolic orbits, whereas slopes of $r^{-2.7}$-$r^{-2.3}$ (derived from radar and optical meteor upper limits, respectively) instead yield interplanetary-to-interstellar flux ratios of $10^{3}$-$10^{6}$. Conclusions. A simple power-law from ISD to ISOs is inconsistent with meteor survey constraints and yields unrealistic predictions for interstellar meteoroids. The data reveal a gap between submicron dust entrained in the Local Interstellar Cloud (LIC) and macroscopic bodies ejected from planetary systems. This gap may reflect distinct origins and destruction-transport processes rather than a continuous size-frequency distribution. This would imply either the dominance of a small-particle LIC component or the need to reassess spacecraft dust fluxes.",
      "pdf_url": "https://arxiv.org/pdf/2511.01957.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02024",
      "title": "Investigating the Role of Protostellar Variability with PRIMA Using Monte Carlo Simulations",
      "authors": [
        "Rachel R. Lee",
        "Cara Battersby",
        "Aleksandra Kuznetsova",
        "Doug Johnstone",
        "William J. Fischer",
        "Henrik Beuther",
        "Yasuhiro Hasegawa",
        "Marta Sewilo"
      ],
      "abstract": "Investigating the Role of Protostellar Variability with PRIMA Using Monte Carlo Simulations Rachel R. Lee, Cara Battersby, Aleksandra Kuznetsova, Doug Johnstone, William J. Fischer, Henrik Beuther, Yasuhiro Hasegawa, Marta Sewilo Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Evidence suggests that protostellar outbursts likely play a critical role in the stellar mass assembly process, but the extent of this contribution is not well understood. Using the proposed observing program of PRIMA, a concept far-IR observatory (PRIMA GO Case #43 in Moullet et al. 2023), we examine the probe's ability to unambiguously determine whether or not variable accretion events dominate the stellar mass assembly process ($M_{\\rm burst}\\geq0.5M_{*}$). To do this, we construct multiple protostellar ensembles using Herschel 70$\\mu$m flux data and evolve them using a toy Monte Carlo simulation through steady-state and high magnitude accretion events. Ensembles are observed at various epochs in the evolution process to conclude how many large amplitude outbursts are observationally recoverable during the proposed program. Based on our synthetic observations and our simulation specifications, we determine that observing a protostellar ensemble of at least 2000 protostars using PRIMA's proposed program is sufficient for determining the importance of protostellar outbursts in the stellar mass assembly process.",
      "pdf_url": "https://arxiv.org/pdf/2511.02024.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02476",
      "title": "Nominal thresholds for good astrometric fits, and prospects for binary detectability, for the full extended \\textit{Gaia} mission",
      "authors": [
        "F. Guerriero",
        "Z. Penoyre",
        "A. G. A. Brown"
      ],
      "abstract": "Nominal thresholds for good astrometric fits, and prospects for binary detectability, for the full extended \\textit{Gaia} mission F. Guerriero, Z. Penoyre, A. G. A. Brown Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The full extended Gaia mission spans slightly over 10 years of data, whilst the current data releases represent only a fraction of that timescale (DR3, 34 months). The longer baseline improves the quality of astrometric fits, lowering the noise floor and making consistently bad fits (for example, due to binarity) more apparent. In this paper, we use simulated binaries from the Gaia Universe Model to examine the long-term astrometric behaviour of single stars and stellar binaries. We calculate nominal upper limits on the spread of goodness of astrometric fits for well-behaved single stars. Specifically, for the RUWE parameter, for upcoming DR4 ($\\rm RUWE_{lim}=1.15$) and DR5 ($\\rm RUWE_{lim}=1.11$), using the full mission nominal scanning law. These can be used to identify poor astrometric fits, and in particular can flag potential binary systems. We show the increase in the number and type of binaries detectable through RUWE. With our updated RUWE thresholds, the number of detectable low-period binaries increases by 5-10% with each subsequent data release, suggesting detections may be possible for orbital periods down to days. The number of detectable long-period systems increases by 10-20%, with periods up to 100 years, causing significant deviations in low moderate-eccentricity binaries. Very eccentric systems with much longer periods (thousands of years) can still be detected if they pass through periapse during the observing window. Finally, we compare our results to the analytic estimate for the spread in UWE, which we predict from a $\\chi$-distribution moderated by the number of observations. These agree with our inferred population limits but suggest that we may be biased by a small number of poorly sampled systems. In regions of the sky that are more frequently observed, lower limits could be employed, potentially bringing even more binaries above the threshold for detectability.",
      "pdf_url": "https://arxiv.org/pdf/2511.02476.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.04435",
      "title": "1000-10,000 M$_\\odot$ Primordial Stars Created the Nitrogen Excess in GS 3073 at $z = 5.55$",
      "authors": [
        "Devesh Nandal",
        "Daniel J. Whalen",
        "Muhammad A. Latif",
        "Alexander Heger"
      ],
      "abstract": "1000-10,000 M$_\\odot$ Primordial Stars Created the Nitrogen Excess in GS 3073 at $z = 5.55$ Devesh Nandal, Daniel J. Whalen, Muhammad A. Latif, Alexander Heger 13 pages, 8 figures, accepted by ApJL Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The advent of the James Webb Space Telescope has revealed a wealth of new galaxies just a few hundred Myr after the Big Bang. Some of these galaxies exhibit unusual N/O ratios that are difficult to explain with stellar populations today. While Wolf-Rayet stars in multiple-burst populations, very massive or rapidly-rotating primordial stars, general relativistic explosions of metal-enriched supermassive stars, or the precursors of globular clusters can in principle account for the nitrogen excess in the galaxies GN-z11 and CEERS 1019, no known stars or supernovae can explain the far higher N/O ratio of 0.46 in GS 3073 at redshift $z =$ 5.55. Here we show that the extreme nitrogen abundances in GS 3073 can be produced by 1000 - 10,000 M$_{\\odot}$ primordial (Pop III) stars. We find that these are the only candidates that can account for its large N/O ratios and its C/O and Ne/O ratios. GS 3073 is thus the first conclusive evidence in the fossil abundance record of the existence of supermassive Pop III stars at cosmic Dawn.",
      "pdf_url": "https://arxiv.org/pdf/2502.04435.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.15323",
      "title": "Euclid Quick Data Release (Q1). Extending the quest for little red dots to z<4",
      "authors": [
        "Euclid Collaboration: L. Bisigello",
        "G. Rodighiero",
        "S. Fotopoulou",
        "F. Ricci",
        "K. Jahnke",
        "A. Feltre",
        "V. Allevato",
        "F. Shankar",
        "P. Cassata",
        "E. Dalla Bontà",
        "G. Gandolfi",
        "G. Girardi",
        "M. Giulietti",
        "A. Grazian",
        "C. C. Lovell",
        "R. Maiolino",
        "T. Matamoro Zatarain",
        "M. Mezcua",
        "I. Prandoni",
        "D. Roberts",
        "W. Roster",
        "M. Salvato",
        "M. Siudek",
        "F. Tarsitano",
        "Y. Toba",
        "A. Vietri",
        "L. Wang",
        "G. Zamorani",
        "M. Baes",
        "S. Belladitta",
        "A. Nersesian",
        "L. Spinoglio",
        "X. Lopez Lopez",
        "N. Aghanim",
        "B. Altieri",
        "A. Amara",
        "S. Andreon",
        "N. Auricchio",
        "H. Aussel",
        "C. Baccigalupi",
        "M. Baldi",
        "A. Balestra",
        "S. Bardelli",
        "A. Basset",
        "P. Battaglia",
        "R. Bender",
        "A. Biviano",
        "A. Bonchi",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H. M. Courtois",
        "M. Cropper",
        "A. Da Silva",
        "H. Degaudenzi",
        "G. De Lucia",
        "A. M. Di Giorgio",
        "C. Dolding",
        "H. Dole",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "S. Dusini",
        "A. Ealet",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "M. Frailis",
        "E. Franceschi",
        "S. Galeotta",
        "K. George",
        "W. Gillard",
        "B. Gillis",
        "C. Giocoli",
        "P. Gómez-Alvarez",
        "J. Gracia-Carpio",
        "B. R. Granett",
        "F. Grupp",
        "S. Gwyn"
      ],
      "abstract": "Euclid Quick Data Release (Q1). Extending the quest for little red dots to z<4 Euclid Collaboration: L. Bisigello, G. Rodighiero, S. Fotopoulou, F. Ricci, K. Jahnke, A. Feltre, V. Allevato, F. Shankar, P. Cassata, E. Dalla Bontà, G. Gandolfi, G. Girardi, M. Giulietti, A. Grazian, C. C. Lovell, R. Maiolino, T. Matamoro Zatarain, M. Mezcua, I. Prandoni, D. Roberts, W. Roster, M. Salvato, M. Siudek, F. Tarsitano, Y. Toba, A. Vietri, L. Wang, G. Zamorani, M. Baes, S. Belladitta, A. Nersesian, L. Spinoglio, X. Lopez Lopez, N. Aghanim, B. Altieri, A. Amara, S. Andreon, N. Auricchio, H. Aussel, C. Baccigalupi, M. Baldi, A. Balestra, S. Bardelli, A. Basset, P. Battaglia, R. Bender, A. Biviano, A. Bonchi, E. Branchini, M. Brescia, J. Brinchmann, S. Camera, G. Cañas-Herrera, V. Capobianco, C. Carbone, J. Carretero, S. Casas, M. Castellano, G. Castignani, S. Cavuoti, K. C. Chambers, A. Cimatti, C. Colodro-Conde, G. Congedo, C. J. Conselice, L. Conversi, Y. Copin, F. Courbin, H. M. Courtois, M. Cropper, A. Da Silva, H. Degaudenzi, G. De Lucia, A. M. Di Giorgio, C. Dolding, H. Dole, F. Dubath, C. A. J. Duncan, X. Dupac, S. Dusini, A. Ealet, S. Escoffier, M. Farina, R. Farinelli, F. Faustini, S. Ferriol, F. Finelli, M. Frailis, E. Franceschi, S. Galeotta, K. George, W. Gillard, B. Gillis, C. Giocoli, P. Gómez-Alvarez, J. Gracia-Carpio, B. R. Granett, F. Grupp, S. Gwyn Paper accepted as part of the A&A Special Issue `Euclid Quick Data Release (Q1)', 21 pages, 11 figures, 8 tables Astrophysics of Galaxies (astro-ph.GA) Recent James Webb Space Telescope (JWST) observations have revealed a population of sources with a compact morphology and a characteristic `v-shaped' continuum, namely blue at rest-frame $\\lambda<4000$A and red at longer wavelengths. The nature of these sources, called `little red dots' (LRDs), is still debated, as it is unclear if they host active galactic nuclei (AGN) and their number seems to drastically drop at z<4. We take advantage of the $63 °^2$ covered by the quick Euclid Quick Data Release (Q1) to extend the search for LRDs to brighter magnitudes and to lower redshifts than what has been possible with JWST. The selection is performed by fitting the available photometric data (Euclid, the Spitzer Infrared Array Camera (IRAC), and ground-based $griz$ data) with two power laws, to retrieve both the rest-frame optical and UV slopes consistently over a large redshift range (i.e, z<7.6). We exclude extended objects and possible line emitters, and perform a careful visual inspection to remove any imaging artefacts. The final selection includes 3341 LRD candidates at z=0.33-3.6, with 29 detected also in IRAC. The resulting rest-frame UV luminosity function, in contrast with previous JWST studies, shows that the number density of LRD candidates increases from high-z down to z=1.5-2.5 and decreases at lower z. However, less evolution is apparent focusing on the subsample of more robust LRD candidates having IRAC detections, which however has low statistics and limited by the IRAC resolution. The comparison with previous quasar (QSO) UV luminosity functions shows that LRDs are not the dominant AGN population at z<4 and $M_{\\rm UV}<-21$. Follow-up studies of these LRD candidates are pivotal to confirm their nature, probe their physical properties and check for their compatibility with JWST sources, given the different spatial resolution and wavelength coverage of Euclid and JWST.",
      "pdf_url": "https://arxiv.org/pdf/2503.15323.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.12397",
      "title": "Unveiling the Ionized and Neutral ISM at z > 10 : The Origin of [O III] /[C II] Ratios from a Sub-parsec Resolution Radiative Transfer Simulation",
      "authors": [
        "Yurina Nakazato",
        "Kazuyuki Sugimura",
        "Akio K. Inoue",
        "Massimo Ricotti"
      ],
      "abstract": "Unveiling the Ionized and Neutral ISM at z > 10 : The Origin of [O III] /[C II] Ratios from a Sub-parsec Resolution Radiative Transfer Simulation Yurina Nakazato, Kazuyuki Sugimura, Akio K. Inoue, Massimo Ricotti 26 pages, 17 figures, submitted to ApJ, after 1st referee comment Astrophysics of Galaxies (astro-ph.GA) Recent multi-wavelength observations by JWST and ALMA are unveiling both ionized and neutral ISM components in high-redshift ($z>6$) galaxies. In this work, we investigate the origin of rest-frame far-infrared [OIII]88 $\\mu$m and [CII]158 $\\mu$m emission by performing zoom-in cosmological simulations of dwarf-galaxy progenitors at $z=9-13$. Our simulations incorporate on-the-fly radiative transfer at sub-pc ($\\sim$ 0.1 pc) resolution, allowing us to resolve the multi-phase ISM. We compute emission lines on a cell-by-cell basis, taking into account local temperature, density, metallicity, radiation field strength, column density, and spectral hardness of radiation bins. We find that [OIII] predominantly arises from centrally located ionizing bubbles with temperatures of $\\sim (1-5)\\times 10^4\\,\\mathrm{K}$ and high ionization parameters of $\\log U_{\\mathrm{ion}} \\simeq -1.5$. In contrast, [CII] is produced in the surrounding dense neutral regions at $\\sim 5\\times 10^3\\,\\mathrm{K}$, which are heated by strong FUV radiation ($G/G_0 \\sim 10^{3-5}$) from the central stellar clusters. This spatial arrangement leads to large local variations in [OIII]/[CII], ranging from $\\sim$ 100 to 0.01. Our galaxy reproduces the global ratio [OIII]/[CII]$\\sim5-30$, consistent with recent ALMA detections at $z>6$ without invoking enhanced O/C abundance ratios. We further derive that [OIII]/[CII] linearly scales with the mass and density ratios of ionized to neutral gas, $M_{\\rm HII}/M_{\\rm HI}$ and $n_{\\rm HII}/n_{\\rm HI}$ and show that the [OIII]/[CII] ratio typically changes from 5.7 to 0.3 from high-z to low-z. For future synergies of JWST and ALMA, we derived $M_{\\rm HII}/M_{\\rm HI}$ for observed $z >6$ galaxies using ${\\rm H}\\beta$ and [CII] and show the validity of our scaling relations.",
      "pdf_url": "https://arxiv.org/pdf/2505.12397.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.04799",
      "title": "The Impact of Cluster Mergers on Galaxy Properties",
      "authors": [
        "Oğuzhan Çakır",
        "Matt S. Owers",
        "Lucas C. Kimmig",
        "Paul Nulsen",
        "Mina Pak",
        "Gabriella Quattropani",
        "Warrick J. Couch"
      ],
      "abstract": "The Impact of Cluster Mergers on Galaxy Properties Oğuzhan Çakır, Matt S. Owers, Lucas C. Kimmig, Paul Nulsen, Mina Pak, Gabriella Quattropani, Warrick J. Couch 21 pages, 10 figures, 3 tables, accepted for publication in PASA Astrophysics of Galaxies (astro-ph.GA) The impact of galaxy cluster mergers on the properties of the resident galaxies remains poorly understood. In this paper, we investigate the effects of merging environments on star formation (SF) activity in nearby clusters ($0.04<z<0.06$) from the SAMI Galaxy Survey - A168, A2399, A3380, and EDCC 0442 - which exhibit different dynamical activity. Using single-fibre spectroscopy from the SAMI Cluster Redshift Survey and Sloan Digital Sky Survey, we trace SF activity across the cluster sample by identifying the star-forming galaxy (SFG) population based on spectral features. We find a mild enhancement in the star-forming galaxy fraction ($f_{SFG}$) in merging clusters, although not statistically significant. The spatial and projected phase-space distributions show that SFGs in merging clusters are well-mixed with the passive population, while galaxy populations exhibit a clear segregation in the relaxed clusters. Analysis of the equivalent width of the $\\rm H\\alpha$ line, as a tracer of recent SF activity, does not reveal strong evidence of triggered SF activity as a function of dynamical state for both the global cluster environment and subsamples of galaxies selected near possible merger features. This suggests that the increase in $f_{SFG}$ is due to the mixing of galaxies in dynamically complex, young merging systems that are still forming, unlike their older, relaxed counterparts that have had longer to quench.",
      "pdf_url": "https://arxiv.org/pdf/2506.04799.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.03744",
      "title": "The Hierarchical Dynamical State of Molecular Gas from 3 to 300 pc in NGC 253",
      "authors": [
        "Elias K. Oakes",
        "Christopher M. Faesi",
        "Erik Rosolowsky",
        "Adam K. Leroy",
        "Simon C. O. Glover",
        "Annie Hughes",
        "Sharon E. Meidt",
        "Eva Schinnerer",
        "Jiayi Sun",
        "Amirnezam Amiri",
        "Ashley T. Barnes",
        "Zein Bazzi",
        "Ivana Bešlić",
        "Guillermo A. Blanc",
        "Charlie Burton",
        "Ryan Chown",
        "Enrico Congiu",
        "Daniel A. Dale",
        "Simthembile Dlamini",
        "Hao He",
        "Eric W. Koch",
        "Fu-Heng Liang",
        "Jérôme Pety",
        "Miguel Querejeta",
        "Sumit K. Sarbadhicary",
        "Sophia K. Stuber",
        "Antonio Usero",
        "Thomas G. Williams"
      ],
      "abstract": "The Hierarchical Dynamical State of Molecular Gas from 3 to 300 pc in NGC 253 Elias K. Oakes, Christopher M. Faesi, Erik Rosolowsky, Adam K. Leroy, Simon C. O. Glover, Annie Hughes, Sharon E. Meidt, Eva Schinnerer, Jiayi Sun, Amirnezam Amiri, Ashley T. Barnes, Zein Bazzi, Ivana Bešlić, Guillermo A. Blanc, Charlie Burton, Ryan Chown, Enrico Congiu, Daniel A. Dale, Simthembile Dlamini, Hao He, Eric W. Koch, Fu-Heng Liang, Jérôme Pety, Miguel Querejeta, Sumit K. Sarbadhicary, Sophia K. Stuber, Antonio Usero, Thomas G. Williams 24 pages, 16 figures, 4 tables; published in the Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) Understanding how the dynamical state of the interstellar medium (ISM) changes across spatial scales can provide important insights into how the gas is organized and ultimately collapses to form stars. To this end, we present ALMA $^{12}\\mathrm{CO}(2-1)$ observations at $7$ pc ($0''.4$) spatial resolution across a $1.4~\\mathrm{kpc}\\times5.6~\\mathrm{kpc}$ ($1'.3\\times1'.3$) region located in the disk of the nearby ($D = 3.5$ Mpc), massive, star-forming galaxy NGC 253. We decompose this emission with a hierarchical, multiscale dendrogram algorithm to identify 2463 structures with deconvolved sizes ranging from $\\sim3$ to $300$ pc, complete to a limiting mass of $10^4~M_\\odot$. By comparing the virial parameter of these structures against physical properties including size, mass, surface density, velocity dispersion, and hierarchical position, we carry out a comprehensive search for a preferred scale at which gravitationally bound structures emerge. Ultimately, we do not identify evidence of an emergent scale for bound objects in our data, nor do we find a significant correlation between the virial parameter and structure sizes. These findings suggest that simple observational estimates of gravitational binding cannot be used to define molecular clouds and emphasize the need for multiscale approaches to characterize the ISM.",
      "pdf_url": "https://arxiv.org/pdf/2507.03744.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.05389",
      "title": "The Potential Impact of Primordial Black Holes on Exoplanet Systems",
      "authors": [
        "Garett Brown",
        "Linda He",
        "James Unwin"
      ],
      "abstract": "The Potential Impact of Primordial Black Holes on Exoplanet Systems Garett Brown, Linda He, James Unwin 13 pages, 11 figures. v2: Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph) The orbits of planetary systems can be deformed from their initial configurations due to close encounters with larger astrophysical bodies. Typical candidates for close encounters are stars and binaries. We explore the prospect that if there is a sizeable population of primordial black holes (PBH) in our galaxy, then these may also impact the orbits of exoplanets. Specifically, in a simplified setting, we study numerically how many planetary systems might have a close encounter with a PBH, and analyze the potential changes to the orbital parameters of systems that undergo PBH flybys.",
      "pdf_url": "https://arxiv.org/pdf/2507.05389.pdf",
      "categories": [
        "astro-ph.GA",
        "hep-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.04410",
      "title": "Bursting at the seams: the star-forming main sequence and its scatter at z=3-9 using NIRCam photometry from JADES",
      "authors": [
        "C. Simmonds",
        "S. Tacchella",
        "W. McClymont",
        "E. Curtis-Lake",
        "F. D'Eugenio",
        "K. Hainline",
        "B.D. Johnson",
        "A. Kravtsov",
        "D. Puskás",
        "B. Robertson",
        "A. Stoffers",
        "C. Willott",
        "W.M. Baker",
        "V.A. Belokurov",
        "R. Bhatawdekar",
        "A.J. Bunker",
        "S. Carniani",
        "J. Chevallard",
        "M. Curti",
        "Q. Duan",
        "J.M. Helton",
        "Z. Ji",
        "T.J. Looser",
        "R. Maiolino",
        "M.V. Maseda",
        "I. Shivaei",
        "C.C. Williams"
      ],
      "abstract": "Bursting at the seams: the star-forming main sequence and its scatter at z=3-9 using NIRCam photometry from JADES C. Simmonds, S. Tacchella, W. McClymont, E. Curtis-Lake, F. D'Eugenio, K. Hainline, B.D. Johnson, A. Kravtsov, D. Puskás, B. Robertson, A. Stoffers, C. Willott, W.M. Baker, V.A. Belokurov, R. Bhatawdekar, A.J. Bunker, S. Carniani, J. Chevallard, M. Curti, Q. Duan, J.M. Helton, Z. Ji, T.J. Looser, R. Maiolino, M.V. Maseda, I. Shivaei, C.C. Williams 18 pages and 15 figures in main paper Astrophysics of Galaxies (astro-ph.GA) We present a comprehensive study of the star-forming main sequence (SFMS) and its scatter at redshifts $3 \\leq z \\leq 9$, using NIRCam photometry from the JADES survey in the GOODS-S and GOODS-N fields. Our analysis is based on a sample of galaxies that is stellar mass complete down to $\\log \\left(M_{\\star}/M_{\\odot}\\right) \\approx 8.1$. The redshift evolution of the SFMS at an averaging timescale of 10 Myr follows a relation, quantified by the specific star-formation rates (sSFR$_{10}$), of $\\mathrm{sSFR}\\propto(1+z)^{\\mu}$ with $\\mu = 2.30^{+0.03}_{-0.01}$, in good agreement with theoretical predictions and the specific mass accretion rate of dark matter halos. We find that the SFMS normalisation varies in a complex way with the SFR averaging timescale, reflecting the combined effects of bursty star formation and rising star formation histories (SFHs). We quantify the scatter of the SFMS, revealing that it decreases with longer SFR averaging timescales, from $\\sigma_{\\rm{int}} \\approx 0.4-0.5~\\mathrm{dex}$ at 10 Myr to $\\sigma_{\\rm{int}} \\approx 0.2~\\mathrm{dex}$ at 100 Myr, indicating that shorter-term fluctuations dominate the scatter, although long-term variations in star formation activity are also present. Our findings suggest that bursty SFHs are more pronounced at lower stellar masses. Furthermore, we explore the implications of our results for the observed over-abundance of UV-bright galaxies at $z > 10$, concluding that additional mechanisms, such as top-heavy initial mass functions, increased star-formation efficiencies, or increased burstiness in star formation are needed to explain these observations. Finally, we emphasize the importance of accurate stellar mass completeness limits when fitting the SFMS, especially for galaxies with bursty SFHs.",
      "pdf_url": "https://arxiv.org/pdf/2508.04410.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23707",
      "title": "The SARAO MeerKAT Galactic Plane Survey compact source catalogue",
      "authors": [
        "Mubela Mutale",
        "Mark A. Thompson",
        "Gwenllian M. Williams",
        "Andrew J. Rigby",
        "Melvin G. Hoare",
        "James S. Urquhart",
        "Michael Bietenholz",
        "Cristobal Bordiu",
        "Fernando Camilo",
        "William D. Cotton",
        "Sharmila Goedhart",
        "Willice O. Obonyo",
        "Simone Riggi",
        "Aiyuan Yang"
      ],
      "abstract": "The SARAO MeerKAT Galactic Plane Survey compact source catalogue Mubela Mutale, Mark A. Thompson, Gwenllian M. Williams, Andrew J. Rigby, Melvin G. Hoare, James S. Urquhart, Michael Bietenholz, Cristobal Bordiu, Fernando Camilo, William D. Cotton, Sharmila Goedhart, Willice O. Obonyo, Simone Riggi, Aiyuan Yang Accepted for publication in MNRAS. The catalogue data release is live and links can be found in the Data Availability Statement in the paper Astrophysics of Galaxies (astro-ph.GA) We present a catalogue of compact sources detected in the SARAO MeerKAT 1.3 GHz Galactic Plane Survey (SMGPS). We extract 510599 compact sources, with areas less than five 8\" beams, from the survey maps covering the regions $252°< l < 358^°$ and $2°< l < 61°$ at $|b| \\leq 1.5^°$, which have an angular resolution of 8\" and a sensitivity of $\\sim$ 10-30 $\\mu$Jy beam$^{-1}$. In this paper, we describe the source identification and characterisation methods, present the quality assurance of the catalogue, explore the nature of the catalogue sources, and present initial science highlights. We limit our catalogue to sources with a signal-to-noise ratio $\\geq 5$, as the catalogue is $\\sim$90 per cent complete, and has a false positive rate of less than 1 per cent at this threshold. The bulk of the catalogue sources are previously unknown to the literature, with the majority of unknown sources at sub-mJy levels. Initial science highlights from the catalogue include the detection of 213 radio quiet WISE HII region candidates, previously undetected in radio continuum studies. We show images that compare the SMGPS compact sources to CORNISH ultracompact HII regions, thus highlighting the sensitivity and unprecedented uv-coverage of the SMGPS, and the potential synergy of the SMGPS with other surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.23707.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24836",
      "title": "A stellar stream around the spiral galaxy Messier 61 in Rubin First Look imaging",
      "authors": [
        "Aaron J. Romanowsky",
        "David Martínez-Delgado",
        "Giuseppe Donatiello",
        "Juan Miró-Carretero",
        "Seppo Laine"
      ],
      "abstract": "A stellar stream around the spiral galaxy Messier 61 in Rubin First Look imaging Aaron J. Romanowsky, David Martínez-Delgado, Giuseppe Donatiello, Juan Miró-Carretero, Seppo Laine published in RNAAS; 3 pages, 1 figure Research Notes of the American Astronomical Society, 9, 292 (2025) Astrophysics of Galaxies (astro-ph.GA) We present the first stellar stream discovered with the Vera C. Rubin Observatory, around spiral galaxy M61 (NGC 4303) in Virgo First Look imaging. The stream is narrow, radially-oriented in projection, and ~50 kpc long. It has g-band surface brightness (SB) mu_g ~ 28 AB mag arcsec^-2, color g-z ~ 1.0, and stellar mass M_* ~ 2x10^8 M_Sun. This dwarf galaxy interaction may have provoked the M61 starburst, and foreshadows the bounty of accretion features expected in the ten-year Rubin Legacy Survey of Space and Time (LSST).",
      "pdf_url": "https://arxiv.org/pdf/2510.24836.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.00240",
      "title": "A Milky Way mass model for isolated simulations",
      "authors": [
        "J A Sellwood"
      ],
      "abstract": "A Milky Way mass model for isolated simulations J A Sellwood (Steward Observatory) 6 pages, 4 figures, added acknowledgments, not published elsewhere. Please cite this posting in any publication that uses the data. The coordinate files may be downloaded from: this https URL Astrophysics of Galaxies (astro-ph.GA) This paper presents an equilibrium model of a Milky Way-like spiral galaxy that supports open, mostly 2- and 3-arm spiral patterns but does not form a bar. It is suggested as a more realistic alternative model to that employed by the Agora collaboration; their model has a much lower disk mass and therefore forms only multi-arm spiral patterns. This improved model should enable simulations that test star-formation and feedback models in a more realistic isolated galaxy. Three versions of the same model having $2.1\\times 10^5$, $2.1\\times 10^6$, and $2.1\\times 10^7$ particles are available for download.",
      "pdf_url": "https://arxiv.org/pdf/2511.00240.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2201.08478",
      "title": "Statistical properties of the gravitational force through ordering statistics",
      "authors": [
        "Constantin Payerne",
        "Vincent Rossetto"
      ],
      "abstract": "Statistical properties of the gravitational force through ordering statistics Constantin Payerne, Vincent Rossetto 16 pages, 1 figure, submitted to The European Physical Journal Plus Statistical Mechanics (cond-mat.stat-mech); Astrophysics of Galaxies (astro-ph.GA) We study the statistical distribution of Newtonian gravitational forces acting on a test particle embedded in an infinite, homogeneous, and uncorrelated random gas of particles. In the limit where both the number of neighboring particles and the confining volume tend to infinity with constant density, this distribution converges to the classic Holtsmark distribution. Our focus here is on the contribution of the nearest particle neighbors to the total Newtonian force. To this end, we derive the joint spatial distribution of the nearest neighbors in arbitrary spatial dimensions, and show that, in three dimensions, the divergence of the variance of the Holtsmark distribution originates entirely from the dominant influence of the nearest neighbor.",
      "pdf_url": "https://arxiv.org/pdf/2201.08478.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.04583",
      "title": "A substellar flyby that shaped the orbits of the giant planets",
      "authors": [
        "Garett Brown",
        "Renu Malhotra",
        "Hanno Rein"
      ],
      "abstract": "A substellar flyby that shaped the orbits of the giant planets Garett Brown, Renu Malhotra, Hanno Rein Published in the Open Journal of Astrophysics, 14 pages, 10 figures Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The modestly eccentric and non-coplanar orbits of the giant planets pose a challenge to solar system formation theories which generally indicate that the giant planets emerged from the protoplanetary disk in nearly perfectly circular and coplanar orbits. We demonstrate that a single encounter with a 2-50 Jupiter-mass object, passing through the solar system at a perihelion distance less than 20 AU and a hyperbolic excess velocity of 1-3 km/s, can excite the giant planets' eccentricities and mutual inclinations to values comparable to those observed. We describe a metric to evaluate how closely a simulated flyby system matches the eccentricity and inclination secular modes of the solar system. We estimate that there is about a 1-in-9000 chance that such a flyby occurs during the solar system's residence in its primordial cluster and produces a dynamical architecture similar to that of the solar system. The scenario of an ancient close encounter with a substellar object offers a plausible explanation for the origin of the moderate eccentricities and inclinations and the secular architecture of the planets. We discuss some broader implications of disruptive flyby encounters on planetary systems in the Galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2412.04583.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.20006",
      "title": "Turbulence and large-scale structures in self-gravitating superfluids",
      "authors": [
        "Sanjay Shukla"
      ],
      "abstract": "Turbulence and large-scale structures in self-gravitating superfluids Sanjay Shukla Published in Physical Review Fluids (2025) Fluid Dynamics (physics.flu-dyn); Astrophysics of Galaxies (astro-ph.GA); Quantum Gases (cond-mat.quant-gas) We study turbulence in self-gravitating superfluids by performing direct numerical simulations of the 3D Gross-Pitaevskii-Poisson (GPP) equation, which is also a model for dark matter haloes around galaxies. In the absence of self-gravity, the spectrally truncated Gross-Pitaevskii (GP) equation shows the emergence of Kolmogorov's $5/3$ scaling in the incompressible kinetic energy spectrum. Introducing self-gravity, we observe the formation of different structures, from sheet-like to spherically collapsed structures, which introduce a minimum in the kinetic energy spectrum that corresponds to the sizes of these structures. The system shows early convergence towards statistically stationary states, which we show by the onset of thermalisation in the compressible kinetic energy spectrum, where $E_{\\rm kin}^c \\propto k^2$. We also show that the formation of such large-scale structures suggests that the particles (bosons) move from small to large scales through an inverse cascade, supporting a mechanism for the formation of large-scale structures, such as dark matter haloes, around our galaxy Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2502.20006.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.02276",
      "title": "VLTI observations of the Orion Belt stars: I. eps Orionis",
      "authors": [
        "Alžběta Oplištilová",
        "Miroslav Brož",
        "Christian A. Hummel",
        "Petr Harmanec",
        "Brad Barlow"
      ],
      "abstract": "VLTI observations of the Orion Belt stars: I. eps Orionis Alžběta Oplištilová, Miroslav Brož, Christian A. Hummel, Petr Harmanec, Brad Barlow Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Massive stars play a decisive role in the evolution of the Universe. In order to constrain their current state and structure, we need sufficiently complex models, constrained by astrometric, interferometric, and spectroscopic observations. However, they are not available for distant stars. Instead, we focused on the nearest massive stars in the Orion Belt. We obtained VLTI interferometric observations of Orion Belt stars and calibrated visibility data from the GRAVITY and PIONIER instruments. Additionally, we obtained spectroscopic data from the CFHT and CTIO observatories. For modelling, we used a modified version of PHOEBE2, extended with new interferometric and spectroscopic modules. To describe non-spherical, rotating, or Roche-like stars, integrals over triangular meshes have to be computed, using extensive grids of synthetic spectra. For fitting, we used the simplex algorithm and chi2 mapping of the parameter space. In this paper, we present single-star models of the B0Ia supergiant eps Ori. Interferometric visibilities indicate that the star is not spherical but rotating close to its critical velocity. The preferred distance, d=(384+-8)pc, corresponds to the median of distances for the Orion OB1b association. We obtained the following parameters: m=(28.4+-2.0)Msol, R=(27.6+-1.5)Rsol, Teff=25000 K, i=45deg, longitude of the ascending node, Omega=300deg, and Prot=4.3+1.0d. This compromise model provides a reasonable fit to wind-free Balmer line profiles, but there is still some tension between interferometric and spectroscopic datasets, corresponding to a faster- vs. slower-rotating star. Our fast-rotating model implies that circumstellar matter should be naturally present, in the form of wind or disk, and contribute to continuum radiation. The fast rotation of eps Ori is compatible with a merger, formed from a multiple system of comparable mass, like del, zet or sig Ori.",
      "pdf_url": "https://arxiv.org/pdf/2507.02276.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01708",
      "title": "High CO/H2 ratios supports an exocometary origin for a CO-rich debris disk",
      "authors": [
        "Kevin D. Smith",
        "Luca Matrà",
        "Ke Zhang",
        "Aoife Brennan",
        "Merdith Hughes",
        "Christine Chen",
        "Isa Rebollido",
        "David Wilner",
        "Aki Roberge",
        "Seth Redfield",
        "Antonio Hales",
        "Karin Öberg"
      ],
      "abstract": "High CO/H2 ratios supports an exocometary origin for a CO-rich debris disk Kevin D. Smith, Luca Matrà, Ke Zhang, Aoife Brennan, Merdith Hughes, Christine Chen, Isa Rebollido, David Wilner, Aki Roberge, Seth Redfield, Antonio Hales, Karin Öberg Submitted to A&A, 15 pages, 13 figures Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) Over 20 exocometary belts host detectable circumstellar gas, mostly in the form of CO. Two competing theories for its origin have emerged, positing the gas to be primordial or secondary. Primordial gas survives from the belt's parent protoplanetary disk and is therefore H$_2$-rich. Secondary gas is outgassed \\textit{in-situ} by exocomets and is relatively H$_2$-poor. Discriminating between these scenarios has not been possible for belts hosting unexpectedly large quantities of CO. We aim to break this gas origin dichotomy \\textit{via} direct measurement of H$_2$ column densities in two edge-on CO-rich exocometary belts around $\\sim$15 Myr-old A-type stars, constraining the $\\frac{\\text{CO}}{\\text{H}_2}$ ratio and CO gas lifetimes. Observing edge-on belts enables rovibrational absorption spectroscopy against the stellar background. We present near-IR CRIRES+ spectra of HD 110058 and HD 131488 which provide the first direct probe of H$_2$ gas in CO-rich exocometary belts. We target the H$_2$ (v=1-0 S(0)) line at 2223.3 nm and and the $^{12}$CO $v=2\\rightarrow0$ rovibrational lines in the range 2333.8-2335.5 nm and derive constraints on column densities along the line-of-sight to the stars. We strongly detect $^{12}$CO but not H$_2$ in the CRIRES+ spectra. This allows us to place $3\\sigma$ lower limits on the $\\frac{\\text{CO}}{\\text{H}_2}$ ratios of $> 1.35 \\times 10^{-3}$ and $> 3.09 \\times 10^{-5}$ for HD 110058 and HD 131488 respectively. These constraints demonstrate that at least for HD 110058, the exocometary gas is compositionally distinct and significantly H$_2$-poor, compared to the $<10^{-4}$ $\\frac{\\text{CO}}{\\text{H}_2}$ ratios typical of protoplanetary disks. We also find H$_2$ alone is unlikely to shield CO over the lifetime of the systems. Overall this suggests that the gas in CO-rich belts is most likely not primordial in origin, supporting the presence of exocometary gas.",
      "pdf_url": "https://arxiv.org/pdf/2511.01708.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01873",
      "title": "Effectiveness of High-Dimensional Distance Metrics on Solar Flare Time Series",
      "authors": [
        "Elaina Rohlfing",
        "Azim Ahmadzadeh",
        "V Aparna"
      ],
      "abstract": "Effectiveness of High-Dimensional Distance Metrics on Solar Flare Time Series Elaina Rohlfing, Azim Ahmadzadeh, V Aparna Solar and Stellar Astrophysics (astro-ph.SR); Machine Learning (cs.LG) Solar-flare forecasting has been extensively researched yet remains an open problem. In this paper, we investigate the contributions of elastic distance measures for detecting patterns in the solar-flare dataset, SWAN-SF. We employ a simple $k$-medoids clustering algorithm to evaluate the effectiveness of advanced, high-dimensional distance metrics. Our results show that, despite thorough optimization, none of the elastic distances outperform Euclidean distance by a significant margin. We demonstrate that, although elastic measures have shown promise for univariate time series, when applied to the multivariate time series of SWAN-SF, characterized by the high stochasticity of solar activity, they effectively collapse to Euclidean distance. We conduct thousands of experiments and present both quantitative and qualitative evidence supporting this finding.",
      "pdf_url": "https://arxiv.org/pdf/2511.01873.pdf",
      "categories": [
        "astro-ph.SR",
        "cs.LG"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02068",
      "title": "Decoding the RVb Enigma of DF Cyg: Pulsations, Circumstellar Disks, and Post-RGB Evolution Revealed by Multi-Wavelength Observations",
      "authors": [
        "Cenk Kayhan",
        "Timur Şahin"
      ],
      "abstract": "Decoding the RVb Enigma of DF Cyg: Pulsations, Circumstellar Disks, and Post-RGB Evolution Revealed by Multi-Wavelength Observations Cenk Kayhan, Timur Şahin 2025, Physica Scripta, Volume 100, Number 10, 105027 Solar and Stellar Astrophysics (astro-ph.SR) This investigation integrates five decades of ground-based photometric data from the AAVSO, AFOEV, ASAS, ASAS-SN, and SuperWASP surveys with recently acquired TESS observations, conducting a multi-wavelength and multi-phase photometric analysis to elucidate the complex nature of DF Cyg. For the first time, we analyze approximately four years of Kepler data alongside TESS observations. Furthermore, TESS observations obtained in 120-second cadence mode, constitute the highest-precision photometric dataset for DF Cyg to date. By isolating long-term trends in the TESS data, we quantified short-term variations in the fundamental pulsation frequency and its integer harmonics. The two alternating short-term cycles in the TESS light curve facilitated the unambiguous identification of seven previously undetected integer harmonics of the fundamental frequency in the power spectrum, providing critical new insights into the star's complex pulsation dynamics. A periodogram analysis of the combined ground- and space-based datasets revealed approximately 35 frequencies linked to both long- and short-term variability mechanisms. Stellar parameters derived from Gaia DR3 data specifically, luminosity and radius estimates based on Type II Cepheid PL and PR relations demonstrate consistency with values obtained through SED modeling. Complementary high-resolution spectroscopic analysis of DF Cyg yielded atmospheric parameters of Teff = 4781 K, logg = 1.74 dex, and [FeH] = -0.07 dex, further constraining physical characteristics of the star. This synthesis of multi-epoch, multi-instrument data advances the understanding of pulsational behavior and evolutionary status in RV Tauri systems. Our findings highlight DF Cyg as a critical benchmark for its class, as its characteristics bridge the gap between post-RGB systems in the Magellanic Clouds and higher-luminosity post-AGB stars.",
      "pdf_url": "https://arxiv.org/pdf/2511.02068.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02150",
      "title": "A Correlation Between the Final Separation and Mass Ratio from Common Envelope Simulations",
      "authors": [
        "Sarah V. Borges"
      ],
      "abstract": "A Correlation Between the Final Separation and Mass Ratio from Common Envelope Simulations Sarah V. Borges Solar and Stellar Astrophysics (astro-ph.SR) Analytical models for common envelope evolution (CEE), particularly the energy formalism, are used in binary population synthesis to predict post-CEE configurations. This formalism is based on an efficiency parameter alpha, which relates the orbital energy released during CEE to that required to unbind the envelope of the giant. However, one of the main challenges is that CEE is a multiscale, multiphysics process. As a result, there may not be a universal value for alpha, or even a general expression. Using 13 3D simulations of CEE with RGBs (1 and 2 M$_\\odot$ primary; four mass ratios; with and without corotation), we present an empirical linear correlation between the post-plunge-in separation and the mass ratio, normalized by the giant radius. This trend for the plunge-in phase of CEE persists across RGB, AGB, and supergiant simulations in the literature, even for partially bound envelopes. Therefore, alpha from simulations should not be used to predict the final separation, but rather as a diagnostic of whether sufficient orbital energy has been liberated to completely eject the envelope immediately after the radial plunge. If this condition is not met, further in-spiral is expected in later stages of CEE, which may explain why the final separation of post-CEE observations is generally smaller than those predicted by the linear fit. Our results reinforce the idea that a better description could emerge if CEE is treated as a sequence of distinct phases, rather than treating it as a single event governed by alpha.",
      "pdf_url": "https://arxiv.org/pdf/2511.02150.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02221",
      "title": "A robust method for identifying Be stars in the LAMOST Data Release 11 based on Deep-learning approach",
      "authors": [
        "Lei Tan",
        "Hui Deng",
        "Ying Mei",
        "Huanbin chi",
        "Yixing Chen",
        "Tianhang Liu",
        "Feng Wang"
      ],
      "abstract": "A robust method for identifying Be stars in the LAMOST Data Release 11 based on Deep-learning approach Lei Tan, Hui Deng, Ying Mei, Huanbin chi, Yixing Chen, Tianhang Liu, Feng Wang Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) Be stars are rapidly rotating B-type stars that exhibit Balmer emission lines in their optical spectra. These stars play an important role in studies of stellar evolution and disk structures. In this work, we carried out a systematic search for Be stars based on LAMOST spectroscopic data. Using low-resolution spectra from LAMOST DR11, we constructed a data set and developed a classification model that combines long short-term memory networks and convolutional neural networks , achieving a testing accuracy of 97.86%. The trained model was then applied to spectra with signal-to-noise ratios greater than 10, yielding 55,667 B-type candidates. With the aid of the MKCLASS automated classification tool and manual verification, we finally confirmed 40,223 B-type spectra. By cross-matching with published H{\\alpha} emission-line star catalogs, we obtained a sample of 8298 Be stars, including 3787 previously reported Be stars and 4511 newly discovered. Furthermore, by incorporating color information, we classified the Be star sample into Herbig Be stars and Classical Be stars. In total, we identified 3363 Classical Be stars and 35 Herbig Be stars. The B-type and Be star catalogs derived in this study, together with the code used for model training, have been publicly released to facilitate community research.",
      "pdf_url": "https://arxiv.org/pdf/2511.02221.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02362",
      "title": "Data-driven Radiative Magnetohydrodynamics Simulations with the MURaM code: the Emerging Active Region Corona",
      "authors": [
        "Feng Chen"
      ],
      "abstract": "Data-driven Radiative Magnetohydrodynamics Simulations with the MURaM code: the Emerging Active Region Corona Feng Chen 24 pages, 11 figures, submitted to ApJ Solar and Stellar Astrophysics (astro-ph.SR) We present the application of the data-driven branch of the MURaM code, which follows the evolution of the actual active region over 4 days and reproduces many key coronal extreme-ultraviolet (EUV) emission features seen in remote sensing observations. Radiative magnetohydrodynamic (MHD) simulations that account for sophisticated energy transport processes, such as those in the real corona, have been extended with the ability to use observations as time-dependent boundaries, such that the models follow the evolution of actual active regions. This opens the possibility of a one-to-one model of a target region over an extensive time period. We use a hybrid strategy that combines fast-evolving idealized zero-$\\beta$ models that capture the evolution of the large-scale active region magnetic field over a long time period and sophisticated radiative MHD models for a shorter time period of interest. Synthesized EUV images illustrate the formation of coronal loops that connect the two sunspots or fan out to the domain boundary. The model reveals in three-dimensional space the finer structures in the coronal heating and plasma properties, which are usually concealed behind the EUV observables. The emission-measure-weighted line-of-sight velocity, which represents the Doppler shift of a spectral line forming in a certain temperature range, reveals vigorous dynamics in plasma at different temperatures and ubiquitous MHD waves, as expected in the real solar corona.",
      "pdf_url": "https://arxiv.org/pdf/2511.02362.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02523",
      "title": "Dynamical Masses and Radiative Transfer Modeling of HD 698: a Be Binary in Evolutionary Transition",
      "authors": [
        "Ilfa A. Gabitova , Alex C. Carciofi , Tajan H. de Amorim , Mark Suffak , Anatoly S. Miroshnichenko , Sergey V. Zharikov , Amanda C. Rubio , Steve Danford , Alicia N. Aarnio , Peter Prendergast , Richard J. Rudy , Richard C. Puetter , R. Brad Perry , Aldiyar T. Agishev , Nadezhda L. Vaidman , Serik A. Khokhlov Faculty of Physics and Technology, Al-Farabi Kazakh National University, Almaty, Kazakhstan, Instituto de Astronomia, Geofisica e Ciencias Atmosfericas, Universidade de Sao Paulo, Sao Paulo, Brazil, Department of Physics and Astronomy, Western University, London, Canada, Department of Physics and Astronomy, University of North Carolina at Greensboro, USA, Fesenkov Astrophysical Institute, Almaty, Kazakhstan, Instituto de Astronomia, Universidad Nacional Autonoma de Mexico, Ensenada, Mexico, School of Physics and Astronomy, University of Leeds, Leeds, UK, Kernersville Observatory, Winston-Salem, USA, Kookoosint Scientific, Camarillo, USA, Center for Astrophysics and Space Science, University of California San Diego, USA, Alabaster Scientific, Irvington, USA)"
      ],
      "abstract": "Dynamical Masses and Radiative Transfer Modeling of HD 698: a Be Binary in Evolutionary Transition Ilfa A. Gabitova (1), Alex C. Carciofi (2), Tajan H. de Amorim (2), Mark Suffak (3), Anatoly S. Miroshnichenko (4 and 5), Sergey V. Zharikov (6), Amanda C. Rubio (7), Steve Danford (4), Alicia N. Aarnio (4), Peter Prendergast (8), Richard J. Rudy (9), Richard C. Puetter (10), R. Brad Perry (11), Aldiyar T. Agishev (1), Nadezhda L. Vaidman (1 and 5), Serik A. Khokhlov (1 and 5) ((1) Faculty of Physics and Technology, Al-Farabi Kazakh National University, Almaty, Kazakhstan, (2) Instituto de Astronomia, Geofisica e Ciencias Atmosfericas, Universidade de Sao Paulo, Sao Paulo, Brazil, (3) Department of Physics and Astronomy, Western University, London, Canada, (4) Department of Physics and Astronomy, University of North Carolina at Greensboro, USA, (5) Fesenkov Astrophysical Institute, Almaty, Kazakhstan, (6) Instituto de Astronomia, Universidad Nacional Autonoma de Mexico, Ensenada, Mexico, (7) School of Physics and Astronomy, University of Leeds, Leeds, UK, (8) Kernersville Observatory, Winston-Salem, USA, (9) Kookoosint Scientific, Camarillo, USA, (10) Center for Astrophysics and Space Science, University of California San Diego, USA, (11) Alabaster Scientific, Irvington, USA) Solar and Stellar Astrophysics (astro-ph.SR) We present a detailed analysis of the early post-mass-transfer binary HD 698 (V742 Cas) combining high-resolution optical spectroscopy, long-baseline interferometry, and radiative-transfer modeling. Counter-phased radial-velocity curves yield a circular orbit with P=55.927+/-0.001 d and component masses M_Be=7.48+/-0.07 M_sun and M_comp=1.23+/-0.02 M_sun. The Be primary is traced by broad H alpha wings, while narrow metallic absorption lines arise from a slowly rotating companion. The interferometric separation implies a dynamical distance of 888+/-5 pc. The spectral energy distribution is reproduced with E(B-V)=0.321+/-0.016 and a viscous decretion disk of base density rho_0~5x10^12 g cm^-3 at r=R_eq, declining radially as rho(r)~r^-n with n=3.0. The companion is luminous and inflated, with T_eff=10.0(+0.2,-0.1) kK, R_comp=13.1+/-0.2 R_sun, and log(L/L_sun)=3.19, contributing significantly to the flux (L_comp/L_Be~0.3). Spectral line mismatches further suggest a hydrogen-poor, CNO-processed atmosphere, consistent with a stripped-envelope star. HD 698 thus adds to the emerging class of Be+bloated OB binaries, capturing a brief post-mass-transfer phase when the donor remains spectroscopically detectable prior to the subdwarf stage.",
      "pdf_url": "https://arxiv.org/pdf/2511.02523.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02528",
      "title": "Recalibration of the Landolt UBVRI Standard Stars and the Generation of 5.4 Million New UBVRI Standard Stars using LAMOST and Gaia",
      "authors": [
        "Bowen Huang",
        "Haibo Yuan",
        "Kai Xiao",
        "Ruoyi Zhang"
      ],
      "abstract": "Recalibration of the Landolt UBVRI Standard Stars and the Generation of 5.4 Million New UBVRI Standard Stars using LAMOST and Gaia Bowen Huang, Haibo Yuan, Kai Xiao, Ruoyi Zhang 23 pages, 13 figures, ApJS in Press Solar and Stellar Astrophysics (astro-ph.SR) We present an independent validation and recalibration of the Landolt 2013 (celestial equator and $\\delta \\sim -50^\\circ$) and 2016 ($\\delta \\sim -50^\\circ$) standard stars in the Johnson $UBV$ and Kron-Cousins $RI$ systems, using tens of thousands of XPSP data from the BEst STar (BEST) database. Our analysis reveals an overall zero-point offset between the 2016 and 2013 datasets. We further identify zero-point offsets for each standard field, ranging from 5 -- 14 mmag across all $UBVRI$ bands, with correlations between offsets in different bands. Additionally, we confirm the spatial structures up to 7 -- 10 mmag in the $BVRI$ bands. We also find that spatial structures are similar across bands for the same field, and similar across different fields for the same band. These similarities may arise from the averaged flat-fields from each observing run. The recalibrated results are consistent with the XPSP data within 48 mmag in the $U$ band, 11 mmag in the $B$ band, and 5 -- 6 mmag in the $VRI$ bands in the brightness $G<16$. Furthermore, based on stellar atmospheric parameters from LAMOST DR12 and Gaia DR3 photometry, along with the XPSP data, we derive temperature- and extinction-dependent extinction coefficients for the $UBVRI$ bands as well as a LAMOST \\& Gaia-based catalog of 5.4 million standard stars in the $UBVRI$ bands, for which the U-band photometry of the vast majority of sources exhibits significantly higher precision than XPSP. The recalibrated Landolt standard stars and LAMOST \\& Gaia-based standard stars will be available on the BEST website (this https URL) and (this https URL).",
      "pdf_url": "https://arxiv.org/pdf/2511.02528.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02539",
      "title": "The Arizona-Montréal spectroscopic survey of hot subluminous stars",
      "authors": [
        "M. Latour",
        "E. M. Green",
        "M. Dorsch",
        "V. Van Grootel",
        "P. Chayer",
        "S. Charpinet",
        "U. Heber",
        "S. K. Randall",
        "X.-Y. Ma"
      ],
      "abstract": "The Arizona-Montréal spectroscopic survey of hot subluminous stars M. Latour, E. M. Green, M. Dorsch, V. Van Grootel, P. Chayer, S. Charpinet, U. Heber, S. K. Randall, X.-Y. Ma Accepted for publication in Astronomy and Astrophysics. This version includes Table D.1 and Fig. E.1 in the appendix, which are otherwise only available on Zenodo Solar and Stellar Astrophysics (astro-ph.SR) Hot subdwarf B (sdB) and O (sdO) type stars are evolved helium-burning objects that lost their hydrogen envelope before the helium flash when their progenitors were close to the tip of the red giant branch. They populate the extreme horizontal branch (EHB) in the Hertzsprung-Russell diagram (HRD). Using the high-quality, homogeneous spectra of 336 hot subluminous star candidates from the Arizona-Montréal Spectroscopic Survey, we aim to improve our understanding of the atmospheric and stellar properties of hot subdwarf stars. We used large grids of model atmospheres to fit the observed spectra and derived their atmospheric parameters: effective temperature (Teff), surface gravity, and helium abundance. The model grids were further utilized to fit the spectral energy distribution of each star and the $Gaia$ parallax was used to compute the stellar parameters radius, luminosity, and mass. We detected helium stratification in six sdB stars with Teff around 30 kK, making them good candidates for also showing $^3$He enrichment in their atmospheres. The mass distributions of H-rich sdBs and sdOs are similar and centered around 0.47 $\\text{M}_\\odot$, consistent with the canonical formation scenario of helium ignition under degenerate conditions. Among the H-rich hot subdwarfs, we found no difference between the mass distributions of close binaries and apparently single stars. The He-sdOs have a significantly wider mass distribution than their H-rich counterparts, with an average mass of about 0.78 $\\text{M}_\\odot$. This strongly favors a merger origin for these He-rich objects. We identified a small number of candidate low-mass ($<$0.45$ \\text{M}_\\odot$) sdBs located below the EHB that might have originated from more massive progenitors. Finally, we identified more than 80 pulsating stars in our sample and found these to fall into well-defined $p$- and $g$-mode instability regions.",
      "pdf_url": "https://arxiv.org/pdf/2511.02539.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02540",
      "title": "A Comprehensive Study of the Physical and Geometrical Characteristics of the Close Visual Binary System HIP 45571",
      "authors": [
        "Motasem J. Alslaihat",
        "Hatem S. Widyan",
        "Mashhoor A. Al-Wardat",
        "Awni M. Kasawneh",
        "Diala M. Taneenah",
        "Abdullah M. Hussein"
      ],
      "abstract": "A Comprehensive Study of the Physical and Geometrical Characteristics of the Close Visual Binary System HIP 45571 Motasem J. Alslaihat, Hatem S. Widyan, Mashhoor A. Al-Wardat, Awni M. Kasawneh, Diala M. Taneenah, Abdullah M. Hussein Solar and Stellar Astrophysics (astro-ph.SR) In this paper, we estimated the physical and geometrical characteristics of the visually close binary stellar system Hip 45571, using Al-Wardat's method for analyzing binary and multiple stellar systems. We estimated the physical properties of the components of the system for the four measured parallax given by Gaia and Hipparcos, which gives a dynamical mass sum ranges between 2.43 and 2.52 solar mass using the new orbital parameters following Tokovinin's dynamical method. The method used is a spectrophotometrical computational technique that employs Kurucz plane-parallel line-blanketed model atmospheres for single stars. These model atmospheres are used to construct the synthetic spectral energy distributions (SED) of each component and for the entire system. To ensure the method's accuracy, we apply the fit between synthetic and observational photometry under different filters, including the recently published Gaia DR3 measurements. The positions of the components on the H-R diagram and the evolutionary tracks were used to estimate their masses and ages. We found that the system consists of 2.24 Gyr two F2.5 IV and F3.5 IV subgiant components with T_eff_A= 6800, T_eff_B= 6700, logg=4.19 m/s^2, logg=4.33 m/s^2, R_A=1.77 R_sun, R_B=1.34 R_sun, L_A=6.01 L_sun, L_B=3.25 L_sun and Z=0.011. Depending on the masses estimated by Al-Wardat's method, a new parallax value of 28.72+-0.30 mas was obtained. Which lies between the values given by DR2 and DR3. This research underscores the importance of precision and reliability in employing these methods and measurements in a dynamic context, deepening our understanding of such stellar systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.02540.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02581",
      "title": "The nature of ASASSN-24fw's occultation: modelling the event as dimming by optically thick rings around a sub-stellar companion",
      "authors": [
        "Sarang Shah",
        "Jonathan P. Marshall",
        "Carlos del Burgo",
        "Gergely Hajdu",
        "Isabel Rebollido",
        "Bogumił Pilecki",
        "Ashish Mahabal",
        "Mansi M. Kasliwal",
        "Viraj Karambelkar",
        "Matthew J. Graham",
        "Stanislav G. Djorgovski",
        "Daniel Stern",
        "Sascha T. Zeegers",
        "Bacham Eswar Reddy",
        "Ciska Kemper"
      ],
      "abstract": "The nature of ASASSN-24fw's occultation: modelling the event as dimming by optically thick rings around a sub-stellar companion Sarang Shah, Jonathan P. Marshall, Carlos del Burgo, Gergely Hajdu, Isabel Rebollido, Bogumił Pilecki, Ashish Mahabal, Mansi M. Kasliwal, Viraj Karambelkar, Matthew J. Graham, Stanislav G. Djorgovski, Daniel Stern, Sascha T. Zeegers, Bacham Eswar Reddy, Ciska Kemper Submitted to MNRAS in August 2025; 4 Figures and 5 tables Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) ASASSN-24fw is a main-sequence F-type star that experienced a rapid and long-lasting dimming event beginning in late 2024 and continuing until mid 2025. Its pre-dimming spectral energy distribution shows a persistent infrared excess with a fractional luminosity of approximately 0.5 percent. We model this excess using a two-component blackbody fit and find dust components with temperatures of about 1070 K and 390 K. Archival light curves indicate that ASASSN-24fw was photometrically stable prior to the event, suggesting that the dimming is caused by an external occulting body rather than intrinsic stellar variability. The event lasted about 275 days and exhibits a distinctive flat-bottomed profile of nearly 200 days, unlike most long-duration occultation events reported in the last decade. We analyze the light curve and spectra obtained during dimming to study the properties of both the star and the occulting material. A parametric light-curve model reveals multiple ingress phases, consistent with variations in the density and structure of the obscuring material. A second transit model favors an occulting body consistent with a gas giant or brown dwarf with a minimum mass of about 3.4 Jupiter masses and surrounded by an extended circumplanetary disk or rings of radius roughly 0.17 au. Near-infrared spectra taken during dimming show enhanced infrared excess and spectral features consistent with a late-type companion, approximately M8. We also detect variable H-alpha emission, suggesting evolving gas and dust in the occulting structure. Imaging from LCOGT identifies a nearby object within 3 arcsec, likely a bound companion at a projected separation of about 3000 au. Systems like ASASSN-24fw appear rare, and continued follow-up will help constrain the nature of the occulting body and the circumstellar environment.",
      "pdf_url": "https://arxiv.org/pdf/2511.02581.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02629",
      "title": "Mass ratio estimates for overcontact binaries using the derivatives of light curves. II. Systems with deep eclipses",
      "authors": [
        "Shinjirou Kouzuma"
      ],
      "abstract": "Mass ratio estimates for overcontact binaries using the derivatives of light curves. II. Systems with deep eclipses Shinjirou Kouzuma 6 pages, 4 figures, accepted for publication in PASJ Solar and Stellar Astrophysics (astro-ph.SR) This is the second paper that proposes a simple method for estimating mass ratios using the derivatives of light curves for overcontact binaries. In the first paper (Kouzuma 2023, ApJ, 958, 84) , we presented a method to estimate the mass ratios for systems exhibiting a double-peak feature in the second derivatives of their light curves around eclipses. This second paper focuses on overcontact systems that are not addressed in the first paper, that is, systems lacking a double peak in the second derivative. A sample of synthetic light curves for overcontact binaries consists of 89670, covering a parameter space typical of overcontact systems. On the basis of a recent study that proposed a new classification scheme using light-curve derivatives up to the fourth order, the sample light curves were classified. We found that time intervals between two local extrema in the derivatives are associated with the mass ratio in systems that exhibit a high degree of eclipse obscuration. Using regression analysis for the identified associations, we derived empirical formulae to estimate the mass ratio and its associated uncertainty. The application of our proposed method to real overcontact binary data demonstrated its effectiveness in providing reliable estimates for both values.",
      "pdf_url": "https://arxiv.org/pdf/2511.02629.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02669",
      "title": "Resonances and Stellar Cycles: Observations and Modelling",
      "authors": [
        "M.M. Katsova",
        "F.A. Azizov",
        "V.N. Obridko",
        "D.D. Sokoloff",
        "E.V. Yushkov"
      ],
      "abstract": "Resonances and Stellar Cycles: Observations and Modelling M.M. Katsova, F.A. Azizov, V.N. Obridko, D.D. Sokoloff, E.V. Yushkov 5 pages, 1 figure. Accepted to Moscow University Physics Bulletin 2025 V.80 (7) Solar and Stellar Astrophysics (astro-ph.SR) In the paper we discuss the possibility of the influence of parametric excitation, in particular, planetary gravitational interaction, on the behavior of stellar magnetic activity cycles. Using the well-known Parker dynamo modeling, we demonstrate the doubtfulness of the fact that planetary rotation can be a determining factor in the formation of the cycle itself. However, we show that even a weak parametric influence can be sufficient to modulation of magnetic field oscillations, and, in particular, to the occurrence of beats. This result is discussed in the context of the influence of Jupiter on the occurrence of maxima and minima of the magnetic activity of our Sun.",
      "pdf_url": "https://arxiv.org/pdf/2511.02669.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02719",
      "title": "Radio and Optical Flares on the dMe Flare Star EV Lac",
      "authors": [
        "Rachel A. Osten",
        "Adam F. Kowalski",
        "Suzanne Hawley",
        "Isaiah I. Tristan",
        "Sarah J. Schmidt",
        "Ben Tofflemire",
        "Eric Hilton"
      ],
      "abstract": "Radio and Optical Flares on the dMe Flare Star EV Lac Rachel A. Osten, Adam F. Kowalski, Suzanne Hawley, Isaiah I. Tristan, Sarah J. Schmidt, Ben Tofflemire, Eric Hilton 23 pages, 11 figures, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) We present the results of a coordinated campaign to observe radio and optical stellar flares from the nearby M dwarf flare star EV~Lac. From a total of 27 hours of radio and 29 hours of optical observations, we examine the correspondence of the action of accelerated electrons of different energies in two distinct regions of the stellar atmosphere. We find that out of 9 optical flares with suitable radio coverage, only four have plausible evidence for a radio response. Optical photometric properties cannot predict which flares will have a radio response. From flares with time-resolved optical spectroscopy available, optical-only flares have similar implied electron distributions, while those with radio responses better correlate with higher low-energy cutoffs. The optical flares with a radio response all exhibit a delay between the optical and radio peaks of $\\approx$1-7 minutes, with the optical flare peaking earlier in all cases. This likely indicates multiple loops are involved in the event, and/or the different impacts on electrons trapped in a magnetic loop (producing radio emission), versus those directly precipitating from the loop (producing the optical flare). We also remark on the radio spectral index behavior at early times for the largest radio flare observed in this study, which we interpret as evidence for increased opacity from a chromospheric evaporation front.",
      "pdf_url": "https://arxiv.org/pdf/2511.02719.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02798",
      "title": "Visualization of High Dynamic Range Solar Imagery and the Radial Histogram Equalizing Filter",
      "authors": [
        "Chris Gilly",
        "Steven Cranmer"
      ],
      "abstract": "Visualization of High Dynamic Range Solar Imagery and the Radial Histogram Equalizing Filter Chris Gilly, Steven Cranmer 16 pages of content, 27 total pages with appendices, 13 figures. Accepted for publication in Solar Physics on 11/3/25. Novel RHEF algorithm is available and implemented in both python and IDL Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM); Space Physics (physics.space-ph) Standard visualizations of Extreme Ultraviolet (EUV) solar imagery often fail to convey the full complexity of the Sun's corona, especially in faint off-limb regions. This can leave the misleading impression of the Sun as a bright ball in a dark void, rather than revealing it as the dynamic, structured source of the solar wind and space weather. A variety of enhancement algorithms have been developed to address this challenge, each with its own strengths and tradeoffs. We introduce the Radial Histogram Equalizing Filter (RHEF), a novel hybrid technique that optimizes contrast in high dynamic range solar images. By combining the spatial awareness of radial graded filters with the perceptual benefits of histogram equalization, RHEF reveals faint coronal structures and works out of the box -- without requiring careful parameter tuning or prior dataset characterization. RHEF operates independently on each frame, and it enhances on-disk and off-limb features uniformly across the field of view. For additional control, we also present the Upsilon redistribution function -- a symmetrized cousin of gamma correction -- as an optional post-processing step that provides intuitive programmatic tonal compression. We benchmark RHEF against established methods and offer guidance on filter selection across various applications, with examples from multiple solar instruments provided in an appendix. Implemented and available in both Python sunkit_image and IDL, RHEF enables immediate improvements in solar coronal visualization.",
      "pdf_url": "https://arxiv.org/pdf/2511.02798.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02801",
      "title": "Cesam2k20: A code for a new generation of stellar evolution models. I. Description of the code",
      "authors": [
        "L. Manchon",
        "M. Deal",
        "J. P. C. Marques",
        "Y. Lebreton"
      ],
      "abstract": "Cesam2k20: A code for a new generation of stellar evolution models. I. Description of the code L. Manchon, M. Deal, J. P. C. Marques, Y. Lebreton Solar and Stellar Astrophysics (astro-ph.SR) We present Cesam2k20, the latest version of the hydrostatic stellar evolution code CESAM originally developed by P. Morel and collaborators. Over the last three decades, it has undergone many improvements and has been extensively tested against other stellar evolution codes before being selected to compute the first-generation grid of stellar models for the PLATO mission. Among all the developments made thus far, Cesam2k20 now implements state-of-the-art models for the transport of chemical elements and angular momentum. It was recently made publicly available with an ecosystem of other codes interfaced with it: 1D and 2D oscillation codes ADIPLS and ACOR, optimisation program OSM, and Python utility package pycesam. This paper recalls the numerical peculiarities of Cesam2k20, namely, the use of a collocation method where the structure variables are decomposed as piecewise polynomials projected on a B-spline basis. Here, we review the options available for modelling the different physical processes. In particular, we illustrate the improvements made in the transport of chemical elements and angular momentum with a series of standard and non-standard solar models.",
      "pdf_url": "https://arxiv.org/pdf/2511.02801.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01954",
      "title": "Precise Radial Velocities",
      "authors": [
        "Jennifer A. Burt",
        "Xavier Dumusque",
        "Samuel Halverson"
      ],
      "abstract": "Jennifer A. Burt, Xavier Dumusque, Samuel Halverson 49 pages, 9 figures, to appear in Volume 64 of Annual Reviews of Astronomy and Astrophysics Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Precise measurements of a star's radial velocity (RV) made using extremely stable, high resolution, optical or near infrared spectrographs can be used to determine the masses and orbital parameters of gravitationally-bound extra-solar planets (exoplanets). Indeed, RV surveys and follow up efforts have provided the vast majority of published exoplanet mass measurements and in doing so have enabled studies into exoplanet interior and atmospheric compositions. Here we review the current state of the RV field, with particular attention paid to: -The evolution of precise RV methodologies over the past two decades -Modern RV spectrograph designs that can be calibrated to a stability level of better than 50 cm/s over timescales of years -RV data reduction and post-processing techniques that minimize the impact of instrument systematics and stellar variability -Techniques for detecting exoplanets in RV data and disentangling planetary signals from stellar variability",
      "pdf_url": "https://arxiv.org/pdf/2511.01954.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01972",
      "title": "Inferring the physics of protoplanetary disc evolution from the irradiated Cygnus OB2 region -- A comparison of viscous and MHD wind-driven scenarios",
      "authors": [
        "Jesse Weder",
        "Andrew J. Winter",
        "Christoph Mordasini"
      ],
      "abstract": "Inferring the physics of protoplanetary disc evolution from the irradiated Cygnus OB2 region -- A comparison of viscous and MHD wind-driven scenarios Jesse Weder, Andrew J. Winter, Christoph Mordasini Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Our current understanding has crystallised around two possible evolution scenarios for protoplanetary discs (turbulent viscosity and magnetohydrodynamic (MHD) wind-driven) - but which dominates remains uncertain. Our aims are twofold: Firstly, we investigate whether a single set of model parameters can reproduce the observational constraints of non-irradiated and irradiated discs. Secondly, we propose a novel approach to break degeneracies between the two evolution scenarios by studying the relation of stellar accretion rate and externally driven wind mass-loss rates, which evolve differently depending on the mechanism of angular momentum transport in the outer disc. We evolve synthetic populations of protoplanetary discs using 1D vertically integrated models for both viscous and MHD wind-driven disc evolution including both internal X-ray and external far ultraviolet (FUV) photoevaporation for both evolution scenarios. We investigate both weak and strong FUV field environments, where the strong FUV field is calculated based on an environment similar to the Cygnus OB2 association. While both scenarios are able to reproduce observational constraints, our simulations suggest that different parameters are needed for the angular momentum transport to explain disc lifetimes and disc mass - stellar accretion rate relation in weakly and strongly irradiated regions. We find that the predicted median disc radii are much larger in low FUV environments compared to Cygnus OB2, but also decreasing with time. In the viscous scenario, the median disc radius in a low FUV field environment is ~100au larger than for the MHD wind-driven scenario. We further show that studying stellar accretion rates and externally driven wind mass-loss rates (provided that they can be isolated from internally driven winds; i.e. MHD wind) is indeed a promising way of disentangling the two evolution scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2511.01972.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01979",
      "title": "ExoplaNeT accRetion mOnitoring sPectroscopic surveY (ENTROPY) - II. Time series of Balmer line profiles of Delorme 1(AB)b",
      "authors": [
        "Dorian Demars",
        "Mickaël Bonnefoy",
        "Catherine Dougados",
        "Gayathri Viswanath",
        "Simon C. Ringqvist",
        "Markus Janson",
        "Yuhiko Aoyama",
        "Thanawuth Thanathibodee",
        "Gabriel-Dominique Marleau",
        "Carlo F. Manara",
        "Elisabetta Rigliaco",
        "Judith Szulágyi",
        "Aurora Sicilia-Aguilar",
        "Jérôme Bouvier",
        "Evelyne Alecian",
        "Simon Petrus",
        "Mathis Houllé"
      ],
      "abstract": "ExoplaNeT accRetion mOnitoring sPectroscopic surveY (ENTROPY) - II. Time series of Balmer line profiles of Delorme 1(AB)b Dorian Demars, Mickaël Bonnefoy, Catherine Dougados, Gayathri Viswanath, Simon C. Ringqvist, Markus Janson, Yuhiko Aoyama, Thanawuth Thanathibodee, Gabriel-Dominique Marleau, Carlo F. Manara, Elisabetta Rigliaco, Judith Szulágyi, Aurora Sicilia-Aguilar, Jérôme Bouvier, Evelyne Alecian, Simon Petrus, Mathis Houllé 23 pages, 16 figures, 3 tables. Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Accretion processes in the planetary-mass regime remain poorly constrained, yet they strongly influence planet formation, evolution, and the composition of circumplanetary disks (CPDs). We investigate the resolved Balmer hydrogen emission-line profiles and their variability in the ~13Mjup, 30-45 Myr-old companion Delorme to constrain the underlying accretion mechanisms. Using VLT/UVES, we obtained 31 new epochs of high-resolution optical spectra (330-680 nm, R = 50,000), probing variability from hours to years. We analyze the shape and flux variability of hydrogen emission lines and compare them to two proposed origins: magnetospheric accretion funnels and localized accretion shocks. We detect Balmer lines from Halpha to H10 (6564-3799 AA) and a UV continuum excess, both indicative of ongoing accretion. All features are variable. The hydrogen lines decompose into two static components that vary only in flux. The broader velocity component correlates strongly with the UV excess and is qualitatively consistent with magnetospheric funnel models, but not with shock models. This component dominates the shape variability. The narrower component, which correlates less with the UV excess, is better matched by shock-emission models and drives most of the flux variability. Line fluxes show low variability on hour timescales but up to ~100% over weeks, similar to T Tauri stars. Our findings support magnetospheric accretion as the origin of the broad component. The narrow component may arise from accretion shocks or chromospheric activity. Higher-cadence observations could reveal rotational modulations and help constrain the object's rotation period and accretion geometry.",
      "pdf_url": "https://arxiv.org/pdf/2511.01979.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02643",
      "title": "The First Occurrence Rate Estimates for Exoplanets in Small-Separation Binary Star Systems: Planet Occurrence is Suppressed in Binary Stars",
      "authors": [
        "Kendall Sullivan",
        "Anne Dattilo",
        "Natalie M. Batalha"
      ],
      "abstract": "The First Occurrence Rate Estimates for Exoplanets in Small-Separation Binary Star Systems: Planet Occurrence is Suppressed in Binary Stars Kendall Sullivan, Anne Dattilo, Natalie M. Batalha 16 pages, 9 figures, 1 table. Accepted to AJ. Table files are available from the first author upon request Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Exoplanet occurrence rates facilitate comparisons between observations of planets and theoretical models of planet formation. Despite their deductive power, exoplanet occurrence rates for half the stars in the sky are missing because occurrence rate studies systematically exclude binary star systems. We assembled a large sample of high-likelihood binaries from the Kepler mission to calculate occurrence rates for circumstellar (S-type) planets in small-separation binary star systems ($\\lesssim 100$ au) for the first time. For a sample of high-likelihood small-separation binaries, we found binaries to host 58% fewer planets per system than single stars to 11.4$\\sigma$ significance within 1-4 $R_{\\oplus}$ and 1-50 d, and 50% fewer planets compared to single stars when integrating over the full parameter space of 1-10 $R_{\\oplus}$ and 1-100 d to 3.8$\\sigma$ significance.. We found no evidence for a radius valley or radius cliff, instead detecting a smooth decline in planet occurrence with increasing planetary radius. The difference between the single-star planet radius distribution and the binary-star planet radius distribution is 4.3$\\sigma$ significant from a Kolomogorov-Smirnov test. These results suggest significantly different planet formation and survival outcomes in binaries compared to single stars, and support other studies that have measured a deficit of observed planets in binary star systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.02643.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02811",
      "title": "From thermal to magnetic driving: spectral diagnostics of simulation-based magnetothermal disc wind models",
      "authors": [
        "Michael L. Weber",
        "Eleftheria Sarafidou",
        "Christian Rab",
        "Oliver Gressel",
        "Barbara Ercolano"
      ],
      "abstract": "From thermal to magnetic driving: spectral diagnostics of simulation-based magnetothermal disc wind models Michael L. Weber, Eleftheria Sarafidou, Christian Rab, Oliver Gressel, Barbara Ercolano Accepted for publication in A&A, 12 pages, 11 figures Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Disc winds driven by thermal and magnetic processes are thought to play a critical role in protoplanetary disc evolution. However, the relative contribution of each mechanism remains uncertain, particularly in light of their observational signatures. We investigate whether spatially resolved emission and synthetic spectral line profiles can distinguish between thermally and magnetically driven winds in protoplanetary discs. We modelled three disc wind scenarios with different levels of magnetisation: a relatively strongly magnetised wind ($\\beta$4), a rather weakly magnetised wind ($\\beta$6), and a purely photoevaporative wind (PE). Using radiative transfer post-processing, we generated synthetic emission maps and line profiles for [OI] 6300 Å, [NeII] 12.81 $\\mathrm{\\mu}$m, and o-H2 2.12 $\\mathrm{\\mu}$m, and compared them with observations. The $\\beta$4 model generally produces broader and more blueshifted low-velocity components across all tracers, consistent with compact emission regions and steep velocity gradients. The $\\beta$6 and PE models yield narrower profiles with smaller blueshifts, in better agreement with most observed narrow low-velocity components (NLVCs). We also find that some line profile diagnostics, such as the inclination at maximum centroid velocity, are not robust discriminants. However, the overall blueshift and full-width at half-maximum (FWHM) of the low-velocity components provide reliable constraints. The $\\beta$4 model reproduces the most extreme blueshifted NLVCs in observations, while most observed winds are more consistent with the $\\beta$6 and PE models. Our findings reinforce previous conclusions that most observed NLVCs are compatible with weakly magnetised or purely photoevaporative flows. The combination of line kinematics and emission morphology offers meaningful constraints on wind-driving physics.",
      "pdf_url": "https://arxiv.org/pdf/2511.02811.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07174",
      "title": "The Unhurried Universe: A Continued Search for Long Term Variability in ASAS-SN",
      "authors": [
        "Sydney Petz",
        "C. S. Kochanek",
        "K. Z. Stanek",
        "Benjamin J. Shappee",
        "Subo Dong",
        "J. L. Prieto",
        "Todd A. Thompson"
      ],
      "abstract": "The Unhurried Universe: A Continued Search for Long Term Variability in ASAS-SN Sydney Petz, C. S. Kochanek, K. Z. Stanek, Benjamin J. Shappee, Subo Dong, J. L. Prieto, Todd A. Thompson Published in the Open Journal of Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) We search a sample of 5,685,060 isolated sources in the All Sky Automated Survey for SuperNovae (ASAS-SN) with 14.5<g<15 mag for slowly varying sources with brightness changes larger than ~0.03 mag/year over 10 years. We find 426 slowly-varying systems. Of these systems, 200 are identified as variables for the first time, 226 are previously classified as variables, and we find equal numbers of sources becoming brighter and fainter. Previously classified systems were mostly identified as semi-regular variables (SR), slow irregular variables (L), or unknown (MISC or VAR), as long time scale variability does not fit into a standard class. Much like Petz & Kochanek 2025, the sources are scattered across the color magnitude diagram and can be placed into 5 groups that exhibit distinct behaviors. There are also six AGN. There are 262 candidates (~62 percent) that also show shorter time scale periodic variability, mostly with periods longer than 10 days. The variability of 66 of these candidates may be related to dust. Combining the new slow variable candidates with the candidates from Petz & Kochanek 2025, we have found a total of 1208 slow variables.",
      "pdf_url": "https://arxiv.org/pdf/2507.07174.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02173",
      "title": "Thermal and Electrical Properties of Prototype Readout Components for CMB-S4",
      "authors": [
        "Wilber Dominguez",
        "Darcy R. Barron",
        "Zeeshan Ahmed",
        "Amy N. Bender",
        "Sandra Diez",
        "Malcolm Durkin",
        "Tristan A. Eggenberger",
        "Gunther Haller",
        "Shawn W. Henderson",
        "Katherine Hewey",
        "Johannes Hubmayr",
        "Christopher Rooney",
        "Robinjeet Singh",
        "Michael Vissers"
      ],
      "abstract": "Thermal and Electrical Properties of Prototype Readout Components for CMB-S4 Wilber Dominguez, Darcy R. Barron, Zeeshan Ahmed, Amy N. Bender, Sandra Diez, Malcolm Durkin, Tristan A. Eggenberger, Gunther Haller, Shawn W. Henderson, Katherine Hewey, Johannes Hubmayr, Christopher Rooney, Robinjeet Singh, Michael Vissers 7 pages, 4 figures, submitted for review to IEEE Transactions on Applied Superconductivity (IEEE-TAS) for a special issue for Low Temperature Detectors 2025 (LTD2025) conference proceedings Instrumentation and Methods for Astrophysics (astro-ph.IM) CMB-S4 is the fourth-generation ground-based cosmic microwave background project, designed to probe the early universe and cosmic inflation. CMB-S4 would achieve its science goals in part by dramatically increasing the number of transition edge sensor (TES) bolometer detectors on the sky. The detector readout system for CMB-S4 is time-division multiplexing (TDM) with a two-stage Superconducting Quantum Interference Device (SQUID) system. To accommodate the large increase in detectors, the size of our camera increases, placing physical constraints on the readout, its wiring, and its power dissipation. Therefore, to optimize readout performance, we need to balance competing design considerations such as thermal load and bandwidth. We present results characterizing the thermal and electrical performance of prototype components, including wiring and SQUID arrays for CMB-S4, and discuss the impact on overall system performance.",
      "pdf_url": "https://arxiv.org/pdf/2511.02173.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02756",
      "title": "Development of Silicon Micromachined Waveguide Filter-Banks for On-Chip Spectrometers",
      "authors": [
        "Matthew A. Koc , Jason Austermann , James Beall , Johannes Hubmayr , Joel N. Ullom , Michael Vissers , Jordan Wheeler University of Colorado Boulder, National Institute of Standards and Technology)"
      ],
      "abstract": "Development of Silicon Micromachined Waveguide Filter-Banks for On-Chip Spectrometers Matthew A. Koc (1 and 2), Jason Austermann (2), James Beall (2), Johannes Hubmayr (2), Joel N. Ullom (1 and 2), Michael Vissers (2), Jordan Wheeler (2) ((1) University of Colorado Boulder, (2) National Institute of Standards and Technology) 6 pages, 6 figures, submitted to IEEE Transactions on Applied Superconductivity Instrumentation and Methods for Astrophysics (astro-ph.IM) Development of high-speed, spatial-mapping spectrometers in the millimeter and far-infrared frequencies would enable entirely new research avenues in astronomy and cosmology. An \"on-chip\" spectrometer is one such technology that could enable Line Intensity Mapping. Recent work has shown the promise of high-speed imaging; however, a limiting factor is that many of these devices suffer from low optical efficiency. Here we present the fabrication of a metalized, Si waveguide filter-bank fabricated using deep reactive ion etching for use in millimeter spectroscopy. Our design simultaneously provides high-density pixel packing, high optical efficiency, high spectral resolution, and is readily compatible with simple and multiplexable MKID arrays. Gold plated test waveguide and filter show excellent match to simulations with a measured resolving power of 263 and a loss quality factor of 1116 at room temperature. The results show promise for extending the measurements to larger, multi-wavelength designs.",
      "pdf_url": "https://arxiv.org/pdf/2511.02756.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02021",
      "title": "Computing the Full Earth System at 1 km Resolution",
      "authors": [
        "Daniel Klocke",
        "Claudia Frauen",
        "Jan Frederik Engels",
        "Dmitry Alexeev",
        "René Redler",
        "Reiner Schnur",
        "Helmuth Haak",
        "Luis Kornblueh",
        "Nils Brüggemann",
        "Fatemeh Chegini",
        "Manoel Römmer",
        "Lars Hoffmann",
        "Sabine Griessbach",
        "Mathis Bode",
        "Jonathan Coles",
        "Miguel Gila",
        "William Sawyer",
        "Alexandru Calotoiu",
        "Yakup Budanaz",
        "Pratyai Mazumder",
        "Marcin Copik",
        "Benjamin Weber",
        "Andreas Herten",
        "Hendryk Bockelmann",
        "Torsten Hoefler",
        "Cathy Hohenegger"
      ],
      "abstract": "Computing the Full Earth System at 1 km Resolution Daniel Klocke, Claudia Frauen, Jan Frederik Engels, Dmitry Alexeev, René Redler, Reiner Schnur, Helmuth Haak, Luis Kornblueh, Nils Brüggemann, Fatemeh Chegini, Manoel Römmer, Lars Hoffmann, Sabine Griessbach, Mathis Bode, Jonathan Coles, Miguel Gila, William Sawyer, Alexandru Calotoiu, Yakup Budanaz, Pratyai Mazumder, Marcin Copik, Benjamin Weber, Andreas Herten, Hendryk Bockelmann, Torsten Hoefler, Cathy Hohenegger Atmospheric and Oceanic Physics (physics.ao-ph); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present the first-ever global simulation of the full Earth system at \\qty{1.25}{\\kilo\\meter} grid spacing, achieving highest time compression with an unseen number of degrees of freedom. Our model captures the flow of energy, water, and carbon through key components of the Earth system: atmosphere, ocean, and land. To achieve this landmark simulation, we harness the power of \\num{8192} GPUs on Alps and \\num{20480} GPUs on JUPITER, two of the world's largest GH200 superchip installations. We use both the Grace CPUs and Hopper GPUs by carefully balancing Earth's components in a heterogeneous setup and optimizing acceleration techniques available in ICON's codebase. We show how separation of concerns can reduce the code complexity by half while increasing performance and portability. Our achieved time compression of 145.7 simulated days per day enables long studies including full interactions in the Earth system and even outperforms earlier atmosphere-only simulations at a similar resolution.",
      "pdf_url": "https://arxiv.org/pdf/2511.02021.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2404.02188",
      "title": "Data availability and requirements relevant for the Ariel space mission and other exoplanet atmosphere applications",
      "authors": [
        "Katy L. Chubb",
        "Séverine Robert",
        "Clara Sousa-Silva",
        "Sergei N. Yurchenko",
        "Nicole F. Allard",
        "Vincent Boudon",
        "Jeanna Buldyreva",
        "Benjamin Bultel",
        "Athena Coustenis",
        "Aleksandra Foltynowicz",
        "Iouli E. Gordon",
        "Robert J. Hargreaves",
        "Christiane Helling",
        "Christian Hill",
        "Helgi Rafn Hrodmarsson",
        "Tijs Karman",
        "Helena Lecoq-Molinos",
        "Alessandra Migliorini",
        "Michaël Rey",
        "Cyril Richard",
        "Ibrahim Sadiek",
        "Frédéric Schmidt",
        "Andrei Sokolov",
        "Stefania Stefani",
        "Jonathan Tennyson",
        "Olivia Venot",
        "Sam O. M. Wright",
        "Rosa Arenales-Lope",
        "Joanna K. Barstow",
        "Andrea Bocchieri",
        "Nathalie Carrasco",
        "Dwaipayan Dubey",
        "Oleg Egorov",
        "Antonio García Muñoz",
        "Ehsan Gharib-Nezhad",
        "Leonardos Gkouvelis",
        "Fabian Grübel",
        "Patrick Gerard Joseph Irwin",
        "Antonín Knížek",
        "David A. Lewis",
        "Matt G. Lodge",
        "Sushuang Ma",
        "Zita Martins",
        "Karan Molaverdikhani",
        "Giuseppe Morello",
        "Andrei Nikitin",
        "Emilie Panek",
        "Miriam Rengel",
        "Giovanna Rinaldi",
        "Jack W. Skinner",
        "Giovanna Tinetti",
        "Tim A. van Kempen",
        "Jingxuan Yang",
        "Tiziano Zingales"
      ],
      "abstract": "Data availability and requirements relevant for the Ariel space mission and other exoplanet atmosphere applications Katy L. Chubb, Séverine Robert, Clara Sousa-Silva, Sergei N. Yurchenko, Nicole F. Allard, Vincent Boudon, Jeanna Buldyreva, Benjamin Bultel, Athena Coustenis, Aleksandra Foltynowicz, Iouli E. Gordon, Robert J. Hargreaves, Christiane Helling, Christian Hill, Helgi Rafn Hrodmarsson, Tijs Karman, Helena Lecoq-Molinos, Alessandra Migliorini, Michaël Rey, Cyril Richard, Ibrahim Sadiek, Frédéric Schmidt, Andrei Sokolov, Stefania Stefani, Jonathan Tennyson, Olivia Venot, Sam O. M. Wright, Rosa Arenales-Lope, Joanna K. Barstow, Andrea Bocchieri, Nathalie Carrasco, Dwaipayan Dubey, Oleg Egorov, Antonio García Muñoz, Ehsan (Sam)Gharib-Nezhad, Leonardos Gkouvelis, Fabian Grübel, Patrick Gerard Joseph Irwin, Antonín Knížek, David A. Lewis, Matt G. Lodge, Sushuang Ma, Zita Martins, Karan Molaverdikhani, Giuseppe Morello, Andrei Nikitin, Emilie Panek, Miriam Rengel, Giovanna Rinaldi, Jack W. Skinner, Giovanna Tinetti, Tim A. van Kempen, Jingxuan Yang, Tiziano Zingales 58 pages, published in RAS Techniques and Instruments (RASTI). The authors welcome feedback: corresponding author emails can be found as footnotes on page 2 RAS Techniques and Instruments, Volume 3, Issue 1, January 2024, Pages 636-690 Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) The goal of this white paper is to provide a snapshot of the data availability and data needs primarily for the Ariel space mission, but also for related atmospheric studies of exoplanets and brown dwarfs. It covers the following data-related topics: molecular and atomic line lists, line profiles, computed cross-sections and opacities, collision-induced absorption and other continuum data, optical properties of aerosols and surfaces, atmospheric chemistry, UV photodissociation and photoabsorption cross-sections, and standards in the description and format of such data. These data aspects are discussed by addressing the following questions for each topic, based on the experience of the \"data-provider\" and \"data-user\" communities: (1) what are the types and sources of currently available data, (2) what work is currently in progress, and (3) what are the current and anticipated data needs. We present a GitHub platform for Ariel-related data, with the goal to provide a go-to place for both data-users and data-providers, for the users to make requests for their data needs and for the data-providers to link to their available data. Our aim throughout the paper is to provide practical information on existing sources of data whether in databases, theoretical, or literature sources.",
      "pdf_url": "https://arxiv.org/pdf/2404.02188.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.02717",
      "title": "Astromer 2",
      "authors": [
        "Cristobal Donoso-Oliva",
        "Ignacio Becker",
        "Pavlos Protopapas",
        "Guillermo Cabrera-Vives",
        "Martina Cádiz-Leyton",
        "Daniel Moreno-Cartagena"
      ],
      "abstract": "Cristobal Donoso-Oliva, Ignacio Becker, Pavlos Protopapas, Guillermo Cabrera-Vives, Martina Cádiz-Leyton, Daniel Moreno-Cartagena Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI); Machine Learning (cs.LG) Foundational models have emerged as a powerful paradigm in deep learning field, leveraging their capacity to learn robust representations from large-scale datasets and effectively to diverse downstream applications such as classification. In this paper, we present Astromer 2 a foundational model specifically designed for extracting light curve embeddings. We introduce Astromer 2 as an enhanced iteration of our self-supervised model for light curve analysis. This paper highlights the advantages of its pre-trained embeddings, compares its performance with that of its predecessor, Astromer 1, and provides a detailed empirical analysis of its capabilities, offering deeper insights into the model's representations. Astromer 2 is pretrained on 1.5 million single-band light curves from the MACHO survey using a self-supervised learning task that predicts randomly masked observations within sequences. Fine-tuning on a smaller labeled dataset allows us to assess its performance in classification tasks. The quality of the embeddings is measured by the F1 score of an MLP classifier trained on Astromer-generated embeddings. Our results demonstrate that Astromer 2 significantly outperforms Astromer 1 across all evaluated scenarios, including limited datasets of 20, 100, and 500 samples per class. The use of weighted per-sample embeddings, which integrate intermediate representations from Astromer's attention blocks, is particularly impactful. Notably, Astromer 2 achieves a 15% improvement in F1 score on the ATLAS dataset compared to prior models, showcasing robust generalization to new datasets. This enhanced performance, especially with minimal labeled data, underscores the potential of Astromer 2 for more efficient and scalable light curve analysis.",
      "pdf_url": "https://arxiv.org/pdf/2502.02717.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.14825",
      "title": "MadVoro: Parallel Construction of Voronoi Diagrams in Distributed Memory Systems",
      "authors": [
        "Maor Mizrachi",
        "Barak Raveh",
        "Elad Steinberg"
      ],
      "abstract": "MadVoro: Parallel Construction of Voronoi Diagrams in Distributed Memory Systems Maor Mizrachi, Barak Raveh, Elad Steinberg Published in RASTI (RAS Techniques and Instruments) in September 2025 Maor Mizrachi, Barak Raveh, Elad Steinberg, madvoro: parallel construction of Voronoi diagrams in distributed memory systems, RAS Techniques and Instruments, Volume 4, 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Computational Geometry (cs.CG); Distributed, Parallel, and Cluster Computing (cs.DC) Voronoi diagrams are essential geometrical structures with numerous applications, particularly astrophysics-driven finite volume methods. While serial algorithms for constructing these entities are well-established, parallel construction remains challenging. This is especially true in distributed memory systems, where each host manages only a subset of the input points. This process requires redistributing points across hosts and accurately computing the corresponding Voronoi cells. In this paper, we introduce a new distributed construction algorithm, which is implemented in our open-source C++ 3-dimensional Voronoi construction framework. Our approach leverages Delaunay triangulation as an intermediate step, which is then transformed into a Voronoi diagram. We introduce the algorithms we implemented for the precise construction and our load-balancing approach and compare the running time with other state-of-the-art frameworks. MadVoro is a versatile tool that can be applied in various scientific domains, such as mesh decomposition, computational physics, chemistry, and machine learning.",
      "pdf_url": "https://arxiv.org/pdf/2502.14825.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.CG",
        "cs.DC"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.20479",
      "title": "Leveraging pre-trained vision Transformers for multi-band photometric light curve classification",
      "authors": [
        "Daniel Moreno-Cartagena",
        "Pavlos Protopapas",
        "Guillermo Cabrera-Vives",
        "Martina Cádiz-Leyton",
        "Ignacio Becker",
        "Cristóbal Donoso-Oliva"
      ],
      "abstract": "Leveraging pre-trained vision Transformers for multi-band photometric light curve classification Daniel Moreno-Cartagena, Pavlos Protopapas, Guillermo Cabrera-Vives, Martina Cádiz-Leyton, Ignacio Becker, Cristóbal Donoso-Oliva Instrumentation and Methods for Astrophysics (astro-ph.IM) This study investigates the potential of a pre-trained vision Transformer (VT) model, specifically the Swin Transformer V2 (SwinV2), to classify photometric light curves without the need for feature extraction or multi-band preprocessing. The goal is to assess whether this image-based approach can accurately differentiate astronomical phenomena and serve as a viable option for working with multi-band photometric light curves. We transformed each multi-band light curve into an image. These images serve as input to the SwinV2 model, which is pre-trained on ImageNet-21K. The datasets employed include the public Catalog of Variable Stars from the Massive Compact Halo Object (MACHO) survey, using both one and two bands, and the first round of the recent Extended LSST Astronomical Time-Series Classification Challenge (ELAsTiCC), which includes six bands. The performance of the model was evaluated on six classes for the MACHO dataset and 20 distinct classes of variable stars and transient events for the ELAsTiCC dataset. The fine-tuned SwinV2 achieved better performance than models specifically designed for light curves, such as Astromer and the Astronomical Transformer for Time Series and Tabular Data (ATAT). When trained on the full MACHO dataset, it attained a macro F1-score of 80.2 and outperformed Astromer in single-band experiments. Incorporating a second band further improved performance, increasing the F1-score to 84.1. In the ELAsTiCC dataset, SwinV2 achieved a macro F1-score of 65.5, slightly surpassing ATAT by 1.3.",
      "pdf_url": "https://arxiv.org/pdf/2502.20479.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01973",
      "title": "Dust back-reaction on gas around planets modifies the cold thermal torque",
      "authors": [
        "Raúl O. Chametla",
        "Ondřej Chrenko",
        "F. J. Sánchez-Salcedo",
        "Mauricio Reyes-Ruiz",
        "Clément Baruteau",
        "Alicia Moranchel-Basurto",
        "Joanna Drążkowska",
        "Gabriel-Dominique Marleau",
        "Yasuhiro Hasegawa",
        "Sonia Cornejo"
      ],
      "abstract": "Dust back-reaction on gas around planets modifies the cold thermal torque Raúl O. Chametla, Ondřej Chrenko, F. J. Sánchez-Salcedo, Mauricio Reyes-Ruiz, Clément Baruteau, Alicia Moranchel-Basurto, Joanna Drążkowska, Gabriel-Dominique Marleau, Yasuhiro Hasegawa, Sonia Cornejo 10 pages, 9 figures, 1 table, accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) A nascent planet in a gas disk experiences radial migration due to the different torques which act on it. It has recently been shown that the torques produced by the gas and dust density variations around a non-accreting low-mass planet, the so-called cold thermal and dust streaming torques, can surpass each of the other torque components. We investigate how the total torque acting on the planet is affected by the presence of dust grains and their aerodynamic back-reaction on gas, while taking into account the cold thermal torque produced by thermal diffusion in the gas component. We perform high-resolution local and global three-dimensional two-fluid simulations within the pressureless-fluid dust approximation using the Fargo3D code. We explore the influence of different dust species parameterized by the Stokes number, focusing on non-accreting protoplanets with masses from one-third the mass of Mars to one Earth mass. The dust feedback has substantial impact on the asymmetry of the cold thermal lobes (which produce the cold thermal torque). However, the total torque is dominated by the dust torque when St $>10^{-2}$. The dust torque becomes more negative over time due to the formation of dust lobes that resemble the cold thermal lobes that form in the gas component. Therefore, the dust streaming torque prevails over the cold thermal torque. On the other hand, when St $\\leq10^{-2}$, the dust streaming torque is negligible and thus, the total torque on the planet comes from the gaseous component of the disk. Our results suggest that a planet embedded in a gas-dust disk may experience stagnant migration or inward runaway migration in regions of the protoplanetary disk where the dust is not fully coupled to the gas. However, this behaviour could change in regions with strong dust-gas coupling or in the inner transition region of the disk, where the cold thermal torque may become relevant.",
      "pdf_url": "https://arxiv.org/pdf/2511.01973.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02067",
      "title": "A JWST Transit of a Jupiter Analog I: Constraints on the Oblateness of Kepler-167e",
      "authors": [
        "Ben Cassese",
        "David Kipping",
        "Quentin Changeat",
        "Daniel A. Yahalomi",
        "Justin Vega",
        "Yayaati Chachan",
        "Billy Edwards",
        "Alex Teachey"
      ],
      "abstract": "A JWST Transit of a Jupiter Analog I: Constraints on the Oblateness of Kepler-167e Ben Cassese, David Kipping, Quentin Changeat, Daniel A. Yahalomi, Justin Vega, Yayaati Chachan, Billy Edwards, Alex Teachey Earth and Planetary Astrophysics (astro-ph.EP) In October 2024 JWST observed a transit of Kepler-167e, a Jupiter-analog planet on a 1000+ day orbit. These observations, recorded over a long baseline of nearly 60 hours, were designed to search for signatures of planetary oblateness and/or exomoons comparable to Ganymede. In this first in a series of studies analyzing these data we report on constraints on Kepler-167e's oblateness. We explored a large grid of data reduction pipelines and modeling choices, including a new entirely independent reduction pipeline (\"katahdin\") and two new treatments for limb darkening. We find that under a Bayesian model comparison framework the data are fit equally well by both spherical and oblate planet models, and that our ability to constrain the oblateness is negatively impacted by the influence of exposure-long trends. Using the most conservative of our posteriors, we place a 95% upper bound on the projected oblateness of $f<0.097$, which corresponds to a rotation period of $P\\geq7.11$ hours if the planet's spin axis is aligned with the sky plane. We note, however, that the final bound depends on the choice of reduction pipeline and systematics model, and that our suite of end-to-end analyses produced bounds as low as $f<0.065$ at 95%. We conclude that leveraging JWST to make tighter constraints on planetary oblateness will require further investigation into mitigating exposure-long trends and correlated noise.",
      "pdf_url": "https://arxiv.org/pdf/2511.02067.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}