{
  "date": "2026-01-25",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.CO",
    "astro-ph.HE",
    "astro-ph.IM",
    "astro-ph.GA"
  ],
  "total_papers": 118,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.15365",
      "title": "LISA and the LISA Science Team",
      "authors": [
        "Anna Heffernan"
      ],
      "abstract": "8 pages, written on behalf of the LISA Science Team and presented at Mathematical Methods for the General Relativistic Two-body Problem at NUS, Sinagpore Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) LISA, the Laser Interferometer Space Antenna, due to launch mid-2035, is a large class space mission by the European Space Agency (ESA). In partnership with NASA and ESA-member states, ESA is on track to launch what is expected to be the first space-based gravitational wave detector. By hosting detectors in space, one gains access to a lower frequency band of gravitational wave sources and with them, a plethora of new science. To maximise this scientific gain, ESA and NASA selected 20 scientists for the LISA Science Team, to carry out and/or lead necessary actions on the run up to LISA launch. We give a short overview and update of the LISA mission, some of its science objectives and related waveforms, as well as the work of the LISA Science Team as of December 2025.",
      "pdf_url": "https://arxiv.org/pdf/2601.15365.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.15542",
      "title": "Two Fluid Quantum Bouncing Cosmology I: Theoretical Model",
      "authors": [
        "Sandro D. P. Vitenti",
        "Nelson Pinto-Neto",
        "Patrick Peter",
        "Luiz Felipe Demétrio"
      ],
      "abstract": "Two Fluid Quantum Bouncing Cosmology I: Theoretical Model Sandro D. P. Vitenti, Nelson Pinto-Neto, Patrick Peter, Luiz Felipe Demétrio Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Bouncing cosmologies offer an alternative to inflation by resolving the initial singularity through a contracting phase followed by a bounce into expansion. In many such models, the contracting phase is dominated by a single matter component, typically pressureless dust, which leads to an almost scale-invariant spectrum of scalar cosmological perturbations with a slight blue tilt, so that generating the observed red-tilted spectrum within this framework was challenging. In this work, we consider a more realistic scenario in which the contracting phase includes both matter and radiation, as required on physical grounds. We show that the presence of radiation can naturally induce a red tilt in the spectrum of curvature perturbations seeded by quantum vacuum fluctuations in the remote past of the contraction. Since the perturbations of the two fluids are coupled via gravity, vacuum initial conditions must be carefully defined. We demonstrate that, without fine-tuning, the resulting entropy perturbations are subdominant with respect to curvature perturbations. This suggests that a minimal two-component bounce model, involving only ordinary matter and radiation, can connect to the standard expanding cosmology with observationally viable initial conditions.",
      "pdf_url": "https://arxiv.org/pdf/2601.15542.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15650",
      "title": "The initial spin matters: the impact of rapid rotation on magnetic-field amplification at merger",
      "authors": [
        "Harry Ho-Yin Ng",
        "Jin-Liang Jiang",
        "Luciano Rezzolla"
      ],
      "abstract": "The initial spin matters: the impact of rapid rotation on magnetic-field amplification at merger Harry Ho-Yin Ng, Jin-Liang Jiang, Luciano Rezzolla High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) A couple of milliseconds after the merger of a binary system of neutron stars can play a fundamental role in amplifying the comparatively low initial magnetic fields into magnetar strengths. The basic mechanism responsible for this amplification is the Kelvin-Helmholtz instability (KHI) and we here report the first systematic study of the impact of rapid rotation on the KHI-amplification process exploiting general-relativistic magnetohydrodynamic simulations at very high-resolutions of $35\\,{\\rm m}$. Concentrating on four different spinning configurations, we find that aligned, anti-aligned, and mixed (aligned/anti-aligned) spin configurations lead to markedly different growth rates of the electromagnetic (EM) energy, field topologies, and vortex properties when compared to the irrotational case. These differences arise from intrinsic variations in the system dynamics, such as tidal deformation, collision strength, and contact surface area, with the anti-aligned configuration producing the largest vorticity and growth in EM energy. Importantly, while different spin configurations lead to significantly different initial growth rates of the poloidal/toroidal components, all systems converge to a specific topological partition. Our simulations are confined to a short window in time, but the different EM energies produced as a result of spin will imprint the EM emission at merger and provide information on the spinning state at merger.",
      "pdf_url": "https://arxiv.org/pdf/2601.15650.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16048",
      "title": "Unveiling the Spectral Morphological Division of Fast Radio Bursts with CHIME/FRB Catalog 2",
      "authors": [
        "Wan-Peng Sun",
        "Yin-Long Cao",
        "Yong-Kun Zhang",
        "Ji-Guo Zhang",
        "Xiaohui Liu",
        "Yichao Li",
        "Fu-Wen Zhang",
        "Wan-Ting Hou",
        "Jing-Fei Zhang",
        "Xin Zhang"
      ],
      "abstract": "Unveiling the Spectral Morphological Division of Fast Radio Bursts with CHIME/FRB Catalog 2 Wan-Peng Sun, Yin-Long Cao, Yong-Kun Zhang, Ji-Guo Zhang, Xiaohui Liu, Yichao Li, Fu-Wen Zhang, Wan-Ting Hou, Jing-Fei Zhang, Xin Zhang High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Fast radio bursts (FRBs) are commonly divided into repeating and apparently non-repeating sources, but whether these represent distinct physical populations remains uncertain. In this work, we apply an unsupervised machine learning methods combining Uniform Manifold Approximation and Projection (UMAP) with density-based clustering to analyze CHIME/FRB Catalog 2. We find that FRBs remain primarily separated into two clusters in the multi-dimensional parameter space, with a recall of 0.94 for known repeaters, indicating strong robustness. Consistent with Catalog 1 analyses, we confirm that the spectral morphology parameter, specifically spectral running remains the key discriminator between the two populations, indicating that narrowband emission is an intrinsic and persistent property of repeating FRBs. With the enlarged Catalog 2 sample, we further identify a stable subclass of atypical repeaters (about $6\\%$ of repeating bursts) that are broadband, shorter in duration, and more luminous, resembling non-repeating bursts. The Nonrepeater-like cluster also shows higher inferred energies and dispersion measures, consistent with a scenario in which apparently non-repeating FRBs may result from observational incompleteness, with low-energy repeating bursts remaining undetected. Our results provide new statistical evidence for a physical connection between repeating and non-repeating FRBs.",
      "pdf_url": "https://arxiv.org/pdf/2601.16048.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2403.15979",
      "title": "Different effects of the Lorentz and Gaussian bump functions on the formation of primordial black holes and secondary gravitational waves",
      "authors": [
        "Wei Yang",
        "Yu-Xuan Kang",
        "Arshad Ali",
        "Tao-Tao Sui",
        "Chen-Hao Wu",
        "Ya-Peng Hu"
      ],
      "abstract": "Different effects of the Lorentz and Gaussian bump functions on the formation of primordial black holes and secondary gravitational waves Wei Yang, Yu-Xuan Kang, Arshad Ali, Tao-Tao Sui, Chen-Hao Wu, Ya-Peng Hu Physics of the Dark Universe 51 (2026) 102224 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Scalar perturbations in the inflation can be amplified when the base inflation potential $V_b(\\phi)$ incorporates a local bump $f(\\phi)$ such as $V(\\phi)=V_b(\\phi)(1+f(\\phi))$. This modification will lead to a peak in the curvature power spectrum, increasing a significant abundance of primordial black holes (PBHs). However, since there is no underlying physical reason for the choice of $f(\\phi)$, it is essential to investigate the effects of various bump functions on PBH generation. In this paper, we choose the well-known Starobinsky potential as the base inflation potential to compare the effects produced by different bumps, specifically focusing on the Lorentz and Gaussian bumps which are widely used. To clearly illustrate the differences between these two bumps, we keep parameters in bump functions the same. We find an interesting and novel result that the Lorentz cases manifest a stronger ability to enhance the power spectrum and produce more abundance of PBHs than Gaussian cases. Moreover, we also investigate the different effects of bump functions on the scalar-induced gravitational waves (SIGWs). The results indicate that the Lorentz bump generates SIGWs with a higher energy density, which can be potentially detected in the future. Our study gives valuable insights into the choice and constraints on the bump functions, and the different effects may distinguish the two bump cases for practical purposes in future experiments.",
      "pdf_url": "https://arxiv.org/pdf/2403.15979.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2409.13399",
      "title": "Cosmic acceleration and the Hubble tension from baryon acoustic oscillation data",
      "authors": [
        "Xuchen Lu",
        "Shengqing Gao",
        "Yungui Gong"
      ],
      "abstract": "Cosmic acceleration and the Hubble tension from baryon acoustic oscillation data Xuchen Lu, Shengqing Gao, Yungui Gong v3: Matches the version published in CPL Chinese Phys. Lett. 43 (2026) 011101 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate the null tests of cosmic accelerated expansion by using the Baryon Acoustic Oscillation (BAO) data measured by the Dark Energy Spectroscopic Instrument (DESI) and reconstruct the dimensionless Hubble parameter $E(z)$ from the DESI BAO Alcock-Paczynski (AP) data using Gaussian process to perform the null test. We find strong evidence of accelerated expansion from the DESI BAO AP data. By reconstructing the deceleration parameter $q(z)$ from the DESI BAO AP data, we find that accelerated expansion persisted until $z \\lesssim 0.7$ with a 99.7\\% confidence level. Additionally, to provide insights into the Hubble tension problem, we propose combining the reconstructed $E(z)$ with $D_H/r_d$ data to derive the model-independent result $r_d h=99.8\\pm 3.1$ Mpc. This result is consistent with measurements from cosmic microwave background (CMB) anisotropies using the $\\Lambda$CDM model. We also propose a model-independent method for reconstructing the comoving angular diameter distance $D_M(z)$ from the distance modulus $\\mu$ using SNe Ia data and combining this result with DESI BAO data of $D_M/r_d$ to constrain the value of $r_d$. We find that the value of $r_d$ derived from this model-independent method is smaller than that obtained from CMB measurements, with a significant discrepancy of at least 4.17$\\sigma$. All the conclusions drawn in this paper are independent of cosmological models and gravitational theories.",
      "pdf_url": "https://arxiv.org/pdf/2409.13399.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.13589",
      "title": "Distinguishing the Origin of Eccentric Black Hole Mergers with Gravitational-wave Spin Measurements",
      "authors": [
        "Jakob Stegmann",
        "Davide Gerosa",
        "Isobel Romero-Shaw",
        "Giulia Fumagalli",
        "Hiromichi Tagawa",
        "Lorenz Zwick"
      ],
      "abstract": "Distinguishing the Origin of Eccentric Black Hole Mergers with Gravitational-wave Spin Measurements Jakob Stegmann, Davide Gerosa, Isobel Romero-Shaw, Giulia Fumagalli, Hiromichi Tagawa, Lorenz Zwick Jakob Stegmann et al 2025 ApJL 994 L47 High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) It remains an open question whether the binary black hole mergers observed with gravitational-wave detectors originate from the evolution of isolated massive binary stars or were dynamically driven by perturbations from the environment. Recent evidence for non-zero orbital eccentricity in a handful of events is seen as support for a non-negligible fraction of the population experiencing external driving of the merger. However, it is unclear from which formation channel eccentric binary black-hole mergers would originate: dense star clusters, hierarchical field triples, active galactic nuclei, or wide binaries in the Galaxy could all be culprits. Here, we investigate whether the spin properties of eccentric mergers could be used to break this degeneracy. Using the fact that different formation channels are predicted to either produce eccentric mergers with mutually aligned or randomly oriented black-hole spins, we investigate how many confident detections would be needed in order for the two models to be statistically distinguishable. If a few percent of binary black hole mergers retain measurable eccentricity in the bandwidth of ground-based detectors, we report a $\\sim9\\,\\%$ chance that we could confidently distinguish both models (Bayes factor $\\ln\\mathcal{B}>3$) after the fifth observing run of the LIGO-Virgo-KAGRA detector network, $\\sim63\\,\\%$ for LIGO A#, and $\\sim98\\,\\%$ for the Einstein Telescope and Cosmic Explorer.",
      "pdf_url": "https://arxiv.org/pdf/2505.13589.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.01371",
      "title": "Self-bound hybrid stars with strong phase transitions can relieve major compact star observation tensions",
      "authors": [
        "Chen Zhang",
        "Juan M. Z. Pretel",
        "Renxin Xu"
      ],
      "abstract": "Self-bound hybrid stars with strong phase transitions can relieve major compact star observation tensions Chen Zhang, Juan M. Z. Pretel, Renxin Xu 15 pages, 5 figures; PRD accepted version High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); Nuclear Theory (nucl-th) Some recent pulsar observations cannot naturally fit into the conventional picture of neutron stars: the compact objects associated with HESS J1731-347 and XTE J1814-338 have too small radii in the low-mass regime, while the secondary component of GW190814 is too massive for neutron stars to be compatible with constraints from the GW170817 event. In this study, we demonstrate that all these anomalous observations and tensions, together with other conventional ones such as recent NICER observations of PSR J0740+6620, J0030+0451, and PSR J0437-4715, can be naturally explained simultaneously by a new general type of self-bound hybrid stars with large density discontinuities, and thus are radially stable in either the slow or rapid phase transition context. As a proof of concept, we use hybrid quark stars, inverted hybrid stars, and hybrid strangeon stars as benchmark examples to explicitly demonstrate the advantage and feasibility of self-bound hybrid stars with strong phase transitions in relieving all tensions related to compact stars' masses, radii, and tidal deformabilities.",
      "pdf_url": "https://arxiv.org/pdf/2507.01371.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "hep-ph",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.12998",
      "title": "Probing the millisecond pulsar origin of the $γ$-ray excess in the Galactic centre with LISA",
      "authors": [
        "Valeriya Korol",
        "Andrei Igoshev"
      ],
      "abstract": "Probing the millisecond pulsar origin of the $γ$-ray excess in the Galactic centre with LISA Valeriya Korol, Andrei Igoshev High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The gigaelectronvolt $\\gamma$-ray excess observed towards the Galactic centre remains unexplained. While dark matter annihilation has long been considered a leading explanation, an alternative scenario involving a large population of millisecond pulsars remains viable. Testing this hypothesis with electromagnetic observations is difficult, as pulsar searches in the bulge are strongly affected by interstellar scattering, high sky temperature, and source confusion. We investigate whether gravitational-wave observations with the Laser Interferometer Space Antenna (LISA) could provide an independent probe of the millisecond pulsar binary population in the Galactic bulge in the future. We constructed synthetic populations of detached millisecond pulsar-white dwarf binaries under two illustrative formation scenarios: an accreted scenario, in which systems are deposited by disrupted globular clusters, and an in situ scenario, in which binaries form through isolated binary evolution. In both cases, only $10^{-5}$-$10^{-4}$ of the underlying bulge population is detectable by LISA. Still, even a few detections would imply tens to hundreds of thousands of unseen systems. Accreted binaries are expected to have lower chirp masses ($\\sim$0.4 M$_\\odot$), while in situ binaries produce more massive companions ($\\sim$0.9 M$_\\odot$), though part of this contrast reflects our modelling assumptions. LISA will measure binary frequencies with high precision, but chirp masses can only be determined for the most massive or highest-frequency systems. Thus, identifying millisecond-pulsar binaries among the far more numerous double white dwarfs will be challenging, as their gravitational-wave signals alone are indistinguishable. However, coordinated follow-up with the Square Kilometre Array of LISA-selected targets could directly test the millisecond-pulsar explanation of the $\\gamma$-ray excess.",
      "pdf_url": "https://arxiv.org/pdf/2509.12998.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.13884",
      "title": "The effect of matter discreteness on gravitational wave propagation in post-geometrical optics",
      "authors": [
        "Sena Atli",
        "Syksy Rasanen"
      ],
      "abstract": "The effect of matter discreteness on gravitational wave propagation in post-geometrical optics Sena Atli, Syksy Rasanen v2. 10+3 pages, no figures. Added references and clarifications. Published version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The gravitational wave equation of motion includes direct coupling to the Riemann tensor. The curvature terms are usually neglected, but they can be large at the location of matter particles and impact the angular diameter distance. We apply the recently introduced post-geometrical optics approximation that includes curvature to gravitational wave propagation. Assuming that particles are localised within their Compton wavelength, the curvature due to electrons leads to a large effect on the angular diameter distance, but caustic formation invalidates the post-geometrical optics approximation. We conclude that the interesting regime of validity of the approximation is limited, as it ceases to apply when the curvature effects become large. Other methods are needed to evaluate the effect of curvature spikes, and the localisation of particles due to decoherence also needs further work.",
      "pdf_url": "https://arxiv.org/pdf/2509.13884.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.05512",
      "title": "Hidden pattern of self-invariant cosmic expansion: Empirical evidence from Hubble diagram of supernovae",
      "authors": [
        "Hoang Ky Nguyen"
      ],
      "abstract": "Hidden pattern of self-invariant cosmic expansion: Empirical evidence from Hubble diagram of supernovae Hoang Ky Nguyen 7 pages, 4 figures. More References added. Typos in Appendix B corrected Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present empirical evidence extracted directly from the Pantheon Catalog of SNeIa demonstrating that the speed of light varies as the universe expands. Moreover, the speed of light must vary in a specific quantifiable manner. To show this, we reformulate the kinematics of late-time acceleration using Dolgov's power-law cosmology $a=(t/t_0)^\\mu$ [Phys. Rev. D 55, 5881 (1997)] and Barrow's varying speed of light $c=c_0a^{-\\zeta}$ [Phys. Rev. D 59, 043515 (1999)]. In this cosmology, light traveling through an expanding universe undergoes an additional refraction caused by the varying c along its path, resulting in a modified Lemaitre redshift formula $1+z=a^{-(1+\\zeta)}$. The new model achieves a high-quality fit to the Pantheon Catalog of SNeIa and exhibits a strong degeneracy along the locus $(1+\\zeta)\\,\\mu=1$. This empirical relation indicates a self-invariant cosmic evolution: at all instants during the late-time epoch, the speed of light is exactly proportional to the rate of cosmic expansion, viz. $c=\\mu^{-1}c_0t_0\\,da/dt$, a characteristic that is absent in the $\\Lambda$CDM model. This synchronous behavior between $c$ and $da/dt$ carries profound cosmological implications that we will discuss, regarding (i) the nature of late-time acceleration; (ii) a resolution to the horizon problem; (iii) Kolb's coasting universe model [Astrophys. J. 344, 543 (1989)]; (iv) a generalized cosmological principle into the time domain; and (v) a novel conformally flat metric applicable to cosmology. This newfound kinematic $c\\propto da/dt$ relation represents a stringent requirement that any viable dynamical model of cosmology must satisfy, a requirement that the $\\Lambda$CDM model does not fulfill. Thus, our paper delivers the clearest and most decisive evidence to date that challenges the standard $\\Lambda$CDM paradigm of cosmology and calls for variable-$c$ modifications to General Relativity.",
      "pdf_url": "https://arxiv.org/pdf/2601.05512.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15378",
      "title": "The Back-in-time Void Finder: dynamical identification of cosmic voids through optimal transport reconstruction",
      "authors": [
        "Simone Sartori",
        "Sofia Contarini",
        "Elena Sarpa",
        "Giulia Degni",
        "Federico Marulli",
        "Stephanie Escoffier",
        "Lauro Moscardini"
      ],
      "abstract": "The Back-in-time Void Finder: dynamical identification of cosmic voids through optimal transport reconstruction Simone Sartori, Sofia Contarini, Elena Sarpa, Giulia Degni, Federico Marulli, Stephanie Escoffier, Lauro Moscardini Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmic voids have increasingly emerged as a powerful cosmological probe. However, their large spatial extent and intrinsically underdense environments make their identification highly sensitive to shot noise, redshift-space distortions (RSD), and observational systematics, particularly for topological and density-based void definitions. We introduce the Back-In-Time Void Finder (BitVF), a novel dynamical and physically motivated algorithm that identifies cosmic voids as regions of negative divergence of the Lagrangian displacement field reconstructed from the present-day tracer distribution. The reconstruction relies on an optimized discrete optimal transport algorithm that recovers the backward-in-time dynamics of tracers, naturally accounting for tracer bias without relying on cosmological assumptions. We validate BitVF against the widely used topological void finder REVOLVER using high-resolution N-body simulations, showing that it produces void catalogs with smoother and more physically motivated density profiles, as well as abundances that are more stable under tracer subsampling and shot noise. We further apply it to realistic DESI-like mock light-cone galaxy catalogs, demonstrating that it intrinsically mitigates redshift-space systematic effects, preserving real-space void size functions more faithfully than topological methods. Modeling RSD, the reconstruction can be combined with a fiducial cosmology and an assumed tracer bias within a bias-corrected Kaiser framework, yielding reconstructed-space void catalogs consistent with real-space statistics across redshift. Its performance is characterized as a function of the main internal parameters, showing an optimal balance between accuracy, computational efficiency, and applicability to stage IV galaxy surveys. BitVF will be publicly released within the CosmoBolognaLib.",
      "pdf_url": "https://arxiv.org/pdf/2601.15378.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15460",
      "title": "Constraining nonminimal f(T) gravity from Primordial Nucleosynthesis to Late-Universe observations",
      "authors": [
        "Yahia Al-Omar",
        "Majida Nahili",
        "Nidal Chamoun"
      ],
      "abstract": "Constraining nonminimal f(T) gravity from Primordial Nucleosynthesis to Late-Universe observations Yahia Al-Omar, Majida Nahili, Nidal Chamoun Results in Physics, 81 (2026) 108587 Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a multi-epoch test of f(T) gravity with nonminimal torsion-matter coupling, combining early- and late-Universe observations. At the MeV scale, Big-Bang Nucleosynthesis constrains the fractional variation of the weak freeze-out temperature, |{\\delta}{\\tau}_f/{\\tau}_f|, thereby mapping light-element abundances into limits on deviations from the standard expansion history. At low redshift, we confront the model with type Ia supernovae, baryon acoustic oscillations, and cosmic-chronometer data, which respectively probe distances, the late-time standard ruler, and the Hubble rate. Independent analyses highlight the complementary roles of each dataset, while a joint SNe Ia + BAO + CC fit breaks degeneracies and yields the tightest combined bounds. As an illustration, we examine two representative torsion-modified gravity scenarios: BBN strongly limits large departures from standard cosmology, whereas late-time probes remain compatible with a near-{\\Lambda}CDM background. This unified approach demonstrates the power of linking early-Universe nuclear physics with precision cosmological observables in assessing torsional extensions of gravity.",
      "pdf_url": "https://arxiv.org/pdf/2601.15460.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15583",
      "title": "Mapping dark matter and the emergence of large-scale structure",
      "authors": [
        "Jon Loveday",
        "Jochen Liske",
        "Ivan K. Baldry",
        "Simon P. Driver",
        "Aaron Robotham",
        "Sabine Bellstedt",
        "Luke Davies",
        "Trystan Lambert"
      ],
      "abstract": "Mapping dark matter and the emergence of large-scale structure Jon Loveday, Jochen Liske, Ivan K. Baldry, Simon P. Driver, Aaron Robotham, Sabine Bellstedt, Luke Davies, Trystan Lambert White paper submitted to ESO Expanding Horizons initiative 2025 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We discuss a potential survey to map dark matter and the emergence of large-scale structure to redshift z ~ 1.5 (baseline) or z~3.5 (with near-IR extension) using a massively multiplexed spectrograph on a 10m-class telescope, such as the proposed Widefield Spectroscopic Telescope.",
      "pdf_url": "https://arxiv.org/pdf/2601.15583.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15718",
      "title": "Fuzzy dark matter soliton core hosting a supermassive black hole as a dense low-mass perturber in strong gravitational lensing",
      "authors": [
        "Masamune Oguri",
        "Naoi Kubo"
      ],
      "abstract": "Fuzzy dark matter soliton core hosting a supermassive black hole as a dense low-mass perturber in strong gravitational lensing Masamune Oguri, Naoi Kubo Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recent high-resolution imaging observations of strong lens systems reveal dense low-mass perturbers. We propose a soliton core, whose central density is boosted by a supermassive black hole (SMBH), in the fuzzy dark matter (FDM) model as an efficient perturber in strong gravitational lensing. The higher central density makes it less efficient in the tidal mass loss, and leads to the higher impact in gravitational lensing. We show that the mass profile of a $\\sim 10^6M_\\odot$ perturber in JVAS B1938+666, which does not resemble any known astronomical object, can be wel explained by a soliton core in the FDM model with the mass of $4\\times 10^{-21}$eV hosting an SMBH with the mass of $4\\times 10^5M_\\odot$. The high mass of the SMBH may be explained by several scenarios that predcit heavy SMBH seeds such as the direct collapse black hole formation and primordial black holes.",
      "pdf_url": "https://arxiv.org/pdf/2601.15718.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15851",
      "title": "Intrinsic alignments in the FLAMINGO simulations with two-point statistics",
      "authors": [
        "A. Herle",
        "N. E. Chisari",
        "H. Hoekstra",
        "D. Navarro-Gironés",
        "M. Schaller",
        "J. Schaye"
      ],
      "abstract": "Intrinsic alignments in the FLAMINGO simulations with two-point statistics A. Herle, N. E. Chisari, H. Hoekstra, D. Navarro-Gironés, M. Schaller, J. Schaye Cosmology and Nongalactic Astrophysics (astro-ph.CO) Intrinsic alignments are a major astrophysical contaminant for next generation large-sky surveys like Euclid and LSST. Large hydrodynamic simulations are crucial for informing the alignment modelling for these surveys. We measure position-position and position-shape correlations of a Luminous Red Galaxy sample from the FLAMINGO suite of hydrodynamical simulations, measuring the alignment signal for more than 4.9 million galaxies at redshift 0. We jointly model the clustering and alignment correlations to provide the tightest constraints on the alignment amplitude to date from a hydrodynamic simulation. We find that both the Non-Linear Alignment (NLA) and the more complex Tidal Alignment Tidal Torquing (TATT) models provide good fits to the data. We compare the measured $A_1$ amplitude to observational data and find good agreement. We measure the dependence of the NLA and TATT free parameters on halo mass. We also introduce a mass-dependent TATT model, TATT-M, by finding empirical relations between the halo mass and the TATT parameters. This allows us to fit TATT with only one parameter, $A_1$, with $A_2/A_1$ being a constant and $A_{1\\delta}/A_1$ being a function of halo mass. Using a Bayesian approach, we find that TATT-M is very strongly preferred by the data over NLA. Using the baryonic feedback variations of the FLAMINGO simulation suite, we test whether the TATT parameters are sensitive to feedback. Variations in AGN and supernova feedback do not significantly change the alignment amplitude beyond the change associated with the dependence of galaxy stellar mass on the strength of feedback. Our results inform the IA modelling for upcoming surveys by providing guidance on model choices, priors and sensitivities to feedback.",
      "pdf_url": "https://arxiv.org/pdf/2601.15851.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15935",
      "title": "Enhancing Thermal Sunyaev-Zel'dovich Analyses with Digital Twins of the Local Universe",
      "authors": [
        "Richard Stiskalek",
        "Harry Desmond"
      ],
      "abstract": "Enhancing Thermal Sunyaev-Zel'dovich Analyses with Digital Twins of the Local Universe Richard Stiskalek, Harry Desmond 14 pages, 7 figures. To be submitted to OJA Cosmology and Nongalactic Astrophysics (astro-ph.CO) The thermal Sunyaev-Zel'dovich (tSZ) effect provides a powerful probe of the thermal pressure of ionised gas in galaxy clusters and the cosmic web; constrained simulations reconstruct the mass and velocity fields of the local Universe. We explore how these two may be mutually informative: the tSZ signal provides a benchmark for assessing the fidelity of constrained simulations, and constrained simulations contribute information on the positions, total masses and density profiles of cosmic web structures for use in tSZ studies. We focus on cluster predictions in the Bayesian Origin Reconstruction from Galaxies (BORG) paradigm, introducing CSiBORG-Manticore, a new state-of-the-art suite of digital twins -- data-constrained posterior simulations whose initial conditions are inferred via Bayesian forward modelling. We develop a framework for scoring constrained simulations on their ability to match measured Compton-$y$ maps from Planck for cluster cutouts, and use it to demonstrate improvement from previous BORG reconstructions. We further validate halo masses against weak-lensing-calibrated X-ray masses from eROSITA. We also show how high-fidelity digital twins offer a practical route to extracting additional information from tSZ data through a novel calibration of the mass-observable relation, and provide a complementary framework to purely statistical analyses of Compton-$y$ maps. This paves the way for integrating the large-scale structure information inherent in constrained simulations into the study of CMB secondary anisotropies.",
      "pdf_url": "https://arxiv.org/pdf/2601.15935.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16165",
      "title": "Reanalyzing DESI DR1: 4. Percent-Level Cosmological Constraints from Combined Probes and Robust Evidence for the Normal Neutrino Mass Hierarchy",
      "authors": [
        "Mikhail M. Ivanov",
        "James M. Sullivan",
        "Shi-Fan Chen",
        "Anton Chudaykin",
        "Mark Maus",
        "Oliver H. E. Philcox"
      ],
      "abstract": "Reanalyzing DESI DR1: 4. Percent-Level Cosmological Constraints from Combined Probes and Robust Evidence for the Normal Neutrino Mass Hierarchy Mikhail M. Ivanov, James M. Sullivan, Shi-Fan Chen, Anton Chudaykin, Mark Maus, Oliver H. E. Philcox Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We present cosmological parameters measurements from the full combination of DESI DR1 galaxy clustering data described with large-scale structure effective field theory. By incorporating additional datasets (photometric galaxies and CMB lensing cross-correlations) and extending the bispectrum likelihood to smaller scales using a consistent one-loop theory computation, we achieve substantial gains in constraining power relative to previous analyses. Combining with the latest DESI baryon acoustic oscillation data and using cosmic microwave background (CMB) priors on the power spectrum tilt and baryon density, we obtain tight constraints on the $\\Lambda$CDM model, finding the Hubble constant $H_0=69.08\\pm 0.37~\\mathrm{km}\\,\\mathrm{s}^{-1}\\mathrm{Mpc}^{-1}$, the matter density fraction $\\Omega_m=0.2973\\pm 0.0050$, and the mass fluctuation amplitude $\\sigma_8 = 0.815\\pm 0.016$ (or the lensing parameter $S_8\\equiv\\sigma_8\\sqrt{\\Omega_m/0.3}=0.811\\pm 0.016$), corresponding to $0.6\\%$, $1.7\\%$, and $2\\%$ precision respectively. Adding the Pantheon+ supernova sample (SNe), we find a preference of $2.6\\sigma$ for the $w_0w_a$ dynamical dark energy model from low-redshift data alone, which increases to $2.8\\sigma$ when exchanging the SNe with Planck CMB data. Combining full-shape data with BAO, CMB, and SNe likelihoods, we improve the dark energy figure-of-merit by $18\\%$ and bound the sum of the neutrino masses to $M_\\nu<0.057$ eV in $\\Lambda$CDM and $M_\\nu<0.095$ eV in the $w_0w_a$ dynamical dark energy model (both at 95\\% CL). This represents an improvement of $25\\%$ over the background expansion constraints and the strongest bound on neutrino masses in $w_0w_a$CDM to date. Our results suggest that the preference for the normal ordering of neutrino mass states holds regardless of the cosmological background model, and is robust in light of tensions between cosmological datasets.",
      "pdf_url": "https://arxiv.org/pdf/2601.16165.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ex",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16197",
      "title": "Constraining dark energy models using Jackknife and Bootstrap resampling",
      "authors": [
        "Roshna K",
        "Nikhil Fernandes",
        "P Praveen",
        "V. Sreenath"
      ],
      "abstract": "Constraining dark energy models using Jackknife and Bootstrap resampling Roshna K, Nikhil Fernandes, P Praveen, V. Sreenath Cosmology and Nongalactic Astrophysics (astro-ph.CO) Analyses of type Ia supernovae have helped us shed light on the existence and nature of dark energy. Most of these analyses have relied on Bayesian techniques. In this work, we rely on resampling techniques to analyse supernova data. In particular, we use the generalised least squares method together with Jackknife and Bootstrap techniques to estimate parameters of $\\Lambda$CDM, flat $\\Lambda$CDM, $w$CDM, flat $w$CDM, and flat $w_0\\,w_a$CDM models from the recent PantheonPlus and SH0ES data. For completeness, we also perform Bayesian analysis using Markov chain Monte Carlo (MCMC) and nested sampling algorithms, and compare the results. We note that resampling techniques can help highlight the limitations of the data. For instance, we see that the Jackknife method estimates a strong positive correlation between $h$ and $M$ and higher standard deviations for both. This may have significant implications for the Hubble tension. We conclude with a discussion of our results.",
      "pdf_url": "https://arxiv.org/pdf/2601.16197.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15844",
      "title": "Radio-Interferometric Image Reconstruction with Denoising Diffusion Restoration Models",
      "authors": [
        "Michel Morales",
        "Emma Tolley",
        "Remi Poitevineau"
      ],
      "abstract": "Radio-Interferometric Image Reconstruction with Denoising Diffusion Restoration Models Michel Morales, Emma Tolley, Remi Poitevineau Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Reconstructing images of the radio sky from incomplete Fourier information is a key challenge in radio astronomy. In this work, we present a method for radio interferometeic image reconstruction using a data-driven prior for the radio sky based on denoising diffusion probabilistic models (DDPMs). We first train a DDPM on radio galaxy observations from the VLA FIRST survey. We create simulated VLA, EHT, and ALMA observations of radio galaxies, then use an unsupervised posterior sampling method called Denoising Diffusion Restoration Models (DDRM) to reconstruct the corresponding images, using our DDPM as a prior. Our approach is agnostic to the measured radio interferometric data and naturally incorporates the physics of the measurement process. We are able to reconstruct images with very high fidelity PSNR>60, a marked improvement over CLEAN and similar image reconstruction methods using conditional DDPMs",
      "pdf_url": "https://arxiv.org/pdf/2601.15844.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15956",
      "title": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: Photometric Catalog",
      "authors": [
        "Brant E. Robertson , Benjamin D. Johnson , Sandro Tacchella , Daniel J. Eisenstein , Kevin Hainline , Stacey Alberts , Santiago Arribas , William M. Baker , Andrew J. Bunker , Alex J. Cameron , Stefano Carniani , Courtney Carreira , Jacopo Chevallard , Chiara Circosta , Emma Curtis-Lake , A. Lola Danhaive , Qiao Duan , Eiichi Egami , Ryan Hausen , Jakob M. Helton , Zhiyuan Ji , Roberto Maiolino , Pablo G. Pérez-González , Dávid Puskás , Marcia Rieke , Pierluigi Rinaldi , Fengwu Sun , Yang Sun , Hannah Übler , James A. A. Trussler , Natalia C. Villanueva , Lily Whitler , Christina C. Williams , Christopher N. A. Willmer , Chris Willott , Zihao Wu , Yongda Zhu University of California, Santa Cruz, Center for Astrophysics | Harvard and Smithsonian, Kavli Institute for Cosmology, University of Cambridge, Cavendish Laboratory, University of Cambridge, Steward Observatory, University of Arizona, AURA for the European Space Agency, Space Telescope Science Institute, Centro de Astrobiología , CSIC-SINTA, DARK, Niels Bohr Institute, University of Oxford, Scuola Normale Superiore, Pisa, Institut de Radioastronomie Millimétrique , University of Hertfordshire, The Johns Hopkins University, Pennsylvania State University, University College London, Space Telescope Science Institute, Max-Planck-Institut für extraterrestrische Physik , The University of Texas at Austin, NSF National Optical-Infrared Astronomy Research Laboratory, NRC Herzberg)"
      ],
      "abstract": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: Photometric Catalog Brant E. Robertson (1), Benjamin D. Johnson (2), Sandro Tacchella (3, 4), Daniel J. Eisenstein (2), Kevin Hainline (5), Stacey Alberts (5, 6), Santiago Arribas (7), William M. Baker (8), Andrew J. Bunker (9), Alex J. Cameron (9), Stefano Carniani (10), Courtney Carreira (1), Jacopo Chevallard (9), Chiara Circosta (11), Emma Curtis-Lake (12), A. Lola Danhaive (3, 4), Qiao Duan (3, 4), Eiichi Egami (5), Ryan Hausen (13), Jakob M. Helton (14), Zhiyuan Ji (5), Roberto Maiolino (3, 4, 15), Pablo G. Pérez-González (7), Dávid Puskás (3, 4), Marcia Rieke (5), Pierluigi Rinaldi (16), Fengwu Sun (2), Yang Sun (5), Hannah Übler (17), James A. A. Trussler (2), Natalia C. Villanueva (18), Lily Whitler (3, 4), Christina C. Williams (19), Christopher N. A. Willmer (5), Chris Willott (20), Zihao Wu (2), Yongda Zhu (5) ((1) University of California, Santa Cruz, (2) Center for Astrophysics | Harvard and Smithsonian, (3) Kavli Institute for Cosmology, University of Cambridge, (4) Cavendish Laboratory, University of Cambridge, (5) Steward Observatory, University of Arizona, (6) AURA for the European Space Agency, Space Telescope Science Institute, (7) Centro de Astrobiología (CAB), CSIC-SINTA, (8) DARK, Niels Bohr Institute, (9) University of Oxford, (10) Scuola Normale Superiore, Pisa, (11) Institut de Radioastronomie Millimétrique (IRAM), (12) University of Hertfordshire, (13) The Johns Hopkins University, (14) Pennsylvania State University, (15) University College London, (16) Space Telescope Science Institute, (17) Max-Planck-Institut für extraterrestrische Physik (MPE), (18) The University of Texas at Austin, (19) NSF National Optical-Infrared Astronomy Research Laboratory, (20) NRC Herzberg) Submitted to AAS Journals. Temporary data access available at this https URL . Permanent data access at this https URL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) JADES Data Release 5 (DR5) photometric catalogs and describes the methodologies used for source detection, deblending, photometry, uncertainty estimation, and catalog curation. The catalogs are constructed from 35 space-based imaging mosaics obtained with JWST/NIRCam, JWST/MIRI, HST/ACS, and HST/WFC3, combining approximately 1250 hours of JADES imaging with extensive additional public JWST and HST observations in the GOODS fields. Sources are identified using custom signal-to-noise-based detection and deblending algorithms optimized for the depth, resolution, and complex point-spread-function structure of JWST imaging. Source centroids, shapes, and photometric apertures are determined using a new fast two-dimensional Gaussian regression method applied to detection-image profiles. We provide forced circular-aperture photometry, ellipsoidal Kron photometry, and curve-of-growth measurements for every source in every band. We introduce a new pixel-level regression framework to model photometric uncertainties as a function of aperture size and local mosaic properties, accounting for correlated noise in heterogeneous JWST mosaics. Photometric redshifts are computed using template-based fitting applied to both small-aperture photometry on unconvolved images and Kron photometry on common-PSF mosaics. The JADES DR5 catalogs supersede previous JADES photometric releases, and are publicly released through the Mikulski Archive for Space Telescopes and an interactive web interface.",
      "pdf_url": "https://arxiv.org/pdf/2601.15956.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16170",
      "title": "The FarView Low Frequency Radio Array on the Moon's Far Side: Science and Array Architecture",
      "authors": [
        "Jack O. Burns",
        "Judd Bowman",
        "Tzu-Ching Chang",
        "Gregg Hallinan",
        "Alex Hegedus",
        "Nivedita Mahesh",
        "Bang Nhan",
        "Jonathan Pober",
        "Ronald Polidan",
        "Willow Smith",
        "Nithyanandan Thyagarajan"
      ],
      "abstract": "The FarView Low Frequency Radio Array on the Moon's Far Side: Science and Array Architecture Jack O. Burns, Judd Bowman, Tzu-Ching Chang, Gregg Hallinan, Alex Hegedus, Nivedita Mahesh, Bang Nhan, Jonathan Pober, Ronald Polidan, Willow Smith, Nithyanandan Thyagarajan 42 pages, 27 figures, final report for a Phase II NASA Innovative Advanced Concepts (NIAC) design study Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) FarView is a proposed low frequency radio interferometer for deployment on the lunar far side, enabled by the Moon's radio quiet environment. Operating over 1-50 MHz inaccessible from Earth, FarView will open a new observational window and promote discovery class science in cosmology, heliophysics, Galactic and exoplanet astrophysics. The primary science is measurement of the redshifted 21 cm signal from the Cosmic Dark Ages (z=30-100), identified by the Astro2020 Decadal Survey as a priority cosmology discovery area. FarView will deliver 3D tomographic measurements and precision power spectra of neutral hydrogen in a largely linear regime, enabling tests of inflationary initial conditions, primordial non Gaussianity, dark matter properties, neutrino masses, and early dark energy. The reference design consists of 100000 crossed dipole antennas in a dense core-halo configuration spanning 200 sq km. A compact 4 km core with 83000 dipoles maximizes sensitivity to large scale cosmological modes, while 20000 halo elements extending to 14 km provide angular resolution and calibration for foreground characterization. Sensitivity forecasts indicate a 10-sigma detection of the Dark Ages 21 cm power spectrum at z=30 over five years of half duty cycle lunar night observations. An FFT-based EPIC beamformer is identified as an efficient signal processing architecture. Beyond cosmology, FarView will enable interferometric imaging of low frequency solar radio bursts, advancing space weather studies. Additional capabilities include stellar space weather observations, Galactic cosmic ray tomography via free-free absorption, and searches for auroral radio emission from exoplanet magnetospheres, a probe of exoplanet habitability. FarView represents a flagship class opportunity to establish the Moon as a platform for foundational astrophysics while delivering unique observational capabilities.",
      "pdf_url": "https://arxiv.org/pdf/2601.16170.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2409.05326",
      "title": "Running the small-correlated-against-large estimator at scale: Applications of small-scale CMB lensing estimators on realistic simulations",
      "authors": [
        "Victor C. Chan",
        "Renée Hložek",
        "Joel Meyers",
        "Alexander van Engelen"
      ],
      "abstract": "Running the small-correlated-against-large estimator at scale: Applications of small-scale CMB lensing estimators on realistic simulations Victor C. Chan, Renée Hložek, Joel Meyers, Alexander van Engelen 19 pages, 9 figures, 6 tables, Published in PRD Phys. Rev. D 113, 023535, Published 21 January, 2026 Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Small-Correlated-Against-Large Estimator (SCALE) for small-scale lensing of the cosmic microwave background (CMB) provides a novel method for measuring the amplitude of CMB lensing power without the need for reconstruction of the lensing field. In our previous study, we showed that the SCALE method can outperform existing reconstruction methods to detect the presence of lensing at small scales ($\\ell \\gg 3000$). Here we develop a procedure to include information from SCALE in cosmological parameter inference. We construct a precise neural network emulator to quickly map cosmological parameters to desired CMB observables such as temperature and lensing power spectra and SCALE cross spectra. We also outline a method to apply SCALE to full-sky maps of the CMB temperature field, and construct a likelihood for the application of SCALE in parameter estimation. SCALE supplements conventional observables such as the CMB power spectra and baryon acoustic oscillations in constraining parameters that are sensitive to the small-scale lensing amplitude such as the neutrino mass $m_\\nu$. We show that including estimates of the small-scale lensing amplitude from SCALE in such an analysis provides enough constraining information to measure the minimum neutrino mass at $4\\sigma$ significance in the scenario of minimal mass, and higher significance for higher mass. Finally, we show that SCALE will play a powerful role in constraining models of clustering that generate scale-dependent modulation to the distribution of matter and the lensing power spectrum, as predicted by models of warm or fuzzy dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2409.05326.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.12556",
      "title": "Group Therapy for Halos: Advancing Halo Mass Estimation for Galaxy Groups",
      "authors": [
        "Welsey Van Kempen",
        "Michelle E. Cluver",
        "Edward N. Taylor",
        "Darren J. Croton",
        "Trystan S. Lambert",
        "Claudia del P. Lagos"
      ],
      "abstract": "Group Therapy for Halos: Advancing Halo Mass Estimation for Galaxy Groups Welsey Van Kempen, Michelle E. Cluver, Edward N. Taylor, Darren J. Croton, Trystan S. Lambert, Claudia del P. Lagos 18 Pages, 10 Figures and 4 tables. Abridged abstract Publications of the Astronomical Society of Australia. Published online 2026:1-18 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Accurate estimation of dark matter halo masses for galaxy groups is central to studies of galaxy evolution and for leveraging group catalogues as cosmological probes. We present a calibration and evaluation of two complementary halo mass estimators: a dynamical estimator based on the virial theorem, and an empirical relation between the sum of the stellar masses of the three most massive group galaxies and the halo mass (SHMR). Using state-of-the-art semi-analytic models (SHARK, SAGE, and GAEA) to generate mock light-cone catalogues, we quantify the accuracy, uncertainty, and model dependence of each method. The calibrated virial theorem achieves negligible systematic bias (mean $\\Delta$ = -0.01 dex) and low scatter (mean $\\sigma$ = 0.20 dex) with no sensitivity to baryonic physics. The calibrated SHMR yields the highest precision (mean $\\Delta$ = 0.02 dex, mean $\\sigma$ = 0.14 dex) but shows greater model dependence due to sensitivity to baryonic physics across the models. We demonstrate applications to observational catalogues, including the empirical halo mass function and mapping quenched fractions in the stellar mass-halo mass plane. We provide guidance: the virial theorem is recommended for GAMA-like surveys (i < 19.2) at z < 0.1 where minimal model dependence is required, while the SHMR is optimal for high-precision halo mass estimates across diverse catalogues with limits of z < 0.3. These calibrated estimators will aid upcoming wide-area spectroscopic surveys in probing the connection between galaxies and their host dark matter halos.",
      "pdf_url": "https://arxiv.org/pdf/2508.12556.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.01881",
      "title": "One latent to fit them all: a unified representation of baryonic feedback on matter distribution",
      "authors": [
        "Shurui Lin",
        "Yin Li",
        "Shy Genel",
        "Francisco Villaescusa-Navarro",
        "Biwei Dai",
        "Wentao Luo",
        "Yang Wang"
      ],
      "abstract": "One latent to fit them all: a unified representation of baryonic feedback on matter distribution Shurui Lin, Yin Li, Shy Genel, Francisco Villaescusa-Navarro, Biwei Dai, Wentao Luo, Yang Wang 10 pages and 5 figures in the main text; 9 pages, 7 figures, and 4 tables in the appendix Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Accurate and parsimonious quantification of baryonic feedback on matter distribution is of crucial importance for understanding both cosmology and galaxy formation from observational data. This is, however, challenging given the large discrepancy among different models of galaxy formation simulations, and their distinct subgrid physics parameterizations. Using 5,072 simulations from 4 different models covering broad ranges in their parameter spaces, we find a unified 2D latent representation. Compared to the simulations and other phenomenological models, our representation is independent of both time and cosmology, much lower-dimensional, and disentangled in its impacts on the matter power spectra. The common latent space facilitates the comparison of parameter spaces of different models and is readily interpretable by correlation with each. The two latent dimensions provide a complementary representation of baryonic effects, linking black hole and supernova feedback to distinct and interpretable impacts on both the matter power spectrum, and field, level. Our approach enables developing robust and economical analytic models for optimal gain of physical information from data, and is generalizable to other fields with significant modeling uncertainty.",
      "pdf_url": "https://arxiv.org/pdf/2509.01881.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.02148",
      "title": "Enhancing the detectability of ionized Regions during the Epoch of Reionization",
      "authors": [
        "Rutvik Ashish Mahajan",
        "Raghunath Ghara",
        "Nishant Pradeep Deo",
        "Arnab Mishra"
      ],
      "abstract": "Enhancing the detectability of ionized Regions during the Epoch of Reionization Rutvik Ashish Mahajan, Raghunath Ghara, Nishant Pradeep Deo, Arnab Mishra 24 pages, 13 figures, Accepted for publication in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present an improved matched filter method for detecting large ionized regions in 21 cm observations of the Epoch of Reionization. In addition to detection, the method constrains the properties of these regions, offering insights into the underlying source populations. Extending a previously developed Bayesian framework, we replace the spherical filter with an eight-parameter spheroidal filter, enabling a more flexible characterization of ionized bubbles. This enhancement significantly improves both detectability and recovery of bubble orientations. For a representative reionization scenario with mean ionization fraction $0.4$ at $z=7$, we find that a $10\\sigma$ detection of the largest ionized region can be achieved with $\\sim 1$ h of observations using the SKA-low AA4 and AA$^{\\star}$ layouts. Our method can help identify regions in the observed field that host large ionized bubbles, making them prime targets for deeper follow-up observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.02148.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.11993",
      "title": "STRAWBERRY: Finding haloes in the gravitational potential",
      "authors": [
        "Tamara R. G. Richardson",
        "Jens Stücker",
        "Raul E. Angulo"
      ],
      "abstract": "STRAWBERRY: Finding haloes in the gravitational potential Tamara R. G. Richardson, Jens Stücker, Raul E. Angulo 15 pages, 16 figures, Accepted in A&A, public code: this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) Here, we present a novel algorithm that discriminates between bound and unbound particles by consideration of the gravitational potential from an accelerated reference frame -- also referred to as `the boosted potential'. Particles are considered bound if their energy does not exceed the escape energy of a potential well -- given by the closest saddle-point that connects to a deeper potential minimum. This approach has core benefits over previous approaches, since it does not require any ad-hoc thresholds (such as over-density criteria), it includes the gravitational effect of all particles in the binding criterion (improving over widely used self-potential binding checks) and it only operates with instantaneous information (making it simpler than approaches based on dynamical histories). We show that particles typically become bound between their first peri- and apo-centeric passage and that bound and unbound populations show very distinct characteristics through their distribution in phase space, their density profiles, their virial ratios, and their redshift evolution. Our findings suggest that it is possible to understand haloes as two-component systems, with one component being bound, virialized, of finite extent and evolving slowly in quasi-equilibrium and the other component being unbound, unvirialized and evolving rapidly.",
      "pdf_url": "https://arxiv.org/pdf/2509.11993.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.09430",
      "title": "The choice of Planck CMB likelihood in cosmological analyses",
      "authors": [
        "Hidde Jense",
        "Marc Viña",
        "Erminia Calabrese",
        "J. Colin Hill"
      ],
      "abstract": "The choice of Planck CMB likelihood in cosmological analyses Hidde Jense, Marc Viña, Erminia Calabrese, J. Colin Hill Cosmology and Nongalactic Astrophysics (astro-ph.CO) We compare cosmological parameters from different Planck sky maps and likelihood pipelines, assessing robustness of cosmological results with respect to the choice of the latest Planck maps-likelihood combination. We show that, for the Planck multipole range retained in combination with ground-based observations, different products give very similar cosmological solutions; small remaining differences are reduced by the addition of other CMB datasets to Planck. In particular, constraints on extended cosmological models benefit from the addition of small-scale power from ground-based experiments and are completely insensitive to the choice of Planck maps and likelihood. For this work we derive and release a nuisance-marginalized dataset and CamSpec-NPIPE-lite likelihood for the Planck NPIPE data injected into the CamSpec likelihood - which are usually used to obtain the reference Planck PR4 cosmology. Using the extracted CMB spectra we show that the additional constraining power for cosmology is coming from polarization at all scales and from temperature at multipoles above 1500 when going from PR3 to PR4. We also show that full marginalization over the CamSpec foreground nuisance parameters can impact parameter inference and model selections when truncating some scales; our new likelihood enables correct combinations with other CMB datasets.",
      "pdf_url": "https://arxiv.org/pdf/2510.09430.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.19131",
      "title": "Turbulent dynamos in a collapsing cloud",
      "authors": [
        "Muhammed Irshad P",
        "Pallavi Bhat",
        "Kandaswamy Subramanian",
        "Anvar Shukurov"
      ],
      "abstract": "Turbulent dynamos in a collapsing cloud Muhammed Irshad P, Pallavi Bhat, Kandaswamy Subramanian, Anvar Shukurov 12 pages, 7 figures. Accepted manuscript (along with SM) in PRL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) The amplification of magnetic fields is crucial for understanding the observed magnetization of stars and galaxies. Turbulent dynamo is the primary mechanism responsible for that but the understanding of its action in a collapsing environment is still rudimentary and relies on limited numerical experiments. We develop an analytical framework and perform numerical simulations to investigate the behavior of small-scale and large-scale dynamos in a collapsing turbulent cloud. This approach is also applicable to expanding environments and facilitates the application of standard dynamo theory to evolving systems. Using a supercomoving formulation of the magnetohydrodynamic (MHD) equations, we demonstrate that dynamo action in a collapsing background leads to a super-exponential growth of magnetic fields in time, significantly faster than the exponential growth seen in stationary turbulence. The enhancement is mainly due to the increasing eddy turnover rate during the collapse, which boosts the instantaneous growth rate of the dynamo. We also show that the scaling of final saturated magnetic field strength with density robustly exceeds the expectation from considerations of pure flux-freezing. Apart from establishing a formal framework for studying magnetic field evolution in collapsing (or expanding) turbulent plasmas, these findings suggest that during star and galaxy formation magnetic fields can become dynamically relevant much earlier than previously thought.",
      "pdf_url": "https://arxiv.org/pdf/2503.19131.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22344",
      "title": "AGN spectral variability across activity states and searches for axion-like particles",
      "authors": [
        "Denys Malyshev",
        "Lidiia Zadorozhna",
        "Yuriy Bidasyuk",
        "Andrea Santangelo",
        "Oleg Ruchayskiy"
      ],
      "abstract": "AGN spectral variability across activity states and searches for axion-like particles Denys Malyshev, Lidiia Zadorozhna, Yuriy Bidasyuk, Andrea Santangelo, Oleg Ruchayskiy Accepted to PoS Multifrequency Behaviour of High Energy Cosmic Sources - XV (MULTIF2025) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Axion-like particles (ALPs) are compelling candidates for dark matter and potential portals to new physics beyond the Standard Model. Photons traversing magnetized regions can convert into ALPs, producing characteristic, energy-dependent absorption features in astrophysical spectra. The probability of such conversions depends sensitively on both the photon energy and the properties of the intervening magnetic fields. Most existing searches have focused on individual astrophysical sources, but uncertainties in the structure and strength of cosmic magnetic fields have limited their reach. Recently, we have demonstrated that active galactic nuclei (AGNs) observed through galaxy clusters provide especially promising targets for ALP searches. By stacking multiple AGN-cluster sightlines, one can average over poorly known magnetic field configurations in galaxy clusters and recover a distinctive ALP-induced spectral suppression, thereby significantly enhancing sensitivity. In this work, we investigate a possible systematic uncertainty in such analyses: the intrinsic time-variability of AGN spectra. We demonstrate that AGN flux variability is correlated with spectral hardness, and that time-averaging over flaring and quiescent states can potentially mimic the suppression features imprinted by ALP-photon mixing. Our findings imply that the recent constraints remain conservative, and that incorporating detailed spectral variability into stacking analyses can further sharpen the search for axion-like particles.",
      "pdf_url": "https://arxiv.org/pdf/2509.22344.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15400",
      "title": "Dynamic shocks powered by a wide, relativistic, super-Eddington outflow launched by an accreting neutron star in the mid-20th century",
      "authors": [
        "F. J. Cowie",
        "R. P. Fender",
        "I. Heywood",
        "F. Carotenuto",
        "J. H. Matthews",
        "B. Reville",
        "L. Olivera-Nieto",
        "A. J. Cooper",
        "A. K. Hughes",
        "K. Savard",
        "P. A. Woudt",
        "J. van den Eijnden",
        "N. Grollimund",
        "P.Saikia"
      ],
      "abstract": "Dynamic shocks powered by a wide, relativistic, super-Eddington outflow launched by an accreting neutron star in the mid-20th century F. J. Cowie, R. P. Fender, I. Heywood, F. Carotenuto, J. H. Matthews, B. Reville, L. Olivera-Nieto, A. J. Cooper, A. K. Hughes, K. Savard, P. A. Woudt, J. van den Eijnden, N. Grollimund, P.Saikia Accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Accreting systems can launch powerful outflows which interact with the surrounding medium. We combine new radio observations of the accreting neutron star X-ray binary (XRB) Circinus X-1 (Cir X-1) with archival radio observations going back 24 years. The $\\sim3$ pc scale wide-angle radio and X-ray emitting caps found around Cir X-1 are identified as synchrotron emitting shocks with significant proper motion and morphological evolution on decade timescales. Proper motion measurements of the shocks reveal they are mildly relativistic and decelerating, with apparent velocity of $0.14c\\pm0.03c$ at a propagation distance of 2 pc. We demonstrate that these shocks are likely powered by a hidden relativistic ($\\gtrsim0.3c$) wide-angle conical outflow launched in $1972\\pm3$, in stark contrast to known structures around other XRBs formed by collimated jets over 1000s of years. The minimum time-averaged power of the outflow required to produce the observed synchrotron emission is $\\sim0.1L_\\text{Edd}$, while the time-averaged power required for the kinetic energy of the shocks is $\\sim40 \\left(\\frac{n}{10^{-2} \\text{cm}^{-3}}\\right)L_\\text{Edd}$, where $n$ is the average ambient medium number density. This reveals the outflow powering the shocks is likely significantly super-Eddington. We measure significant linear polarisation up to $52\\pm6\\%$ in the shocks demonstrating the presence of an ordered magnetic field of strength $\\sim200~\\mu\\text{G}$. We show that the shocks are potential PeVatrons, capable of accelerating electrons to $\\sim0.7~\\text{PeV}$ and protons to $\\sim20~\\text{PeV}$, and we estimate the injection and energetic efficiencies of electron acceleration in the shocks. Finally, we predict that next generation gamma-ray facilities may be able to detect hadronic signatures from the shocks.",
      "pdf_url": "https://arxiv.org/pdf/2601.15400.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15425",
      "title": "Spin-down changes in PSR B0540-69 induced by a drift of the magnetic axis",
      "authors": [
        "Lucas G. Barão",
        "J. E. Horvath"
      ],
      "abstract": "Spin-down changes in PSR B0540-69 induced by a drift of the magnetic axis Lucas G. Barão, J. E. Horvath High Energy Astrophysical Phenomena (astro-ph.HE) The dynamics of the solid crust + magnetic field lines of pulsars is a much debated issue, and remains unsettled after 50 years. Some pieces of evidence have emerged to complete and confirm theoretical calculations and expectations. We discuss in the present work an interpretation of the behavior of the ''Crab Twin'' pulsar PSR B0540-69 in terms of the evolution of the magnetic field/quakes, connecting the behavior of the braking index with the underlying platelet drift and sudden discontinuous rearrangement (fast-slip) and long-term ones (slow-slip events), suggested by analogy with existing theoretical picture observed in the Earth's crust. The relationship of this scenario with permanent torque-changing glitches seen in the Crab and other young pulsars, and a set of similar events in the same object and others is addressed. We conclude that this physical approach is in principle consistent with all these sudden events, and point out future work to clarify the whole picture.",
      "pdf_url": "https://arxiv.org/pdf/2601.15425.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15452",
      "title": "The long quest for vacuum birefringence in magnetars: 1E 1547.0-5408 and the elusive smoking gun",
      "authors": [
        "Roberto Taverna",
        "Roberto Turolla",
        "Lorenzo Marra",
        "Ruth M. E. Kelly",
        "Alice Borghese",
        "Gian Luca Israel",
        "Sandro Mereghetti",
        "Silvia Zane",
        "Michela Rigoselli"
      ],
      "abstract": "The long quest for vacuum birefringence in magnetars: 1E 1547.0-5408 and the elusive smoking gun Roberto Taverna, Roberto Turolla, Lorenzo Marra, Ruth M. E. Kelly, Alice Borghese, Gian Luca Israel, Sandro Mereghetti, Silvia Zane, Michela Rigoselli 15 pages, 10 figures, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Magnetars are now known to be among the most strongly polarized celestial sources in X-rays. Here we report on the $500\\,\\mathrm{ks}$ observation of the magnetar 1E 1547.0-5408 performed by the Imaging X-ray Polarimetry Explorer (IXPE) in March 2025. The IXPE spectrum is well reproduced by a single thermal component with blackbody temperature $kT_\\mathrm{BB}\\sim 0.67\\,\\mathrm{keV}$ and emission radius $R_\\mathrm{BB}\\sim 1.2\\,\\mathrm{km}$. The source exhibits a high linear polarization degree in the $2$--$6\\,\\mathrm{keV}$ band ($\\mathrm{PD}=47.7\\pm2.9\\%$) with polarization angle $\\mathrm{PA}=75^\\circ.8 \\pm 1.^\\circ8$, measured West of celestial North. While $\\mathrm{PA}$ does not appear to vary with energy, there is some evidence (at the $1\\sigma$ confidence level) of a minimum in $\\mathrm{PD}$ between $3$ and $4\\,\\mathrm{keV}$, compatible with what is expected by partial mode conversion at the vacuum resonance in a magnetized atmosphere. Phase-resolved spectral and polarimetric analyses reveal that X-ray thermal radiation likely originates from a single, fairly small hot spot with a non-uniform temperature distribution. Fitting the phase-dependent $\\mathrm{PA}$ measured by IXPE with a rotating vector model (RVM) constrains the source geometry and indicates that both the dipole axis and line-of-sight are misaligned with respect to the spin axis. Under these conditions, the high polarization of the source cannot be regarded as compelling evidence for the presence of vacuum birefringence in the star magnetosphere. Nevertheless, the fact that the RVM successfully reproduces the modulation of the X-ray polarization angle and the behavior of $\\mathrm{PD}$ with the energy hint once more to the presence of QED effects in magnetars.",
      "pdf_url": "https://arxiv.org/pdf/2601.15452.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15577",
      "title": "Source identification for the Swift-BAT 150-month hard X-ray catalog using soft X-ray observations",
      "authors": [
        "K. Imam",
        "N. Torres-Alba",
        "S. Marchesi",
        "M. Ajello",
        "S. Joffre",
        "I. Cox",
        "A. Pizzetti",
        "X. Zhao",
        "A. Segreto",
        "A. Banerjee",
        "I. Pal",
        "V. E. Gianolli",
        "D. Stern"
      ],
      "abstract": "Source identification for the Swift-BAT 150-month hard X-ray catalog using soft X-ray observations K. Imam, N. Torres-Alba, S. Marchesi, M. Ajello, S. Joffre, I. Cox, A. Pizzetti, X. Zhao, A. Segreto, A. Banerjee, I. Pal, V. E. Gianolli, D. Stern High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We present a comprehensive catalog of 251 potential counterparts for 250 unassociated hard X-ray sources detected in the Swift Burst Alert Telescope (BAT) 150-month hard X-ray survey. Over 150 months of observation, BAT has detected 2339 sources in the 15-150 keV energy range. Among these, 344 do not have a previously identified low-energy counterpart. Our study focuses on the analysis of soft X-ray observations at energies below 10 keV, spatially overlapping with these new Swift-BAT hard X-ray sources. Such observations were taken with Chandra, Swift-XRT, eROSITA, and XMM-Newton. Within the sample of 251 potential counterparts, 94 (37 percent) are identified as active galactic nuclei and 58 (23 percent) as galaxies. The remaining 99 sources (40 percent) include pulsars, cataclysmic variables, and unclassified soft X-ray counterparts in the 0.5-10 keV band. Redshift information is available for 139 out of the 251 sources, and its distribution is in close agreement with the redshift distribution of previous BAT catalogs. We also present the results of a small optical spectroscopy campaign of 9 out of 58 galaxies. The majority of these are classified as Seyfert 2 galaxies at redshifts slightly larger than the median of the BAT AGN sample.",
      "pdf_url": "https://arxiv.org/pdf/2601.15577.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15691",
      "title": "Development of an early warning method incorporating pre-supernova neutrino light curves",
      "authors": [
        "Keita Saito",
        "Minori Eizuka",
        "Zhuojun Hu",
        "Koichi Ichimura",
        "Motoyasu Ikeda",
        "Koji Ishidoshiro",
        "Nanami Kawada",
        "Lucas N. Machado",
        "Lluis Marti-Magro",
        "Kazuha Mikami",
        "Koga Tachibana",
        "Roger A. Wendell"
      ],
      "abstract": "Development of an early warning method incorporating pre-supernova neutrino light curves Keita Saito, Minori Eizuka, Zhuojun Hu, Koichi Ichimura, Motoyasu Ikeda, Koji Ishidoshiro, Nanami Kawada, Lucas N. Machado, Lluis Marti-Magro, Kazuha Mikami, Koga Tachibana, Roger A. Wendell High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Massive stars ($M>8\\mathrm{M_\\odot}$) emit neutrinos known as pre-supernova (pre-SN) neutrinos through thermal and nuclear interactions for cooling the stellar core during the final stage of stellar evolution. Real-time monitoring of their pre-SN neutrino interaction rate offers a crucial opportunity to issue an early warning to a core-collapse supernova. Some neutrino detectors, including KamLAND and Super-Kamiokande already operate pre-SN alarm systems based on a statistically significant excess of the observed event rate over the expected background. To improve alarm sensitivity, we propose an alarm method which incorporates the time evolution of the observed pre-SN neutrino event rate. The method uses a log likelihood ratio test that references multiple theoretical stellar-evolution models and treats the core collapse time as a nuisance parameter to be profiled over. The performance of the proposed method was evaluated using simulated data for the KamLAND, Super-Kamiokande with dissolved Gadolinium (SK-Gd) and their combined analysis. The results demonstrate a significant improvement in the warning time compared to the conventional rate-only method, while maintaining the same false alarm rate.",
      "pdf_url": "https://arxiv.org/pdf/2601.15691.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15732",
      "title": "GRB~250704B/EP250704a a Short Gamma-Ray Burst Powered by a Magnetar",
      "authors": [
        "Nissim Fraija",
        "Antonio Galvá",
        "Boris Betancourt Kamenetskaia",
        "Maria G Dainotti"
      ],
      "abstract": "GRB~250704B/EP250704a a Short Gamma-Ray Burst Powered by a Magnetar Nissim Fraija, Antonio Galvá, Boris Betancourt Kamenetskaia, Maria G Dainotti High Energy Astrophysical Phenomena (astro-ph.HE) GRB~250704B/EP250704a, identified as a short gamma-ray burst (sGRB), exhibited prolonged X-ray emission following the prompt phase and, in optical and infrared (IR) bands, an unusual one-day plateau succeeded by a rapid decline. This sGRB was observed by multiple satellites and ground-based observatories across the electromagnetic spectrum. This study presents temporal and spectral analyses from radio to gamma-ray frequencies, spanning several observation periods beginning after the trigger and continuing for nearly 2 days. The results of the temporal and spectral analyses of the prompt episode, the extended X-ray component, and the afterglow phase are consistent with a millisecond magnetar undergoing accretion. The long-lasting X-ray emission is attributed to the internal energy dissipation of the magnetar spin-down power, governed by the magnetization parameter; the extended optical/IR plateau to synchrotron afterglow emission with energy injection; and the steep decay to changes in microphysical parameters during the post-jet break phase. The X-ray observations are consistent with the superposition of spin-down luminosity and synchrotron afterglow scenario. These findings suggest that the compact-object remnant is most likely a long-lived magnetar.",
      "pdf_url": "https://arxiv.org/pdf/2601.15732.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15994",
      "title": "SVOM discovery of a strong X-ray outburst of the blazar 1ES~1959+650 and multi-wavelength follow-up with the Neil Gehrels Swift observatory",
      "authors": [
        "A. Foisseau",
        "A. Coleiro",
        "S. Komossa",
        "D. Grupe",
        "F. Cangemi",
        "P. Maggi",
        "D. Götz",
        "H.-B. Cai",
        "B. Cordier",
        "N. Dagoneau",
        "Z.-G. Dai",
        "Y.-W. Dong",
        "M. Fernandes Moita",
        "O. Godet",
        "A. Goldwurm",
        "H. Goto",
        "S. Guillot",
        "L. Huang",
        "M.-H. Huang",
        "N. Jiang",
        "C. Lachaud",
        "S. Le Stum",
        "E.-W. Liang",
        "X.-M. Lu",
        "L. Michel",
        "C. Plasse",
        "Y.L. Qiu",
        "J. Rodriguez",
        "L. Tao",
        "S. Schanne",
        "J. Wang",
        "X.-G. Wang",
        "X.-Y. Wang",
        "J. Wei",
        "C. Wu",
        "Y.-W. Yu",
        "J. Zhang",
        "L. Zhang",
        "S.-N. Zhang",
        "S. Zheng"
      ],
      "abstract": "SVOM discovery of a strong X-ray outburst of the blazar 1ES~1959+650 and multi-wavelength follow-up with the Neil Gehrels Swift observatory A. Foisseau, A. Coleiro, S. Komossa, D. Grupe, F. Cangemi, P. Maggi, D. Götz, H.-B. Cai, B. Cordier, N. Dagoneau, Z.-G. Dai, Y.-W. Dong, M. Fernandes Moita, O. Godet, A. Goldwurm, H. Goto, S. Guillot, L. Huang, M.-H. Huang, N. Jiang, C. Lachaud, S. Le Stum, E.-W. Liang, X.-M. Lu, L. Michel, C. Plasse, Y.L. Qiu, J. Rodriguez, L. Tao, S. Schanne, J. Wang, X.-G. Wang, X.-Y. Wang, J. Wei, C. Wu, Y.-W. Yu, J. Zhang, L. Zhang, S.-N. Zhang, S. Zheng High Energy Astrophysical Phenomena (astro-ph.HE) On December 6, 2024, 1ES 1959+650, one of the X-ray brightest blazars known, underwent a high-amplitude X-ray outburst detected by SVOM, the first such discovery with this mission. The source was subsequently monitored with SVOM and Swift from December 2024 to March 2025. We report the detection and multi-wavelength follow-up of this event, and describe the temporal and spectral evolution observed during the campaign. Data from SVOM/MXT, SVOM/ECLAIRs, and Swift/XRT were analyzed with log-parabola models to track flux and spectral variability. The source was detected in a bright state over the 0.3-50 keV range. During the three months of monitoring, the X-ray flux varied significantly, showing episodes of spectral hardening at high flux levels. The spectral curvature evolved more irregularly and did not show a clear trend with flux. A shift of the Spectral Energy Distribution (SED) synchrotron peak to higher energies is seen when the flux increases. This constitutes the first blazar outburst discovered in X-rays by SVOM. The coordinated follow-up with Swift provided continuous coverage of the flare and highlights the strong complementarity of the two missions for time-domain studies of blazars. The flare shows no clear signatures of either Fermi I or Fermi II acceleration, suggesting a mixed Fermi I/II scenario.",
      "pdf_url": "https://arxiv.org/pdf/2601.15994.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16159",
      "title": "Magnetar fraction in Core-Collapse Supernovae",
      "authors": [
        "Celsa Pardo-Araujo",
        "Nanda Rea",
        "Michele Ronchi",
        "Vanessa Graber"
      ],
      "abstract": "Magnetar fraction in Core-Collapse Supernovae Celsa Pardo-Araujo, Nanda Rea, Michele Ronchi, Vanessa Graber 51 pages, 9 figures, 4 tables; Submitted; Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) Magnetars are extreme neutron stars powered by ultra-strong magnetic fields ($\\sim10^{14}$ Gauss) and are compelling engines for some of the most powerful extragalactic transients such as Super Luminous Supernovae, Gamma-Ray Bursts, and Fast Radio Bursts. Yet their formation rate relative to ordinary neutron stars remains uncertain, often precluding direct comparisons with the rates of these extragalactic transients. Furthermore, magnetars have been recently shown to be evolutionarily related to other neutron star classes, complicating the estimate of the exact magnetar fraction within the neutron star population. We study the magnetar birth fraction in core-collapse supernovae using pulsar population synthesis of all isolated neutron star classes in our Galaxy, incorporating self-consistently the Galactic dynamical evolution, spin-down and magneto-thermal evolution. This approach allows us to derive strong constraints from small close-to-complete observational samples. In particular, looking at the age-limited young ($<$2 kyr) neutron star population in the Milky Way we find 24 detected young neutron stars, with only 10 of them (41%) being classical rotational powered pulsars, while the others (59%) are either magnetars or central compact objects, the latter believed to be equally magnetically powered. We further compare the results with the nearby volume-limited class ($<$500 pc) of X-ray Dim Isolated Neutron stars, old nearby magnetars. We conclude that the observed population of isolated neutron stars in the Galaxy can be reproduced only by assuming a core-collapse supernova rate larger than two, and a larger magnetar fraction than previously inferred. By assuming a bimodal initial magnetic field ($B_0$) distribution at birth, we find that the magnetar class peaks between $B_0\\sim 1-2.5\\times10^{14}$ Gauss and represents on average $\\sim50$% of the entire neutron star population.",
      "pdf_url": "https://arxiv.org/pdf/2601.16159.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16190",
      "title": "Evolution of the recent high-accretion state of the recurrent nova T CrB: HST, Swift, NuSTAR, and XMM-Newton observations",
      "authors": [
        "G. J. M. Luna",
        "N. P. M. Kuin",
        "K. Mukai",
        "J. L. Sokoloski",
        "K. Page",
        "J. P. Osborne"
      ],
      "abstract": "Evolution of the recent high-accretion state of the recurrent nova T CrB: HST, Swift, NuSTAR, and XMM-Newton observations G. J. M. Luna, N. P. M. Kuin, K. Mukai, J. L. Sokoloski, K. Page, J. P. Osborne High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) As the recurrent nova T Coronae Borealis (T CrB) approaches its next predicted thermonuclear eruption, it is currently exhibiting a \"super-active state\" (SAS) characterized by enhanced multiwavelength emission similar to the behavior recorded prior to the 1946 outburst. We present a multiwavelength analysis of the SAS and the subsequent \"faint state\" using observations from HST, Swift, NuSTAR, and XMM-Newton. Our results indicate that the SAS was driven by an increase in the mass accretion rate, which caused the accretion disk's boundary layer to become optically thick. A weighted least squares regression analysis quantifies the evolution of the accretion components, displaying a highly significant (4.5$\\sigma$) increase in the luminosity of the optically thin cooling flow (L$_{cf}$) and a marginal (2.58$\\sigma$) decrease in the optically thick boundary layer luminosity (L$_{bb}$) as the system transitioned into the faint state. We find that this dimming is consistent with an intrinsic change in the accretion flow rather than dust obscuration, supported by the lack of infrared excess and the stability of the 2175 Å feature. Additionally, a time-series analysis using autoregressive modeling to account for correlated red noise revealed no significant periodicities, thereby disputing the previously reported $\\sim$6000 s signal. These findings suggest that the pre-outburst evolution of T CrB is characterized by significant changes in the accretion disk structure and boundary layer, providing a self-consistent physical framework for the system's behavior as it approaches eruption.",
      "pdf_url": "https://arxiv.org/pdf/2601.16190.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15379",
      "title": "Optimizing Optical Searches for Supermassive Black Hole Binaries in AGN Light Curves: Fourier versus Bayesian Periodicity Detection",
      "authors": [
        "Sebastian Banaszak",
        "Caitlin Witt",
        "Adam Miller"
      ],
      "abstract": "Optimizing Optical Searches for Supermassive Black Hole Binaries in AGN Light Curves: Fourier versus Bayesian Periodicity Detection Sebastian Banaszak, Caitlin Witt, Adam Miller Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Simulations predict that supermassive black hole binaries (SMBHBs) will exhibit periodic brightness variations that may exceed the stochastic variability intrinsic to active galactic nuclei (AGN). In this paper, we simulate SMBHBs with damped random walk (DRW) AGN variability and an added sinusoidal signal from the orbital motion, and test three methods -- the Generalized Lomb Scargle Periodogram (GLSP), the nested Bayesian sampler (NBS), and the Weighted Wavelet Z-Transform (WWZ) -- to determine which is best at recovering the periodicity. Our simulated light curves follow the properties of the Catalina Real-Time Transient Survey (CRTS), Legacy Survey of Space and Time (LSST), and Zwicky Transient Facility (ZTF) to best inform current and future SMBHB searches. We map a broad range of parameter space and identify which DRW-only light curves best mimic periodicity and pass each method's model selection. The NBS performs best at detecting periodicity and filtering out DRW-only light curves. Combined candidate selection with both the NBS and GLSP significantly reduces false positive rates with marginal impact to true positive rates. With this joint model selection pipeline, we find the lowest false positive rates in ZTF-like simulations and the highest detection rates in LSST-like simulations. Using a modified computation of the False Alarm Probability (FAP) with GLSP, we efficiently triage LSST AGN light curves (~10^7 light curves in ~10-30 hours) and achieve true- and false- positive rates of ~40% and ~0.5%, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2601.15379.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15383",
      "title": "An Investigation of 5-year Simultaneous X-ray and Radio Light Curves of the Dwarf Seyfert Galaxy UGC 6728",
      "authors": [
        "Krista Lynne Smith",
        "Macon Magno",
        "Michael Koss"
      ],
      "abstract": "An Investigation of 5-year Simultaneous X-ray and Radio Light Curves of the Dwarf Seyfert Galaxy UGC 6728 Krista Lynne Smith, Macon Magno, Michael Koss 11 pages, 4 figures, accepted for publication in the Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We present serendipitous simultaneous radio and X-ray light curves of the dwarf Seyfert galaxy UGC 6728 spanning 5 years. The X-ray light curve exhibits a flaring period, followed by a gradual rise and decline. Throughout these events, the X-ray hardness ratio and spectrum do not change significantly. The radio flux is constant, as far as can be determined from its sparse sampling, until the end of the X-ray flare, then decreases by a factor of two by the midpoint of the gradual X-ray rise before returning to baseline at the end of the X-ray decline. We interpret this behavior in light of a similar event recently reported in NGC 2992, in which there is a temporary obscuration of the radio source by a blob of plasma ejected by a magnetic reconnection in the accretion disk. The energetics of the X-ray flare are consistent with those expected from magnetic disk activity. As in NGC 2992, the X-ray spectrum does not evolve during the obscuration event. We also discuss the possibility that the observed phenomena are due to normal AGN coronal flaring and variability, which is plausible but unlikely given the lack of spectral variation.",
      "pdf_url": "https://arxiv.org/pdf/2601.15383.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15428",
      "title": "Supernova interactions with aspherical circumstellar material I: calculations of light curves, AB magnitudes, spectra, and polarisation",
      "authors": [
        "Petr Kurfürst",
        "Georgi Bless",
        "Jakub Fišák",
        "Filip Holoubek",
        "Jiří Krtička",
        "Brankica Kubátová",
        "Jiří Kubát",
        "Michal Zajaček"
      ],
      "abstract": "Supernova interactions with aspherical circumstellar material I: calculations of light curves, AB magnitudes, spectra, and polarisation Petr Kurfürst, Georgi Bless, Jakub Fišák, Filip Holoubek, Jiří Krtička, Brankica Kubátová, Jiří Kubát, Michal Zajaček Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) We present an upgraded detailed numerical calculations of supernova (SN) interactions with significantly aspherical circumstellar matter (CSM), primarily formed as a disc or bipolar lobes. The circumstellar disc can arise as a result of, for example, mass transfer in a binary, while bipolar lobes can be the result of a violent pre-explosive ejection of matter, similar to the iconic cases of luminous blue variable stars (LBVs). We numerically simulate the radiation-hydrodynamic (RHD) behaviour of interaction processes using a 2D cylindrical version of the RHD code CASTRO. We then calculate light curves, spectral patterns, and polarisation profiles, all up to a relatively long time of two years after an SN shock breakout and from different directions, using the multidimensional Monte Carlo radiation transfer (MC-RT) codes SEDONA and SIROCCO. We calculated a total of five models for the two aforementioned configurations of the surrounding CSM, for stratified density levels, comparing the simulated hydrodynamic behaviour and differences in their observable properties. RHD models exhibit similar behaviour to previous adiabatic models, but with a significantly slower expansion velocity. The calculated light curves show a relatively smooth evolution in SN-disc interaction, and declines and brightening in SN-lobes interaction. Comparing models with real events with a presumed similar physical process provides guidance for selecting a more accurate CSM configuration when simulating real situations.",
      "pdf_url": "https://arxiv.org/pdf/2601.15428.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15725",
      "title": "Interaction between the ejecta, the accretion disk, and the secondary star in the recurrent nova system U Sco",
      "authors": [
        "Joana Figueira",
        "Jordi Jose",
        "Ruben Cabezon",
        "Domingo Garcia-Senz"
      ],
      "abstract": "Interaction between the ejecta, the accretion disk, and the secondary star in the recurrent nova system U Sco Joana Figueira, Jordi Jose, Ruben Cabezon, Domingo Garcia-Senz Astronomy & Astrophysics (2025), 693, A209 (10 pp) Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Most efforts in the modeling of recurrent novae have centered on the initial phases of the explosion and ejection, overlooking the subsequent interaction of the ejecta, first with the accretion disk orbiting the white dwarf and ultimately with the secondary star. To address this gap, a series of 3D smoothed-particle hydrodynamics simulations was conducted. These simulations explored the dynamic interactions between the nova ejecta, accretion disk, and stellar companion within the framework of the recurrent nova system U Sco. Notably, the simulations incorporate rotation around the system's center of mass. The primary goal of these simulations was to qualitatively examine the impact of various model parameters, including ejecta mass, velocity, and density, as well as the mass and geometry of the accretion disk. Simulations reveal complete disruption and sweeping of the accretion disk orbiting the white dwarf star for models with flared disks and Mejecta/Mdisk larger than 1. In contrast, V-shaped disks with a (constant) high initial density and Mejecta/Mdisk < 1 partially survive the impact with the nova ejecta. A very minor chemical contamination of the secondary star is anticipated in the U Sco case based on the limited impact of nova ejecta particles on the subgiant in all simulations. Minor mass ejection from the subgiant's outer layers is observed during the late-stage collision with ejecta and disk material, with some particles ejected from the binary system and some accreted by the white dwarf.",
      "pdf_url": "https://arxiv.org/pdf/2601.15725.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15740",
      "title": "Nucleosynthesis in Type Ia Supernovae, Classical Novae, and Type I X-Ray Bursts. A Primer on Stellar Explosions",
      "authors": [
        "Jordi Jose"
      ],
      "abstract": "Nucleosynthesis in Type Ia Supernovae, Classical Novae, and Type I X-Ray Bursts. A Primer on Stellar Explosions Jordi Jose EPJ Web Conf. (2024) 297, 01006 (9 pp) Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Nuclear astrophysics aims at unraveling the cosmic origins of chemical elements and the physical processes powering stars. It constitutes a truly multidisciplinary field, that integrates tools, advancements, and accomplishments from theoretical astrophysics, observational astronomy, cosmochemistry, and theoretical and experimental atomic and nuclear physics. For instance, the advent of high-energy astrophysics, facilitated by space-borne observatories, has ushered in a new era, offering a unique, panchromatic view of the universe (i.e., allowing multifrequency observations of stellar events); supercomputers are also playing a pivotal role, furnishing astrophysicists with computational capabilities essential for studying the intricate evolution of stars within a multidimensional framework; cosmochemists, through examination of primitive meteorites, are uncovering tiny fragments of stardust, shedding light on the physical processes operating in stars and on the mechanisms that govern condensation of stellar ejecta into solids; simultaneously, nuclear physicists managed to measure nuclear reactions at (or close to) stellar energies, using both stable and radioactive ion beam facilities. This paper provides a multidisciplinary view on nucleosynthesis accompanying stellar explosions, with a specific focus on thermonuclear supernovae, classical novae, and type I X-ray bursts.",
      "pdf_url": "https://arxiv.org/pdf/2601.15740.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16100",
      "title": "Formation and X-ray emission from hot bubbles in planetary nebulae - III. The impact of [Wolf-Rayet]-type winds",
      "authors": [
        "Rogelio Orozco-Duarte",
        "Jesús A. Toalá",
        "S. Jane Arthur",
        "Janis B. Rodríguez-González",
        "Luke Conmy",
        "Rolf Kuiper"
      ],
      "abstract": "Formation and X-ray emission from hot bubbles in planetary nebulae - III. The impact of [Wolf-Rayet]-type winds Rogelio Orozco-Duarte, Jesús A. Toalá, S. Jane Arthur, Janis B. Rodríguez-González, Luke Conmy, Rolf Kuiper Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We use radiation-hydrodynamical simulations to investigate the formation and synthetic X-ray emission of hot bubbles within planetary nebulae (PNe) driven by the powerful winds of H-deficient, [Wolf-Rayet]([WR])-type stars. Our models, based on {\\sc mesa} stellar evolution tracks for 1--3 M$_{\\odot}$ progenitors, adopt a recent mass-loss rate prescription for [WR] stars and incorporate the enhanced radiative cooling of their C-rich material, comparing the results against standard H-rich PN models. The enhanced mass-loss in the [WR] models leads to an accelerated post-AGB evolution and a subsequent delay in hot bubble formation compared to their H-rich counterparts, as suggested by a previous work. By computing synthetic X-ray spectra that account for the mixed H-rich and H-deficient gas phases, we find that models incorporating [WR] winds exhibit significantly higher X-ray luminosities ($L_\\mathrm{X}$) than their H-rich counterparts, but the emissivity-weighted plasma temperature of the X-ray-emitting gas converge to values of $T_\\mathrm{X} = [1-3] \\times 10^{6}$~K, regardless of whether the system follows a [WR]-type or an H-rich post-AGB evolutionary path. Our results reinforce previous suggestions that mixing is a key mechanism in generating the observed soft X-ray emission even for PN hosting [WR] central stars.",
      "pdf_url": "https://arxiv.org/pdf/2601.16100.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2407.05968",
      "title": "Evidence for GeV emission of the superluminous supernova SN 2017egm",
      "authors": [
        "Shang Li",
        "Yun-Feng Liang",
        "Neng-Hui Liao",
        "Lei Lei",
        "Yi-Zhong Fan"
      ],
      "abstract": "Evidence for GeV emission of the superluminous supernova SN 2017egm Shang Li, Yun-Feng Liang, Neng-Hui Liao, Lei Lei, Yi-Zhong Fan Accepted for publication in PRL High Energy Astrophysical Phenomena (astro-ph.HE) Superluminous supernovae (SLSNe) are a new class of transients with luminosities $\\sim10 -100$ times larger than the usual core-collapse supernovae (SNe). Their origin is still unclear and one widely discussed scenario involves a millisecond magnetar central engine. The GeV-TeV emission of SLSNe has been predicted in the literature but has not been convincingly detected yet. Here we report the results of the search for $\\gamma$-ray emission in the direction of SN 2017egm, one of the closest SLSNe detected so far, using 15 years of {\\it Fermi}-LAT Pass 8 data. There is a transient $\\gamma$-ray source appearing about 2 months after this event and lasting a few months. Monte Carlo simulations show that the $\\gamma$-ray signal has a global significance of {\\it at least} 4$\\sigma$. Both the peak time and the luminosity of the GeV emission are consistent with the magnetar model prediction, suggesting that such a GeV transient is the high-energy counterpart of SN 2017egm and the central engine of this SLSNe is a young magnetar.",
      "pdf_url": "https://arxiv.org/pdf/2407.05968.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.12384",
      "title": "WINTER on S250206dm: A near-infrared search for an electromagnetic counterpart to a gravitational-wave event",
      "authors": [
        "Danielle Frostig",
        "Viraj R. Karambelkar",
        "Robert D. Stein",
        "Nathan P. Lourie",
        "Mansi M. Kasliwal",
        "Robert A. Simcoe",
        "Mattia Bulla",
        "Tomas Ahumada",
        "Geoffrey Mo",
        "Josiah Purdum",
        "Jill Juneau",
        "Andrew Malonis",
        "Gabor Furesz"
      ],
      "abstract": "WINTER on S250206dm: A near-infrared search for an electromagnetic counterpart to a gravitational-wave event Danielle Frostig, Viraj R. Karambelkar, Robert D. Stein, Nathan P. Lourie, Mansi M. Kasliwal, Robert A. Simcoe, Mattia Bulla, Tomas Ahumada, Geoffrey Mo, Josiah Purdum, Jill Juneau, Andrew Malonis, Gabor Furesz High Energy Astrophysical Phenomena (astro-ph.HE) We present near-infrared follow-up observations of the International Gravitational Wave Network (IGWN) event S250206dm with the Wide-Field Infrared Transient Explorer (WINTER). WINTER is a near-infrared time-domain survey designed for electromagnetic follow-up of gravitational-wave sources localized to $\\leq$300 deg$^{2}$. The instrument's wide field of view (1.2 deg$^2$), dedicated 1-m robotic telescope, and near-infrared coverage (0.9-1.7 microns) are optimized for searching for kilonovae, which are expected to exhibit a relatively long-lived near-infrared component. S250206dm is the only neutron star merger in the fourth observing run (to date) localized to $\\leq$300 deg$^{2}$ with a False Alarm Rate below one per year. It has a $55\\%$ probability of being a neutron star-black hole (NSBH) merger and a $37\\%$ probability of being a binary neutron star (BNS) merger, with a $50\\%$ credible region spanning 38 deg$^2$, an estimated distance of 373 Mpc, and an overall false alarm rate of approximately one in 25 years. WINTER covered $43\\%$ of the probability area at least once and $35\\%$ at least three times. Through automated and human candidate vetting, all transient candidates found in WINTER coverage were rejected as kilonova candidates. Unsurprisingly, given the large estimated distance of 373 Mpc, the WINTER upper limits do not constrain kilonova models. This study highlights the promise of systematic infrared searches and the need for future wider and deeper infrared surveys.",
      "pdf_url": "https://arxiv.org/pdf/2504.12384.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.06626",
      "title": "Machine-learning correction for the calorimeter saturation of cosmic-ray ions with the Dark Matter Particle Explorer: towards the PeV scale",
      "authors": [
        "Andrea Serpolla",
        "Andrii Tykhonov",
        "Paul Coppin",
        "Manbing Li",
        "Andrii Kotenko",
        "Enzo Putti-Garcia",
        "Hugo Valentin Boutin",
        "Mikhail Stolpovskiy",
        "Jennifer Maria Frieden",
        "Chiara Perrina",
        "Xin Wu"
      ],
      "abstract": "Machine-learning correction for the calorimeter saturation of cosmic-ray ions with the Dark Matter Particle Explorer: towards the PeV scale Andrea Serpolla, Andrii Tykhonov, Paul Coppin, Manbing Li, Andrii Kotenko, Enzo Putti-Garcia, Hugo Valentin Boutin, Mikhail Stolpovskiy, Jennifer Maria Frieden, Chiara Perrina, Xin Wu High Energy Astrophysical Phenomena (astro-ph.HE) The Dark MAtter Particle Explorer (DAMPE) instrument is a space-borne cosmic-ray detector, capable of measuring ion fluxes up to $\\sim$500 TeV/n. This energy scale is made accessible through its calorimeter, which is the deepest currently operating in orbit. Saturation of the calorimeter readout channels starts occurring above $\\sim$100 TeV of incident energy, and can significantly affect the primary energy reconstruction. Different techniques -- analytical and machine-learning based -- were developed to tackle this issue, focusing on the recovery of single-bar deposits, up to several hundreds of TeV. In this work, a new machine-learning technique is presented, which benefits from a unique model to correct the total deposited energy in DAMPE calorimeter. The described method is able to generalise its corrections for different ions and extend the maximum detectable incident energy to the PeV scale. This work is a continuation of the results presented in [1].",
      "pdf_url": "https://arxiv.org/pdf/2507.06626.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07380",
      "title": "AT2019cmw: A highly luminous, cooling featureless TDE candidate from the disruption of a high mass star in an early-type galaxy",
      "authors": [
        "Jacob L. Wise",
        "Daniel A. Perley",
        "Nikhil Sarin",
        "Tatsuya Matsumoto",
        "K-Ryan Hinds",
        "Yuhan Yao",
        "Jesper Sollerman",
        "Steve Schulze",
        "Aleksandra Bochenek",
        "Michael W. Coughlin",
        "Kishalay De",
        "Richard Dekany",
        "Sara Frederick",
        "Christoffer Fremling",
        "Suvi Gezari",
        "Matthew J. Graham",
        "Anna Y. Q. Ho",
        "Shrinivas Kulkarni",
        "Russ R. Laher",
        "Conor Omand",
        "Natalya Johnson",
        "Yashvi Sharma",
        "Kirsty Taggart",
        "Charlotte Ward",
        "Avery Wold",
        "Lin Yan"
      ],
      "abstract": "AT2019cmw: A highly luminous, cooling featureless TDE candidate from the disruption of a high mass star in an early-type galaxy Jacob L. Wise, Daniel A. Perley, Nikhil Sarin, Tatsuya Matsumoto, K-Ryan Hinds, Yuhan Yao, Jesper Sollerman, Steve Schulze, Aleksandra Bochenek, Michael W. Coughlin, Kishalay De, Richard Dekany, Sara Frederick, Christoffer Fremling, Suvi Gezari, Matthew J. Graham, Anna Y. Q. Ho, Shrinivas Kulkarni, Russ R. Laher, Conor Omand, Natalya Johnson, Yashvi Sharma, Kirsty Taggart, Charlotte Ward, Avery Wold, Lin Yan 28 pages, 20 figures, MNRAS accepted High Energy Astrophysical Phenomena (astro-ph.HE) We present optical/UV photometric and spectroscopic observations, as well as X-ray and radio follow-up, of the extraordinary event AT2019cmw. With a peak bolometric luminosity of ~$\\mathrm{10^{45.6}\\,erg\\,s^{-1}}$, it is one of the most luminous thermal transients ever discovered. Extensive spectroscopic follow-up post-peak showed only a featureless continuum throughout its evolution. This, combined with its nuclear location, blue colour at peak and lack of prior evidence of an AGN in its host lead us to interpret this event as a `featureless' tidal disruption event (TDE). It displays photometric evolution atypical of most TDEs, cooling from ~30 kK to ~10 kK in the first ~300 days post-peak, with potential implications for future photometric selection of candidate TDEs. No X-ray or radio emission is detected, placing constraints on the presence of on-axis jetted emission or a visible inner-accretion disk. Modelling the optical light curve with existing theoretical prescriptions, we find that AT2019cmw may be the result of the disruption of a star in the tens of solar masses by a supermassive black hole (SMBH). Combined with a lack of detectable star formation in its host galaxy, it could imply the existence of a localised region of star formation around the SMBH. This could provide a new window to probe nuclear star formation and the shape of the initial mass function (IMF) in close proximity to SMBHs out to relatively high redshifts.",
      "pdf_url": "https://arxiv.org/pdf/2507.07380.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20893",
      "title": "The role of magnetic fields in shaping $γ$-ray emission from the Fermi bubbles",
      "authors": [
        "Olivier Tourmente",
        "Donna Rodgers-Lee",
        "Andrew M. Taylor"
      ],
      "abstract": "The role of magnetic fields in shaping $γ$-ray emission from the Fermi bubbles Olivier Tourmente, Donna Rodgers-Lee, Andrew M. Taylor High Energy Astrophysical Phenomena (astro-ph.HE) Despite their discovery fifteen years ago, the nature and origin of the Fermi bubbles remain unclear. We here investigate the effect a magnetic field can have on a subsonic breeze outflow emanating from the Galactic centre region. The presence of this magnetic field allows anisotropic diffusion of cosmic rays within the outflow, shaping the resultant cosmic ray distribution obtained out at large distances within the Galactic halo. We show that our magnetohydrodynamic Galactic breeze model, in combination with an opening angle for the injection of cosmic rays, leads to $\\gamma$-ray emission from the Fermi bubble region with relatively sharp edges.",
      "pdf_url": "https://arxiv.org/pdf/2507.20893.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.06487",
      "title": "Rapid jet production and suppression during fast state transitions in the black hole X-ray binary MAXI J1348$-$630",
      "authors": [
        "Francesco Carotenuto",
        "Liang Zhang",
        "Diego Altamirano",
        "Piergiorgio Casella",
        "Stéphane Corbel",
        "James C. A. Miller-Jones"
      ],
      "abstract": "Rapid jet production and suppression during fast state transitions in the black hole X-ray binary MAXI J1348$-$630 Francesco Carotenuto, Liang Zhang, Diego Altamirano, Piergiorgio Casella, Stéphane Corbel, James C. A. Miller-Jones 8 pages, 4 figures, Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE) Black hole X-ray binaries (BH XRBs) launch powerful relativistic jets during bright outburst phases. The properties of these outflows change dramatically between different spectral/accretion states. Compact jets are observed during the hard state and are quenched during the soft state, while discrete ejecta are mainly launched during the hard-to-soft state transition. Currently, we do not understand what triggers the formation/destruction of compact jets or the launch of discrete ejecta. In this context, finding a unique link between the jet evolution and the properties of the X-ray emission, such as its fast variability, would imply major progress in our understanding of the fundamental mechanisms that drive relativistic outflows in BH XRBs. Here we show that a brief, strong radio re-brightening during a predominantly soft state of the BH XRB MAXI J1348$-$630 was contemporaneous with a significant increase in the X-ray rms variability observed with NICER in 2019. During this phase, the variability displayed significant changes and, at the same time, MAXI J1348$-$630 launched two relativistic discrete ejecta that we detected with the MeerKAT and ATCA radio-interferometers. We propose that short-lived compact jets were reactivated during this excursion to the hard-intermediate state and were switched off before the ejecta launch, a behavior that has been very rarely observed in these systems. Interestingly, with the caveat of gaps in our radio and X-ray coverage, we suggest a tentative correspondence between the launch of ejecta and the drop in X-ray rms variability in this source, while other typical X-ray signatures associated with discrete ejections are not detected. We discuss how these results provide us with insights into the complex dynamic coupling between the jets and hot corona in BH XRBs.",
      "pdf_url": "https://arxiv.org/pdf/2509.06487.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.09261",
      "title": "Light Travel Time Effects in Kilonova Models",
      "authors": [
        "F. McNeill",
        "S. A. Sim",
        "C. E. Collins",
        "L. J. Shingles",
        "R. Damgaard",
        "A. Sneppen",
        "J. H. Gillanders"
      ],
      "abstract": "Light Travel Time Effects in Kilonova Models F. McNeill, S. A. Sim, C. E. Collins, L. J. Shingles, R. Damgaard, A. Sneppen, J. H. Gillanders As accepted by MNRAS (2026 January 6th) High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The extremely rapid evolution of kilonovae results in spectra that change on an hourly basis. These spectra are key to understanding the processes occurring within the event, but this rapid evolution is an unfamiliar domain compared to other explosive transient events, such as supernovae. In particular, the most obvious P Cygni feature in the spectra of AT2017gfo -- commonly attributed to strontium -- possesses an emission component that emerges after, and ultimately outlives, its associated absorption dip. This delay is theorised to arise from reverberation effects, wherein photons emitted earlier in the kilonova's evolution are scattered before reaching the observer, causing them to be detected at later times. We aim to examine how the finite speed of light -- and therefore the light travel time to an observer -- contributes to the shape and evolution of spectral features in kilonovae. Using a simple model, and tracking the length of the journey photons undertake to an observer, we are able to test the necessity of accounting for this time delay effect when modelling kilonovae. In periods where the photospheric temperature is rapidly evolving, we show spectra synthesised using a time independent approach are visually distinct from those where these time delay effects are accounted for. Therefore, in rapidly evolving events such as kilonovae, time dependence must be taken into account.",
      "pdf_url": "https://arxiv.org/pdf/2510.09261.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.11699",
      "title": "Gamma-ray Orbital Modulation in Spider Pulsars: Three Discoveries and a Universal Modulated Fraction",
      "authors": [
        "Maksat Satybaldiev",
        "Manuel Linares",
        "Vittoria Vecchiotti"
      ],
      "abstract": "Gamma-ray Orbital Modulation in Spider Pulsars: Three Discoveries and a Universal Modulated Fraction Maksat Satybaldiev, Manuel Linares, Vittoria Vecchiotti 26 pages, 16 figures, 5 tables; accepted to ApJ; section 3.5 with SEDs added as requested by the referee; GOM animation this https URL High Energy Astrophysical Phenomena (astro-ph.HE) Compact binary millisecond pulsars (also known as spiders) allow us to probe pulsar winds in their innermost regions, between the light cylinder (radius $\\sim10^{7}$ cm) and the companion star (at $\\sim10^{11}$ cm). Their flux is known to vary along the orbit, from radio to X-rays. During the past decade, gamma-ray orbital modulation (GOM) has been discovered in a handful of spiders, but its origin remains largely unknown. We present the results of a systematic search for GOM among 43 systems, selecting pulsed 0.1-1 GeV photons and using spin and orbital ephemeris from Fermi's Third Pulsar Catalog. We discover GOM from three spiders - PSR J1124-3653, PSR J1946-5403 and PSR J2215+5135 - and confirm four previous detections. In all seven cases so far, the GOM peaks near the pulsar's superior conjunction. The X-ray orbital light curves are usually in antiphase, peaking when the pulsar is at inferior conjunction, but we find one case where both gamma-rays and X-rays peak around superior conjunction: PSR J1946-5403. We measure the modulated fractions of the GOM and find consistent values for all seven spiders, with an average $22.0\\pm2.6\\%$. Including eclipsing systems seen edge-on, we find no clear dependence of the modulated fraction on the orbital inclination (within $\\simeq$45-90$^\\circ$). Our results challenge previous models proposed to explain GOM in spiders, based on inverse Compton and synchrotron emission close to the companion, since these predict a clear dependence on orbital inclination (stronger modulation at high inclinations). We nearly double the number of GOM detections in spiders, showing that it is more common than previously thought.",
      "pdf_url": "https://arxiv.org/pdf/2510.11699.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.07290",
      "title": "Diagnosing Interstellar Magnetic Turbulence with TeV Pulsar Halos",
      "authors": [
        "Chao-Ming Li",
        "Ruo-Yu Liu",
        "Huirong Yan"
      ],
      "abstract": "Diagnosing Interstellar Magnetic Turbulence with TeV Pulsar Halos Chao-Ming Li, Ruo-Yu Liu, Huirong Yan 9 pages, 6 figures, accepted by Phys. Rev. D Phys. Rev. D 113, L021303 (2026) High Energy Astrophysical Phenomena (astro-ph.HE) Interstellar magnetic field is essential in various astrophysical phenomena and processes. Pulsar halos are a recently discovered class of TeV gamma-ray sources formed by escaping electrons/positrons from pulsars. The morphology of the halo is regulated by the diffusion of those escaping particles, and hence carries information of the interstellar magnetic field. We suggest that the morphology of TeV pulsar halos can be used as a novel probe of the properties of interstellar magnetic field around the pulsar, such as the Alfvénic Mach number and the mean direction. We establish a theoretical relation between these quantities and the observational features of the halo's morphology based on the anisotropic diffusion model, and show how X-ray observations of the pulsar halos can further improve the diagnosis of the magnetic field.",
      "pdf_url": "https://arxiv.org/pdf/2512.07290.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.14065",
      "title": "Unveiling Hidden Clustering: An Unsupervised Machine Learning Study of Repeating FRB 20220912A",
      "authors": [
        "An-Chieh Hsu",
        "Tetsuya Hashimoto",
        "Tomotsugu Goto",
        "Tomoki Wada",
        "Bjorn Jasper Raquel"
      ],
      "abstract": "Unveiling Hidden Clustering: An Unsupervised Machine Learning Study of Repeating FRB 20220912A An-Chieh Hsu, Tetsuya Hashimoto, Tomotsugu Goto, Tomoki Wada, Bjorn Jasper Raquel Accepted for publication in PASP High Energy Astrophysical Phenomena (astro-ph.HE) Fast Radio Bursts (FRBs) are millisecond-duration radio transients of extragalactic origin. Classifying repeating FRBs is essential for understanding their emission mechanisms, but remains challenging due to their short durations, high variability, and increasing data volume. Traditional methods often rely on subjective criteria and struggle with high-dimensional data. In this study, we apply an unsupervised machine learning framework that combines Uniform Manifold Approximation and Projection (UMAP) and Hierarchical Density-Based Spatial Clustering of Applications with Noise (HDBSCAN) to eight observed parameters from FRB 20220912A. Our analysis reveals three distinct clusters of bursts with varying spectral and fluence properties. Comparisons with clustering studies on other repeaters show that some of our clusters share similar features with sources such as FRB 20201124A and FRB 121102, suggesting possible common emission mechanisms. We also provide qualitative interpretations for each cluster, highlighting the spectral diversity within a single source. Notably, one cluster shows broadband emission and high fluence, which are typically seen in non-repeating FRBs. This raises the possibility that some non-repeaters may be misclassified repeaters due to observational limitations. Our results demonstrate the utility of machine learning in uncovering intrinsic diversity in FRB emission and provide a foundation for future classification studies.",
      "pdf_url": "https://arxiv.org/pdf/2601.14065.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.14801",
      "title": "The Supernova Remnant G284.3$-$1.8 and Its Relation to the Gamma-ray Binary 1FGL J1018.6$-$5856",
      "authors": [
        "Natsuki Terano",
        "Takaaki Tanaka",
        "Hiromasa Suzuki",
        "Rei Enokiya",
        "Hiroyuki Uchida",
        "Kai Matsunaga",
        "Takuto Narita",
        "Yasuo Fukui",
        "Toshiki Sato"
      ],
      "abstract": "The Supernova Remnant G284.3$-$1.8 and Its Relation to the Gamma-ray Binary 1FGL J1018.6$-$5856 Natsuki Terano, Takaaki Tanaka, Hiromasa Suzuki, Rei Enokiya, Hiroyuki Uchida, Kai Matsunaga, Takuto Narita, Yasuo Fukui, Toshiki Sato 6 pages, 8 figures, 2 tables, accepted for publication in PASJ High Energy Astrophysical Phenomena (astro-ph.HE) G284.3$-$1.8 is a supernova remnant with a radio shell and thermal X-ray emission. Located near its center is the gamma-ray binary 1FGL J1018.6$-$5856, although the physical association between the two systems is not clear yet. Our X-ray spectroscopy with Suzaku reveals that G284.3$-$1.8 and 1FGL J1018.6$-$5856 have compatible absorption column densities of $N_\\mathrm{H} = 6\\textrm{--}7 \\times 10^{21}~\\mathrm{cm}^{-2}$, indicating that the two systems have similar distances. The actual distance is determined as $3~\\mathrm{kpc}$ using $\\mathrm{^{12}CO}$ ($J=1\\textrm{--}0$) data obtained with NANTEN. The X-ray spectrum of G284.3$-$1.8 shows a strong K-shell emission line of Mg, confirming that the earlier claim that the SNR is one of the few Mg-rich SNRs. Comparing recent stellar models taking into account the \"shell merger\" processes, we find that the obtained Mg-to-Ne mass ratio of $M_\\mathrm{Mg}/M_\\mathrm{Ne} = 0.73^{+0.07}_{-0.03}$ and Si-to-Mg mass ratio of $M_\\mathrm{Si}/M_\\mathrm{Mg} = 0.44\\pm0.03$ suggest a supernova explosion that would have left a neutron star. The characteristics of 1FGL J1018.6$-$5856, on the other hand, are better explained with a model in which its compact object is neutron star. The present results, therefore, would suggest a possible scenario where G284.3$-$1.8 and 1FGL J1018.6$-$5856 are both remnants of a common supernova explosion although further observational tests are necessary.",
      "pdf_url": "https://arxiv.org/pdf/2601.14801.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15373",
      "title": "Hierarchical bayesian inference: constraining population distribution of dark matter halo shapes via stellar streams",
      "authors": [
        "David Chemaly",
        "Elisabeth Sola",
        "Vasily Belokurov",
        "Sergey Kosposov",
        "GyuChul Meyong",
        "HanYuan Zhang",
        "Denis Erkal"
      ],
      "abstract": "Hierarchical bayesian inference: constraining population distribution of dark matter halo shapes via stellar streams David Chemaly, Elisabeth Sola, Vasily Belokurov, Sergey Kosposov, GyuChul Meyong, HanYuan Zhang, Denis Erkal Astrophysics of Galaxies (astro-ph.GA) Stellar streams, the debris of tidally disrupted satellites, trace their host's gravitational potential and thus probe dark matter halo structure. While six-dimensional phase-space data of Galactic streams enable precise dark matter halo modelling in the Milky Way, streams around external galaxies are typically available only as low surface brightness features without kinematics (i.e. two-dimensional photometric data), providing only weak constraints when considered individually. We present a hierarchical Bayesian framework that infers the population distribution of halo flattening using only projected stream tracks. Streams are forward-modelled in StreaMAX, a new JAX-accelerated particle-spray package that achieves orders of magnitude faster stream generation when compared to traditional methods. For each stream we fit an axisymmetric dark matter halo model and obtain a posterior on the flattening. These posteriors are then combined through hierarchical reweighting to constrain the population distribution. Using mock data, we show that individual fits recover the correct flattening with modest precision and exhibit projection-induced multi-modalities. Nevertheless, aggregating these fits yields accurate and confident constraints on the underlying population distribution of dark matter halo morphologies, clearly distinguishing between oblate, spherical, and prolate populations. The total computational cost scales linearly with sample size. Our results demonstrate that ensembles of purely photometric streams carry sufficient information to constrain dark matter halo shapes in external galaxies at the population level. With the forthcoming samples from Euclid and Rubin/LSST, this approach offers a practical path to population-level inferences of halo morphology without any kinematic measurements.",
      "pdf_url": "https://arxiv.org/pdf/2601.15373.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15374",
      "title": "What factors shape the radio luminosity of star-forming galaxies? A new calibration from LoTSS-DR2",
      "authors": [
        "Shravya Shenoy",
        "Daniel J. B. Smith",
        "Sarah K. Biddle",
        "Gülay Gürkan",
        "Martin J. Hardcastle",
        "Marina I. Arnaudova",
        "Soumyadeep Das",
        "Luke R. Holden",
        "Gaoxiang Jin",
        "Leah K. Morabito",
        "Huub J. A. Röttgering"
      ],
      "abstract": "What factors shape the radio luminosity of star-forming galaxies? A new calibration from LoTSS-DR2 Shravya Shenoy, Daniel J. B. Smith, Sarah K. Biddle, Gülay Gürkan, Martin J. Hardcastle, Marina I. Arnaudova, Soumyadeep Das, Luke R. Holden, Gaoxiang Jin, Leah K. Morabito, Huub J. A. Röttgering 19 pages, 10 figures. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Radio observations offer a dust-unobscured view of galaxy star formation via the radio continuum-star formation rate (RC--SFR) relation. Emerging evidence of a stellar mass dependence in the RC--SFR relation raises the broader question of how other galaxy properties may influence this relation. In this work, we study the dependence of the global RC--SFR relation on galaxy properties in local ($z\\,\\leq$\\,0.3) star-forming galaxies (SFGs) using the second data release of the LOFAR Two-Metre Sky Survey (LoTSS-DR2). Employing a non-parametric decision-tree regression algorithm, we identify the most important galaxy properties for estimating the radio luminosity using a sample of 18,828 emission-line-classified SFGs based on spectroscopic data from the SDSS-DR8. Along with the spectroscopically obtained SFRs and stellar mass values, we also use SFRs and stellar masses derived using photometric SED-fitting from the \\textit{GALEX}--SDSS--\\textit{WISE} Legacy Catalogue (GSWLC) for the same sample. We find that a galaxy's SFR is most important for predicting the radio luminosity, followed by the stellar mass, at $>5\\sigma$ significance. Complementing the LoTSS catalogue 150\\,MHz flux densities with aperture photometry for the rest of the emission-line classified sample (35,099 galaxies in total), we obtain a new calibration of the RC--SFR relation, which does not change significantly whether we use spectroscopic or photometrically derived SFRs and stellar masses, despite the fact that the methods probe star formation on different characteristic timescales. Our results highlight the utility of decision-tree algorithms for handling censored radio-selected galaxy samples, which will be useful for future spectroscopic surveys of radio sources.",
      "pdf_url": "https://arxiv.org/pdf/2601.15374.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15381",
      "title": "Blazars define a stable celestial reference frame",
      "authors": [
        "Nathan Secrest",
        "Sebastien Lambert"
      ],
      "abstract": "Blazars define a stable celestial reference frame Nathan Secrest, Sebastien Lambert 11 pages, 10 figures, accepted for publication in Astronomy & Astrophysics. arXiv abstract abridged to meet character limit Astrophysics of Galaxies (astro-ph.GA) Recent work has shown that optical-radio position offsets and radio position variability are inversely correlated with the photometric variability of active galactic nuclei (AGN). A key prediction of these findings is that a reference frame constructed using highly photometrically variable AGN should be more stable than a frame that does not account for variability and that variability can be used to optimally weight all sources in order to maximize frame stability. Using ICRF3 matched to Gaia DR3, we employed a bootstrap method to estimate the multi-epoch stability of frames constructed using AGN selected at varying levels of photometric variability. We fit vector spherical harmonics to the coordinate differences between the three ICRF3 frames (S/X, K, and X/Ka) and Gaia and quantified the statistical dispersion as a function of blazar-like (high variability), quasar-like (low variability), and intermediate-variability class. An S/X reference frame constructed using blazars exceeds the stability of a frame constructed with quasars by a factor of 6 and is twice as stable as the ICRF3 defining sources. At K and X/Ka, a blazar-based frame matches or exceeds the stability of the defining sources by a factor of 1.4 in the case of X/Ka and exceeds the stability of a frame based on quasars by over a factor of 2 in both cases. The smaller improvement at K and X/Ka is likely because sources selected at higher frequency are more likely to be blazars. We derived a variability-based astrometric covariance scaling method that results in factor of 2 reduction in frame distortions and instabilities between S/X and Gaia, with a mild improvement for K but no difference for X/Ka, which is dominated by known distortions. Our results confirm the prediction that an optimal weighting of the link between the optical and radio celestial reference frames is enabled by accounting for photometric variability.",
      "pdf_url": "https://arxiv.org/pdf/2601.15381.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15382",
      "title": "A Stratification in Magnetic Field Structures: The Radio Outflow in NGC 4151",
      "authors": [
        "Salmoli Ghosh",
        "P. Kharb",
        "E. Costantini",
        "J. Gallimore",
        "D. Williams-Baldwin",
        "M. Mehdipour"
      ],
      "abstract": "A Stratification in Magnetic Field Structures: The Radio Outflow in NGC 4151 Salmoli Ghosh (NCRA-TIFR), P. Kharb (NCRA-TIFR), E. Costantini (SRON, API-UvA, The Netherlands), J. Gallimore (Bucknell University), D. Williams-Baldwin (JBCA, The University of Manchester), M. Mehdipour (University of Michigan) Accepted for publication in the Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) The nature of radio outflows in radio-quiet AGN remains poorly understood. In this study, we present kpc-scale polarization observations of the Seyfert galaxy NGC\\,4151 using the Karl G. Jansky Very Large Array (VLA) in B-array at 3 and 10 GHz. We find that the inferred magnetic (B-) field structures show a stratification: a `spine-sheath'-like structure, with fields perpendicular to the jet direction in the `spine' and parallel in the `sheath', is observed in the higher resolution (0.5 arcsec) image at 10 GHz. In addition, a `wind'-like component with B-fields perpendicular to the radio outflow is observed in the 3 GHz image (resolution 2 arcsec); this feature is prominent along the `receding' (eastern) jet direction. Rotation measure (RM) ranges from $-230$ to 250 rad m$^{-2}$ over the polarized regions, indicating a low-electron-density ($10^{-2}-10^{-3}$ cm$^{-3}$) tenuous medium surrounding the source causing Faraday rotation. A {tentative} RM gradient of $+75$ to $-25$ rad m$^{-2}$ is observed transverse to the northern `wind' component, while a similar gradient with opposite sign is seen across the southern `wind' component, suggestive of a helical magnetic field threading the outflow. Based on an analysis of the available radio and X-ray data, we conclude that the stratified radio outflow in NGC 4151 is magnetically-driven. The bi-conical radio `wind' is found to be massive ($1050-3200 M_\\odot$) with a high mass outflow rate ($0.01-0.03$ M$_\\odot$ yr$^{-1}$) but low in kinetic power ($<0.01$% of L$_{\\rm{bol}}$), making it less impactful for galactic-scale feedback. Our study suggests that radio-quiet AGN may also host magnetically dominant jets and winds, even while their jets are smaller and weaker compared to radio-loud AGN.",
      "pdf_url": "https://arxiv.org/pdf/2601.15382.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15384",
      "title": "An Analysis of AGN Feedback in the Compact Galaxy Group Stephan's Quintet",
      "authors": [
        "Maura Kathleen Shea , D. Michael Crenshaw , Travis C. Fischer , Mitchell Revalski , Julia Falcone , Beena Meena , Zo Chapman , Jacob Tutterow , Madeline Davis , Kesha Patel Department of Physics and Astronomy, Georgia State University, Atlanta, GA, USA, AURA for ESA, Space Telescope Science Institute, Baltimore, MD, USA, Space Telescope Science Institute, Baltimore, MD, USA, College of Computer Science, Georgia Institute of Technology, Atlanta, GA, USA, Kapteyn Astronomical Institute, University of Groningen, AV Groningen, the Netherlands, Department of Physics and Astronomy, Tufts University, Medford, MA, USA)"
      ],
      "abstract": "An Analysis of AGN Feedback in the Compact Galaxy Group Stephan's Quintet Maura Kathleen Shea (1), D. Michael Crenshaw (1), Travis C. Fischer (2), Mitchell Revalski (3), Julia Falcone (1), Beena Meena (3), Zo Chapman (4), Jacob Tutterow (5), Madeline Davis (1), Kesha Patel (6) ((1) Department of Physics and Astronomy, Georgia State University, Atlanta, GA, USA, (2) AURA for ESA, Space Telescope Science Institute, Baltimore, MD, USA, (3) Space Telescope Science Institute, Baltimore, MD, USA, (4) College of Computer Science, Georgia Institute of Technology, Atlanta, GA, USA, (5) Kapteyn Astronomical Institute, University of Groningen, AV Groningen, the Netherlands, (6) Department of Physics and Astronomy, Tufts University, Medford, MA, USA) Astrophysics of Galaxies (astro-ph.GA) Compact galaxy groups are ideal laboratories for studying the effects of interactions between AGN and multiple nearby galaxies. Recent JWST observations of the nearby compact group Stephan's Quintet highlight tidal flows between the interacting galaxies as well as outflows from the active galaxy NGC 7319. To study the kinematics on a large scale throughout the group, we obtained spatially-resolved long-slit spectra of Stephan's Quintet at multiple slit positions with Apache Point Observatory's Kitt Peak Ohio State Multi-Object Spectrograph. We fit multiple Gaussians to the H$\\alpha$ $\\lambda$6563 Å and [N II] $\\lambda\\lambda$6548, 6583 Å emission lines to isolate the different kinematic components. We used the kinematics to develop the first biconical outflow model of the narrow-line region of NGC 7319. Using a combination of galactic rotation models, biconical outflow models, and kinematic maps of the ionized gas, we disentangled the outflows, rotation, and tidal flows in the group. We found outflow radial velocities up to 550 km s$^{-1}$ peaking at 2.6 kpc from the central supermassive black hole, and a transition from AGN-powered outflows to gravitationally-powered tidal flows at a projected distance between 2.4 -- 6.3 kpc. We performed a line ratio analysis and determined the gas shows Seyfert-like ionization out to 6.3 kpc (projected), which supports our finding that gas outside this radius is predominantly powered by tidal flows. Our separation of kinematic components in Stephan's Quintet will enable future studies of the physical conditions and dynamical forces in the ionized gas to better quantify the feeding and feedback processes of AGN in compact groups.",
      "pdf_url": "https://arxiv.org/pdf/2601.15384.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15435",
      "title": "The role of gas stripping in the quenching of satellite galaxies using SHARK v2.0",
      "authors": [
        "Megan K. Oxland",
        "Matías Bravo",
        "Laura C. Parker",
        "Claudia del P. Lagos"
      ],
      "abstract": "The role of gas stripping in the quenching of satellite galaxies using SHARK v2.0 Megan K. Oxland, Matías Bravo, Laura C. Parker, Claudia del P. Lagos 10 pages, 8 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) Observational studies have made substantial progress in characterizing quenching as a function of stellar mass and environment, but they are often limited in their ability to constrain quenching timescales and to determine the dominant environmental process responsible for the shutting down of star formation. To address this, we combine recent Sloan Digital Sky Survey (SDSS) observations with the SHARK v2.0 semi-analytic model to study the quenching of satellite galaxies in groups and clusters. We generate mock SDSS-like observations to calibrate the hot halo and cold interstellar medium (ISM) gas stripping prescriptions against observed satellite quenched fractions, finding that the previously adopted stripping prescriptions in SHARK v2.0 are too aggressive and overestimate the quenched fraction of satellite galaxies. Reducing the efficiency of both hot and cold gas stripping yields excellent agreement with observations for low- and intermediate-mass satellite galaxies. We use the calibrated model to investigate quenching timescales and find that satellites quench more quickly in clusters compared to groups, with timescales that generally decrease with increasing stellar mass. The long (>2 Gyr) timescales we measure favour hot halo gas removal as the dominant driver of satellite quenching.",
      "pdf_url": "https://arxiv.org/pdf/2601.15435.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15585",
      "title": "Multi-band Reconstruction of Sixteen Gravitational Lens Systems using PISCO data",
      "authors": [
        "Huimin Qu",
        "Daniel J. Ballard",
        "Geraint F. Lewis",
        "Karl Glazebrook",
        "Antony Stark",
        "Sarah M. Sweet",
        "Colin Jacobs",
        "Kim-Vy Tran",
        "Brian Stalder",
        "Tania M. Barone",
        "Tucker Jones",
        "Keerthi Vasan G.C.",
        "Thomas E. Collett",
        "Glenn G. Kacprzak",
        "Dorota Bayer"
      ],
      "abstract": "Multi-band Reconstruction of Sixteen Gravitational Lens Systems using PISCO data Huimin Qu, Daniel J. Ballard, Geraint F. Lewis, Karl Glazebrook, Antony Stark, Sarah M. Sweet, Colin Jacobs, Kim-Vy Tran, Brian Stalder, Tania M. Barone, Tucker Jones, Keerthi Vasan G.C., Thomas E. Collett, Glenn G. Kacprzak, Dorota Bayer Accepted by MNRAS. 22 pages, 16 figures, 4 tables Astrophysics of Galaxies (astro-ph.GA) Next-generation surveys such as the Euclid survey, the Legacy Survey of Space and Time (LSST), and the China Space Station Telescope (CSST) survey are expected to discover ~10^5 galaxy-galaxy scale strong gravitational lenses. This motivates the development of scalable and robust lens modeling approaches that can efficiently and reliably learn from wide-field survey datasets before high-resolution follow-up. We design a scalable, Bayesian, Lenstronomy-based pipeline and apply it to a sample of sixteen lens candidates observed with the Parallel Imager for Southern Cosmology Observations (PISCO) on the Magellan telescope. PISCO provides four-band imaging (z, i, r, g) with colours, depth and seeing conditions comparable to LSST. To fully exploit the constraining power of this dataset, our pipeline performs simultaneous multi-band modeling, using a common mass profile across all four bands while allowing independent light profiles in each. This approach leverages color information to provide joint constraints on the lens mass and yields reduced uncertainties compared to single-band analyses. Fifteen out of sixteen PISCO lens candidates are successfully recovered with interpretable lensing configurations, including DESJ0533-2536, the first reported hyperbolic-umbilic galaxy-galaxy scale strong lensing candidate. We further assess how much model complexity can be reliably constrained given the resolution and seeing of PISCO-like data. Overall, our results demonstrate that scalable, multi-band lens modeling of ground-based data can extract meaningful constraints on mass and source morphology, providing a practical pathway to maximize the scientific return from large samples in upcoming surveys.",
      "pdf_url": "https://arxiv.org/pdf/2601.15585.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15665",
      "title": "K-DRIFT Science Theme: Galactic Cirrus Clouds and Circumgalactic Medium",
      "authors": [
        "Kwang-il Seon",
        "Jaehyun Lee",
        "Jongwan Ko",
        "Woowon Byun",
        "Jaewon Yoo",
        "Kyungwon Chun",
        "Sang-Hyun Chun",
        "Sungryong Hong",
        "Jae-Woo Kim",
        "Hong Soo Park",
        "Jihye Shin"
      ],
      "abstract": "K-DRIFT Science Theme: Galactic Cirrus Clouds and Circumgalactic Medium Kwang-il Seon, Jaehyun Lee, Jongwan Ko, Woowon Byun, Jaewon Yoo, Kyungwon Chun, Sang-Hyun Chun, Sungryong Hong, Jae-Woo Kim, Hong Soo Park, Jihye Shin accepted for publication in JKAS, 14 pages, 8 figures Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) In this paper, we review the extended halo material and the circumgalactic medium (CGM), including both dust and gas, and discuss promising science cases that could be realized using the KASI Deep Rolling Imaging Fast Telescope (K-DRIFT). Scattered starlight from cirrus clouds in our Galaxy poses one of the major challenges to studying the low surface brightness features of extragalactic sources. Therefore, it is essential to investigate how to discriminate extragalactic sources from the cirrus cloud features. At the same time, interstellar dust clouds themselves are fundamental to understanding dust properties and the interstellar radiation field, both of which are essential for studies of chemical evolution and star formation in our Galaxy. Measuring the reddening of background sources, such as quasars, with K-DRIFT, which benefits from its broad field of view and accurate background subtraction, allows for effective detection of extended dust in galactic halos, the CGM, and intracluster space. Observations of the H-alpha emission lines can be used to identify signatures of star formation activity within galaxies, as well as the environmental effects acting on them. Galactic winds driven by active galactic nuclei and starbursts can be traced through H-alpha emission. Strong ram pressure stripping effectively removes the interstellar medium (ISM) from galaxies. The stripped ISM becomes ionized or dissociated through mixing with the hot intracluster medium (ICM), forming H-alpha tails. The surface brightness of these H-alpha tails correlates not only with the presence of star formation in the tails but also the mixing stage of the stripped ISM and ICM. The H-alpha survey with K-DRIFT will enable the investigation of the evolutionary stages of ram pressure stripped galaxies in cluster environments, as well as the multiphase gas reservoir around galaxies and in the CGM.",
      "pdf_url": "https://arxiv.org/pdf/2601.15665.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15791",
      "title": "Deuteration of HC3N and CH3CCH in the pre-stellar core L1544",
      "authors": [
        "K. Giers",
        "S. Spezzano",
        "Y. Lin",
        "P. Caselli",
        "O. Sipilä"
      ],
      "abstract": "Deuteration of HC3N and CH3CCH in the pre-stellar core L1544 K. Giers, S. Spezzano, Y. Lin, P. Caselli, O. Sipilä 15 pages, 13 figures, accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Deuterated molecules are a useful diagnostic tool to probe the evolution and the kinematics in the earliest stages of star formation. Due to the low temperatures and high densities in the centre of pre-stellar cores, the deuterium fraction is enhanced by several orders of magnitude. We study the distribution of the emission and the deuteration of the two carbon chains HC3N and CH3CCH throughout the pre-stellar core L1544. We analyse emission maps of CH3CCH, CH2DCCH, CH3CCD, HC3N, HCC13CN, and DC3N, observed with the IRAM 30m single-dish radio telescope. We use non-LTE radiative transfer calculations, combined with chemical modelling of the molecular abundances, to constrain physical parameters of the observed species. Following this, we derive the column density and deuteration maps. We find D-fractions of N(DC3N)/N(HC3N)=0.04-0.07, N(CH2DCCH)/N(CH3CCH)=0.09-0.15, and N(CH3CCD)/N(CH3CCH)=0.07-0.09. The deuteration of HC3N appears homogeneous across the core, with widespread D-fraction values above 0.06, tracing intermediate-density gas in the outer layers of the core. CH3CCD is most efficiently formed in the higher-density regions towards the core centre, while the D-fraction of CH2DCCH traces a local density enhancement in the north-east of the core, coinciding with the CH3OH emission peak. The results suggest that gas-phase reactions dominate the formation and deuteration of both HC3N and CH3CCH in L1544, with spatial variations driven by physical structure, density and external radiation. The significantly higher D-fraction of CH2DCCH compared to CH3CCD and a tentative gradient with higher values in the north suggest different deuteration mechanisms for the two functional groups. Similarities between the CH2DCCH emission and CH2DOH might indicate an additional deuteration pathway of CH3CCH on the surfaces of dust grains, as observed for H2CO.",
      "pdf_url": "https://arxiv.org/pdf/2601.15791.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15954",
      "title": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: NIRCam Imaging in GOODS-S and GOODS-N",
      "authors": [
        "Benjamin D. Johnson",
        "Brant E. Robertson",
        "Daniel J. Eisenstein",
        "Sandro Tacchella",
        "Dávid Puskás",
        "Qiao Duan",
        "Zihao Wu",
        "Kevin Hainline",
        "Marcia Rieke",
        "Chris Willott",
        "Christopher N. A. Willmer",
        "James A. A. Trussler",
        "Stacey Alberts",
        "Santiago Arribas",
        "William M. Baker",
        "Andrew J. Bunker",
        "Alex J. Cameron",
        "Stefano Carniani",
        "Courtney Carreira",
        "Phillip A. Cargile",
        "Emma Curtis-Lake",
        "Eiichi Egami",
        "Ryan Hausen",
        "Jakob M. Helton",
        "Zhiyuan Ji",
        "Roberto Maiolino",
        "Pablo G. Pérez-González",
        "Pierluigi Rinaldi",
        "Fengwu Sun",
        "Yang Sun",
        "Natalia C. Villanueva",
        "Christina C. Williams",
        "Yongda Zhu"
      ],
      "abstract": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: NIRCam Imaging in GOODS-S and GOODS-N Benjamin D. Johnson, Brant E. Robertson, Daniel J. Eisenstein, Sandro Tacchella, Dávid Puskás, Qiao Duan, Zihao Wu, Kevin Hainline, Marcia Rieke, Chris Willott, Christopher N. A. Willmer, James A. A. Trussler, Stacey Alberts, Santiago Arribas, William M. Baker, Andrew J. Bunker, Alex J. Cameron, Stefano Carniani, Courtney Carreira, Phillip A. Cargile, Emma Curtis-Lake, Eiichi Egami, Ryan Hausen, Jakob M. Helton, Zhiyuan Ji, Roberto Maiolino, Pablo G. Pérez-González, Pierluigi Rinaldi, Fengwu Sun, Yang Sun, Natalia C. Villanueva, Christina C. Williams, Yongda Zhu Submitted to AAS Journals. Images and associated data will be made available at MAST as a High Level Science Product via this https URL . Temporary access is available through this https URL Astrophysics of Galaxies (astro-ph.GA) We present the Near Infrared Camera (NIRCam) imaging products of the fifth data release (DR5) of the James Webb Space Telescope (JWST) Advanced Deep Extragalactic Survey (JADES). The JADES survey is one of the most ambitious programs yet conducted on JWST, producing deep infrared imaging and multiobject spectroscopy on the GOODS-S and GOODS-N extragalactic deep fields in order to explore galaxies to the earliest epoch. Here we describe the NIRCam data reduction procedures that result in deep and well-characterized mosaics in up to 18 filters covering 469 arcmin$^2$, with 250 arcmin$^2$ having at least 8 filters of coverage. This release contains the full NIRCam imaging of JADES, over 800 JWST mission hours, as well as co-reductions of 19 other programs in these two premier deep fields. We perform detailed tests on the final data products, thereby characterizing the photometric properties, point-spread function, and astrometric alignment. We release mosaics for individual programs (or epochs, depending on scheduling) and the mosaics combining data from all programs in order to facilitate photometric variability studies and the deepest possible photometry.",
      "pdf_url": "https://arxiv.org/pdf/2601.15954.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15955",
      "title": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: MIRI Coordinated Parallels in GOODS-S and GOODS-N",
      "authors": [
        "Stacey Alberts",
        "Daniel J. Eisenstein",
        "Andrew J. Bunker",
        "Emma Curtis-Lake",
        "Qiao Duan",
        "Kevin Hainline",
        "Ryan Hausen",
        "Jakob M. Helton",
        "Zhiyuan Ji",
        "Benjamin D. Johnson",
        "Jianwei Lyu",
        "Jane Morrison",
        "Pablo G. Perez-Gonzalez",
        "George H. Rieke",
        "Marcia Rieke",
        "Pierluigi Rinaldi",
        "Brant Robertson",
        "Yang Sun",
        "Sandro Tacchella",
        "Christina C. Williams",
        "Christopher N. A. Willmer",
        "Zihao Wu"
      ],
      "abstract": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: MIRI Coordinated Parallels in GOODS-S and GOODS-N Stacey Alberts, Daniel J. Eisenstein, Andrew J. Bunker, Emma Curtis-Lake, Qiao Duan, Kevin Hainline, Ryan Hausen, Jakob M. Helton, Zhiyuan Ji, Benjamin D. Johnson, Jianwei Lyu, Jane Morrison, Pablo G. Perez-Gonzalez, George H. Rieke, Marcia Rieke, Pierluigi Rinaldi, Brant Robertson, Yang Sun, Sandro Tacchella, Christina C. Williams, Christopher N. A. Willmer, Zihao Wu Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Medium to ultra-deep mid-infrared imaging surveys with the James Webb Space Telescope (JWST)'s Mid-Infrared Instrument (MIRI) are reframing our view of the early Universe, from the emergence of ultra-red dusty and quiescent galaxies to the epoch of reionization to the first galaxies. Here we present the MIRI coordinated parallels component of the JADES program, which obtained ultra-deep (155 ks) imaging at $7.7 \\mu$m over $\\sim10$ arcmin$^2$ as well as medium depth ($\\sim5-15$ ks) imaging at $7.7, 12.8$, and $15 \\mu$m over $\\sim36$, 25, and 22 arcmin$^2$, respectively, in the GOODS-S and GOODS-N fields. This paper describes the data reduction, which combines the official JWST Calibration Pipeline with custom steps to optimize flagging of warm/hot pixels and optimize background subtraction. We further introduce a new step to address artifacts caused by persistence from saturating sources. The final, fully reduced JADES/MIRI mosaics are being released as part of JADES Data Release 5, along with prior-based forced photometry using NIRCam detection images, providing critical rest-frame near-infrared and optical constraints on early galaxy populations.",
      "pdf_url": "https://arxiv.org/pdf/2601.15955.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15957",
      "title": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: Catalogs of inferred morphological properties of galaxies from JWST/NIRCam imaging in GOODS-N and GOODS-S",
      "authors": [
        "Courtney Carreira",
        "Brant E. Robertson",
        "A. Lola Danhaive",
        "Zhiyuan Ji",
        "Marcia Rieke",
        "Sandro Tacchella",
        "Natalia C. Villanueva",
        "Christopher N. A. Willmer",
        "Zihao Wu",
        "Yongda Zhu",
        "William M. Baker",
        "Andrew J. Bunker",
        "Alex J. Cameron",
        "Jacopo Chevallard",
        "Emma Curtis-Lake",
        "Qiao Duan",
        "Daniel J. Eisenstein",
        "Kevin Hainline",
        "Ryan Hausen",
        "Benjamin D. Johnson",
        "Roberto Maiolino",
        "Petra Mengistu",
        "Dávid Puskás",
        "Pierluigi Rinaldi",
        "Yang Sun",
        "James A. A. Trussler",
        "Hannah Übler",
        "Anavi Uppal",
        "Christina C. Williams"
      ],
      "abstract": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: Catalogs of inferred morphological properties of galaxies from JWST/NIRCam imaging in GOODS-N and GOODS-S Courtney Carreira, Brant E. Robertson, A. Lola Danhaive, Zhiyuan Ji, Marcia Rieke, Sandro Tacchella, Natalia C. Villanueva, Christopher N. A. Willmer, Zihao Wu, Yongda Zhu, William M. Baker, Andrew J. Bunker, Alex J. Cameron, Jacopo Chevallard, Emma Curtis-Lake, Qiao Duan, Daniel J. Eisenstein, Kevin Hainline, Ryan Hausen, Benjamin D. Johnson, Roberto Maiolino, Petra Mengistu, Dávid Puskás, Pierluigi Rinaldi, Yang Sun, James A. A. Trussler, Hannah Übler, Anavi Uppal, Christina C. Williams 22 pages, 7 main figures, 6 appendix figures. Submitted to AAS Journals. Catalogs will be made publicly available upon manuscript acceptance Astrophysics of Galaxies (astro-ph.GA) We present morphological parameters and their uncertainties for all sources detected in JWST/NIRCam imaging in GOODS-N and GOODS-S from the JWST Advanced Deep Extragalactic Survey (JADES) catalogs. We model the surface brightness profiles of these sources with single-component Sérsic profiles, performing Bayesian inference of galaxy structural parameters. We fit each of the $>10^5$ sources with every available JWST/NIRCam wide-band filter individually, amounting to over 3 million Sérsic profiles computed. We provide catalogs of this morphological information, building one of the largest extragalactic morphological datasets to date, which we share alongside imaging and photometry from the JADES Data Release 5. With this information, we analyze the rest-frame optical redshift evolution of the effective radius and the surface luminosity density within a radius of 1 kiloparsec, $\\Sigma_{\\text{1 kpc}}$, for 24,692 galaxies at $z>1$. We find $r_{\\text{eff}} \\propto (1+z)^{-0.635 \\pm 0.013}$ kpc, while $\\Sigma_{\\text{1 kpc}}$ is relatively constant across time. Additionally, we explore bulge-disk decomposition on a subset of 8,390 galaxies in the JADES deep imaging covering the Hubble Ultra Deep Field, finding the effective radius of the bulge-components to increase marginally with time, whereas the disk-component sizes evolve as $r_{\\text{eff,disk}} \\propto (1+z)^{-1.091 \\pm 0.043}$. Future work modeling multi-component surface brightness profiles will enable further analysis of the morphological evolution of galaxies across cosmic time.",
      "pdf_url": "https://arxiv.org/pdf/2601.15957.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15959",
      "title": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: Photometrically Selected Galaxy Candidates at z > 8",
      "authors": [
        "Kevin N. Hainline",
        "Daniel J. Eisenstein",
        "Lily Whitler",
        "Brant Robertson",
        "Benjamin D. Johnson",
        "Peter Jakobsen",
        "David Puskas",
        "Sandro Tacchella",
        "Jakob M. Helton",
        "Zihao Wu",
        "Santiago Arribas",
        "William M. Baker",
        "Andrew J. Bunker",
        "Alex J. Cameron",
        "Stefano Carniani",
        "Courtney Carreira",
        "Stephane Charlot",
        "Jacopo Chevallard",
        "Emma Curtis-Lake",
        "Francesco D'Eugenio",
        "Qiao Duan",
        "Eiichi Egami",
        "Ryan Hausen",
        "Zhiyuan Ji",
        "Tobias J. Looser",
        "Roberto Maiolino",
        "Petra Mengistu",
        "Pablo G. Perez-Gonzalez",
        "Marcia Rieke",
        "Pierluigi Rinaldi",
        "Fengwu Sun",
        "James A. A. Trussler",
        "Hannah Ubler",
        "Christina C. Williams",
        "Christopher N. A. Willmer",
        "Chris Willott",
        "Joris Witstok"
      ],
      "abstract": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: Photometrically Selected Galaxy Candidates at z > 8 Kevin N. Hainline, Daniel J. Eisenstein, Lily Whitler, Brant Robertson, Benjamin D. Johnson, Peter Jakobsen, David Puskas, Sandro Tacchella, Jakob M. Helton, Zihao Wu, Santiago Arribas, William M. Baker, Andrew J. Bunker, Alex J. Cameron, Stefano Carniani, Courtney Carreira, Stephane Charlot, Jacopo Chevallard, Emma Curtis-Lake, Francesco D'Eugenio, Qiao Duan, Eiichi Egami, Ryan Hausen, Zhiyuan Ji, Tobias J. Looser, Roberto Maiolino, Petra Mengistu, Pablo G. Perez-Gonzalez, Marcia Rieke, Pierluigi Rinaldi, Fengwu Sun, James A. A. Trussler, Hannah Ubler, Christina C. Williams, Christopher N. A. Willmer, Chris Willott, Joris Witstok 30 pages, 11 figures, submitted to the AAS Journals. Source data table can be found at DOI: https://doi.org/10.5281/zenodo.18306484 Astrophysics of Galaxies (astro-ph.GA) We present a sample of 2081 sources selected at photometric redshift $z_{\\mathrm{phot}} > 8$ across the JADES DR5 data release in GOODS-S and GOODS-N over a total area of 469 square arcmin. These sources range from $M_{\\mathrm{UV}} = -22$ to $M_{\\mathrm{UV}} = -16$, with 19 objects at $z_{\\mathrm{phot}} > 14$. We estimate the UV slopes for the full sample from fits to the photometry and find evidence for a steepening of the relationship between the UV continuum slope and $M_{\\mathrm{UV}}$ to higher redshifts, a result that differs from prior analyses of brighter samples in the literature. We provide evidence that over one quarter of our sources have evidence for being morphologically extended, with many galaxies showing multiple bright knots or clumps even out to $z \\sim 13 - 14$, an indication of how galaxies at Cosmic Dawn are growing and evolving. We discuss JADES-GN+189.15982+62.28899, a GOODS-N F200W dropout galaxy at $z_{\\mathrm{phot}} \\sim 15 - 18$ which has been observed spectroscopically with JWST/NIRSpec in prism mode, resulting in a very low signal-to-noise spectrum that is consistent with the photometry and rules out a number of low-redshift solutions for the source. Finally, we use a subsample of 123 objects in our sample with spectroscopic redshifts to explore the usage of alternate fitting templates and a prescription for Ly-$\\alpha$ damping wing absorption, finding that both produce significant improvements to the estimated photometric redshifts.",
      "pdf_url": "https://arxiv.org/pdf/2601.15959.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15960",
      "title": "JADES: A Prominent Galaxy Overdensity Candidate within the First 500 Myr",
      "authors": [
        "Zihao Wu",
        "Daniel J. Eisenstein",
        "Benjamin D. Johnson",
        "Kevin Hainline",
        "William M. Baker",
        "Andrew J. Bunker",
        "Alex J. Cameron",
        "Emma Curtis-Lake",
        "A. Lola Danhaive",
        "Ryan Hausen",
        "Jakob M. Helton",
        "Zhiyuan Ji",
        "Tobias J. Looser",
        "Roberto Maiolino",
        "Petra Mengistu",
        "Pierluigi Rinaldi",
        "Brant E. Robertson",
        "Fengwu Sun",
        "Sandro Tacchella",
        "James A. A. Trussler",
        "Christina C. Williams",
        "Christopher N. A. Willmer",
        "Joris Witstok"
      ],
      "abstract": "JADES: A Prominent Galaxy Overdensity Candidate within the First 500 Myr Zihao Wu, Daniel J. Eisenstein, Benjamin D. Johnson, Kevin Hainline, William M. Baker, Andrew J. Bunker, Alex J. Cameron, Emma Curtis-Lake, A. Lola Danhaive, Ryan Hausen, Jakob M. Helton, Zhiyuan Ji, Tobias J. Looser, Roberto Maiolino, Petra Mengistu, Pierluigi Rinaldi, Brant E. Robertson, Fengwu Sun, Sandro Tacchella, James A. A. Trussler, Christina C. Williams, Christopher N. A. Willmer, Joris Witstok Astrophysics of Galaxies (astro-ph.GA) We report a galaxy overdensity candidate at $z\\approx 10.5$ in the JWST Advanced Deep Extragalactic Survey (JADES). This overdensity contains 18 galaxies with consistent photometric redshifts and robust F115W dropouts within 8 comoving Mpc in projection. The galaxy number density is four times higher than the field expectation, accounting for one-third of comparably bright galaxies and nearly 50% of the total star formation rate at $10<z_\\mathrm{phot}<12$ in the GOODS-S field. Two compact members of the overdensity show potential Balmer breaks suggestive of evolved stellar populations or little red dots (LRDs). One-third of galaxies have close companions or substructures within 1 kpc at consistent photometric redshifts, implying more frequent interactions in an overdense environment. Most galaxies have stellar masses of 0.6-3$\\times10^8$ $M_\\odot$, half-light radii of $\\sim$200 pc, and star formation rates of $\\sim$5 $M_\\odot \\mathrm{yr^{-1}}$, with no significant deviation from typical high-redshift scaling relations. We find tentative evidence for a spatially varying Ly$\\alpha$ transmission inferred photometrically, consistent with an emerging ionized bubble. This overdensity provides a rare opportunity for probing the environmental impact on galaxy evolution and the onset of cosmic reionization within the first 500 Myr.",
      "pdf_url": "https://arxiv.org/pdf/2601.15960.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15961",
      "title": "JADES: Discovery of Large Reservoirs of Small Dust Grains in the Circumgalactic Medium of Massive Galaxies at $z\\sim3.5$ through Deep JWST/NIRCam Imaging and Grism Spectroscopy",
      "authors": [
        "Fengwu Sun",
        "Daniel J. Eisenstein",
        "Francesco D'Eugenio",
        "Kevin Hainline",
        "Jakob M. Helton",
        "Benjamin D. Johnson",
        "Xiaojing Lin",
        "Marcia Rieke",
        "Brant Robertson",
        "Sandro Tacchella",
        "Andrew J. Bunker",
        "Jacopo Chevallard",
        "Emma Curtis-Lake",
        "Eiichi Egami",
        "Ryan Hausen",
        "Zhiyuan Ji",
        "Jianwei Lyu",
        "Roberto Maiolino",
        "Pierluigi Rinaldi",
        "Yang Sun",
        "James A. A. Trussler",
        "Christina C. Williams",
        "Christopher N. A. Willmer",
        "Joris Witstok",
        "Zihao Wu",
        "Yongda Zhu"
      ],
      "abstract": "JADES: Discovery of Large Reservoirs of Small Dust Grains in the Circumgalactic Medium of Massive Galaxies at $z\\sim3.5$ through Deep JWST/NIRCam Imaging and Grism Spectroscopy Fengwu Sun, Daniel J. Eisenstein, Francesco D'Eugenio, Kevin Hainline, Jakob M. Helton, Benjamin D. Johnson, Xiaojing Lin, Marcia Rieke, Brant Robertson, Sandro Tacchella, Andrew J. Bunker, Jacopo Chevallard, Emma Curtis-Lake, Eiichi Egami, Ryan Hausen, Zhiyuan Ji, Jianwei Lyu, Roberto Maiolino, Pierluigi Rinaldi, Yang Sun, James A. A. Trussler, Christina C. Williams, Christopher N. A. Willmer, Joris Witstok, Zihao Wu, Yongda Zhu 23 pages, 14 figures. Comments are welcome Astrophysics of Galaxies (astro-ph.GA) Using JWST NIRCam imaging and grism spectroscopy from the JWST Advanced Deep Extragalactic Survey (JADES) Origins Fields, we report spectroscopic redshift measurements of 1,445 emission-line galaxies at $z=0-9$. Within this sample, we identify two prominent galaxy protoclusters at $z = 3.47$ and 3.69, each anchored by massive dusty star-forming galaxies (DSFGs). In the vicinity of these systems, we discover seven background galaxies at $z=3.6 - 6$ that simultaneously exhibit strong rest-frame optical emission lines (e.g., [O III] and H$\\alpha$) and unusually reddened UV-to-optical continua. We attribute this reddening to dust extinction arising from the circumgalactic medium (CGM) of the foreground DSFGs at projected separations of 7-30 kpc. We infer a high dust column density ($\\gtrsim 10^{-1}$ Msun/kpc^2), substantially exceeding those measured in low-redshift halos and those predicted by hydrodynamical simulations like IllustrisTNG and FIRE-2. The steep extinction curves, comparable to or steeper than that of the SMC, indicate a dominant population of small dust grains in the high-redshift CGM. We conclude that DSFGs at this epoch host large reservoirs of dusty CGM enriched to solar metallicity. These extended dust components are largely invisible to (sub-)millimeter interferometers such as ALMA because of their low surface brightness. We discuss the physical processes in dust transport that might be key to reproducing our observations, including galaxy mergers, cool-phase gas outflows, dust shattering, sputtering and radiation pressure. Finally, we caution that foreground CGM dust extinction may redden background galaxies at intermediate redshifts to mimic Lyman-break galaxies at $z\\gtrsim10$.",
      "pdf_url": "https://arxiv.org/pdf/2601.15961.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15962",
      "title": "Undermassive Hosts of $z = 4-6 $ AGN from JWST/NIRCam Image Decomposition with CONGRESS, FRESCO, and JADES",
      "authors": [
        "Zheng Ma",
        "Eichi Egami",
        "Yongda Zhu",
        "Fengwu Sun",
        "Jianwei Lyu",
        "Junyu Zhang",
        "Christopher N. A. Willmer",
        "Andrew J. Bunker",
        "Stefano Carniani",
        "Emma Curtis-Lake",
        "Ryan Hausen",
        "Xihan Ji",
        "Zhiyuan Ji",
        "Ignas Juodžbalis",
        "Roberto Maiolino",
        "George H. Rieke",
        "Pierluigi Rinaldi",
        "Yang Sun",
        "Sandro Tacchella",
        "Hannah Übler",
        "Christina C. Williams"
      ],
      "abstract": "Undermassive Hosts of $z = 4-6 $ AGN from JWST/NIRCam Image Decomposition with CONGRESS, FRESCO, and JADES Zheng Ma, Eichi Egami, Yongda Zhu, Fengwu Sun, Jianwei Lyu, Junyu Zhang, Christopher N. A. Willmer, Andrew J. Bunker, Stefano Carniani, Emma Curtis-Lake, Ryan Hausen, Xihan Ji, Zhiyuan Ji, Ignas Juodžbalis, Roberto Maiolino, George H. Rieke, Pierluigi Rinaldi, Yang Sun, Sandro Tacchella, Hannah Übler, Christina C. Williams Astrophysics of Galaxies (astro-ph.GA) In the local Universe, supermassive black hole (SMBH) masses strongly correlate with their host-galaxies' stellar masses ($M_{*}$), but galaxies hosting faint AGN recently found by JWST may deviate from this relation. To constrain the M$_{\\text{BH}}$-M$_{*}$ relation at high redshift, we performed AGN-host image decomposition for 17 low-luminosity AGN galaxies at $z$\\,$\\sim$\\,4--6 using NIRCam images in the JADES GOODS-N field. These sources are identified as AGNs from broad H$\\alpha$ emission lines detected by the CONGRESS and FRESCO surveys. We used \\textsc{galfit+MCMC} to fit spatial profiles in 7 wide-band images and detected extended emission in 9 sources out of 17. The close spatial alignment between the extended components and the AGN centers indicates that this emission likely originates from the host galaxies. These sources are extended at 0.9--2.0~$\\mu$m, suggesting significant host-galaxy light in the rest-frame UV. For the sources with the host detection, the stellar mass inferred based on image decomposition result can be 1-2 dex lower than the results without image decomposition. The BH-to-stellar mass ratio spans $M_{\\text{BH}}/M_\\ast$\\,$\\sim$\\,0.01--1.48, placing them well above the local $M_{\\text{BH}}$--$M_\\ast$ relation. In contrast, the host-galaxy size--mass relation broadly agrees with previous measurements. Our results suggest that the host galaxies of these faint AGN are either genuinely under-massive compared to their black hole masses, or too compact to be spatially resolved.",
      "pdf_url": "https://arxiv.org/pdf/2601.15962.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15963",
      "title": "There Is More to Outshining: 2D Dust Effects on Stellar Mass Estimates at $3 \\leq z < 9$ with JWST in the JADES Field",
      "authors": [
        "M. Hamed",
        "P. G. Pérez-González",
        "M. Annunziatella",
        "L. Colina",
        "I. Shivaei",
        "M. Perna",
        "A.J. Bunker",
        "K. Małek",
        "S. Arribas",
        "J. Álvarez-Márquez",
        "C.N.A. Willmer",
        "H. Übler",
        "R. Bhatawdekar",
        "J. Chevallard",
        "E. Curtis-Lake",
        "Z. Ji",
        "P. Rinaldi",
        "C.C. Williams"
      ],
      "abstract": "There Is More to Outshining: 2D Dust Effects on Stellar Mass Estimates at $3 \\leq z < 9$ with JWST in the JADES Field M. Hamed, P. G. Pérez-González, M. Annunziatella, L. Colina, I. Shivaei, M. Perna, A.J. Bunker, K. Małek, S. Arribas, J. Álvarez-Márquez, C.N.A. Willmer, H. Übler, R. Bhatawdekar, J. Chevallard, E. Curtis-Lake, Z. Ji, P. Rinaldi, C.C. Williams Astrophysics of Galaxies (astro-ph.GA) Dust attenuation modifies the observed spectral energy distribution (SED), leading to biases in the properties inferred from integrated SED fitting. As spatially resolved SED modeling becomes feasible for large high-redshift samples, it is increasingly important to assess how dust attenuation affects resolved mass estimates. We evaluate the impact of dust attenuation on stellar mass estimates derived from integrating spatially resolved SED fitting results. We perform spatially resolved and integrated SED fitting on a sample of 3408 galaxies at $3 \\leq z < 9$ from the GOODS South field, combining deep NIRCam from the JWST Advanced Deep Extragalactic Survey (JADES) and HST/ACS imaging from GOODS and CANDELS. We compare galaxy-integrated properties derived from fitting the summed SED with those obtained from spatially resolved SED modeling. Using a two-component dust attenuation model with a variable slope, we investigate how the dust attenuation slope, A(V), and stellar population properties contribute to discrepancies in the resulting stellar mass estimates. Resolved stellar masses are systematically higher than integrated estimates, with a median offset of +0.24 dex. Resolved analyses recover higher dust attenuations ($\\Delta A(V)\\approx +0.08$ mag), lower birth cloud fractions ($\\Delta\\mu \\approx -0.28$), and grayer attenuation curves ($\\Delta\\delta_{\\mathrm{ISM}} = +0.08$), arising from preferential sampling of compact star-forming regions. Integrated fits underestimate stellar ages by $\\sim23\\%$ at $z < 5$ and 31$\\%$ at $z \\gtrsim 5$. The stellar mass offset correlates strongly with the age difference and the attenuation slope difference, indicating that age-dependent outshining and spatially varying dust geometry are primary drivers of the discrepancy between resolved and integrated stellar masses.",
      "pdf_url": "https://arxiv.org/pdf/2601.15963.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15964",
      "title": "JADES: Evolution of nitrogen abundances in star-forming galaxies from z ~ 1.5-7",
      "authors": [
        "Alex J. Cameron",
        "Courtney Carreira",
        "Charlotte Simmonds",
        "Andrew J. Bunker",
        "Aayush Saxena",
        "Stefano Carniani",
        "Stéphane Charlot",
        "Jacopo Chevallard",
        "Emma Curtis-Lake",
        "Kevin Hainline",
        "Ryan Hausen",
        "Xihan Ji",
        "Zhiyuan Ji",
        "Benjamin D. Johnson",
        "Pierluigi Rinaldi",
        "Brant Robertson",
        "Jan Scholtz",
        "Maddie S. Silcock",
        "Sandro Tacchella",
        "James A. A. Trussler",
        "Hannah Übler",
        "Christina C. Williams",
        "Christopher N. A. Willmer",
        "Chris Willott",
        "Joris Witstok"
      ],
      "abstract": "JADES: Evolution of nitrogen abundances in star-forming galaxies from z ~ 1.5-7 Alex J. Cameron, Courtney Carreira, Charlotte Simmonds, Andrew J. Bunker, Aayush Saxena, Stefano Carniani, Stéphane Charlot, Jacopo Chevallard, Emma Curtis-Lake, Kevin Hainline, Ryan Hausen, Xihan Ji, Zhiyuan Ji, Benjamin D. Johnson, Pierluigi Rinaldi, Brant Robertson, Jan Scholtz, Maddie S. Silcock, Sandro Tacchella, James A. A. Trussler, Hannah Übler, Christina C. Williams, Christopher N. A. Willmer, Chris Willott, Joris Witstok 41 pages, 17 figures, 5 tables. Submitted Astrophysics of Galaxies (astro-ph.GA) We present nitrogen abundance measurements based on the low-ionisation [NII]6583 emission line for 588 galaxies between 1.5<z<7.0 from the JWST Advanced Deep Extragalactic Survey (JADES). We detect the temperature-sensitive [OIII]4363 auroral line in 40 galaxies in our sample, affording $T_e$-based abundances for this subset. We find that the average N/O abundance ratio in our low-metallicity sample is at least 0.1 dex higher than z ~ 0 samples. In particular, we find significant scatter toward high N/O, with five galaxies being identified with enhanced nitrogen abundances (log(N/O)>-1.1) at low-metallicity (12+log(O/H)<8.0) from $T_e$-based measurements. Meanwhile, applying strong-line abundance measurements to the remainder of our sample reveals a further 14 candidate galaxies passing these abundance cuts, implying that around 13 % of 12+log(O/H)<8.0 galaxies at these redshifts are nitrogen-enhanced at this level. We find that N/O abundance in low-metallicity systems correlates with SFR, surface density of SFR, and surface density of stellar mass at high redshift, while only in high-metallicity systems does a correlation with stellar mass emerge. Despite healthy representation of these `moderately nitrogen-enhanced' galaxies (-1.1<log(N/O)<-0.6), no galaxies in our low-metallicity sample are identified as having log(N/O)>-0.6, abundances that are typical of high-redshift NIII]- and NIV]-emitters. This demonstrates that the extreme nitrogen enhancements seen in some NIII]- and NIV]-emitters are only attained during the most extreme starbursts. This suggests that these elevated abundances are caused by enrichment from young massive stars in extreme environments and that the impact of this enrichment pathway is milder, though still important, for high-redshift systems on the star-forming main sequence.",
      "pdf_url": "https://arxiv.org/pdf/2601.15964.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15965",
      "title": "Clump-like Structures in High-Redshift Galaxies: Mass Scaling and Radial Trends from JADES",
      "authors": [
        "Yongda Zhu",
        "Marcia J. Rieke",
        "Zhiyuan Ji",
        "Andrew J. Bunker",
        "Courtney Carreira",
        "A. Lola Danhaive",
        "Qiao Duan",
        "Eiichi Egami",
        "Daniel J. Eisenstein",
        "Kevin Hainline",
        "Benjamin D. Johnson",
        "Zheng Ma",
        "Dávid Puskás",
        "George H. Rieke",
        "Pierluigi Rinaldi",
        "Brant Robertson",
        "Sandro Tacchella",
        "Hannah Übler",
        "Natalia C. Villanueva",
        "Christina C. Williams",
        "Christopher N. A. Willmer",
        "Zihao Wu",
        "Junyu Zhang"
      ],
      "abstract": "Clump-like Structures in High-Redshift Galaxies: Mass Scaling and Radial Trends from JADES Yongda Zhu, Marcia J. Rieke, Zhiyuan Ji, Andrew J. Bunker, Courtney Carreira, A. Lola Danhaive, Qiao Duan, Eiichi Egami, Daniel J. Eisenstein, Kevin Hainline, Benjamin D. Johnson, Zheng Ma, Dávid Puskás, George H. Rieke, Pierluigi Rinaldi, Brant Robertson, Sandro Tacchella, Hannah Übler, Natalia C. Villanueva, Christina C. Williams, Christopher N. A. Willmer, Zihao Wu, Junyu Zhang Submitted to ApJ. Figures 5, 7, and 9 show our key results Astrophysics of Galaxies (astro-ph.GA) Massive star-forming clumps are a prominent feature of high-redshift galaxies and are thought to trace gravitational fragmentation, feedback, and bulge growth in gas-rich disks. We present a statistical analysis of clump-like structures in $\\sim$3600 galaxies spanning $2 \\lesssim z \\lesssim 8$ from deep JWST/NIRCam imaging in the JADES GOODS--South field. Clumps are identified as residual features after subtracting smooth Sérsic profiles, enabling a uniform, rest-frame optical census of sub-galactic structure. We characterize their physical properties, size--mass relations, and spatial distributions to constrain models of sub-galactic structure formation and evolution. We find that clumps in our sample are typically low-mass ($10^{\\sim7-8}M_\\odot$), actively star-forming, and show diverse gas-phase metallicity, dust attenuation, and stellar population properties. Their sizes and average pairwise separations increase with cosmic time (toward lower redshift), consistent with inside-out disk growth. The clump mass function follows a power law with slope $\\alpha = -1.50_{-0.17}^{+0.19}$, consistent with fragmentation in turbulent disks. We find a deficit of relatively young clumps near galaxy centers and a radial transition in the size--mass relation: outer clumps exhibit steeper, near-virial slopes ($R_{\\rm e}\\propto M_*^{\\sim 0.3}$), while inner clumps follow flatter trends ($R_{\\rm e}\\propto M_*^{\\sim 0.2}$), consistent with structural evolution via migration or disruption. These results provide new constraints on the formation, survival, and dynamical evolution of clumps, highlighting their role in shaping galaxy morphology during the peak of cosmic star formation.",
      "pdf_url": "https://arxiv.org/pdf/2601.15965.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15974",
      "title": "HE0144-4657: A Carbon-Enhanced Ultra Metal-Poor Star ([Fe/H] ~ -4.1) from the Helmi Stream Disrupted Dwarf Galaxy",
      "authors": [
        "Vinicius M. Placco",
        "Guilherme Limberg",
        "Catherine R. Kennedy",
        "Norbert Christlieb"
      ],
      "abstract": "HE0144-4657: A Carbon-Enhanced Ultra Metal-Poor Star ([Fe/H] ~ -4.1) from the Helmi Stream Disrupted Dwarf Galaxy Vinicius M. Placco, Guilherme Limberg, Catherine R. Kennedy, Norbert Christlieb 15 pages, 3 figures, submitted for publication on ApJL Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present the discovery of HE0144-4657, an ultra metal-poor, CNO-enhanced star dynamically associated with the Helmi Stream disrupted dwarf-galaxy remnant. This star was first identified as a carbon-enhanced, metal-poor star candidate from the Hamburg/ESO objective-prism survey, then followed up with medium- and high-resolution spectroscopy. At [Fe/H]=-4.11, HE0144-4657 is the lowest metallicity star found in a stellar stream to date. Its chemistry is consistent with field halo stars in the same metallicity regime, and the light-element (atomic number Z<=30) chemical abundance pattern suggests that HE0144-4657 is a bona-fide second-generation star with a possible Population III progenitor in the 50Msun mass range with low explosion energy. One possible scenario for the origin of HE0144-4657 is that it was formed in an ultra-faint dwarf galaxy accreted by the Helmi Stream progenitor system before merging with the Milky Way. This discovery provides further evidence for the extragalactic origin of carbon-enhanced ultra metal-poor stars in the Milky Way and for the specific environments conducive to their formation.",
      "pdf_url": "https://arxiv.org/pdf/2601.15974.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15979",
      "title": "Extreme line profile variations in the repeating changing-look active galactic nucleus IRAS23226-3843",
      "authors": [
        "Wolfram Kollatschny",
        "Dirk Grupe",
        "Hartmut Winkler",
        "Malte A. Probst",
        "Martin W. Ochmann",
        "Amon Poenitzsch",
        "Norbert Schartel",
        "Salem Wolsing",
        "Stefanie Komossa",
        "Stephen B. Potter"
      ],
      "abstract": "Extreme line profile variations in the repeating changing-look active galactic nucleus IRAS23226-3843 Wolfram Kollatschny, Dirk Grupe, Hartmut Winkler, Malte A. Probst, Martin W. Ochmann, Amon Poenitzsch, Norbert Schartel, Salem Wolsing, Stefanie Komossa, Stephen B. Potter 13 pages, 8 figures, Astronomy & Astrophysics in press Astrophysics of Galaxies (astro-ph.GA) IRAS23226-3843 has been identified as a highly variable Seyfert galaxy and even as a changing-look active galactic nucleus based on optical spectra. Here we present follow-up observations - taken over the past five years - for examining the ongoing photometric and spectral variations in this remarkable galaxy. We carried out SWIFT observations of IRAS23226-3843 together with new optical spectra taken in 2023 and 2024. In parallel we investigate ASAS-SN photometric data from 2014 till 2025. IRAS23226-3843 stayed on a high continuum flux level in the X-ray as well as in the optical since a historic outburst in 2019. However, it shows strong short-term variations on timescales of a few months. Densely sampled ASAS-SN V-band continuum data from 2014 till 2025 confirm that behavior. IRAS23226-3843 switched from a clear Seyfert 1 type in December 2019 to a Seyfert 1.9/2 type in July 2020 based on its optical spectra. Afterward, it again became a Seyfert 1 type with symmetric broad single-peaked Balmer line profiles in January 2023. These spectra prove the repeating changing-look character of the galaxy.IRAS23226-3843 exhibits extreme high Balmer decrements Ha\\Hb based on their broad line components. The Balmer decrement values are on the order of 10. IRAS23226-3843 successively showed all types of broad line Balmer profiles during the past 25 years over periods of many years: asymmetric single-peaked, double-peaked, as well as single-peaked and symmetric profiles in addition to its Seyfert 1.9/2 transition. These variations are not clearly correlated with continuum and line intensity variations.",
      "pdf_url": "https://arxiv.org/pdf/2601.15979.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15991",
      "title": "A multi-wavelength approach of AGN feedback in LINERs: The case of NGC 4438",
      "authors": [
        "M. Puig-Subirà",
        "J. Moldón",
        "I. Márquez",
        "J. Masegosa",
        "O. González-Martín",
        "L. Hermosa Muñoz",
        "S. Cazzoli",
        "D. Williams-Baldwin"
      ],
      "abstract": "A multi-wavelength approach of AGN feedback in LINERs: The case of NGC 4438 M. Puig-Subirà, J. Moldón, I. Márquez, J. Masegosa, O. González-Martín, L. Hermosa Muñoz, S. Cazzoli, D. Williams-Baldwin Astrophysics of Galaxies (astro-ph.GA) The presence of multi-phase outflows in low ionisation nuclear emission-line regions (LINERs) has been confirmed to be frequent, but the mechanisms that launch them are still under study. We aim to explore the connections between the ionised gas outflow, radio continuum structures and X-ray emission detected in the LINER NGC4438. We analyse L, C and X-band images (from 1.4 to 12 GHz) of the LINER NGC4438, combining high-resolution data from enhanced Multi Element Radio Linked Interferometer Network (e-MERLIN) and Karl G Jansky Very Large Array (VLA). We produce radio flux, spectral index maps, and an energetic model that allows us to characterise the source. We incorporate optical integral field spectroscopy (IFS) data (GTC/MEGARA) and Chandra X-ray data, with comparable resolution, to better trace the outflow, the AGN and their potential connection. We present new L, C, and X-band high-resolution, high-sensitivity radio images and spectral-index maps that probe $\\sim$ 25 pc scales in NGC 4438. These data reveal a close morphological correspondence between the radio structures and the ionised gas bubble. Using a spatially resolved energetic model based on radio flux and spectral index, we disentangle the compact AGN emission from the extended bubble for the first time, establishing their distinct physical origins. We measure a kinetic power of $\\sim 5\\times 10^{44}$ erg s$^{-1}$ for the radio bubble, exceeding the power of the ionised outflow by more than three orders of magnitude. Our multi-wavelength analysis indicates that NGC 4438 is undergoing jet-mode feedback, where a low-luminosity, weakly collimated jet impacts the dense northern interstellar medium. This interaction drives shock-ionised gas, produces a moderate velocity outflow that removes material from the region, and generates thermal X-ray emission coincident with the radio and H$\\alpha$ cavity.",
      "pdf_url": "https://arxiv.org/pdf/2601.15991.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16019",
      "title": "Spatially resolved stellar-to-total dynamical mass relation: Radial variations, gradients and profiles of galaxy stellar populations",
      "authors": [
        "L. Scholz-Diaz",
        "A. R. Gallazzi",
        "S. Zibetti",
        "D. Mattolini"
      ],
      "abstract": "Spatially resolved stellar-to-total dynamical mass relation: Radial variations, gradients and profiles of galaxy stellar populations L. Scholz-Diaz, A. R. Gallazzi, S. Zibetti, D. Mattolini Accepted for publication in A&A. 16 pages, 7 figures (abstract abridged from original) Astrophysics of Galaxies (astro-ph.GA) Although galaxy evolution is governed by the interplay between baryonic physics and dark matter halo assembly, how halo properties shape observed galaxies remains unclear. With current challenges in measuring halo properties, the stellar-to-total dynamical mass relation is introduced as an alternative metric sensitive to the dark matter content within galaxies. We explore how spatially resolved stellar population properties vary across this relation using optical IFS data and photometry from 265 CALIFA galaxies. Spatially resolved ages and metallicities, [M/H], are derived using a Bayesian framework fed with a library of model spectra based on stochastic star formation and metallicity histories and dust attenuation. We study these properties in terms of both stellar and total dynamical mass, with the latter being enclosed mass within three effective radii from Jeans dynamical modeling. We find that ages and [M/H] measured at different annuli depend on both stellar and total mass, yet showing distinct radial trends. While the dependence of age on total mass is more prominent in the outskirts, that of [M/H] is significant in the inner parts. This behavior is reflected in the stellar population profiles and gradients, more strongly for age and connected to morphology. Intermediate-mass early-types have higher stellar-to-total mass ratios and flatter age profiles with older ages, and steep negative [M/H] profiles, whereas later-types have lower stellar-to-total mass ratios, negative age profiles with younger ages and shallower negative [M/H] profiles. Moreover, at fixed stellar mass galaxies have more negative age gradients and shallower [M/H] ones as total mass increases. Our results show that total dynamical mass is linked to systematic variations in stellar populations and radial gradients at fixed stellar mass, suggesting a relevant role of dark matter halos in shaping galaxy properties",
      "pdf_url": "https://arxiv.org/pdf/2601.16019.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16057",
      "title": "Constraining Nuclear Molecular Gas Content with High-resolution CO Imaging of GOALS Galaxies",
      "authors": [
        "James Agostino",
        "Anne M. Medling",
        "Loreto Barcos-Muñoz",
        "Vivian U",
        "Mynor Rodríguez Vásquez",
        "George C. Privon",
        "Claudia Cicone",
        "Lee Armus",
        "Jorge Moreno",
        "Claudio Ricci",
        "Yiqing Song",
        "Christopher C. Hayward",
        "Katherine Alatalo",
        "David B. Sanders"
      ],
      "abstract": "Constraining Nuclear Molecular Gas Content with High-resolution CO Imaging of GOALS Galaxies James Agostino, Anne M. Medling, Loreto Barcos-Muñoz, Vivian U, Mynor Rodríguez Vásquez, George C. Privon, Claudia Cicone, Lee Armus, Jorge Moreno, Claudio Ricci, Yiqing Song, Christopher C. Hayward, Katherine Alatalo, David B. Sanders Astrophysics of Galaxies (astro-ph.GA) We present measurements of the cool molecular gas mass around the nuclei of two gas-rich mergers, III Zw 035 and IRAS F01364-1042, whose enclosed masses (M$_\\mathrm{enc}$) within the central 40-80 pc would be overmassive if attributed entirely to the supermassive black hole mass (SMBH) and compared to SMBH-galaxy scaling relations. Our gas mass measurements are derived from Atacama Large Millimeter/submillimeter Array (ALMA) Band 6 long-baseline observations of CO(J=2-1) and 230 GHz continuum emission at 14-20 pc resolution, which probes below the resolving limit of the previous black hole mass measurements. Subtracting molecular gas mass from these enclosed masses is not enough to reconcile with BH-galaxy relationships, but independently measuring M$_\\mathrm{enc}$ using the cold CO(2-1) gas does shift the black holes down to their expected values. Still, these ALMA data reveal respective molecular gas masses of $\\sim$3$\\times$10$^7$ to $\\sim$6$\\times$10$^8$ M$_\\odot$ within 70 pc of these black holes, which could challenge some black hole accretion models that assume nuclear gas like this has no angular momentum.",
      "pdf_url": "https://arxiv.org/pdf/2601.16057.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16115",
      "title": "Cis--Trans Rotational Isomerism of Seleno-, Thio-, and Formic Acids and Their Dimers: Chemical Kinetics under Interstellar Conditions",
      "authors": [
        "Judith Wurmel",
        "John M. Simmie"
      ],
      "abstract": "Cis--Trans Rotational Isomerism of Seleno-, Thio-, and Formic Acids and Their Dimers: Chemical Kinetics under Interstellar Conditions Judith Wurmel, John M. Simmie 10pages, 8 figures, for submission to Physical Chemistry Chemical Physics Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Tunnelling reactions of molecules embedded on cryogenic noble-gas matrices are being used in fundamental studies of how reactivity varies with the nature of the supposedly inert matrix as well as pointers to the chemistry occurring in the interstellar medium on ice-grains. To these ends we present chemical kinetic rate constants for the \\textit{cis} to \\textit{trans} isomerisation of seleno-, thio- and monomeric formic acids and that of their three dimeric species, based on multidimensional calculations in the gas-phase, from 10~K to 300~K as a guide to the matrix reactions.",
      "pdf_url": "https://arxiv.org/pdf/2601.16115.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16179",
      "title": "A general spectral solver for the axisymmetric Jeans equations: fast galaxy modelling with arbitrary anisotropy",
      "authors": [
        "Michele Cappellari"
      ],
      "abstract": "A general spectral solver for the axisymmetric Jeans equations: fast galaxy modelling with arbitrary anisotropy Michele Cappellari (University of Oxford) 15 pages, 7 figures. LaTeX. Submitted to MNRAS. Implementation will be included in the JamPy package at this https URL Astrophysics of Galaxies (astro-ph.GA) Dynamical modelling is a fundamental tool for measuring galaxy masses and density profiles in the era of large integral-field spectroscopic surveys and Bayesian inference. Solutions based on the Jeans equations are popular due to their robustness and computational efficiency. However, traditional semi-analytic Jeans solvers often require restrictive assumptions about the velocity anisotropy to remain computationally tractable. This paper presents a new spectral solver for the axisymmetric Jeans equations designed to overcome these limitations. I first illustrate, using orbit integrations in realistic potentials, that spherical alignment of the velocity ellipsoid is a physically well-motivated approximation for galaxy modelling. The new method employs a spectral technique to solve the Jeans partial differential equations directly. Two design choices are critical for accuracy and speed: (i) solving for the slowly-varying velocity dispersion rather than the rapidly varying pressure, and (ii) imposing a Robin boundary condition to enforce the asymptotic decay on a finite domain. This formulation supports arbitrary anisotropy distributions beta(r, theta) while simultaneously increasing computational speed by orders of magnitude compared to standard high-accuracy quadratures. Validated against exact analytic benchmarks, the solver recovers intrinsic moments with sub-percent accuracy. The implementation will be included in the public JamPy package and is structured to be optimally suited for massive parallelization on specialized hardware such as GPUs, enabling the rigorous exploration of complex parameter spaces.",
      "pdf_url": "https://arxiv.org/pdf/2601.16179.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16191",
      "title": "On the Missing Red Giants near the Galactic Center",
      "authors": [
        "Taeho Kim",
        "Jeremy Goodman"
      ],
      "abstract": "On the Missing Red Giants near the Galactic Center Taeho Kim, Jeremy Goodman Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) There is a long-acknowledged deficiency of bright red giants relative to fainter old stars within a few arc seconds of Sgr A*. We explore whether this could be due to tidal stripping by the central black hole. This requires putting the stars onto highly eccentric orbits, for which we evaluate diffusion by both scalar resonant and non-resonant relaxation of the orbital angular momentum. We conclude that tidal stripping does not discriminate sufficiently between main-sequence and red giant stars. While the tidal loss cone increases with stellar radius, the rate of diffusion into the loss cone increases only logarithmically, whereas the lifetime on the red giant branch decreases more rapidly than $R_*^{-1}$. In agreement with previous studies, we find that stellar collisions are a more likely explanation for the deficiency of bright red giants relative to fainter ones.",
      "pdf_url": "https://arxiv.org/pdf/2601.16191.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15371",
      "title": "Digging into the Interior of Hot Cores with ALMA (DIHCA). VII. Disk candidates around high-mass stars and evidence of anisotropic infall",
      "authors": [
        "Fernando A. Olguin",
        "Patricio Sanhueza",
        "Yoko Oya",
        "Adam Ginsburg",
        "Maria T. Beltrán",
        "Kaho Morii",
        "Roberto Galván-Madrid",
        "Huei-Ru Vivien Chen",
        "Qiuyi Luo",
        "Kei E. I. Tanaka",
        "Suinan Zhang",
        "Yu Cheng",
        "Fumitaka Nakamura",
        "Shanghuo Li",
        "Kotomi Taniguchi",
        "Guido Garay",
        "Qizhou Zhang",
        "Masao Saito",
        "Takeshi Sakai",
        "Xing Lu",
        "Jixiang Weng",
        "Andrés E. Guzmán"
      ],
      "abstract": "Digging into the Interior of Hot Cores with ALMA (DIHCA). VII. Disk candidates around high-mass stars and evidence of anisotropic infall Fernando A. Olguin, Patricio Sanhueza, Yoko Oya, Adam Ginsburg, Maria T. Beltrán, Kaho Morii, Roberto Galván-Madrid, Huei-Ru Vivien Chen, Qiuyi Luo, Kei E. I. Tanaka, Suinan Zhang, Yu Cheng, Fumitaka Nakamura, Shanghuo Li, Kotomi Taniguchi, Guido Garay, Qizhou Zhang, Masao Saito, Takeshi Sakai, Xing Lu, Jixiang Weng, Andrés E. Guzmán 29 pages, 8 figures, 7 tables. Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We study the kinematics of condensations in 30 fields forming high-mass stars with ALMA at a high-resolution of ~0.08'' on average (~230 au). The presence of disks is important for feeding high-mass stars without feedback halting growth as their masses increase. In the search for velocity gradients resembling rotation that can reveal the presence of disks, we analyze the emission of gas tracers in 49 objects using CH$_3$OH, CH$_3$CN, and tentative detections of HNCO and cis-HCOOH. Most of the velocity distributions show velocity gradients indicative of rotation. We reveal a total of 32 disk candidates, the largest sample to date that has been uniformly analyzed at a few hundred au scales in the high-mass regime. Their position-velocity maps are generally asymmetric with one side brighter than the opposite. We successfully fit a power law to the position-velocity maps of the disk candidates and find indices between -0.5 (Keplerian rotation) and -1 (rotation under specific angular momentum conservation) with a median of -0.7. Under Keplerian rotation assumption, we estimate central masses, uncorrected for inclination, ranging between 7 to 45 M$_\\odot$. Excluding outliers, the disk candidates are relatively more compact (<200 au) and less massive (<5 M$_\\odot$) than previous results at coarser angular resolution. We calculate an average Toomre-$Q$ parameter and find that most are gravitationally unstable (median of 0.5). We conclude that these observations offer the first opportunity to separate the disk and envelope components of hot cores on a statistically significant sample, and confirm that anisotropic collapse plays an role in feeding high-mass (proto)stars.",
      "pdf_url": "https://arxiv.org/pdf/2601.15371.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15387",
      "title": "Solar twins in Gaia DR3 GSP-Spec I. Building a large catalog of Solar twins with ages",
      "authors": [
        "Daisuke Taniguchi",
        "Patrick de Laverny",
        "Alejandra Recio-Blanco",
        "Takuji Tsujimoto",
        "Pedro A. Palicio"
      ],
      "abstract": "Solar twins in Gaia DR3 GSP-Spec I. Building a large catalog of Solar twins with ages Daisuke Taniguchi, Patrick de Laverny, Alejandra Recio-Blanco, Takuji Tsujimoto, Pedro A. Palicio 36 pages (main text 18 pages), 24 figures. Submitted to A&A. Abstract abbreviated. Comments welcome! Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) [Abbreviated] Context. Solar twins, stars whose stellar parameters (Teff, log g, and [M/H]) are very close to the Solar ones, offer a unique opportunity to investigate Galactic archaeology with very high accuracy and precision. However, most previous catalogs of Solar twins contain only a small number of objects (typically a few tens), and their selection functions are poorly characterized. Aims. We aim at building a large catalog of Solar twins from Gaia DR3 GSP-Spec, providing model-driven, rather than data-driven, stellar parameters including ages, together with a well-characterized selection function. Methods. Using stellar parameters from the Gaia DR3 GSP-Spec catalog, we selected Solar-twin candidates whose parameters lie within +- 200 K in Teff, +- 0.2 in log g, and +- 0.1 dex in [M/H] of the Solar values. Candidates unlikely to be genuine Solar twins were removed using Gaia flags and photometric constraints. We determined accurate ages for individual twins with a Bayesian isochrone-projection method, considering three combinations of parameters: Teff, [M/H], and either log g, M_G, or M_Ks. We also constructed a mock catalog to characterize the selection function. Results. Our final GSP-Spec Solar-twin catalog contains 6,594 stars. The mock catalog consisting of 75,588 artificial twins well reproduces the main characteristics of the observed catalog, especially for ages determined with M_G or M_Ks. To demonstrate the usefulness of our catalog, we compared chemical abundances [X/Fe] with age. We statistically confirmed the age--[X/Fe] relations for several species (e.g., Al, Si, Ca, and Y), demonstrating that trends previously identified in small but very high-precision samples persist in a much larger, independent sample. Conclusions. Our study bridges small high-precision Solar-twin samples and large data-driven ones, enabling demographic studies of Solar twins.",
      "pdf_url": "https://arxiv.org/pdf/2601.15387.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15413",
      "title": "The age sequence of young clusters in Perseus: Estimating ages from mass distributions",
      "authors": [
        "Tatiana Pavlidou",
        "Aleks Scholz",
        "Koraljka Muzic"
      ],
      "abstract": "The age sequence of young clusters in Perseus: Estimating ages from mass distributions Tatiana Pavlidou (Limassol), Aleks Scholz (St Andrews), Koraljka Muzic (Lisbon) 12 pages, accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Establishing ages for young clusters is key for properly tracking the star formation history of a region. In this paper we investigate a new approach to estimating ages for young populations, based on the well-founded assumption that the initial mass function is the same throughout a star forming cloud. We trial this method for six young clusters in the Perseus star forming region. For all six clusters, we construct new member samples in a homogeneous way using Gaia DR3. We estimate masses by comparing 2MASS photometry to theoretical isochrones, including Monte Carlo simulations to propagate the errors. We compare the mass distributions of the clusters for a range of plausible ages, looking for a combination of ages that results in indistinguishable mass distributions across the region. We find the best fit for ages of 1 Myr for NGC1333+Autochthe, 2 Myr for IC348, 2-3 Myr for Heleus, 3-4 Myr for Mestor, 4-5 Myr for Electryon+Cynurus, and 5-8 Myr for Alcaeus. All other combinations of ages are ruled out by this criterion. The established age sequence is consistent with the relative ages inferred from disc fractions, and broadly aligns with the age sequence determined in previous studies using isochrone fitting. We suggest that this approach can be a useful complement and cross-check to established methods to estimate ages in young populations.",
      "pdf_url": "https://arxiv.org/pdf/2601.15413.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15443",
      "title": "Perihelion Asymmetry in the Water Production Rate of the Interstellar Object 3I/ATLAS",
      "authors": [
        "Hanjie Tan , Xiaoran Yan , Jian-Yang Li Planetary Environmental and Astrobiological Research Laboratory , School of Atmospheric Sciences, Sun Yat-sen University, Zhuhai, China, National Research Council, Institute of Applied Physics \"Nello Carrara\" , FI, Italy, Xinjiang Astronomical Observatory, Chinese Academy of Sciences, Urumqi, China)"
      ],
      "abstract": "Perihelion Asymmetry in the Water Production Rate of the Interstellar Object 3I/ATLAS Hanjie Tan (1), Xiaoran Yan (2), Jian-Yang Li (1 and 3) ((1) Planetary Environmental and Astrobiological Research Laboratory (PEARL), School of Atmospheric Sciences, Sun Yat-sen University, Zhuhai, China, (2) National Research Council, Institute of Applied Physics \"Nello Carrara\" (IFAC-CNR), FI, Italy, (3) Xinjiang Astronomical Observatory, Chinese Academy of Sciences, Urumqi, China) 13 pages, 7 figures. Accepted for publication in The Astrophysical Journal Letters (ApJL) Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) 3I/ATLAS is an interstellar object whose activity provides critical insights into its composition and origin. However, due to its orbital geometry, the object is too close to the Sun near perihelion to be observed from the ground, and space-based measurements are therefore required. Here we characterize the water production rate of 3I/ATLAS using SOHO/SWAN Lyman-$\\alpha$ observations from 2025 November to December (heliocentric distances 1.4 to 2.2 au) with 3D Monte Carlo modeling. We report a peak post-perihelion water production rate of $Q_{\\mathrm{H_2O}} \\approx 4 \\times 10^{28}$ mol s$^{-1}$, corresponding to a minimum active fraction of $\\sim$30\\% (assuming a maximum nucleus radius of 2.8 km). Comparison of our post-perihelion measurements with published pre-perihelion results reveals a heliocentric asymmetry, with an $r_h^{-5.9 \\pm 0.8}$ scaling for the inbound rise, followed by a shallower $r_h^{-3.3 \\pm 0.3}$ scaling during the outbound decline, where $r_h$ is heliocentric distance. The post-perihelion behavior indicates that the water production of 3I/ATLAS was driven primarily by the varying solar insolation acting on a stable active area. Combined with other evidence, including comparison with the hyperactive comet 103P/Hartley 2, our findings suggest that its water production is likely dominated by a distributed source of icy grains. Furthermore, it displayed remarkable stability in the activity with no signs of outbursts or rapid depletion of water production.",
      "pdf_url": "https://arxiv.org/pdf/2601.15443.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15958",
      "title": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: Wisp Subtraction with the Non-negative Matrix Factorization Algorithm",
      "authors": [
        "Zihao Wu",
        "Benjamin D. Johnson",
        "Daniel J. Eisenstein",
        "Phillip Cargile",
        "Kevin Hainline",
        "Ryan Hausen",
        "Pierluigi Rinaldi",
        "Brant E. Robertson",
        "Sandro Tacchella",
        "Christina C. Williams",
        "Christopher N. A. Willmer"
      ],
      "abstract": "JWST Advanced Deep Extragalactic Survey (JADES) Data Release 5: Wisp Subtraction with the Non-negative Matrix Factorization Algorithm Zihao Wu, Benjamin D. Johnson, Daniel J. Eisenstein, Phillip Cargile, Kevin Hainline, Ryan Hausen, Pierluigi Rinaldi, Brant E. Robertson, Sandro Tacchella, Christina C. Williams, Christopher N. A. Willmer Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) Wisps are among the most prominent scattered light artifacts in JWST/NIRCam imaging. They often appear in certain regions of the detectors and contaminate observations at surface-brightness levels relevant for faint-source photometry. We introduce a new subtraction method that uses the non-negative matrix factorization (NMF) algorithm to model and remove wisps. Using deep NIRCam observations from the JWST Advanced Deep Extragalactic Survey (JADES) and other programs, we construct multi-component, filter- and detector-specific wisp templates that capture the wisp structures and their exposure-to-exposure morphological variations. Wisps in individual exposures are represented as non-negative linear combinations of these templates, consistent with their additive nature and reducing degeneracies relative to single-template scaling. Compared to existing approaches, our method delivers lower residual root mean square in wisp-affected regions and reduces photometric bias and scatter to levels consistent with clean detector areas. The NMF wisp templates are readily applicable to other datasets and are publicly released to support future NIRCam extragalactic surveys.",
      "pdf_url": "https://arxiv.org/pdf/2601.15958.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.17381",
      "title": "The AURORA Survey: Tracing Galactic Outflows at $z\\gtrsim2.5$ with JWST/NIRSpec NUV Absorption Lines",
      "authors": [
        "Emily Kehoe",
        "Alice E. Shapley",
        "Ryan L. Sanders",
        "Naveen A. Reddy",
        "Natalie Lam",
        "Leonardo Clarke",
        "Fergus Cullen",
        "Richard S. Ellis",
        "N. M. Forster Schreiber",
        "Tucker Jones",
        "Ali Ahmad Khostovan",
        "Derek J. McLeod",
        "Ross J. McLure",
        "Desika Narayanan",
        "Pascal Oesch",
        "Anthony J. Pahl"
      ],
      "abstract": "The AURORA Survey: Tracing Galactic Outflows at $z\\gtrsim2.5$ with JWST/NIRSpec NUV Absorption Lines Emily Kehoe, Alice E. Shapley, Ryan L. Sanders, Naveen A. Reddy, Natalie Lam, Leonardo Clarke, Fergus Cullen, Richard S. Ellis, N. M. Forster Schreiber, Tucker Jones, Ali Ahmad Khostovan, Derek J. McLeod, Ross J. McLure, Desika Narayanan, Pascal Oesch, Anthony J. Pahl 22 pages, 10 figures, 3 tables, accepted to ApJ Astrophysics of Galaxies (astro-ph.GA) We probe galactic-scale outflows in star-forming galaxies at $z\\gtrsim2.5$ drawn from the \\textit{JWST}/NIRSpec AURORA program. For the first time, we directly compare outflow properties from the early universe to the present day using near-UV absorption lines. We measure ISM kinematics from Fe\\,{\\sc ii} and Mg\\,{\\sc ii} absorption features in 41 and 43 galaxies, respectively, and examine how these kinematics correlate with galaxy properties. We find that galaxies with outflows tend to have higher stellar masses, and that maximum outflow velocities increase with stellar mass, SFR, UV slope $\\beta$, $E(B-V)$, and $A_V$. We also find that Mg\\,{\\sc ii} emission is more common in galaxies with lower masses, higher sSFRs, and less dust. These trends are consistent with those in star-forming galaxies at $z<2$ when using the same outflow tracers, suggesting that the feedback from star formation has played a persistent role in shaping galaxy evolution over cosmic time. We also directly compare near-UV and far-UV features in the same NIRSpec spectrum for a $z=5.19$ galaxy, finding consistent ISM kinematics and demonstrating that different tracers yield comparable measurements. We also detect Na\\,D absorption in 10 galaxies, which have higher stellar mass, SFR, and dust attenuation compared to galaxies without Na\\,D absorption, which is consistent with $z\\sim0$ studies. The broad continuum coverage and sensitivity of NIRSpec will enable future studies with larger samples, allowing for robust tests of these trends across a wider dynamic range of galaxy properties.",
      "pdf_url": "https://arxiv.org/pdf/2506.17381.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02054",
      "title": "Bars in low-density environments rotate faster than bars in dense regions",
      "authors": [
        "Natalia Puczek , Tobias Géron , Rebecca J. Smethurst , Chris J. Lintott Oxford Astrophysics, Department of Physics, University of Oxford, Denys Wilkinson Building, Oxford, UK, Dunlap Institute for Astronomy and Astrophysics, University of Toronto, Toronto, Canada)"
      ],
      "abstract": "Bars in low-density environments rotate faster than bars in dense regions Natalia Puczek (1), Tobias Géron (1 and 2), Rebecca J. Smethurst (1), Chris J. Lintott (1) ((1) Oxford Astrophysics, Department of Physics, University of Oxford, Denys Wilkinson Building, Oxford, UK, (2) Dunlap Institute for Astronomy and Astrophysics, University of Toronto, Toronto, Canada) 8 pages, 2 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Does the environment of a galaxy directly influence the kinematics of its bar? We present observational evidence that bars in high-density environments exhibit significantly slower rotation rates than bars in low-density environments. Galactic bars are central, extended structures composed of stars, dust and gas, present in approximately 30 to 70 per cent of luminous spiral galaxies in the local Universe. Recent simulation studies have suggested that the environment can influence the bar rotation rate, $R$, which is used to classify bars as either fast ($1\\leq R \\leq1.4$) or slow ($R \\gt 1.4$). We use estimates of $R$ obtained with the Tremaine-Weinberg method applied to Integral Field Unit spectroscopy from MaNGA and CALIFA. After cross-matching these with the projected neighbour density, $\\log\\Sigma$, we retain 286 galaxies. The analysis reveals that bars in high-density environments are significantly slower (median $R = 1.65^{+0.13}_{-0.11}$) compared to bars in low-density environments (median $R = 1.39^{+0.09}_{-0.08}$); Anderson-Darling $\\textit{p}$-value of $p_{\\mathrm{AD}}= 0.002$ ($3.1\\,\\sigma$). This study marks the first empirical test of the hypothesis that fast bars are formed by global instabilities in isolated galaxies, while slow bars are triggered by tidal interactions in dense environments, in agreement with predictions from numerous $\\textit{N}$-body simulations. Future studies would benefit from a larger sample of galaxies with reliable Integral Field Unit data, required to measure bar rotation rates. Specifically, more data are necessary to study the environmental influence on bar formation within dense settings (i.e. groups, clusters and filaments).",
      "pdf_url": "https://arxiv.org/pdf/2511.02054.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.08904",
      "title": "Digging into the Interior of Hot Cores with ALMA. VI. The Formation of Low-mass Multiple Systems in High-mass Cluster-forming Regions",
      "authors": [
        "Qiuyi Luo",
        "Patricio Sanhueza",
        "Stella S. R. Offner",
        "Fernando Olguin",
        "Adam Ginsburg",
        "Fumitaka Nakamura",
        "Kaho Morii",
        "Yu Cheng",
        "Kei Tanaka",
        "Junhao Liu",
        "Tie Liu",
        "Xing Lu",
        "Qizhou Zhang",
        "Kotomi Taniguchi",
        "Piyali Saha",
        "Shanghuo Li",
        "Xiaofeng Mai"
      ],
      "abstract": "Digging into the Interior of Hot Cores with ALMA. VI. The Formation of Low-mass Multiple Systems in High-mass Cluster-forming Regions Qiuyi Luo, Patricio Sanhueza, Stella S. R. Offner, Fernando Olguin, Adam Ginsburg, Fumitaka Nakamura, Kaho Morii, Yu Cheng, Kei Tanaka, Junhao Liu, Tie Liu, Xing Lu, Qizhou Zhang, Kotomi Taniguchi, Piyali Saha, Shanghuo Li, Xiaofeng Mai This paper has been accepted by ApJ Astrophysics of Galaxies (astro-ph.GA) Most stars form in multiple systems, with profound implications in numerous astronomical phenomena intrinsically linked to multiplicity. However, our knowledge about the process on how multiple stellar systems form is incomplete and biased toward nearby molecular clouds forming only low-mass stars, which are unrepresentative of the stellar population in the Galaxy. Most stars form within dense cores in clusters alongside high-mass stars (>8 M$_{\\odot}$), as likely the Sun did. Here we report deep ALMA 1.33 mm dust continuum observations at ~160 au spatial resolution, revealing 72 low-mass multiple systems embedded in 23 high-mass cluster-forming regions, as part of the Digging into the Interior of Hot Cores with ALMA (DIHCA) survey. We find that the companion separation distribution presents a distinct peak at ~1200 au, in contrast to the one at ~4000 au observed in nearby low-mass regions. The shorter fragmentation scale can be explained by considering the higher pressure exerted by the surrounding medium, which is higher than the one in low-mass regions, due to the larger turbulence and densities involved. Because the peak of the companion separation distribution occurs at much larger scales than the expected disk sizes, we argue that the observed fragmentation is produced by turbulent core fragmentation. Contrary as predicted, the multiplicity fraction remains constant as the stellar density increases. We propose that in the extremely dense environments where high-mass stars form, dynamical interactions play an important role in disrupting weakly bound systems.",
      "pdf_url": "https://arxiv.org/pdf/2601.08904.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.11710",
      "title": "Resonant Scattering of the He I 1.0833$μ$m Triplet in H II Regions: Emission Spectra",
      "authors": [
        "B.T. Draine"
      ],
      "abstract": "Resonant Scattering of the He I 1.0833$μ$m Triplet in H II Regions: Emission Spectra B.T. Draine ApJ, accepted. revision v2 has a few typos corrected Astrophysics of Galaxies (astro-ph.GA) Resonant scattering of He I 1.0833$\\mu$m triplet photons by metastable He 2 $^3$S$_1$ is studied for optical depths characteristic of H II regions. Regions with large He 2 $^3$S$_1$ column densities are predicted to have unusually broad, multi-peaked 1.0833$\\mu$m emission profiles, with the centroid blue-shifted by up to $\\sim$14 km/s relative to other lines. The feature FWHM can exceed 100 km/s for some regions. Resonant trapping enhances dust absorption and reduces the He I 1.0833$\\mu$m emission. Care must be taken when using the He I 1.0833$\\mu$m/H I 1.0941$\\mu$m (Pa$\\gamma$) ratio to estimate the He$^+$/H$^+$ ratio. Predicted spectra are computed for examples, including M-17B and NGC3603 in the Galaxy, and a star-forming region in M51. Observations of the 1.0833$\\mu$m triplet with spectrometers such as NIRSPEC, CARMENES, or X-Shooter can confirm the predicted effects of resonant scattering in H II regions, and constrain the nebular conditions.",
      "pdf_url": "https://arxiv.org/pdf/2601.11710.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.12413",
      "title": "Updated Metallicity Diagnostics for Precision Oxygen Abundance Measurements in High-redshift Galaxies with JWST",
      "authors": [
        "Shihong Liu",
        "Yu Rong",
        "Tie Li",
        "Yao Yao",
        "Cheng Jia",
        "Enci Wang",
        "Hongxin Zhang",
        "Zhicheng He",
        "Huiyuan Wang",
        "Xu Kong"
      ],
      "abstract": "Updated Metallicity Diagnostics for Precision Oxygen Abundance Measurements in High-redshift Galaxies with JWST Shihong Liu, Yu Rong, Tie Li, Yao Yao, Cheng Jia, Enci Wang, Hongxin Zhang, Zhicheng He, Huiyuan Wang, Xu Kong Astrophysics of Galaxies (astro-ph.GA) Recent work has demonstrated that widely used strong-line oxygen abundance indicators, such as O3N2, $\\rm R23$, and $\\widehat{\\rm R}$, suffer from large uncertainties when applied to high-redshift galaxies. We show that this loss of precision primarily arises because, at fixed \\Oabund, galaxies span a wide dynamic range in ionization parameter and nitrogen enrichment. Here we develop updated indicators that explicitly incorporate both effects via the proxies O32 and N2O2. We define ${\\rm R}_{\\rm u}\\equiv \\rm R23+\\alpha_1 O32+\\alpha_2 N2O2$, $\\widehat{\\rm R}_{\\rm u}\\equiv \\rm \\widehat{R}+\\beta_1 O32+\\beta_2 N2O2$, and ${\\rm O}_{\\rm u}\\equiv \\rm O3N2+\\gamma_1 O32+\\gamma_2 N2O2$, and calibrate \\Oabund~as low-order polynomials in each composite indicator. Applied to a JWST sample with $T_{\\rm e}$-method abundances, the updated indicators substantially tighten the correlations with \\Oabund, boosting adjusted coefficients of determination from $\\mathbb{R}^2\\lesssim 0$ (classical indicators) to $\\mathbb{R}^2\\gtrsim 0.5$ for the full sample and to $\\sim 0.7$ at $z>2$. The residuals reveal a redshift evolution in the mapping between \\Oabund, strong lines, ionization, and nitrogen enrichment, with a pivotal turning point near the cosmic noon ($z\\sim 2$). Our calibrations provide a practical, physically grounded path to precise metallicity measurements in the JWST era and a firmer basis for quantifying early chemical enrichment and feedback.",
      "pdf_url": "https://arxiv.org/pdf/2601.12413.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15186",
      "title": "Probing Heavily Obscured AGN in Major Galaxy Mergers Using the mm-X-ray Correlation",
      "authors": [
        "M. Droguett-Callejas",
        "E. Treister",
        "L. Barcos-Muñoz",
        "M. Johnstone",
        "F. E. Bauer",
        "T. Kawamuro",
        "N. Torres-Albà",
        "C. Ricci",
        "M. Koss",
        "Y. Song",
        "A. Peca",
        "A. Evans",
        "J. González"
      ],
      "abstract": "Probing Heavily Obscured AGN in Major Galaxy Mergers Using the mm-X-ray Correlation M. Droguett-Callejas, E. Treister, L. Barcos-Muñoz, M. Johnstone, F. E. Bauer, T. Kawamuro, N. Torres-Albà, C. Ricci, M. Koss, Y. Song, A. Peca, A. Evans, J. González Astrophysics of Galaxies (astro-ph.GA) The study of heavily obscured supermassive black hole (SMBH) growth in late-stage galaxy mergers is challenging: column densities $N_{\\mathrm{H}}>10^{24},\\mathrm{cm}^{-2}$ can block most nuclear emission, leaving significant gaps in the SMBH growth census. Millimeter-wave continuum emission offers a potential window into this obscured phase, as it can trace Active Galactic Nuclei (AGN) activity through mechanisms less affected by dust extinction. In this work, we test whether the observed correlation between millimeter ($\\sim200,\\mathrm{GHz}$) and hard X-ray (14 - 150,keV) luminosities can be used to plausibly identify hidden AGN in local (Ultra)Luminous Infrared Galaxies (U)LIRGs, including systems hosting confirmed dual AGN. We identify three sources -- one confirmed AGN and two strong candidates -- presenting significant evidence of AGN activity. The confirmed dual AGN lie within $\\sim3\\sigma$ of the mm--X-ray correlation, suggesting this relation can be used to identify hidden pairs. By combining the position of each source relative to this correlation with independent star formation rate constraints, we propose a method to disentangle AGN and star formation contributions for sources with measured column densities. While our analysis is based on a small, heterogeneous local sample and relies on empirical scaling relations, these results indicate that millimeter continuum emission may provide a useful complementary diagnostic for obscured SMBH growth. ALMA observations at high angular resolutions are particularly valuable for this approach, while future facilities such as the ngVLA will be essential to test its robustness in larger and more distant samples.",
      "pdf_url": "https://arxiv.org/pdf/2601.15186.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.04560",
      "title": "Multi-color characterization of optically invisible FU Orionis-type outbursts: Demonstration and prospects for the WINTER survey",
      "authors": [
        "Danielle Frostig",
        "Kishalay De",
        "Lynne A. Hillenbrand",
        "Jill Juneau",
        "Viraj R. Karambelkar",
        "Mansi M. Kasliwal",
        "Nathan P. Lourie",
        "Geoffrey Mo",
        "Sam Rose",
        "Robert A. Simcoe",
        "Robert D. Stein"
      ],
      "abstract": "Multi-color characterization of optically invisible FU Orionis-type outbursts: Demonstration and prospects for the WINTER survey Danielle Frostig, Kishalay De, Lynne A. Hillenbrand, Jill Juneau, Viraj R. Karambelkar, Mansi M. Kasliwal, Nathan P. Lourie, Geoffrey Mo, Sam Rose, Robert A. Simcoe, Robert D. Stein 12 pages, 6 figures, submitted to ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Episodic mass accretion is the dominant mechanism for mass assembly in the proto-stellar phase. Although prior optical time-domain searches have allowed detailed studies of individual outbursts, these searches remain insensitive to the earliest stages of star formation. In this paper, we present the characterization of two FU Orionis (FUor) outbursts identified using the combination of the ground-based, near-infrared Wide-field Infrared Transient Explorer (WINTER) and the space-based, mid-infrared NEOWISE survey. Supplemented with near-infrared spectroscopic follow-up, we show that both objects are bona fide FUor type outbursts based on i) their proximity to star-forming regions, ii) large amplitude (2-4 magnitudes) infrared brightening over the last decade, iii) progenitor colors consistent with embedded (Class I) protostars, and iv) \"mixed-temperature\" infrared spectra exhibiting characteristic signatures of cool outer envelopes and a hot inner disk with a wind. While one source, WNTR24-cua, is a known FUor which we independently recover; the second source, WNTR24-egv, is a newly confirmed object. Neither source is detected in contemporaneous ground-based optical imaging, despite flux limits $\\gtrsim 100\\times$ fainter than their infrared brightness, demonstrating the capabilities of WINTER to identify heavily obscured young stellar object (YSO) outbursts. We highlight the capabilities of the Galactic Plane survey of the recently commissioned WINTER observatory in addressing the poorly understood FUor population with its unique combination of real-time detection capabilities, multi-color sensitivity, weekly cadence, and wide area coverage.",
      "pdf_url": "https://arxiv.org/pdf/2509.04560.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15619",
      "title": "A compact object with a K type star companion in the solar neighborhood: a wide post common envelope binary with a white dwarf candidate",
      "authors": [
        "Jie Lin",
        "Hailiang Chen",
        "Bojun Wang",
        "Yudong Luo",
        "Wenshi Tang",
        "Bo Huang"
      ],
      "abstract": "A compact object with a K type star companion in the solar neighborhood: a wide post common envelope binary with a white dwarf candidate Jie Lin, Hailiang Chen, Bojun Wang, Yudong Luo, Wenshi Tang, Bo Huang 13 pages, 10 figures. Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) Post-common envelope binaries (PCEBs) consisting of a white dwarf (WD) plus a main-sequence (MS) star can constrain current prescriptions of common envelope evolution (CEE) and calibrate theoretical models of binary formation and evolution. Most PCEBs studied to date have typical orbital periods of hours to a few days and can be well explained by assuming inefficient CEE to expel the envelope. However, there are currently several systems with relatively wide orbital periods ($>$18 days). To explain these wide PCEBs, additional sources of energy have been suggested to be taken into account. Here, we present the discovery and observational characterization of a compact object ($M\\,\\geq\\,0.58\\,\\rm M_{\\odot}$) with a K-type star companion in the solar neighborhood ($d\\sim 112$ pc) and an orbital period of $P_{\\rm orb}\\sim 14$ days. The compact object binary is likely to be a system consisting of a WD and a barium dwarf. Such a system with an orbital period within the gap between tight and wide binaries provides a test of whether additional energy sources are required to explain its formation. Using binary evolution models, we investigate the evolutionary history of this wide PCEB system and find that the observed properties of this source can be explained without invoking any extra energy source.",
      "pdf_url": "https://arxiv.org/pdf/2601.15619.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15672",
      "title": "The reason for the occurrence of W-type contact binaries",
      "authors": [
        "Jia Zhang",
        "Sheng-Bang Qian",
        "Li-Ying Zhu",
        "Xu-Zhi Li"
      ],
      "abstract": "The reason for the occurrence of W-type contact binaries Jia Zhang, Sheng-Bang Qian, Li-Ying Zhu, Xu-Zhi Li Zhang et al. 2026, ApJS, 282, 17 Solar and Stellar Astrophysics (astro-ph.SR) For more than half a century, the puzzling W-type phenomenon in contact binaries has challenged astrophysicists. In these systems, the less massive component exhibits a higher surface temperature than its more massive companion, which is a reversal of the typical A-type configuration, where the more massive star is hotter. This counterintuitive temperature inversion defies the basic stellar physics and still lacks a widely accepted explanation. In this study, we assembled a sample of over 3,000 extensively observed contact binaries and derived their complete set of physical parameters. Our statistical analysis revealed a strong positive correlation between the occurrence of W-type contact binaries and the intensity and frequency of magnetic activities. This result strongly supports the hypothesis that magnetic activities are the primary driver of the W-type phenomenon and offers a compelling explanation for the observed transitions between the W-type and A-type.",
      "pdf_url": "https://arxiv.org/pdf/2601.15672.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15713",
      "title": "Hydrodynamic simulations of the recurrent nova T Coronae Borealis: Nucleosynthesis predictions",
      "authors": [
        "Jordi Jose",
        "Margarita Hernanz"
      ],
      "abstract": "Hydrodynamic simulations of the recurrent nova T Coronae Borealis: Nucleosynthesis predictions Jordi Jose, Margarita Hernanz Astronomy and Astrophysics (2025), 698, A251 (21 pp) Solar and Stellar Astrophysics (astro-ph.SR) T Coronae Borealis (T CrB) is one of the eleven known recurrent novae in our Galaxy. It was observed in outburst in 1866 and 1946, with additional likely eruptions recorded in 1217 and 1787. Given its predicted recurrence period of approximately 80 yr, the next outburst is anticipated to occur imminently, thus motivating a thorough examination of the main characteristics of this system. We present new hydrodynamic models of the explosion of T CrB for different combinations of parameters (i.e., the mass, composition, and initial luminosity of the white dwarf, the metallicity of the accreted matter, and the mass-transfer rate). We show that mass-accretion rates between 10-8 - 10-7 Msun yr-1 are required to trigger an outburst after 80 yr of accretion of solar-composition material onto white dwarfs with masses about 1.30 - 1.38 Msun. For lower white dwarf luminosities, less massive white dwarfs, or reduced metallicity in the accreted material, higher mass-accretion rates are required to drive an explosion within this timescale. A decrease in metallicity or initial white dwarf luminosity leads to higher accumulated masses and ignition pressures, resulting in more violent outbursts. These outbursts exhibit higher peak temperatures, higher ejected masses, and greater kinetic energies. Models computed for different white dwarf masses but identical initial luminosities reveal significant differences in the elemental abundances of a wide range of species, including Ne, Na, Mg, Al, Si, P, S, Ar, K, Ca, and Sc. These compositional differences offer a potential diagnostic tool for constraining the parameter space and discriminating between the various T CrB models reported in this study.",
      "pdf_url": "https://arxiv.org/pdf/2601.15713.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15823",
      "title": "Failed ejection and oscillations of a current-carrying filament balanced by gravity",
      "authors": [
        "P. Jelínek",
        "M. Karlický",
        "S. Belov"
      ],
      "abstract": "Failed ejection and oscillations of a current-carrying filament balanced by gravity P. Jelínek, M. Karlický, S. Belov 12 pages, 14 figures, accepted in Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) In this study, we investigate the post-destabilization evolution of a filament in a gravity-balanced model. We adopt the filament model proposed by Solov'ev (2010), in which a dense filament is supported against gravity by the repulsive force between the filament current and its sub-photospheric image. We first performed an analytical investigation of this model. For the numerical study, we use a two-dimensional magnetohydrodynamic (MHD) model that solves the MHD equations with the Lare2d numerical code. Results: In this filament model, analytical expressions are derived for the electric current density, plasma density, and their spatial distributions as functions of the model parameters. The total electric current and the filament weight are also calculated. For the numerical simulations, we constructed an equilibrium filament characterized by a magnetic field of $B_0$ = $10^{-3}$ T, mass density $\\rho_0$ ~ 1.3 x $10^{-9}$ kg m$^{-3}$, and temperature T ~ 13000 K. The system was destabilized either by increasing the currents or by reducing the filament density, and its evolution was computed. In both destabilization regimes, the filament was ejected, then halted at a certain altitude, and subsequently fell back, repeating this cycle with a period of about 600 s. The maximum filament ejection velocity was approximately 80 and 40 km $s^{-1}$, respectively. Beneath the ejected filament a current sheet forms, where magnetic reconnection occurs. The maximum ejection altitudes were determined as functions of both the destabilizing currents and the degree of filament plasma dilution. Finally, we compared results of this MHD model with those of an ideal vacuum model and discussed all results.",
      "pdf_url": "https://arxiv.org/pdf/2601.15823.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15919",
      "title": "Does the solar oxygen abundance change over the solar cycle? An investigation into activity-induced variations of the O I infrared triplet",
      "authors": [
        "A.G.M. Pietrow",
        "M. Baratella",
        "I.V. Ilyin",
        "M. Steffen",
        "K. G. Strassmeier"
      ],
      "abstract": "Does the solar oxygen abundance change over the solar cycle? An investigation into activity-induced variations of the O I infrared triplet A.G.M. Pietrow, M. Baratella, I.V. Ilyin, M. Steffen, K. G. Strassmeier Accepted as a letter in A&A. 5 pages, 5 figures, 1 table Solar and Stellar Astrophysics (astro-ph.SR) The determination of the solar oxygen abundance remains a central problem in astrophysics, as its accuracy is limited not only by models but also by systematics. While many of these factors have been thoroughly characterized, the effect of the solar activity cycle has so far remained unexplored. Due to its relative strength and accessibility, the O I infrared triplet is typically the primary choice for abundance studies. However, previous investigations have shown that abundances inferred from this triplet tend to be higher than expected on active stars, whereas such an overabundance effect is not observed for the much weaker forbidden O I 6300 Å line. This raises the question of whether a similar trend can be found for the Sun. To address this question, we analyze two decades' worth of synoptic disk-integrated Sun-as-a-star datasets from the FEROS, HARPS-N, PEPSI, and NEID spectrographs, focusing on the infrared triplet (7772, 7774, 7775 Å) and the forbidden O I 6300 Å line. The excellent signal-to-noise ratio of the PEPSI observations allows us to detect a weak but significant variation in the equivalent widths of the infrared triplet, corresponding to about 0.01 dex difference in abundance between activity minimum and maximum. This value is significantly smaller than the typical uncertainties on the solar oxygen abundance. Due to higher scatter, no comparable trend is found in the other data sets. Based on these results, we conclude that within the typical uncertainties presented in other works, we can assume the inferred solar oxygen abundance to be stable across the solar cycle, but that this effect may be significant for other, more active stars.",
      "pdf_url": "https://arxiv.org/pdf/2601.15919.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15926",
      "title": "Out-of-Sample Validation of MagNet",
      "authors": [
        "Aryiadna Yesmanchyk",
        "Yan Xu",
        "Jason T. L. Wang",
        "Haodi Jiang",
        "Chunhui Xu",
        "Haimin Wang"
      ],
      "abstract": "Out-of-Sample Validation of MagNet Aryiadna Yesmanchyk, Yan Xu, Jason T. L. Wang, Haodi Jiang, Chunhui Xu, Haimin Wang Solar and Stellar Astrophysics (astro-ph.SR) Machine learning is starting to be used in almost every industry and academic research, and solar physics is no exception. A newly developed machine learning model named MagNet helps us to tackle some of the most serious challenges in data mining by generating transverse fields of solar active regions. Being trained on line-of-sight magnetograms from Michelson Doppler Imager at Solar and Heliospheric Observatory (SOHO/MDI), H{\\alpha} maps from Big Bear Solar Observatory and Kanzelhohe Solar Observatory and vector magnetograms from Helioseismic and Magnetic Imager at Solar Dynamic Observatory (SDO/HMI), this model provides vector magnetograms in active regions for SOHO/MDI data covering the strong solar cycle 23. In this study, we performed out-of-sample validation of the MagNet model with data from Imaging Vector Magnetograph (IVM) at Mees Solar Observatory, which was not included in the training process. Our results show good correlation between the AI generated data and the observed vector magnetograms and therefore strengthen the confidence of implementing MagNet to the entire SOHO/MDI archive and future scientific analysis of the AI generated data.",
      "pdf_url": "https://arxiv.org/pdf/2601.15926.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15969",
      "title": "Gaia20fnr: A binary-lens microlensing event with full orbital motion revealed by four space telescopes",
      "authors": [
        "M. Wicker",
        "Ł. Wyrzykowski",
        "M. Hundertmark",
        "K. A. Rybicki",
        "P. Zieliński",
        "E. Stonkutė",
        "N. Ihanec",
        "M. Maskoliūnas",
        "E. Bachelet",
        "K. Kruszyńska",
        "M. Dominik",
        "D. A. H. Buckley",
        "I. Gezer",
        "P. Mikołajczyk",
        "K. Kotysz",
        "J. Majumdar",
        "E. Pakštienė",
        "J. Zdanavičius",
        "V. Čepas",
        "U. Jonauskaitė",
        "V. Bozza",
        "A. Cassan",
        "R. Figuera Jaimes",
        "M. Rabus",
        "P. Rota",
        "R. A. Street",
        "Y. Tsapras",
        "J. Wambsganss",
        "S. Awiphan",
        "S. M. Brincat",
        "Z. Budzik",
        "J. W. Davidson Jr.",
        "R. Dymock",
        "C. Galdies",
        "V. Godunova",
        "F.-J. Hambsch",
        "M. Jabłonska",
        "T. Kvernadze",
        "M. Larma",
        "M. Makowska",
        "Y. Markus",
        "J. Merc",
        "O. Michniewicz",
        "M. Motylinski",
        "A. Popowicz",
        "M. Radziwonowicz",
        "D. Reichart",
        "A.O. Simon",
        "P. Trzcionkowski",
        "M. Zejmo",
        "S. Zola"
      ],
      "abstract": "Gaia20fnr: A binary-lens microlensing event with full orbital motion revealed by four space telescopes M. Wicker, Ł. Wyrzykowski, M. Hundertmark, K. A. Rybicki, P. Zieliński, E. Stonkutė, N. Ihanec, M. Maskoliūnas, E. Bachelet, K. Kruszyńska, M. Dominik, D. A. H. Buckley, I. Gezer, P. Mikołajczyk, K. Kotysz, J. Majumdar, E. Pakštienė, J. Zdanavičius, V. Čepas, U. Jonauskaitė, V. Bozza, A. Cassan, R. Figuera Jaimes, M. Rabus, P. Rota, R. A. Street, Y. Tsapras, J. Wambsganss, S. Awiphan, S. M. Brincat, Z. Budzik, J. W. Davidson Jr., R. Dymock, C. Galdies, V. Godunova, F.-J. Hambsch, M. Jabłonska, T. Kvernadze, M. Larma, M. Makowska, Y. Markus, J. Merc, O. Michniewicz, M. Motylinski, A. Popowicz, M. Radziwonowicz, D. Reichart, A.O. Simon, P. Trzcionkowski, M. Zejmo, S. Zola 22 pages, 11 figures, submitted to A&A on 22.01.2026 Solar and Stellar Astrophysics (astro-ph.SR) The microlensing event Gaia20fnr is a long-duration, non-caustic-crossing binary-lens event at high Galactic latitude. Triggered by a photometric rise detected by the Gaia space mission, the event was followed up with observations from multiple ground-based facilities and four space telescopes: Gaia, NEOWISE, Swift, and TESS. We characterize the Gaia20fnr microlensing system by determining the physical and orbital properties of the binary lens, the nature of the luminous source, and the kinematics of both the source and the lens. We employed a binary-lens microlensing model including full Keplerian orbital motion and annual microlens parallax to fit the photometric data. The event is best explained by a K2 giant source at $D_{\\rm S} = 3.10 \\pm 0.10\\,\\mathrm{kpc}$ lensed by a stellar binary composed of $M_{\\rm L,1} = 0.46 \\pm 0.06\\,M_\\odot$ and $M_{\\rm L,2} = 0.52 \\pm 0.06\\,M_\\odot$ at a distance of $D_{\\rm L} = 0.54 \\pm 0.05\\,\\mathrm{kpc}$. The light curve exhibits strong signatures of orbital motion and requires a full Keplerian model with a period of $P = 0.67 \\pm 0.04\\,\\mathrm{yr}$ and a radial-velocity semi-amplitude of $K_1 = 16.9 \\pm 0.9\\,\\mathrm{km\\,s^{-1}}$. Gaia20fnr is one of the few microlensing events for which a complete Keplerian binary-lens solution has been derived. The model can be tested with follow-up radial-velocity and high-resolution imaging observations as well as forthcoming Gaia DR4 and DR5 astrometric time-series data. Its long duration, multi-peak structure, and extensive coverage make it a benchmark for studying faint nearby low-mass binaries through microlensing.",
      "pdf_url": "https://arxiv.org/pdf/2601.15969.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16202",
      "title": "A multiwavelength ALMA view of gas and dust in binary protoplanetary system AS 205: Evidence of dust asymmetric distribution",
      "authors": [
        "Nguyen Thi Phuong",
        "Nguyen Tat Thang"
      ],
      "abstract": "A multiwavelength ALMA view of gas and dust in binary protoplanetary system AS 205: Evidence of dust asymmetric distribution Nguyen Thi Phuong, Nguyen Tat Thang Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) We present Atacama Large Millimeter/Submillimeter Array observations of multi-wavelength dust emissions at 3.1\\,mm and 1.3\\,mm; along with molecular line emissions of CO(2--1), CO(3--2), \\mbox{$^{13}$CO(3--2)}, and C$^{18}$O(3--2) at spatial resolutions of 7--45 AU towards the protoplanetary system AS 205. The dust emissions exhibit two distinct components of AS 205 N and AS 205 S, separated by 1.3 arcsec. While gas kinematics within the dust disk regions are dominated by Keplerian rotation, the more extended gas emission displays complex morphology and kinematics strongly affected by the binary gravitational interaction in the outer regions. The stellar masses of AS 205 N and AS 205 S are estimated at $0.78\\pm0.19$\\,M$_\\odot$ and $1.93\\pm0.86$\\,M$_\\odot$, respectively. Azimuthal variation is observed in the spectral index distribution of both disks. In AS 205 N, the spectral index minimum in the southwest is coincident with the peaks of CO($2-1$), CO($3-2$), and $^{13}$CO($3-2$) integrated intensity and the relative position of its southern counterpart. On the other hand, the spectral index distribution in \\ass~exhibits two prominent maxima, with the one in the northeast aligning with the peak of $^{13}$CO($3-2$), and the peak in the south coinciding with local maxima in CO($2-1$) and CO($3-2$) azimuthal profiles. These results suggest a correlation between dust grain size and/or optical depth with the gas distributions. Dust-trapping along the spiral arms possibly contributes to the spectral index minima in AS 205 N; however, the observed asymmetry across both disks suggests the involvement of additional mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2601.16202.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16203",
      "title": "Cyclic sunspot activity during the first millennium CE as reconstructed from radiocarbon",
      "authors": [
        "Ilya Usoskin",
        "Sami K. Solanki",
        "Natalie A. Krivova",
        "Theodosis Chatzistergos"
      ],
      "abstract": "Cyclic sunspot activity during the first millennium CE as reconstructed from radiocarbon Ilya Usoskin, Sami K. Solanki, Natalie A. Krivova, Theodosis Chatzistergos Solar and Stellar Astrophysics (astro-ph.SR) Context. Solar activity, dominated by the 11-year cyclic evolution, has been observed directly since 1610. Before that, indirect cosmogenic proxy data are used to reconstruct it over millennia. Recently, the precision of radiocarbon measurements has improved sufficiently to allow reconstructing solar activity over millennia. Aims. The first detailed reconstruction of solar activity, represented by annual sunspot numbers, is presented for 1-969 CE. Methods. The reconstruction of sunspot numbers from D14C was performed using a physics-based method involving several steps: using a carbon-cycle box model, the 14C production rate, corrected for the geomagnetic shielding, was computed from the measured data; The open solar magnetic flux was computed using a model of the heliospheric cosmic-ray modulation; Sunspot numbers were calculated using a model of the evolution of the Sun's magnetic field. The Markov Chain Monte Carlo approach was used to account for different sources of uncertainty. Results. Annual sunspot numbers were reconstructed for the first millennium CE. This period includes one extreme solar event of 774 CE and one Grand solar minimum of 650-730 CE. We could identify 91 solar cycles, of which 26 were well-defined, while 24 and 41 were reasonably and poorly defined, respectively. The mean cycle length was 10.6 years, but the lengths of individual cycles vary between 8 and 15 years. The existence of empirical Waldmeier's relations remains inconclusive. No significant periodicities were found beyond the 11-year cycle. Conclusions. This work fills the gap in the solar cycle statistics between the previously reconstructed first millennium BCE and the second millennium CE, providing vital constraints for the solar dynamo and irradiance models. A consistent 3-millennium-long reconstruction of sunspot numbers, based on a composite multi-proxy cosmogenic record, is pending.",
      "pdf_url": "https://arxiv.org/pdf/2601.16203.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15704",
      "title": "Evidence for stellar contamination and water absorption in NGTS-5b's transmission spectra with GTC/OSIRIS",
      "authors": [
        "Wan-Hao Wang",
        "Guo Chen",
        "Chengzi Jiang",
        "Enric Palle",
        "Felipe Murgas",
        "Hannu Parviainen"
      ],
      "abstract": "Evidence for stellar contamination and water absorption in NGTS-5b's transmission spectra with GTC/OSIRIS Wan-Hao Wang, Guo Chen, Chengzi Jiang, Enric Palle, Felipe Murgas, Hannu Parviainen 13 pages, 7 figures, accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Transmission spectroscopy serves as a valuable tool for probing atmospheric absorption features in the terminator regions of exoplanets. Stellar surface heterogeneity can introduce wavelength-dependent contamination that complicates the interpretation of planetary spectra. We aim to investigate the atmosphere of the warm sub-Saturn NGTS-5b through optical transmission spectroscopy. Two transits were observed with the low-resolution Optical System for Imaging and low-Intermediate-Resolution Integrated Spectroscopy (OSIRIS) on the 10.4 m Gran Telescopio Canarias (GTC). Chromatic transit light curves were modeled to derive optical transmission spectra and multiple Bayesian spectral retrievals were performed to characterize the atmospheric properties. Model comparisons provide strong evidence for contamination from unocculted stellar spots. A joint retrieval of the transmission spectra, assuming equilibrium chemistry, indicates a relatively clear atmosphere with a sub-solar C/O ratio of $<$0.22 (90% upper limit) and a low metallicity of $0.10^{+0.34}_{-0.05} \\times$ solar. Retrievals assuming free chemistry yield strong evidence for the presence of $\\rm H_2O$, with its abundance constrained to $\\log X_{\\mathrm{H_2O}} = -0.79^{+0.14}_{-0.17}$. However, the abundances of other species remain unconstrained due to the limited optical wavelength coverage. The discrepancies between the two NGTS-5b transit spectra can be attributed to varying levels of stellar contamination. NGTS-5b thus appears to host a relatively clear, water-rich atmosphere, pending confirmation from additional observations of molecular bands in the infrared.",
      "pdf_url": "https://arxiv.org/pdf/2601.15704.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15948",
      "title": "A 2 au resolution view by ALMA of the planet-hosting WISPIT 2 disk",
      "authors": [
        "Stefano Facchini",
        "Pietro Curone",
        "Myriam Benisty",
        "Francesco Zagaria",
        "Richard Teague",
        "Gabriele Cugno",
        "Jaehan Bae"
      ],
      "abstract": "A 2 au resolution view by ALMA of the planet-hosting WISPIT 2 disk Stefano Facchini, Pietro Curone, Myriam Benisty, Francesco Zagaria, Richard Teague, Gabriele Cugno, Jaehan Bae Accepted for publication on ApJL; 14 pages, 10 figures Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We present deep, high spatial resolution interferometric observations of 0.88 mm continuum emission from the TYC 5709-354-1 system, hereafter WISPIT 2, obtained with the goal of detecting circumplanetary emission in the vicinity of the newly discovered WISPIT 2b planet. Observations with the most extended baseline configuration offered by ALMA, achieving an angular resolution of $25 \\times 17$ mas ($3.3 \\times 2.2$ au), revealed a single, narrow ring with a deprojected radius of 144.4 au and width of 7.2 au, and no evidence of circumplanetary emission within the cavity. Injection and recovery tests demonstrate that these observations can rule out point-like emission at the location of WISPIT 2b brighter than $\\approx 45$ $\\mu$Jy at the $3\\sigma$ level. While these data can rule out PDS 70c like circumplanetary emission, the upper limit is consistent with empirical mass-flux relationships extrapolated from the stellar regime. Visibility modeling of the continuum ring confirms that WISPIT 2b lies significantly interior to the mm dust ring, raising doubts about the ability of WISPIT 2b to be the only driver of the dust structure. Possible solutions include either another lower mass companion, residing between WISPIT 2b and the cavity edge, likely in the gap seen by SPHERE at $\\sim130$ au, or that WISPIT 2b is either substantially more massive than IR-photometry based estimates ($\\sim15$ $M_{\\rm Jup}$) or on a moderately eccentric orbit. The combination of observations sensitive to the gas and dust distributions on larger spatial scales and dedicated hydrodynamical modeling will help differentiate between scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2601.15948.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.15131",
      "title": "Polarimeter to Unify the Corona and Heliosphere (PUNCH)",
      "authors": [
        "Craig E. DeForest",
        "Sarah E. Gibson",
        "Ronnie Killough",
        "Nick R. Waltham",
        "Matt N. Beasley",
        "Robin C. Colaninno",
        "Glenn T. Laurent",
        "Daniel B. Seaton",
        "J. Marcus Hughes",
        "Madhulika Guhathakurta",
        "Nicholeen M. Viall",
        "Raphael Attie",
        "Dipankar Banerjee",
        "Luke Barnard",
        "Doug A. Biesecker",
        "Mario M. Bisi",
        "Volker Bothmer",
        "Antonina Brody",
        "Joan Burkepile",
        "Iver H. Cairns",
        "Jennifer L. Campbell",
        "Traci Case",
        "Amir Caspi",
        "David Cheney",
        "Rohit Chhiber",
        "Matthew J. Clapp",
        "Steven R. Cranmer",
        "Jackie A. Davies",
        "Curt A. de Koning",
        "Mihir I. Desai",
        "Heather A. Elliott",
        "Samaiyah Farid",
        "Bea Gallardo-Lacourt",
        "Chris Gilly",
        "Caden Gobat",
        "Mary H. Hanson",
        "Richard A. Harrison",
        "Donald M. Hassler",
        "Chase Henley",
        "Alan M. Henry",
        "Russell A. Howard",
        "Bernard V. Jackson",
        "Samuel Jones",
        "Don Kolinski",
        "Derek A. Lamb",
        "Florine Lehtinen",
        "Chris Lowder",
        "Anna Malanushenko",
        "William H. Matthaeus",
        "David J. McComas",
        "Jacob McGee",
        "Huw Morgan",
        "Divya Oberoi",
        "Dusan Odstrcil",
        "Chris Parmenter",
        "Ritesh Patel",
        "Francesco Pecora",
        "Steve Persyn",
        "Victor J. Pizzo",
        "Simon P. Plunkett",
        "Elena Provornikova",
        "Nour Eddine Raouafi",
        "Jillian A. Redfern",
        "Alexis P. Rouillard",
        "Kelly D. Smith",
        "Keith B. Smith",
        "Zachary S. Talpas",
        "S. James Tappin",
        "Arnaud Thernisien",
        "Barbara J. Thompson",
        "Samuel Van Kooten",
        "Kevin J. Walsh",
        "David F. Webb",
        "William L. Wells",
        "Matthew J. West",
        "Zachary Wiens",
        "Yan Yang"
      ],
      "abstract": "Polarimeter to Unify the Corona and Heliosphere (PUNCH) Craig E. DeForest, Sarah E. Gibson, Ronnie Killough, Nick R. Waltham, Matt N. Beasley, Robin C. Colaninno, Glenn T. Laurent, Daniel B. Seaton, J. Marcus Hughes, Madhulika Guhathakurta, Nicholeen M. Viall, Raphael Attie, Dipankar Banerjee, Luke Barnard, Doug A. Biesecker, Mario M. Bisi, Volker Bothmer, Antonina Brody, Joan Burkepile, Iver H. Cairns, Jennifer L. Campbell, Traci Case, Amir Caspi, David Cheney, Rohit Chhiber, Matthew J. Clapp, Steven R. Cranmer, Jackie A. Davies, Curt A. de Koning, Mihir I. Desai, Heather A. Elliott, Samaiyah Farid, Bea Gallardo-Lacourt, Chris Gilly, Caden Gobat, Mary H. Hanson, Richard A. Harrison, Donald M. Hassler, Chase Henley, Alan M. Henry, Russell A. Howard, Bernard V. Jackson, Samuel Jones, Don Kolinski, Derek A. Lamb, Florine Lehtinen, Chris Lowder, Anna Malanushenko, William H. Matthaeus, David J. McComas, Jacob McGee, Huw Morgan, Divya Oberoi, Dusan Odstrcil, Chris Parmenter, Ritesh Patel, Francesco Pecora, Steve Persyn, Victor J. Pizzo, Simon P. Plunkett, Elena Provornikova, Nour Eddine Raouafi, Jillian A. Redfern, Alexis P. Rouillard, Kelly D. Smith, Keith B. Smith, Zachary S. Talpas, S. James Tappin, Arnaud Thernisien, Barbara J. Thompson, Samuel Van Kooten, Kevin J. Walsh, David F. Webb, William L. Wells, Matthew J. West, Zachary Wiens, Yan Yang As accepted by Solar Physics journal; substantially similar (but not identical) to the article as it will appear in the journal Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Polarimeter to Unify the Corona and Heliosphere (PUNCH) mission is a NASA Small Explorer to determine the cross-scale processes that unify the solar corona and heliosphere. PUNCH has two science objectives: (1) understand how coronal structures become the ambient solar wind, and (2) understand the dynamic evolution of transient structures, such as coronal mass ejections, in the young solar wind. To address these objectives, PUNCH uses a constellation of four small spacecraft in Sun-synchronous low Earth orbit, to collect linearly polarized images of the K corona and young solar wind. The four spacecraft each carry one visible-light imager in a 1+3 configuration: a single Narrow Field Imager solar coronagraph captures images of the outer corona at all position angles, and at solar elongations from 1.5 degrees (6 R$_\\odot$) to 8 degrees (32 R$_\\odot$); and three separate Wide Field Imager heliospheric imagers together capture views of the entire inner solar system, at solar elongations from 3 degrees (12 R$_\\odot$) to 45 degrees (180 R$_\\odot$) from the Sun. PUNCH images include linear-polarization data, to enable inferring the three-dimensional structure of visible features without stereoscopy. The instruments are matched in wavelength passband, support overlapping instantaneous fields of view, and are operated synchronously, to act as a single ``virtual instrument'' with a 90 degree wide field of view, centered on the Sun. PUNCH launched in March of 2025 and began science operations in June of 2025. PUNCH has an open data policy with no proprietary period, and PUNCH Science Team Meetings are open to all.",
      "pdf_url": "https://arxiv.org/pdf/2509.15131.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.22822",
      "title": "On the Short Dissipation Scales and Current-Sheet Properties of Low-Coronal EUV Brightenings",
      "authors": [
        "Olena Podladchikova"
      ],
      "abstract": "On the Short Dissipation Scales and Current-Sheet Properties of Low-Coronal EUV Brightenings Olena Podladchikova Solar and Stellar Astrophysics (astro-ph.SR) Solar Orbiter EUV observations reveal ubiquitous small-scale brightenings in the quiet-Sun low corona. We analyze the spatial and temporal dissipation scales of these events with a focus on the formation, evolution, and dissipation of associated current sheets. The brightenings are observed at heights of 1-5 Mm and span energies of 10^20 - 10^24 erg, well below the classical nanoflare regime, with the lowest-energy brightenings preferentially originating in the lowest coronal layers. Two distinct dissipation regimes are identified: impulsive brightenings with timescales of 1-10 s, consistent with fast, Alfvenic magnetic reconnection in low-beta plasma, and longer-lived heating episodes lasting 10-100 s, indicative of slower, resistive current-sheet dissipation under higher-beta conditions. The observed dissipation scales suggest a transition from kinetic-scale reconnection to macroscopic current-sheet heating in the low corona. These results support a multi-scale energy-release framework and highlight the role of low-altitude, small-scale current-sheet dissipation in quiet-Sun coronal heating.",
      "pdf_url": "https://arxiv.org/pdf/2510.22822.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.14378",
      "title": "A Not-So-Compact Companion: Massive, Oversize White Dwarf in a Post-Common Envelope Eclipsing Binary",
      "authors": [
        "Erin M. Motherway",
        "Evan Linck",
        "Robert D. Mathieu",
        "Don Dixon",
        "Keivan G. Stassun",
        "Katelyn Breivik",
        "Steven R. Majewski",
        "Onno Pols"
      ],
      "abstract": "A Not-So-Compact Companion: Massive, Oversize White Dwarf in a Post-Common Envelope Eclipsing Binary Erin M. Motherway, Evan Linck, Robert D. Mathieu, Don Dixon, Keivan G. Stassun, Katelyn Breivik, Steven R. Majewski, Onno Pols Solar and Stellar Astrophysics (astro-ph.SR) We provide a detailed characterization of 2M07515777+1807352, a post-common envelope eclipsing binary system with a 10.3 d, nearly, but not quite, circular orbit (e = 0.02). This system consists of a massive white dwarf (WD) ($1.08$ M$_{\\odot}$) and a 4400 K main-sequence companion (0.66 M$_{\\odot}$). This WD is among the most massive known within post-common envelope binary systems. We also find, through both spectral energy distribution and $\\it{TESS}$ light curve analyses, that the WD has a radius of $1.54\\pm 0.07 R_{\\oplus}$, roughly $12\\sigma$ larger than the expected value from WD mass-radius relationships. Both the Lomb-Scargle analysis and the $v \\sin{i}$ of the system indicate the main-sequence companion to be super-synchronously rotating at a period of $\\sim$6 days, which may suggest accretion occurred during the evolution of the system. This binary also shares similar physical characteristics with six other post-common envelope systems hosting massive WDs, which may point to a shared formation pathway. We model the history of this system with COSMIC and find that it likely formed through an episode of common envelope evolution following the onset of mass transfer when the progenitor primary was on either the early or the thermally pulsing stages of the asymptotic giant branch. As a result of its properties, the study of 2M07515777+1807352 can provide new insights regarding many key outstanding questions in our understanding of common envelope evolution.",
      "pdf_url": "https://arxiv.org/pdf/2601.14378.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21348",
      "title": "Asymptotics of spherical dynamos exhibiting a small-scale MAC balance",
      "authors": [
        "Justin A. Nicoski",
        "Andy Esseln",
        "Chris Davies",
        "Michael A. Calkins"
      ],
      "abstract": "Asymptotics of spherical dynamos exhibiting a small-scale MAC balance Justin A. Nicoski, Andy Esseln, Chris Davies, Michael A. Calkins Geophysics (physics.geo-ph); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Understanding the asymptotic behaviour of numerical dynamo models is critical for extrapolating results to the physical conditions that characterise terrestrial planetary cores. Here we investigate the behaviour of convection-driven dynamos reaching a MAC (magnetic-Archimedes-Coriolis) balance on the convective length scale and compare the results with non-magnetic convection cases. In particular, the dependence of physical quantities on the Ekman number, $Ek$, is studied in detail. The scaling of velocity dependent quantities is observed to be independent of the force balance and in agreement with quasi-geostrophic theory. The primary difference between dynamo and non-magnetic cases is that the fluctuating temperature is order unity in the former such that the buoyancy force scales with the Coriolis force. The MAC state yields a scaling for the flow speeds that is identical to the so-called CIA (Coriolis-inertia-Archimedes) scaling. There is an $O(Ek^{1/3})$ length scale present within the velocity field irrespective of the leading order force balance. This length scale is consistent with the asymptotic scaling of the terms of the governing equations and is not an indication that viscosity plays a dominant role. The peak of the kinetic energy spectrum and the ohmic dissipation length scale both exhibit an Ekman number dependence of approximately $Ek^{1/6}$, which is consistent with a scaling of $Rm^{-1/2}$, where $Rm$ is the magnetic Reynolds number. For the dynamos, advection remains comparable to, and scales similarly with, both inertia and viscosity, implying that nonlinear convective Rossby waves play an important role in the dynamics even in a MAC regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.21348.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03620",
      "title": "On flying through the base of a pseudo-streamer",
      "authors": [
        "Forrest Mozer",
        "Oleksiy Agapitov",
        "Kyungeun Choi",
        "Andrii Voshchepynets"
      ],
      "abstract": "On flying through the base of a pseudo-streamer Forrest Mozer, Oleksiy Agapitov, Kyungeun Choi, Andrii Voshchepynets possible error in strahl measurements Space Physics (physics.space-ph); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Near the 10 solar radius perihelion of Parker Solar Probe orbit 24, a confined region containing an enhanced plasma density of 25,000 particles per cubic centimeter and broadband electrostatic waves was encountered. The solar wind velocity of 200 kilometers per second and ion temperature of 25 eV were significantly reduced as compared to their values in the ambient solar wind. These anomalous plasma conditions were observed on closed magnetic field lines, as determined from observations of the suprathermal electron strahl. Because the polarity of the radial magnetic field did not change sign on the two sides of the crossing and the crossed region contained a double-peaked plasma structure, the spacecraft must have passed through the base of a pseudo-streamer whose structure extended out to 10 solar radii. In the plasma frame, an electric field as large as 400 millivolts per meter was detected during the crossing. The current associated with this electric field was less than one milliampere per square meter, corresponding to a drift velocity less than 2.5 kilometers per second. It also contained a turbulent plasma with density fluctuations divided by density as large as 0.3, suggesting that the resistive term in the generalized ohm's law was significant. Also, the density as a function of time had a non-zero slope when the electric field was non-zero, suggesting that the pressure gradient term also mattered. As compared to earlier remote sensing and theoretical results, it is surprising that the plasma in this pseudo-streamer had a remarkably low flow velocity and that the pseudo-streamer base extended out to 10 solar radii.",
      "pdf_url": "https://arxiv.org/pdf/2601.03620.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15351",
      "title": "OmniSpectra: A Unified Foundation Model for Native Resolution Astronomical Spectra",
      "authors": [
        "Md Khairul Islam",
        "Judy Fox"
      ],
      "abstract": "OmniSpectra: A Unified Foundation Model for Native Resolution Astronomical Spectra Md Khairul Islam, Judy Fox Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI) We present OmniSpectra, the first native-resolution foundation model for astronomy spectra. Unlike traditional models, which are limited to fixed-length input sizes or configurations, OmniSpectra handles spectra of any length at their original size, without resampling or interpolation. Despite the large-scale spectroscopic data from diverse surveys fueling the rapid growth of astronomy, existing foundation models are limited to a fixed wavelength range and specific instruments. OmniSpectra is the first foundation model to learn simultaneously from multiple real-world spectra surveys with different configurations at a large scale. We achieve this by designing a novel architecture with adaptive patching across variable lengths, sinusoidal global wavelength encoding, local positional embeddings through depthwise convolution, and validity-aware self-attention masks. Allowing us to learn multi-scale spatial patterns while skipping attention for invalid patches. Even with a limited training example, OmniSpectra demonstrates excellent zero-shot generalization compared to methods tailored for specific tasks. This transfer learning capability makes this model the state-of-the-art across various astronomy tasks, including source classification, redshift estimation, and properties prediction for stars and galaxies. OmniSpectra reduces the need for training individual models for different tasks from scratch, establishing itself as the next-generation astronomy foundation model.",
      "pdf_url": "https://arxiv.org/pdf/2601.15351.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15367",
      "title": "Non-uniform Antenna Loading Effect on Embedded Element Patterns and Application to Fault Detection",
      "authors": [
        "Georgios Kyriakou"
      ],
      "abstract": "Non-uniform Antenna Loading Effect on Embedded Element Patterns and Application to Fault Detection Georgios Kyriakou 6 pages, 5 pages, to be submitted to IEEE-TAP as Communication Instrumentation and Methods for Astrophysics (astro-ph.IM) A new, iterative algorithm is presented to calculate the Embedded Element Pattern (EEP) tranformation from a set of patterns computed for a uniform antenna port loading (scaled identinty matrix) to a set of those computed for a non-uniform one (arbitrary diagonal matrix). This method proves particularly useful when inverting the computations to derive the non-uniform entries of the arbitrary load, given the minimum number of EEPs necessary, which disposes of the redundancy of other matrix-based computations and leads to numerically stable impedance fault calculation. As the EEPs are envisioned to be obtained primarily through measurement, our method is also tested with the inclusion of various noise components and its convergence is evaluated, suggesting the minimum SNR and fading level of the measurement apparatus, as well as the optimal choice of reference antenna to minimise the estimation error.",
      "pdf_url": "https://arxiv.org/pdf/2601.15367.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15805",
      "title": "Distance-Independent Atmospheric Refraction Correction for Accurate Retrieval of Fireball Trajectories",
      "authors": [
        "Jaakko Visuri",
        "Maria Gritsevich",
        "Janne Sievinen"
      ],
      "abstract": "Distance-Independent Atmospheric Refraction Correction for Accurate Retrieval of Fireball Trajectories Jaakko Visuri, Maria Gritsevich, Janne Sievinen Accepted for publication in Monthly Notices of the Royal Astronomical Society Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Atmospheric and Oceanic Physics (physics.ao-ph); Geophysics (physics.geo-ph); Optics (physics.optics) Accurate determination of fireball direction is essential for retrieving trajectories and velocities. Errors in these measurements have significant implications, affecting the calculated pre-impact orbit, influencing mass estimates, and impacting the accuracy of dark flight simulations, where applicable. Here we implement a new atmospheric refraction correction technique that addresses a significant aspect previously overlooked in the field of meteor science. Traditional refraction correction techniques, originally designed for objects positioned at infinite distances, tend to overcompensate when applied to objects within the Earth's atmosphere. To rectify this issue, our study introduces the concept of the atmospheric refraction delta z correction technique, involving the artificial elevation of the observer site height above sea level. We utilize analytically derived formulas for the delta z correction in conjunction with commonly used refraction models, validating these results against a numerical solution that traces light rays through the atmosphere. This ray-tracing model is applied to finely meshed atmospheric layers, yielding precise correction values. We evaluate multiple sources of error in order to quantify the achievable accuracy of the proposed method. Our approach (1) enables the determination of fireball positions with improved astrometric accuracy, (2) removes the explicit dependence on the fireball distance from the observer or its height above Earth's surface within the limits imposed by realistic atmospheric variability, and (3) simplifies meteor data processing by providing a robust framework for analyzing low-elevation fireball observations, for which atmospheric refraction is significant and is automatically corrected by the method. As a result of this work, we provide open, publicly accessible software for calculating the delta z correction.",
      "pdf_url": "https://arxiv.org/pdf/2601.15805.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15837",
      "title": "Determination of the longitude difference between Baghdad and Khwarezm using a lunar eclipse (the method of Abu Rayhan al-Biruni and Abu al-Wafa al-Buzjani)",
      "authors": [
        "Rizoi Bakhromzod"
      ],
      "abstract": "Determination of the longitude difference between Baghdad and Khwarezm using a lunar eclipse (the method of Abu Rayhan al-Biruni and Abu al-Wafa al-Buzjani) Rizoi Bakhromzod History and Philosophy of Physics (physics.hist-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM) This paper examines how, in the tenth century, medieval Iranian scholars Abu Rayhan al-Biruni and Abu al-Wafa al-Buzjani determined the difference in geographical longitude between the cities of Baghdad and Khwarezm through simultaneous observation of a lunar eclipse. Brief academic biographies of these scholars are presented, with emphasis on their contributions to mathematics and astronomy. The study discusses the importance of determining geographical coordinates - especially longitude - in the science of the 10th-11th centuries, provides an overview of the methods of coordinate determination available at the time, and highlights the problem of synchronizing remote observations prior to the advent of electronic communication. Particular attention is devoted to a detailed analysis of the method based on observing a lunar eclipse to simultaneously measure longitude differences: the necessary conditions and organization of the experiment, the instruments employed, the mathematical calculations, and error estimates are described. The longitude difference obtained by al-Biruni and al-Buzjani is compared with modern values. The conclusion discusses the scientific significance of this method for the history of science and astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2601.15837.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15927",
      "title": "Hot and cloudy: High temperature clouds in super-Earths and sub-Neptunes",
      "authors": [
        "Leoni J. Janssen",
        "Yamila Miguel",
        "Michiel Min",
        "Helong Huang",
        "Mantas Zilinskas",
        "Christiaan P. A. van Buchem"
      ],
      "abstract": "Hot and cloudy: High temperature clouds in super-Earths and sub-Neptunes Leoni J. Janssen, Yamila Miguel, Michiel Min, Helong Huang, Mantas Zilinskas, Christiaan P. A. van Buchem Earth and Planetary Astrophysics (astro-ph.EP) JWST observations provide for the first time evidence for an atmosphere on a rocky exoplanet - 55 Cnc e. The atmosphere of 55 Cnc e is hot with $\\text{T}_{\\text{eq}}>2000$K and shows strong variability, for which cloud formation above a molten crust could be one possible explanation. The composition of the atmosphere of 55 Cnc e is still unknown but suggests the presence of volatiles. We have run cloud formation models on a grid of N-dominated, O-dominated, C-dominated and H-dominated atmospheres to investigate which type of cloud we could expect on hot super-Earths and hot sub-Neptunes ($1000$K $<$ T $<$ $3000$K). Our models combine radiative transfer with equilibrium chemistry of the gaseous and condensed phases, vertical mixing of condensable species, sedimentation, nucleation and coagulation. We find that the condensability of species is highly dependent on the oxygen abundance of an atmosphere. Oxygen poor atmospheres can be heated by UV and optical absorbers PS, TiO and CN which create temperature inversions. These inhibit condensation. Oxygen rich atmospheres are colder without temperature inversions, and are therefore more favourable environments for cloud formation. The major expected cloud component in O-dominated atmospheres with solar refractory abundance is TiO$_2$(s). Spectral features of clouds in these worlds are stronger in transmission than in emission, in particular at short wavelengths. We find a lack of optical data of solid species in comparison to the variety of stable cloud components which can form on hot, rocky planets.",
      "pdf_url": "https://arxiv.org/pdf/2601.15927.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16031",
      "title": "Modeling the Impact of Unresolved Stellar Companions on Detection Sensitivity in Kepler's Small Planet Occurrence Rates",
      "authors": [
        "Galen J. Bergsten",
        "David R. Ciardi",
        "Jessie L. Christiansen",
        "Catherine A. Clark",
        "Ilaria Pascucci",
        "Courtney D. Dressing",
        "Kevin K. Hardegree-Ullman",
        "Michael B. Lund"
      ],
      "abstract": "Modeling the Impact of Unresolved Stellar Companions on Detection Sensitivity in Kepler's Small Planet Occurrence Rates Galen J. Bergsten, David R. Ciardi, Jessie L. Christiansen, Catherine A. Clark, Ilaria Pascucci, Courtney D. Dressing, Kevin K. Hardegree-Ullman, Michael B. Lund 20 pages, 7 figures, 6 tables; accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP) Unresolved stellar companions can cause both under-estimations in the radii of transiting planets and over-estimations of their detectability, affecting our ability to reliably measure planet occurrence rates. To quantify the latter, we identified a control sample of 198 Kepler stars with sensitivity to Earth-like planets if they were single stars, and imaged them with adaptive optics. In 20% of systems, we detected stellar companions that were close enough to go unresolved in Kepler observations. We calculated the distribution of planet radius correction factors needed to adjust for these observed companions, along with simulations of undetected companions to which our observations were not sensitive. We then used these correction factors to optimize an occurrence rate model for small close-in planets while correcting Kepler's detection efficiency for the presence of unresolved companions, and quantified how this correction affects occurrence estimates. Median occurrence rates for small planets between $2-100$ days increased by an average factor of $1.08-1.19$ (depending on statistical treatments), with the largest differences found for smaller planets at larger orbital periods. We found that the frequency of Earth-sized planets in the habitable zone ($\\eta_\\oplus$) increased by a factor of ${1.18}_{-0.66}^{+0.43}-{1.46}_{-0.83}^{+0.53}$ when accounting for the effect of unresolved companions on Kepler's detection sensitivity.",
      "pdf_url": "https://arxiv.org/pdf/2601.16031.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25923",
      "title": "NEOForCE: Near-Earth Objects' Forecast of Collisional Events",
      "authors": [
        "Dmitrii E. Vavilov",
        "Daniel Hestroffer"
      ],
      "abstract": "NEOForCE: Near-Earth Objects' Forecast of Collisional Events Dmitrii E. Vavilov, Daniel Hestroffer Earth and Planetary Astrophysics (astro-ph.EP) Robust impact monitoring of near-Earth objects is an essential task of planetary defense. Current systems such as NASA's Sentry-II, the University of Pisa's CLOMON2, and ESA's Aegis have been highly successful, but independent approaches are essential to ensure reliability and to cross-validate predictions of possible impacts. We present NEOForCE (Near-Earth Objects' Forecast of Collisional Events), a new independent monitoring system for asteroid impact prediction. By relying on orbital solutions from DynAstVO at Paris Observatory and using an original methodology for uncertainty propagation, NEOForCE provides an alternative line of verification for impact assessments and strengthens the overall robustness of planetary defense. As other monitoring systems, NEOForCE samples several thousand virtual asteroids from the uncertainty region and integrates their orbits up to 100 years into the future. Instead of searching for close approaches of the virtual asteroids with the Earth, our system looks for times when the Earth comes close to the realistic uncertainty regions around them, which are mostly stretched along their osculating orbits. We also estimate the maximal impact probability, and only if this value is large enough do we continue to the next step. In this second step, we compute how the original asteroid orbit should be modified so that the new trajectory leads to an Earth impact, which allows us to confirm the possible collision and estimate the impact probability. We tested NEOForCE against NASA's Sentry-II system on five representative asteroids: 2000 SG344, 2005 QK76, 2008 JL3, 2023 DO and 2008 EX5. NEOForCE successfully recovered mostly all possible collisions reported by Sentry-II with impact probabilities above e-7, demonstrating the robustness of our approach. In addition, NEOForCE identified several potential impacts at the e-7 - e-6 level that Sentry-II did not report.",
      "pdf_url": "https://arxiv.org/pdf/2510.25923.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}