{
  "date": "2025-11-29",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.IM",
    "astro-ph.GA",
    "astro-ph.EP",
    "astro-ph.HE",
    "astro-ph.CO",
    "astro-ph.SR"
  ],
  "total_papers": 98,
  "gw_related_papers": 3,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.19994",
      "title": "A Focused Review of Quintom Cosmology: From Quintom Dark Energy to Quintom Bounce",
      "authors": [
        "Tao-tao Qiu",
        "Yifu Cai",
        "Yang Liu",
        "Si-Yu Li",
        "Jarah Evslin",
        "Xinmin Zhang"
      ],
      "abstract": "A Focused Review of Quintom Cosmology: From Quintom Dark Energy to Quintom Bounce Tao-tao Qiu, Yifu Cai, Yang Liu, Si-Yu Li, Jarah Evslin, Xinmin Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The recently released data of DESI DR2 favors a dynamical dark energy theory, with the equation of state crossing the cosmological constant boundary $w=-1$. In this paper, we briefly review quintom cosmology, especially the quintom bounce. We will give three examples of a quintom bounce and one example of a cyclic universe with quintom matter.",
      "pdf_url": "https://arxiv.org/pdf/2511.19994.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20739",
      "title": "Game Theory in Cosmology",
      "authors": [
        "Oem Trivedi",
        "Venkat Venkatsubramanian"
      ],
      "abstract": "Oem Trivedi, Venkat Venkatsubramanian 32 pages with no figures, comments very welcome ! Cosmology and Nongalactic Astrophysics (astro-ph.CO); Statistical Mechanics (cond-mat.stat-mech); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We present a game-theoretic statistical framework for cosmology, which we term \\textit{Cosmological Teleodynamics}. We recast the dark sector, cosmic acceleration, large-scale structure, and cosmic tensions as emergent consequences of nonlocal memory and intrinsically persistent organization in a self-gravitating Universe. By introducing a maximum-caliber weight on cosmic histories and a bias functional encoding structural memory, we derive modified Friedmann, Boltzmann, and Poisson equations that naturally generate dark energy-like acceleration, dark matter-like clustering, and scale-dependent growth suppression. We also show how this approach can naturally help alleviate the $H_0$ and $S_8$ tensions, can produce anisotropic velocity fields, and predict environment-dependent halo signatures that cannot arise from particle dark matter or scalar-field dark energy. We also derive a generalized horizon entropy and temperature, revealing a nonequilibrium statistical origin for cosmic acceleration and formulating a Law of Universal Arbitrage Equilibrium that governs the evolution of the Universe, showing that it is expanding towards a continuous form of Nash equilibrium. Cosmological Teleodynamics therefore offers a unified, emergent, and testable alternative to the conventional dark sector, rooted not in new particles but in the intrinsic statistical and systemic structure of cosmic memory, and shows that the universe itself operates like a giant potential game.",
      "pdf_url": "https://arxiv.org/pdf/2511.20739.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20756",
      "title": "High-Order Photon Rings around Kerr Naked Singularities",
      "authors": [
        "Hina Suzuki",
        "Yosuke Mizuno",
        "Akhil Uniyal",
        "Indu Kalpa Dihingia",
        "Tintin Nguyen",
        "Chi-kwan Chan"
      ],
      "abstract": "High-Order Photon Rings around Kerr Naked Singularities Hina Suzuki, Yosuke Mizuno, Akhil Uniyal, Indu Kalpa Dihingia, Tintin Nguyen, Chi-kwan Chan 9 pages, 3 figures, comments welcomed High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We present a detailed study of higher-order photon rings of an accreting Kerr naked singularity (KNS) with dimensionless spin parameter $a=1.01$; i.e., a horizonless, overly spinning compact object. Motivated by horizon-scale very-long-baseline interferometry (VLBI) including Event Horizon Telescope (EHT) and future missions such as the Black Hole Explorer (BHEX), we analyze image morphology and interferometric visibilities to identify observational signatures that differentiate KNS from Kerr black holes. We find that higher-order photon rings are tightly concentrated within the nominal ``shadow'' region and that the shadow develops a pronounced gap at sufficiently large observer inclination. These morphological differences produce measurable deviations in the complex visibilities relative to Kerr black hole predictions. Our results indicate that photon-ring structure and visibility-domain diagnostics at horizon-resolving baselines can provide a direct observational test of the presence (or absence) of an event horizon and thus offer a concrete avenue to test general relativity with future horizon-scale observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.20756.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20757",
      "title": "Reanalyzing DESI DR1: 2. Constraints on Dark Energy, Spatial Curvature, and Neutrino Masses",
      "authors": [
        "Anton Chudaykin",
        "Mikhail M. Ivanov",
        "Oliver H. E. Philcox"
      ],
      "abstract": "Reanalyzing DESI DR1: 2. Constraints on Dark Energy, Spatial Curvature, and Neutrino Masses Anton Chudaykin, Mikhail M. Ivanov, Oliver H. E. Philcox Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We carry out an independent re-analysis of the Dark Energy Spectroscopic Instrument (DESI) public dataset, focusing on extensions to the standard cosmological model, $\\Lambda$CDM. Utilizing the dataset and Effective Field Theory (EFT)-based pipeline described in Paper 1, we constrain cosmological models with massive neutrinos ($\\Lambda$CDM+$M_\\nu$), spatial curvature ($o\\Lambda$CDM), dynamical dark energy ($w_0w_a$CDM), and their combinations using the power spectrum and bispectrum of DESI galaxies and quasars. Our work also presents the first measurements of relevant non-minimal cosmological parameters from the combination of cosmic microwave background (CMB) and DESI full-shape (FS) data, which are made possible thanks to carefully chosen priors on EFT parameters. We find that the addition the FS likelihood to DESI's baryon acoustic oscillation (BAO) data improves the limits on the spatial curvature by a factor of two over the BAO only results, though the improvements are less significant with the CMB data. The dark energy equation of state figure-of-merit increases both with and without the supernovae data (SNe), by $\\approx30\\%$ and $\\approx20\\%$ relative to the CMB+BAO and CMB+BAO+SNe results, respectively. Our FS likelihood also yields the strongest CMB-independent constraint on the total neutrino mass $M_\\nu<0.32\\,{\\rm eV}$, with the $30\\%$ improvement due to the bispectrum. In combination with the CMB, we find a $14\\%$ improvement assuming the $\\Lambda$CDM+$M_\\nu$ model (yielding $M_\\nu<0.059\\,{\\rm eV}$), but this increases to $22\\%$ when using non-minimal backgrounds: $M_\\nu<0.097\\,{\\rm eV}$ in $o\\Lambda$CDM+$M_\\nu$ and $M_\\nu<0.13\\,{\\rm eV}$ in $w_0w_a$CDM+$M_\\nu$. Overall, our work illustrates that robust and substantial gains in constraining power can be obtained by incorporating the FS power spectrum and bispectrum measurements in analyses of non-minimal cosmological models.",
      "pdf_url": "https://arxiv.org/pdf/2511.20757.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20970",
      "title": "The diverse morphology of gravitational wave signals from merging neutron-star white-dwarf binaries",
      "authors": [
        "Shenghua Yu",
        "Youjun Lu",
        "C. Simon Jeffery",
        "Zhanwen Han",
        "DongDong Liu",
        "Jie Yang",
        "Xilong Fan",
        "Bo Peng",
        "Jianbin Li"
      ],
      "abstract": "The diverse morphology of gravitational wave signals from merging neutron-star white-dwarf binaries Shenghua Yu, Youjun Lu, C. Simon Jeffery, Zhanwen Han, DongDong Liu, Jie Yang, Xilong Fan, Bo Peng, Jianbin Li 13 pages, 7 figures, accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) In sufficiently compact neutron star-white dwarf (NSWD) binary systems, orbital decay means the white dwarf eventually fills its shrinking Roche lobe, initiating a phase of mass transfer. The exchange of angular momentum-both internal and external-plays a critical role in determining the binary's evolutionary outcome. For neutron stars with relatively low magnetic fields and spin frequencies, whether the orbital separation continues to shrink depends on the interplay between gravitational wave (GW) radiation and mass transfer dynamics. We compute the orbital evolution of NSWD binaries across a broad parameter space, incorporating four key variables. Our results reveal distinct boundaries in the NS-WD mass-mass diagram: binaries with white dwarf masses above these thresholds undergo rapid orbital decay and direct coalescence. The dependence of these boundaries on system parameters indicates that Roche-lobe-filling NSWD binaries can follow multiple evolutionary pathways -- a phenomenon we refer to as branched or polymorphic evolution. NSWD binary systems emit strong and diverse GW signals, many of which would be detectable by space-based GW observatories. The morphology of the evolving GW waveform provides a direct diagnostic for the NSWD binary configuration, including any contribution from an accretion disk. Our models can provide critical waveform templates for identifying merging binary signals in real-time GW data.",
      "pdf_url": "https://arxiv.org/pdf/2511.20970.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.21388",
      "title": "Friction in Stochastic Inflation",
      "authors": [
        "Baptiste Blachier",
        "Christophe Ringeval"
      ],
      "abstract": "Friction in Stochastic Inflation Baptiste Blachier, Christophe Ringeval 26 pages, 7 figures, uses jcappub Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We solve time-reversed stochastic inflation in the semi-infinite flat potential with a constant drift term and derive an exact expression for the probability distribution of the curvature fluctuations. It exhibits exponential decaying tails which contrast to the Levy-like power law behaviour encountered without friction. Such a non-vanishing drift acts as a regulator for the conventional ``forward'' stochastic $\\delta N$-formalism, which is otherwise ill-defined in the unbounded and flat potentials typical of plateau models of inflation. This setup therefore allows us to compare the curvature distribution derived from both approaches, reverse and forward in time. Up to similar exponential tails, we find quantitative differences. In particular, in the classical-like limit of very large drift, the tails become Gaussian but only in the time-reversed picture. As a toy model of eternal inflation, we finally discuss the case of negative drift in which inflation never ends for many field trajectories. The forward approach becomes pathological whereas the reverse formalism gives back a finite curvature distribution with always exponential tails. All these differences end up being related to the very definition of the background which is ambiguous when a classical trajectory does not exist.",
      "pdf_url": "https://arxiv.org/pdf/2511.21388.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.17680",
      "title": "Time-reversed Stochastic Inflation",
      "authors": [
        "Baptiste Blachier",
        "Christophe Ringeval"
      ],
      "abstract": "Time-reversed Stochastic Inflation Baptiste Blachier, Christophe Ringeval 34 pages, 7 figures, uses jcappub. Discussions added, matches published version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Cosmic inflation may exhibit stochastic periods during which quantum fluctuations dominate over the semi-classical evolution. Extracting observables in these regimes is a notoriously difficult program as quantum randomness makes them fully probabilistic. However, among all the possible quantum histories, the ones which are relevant for Cosmology are conditioned by the requirement that stochastic inflation ended. From an observational point of view, it would be more convenient to model stochastic periods as starting from the time at which they ended and evolving backwards in times. We present a time-reversed approach to stochastic inflation, based on a reverse Fokker-Planck equation, which allows us to derive non-perturbatively the probability distribution of the field values at a given time before the end of the quantum regime. As a motivated example, we solve the flat semi-infinite potential and derive a new and exact formula for the probability distribution of the quantum-generated curvature fluctuations. It is normalisable while exhibiting tails slowly decaying as a Levy distribution. Our reverse-time stochastic formalism could be applied to any inflationary potentials and quantum diffusion eras, including the ones that can lead to the formation of primordial black holes.",
      "pdf_url": "https://arxiv.org/pdf/2504.17680.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.13811",
      "title": "Testing the cosmic distance duality relation with baryon acoustic oscillations and supernovae data",
      "authors": [
        "Tian-Nuo Li",
        "Guo-Hong Du",
        "Peng-Ju Wu",
        "Jing-Zhao Qi",
        "Jing-Fei Zhang",
        "Xin Zhang"
      ],
      "abstract": "Testing the cosmic distance duality relation with baryon acoustic oscillations and supernovae data Tian-Nuo Li, Guo-Hong Du, Peng-Ju Wu, Jing-Zhao Qi, Jing-Fei Zhang, Xin Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) One of the most fundamental relationships in modern cosmology is the cosmic distance duality relation (CDDR), which describes the relationship between the angular diameter distance ($D_{\\rm A}$) and the luminosity distance ($D_{\\rm L}$), and is expressed as: $\\eta(z)=D_{\\rm L}(z)(1+z)^{-2}/D_{\\rm A}(z)=1$. In this work, we conduct a comprehensive test of the CDDR by combining baryon acoustic oscillation (BAO) data from the SDSS and DESI surveys with type Ia supernova (SN) data from PantheonPlus and DESY5. We utilize an artificial neural network approach to match the SN and BAO data at the same redshift. To explore potential violations of the CDDR, we consider three different parameterizations: (i) $\\eta(z)=1+\\eta_0z$; (ii) $\\eta(z)=1+\\eta_0z/(1+z)$; (iii) $\\eta(z)=1+\\eta_0\\ln(1+z)$. Our results indicate that the calibration of the SN absolute magnitude $M_{\\rm B}$ plays a crucial role in testing potential deviations from the CDDR, as there exists a significant negative correlation between $\\eta_0$ and $M_{\\rm B}$. For PantheonPlus analysis, when $M_{\\rm B}$ is treated as a free parameter, no evidence of CDDR violation is found. In contrast, fixing $M_{\\rm B}$ to the $M_{\\rm B}^{\\rm D20}$ prior with $-19.230\\pm0.040$ mag leads to a deviation at approximately the $2\\sigma$ level, while fixing $M_{\\rm B}$ to the $M_{\\rm B}^{\\rm B23}$ prior with $-19.396\\pm0.016$ mag remains in agreement with the CDDR. Furthermore, overall analyses based on the SDSS+DESY5 and DESI+DESY5 data consistently show no evidence of the deviation from the CDDR.",
      "pdf_url": "https://arxiv.org/pdf/2507.13811.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20761",
      "title": "Caustic crossings in giant arcs with extended dark matter objects",
      "authors": [
        "Djuna Croon",
        "Benedict Crossey",
        "Jose Maria Diego",
        "Bradley J. Kavanagh",
        "Jose Maria Palencia"
      ],
      "abstract": "Caustic crossings in giant arcs with extended dark matter objects Djuna Croon, Benedict Crossey, Jose Maria Diego, Bradley J. Kavanagh, Jose Maria Palencia Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph) Caustic-crossing stars observed in giant arcs behind galaxy clusters provide a powerful probe of dark matter substructure. While previous work has focused on point-like lenses such as primordial black holes, we extend this framework to extended dark objects (EDOs), including ultracompact minihalos formed from the collapse of primordial overdensities. We develop an analytic model of microlensing by EDOs embedded in a macrolensing cluster potential and derive the resulting caustics and light curves. Depending on the EDO size relative to the effective Einstein radius, we show that they may generate additional narrow caustics, leading to novel features in the light curve. Applying our framework to the MACS J1149 LS1 ``Icarus'' event, we constrain EDOs with radii up to $10^7 R_\\odot$. Our results demonstrate that caustic-crossing events complement galactic microlensing searches, as they can probe EDOs with larger physical size. We discuss the implications for current and future observations, which promise to deliver a statistical sample of caustic transients and correspondingly sharper constraints on dark objects.",
      "pdf_url": "https://arxiv.org/pdf/2511.20761.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20856",
      "title": "Euclid preparation. Controlling angular systematics in the Euclid spectroscopic galaxy sample",
      "authors": [
        "Euclid Collaboration: P. Monaco",
        "M. Y. Elkhashab",
        "B. R. Granett",
        "J. Salvalaggio",
        "E. Sefusatti",
        "C. Scarlata",
        "B. Zabelle",
        "M. Bethermin",
        "S. Bruton",
        "C. Carbone",
        "S. de la Torre",
        "S. Dusini",
        "A. Eggemeier",
        "L. Guzzo",
        "G. Lavaux",
        "S. Lee",
        "K. Markovic",
        "K. S. McCarthy",
        "M. Moresco",
        "F. Passalacqua",
        "W. J. Percival",
        "I. Risso",
        "A. G. Sánchez",
        "D. Scott",
        "C. Sirignano",
        "Y. Wang",
        "B. Altieri",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "V. F. Cardone",
        "J. Carretero",
        "S. Casas",
        "F. J. Castander",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H. M. Courtois",
        "H. Degaudenzi",
        "G. De Lucia",
        "H. Dole",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "S. Ferriol",
        "N. Fourmanoit",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "W. Gillard",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "S. V. H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "B. Kubik",
        "M. Kümmel",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti",
        "D. Maino",
        "E. Maiorano",
        "O. Mansutti"
      ],
      "abstract": "Euclid preparation. Controlling angular systematics in the Euclid spectroscopic galaxy sample Euclid Collaboration: P. Monaco (1 and 2 and 3 and 4 and 5), M. Y. Elkhashab (2 and 3 and 1 and 4), B. R. Granett (6), J. Salvalaggio (2 and 4 and 1 and 3), E. Sefusatti (2 and 4 and 3), C. Scarlata (7), B. Zabelle (7), M. Bethermin (8), S. Bruton (9), C. Carbone (10), S. de la Torre (11), S. Dusini (12), A. Eggemeier (13), L. Guzzo (14 and 6 and 15), G. Lavaux (16), S. Lee (17), K. Markovic (17), K. S. McCarthy (17 and 18), M. Moresco (19 and 20), F. Passalacqua (21 and 12), W. J. Percival (22 and 23 and 24), I. Risso (6 and 25), A. G. Sánchez (26), D. Scott (27), C. Sirignano (21 and 12), Y. Wang (28), B. Altieri (29), S. Andreon (6), N. Auricchio (20), C. Baccigalupi (4 and 2 and 3 and 30), M. Baldi (31 and 20 and 32), S. Bardelli (20), A. Biviano (2 and 4), E. Branchini (33 and 25 and 6), M. Brescia (34 and 35), J. Brinchmann (36 and 37 and 38), S. Camera (39 and 40 and 41), G. Cañas-Herrera (42 and 43), V. Capobianco (41), V. F. Cardone (44 and 45), J. Carretero (46 and 47), S. Casas (48 and 49), F. J. Castander (50 and 51), M. Castellano (44), G. Castignani (20), S. Cavuoti (35 and 52), A. Cimatti (53), C. Colodro-Conde (54), G. Congedo (55), C. J. Conselice (56), L. Conversi (57 and 29), Y. Copin (58), F. Courbin (59 and 60 and 61), H. M. Courtois (62), H. Degaudenzi (63), G. De Lucia (2), H. Dole (64), F. Dubath (63), C. A. J. Duncan (55), X. Dupac (29), S. Escoffier (65), M. Farina (66), R. Farinelli (20), S. Ferriol (58), N. Fourmanoit (65), M. Frailis (2), E. Franceschi (20), M. Fumana (10), S. Galeotta (2), K. George (67), W. Gillard (65), B. Gillis (55), C. Giocoli (20 and 32), J. Gracia-Carpio (26), A. Grazian (68), F. Grupp (26 and 69), S. V. H. Haugan (70), W. Holmes (17), F. Hormuth (71), A. Hornstrup (72 and 73), K. Jahnke (74), M. Jhabvala (75), B. Joachimi (76), E. Keihänen (77), S. Kermiche (65), A. Kiessling (17), B. Kubik (58), M. Kümmel (69), M. Kunz (78), H. Kurki-Suonio (79 and 80), A. M. C. Le Brun (81), S. Ligori (41), P. B. Lilje (70), V. Lindholm (79 and 80), I. Lloro (82), G. Mainetti (83), D. Maino (14 and 10 and 15), E. Maiorano (20), O. Mansutti submitted to A&A; 34 pages, 18 figures, 4 appendices Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the strategy to identify and mitigate potential sources of angular systematics in the Euclid spectroscopic galaxy survey, and we quantify their impact on galaxy clustering measurements and cosmological parameter estimation. We first survey the Euclid processing pipeline to identify all evident, potential sources of systematics, and classify them into two broad classes: angular systematics, which modulate the galaxy number density across the sky, and catastrophic redshift errors, which lead to interlopers in the galaxy sample. We then use simulated spectroscopic surveys to test our ability to mitigate angular systematics by constructing a random catalogue that represents the visibility mask of the survey; this is a dense set of intrinsically unclustered objects, subject to the same selection effects as the data catalogue. The construction of this random catalogue relies on a detection model, which gives the probability of reliably measuring the galaxy redshift as a function of the signal-to-noise ratio (S/N) of its emission lines. We demonstrate that, in the ideal case of a perfect knowledge of the visibility mask, the galaxy power spectrum in the presence of systematics is recovered, to within sub-percent accuracy, by convolving a theory power spectrum with a window function obtained from the random catalogue itself. In the case of only approximate knowledge of the visibility mask, we test the stability of power spectrum measurements and cosmological parameter posteriors by using perturbed versions of the random catalogue. We find that significant effects are limited to very large scales, and parameter estimation remains robust, with the most impacting effects being connected to the calibration of the detection model.",
      "pdf_url": "https://arxiv.org/pdf/2511.20856.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21134",
      "title": "Testing Bump in the Cosmological Power Spectrum Using Dwarf Galaxies",
      "authors": [
        "Maxim Zabelkin",
        "Sergey Drozdov",
        "Oleg Skorikov",
        "Sergey Pilipenko"
      ],
      "abstract": "Testing Bump in the Cosmological Power Spectrum Using Dwarf Galaxies Maxim Zabelkin, Sergey Drozdov, Oleg Skorikov, Sergey Pilipenko Cosmology and Nongalactic Astrophysics (astro-ph.CO) We analyze the possibility of using observational data on nearby dwarf galaxies -- their luminosity functions and spatial distributions -- to constrain deviations of the cosmological power spectrum from the standard one. Specifically, we consider a cosmological model with a \"bump\" in the power spectrum at a wavelength of 1.3~Mpc and a dimensionless amplitude $\\mathcal{A}=2.0$. Such a spectrum is motivated by observations of an excess number of galaxies at high redshifts. The bump leads to a noticeable increase in the luminosity function in the range $-13 > M_B > -17$ at $z=0$. Comparison with observations constrains the bump amplitude to $\\mathcal{A} < 0.25$ at a 3-sigma significance level for a wavelength of 1.3~Mpc. For wavelengths smaller than 0.8~Mpc, the bump manifests only in the luminosity function of dwarfs with $M_B > -14$.",
      "pdf_url": "https://arxiv.org/pdf/2511.21134.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21179",
      "title": "Constraints on Features in the Cosmological Power Spectrum from Observations of the Epoch of Reionization",
      "authors": [
        "O.R. Skorikov",
        "S.V. Pilipenko",
        "M.V. Tkachev"
      ],
      "abstract": "Constraints on Features in the Cosmological Power Spectrum from Observations of the Epoch of Reionization O.R. Skorikov, S.V. Pilipenko, M.V. Tkachev Cosmology and Nongalactic Astrophysics (astro-ph.CO) We consider cosmological models with a power spectrum of perturbations featuring an enhanced amplitude on dwarf galaxy scales (with a \"bump\" or a \"tilt\"). Early formation of a large number of galaxies in such models, compared to the standard spectrum, can shift the epoch of reionization to higher redshifts compared to observations. We show that for moderate bump amplitude $\\mathcal{A}<1.5-2$, the considered models are not ruled out by observations of reionization at $z \\approx 8$ due to existing uncertainties in the fraction of ultraviolet photons escaping galaxies, $f_{esc}$, and inhomogeneity of the neutral hydrogen distribution.",
      "pdf_url": "https://arxiv.org/pdf/2511.21179.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21289",
      "title": "First Results from HERA Phase II",
      "authors": [
        "The HERA Collaboration: Zuhra Abdurashidova",
        "Tyrone Adams",
        "James E. Aguirre",
        "Rushelle Baartman",
        "Rennan Barkana",
        "Lindsay M. Berkhout",
        "Gianni Bernardi",
        "Tashalee S. Billings",
        "Bruno B. Bizarria",
        "Judd D. Bowman",
        "Daniela Breitman",
        "Philip Bull",
        "Jacob Burba",
        "Ruby Byrne",
        "Steven Carey",
        "Rajorshi Sushovan Chandra",
        "Kai-Feng Chen",
        "Samir Choudhuri",
        "Tyler Cox",
        "David R. DeBoer",
        "Eloy de Lera Acedo",
        "Matt Dexter",
        "Jiten Dhandha",
        "Joshua S. Dillon",
        "Scott Dynes",
        "Nico Eksteen",
        "John Ely",
        "Aaron Ewall-Wice",
        "Nicolas Fagnoni",
        "Anastasia Fialkov",
        "Steven R. Furlanetto",
        "Kingsley Gale-Sides",
        "Hugh Garsden",
        "Adelie Gorce",
        "Deepthi Gorthi",
        "Ziyaad Halday",
        "Bryna J. Hazelton",
        "Jacqueline N. Hewitt",
        "Jack Hickish",
        "Tian Huang",
        "Daniel C. Jacobs",
        "Alec Josaitis",
        "Nicholas S. Kern",
        "Joshua Kerrigan",
        "Piyanat Kittiwisit",
        "Matthew Kolopanis",
        "Adam Lanman",
        "Paul La Plante",
        "Adrian Liu",
        "Yin-Zhe Ma",
        "David H. E. MacMahon",
        "Lourence Malan",
        "Cresshim Malgas",
        "Keith Malgas",
        "Bradley Marero",
        "Zachary E. Martinot",
        "Lisa McBride",
        "Andrei Mesinger",
        "Jordan Mirocha",
        "Nicel Mohamed-Hinds",
        "Mathakane Molewa",
        "Miguel F. Morales",
        "Julian B. Muñoz",
        "Steven G. Murray",
        "Bojan Nikolic",
        "Hans Nuwegeld",
        "Aaron R. Parsons",
        "Robert Pascua",
        "Nipanjana Patra",
        "Simon Pochinda",
        "Yuxiang Qin",
        "Eleanor Rath",
        "Nima Razavi-Ghods",
        "Daniel Riley",
        "Kathryn Rosie",
        "Mario G. Santos",
        "Saurabh Singh",
        "Dara Storer",
        "Hilton Swarts",
        "Jianrong Tan",
        "Emilie Thélie",
        "Pieter van Wyngaarden",
        "Michael J. Wilensky",
        "Peter K. G. Williams",
        "Haoxuan Zheng"
      ],
      "abstract": "First Results from HERA Phase II The HERA Collaboration: Zuhra Abdurashidova, Tyrone Adams, James E. Aguirre, Rushelle Baartman, Rennan Barkana, Lindsay M. Berkhout, Gianni Bernardi, Tashalee S. Billings, Bruno B. Bizarria, Judd D. Bowman, Daniela Breitman, Philip Bull, Jacob Burba, Ruby Byrne, Steven Carey, Rajorshi Sushovan Chandra, Kai-Feng Chen, Samir Choudhuri, Tyler Cox, David R. DeBoer, Eloy de Lera Acedo, Matt Dexter, Jiten Dhandha, Joshua S. Dillon, Scott Dynes, Nico Eksteen, John Ely, Aaron Ewall-Wice, Nicolas Fagnoni, Anastasia Fialkov, Steven R. Furlanetto, Kingsley Gale-Sides, Hugh Garsden, Adelie Gorce, Deepthi Gorthi, Ziyaad Halday, Bryna J. Hazelton, Jacqueline N. Hewitt, Jack Hickish, Tian Huang, Daniel C. Jacobs, Alec Josaitis, Nicholas S. Kern, Joshua Kerrigan, Piyanat Kittiwisit, Matthew Kolopanis, Adam Lanman, Paul La Plante, Adrian Liu, Yin-Zhe Ma, David H. E. MacMahon, Lourence Malan, Cresshim Malgas, Keith Malgas, Bradley Marero, Zachary E. Martinot, Lisa McBride, Andrei Mesinger, Jordan Mirocha, Nicel Mohamed-Hinds, Mathakane Molewa, Miguel F. Morales, Julian B. Muñoz, Steven G. Murray, Bojan Nikolic, Hans Nuwegeld, Aaron R. Parsons, Robert Pascua, Nipanjana Patra, Simon Pochinda, Yuxiang Qin, Eleanor Rath, Nima Razavi-Ghods, Daniel Riley, Kathryn Rosie, Mario G. Santos, Saurabh Singh, Dara Storer, Hilton Swarts, Jianrong Tan, Emilie Thélie, Pieter van Wyngaarden, Michael J. Wilensky, Peter K. G. Williams, Haoxuan Zheng 61 pages, 18 figures, submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We report the first upper limits on the power spectrum of 21-cm fluctuations during the Epoch of Reionization and Cosmic Dawn from Phase II of the Hydrogen Epoch of Reionization Array (HERA) experiment. HERA Phase II constitutes several significant improvements in the signal chain compared to Phase I, most notably resulting in expanded frequency bandwidth, from 50-250 MHz. In these first upper limits, we investigate a small two-week subset of the available Phase II observations, with a focus on identifying new systematic characteristics of the instrument, and establishing an analysis pipeline to account for them. We report 2$\\sigma$ upper limits in eight spectral bands, spanning $5.6 \\leq z \\leq 24.4$ that are consistent with thermal noise at the $2\\sigma$ level for $k \\gtrsim 0.6-0.9 h{\\rm Mpc}^{-1}$ (band dependent). Our tightest limit during Cosmic Dawn ($z>12$) is $1.13\\times 10^6 {\\rm mK}^2$ at ($k=0.55 h{\\rm Mpc}^{-1}, z=16.78$), and during the EoR ($5.5<z<12$) it is $1.78\\times 10^3 {\\rm mK}^2$ at ($k=0.70 h{\\rm Mpc}^{-1}, z=7.05$). We find that mutual coupling has become our dominant systematic, leaking foreground power that strongly contaminates the low-$k$ modes, resulting in the loss of modes from $k=0.35-0.55$ compared to Phase I data.",
      "pdf_url": "https://arxiv.org/pdf/2511.21289.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21468",
      "title": "Testing modified gravity with 3x2pt analyses in galaxy mocks",
      "authors": [
        "Marc Alemany-Gotor",
        "Cristian Viglione",
        "Pablo Fosalba",
        "Isaac Tutusaus"
      ],
      "abstract": "Testing modified gravity with 3x2pt analyses in galaxy mocks Marc Alemany-Gotor, Cristian Viglione, Pablo Fosalba, Isaac Tutusaus Cosmology and Nongalactic Astrophysics (astro-ph.CO) Stage-IV surveys will enable unprecedented tests of gravity on cosmological scales. However, assuming General Relativity in the analysis of large-scale structure could introduce systematic biases if gravity deviates from GR at these scales. Modified gravity theories, such as the Hu-Sawicki formulation of $f(R)$ gravity, offer an alternative explanation for cosmic acceleration without invoking a cosmological constant, while remaining consistent with Solar System tests through screening mechanisms. In this work, we quantify the cosmological parameter biases that arise when using a combination of galaxy clustering and weak-lensing data-vectors, the so-called 3x2pt analysis, from an $f(R)$ galaxy mock under the incorrect assumption of GR, using for the first time high-fidelity full-sky galaxy mock catalogues. We employ a pair of twin simulations: one with GR and one with Hu--Sawicki $f(R)$ gravity with $|f_{R0}| = 10^{-5}$. The mocks are built using an HOD method to populate the dark matter haloes with galaxies, calibrated against SDSS observations at low redshift. Using conservative scale cuts to minimise modelling uncertainties, we perform 3x2pt analyses and infer cosmological parameters through nested sampling, validating our pipeline with the GR mock. Our results show that when analysing the $f(R)$ galaxy mock assuming GR, the recovered cosmological parameters are very significantly biased, even when considering conservative scale cuts: the Figure of Bias reaches $\\sim12\\sigma$ for both $\\{\\Omega_{\\rm m}, \\sigma_8\\}$ and $S_8$. These biases persist even when marginalising over the galaxy bias and baryonic feedback, demonstrating that nuisance parameters cannot absorb the effects of modified gravity. We conclude that incorrectly assuming GR in a universe governed by $f(R)$ gravity leads to severe and detectable biases in cosmological inference for Stage-IV surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.21468.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21585",
      "title": "Large-Scale Galaxy Correlations from the DESI First Data Release",
      "authors": [
        "Francesco Sylos Labini",
        "Tibor Antal"
      ],
      "abstract": "Large-Scale Galaxy Correlations from the DESI First Data Release Francesco Sylos Labini, Tibor Antal Cosmology and Nongalactic Astrophysics (astro-ph.CO) We quantify galaxy correlations using two distinct three-dimensional samples from the first data release of the Dark Energy Spectroscopic Instrument (DESI): the Bright Galaxy Sample (BGS) and the Luminous Red Galaxy Sample (LRGS). Specifically, we measure the conditional average density, defined as the average density of galaxies observed around a typical galaxy in the sample. To minimize boundary effects, we adopt a conservative criterion: only galaxies for which a spherical volume of radius $r$, centered on them, is fully contained within the survey footprint are included in the computation. For the BGS, we construct four volume-limited subsamples in order to eliminate biases arising from luminosity-dependent selection effects. By contrast, the LRGS is approximately volume-limited by design. The resulting samples span different depths, providing an opportunity to test the stability of statistical measurements across survey volumes of increasing size. Our results show that the conditional average density follows a power-law decay, $\\langle n(r) \\rangle \\propto r^{-0.8}$, without exhibiting any transition to homogeneity within the survey volume. The large statistics of the DESI samples also allow us to demonstrate that finite-size effects become significant as $r$ approaches the boundaries of the sample volumes. Consistently, we find that the distribution of density fluctuations follows a Gumbel distribution - characteristic of extreme-value statistics - rather than a Gaussian distribution, which would be expected for a spatially homogeneous field. These findings confirm and extend the trends previously observed in smaller redshift surveys, supporting the conclusion that the galaxy distribution does not undergo a transition to spatial homogeneity within the probed scales, up to $r \\sim 400$~\\text{Mpc}/$h$.",
      "pdf_url": "https://arxiv.org/pdf/2511.21585.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20746",
      "title": "Neural Deprojection of Galaxy Stellar Mass Profiles",
      "authors": [
        "M. J. Yantovski-Barth",
        "Hengyue Zhang",
        "Nolan Smyth",
        "Connor Stone",
        "Martin Bureau",
        "Yashar Hezaveh",
        "Laurence Perreault-Levasseur"
      ],
      "abstract": "Neural Deprojection of Galaxy Stellar Mass Profiles M. J. Yantovski-Barth, Hengyue Zhang, Nolan Smyth, Connor Stone, Martin Bureau, Yashar Hezaveh, Laurence Perreault-Levasseur 8 pages, 4 figures, accepted at the Machine Learning and the Physical Sciences Workshop, NeurIPS 2025 Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We introduce a neural approach to dynamical modeling of galaxies that replaces traditional imaging-based deprojections with a differentiable mapping. Specifically, we train a neural network to translate Nuker profile parameters into analytically deprojectable Multi Gaussian Expansion components, enabling physically realistic stellar mass models without requiring optical observations. We integrate this model into SuperMAGE, a differentiable dynamical modelling pipeline for Bayesian inference of supermassive black hole masses. Applied to ALMA data, our approach finds results consistent with state-of-the-art models while extending applicability to dust-obscured and active galaxies where optical data analysis is challenging.",
      "pdf_url": "https://arxiv.org/pdf/2511.20746.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20755",
      "title": "From Observations to Simulations: A Neural-Network Approach to Intracluster Medium Kinematics",
      "authors": [
        "E. Gatuzz",
        "J. ZuHone",
        "J. S. Sanders",
        "A. Fabian",
        "A. Liu",
        "C. Pinto",
        "S. Walker"
      ],
      "abstract": "From Observations to Simulations: A Neural-Network Approach to Intracluster Medium Kinematics E. Gatuzz, J. ZuHone, J. S. Sanders, A. Fabian, A. Liu, C. Pinto, S. Walker 9 pages, 5 figures, submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present a systematic comparison between {\\it XMM-Newton} velocity maps of the Virgo, Centaurus, Ophiuchus and A3266 clusters and synthetic velocity maps generated from the Illustris TNG-300 simulations. Our goal is to constrain the physical conditions and dynamical states of the intracluster medium (ICM) through a data-driven approach. We employ a Siamese Convolutional Neural Network (CNN) designed to identify the most analogous simulated cluster to each observed system based on the morphology of their line-of-sight velocity maps. The model learns a high-dimensional similarity metric between observations and simulations, allowing us to capture subtle kinematic and structural patterns beyond traditional statistical tests. We find that the best-matching simulated halos reproduce the observed large-scale velocity gradients and local kinematic substructures, suggesting that the ICM motions in these clusters arise from a combination of gas sloshing, AGN feedback, and minor merger activity. Our results demonstrate that deep learning provides a powerful and objective framework for connecting X-ray observations to cosmological simulations, offering new insights into the dynamical evolution of galaxy clusters and the mechanisms driving turbulence and bulk flows in the hot ICM.",
      "pdf_url": "https://arxiv.org/pdf/2511.20755.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20952",
      "title": "Oscillations of dark matter halos in galaxies",
      "authors": [
        "V. V. Flambaum",
        "I. B. Samsonov"
      ],
      "abstract": "Oscillations of dark matter halos in galaxies V. V. Flambaum, I. B. Samsonov 6 pages, 2 figures. An animated 3D figure is provided in ancillary files Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Baryonic matter and dark matter in galaxies represent two substances linked by the gravitational interaction. Collisions of galaxies may create an offset between the centers of mass of these two components. Ignoring internal dynamics of particles in the dark matter halo and Keplerian rotations of stars in the galaxy, we focus on possible relative oscillations of the visible matter in the dark matter halo. This two-fluid model is somewhat similar to the ``giant dipole resonances'' in nuclei. We estimate possible amplitude and frequency of such oscillations assuming that the offset of the centers of mass is small as compared with the size of the galaxy. Such oscillations, if exist, should manifest themselves in anomalies of velocities of stars in the galaxy, such as the density waves and runaway stars which have orbit periods in resonance with oscillations. These matter -- dark matter oscillations may affect direction and magnitude of the dark matter wind coming to Earth.",
      "pdf_url": "https://arxiv.org/pdf/2511.20952.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20999",
      "title": "Deep Extragalactic VIsible Legacy Survey (DEVILS): First Data Release Covering The D10 (COSMOS) Region",
      "authors": [
        "L. J. M. Davies",
        "M. Bravo",
        "R. H. W. Cook",
        "A. Hashemizadeh",
        "J. E. Thorne",
        "S. Bellstedt",
        "S. P. Driver",
        "A. S. G. Robotham",
        "S. Koushan",
        "N. Adams",
        "S. Huynh",
        "E. J. A. Mannering",
        "J. Tocknell",
        "M. J. I. Brown",
        "J. Bland-Hawthorn",
        "L. Cortese",
        "B. Catinella",
        "M. Meyer",
        "S. Phillipps",
        "M. Siudek",
        "C. Wolf"
      ],
      "abstract": "Deep Extragalactic VIsible Legacy Survey (DEVILS): First Data Release Covering The D10 (COSMOS) Region L. J. M. Davies, M. Bravo, R. H. W. Cook, A. Hashemizadeh, J. E. Thorne, S. Bellstedt, S. P. Driver, A. S. G. Robotham, S. Koushan, N. Adams, S. Huynh, E. J. A. Mannering, J. Tocknell, M. J. I. Brown, J. Bland-Hawthorn, L. Cortese, B. Catinella, M. Meyer, S. Phillipps, M. Siudek, C. Wolf Monthly Notices of the Royal Astronomical Society, Volume 544, Issue 4, December 2025, Pages 3005-3040 Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Deep Extragalactic VIsible Legacy Survey (DEVILS) is a deep, high-completeness multi-wavelength survey based around spectroscopic observations using the Anglo-Australian Telescope's AAOmega spectrograph. The survey covers $\\sim4.5$deg$^{2}$ over three extragalactic fields to Y$_{AB}<21.2$mag and probes sources at $0<z<1.2$, with a median redshift of $z=0.53$. Here we describe the DEVILS spectroscopic observations, data reduction and redshift analysis. We then describe and release to the community all DEVILS data in the 10h (D10, COSMOS) region including: i) catalogues of redshifts, photometry, SED fitting for physical properties, visual morphologies, structural decompositions and group environments/halo masses, ii) matched imaging in 28 bands from x-rays to radio continuum, and iii) reduced 1D spectra. All data are made publicly available through Data Central. Within D10 we obtain 5,442 new high-quality spectroscopic redshifts. When combined with existing, lower-quality, redshift information ($i.e.$ photometric redshifts) this is increased to 7,946. Of these, 3,122 have a spectroscopic redshift from another source (many that was not available at the time of the DEVILS observations). As such, DEVILS provides new unique high-quality spectroscopic redshifts for 4,824 faint sources in COSMOS. This increases the spectroscopic completeness at Y-mag$\\sim$21 from $\\sim$50% in other samples to $\\sim$90% in DEVILS. Finally, we show the power of this dataset by exploring the suppression of star formation in over-dense environments, split by morphology and stellar mass, and highlighting the ubiquitous nature of environmental quenching.",
      "pdf_url": "https://arxiv.org/pdf/2511.20999.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2403.16726",
      "title": "Enhancing Primordial B-mode Detection: Comprehensive Delensing Pipelines for Improved Sensitivity to $r$",
      "authors": [
        "Wen-Zheng Chen",
        "Yang Liu",
        "Siyu Li",
        "Bin Hu",
        "Hong Li"
      ],
      "abstract": "Enhancing Primordial B-mode Detection: Comprehensive Delensing Pipelines for Improved Sensitivity to $r$ Wen-Zheng Chen, Yang Liu, Siyu Li, Bin Hu, Hong Li 38 pages, 15 figures, 3 tables, published in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recognizing the impact of contamination from weak gravitational lensing B-modes induced by Large Scale Structure, we examine delensing methods to enhance sensitivity to the tensor-to-scalar ratio $r$ in primordial B-mode detection experiments. This study presents a realistic pipeline to improve $r$ constraints using foreground-cleaned maps with negligible residuals. The pipeline, based on simulations, is adaptable for future experiments. We focus on two delensing approaches: (1) subtracting the gradient-order lensing B-mode template, computed by convolving the E-mode with the lensing potential, from the observed B-mode signal; and (2) remapping observations using the estimated inverse deflection angle. For parameter constraints, we employ three models to reduce $r$ uncertainty and bias, finding consistent uncertainties across models, though biases vary due to the multipole-dependence of the delensing fraction. %We demonstrate the pipeline using simulated maps from future CMB polarization experiments, including a small-aperture (sub-1m) telescope, a large-aperture (6m) telescope, and a future space mission (3m). We demonstrated this pipeline using simulated observation maps from future CMB polarization experiments, which included current representative ground-based small aperture telescopes (sub-1m), next-generation ground-based large aperture telescopes (6m), and highly competitive future space-based medium aperture missions (3m). Results show a delensing efficiency of 40\\% with the small-aperture telescope alone, increasing to 65\\% when combined with the large-aperture telescope, and 80\\% with the satellite mission. These lead to reductions in $r$ uncertainty by 46\\% for ground-based and 63\\% for space missions. The most promising method adds the lensing template B-mode as an additional frequency channel, minimizing bias on $r$.",
      "pdf_url": "https://arxiv.org/pdf/2403.16726.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.18790",
      "title": "Delensing for Precision Cosmology: Optimizing Future CMB B-mode Surveys to Constrain r",
      "authors": [
        "Wen-Zheng Chen",
        "Yang Liu",
        "Yi-Ming Wang",
        "Hong Li"
      ],
      "abstract": "Delensing for Precision Cosmology: Optimizing Future CMB B-mode Surveys to Constrain r Wen-Zheng Chen, Yang Liu, Yi-Ming Wang, Hong Li 37 pages, 23 figures, 8 tables, published in EPJ C Cosmology and Nongalactic Astrophysics (astro-ph.CO) The detection of primordial B-modes, a key probe of cosmic inflation, is increasingly challenged by contamination from weak gravitational lensing B-modes induced by large-scale structure (LSS). We present a delensing pipeline designed to enhance the sensitivity to the inflationary parameter r, minimizing reliance on foreground mitigation during lensing reconstruction. Using simulations of Simons Observatory-like CMB observations and Euclid-like LSS surveys in the Northern hemisphere, we demonstrate that excluding low-l modes (l<200) effectively mitigates foreground biases, enabling robust lensing potential reconstruction using observed CMB polarization maps. We reconstruct the lensing potential with a minimum-variance (MV) quadratic estimator (QE) applied to CMB polarization data and combine this with external LSS tracers to improve delensing efficiency. Two complementary methods, the Gradient-order template and the Inverse-lensing approach, are used to generate lensing B-mode templates, which are cross-correlated with observed B-modes. This achieves a 40 percent reduction in the uncertainty of r with CMB-only reconstruction, improving to 60 percent when incorporating external LSS tracers. We validate our results using both the Hamimeche and Lewis likelihood and a Gaussian approximation, finding consistent constraints on r. Our work establishes a streamlined framework for ground-based CMB experiments, demonstrating that synergies with LSS surveys significantly enhance sensitivity to primordial gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2502.18790.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.16022",
      "title": "The Impact of $Ω_{m0}$ Prior Bias on Cosmological Parameter Estimation: Reconciling DESI DR2 BAO and Pantheon+ SNe Data Combination Results",
      "authors": [
        "Seokcheon Lee"
      ],
      "abstract": "The Impact of $Ω_{m0}$ Prior Bias on Cosmological Parameter Estimation: Reconciling DESI DR2 BAO and Pantheon+ SNe Data Combination Results Seokcheon Lee To match the published version in MNRAS. 6 pages, 3 figures Mon. Not. Roy. Ast. Soc. 544, 3388-3393 2025 Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recent cosmological parameter analyses combining DESI DR2 Baryon Acoustic Oscillation (BAO) data with external probes, such as Pantheon+ Supernovae (SNe) observations, have reported deviations of the dark energy equation-of-state parameters ($\\oo, \\oa$) from the standard $\\Lambda$CDM model predictions ($\\oo=-1, \\oa=0$). A notable aspect of these results is the role of $\\Omo$ prior information from SNe, which is known to exhibit tension with BAO-only constraints. In this study, we rigorously investigate this effect through a statistical analysis using 1000 mock DESI DR2 BAO data realizations. We demonstrate that the strong degeneracy between $\\oo$, $\\oa$, and $\\Omo$ causes significant biases in the estimated dark energy parameters when the $\\Omo$ prior mean deviates from its true underlying value. Specifically, applying an $\\Omo$ prior mean of 0.33 (consistent with some SNe-only constraints) to mock data, assuming a true $\\Lambda$CDM universe ($\\Omo=0.30, \\oo=-1, \\oa=0$), yields biased estimates such as $\\oo \\approx -0.82 \\pm 0.06$ and $\\oa \\approx -0.82 \\pm 0.4$. This systematic shift, driven by the $\\Omo$ prior, moves the estimated parameters towards the non-$\\Lambda$CDM region, offering a qualitative resemblance to outcomes reported in current combined DESI DR2 BAO + Pantheon+ SNe analyses (e.g., $\\oo = -0.888^{+0.055}_{-0.064}$, $\\oa = -0.17 \\pm 0.46$). Our findings suggest that these observed non-$\\Lambda$CDM parameters may largely arise from statistical biases due to $\\Omo$ prior tensions between datasets. This study proposes a potential resolution to current cosmological tensions without necessarily invoking new physics.",
      "pdf_url": "https://arxiv.org/pdf/2506.16022.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.00049",
      "title": "Segmenting proto-halos with vision transformers",
      "authors": [
        "Toka Alokda",
        "Cristiano Porciani"
      ],
      "abstract": "Segmenting proto-halos with vision transformers Toka Alokda, Cristiano Porciani 39 pages, 14 figures, 11 tables; updated to match the published version: JCAP11(2025)083 Cosmology and Nongalactic Astrophysics (astro-ph.CO) The formation of dark-matter halos from small cosmological perturbations generated in the early universe is a highly non-linear process typically modeled through N-body simulations. In this work, we explore the use of deep learning to segment and classify proto-halo regions in the initial density field according to their final halo mass at redshift z=0. We compare two architectures: a fully convolutional neural network (CNN) based on the V-Net design and a U-Net transformer. We find that the transformer-based network significantly outperforms the CNN across all metrics, achieving sub-percent error in the total segmented mass per halo class. Both networks deliver much higher accuracy than the perturbation-theory-based model \\textsc{pinocchio}, especially at low halo masses and in the detailed reconstruction of proto-halo boundaries. We also investigate the impact of different input features by training models on the density field, the tidal shear, and their combination. Finally, we use Grad-CAM to generate class-activation heatmaps for the CNN, providing preliminary yet suggestive insights into how the network exploits the input fields.",
      "pdf_url": "https://arxiv.org/pdf/2508.00049.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.08573",
      "title": "Reconstructing the local density field with combined convolutional and point cloud architecture",
      "authors": [
        "Baptiste Barthe-Gold",
        "Nhat-Minh Nguyen",
        "Leander Thiele"
      ],
      "abstract": "Reconstructing the local density field with combined convolutional and point cloud architecture Baptiste Barthe-Gold, Nhat-Minh Nguyen, Leander Thiele 6 pages, 4 figures, 1 table. Accepted at the NeurIPS 2025 Workshop: ML4PS. Comments welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG); Machine Learning (stat.ML) We construct a neural network to perform regression on the local dark-matter density field given line-of-sight peculiar velocities of dark-matter halos, biased tracers of the dark matter field. Our architecture combines a convolutional U-Net with a point-cloud DeepSets. This combination enables efficient use of small-scale information and improves reconstruction quality relative to a U-Net-only approach. Specifically, our hybrid network recovers both clustering amplitudes and phases better than the U-Net on small scales.",
      "pdf_url": "https://arxiv.org/pdf/2510.08573.pdf",
      "categories": [
        "astro-ph.CO",
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.12488",
      "title": "The first AKRA mass map reconstruction from HSC Y1 data",
      "authors": [
        "Yuan Shi",
        "Pengjie Zhang",
        "Zhao Chen",
        "Jian Qin",
        "Li Cui",
        "Furen Deng",
        "Ji Yao"
      ],
      "abstract": "The first AKRA mass map reconstruction from HSC Y1 data Yuan Shi, Pengjie Zhang, Zhao Chen, Jian Qin, Li Cui, Furen Deng, Ji Yao 17 pages, 9 figures, to be submitted Cosmology and Nongalactic Astrophysics (astro-ph.CO) Weak lensing mass-mapping from shear catalogs faces systematic challenges from survey masks and spatially varying noise. To overcome these issues and reconstruct unbiased convergence $\\kappa$ maps, we have constructed the AKRA (Accurate Kappa Reconstruction Algorithm), a prior-free and maximum-likelihood based analytical method. It has been validated for mock shear catalogs with a variety of survey masks. In this work, we present the first real-data application of the AKRA on the Subaru Hyper Suprime-Cam Year 1 (HSC Y1) data. We first validate AKRA using mock shear catalogs from the \\texttt{Kun} simulation suite, with masks corresponding to the six HSC Y1 regions (\\texttt{GAMA09H}, \\texttt{GAMA15H}, \\texttt{HECTOMAP}, \\texttt{VVDS}, \\texttt{WIDE12H}, and \\texttt{XMMLSS}). The investigated statistics, including the lensing power spectrum, $\\langle \\kappa^2\\rangle$, $\\langle \\kappa^3\\rangle$, and the one-point probability distribution function of $\\kappa$, are all unbiased. We then apply AKRA to the HSC Y1 shear catalog and provide reconstructed $\\kappa$ maps ready for subsequent scientific analyses.",
      "pdf_url": "https://arxiv.org/pdf/2511.12488.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.16130",
      "title": "Creation of Viscous Dark Energy by the Hubble Flow: Comparison with SNe Ia Master Sample Binned Data",
      "authors": [
        "Iolanda Navone",
        "Maria Giovanna Dainotti",
        "Elisa Fazzari",
        "Giovanni Montani",
        "Naoto Maki",
        "Kazunori Kohri Maki"
      ],
      "abstract": "Creation of Viscous Dark Energy by the Hubble Flow: Comparison with SNe Ia Master Sample Binned Data Iolanda Navone, Maria Giovanna Dainotti, Elisa Fazzari, Giovanni Montani, Naoto Maki, Kazunori Kohri Maki Cosmology and Nongalactic Astrophysics (astro-ph.CO) We study a cosmological model featuring evolutionary dark energy, according to the idea that the creation of its constituents arises from the gravitational field of the expanding universe, whose non-equilibrium physics is described by a non-zero bulk viscosity coefficient. This physical scenario calls for two additional parameters with respect to the {\\Lambda}CDM model, one of which is the equation of state parameter of the created dark energy. The model is constrained by the requirement that its deceleration parameter coincides with the one predicted by the {\\Lambda}CDM model. Then, we construct the effective running Hubble constant, a theoretical function that corresponds to the ratio of the Hubble parameter in our model to the {\\Lambda}CDM expansion rate. The model's theoretical predictions for the effective running Hubble constant are compared with the binned data of the Supernovae Ia Master Sample. The comparison is performed by a MCMC procedure for each bin, with three parameters left free to vary, while the particle creation rate is taken from a grid of values, each of which is fixed in the given MCMC run. The most important result emerging from this analysis is that the created dark energy constituent corresponds to an equation of state parameter with phantom character. Only if particle creation is removed do the dark energy constituents acquire a quintessence character. No matter the intrinsic nature of the constituents, their effective z-dependent equation of state parameter is, both with and without considering particle creation, entirely of phantom nature across the considered redshift range.",
      "pdf_url": "https://arxiv.org/pdf/2511.16130.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.14510",
      "title": "AKRA 2.0: Accurate Kappa Reconstruction Algorithm for masked shear catalog",
      "authors": [
        "Yuan Shi",
        "Pengjie Zhang",
        "Furen Deng",
        "Shuren Zhou",
        "Hongbo Cai",
        "Ji Yao",
        "Zeyang Sun"
      ],
      "abstract": "AKRA 2.0: Accurate Kappa Reconstruction Algorithm for masked shear catalog Yuan Shi, Pengjie Zhang, Furen Deng, Shuren Zhou, Hongbo Cai, Ji Yao, Zeyang Sun 34 pages, 17 figures. The code is publicly available at this https URL Shi, Y., Zhang, P., Deng, F., Zhou, S., Cai, H., Yao, J., & Sun, Z. (2025). AKRA 2.0: Accurate Kappa Reconstruction Algorithm for masked shear catalog. JOURNAL OF COSMOLOGY AND ASTROPARTICLE PHYSICS, 2025, 038 Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmic shear surveys serve as a powerful tool for mapping the underlying matter density field, including non-visible dark matter. A key challenge in cosmic shear surveys is the accurate reconstruction of lensing convergence ($\\kappa$) maps from shear catalogs impacted by survey boundaries and masks, which seminal Kaiser-Squires (KS) method are not designed to handle. To overcome these limitations, we previously proposed the Accurate Kappa Reconstruction Algorithm (AKRA), a prior-free maximum likelihood map-making method. Initially designed for flat sky scenarios with periodic boundary conditions, AKRA has proven successful in recovering high-precision $\\kappa$ maps from masked shear catalogs. In this work, we upgrade AKRA to AKRA 2.0 by integrating the tools designed for spherical geometry. This upgrade employs spin-weighted spherical harmonic transforms to reconstruct the convergence field over the full sky. To optimize computational efficiency, we implement a scale-splitting strategy that segregates the analysis into two parts: large-scale analysis on the sphere (referred to as AKRA-sphere) and small-scale analysis on the flat sky (referred to as AKRA-flat); the results from both analyses are then combined to produce final reconstructed $\\kappa$ map. We tested AKRA 2.0 using simulated shear catalogs with various masks, demonstrating that the reconstructed $\\kappa$ map by AKRA 2.0 maintains high accuracy. For the reconstructed $\\kappa$ map in unmasked regions, the reconstructed convergence power spectrum $C_\\kappa^{\\rm{rec}}$ and the correlation coefficient with the true $\\kappa$ map $r_\\ell$ achieve accuracies of $(1-C_\\ell^{\\rm{rec}}/C_\\ell^{\\rm{true}}) \\lesssim 1\\%$ and $(1-r_\\ell) \\lesssim 1\\%$, respectively. Our algorithm is capable of straightforwardly handling further issues such as inhomogeneous shape measurement noise, which we will address in subsequent analysis.",
      "pdf_url": "https://arxiv.org/pdf/2411.14510.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.22600",
      "title": "Dust Budget Crisis in Little Red Dots",
      "authors": [
        "Kejian Chen",
        "Zhengrong Li",
        "Kohei Inayoshi",
        "Luis C. Ho"
      ],
      "abstract": "Dust Budget Crisis in Little Red Dots Kejian Chen, Zhengrong Li, Kohei Inayoshi, Luis C. Ho 12 pages, 7 figures; added analysis for stacked SEDs; published on ApJL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Little red dots (LRDs), a population of active galactic nuclei (AGNs) recently identified by JWST, are characterized by their compact morphology and red optical continuum emission, which is often interpreted as evidence for significant dust extinction of $A_V \\gtrsim 3$ mag. However, the dust-reddened AGN scenario is increasingly challenged by their faint near-to-far infrared emission and a potential \"dust budget crisis\" in cases when the host galaxy is either undetectably low-mass or absent. In this study, we re-evaluate the dust extinction level in LRDs by modeling the UV-to-infrared spectra for various extinction laws and a broad range of dusty distribution parameters. Comparing the predicted infrared fluxes with observational data from the JWST MIRI, Herschel, and ALMA, our analysis finds that the visual extinction is tightly and consistently constrained to $A_V \\lesssim 1.0-1.5$ mag for A2744-45924, RUBIES-BLAGN-1, and stacked SEDs from a large sample of LRDs under the SMC extinction law, with slightly weaker constraints for those with gray extinction in the UV range. The revised $A_V$ values yield radiative efficiencies of $\\sim 10\\%$ for the LRD population, easing the tension with the Sołtan argument for the bulk AGN population at lower redshifts. Moreover, this moderate extinction (or dust-free) scenario, with reprocessed emission spectra testable by future far-infrared observatories, provides a paradigm shift in understanding their natures, environments, and evolutionary pathways of massive black holes in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2505.22600.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.06301",
      "title": "Introducing NewCluster: the first half of the history of a high-resolution cluster simulation",
      "authors": [
        "San Han",
        "Sukyoung K. Yi",
        "Yohan Dubois",
        "Jinsu Rhee",
        "Seyoung Jeon",
        "J. K. Jang",
        "Gyeong-Hwan Byun",
        "Corentin Cadiou",
        "Juhan Kim",
        "Taysun Kimm",
        "Christophe Pichon"
      ],
      "abstract": "Introducing NewCluster: the first half of the history of a high-resolution cluster simulation San Han, Sukyoung K. Yi, Yohan Dubois, Jinsu Rhee, Seyoung Jeon, J. K. Jang, Gyeong-Hwan Byun, Corentin Cadiou, Juhan Kim, Taysun Kimm, Christophe Pichon 21 pages, 12 figures, accepted to A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We introduce NewCluster, a new high-resolution cluster simulation designed to serve as the massive halo counterpart of the modern cosmological galaxy evolution framework. The zoom-in simulation targets a volume of $4.1\\sigma$ overdensity region, which is expected to evolve into a galaxy cluster with a virial mass of $5 \\times 10^{14} M_\\odot$, comparable to that of the Virgo Cluster. The zoom-in volume extends out to 3.5 virial radii from the central halo. The novelties of NewCluster are found in its resolutions. Its stellar mass resolution of $2 \\times 10^{4} M_\\odot$ is effective for tracing the early assembly of massive galaxies as well as the formation of dwarf galaxies. The spatial resolution of 68 parsecs in the best-resolved regions in the adaptive-mesh-refinement approach is powerful to study the detailed kinematic structure of galaxies. The time interval between snapshots is also exceptionally short-15 Myr-which is ideal for monitoring changes in the physical properties of galaxies, particularly during their orbital motion within a larger halo. The simulation has up-to-date feedback schemes for supernovae and active galactic nuclei. The chemical evolution is calculated for ten elements, along with dust calculation that includes the formation, size change, and destruction. To overcome the limitations of the Eulerian approach used for gas dynamics in this study, we employ Monte Carlo-based tracer particles in NewCluster, enabling a wide range of scientific investigations.",
      "pdf_url": "https://arxiv.org/pdf/2507.06301.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.16707",
      "title": "Simulating realistic Lyman-$α$ emitting galaxies including the effect of radiative transfer",
      "authors": [
        "Hasti Khoraminezhad",
        "Shun Saito",
        "Max Gronke",
        "Chris Byrohl"
      ],
      "abstract": "Simulating realistic Lyman-$α$ emitting galaxies including the effect of radiative transfer Hasti Khoraminezhad, Shun Saito, Max Gronke, Chris Byrohl Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present an empirical yet physically motivated simulation of realistic Lyman-$\\alpha$ emitters (LAEs) at $z\\sim2-3$, crucial for ongoing and forthcoming cosmological LAE surveys. We combine an empirical $\\mathtt{UniverseMachine}$ galaxy-halo model with a simple spherical expanding shell model for the Lyman-$\\alpha$ radiative transfer, calibrating only three free parameters to simultaneously reproduce the observed Lyman-$\\alpha$ luminosity function and the angular clustering. Our LAE model is further supported by its consistency with other observables such as the Lyman-$\\alpha$ equivalent width distribution, the Lyman-$\\alpha$ escape fraction as a function of stellar mass and dust reddening, and the systemic velocity offsets. Our LAE model provides predictions for the halo occupation distributions for LAEs and relationship between Ly$\\alpha$ luminosity and halo mass, including the distribution of satellite LAEs. Our work provides a crucial first step towards creating a high-fidelity LAE synthetic catalog for the LAE cosmology surveys. We make our LAE catalog and spectra publicly available upon publication.",
      "pdf_url": "https://arxiv.org/pdf/2507.16707.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20682",
      "title": "High-energy radiation from the pulsar Equatorial Current Sheet",
      "authors": [
        "Ioannis Contopoulos",
        "Jerome Petri",
        "Ioannis Dimitropoulos"
      ],
      "abstract": "High-energy radiation from the pulsar Equatorial Current Sheet Ioannis Contopoulos, Jerome Petri, Ioannis Dimitropoulos 8 pages, 4 figures, submitted to Astronomy and Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) Pulsars emit beams of radiation that reveal the extreme physics of neutron star magnetospheres. Yet, their understanding remains incomplete. Recent global Particle-in-Cell (PIC) simulations have raised several questions that led us to question their validity and their extrapolation to realistic particle Lorentz factors, electric and magnetic fields. We want to generate realistic sky maps of high-energy radiation from first principles. We propose a novel method to study the Equatorial Current Sheet (ECS) where most of the particle acceleration and the high-energy radiation is expected to originate. We first determine its shape and external magnetic field with a steady-state ideal force-free solution. Then, we consider the extra electric and magnetic field components that develop when dissipation is considered. Finally, we study the particle acceleration and radiation that is due to these extra field components for realistic field and particle parameters. We generate realistic sky maps of high-energy radiation and compare them with those obtained via PIC simulations. These sky maps may also be closely reproduced using the ECS of the split-monopole solution beyond the light cylinder. The ECS is probably stabilized by the normal magnetic field component that is due to the global magnetospheric reconnection. Our method helps us better understand the origin of the pulsed high-energy radiation in the pulsar magnetosphere.",
      "pdf_url": "https://arxiv.org/pdf/2511.20682.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20767",
      "title": "The Effect of the Fast-Flavor Instability on Core-Collapse Supernova Models: II. Quasi-Equipartition and the Impact of Various Angular Reconstruction Methods",
      "authors": [
        "Tianshu Wang",
        "Adam Burrows"
      ],
      "abstract": "The Effect of the Fast-Flavor Instability on Core-Collapse Supernova Models: II. Quasi-Equipartition and the Impact of Various Angular Reconstruction Methods Tianshu Wang, Adam Burrows 19 pages, 13 figures. Submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) In this work, we explore in a consistent fashion the effects of fast flavor conversion (FFC) in 1D and 2D core-collapse supernova (CCSN) simulations. In addition, we investigate the impact of various angular reconstruction methods and compare the ``3-species'' and ``4-species'' neutrino transport schemes. We find that the FFC effects are insensitive to the different methods tested and that the FFC alters supernova hydrodynamics is only minor ways. We also present a ``quasi-equipartition'' approximation which can be used to estimate the FFC-altered neutrino properties by post-processing the neutrino signals extracted from no-oscillation CCSN simulations. The relative errors in neutrino number and energy luminosities of this phenomenological method are less than 2\\% for 1D models, and less than 10\\% for 2D models. This method provides a simple way to include the effects of FFC on neutrino signals without implementing a complex and expensive FFC scheme or redoing simulations.",
      "pdf_url": "https://arxiv.org/pdf/2511.20767.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20847",
      "title": "Is there a retrograde accretion disk around 4U 1626$-$67? Tracking torque reversals with a state-space model",
      "authors": [
        "Joseph O'Leary",
        "Andrew Melatos",
        "Tom Kimpson",
        "Dimitris M. Christodoulou",
        "Nicholas J. O'Neill",
        "Patrick M. Meyers",
        "Sayantan Bhattacharya",
        "Silas G.T. Laycock"
      ],
      "abstract": "Is there a retrograde accretion disk around 4U 1626$-$67? Tracking torque reversals with a state-space model Joseph O'Leary, Andrew Melatos, Tom Kimpson, Dimitris M. Christodoulou, Nicholas J. O'Neill, Patrick M. Meyers, Sayantan Bhattacharya, Silas G.T. Laycock 31 pages, 7 figures. Accepted for publication in The Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) X-ray timing studies of the persistent, Galactic, accretion-powered pulsar 4U 1626$-$67 reveal torque reversals, during which the pulse frequency $\\nu(t)$ alternates between multiyear episodes of secular acceleration and deceleration, separated by transitions lasting $\\lesssim 150 \\, \\rm{days}$. Here an unscented Kalman filter is applied to track the $\\nu(t)$ fluctuations observed in 22.7 years (3340 samples) of publicly available Compton Gamma-Ray Observatory and Fermi Gamma-Ray Space Telescope data to test the canonical picture of magnetocentrifugal accretion for consistency with prograde-prograde and retrograde-prograde accretion disk configurations on either side of the 2008 torque reversal. It is found that the retrograde-prograde model is preferred, with a log Bayes factor equal to 0.44 and maximum a posteriori log likelihood ratio equal to 2.5. The mass accretion rate $Q(t)$ and magnetocentrifugal fastness $\\omega(t)$ transition smoothly between episodes of deceleration and acceleration; $Q(t)$ shifts by $\\leq 0.34 \\, {\\rm dex}$ across the reversal, and one measures $\\omega(t) \\approx 0.25$ and $\\omega(t) \\approx 0.30$ during deceleration and acceleration, respectively. The angular acceleration $\\dot{\\Omega}(t)$ satisfies $-9 \\lesssim \\dot{\\Omega}(t)/(10^{-12} \\, \\rm{rad \\, s^{-2}}) \\lesssim -5$ and $2 \\lesssim \\dot{\\Omega}(t)/(10^{-12} \\, \\rm{rad \\, s^{-2}}) \\lesssim 9$ before and after the 2008 reversal, respectively, compared to $\\dot{\\Omega} \\approx -3.0 \\times 10^{-12} \\, \\rm{rad \\, s^{-2}}$ before reversal and $\\dot{\\Omega} \\approx 2.5 \\times 10^{-12} \\, \\rm{rad \\, s^{-2}}$ after reversal, as inferred from previous long-term X-ray timing and spectral analysis of 4U 1626$-$67.",
      "pdf_url": "https://arxiv.org/pdf/2511.20847.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20945",
      "title": "The Intermediate Mass Black Hole in Omega Centauri: Constraints on Accretion from JWST",
      "authors": [
        "Steven Chen",
        "Jeremy Hare",
        "Oleg Kargaltsev",
        "Hui Yang",
        "Denis Cioffi",
        "Maximilian Häberle",
        "Anil Seth"
      ],
      "abstract": "The Intermediate Mass Black Hole in Omega Centauri: Constraints on Accretion from JWST Steven Chen, Jeremy Hare, Oleg Kargaltsev, Hui Yang, Denis Cioffi, Maximilian Häberle, Anil Seth High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We analyze JWST observations of the central region of the globular cluster $\\omega$ Centauri (NGC 5139, $\\omega$ Cen hereafter), around the position of the candidate IMBH inferred by Haberle et al. (2024a) from the motion of fast-moving stars in multi-epoch HST observations. We performed PSF-fitting photometry for sources in NIRCam (F200W and F444W) and MIRI (F770W and F1500W) and constructed UV to IR SEDs for sources within the central region of the cluster by using HST photometry from oMEGACat (Haberle et al. 2024b). None of the SEDs of reliably measured sources within this region resembles the SEDs computed from models of Pesce et al. 2021 for IMBHs accreting from intracluster medium at low rates. Our JWST limits place constraints on combinations of IMBH mass and accretion efficiency, either due to the amount of material available to be accreted, or due to the fraction of accreting matter that actually falls into the IMBH. Our non-detection then does not contradict the mass range of the IMBH inferred from the fast moving stars. We discuss these constraints in the context of the model of Pesce et al. 2021. We find that JWST limits are more restrictive than the existing radio limits for IMBH masses $\\lesssim 20,000 M_{\\odot}$. It is also possible that the faint IMBH emission is dominated by the light of a nearby star. Tighter limits on accretion onto the candidate IMBH can be placed with deeper observations, a more precise localization of the IMBH, and better measurements of the local intracluster medium density and temperature at the center of the cluster.",
      "pdf_url": "https://arxiv.org/pdf/2511.20945.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21154",
      "title": "Impact of Cosmic Ray Distribution on the Growth and Saturation of Bell Instability",
      "authors": [
        "Saikat Das",
        "Siddhartha Gupta",
        "Prateek Sharma"
      ],
      "abstract": "Impact of Cosmic Ray Distribution on the Growth and Saturation of Bell Instability Saikat Das, Siddhartha Gupta, Prateek Sharma 15 pages, 11 figures, 3 tables; To be submitted; Comments are welcome! High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) Cosmic rays (CRs) streaming in weakly magnetized plasmas can drive large-amplitude magnetic fluctuations via nonresonant streaming instability (NRSI), or Bell instability. Using one-dimensional kinetic simulations, we investigate how mono-energetic and power-law CR momentum distributions influence the growth and saturation of NRSI. The linear growth is governed solely by the CR current and is largely insensitive to the CR distribution. However, the saturation depends strongly on the CR distribution and is achieved through CR isotropization, which quenches the driving current. Mono-energetic CRs effectively amplify the magnetic field and isotropize. For power-law distributions, the lowest-energy CRs dominate current relaxation and magnetic growth, while the highest-energy CRs remain weakly scattered, limiting their contribution to saturation. In the absence of low-energy CRs, high-energy particles amplify magnetic fields effectively and isotropize. We provide a modified saturation prescription accounting for these effects and propose a layered CR-confinement scenario upstream of astrophysical shocks, relevant to particle acceleration to high energies.",
      "pdf_url": "https://arxiv.org/pdf/2511.21154.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21182",
      "title": "Broad-band temporal and spectral study of TeV blazar TXS 0518+211",
      "authors": [
        "Avik Kumar Das",
        "Pankaj Kushwaha",
        "Veeresh Singh",
        "Goldy Ahuja",
        "Deekshya R. Sarkar"
      ],
      "abstract": "Broad-band temporal and spectral study of TeV blazar TXS 0518+211 Avik Kumar Das, Pankaj Kushwaha, Veeresh Singh, Goldy Ahuja, Deekshya R. Sarkar 20 pages, 8 figures, 4 tables. Submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present a long-term broad-band temporal and spectral study of a TeV BL Lac source TXS 0518+211 by analyzing nearly 16 years (MJD 54682 -- 60670) of simultaneous optical, UV and X-ray light curves from Swift-XRT/UVOT and gamma-ray light curves from Fermi-LAT. Based on the availability of simultaneous multi-wavelength data and considering flux level as the depiction of AGN-jet activity we identified 11 epochs (named as Epoch-A to Epoch-K) and investigated temporal as well as spectral variability during these epochs to understand the emission properties in this source. The fractional variability analysis reveals that, in all epochs, X-ray light curve exhibits relatively high degree of variability in compared to the optical, UV and gamma-ray light curves. The flux-flux plots among different bands, in general, show weak to moderate correlation with Spearman correlation coefficient ranging from 0.29 to 0.58. Notably, during Epoch-I, we detect a possible orphan flare exhibiting increase in the X-ray flux level ($\\sim$ 2.4 times of the total average flux) but with no corresponding counterpart seen in the optical, UV bands. In contrast, during Epoch-K, we detect a significant decrease in the X-ray flux but no corresponding decrease in optical, UV and gamma-ray bands. Overall, our study reveals several changes in the flux states and complex nature of jet dominated emission processes. In all the epochs, two-zone leptonic model provides a better description of the broad-band emission in this TeV BL Lac source.",
      "pdf_url": "https://arxiv.org/pdf/2511.21182.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21243",
      "title": "The Faintest, Extremely Variable X-ray Tidal Disruption Event from a Supermassive Black Hole Binary?",
      "authors": [
        "Mengqiu Huang",
        "Yongquan Xue",
        "Shuo Li",
        "Fukun Liu",
        "Shifu Zhu",
        "Jin-Hong Chen",
        "Rong-Feng Shen",
        "Yibo Wang",
        "Yi Yang",
        "Ning Jiang",
        "Franz Erik Bauer",
        "Cristian Vignali",
        "Fan Zou",
        "Jialai Wang",
        "Alexei V. Filippenko",
        "Bin Luo",
        "Chen Qin",
        "Jonathan Quirola-Vásquez",
        "Jun-Xian Wang",
        "Lulu Fan",
        "Mouyuan Sun",
        "Qingwen Wu",
        "Qingling Ni",
        "Thomas G. Brink",
        "Tinggui Wang",
        "Weikang Zheng",
        "Xinwen Shu",
        "Xuechen Zheng",
        "Xiaozhi Lin",
        "Xu Kong",
        "Yijun Wang",
        "Yibin Luo",
        "Zheyu Lin"
      ],
      "abstract": "The Faintest, Extremely Variable X-ray Tidal Disruption Event from a Supermassive Black Hole Binary? Mengqiu Huang, Yongquan Xue, Shuo Li, Fukun Liu, Shifu Zhu, Jin-Hong Chen, Rong-Feng Shen, Yibo Wang, Yi Yang, Ning Jiang, Franz Erik Bauer, Cristian Vignali, Fan Zou, Jialai Wang, Alexei V. Filippenko, Bin Luo, Chen Qin, Jonathan Quirola-Vásquez, Jun-Xian Wang, Lulu Fan, Mouyuan Sun, Qingwen Wu, Qingling Ni, Thomas G. Brink, Tinggui Wang, Weikang Zheng, Xinwen Shu, Xuechen Zheng, Xiaozhi Lin, Xu Kong, Yijun Wang, Yibin Luo, Zheyu Lin 31 pages, 6 figures, 1 table, accepted by The Innovation The Innovation 7(3), 101169 (2026) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Tidal disruption events (TDEs), which occur when stars enter the tidal radii of supermassive black holes (SMBHs) and are subsequently torn apart by their tidal forces, represent intriguing phenomena that stimulate growing research interest and pose an increasing number of puzzles in the era of time-domain astronomy. Here we report an unusual X-ray transient, XID 935, discovered in the 7 Ms Chandra Deep Field-South, the deepest X-ray survey ever. XID 935 experienced an overall X-ray dimming by a factor of more than 40 between 1999 and 2016. Not monotonically decreasing during this period, its X-ray luminosity increased by a factor $> 27$ within 2 months, from $L_{\\rm 0.5-7\\ keV}<10^{40.87}$ erg s$^{-1}$ (10 October 2014 -- 4 January 2015) to $L_{\\rm 0.5-7\\ keV}=10^{42.31\\pm 0.20}$ erg s$^{-1}$ (16 March 2015). The X-ray position of XID 935 is located at the center of its host galaxy with a spectroscopic redshift of 0.251, whose optical spectra do not display emission characteristics associated with an active galactic nucleus. The peak 0.5--2.0 keV flux is the faintest among all the X-ray-selected TDE candidates to date. Thanks to a total exposure of $\\sim 9.5$ Ms in the X-ray bands, we manage to secure relatively well-sampled, 20-year-long X-ray light curves of this deepest X-ray-selected TDE candidate. We find that a partial TDE model could not explain the main declining trend. An SMBH binary TDE model is in acceptable accordance with the light curves of XID 935; however, it fails to match short-timescale fluctuations exactly. Therefore, the exceptional observational features of XID 935 provide a key benchmark for refining quantitative TDE models and simulations.",
      "pdf_url": "https://arxiv.org/pdf/2511.21243.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21419",
      "title": "Probing the Nature of High-Redshift Long GRB 250114A and Its Magnetar Central Engine",
      "authors": [
        "Wen-Yuan Yu",
        "Hou-Jun Lü",
        "Xiao Tian",
        "Liang-Jun Chen",
        "En-Wei Liang"
      ],
      "abstract": "Probing the Nature of High-Redshift Long GRB 250114A and Its Magnetar Central Engine Wen-Yuan Yu, Hou-Jun Lü, Xiao Tian, Liang-Jun Chen, En-Wei Liang 16 pages, 7 figures, and 3 tables. Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) GRB 250114A is a long-duration gamma-ray burst (GRB) which triggered the Swift/BAT with a spectroscopic high-redshift at $z = 4.732$. The light curve of the prompt emission is composed of three distinct emission episodes, which are separated by quiescent gaps ranging from tens to hundreds of seconds. While the X-ray light curve exhibits the canonical X-ray emission which is composed of several power-law segments superposition of a giant X-ray flare. More interestingly, there is still significant X-ray emission during the quiescent time in the prompt emission, suggesting a continuously active central engine whose power fluctuates across the $\\gamma$-ray detectability threshold. In this paper, we propose a magnetar as the central engine of GRB 250114A by fitting the X-ray light curve, and infer a magnetic field strength $B_{\\rm p}=13.24^{+1.73}_{-5.84} \\, \\times10^{15}\\ \\mathrm{G}$ and an initial spin period $P_{0}=14.31^{+0.93}_{-3.16} \\, \\mathrm{ms}$ of magnetar, with a jet correction, fall within a reasonable range. Furthermore, we also compare the prompt emission, X-ray afterglow, $E_{\\mathrm p}$-$E_{\\gamma,\\mathrm{iso}}$, and $\\varepsilon-$distribution of GBR 250114A with those of other high-$z$ sample-GRBs, and find no significant statistical differences between them.",
      "pdf_url": "https://arxiv.org/pdf/2511.21419.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21463",
      "title": "Compton-induced $γ$-ray Cascade Emissions in Radio Galaxy NGC 1275",
      "authors": [
        "Mfuphi Ntshatsha",
        "Markus Böttcher",
        "Soebur Razzaque"
      ],
      "abstract": "Compton-induced $γ$-ray Cascade Emissions in Radio Galaxy NGC 1275 Mfuphi Ntshatsha, Markus Böttcher, Soebur Razzaque 7 pages, 5 figures, 1 table, conference High Energy Astrophysical Phenomena (astro-ph.HE) Among active galactic nuclei (AGNi), blazars are the brightest emitters of high-energy (HE, $E \\geq 100$ MeV) to very-high-energy (VHE, $E \\geq 100$ GeV) $\\gamma$-rays from their jets. Radio galaxies, being the misaligned parent population of the blazar class, were historically not detected at these frequencies. However, advances in experiments and observatories have led to their detection in the HE--VHE $\\gamma$-ray band. In this work, we leverage and refine a Monte-Carlo photon and electron-positron (e$^\\pm$) pair tracking code in the AGN environment of the radio galaxy NGC 1275. In the code, we consider the isotropic broad-line region (BLR) and anisotropic Shakura-Sunyaev (SS) accretion disk radiation fields, with mild magnetic fields in the AGN environment. We find that cascade $\\gamma$-rays from inverse-Compton scattering by relativistic e$^\\pm$ pairs of these external radiation fields can explain the Fermi Large Area Telescope's (LAT) and Major Atmospheric Cherenkov Experiment's observations from the radio galaxy NGC 1275. We present a set of plausible parameters obtained from the code by fitting the source's spectral energy distribution (SED) during flaring events reported during the period December 2022 to January 2023.",
      "pdf_url": "https://arxiv.org/pdf/2511.21463.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21501",
      "title": "The Feasibility of Using Fe XXIII Metastable Transitions as a Density Diagnostic for LMXB Disk Winds",
      "authors": [
        "D. L. Moutard",
        "L. R. Corrales",
        "R. Tomaru",
        "C. Done",
        "J. Neilsen",
        "E. Behar",
        "E. Costantini",
        "M. Díaz-Trigo",
        "S. Yamada"
      ],
      "abstract": "The Feasibility of Using Fe XXIII Metastable Transitions as a Density Diagnostic for LMXB Disk Winds D. L. Moutard, L. R. Corrales, R. Tomaru, C. Done, J. Neilsen, E. Behar, E. Costantini, M. Díaz-Trigo, S. Yamada Accepted for Publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Low mass X-ray binaries (LMXBs) occasionally show signs of outflowing material from the accretion disk. Studying these outflows can inform the understanding of the geometry of the systems, as well as the dynamics and energetics of accretion. One key variable for determining the location of these disk winds is the density of the outflowing material. In this paper we explore a density diagnostic based upon the absorption of ionizing photons by density-sensitive metastable states of Fe XXIII. This can yield a blue shifted complex of absorption features in the region of $6.61-6.64$ keV. We use the photoionization code {\\sc pion} to test how varying the ionizing spectrum affects the detectability and interpretation of these features. We base these ionizing spectral energy distributions on GX~13$+$1 to represent a bright thermally dominated spectrum; 4U 1735$-$44 representing a harder, fainter LMXB spectrum; and MAXI J1820$+$070 representing a black hole LMXB spectrum completely dominated by Comptonized emission. For each of these, we find that the regime where Fe XXIII can be used as a density diagnostic is with an ionization parameter $\\log{(\\xi/{\\rm erg~cm~s^{-1}})}\\sim2-3$ and an outflow density $\\log{(n_H/{\\rm cm^{-3})}}\\gtrsim14$. The typical range of ionization parameters for LMXBs indicates that this technique is more feasibly achieved with BH LMXBs than their NS counterparts.",
      "pdf_url": "https://arxiv.org/pdf/2511.21501.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21532",
      "title": "Simulations of high-energy neutrino emissions from blazars with the LeHa-Paris code",
      "authors": [
        "Francesco Carenini",
        "Matteo Cerruti"
      ],
      "abstract": "Simulations of high-energy neutrino emissions from blazars with the LeHa-Paris code Francesco Carenini, Matteo Cerruti Presented at the 39th International Cosmic Ray Conference (ICRC2025) High Energy Astrophysical Phenomena (astro-ph.HE) The identification of astrophysical sources responsible for high-energy cosmic neutrinos has long been a challenge. A significant milestone was achieved with the blazar TXS 0506+056, which was found to be in a flaring state of high gamma-ray emission and associated at the 3$\\sigma$ level with a 290 TeV neutrino detected by IceCube in September 2017. This discovery motivated deeper exploration of the theoretical link between photon and neutrino emissions. In this context, simulations of proton-photon interactions in blazars and radiative processes are conducted using advanced numerical codes to predict neutrino spectra. The LeHa-Paris code, previously applied to TXS 0506+056, enables the computation of both leptonic and hadronic components of blazar spectral energy distributions, facilitating exploration of a broad parameter space. In this work, starting from the case of PKS 2155-304, one of the brightest and most studied High-frequency-peaked BL Lacs (HBLs), known for its extreme variability and subject of multi-wavelength observational campaigns, a methodology has been developed to extend neutrino flux templates, optimized via LeHa-Paris, to the full class of HBLs. Afterwards, neutrino emission models for a subset of HBLs from the 3HSP catalogue are derived.",
      "pdf_url": "https://arxiv.org/pdf/2511.21532.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21567",
      "title": "Enhanced antineutrino emission from $β$ decay in core-collapse supernovae with self-consistent weak decay rates",
      "authors": [
        "T. Dasher",
        "A. Ravlić",
        "S. Lalit",
        "E. O'Connor",
        "K. Godbey"
      ],
      "abstract": "Enhanced antineutrino emission from $β$ decay in core-collapse supernovae with self-consistent weak decay rates T. Dasher, A. Ravlić, S. Lalit, E. O'Connor, K. Godbey 7 pages, 3 figures, includes Supplemental Material. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) Nuclear weak-interaction rates are known to exert a prominent effect in the late-stages of stellar collapse. Despite their importance, most studies to date on core-collapse supernovae (CCSNe) have focused primarily on the effects of electron captures, generally neglecting $\\beta$ decay contributions. In this Letter, we present the first CCSNe simulation incorporating global $\\beta$ decay rates from a microscopic theory. These are enabled by a large-scale evaluation of both electron capture and $\\beta$ decay rates, obtained self-consistently utilizing the relativistic energy density functional theory and finite-temperature quasiparticle random-phase approximation. We find a significant enhancement of antineutrino emissivity by more than 4 orders of magnitude due to the inclusion of $\\beta$ decay rates, as well as 3 orders of magnitude for antineutrino luminosity. It is expected that these new rates could help us constrain the model uncertainties related to weak-interaction processes, improving the prediction of antineutrino signal during the final stages of stellar death and potentially influencing the late-stage evolution of massive stars.",
      "pdf_url": "https://arxiv.org/pdf/2511.21567.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21627",
      "title": "Evidence For A Correlation Between Astrophysical Neutrinos and Radio Flares",
      "authors": [
        "Yjan A. Gordon",
        "Peter S. Ferguson",
        "Eric J. Hooper",
        "Michael N. Martinez"
      ],
      "abstract": "Evidence For A Correlation Between Astrophysical Neutrinos and Radio Flares Yjan A. Gordon, Peter S. Ferguson, Eric J. Hooper, Michael N. Martinez 11 pages, 7 figures, 3 tables. For submission to the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We use data from the first two epochs of the Very Large Array Sky Survey (VLASS) and the IceCube Neutrino Observatory to search for evidence of a correlation between radio variability and the detection of astrophysical neutrinos. We find an excess number of associations between flaring radio sources and neutrinos that were detected between the first and second VLASS observations at $>2\\sigma$ confidence. This excess is consistent with radio flares contributing $\\sim13\\,\\%$ of the astrophysical neutrinos observed by IceCube. Notably $>80\\,\\%$ of the radio flares associated with neutrinos are not detected at either $\\gamma$-ray or X-ray wavelengths, highlighting the importance of radio observations for identifying potential electromagnetic counterparts to astrophysical neutrinos. No excess in the number of associations between the wider radio-variable population and the IceCube neutrinos is seen when no time constraint is placed on the neutrino detection. We predict that data from future VLASS epochs will see an excess number of associations between radio flares and neutrinos at the $>3\\sigma$ level, and expected improvements to the positional constraints on the neutrinos may increase that confidence to $>5\\sigma$, should our results be representative.",
      "pdf_url": "https://arxiv.org/pdf/2511.21627.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2304.13630",
      "title": "Nonlinear Hall effect in the stationary cylinder with a radial heat flux",
      "authors": [
        "G. S. Bisnovatyi-Kogan",
        "M. V. Glushikhina"
      ],
      "abstract": "Nonlinear Hall effect in the stationary cylinder with a radial heat flux G. S. Bisnovatyi-Kogan, M. V. Glushikhina High Energy Astrophysical Phenomena (astro-ph.HE) A conducting cylinder with a uniform magnetic field along its axis and radial temperature gradient is considered at the stationary state. At large temperature gradients the azimuthal Hall electrical current creates the axial magnetic field which strength may be comparable with the original one. It is shown, that the magnetic field, generated by the azimuthal Hall current, leads to the decrease of magnetic field originated by external sources, and this suppression increases with increase of the electromotive force, connected with a thermodiffusion. Obtained results can help to investigate influence of the Hall current on the coupled magneto-thermal evolution of magnetic and electric fields in neutron stars, white dwarfs, and, possibly, in a laboratory facilities.",
      "pdf_url": "https://arxiv.org/pdf/2304.13630.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.03038",
      "title": "A Continuous Galactic Line Source of Axions: The Remarkable Case of 23Na",
      "authors": [
        "W. C. Haxton",
        "Xing Liu",
        "Annie McCutcheon",
        "Anupam Ray"
      ],
      "abstract": "A Continuous Galactic Line Source of Axions: The Remarkable Case of 23Na W. C. Haxton, Xing Liu, Annie McCutcheon, Anupam Ray 6 pages, 4 figures; updated to reflect the published version Phys. Rev. Lett. 135, 222701 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph); Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th) We argue that $^{23}$Na is a potentially significant source of galactic axions. For temperatures $\\gtrsim 7 \\times 10^8$K -- characteristic of carbon burning in the massive progenitors of supernovae and ONeMg white dwarfs -- the 440 keV first excited state of $^{23}$Na is thermally populated, with its repeated decays pumping stellar energy into escaping axions. Odd-A nuclear abundances are typically very low in high-temperature stellar environments (or absent entirely due to burn-up). $^{23}$Na is an exception: $\\approx 0.1 M_\\odot$ of the isotope is synthesized during carbon burning then maintained at $\\approx 10^9$K for times ranging up to $6 \\times 10^4$y. Using MESA simulations, a galactic model, and sampling over progenitor masses, locations, and evolutionary stages, we find a continuous flux at earth of $\\langle \\phi_a \\rangle \\approx 22$/cm$^2$s for $g^\\mathrm{eff}_{aNN} = 10^{-9}$. Some fraction of these axions convert to photons as they propagate through the galactic magnetic field, producing a distinctive 440 keV line $\\gamma$ ray detectable by all-sky detectors like the Compton Spectrometer and Imager (COSI). Assuming a 1$\\mu$G galactic magnetic field and a sufficiently light axion mass, we find that COSI will be able to probe $| g_{aNN}^\\mathrm{eff} g_{a \\gamma \\gamma} | \\gtrsim1.8 \\times 10^{-22}$ GeV$^{-1}$ at $3\\sigma$ after two years of surveying.",
      "pdf_url": "https://arxiv.org/pdf/2505.03038.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ex",
        "hep-ph",
        "nucl-ex",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.06766",
      "title": "Effects of Lorentz invariance violation on charged particles and photon production in astrophysical sources",
      "authors": [
        "Matheus Duarte",
        "Vitor de Souza"
      ],
      "abstract": "Effects of Lorentz invariance violation on charged particles and photon production in astrophysical sources Matheus Duarte, Vitor de Souza High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) We investigate the impact of Lorentz invariance violation (LIV) on radiation processes in astrophysical sources, focusing on synchrotron and inverse Compton interactions. We derive modified expressions for radiated power and photon energy under LIV assumptions and incorporate them into first-order Fermi acceleration models. Our analysis reveals energy thresholds beyond which LIV, within a kinematic framework, significantly alters particle dynamics and photon spectra, introducing non-physical divergences that highlight limitations in perturbative approaches. We model synchrotron self-Compton (SSC) emission in the presence of LIV and assess its consequences for photon fluxes from blazars, including Markarian 501 and the BL Lac population. LIV introduces distinct high-energy emission regions that deviate from standard expectations. Comparisons with observational data, particularly upper limits from the Pierre Auger Observatory, suggest that future multi-messenger observations, together with the full analysis of particle's trajectories, could constrain LIV parameters through the non-detection of such excesses.",
      "pdf_url": "https://arxiv.org/pdf/2507.06766.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.21867",
      "title": "Gamma rays as leptonic portals to energetic neutrinos: a new Monte Carlo approach",
      "authors": [
        "Gaetano Di Marco",
        "Rafael Alves Batista",
        "Miguel A. Sánchez-Conde"
      ],
      "abstract": "Gamma rays as leptonic portals to energetic neutrinos: a new Monte Carlo approach Gaetano Di Marco, Rafael Alves Batista, Miguel A. Sánchez-Conde 21 pages, 14 figures. Published in Astroparticle Physics Astroparticle Physics, Volume 175, February 2026, 103192 High Energy Astrophysical Phenomena (astro-ph.HE) High center-of-mass electromagnetic~(EM) interactions could produce decaying heavy leptons and hadrons, leading to neutrino generation. These processes might occur in the most extreme astrophysical scenarios, potentially altering the expected gamma-ray and neutrino fluxes in both the hadronic and the leptonic pictures. For instance, neutrinos could arise from high-redshift EM cascades, triggered by gamma rays beyond $10^{18} \\; \\text{eV}$ scattering background photons, from radio to ultraviolet energy bands. Such energetic gamma rays are predicted in cosmogenic models and in scenarios involving non-standard physics. On astrophysical scales, leptonic production of neutrinos could take place in active galactic nuclei cores, where several-TeV gamma rays interact with the X-ray photons from the hot corona. We explore these scenarios within the CRPropa Monte Carlo code framework, developing dedicated tools to account for leptonic production and decay of heavy leptons and hadrons. In particular, the latter are performed by interfacing with the PYTHIA event generator. With these novel tools, we characterise the spectrum and flavour composition of neutrinos emerging from cosmological EM cascades and from leptonic processes in the core of active galactic nuclei. Finally, we investigate the leptonic production of neutrinos in the context of the IceCube detection of NGC~1068.",
      "pdf_url": "https://arxiv.org/pdf/2507.21867.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.11186",
      "title": "Simulations of Tidal Disruption of Supernova in Galaxy Nuclear Region: A Novel Model for Ambiguous Nuclear Transients",
      "authors": [
        "Xiangli Lei",
        "Qingwen Wu",
        "Ya-Ping Li",
        "Wei-Hua Lei"
      ],
      "abstract": "Simulations of Tidal Disruption of Supernova in Galaxy Nuclear Region: A Novel Model for Ambiguous Nuclear Transients Xiangli Lei, Qingwen Wu, Ya-Ping Li, Wei-Hua Lei High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) An increasing number of ambiguous nuclear transients, including some extreme nuclear transients with very shallow light-curve declines and weak AGN activity in their host galaxies, have been reported. Stars form in or are captured by AGN disks will grow and migrate inward, potentially exploding as supernovae once the inner cold accretion disk disappears in low-luminosity AGNs. We propose that the tidal disruption of a supernova (TDS) by a supermassive black hole (SMBH) can produce nuclear transients that are more energetic and evolve more slowly than typical tidal disruption events (TDEs), without the black hole mass limit as in TDEs. In this scenario, the SMBH capture the supernova ejecta, which subsequently self-intersects and circularizes into an accretion disk. Based on hydrodynamical simulations, we find that the accretion rate of the TDS disk exhibits a slow decline that can last for months to decades. The peak accretion rate of a typical core-collapse SN scenario can exceed the Eddington limit for SMBHs with $M_{\\rm BH} \\lesssim 10^{7.5}\\,M_\\odot$, while it remains sub-Eddington for more massive SMBHs. This model provides a mechanism for triggering an energetic TDE-like flare with luminosity \\(\\gtrsim10^{45}\\,\\mathrm{erg\\,s^{-1}}\\) in weak AGNs even with SMBH mass much larger than $10^{8}\\,M_\\odot$ or triggering turn-on changing-look AGNs.",
      "pdf_url": "https://arxiv.org/pdf/2509.11186.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.22914",
      "title": "Constraint on the Physical Origin of Gamma-Ray Burst Prompt Emission via Its Nondetected Diffuse Neutrino Emission",
      "authors": [
        "Yang-Dong-Jun Ou",
        "Hou-Jun Lü",
        "Jia-Ming Chen",
        "Ben-Yang Zhu",
        "En-Wei Liang"
      ],
      "abstract": "Constraint on the Physical Origin of Gamma-Ray Burst Prompt Emission via Its Nondetected Diffuse Neutrino Emission Yang-Dong-Jun Ou, Hou-Jun Lü, Jia-Ming Chen, Ben-Yang Zhu, En-Wei Liang 9 pages, 4 figures, and 2 tables, matched with the published verison High Energy Astrophysical Phenomena (astro-ph.HE) The physical origin of prompt emission in gamma-ray bursts (GRBs) remains an open question since it has been studied more than half a century. Three alternative models (i.e. dissipative photosphere, internal shock, and Internal-Collision-induced MAgnetic Reconnection and Turbulence, ICMART) have been proposed to interpret the observations of GRB prompt emission, but none of them can fully interpret all of the observational data collected so far. The question is what is the fraction of these three theoretical models in the prompt emission of GRBs. In this paper, we propose to utilize an innovative method and constrain the fraction of GRB prompt emission models via its nondetected diffuse neutrinos. By adopting two methods (e.g., summing up the individual GRB contributions and assumed luminosity functions of GRB) to calculate diffuse neutrino flux of GRBs for given the benchmark parameters of $\\Gamma=300$ and $\\varepsilon_{p} \\text{/} \\varepsilon_{e}=10$, both approaches indicate that most GRBs should be originated from the ICMART model. Moreover, we find that the fractions of the dissipative photosphere model, the internal shock model, and the ICMART model are constrained to be [0, $0.5\\%$], [0, $1.1\\%$], and [$98.9\\%$, 1], respectively, for the method of summing up the individual GRB contributions. For the method of luminosity functions, the fractions of above three models are constrained to be [0, $6.1\\%$], [0, $8.2\\%$], and [$91.8\\%$, 1], respectively. However, such fractions of different models are also dependent on the parameters of $\\Gamma$ and $\\varepsilon_{p} \\text{/} \\varepsilon_{e}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.22914.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20748",
      "title": "ALMA Lensing Cluster Survey: Molecular Gas Properties of Line-Emitting Galaxies from a Blind Survey",
      "authors": [
        "Kanako Narita",
        "Bunyo Hatsukade",
        "Seiji Fujimoto",
        "Jorge González-López",
        "Kotaro Kohno",
        "Francesco Valentino",
        "Ryosuke Uematsu",
        "Masamune Oguri",
        "Vasily Kokorev",
        "Daniel Espada",
        "Hideki Umehata",
        "Anton M. Koekemoer",
        "Jean Baptiste Jolly",
        "Fengwu Sun",
        "Karina Caputi",
        "Miroslava Dessauges-Zavadsky",
        "Neil Nagar",
        "Akiyoshi Tsujita",
        "Wei-Hao Wang"
      ],
      "abstract": "ALMA Lensing Cluster Survey: Molecular Gas Properties of Line-Emitting Galaxies from a Blind Survey Kanako Narita, Bunyo Hatsukade, Seiji Fujimoto, Jorge González-López, Kotaro Kohno, Francesco Valentino, Ryosuke Uematsu, Masamune Oguri, Vasily Kokorev, Daniel Espada, Hideki Umehata, Anton M. Koekemoer, Jean Baptiste Jolly, Fengwu Sun, Karina Caputi, Miroslava Dessauges-Zavadsky, Neil Nagar, Akiyoshi Tsujita, Wei-Hao Wang Accepted for publication in ApJ, 19 pages, 10 figures, 4 tables Astrophysics of Galaxies (astro-ph.GA) We present results of a blind search for line-emitting galaxies using ALMA Lensing Cluster Survey data. We detected seven line emitters, one of which is [C\\,{\\sc ii}] at $z = 6.071$, four are CO at $z = 0.8$--1.1, and the remaining two are possibly CO or [C\\,{\\sc i}] within photometric redshift ranges. Three of the four CO emitters are multiple images of the same galaxy. Compared to previous line-emitter searches in ALMA deep fields, our sample probes molecular gas masses $\\sim$1 dex below the lower bound, thanks to gravitational lensing (typically $\\mu \\sim 4$, up to $\\sim$30 in extreme cases). Most emitters are located in a region similar to normal star-forming galaxies in the star formation rate (SFR) versus molecular gas mass plane. To reduce dependence on SFR and stellar mass, we analyzed the molecular gas fraction and depletion timescale as a function of distance from the star-formation main sequence. We found that most emitters broadly follow the scaling relations from previous studies, consistent within the intrinsic scatter. In addition, we serendipitously detected the CH $N = 1$, $J = 3/2 \\rightarrow 1/2$ $\\Lambda$-doublet transition from one CO emitter at $z = 1.142$, representing the first detection of CH from an individual galaxy at cosmological distances through a blind survey. The CH/CO column density ratio of $\\sim$$10^{-4}$ is comparable to that of local AGN-host galaxies, suggesting that CH traces molecular gas associated with AGN activity, possibly irradiated by X-rays.",
      "pdf_url": "https://arxiv.org/pdf/2511.20748.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20751",
      "title": "ECOGAL I. Project design and the first catalogue",
      "authors": [
        "Minju M. Lee",
        "Georgios Magdis",
        "Gabriel Brammer",
        "Daizhong Liu",
        "Benjamin Magnelli",
        "Steven Gillman",
        "Bitten Gullberg",
        "Kei Ito",
        "Nikolaj Sillassen",
        "Francesco Valentino",
        "Rashmi Gottumukkala",
        "Chandana Hegde",
        "Thomas R. Greve"
      ],
      "abstract": "ECOGAL I. Project design and the first catalogue Minju M. Lee, Georgios Magdis, Gabriel Brammer, Daizhong Liu, Benjamin Magnelli, Steven Gillman, Bitten Gullberg, Kei Ito, Nikolaj Sillassen, Francesco Valentino, Rashmi Gottumukkala, Chandana Hegde, Thomas R. Greve 19 pages, 19 figures; Submitted to A&A; the latest data products are publicly available on the DAWN JWST Archive (DJA) with instructions to query this https URL and a query tool available on this https URL frozen catalogue versions are made on Zenodo this https URL Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present ECOology for Galaxies using ALMA archive and Legacy surveys (ECOGAL), an ALMA data mining project. Using the footprints of the James Webb Space Telescope (JWST) and the Hubble Space Telescope (HST), we query and uniformly reprocess ALMA data to produce continuum images and two complementary source catalogues: (i) a prior-based catalogue anchored to optical/near-infrared detections, and (ii) a blind catalogue based on significant ALMA detections. Detection thresholds are established through peak SNR statistics and analysis of inverted maps. In this paper, we focus on the ALMA-accessible CANDELS fields (COSMOS, GOODS-S, and UDS), covering ~130,000 optical/NIR-selected galaxies spanning $0.0 < z < 15.0$. We identify 1288 detections (622 unique) with optical/NIR counterparts across the two methods, of which 832 detections (395 unique) appear in both. Among the 622 unique sources, 307 have spectroscopic redshifts from $0.12 < z < 6.85$. ECOGAL expands the parameter space previously explored by $A^3COSMOS$ and $A^3GOODS-S$ by incorporating the UDS field and integrating publicly available JWST datasets from the DAWN JWST Archive (DJA). We also highlight several science cases enabled by ECOGAL, including the evolution of cosmic gas and dust masses, obscured star formation and optically dark systems. ECOGAL provides science-ready data sets for the community and showcases the power of combining over a decade of accumulated public data with other legacy datasets. The data product is made publicly available and accompanies a post demonstrating the usage of the catalogue on the DJA webpage.",
      "pdf_url": "https://arxiv.org/pdf/2511.20751.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20752",
      "title": "The galactic chemical evolution of carbon: Implications for stellar nucleosynthesis",
      "authors": [
        "Daniel A. Boyea",
        "James W. Johnson",
        "David H. Weinberg"
      ],
      "abstract": "The galactic chemical evolution of carbon: Implications for stellar nucleosynthesis Daniel A. Boyea, James W. Johnson, David H. Weinberg 18 pages, 11 figures, submitted to MNRAS, comments welcome Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Carbon (C) is thought to be produced by both core collapse supernovae (CCSN) and asymptotic giant branch (AGB) stars, but the relative contributions of these two sources are uncertain. We investigate the astrophysical origin of C using models of Galactic chemical evolution (GCE) appropriate for the Milky Way disk. We benchmark our results against APOGEE subgiant abundances. The trend between [C/Mg] and [Mg/H] is set by the total C yield as a function of metallicity. Observations indicate a gently rising [C/Mg] with [Mg/H], but AGB C production is predicted to decline with metallicity. Our sample therefore favours a scenario in which CCSN yields rise with metallicity to offset declining AGB C yields and drive a subtle increase in [C/Mg] with [Mg/H]. This result is consistent with massive star nucleosynthesis models incorporating rotation. The [C/Mg]-[Mg/Fe] trend is sensitive to delayed enrichment and therefore constrains the amount of AGB C production. Given the slope of this relation, we find that AGB stars likely account for 10-40 per cent of C at solar metallicity. Artificially shifting the AGB C yields towards lower mass stars with longer lifetimes also improves agreement with the observed [C/Mg]-[Mg/Fe] trend, possibly indicating a discrepancy with stellar evolution predictions or our assumed Fe production rate.",
      "pdf_url": "https://arxiv.org/pdf/2511.20752.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20775",
      "title": "Ashes of Creation: JWST Uncovers Silicate Dust in Massive Star Clusters",
      "authors": [
        "Daniel Maschmann",
        "Bradley C. Whitmore",
        "David A. Thilker",
        "Ivan Gerasimov",
        "Simon C. O. Glover",
        "B. T. Draine",
        "Bret Lehmer",
        "Varun Bajaj",
        "Sumit Sarbadhicary",
        "Médéric Boquien",
        "G. C. Sloan",
        "Tony D. Weinbeck",
        "Daniel A. Dale",
        "Kiana Henny",
        "Kirsten L. Larson",
        "M. Jimena Rodríguez",
        "Robert Kennicutt",
        "Amirnezam Amiri",
        "Ashley. T. Barnes",
        "Torsten Böker",
        "Martha Boyer",
        "Daizhong Liu",
        "Oleg V. Egorov",
        "Hwihyun Kim",
        "Ralf S. Klessen",
        "Thomas S.-Y. Lai",
        "Janice C. Lee",
        "Adam K. Leroy",
        "Sean T. Linden",
        "Julia Roman-Duval",
        "Karin Sandstrom",
        "Eva Schinnerer",
        "J. D. Smith",
        "Leonardo Úbeda",
        "Stefanie Walch",
        "E. Watkins",
        "Thomas G. Williams",
        "Yixian Cao"
      ],
      "abstract": "Ashes of Creation: JWST Uncovers Silicate Dust in Massive Star Clusters Daniel Maschmann, Bradley C. Whitmore, David A. Thilker, Ivan Gerasimov, Simon C. O. Glover, B. T. Draine, Bret Lehmer, Varun Bajaj, Sumit Sarbadhicary, Médéric Boquien, G. C. Sloan, Tony D. Weinbeck, Daniel A. Dale, Kiana Henny, Kirsten L. Larson, M. Jimena Rodríguez, Robert Kennicutt, Amirnezam Amiri, Ashley. T. Barnes, Torsten Böker, Martha Boyer, Daizhong Liu, Oleg V. Egorov, Hwihyun Kim, Ralf S. Klessen, Thomas S.-Y. Lai, Janice C. Lee, Adam K. Leroy, Sean T. Linden, Julia Roman-Duval, Karin Sandstrom, Eva Schinnerer, J. D. Smith, Leonardo Úbeda, Stefanie Walch, E. Watkins, Thomas G. Williams, Yixian Cao 38 Pages, 13Figures, submitted to APJ Astrophysics of Galaxies (astro-ph.GA) Dust production is a fundamental aspect of the baryonic cycle of star formation. It is known that dust is injected into the interstellar medium during early star formation by supernovae and later on by evolved stars. From individual objects, these mechanisms are well understood, but the overall dust production in star clusters at different evolutionary stages is still challenging to quantify. We present 22 massive (> 105M$_{\\odot}$) extra galactic star clusters with ages between 3 and 100 Myr exhibiting a compact dust morphology seen with JWST-MIRI. We only find PAH features associated with one star cluster and nineteen have already cleared themselves from their natal dust. Their main characteristic is a significant enhancement at 10${\\mu}$m, which is likely due to silicate emission and cannot be explained by ionized gas. We discuss several possible explanations including dust production from evolved stars such as red super giants, more exotic star types like yellow hypergiants and luminous blue variable stars. Stochastic dust injection from supernovae or a single supernova in dense gas can also create significant silicate emission. However, for this scenario secondary tracers such as a X-ray signal are expected which we only observe in three star clusters. We find the most luminous 10${\\mu}$m emitter to be the three most massive star clusters (> 106M$_{\\odot}$) which is at least a magnitude stronger than any known stellar sources indicating a rare mechanism that only appears at extreme masses and a short lifetime.",
      "pdf_url": "https://arxiv.org/pdf/2511.20775.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20806",
      "title": "Age and metallicity of low-mass galaxies: from their centres to their stellar halos",
      "authors": [
        "Elisa A. Tau",
        "Antonela Monachesi",
        "Facundo A. Gómez",
        "Robert J. J. Grand",
        "Rüdiger Pakmor",
        "Freeke van de Voort",
        "Federico Marinacci",
        "Rebekka Bieri"
      ],
      "abstract": "Age and metallicity of low-mass galaxies: from their centres to their stellar halos Elisa A. Tau, Antonela Monachesi, Facundo A. Gómez, Robert J. J. Grand, Rüdiger Pakmor, Freeke van de Voort, Federico Marinacci, Rebekka Bieri 16 pages, 10 figures, 2 appendices with additional figures. Submitted to A&A Astrophysics of Galaxies (astro-ph.GA) We aim to analyse the metallicity and the ages of the stellar halos of low-mass galaxies to better understand their formation history. We use 17 simulated low-mass galaxies from the Auriga Project ($\\sim 3 \\times 10^8 \\, M_\\odot \\leq M_* \\lesssim 2 \\times 10^{10} \\, M_\\odot$). We study the metallicity and the ages of these galaxies and their stellar halos, as well as the relation between these two properties. We find that all galaxies have negative radial [Fe/H] gradients, and that the centres of less massive dwarfs are generally more metal poor than those of more massive dwarfs. We find no correlation between the metallicity gradients and intrinsic galaxy properties, such as stellar mass or accreted stellar mass, suggesting that these gradients are not a simple byproduct of galaxy evolution in the low-mass regime. We also find that the dispersion in the mass-metallicity relation found in the stellar halos of low-mass galaxies can be explained with the infall time of their most dominant satellite: at a fixed accreted stellar halo mass, dwarf galaxies that accreted this satellite at later times have more metal-rich accreted stellar halos. Regarding the ages of the analysed galaxies, we find a prominent U-shape in the radial mean age profiles of $\\sim 65\\%$ of them, which is mainly driven by the in situ stellar material. This presence of a U-shape in the age profiles is due to the combination of the cessation of recent star formation at large radial distances and the merger events these galaxies undergo, which redistribute the stellar material to their outer regions. When focusing on the ages of the stellar halos, we find that more massive ones are older than less massive ones. Our results show a wide variety in ages and metallicities of low-mass galaxies and their stellar halos, reflecting the complex and non-uniform evolutionary pathways these systems can follow.",
      "pdf_url": "https://arxiv.org/pdf/2511.20806.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20900",
      "title": "Mapping the Galaxy Color-Star Formation Rate Relation with Manifold Learning and Infrared Image Stacking",
      "authors": [
        "Yu-Heng Lin",
        "Daniel Masters",
        "Andreas L. Faisst",
        "Harry Teplitz",
        "Olivier Ilbert",
        "Matthieu Bethermin",
        "Shoubaneh Hemmati",
        "Vihang Mehta",
        "Jason D. Rhodes",
        "Gregory L. Walth"
      ],
      "abstract": "Mapping the Galaxy Color-Star Formation Rate Relation with Manifold Learning and Infrared Image Stacking Yu-Heng Lin, Daniel Masters, Andreas L. Faisst, Harry Teplitz, Olivier Ilbert, Matthieu Bethermin, Shoubaneh Hemmati, Vihang Mehta, Jason D. Rhodes, Gregory L. Walth 18 pages, 16 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Modern surveys present us with billions of faint galaxies for which we only have broadband images in $\\sim$6-8 optical-to-near-infrared (NIR) filters. Galaxy star formation rates (SFRs) are difficult to estimate accurately without spectroscopic diagnostics or far-infrared (FIR) photometry, both of which are prohibitively expensive to obtain for large numbers of faint, high-redshift galaxies. Here we present the empirical relation between SFR and broadband optical-to-NIR colors learned from Spitzer MIPS and Herschel PACS/SPIRE imaging using an innovative stacking analysis that bins galaxies with similar optical-to-NIR spectral energy distributions using a Self-Organizing Map (SOM). Stacking based on optical-to-NIR colors ensures that our FIR stacks are built from galaxies with similar intrinsic physical properties as opposed to stacking simply by stellar mass. We train a 40$\\times$40 SOM using 230,638 galaxies selected from the COSMOS field, and stack the mid-to-far infrared images from 24 micron to 500 micron. We are able to measure the median FIR luminosities from half of the SOM cells to calibrate the star formation rate. In addition to investigating the common structures of optical-to-NIR properties and FIR detections labeled on the SOM, we provide calibrated star formation rates for nearly half of the galaxies in the COSMOS fields down to $i-$band magnitude $\\leq 25.5$, and present the evolution of the galaxy main sequence for low-mass galaxies to redshift $z\\sim2.5$.",
      "pdf_url": "https://arxiv.org/pdf/2511.20900.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21010",
      "title": "Different Origins of Nucleated and Non-nucleated Dwarf Elliptical Galaxies: Identified by the Deep-learning",
      "authors": [
        "Sanjaya Paudel",
        "Cristiano G. Sabiu",
        "Suk-Jin Yoon",
        "Daya Nidhi Chhatkuli",
        "Woong-Bae G. Zee",
        "Jaewon Yoo",
        "Binod Adhikari"
      ],
      "abstract": "Different Origins of Nucleated and Non-nucleated Dwarf Elliptical Galaxies: Identified by the Deep-learning Sanjaya Paudel, Cristiano G. Sabiu, Suk-Jin Yoon, Daya Nidhi Chhatkuli, Woong-Bae G. Zee, Jaewon Yoo, Binod Adhikari Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) Dwarf elliptical galaxies (dEs) are the dominant population in galaxy clusters and serve as ideal probes for studying the environmental impact on galactic evolution. A substantial fraction of dEs are known to harbor central nuclei, which are among the densest stellar systems in the Universe. The large-scale distribution and the underlying origin of nucleated and non-nucleated dEs remain unresolved. Using a state-of-the-art machine learning framework, we systematically scan the Virgo cluster region ($15\\arcdeg \\times 20\\arcdeg$ centered at $R.A. = 187.2\\arcdeg$ and $Dec. = 9.6\\arcdeg$) and construct the largest homogeneous sample of dEs (of total 2,123) with robust nucleus classifications. We find that nucleated dEs are more spatially clustered and exhibit a stronger association with massive galaxies than their non-nucleated counterparts. This suggests that most nucleated dEs likely formed alongside massive galaxies within the cluster (i.e, the in-situ formation). In contrast, non-nucleated dEs are more widely distributed across the cluster and align more closely with Virgo's global potential well, as traced by the cluster's hot gas. This indicates that most non-nucleated dEs originated outside the cluster (i.e, the ex-situ formation) and were later accreted and redistributed within it. Our findings shed new light on how dEs and their central nuclei form and evolve.",
      "pdf_url": "https://arxiv.org/pdf/2511.21010.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21027",
      "title": "Spectuner-D1: Spectral Line Fitting of Interstellar Molecules Using Deep Reinforcement Learning",
      "authors": [
        "Yisheng Qiu",
        "Tianwei Zhang",
        "Tie Liu",
        "Fengyao Zhu",
        "Dezhao Meng",
        "Huaxi Chen",
        "Thomas Möller",
        "Peter Schilke",
        "Donghui Quan"
      ],
      "abstract": "Spectuner-D1: Spectral Line Fitting of Interstellar Molecules Using Deep Reinforcement Learning Yisheng Qiu, Tianwei Zhang, Tie Liu, Fengyao Zhu, Dezhao Meng, Huaxi Chen, Thomas Möller, Peter Schilke, Donghui Quan 21 pages, 8 figures, submitted to ApJS Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Spectral lines from interstellar molecules provide crucial insights into the physical and chemical conditions of the interstellar medium. Traditional spectral line analysis relies heavily on manual intervention, which becomes impractical when handling the massive datasets produced by modern facilities like ALMA. To address this challenge, we introduce a novel deep reinforcement learning framework to automate spectral line fitting. Using observational data from ALMA, we train a neural network that maps both molecular spectroscopic data and observed spectra to physical parameters such as excitation temperature and column density. The neural network predictions can serve as initial estimates and be further refined using a local optimizer. Our method achieves consistent fitting results compared to global optimization with multiple runs, while reducing the number of forward modeling runs by an order of magnitude. We apply our method to pixel-level fitting for an observation of the G327.3-0.6 hot core and validate our results using XCLASS. We perform the fitting for CH$_3$OH, CH$_3$OCHO, CH$_3$OCH$_3$, C$_2$H$_5$CN, and C$_2$H$_3$CN. For a 100 $\\times$ 100 region covering 5 GHz bandwidth, the fitting process requires 4.9 to 41.9 minutes using a desktop with 16 cores and one consumer-grade GPU card.",
      "pdf_url": "https://arxiv.org/pdf/2511.21027.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21085",
      "title": "The FAST-SETI Milky Way Globular Cluster Survey I: A Pilot Multibeam On-the-Fly Search of Five Globular Clusters at L-Band",
      "authors": [
        "Bo-Lun Huang",
        "Zhen-Zhao Tao",
        "Tong-Jie Zhang",
        "Vishal Gajjar"
      ],
      "abstract": "The FAST-SETI Milky Way Globular Cluster Survey I: A Pilot Multibeam On-the-Fly Search of Five Globular Clusters at L-Band Bo-Lun Huang, Zhen-Zhao Tao, Tong-Jie Zhang, Vishal Gajjar 15 pages, 6 figures, 4 this http URL for publication in The Astronomical Journal Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We report a narrowband technosignature search toward five Milky Way globular clusters (NGC 6171, NGC 6218, NGC 6254, NGC 6838, and IC 1276) using the Five-hundred-meter Aperture Spherical radio Telescope (FAST) 19-beam L-band receiver (1.05-1.45 GHz). We adapt the MultiBeam Point-source Scanning (MBPS) strategy to extended targets by gating detections to generalized on-target windows (gOTWs), i.e. the time intervals when a beam main lobe intersects a buffered cluster mask, and by enforcing the deterministic multibeam illumination sequence as a geometry test. Dynamic spectra with frequency resolution about 7.5 Hz and time resolution about 10 s are searched with turboSETI over drift rates |nu_dot| <= 4 Hz s^-1 at signal-to-noise ratio S/N >= 10. From about 2.75e5 raw hits across both linear polarizations, none survive the gOTW gating, array-wide simultaneity veto, in-stripe ordering, and single-drift coherence checks, yielding a robust null result. With system equivalent flux density SEFD about 1.5 Jy and an effective 60 s per illuminated crossing, our per-crossing flux density threshold is S_min about 0.50 Jy, corresponding to minimum isotropic-equivalent radiated power EIRP_min in the range (0.72-1.8)e16 W for cluster distances 4-6.5 kpc; when multiple illuminated crossings occur, non-coherent stacking improves sensitivity by up to sqrt(N). To our knowledge this is the first FAST technosignature survey dedicated to globular clusters and the first to use MBPS as the primary observing strategy. These limits disfavor bright, persistent, isotropic L-band beacons above the stated thresholds during our epochs and establish a scalable blueprint, based on geometry-aware gating and verification, for multi-epoch MBPS campaigns that expand signal morphologies and combine passes to deepen constraints on transmitters in dense stellar systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.21085.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21187",
      "title": "Molecular Gas and Star Formation in Dwarf Galaxies Observed by the Atacama Large Millimeter/submillimeter Array",
      "authors": [
        "Kijeong Yim",
        "Soo-Chang Rey"
      ],
      "abstract": "Molecular Gas and Star Formation in Dwarf Galaxies Observed by the Atacama Large Millimeter/submillimeter Array Kijeong Yim, Soo-Chang Rey 13 pages, 6 figures, Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We present a spatially resolved analysis of the molecular star formation law (SFL) and gravitational instability in a sample of nearby dwarf galaxies (NGC 1035, NGC 4310, NGC 4451, NGC 4701, NGC 5692, and NGC 6106), using high-resolution $^{12}$CO ($J=1\\rightarrow0$) data from the Atacama Large Millimeter/submillimeter Array. We estimate the star formation rate (SFR) by combining the Galaxy Evolution Explorer near-ultraviolet and the Wide-field Infrared Survey Explorer 12 $\\mu$m imaging data to examine the relationship between molecular gas and SFR densities on scales of several hundred parsecs. We find that the power-law slope of the molecular SFL ranges from 0.62 to 1.08, with an average value of N$=0.81\\pm0.18$, increasing to N$=0.87\\pm0.05$ when excluding galaxies with poorly constrained CO data. These results are roughly consistent with values observed in massive spiral galaxies, suggesting a universal molecular SFL when analyzed with sufficient resolution and sensitivity. Radial profiles of the Toomre $Q$ parameter remain close to unity across the disks, with minimal radial variation, consistent with a self-regulated star formation model. Our results suggest that, despite their lower mass and metallicity, star formation in dwarf galaxies is governed by the same fundamental physical processes as in larger systems. This highlights the significance of high-resolution molecular gas observations in low-mass galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2511.21187.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21190",
      "title": "Molybdenum and ruthenium in the Galactic disk: A closer look at their nucleosynthesis components",
      "authors": [
        "Tamara Mishenina",
        "Teresa Kurtukian-Nieto",
        "Tatiana Gorbaneva",
        "Anish M. Amarsi",
        "Athanasios Psaltis",
        "Marco Pignatari"
      ],
      "abstract": "Molybdenum and ruthenium in the Galactic disk: A closer look at their nucleosynthesis components Tamara Mishenina, Teresa Kurtukian-Nieto, Tatiana Gorbaneva, Anish M. Amarsi, Athanasios Psaltis, Marco Pignatari 8 pages, 3 figures, accepted in A&A Astrophysics of Galaxies (astro-ph.GA) The stellar origin of the elements molybdenum (Mo, Z=42) and ruthenium (Ru, Z=44) is still a matter of debate. Studying their abundances provides valuable insights into nucleosynthesis processes and the broader evolution of neutron-capture elements. We presented new observations of Mo and Ru, together with nearby neutron-capture elements strontium (Sr) and zirconium (Zr) for a new sample of 154 giant stars, located in the Galactic disk with metallicities -1 < [Fe/H] < +0.3. The abundances were determined under the assumption of the local thermodynamic equilibrium by fitting synthetic spectra. The abundances of Mo were derived from the Mo I lines at 5506 and 5533 A, the abundances of Ru were determined from Ru I lines at 4584, and 4757 A. For most of the giant stars observed in this work, Mo and Ru abundances were determined for the first time. We compare our observations with the signatures from different nucleosynthesis processes. Both the [Mo/Fe] and [Ru/Fe] in our stars show a decreasing trend with respect to increasing [Fe/H]. This pattern is similar to that of [Zr/Fe], whereas [Sr/Fe] exhibits a relatively flat trend with metallicity. Compared to the s-process ratios, all stars show a lower [Zr/Mo] and a higher [Ru/Mo], as expected from classical nucleosynthesis. Still, it is unclear if additional contributions from neutrino-wind components or the i-process is needed to explain the observed scatter of [Zr/Mo] and [Ru/Mo] in the Milky Way disk. Indeed, such a dispersion is consistent with the variations also seen in r-II stars at low metallicity and could therefore result from the combined contributions of r-process and s-process to galactic chemical evolution. The observed [Zr/Mo] and [Ru/Mo] scatter in r-II stars should be constrained by future investigations to define if any contributions of additional nucleosynthesis components are needed.",
      "pdf_url": "https://arxiv.org/pdf/2511.21190.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21479",
      "title": "Scalable and Robust Multiband Modeling of AGN Light Curves in Rubin-LSST",
      "authors": [
        "Weixiang Yu",
        "John J. Ruan",
        "Colin J. Burke",
        "Roberto J. Assef",
        "Tonima T. Ananna",
        "Franz E. Bauer",
        "Demetra De Cicco",
        "Keith Horne",
        "Lorena Hernández-García",
        "Dragana Ilić",
        "Andjelka B. Kovačević",
        "Marcin Marculewicz",
        "Swayamtrupta Panda",
        "Claudio Ricci",
        "Gordon T. Richards",
        "Rogemar A. Riffel",
        "Donald P. Schneider",
        "Paula Sánchez-Sáez",
        "Sarath Satheesh Sheeba",
        "Francesco Tombesi",
        "Matthew J. Temple",
        "Michael S. Vogeley",
        "Ilsang Yoon",
        "Fan Zou"
      ],
      "abstract": "Scalable and Robust Multiband Modeling of AGN Light Curves in Rubin-LSST Weixiang Yu, John J. Ruan, Colin J. Burke, Roberto J. Assef, Tonima T. Ananna, Franz E. Bauer, Demetra De Cicco, Keith Horne, Lorena Hernández-García, Dragana Ilić, Andjelka B. Kovačević, Marcin Marculewicz, Swayamtrupta Panda, Claudio Ricci, Gordon T. Richards, Rogemar A. Riffel, Donald P. Schneider, Paula Sánchez-Sáez, Sarath Satheesh Sheeba, Francesco Tombesi, Matthew J. Temple, Michael S. Vogeley, Ilsang Yoon, Fan Zou Submitted to ApJ, 24 pages, 15 figures Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) will monitor tens of millions of active galactic nuclei (AGNs) for a period of 10 years with an average cadence of 3 days in six broad photometric bands. This unprecedented dataset will enable robust characterizations of AGN UV/optical variability across a wide range of AGN physical properties. However, existing tools for modeling AGN light curves are not yet capable of fully leveraging the volume, cadence, and multiband nature of LSST data. We present EzTaoX, a scalable light curve modeling tool designed to take advantage of LSST's multiband observations to simultaneously characterize AGN UV/optical stochastic variability and measure interband time delays. EzTaoX achieves a speed increase of $\\sim 10^2-10^4 \\times$ on CPUs over current tools with similar capabilities, while maintaining equal or better accuracy in recovering simulated variability properties. This performance gain enables continuum time-delay measurements for all AGNs discovered by LSST -- both in the Wide Fast Deep survey and the Deep Drilling Fields -- thereby opening new opportunities to probe AGN accretion-flow geometries. In addition, EzTaoX's multiband capability allows robust characterization of AGN stochastic variability down to hourly timescales, facilitating the identification of accreting low-mass AGNs -- such as those residing in dwarf galaxies -- through their distinctive variability signatures.",
      "pdf_url": "https://arxiv.org/pdf/2511.21479.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21512",
      "title": "Galaxy evolution in the post-merger regime. IV - The long-term effect of mergers on galactic stellar mass growth and distribution",
      "authors": [
        "Sara L. Ellison",
        "Leonardo Ferreira"
      ],
      "abstract": "Galaxy evolution in the post-merger regime. IV - The long-term effect of mergers on galactic stellar mass growth and distribution Sara L. Ellison, Leonardo Ferreira Submitted to the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) Galaxy mergers are known to trigger bursts of central star formation, which should therefore lead to stellar mass growth in their inner regions. However, observational measurements of this `burst mass fraction' are scant. Here, we assemble a large (~14,000) sample of post-coalescence galaxies that have recently completed their merger-induced star formation, and compare various measurements of central stellar mass with a matched control sample. Specifically, we quantify (at fixed redshift, star formation rate and total stellar mass) the stellar mass enhancement within a fixed angular aperture (Delta M_{star,fibre}) and in the galactic bulge (Delta M_{star,bulge}), finding burst mass fractions of 10 -- 20 %. 61 galaxies in our sample are at z<0.05 and have integral field unit data from the Mapping Galaxies at Apache Point (MaNGA) survey, allowing further kpc-scale assessment of excess stellar mass and radial gradients. Again, we find a ~15 -- 20 % excess of stellar mass in the central regions of the post-mergers compared with matched controls. However, contrary to previous works, which have inferred very compact, centralized merger-induced mass growth, we find a 15 % stellar mass excess out to ~7 kpc (1.4 R_e for the stellar masses in our sample). Our work represents the first direct measurement of merger-induced stellar mass that is independent of stellar population modelling, or fitting light profiles, demonstrating significant and extended mass build-up in late stage post-mergers.",
      "pdf_url": "https://arxiv.org/pdf/2511.21512.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21618",
      "title": "A Super-Eddington, Lensing-Magnified Quasar at $z=5.07$ observed with JWST",
      "authors": [
        "Katherine Panebianco",
        "Minghao Yue",
        "Anna-Christina Eilers",
        "Xiaohui Fan",
        "Feige Wang",
        "Jinyi Yang",
        "Robert A. Simcoe"
      ],
      "abstract": "A Super-Eddington, Lensing-Magnified Quasar at $z=5.07$ observed with JWST Katherine Panebianco, Minghao Yue, Anna-Christina Eilers, Xiaohui Fan, Feige Wang, Jinyi Yang, Robert A. Simcoe Astrophysics of Galaxies (astro-ph.GA) We present JWST/NIRCam F070W and F480M imaging for a quasar at $z = 5.07$, J0025-0145, which is magnified by a foreground lensing galaxy. Existing Hubble Space Telescope (HST) imaging does not have sufficient spatial resolution to determine whether the background quasar is multiply imaged. Exploiting the sharp PSF of the F070W band, we confirm that the background quasar can be well-described by a single point spread function (PSF), essentially ruling out the existence of multiple lensed images. We do not detect the quasar host galaxy in either the F070W or the F480M band. Using the HST and JWST photometry, we fit the Spectral Energy Distribution (SED) of the foreground galaxy. The estimated mass ($\\log(M_{*} / M_{\\odot}) = 11.15 \\pm 0.16$) and redshift ($z_{\\text{phot}} = 3.62_{-0.04}^{+0.06}$) of the foreground galaxy are consistent with a single-image lensing model. We estimate the maximum possible magnification of the quasar to be $\\mu_{\\text{max}} = 3.2$, which implies that the intrinsic Eddington ratio of the quasar is at least $\\lambda_{\\text{Edd}}^{\\text{intrinsic}} > 4.9$. Therefore, J0025-0145 has one of the highest Eddington ratios among $z>5$ supermassive black holes known so far, suggesting the viability of super-Eddington growth for supermassive black holes in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2511.21618.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20735",
      "title": "StarEstate: A Python Package for Galactic Population Synthesis",
      "authors": [
        "Amedeo Romagnolo"
      ],
      "abstract": "StarEstate: A Python Package for Galactic Population Synthesis Amedeo Romagnolo Code available at this http URL Submitted to Journal of Open Source Software Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) I present StarEstate, an open-source Python package for producing rapid, statistically robust galactic population synthesis models. By utilizing optimized pre-calculated inverse-cumulative distribution function samplers, the tool generates synthetic populations from pre-generated grids of stellar tracks orders of magnitude faster than traditional numerical integration methods. A key morphological feature is the probabilistic assignment of stars to spiral arms based on age-dependent dynamical temperature, reproducing the observation that young tracers tightly confine to arms while older populations disperse. The software combines statistical generation with stellar physics by mapping synthetic populations to MESA or rapid SSE/BSE evolutionary tracks. Users can inspect specific evolutionary stages through automatic hierarchical classification, distinguishing evolutionary phases and spectral classes like Wolf-Rayet, O-type, or red supergiant stars across different metallicity environments. StarEstate's features allow the user to predict spatial distributions of diverse stellar objects, providing a flexible resource for interpreting galactic surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.20735.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20810",
      "title": "Tracking the Activity of the Interstellar Object 3I/ATLAS through its Perihelion",
      "authors": [
        "T. Marshall Eubanks",
        "Craig E. DeForest",
        "Kevin J. Walsh",
        "Simon Porter",
        "Thomas Lehmann",
        "Bruce G. Bills",
        "Adam Hibberd",
        "W. Paul Blase",
        "Andreas M. Hein",
        "Robert G. Kennedy III",
        "Adrien Coffinet",
        "Pierre Kervella",
        "Carlos Gomez de Olea Ballester"
      ],
      "abstract": "Tracking the Activity of the Interstellar Object 3I/ATLAS through its Perihelion T. Marshall Eubanks, Craig E. DeForest, Kevin J. Walsh, Simon Porter, Thomas Lehmann, Bruce G. Bills, Adam Hibberd, W. Paul Blase, Andreas M. Hein, Robert G. Kennedy III, Adrien Coffinet, Pierre Kervella, Carlos Gomez de Olea Ballester Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) In order to facilitate interplanetary spacecraft observationsof 3I/ATLAS, we have monitored and predicted the optical properties of its coma using both ground and space-based observations. Here, we describe how the data from space-based solar coronagraphs and the PUNCH mission enabled tracking of 3I/ATLAS's optical magnitude throughout its entire perihelion passage, including the period between October 8 and 30, 2025, when it was not visible from Earth.",
      "pdf_url": "https://arxiv.org/pdf/2511.20810.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20845",
      "title": "CH$_3$OH and HCN in Interstellar Comet 3I/ATLAS Mapped with the ALMA Atacama Compact Array: Distinct Outgassing Behaviors and a Remarkably High CH$_3$OH/HCN Production Rate Ratio",
      "authors": [
        "Nathan X. Roth",
        "Martin A. Cordiner",
        "Dominique Bockelée-Morvan",
        "Nicolas Biver",
        "Jacques Crovisier",
        "Stefanie N. Milam",
        "Emmanuel Lellouch",
        "Pablo Santos-Sanz",
        "Dariusz C. Lis",
        "Chunhua Qi",
        "K. D. Foster",
        "Jérémie Boissier",
        "Kenji Furuya",
        "Raphael Moreno",
        "Steven B. Charnley",
        "Anthony J. Remijan",
        "Yi-Jehng Kuan",
        "Lillian X. Hart"
      ],
      "abstract": "CH$_3$OH and HCN in Interstellar Comet 3I/ATLAS Mapped with the ALMA Atacama Compact Array: Distinct Outgassing Behaviors and a Remarkably High CH$_3$OH/HCN Production Rate Ratio Nathan X. Roth, Martin A. Cordiner, Dominique Bockelée-Morvan, Nicolas Biver, Jacques Crovisier, Stefanie N. Milam, Emmanuel Lellouch, Pablo Santos-Sanz, Dariusz C. Lis, Chunhua Qi, K. D. Foster, Jérémie Boissier, Kenji Furuya, Raphael Moreno, Steven B. Charnley, Anthony J. Remijan, Yi-Jehng Kuan, Lillian X. Hart Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We report the detection of methanol (CH$_3$OH) toward interstellar comet 3I/ATLAS using the Atacama Compact Array of the Atacama Large Millimeter/Submillimeter Array (ALMA) on UT 2025 August 28, September 18 and 22, and October 1, and of hydrogen cyanide (HCN) on September 12 and 15. These observations spanned pre-perihelion heliocentric distances ($r_H$) of 2.6 -- 1.7 au. The molecules showed outgassing patterns distinct from one another, with HCN production being depleted in the sunward hemisphere of the coma, whereas CH$_3$OH was enhanced in that direction. Statistical analysis of molecular scale lengths in 3I/ATLAS indicated that CH$_3$OH included production from coma sources at $L_p>258$ km at 99% confidence, although low signal-to-noise on long baselines prevented definitively ruling out CH$_3$OH as purely a parent species. In contrast, HCN production was indistinguishable from direct nucleus sublimation. The CH$_3$OH production rate increased sharply from August through October, including an uptick near the inner edge of the H$_2$O sublimation zone at $r_H$ = 2 au. Compared to comets measured to date at radio wavelengths, the derived CH$_3$OH/HCN ratios in 3I/ATLAS of $124^{+30}_{-34}$ and $79^{+11}_{-14}$ on September 12 and 15, respectively, are among the most enriched values measured in any comet, surpassed only by anomalous solar system comet C/2016 R2 (PanSTARRS).",
      "pdf_url": "https://arxiv.org/pdf/2511.20845.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21012",
      "title": "Refined classification of YSOs and AGB stars by IR magnitudes, colors, and time-domain analysis with machine learning",
      "authors": [
        "Hyunwook Jheonn",
        "Jeong-Eun Lee",
        "Jinho Lee",
        "Seonjae Lee",
        "Hyeyoon Lee",
        "ShinGeon Kim",
        "Carlos Contreras Peña",
        "Mi-Ryang Kim"
      ],
      "abstract": "Refined classification of YSOs and AGB stars by IR magnitudes, colors, and time-domain analysis with machine learning Hyunwook Jheonn, Jeong-Eun Lee, Jinho Lee, Seonjae Lee, Hyeyoon Lee, ShinGeon Kim, Carlos Contreras Peña, Mi-Ryang Kim 18 pages, 11 figures, accepted to ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We introduce a binary classification model, {\\it the Double Filter Model}, utilizing various machine learning and deep learning methods to classify Young Stellar Objects (YSOs) and Asymptotic Giant Branch (AGB) stars. Since YSOs and AGB stars share similar infrared (IR) photometric characteristics due to comparable temperatures and the presence of circumstellar dust, distinguishing them is challenging and often leads to misclassification. While machine learning and deep learning techniques have helped reduce YSO-AGB misclassifications, achieving a reliable separation remains challenging. Given that YSOs and AGB stars exhibit distinct light curves resulting from different variability mechanisms, our Double Filter Model leverages light curve data to enhance classification accuracy. This approach uncovered YSOs and AGB stars that were misclassified in IR photometry and was validated against Taurus YSOs and spectroscopically confirmed AGB stars. We applied the model to the {\\it Spitzer/IRAC Candidate YSO Catalog for the Inner Galactic Midplane} (SPICY) catalog for catalog refinement and identified potential AGB star contaminants.",
      "pdf_url": "https://arxiv.org/pdf/2511.21012.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21234",
      "title": "Shock-type inference of L1157 B2 using methanol desorption",
      "authors": [
        "Cedric Baijot",
        "Maria Groyne",
        "Michaël De Becker"
      ],
      "abstract": "Shock-type inference of L1157 B2 using methanol desorption Cedric Baijot, Maria Groyne, Michaël De Becker Accepted for publication in A&A Sect. 6. Interstellar and circumstellar matter, 15 pages, 8 figures, 9 tables, in press Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Shock types of low-velocity molecular outflows are not always well constrained. Astrochemical comparisons are often made between low-velocity and high-velocity outflows, but without considering the question of the shock type. We investigated molecular abundances of post-shock regions to determine whether strong differences between non-irradiated C-type and J-type shocks can be highlighted. One of the main application goals is to diagnose the shock type of the protostellar object L1157 B2 through the use of molecular tracers. We simulated grid sets of shock models with the Paris-Durham Shock code with velocities ranging from 5 to 19 km/s and low densities from $10^2$ to $10^5$ cm$^{-3}$. We computed the desorption percentage of methanol in these simulations and estimated it at higher velocities. We compared our results to observational measurements of L1157 B2 and with a benchmark of four already identified shocks. L1157 B2 has been diagnosed as a non-irradiated C-type shock, and the method showed a good applicability through the benchmark. Methanol formed in the icy mantle of grains can serve to trace the differences between shock types, at least in non-irradiated conditions. A requirement for the applicability of a species as a shock-type tracer is that it does not undergo significant enhancement or destruction, but is mainly impacted by desorption processes under shocked conditions. The desorption percentage of methanol is a good criterion in characterizing the shock type of L1157 B2 and should be investigated as a general method to diagnose the shock type in non-irradiated regions. We identify L1157 B2 as a non-irradiated C-type shock with velocities and densities fitting with previous studies.",
      "pdf_url": "https://arxiv.org/pdf/2511.21234.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21676",
      "title": "Axion Constraints from White Dwarf Cooling in 47 Tucanae",
      "authors": [
        "Leesa Fleury",
        "Alysa Obertas",
        "Harvey Richer",
        "Jeremy Heyl"
      ],
      "abstract": "Axion Constraints from White Dwarf Cooling in 47 Tucanae Leesa Fleury, Alysa Obertas, Harvey Richer, Jeremy Heyl 25 pages + appendices, 7 figures in main text (+ 21 figures in appendices) Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph) We analyse the cooling of white dwarfs in the globular cluster 47 Tucanae to look for evidence of axion emission affecting the rate of white dwarf cooling. If axions exist and couple to electrons, then axions could be produced at an appreciable rate in the electron-degenerate core of a white dwarf through axion bremsstrahlung from electrons. The emission of these axions would provide an additional cooling mechanism for white dwarfs that would affect the cooling rate, and hints of axions have been suggested based on observations of anomalous cooling reported for white dwarfs in the Galactic disc and halo. We performed stellar evolution simulations of white dwarf cooling that accounted for the additional energy loss due to axion bremsstrahlung from electrons, producing a suite of white dwarf cooling models for different values of the axion-electron coupling constant, as well as the white dwarf mass and envelope thickness. These cooling models are compared to observations of white dwarfs in 47 Tucanae from the Hubble Space Telescope through an unbinned likelihood analysis. The optimal model found by this analysis corresponds to the case of no axion emission with a thick white dwarf envelope, and we find a new bound on the axion-electron coupling of $g_{aee} \\leq 0.81 \\times 10^{-13}$ at 95% confidence level. This improves upon the previous white dwarf cooling bound for this coupling and excludes the range of values favoured by the axion hints from the anomalous cooling of Galactic white dwarfs.",
      "pdf_url": "https://arxiv.org/pdf/2511.21676.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "hep-ph"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.12212",
      "title": "Quantifying the Relationship Between Galaxy Specific Star Formation Rate And Halo Spin For Star-forming Galaxies",
      "authors": [
        "Wenxiao Xue",
        "Zichen Hua",
        "Yu Rong"
      ],
      "abstract": "Quantifying the Relationship Between Galaxy Specific Star Formation Rate And Halo Spin For Star-forming Galaxies Wenxiao Xue, Zichen Hua, Yu Rong Astrophysics of Galaxies (astro-ph.GA) Utilizing ALFALFA HI data, we investigate the relationship between specific star formation rate (sSFR) and halo spin across various star-forming galaxies. Our analysis reveals weak yet statistically significant positive correlation between sSFR and halo spin, irrespective of the galactic environment. This trend suggests that galaxies with higher spin parameters tend to host dynamically colder, gas-rich disks, sustaining elevated gas surface densities and prolonged star formation. These findings align with theoretical expectations of angular momentum-regulated gas accretion but highlight discrepancies with cosmological simulations, underscoring unresolved challenges in modeling baryonic feedback and star formation efficiency.",
      "pdf_url": "https://arxiv.org/pdf/2411.12212.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.07420",
      "title": "A flux-limited sample of dusty star-forming galaxies from the Atacama Cosmology Telescope: physical properties and the case for multiplicity",
      "authors": [
        "Kirsten R. Hall",
        "Jake Hassan",
        "Richard M. Feder",
        "Tobias A. Marriage",
        "Michael Zemcov",
        "Jesus Rivera"
      ],
      "abstract": "A flux-limited sample of dusty star-forming galaxies from the Atacama Cosmology Telescope: physical properties and the case for multiplicity Kirsten R. Hall, Jake Hassan, Richard M. Feder, Tobias A. Marriage, Michael Zemcov, Jesus Rivera 28 pages, 8 figures (26 including subfigures), accepted and in press with ApJ Astrophysics of Galaxies (astro-ph.GA) We report the modeling of the millimeter and far-infrared spectral energy distributions of 71 dusty star-forming galaxies (DSFGs) selected by the Atacama Cosmology Telescope (ACT) with a lower flux-density limit of 8 mJy at 220 GHz (1.4 mm). All sources were cross-identified with Herschel surveys at 500, 350, and 250 {\\mu}m, and nineteen of our sources were observed at with the Submillimeter Array. A probabilistic cataloging algorithm, PCAT, favors multiple unresolved flux components in the Herschel data for the majority of ACT-selected DSFGs. We compare the derived physical properties of the DSFGs obtained from modeling the flux densities with those from similar studies of both lensed and unlensed DSFG populations. We find the median, 16th and 84th percentiles for the following model parameters: redshift zphot=3.3(+0.7)(-0.6), apparent size {\\mu}d=5.2(+0.9)(-2.4) kpc, apparent dust mass log10({\\mu}Md/Msun)=9.14(+0.12)(-0.04) and cutoff temperature Tc=35.6(+4.8)(-1.6) K, and the corresponding apparent far-infrared luminosity log10({\\mu}LIR/Lsun)=13.6(+0.2)(-0.3), where {\\mu} is lensing magnification. While many of the properties broadly agree with those of samples of primarily lensed DSFGs, we exercise caution in interpreting them. ACT's lower flux limit, the PCAT decomposition, and the higher-resolution SMA observations all suggest that some fraction of these DSFGs are likely to be unlensed and possibly multiples. The SMA data indicate that at least fourteen out of nineteen sources are such, either via \"missing\" flux in comparison to the ensemble model or detection of additional sources in the fields. Additional high-resolution follow-up and targeted redshift observations are needed to better understand this flux-limited sample of DSFGs.",
      "pdf_url": "https://arxiv.org/pdf/2501.07420.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03640",
      "title": "Deciphering galaxy images using machine vision -- Combining variational autoencoder and principal component analysis for feature extraction",
      "authors": [
        "Samuel Howie",
        "Ting-Yun Cheng",
        "Carlton M. Baugh"
      ],
      "abstract": "Deciphering galaxy images using machine vision -- Combining variational autoencoder and principal component analysis for feature extraction Samuel Howie, Ting-Yun Cheng, Carlton M. Baugh 18 pages, 13 figures. Published on MNRAS. The abstract is modified to accommodate the character limit on arXiv Mon Not R Astron Soc (2025) 3124-3141 Astrophysics of Galaxies (astro-ph.GA) Here, we present a machine vision approach, combining a VAE framework with PCA, to decipher galaxy images. Using mock gri-band images from the EAGLE simulation, the VAE finds that around 35 features are needed to describe the images. Adding the PCA, we identify an optimal range of 10-12 features needed to capture 99.9% of the variance in galaxy images. The exact optimal number varies with galaxy complexity: disk-dominated galaxies require 12 features, bulge-dominated galaxies need 9, and intermediate systems require 10-11 features. Correlations between extracted PCA features and structural measurements reveal that the VAE prioritizes galaxy size during reconstruction, with half-light radius strongly correlating with the highest-ranked principal components. Subsequent features capture morphology-dependent characteristics: disk-dominated galaxies emphasize size, asymmetry, and position angle; bulge-dominated systems focus on size, concentration, and axis ratio; while intermediate galaxies show enhanced attention to Sersic index, indicating greater emphasis on accurately reproducing both disk and bulge structures. The PCA process significantly reduces the entanglement of the features compared to the raw VAE latent features, decreasing the correlations with the half-light radius and the Sersic index from 14.5+-1.0 and 6.0+-1.5 features, respectively, to only 2.0+-1.0 components after PCA. Using UMAP, we construct two-dimensional visualizations that preserve neighborhood relationships from the high-dimensional feature space. This demonstrates that machine vision can effectively distinguish galaxy populations across different morphological types, including systems with atypical structures that may be overlooked by traditional classification methods, providing a data-driven complement to conventional structural measurements.",
      "pdf_url": "https://arxiv.org/pdf/2509.03640.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.13278",
      "title": "Bar Evolution in Edge-on Galaxies: A Demographic Study of Boxy/Peanut Bulges",
      "authors": [
        "Atul A. Samanta",
        "Ankit Kumar",
        "Mousumi Das",
        "M. Celeste Artale"
      ],
      "abstract": "Bar Evolution in Edge-on Galaxies: A Demographic Study of Boxy/Peanut Bulges Atul A. Samanta, Ankit Kumar, Mousumi Das, M. Celeste Artale 14 pages, 12 figures, accepted for publication in A&A [accepted version] Astrophysics of Galaxies (astro-ph.GA) Boxy/peanut and X-shaped (BP/X) bulges are prominent features in edge-on disk galaxies and are believed to be vertically thickened bars. Despite their relevance in bar evolution, a statistically robust census of these structures in large surveys has been lacking. We aim to provide the largest catalog of BP/X structures in edge-on galaxies to date, and to investigate their properties and role in shaping galaxy scaling relations. We selected a sample of 6684 edge-on galaxies from SDSS DR8 using Galaxy Zoo classifications, requiring a high edge-on probability ($> 0.9$) and a minimum of 10 independent votes. Two-dimensional image decomposition is performed using GALFIT to obtain structural parameters. Residual images are visually inspected to classify BP/X features into four categories: strong both-sided, both-sided, one-sided, and control (no BP/X). We also estimated stellar mass, distance, and physical size for each galaxy. Out of 6653 classified galaxies, we identified 1673 ($\\sim$25%) with both-sided BP/X features-504 ($\\sim$8%) strong and 1169 ($\\sim$17%) weak-as well as 1112 ($\\sim$17%) one-sided structures, making up a total of 2785 BP/X-hosting galaxies ($\\sim$42%). One-sided structures, likely signatures of ongoing buckling, are more frequent than strong both-sided bulges across all stellar masses. The fraction of BP/X bulges increases with stellar surface mass density, indicating a connection with bar formation in dense disks. We also find that galaxies with strong BP/X bulges contribute to increased scatter in the stellar mass-size and stellar mass-surface density relations, particularly at higher masses.",
      "pdf_url": "https://arxiv.org/pdf/2509.13278.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.13607",
      "title": "The velocity field of the Scorpius-Centaurus OB association",
      "authors": [
        "S. Hutschenreuter , J. Alves , L. Posch , J. Großschedl , M. Piecka , N. Miret-Roig , S. Ratzenböck , C. Swiggum University of Vienna, Department of Astrophysics, Astronomical Institute of the Czech Academy of Sciences, Departament de Física Quàntica i Astrofísica , Universitat de Barcelona , Institut de Ciències del Cosmos , Universitat de Barcelona , Center for Astrophysics | Harvard &amp; Smithsonian)"
      ],
      "abstract": "The velocity field of the Scorpius-Centaurus OB association S. Hutschenreuter (1), J. Alves (1), L. Posch (1), J. Großschedl (2), M. Piecka (1), N. Miret-Roig (3, 4), S. Ratzenböck (5), C. Swiggum (1) ((1) University of Vienna, Department of Astrophysics, (2) Astronomical Institute of the Czech Academy of Sciences, (3) Departament de Física Quàntica i Astrofísica (FQA), Universitat de Barcelona (UB), (4) Institut de Ciències del Cosmos (ICCUB), Universitat de Barcelona (UB), (5) Center for Astrophysics | Harvard &amp; Smithsonian) 12 + 6 pages, accepted in Astronomy and Astrophysics, maps at this https URL Astrophysics of Galaxies (astro-ph.GA) We present a non-parametric reconstruction of the three-dimensional velocity field of the Scorpius-Centaurus OB association (Sco- Cen). Using Gaia DR3 astrometry and radial velocities, we infer the velocity field using information field theory on a 70 x 70 x 50 grid at 3 pc resolution. Our model suggests the existence of a primary stellar velocity field with a secondary field that accounts for an additional young kinematic component in Upper Scorpius and Lupus. We find clear tracers of a feedback-driven expansion of the association, while Galactic rotation appears to play a subordinate role. The results confirm the existence of cluster chains and reveal coherent large-scale expansion with characteristic speeds of 1-2 km s$^{-1}$ and local maxima of about 10 km s$^{-1}$. Power spectra indicate an excess of small-scale structure and slopes shallower than Kolmogorov, consistent with energy injection from stellar feedback. Maps of the divergence reveal net positive values, implying an approximate dispersal timescale of 10-15 Myr. A comparison with molecular gas in Lupus and Ophiuchus shows broadly consistent patterns but systematic velocity offsets of several km s$^{-1}$, suggesting partial decoupling for optically visible young stars and gas. The framework presented provides a physically motivated description of the Sco-Cen velocity field and a basis for quantifying the dynamical state and feedback history of OB associations in the local Galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2509.13607.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11115",
      "title": "The Spatial Evolution of Star Clusters in NGC 628 with JWST",
      "authors": [
        "Anne S. M. Buckner",
        "Ana Duarte-Cabral",
        "Angela Adamo",
        "Sean Linden",
        "Michele Cignoni",
        "Varun Bajaj",
        "Arjan Bik",
        "Giacomo Bortolini",
        "Daniela Calzetti",
        "Matteo Correnti",
        "Bruce G. Elmegreen",
        "Debra M. Elmegreen",
        "Helena Faustino Vieira",
        "John S. Gallagher III",
        "Kathryn Grasha",
        "Benjamin Gregg",
        "Rob A. Gutermuth",
        "Kelsey Johnson",
        "Mark Krumholz",
        "Drew Lapeer",
        "Matteo M. Messa",
        "Göran Östlin",
        "Alex Pedrini",
        "Jenna E. Ryon",
        "Linda J. Smith",
        "Monica Tosi"
      ],
      "abstract": "The Spatial Evolution of Star Clusters in NGC 628 with JWST Anne S. M. Buckner, Ana Duarte-Cabral, Angela Adamo, Sean Linden, Michele Cignoni, Varun Bajaj, Arjan Bik, Giacomo Bortolini, Daniela Calzetti, Matteo Correnti, Bruce G. Elmegreen, Debra M. Elmegreen, Helena Faustino Vieira, John S. Gallagher III, Kathryn Grasha, Benjamin Gregg, Rob A. Gutermuth, Kelsey Johnson, Mark Krumholz, Drew Lapeer, Matteo M. Messa, Göran Östlin, Alex Pedrini, Jenna E. Ryon, Linda J. Smith, Monica Tosi 17 pages, 13 figures, 4 tables, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We examine the spatial distribution of star clusters in NGC 628 using the statistical tool INDICATE to quantify clustering tendencies. Our sample, based on HST and JWST observations, is the most complete to date, spanning ages from 1 Myr to >100 Myr. We find cluster spatial behaviour varies with galactic position, age, and mass. Most emerging young clusters are tightly spatially associated with each other, while fully emerged clusters are in \\sim1.5 times looser spatial associations, irrespective of age. Young Massive Clusters (YMCs \\ge 10^4 M_{\\odot}) tend to associate with lower-mass clusters but not strongly with other YMCs, implying that intense star formation regions produce a few YMCs alongside many lower-mass clusters rather than multiple YMCs together. Young concentrated clusters show a wide radial distribution in the galactic disk, which narrows with age; with concentrated clusters >100 Myr mostly residing between 2-6 kpc. This pattern may reflect either faster dispersal of isolated tight cluster spatial \"structure\" in a lower gas density outer disk or gradual inside-out growth, with the formation of this structure shifting outward over time. We also detect distinct spatial behaviours for clusters within 2 kpc, linked to the inner Lindblad resonance (\\le1 kpc), nuclear ring (\\sim0.5-1 kpc), and the start of spiral arms (\\sim1.25-2 kpc), suggesting these regions exhibit strong radial motions that could hinder clusters from forming and remaining in tight concentrations. Our results highlight how spatially-resolved studies of clusters can reveal the influence of galactic dynamics on star formation and cluster evolution.",
      "pdf_url": "https://arxiv.org/pdf/2511.11115.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.14474",
      "title": "The Prime Focus Infrared Microlensing Experiment (PRIME): First Results",
      "authors": [
        "Takahiro Sumi",
        "David A. H. Buckley",
        "Alexander S. Kutyrev",
        "Motohide Tamura",
        "David P. Bennett",
        "Ian A. Bond",
        "Giuseppe Cataldo",
        "Joseph M. Durbak",
        "S. Bradley Cenko",
        "Dale Fixsen",
        "Orion Guiffreda",
        "Ryusei Hamada",
        "Yuki Hirao",
        "Asahi Idei",
        "Dan Kelly",
        "Markus Loose",
        "Gennadiy N. Lotkin",
        "Eric I. Lyness",
        "Stephen Maher",
        "Shuma Makida",
        "Noriyuki Matsunaga",
        "Shota Miyazaki",
        "Gregory Mosby",
        "Samuel H. Moseley",
        "Tutumi Nagai",
        "Togo Nagano",
        "Seiya Nakayama",
        "Mayu Nishio",
        "Kansuke Nunota",
        "Ryo Ogawa",
        "Ryunosuke Oishi",
        "Yui Okumoto",
        "Nicholas J. Rattenbury",
        "Yuki K. Satoh",
        "Elmer H. Sharp",
        "Daisuke Suzuki",
        "Takuto Tamaoki",
        "Eleonora Troja",
        "Sarah V. White",
        "Hibiki Yama"
      ],
      "abstract": "The Prime Focus Infrared Microlensing Experiment (PRIME): First Results Takahiro Sumi, David A. H. Buckley, Alexander S. Kutyrev, Motohide Tamura, David P. Bennett, Ian A. Bond, Giuseppe Cataldo, Joseph M. Durbak, S. Bradley Cenko, Dale Fixsen, Orion Guiffreda, Ryusei Hamada, Yuki Hirao, Asahi Idei, Dan Kelly, Markus Loose, Gennadiy N. Lotkin, Eric I. Lyness, Stephen Maher, Shuma Makida, Noriyuki Matsunaga, Shota Miyazaki, Gregory Mosby, Samuel H. Moseley, Tutumi Nagai, Togo Nagano, Seiya Nakayama, Mayu Nishio, Kansuke Nunota, Ryo Ogawa, Ryunosuke Oishi, Yui Okumoto, Nicholas J. Rattenbury, Yuki K. Satoh, Elmer H. Sharp, Daisuke Suzuki, Takuto Tamaoki, Eleonora Troja, Sarah V. White, Hibiki Yama 16 pages, 15 figures, published in the Astronomical Journal Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) We present the description of the instruments and the first results of the PRime-focus Infrared Microlensing Experiment (PRIME). PRIME is the first dedicated near-infrared (NIR) microlensing survey telescope located at the South African Astronomical Observatory (SAAO) in Sutherland, South Africa. Among its class, it offers one of the widest fields of view in the NIR regime. PRIME's main goals are (1) To study planetary formation by measuring the frequency and mass function of planets. In particular, we compare results from the central Galactic bulge (GB), accessible only in the NIR by PRIME, with those from the outer GB by optical surveys. (2) To conduct concurrent observations with NASA's Nancy Grace Roman Space telescope. Due to the different lines of sight between the ground and space, we detect slight variations in light curves, known as ``Space-based parallax.\" This effect allows us to measure the mass of lens systems and their distance from the Earth. It is the only method to measure the mass of the free-floating planets down to Earth-mass. We began the GB survey in February 2024 and analyzed images through June 1, 2025, identifying 486 microlensing candidates and over a thousand variable stars, including Mira variables, which are useful to study the Galactic structure. We issue real-time alerts for follow-up observations, supporting exoplanet searches, and the chemical evolution studies in the GB. During the off-bulge season, we conduct an all-sky grid survey and Target of Opportunity (ToO) observations of transients, including gravitational wave events, gamma-ray bursts, and other science.",
      "pdf_url": "https://arxiv.org/pdf/2508.14474.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.20816",
      "title": "An empirical view of the extended atmosphere and inner envelope of the asymptotic giant branch star R Doradus. II. Constraining the dust properties with radiative transfer modelling",
      "authors": [
        "Thiebaut Schirmer",
        "Theo Khouri",
        "Wouter Vlemmings",
        "Gunnar Nyman",
        "Matthias Maercker",
        "Ramlal Unnikrishnan",
        "Behzad Bojnordi Arbab",
        "Kirsten K. Knudsen",
        "Susanne Aalto"
      ],
      "abstract": "An empirical view of the extended atmosphere and inner envelope of the asymptotic giant branch star R Doradus. II. Constraining the dust properties with radiative transfer modelling Thiebaut Schirmer, Theo Khouri, Wouter Vlemmings, Gunnar Nyman, Matthias Maercker, Ramlal Unnikrishnan, Behzad Bojnordi Arbab, Kirsten K. Knudsen, Susanne Aalto Solar and Stellar Astrophysics (astro-ph.SR) Mass loss in oxygen-rich asymptotic giant branch (AGB) stars remains poorly understood, as the dust detected around them appears too transparent to drive winds through absorption alone. The current paradigm invokes outflows driven by photon scattering on relatively large grains ($\\sim0.3\\,\\mu$m), but whether such grains exist in sufficient quantities remains uncertain. We test whether the dust around the oxygen-rich AGB star R~Doradus can drive its wind by combining polarimetric constraints, elemental abundance limits, and force-balance calculations. We examine Fe-free silicates (MgSiO$_3$), alumina (Al$_2$O$_3$), and Fe-bearing silicates (MgFeSiO$_4$) to evaluate whether any species can produce enough radiative pressure under realistic conditions. Using high-angular-resolution polarimetric observations from SPHERE/ZIMPOL at the VLT, we model the circumstellar dust with RADMC-3D and explore a broad parameter space in grain size, density structure, and wavelength-dependent stellar radius. For models consistent with the observations, we assess wind feasibility using updated gas-density profiles, elemental depletion constraints, and radiation-pressure thresholds. Although several dust configurations reproduce the observed scattering patterns, none generate sufficient radiative force at realistic gas-to-dust ratios, even under maximal elemental depletion. Our results for R~Doradus indicate that photon scattering on dust cannot by itself launch the wind, implying that additional mechanisms must contribute.",
      "pdf_url": "https://arxiv.org/pdf/2511.20816.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20817",
      "title": "Measuring Dust Masses of Protoplanetary Disks in Serpens and L1641/L1647 with ALMA",
      "authors": [
        "Luisa F. Zamudio-Ruvalcaba",
        "Catherine C. Espaillat",
        "Álvaro Ribas",
        "Enrique Macías"
      ],
      "abstract": "Measuring Dust Masses of Protoplanetary Disks in Serpens and L1641/L1647 with ALMA Luisa F. Zamudio-Ruvalcaba, Catherine C. Espaillat, Álvaro Ribas, Enrique Macías Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Protoplanetary disks are an essential component of the planet-formation process. The amount of dust and gas in the disk constrains the number and size of planets that can form in a system. We analyze 178 T-Tauri stars, 18 in Serpens and 160 in L1641/L1647, and measure their disk dust masses using spectral energy distribution (SED) modeling and multiwavelength data, including 1.3 mm (ALMA band 6) fluxes from the literature. The disk masses calculated in this work are up to $\\sim$2 times higher than those previously reported. We conclude that this is because disks may be partially optically thick at millimeter wavelengths while most calculations of the disk mass assume that the disk is optically thin at 1.3 mm. We calculate optical depths at 1.3 and 7 mm for a subset of the Serpens and L1641/L1647 disk sample and show that the vast majority of disks become optically thin at longer millimeter wavelengths; thus, observations at 7 mm (i.e., ALMA band 1) are vital to better characterize disk dust masses.",
      "pdf_url": "https://arxiv.org/pdf/2511.20817.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20908",
      "title": "Automated all-sky detection of γ Doradus / δ Scuti hybrids in TESS data from positive unlabelled (PU) learning",
      "authors": [
        "Mykyta Kliapets",
        "Pablo Huijse",
        "Andrew Tkachenko",
        "Alex Kemp",
        "Dario J. Fritzewski",
        "Daniel Hey",
        "Conny Aerts"
      ],
      "abstract": "Automated all-sky detection of γ Doradus / δ Scuti hybrids in TESS data from positive unlabelled (PU) learning Mykyta Kliapets, Pablo Huijse, Andrew Tkachenko, Alex Kemp, Dario J. Fritzewski, Daniel Hey, Conny Aerts 12 pages, 10 figures, 4 appendices Kliapets et al., Automated all-sky detection of {\\gamma} Doradus/{\\delta} Scuti hybrids in TESS data from positive unlabelled (PU) learning. A&A 703 A240 (2025) Solar and Stellar Astrophysics (astro-ph.SR) The Transiting Exoplanet Survey Satellite (TESS) mission has observed hundreds of millions of stars, substantially contributing to the available pool of high-precision photometric space data. Among them are the relatively rare $\\gamma$ Doradus / $\\delta$ Scuti ($\\gamma$ Dor / $\\delta$ Sct) hybrid pulsators, which have been previously studied using Kepler data. These stars are perfect laboratories to probe both inner and outer interior stellar layers thanks to them exhibiting both pressure and gravity modes. We seek to classify an all-sky sample of AF stars observed by TESS to find previously undiscovered hybrid pulsators and supply them in a catalogue of candidates. We also aim to compare the light curves produced with the TESS-Gaia Light Curve (TGLC) pipeline, currently underused in variability studies, with other publicly available light curves. We compared dominant and secondary frequencies of confirmed hybrid pulsators in Kepler, extended mission Quick Look Pipeline (QLP) data, and nominal and extended mission TGLC data. We then used a feature-based positive unlabelled (PU) learning classifier to search for new hybrid pulsators amongst TESS AF stars and investigated the properties of the detected populations. We find that the variability of confirmed hybrids in TGLC agrees well with the one occurring in QLP light curves and has a high recovery rate of \\kepler-extracted frequencies. Our `smart binning' method allows for robust extraction of hybrids from large unlabelled datasets, with an average out-of-bag prediction for test set hybrids at 93.04\\%. The analysis of dominant frequencies in high-probability candidates shows that we find more pressure-mode dominant hybrids. Our catalogue includes 62,026 new candidate light curves from the nominal and extended TESS missions, with individual probabilities of being a hybrid in each available sector.",
      "pdf_url": "https://arxiv.org/pdf/2511.20908.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20948",
      "title": "High-order Gravity-mode Period Spacing Patterns of Intermediate-mass ($1.5 \\, M_\\odot < M < 3 \\, M_{\\odot}$) Main-sequence Stars I. Perturbative Analysis",
      "authors": [
        "Yoshiki Hatta",
        "Takashi Sekii"
      ],
      "abstract": "High-order Gravity-mode Period Spacing Patterns of Intermediate-mass ($1.5 \\, M_\\odot < M < 3 \\, M_{\\odot}$) Main-sequence Stars I. Perturbative Analysis Yoshiki Hatta, Takashi Sekii 17 pages, 7 figures, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) Theoretical study of high-order gravity-mode period spacing ($\\Delta P_g$) pattern is relevant for the better understanding of internal properties of intermediate-mass ($1.5 \\, M_\\odot < M < 8 \\, M_{\\odot}$) main-sequence g-mode pulsators. In this paper, we carry out the first-order perturbative analysis to evaluate effects of a sharp, though not discontinuous, transition in the Brunt-Väisälä (BV) frequency on the $\\Delta P_g$ pattern. Such a finite-width transition in the BV frequency, whose scale height can be comparable to the local wavelength of gravity waves, is expected to develop in relatively low-mass ($1.5 \\, M_\\odot < M < 3 \\, M_{\\odot}$) main-sequence stars, causing a bump in the second derivative of the BV frequency. Inspired by Unno et al.'s formulation, we treat the bump in the second derivative of the BV frequency as a small perturbation, which allows us to derive an analytical expression of the $\\Delta P_g$ pattern. The analytical expression shows that the amplitude of the oscillatory $\\Delta P_g$ pattern is determined by a weighted average of the bump in the second derivative of the BV frequency where the weighting function is given by the g-mode eigenfunction. Tests with low-mass ($\\sim 2 \\, M_\\odot$) main-sequence stellar models show that the analytical expression can reproduce the $\\Delta P_g$ patterns numerically computed reasonably well. The results of our perturbative analysis will be useful for, e.g., improving semi-analytical expressions of the $\\Delta P_g$ pattern, which would enable us to investigate $\\Delta P_g$ patterns of SPB stars and $\\gamma$ Dor stars for inferring chemical composition profile and rotation rates.",
      "pdf_url": "https://arxiv.org/pdf/2511.20948.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21062",
      "title": "Multiwavelength Observations for a Double-decker Filament Channel in AR 13102",
      "authors": [
        "Yin Zhang",
        "Baolin Tan",
        "Quan Wang",
        "Jing Huang",
        "Zhe Xu",
        "Kanfan Ji",
        "Xiao Yang",
        "Jie Chen",
        "Xianyong Bai",
        "Zhenyong Hou",
        "Yuanyong Deng"
      ],
      "abstract": "Multiwavelength Observations for a Double-decker Filament Channel in AR 13102 Yin Zhang, Baolin Tan, Quan Wang, Jing Huang, Zhe Xu, Kanfan Ji, Xiao Yang, Jie Chen, Xianyong Bai, Zhenyong Hou, Yuanyong Deng Solar and Stellar Astrophysics (astro-ph.SR) We present the observational evidence of the existence of a double-decker filament channel (FC) by using observations in extreme ultraviolet and H{\\alpha} wavelengths. For both FCs, the east foot-point roots in the active region (AR), while the west one roots in the remote quiet region. The bottom FC (FC1) appears as intermittent filaments. Within the AR, the FC1 appears as an S-shaped filament (F1), which consisted of two J-shaped filaments (F1S/F1N for the south/north one). For the upper one (FC2), only the east part is filled with dark plasma and visible as a small filament (F2). Its east foot-point roots around the junction of F1S and F1N. Initially, due to the recurrent reconnections, F1N and F1S link to each other and form a new filament (F3) thread by thread. Meanwhile, the heated plasma, which appears as brightening features, flows from the east foot-point of F2 to the west, and becomes invisible about 1.1$\\times$10^{5} km away. The failed eruption of F1S is triggered by the reconnection, which appears as the brightening threads changing their configuration from crossed to quasiparallel in between the F1S and F3, and is confined by the upper magnetic field. Associated with the eruption, the distant invisible plasma becomes visible as a brightening feature. It continuously flows to the remote foot-point, and becomes invisible before reaching it. The brightening plasma flow outlines the skeleton of FC2 gradually. The observations show the existence of a double-decker FC, as a magnetic structure, before they appear as a brightening/dark feature when fully filled with hot/cool plasma.",
      "pdf_url": "https://arxiv.org/pdf/2511.21062.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21347",
      "title": "Resonance locking and tidal evolution in rotating γ-Doradus binaries",
      "authors": [
        "L. Fellay",
        "M.-A. Dupret",
        "P. A. Kołaczek-Szymański"
      ],
      "abstract": "Resonance locking and tidal evolution in rotating γ-Doradus binaries L. Fellay, M.-A. Dupret, P. A. Kołaczek-Szymański accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) In binary systems, studying tidal interactions is key to understanding the evolution of binary populations. The primary dissipation process occurring in stars with radiative envelopes is believed to be radiative damping of high-radial-order tidally excited oscillations, which is in agreement with observations of most binary systems. However, recent studies have suggested that outside this dissipation regime, dynamical tides can act in the opposite manner (a phenomenon known as inverse tides), and resonance locking could significantly impact the orbital evolution of binary systems. We aim to study inverse tides and resonance locking by simultaneously including the effect of all the forcing frequencies and accounting for the effect of the rotation on the forced oscillations. We have developed an orbital evolution code that is coupled to a stellar oscillation code to compute on the fly the impact of dynamical tides on the rotational and orbital evolution of binary systems including multiple simultaneous forcing frequencies. We find that resonance locking can be stable over a long period of time and a source of long-term exchange of angular momentum for rapidly rotating stars. Long-term locking can increase the total angular momentum of a fast-rotating star by approximately 70% during the main sequence. For slow-rotating stars, resonance locking can slow down the rotational evolution of the system over most of the main-sequence phase, even in the presence of strong tidal interactions. This mechanism efficiently drives asynchronisation in binary systems where significant discrepancies already exist between the orbital and rotational frequencies.",
      "pdf_url": "https://arxiv.org/pdf/2511.21347.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21511",
      "title": "Variability of H$α$ chromospheric activity of solar-like stars revealed by the time-domain data of LAMOST Medium-Resolution Spectroscopic Survey",
      "authors": [
        "Han He",
        "Ali Luo",
        "Haotong Zhang",
        "Song Wang"
      ],
      "abstract": "Variability of H$α$ chromospheric activity of solar-like stars revealed by the time-domain data of LAMOST Medium-Resolution Spectroscopic Survey Han He, Ali Luo, Haotong Zhang, Song Wang 43 pages, 19 figures, 2 tables, Accepted for publication in Astrophysics and Space Science Solar and Stellar Astrophysics (astro-ph.SR) The variability of H$\\alpha$ chromospheric activity of solar-like stars is investigated by using the time-domain data of LAMOST Medium-Resolution Spectroscopic Survey (MRS). We use $R_\\mathrm{H\\alpha}$ index (ratio of H$\\alpha$ luminosity to bolometric luminosity) to measure the H$\\alpha$ activity intensity of a spectrum, and utilize the median of the $R_\\mathrm{H\\alpha}$ values of multiple observations ($R_\\mathrm{H\\alpha}^\\mathrm{median}$) as the representative activity intensity of a stellar source. The H$\\alpha$ variability of a stellar source is indicated by the extent of $R_\\mathrm{H\\alpha}$ fluctuation ($R_\\mathrm{H\\alpha}^\\mathrm{EXT}$) of multiple observations. Our sample shows that $R_\\mathrm{H\\alpha}^\\mathrm{EXT}$ of solar-like stars is about one order of magnitude smaller than $R_\\mathrm{H\\alpha}^\\mathrm{median}$. The distribution of $\\log R_\\mathrm{H\\alpha}^\\mathrm{EXT}$ versus $\\log R_\\mathrm{H\\alpha}^\\mathrm{median}$ reveals the distinct behaviors between the stellar source categories with lower ($\\log R_\\mathrm{H\\alpha}^\\mathrm{median} < -4.85$) and higher ($\\log R_\\mathrm{H\\alpha}^\\mathrm{median} > -4.85$) activity intensity. For the former stellar source category, the top envelope of the distribution first increases and then decreases with $\\log R_\\mathrm{H\\alpha}^\\mathrm{median}$; while for the latter category, the top envelope of the distribution is largely along a positive correlation line. In addition, for the stellar sources with lower activity intensity, the large-$\\log R_\\mathrm{H\\alpha}^\\mathrm{EXT}$ objects near the top envelope of the $\\log R_\\mathrm{H\\alpha}^\\mathrm{EXT}$ versus $\\log R_\\mathrm{H\\alpha}^\\mathrm{median}$ distribution tend to have long-term and regular variations of H$\\alpha$ activity; while for the stellar sources with higher activity intensity, the H$\\alpha$ variations are more likely to be random fluctuations.",
      "pdf_url": "https://arxiv.org/pdf/2511.21511.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21589",
      "title": "Formation and nature of \"Huntsman\" binary pulsars",
      "authors": [
        "O. G. Benvenuto",
        "M. A. De Vito",
        "M. Echeveste",
        "M. L. Novarino",
        "N. D. Pires",
        "L. M. de Sá",
        "J. E. Horvath"
      ],
      "abstract": "Formation and nature of \"Huntsman\" binary pulsars O. G. Benvenuto, M. A. De Vito, M. Echeveste, M. L. Novarino, N. D. Pires, L. M. de Sá, J. E. Horvath Benvenuto, O. G., De Vito, M. A., Echeveste, M., et al. 2025, Astronomy & Astrophysics, Volume 698, id.L5, 5 pp Solar and Stellar Astrophysics (astro-ph.SR) Spider systems are a class of close binaries in which a neutron star first accretes from a normal companion, and later ablates it in some cases. New observations have expanded this category, with the addition of a Huntsman group, tentatively linked to a short donor phase along the red bump in the secondary evolutionary track. We present explicit evolutionary tracks that support the Huntsman nature recently suggested, and discuss how the whole class of spiders emerges from the full consideration of irradiation and ablating winds. We address the irradiation feedback (IFB) effects and the hydrogen-shell burning detachment (HSBD) simultaneously, and show that they act independently and do not interfere with each other, supporting a physical picture of the Huntsman group. We employ our binary evolution code to compute a suite of binary systems formed by a donor star and a neutron star for different initial orbital periods, assuming solar composition and Z=0.01. Although many models do not consider IFB, we also present the evolution with IFB for one system as an example. We found that the recently suggested association of Huntsman pulsar with the evolutionary stage where (as a consequence of the dynamics of HSBD) the system remains detached for a few million years is plausible. However, this feature alone is unable to account for the occurrence of Redback spider pulsars. Meanwhile, models including IFB, with pulsed mass transfer, display detachment episodes that can be naturally associated with the Redback stage. Irradiation feedback does not preclude or modify HSBD and in fact, Huntsman systems were already present as an implicit prediction in our earlier calculations. We conclude that Huntsman is an expected stage of the spider systems under quite general conditions. This is another step towards a unified picture of spider pulsars as a group.",
      "pdf_url": "https://arxiv.org/pdf/2511.21589.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20923",
      "title": "The Diversity of Cold Worlds: Age and Characterization of the Exoplanet COCONUTS-2b",
      "authors": [
        "Rocio Kiman , Charles A. Beichman , Azul Ruiz Diaz , Jacqueline K. Faherty , Brianna Lacy , Genaro Suarez , Federico Marocco , J. Davy Kirkpatrick , Jonathan Gagne , Jessica Copeland , Ben Burningham , Niall Whiteford , Melanie J. Rowland , Daniella C. Bardalez Gagliuffi , Johanna M. Vos , Adam C. Schneider , Eileen C. Gonzales , Sherelyn Alejandro Merchan , Austin Rothermich , Richard Smart , Edgardo Costa , Rene A. Mendez Department of Astronomy, California Institute of Technology, Pasadena, CA 91125, USA, Infrared Processing and Analysis Center, California Institute of Technology, 1200 E. California Boulevard, Pasadena, CA 91125, USA, Department of Astrophysics, American Museum of Natural History, Central Park West at 79th St, New York, NY 10024, USA, Department of Astronomy and Astrophysics, University of California, Santa Cruz, CA, USA, Planetarium de Montreal, Espace pour la Vie, 4801 av. Pierre-de Coubertin, Montreal, Quebec, Canada, Trottier Institute for Research on Exoplanets, Universite de Montreal, Departement de Physique, C.P. 6128 Succ. Centre-ville, Montreal, QC H3C 3J7, Canada, Department of Physics, Astronomy and Mathematics, University of Hertfordshire, Hatfield, UK, Department of Astronomy, University of Texas at Austin, Austin, TX, USA, Department of Physics and Astronomy, Amherst College, Amherst, MA, USA, School of Physics, Trinity College Dublin, The University of Dublin, Dublin 2, Ireland, United States Naval Observatory, Flagstaff Station, 10391 West Naval Observatory Rd., Flagstaff, AZ 86005, USA, Department of Physics and Astronomy, San Francisco State University, 1600 Holloway Ave., San Francisco, CA 94132, USA, Department of Physics, Graduate Center, City University of New York, 365 5th Ave., New York, NY 10016, USA, Department of Physics and Astronomy, Hunter College, City University of New York, 695 Park Avenue, New York, NY, 10065, USA, Backyard Worlds: Planet 9, Osservatorio Astronomico di Torino, Pino Torinese, Piemonte, IT, Departamento de Astronomia, Universidad de Chile, Casilla 36-D, Santiago, Chile)"
      ],
      "abstract": "The Diversity of Cold Worlds: Age and Characterization of the Exoplanet COCONUTS-2b Rocio Kiman (1), Charles A. Beichman (1 and 2), Azul Ruiz Diaz (3), Jacqueline K. Faherty (3), Brianna Lacy (4), Genaro Suarez (3), Federico Marocco (2), J. Davy Kirkpatrick (2), Jonathan Gagne (5 and 6), Jessica Copeland (7), Ben Burningham (7), Niall Whiteford (3), Melanie J. Rowland (8), Daniella C. Bardalez Gagliuffi (9), Johanna M. Vos (10 and 3), Adam C. Schneider (11), Eileen C. Gonzales (12), Sherelyn Alejandro Merchan (3 and 13), Austin Rothermich (3, 13, 14 and 15), Richard Smart (16), Edgardo Costa (17), Rene A. Mendez (17) ((1) Department of Astronomy, California Institute of Technology, Pasadena, CA 91125, USA, (2) Infrared Processing and Analysis Center, California Institute of Technology, 1200 E. California Boulevard, Pasadena, CA 91125, USA, (3) Department of Astrophysics, American Museum of Natural History, Central Park West at 79th St, New York, NY 10024, USA, (4) Department of Astronomy and Astrophysics, University of California, Santa Cruz, CA, USA, (5) Planetarium de Montreal, Espace pour la Vie, 4801 av. Pierre-de Coubertin, Montreal, Quebec, Canada, (6) Trottier Institute for Research on Exoplanets, Universite de Montreal, Departement de Physique, C.P. 6128 Succ. Centre-ville, Montreal, QC H3C 3J7, Canada, (7) Department of Physics, Astronomy and Mathematics, University of Hertfordshire, Hatfield, UK, (8) Department of Astronomy, University of Texas at Austin, Austin, TX, USA, (9) Department of Physics and Astronomy, Amherst College, Amherst, MA, USA, (10) School of Physics, Trinity College Dublin, The University of Dublin, Dublin 2, Ireland, (11) United States Naval Observatory, Flagstaff Station, 10391 West Naval Observatory Rd., Flagstaff, AZ 86005, USA, (12) Department of Physics and Astronomy, San Francisco State University, 1600 Holloway Ave., San Francisco, CA 94132, USA, (13) Department of Physics, Graduate Center, City University of New York, 365 5th Ave., New York, NY 10016, USA, (14) Department of Physics and Astronomy, Hunter College, City University of New York, 695 Park Avenue, New York, NY, 10065, USA, (15) Backyard Worlds: Planet 9, (16) Osservatorio Astronomico di Torino, Pino Torinese, Piemonte, IT, (17) Departamento de Astronomia, Universidad de Chile, Casilla 36-D, Santiago, Chile) 22 pages, 11 figures, 4 tables. Accepted for publication The Astronomical Journal Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Studying cold brown dwarfs is key to understanding the diverse characteristics of cold giant exoplanets atmospheres. COCONUTS-2, is a wide binary system composed of a T9 brown dwarf and an M3 star, which presents a unique opportunity to characterize a cold benchmark brown dwarf. As part of a JWST program to study the range of physical and atmospheric properties of the coldest brown dwarfs, we obtained NIRSpec G395H spectra (R~2700, 2.87-5.13 um) and MIRI F1000W, F1280W, and F1800W photometry for COCONUTS-2b. In this work, we find a 99% probability of the system belonging to the Corona of Ursa Major (414+/-23 Myr) using BANYAN Sigma and its full kinematics. We also re-estimate the astrometry of COCONUTS-2b using the MIRI data. We support the membership with a comparison of rotation period, metallicity and C/O ratio of the group with those of the COCONUTS-2 system. We also calculate its bolometric luminosity, which combined with our age estimation, allows us to derive its mass, effective temperature, surface gravity, and radius with high precision. As a result of our analysis, we support the conclusion that COCONUTS-2b is a planetary mass object (7.5+/-0.4 MJup) which was likely formed via the same mechanism as stars. In addition we compare the JWST spectrum to another object in the sample, J082507.35+280548.5 (0825+2805), a Y0.5 brown dwarf, which is a candidate member of the same moving group, but has a lower mass (3.7+/-0.2 MJup). We identify absorption feature differences which could indicate that 0825+2805 has stronger vertical mixing.",
      "pdf_url": "https://arxiv.org/pdf/2511.20923.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21184",
      "title": "The WEAVE-TwiLight-Survey: Expanding WEAVE's Reach to Bright and Low-Surface-Density Targets with a Novel Observing Mode",
      "authors": [
        "Thomas Hajnik , Nicholas A. Walton , Giuseppe D'Ago , Piercarlo Bonifacio , Gavin Dalton , Lilian Dominguez-Palmero , Emanuel Gafton , Mike J. Irwin , Sergio Pico , David Terrett , Anke Ardern-Arentsen , Ruben Sanchez-Janssen , David S. Aguado , J. Alfonso L. Aguerri , Carlos Allende Prieto , Marc Balcells , Chris Benn , Angela Bragaglia , Elisabetta Caffau , Esperanza Carrasco , Ricardo Carrera , Silvano Desidera , Boris T. Gansicke , Sarah Hughes , Shoko Jin , Ian Lewis , Alireza Molaeinezhad , David N. A. Murphy , Ellen Schallig , Scott Trager , Antonella Vallenari Institute of Astronomy, University of Cambridge, Cambridge, UK, Observatoire de Paris, Meudon, France, University of Oxford, Oxford, UK, STFC Rutherford Appleton Laboratory, Harwell, UK, Isaac Newton Group, Santa Cruz de La Palma, Spain, Instituto de Astrofisica de Canarias, La Laguna, Spain, Universidad de La Laguna, La Laguna, Spain, INAF-OAS Bologna, Bologna, Italy, INAOE, Tonantzintla, Mexico, INAF-Osservatorio Astronomico di Padova, Padova, Italy, University of Warwick, Coventry, UK, MIT Kavli Institute, Cambridge, USA, Kapteyn Astronomical Institute, Groningen, The Netherlands)"
      ],
      "abstract": "The WEAVE-TwiLight-Survey: Expanding WEAVE's Reach to Bright and Low-Surface-Density Targets with a Novel Observing Mode Thomas Hajnik (1), Nicholas A. Walton (1), Giuseppe D'Ago (1), Piercarlo Bonifacio (2), Gavin Dalton (3 and 4), Lilian Dominguez-Palmero (5 and 6), Emanuel Gafton (5), Mike J. Irwin (1), Sergio Pico (5), David Terrett (3 and 4), Anke Ardern-Arentsen (1), Ruben Sanchez-Janssen (5), David S. Aguado (6 and 7 and 1), J. Alfonso L. Aguerri (6 and 7), Carlos Allende Prieto (6 and 7), Marc Balcells (5 and 6 and 7), Chris Benn (5), Angela Bragaglia (8), Elisabetta Caffau (2), Esperanza Carrasco (9), Ricardo Carrera (8), Silvano Desidera (10), Boris T. Gansicke (11), Sarah Hughes (12), Shoko Jin (13), Ian Lewis (3), Alireza Molaeinezhad (1), David N. A. Murphy (1), Ellen Schallig (3), Scott Trager (13), Antonella Vallenari (10) ((1) Institute of Astronomy, University of Cambridge, Cambridge, UK, (2) Observatoire de Paris, Meudon, France, (3) University of Oxford, Oxford, UK, (4) STFC Rutherford Appleton Laboratory, Harwell, UK, (5) Isaac Newton Group, Santa Cruz de La Palma, Spain, (6) Instituto de Astrofisica de Canarias, La Laguna, Spain, (7) Universidad de La Laguna, La Laguna, Spain, (8) INAF-OAS Bologna, Bologna, Italy, (9) INAOE, Tonantzintla, Mexico, (10) INAF-Osservatorio Astronomico di Padova, Padova, Italy, (11) University of Warwick, Coventry, UK, (12) MIT Kavli Institute, Cambridge, USA, (13) Kapteyn Astronomical Institute, Groningen, The Netherlands) Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Current-day multi-object spectroscopic surveys are often limited in their ability to observe bright stars due to their low surface densities, resulting in increased observational overheads and reduced efficiency. Addressing this, we have developed a novel observing mode for WEAVE (William Herschel Telescope Enhanced Area Velocity Explorer) that enables efficient observations of low-surface-density target fields without incurring additional overheads from calibration exposures. As a pilot for the new mode, we introduce the WEAVE-TwiLight-Survey (WTLS), focusing on bright exoplanet-host stars and their immediate surroundings on the sky. High observational efficiency is achieved by superimposing multiple low-target-density fields and allocating the optical fibres in this configuration. We use a heuristic method to define fields relative to a central guide star, which serves as a reference for their superposition. Suitable guide fibres for each merged configuration are selected using a custom algorithm. Test observations have been carried out, demonstrating the feasibility of the new observing mode. We show that merged field configurations can be observed with WEAVE using the proposed method. The approach minimizes calibration times and opens twilight hours to WEAVE's operational schedule. WTLS is built upon the new observing mode and sourced from the ESA PLATO long-duration-phase fields. This survey will result in a homogeneous catalogue of approximately 6300 bright stars, including 62 known planet hosts, laying the groundwork for future elemental abundance studies tracing chemical patterns of planetary formation. This new observing mode (WEAVE-Tumble-Less) expands WEAVE's capabilities to rarely used on-sky time and low-density field configurations without sacrificing efficiency.",
      "pdf_url": "https://arxiv.org/pdf/2511.21184.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21611",
      "title": "Transit Timing of the White Dwarf-Cold Jupiter System WD 1856+534",
      "authors": [
        "Eli A. Gendreau-Distler",
        "Kate B. Bostow",
        "Kishore C. Patra",
        "Efrain Alvarado III",
        "Andreas Betz",
        "Victoria M. Brendel",
        "Vidhi Chander",
        "Asia A. DeGraw",
        "Cooper Jacobus",
        "Connor F. Jennings",
        "Ann Mina",
        "Ansel Parke",
        "Riley Patlak",
        "Neil R. Pichay",
        "Sophia Risin",
        "Edgar P. Vidal",
        "William Wu",
        "Thomas G. Brink",
        "WeiKang Zheng",
        "Alexei V. Filippenko"
      ],
      "abstract": "Transit Timing of the White Dwarf-Cold Jupiter System WD 1856+534 Eli A. Gendreau-Distler, Kate B. Bostow, Kishore C. Patra, Efrain Alvarado III, Andreas Betz, Victoria M. Brendel, Vidhi Chander, Asia A. DeGraw, Cooper Jacobus, Connor F. Jennings, Ann Mina, Ansel Parke, Riley Patlak, Neil R. Pichay, Sophia Risin, Edgar P. Vidal, William Wu, Thomas G. Brink, WeiKang Zheng, Alexei V. Filippenko Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We present new transit timing measurements for the white dwarf-cold Jupiter system WD 1856+534, extending the baseline of observations from 311 epochs to 1498 epochs. The planet is unlikely to have survived the host star's red-giant phase at its present location and is likely too small for common-envelope evolution to take place. As such, a plausible explanation for the short semimajor axis is that the exoplanet started out on a much larger orbit and then spiraled inward through high-eccentricity tidal migration (HETM). A past transit-timing analysis found tentative evidence for orbital growth, which could have been interpreted as a residual effect of HETM, but we find the data are consistent with a constant-period model after adding 18 new transit measurements. We use the estimated period derivative $\\dot{P} = 0.04\\pm0.43$ ms yr$^{-1}$ to place a lower limit on the planetary tidal quality factor of $Q_p' \\gtrsim 3.1 \\times 10^6$, consistent with that of Jupiter in our own Solar System. We also test for the presence of companion planets in the system, which could have excited WD 1856 b onto an eccentric orbit via the Kozai-Lidov process, and ultimately rule out the presence of an additional planet with a mass greater than $4.1\\,M_J$ and a period shorter than 1500 days. We find no evidence for nonzero eccentricity, with an upper limit of $e\\lesssim10^{-2}$. If the planet indeed reached its current orbit through HETM, the low present-day eccentricity indicates that the migration process has now ceased, and any further orbital evolution will be governed solely by weak planetary tides.",
      "pdf_url": "https://arxiv.org/pdf/2511.21611.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.12057",
      "title": "Spectral synthesis of 3D unified model atmospheres with winds for O stars",
      "authors": [
        "L. Delbroek",
        "J.O. Sundqvist",
        "D. Debnath",
        "N. Moens",
        "F. Backs",
        "C. Van der Sijpt",
        "O. Verhamme",
        "P. Schillemans"
      ],
      "abstract": "Spectral synthesis of 3D unified model atmospheres with winds for O stars L. Delbroek, J.O. Sundqvist, D. Debnath, N. Moens, F. Backs, C. Van der Sijpt, O. Verhamme, P. Schillemans Solar and Stellar Astrophysics (astro-ph.SR) Spectroscopic studies of massive and luminous O-type stellar atmospheres and winds have primarily been done by using 1D, spherically symmetric and stationary models. Both observations and modern theoretical models show that such stars have highly structured and variable atmospheres and winds. We present first spectral synthesis based on 3D time-dependent unified RHD model atmospheres with winds for O stars. We first carried out time-dependent, 3D simulations of unified atmospheres with winds. We then used 3D radiative transfer to compute surface brightness maps for the optical continuum as well as integrated flux profiles for select diagnostic lines. To derive occupation numbers and source functions, an aNLTE method was used, as well as scattering source functions. Our continuum intensity maps of a prototypical early O star reveal a highly variable and time-dependent surface, characterised by local emergent radiation temperature variations. Our averaged synthetic line profiles of optical absorption lines have large widths, without applying any macro- or microturbulence. From the simulations we find correspondingly large velocity dispersions in the photospheric layers. Additionally, the absorption line EWs are larger than for comparable 1D models. First results using scattering source functions further demonstrate that characteristic features like the softening of the blue edge of strong ultra-violet wind lines are qualitatively well-reproduced by our models. Our 3D simulations clearly predict a highly structured and strongly variable O star surface. First line profile results further suggest that several observed features are naturally reproduced by our models without the need to introduce ad-hoc spectral fitting parameters. We also discuss how using 3D rather than 1D simulations as a basis for future studies may affect the derivation of fundamental stellar parameters.",
      "pdf_url": "https://arxiv.org/pdf/2507.12057.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20763",
      "title": "A Direct Calibration Algorithm for ADC Interleaving",
      "authors": [
        "Chi-kwan Chan",
        "Hina Suzuki",
        "David Forbes",
        "Andrew Thomas West",
        "Arash Roshanineshat",
        "Daniel P. Marrone",
        "Amy Lowitz"
      ],
      "abstract": "A Direct Calibration Algorithm for ADC Interleaving Chi-kwan Chan, Hina Suzuki, David Forbes, Andrew Thomas West, Arash Roshanineshat, Daniel P. Marrone, Amy Lowitz 9 pages, 3 figures, comments welcomed Instrumentation and Methods for Astrophysics (astro-ph.IM); Signal Processing (eess.SP) We introduce a novel direct calibration algorithm to address phase delay, gain, and offset mismatches in Analog-to-Digital Converter (ADC) time interleaving systems. These mismatches, common in high-speed data acquisition, degrade system performance and signal integrity, particularly in applications such as radio astronomy and very long baseline interferometry (VLBI). Our proposed algorithm uses a sinusoidal reference signal and Fourier analysis to isolate and correct each type of mismatch, providing a computationally efficient solution. Extensive numerical simulations validate the algorithm's effectiveness and demonstrate its ability to significantly enhance signal reconstruction accuracy compared to existing methods. This work provides a robust and scalable solution for maintaining signal fidelity in interleaved ADC systems and has broad applications in fields that require high-speed data acquisition.",
      "pdf_url": "https://arxiv.org/pdf/2511.20763.pdf",
      "categories": [
        "astro-ph.IM",
        "eess.SP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20764",
      "title": "TriPoDPy: 1D Tri-Population size distributions forDust evolution in protoplanetary disks",
      "authors": [
        "Nicolas Leo Kaufmann",
        "Thomas Pfeil",
        "Sebastian Stammler",
        "Anna Penzlin",
        "Sandro Christian Paetzold",
        "Til Birnstiel"
      ],
      "abstract": "TriPoDPy: 1D Tri-Population size distributions forDust evolution in protoplanetary disks Nicolas Leo Kaufmann, Thomas Pfeil, Sebastian Stammler, Anna Penzlin, Sandro Christian Paetzold, Til Birnstiel Submitted to the Journal of Open Source Software (JOSS). Documentation: this https URL Repository: this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) TriPoDPy is a code simulating the dust evolution, including dust growth and dynamics in protoplanetary disks using the parametric dust model presented in (Pfeil et al., 2024). The simulation evolves a dust distribution in a one-dimensional grid in the radial direction. It's written in Python and the core routines are implemented in Fortran90. The code not only solves for the evolution of the dust but also the gas disk with the canonical alpha-description (Shakura & Sunyaev, 1973). In addition to the original model, we added descriptions of tracers for the dust and gas, which could be used for compositional tracking of additional components.",
      "pdf_url": "https://arxiv.org/pdf/2511.20764.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21207",
      "title": "Enhancing Galaxy Classification with U-Net Variational Autoencoders. II. JWST High Redshift Galaxy Sample",
      "authors": [
        "Sergey Mirzoyan"
      ],
      "abstract": "Enhancing Galaxy Classification with U-Net Variational Autoencoders. II. JWST High Redshift Galaxy Sample Sergey Mirzoyan 9 pages, 2 figures, Research in Astronomy and Astrophysics in press Instrumentation and Methods for Astrophysics (astro-ph.IM) Building on our previous work, we apply a U-Net Variational Autoencoder (VAE) framework to denoise galaxy images from the James Webb Space Telescope (JWST) and enhance morphological classification. This study focuses on galaxies observed up to redshift approximately at 8, capturing them at early evolutionary stages where their faintness and structural complexity pose challenges for the traditional classification methods. By mitigating observational noise, our approach enables the identification of morphological features, particularly in distinguishing between disk and non-disk galaxy types. We evaluate the denoising performance using standard image quality metrics and demonstrate that the enhanced images lead to improved classification accuracy across multiple deep learning models. Our analysis of a sample of 292 galaxies up to z=7.69 shows 83 galaxies classified as disk-like by the GCNN model with high confidence, of those approximately 70-80 % are of redshifts greater than 3. These findings suggest that disk-like structures can be prevalent in the early universe. The results highlight the potential of VAE-based denoising as a robust pre-processing step for analyzing high-redshift galaxy populations in ongoing astronomical surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.21207.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.02285",
      "title": "Deep Investigation of Neutral Gas Origins (DINGO): Options for the Processing and Storage of Radio Astronomy Data for robust Deep Spectral Line Imaging in the SKA-Era using uv-Grids",
      "authors": [
        "Alexander Williamson",
        "Richard Dodson",
        "Pascal J. Elahi",
        "Jonghwan Rhee",
        "Qian Gong",
        "Martin Meyer",
        "Kristof Rozgonyi",
        "Andreas Wicenec",
        "Jieyang Chen",
        "Norbert Podhorszki",
        "Scott Klasky",
        "Daniel Mitchell"
      ],
      "abstract": "Deep Investigation of Neutral Gas Origins (DINGO): Options for the Processing and Storage of Radio Astronomy Data for robust Deep Spectral Line Imaging in the SKA-Era using uv-Grids Alexander Williamson, Richard Dodson, Pascal J. Elahi, Jonghwan Rhee, Qian Gong, Martin Meyer, Kristof Rozgonyi, Andreas Wicenec, Jieyang Chen, Norbert Podhorszki, Scott Klasky, Daniel Mitchell Instrumentation and Methods for Astrophysics (astro-ph.IM) The next generation of radio astronomy telescopes are challenging existing data analysis paradigms, as they have an order of magnitude more antennas and larger bandwidth. Foremost amongst these are deep spectral line surveys, because these have the largest number of epochs and spectral channels per dataset. For example, the Deep Investigation of Neutral Gas Origins (DINGO) project on the Australian Square Kilometre Array Pathfinder (ASKAP) aims to observe over 3,000 hours spread over hundreds of observing sessions, covering two pointings and two frequency settings. The two primary problems encountered when processing this data are the need for storage and that processing is primarily I/O limited. To address these issues, we have implemented an deep imaging pipeline based on the storage of an intermediate data product in the software ASKAPSoft, that of the uv-gridded data, and have demonstrated lossy and lossless compression of this data on ASKAP, using MGARD and ADIOS2 libraries. We find data compression ratios from a factor of 7 (lossless) up to 20 (using lossy compression with an absolute error bound of $10^{-4}$), and processing is faster by a factor of 7 for lossless compression. We discuss the effectiveness of lossy MGARD compression and its adherence to the designated error bounds, the trade-off between these error bounds and the corresponding compression ratios, as well as the potential consequences of these I/O and storage improvements on the science quality of the data products.",
      "pdf_url": "https://arxiv.org/pdf/2410.02285.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.03147",
      "title": "Eclipse Mapping with Ariel: Future Prospects for a Population-Level Mapping Survey",
      "authors": [
        "Daniel Valentine",
        "Hannah R. Wakeford",
        "Mark Hammond",
        "Ryan C. Challener",
        "Billy Edwards",
        "Theresa Lüftinger",
        "Maximillian N. Günther"
      ],
      "abstract": "Eclipse Mapping with Ariel: Future Prospects for a Population-Level Mapping Survey Daniel Valentine, Hannah R. Wakeford, Mark Hammond, Ryan C. Challener, Billy Edwards, Theresa Lüftinger, Maximillian N. Günther Main text - 25 pages, 16 figures, 4 tables. Published in MNRAS Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Eclipse mapping is a powerful tool for measuring 3D profiles of exoplanet atmospheres. To date, only JWST has been capable of widely applying this technique, but as a general observatory, it is too time-limited to conduct population-level mapping studies. Ariel, on the other hand, is a dedicated exoplanet mission set to observe 1000 transiting exoplanets, making it a natural candidate for this. To assess Ariel's mapping potential, we quantitatively benchmark its abilities against those of JWST using a simulation-and-retrieval framework with existing JWST eclipse maps as test cases. We find that for high-ranking targets, Ariel will be able to derive qualitatively similar maps to JWST using the same amount of observations; for mid-ranking targets, Ariel will be able to compete using as few as 3x as many observations; and for lower-ranking targets, the use of phase curves overcomes the need for an impractical number of repeated eclipse observations. We find that while Ariel is unlikely to have extensive latitudinal mapping abilities, it will have wide-ranging longitudinal abilities, from which the first-order atmospheric dynamics can be constrained. Using an analytically-derived metric, we determine the best eclipse mapping targets for Ariel, finding that it will be able to map nearly 100 targets using full phase curves in only quarter of its lifetime. This would be the largest mapping survey to date, and have enormous ramifications for our demographic understanding of exoplanet atmospheric dynamics. Finally, we rank all the best mapping targets for both JWST and Ariel in order to encourage future eclipse mapping studies.",
      "pdf_url": "https://arxiv.org/pdf/2510.03147.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21323",
      "title": "Concurrent Accretion and Migration of Giant Planets in their Natal Disks with Consistent Accretion Torque (II): Parameter Survey and Condition for Outward Migration",
      "authors": [
        "JunPeng Pan",
        "Ya-Ping Li",
        "Yi-Xian Chen",
        "Shigeru Ida",
        "Douglas N. C. Lin"
      ],
      "abstract": "Concurrent Accretion and Migration of Giant Planets in their Natal Disks with Consistent Accretion Torque (II): Parameter Survey and Condition for Outward Migration JunPeng Pan, Ya-Ping Li, Yi-Xian Chen, Shigeru Ida, Douglas N. C. Lin 14 pages, 7 figures, 1 table. Accepted for publication in The Astrophysical Journal Earth and Planetary Astrophysics (astro-ph.EP) Migration typically occurs during the formation of planets and is closely linked to the planetary formation process. In classical theories of non-accreting planetary migration, both type I and type II migration typically result in inward migration, which is hard to align with the architecture of the planetary this http URL this work, we conduct systematic, high-resolution 3D/2D numerical hydrodynamic simulations to investigate the migration of an accreting planet. Under different disk conditions, we compared the dynamical evolution of planets with different planet-to-star mass ratios. We find that accretion of planets can significantly diminish the inward migration tendency of planets, or even change the migration direction. The migration of low-/high-mass planets is classified as Type I/II inward migration, respectively, while intermediate-mass planets, which have the strongest accretion, show an outward migration trend. We confirm that the outward migration is mainly attributed to the positive torque from the azimuthal asymmetric structures around the accreting planet, similar to Li et al. (2024). The termination of planetary mass growth is thus synonymous with the transition from outward to inward migration. For the high viscosity $\\alpha=0.04$ and disk aspect ratio height $h_0=0.05$ cases, the mass ratio range for planetary outward migration is $1\\times10^{-4}\\lesssim q\\lesssim4\\times10^{-3}$. For the low viscosity case with $\\alpha=0.001$, and/or the low disk aspect ratio cases $h_0=0.03$, the mass ratio range for the outward migration will shift toward the lower end. Our parameter survey reveals that a simple gap opening parameter determines the outward migration condition; details of the analytical interpretation are presented in Ida et al. (2025).",
      "pdf_url": "https://arxiv.org/pdf/2511.21323.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21328",
      "title": "Planet Migration in Protoplanetary Disks with Rims",
      "authors": [
        "Zhuoya Cao",
        "Ya-Ping Li",
        "Douglas N.C. Lin",
        "Shude Mao"
      ],
      "abstract": "Planet Migration in Protoplanetary Disks with Rims Zhuoya Cao, Ya-Ping Li, Douglas N.C. Lin, Shude Mao 13 pages, 7 figures, Submitted to APJ Earth and Planetary Astrophysics (astro-ph.EP) Complex structures, including sharp edges, rings and gaps, have been commonly observed in protoplanetary disks with or without planetary candidates. Here we consider the possibility that they are the intrinsic consequences of angular momentum transfer mechanisms, and investigate how they may influence the dynamical evolution of embedded planets. With the aid of numerical hydrodynamic simulations, we show that gas giants have a tendency to migrate away from sharp edges, whereas super-Earths embedded in the annuli tend to be retained. This implies that, observationally, Jupiters are preferentially detected in dark rings (gaps), whereas super-Earths tend to be found in bright rings (density bumps). Moreover, planets' tidal torque provide, not necessarily predominant, feedback on the surface density profile. This tendency implies that Jupiter's gap-opening process deepens and widens the density gap associated with the dark ring, while super-Earths can be halted by steep surface density gradient near the disk or ring boundaries. 13Hence, we expect there would be a desert for super-Earths in the surface density gap.",
      "pdf_url": "https://arxiv.org/pdf/2511.21328.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21454",
      "title": "Quantifying the differences in transmission and emission spectra for hot irradiated gaseous exoplanet Atmospheres: A comparison of 1D and 3D modeling using JWST",
      "authors": [
        "Rahul Arora",
        "Liton Majumdar"
      ],
      "abstract": "Quantifying the differences in transmission and emission spectra for hot irradiated gaseous exoplanet Atmospheres: A comparison of 1D and 3D modeling using JWST Rahul Arora, Liton Majumdar Accepted for publication in MNRAS. 16 pages, 12 figures, 6 tables Earth and Planetary Astrophysics (astro-ph.EP) Modeling the atmospheres of exoplanets is fundamental to understanding their atmospheric physics and chemical processes. While one-dimensional (1D) atmospheric models with 1D radiative transfer (RT) have been widely used, advances in three-dimensional (3D) general circulation models (GCMs) and 3D RT methods now allow quantitative comparisons of these approaches. With the precision and sensitivity of JWST, such differences can be observationally tested. This study investigates the spectral variations produced by 1D and 3D models and estimates the JWST observing time or number of transits needed to distinguish them. Using HD 189733b as a case study, three sets of simulations were performed: 1D atmospheric models with 1D RT and 3D GCM models coupled with both 1D and 3D RT. An inherent limitation of our study is that the temperature-pressure (T-P) profiles derived from the 3D GCM extend only to the high-pressure regions. The simulations incorporated both equilibrium and disequilibrium chemistry. Significant spectral discrepancies were found, with 3D models generally showing weaker features. Using a JWST noise simulator, the signal-to-noise ratio (SNR) for detecting these differences was calculated. For transmission spectra, the SNR ranged from 2.04-7.68 (equilibrium) and 1.66-7.04 (disequilibrium), while for emission spectra it ranged from 5.90-34.52 (equilibrium) and 7.11-36.93 (disequilibrium). To test the limitations of the 3D GCM, we extended the atmosphere to lower pressures using an isothermal T-P profile and found wavelength-dependent variations in both the spectra and the SNR. These results show that JWST can distinguish 1D from 3D model spectra for major molecular features, underscoring the importance of 3D modeling in interpreting exoplanetary atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2511.21454.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.16734",
      "title": "The 12CO Gas Structures of Protoplanetary Disks in the Upper Scorpius Region",
      "authors": [
        "Luigi Zallio",
        "Giovanni P. Rosotti",
        "Miguel Vioque",
        "Anna Miotello",
        "Sean M. Andrews",
        "Carlo F. Manara",
        "John M. Carpenter",
        "Aaron Empey",
        "Nicolás T. Kurtovic",
        "Charles J. Law",
        "Cristiano Longarini",
        "Teresa Paneque-Carreño",
        "Richard Teague",
        "Marion Villenave",
        "Hsi-Wei Yen",
        "Francesco Zagaria"
      ],
      "abstract": "The 12CO Gas Structures of Protoplanetary Disks in the Upper Scorpius Region Luigi Zallio, Giovanni P. Rosotti, Miguel Vioque, Anna Miotello, Sean M. Andrews, Carlo F. Manara, John M. Carpenter, Aaron Empey, Nicolás T. Kurtovic, Charles J. Law, Cristiano Longarini, Teresa Paneque-Carreño, Richard Teague, Marion Villenave, Hsi-Wei Yen, Francesco Zagaria Accepted for publication in A&A. 20 pages, 7 tables, 21 figures Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) We present measurements of key protoplanetary disk properties inferred from parametric models of ALMA 12CO spectral line visibilities. We derive gas-disk radii, integrated fluxes, optically thick emission layers, and brightness temperature profiles for the disk population of the old (4 - 14 Myr) Upper Scorpius star-forming region. We measure CO emission sizes for 37 disks with bright CO J=3-2 emission (S/N > 10 on the integrated flux; out of the 83 disks with CO detections), finding that the median radius containing 90% of the flux is ~84 au, with radii spanning from 23 up to 243 au. We report a correlation between the 12CO brightness temperatures and stellar luminosities, with a Pearson coefficient of 0.6, and we use it to prove that the 12CO optically thick emission layer primarily emanates from a region below the super-heated dust, which is optically thin to the stellar irradiation. Moreover, we derive 33 CO emission surface height profiles, finding a median aspect ratio <z/r> ~ 0.16 in a range from ~0.01 up to ~0.45 over the sample. Finally, we comment on the multiple systems in our sample, of which only some were already known. These results re-affirm how it is possible to derive bulk disk properties by modeling moderate angular resolution ALMA visibilities.",
      "pdf_url": "https://arxiv.org/pdf/2511.16734.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.18341",
      "title": "Enriched volatiles and refractories but deficient titanium on the dayside atmosphere of WASP-121b revealed by JWST/NIRISS",
      "authors": [
        "Stefan Pelletier",
        "Louis-Philippe Coulombe",
        "Jared Splinter",
        "Björn Benneke",
        "Ryan J. MacDonald",
        "David Lafrenière",
        "Nicolas B. Cowan",
        "Romain Allart",
        "Emily Rauscher",
        "Robert C. Frazier",
        "Michael R. Meyer",
        "Loïc Albert",
        "Lisa Dang",
        "René Doyon",
        "David Ehrenreich",
        "Laura Flagg",
        "Doug Johnstone",
        "Adam B. Langeveld",
        "Olivia Lim",
        "Caroline Piaulet-Ghorayeb",
        "Michael Radica",
        "Jason Rowe",
        "Jake Taylor",
        "Jake D. Turner"
      ],
      "abstract": "Enriched volatiles and refractories but deficient titanium on the dayside atmosphere of WASP-121b revealed by JWST/NIRISS Stefan Pelletier, Louis-Philippe Coulombe, Jared Splinter, Björn Benneke, Ryan J. MacDonald, David Lafrenière, Nicolas B. Cowan, Romain Allart, Emily Rauscher, Robert C. Frazier, Michael R. Meyer, Loïc Albert, Lisa Dang, René Doyon, David Ehrenreich, Laura Flagg, Doug Johnstone, Adam B. Langeveld, Olivia Lim, Caroline Piaulet-Ghorayeb, Michael Radica, Jason Rowe, Jake Taylor, Jake D. Turner 19 pages, 12 figures, accepted in A&A Earth and Planetary Astrophysics (astro-ph.EP) With dayside temperatures elevated enough for all atmospheric constituents to be present in gas form, ultra-hot Jupiters offer a unique opportunity to probe the composition of giant planets. We aim to infer the composition and thermal structure of the dayside atmosphere of the ultra-hot Jupiter WASP-121b from two NIRISS$/$SOSS secondary eclipses observed as part of a full phase curve. We extract the eclipse spectrum of WASP-121b with two independent data reduction pipelines and analyse it using different atmospheric retrieval prescriptions to explore the effects of thermal dissociation, reflected light, and titanium condensation on the inferred atmospheric properties. We find that the observed dayside spectrum of WASP-121b is best fit by atmosphere models possessing a stratospheric inversion with temperatures reaching over 3000K, with spectral contributions from H2O, CO, VO, H-, and either TiO or reflected light. We measure the atmosphere of WASP-121b to be metal enriched (~10x stellar) but comparatively titanium poor (~1x stellar), potentially due to partial cold-trapping. The inferred C/O depends on model assumptions such as whether reflected light is included, ranging from being consistent with stellar if a geometric albedo of zero is assumed to being super-stellar for a freely fitted Ag = 0.16 +/- 0.02. The volatile-to-refractory ratio is measured to be consistent with the stellar value. We infer that WASP-121b has an atmosphere enriched in both volatile and refractory metals, but not in ultra-refractory titanium, suggesting the presence of a nightside cold-trap. Considering H2O dissociation is critical in free retrieval analyses, leading to order-of-magnitude differences in retrieved abundances for WASP-121b if neglected. Simple chemical equilibrium retrievals assuming that all species are governed by a single metallicity parameter drastically overpredict the TiO abundance.",
      "pdf_url": "https://arxiv.org/pdf/2508.18341.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}