{
  "date": "2026-02-06",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.SR",
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.EP",
    "astro-ph.IM"
  ],
  "total_papers": 95,
  "gw_related_papers": 13,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.04055",
      "title": "A simple mechanism for the enhancement of the inflationary power spectrum",
      "authors": [
        "I. Dalianis",
        "A. Katsis",
        "N. Tetradis"
      ],
      "abstract": "A simple mechanism for the enhancement of the inflationary power spectrum I. Dalianis, A. Katsis, N. Tetradis Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The background evolution in two-field inflation can feature two distinct stages, corresponding to the evolution along two successive field directions. When the second stage occurs at a significantly lower energy scale, the inflationary trajectory includes a sharp transition, accompanied by a series of rapid turns in field space. Fluctuations crossing the Hubble horizon during this turning phase can experience amplification by several orders of magnitude. This mechanism is very intuitive and can be implemented even in simple two-field models. It produces a peak in the scalar power spectrum that can lead to significant abundances of primordial black holes and secondary gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2602.04055.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.04198",
      "title": "Propulsion Trades for a 2035-2040 Solar Gravitational Lens Mission",
      "authors": [
        "Slava G. Turyshev"
      ],
      "abstract": "Propulsion Trades for a 2035-2040 Solar Gravitational Lens Mission Slava G. Turyshev Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) The Solar Gravitational Lens (SGL) enables multipixel imaging and spatially resolved spectroscopy of a nearby terrestrial exoplanet from heliocentric distances $z\\simeq 650$-$900$ AU, where solar power is negligible and transportation largely sets time-to-first-science. Reaching 650 AU in 20 yr implies a ballistic lower bound $\\bar v_r \\simeq 32.5~{\\rm AU/yr}\\simeq 154$ km/s, motivating propulsion beyond chemical and gravity-assist-only options. We compare close-perihelion solar sailing, fission-powered nuclear electric propulsion (NEP), and Oberth-enabled hybrid injection using simple time-to-distance models that isolate the long outbound leg (i.e., excluding architecture-dependent inner-solar-system injection overhead). For solar sailing, $r_p=0.05$ AU requires $\\sigma_{\\rm tot}\\simeq 4.9~\\mathrm{g\\,m^{-2}}$ for $v_\\infty\\simeq 105$ km/s and $\\sigma_{\\rm tot}\\simeq 2.3~\\mathrm{g\\,m^{-2}}$ for $v_\\infty\\simeq 155$ km/s, placing sub-20 yr sail-only access in an ultra-low-areal-density, deep-perihelion survivability regime. For NEP, a constant-power stage closure shows that a $m_0=20$ t spacecraft with $m_{\\rm pay}=800$ kg and $\\eta=0.7$ reaches 650 AU in ~27-33 yr for $\\alpha_{\\rm tot}=10$-$20~\\mathrm{kg\\,kW_e^{-1}}$ (typical optima $P_e\\simeq 0.18$-$0.30~\\mathrm{MW_e}$, thrust of a few newtons). NEP-only sub-20 yr transfers require extremely aggressive assumptions ($\\alpha_{\\rm tot}\\lesssim 3~\\mathrm{kg\\,kW_e^{-1}}$ and very-high-$I_{\\rm sp}$, long-life EP), whereas hybrid architectures become plausible for $\\alpha_{\\rm tot}\\sim 10$-$15~\\mathrm{kg\\,kW_e^{-1}}$ if an injection stage supplies $v_0\\gtrsim 50$-70 km/s prior to NEP cruise. We map these requirements to technology readiness and identify system-level demonstrations needed by the early 2030s for a credible 2035--2040 start.",
      "pdf_url": "https://arxiv.org/pdf/2602.04198.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04285",
      "title": "Parametric Resonance and Backreaction Effects in Magnetogenesis from Ultralight Dark Matter",
      "authors": [
        "Nirmalya Brahma",
        "Robert Brandenberger"
      ],
      "abstract": "Parametric Resonance and Backreaction Effects in Magnetogenesis from Ultralight Dark Matter Nirmalya Brahma, Robert Brandenberger (McGill University) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We take a more detailed look at the recently proposed magnetogenesis mechanism triggered by ultralight dark matter coupled to electromagnetism. The proposed mechanism made use of a tachyonic resonance channel which leads to the exponential amplification of infrared modes. Here, we first investigate a possible narrow band parametric resonance channel which can produce photons at higher frequencies. Secondly, we estimate the effects of back-reaction on terminating the resonance. We find that there is indeed a narrow resonance channel. It is characterized by a Floquet exponent which is slightly smaller than the corresponding exponent for the tachyonic resonance. However, there is a region of parameter space (corresponding to a very small coupling constant) for which the tachyonic resonance is ineffective. In this case, the narrow resonance will dominate, and it will still be sufficiently strong to generate the observed magnetic fields on cosmological scales. Our analytical treatment of the back-reaction effects considered here indicates that a fraction of order one of the initial dark matter density can flow into the gauge fields. Hence, our magnetogenesis scenario appears to be robust to back-reaction effects.",
      "pdf_url": "https://arxiv.org/pdf/2602.04285.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.05906",
      "title": "Inference on inner galaxy structure via gravitational waves from supermassive binaries",
      "authors": [
        "Yifan Chen",
        "Matthias Daniel",
        "Daniel J. D'Orazio",
        "Xuanye Fan",
        "Andrea Mitridate",
        "Laura Sagunski",
        "Xiao Xue",
        "Gabriella Agazie",
        "Akash Anumarlapudi",
        "Anne M. Archibald",
        "Zaven Arzoumanian",
        "Jeremy G. Baier",
        "Paul T. Baker",
        "Bence Bécsy",
        "Laura Blecha",
        "Adam Brazier",
        "Paul R. Brook",
        "Sarah Burke-Spolaor",
        "Rand Burnette",
        "J. Andrew Casey-Clyde",
        "Maria Charisi",
        "Shami Chatterjee",
        "Tyler Cohen",
        "James M. Cordes",
        "Neil J. Cornish",
        "Fronefield Crawford",
        "H. Thankful Cromartie",
        "Kathryn Crowter",
        "Megan E. DeCesar",
        "Paul B. Demorest",
        "Heling Deng",
        "Lankeswar Dey",
        "Timothy Dolch",
        "Elizabeth C. Ferrara",
        "William Fiore",
        "Emmanuel Fonseca",
        "Gabriel E. Freedman",
        "Emiko C. Gardiner",
        "Nate Garver-Daniels",
        "Peter A. Gentile",
        "Kyle A. Gersbach",
        "Joseph Glaser",
        "Deborah C. Good",
        "Kayhan Gültekin",
        "Jeffrey S. Hazboun",
        "Ross J. Jennings",
        "Aaron D. Johnson",
        "Megan L. Jones",
        "David L. Kaplan",
        "Luke Zoltan Kelley",
        "Matthew Kerr",
        "Joey S. Key",
        "Nima Laal",
        "Michael T. Lam",
        "William G. Lamb",
        "Bjorn Larsen",
        "T. Joseph W. Lazio",
        "Natalia Lewandowska",
        "Tingting Liu",
        "Duncan R. Lorimer",
        "Jing Luo",
        "Ryan S. Lynch",
        "Chung-Pei Ma",
        "Dustin R. Madison",
        "Alexander McEwen",
        "James W. McKee",
        "Maura A. McLaughlin",
        "Natasha McMann",
        "Bradley W. Meyers",
        "Patrick M. Meyers",
        "Chiara M. F. Mingarelli",
        "Cherry Ng",
        "David J. Nice",
        "Stella Koch Ocker",
        "Ken D. Olum",
        "Timothy T. Pennucci",
        "Benetge B. P. Perera",
        "Polina Petrov",
        "Nihan S. Pol",
        "Henri A. Radovan",
        "Scott M. Ransom",
        "Paul S. Ray",
        "Joseph D. Romano",
        "Jessie C. Runnoe",
        "Alexander Saffer",
        "Shashwat C. Sardesai",
        "Ann Schmiedekamp",
        "Carl Schmiedekamp",
        "Kai Schmitz",
        "Brent J. Shapiro-Albert",
        "Xavier Siemens",
        "Joseph Simon",
        "Magdalena S. Siwek",
        "Sophia V. Sosa Fiscella",
        "Ingrid H. Stairs",
        "Daniel R. Stinebring",
        "Kevin Stovall",
        "Abhimanyu Susobhanan",
        "Joseph K. Swiggum",
        "Jacob Taylor"
      ],
      "abstract": "Inference on inner galaxy structure via gravitational waves from supermassive binaries Yifan Chen, Matthias Daniel, Daniel J. D'Orazio, Xuanye Fan, Andrea Mitridate, Laura Sagunski, Xiao Xue, Gabriella Agazie, Akash Anumarlapudi, Anne M. Archibald, Zaven Arzoumanian, Jeremy G. Baier, Paul T. Baker, Bence Bécsy, Laura Blecha, Adam Brazier, Paul R. Brook, Sarah Burke-Spolaor, Rand Burnette, J. Andrew Casey-Clyde, Maria Charisi, Shami Chatterjee, Tyler Cohen, James M. Cordes, Neil J. Cornish, Fronefield Crawford, H. Thankful Cromartie, Kathryn Crowter, Megan E. DeCesar, Paul B. Demorest, Heling Deng, Lankeswar Dey, Timothy Dolch, Elizabeth C. Ferrara, William Fiore, Emmanuel Fonseca, Gabriel E. Freedman, Emiko C. Gardiner, Nate Garver-Daniels, Peter A. Gentile, Kyle A. Gersbach, Joseph Glaser, Deborah C. Good, Kayhan Gültekin, Jeffrey S. Hazboun, Ross J. Jennings, Aaron D. Johnson, Megan L. Jones, David L. Kaplan, Luke Zoltan Kelley, Matthew Kerr, Joey S. Key, Nima Laal, Michael T. Lam, William G. Lamb, Bjorn Larsen, T. Joseph W. Lazio, Natalia Lewandowska, Tingting Liu, Duncan R. Lorimer, Jing Luo, Ryan S. Lynch, Chung-Pei Ma, Dustin R. Madison, Alexander McEwen, James W. McKee, Maura A. McLaughlin, Natasha McMann, Bradley W. Meyers, Patrick M. Meyers, Chiara M. F. Mingarelli, Cherry Ng, David J. Nice, Stella Koch Ocker, Ken D. Olum, Timothy T. Pennucci, Benetge B. P. Perera, Polina Petrov, Nihan S. Pol, Henri A. Radovan, Scott M. Ransom, Paul S. Ray, Joseph D. Romano, Jessie C. Runnoe, Alexander Saffer, Shashwat C. Sardesai, Ann Schmiedekamp, Carl Schmiedekamp, Kai Schmitz, Brent J. Shapiro-Albert, Xavier Siemens, Joseph Simon, Magdalena S. Siwek, Sophia V. Sosa Fiscella, Ingrid H. Stairs, Daniel R. Stinebring, Kevin Stovall, Abhimanyu Susobhanan, Joseph K. Swiggum, Jacob Taylor 19 pages, 6 figures, accepted version in Nature Astronomy High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The detection of a stochastic gravitational wave background by pulsar-timing arrays indicates the presence of a population of supermassive black hole binaries. Although the observed spectrum generally matches predictions for orbital evolution driven by gravitational-wave emission in circular orbits, there is a preference for a spectral turnover at the lowest observed frequencies, which may point to substantial hardening during a transition from early environmental influences to later stages dominated by emission. In the vicinity of these binaries, the ejection of stars or dark matter particles through gravitational three-body slingshots efficiently extracts orbital energy, leading to a low-frequency turnover in the spectrum. Here we model how the gravitational-wave spectrum depends on the initial inner galactic profile before scouring by binary ejections while accounting for a range of initial binary eccentricities. By analysing the NANOGrav 15-year data, we find that a parsec-scale galactic-centre density of around $10^6 M_{\\odot} \\mathrm{pc}^{-3}$ is favoured across most of the parameter space, thus shedding light on the environmental effects that shape black hole evolution and the combined matter density near galaxy centres.",
      "pdf_url": "https://arxiv.org/pdf/2411.05906.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.10673",
      "title": "Time-dependent deflection reconstruction: new technique to search for gravitational waves with the cosmic microwave background",
      "authors": [
        "Alvin Leluc",
        "Joel Meyers",
        "Alexander van Engelen"
      ],
      "abstract": "Time-dependent deflection reconstruction: new technique to search for gravitational waves with the cosmic microwave background Alvin Leluc, Joel Meyers, Alexander van Engelen Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Gravitational waves (GWs) passing through the Earth cause a correlated pattern of time-dependent deflections of the apparent position of astronomical sources. We build upon standard lensing reconstruction techniques to develop a new time-dependent quadratic estimator, providing a novel technique to search for the deflections produced by GWs using observations of the cosmic microwave background (CMB). We find that the time-dependent deflection reconstruction is many orders of magnitude more sensitive than the ordinary static lensing estimator, and it can be employed with the data collected by existing and future CMB surveys, without requiring any modification to the experimental or survey design. We demonstrate that CMB surveys offer sensitivity to GWs across a broad frequency range: while the sensitivity will not be competitive over the frequency range covered by pulsar timing arrays, it does extend coverage to both lower and higher frequencies. Finally, we discuss how our methods can be extended to search for other time-varying signals, and also how it can be applied to surveys at other wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2508.10673.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.13732",
      "title": "Polar Mounds on Strangeon Stars: the Neutrino Emission from Ultraluminous X-ray Pulsars",
      "authors": [
        "Hong-Bo Li",
        "Shi-Jie Gao",
        "Xiang-Dong Li",
        "Ren-Xin Xu"
      ],
      "abstract": "Polar Mounds on Strangeon Stars: the Neutrino Emission from Ultraluminous X-ray Pulsars Hong-Bo Li, Shi-Jie Gao, Xiang-Dong Li, Ren-Xin Xu 10 pages, 5 figures, 3 tables, accept for the publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Ultraluminous X-ray pulsars (ULXPs) serve as unique astrophysical laboratories, offering critical insights into accretion physics under extreme conditions, such as strong magnetic fields and super-Eddington accretion rates. Additionally, the nature of pulsars, i.e., the equation of state of supranuclear matter, is still a matter of intense debate, basing on either conventional neutron stars or strange stars. In this work, in order to differentiate the conjectured states of matter, we investigate accretion columns of ULXPs based on the strangeon-star (SS) model, focusing on the thermal mound at the column base. Accounting for Coulomb and strangeness barriers of SSs, we find that the mound can reach $0.7-0.95\\,\\rm km$ in height with temperatures above $10^9\\, \\rm K$, enabling substantial neutrino emission via electron-positron annihilation. At low accretion rates ($< 10^{20}\\, \\rm g\\,s^{-1}$), photons dominate the luminosity, while at higher rates ($> 10^{21}\\, \\rm g\\, s^{-1}$), photon trapping makes neutrino emission the main cooling channel, with total luminosity exceeding photon emission, which saturates near $10^{41}\\, \\rm erg\\,s^{-1}$. Even though the predicted neutrino flux from the nearest system, Swift J0243.6$+$6124, lies well below the diffuse MeV background--implying that detectable emission would require substantially closer or more luminous sources--these results demonstrate the key role of the thermal mound and SS properties in accretion, providing a foundation for future ULXP studies and suggesting that neutrino observations could, in principle, offer a novel probe of SSs and extreme supranuclear matter.",
      "pdf_url": "https://arxiv.org/pdf/2509.13732.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03456",
      "title": "The steep redshift evolution of the hierarchical binary black hole merger rate may cause the $z$-$χ_{\\rm eff}$ correlation",
      "authors": [
        "Amanda M. Farah",
        "Aditya Vijaykumar",
        "Maya Fishbach"
      ],
      "abstract": "The steep redshift evolution of the hierarchical binary black hole merger rate may cause the $z$-$χ_{\\rm eff}$ correlation Amanda M. Farah, Aditya Vijaykumar, Maya Fishbach 9 pages, 4 figures (with appendices: 18 pages, 12 figures). Also see Vijaykumar et al., posted simultaneously. v3 fixes an error with sensitivity estimates High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) There is growing evidence from gravitational-wave observations that some merging black holes are created from previous mergers. Using the prediction that these hierarchically-merged black holes have dimensionless spin magnitudes of $\\chi \\approx 0.69$, we identify a subpopulation in the gravitational-wave data consistent with a hierarchical-merger origin in dense star clusters. This subpopulation's primary mass distribution peaks at $17.0^{+18.3}_{-4.4},\\mathrm{M}_{\\odot}$, which is approximately twice as large as its secondary mass distribution's mode ($10.5^{+29.7}_{-4.7},\\mathrm{M}_{\\odot}$), and its spin tilt distribution is consistent with isotropy. Our inferred secondary mass distributions imply that isolated binary evolution may still be needed to explain the entirety of the $9\\,\\mathrm{M}_{\\odot}$ peak. Surprisingly, we find that the rate of hierarchical mergers may evolve more steeply with redshift than the rest of the population ($98.0\\%$ credibility): the fraction of all binary black holes that are hierarchically formed at $z=0.1$ is $0.03^{+0.05}_{-0.02}$, compared to $0.09^{+0.11}_{-0.07}$ at $z=1$. This provides an explanation for the previously-discovered broadening of the effective spin distribution with redshift. Our results have implications for star cluster formation histories, as they suggest the potential existence of a high-redshift population of massive, compact clusters.",
      "pdf_url": "https://arxiv.org/pdf/2601.03456.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.03917",
      "title": "The Atacama Cosmology Telescope: Constraints on Local Non-Gaussianity from the ACT Cluster Catalog",
      "authors": [
        "Leonid Sarieddine",
        "J. Richard Bond",
        "Matt Hilton",
        "Raul Jimenez",
        "Arthur Kosowsky",
        "Kavilan Moodley",
        "Bernardita Ried Guachalla",
        "Cristóbal Sifón",
        "Suzanne T. Staggs",
        "Licia Verde",
        "Edward J. Wollack"
      ],
      "abstract": "The Atacama Cosmology Telescope: Constraints on Local Non-Gaussianity from the ACT Cluster Catalog Leonid Sarieddine, J. Richard Bond, Matt Hilton, Raul Jimenez, Arthur Kosowsky, Kavilan Moodley, Bernardita Ried Guachalla, Cristóbal Sifón, Suzanne T. Staggs, Licia Verde, Edward J. Wollack Cosmology and Nongalactic Astrophysics (astro-ph.CO) We derive constraints on local-type primordial non-Gaussianity using the ACT DR6 Sunyaev--Zel'dovich cluster catalog. Modeling the redshift- and mass-dependent number counts of 1,201 clusters in the 10,347~deg$^2$ Legacy region, and accounting for survey completeness, intrinsic SZ scatter, and a weak-lensing-calibrated mass bias, we compute theoretical abundances using the Log--Edgeworth halo mass function. Assuming $\\Lambda$CDM with well-motivated external priors, we obtain $f_{\\rm NL} = 55 \\pm 125$ (68% CL), consistent with Gaussian initial conditions. These constraints probe comoving scales of $5$--$10~{\\rm Mpc}~h^{-1}$, complementing CMB bispectrum and scale-dependent bias measurements, which do not reach such small scales. We also find evidence for a 16.4% residual mass bias, which, although heavily informed by our adopted priors, plays a key role in matching observed and predicted counts but has negligible effect on $f_{\\rm NL}$ constraints. We briefly discuss robustness of the results under relaxed priors and the prospects for next-generation SZ and lensing surveys to strengthen cluster-based tests of primordial non-Gaussianity.",
      "pdf_url": "https://arxiv.org/pdf/2602.03917.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03923",
      "title": "An emulator for the ionizing photon mean free path in ultra-high resolution simulations: the implications of mean free path measurements for the reionization history",
      "authors": [
        "Hurum Maksora Tohfa",
        "Christopher Cain",
        "Matthew McQuinn",
        "Anson D'Aloisio"
      ],
      "abstract": "An emulator for the ionizing photon mean free path in ultra-high resolution simulations: the implications of mean free path measurements for the reionization history Hurum Maksora Tohfa, Christopher Cain, Matthew McQuinn, Anson D'Aloisio Cosmology and Nongalactic Astrophysics (astro-ph.CO) Measurements of the mean free path of ionizing photons from high-redshift quasar spectra at $z \\sim 5$-$6$ constrain the reionization history, but interpreting them requires modeling the kiloparsec-scale clumping that large-volume reionization simulations cannot resolve. We present a deep learning emulator for the mean free path (MFP) trained on high-resolution cosmological radiative transfer simulations of ionization fronts sweeping through small 2 comoving~Mpc/h volumes. Using a residual multi-layer perceptron neural network, we predict the MFP at a given redshift as a function of the reionization redshift, photoionization rate, wavelength, and box-scale density, achieving a median relative error of 1.6\\% across nearly four orders of magnitude in MFP. Integrating its predictions over box-scale overdensity and an extended reionization history allows the emulator to predict the global MFP. We apply the emulator to extended reionization histories constrained by observed photoionization rates, finding that models prefer late reionization with substantial neutral fractions persisting at $z \\lesssim 6$. Fitting a parametric ionization history yields a midpoint of reionization of $z_{\\rm re} = 6.8\\pm 1.2$ for reionization durations consistent with Planck and kinetic Sunyaev-Zeldovich constraints, and the universe being $10\\%$ neutral still at $z_{\\rm re} < 5.8 ~(6.3)$ at 1~(2)$\\sigma$. Global ionizing emissivity inferences using measurements of the photoionization rate and MFP plus our emulator, which avoids common power-law assumptions, suggest a factor of $2-3$ decline between $z = 6$ and $4.8$, in agreement with previous studies. Our method provides an efficient (and more converged) alternative to large-volume radiative-hydrodynamic simulations of reionization for interpreting MFP measurements, and can also serve as a subgrid prescription for the ionizing opacity within such simulations.",
      "pdf_url": "https://arxiv.org/pdf/2602.03923.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03928",
      "title": "The local void model for the Hubble and BAO tensions",
      "authors": [
        "Indranil Banik",
        "Harry Desmond",
        "Vasileios Kalaitzidis",
        "Sergij Mazurenko"
      ],
      "abstract": "The local void model for the Hubble and BAO tensions Indranil Banik, Harry Desmond, Vasileios Kalaitzidis, Sergij Mazurenko 14 pages, 5 figures, no tables. Comments welcome, ideally before submission to Discover Space by 12th February 2026 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) The inconsistency between the locally inferred Hubble constant and the value inferred from the cosmic microwave background assuming the $\\Lambda$CDM cosmological model has persisted, turning into an important problem. An emergent underlying trend is that this Hubble tension is driven by data confined to the very low-redshift Universe (typically $z < 0.15$). Most intermediate-redshift measurements remain mutually consistent with $H_0^\\mathrm{CMB}$, the $\\Lambda$CDM expectation anchored by the CMB. This Perspective examines if a large local void can explain the Hubble tension and its appearance only at low $z$. For an observer residing within a large underdensity, such as the Milky Way inside the claimed KBC void, gravitationally induced outflows and redshift can inflate the locally inferred recession scale $cz'$ despite having $H_0 = H_0^\\mathrm{CMB}$. We summarise evidence suggestive of a local underdensity from multi-wavelength galaxy number counts, discuss the dynamical requirements implied by the amplitude of inferred bulk flows, and connect the solution to the emerging low-redshift BAO distance anomaly ($\\alpha_{\\mathrm{iso}} < 1$). Previously published semi-analytic void models anticipated the observed redshift dependence of BAO deviations and predict a rapid convergence to CMB-consistent expansion for $z \\gtrsim 0.2$, aligning with reconstructions of $H_0(z)$ from BAO plus uncalibrated Type Ia supernovae. We conclude by looking to future tests, including improved mapping of the local density and velocity field, fits to galaxy distance catalogues at the field level, kinematic Sunyaev-Zel'dovich constraints on coherent outflows, fast radio bursts, and the long-term prospect of redshift drift measurements as a direct probe of time-varying non-cosmological redshift contributions.",
      "pdf_url": "https://arxiv.org/pdf/2602.03928.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03935",
      "title": "pop-cosmos: Forward modeling KiDS-1000 redshift distributions using realistic galaxy populations",
      "authors": [
        "Boris Leistedt",
        "Hiranya V. Peiris",
        "Anik Halder",
        "Stephen Thorp",
        "Daniel J. Mortlock",
        "Arthur Loureiro",
        "Justin Alsing",
        "Gurjeet Jagwani",
        "Madalina N. Tudorache",
        "Sinan Deger",
        "Joel Leja",
        "Benedict Van den Bussche",
        "Angus H. Wright",
        "Shun-Sheng Li",
        "Konrad Kuijken",
        "Hendrik Hildebrandt"
      ],
      "abstract": "pop-cosmos: Forward modeling KiDS-1000 redshift distributions using realistic galaxy populations Boris Leistedt, Hiranya V. Peiris, Anik Halder, Stephen Thorp, Daniel J. Mortlock, Arthur Loureiro, Justin Alsing, Gurjeet Jagwani, Madalina N. Tudorache, Sinan Deger, Joel Leja, Benedict Van den Bussche, Angus H. Wright, Shun-Sheng Li, Konrad Kuijken, Hendrik Hildebrandt 22 pages, 11 figures, to be submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) The accuracy of the cosmological constraints from Stage~IV galaxy surveys will be limited by how well the galaxy redshift distributions can be inferred. We have addressed this challenging problem for the Kilo-Degree Survey (KiDS) cosmic shear sample by developing a forward-modeling framework with two main ingredients: (1) the \\texttt{pop-cosmos} generative model for the evolving galaxy population, calibrated on \\textit{Spitzer} IRAC $\\textit{Ch.\\,1}<26$ galaxies from COSMOS2020; and (2) a data model for noise and selection, machine-learned from the SURFS-based KiDS-Legacy-Like Simulations (SKiLLS). Applying KiDS tomographic binning to our synthetic photometric data, we infer redshift distributions in each of five bins directly from the population and data models, bypassing the need for spectroscopic reweighting. Keeping the data model fixed, we compare results using two different galaxy population models: \\texttt{pop-cosmos}; and \\texttt{shark}, the semi-analytic galaxy formation model used in SKiLLS. In the first ($0.1<z<0.3$) and last ($0.9<z<1.2$) tomographic bins we find systematic differences in the mean redshifts of $\\Delta z\\sim0.05$-$0.1$, comparable to the reported uncertainties from spectroscopic reweighting methods. This work paves the way for accurate redshift distribution calibration for Stage~IV surveys directly through forward modeling, thus providing an independent cross-check on spectroscopic-based calibrations which avoids their selection biases and incompleteness. We will use the \\texttt{pop-cosmos} redshift distributions in an upcoming full KiDS cosmology reanalysis.",
      "pdf_url": "https://arxiv.org/pdf/2602.03935.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04203",
      "title": "From Nonparametric Distance Reconstruction to Testing the Etherington Relation and Cosmic Curvature Using 2D and 3D BAO Measurements",
      "authors": [
        "Darshan Kumar",
        "Jie Zheng",
        "Zhi-Qiang You",
        "Da-Chun Qiang"
      ],
      "abstract": "From Nonparametric Distance Reconstruction to Testing the Etherington Relation and Cosmic Curvature Using 2D and 3D BAO Measurements Darshan Kumar (HNAS), Jie Zheng (HNAS), Zhi-Qiang You (HNAS), Da-Chun Qiang (HNAS) 17 pages, 5 figures, and 5 tables. Accepted for publication in Astrophys. J Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a joint test of cosmic curvature, $\\Omega_{k0}$, and the cosmic distance-duality relation (CDDR) using the Etherington relation, which connects the luminosity and angular diameter distances at the same redshift. In this work, we combine the angular diameter distance measurements from recent Baryon Acoustic Oscillation (BAO) observations with luminosity distances reconstructed from Cosmic Chronometers data of Hubble parameter $H(z)$ using a non-parametric technique, Gaussian Process. A key part of our analysis is the systematic comparison of different BAO measurements (2D BAO, 3D BAO, and 3D DESI BAO) to determine whether any potential tension between angular and anisotropic BAO data affects constraints on the distance duality parameter $\\eta(z)$ and $\\Omega_{k0}$. We adopt four representative parameterizations of $\\eta(z)$ to examine the correlation between $\\eta(z)$ and $\\Omega_{k0}$. Our results show no evidence for violation of the CDDR, with $\\eta(z)$ consistent with unity at the 99\\% confidence level for all BAO datasets and parameterizations. In all scenarios, the best-fit values of $\\Omega_{k0}$ mildly favor a non-flat universe, although a spatially flat universe remains compatible at the 95\\% confidence level. The constraints on $\\eta_1$ and $\\Omega_{k0}$ indicate slight variations across different BAO datasets, but the discrepancies between the 2D and 3D BAO measurements do not introduce any significant bias, and no statistically meaningful tension is observed. Our work provides robust constraints on cosmic curvature and the validity of the CDDR based on non-parametric distance reconstruction.",
      "pdf_url": "https://arxiv.org/pdf/2602.04203.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04485",
      "title": "Large-scale halo velocity correlations and the impact of finite simulation volumes",
      "authors": [
        "Yao-Tsung Chuang",
        "Teppei Okumura",
        "Takahiro Nishimichi"
      ],
      "abstract": "Large-scale halo velocity correlations and the impact of finite simulation volumes Yao-Tsung Chuang, Teppei Okumura, Takahiro Nishimichi Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The velocity correlation functions directly measured from the peculiar velocity field of dark matter in numerical simulations are known to have an amplitude lower than that predicted by theoretical models at large scales. The trend persists for dark-matter halos or galaxies that are more closely related to the observables. We investigate the impact of the finite simulation box sizes on the measured velocity correlation functions of halos, utilizing N-body simulations with different box sizes. We measure the halo velocity correlations from N-body simulations with side lengths of $1{\\rm Gpc}/h$ and $2{\\rm Gpc}/h$, confirming the former is more suppressed compared to the linear theory prediction on large scales due to the lack of large-scale modes beyond the box size. In contrast, even though we subdivide the larger-box simulations into those with side lengths of $1{\\rm Gpc}/h$, the amount of the suppression is the same as that from the original boxes, as the large-scale modes are already imprinted. Introducing the lower limit of the integral in the Hankel transform, $k_{\\rm min}$, as a free parameter and marginalizing it over, we find that the constrained growth rate parameter, $f(z)\\sigma_8(z)$, returns the correct value assumed in the simulations. However, when we ignore the effect and set $k_{\\rm min}=0$, the constraint on $f\\sigma_8$ is significantly biased if the correlation between different separation bins is also ignored. Furthermore, we find that the suppression of the velocity correlation amplitude on large scales depends on halo mass, with more massive halos exhibiting a systematically stronger suppression. These results highlight the importance of accounting for missing long-wavelength modes when developing simulation-based modeling of velocity statistics, such as emulators.",
      "pdf_url": "https://arxiv.org/pdf/2602.04485.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04497",
      "title": "A model-independent measurement of the Hubble constant from gravitational-wave standard sirens and electromagnetic observations",
      "authors": [
        "Gaurav N. Gadbail",
        "Kazuharu Bamba"
      ],
      "abstract": "A model-independent measurement of the Hubble constant from gravitational-wave standard sirens and electromagnetic observations Gaurav N. Gadbail, Kazuharu Bamba Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Hubble tension is one of the most significant challenges in modern cosmology. Developing new approaches to estimate the Hubble constant is therefore crucial, and in this work, we employ a Gaussian process, a fully model-independent method that relies solely on observational data. To determine the Hubble constant, we use not only electromagnetic observations but also include gravitational-wave standard siren data from GWTC3. Our measurements of the Hubble constant are strongly consistent with the SH0ES result, with tensions less than $2\\sigma$, indicating no statistically significant discrepancy. This approach quantifies the impact of gravitational-wave data on the determination of the Hubble constant, examines its consistency with electromagnetic measurements, and explores its potential role in addressing the Hubble tension.",
      "pdf_url": "https://arxiv.org/pdf/2602.04497.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.04504",
      "title": "Weak Lensing Low Multipoles",
      "authors": [
        "Albert Bonnefous",
        "Roya Mohayaee"
      ],
      "abstract": "Albert Bonnefous, Roya Mohayaee Cosmology and Nongalactic Astrophysics (astro-ph.CO) We analyse the low-multipole components of the weak-lensing convergence field in a FLRW universe. The low-multipole convergence field, encodes the largest-angle coherent potential gradients, essential for assessment of large-angle features in data. To study this large angle signal, we perform a combined analytical, numerical and observational study. Starting from exact analytical expressions for the convergence power spectrum, we quantify how the dipole, quadrupole and octupole build up with source redshift and show that, in $\\Lambda$CDM, they saturate at an amplitude of order $10^{-4}$. We then use full-sky, horizon-scale $N$-body simulations (Quijote) to explore the dependence of this signal on the observer's environment, comparing random observers to ``Milky Way-like'' observers. In parallel, we reconstruct the convergence field due to our local Universe with the 2MASS Redshift Survey (2MRS), with proper treatment of incompleteness and galaxy bias. We find that the observed low multipoles from observation is above the $\\Lambda$CDM mean predictions, but in full agreement with Milky Way-like observers in the simulation. Finally, by converting the convergence dipole into a number-count dipole, we test whether weak lensing can contribute to the cosmic dipole anomaly, an idea motivated by its natural alignment with the CMB dipole and by the fact that lensing, unlike clustering, cannot be removed by cross-matching surveys and thus survives in all high-redshift catalogues. We show that weak lensing by local structure contributes at most a few percent to this observed anomaly.",
      "pdf_url": "https://arxiv.org/pdf/2602.04504.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04528",
      "title": "Separation of polarized dust emission in Planck observations with Scattering Transforms",
      "authors": [
        "Alexandros Tsouros",
        "Elisa Russier",
        "Erwan Allys",
        "Constant Auclair",
        "François Boulanger",
        "Jacques Delabrouille"
      ],
      "abstract": "Separation of polarized dust emission in Planck observations with Scattering Transforms Alexandros Tsouros, Elisa Russier, Erwan Allys, Constant Auclair, François Boulanger, Jacques Delabrouille Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Polarized dust emission is a major astrophysical foreground contaminant of the cosmic microwave background polarization (CMB), which must be accurately measured to look for the faint primordial polarization B-modes of inflationary origin. The available maps to date, obtained from Planck space mission data, are noise-dominated in the high Galactic latitude regions that are most relevant for CMB observations. The goal of this work is to obtain better dust polarization maps from Planck observations, by exploiting both the dependence between polarization and total intensity, as well as the non-Gaussian filamentary structure of the dust emission. To this end, we use scattering transforms, which provide a stable and interpretable representation of complex non-Gaussian textures, allowing for a data-driven analysis approach requiring no explicit priors on dust. The analysis is performed locally on Cartesian patches of sky, where Stokes linear polarization parameters, redefined in a local reference frame, are modeled as the sum of a signal of interest and a nuisance term. Using multiple realizations of the random nuisance term, we recover the polarized dust maps by minimizing a composite objective function that enforces multiple statistical constraints in scattering space. The proposed algorithm reconstructs maps of polarized dust emission whose statistics are consistent with those expected from the Planck data once random nuisance realizations are added. This is confirmed in a validation test using a high signal-to-noise sky region as a test case. Comparisons with existing dust polarization maps and models show that our approach better recovers small-scale polarized dust emission, and that our reconstructed power and cross-spectra closely match those of the dust polarization maps. A second set of maps that deterministically reproduce the features of the dust polarized emission is also produced.",
      "pdf_url": "https://arxiv.org/pdf/2602.04528.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.04559",
      "title": "The Standard siren tests of viable $f(R)$ cosmologies",
      "authors": [
        "Yi Zhang",
        "Xuanjun Niu",
        "Xianfu Su",
        "Dong-Ze He"
      ],
      "abstract": "The Standard siren tests of viable $f(R)$ cosmologies Yi Zhang, Xuanjun Niu, Xianfu Su, Dong-Ze He Cosmology and Nongalactic Astrophysics (astro-ph.CO) We constrain the Hu-Sawicki and Starobinsky $f(R)$ gravity models utilizing current electromagnetic (PP+CC, Planck and DESI2) datasets and simulate standard siren catalogs based on the resulting best-fit parameters. We demonstrate that the simulated SS data provide complementary sensitivity to the modified gravitational wave propagation friction term, thereby enhancing the discriminating power between $f(R)$ gravity and the $\\Lambda$CDM model. However, we note that standard sirens do not offer a viable resolution to the Hubble tension in this analysis, as the inferred constraints are predominantly driven by the fiducial cosmologies adopted in the simulations. Regarding the specific models, we find that for the Hu-Sawicki scenario, several data combinations favor $F_{RR0}<0$, implying potential theoretical instabilities. And, for the Starobinsky model, while EM-only constraints are nearly symmetric between the two parameter branches ($b<0$ and $b>0$), the inclusion of SS constraints introduces mild asymmetries, revealing the sensitivity of SS observables to the curvature dependence of the theory. Future truly independent standard siren observations would be crucial for a definitive assessment of $f(R)$ gravity as an alternative to $\\Lambda$CDM.",
      "pdf_url": "https://arxiv.org/pdf/2602.04559.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.04698",
      "title": "Unclustered tracers remain unclustered: the lack of primordial non-Gaussianity response of bias-zero tracers",
      "authors": [
        "Celia Merino",
        "Santiago Avila",
        "A. G. Adame",
        "A. Anguren",
        "V. Gonzalez-Perez",
        "J. Meneses-Rizo"
      ],
      "abstract": "Unclustered tracers remain unclustered: the lack of primordial non-Gaussianity response of bias-zero tracers Celia Merino, Santiago Avila, A. G. Adame, A. Anguren, V. Gonzalez-Perez, J. Meneses-Rizo Cosmology and Nongalactic Astrophysics (astro-ph.CO) Constraining primordial non-Gaussianities (PNG) is one of the main goals of new-generation large-scale galaxy surveys. It had been proposed that unclustered tracers (with bias $b_1=0$) could be optimal for PNG studies, and that these could be found by selecting galaxies in bins of their local density. Here, we test this hypothesis in state-of-the-art simulations from the PNG-UNITsim suite with local $f_{\\rm NL}=100$ and $f_{\\rm NL}=-20$. We consider different parent tracer catalogues: all halos together, halos in large mass bins, and HOD models for LRGs and QSO. We then classify these tracers by their local density ($\\delta_{t,R}$) and measure the linear bias ($b_1$) and PNG-response ($b_\\phi$). Most $\\delta_{t,R}$ bins show a PNG-response compatible with $b_\\phi=0$ for all halos or the low-mass bin (log$M<11$). For high-mass halos (log$M>$12), QSO or LRG, we recover a trend closer to the universality relation ($b_\\phi = 2 \\delta_{\\rm crit}(b_1-1)$) for $b_1>1$, but the $b_\\phi(b_1)$ curve flattens to 0 below $\\vert b_1\\lvert<1$. Hence, we find $b_\\phi\\approx0$ for all bias-zero tracers considered. The complex $\\delta_{t,R}$-based selection causes their clustering to strongly deviate from simple assumptions, namely the universality relation and Poisson shot noise, hindering their capability to constrain PNG.",
      "pdf_url": "https://arxiv.org/pdf/2602.04698.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04766",
      "title": "Measurement of the Hubble constant using the Dark Energy Survey Year 6 Gold galaxy catalog and the fourth Gravitational-Wave Transient Catalog",
      "authors": [
        "Isaac McMahon",
        "Danny Laghi",
        "Marcelle Soares-Santos",
        "Kendall Ackley",
        "Gergely Dálya",
        "Yavuz Gençel",
        "David Sánchez-Cid",
        "Felipe Andrade-Oliveira",
        "Sean MacBride",
        "Christian Chapman-Bird",
        "Rachel Gray",
        "Alexander Papadopoulos"
      ],
      "abstract": "Measurement of the Hubble constant using the Dark Energy Survey Year 6 Gold galaxy catalog and the fourth Gravitational-Wave Transient Catalog Isaac McMahon, Danny Laghi, Marcelle Soares-Santos, Kendall Ackley, Gergely Dálya, Yavuz Gençel, David Sánchez-Cid, Felipe Andrade-Oliveira, Sean MacBride, Christian Chapman-Bird, Rachel Gray, Alexander Papadopoulos Cosmology and Nongalactic Astrophysics (astro-ph.CO) Gravitational wave standard sirens enable independent measurements of the Hubble constant $H_0$. In the absence of electromagnetic counterparts, the \"dark siren\" method statistically correlates GW events with potential host galaxies. We present a measurement of $H_0$ using 142 compact binary coalescences from the fourth Gravitational-Wave Transient Catalog (GWTC-4.0) combined with the Dark Energy Survey Year 6 Gold photometric galaxy catalog. Using the gwcosmo pipeline, we jointly infer cosmological and GW population parameters. We analyze the impact of galaxy catalog properties on the inference, identifying significant features in the galaxy redshift distribution which can introduce biases. By restricting the galaxy catalog to $0.05<z<0.35$ to maintain consistency with a uniform in comoving volume galaxy distribution, we obtain a result of $H_0 = 70.9^{+22.3}_{-18.6}\\;\\text{km}\\;\\text{s}^{-1}\\;\\text{Mpc}^{-1}$ from dark sirens and $H_0=73.1^{+11.7}_{-8.6}\\;\\text{km}\\;\\text{s}^{-1}\\;\\text{Mpc}^{-1}$ when combined with the bright siren GW170817. This study demonstrates the adaptation of deep galaxy catalogs for GW cosmology, highlighting key challenges and methodologies essential for maximizing the potential of next-generation galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.04766.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.03930",
      "title": "pop-cosmos: Redshifts and physical properties of KiDS-1000 galaxies",
      "authors": [
        "Anik Halder",
        "Hiranya V. Peiris",
        "Stephen Thorp",
        "Boris Leistedt",
        "Daniel J. Mortlock",
        "Gurjeet Jagwani",
        "Madalina N. Tudorache",
        "Sinan Deger",
        "Benedict Van den Bussche",
        "Joel Leja",
        "Angus H. Wright"
      ],
      "abstract": "pop-cosmos: Redshifts and physical properties of KiDS-1000 galaxies Anik Halder, Hiranya V. Peiris, Stephen Thorp, Boris Leistedt, Daniel J. Mortlock, Gurjeet Jagwani, Madalina N. Tudorache, Sinan Deger, Benedict Van den Bussche, Joel Leja, Angus H. Wright 17 pages, 13 figures + appendix. To be submitted to MNRAS. Comments are welcome! Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Principled Bayesian inference of galaxy properties has not previously been performed for wide-area weak lensing surveys with millions of sources. We address this gap by applying the pop-cosmos generative model to perform spectral energy distribution (SED) fitting for 4 million KiDS-1000 galaxies. Calibrated on deep COSMOS2020 photometric data, pop-cosmos specifies a physically-motivated prior over the galaxy population up to $z \\simeq 6$ in stellar population synthesis (SPS) parameter space. Using the Speculator SPS emulator with GPU-accelerated MCMC sampling, we perform full posterior inference at 6.5 GPU seconds per galaxy, obtaining joint constraints on galaxy redshifts and physical properties. We validate photometric redshifts against $\\sim\\!185,\\!000$ KiDS galaxies cross-matched to DESI DR1 spectroscopic samples, achieving low bias ($3\\times10^{-3}$), scatter ($\\sigma_{\\mathrm{MAD}}=0.04$), and outlier fraction (3.7%) for the Bright Galaxy Survey, with comparable performance (bias $3\\times10^{-2}$, $\\sigma_{\\mathrm{MAD}}=0.05$, 1.3% outliers) for luminous red galaxies (LRGs). Within the LRG sample, we identify massive, dusty, star-forming contaminants at $z \\simeq 0.4$ satisfying standard colour selections for quenched populations. We infer trends in stellar mass, star formation, metallicity, and dust across five tomographic redshift bins consistent with established scaling relations. Using specific star formation rate constraints, we identify $\\sim$10% of KiDS-1000 galaxies as quenched, versus 37% implied by conservative colour cuts. This enables the construction of weak lensing samples defined by physical properties while mitigating intrinsic alignment systematics and preserving statistical power. Our analysis validates pop-cosmos out-of-sample, establishing it as a scaleable approach for galaxy evolution and cosmological analyses in photometric surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.03930.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03934",
      "title": "Dynamical Systematics on Time Delay Lenses and the Impact on the Hubble Constant",
      "authors": [
        "R. Forés-Toribio",
        "C. S. Kochanek",
        "J. A. Muñoz"
      ],
      "abstract": "Dynamical Systematics on Time Delay Lenses and the Impact on the Hubble Constant R. Forés-Toribio, C. S. Kochanek, J. A. Muñoz 24 pages, 13 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) While time-delay lenses can be an independent probe of $H_0$ the estimates are degenerate with the convergence of the lens near the Einstein radius. Velocity dispersions, $\\sigma$, can be used to break the degeneracy, with uncertainties $\\Delta H/H_0 \\propto \\Delta\\sigma^2/\\sigma^2$ ultimately limited by the systematic uncertainties in the kinematic measurements - measuring $H_0$ to 2% requires $\\Delta\\sigma^2/\\sigma^2$ < 2%. Here we explore a broad range of potential systematic uncertainties contributing to eight time-delay lenses used in cosmological analyses. We find that: (1) The characterization of the PSF both in absolute scale and in shape is important, with biases in $\\Delta\\sigma^2/\\sigma^2$ up to 1-6%, depending on the lens system. Small slit miscenterings of the lens are less important. (2) The difference between the measured velocity dispersion and the mean square velocity needed for the Jeans equations is important, with up to $\\Delta\\sigma^2/\\sigma^2 \\sim$ 3-8%. (3) The choice of anisotropy models is important with maximum changes of $\\Delta\\sigma^2/\\sigma^2 \\sim$ 5-18% and the frequently used Osipkov-Merritt models do not produce $h_4$ velocity moments typical of early-type galaxies. (4) Small differences between the true stellar mass distribution and the model light profile matter ($\\Delta\\sigma^2/\\sigma^2 \\sim$ 5-40%), with radial color gradients further complicating the problem. Finally, we discuss how the homogeneity of the early-type galaxy population means that many dynamically related parameters must be marginalized over the lens sample as a whole and not over individual lenses.",
      "pdf_url": "https://arxiv.org/pdf/2602.03934.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.21743",
      "title": "Three-Dimensional Stacking as a Line Intensity Mapping Statistic",
      "authors": [
        "D. A. Dunne",
        "K. A. Cleary",
        "P. C. Breysse",
        "D. T. Chung",
        "H. T. Ihle",
        "J. G. S. Lunde",
        "H. Padmanabhan",
        "N.-O. Stutzer",
        "J. R. Bond",
        "J. O. Gundersen",
        "J. Kim",
        "A. C. S. Readhead"
      ],
      "abstract": "Three-Dimensional Stacking as a Line Intensity Mapping Statistic D. A. Dunne, K. A. Cleary, P. C. Breysse, D. T. Chung, H. T. Ihle, J. G. S. Lunde, H. Padmanabhan, N.-O. Stutzer, J. R. Bond, J. O. Gundersen, J. Kim, A. C. S. Readhead 24 pages, 24 figures (including appendices). Submitted to A&A (v2 is published version) Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Line-intensity mapping (LIM) is a growing technique that measures the integrated spectral-line emission from unresolved galaxies over a three-dimensional region of the Universe. Although LIM experiments ultimately aim to provide powerful cosmological constraints via auto-correlation, many LIM experiments are also designed to take advantage of overlapping galaxy surveys, enabling joint analyses of the two datasets. We introduce a flexible simulation pipeline that can generate mock galaxy surveys and mock LIM data simultaneously for the same population of simulated galaxies. Using this pipeline, we explore a simple joint analysis technique: three-dimensional co-addition (stacking) of LIM data on the positions of galaxies from a traditional galaxy catalogue. We test how the output of this technique reacts to changes in experimental design of both the LIM experiment and the galaxy survey, its sensitivity to various astrophysical parameters, and its susceptibility to common systematic errors. We find that an ideal catalogue for a stacking analysis targets as many high-mass dark matter halos as possible. We also find that the signal in a LIM stacking analysis originates almost entirely from the large-scale clustering of halos around the catalogue objects, rather than the catalogue objects themselves. While stacking is a sensitive and conceptually simple way to achieve a LIM detection, thus providing a valuable way to validate a LIM auto-correlation detection, it will likely require a full cross-correlation to achieve further characterization of the galaxy tracers involved, as the cosmological and astrophysical parameters we explore here have degenerate effects on the stack.",
      "pdf_url": "https://arxiv.org/pdf/2503.21743.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.14898",
      "title": "Self-Interacting Dark Matter with Mass Segregation: A Unified Explanation of Dwarf Cores and Small-Scale Lenses",
      "authors": [
        "Daneng Yang",
        "Yi-Zhong Fan",
        "Siyuan Hou",
        "Yue-Lin Sming Tsai"
      ],
      "abstract": "Self-Interacting Dark Matter with Mass Segregation: A Unified Explanation of Dwarf Cores and Small-Scale Lenses Daneng Yang, Yi-Zhong Fan, Siyuan Hou, Yue-Lin Sming Tsai 18 pages, 12 figures. Version 3, matched to the published version in Science Bulletin. In version two, we: (1) introduce a parametric model for two-component SIDM that accounts for mass segregation; (2) provide a new discussion of baryonic effects; (3) include a statistical interpretation of the GGSL signal; and (4) demonstrate the numerical robustness of our analysis Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) In two-component self-interacting dark matter (SIDM) models with inter-species interactions, mass segregation arises naturally from collisional relaxation, enhancing central densities and gravothermal evolution. We demonstrate that models with velocity-dependent interactions, both within and between species, can connect several small-scale observations while remaining consistent with cluster-scale constraints. This combination enables core formation in dwarf halos, where the presence of baryons increases the inner densities and enhances the predicted strong lensing signatures. Using cosmological and controlled simulations alongside an accurate parametric model, we present proof-of-principle examples showing that this framework can explain the structure of dark perturbers observed in strong lensing systems, and can enhance the efficiency of small-scale lenses by a factor of a few, in line with the excess reported in galaxy-galaxy strong-lensing observations. Importantly, mass segregation can enhance the Einstein radii of SIDM halos relative to their cold dark matter (CDM) counterparts, overcoming a key challenge in one-component SIDM scenarios. Our results present mass segregation in two-component SIDM as a self-consistent, testable framework with the potential to address multiple small-scale challenges in structure formation.",
      "pdf_url": "https://arxiv.org/pdf/2506.14898.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.17761",
      "title": "QUIJOTE scientific results XIX. New constraints on the synchrotron spectral index using a semi-blind component separation method",
      "authors": [
        "Debabrata Adak",
        "J. A. Rubiño-Martín",
        "R. T. Génova-Santos",
        "M. Remazeilles",
        "A. Almeida",
        "K. Aryan",
        "M. Ashdown",
        "R. B. Barreiro",
        "U. Bose",
        "R. Cepeda-Arroita",
        "J.M. Casas",
        "M. Fernández-Torreiro",
        "E. Martínez-Gonzalez",
        "F. Poidevin",
        "R. Rebolo",
        "P. Vielva"
      ],
      "abstract": "QUIJOTE scientific results XIX. New constraints on the synchrotron spectral index using a semi-blind component separation method Debabrata Adak, J. A. Rubiño-Martín, R. T. Génova-Santos, M. Remazeilles, A. Almeida, K. Aryan, M. Ashdown, R. B. Barreiro, U. Bose, R. Cepeda-Arroita, J.M. Casas, M. Fernández-Torreiro, E. Martínez-Gonzalez, F. Poidevin, R. Rebolo, P. Vielva 15 pages, 17 figures, 1 table, accepted in A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We introduce a novel approach to estimate the spectral index, $\\beta_s$, of polarised synchrotron emission, combining the moment expansion of CMB and the constrained-ILC. We reconstructed the maps of the first two synchrotron moments, combining multi-frequency data, and applied the `T-T plot' technique between two moment maps to estimate the synchrotron spectral index. This approach offers a new technique for mapping the foreground spectral parameters, complementing the model-based parametric component separation methods. Applying this technique, we derived a new constraint on the spectral index of polarised synchrotron emission using QUIJOTE MFI wide-survey 11 and 13 GHz data, Wilkinson Microwave Anisotropy Probe data at K and Ka bands, and Planck LFI 30 GHz data. In the Galactic plane and North Polar Spur regions, we obtained an inverse-variance-weighted mean synchrotron index of $\\beta_s = -3.11$ with a standard deviation of $0.21$ due to intrinsic scatter, consistent with previous results based on parametric methods using the same dataset. We find that the inverse-variance-weighted mean spectral index, including both statistical and systematic uncertainties, is $\\beta_s^{\\rm plane} = -3.05 \\pm 0.01$ in the Galactic plane and $\\beta_s^{\\rm high\\text{-}lat} = -3.13 \\pm 0.02$ at high latitudes, indicating a moderate steepening of the spectral index from low to high Galactic latitudes. Our analysis indicates that, within the current upper limit on the Anomalous Microwave Emission polarisation fraction, our results are not subject to any appreciable bias. Furthermore, we infer the spectral index over the entire QUIJOTE survey region, partitioning the sky into 21 patches. This technique can be further extended to constrain the synchrotron spectral curvature by reconstructing higher-order moments when better-quality data become available.",
      "pdf_url": "https://arxiv.org/pdf/2510.17761.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09466",
      "title": "Unbiased analysis of primordial non-Gaussianity: the multipoles of the full relativistic power spectrum",
      "authors": [
        "Chris Addis",
        "Sêcloka L. Guedezounme",
        "Jessie Hammond",
        "Chris Clarkson",
        "Federico Montano",
        "Stefano Camera",
        "Sheean Jolicoeur",
        "Roy Maartens"
      ],
      "abstract": "Unbiased analysis of primordial non-Gaussianity: the multipoles of the full relativistic power spectrum Chris Addis, Sêcloka L. Guedezounme, Jessie Hammond, Chris Clarkson, Federico Montano, Stefano Camera, Sheean Jolicoeur, Roy Maartens 51 pages, 22 figures. Moderate revisions Cosmology and Nongalactic Astrophysics (astro-ph.CO) A major goal of ongoing and future cosmological surveys of the large-scale structure is to measure local type primordial non-Gaussianity in the galaxy power spectrum through the scale-dependent bias. General relativistic effects have been shown to be degenerate with this measurement, therefore requiring a non-Newtonian approach. In this work, we develop a consistent framework to compute integrated effects, including lensing convergence, time delay, and integrated Sachs--Wolfe, along with the local relativistic projection and wide-separation corrections in the multipoles of the power spectrum. We show that, for a \\textit{Euclid}-like H$\\alpha$-line galaxy survey and a MegaMapper-like Lyman-break galaxy survey, ignoring these effects leads to a bias on the best fit measurement of the amplitude of primordial non-Gaussianity, $f_{\\rm NL}$, of around $ 3\\,\\sigma$ and $ 20 \\, \\sigma$ respectively. When we include these corrections, the uncertainty in our knowledge of the luminosity function leads to further uncertainty in our measurement of $f_{\\rm NL}$. In this work, we show that this degeneracy can be partly mitigated by using a bright-faint multi-tracer analysis, where the observed galaxy sample is subdivided into two separate populations based on luminosity, which provides a $15$--$20\\%$ improvement on the forecasted constraints of local type $f_{\\rm NL}$. In addition, we present a novel calculation of the full multi-tracer covariance with the inclusion of wide-separation corrections~-- all of these results are implemented in the \\textit{Python} code \\textsc{CosmoWAP}.",
      "pdf_url": "https://arxiv.org/pdf/2511.09466.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.14425",
      "title": "Deep Chandra Observations of the z = 1.16 Relaxed, Cool-core Galaxy Cluster SPT-CL J2215-3537",
      "authors": [
        "Haley R. Stueber",
        "Adam B. Mantz",
        "Steven W. Allen",
        "Anthony M. Flores",
        "R. Glenn Morris",
        "Abigail Y. Pan",
        "Taweewat Somboonpanyakul",
        "Lindsey E. Bleem",
        "Michael Calzadilla",
        "Benjamin Floyd",
        "Julie Hlavacek-Larrondo",
        "Michael McDonald",
        "Arnab Sarkar"
      ],
      "abstract": "Deep Chandra Observations of the z = 1.16 Relaxed, Cool-core Galaxy Cluster SPT-CL J2215-3537 Haley R. Stueber, Adam B. Mantz, Steven W. Allen, Anthony M. Flores, R. Glenn Morris, Abigail Y. Pan, Taweewat Somboonpanyakul, Lindsey E. Bleem, Michael Calzadilla, Benjamin Floyd, Julie Hlavacek-Larrondo, Michael McDonald, Arnab Sarkar 13 pages, 8 figures, 2 tables. Accepted in ApJ. Updated acknowledgments in v2 Cosmology and Nongalactic Astrophysics (astro-ph.CO) Galaxy clusters serve as a unique and valuable laboratory for probing cosmological models and understanding astrophysics at the high-mass limit of structure formation. Clusters that are dynamically relaxed are especially useful targets of study because of their morphological and dynamical simplicity. However, at redshifts z > 1, very few such clusters have been identified. We present results from new Chandra observations of the cluster SPT-CL J2215-3537 (hereafter SPT J2215), at z = 1.16, the second most distant relaxed, cool-core cluster identified to date. We place constraints on the cluster's total mass profile and investigate its thermodynamic profiles, scaling relations (gas mass, average temperature, and X-ray luminosity), and metal enrichment, resolving the cool core and providing essential context for the massive starburst seen in its central galaxy. We contextualize the thermodynamic and cosmological properties of the cluster within a sample of well-studied, lower-redshift relaxed systems. In this way, SPT J2215 serves as a powerful high-redshift benchmark for understanding the formation of cool cores and the evolution of massive clusters of galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2601.14425.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2404.05833",
      "title": "Data-driven modeling of rotation curves with artificial neural networks",
      "authors": [
        "Gabriela Garcia-Arroyo",
        "Isidro Gómez-Vargas",
        "J. Alberto Vázquez"
      ],
      "abstract": "Data-driven modeling of rotation curves with artificial neural networks Gabriela Garcia-Arroyo, Isidro Gómez-Vargas, J. Alberto Vázquez Physics of the Dark Universe (2026) Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Galactic rotation curves are crucial for understanding the distribution of mass in galaxies. Despite advances in precision observations, there are discrepancies between the inferred mass from luminosity and the observed rotational velocities, often attributed to dark matter. While traditional parametric models provide valuable insights, they struggle with complex galactic features like prominent bulges and non-circular motions. In this study, we apply artificial neural networks to generate robust, data-driven models, tailored to each galaxy, for the rotation curves of spiral galaxies using high-quality observational data. Our approach demonstrates that neural networks can effectively capture the intricate structure of rotation curves without relying on predefined astrophysical assumptions. By comparing the data-based models with the Navarro-Frenk-White model under two different assumptions for the stellar component, we classify galaxies based on the model that best fits their rotation curves, offering insights into the limitations and strengths of both theoretical and data-based methods. This work highlights the potential of machine learning techniques in identifying galaxies whose dynamics are not well captured by standard theoretical models, pointing to the need for more refined physical descriptions.",
      "pdf_url": "https://arxiv.org/pdf/2404.05833.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.10122",
      "title": "Novel method to trace the dark matter density profile around supermassive black holes with AGN reverberation mapping",
      "authors": [
        "Mayank Sharma",
        "Gonzalo Herrera",
        "Nahum Arav",
        "Shunsaku Horiuchi"
      ],
      "abstract": "Novel method to trace the dark matter density profile around supermassive black holes with AGN reverberation mapping Mayank Sharma, Gonzalo Herrera, Nahum Arav, Shunsaku Horiuchi Accepted for publication in Physical Review D Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We propose a new method to determine the dark matter density profile in the vicinity of distant supermassive black holes (SMBH) using reverberation mapping (RM) measurements of active galactic nuclei (AGN). The mapping of multiple emission lines allows the measurement of the enclosed mass within different radii from the central SMBH, which can be used to infer or constrain the dark matter density profile on sub-parsec scales. We apply a toy model based on this method to a sample of fourteen AGN to test its feasibility based on current measurements. We find that for five objects, the observed enclosed mass does grow with radii, hinting towards the presence of a dark matter component at the 1-2 $\\sigma$ level. For these sources, we find global evidence for a universal dark matter profile with a preferred radial steepness of index $\\gamma \\sim 1.6$, consistent with the scenario expected for a dark matter spike mildly relaxed by stellar heating processes. The enclosed dark matter mass, however, is found to be significantly larger than expected. We show that the current RM based mass measurements suffer from large systematic uncertainties, that limit the effectiveness of our method. Our work emphasizes the importance of applying the recent developments in mass determination techniques to target multiple emission lines with future RM and interferometry campaigns. This provides the most direct way of constraining the dark matter density in the sub-parsec regions around extragalactic SMBHs, which is crucial to our understanding of the dynamics and nature of dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2506.10122.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03564",
      "title": "Systematic effect induced by misalignment in a Reflective Polarization Modulator for CMB, and application to the LiteBIRD case",
      "authors": [
        "S. Stellati",
        "F. Piacentini",
        "S. Micheli",
        "A. Novelli",
        "F. Columbro",
        "A. Coppolecchia",
        "P. de Bernardis",
        "S. Masi",
        "M. Najafi",
        "A. Occhiuzzi",
        "L. Pagano",
        "A. Paiella",
        "LiteBIRD Collaboration"
      ],
      "abstract": "Systematic effect induced by misalignment in a Reflective Polarization Modulator for CMB, and application to the LiteBIRD case S. Stellati, F. Piacentini, S. Micheli, A. Novelli, F. Columbro, A. Coppolecchia, P. de Bernardis, S. Masi, M. Najafi, A. Occhiuzzi, L. Pagano, A. Paiella, LiteBIRD Collaboration Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) [Abridged] The LiteBIRD mission aims to measure the Cosmic Microwave Background (CMB) polarization with unprecedented precision, targeting the detection of primordial B modes and a precise determination of the tensor-to-scalar ratio r. A central component of LiteBIRD are the polarization modulators based on Half-Wave Plates (HWP). In this work, we investigate systematic effects caused by a small, constant misalignment between the reflective HWP's rotation axis and optical axis, which mimics a wedge-like effect. This effect can introduce HWP-synchronous pointing errors, biasing polarization measurements and generating spurious B modes. Using the LiteBIRD simulation framework, we implement this wedge-like misalignment in time-ordered data and evaluate its impact on reconstructed maps and angular power spectra. Our results show that the contamination predominantly mimics lensing B modes rather than primordial tensor modes, and its impact is reduced when increasing the number of detectors. By estimating the resulting error on the tensor-to-scalar ratio, we set constraints on the maximum allowable wedge angle to ensure systematic effects remain below mission requirements. This study emphasizes the critical importance of precise optical alignment in CMB polarization experiments. Future work will address the additional effects of time-dependent HWP wobbling and more realistic scenarios with non-ideal detector pairs.",
      "pdf_url": "https://arxiv.org/pdf/2509.03564.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03932",
      "title": "Discovery of crested quasi-periodic eruptions following the most luminous SRG/eROSITA tidal disruption event",
      "authors": [
        "Pietro Baldini",
        "Arne Rau",
        "Andrea Merloni",
        "Benny Trakhtenbrot",
        "Riccardo Arcodia",
        "Margherita Giustini",
        "Giovanni Miniutti",
        "Seán J. Brennan",
        "Michael Freyberg",
        "Paula Sánchez-Sáez",
        "Iuliia Grotova",
        "Zhu Liu",
        "Tianying Lian",
        "Kirpal Nandra"
      ],
      "abstract": "Discovery of crested quasi-periodic eruptions following the most luminous SRG/eROSITA tidal disruption event Pietro Baldini, Arne Rau, Andrea Merloni, Benny Trakhtenbrot, Riccardo Arcodia, Margherita Giustini, Giovanni Miniutti, Seán J. Brennan, Michael Freyberg, Paula Sánchez-Sáez, Iuliia Grotova, Zhu Liu, Tianying Lian, Kirpal Nandra 8 pages, 9 figures. Accepted in A&A as a Letter High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We report the discovery of complex flaring activity from the galactic nucleus hosting the five-year-old tidal disruption event eRASSt J234402.9-352640 (J2344). With Einstein Probe and XMM-Newton observations, we detected highly structured soft X-ray variability. Through temporal decomposition of the XMM-Newton light curve and time-resolved spectral analysis, we identified broad, thermal flares recurring every $\\sim$12 hours and lasting $\\sim$2 hours, consistent with quasi-periodic eruptions (QPEs). Remarkably, these QPEs are accompanied by an unprecedented crest of hotter, shorter flares, each lasting between 5 and 30 minutes. These flares are predominantly found in the rising phases of the QPEs, although they also appear throughout the quiescence. These findings establish J2344 as a new member of the QPE emitter population and uncover a previously unobserved phenomenology that challenges current models of QPEs. In this letter, we present the phenomenological properties of this unique source and discuss possible interpretations within the framework of extreme-mass-ratio inspirals.",
      "pdf_url": "https://arxiv.org/pdf/2602.03932.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03982",
      "title": "Modeling X-ray Bursting Neutron Star Atmospheres",
      "authors": [
        "Lourenzo Colleyn",
        "Zach Medin",
        "Alan Calder"
      ],
      "abstract": "Modeling X-ray Bursting Neutron Star Atmospheres Lourenzo Colleyn, Zach Medin, Alan Calder 12 pages, 5 figures, to appear in the Proceedings of ASTRONUM 2025, the 17th International Conference on Numerical Modeling of Space Plasma Flows at Madison, Wisconsin, USA, 13-18 July, 2025 High Energy Astrophysical Phenomena (astro-ph.HE) We present a verification of a computational model, developed at the Los Alamos National Laboratory (LANL) for simulating radiation transfer in X-ray bursting neutron star atmospheres. We tested a baseline case and demonstrated strong agreement in the behavior of the outgoing spectrum's color-correction factor with earlier work and theoretical expectations. By analyzing the relationship between the simulation time and outgoing flux, we also demonstrated how the model calculates through a sequence of time-independent atmospheric snapshots, each iteratively refined, and uses them to progressively converge toward the correct atmospheric state (as would be observed during a burst). We examined the behavior of the outgoing flux across different optical depths and explored the physical explanations for deviations from a pure blackbody spectrum, attributed to frequency-dependent opacity sources. Additionally, we assessed the impact of Compton scattering, highlighting its role in redistributing photon energies.",
      "pdf_url": "https://arxiv.org/pdf/2602.03982.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04135",
      "title": "McFACTS IV: Electromagnetic Counterparts to AGN Disk Embedded Binary Black Hole Mergers",
      "authors": [
        "Emily McPike",
        "Rosalba Perna",
        "K.E. Saavik Ford",
        "Barry McKernan",
        "Vera Delfavero",
        "Miranda McCarthy",
        "Kaila Nathaniel",
        "Jake Postiglione",
        "Nicolas Posner",
        "Varun Pritmani",
        "Shawn Ray",
        "Richard O'Shaughnessy"
      ],
      "abstract": "McFACTS IV: Electromagnetic Counterparts to AGN Disk Embedded Binary Black Hole Mergers Emily McPike, Rosalba Perna, K.E. Saavik Ford, Barry McKernan, Vera Delfavero, Miranda McCarthy, Kaila Nathaniel, Jake Postiglione, Nicolas Posner, Varun Pritmani, Shawn Ray, Richard O'Shaughnessy 21 pages, 12 figures, 3 tables; submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) The accretion disks of active galactic nuclei (AGN) are promising environments for producing binary black hole (BBH) mergers, which have been detected via gravitational waves (GW) with LIGO-Virgo-KAGRA (LVK). BBH mergers embedded in AGN disks are unique among GW formation channels in their generic ability to produce electromagnetic (EM) counterparts, via interactions between the merger remnant and the surrounding disk gas (though these are not always observable). While such mergers represent valuable multi-messenger sources, the lack of predictive statistical models in existing literature currently limits our ability to select possible EM counterparts with GW detections in archival data and in real time using time-domain surveys such as ZTF or LSST. Here, we employ the Monte Carlo For AGN Channel Testing and Simulation code (\\texttt{McFACTS}\\footnote{this https URL}) to predict the bolometric luminosities of jets and shocks associated with LVK-detectable BBH merger remnants in AGN disks. \\texttt{McFACTS} predicts the distribution of GW observables for an underlying BH population and disk model. In this work we present a new capability that simultaneously generates the distribution of bolometric EM luminosities corresponding to these predicted GW detections. We show that (i) migration traps in dense, Sirko-Goodman-like AGN disks efficiently drive hierarchical BH mergers, yielding high-mass, high-spin BH remnants capable of powering observable EM counterparts across merger generations; and ii) mergers embedded in sufficiently dense disks with chirp mass $\\mathcal{M}\\gtrsim40M_\\odot$ are highly likely to yield observable EM counterparts for sufficiently long-lived disks and top-heavy BH initial mass functions.",
      "pdf_url": "https://arxiv.org/pdf/2602.04135.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.04309",
      "title": "SN 2024abfl: A Low-Luminosity Type IIP Supernova in NGC 2146 from a Low-Mass Red Supergiant Progenitor",
      "authors": [
        "Xiaohan Chen",
        "Ning-Chen Sun",
        "Qiang Xi",
        "Chun Chen",
        "Yu Zhang",
        "Zexi Niu",
        "Junjie Jin",
        "Yiming Mao",
        "Beichuan Wang",
        "Samaporn Tinyanont",
        "Krittapas Chanchaiworawit",
        "Kanthanakorn Noysena",
        "David Aguado",
        "Ismael Perez-Fournon",
        "Frédéric Poidevin",
        "Justyn R. Maund",
        "Xunhao Chen",
        "Pengliang Du",
        "David López Fernández-Nespral",
        "Liguo Fang",
        "Guolin Gao",
        "Jiupeng Guo",
        "Min He",
        "Xinyi Hong",
        "Zhigang Hou",
        "Qingzheng Li",
        "Wenxiong Li",
        "Tongyu Liu",
        "Alicia López-Oramas",
        "Haiyang Mu",
        "César Rojas-Bravo",
        "Jianfeng Tian",
        "Jinhui Wang",
        "Lingzhi Wang",
        "Rui Wang",
        "Yanan Wang",
        "Ziyang Wang",
        "Klaas Wiersema",
        "Ying Wu",
        "Guo Zhen",
        "Jie Zheng",
        "Guoyin Zhu",
        "Yinan Zhu",
        "Zhou Fan",
        "Jing Li",
        "Hong Wu",
        "Jifeng Liu"
      ],
      "abstract": "SN 2024abfl: A Low-Luminosity Type IIP Supernova in NGC 2146 from a Low-Mass Red Supergiant Progenitor Xiaohan Chen, Ning-Chen Sun, Qiang Xi, Chun Chen, Yu Zhang, Zexi Niu, Junjie Jin, Yiming Mao, Beichuan Wang, Samaporn Tinyanont, Krittapas Chanchaiworawit, Kanthanakorn Noysena, David Aguado, Ismael Perez-Fournon, Frédéric Poidevin, Justyn R. Maund, Xunhao Chen, Pengliang Du, David López Fernández-Nespral, Liguo Fang, Guolin Gao, Jiupeng Guo, Min He, Xinyi Hong, Zhigang Hou, Qingzheng Li, Wenxiong Li, Tongyu Liu, Alicia López-Oramas, Haiyang Mu, César Rojas-Bravo, Jianfeng Tian, Jinhui Wang, Lingzhi Wang, Rui Wang, Yanan Wang, Ziyang Wang, Klaas Wiersema, Ying Wu, Guo Zhen, Jie Zheng, Guoyin Zhu, Yinan Zhu, Zhou Fan, Jing Li, Hong Wu, Jifeng Liu High Energy Astrophysical Phenomena (astro-ph.HE) Type IIP supernovae (SNe IIP) exhibit a significant diversity in their explosion properties, yet the physical mechanisms driving this diversity remain unknown. In this work, we present photometric and spectroscopic observations of SN 2024abfl, a SN IIP in NGC 2146 with a directly detected red supergiant (RSG) progenitor. We find it has a low plateau luminosity ($M_V \\sim -15$ mag) and a relatively long plateau length ($\\sim 126.5$ days). By fitting a semi-analytical model, we estimated a $^{56}$Ni mass of $\\sim 0.009 M_\\odot$, an initial kinetic energy of $\\sim 0.42$ foe, an initial thermal energy of $\\sim 0.03$ foe and an ejecta mass of $\\sim 8.3 M_\\odot$. The spectral evolution of SN 2024abfl is similar to those of other SNe IIP, except for much lower ejecta velocities at similar epochs. At later epochs, we find a relatively high-velocity H$\\alpha$ absorption feature at $\\sim -4000$ km s$^{-1}$, possibly due to a fast-moving plume of matter in the inner ejecta, and two emission features at $\\pm 2000$ km s$^{-1}$, possibly caused by CSM interaction. We estimate the progenitor mass to be $\\le 15 M_\\odot$ based on nebular spectra. We conclude that SN 2024abfl is a low-luminosity SN IIP originating from a low-mass RSG progenitor.",
      "pdf_url": "https://arxiv.org/pdf/2602.04309.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04519",
      "title": "Emergence of cyclic flux eruptions in kinetic simulations of magnetized spherical accretion onto a Schwarzschild black hole",
      "authors": [
        "Enzo Figueiredo",
        "John Mehlhaff",
        "Adrien Soudais",
        "Benoît Cerutti"
      ],
      "abstract": "Emergence of cyclic flux eruptions in kinetic simulations of magnetized spherical accretion onto a Schwarzschild black hole Enzo Figueiredo, John Mehlhaff, Adrien Soudais, Benoît Cerutti 12 pages, 9 figures, submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE) The dynamics of black hole magnetospheres critically depend on the black hole spin and on the structure of the accretion flow. In the limit of a Schwarzschild black hole immersed in a zero-net angular momentum flow, accretion is spherical. However, in the presence of a large-scale vertical magnetic field, the classical Bondi accretion model is significantly altered. The frozen-in field is stretched radially as the plasma is pulled inward by gravity. This continues until the restoring force from the magnetic tension suddenly expels the material and resets the field, allowing a new cycle to begin. Although this scenario has been well depicted in previous studies, it remains incomplete as the issues of dissipation and particle acceleration are not yet fully resolved. In this work, we aim to revisit these issues with a first-principles kinetic plasma model. We perform two-dimensional global general relativistic particle-in-cell simulations of magnetized spherical accretion onto a Schwarzschild black hole, for both pair and electron-ion plasmas. The simulations are evolved over long timescales to capture multiple flux eruption events and establish a quasi-steady state. For each accretion cycle, we find that the system goes through three main stages: (i) an ideal advection phase where magnetic flux through the horizon increases quasi-linearly with time; (ii) a reconnection-regulated phase where the net increase of the flux is slowed down by intermittent reconnection events near the horizon; and (iii) a flaring phase when a major, large-scale reconnection event expels the flux, leading to efficient particle acceleration. The emergence of large-amplitude quasi-periodic flux eruptions and concomitant particle acceleration is reminiscent of Sgr A* flaring activity. This phenomenon could also be applicable to quiescent black holes, especially isolated black holes accreting the interstellar medium.",
      "pdf_url": "https://arxiv.org/pdf/2602.04519.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04592",
      "title": "$γ$-Ray Lines -- Signatures of Nucleosynthesis, Cosmic Rays, Positron Annihilation, and Fundamental Physics",
      "authors": [
        "Thomas Siegert",
        "Francesca Calore",
        "Pierre Jean",
        "Mark Leising",
        "Nicolas de Séréville",
        "Gerald H. Share",
        "Vincent Tatischeff",
        "Wei Wang",
        "Meng-Ru Wu"
      ],
      "abstract": "$γ$-Ray Lines -- Signatures of Nucleosynthesis, Cosmic Rays, Positron Annihilation, and Fundamental Physics Thomas Siegert, Francesca Calore, Pierre Jean, Mark Leising, Nicolas de Séréville, Gerald H. Share, Vincent Tatischeff, Wei Wang, Meng-Ru Wu 109 pages, 36 figures, 6 tables, accepted as contribution to the book \"MeV Universe\" High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Space Physics (physics.space-ph) The nuclear $\\gamma$-ray lines in the MeV range of the electromagnetic spectrum hold a vast variety of astrophysical, particle-physical, and fundamental physical information that is otherwise extreme difficult to access. MeV $\\gamma$-ray line observations provide the most direct evidence for ongoing nucleosynthesis in galaxies by measuring freshly produced radioactive isotopes from massive stars, supernovae, classical novae, or binary neutron star mergers. Their flux ratios can determine the low-energy cosmic-ray spectrum in different objects and of the Milky Way as a whole. Different phases of the interstellar medium are traced by hot nucleosynthesis ejecta, cooling positrons, or cosmic-ray interactions with molecular clouds. Positron annihilation itself can be considered as an astrophysical messenger as their production and destruction in typical space environments is inevitable. Finally, as-of-yet unknown signatures from beyond standard model physics might have their elusive imprints in $\\gamma$-ray lines. This Chapter gives an overview of historical $\\gamma$-ray line measurements, newest results, and open questions that may only be solved by a new generation of MeV telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2602.04592.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04622",
      "title": "Constraints on cyclotron features and accretion regime in the high-mass X-ray binary 4U 1700--37 from NuSTAR",
      "authors": [
        "Lautaro West-Ocampo",
        "Federico A. Fogantini",
        "Enzo A. Saavedra",
        "Jorge A. Combi",
        "Federico García",
        "Pedro L. Luque-Escamilla",
        "Josep Martí",
        "Sylvain Chaty",
        "Juan F. Albacete-Colombo"
      ],
      "abstract": "Constraints on cyclotron features and accretion regime in the high-mass X-ray binary 4U 1700--37 from NuSTAR Lautaro West-Ocampo, Federico A. Fogantini, Enzo A. Saavedra, Jorge A. Combi, Federico García, Pedro L. Luque-Escamilla, Josep Martí, Sylvain Chaty, Juan F. Albacete-Colombo 12 pages, 4 figures - Accepted in Journal of High Energy Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) 4U 1700-37 is a wind-fed high-mass X-ray binary hosting a compact object, likely a neutron star, accreting from O6.5 Iaf+ supergiant HD 153919. Coherent pulsations not firmly detected; magnetic field strength remains uncertain. We analyze NuSTAR observations to characterize hard X-ray timing and spectral properties, test robustness of candidate cyclotron features, and constrain magnetic field and accretion regime. We perform timing and spectral analysis of two observations, modeling spectra with continua used for accreting pulsars, and use simulations to assess significance of features. No coherent pulsations detected; pulsed fraction constrained below 1.5\\%. Spectra are well described by absorbed blackbody plus cutoff power-law continuum, showing residuals around 20 keV and 40--50 keV. Features improve fits but do not constitute firm cyclotron detections. Intensity-resolved spectroscopy suggests possible shifts of apparent line centroid. Results favor neutron-star magnetic field of 1.7--4.4 $\\times 10^{12}$ G and quasi-spherical subsonic accretion regime with equilibrium spin period $\\sim 1.9$ ks. Analysis provides quantitative constraints on magnetic field and accretion physics, helping reconcile discrepant line-energy measurements.",
      "pdf_url": "https://arxiv.org/pdf/2602.04622.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04660",
      "title": "An Afterglow Study of the \"New Year's Burst\" GRB 220101A",
      "authors": [
        "Agniva Roychowdhury",
        "Tuomas Kangas",
        "Andrew Fruchter",
        "A. Pe'er",
        "K. Bhirombhakdi",
        "J. Graham",
        "K. Misra",
        "A. J. Levan",
        "B. Cenko",
        "A. Cucchiara",
        "V. Cunningham",
        "B. P. Gompertz",
        "D. Perley",
        "J. Racusin",
        "N. R. Tanvir"
      ],
      "abstract": "An Afterglow Study of the \"New Year's Burst\" GRB 220101A Agniva Roychowdhury, Tuomas Kangas, Andrew Fruchter, A. Pe'er, K. Bhirombhakdi, J. Graham, K. Misra, A. J. Levan, B. Cenko, A. Cucchiara, V. Cunningham, B. P. Gompertz, D. Perley, J. Racusin, N. R. Tanvir 17 pages, 10 figures. Submitted to The Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE) We present a detailed broadband afterglow study of GRB 220101A ($10^4\\lesssim\\Delta T\\lesssim10^7$ s) combining multi-wavelength data from soft X-rays until 6 GHz. The afterglow light curves in both X-ray and optical show distinct steepening around $\\sim9$ days, followed by a sharp post-break decay index of $\\sim2.99\\pm0.10$. We fit the light curves using the afterglow modelling package \\texttt{afterglowpy} for both Top-hat and Gaussian jets for different values of the electronic participation fraction $\\xi$ from 0.01 to 1.0 and find that, although the radio behavior is well described by the $\\xi=1.0$ case, the required circumburst medium (CBM) densities are very low, $<10^{-4}$ cm$^{-3}$. However, the resulting energy requirements are modest, $\\sim10^{52}$ erg, with an electron energy distribution (EED) index $p\\sim2.05$. Similar results are also obtained from an analytic model fit to the light curve, except the predicted $p$ is higher, $\\sim2.40$. The observed post-break decay index of $2.99$ is at least 5$\\sigma$ away from $p$, which is one of the steepest observed so far. We also find that when ignoring the radio observations, the CBM density is raised by a few orders of magnitude to $\\sim0.01$ cm$^{-3}$ for $\\xi=1.0$, still far from the expected ISM density ($>1$ cm$^{-3}$) of GRB environments, which are highly star forming regions. Similarly low ISM densities have been seen in modeling of other LAT GRBs as well, especially ones with reverse-shock features (e.g., GRBs 130427A, 160509A and 160625B), thereby hinting at either an issue with the standard model or possible evacuated cavities where GRBs explode.",
      "pdf_url": "https://arxiv.org/pdf/2602.04660.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03941",
      "title": "Low-mass stars dominate the hot (0.7 keV) Galactic X-ray emission",
      "authors": [
        "G. Ponti",
        "M. C. H. Yeung",
        "G. Stel",
        "N. Locatelli",
        "X. Zheng",
        "B. Stelzer",
        "A. Merloni",
        "M. Caramazza",
        "E. Magaudda",
        "M. Sasaki",
        "K. Dennerl",
        "T. H. Reiprich",
        "A. Schwope",
        "W. Becker",
        "M. Freyberg"
      ],
      "abstract": "Low-mass stars dominate the hot (0.7 keV) Galactic X-ray emission G. Ponti, M. C. H. Yeung, G. Stel, N. Locatelli, X. Zheng, B. Stelzer, A. Merloni, M. Caramazza, E. Magaudda, M. Sasaki, K. Dennerl, T. H. Reiprich, A. Schwope, W. Becker, M. Freyberg Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The circumgalactic medium (CGM) of the Milky Way is composed of a tenuous atmosphere filled with multi-phase plasma, including a warm-hot virialised component. Recent studies suggest a much hotter (~0.7 keV) super-virial component detected in both absorption and emission. We want to shed light on the nature of this putative super-virial component. We analysed the X-ray background as observed by SRG/eROSITA over the entire western Galactic hemisphere. We show that low-mass stars provide a large fraction of the 0.7 keV emission. Indeed, a tight correlation is found between the surface brightness of the 0.7 keV emission and the mass distribution of the Milky Way across a large portion of the western Galactic hemisphere. The correlation coefficient implies an X-ray luminosity per unit of stellar mass comparable to that of the average low-mass stars within 10 pc of the Sun, suggesting that unresolved M dwarfs and F, G, and K type stars dominate the 0.7 keV emission. This emission is asymmetric with respect to the Galactic plane, influenced by the asymmetric distribution of nearby star-forming regions, and broadly consistent with the known offset of the Sun above the Galactic midplane. The remaining signal might be produced by the cumulative emission of stars of different types or ages, in addition to other sources (e.g. hot interstellar medium, Galactic corona, etc.). Assuming that the putative residual hot super-virial atmosphere is homogeneous and has a spherical beta profile with slope $\\beta=0.4$, we constrain its density at 10 kpc to be $n_e<4\\times10^{-4}$~cm$^{-3}$. Our findings may help refine models of the circumgalactic medium around external galaxies, advancing our understanding of hot baryon flows and galaxy evolution.",
      "pdf_url": "https://arxiv.org/pdf/2602.03941.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04065",
      "title": "Eigenmodes in an ultra-relativistic ultra-magnetized pair QED-plasma",
      "authors": [
        "Ryan T. Low",
        "Mikhail V. Medvedev"
      ],
      "abstract": "Eigenmodes in an ultra-relativistic ultra-magnetized pair QED-plasma Ryan T. Low, Mikhail V. Medvedev Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Ultra-relativistic quantum-electrodynamic (QED) plasmas, characterized by magnetic field strengths approaching and even exceeding the Schwinger field of approximately $B_{Q} \\approx 4 \\times 10^{13}$ gauss, hold significant interest for laser-plasma experiments and astrophysical observations of neutron stars and magnetars. In this study, we investigate the joint modification of normal plasma modes in ultra-relativistic electron-positron plasmas, both charge neutral and non-neutral, by the super-strong magnetic field and plasma relativistic temperature. Our analysis shows that the most substantial modification concerns the reduction of the plasma frequency cutoff, resulting in relativistic and field-induced transparency. Additionally, we observe a temperature-independent modification of the index of refraction of electromagnetic waves, which coincides with the behavior observed in a cold QED plasma.",
      "pdf_url": "https://arxiv.org/pdf/2602.04065.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04421",
      "title": "From Main Sequence Binary to Blast: MESA Modeling of the Double-Detonation Progenitor PTF1~J2238+7430",
      "authors": [
        "Mercedes S. Hernandez",
        "Thomas Kupfer",
        "Diogo Belloni",
        "Matthias R. Schreiber"
      ],
      "abstract": "From Main Sequence Binary to Blast: MESA Modeling of the Double-Detonation Progenitor PTF1~J2238+7430 Mercedes S. Hernandez, Thomas Kupfer, Diogo Belloni, Matthias R. Schreiber Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Hot subdwarf B (sdB) stars in close binaries with white dwarf (WD) companions are potential progenitors of double-detonation thermonuclear supernovae. The recently discovered system PTF1 J2238+7430 is a candidate for this evolutionary channel, hosting a low-mass sdB and a comparatively massive WD in a compact orbit. We aim to reproduce the evolutionary history of PTF1 J2238+7430, in which the sdB forms first via stable mass transfer, followed by the formation of the WD through a subsequent common-envelope (CE) phase. Additionally, we seek to constrain the range of initial binary parameters that can lead to such double-detonation progenitors. Using the Modules for Experiments in Stellar Astrophysics (MESA), we performed detailed binary evolution simulations from the zero-age main sequence to the present-day configuration. We explored initial stellar masses, orbital periods, and mass-loss fractions, including the effects of angular momentum transfer, tidal synchronization, and gravitational-wave-driven orbital evolution. The post-CE binary properties were derived using the standard energy formalism. Our models successfully reproduce the observed properties of PTF1 J2238+7430, consisting of a 0.406 solar-mass sdB and a 0.72 solar-mass WD in a 76.34-minute orbit. Stable Roche-lobe overflow of an approximately 2.7 solar-mass donor produces the sdB, while the WD forms from the initially less massive companion during an episode of CE evolution. We find that the CE ejection efficiency must be high to match the observed orbit, exceeding canonical values for similar systems. We further delineate the allowed parameter space for initial binaries that can evolve into sdB+WD systems consistent with double-detonation progenitors. These limits are preliminary; a systematic exploration of all parameters is needed for robust constraints, but our results provide a useful starting point for future work.",
      "pdf_url": "https://arxiv.org/pdf/2602.04421.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.04474",
      "title": "SN 2017ati: A luminous type IIb explosion from a massive progenitor",
      "authors": [
        "Z.-H. Peng",
        "S. Benetti",
        "Y.-Z. Cai",
        "A. Pastorello",
        "J.-W. Zhao",
        "A. Reguitti",
        "Z.-Y. Wang",
        "E. Cappellaro",
        "N. Elias-Rosa",
        "Q.-L. Fang",
        "M. Fraser",
        "T. Kangas",
        "E. Kankare",
        "Z. Kostrzewa-Rutkowska",
        "P. Lundqvist",
        "S. Mattila",
        "T. M. Reynolds",
        "M. D. Stritzinger",
        "A. Somero",
        "L. Tomasella",
        "S.-P. Pei",
        "Y.-J. Yang",
        "J.-J. Zhang",
        "Y. Pan"
      ],
      "abstract": "SN 2017ati: A luminous type IIb explosion from a massive progenitor Z.-H. Peng, S. Benetti, Y.-Z. Cai, A. Pastorello, J.-W. Zhao, A. Reguitti, Z.-Y. Wang, E. Cappellaro, N. Elias-Rosa, Q.-L. Fang, M. Fraser, T. Kangas, E. Kankare, Z. Kostrzewa-Rutkowska, P. Lundqvist, S. Mattila, T. M. Reynolds, M. D. Stritzinger, A. Somero, L. Tomasella, S.-P. Pei, Y.-J. Yang, J.-J. Zhang, Y. Pan Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We present optical photometric and spectroscopic observations of the Type~IIb supernova (SN)~2017ati. It reached the maximum light at about 27~d after the explosion and the light curve shows a broad, luminous peak with an absolute $r$-band magnitude of $M_{r} = -18.48 \\pm 0.16$~mag. At about 50~d after maximum light, SN~2017ati exhibits a decline rate close to that expected from the $^{56}$Co $\\rightarrow$ $^{56}$Fe radioactive decay, at 0.98 mag per 100 days, as usually observed in SNe IIb. However, it remains systematically brighter at late times by about 1--2~mag, exceeding the usual upper luminosity range of this class. As a result, modelling the light curve of SN~2017ati with a standard $^{56}$Ni decay scenario requires a large nickel mass of up to $\\sim0.37\\,M_{\\odot}$ and still fails to reproduce the early-time light curve adequately. In contrast, incorporating additional energy input from a magnetar yields a significantly improved fit to the light curve of SN~2017ati, which would reduce the nickel mass to $\\sim0.21\\,M_{\\odot}$, still close to the upper end of the range typically inferred for SNe~IIb. Comparing the fitted results of SN~2017ati with the known sample of SNe~IIb indicates that its luminosity evolution is best explained by a combination of neutron star spin-down energy and radioactive nickel deposition. From late-time nebular spectra of SN~2017ati, the luminosity of the [\\Oi]~$\\lambda\\lambda6300,6364$ doublet implies an oxygen mass of $\\sim1.82-3.34\\,M_{\\odot}$, and the combination of a [\\Caii]/[\\Oi] flux ratio of $\\sim0.5$ with nebular spectral model comparisons favours a progenitor zero-age main-sequence mass of $\\geq17\\,M_{\\odot}$.",
      "pdf_url": "https://arxiv.org/pdf/2602.04474.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04666",
      "title": "Expanding the Horizon of Black Hole Imaging with AtLAST",
      "authors": [
        "Kazunori Akiyama",
        "Mariafelicia De Laurentis",
        "Ziri Younsi",
        "Yuto Akiyama",
        "Dominic W. Pesce",
        "Geoffrey C. Bower",
        "Kazuhiro Hada",
        "Jens Kauffmann",
        "Shoko Koyama",
        "Kotaro Moriyama",
        "Derek-Ward Thompson"
      ],
      "abstract": "Expanding the Horizon of Black Hole Imaging with AtLAST Kazunori Akiyama, Mariafelicia De Laurentis, Ziri Younsi, Yuto Akiyama, Dominic W. Pesce, Geoffrey C. Bower, Kazuhiro Hada, Jens Kauffmann, Shoko Koyama, Kotaro Moriyama, Derek-Ward Thompson 4 pages, 3 figures, a public version of a white paper submitted to the ESO Call for \"Expanding Horizons\" Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) The Event Horizon Telescope (EHT) has directly resolved and imaged two supermassive black holes and opening a new window on black hole physics. However, the current array is limited to only these two brightest nearby targets. This white paper outlines how future EHT upgrades, anchored by the Atacama Large Aperture Submillimeter Telescope (AtLAST), will enable a transformative expansion of the accessible population of event-horizon-scale sources. By substantially improving sensitivity and multi-frequency capabilities, EHT+AtLAST will enable demographic studies of black hole growth, accretion physics, and jet launching across a wide range of masses, environments, and accretion states.",
      "pdf_url": "https://arxiv.org/pdf/2602.04666.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.04387",
      "title": "Cosmic Ray Magnetohydrodynamics: A New Two-Moment Framework with Numerical Implementation",
      "authors": [
        "Xihui Zhao",
        "Xue-Ning Bai",
        "Eve C. Ostriker"
      ],
      "abstract": "Cosmic Ray Magnetohydrodynamics: A New Two-Moment Framework with Numerical Implementation Xihui Zhao, Xue-Ning Bai, Eve C. Ostriker Revised after acceptance by ApJS: notation streamlined, typos corrected, and minor clarifications added. The main content and conclusions remain unchanged. Now 33 pages, 12 figures High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Cosmic rays (CRs) play a pivotal role in various astrophysical systems, delivering feedback over a broad range of scales. However, modeling CR transport remains challenging due to its inherently multi-scale nature and complex microphysics. Recent advances in two-moment CR hydrodynamics have alleviated some of these challenges, improving understanding of CR feedback. Yet, current two-moment methods may not be able to directly incorporate all relevant CR transport processes, while the outcome of CR feedback sensitively depends on these underlying microphysics. Furthermore, numerical challenges persist, including instabilities from streaming terms and ambiguities in solver design for coupled CR-MHD systems. In this work, we develop a two-moment description for CR hydrodynamics from first principles. Beyond canonical CR streaming, our formulation accounts for CR pressure anisotropy and Alfvén waves propagating in both directions along the magnetic field, providing a general framework to incorporate more CR transport physics. We implement this framework as a new CR fluid module in the \\textit{Athena}++ code, and validate it through a suite of benchmark tests. In particular, we derive the full dispersion relation of the two-moment CR-MHD system, identifying the CR-acoustic instability as well as other wave branches. These CR-MHD waves serve as rigorous benchmarks and also enable the use of realistic signal speeds in our Riemann solver. We propose a time step guideline to mitigate numerical instabilities arising from streaming source terms.",
      "pdf_url": "https://arxiv.org/pdf/2509.04387.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16303",
      "title": "New determination of the neutrino hadronic production cross sections from GeV to beyond PeV energies",
      "authors": [
        "Luca Orusa",
        "Mattia Di Mauro",
        "Fiorenza Donato"
      ],
      "abstract": "New determination of the neutrino hadronic production cross sections from GeV to beyond PeV energies Luca Orusa, Mattia Di Mauro, Fiorenza Donato 11 pages, 6 figures. Typos corrected, matches version published by PRD. The tables of the energy differential cross sections of neutrinos with a script to read them can be found here: this https URL Phys.Rev.D 113 (2026) 2, 023043 High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) The flux of astrophysical neutrinos is now measured with unprecedented accuracy and over several decades of energy spectrum. Their origin traces back to hadronic collisions between protons and nuclei in the cosmic rays with hydrogen and helium in the target gas. To accurately interpret the data, a precise determination of the underlying cross sections is therefore mandatory. We present a new evaluation of the neutrino production cross section from $p+p$ collisions, building on our previous analysis of the production cross section for $\\pi^\\pm$, $K^\\pm$, and minor baryonic and mesonic channels. Cross sections for scatterings involving nuclei heavier than protons are also derived. The novelty of our approach is the analytical description of the Lorentz invariant cross section $\\sigma_{\\rm inv}$, and the fit of the model to the available accelerator data. We work with neutrino energies from $10$ GeV to $10^7$ GeV, and, correspondingly, to incident proton (nuclei) energies from $10$ GeV to $10^9$ GeV (GeV/n). We obtain the total differential cross section, $d\\sigma(p+p\\rightarrow \\nu+X)/dE_{\\nu}$ as a function of neutrino and proton energies, with an estimated uncertainty of 5% for neutrino energies below 100 GeV, increasing to 10% above TeV energies. Predictions are given for $\\nu_e, \\nu_\\mu, \\bar{\\nu_e}$ and $\\bar{\\nu_\\mu}$. A comparison with state-of-the-art cross sections, all relying on Monte Carlo generators, is also presented. To facilitate the use by the community, we provide numerical tables and a script for accessing our energy-differential cross sections.",
      "pdf_url": "https://arxiv.org/pdf/2509.16303.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04619",
      "title": "The X-ray properties and structure of A3571 up to $R_{500}$",
      "authors": [
        "X. Zheng",
        "H. Yu",
        "S. Jia",
        "C. Li",
        "X. Hou",
        "A. Liu",
        "Y. Chen",
        "H. Feng",
        "L. Song",
        "C. Liu",
        "F. Lu",
        "S. Zhang",
        "W. Yuan",
        "J. Sanders",
        "J. Wang",
        "K. Nandra",
        "W. Cui",
        "J. Guan",
        "D. Han",
        "C. Jin",
        "Y. Liu",
        "J. Xu",
        "J. Zhang",
        "H. Zhao",
        "X. Zhao"
      ],
      "abstract": "The X-ray properties and structure of A3571 up to $R_{500}$ X. Zheng, H. Yu, S. Jia, C. Li, X. Hou, A. Liu, Y. Chen, H. Feng, L. Song, C. Liu, F. Lu, S. Zhang, W. Yuan, J. Sanders, J. Wang, K. Nandra, W. Cui, J. Guan, D. Han, C. Jin, Y. Liu, J. Xu, J. Zhang, H. Zhao, X. Zhao 10 pages, 9 figures. Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Abell 3571 is a nearby, X-ray bright galaxy cluster located in the Shapley Supercluster. Although it appears morphologically relaxed in X-ray images, multiwavelength observations reveal subtle indications of residual dynamical activity, likely associated with past merger events. Using wide-field ($1^{\\circ} \\times 1^{\\circ}$) data from the Einstein Probe Follow-up X-ray Telescope (EP-FXT), we extend measurements of the cluster's properties beyond its $R_{500}$ radius. We detect surface-brightness excesses on both the northern and southern sides, consistent with previous XMM-Newton results. The temperature, pressure, and entropy in the northern excess region are lower than the average values, whereas those on the southern side are slightly higher. However, we find no evidence for cold fronts or shocks. These features can be interpreted as sloshing motions triggered by an off-center minor merger. Our findings suggest that, despite its symmetric appearance, A3571 is still recovering from a minor merger and is currently in a post-merger phase. This work also demonstrates the excellent capability of EP-FXT for probing the outskirts of galaxy clusters.",
      "pdf_url": "https://arxiv.org/pdf/2601.04619.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.14156",
      "title": "A multi-wavelength study of the 2025 low state of the intermediate polar BG CMi",
      "authors": [
        "A. W. Shaw",
        "K. Mukai",
        "C. O. Heinke",
        "C. G. Nixon",
        "D. A. H. Buckley",
        "P. A. Dubovský",
        "F.-J. Hambsch",
        "J. Hilburn",
        "K. Petrík",
        "R. M. Plotkin",
        "S. B. Potter",
        "N. Rawat",
        "T. Shahbaz",
        "S. Dufoer",
        "S. Dvorak",
        "D. Messier",
        "G. Myers",
        "P. Nelson",
        "R. Sabo",
        "J. Ulowetz",
        "T. Vanmunster"
      ],
      "abstract": "A multi-wavelength study of the 2025 low state of the intermediate polar BG CMi A. W. Shaw, K. Mukai, C. O. Heinke, C. G. Nixon, D. A. H. Buckley, P. A. Dubovský, F.-J. Hambsch, J. Hilburn, K. Petrík, R. M. Plotkin, S. B. Potter, N. Rawat, T. Shahbaz, S. Dufoer, S. Dvorak, D. Messier, G. Myers, P. Nelson, R. Sabo, J. Ulowetz, T. Vanmunster 20 pages, 10 figures, 1 table. Accepted for publication in ApJ. v2 fixes some footnotes and adds a note in the Acknowledgements section. v3 corrects a misspelled co-author's name High Energy Astrophysical Phenomena (astro-ph.HE) We present multi-wavelength observations of the first recorded low state of the intermediate polar BG CMi. Optical monitoring of the source by members of the American Association of Variable Star Observers reveals a decrease of ~0.5 mag that lasted ~50 d in early 2025. During the low state the optical timing properties imply that BG CMi underwent a change in the accretion mode, as power at the spin frequency $\\omega$ dramatically dropped. An XMM-Newton observation revealed a substantial decrease in intrinsic absorption and a slight increase in intrinsic X-ray luminosity, compared to archival Suzaku data. Timing analysis of the X-ray light curves shows that power shifted from the orbital frequency $\\Omega$ (prominent in Suzaku data) to $2\\Omega$ in the low state XMM-Newton data, along with the strengthening of certain orbital sidebands. We suggest that BG CMi transitioned to disk-overflow accretion, where the white dwarf accreted matter via both a disk and a stream, the latter becoming more dominant during the low state due to a decrease in the mass and size of the disk.",
      "pdf_url": "https://arxiv.org/pdf/2601.14156.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16674",
      "title": "Investigating Twin Star Equation of States in Light of Recent Astrophysical Observations",
      "authors": [
        "Shamim Haque",
        "Atharva Shinde",
        "Asim Kumar Saha",
        "Tuhin Malik",
        "Ritam Mallick"
      ],
      "abstract": "Investigating Twin Star Equation of States in Light of Recent Astrophysical Observations Shamim Haque, Atharva Shinde, Asim Kumar Saha, Tuhin Malik, Ritam Mallick 17 pages, 6 Figures and 6 Tables High Energy Astrophysical Phenomena (astro-ph.HE) Twin stars are predicted to exist in nature if the hadron-to-quark phase transition is strong enough to form a new branch of hybrid stars, separated from the branch of neutron stars. We adopt an agnostic approach, using transition energy density, transition pressure, the discontinuity strength, and a constant speed of sound for quark matter as our parameter space to construct a large possibility of hybrid equations of state, and thereby encapsulating a comprehensive picture of the twin star scenario. First, we report the complete conditions on our parameter space imposed by the general relativistic hydrostatic equilibrium solutions. For a fixed transition energy density and speed of sound for quark matter, we define distinct ranges of transition pressures based on the allowed strengths of discontinuity. Below a maximum transition pressure, a range of discontinuity exists that increases as the transition pressure decreases. Thereby, we identify the loci of the limits on discontinuities as the `witch-hat' curves. Based on the causality limit, the witch-hat curves can be punctured or incomplete. Strong constraints on this picture are drawn from the inferences from GW170817 and the NICER measurements. We computed the maximum mass for twin stars to be $2.05~M_\\odot$, the allowed strongest discontinuity in rest-mass density to be $7.76\\rho_\\mathrm{sat}$, and the upper bound on transition rest-mass density to be $4.03\\rho_\\mathrm{sat}$. Subsequently, we compute the implications of the stiffness of the quark matter equation of state on this picture. Different confidence levels for observational inferences are considered to assess the extent of inclusion (and rejection) of hybrid equations of state and, consequently, their effects on the limits of the maximum mass of twin stars and phase transition properties.",
      "pdf_url": "https://arxiv.org/pdf/2601.16674.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.05151",
      "title": "Laboratory Modeling of Supernova Remnants Collisions: Implications for Triggered Star Formation",
      "authors": [
        "Marin Fontaine",
        "Clotilde Busschaert",
        "Émeric Falize"
      ],
      "abstract": "Laboratory Modeling of Supernova Remnants Collisions: Implications for Triggered Star Formation Marin Fontaine, Clotilde Busschaert, Émeric Falize Astrophysical Journal, 998, 74 (2026) Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Theoretical models of star formation consistently underestimate the rates observed in astronomical surveys. Stars form within giant molecular clouds, which fragment into dense clumps under the combined influences of turbulence, magnetic fields, radiation, and gravity. While some of these clumps collapse spontaneously, others require an external trigger, a mechanism estimated to account for 14%-25% of star formation in regions such as the Elephant Trunk Nebula. Laboratory astrophysics has emerged as a powerful approach for investigating such triggering processes, in particular those involving supernova remnants (SNRs). Recent experiments, guided by well-established scaling laws, have successfully replicated the dynamics of SNRs and their interactions with dense clumps or other SNRs. In this work, we present a comprehensive numerical study of these experimental configurations using the 3D radiation-hydrodynamics code TROLL. The simulations provide enhanced insight into the underlying physical mechanisms, accurately reproduce key experimental phenomena, and offer valuable comparisons with analytical models. This study underscores the strong synergy between laboratory experiments and numerical simulations, laying a robust foundation for future advancements in laboratory astrophysics. Furthermore, we propose a new experimental setup that offers improved scaling for the asymmetric collision observed in the DEM L316 system. Our findings also show that SNR collisions in dense environments can decrease the gravitational stability of dense clumps, thereby promoting their collapse and potentially triggering star formation.",
      "pdf_url": "https://arxiv.org/pdf/2508.05151.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.10821",
      "title": "Co-evolution of Nuclear Star Clusters and Massive Black Holes: Extreme Mass-Ratio Inspirals",
      "authors": [
        "Fupeng Zhang",
        "Pau Amaro Seoane"
      ],
      "abstract": "Co-evolution of Nuclear Star Clusters and Massive Black Holes: Extreme Mass-Ratio Inspirals Fupeng Zhang, Pau Amaro Seoane 31 pages, 15 figures, accepted for publication in ApJ. Modified according to the referee's report Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We explore extreme mass-ratio inspirals (EMRIs) in the co-evolution of massive black holes (MBHs) and nuclear star clusters (NSCs), which host diverse stellar populations across a wide range of masses. The dynamics are simulated self-consistently with GNC, which we have updated to incorporate gravitational wave orbital decay, the loss cone of a spinning MBH, and stellar evolution. Over $12$ Gyr, we investigate the evolution of the NSC with a mass-growing MBH, as well as the EMRIs of stellar black holes, neutron stars, white dwarfs, brown dwarfs (BDs), and low-mass main-sequence stars (MSs), along with tidal disruption events (TDEs) involving MSs, BDs, and post-MSs. The mass growth of the MBH contributed by TDEs is typically $\\sim 10^7\\,M_{\\odot}$, $\\sim 10^6\\,M_{\\odot}$, and $\\sim 5\\times10^4\\,M_{\\odot}$ for massive, Milky-Way-like, and smaller NSCs, respectively. Between $40\\%$ and $70\\%$ of the stellar mass is lost during stellar evolution, which dominates the mass growth of the MBH if a significant fraction of the lost mass is accreted. The evolution of EMRI rates is generally affected by the cluster's size expansion or contraction, stellar population evolution, MBH mass growth, and the stellar initial mass function. The EMRI rates for compact objects peak at early epochs ($\\lesssim 1$ Gyr) and then gradually decline over cosmic time. LISA-band ($0.1$ mHz) EMRIs involving compact objects around Milky-Way-like MBHs tend to have high eccentricities, while those around spinning MBHs preferentially occupy low-inclination (prograde) orbits. In contrast, MS- and BD-EMRIs usually have eccentricity and inclination distributions that are distinct from those of compact objects.",
      "pdf_url": "https://arxiv.org/pdf/2510.10821.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.03976",
      "title": "On the coupled origin of the stellar IMF and multiplicity",
      "authors": [
        "B. Thomasson",
        "I. Joncour",
        "E. Moraux",
        "F. Motte",
        "T. Yoo",
        "A. Ginsburg"
      ],
      "abstract": "On the coupled origin of the stellar IMF and multiplicity B. Thomasson, I. Joncour, E. Moraux, F. Motte, T. Yoo, A. Ginsburg Astrophysics of Galaxies (astro-ph.GA) In the solar neighborhood, the Initial Mass Function (IMF) follows is canonically described by the Salpeter power-law slope for the high-mass range. The stellar IMF may directly result from a Core Mass Function (CMF) through accretion, gravitational collapse, and fragmentation. This inheritance implies that the mass of the gaseous fragments may be connected to the properties of clustered and multiple stellar systems. We aim to (i) quantify the influence of hierarchical fragmentation of cores on the resulting IMF, and (ii) determine the consequences of this fragmentation on the multiplicity of the stellar systems. We employed a scale-free, hierarchical fragmentation model to investigate the fragmentation of top-heavy CMF. Hierarchical fragmentation of gas clumps shifts the CMF towards lower mass range and can modify its shape. Starting from the top-heavy power-law CMF observed in W43-MM2&MM3 star forming region, we show that at least four levels of hierarchical fragmentation are required to generate the turn-over peak of the cIMF. Within a radius of 0.2-2.5 kAU, massive stars (M > 10 Msun) have on average 0.9 companions, five times fewer than low-mass stars (M < 0.1 Msun); the latter are less dynamically stable and should disperse. We show that a universal IMF can emerge from mass-dependent fragmentation processes provided that more massive cores produce less fragments compared to lower mass cores and transfer their mass less efficiently to their fragments. Hierarchical fragmentation alone cannot reconcile a universal IMF with observed stellar multiplicity. We propose that fragmentation is not scale-free but operates in two distinct regimes: a mass-dependent phase establishing the Salpeter slope and a mass-independent phase setting the turn-over. Our framework provides a way to compare core subfragmentation in various star-forming regions and numerical simulations.",
      "pdf_url": "https://arxiv.org/pdf/2602.03976.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03989",
      "title": "A gas-phase \"top-down\" chemical link between aldehydes and alcohols",
      "authors": [
        "Christopher N. Shingledecker",
        "Germán Molpeceres",
        "A. Mackenzie Flowers",
        "Deaton Warren",
        "Emma Stanley",
        "Anthony Remijan"
      ],
      "abstract": "A gas-phase \"top-down\" chemical link between aldehydes and alcohols Christopher N. Shingledecker, Germán Molpeceres, A. Mackenzie Flowers, Deaton Warren, Emma Stanley, Anthony Remijan Accepted for publication in \"Frontiers in Astronomy and Space Sciences\". 11 pages, 8 figures, 2 tables Astrophysics of Galaxies (astro-ph.GA) Alcohols and aldehydes represent two key classes of interstellar complex organic molecules (COMs). This work seeks to better understand their possible chemical connections, with a focus on such molecules in the sources of the star-forming region Sgr B2 (N). The gas-phase reaction between ethanol (CH3CH2OH) and the halogens fluorine and chlorine was investigated via DFT calculations, with the goal of determining whether astrochemically viable chemical pathways leading to acetaldehyde (CH3CHO) exist. The studied reactions were then included in an astrochemical model of Sgr B2 (N) to determine their significance under real interstellar conditions. Our DFT calculations revealed that both chlorine and fluorine can react barrierlessly with ethanol to abstract a hydrogen atom. We further found that, following this initial step, the resulting ethanol radicals can undergo further reactions with atomic hydrogen, with some routes leading to acetaldehyde. Incorporation of these novel reactions in astrochemical models of hot cores suggest that they are indeed efficient under those conditions, and can lead to modest increases in the abundance of CH3CHO during model times where gas-phase ethanol is abundant. Of the ethanol radicals included in our chemical network, we found CH3CHOH to have the highest abundances in our simulations comparable to that of ethanol at some model times. Overall, this work reveals a novel gas-phase ``top-down'' link from alcohols to aldehydes that compliments the better studied ``bottom-up'' routes involving grain-surface H-addition reactions yielding alcohols from aldehydes. Moreover, results from our astrochemical models suggest that the ethanol radical CH3CHOH may be detectable in the interstellar medium.",
      "pdf_url": "https://arxiv.org/pdf/2602.03989.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04176",
      "title": "Intermediate-Mass Black Hole Formation from Hierarchical Mergers in Galactic Nuclei",
      "authors": [
        "Amanda Newton",
        "Sanaea C Rose",
        "Fulya Kiroglu",
        "Bao-Minh Hoang",
        "Frederic Rasio"
      ],
      "abstract": "Intermediate-Mass Black Hole Formation from Hierarchical Mergers in Galactic Nuclei Amanda Newton, Sanaea C Rose, Fulya Kiroglu, Bao-Minh Hoang, Frederic Rasio Astrophysics of Galaxies (astro-ph.GA) Dense stellar environments like nuclear star clusters (NSCs) can dynamically assemble gravitational wave (GW) sources. We consider a population of single stellar mass black holes (BHs) in the inner $0.1$~pc of a NSC surrounding a $4 \\times 10^6$~M$_\\odot$ supermassive black hole (SMBH). Using a semianalytic model, we account for direct collisions between BHs and stars and GW capture between BHs. We explore the effect of the initial BH mass and spin distributions on their final properties and the production of GW sources. Specifically, we consider upper and lower limits for the BH initial mass distribution, and we account for the possibility that a subset of our initial population are the merger products of primordial BH binaries. We find that $\\sim 500$ M$_{\\odot}$ intermediate mass black holes (IMBHs) can form for our upper limit mass distribution, while our lower limit mass distribution forms none. Most IMBHs $\\gtrsim 200$~M$_\\odot$ eventually sink towards the center of the cluster and merge with the SMBH. We also find that BH-star collisions create a more uniform spin distribution. Our results have implications for LIGO-Virgo-KAGRA sources. We find that the overall merger rate depends primarily on the upper limits of the initial BH mass distribution, ranging from $\\sim10^{-10}$ to $\\sim10^{-9}$~yr$^{-1}$ per galaxy. However, primordial binaries increase the number of second and higher generation mergers by an order of magnitude.",
      "pdf_url": "https://arxiv.org/pdf/2602.04176.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.04177",
      "title": "Kinematic-Distance Biases in the Inner Milky Way from a Stellar-Dynamically Constrained Bar",
      "authors": [
        "Junichi Baba"
      ],
      "abstract": "Kinematic-Distance Biases in the Inner Milky Way from a Stellar-Dynamically Constrained Bar Junichi Baba (Kagoshima U./NAOJ) Accepted for publication in PASJ Astrophysics of Galaxies (astro-ph.GA) We quantify how bar-driven non-circular motions bias Milky-Way gas maps inferred with the kinematic-distance (KD) method. KD reconstructions of H\\,\\textsc{i} and CO surveys assume circular rotation in an axisymmetric potential, an assumption that is strongly violated in the barred inner Milky Way. We use high-resolution hydrodynamical simulations of gas flow in an observationally constrained barred Milky Way potential. From a quasi-steady snapshot we generate synthetic longitude--velocity data and apply a standard axisymmetric KD inversion using the circular-speed curve derived from the $m=0$ component of the same potential. To isolate non-circular effects, we remove the near--far ambiguity by selecting, for each gas element, the KD branch closest to its true distance. We find that the KD method reproduces the gas distribution reasonably well outside the bar-dominated region ($R \\gtrsim 5$~kpc), but fails systematically in the bar region ($R \\sim 0.5$--3~kpc). There the KD-reconstructed face-on map exhibits anisotropic, quadrant-dependent artifacts, including arc-like overdensities and LOS-elongated low-density cavities. In azimuthally averaged profiles, these anisotropic misassignments translate into net radial mixing: the axisymmetric KD inversion substantially fills in the true bar-induced depression (hereafter, the ``bar gap'') and yields a flatter inner profile. Distance-error maps show coherent structures with $|\\Delta d| \\sim 1$--2~kpc and relative errors of several tens of percent along the bar and inner ring, coincident with zones where the KD mapping is intrinsically ill-conditioned, quantified by a large geometric sensitivity $S \\equiv \\left|\\partial d/\\partial V_{\\rm LOS}^{\\rm circ}\\right|$. In these regions the error is well approximated to first order by $\\Delta d \\simeq S\\,\\Delta V_{\\rm LOS}$, linking KD failures directly to bar-driven streaming velocities. ...",
      "pdf_url": "https://arxiv.org/pdf/2602.04177.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04179",
      "title": "A high rate of foreground contaminants toward high-redshift galaxies resolved by JWST",
      "authors": [
        "Weiyang Liu",
        "Linhua Jiang"
      ],
      "abstract": "A high rate of foreground contaminants toward high-redshift galaxies resolved by JWST Weiyang Liu, Linhua Jiang 15 pages, 11 figures, 4 tables (+3 pages, 2 figures, 1 table in Appendix). Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We present a study of high-redshift Ly$\\alpha$ emitters (LAEs) with multiple components using HST and JWST. High-redshift galaxies are mostly point-like objects on ground-based images, but they often exhibit multiple components in higher spatial resolution images. JWST for the first time allow detailed analyses on these individual components. We collect 840 spectroscopically confirmed LAEs at $z=2\\sim7$ from the literature and nearly 50\\% of them appear to have multiple components in JWST images. We further construct a sample of 248 LAEs that have two or more relatively isolated components in a circular aperture of 2$\\arcsec$ in diameter. We estimate photometric redshifts for all 593 components of the 248 LAEs, and find that 68\\% of them are `real components' with photometric redshifts consistent with the spectroscopic redshifts of the LAEs. The remaining components are mostly foreground objects. The fraction of the `real components' decreases rapidly with the projected distance to the LAE centers from $\\sim80\\%$ at $0\\farcs2-0\\farcs4$ to $\\sim30\\%$ at $0\\farcs8-1\\farcs0$. Our SED modeling results suggest that the majority of the LAEs are young, low-mass, low extinction starburst galaxies (partly due to a selection effect), and their `real components' have stronger star-forming activities than main-sequence galaxies. We investigate the potential impact of the high foreground contamination rate on previous studies based on ground-based images that often use a 2$\\arcsec$ aperture for photometry, and find that some of key parameters such as stellar mass would have been largely affected.",
      "pdf_url": "https://arxiv.org/pdf/2602.04179.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04273",
      "title": "Variable Modified Newtonian Mechanics VIII: Ultra faint dwarfs in Milky Way",
      "authors": [
        "James Chi Chung Wong"
      ],
      "abstract": "Variable Modified Newtonian Mechanics VIII: Ultra faint dwarfs in Milky Way James Chi Chung Wong Astrophysics of Galaxies (astro-ph.GA) Velocity dispersions of Ultra faint dwarf (UFD) galaxies are observed to deviate significantly from the Baryon Tully Fisher Relation of the massive galaxies (BTFR). We propose a solution with Variable Modified Newtonian dynamics model, which could explain this deviation.",
      "pdf_url": "https://arxiv.org/pdf/2602.04273.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04333",
      "title": "BEACON: JWST NIRCam Pure-parallel Imaging Survey. IV. A Systematic Search for Galaxy Overdensities and Evidence for Gas Accretion Mode Transition",
      "authors": [
        "Ryo Albert Sutanto",
        "Takahiro Morishita",
        "Tadayuki Kodama",
        "Abdurro'uf",
        "Larry D. Bradley",
        "Andrew J. Bunker",
        "Nima Chartab",
        "Nuo Chen",
        "Matthew J. Hayes",
        "George Helou",
        "Novan Saputra Haryana",
        "Nicha Leethochawalit",
        "Zhaoran Liu",
        "Charlotte A. Mason",
        "Marc Rafelski",
        "Michael J. Rutkowski",
        "Massimo Stiavelli",
        "Kosuke Takahashi",
        "Harry I. Teplitz",
        "Michele Trenti",
        "Tommaso Treu",
        "Benedetta Vulcani",
        "Yechi Zhang"
      ],
      "abstract": "BEACON: JWST NIRCam Pure-parallel Imaging Survey. IV. A Systematic Search for Galaxy Overdensities and Evidence for Gas Accretion Mode Transition Ryo Albert Sutanto, Takahiro Morishita, Tadayuki Kodama, Abdurro'uf, Larry D. Bradley, Andrew J. Bunker, Nima Chartab, Nuo Chen, Matthew J. Hayes, George Helou, Novan Saputra Haryana, Nicha Leethochawalit, Zhaoran Liu, Charlotte A. Mason, Marc Rafelski, Michael J. Rutkowski, Massimo Stiavelli, Kosuke Takahashi, Harry I. Teplitz, Michele Trenti, Tommaso Treu, Benedetta Vulcani, Yechi Zhang Astrophysics of Galaxies (astro-ph.GA) We systematically search for galaxy overdensities using 20 independent fields with a minimum of six filters (F090W, F115W, F150W, F277W, F356W, and F444W) from BEACON, the JWST Cycle 2 NIRCam pure-parallel imaging survey. We apply an adaptive kernel-density estimation method that incorporates the full photometric redshift probability distribution function of each galaxy to map galaxy overdensities, and identify 207 significant ($>4\\,\\sigma$) overdensities at $1.5<z<5$. We measure the quenched-galaxy fraction, the median specific star formation rate (sSFR), the total halo mass, and the local galaxy density of each system. By investigating the correlation among these observables, we find that galaxy quenching proceeds in two paths:($i$) Overdensities within more massive halos exhibit higher quenched fractions and lower averaged sSFRs. This trend weakens at $z\\gtrsim2$, consistent with cold gas streams penetrating shock-heated massive halos and sustaining star formation activity at early times. ($ii$) We also find a dependence of the same parameters on local densities at $z<2$, where the quenched fraction increases and the sSFR decreases toward higher densities. The environmental trend in sSFR weakens at $z\\sim2$--$3$ and shows tentative evidence for a reversal at $z>3$, potentially due to a larger cold gas supply in earlier times. Our study reveals a complex interplay between individual galaxies and large-scale environmental properties, marking the onset of environmental effects on galaxy quenching in massive halos at cosmic noon.",
      "pdf_url": "https://arxiv.org/pdf/2602.04333.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04374",
      "title": "Atom Addition Formation of Thionylimide (HNSO) on Interstellar Dust Grains: Chemical routes requiring oxygen and nitrogen atom surface diffusion",
      "authors": [
        "Juan Carlos del Valle",
        "Miguel Sanz-Novo",
        "Johannes Kästner",
        "Kenji Furuya",
        "Víctor M. Rivilla",
        "Rafael Martín-Domńech",
        "Germán Molpeceres"
      ],
      "abstract": "Atom Addition Formation of Thionylimide (HNSO) on Interstellar Dust Grains: Chemical routes requiring oxygen and nitrogen atom surface diffusion Juan Carlos del Valle, Miguel Sanz-Novo, Johannes Kästner, Kenji Furuya, Víctor M. Rivilla, Rafael Martín-Domńech, Germán Molpeceres Astrophysics of Galaxies (astro-ph.GA); Chemical Physics (physics.chem-ph) We investigate the formation of the recently detected HNSO molecule using quantum chemical calculations on ices and astrochemical models in tandem. Our results indicate that HNSO is efficiently produced on grain surfaces through reactions involving atomic oxygen and nitrogen atoms with the radicals NS and SO, forming NSO as a key intermediate. Subsequent hydrogenation of NSO leads to HNSO, with a clear preference for the lowest energy cis conformer, while the trans form is metastable and may be short-lived under typical interstellar conditions. The models predict that solid HNSO can reach abundances comparable to icy OCS, placing it among the major sulfur-bearing species in interstellar ices. Gas-phase abundances, in contrast, remain lower than those of OCS. The implementation of a multibinding scheme in our models clarifies the role of diffusive chemistry in the production of HNSO at early times, improving agreement with observations. These findings suggest that reactions involving diffusing O and N atoms on icy grains contribute significantly to sulfur chemistry and beyond in dense clouds and motivate further searches for molecules containing simultaneously H, N, O and S in other astronomical environments.",
      "pdf_url": "https://arxiv.org/pdf/2602.04374.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04710",
      "title": "Nonlinear Saturation of the Acoustic Resonant Drag Instability",
      "authors": [
        "Ben Y. Israeli",
        "Jonathan Squire",
        "Eric Moseley",
        "Amitava Bhattacharjee"
      ],
      "abstract": "Nonlinear Saturation of the Acoustic Resonant Drag Instability Ben Y. Israeli, Jonathan Squire, Eric Moseley, Amitava Bhattacharjee Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); Fluid Dynamics (physics.flu-dyn); Plasma Physics (physics.plasm-ph) Resonant drag instabilities (RDIs) are a novel type of dust/fluid instability relevant to a diverse range of astrophysical environments. They are driven by a resonant interaction between streaming dust and waves in a background medium, which results in dust density fluctuations and amplification of the waves. This broad class of instabilities includes recently-proposed modes incorporating acoustic and magnetohydrodynamic waves, as well as the well-studied disk streaming instability. As the study of RDIs is at an early stage, their evolution beyond the linear regime is not well understood. In order to make inroads into the nonlinear theory of RDIs, we performed simulations of the simplest case, the acoustic RDI, in which sound waves in a gas are amplified by interaction with supersonically streaming dust. This particular instability is of interest both due its potential relevance in various poorly ionized environments, and due to its resemblance to the fast magnetosonic RDI. We find that the nonlinear growth and saturation of the instability are characterized by a balance between time scales of instability growth and turbulent eddy turnover. The simulations demonstrate a saturated state possessing an anisotropic outer forcing range in which this balance is maintained, and suggest the presence of an isotropic turbulent inertial range below this scale. By presenting a model for the nonlinear growth and saturated state of the acoustic RDI, this work provides a framework for further study of the nonlinear behavior of this and other RDIs.",
      "pdf_url": "https://arxiv.org/pdf/2602.04710.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04765",
      "title": "Evolution of dust attenuation in star-forming galaxies with UV slope, stellar mass, and redshift out to $z \\sim 5$",
      "authors": [
        "J.V.Wijesekera",
        "M.P.Koprowski",
        "J.S.Dunlop",
        "K. Lisiecki",
        "D.J.McLeod",
        "R.J.McLure",
        "M.J.Michałowski",
        "M.Solar"
      ],
      "abstract": "Evolution of dust attenuation in star-forming galaxies with UV slope, stellar mass, and redshift out to $z \\sim 5$ J.V.Wijesekera, M.P.Koprowski, J.S.Dunlop, K. Lisiecki, D.J.McLeod, R.J.McLure, M.J.Michałowski, M.Solar 13 pages, 8 figures and 5 tables, submitted to A&A Astrophysics of Galaxies (astro-ph.GA) Aims. We derive a dependence of the IRX on UV slope $\\beta$, stellar mass $M_\\ast$, and redshift out to $z \\simeq 5$, and establish consistent functional relations that can be used for correcting the UV/optical-selected galaxy samples for the effects of dust absorption. Methods. This work is based on a $K$-band selected sample of $\\sim 10^5$ star-forming galaxies detected in the UDS and COSMOS fields. Quiescent sources and known starbursts are removed, and the IR luminosities are established through stacking in FIR {\\it Herschel} and JCMT maps. UV slopes are found from SED fits and stacked IRX values are derived by taking the median of individual IRX measurements in bins of $\\beta$, $M_\\ast$ and redshift. Results. While our best-fit IRX-$\\beta$ relation is consistent with a Calzetti-like attenuation curve at $\\beta\\gtrsim -1$, at bluer values the IRX seems to increase with redshift due to different mass-completeness limits imposed. When deriving the IRX-$\\beta$ relation in stellar-mass bins, a systematic trend is found, where the effective slope of the attenuation law becomes progressively shallower with increasing mass. We incorporate this into the IRX-$\\beta$ relation through the slope of the underlying reddening law, $dA_{1600}/d\\beta$, being a quadratic function of $\\log(M_\\ast/{\\rm M_\\odot})$. Expressing IRX as a function of the stellar mass we find a tight correlation, with IRX rising monotonically with mass but exhibiting a clear high-mass turnover at $z\\lesssim 2-3$, consistent with suppressed cold-gas accretion and dust growth in massive systems.",
      "pdf_url": "https://arxiv.org/pdf/2602.04765.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04645",
      "title": "The incidence of LBV variability in the LMC",
      "authors": [
        "V. M. Kalari",
        "J. S. Vink",
        "C. Furey",
        "R. Salinas",
        "A. Udalski",
        "M. Pawlak"
      ],
      "abstract": "The incidence of LBV variability in the LMC V. M. Kalari, J. S. Vink, C. Furey, R. Salinas, A. Udalski, M. Pawlak Accepted for publication in A&A; 11 pages, 8 figures. Comments/suggestions welcome Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Luminous blue variables (LBVs) exhibit unique variability features, characterized by episodic outbursts ($>$1 mag) accompanied by spectroscopic changes (S Dor variables). It is debated if all massive stars undergo an LBV-like phase during their evolution, or instead LBVs are exotic phenomena. We aim to quantify the incidence of LBV-like variability in the blue supergiant (BSgs) population of the Large Magellanic Cloud (LMC) using the OGLE survey. Here, we extend previous work in the Small Magellanic Cloud to the LMC, where we examine the light curves of 87 B Supergiants (BSgs) (out of 254 known BSgs) spanning timescales of twenty years, and 37 objects across a three year timescale for aperiodic variations resembling known S Dor variables. One blue supergiant, [ST92] 4-13 shows S Dor type photometric variations. New spectra of this object reveals a potential change in spectral type compared to the literature classification. However, based on its spectral characteristics and low luminosity and mass, we do not currently classify it as an LBV. Our study highlights the need to classify bona fide LBVs as stars undergoing both photometric and spectroscopic variations. Based on currently known stellar population of S Dor variables in the LMC, the lifetime of the S Dor phase is at most $\\sim$10$^3$ yrs, in agreement with our duty cycle study based on OGLE data in the SMC. This is orders of magnitude shorter than assumed in literature. Our discovery of LBV-like variability at low luminosities may suggest that S Dor variations could arise from Eddington limit related physics over a wide range of stellar masses, rather than being linked to a unique evolutionary stage.",
      "pdf_url": "https://arxiv.org/pdf/2602.04645.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04661",
      "title": "Wide binaries without viable bound Newtonian orbits",
      "authors": [
        "L. Pasquini",
        "R. Saglia",
        "F. Patat",
        "L. Berni",
        "D. Bossini",
        "L. Magrini",
        "H. Ludwig",
        "M. T. Murphy",
        "J.R. de Medeiros",
        "J. Chanamé"
      ],
      "abstract": "Wide binaries without viable bound Newtonian orbits L. Pasquini, R. Saglia, F. Patat, L. Berni, D. Bossini, L. Magrini, H. Ludwig, M. T. Murphy, J.R. de Medeiros, J. Chanamé Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) Context. Wide binaries offer a unique opportunity to test gravity in the low acceleration regime, where deviations from Newtonian dynamics may appear. Aims. We use high-resolution VLT-ESPRESSO archival spectra to study 26 wide binaries with projected separations larger than 13,000 AU. By combining precise radial velocities with Gaia proper motions and parallaxes, we aim to test whether these systems are consistent with Newtonian gravity in the low acceleration regime. Methods. We use multiple radial velocity measurements and stellar parameters to remove systems affected by unresolved triples, chance alignments, or young systems. For the remaining binaries, we combine radial velocities (corrected for convective shift and gravitational redshift) with Gaia proper motions, parallaxes, and positions to attempt bound Newtonian orbital solutions Results. Fourteen of the 26 initial systems were discarded: 12 due to radial velocity variability indicating unresolved close binaries, one hosting a faint Gaia companion, and one too young. Of the remaining 12, nine can be fitted with bound orbital solution, while three show velocity differences too large to be reconciled with any bound Newtonian orbit. Conclusions. For the three systems that cannot be fitted with a bound orbit, repeated radial velocity observations allow us to confidently exclude, with one possible exception, unresolved triple stellar companions or massive close-in planets as causes. Given their likely large 3-dimensional separations, these binaries may have been dynamically perturbed or disrupted by stellar encounters or Galactic tides, and may no longer be gravitationally bound. This highlights how utmost caution must be applied when studying wide binaries as isolated systems.",
      "pdf_url": "https://arxiv.org/pdf/2602.04661.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04688",
      "title": "EPISODE III: The Nested Jet/Outflow Morphology of EC 53 Revealed by JWST and ALMA",
      "authors": [
        "Seonjae Lee",
        "Jeong-Eun Lee",
        "Chul-Hwan Kim",
        "Seokho Lee",
        "Doug Johnstone",
        "Gregory J. Herczeg",
        "Joel Green",
        "Logan Francis",
        "Yao-Lun Yang",
        "Hyundong Lee",
        "Nagayoshi Ohashi"
      ],
      "abstract": "EPISODE III: The Nested Jet/Outflow Morphology of EC 53 Revealed by JWST and ALMA Seonjae Lee, Jeong-Eun Lee, Chul-Hwan Kim, Seokho Lee, Doug Johnstone, Gregory J. Herczeg, Joel Green, Logan Francis, Yao-Lun Yang, Hyundong Lee, Nagayoshi Ohashi Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We present an extensive study of the structure and kinematics of the jet and outflow of EC 53, a Class I protostar with a quasi-periodic variability, using combined James Webb Space Telescope (JWST) and Atacama Large Millimeter/submillimeter Array (ALMA) observations. ALMA continuum observations resolve a compact disk with a radius of $\\sim$0.14\\arcsec\\ (60\\,au). Scattered light from the outflow cavity is prominent in the short-wavelength NIRCam and NIRSpec observations, revealing only the southeast nearside lobe. We detected 27 H$_2$ emission lines tracing a narrow, cone-shaped structure within the outflow cavity. A high-velocity ionized jet is detected in several forbidden atomic lines, characterized by a position angle of 142\\degree, an opening angle of 1.4\\degree, and an estimated geometric launching radius of at most $\\sim$40\\,au. Mid-infrared CO ro-vibrational emission lines, stronger in the P-branch, show a similar distribution to the H$_2$ emission and are likely to originate from hot gas within the outflow cavity. CO and C$_2$H emission lines detected by ALMA trace slower, colder outflow components and cavity walls. The spatial and kinematic stratification between the hot atomic and molecular components and the colder molecular gas is consistent with predictions from MHD disk wind models, although envelope material entrained by a wide-angle wind or jet may also contribute. Our analysis highlights the powerful synergy between JWST and ALMA in advancing the understanding of protostellar jets and outflows across multiple spatial and physical scales.",
      "pdf_url": "https://arxiv.org/pdf/2602.04688.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04806",
      "title": "A Two-Dimensional Analytic Solution for the Generation of Hyperbolic Trajectories Via A Single Close Encounter with Applications To Interstellar Objects",
      "authors": [
        "Hayden Monk",
        "Darryl Z. Seligman"
      ],
      "abstract": "A Two-Dimensional Analytic Solution for the Generation of Hyperbolic Trajectories Via A Single Close Encounter with Applications To Interstellar Objects Hayden Monk, Darryl Z. Seligman 11 pages, 10 figures. Resubmitted to MNRAS based on Reviewer Comments. 2 accompanying animations available at this https URL Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The discovery of interstellar interlopers such as 1I/`Oumuamua, 2I/Borisov, and 3I/ATLAS have highlighted the necessity of understanding the dynamical pathways that eject small bodies from planetary systems into hyperbolic trajectories. In this paper we examine the orbital elements of particles in the restricted three-body problem prior to and post scattering onto hyperbolic trajectories by massive perturbers. Building on previous work, we calculate closed-form -- but approximate -- analytic criteria that map pre- to post-encounter orbital elements. An application of these equations demonstrates that ejection occurs most efficiently when the orbital eccentricity of the massless test particle exceeds a minimum threshold, $e\\gtrsim0.4$. The primary driver of the final eccentricity is the component of the perturber-centric velocity projected along the direction of motion of the perturber. These analytic criteria are then benchmarked and validated against numerical simulations which demonstrate that they provide a reasonably good zeroth-order approximation for ejection behavior. However, system-specific cases will generally require numerical simulations in addition to this analytic construction. The methodology is applied to (i) the solar system and exoplanetary systems (ii) $\\beta$ Pictoris and (iii) HR 8799 to evaluate the pre-scattering orbits of ejected particles. This method provides a transparent and computationally efficient tool for identifying orbits within a given system from which interstellar objects are efficiently ejected via a single scattering event from a massive perturber.",
      "pdf_url": "https://arxiv.org/pdf/2602.04806.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.09744",
      "title": "Unveiling the drivers of the Baryon Cycles with Interpretable Multi-step Machine Learning and Simulations",
      "authors": [
        "Mst Shamima Khanom",
        "Benjamin W. Keller",
        "Javier Ignacio Saavedra Moreno"
      ],
      "abstract": "Unveiling the drivers of the Baryon Cycles with Interpretable Multi-step Machine Learning and Simulations Mst Shamima Khanom, Benjamin W. Keller, Javier Ignacio Saavedra Moreno 22 pages,17 figures, Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) We present a new approach for understanding how galaxies lose or retain baryons by utilizing a pipeline of two machine learning methods applied the IllustrisTNG100 simulation. We employed a Random Forest Regressor and Explainable Boosting Machine (EBM) model to connect the retained baryon fraction of approximately 10^5 simulated galaxies to their properties. We employed Random Forest models to filter and used the five most significant properties to train an EBM. Interaction functions identified by the EBM highlight the relationship between baryon fraction and three different galactic mass measurements, the location of the rotation curve peak, and the velocity dispersion. This interpretable machine learning-based approach provides a promising pathway for understanding the baryon cycle in galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2504.09744.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.04138",
      "title": "COSMOS-Web: Estimating Physical Parameters of Galaxies Using Self-Organizing Maps",
      "authors": [
        "Fatemeh Abedini",
        "Ghassem Gozaliasl",
        "Akram Hasani Zonoozi",
        "Atousa Kalantari",
        "Maarit Korpi-Lagg",
        "Olivier Ilbert",
        "Hollis Akins",
        "Natalie Allen",
        "Rafael Arango-Toro",
        "Caitlin Casey",
        "Nicole Drakos",
        "Andreas Faisst",
        "Carter Flayhart",
        "Maximilien Franco",
        "Hosein Haghi",
        "Aryana Haghjoo",
        "Santosh Harish",
        "Hossein Hatamnia",
        "Jeyhan Kartaltepe",
        "Ali Khostovan",
        "Anton Koekemoer",
        "Vasily Kokorev",
        "Rebecca Larson",
        "Gavin Leroy",
        "Daizhong Liu",
        "Henry McCracken",
        "Jed McKinney",
        "Nicolas McMahon",
        "Wilfried Mercier",
        "Bahram Mobasher",
        "Sophie Newman",
        "Louise Paquereau",
        "Jason Rhodes",
        "Brant Robertson",
        "Sogol Sanjaripour",
        "Marko Shuntov",
        "Sina Taamoli",
        "Sune Toft",
        "Francesco Valentino",
        "Eleni Vardoulaki",
        "John Weaver"
      ],
      "abstract": "COSMOS-Web: Estimating Physical Parameters of Galaxies Using Self-Organizing Maps Fatemeh Abedini, Ghassem Gozaliasl, Akram Hasani Zonoozi, Atousa Kalantari, Maarit Korpi-Lagg, Olivier Ilbert, Hollis Akins, Natalie Allen, Rafael Arango-Toro, Caitlin Casey, Nicole Drakos, Andreas Faisst, Carter Flayhart, Maximilien Franco, Hosein Haghi, Aryana Haghjoo, Santosh Harish, Hossein Hatamnia, Jeyhan Kartaltepe, Ali Khostovan, Anton Koekemoer, Vasily Kokorev, Rebecca Larson, Gavin Leroy, Daizhong Liu, Henry McCracken, Jed McKinney, Nicolas McMahon, Wilfried Mercier, Bahram Mobasher, Sophie Newman, Louise Paquereau, Jason Rhodes, Brant Robertson, Sogol Sanjaripour, Marko Shuntov, Sina Taamoli, Sune Toft, Francesco Valentino, Eleni Vardoulaki, John Weaver Astrophysics of Galaxies (astro-ph.GA) The COSMOS-Web survey, with its unparalleled combination of multiband data, notably, near-infrared imaging from JWST's NIRCam (F115W, F150W, F277W, and F444W), provides a transformative dataset down to $\\sim28$ mag (F444W) for studying galaxy evolution. In this work, we employ Self-Organizing Maps (SOMs), an unsupervised machine learning method, to estimate key physical parameters of galaxies -- redshift, stellar mass, star formation rate (SFR), specific SFR (sSFR), and age -- directly from photometric data out to $z=3.5$. SOMs efficiently project high-dimensional galaxy color information onto 2D maps, showing how physical properties vary among galaxies with similar spectral energy distributions. We first validate our approach using mock galaxy catalogs from the HORIZON-AGN simulation, where the SOM accurately recovers the true parameters, demonstrating its robustness. Applying the method to COSMOS-Web observations, we find that the SOM delivers robust estimates despite the increased complexity of real galaxy populations. Performance metrics ($\\sigma_{\\mathrm{NMAD}}$ typically between $0.1$--$0.3$, and Pearson correlation between $0.7$ and $0.9$) confirm the precision of the method, with $\\sim$ $70\\%$ of predictions within 1$\\sigma$ dex of reference values. Although redshift estimation in COSMOS-Web remains challenging (median $\\sigma_{\\mathrm{NMAD}} = 0.04$), the overall success of the highlights its potential as a powerful and interpretable tool for galaxy parameter estimation. A key advance of this work is the use of JWST/NIRCam photometry, particularly the F444W band, which enhances SOM training and allows more accurate estimation of stellar mass, SFR, and age compared to previous studies using IRAC/Spitzer filters.",
      "pdf_url": "https://arxiv.org/pdf/2506.04138.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.08077",
      "title": "MIRACLE II: Unveiling the multi-phase gas interplay in the circumnuclear region of NGC 1365 via multi-cloud modeling",
      "authors": [
        "M. Ceci",
        "C. Marconcini",
        "A. Marconi",
        "A. Feltre",
        "I. Lamperti",
        "F. Belfiore",
        "E. Bertola",
        "C. Bracci",
        "S. Carniani",
        "E. Cataldi",
        "G. Cresci",
        "Q. D'Amato",
        "J. Fritz",
        "M. Ginolfi",
        "E. Hatziminaoglou",
        "M. Hirschmann",
        "M. Mingozzi",
        "B. Moreschini",
        "F. Mannucci",
        "G. Sabatini",
        "F. Salvestrini",
        "M. Scialpi",
        "G. Tozzi",
        "L. Ulivi",
        "G. Venturi",
        "A. Vidal-García",
        "C. Vignali",
        "M.V. Zanchettin"
      ],
      "abstract": "MIRACLE II: Unveiling the multi-phase gas interplay in the circumnuclear region of NGC 1365 via multi-cloud modeling M. Ceci, C. Marconcini, A. Marconi, A. Feltre, I. Lamperti, F. Belfiore, E. Bertola, C. Bracci, S. Carniani, E. Cataldi, G. Cresci, Q. D'Amato, J. Fritz, M. Ginolfi, E. Hatziminaoglou, M. Hirschmann, M. Mingozzi, B. Moreschini, F. Mannucci, G. Sabatini, F. Salvestrini, M. Scialpi, G. Tozzi, L. Ulivi, G. Venturi, A. Vidal-García, C. Vignali, M.V. Zanchettin Accepted by A&A; 22 pages (plus 4 pages of supplementary material), 8 figures (plus 9 in the appendix and supplementary material); Abstract adapted from original Astrophysics of Galaxies (astro-ph.GA) We present a multi-phase study of the gas in the circumnuclear region (~1.1x1.0 kpc^2) of the nearby Seyfert 1.8 galaxy NGC 1365, observed in the context of the Mid-IR Activity of Circumnuclear Line Emission (MIRACLE) program. We combined spatially resolved spectroscopic observations from JWST/MIRI, VLT/MUSE, and ALMA to investigate the ionized atomic gas and the warm and cold molecular phases. MIRI data revealed over 40 mid-IR emission lines from ionized and warm molecular gas. Moment maps show that both cold and warm molecular gas follow the rotation of the stellar disk along the circumnuclear ring. The ionized gas displays flux and kinematic patterns that depend on ionization potential (IP): low-IP species (<25 eV) trace the disk, while higher-IP lines (up to ~120 eV) trace outflowing material. The [O III]5700 and [Ne V]14 lines both trace the southeast nuclear outflow cone. Additionally, [Ne V]14 detects the northwest counter-cone, obscured in the optical and thus invisible in [O III]5700. Mid-IR diagnostics, unlike optical ones, clearly reveal the AGN as the primary ionization source in the nucleus. Emission from high-IP species is spatially coincident with the ionization cones and not with star-forming regions. Using the [Ne V]24/[Ne V]14 ratio, we derive an electron density of (750+-440) cm^(-3), in agreement with values from the [S II] optical doublet. For the first time, we apply a fully self-consistent approach combining advanced photoionization and kinematic models (HOMERUN+MOKA3D) to constrain intrinsic outflow properties, overcoming the limitations of simplified classical methods. Exploiting the synergy of JWST/MIRI and VLT/MUSE, HOMERUN reproduces fluxes of over 60 emission lines from optical to mid-IR, disentangling AGN and star formation contributions and yielding robust estimates of outflow mass, geometry, and energetics.",
      "pdf_url": "https://arxiv.org/pdf/2507.08077.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16094",
      "title": "The GUAPOS project. VI: the chemical inventory of shocked gas",
      "authors": [
        "Á. López-Gallifa",
        "V. M. Rivilla",
        "M. T. Beltrán",
        "L. Colzi",
        "F. Fontani",
        "Á. Sánchez-Monge",
        "C. Mininni",
        "R. Cesaroni",
        "I. Jiménez-Serra",
        "S. Viti",
        "A. Lorenzani"
      ],
      "abstract": "The GUAPOS project. VI: the chemical inventory of shocked gas Á. López-Gallifa, V. M. Rivilla, M. T. Beltrán, L. Colzi, F. Fontani, Á. Sánchez-Monge, C. Mininni, R. Cesaroni, I. Jiménez-Serra, S. Viti, A. Lorenzani Accepted for publication in Astronomy and Astrophysics (A&A) Astrophysics of Galaxies (astro-ph.GA) The study of the chemical composition of star-forming regions is key to understanding the chemical ingredients available during the formation of planetary systems. Because the chemical inventory of interstellar dust grains in prestellar phases might be altered by protostellar warming, an alternative to inferring the chemical composition of the grains might be to observe regions that are affected by shocks associated with molecular outflows. These shocks can desorb the molecules and might produce less chemical processing because the timescales are shorter. We present a detailed study of the chemical reservoir of a shocked region located in the G31.41+0.31 protocluster using data from the G31.41+0.31 Unbiased ALMA sPectral Observational Survey (GUAPOS). We report the detection of 30 molecular species (plus 18 isotopologs). We compared the molecular ratios in the shocked region with those derived toward the hot core of G31.41+0.31. They are poorly correlated, with the exception of N-bearing species. Our results confirm observationally that a different level of chemical alteration is present in hot cores and in shocks. While the former likely alter the molecular ratios by thermal processing during longer timescales, the latter might represent freshly desorbed material that constitutes a better proxy of the composition of the ice mantle. The similarity of the molecular ratios of the N-bearing species in the G31.41+0.31 shock and the hot core suggests that these species are predominantly formed at early evolutionary stages. Interestingly, the abundances in the G31.41+0.31 shock are better correlated with other shock-dominated regions (two protostellar outflows and a molecular cloud in the Galactic center). This suggests that gas-phase chemistry after shock-induced ejection from grains is negligible and that the composition of the ice mantle is similar regardless of the Galactic environment.",
      "pdf_url": "https://arxiv.org/pdf/2509.16094.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.14613",
      "title": "The multimessenger view of Pulsar Timing Array black holes with the Horizon-AGN simulation",
      "authors": [
        "Hippolyte Quelquejay Leclere",
        "Kunyang Li",
        "Marta Volonteri",
        "Stanislav Babak",
        "Ricarda S. Beckmann",
        "Yohan Dubois",
        "Clotilde Laigle",
        "Natalie A. Webb"
      ],
      "abstract": "The multimessenger view of Pulsar Timing Array black holes with the Horizon-AGN simulation Hippolyte Quelquejay Leclere, Kunyang Li, Marta Volonteri, Stanislav Babak, Ricarda S. Beckmann, Yohan Dubois, Clotilde Laigle, Natalie A. Webb 25 pages, 16 figures, Data availability section added Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We use the Horizon-AGN cosmological simulation to study the properties of supermassive black hole binaries (MBHBs) contributing most to the gravitational wave background (GWB) signal expected in the pulsar timing array (PTA) band. We develop a pipeline to generate realistic populations of MBHBs, allowing us to estimate both the characteristic strain and GWB time series observable by PTA experiments. We identify potential continuous wave (CW) candidates standing above the background noise, using toy PTA sensitivities representing the current EPTA and future SKA. We estimate the probability of detecting at least one CW with signal-to-noise ratio $>3$ to be $4\\%$ ($20\\%$) for EPTA (SKA)-like sensitivities, assuming a 10-year baseline. We find the GWB to be dominated by hundreds to thousands of binaries at redshifts in the range $0.05-1$, with chirp masses of $10^{8.5}-10^{9.5}\\, M_\\odot$, hosted mainly in quiescent massive galaxies residing in halos of mass $\\sim 10^{13}\\, M_\\odot$. CW candidates have larger masses, lower redshifts and are found in even more massive halos, typical of galaxy groups and clusters. The majority of these systems would appear as AGN rather than quasars, because of their low Eddington ratios. Nevertheless, CW candidates with $f_{\\rm Edd}>10^{-3}$ can still outshine their hosts, particularly in radio and X-ray bands, suggesting them as the most promising route for identification. Our findings imply that optical and near-infrared searches based on light curve variability are challenging and biased toward more luminous systems. Finally, we highlight important caveats in the common method used to compare PTA observations with theoretical models. We find that GWB spectral inferences used by PTAs could be biased toward shallower slopes and higher amplitudes at $f=1/\\rm yr$, thereby reducing the apparent tension between astrophysical expectations and PTA observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.14613.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.01733",
      "title": "A Possible \"Too-Many-Satellites\" Problem in the Isolated Dwarf Galaxy DDO 161",
      "authors": [
        "Jiaxuan Li",
        "Jenny E. Greene",
        "Shany Danieli",
        "Scott Carlsten",
        "Marla Geha"
      ],
      "abstract": "A Possible \"Too-Many-Satellites\" Problem in the Isolated Dwarf Galaxy DDO 161 Jiaxuan Li, Jenny E. Greene, Shany Danieli, Scott Carlsten, Marla Geha Astrophysics of Galaxies (astro-ph.GA) The abundance of satellite galaxies provides a direct test of $\\Lambda$CDM and galaxy formation physics on small scales. While satellites of Milky Way-mass galaxies are well studied, those of dwarf galaxies remain largely unexplored. We present a systematic search for satellites around the isolated dwarf galaxy DDO~161 ($M_\\star \\approx 10^{8.4}\\, M_\\odot$) at a distance of 6 Mpc. We identify eight satellite candidates within the projected virial radius and confirm three new satellites through surface brightness fluctuation distance measurements from deep Magellan imaging data. Together with its confirmed satellite UGCA~319, DDO~161 has four confirmed satellites above $M_{\\star}^{\\rm sat} > 10^{5.4}\\, M_\\odot$, making it the most satellite-rich dwarf galaxy known to date. We compare this system with predictions from the TNG50 cosmological simulation, combined with currently established galaxy-halo connection models calibrated on Milky Way satellites, and find that DDO~161 has a satellite abundance far exceeding all current expectations. The rich satellite system of DDO~161 offers new insight into how low-mass galaxies occupy dark matter halos in low-density environments and may provide new constraints on the nature of dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2511.01733.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.15865",
      "title": "Mean Mass Density near the Sun from the Divergence Theorem and Pulsar Accelerations",
      "authors": [
        "Thomas Donlon II",
        "Lawrence M. Widrow",
        "Sukanya Chakrabarti"
      ],
      "abstract": "Mean Mass Density near the Sun from the Divergence Theorem and Pulsar Accelerations Thomas Donlon II, Lawrence M. Widrow, Sukanya Chakrabarti Astrophysics of Galaxies (astro-ph.GA) We introduce a new, non-parametric method for estimating the mass enclosed within a sphere of arbitrary radius centered on the Sun. The method is based on the divergence theorem as applied to measurements of the line-of-sight accelerations of millisecond pulsars. We describe a procedure for inferring the mean mass density within a sphere of a given radius centered on the Sun and find results that are consistent with previous analyses. When combined with a model for the distribution of baryons, this provides the mean mass density of dark matter as a function of distance from the Sun, rather than a single value as is typically reported by kinematic studies. However, with the present pulsar data, the method cannot unambiguously measure a signal from the local distribution of dark matter at this time; such a measurement is expected to soon become possible as the amount of pulsar acceleration data grows and its precision improves. We derive an extension of the well-known shell theorem to a spherical-harmonics expansion of the density and potential, and use the result to obtain estimates for density asymmetries with respect to the Galactic midplane from the observed acceleration data. The predicted asymmetries do not follow the observed distribution of MW disk stars or gas; this can potentially be explained by a non-uniform distribution of dark matter in the Solar neighborhood.",
      "pdf_url": "https://arxiv.org/pdf/2511.15865.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.15983",
      "title": "MAGellanic Outflow and chemistry Survey (MAGOS): Hot cores in the LMC",
      "authors": [
        "Takashi Shimonishi",
        "Kei E. I. Tanaka",
        "Yichen Zhang",
        "Kenji Furuya",
        "Yu Cheng",
        "Asako Sato"
      ],
      "abstract": "MAGellanic Outflow and chemistry Survey (MAGOS): Hot cores in the LMC Takashi Shimonishi, Kei E. I. Tanaka, Yichen Zhang, Kenji Furuya, Yu Cheng, Asako Sato Published in ApJS, 38 pages, 28 figures, 4 tables Astrophysics of Galaxies (astro-ph.GA) The Large Magellanic Cloud (LMC) provides a key laboratory for exploring the diversity of star formation and interstellar chemistry under subsolar metallicity conditions. We present the results of a hot core survey toward 30 massive protostellar objects in the LMC using the Atacama Large Millimeter/submillimeter Array (ALMA) at 350 GHz. Continuum imaging reveals 36 compact sources in total, among which line analyses identify 9 hot cores and 1 hot-core candidate, including two newly identified sources. We detect CO, HCO+, H13CO+, HC15N, HC3N, SiO, SO, SO+, NS, SO2, 34SO2, 33SO2, CH3OH, 13CH3OH, HCOOH, HCOOCH3, CH3OCH3, C2H5OH, H2CCO (tentative), and hydrogen recombination lines from hot cores. CH3OCH3, a complex organic molecule larger than CH3OH, is detected for the first time in a hot core outside the LMC bar region. All hot cores show stronger emission in the high-excitation SO line compared to non-hot-core sources, suggesting that its strong detection will be useful for identifying hot-core candidates in the LMC. Chemical analysis reveals a spread of more than two orders of magnitude in CH3OH abundances, with some sources deficient in COMs. In contrast, SO2 is detected in all hot cores, and its abundance shows a good correlation with rotational temperature. The hot cores without CH3OH detections are all located outside the LMC bar region and are characterized by either high luminosity or active star formation in their surroundings. A combination of locally low metallicity, active star formation in the vicinity, and high protostellar luminosity may jointly trigger the COM-poor hot core chemistry observed in the LMC.",
      "pdf_url": "https://arxiv.org/pdf/2512.15983.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03014",
      "title": "Subaru/HSC NB395 view of NGC 5466: metallicity, mass function, and the nature of its tidal stream",
      "authors": [
        "Itsuki Ogami",
        "Miho N. Ishigaki",
        "Pete B. Kuzma",
        "Takanobu Kirihara",
        "Nozomu Tominaga",
        "Masashi Chiba",
        "Yutaka Komiyama",
        "Mohammad Mardini",
        "Hiroko Okada"
      ],
      "abstract": "Subaru/HSC NB395 view of NGC 5466: metallicity, mass function, and the nature of its tidal stream Itsuki Ogami, Miho N. Ishigaki, Pete B. Kuzma, Takanobu Kirihara, Nozomu Tominaga, Masashi Chiba, Yutaka Komiyama, Mohammad Mardini, Hiroko Okada 30 pages (main text 21 pages), 32 figures, Submitted to PASJ. Comments welcome! Astrophysics of Galaxies (astro-ph.GA) We present a deep photometric study of the globular cluster NGC 5466 and its tidal stream using Subaru/Hyper Suprime-Cam (HSC) imaging with the metallicity-sensitive narrowband filter NB395. We develop an improved member-selection technique based on a k-nearest neighbor algorithm applied to the color-color-magnitude diagram (CCMD), enabling reliable candidate identification down to $i_{2,0} < 23.5$. Photometric metallicities derived from NB395 colors agree with previous measurements, supporting the robustness of our calibration. While modest residual contamination and possible offsets - potentially driven by variations in light-element abundances - may remain beyond 10 arcmin, the metallicity distribution of high-probability inner members matches the known mean metallicity of NGC 5466, demonstrating the effectiveness of our method. The spatial distribution of NB395-selected stars clearly delineates the tidal stream. Beyond the tidal radius, the azimuthally averaged radial surface density profile follows a power law with slope $\\alpha = -4.53_{-0.14}^{+0.13}$. We also detect a power-law component perpendicular to the stream, suggestive of multiple apogalactic passages. A density gap is identified at a projected distance of $\\sim200$ pc from the cluster center, consistent with eTidal N-body predictions and possibly associated with a recent pericentric passage or Galactic disk interaction. Analysis of the main-sequence mass function reveals a strong negative radial gradient in the slope within the tidal radius, whereas the slope along the outer stream is relatively flat, consistent with preferential tidal stripping of low-mass stars. These results highlight the power of HSC/NB395 photometry for identifying metal-poor populations and deriving photometric metallicities, underscoring its value for future wide-field surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.03014.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.13409",
      "title": "NSF-DOE Vera C. Rubin Observatory Observations of Interstellar Comet 3I/ATLAS (C/2025 N1)",
      "authors": [
        "Colin Orion Chandler",
        "Pedro H. Bernardinelli",
        "Mario Jurić",
        "Devanshi Singh",
        "Henry H. Hsieh",
        "Ian Sullivan",
        "R. Lynne Jones",
        "Jacob A. Kurlander",
        "Dmitrii Vavilov",
        "Siegfried Eggl",
        "Matthew Holman",
        "Federica Spoto",
        "Megan E. Schwamb",
        "Lauren A. MacArthur",
        "Rahil Makadia",
        "Marco Micheli",
        "Aren Heinze",
        "Eric J. Christensen",
        "Wilson Beebe",
        "Aaron Roodman",
        "Kian-Tat Lim",
        "Tim Jenness",
        "James Bosch",
        "Brianna Smart",
        "Eric Bellm",
        "Sean MacBride",
        "Meredith L. Rawls",
        "Sarah Greenstreet",
        "Colin Slater",
        "Željko Ivezić",
        "Bob Blum",
        "Andrew Connolly",
        "Gregory Daues",
        "Michelle Gower",
        "J. Bryce Kalmbach",
        "Michele T. Bannister",
        "Luke Dones",
        "Rosemary C. Dorsey",
        "Davide Farnocchia",
        "Wesley C. Fraser",
        "John C. Forbes",
        "Cesar Fuentes",
        "Carrie E. Holt",
        "Laura Inno",
        "Geraint H. Jones",
        "Matthew M. Knight",
        "Chris J. Lintott",
        "Tim Lister",
        "Robert Lupton",
        "Mark Jesus Mendoza Magbanua",
        "Renu Malhotra",
        "Beatrice E. A. Mueller",
        "Joseph Murtagh",
        "Nitya Pandey",
        "William T. Reach",
        "Nalin H. Samarasinha",
        "Darryl Z. Seligman",
        "Colin Snodgrass",
        "Michael Solontoi",
        "Gyula M. Szabó",
        "Peter Vereš",
        "Ellie White",
        "Maria Womack",
        "Leslie A. Young",
        "Russ Allbery",
        "Shreya Anand",
        "Roberto Armellin",
        "Éric Aubourg",
        "Chrysa Avdellidou",
        "Farrukh Azfar",
        "James Bauer",
        "Keith Bechtol",
        "vValerie R Beckerć",
        "Matthew Belyakov",
        "Susan D. Benecchi",
        "Ivano Bertini",
        "Dennis Bodewits",
        "Patricia Boeshaar",
        "Bryce T. Bolin",
        "vMaitrayee Bose",
        "Laura E. Buchanan",
        "Alexandre Boucaud",
        "Rodrigo C. Boufleur",
        "Dominique Boutigny",
        "Andrew Bradshaw",
        "Felipe Braga-Ribas",
        "Johan Bregeon",
        "Daniel Calabrese",
        "J. I. B. Camargo",
        "Neven Caplar",
        "Jeffrey L. Carlin",
        "Benoit Carry",
        "Juan Pablo Carvajal",
        "Ross Ceballo",
        "Hsin-Fang Chiang",
        "Yumi Choi",
        "Laura Toribio San Cipriano",
        "Céline Combet",
        "Luiz da Costa",
        "Preeti Cowan"
      ],
      "abstract": "NSF-DOE Vera C. Rubin Observatory Observations of Interstellar Comet 3I/ATLAS (C/2025 N1) Colin Orion Chandler, Pedro H. Bernardinelli, Mario Jurić, Devanshi Singh, Henry H. Hsieh, Ian Sullivan, R. Lynne Jones, Jacob A. Kurlander, Dmitrii Vavilov, Siegfried Eggl, Matthew Holman, Federica Spoto, Megan E. Schwamb, Lauren A. MacArthur, Rahil Makadia, Marco Micheli, Aren Heinze, Eric J. Christensen, Wilson Beebe, Aaron Roodman, Kian-Tat Lim, Tim Jenness, James Bosch, Brianna Smart, Eric Bellm, Sean MacBride, Meredith L. Rawls, Sarah Greenstreet, Colin Slater, Željko Ivezić, Bob Blum, Andrew Connolly, Gregory Daues, Michelle Gower, J. Bryce Kalmbach, Michele T. Bannister, Luke Dones, Rosemary C. Dorsey, Davide Farnocchia, Wesley C. Fraser, John C. Forbes, Cesar Fuentes, Carrie E. Holt, Laura Inno, Geraint H. Jones, Matthew M. Knight, Chris J. Lintott, Tim Lister, Robert Lupton, Mark Jesus Mendoza Magbanua, Renu Malhotra, Beatrice E. A. Mueller, Joseph Murtagh, Nitya Pandey, William T. Reach, Nalin H. Samarasinha, Darryl Z. Seligman, Colin Snodgrass, Michael Solontoi, Gyula M. Szabó, Peter Vereš, Ellie White, Maria Womack, Leslie A. Young, Russ Allbery, Shreya Anand, Roberto Armellin, Éric Aubourg, Chrysa Avdellidou, Farrukh Azfar, James Bauer, Keith Bechtol, vValerie R Beckerć, Matthew Belyakov, Susan D. Benecchi, Ivano Bertini, Dennis Bodewits, Patricia Boeshaar, Bryce T. Bolin, vMaitrayee Bose, Laura E. Buchanan, Alexandre Boucaud, Rodrigo C. Boufleur, Dominique Boutigny, Andrew Bradshaw, Felipe Braga-Ribas, Johan Bregeon, Daniel Calabrese, J. I. B. Camargo, Neven Caplar, Jeffrey L. Carlin, Benoit Carry, Juan Pablo Carvajal, Ross Ceballo, Hsin-Fang Chiang, Yumi Choi, Laura Toribio San Cipriano, Céline Combet, Luiz da Costa, Preeti Cowan 38 pages, 16 figures, 2 tables; collaboration between the NSF-DOE Vera C. Rubin Observatory and the LSST Solar System Science Collaboration (SSSC) Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We report on the observation and measurement of astrometry, photometry, morphology, and activityof the interstellar object 3I/ATLAS, also designated C/2025 N1 (ATLAS) with the NSF-DOE Vera C. Rubin Observatory. Comet 3I/ATLAS, the third known interstellar object, was discovered on UT 2025 July 1. Rubin Observatory had coincidentally collected images of the object's region of the sky during routine commissioning. Facilitated by Rubin's high resolution and large aperture, we successfully recovered object detections from Rubin observations spanning UT 2025 June 21 (10 days before discovery, when 3I/ATLAS was 4.5 au from the Sun) through the date of discovery, and we acquired additional images through UT 2025 July 20 as part of commissioning. We measure on-sky locations of 3I/ATLAS in Rubin ugrizy bands, with a typical precision of about 70 mas, and briefly describe the reason this is coarser than our measured static source astrometric precision of about 3 mas in Rubin images. We measure grizy magnitudes of 3I/ATLAS photometry at about 0.01 mag precision, detecting no short-term photometric variability above 0.01 mag. We derive an estimated near-nucleus dust-to-nucleus scattering cross-section ratio of eta >= 13 on UT 2025 July 2 based on Rubin photometry and an upper limit nucleus size computed from Hubble Space Telescope observations. We find Rubin colors of g - r = (0.657 +/- 0.013) mag, r - i = (0.235 +/- 0.018) mag, i - z = (0.147 +/- 0.042) mag, z - y = (0.047 +/- 0.052) mag. These data represent the earliest observations of this object by a large (>=8-meter class) telescope and illustrate the type of measurements (and discoveries) Rubin's Legacy Survey of Space and Time (LSST) will begin to provide after it begins in early 2026.",
      "pdf_url": "https://arxiv.org/pdf/2507.13409.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13136",
      "title": "VLBI astrometry of radio stars to link radio and optical celestial reference frames. II. 11 radio stars",
      "authors": [
        "Jingdong Zhang",
        "Bo Zhang",
        "Shuangjing Xu",
        "Xiaofeng Mai",
        "Mark J. Reid",
        "Pengfei Jiang",
        "Wen Chen",
        "Fengchun Shu",
        "Jinling Li",
        "Lang Cui",
        "Xingwu Zheng",
        "Yan Sun",
        "Zhaoxiang Qi"
      ],
      "abstract": "VLBI astrometry of radio stars to link radio and optical celestial reference frames. II. 11 radio stars Jingdong Zhang, Bo Zhang, Shuangjing Xu, Xiaofeng Mai, Mark J. Reid, Pengfei Jiang, Wen Chen, Fengchun Shu, Jinling Li, Lang Cui, Xingwu Zheng, Yan Sun, Zhaoxiang Qi MNRAS accepted. Note: this paper is renumbered to II in the paper series due to publication order issue Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) The alignment between the radio-based International Celestial Reference Frame (ICRF) and the optical Gaia Celestial Reference Frame (Gaia-CRF) is critical for multi-waveband astronomy, yet systematic offsets at the optical bright end (G<13) limit their consistency. While radio stars offer a potential link between these frames, their utility has been restricted by the scarcity of precise Very Long Baseline Interferometry (VLBI) astrometry. In this study, we present new VLBI astrometry of 11 radio stars using the Very Long Baseline Array (VLBA), expanding the existing sample with positions, parallaxes, and proper motions measured. All 11 radio stars were detected, for 10 of which parallaxes and proper motions can be estimated, achieving median uncertainties better than 0.1 mas and 0.1 mas/yr, respectively. These new samples greatly contribute to the link between ICRF and Gaia-CRF at the optical bright end.",
      "pdf_url": "https://arxiv.org/pdf/2512.13136.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04274",
      "title": "Limb Shift of the Fe I 6569 Å line on the Sun",
      "authors": [
        "H. C. Yu",
        "M. D. Ding",
        "J. Hong",
        "Y. K. Wang",
        "Z. Li"
      ],
      "abstract": "Limb Shift of the Fe I 6569 Å line on the Sun H. C. Yu, M. D. Ding, J. Hong, Y. K. Wang, Z. Li Solar and Stellar Astrophysics (astro-ph.SR) The convective motions of solar granules generate a center-to-limb variation of Doppler velocity in the photospheric lines, known as the limb shift effect. This study presents a comprehensive analysis of this effect for the Fe I 6569 Å line using both observational data from the CHASE mission and numerical simulations from the Bifrost code. We employ two independent methods to derive the limb shift curve: a spectral-averaging method (Method 1) and a velocity-averaging method (Method 2). By comparing synthetic and observed data, we determine the convective blueshift, which is not accounted for in the CHASE observations. The simulations reproduce the observed trends for both methods at the instrument's spatial resolution of 1.2 arcsec. However, at resolutions below 1 arcsec, Method 2 produces limb-shift curves that depart significantly from both Method 1 results and traditional limb-shift profiles, whereas Method 1 remains in agreement with classical behavior. Further analysis finds that the results from Method 1 comprise two distinct components: a contrast contribution caused by the correlation between velocity and line depth, and a Dopplergram contribution caused by density inhomogeneities and corrugation effects.",
      "pdf_url": "https://arxiv.org/pdf/2602.04274.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04354",
      "title": "Stellar Interpretation of Meteoritic Data and PLotting for Everyone (SIMPLE): Isotope Mixing Lines for Six Sets of Core-Collapse Supernova Models",
      "authors": [
        "Marco Pignatari",
        "Mattias Ek",
        "Georgy V. Makhatadze",
        "Gábor G. Bálazs",
        "Lorenzo Roberti",
        "James M. Ball",
        "Borbála Cseh",
        "Alessandro Chieffi",
        "Chris Fryer",
        "Falk Herwig",
        "Chiara Incollingo",
        "Thomas Lawson",
        "Marco Limongi",
        "Thomas Rauscher",
        "Maria Schönbächler",
        "Andre Sieverding",
        "Reto Trappitsch",
        "Maria Lugaro"
      ],
      "abstract": "Stellar Interpretation of Meteoritic Data and PLotting for Everyone (SIMPLE): Isotope Mixing Lines for Six Sets of Core-Collapse Supernova Models Marco Pignatari, Mattias Ek, Georgy V. Makhatadze, Gábor G. Bálazs, Lorenzo Roberti, James M. Ball, Borbála Cseh, Alessandro Chieffi, Chris Fryer, Falk Herwig, Chiara Incollingo, Thomas Lawson, Marco Limongi, Thomas Rauscher, Maria Schönbächler, Andre Sieverding, Reto Trappitsch, Maria Lugaro 16 pages, 4 figures, 2 tables, submitted to the Astrophysical Journal Supplement Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Bulk meteorites and their inclusions exhibit, for many chemical elements, isotopic variability produced by nucleosynthetic events in stars and supernovae before the formation of the Sun. While the exact astrophysical origins of these variations are still a matter of debate, their identification provides insights on the environment of the Sun's birth and the formation of the Solar System. Here we present a new Python tool called SIMPLE (Stellar Interpretation of Meteoritic Data and Plotting for Everyone) designed to compare the isotopic composition of the ejecta from core-collapse supernovae (CCSNe) with meteoritic data. In the present version, the SIMPLE toolkit includes a dataset of 18 CCSN models, from 6 different published sets, with initial masses of 15, 20, and 25 M$_{\\odot}$ and solar metallicity. SIMPLE is designed to easily extract the isotopic abundances predicted by each CCSN model for any elements and post-process them into the format needed to compare to the meteoritic data, therefore, facilitating their interpretation. As an example of how to use SIMPLE, we analyze the composition of the Ni isotopes in the 18 models and confirm that bulk meteorite Ni anomalies are compatible with material from the innermost Si-rich region of CCSN ejecta. Designed as a collaborative platform, SIMPLE is open-source and welcomes community contributions to enhance its development and dissemination for stellar nucleosynthesis and meteoritic studies. Future enhancements include addition of more model predictions and inclusion of mixing between different layers of supernova ejecta.",
      "pdf_url": "https://arxiv.org/pdf/2602.04354.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04427",
      "title": "Cosmic Ray Inter-Station Correlation Variations as Precursors of Geomagnetic Storms: A Statistical Study and Multi-Parameter Early Warning Framework",
      "authors": [
        "Haoyang Li",
        "Zongyuan Ge",
        "Zhaoming Wang"
      ],
      "abstract": "Cosmic Ray Inter-Station Correlation Variations as Precursors of Geomagnetic Storms: A Statistical Study and Multi-Parameter Early Warning Framework Haoyang Li, Zongyuan Ge, Zhaoming Wang Solar and Stellar Astrophysics (astro-ph.SR) The modulation of galactic cosmic rays (GCRs) by interplanetary disturbances, manifested as Forbush decreases (FDs), has long been recognized as a signature of coronal mass ejection (CME) passages through the heliosphere. While individual FD events have been extensively studied, systematic investigations of how GCR inter-station correlation variations relate to geomagnetic storm (GS) intensity have not been established. Here we analyze the relationship between GCR characteristics (from a global NM network) and GSs, aiming to understand the physical mechanisms of heliospheric disturbances and to develop complementary predictive capabilities beyond existing L1 solar wind monitoring. By applying a newly introduced anisotropy characteristic method alongside correlation analysis to 25 years of hourly NM data (1995-2020, seven stations), we demonstrate significant correlations between GCR parameters and geomagnetic activity. Inter-station relative differences and anisotropy enhancements show distinct precursor signatures depending on storm intensity, with extreme events displaying detectable signals 48-96 hours in advance. Based on these intensity-dependent response patterns, we propose a \"two-stage multi-level\" early warning framework: mid-term identification (48-96 hr) triggered by sustained anisotropy increases, followed by short-term grading (0-48 hr) based on inter-station relative difference variations and high-latitude flux changes. Validated on the extreme November 2003 and severe August 2018 geomagnetic storms, our approach successfully identifies precursor signals, providing a potential means to extend GS prediction windows.",
      "pdf_url": "https://arxiv.org/pdf/2602.04427.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04701",
      "title": "Early Stages of Protostellar Disk Evolution: A Link to the Initial Cloud Core",
      "authors": [
        "Majd Noel",
        "Rahul Khanna",
        "Shahram Abbassi",
        "Sami Dib",
        "Shantanu Basu"
      ],
      "abstract": "Early Stages of Protostellar Disk Evolution: A Link to the Initial Cloud Core Majd Noel, Rahul Khanna, Shahram Abbassi, Sami Dib, Shantanu Basu Solar and Stellar Astrophysics (astro-ph.SR) We study the structure and evolution of the very early protostellar disk (``protodisk'') just after protostar formation, where disk self-gravity dominates and the stellar contribution is dynamically minor. The disk redistributes angular momentum outward through outflows and gravitational torques, thereby helping to resolve the angular momentum problem of star formation. We develop a self-similar model and carry out a parameter study that examines disk stability as a function of the key drivers of early evolution, notably the infall rate from the envelope and the strength of the gravitational torques. The mass infall rate onto the disk is estimated to be that from the collapse of a Bonnor-Ebert sphere. Our results indicate that protostellar disks that form from more unstable initial cores are more likely to be Toomre-unstable. We also find that the specific angular momentum of young protostellar disks lie in the range $10^{19}\\text{--}10^{20}\\,{\\rm cm^2\\,s^{-1}}$. We find distinct power-law profiles of physical quantities in the protodisk stage, including a rotation velocity profile that is shallower than the Keplerian profile that would be established at a later stage. As a rough validity window, our assumptions are most secure during the first $\\lesssim 2\\times 10^{3}$\\,yr after protostar formation and may plausibly extend to $\\sim(0.5\\text{--}1)\\times 10^{4}$\\,yr under weak magnetic braking and strong infall.",
      "pdf_url": "https://arxiv.org/pdf/2602.04701.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04797",
      "title": "The Frequency of Solar Eclipses for a Given Place: A New Approach to a Classic Question",
      "authors": [
        "Graham Jones",
        "Renate Mauland-Hus",
        "Frank Thomas Tveter",
        "Anne Buckle",
        "Sébastien Emonet",
        "Adalbert Michelic",
        "Anna Smith",
        "David Usken",
        "Steffen Thorsen"
      ],
      "abstract": "The Frequency of Solar Eclipses for a Given Place: A New Approach to a Classic Question Graham Jones, Renate Mauland-Hus, Frank Thomas Tveter, Anne Buckle, Sébastien Emonet, Adalbert Michelic, Anna Smith, David Usken, Steffen Thorsen Accepted for publication in the Journal of the British Astronomical Association Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) In a classic 1982 paper in this journal, Jean Meeus used a statistical approach for finding the mean frequency of a total and an annular eclipse of the Sun at a given place on the surface of the Earth. In this current paper we tackle the problem again, taking advantage of the much greater computing power now available. We obtain narrower estimates of once every 373 $\\pm$ 7 years for a total eclipse, and once every 226 $\\pm$ 4 years for an annular eclipse. In addition, we obtain a result of once every 2.59 $\\pm$ 0.02 years for a partial eclipse. We provide further insights into the \"latitude effect\", showing that solar eclipses occur most frequently around the Arctic and Antarctic Circles. We also show how the gradual shift of aphelion and perihelion with respect to the seasons produces a $\\sim$21,000-year cycle in the frequency of eclipses in the Northern and Southern Hemispheres.",
      "pdf_url": "https://arxiv.org/pdf/2602.04797.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04848",
      "title": "Diagnostics for the solar chromosphere using neutral carbon Rydberg lines",
      "authors": [
        "R.P. Dufresne",
        "C.M.O. Osborne",
        "G. Del Zanna"
      ],
      "abstract": "Diagnostics for the solar chromosphere using neutral carbon Rydberg lines R.P. Dufresne, C.M.O. Osborne, G. Del Zanna 11 pages, 7 figures, 1 table, accepted in MNRAS Solar and Stellar Astrophysics (astro-ph.SR) Diagnostics for the solar chromosphere are relatively few compared to other parts of the atmosphere. Despite this, hundreds of Rydberg lines emitted by neutrals in this region have been observed at UV wavelengths. Here, we investigate their diagnostic potential by modelling the lines emitted by neutral carbon using recent atomic data. We use the radiative transfer code Lightweaver to explore how they form and how they respond to temperature, density and micro-turbulent velocity perturbations in the atmosphere. To simplify the modelling, we investigate lines emitted from levels with principal quantum number $n\\geq10$, which are expected to be in Saha-Boltzmann equilibrium with the ground state of the singly-charged ion. Optical depth effects are apparent in the lines and their response to atmospheric perturbations suggest that they will be useful in reconstructions of the atmosphere using inversions. The study opens the way for using many such lines emitted by multiple elements over a range of heights, a large number of which will be observed by the forthcoming Solar-C EUV High-throughput Spectroscopic Telescope (EUVST).",
      "pdf_url": "https://arxiv.org/pdf/2602.04848.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03959",
      "title": "The Landscape of Undergraduate Astronomy and Astrophysics Degree Requirements",
      "authors": [
        "Kate Follette",
        "Carl Ferkinhoff",
        "Michael Foley",
        "Meridith MacGregor",
        "Melissa Morris",
        "Karen Masters",
        "Tom Rice",
        "Colin Wallace"
      ],
      "abstract": "The Landscape of Undergraduate Astronomy and Astrophysics Degree Requirements Kate Follette, Carl Ferkinhoff, Michael Foley, Meridith MacGregor, Melissa Morris, Karen Masters, Tom Rice, Colin Wallace this report was delivered to the American Astronomical Society Board on December 22, 2025. Feedback from the community is welcome at this http URL Physics Education (physics.ed-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) In this document we summarize the results of a survey of undergraduate degree-granting programs conducted by the 2024-2025 American Astronomical Society Education Committee's Subcommittee on UndeRgraduate and Graduate Education (SURGE). Individuals from 78 institutions completed the survey, representing approximately 1000 majors annually and a majority of undergraduate Astronomy and Astrophysics degree-granting institutions. Information collected from participants include: degree names, degree types, course requirements, elective course options, and learning goals. Our report presents 9 key findings and 10 recommendations, and these are summarized in the preamble to the report. The recommendations are directed primarily to degree-granting departments and the American Astronomical Society, as the principal relevant professional organization, though we earnestly invite all members of the Astronomy and Astrophysics community to contribute to a broader discussion about these findings and recommendations. Appendix A of the report contains detailed descriptions of survey data analyses. Appendices B and C contain recommended undergraduate course requirements and learning goals, respectively. Our survey results show clearly that there is not currently community consensus about what knowledge and competencies an undergraduate Astronomy or Astrophysics degree should instill. This lack of cohesion is a problem for our community, as it dilutes the significance and interpretability of the credential for employers and graduate schools. We view this report as just the beginning of an important dialog, and we look forward to engaging with the Astronomy and Astrophysics community about our findings and recommendations through our feedback form at this http URL.",
      "pdf_url": "https://arxiv.org/pdf/2602.03959.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/1401.3149",
      "title": "The VLT-FLAMES Tarantula Survey. XV. VFTS 822: a candidate Herbig B[e] star at low metallicity",
      "authors": [
        "V. M. Kalari",
        "J. S. Vink",
        "P. L. Dufton",
        "C. J. Evans",
        "P. R. Dunstall",
        "H. Sana",
        "J. S. Clark",
        "L. Ellerbroek",
        "A. de Koter",
        "D. J. Lennon",
        "W. D. Taylor"
      ],
      "abstract": "The VLT-FLAMES Tarantula Survey. XV. VFTS 822: a candidate Herbig B[e] star at low metallicity V. M. Kalari, J. S. Vink, P. L. Dufton, C. J. Evans, P. R. Dunstall, H. Sana, J. S. Clark, L. Ellerbroek, A. de Koter, D. J. Lennon, W. D. Taylor Solar and Stellar Astrophysics (astro-ph.SR) We report the discovery of the B[e] star VFTS 822 in the 30 Doradus star-forming region of the Large Magellanic Cloud, classified by optical spectroscopy from the VLT-FLAMES Tarantula Survey and complementary infrared photometry. VFTS 822 is a relatively low-luminosity (log $L$ = 4.04 $\\pm$ 0.25 $L_{\\odot}$) B8[e] star. In this Letter, we evaluate the evolutionary status of VFTS 822 and discuss its candidacy as a Herbig B[e] star. If the object is indeed in the pre-main sequence phase, it would present an exciting opportunity to measure mass accretion rates at low metallicity spectroscopically, to understand the effect of metallicity on accretion rates.",
      "pdf_url": "https://arxiv.org/pdf/1401.3149.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18742",
      "title": "Nonthermal electron acceleration in turbulent post-flare coronal loops",
      "authors": [
        "Clarissa Mora",
        "Fabio Bacchini",
        "Rony Keppens"
      ],
      "abstract": "Nonthermal electron acceleration in turbulent post-flare coronal loops Clarissa Mora, Fabio Bacchini, Rony Keppens Solar and Stellar Astrophysics (astro-ph.SR) The generation of nonthermal electrons during solar flares plays a critical role in energy transport from the corona to the chromosphere, producing regions of observed intense X-ray emission. Turbulence in post-flare loops, particularly from Kelvin-Helmholtz instabilities (KHI), has been suggested and investigated as a mechanism for trapping and accelerating electrons in such scenarios. Starting from past results, we aim to characterize the energization process of electrons trapped in a turbulent post-flare looptop, quantifying the contributions of different acceleration mechanisms, and establishing a coherent numerical framework for describing particle energetics. We perform test-particle simulations with the guiding-centre approximation on top of a 2.5D magnetohydrodynamic model of a time-evolving post-flare coronal looptop. We implement an improved formulation of the guiding-centre equations that explicitly conserves energy, enabling a consistent analysis of electron acceleration in the turbulent plasma. We find that, in the plasma turbulence inside the looptop, electrons develop suprathermal energy distributions with tails compatible with hard X-ray emission. The dominant energization channel arises from perpendicular gradient effects in the form of second-order Fermi-like stochastic acceleration, while curvature effects are dominant for particles on long trajectories. Statistical correlations with the measured particle pitch angle confirm that the strongest acceleration occurs for electrons trapped in bouncing motions within turbulent magnetic structures. Our results provide an understanding of how KHI-induced turbulence in coronal looptops produces and sustains populations of trapped nonthermal electrons. We dissect and clarify the relative roles of different magnetic effects and the emergence of stochastic Fermi-like energization.",
      "pdf_url": "https://arxiv.org/pdf/2510.18742.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.18914",
      "title": "STORMY : A Real-time Triggering Framework using Yamagawa Solar Spectrograph for Active Solar Emission Observations with the MWA",
      "authors": [
        "Deepan Patra",
        "Devojyoti Kansabanik",
        "Divya Oberoi",
        "Yûki Kubo",
        "Bradley W. Meyers",
        "Andrew Williams",
        "Soham Dey",
        "Naoto Nishizuka"
      ],
      "abstract": "STORMY : A Real-time Triggering Framework using Yamagawa Solar Spectrograph for Active Solar Emission Observations with the MWA Deepan Patra, Devojyoti Kansabanik, Divya Oberoi, Yûki Kubo, Bradley W. Meyers, Andrew Williams, Soham Dey, Naoto Nishizuka Published in Publications of the Astronomical Society of Australia (PASA) Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) Some of the most interesting insights into solar physics and space weather come from studying radio emissions associated with solar activity, which remain inherently unpredictable. Hence, a real-time triggering system is needed for solar observations with the versatile new-generation radio telescopes to efficiently capture these episodes of solar activity with the precious and limited solar observing time. We have developed such a system, Solar Triggered Observations of Radio bursts using MWA and Yamagawa (STROMY) for the Murchison Widefield Array (MWA), the precursor for the low frequency telescope of upcoming Square Kilometre Array Observatory (SKAO). It is based on near-real-time data from the Yamagawa solar spectrograph, located at a similar longitude to the MWA. We have devised, implemented, and tested algorithms to perform an effective denoising of the data to identify signatures of solar activity in the Yamagawa data in near real-time. End-to-end tests of triggered observations have been successfully carried out at the MWA. STORMY is operational at the MWA for the routine solar observations, a timely development in the view of the ongoing solar maximum. We present this new observing framework and discuss how it can enable efficient capturing of event-rich solar data with existing instruments, like the LOw Frequency ARray (LOFAR), Owens Valley Radio Observatory - Long Wavelength Array (OVRO-LWA) etc., and pave the way for triggered observing with the SKAO, especially the SKA-Low.",
      "pdf_url": "https://arxiv.org/pdf/2511.18914.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.04764",
      "title": "Observations of Transition from Imbalanced to Balanced Kinetic Alfvénic Turbulence",
      "authors": [
        "Jinsong Zhao",
        "Trevor A. Bowen",
        "Stuart D. Bale",
        "Chen Shi",
        "Thierry Dudok de Wit",
        "Nikos Sioulas"
      ],
      "abstract": "Observations of Transition from Imbalanced to Balanced Kinetic Alfvénic Turbulence Jinsong Zhao, Trevor A. Bowen, Stuart D. Bale, Chen Shi, Thierry Dudok de Wit, Nikos Sioulas 18 pages, 14 figures, accepted for publication in ApJL Space Physics (physics.space-ph); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) We report observations of solar wind turbulence derived from measurements by the Parker Solar Probe. Our findings reveal the emergence of finite magnetic helicity within the transition range of the turbulence, aligning with signatures of kinetic Alfvén waves (KAWs). Notably, as the wave scale transitions from super-ion to sub-ion scales, the ratio of KAWs with opposing signs of magnetic helicity initially increases from approximately 1 to 6.5 before returning to 1. This observation provides, for the first time, compelling evidence for the transition from imbalanced kinetic Alfvénic turbulence to balanced kinetic Alfvénic turbulence.",
      "pdf_url": "https://arxiv.org/pdf/2502.04764.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04020",
      "title": "Thermal conductivity of various CFRPs from 100 mK to 20 K",
      "authors": [
        "Valentin Sauvage"
      ],
      "abstract": "Thermal conductivity of various CFRPs from 100 mK to 20 K Valentin Sauvage Instrumentation and Methods for Astrophysics (astro-ph.IM) Carbon-fiber-reinforced polymers (CFRPs) are some of the most useful materials for building spacecraft and aerospace tools. They are especially valuable for systems that work at extremely cold (cryogenic) temperatures because they are strong, lightweight, and don't transfer heat easily. In this study, researchers measured how well heat moves through several different types of carbon fiber samples, specifically T300, T700, HS40, M55J, and IMA, at different fiber layouts and densities. These measurements were taken at ultra-cold temperatures ranging from 100 mK to 20 K. The team used a newly developed analysis method to calculate the thermal conductivity for each sample. Finally, they shared how each material behaved at different temperatures and compared their findings to previous research.",
      "pdf_url": "https://arxiv.org/pdf/2602.04020.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04041",
      "title": "WFC3/UVIS Geometric Distortion -- Time Evolution of Linear Terms w.r.t Gaia",
      "authors": [
        "Anne O'Connor",
        "Varun Bajaj",
        "Jennifer Mack",
        "Annalisa Calamida"
      ],
      "abstract": "WFC3/UVIS Geometric Distortion -- Time Evolution of Linear Terms w.r.t Gaia Anne O'Connor, Varun Bajaj, Jennifer Mack, Annalisa Calamida Instrumentation and Methods for Astrophysics (astro-ph.IM) We align more than 7,400 WFC3/UVIS exposures to the Gaia DR3 catalog to examine the time evolution of the linear terms (shift, rotation, scale and skew) of the geometric distortion solution between 2009 and 2022. We find small linear temporal changes in the scale and skew terms (less than 0.2 pixels in 13 years) which are generally dominated by intrinsic scatter (up to $\\pm$ 0.3 pixels). Concurrently, a larger filter-dependent offset in the scale term is observed, with a maximum difference of 0.3 pixels between F275W and F814W images at all epochs. A small rotation offset to Gaia of 0.003 $\\pm$ 0.004 degrees is measured from 2009 to mid-2017, after which the offsets are as large as 0.01 degrees, with a large scatter. MAST pipeline processing includes an additional alignment step which corrects UVIS images for any residual linear terms with respect to Gaia DR3 when there are at least 10 matched sources. In addition to any pointing offsets, this step accounts for any evolution in the distortion linear terms described here. For observers requiring high-precision astrometry, we recommend using the tweakreg routine to realign images using a 4-parameter fit (x-shift, y-shift, rotation, and scale) or a 6-parameter fit (x-shift, y-shift, x-rotation, y-rotation, x-scale, and y-scale) depending on the number of matched sources. We provide links to DrizzlePac tutorials for improving both absolute and relative astrometry in WFC3 images.",
      "pdf_url": "https://arxiv.org/pdf/2602.04041.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04183",
      "title": "GASV: A New VLBI analysis software for Geodesy and Astrometry",
      "authors": [
        "Dang Yao",
        "Yuan-wei Wu",
        "Xu-hai Yang"
      ],
      "abstract": "GASV: A New VLBI analysis software for Geodesy and Astrometry Dang Yao, Yuan-wei Wu, Xu-hai Yang Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) We present GASV, a novel Python-based software package specifically designed for the analysis of Very Long Baseline Interferometry (VLBI) data. Developed with ease of installation and user friendliness in mind, GASV supports both pipeline and interactive processing modes. The software processes VLBI baseline delays and rates in standard formats such as HOPS outputs and NGS card files to estimate key geodetic and astrometric parameters, including station coordinates, Earth Orientation Parameters, source coordinates, clock parameters, and atmospheric models. We evaluate the capabilities and performance of GASV, demonstrating that its parameter estimation accuracy for IVS INT, Regular, and CONT sessions is comparable to that achieved by the VLBI analysis centers at BKG and USNO. As a state-of-the-art tool, GASV not only enables high-quality single-session data processing but also but also supports global analyses of long-term SINEX files, generating Celestial Reference Frame and Terrestrial Reference Frame solutions with reliable accuracy.",
      "pdf_url": "https://arxiv.org/pdf/2602.04183.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04269",
      "title": "A Quantum Computing Framework for VLBI Data Correlation",
      "authors": [
        "Lei Liu"
      ],
      "abstract": "A Quantum Computing Framework for VLBI Data Correlation Lei Liu Instrumentation and Methods for Astrophysics (astro-ph.IM); Quantum Physics (quant-ph) We present a quantum computing framework for VLBI data correlation. We point out that a classical baseband time series data of length $N$ can be embedded into a quantum superposition state using amplitude encoding with only $\\log_2 N$ qubits. The basic VLBI correlation and fringe fitting operations, including fringe rotation, Fourier transform, delay compensation, and cross correlation, can be implemented via quantum algorithms with significantly reduced computational complexity. We construct a full quantum processing pipeline and validate its feasibility and accuracy through direct comparison with a classical VLBI pipeline. We recognize that amplitude encoding of large data volumes remains the primary bottleneck in quantum computing; however, the quantized nature of VLBI raw data helps reduce the state-preparation complexity. Our investigation demonstrates that quantum computation offers a promising paradigm for VLBI data correlation and is likely to play a role in future VLBI systems.",
      "pdf_url": "https://arxiv.org/pdf/2602.04269.pdf",
      "categories": [
        "astro-ph.IM",
        "quant-ph"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04840",
      "title": "The EXoplanet Climate Infrared TElescope (EXCITE): A balloon-borne mission to measure spectroscopic phase curves of transiting hot Jupiters",
      "authors": [
        "Timothy D. Rehm",
        "Caitlyn Altermatt",
        "Lee Bernard",
        "Andrea Bocchieri",
        "Nathaniel Butler",
        "Oliver Carey",
        "Ryan C. Challener",
        "John Hartley",
        "Kyle R. Helson",
        "Daniel P. Kelly",
        "Kanchita Klangboonkrong",
        "Andrei L. Korotkov",
        "Maura Lally",
        "Edward Leong",
        "Nikole K. Lewis",
        "Steven Li",
        "Michael Line",
        "Stephen F. Maher",
        "Ryan McClelland",
        "Lorenzo V. Mugnai",
        "Peter C. Nagler",
        "C. Barth Netterfield",
        "Vivien Parmentier",
        "Enzo Pascale",
        "Jennifer Patience",
        "L. Javier Romualdez",
        "Paul A. Scowen",
        "Gregory S. Tucker",
        "Ingo Waldmann"
      ],
      "abstract": "The EXoplanet Climate Infrared TElescope (EXCITE): A balloon-borne mission to measure spectroscopic phase curves of transiting hot Jupiters Timothy D. Rehm, Caitlyn Altermatt, Lee Bernard, Andrea Bocchieri, Nathaniel Butler, Oliver Carey, Ryan C. Challener, John Hartley, Kyle R. Helson, Daniel P. Kelly, Kanchita Klangboonkrong, Andrei L. Korotkov, Maura Lally, Edward Leong, Nikole K. Lewis, Steven Li, Michael Line, Stephen F. Maher, Ryan McClelland, Lorenzo V. Mugnai, Peter C. Nagler, C. Barth Netterfield, Vivien Parmentier, Enzo Pascale, Jennifer Patience, L. Javier Romualdez, Paul A. Scowen, Gregory S. Tucker, Ingo Waldmann 22 pages, 29 figures, submitted to Review of Scientific Instruments Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) The EXoplanet Climate Infrared TElescope (EXCITE) is a balloon-borne mission dedicated to measuring spectroscopic phase curves of hot Jupiter-type exoplanets. Phase curve measurements can be used to characterize an exoplanet's longitude-dependent atmospheric composition and energy circulation patterns. EXCITE carries a 0.5 m primary mirror and moderate resolution diffraction-limited spectrograph with spectral coverage from 0.8--3.5 um. EXCITE is designed to fly from a long-duration balloon (LDB). EXCITE will observe through the peak of a target's spectral energy distribution (SED) and through spectral signatures of hydrogen and carbon-containing molecules. In this paper, we present the science goals of EXCITE, detail the as-built instrument, and discuss its performance during a 2024 engineering flight from Fort Sumner, New Mexico.",
      "pdf_url": "https://arxiv.org/pdf/2602.04840.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04389",
      "title": "Lessons Learned from Integrating Generative AI into an Introductory Undergraduate Astronomy Course at Harvard",
      "authors": [
        "Christopher W. Stubbs",
        "Dongpeng Huang",
        "Jungyoon Koh",
        "Madeleine Woods",
        "Andrés A. Plazas Malagón"
      ],
      "abstract": "Lessons Learned from Integrating Generative AI into an Introductory Undergraduate Astronomy Course at Harvard Christopher W. Stubbs, Dongpeng Huang, Jungyoon Koh, Madeleine Woods, Andrés A. Plazas Malagón 27 pages, submitted to the Journal of Astronomy and Earth Sciences Education Physics Education (physics.ed-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM) We describe our efforts to fully integrate generative artificial intelligence (GAI) into an introductory undergraduate astronomy course. Ordered by student perception of utility, GAI was used in instructional Python notebooks, in a subset of assignments, for student presentation preparations, and as a participant (in conjunction with a RAG-encoded textbook) in a course Slack channel. Assignments were divided into GAI-encouraged and GAI-discouraged. We incentivized student mastery of the material through midterm and final exams in which electronics were not allowed. Student evaluations of the course showed no reduction compared to the non-GAI version from the previous year.",
      "pdf_url": "https://arxiv.org/pdf/2602.04389.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.13158",
      "title": "Hybrid Active-Passive Galactic Cosmic Ray Simulator: experimental implementation and microdosimetric characterization",
      "authors": [
        "Enrico Pierobon",
        "Luca Lunati",
        "Tim Wagner",
        "Marco Durante",
        "Christoph Schuy"
      ],
      "abstract": "Hybrid Active-Passive Galactic Cosmic Ray Simulator: experimental implementation and microdosimetric characterization Enrico Pierobon, Luca Lunati, Tim Wagner, Marco Durante, Christoph Schuy Space Physics (physics.space-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM) Space radiation is one of the major obstacles to space exploration. If not mitigated, radiation can interact both with biological and electronic systems, inducing damage and posing significant risk to space missions. Countermeasures can only be studied effectively with ground-based accelerators that act as a proxy for space radiation. Following an in-silico design and optimization process we have developed a galactic cosmic ray (GCR) simulator using a hybrid active-passive methodology. In this approach, the primary beam energy is actively switched and the beam interacts with specifically designed passive modulators. In this paper, we present the implementation of such a GCR simulator and its experimental microdosimetric characterization. Measuring the GCR field is of paramount importance, both before providing it to the user as a validated radiation field and for achieving the best possible radiation description. The issue is addressed in this paper by using a tissue equivalent proportional counter to measure radiation quality and by comparing experimental measurements with Monte Carlo simulations. In conclusion, we will demonstrate the GCR simulator's capability to reproduce a GCR field.",
      "pdf_url": "https://arxiv.org/pdf/2509.13158.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03885",
      "title": "Where Does Tracing of Cosmic Ray in Real Atmosphere Terminate?",
      "authors": [
        "Du-Xin Zheng",
        "Long Chen",
        "Ran Huo"
      ],
      "abstract": "Where Does Tracing of Cosmic Ray in Real Atmosphere Terminate? Du-Xin Zheng, Long Chen, Ran Huo 8 pages, 6 figures, to be published in Chinese Physics C Space Physics (physics.space-ph); Earth and Planetary Astrophysics (astro-ph.EP); High Energy Physics - Phenomenology (hep-ph); Atmospheric and Oceanic Physics (physics.ao-ph) In backtracing simulations, which are widely employed to determine cosmic-ray particle trajectories in the geomagnetic field, the atmosphere is typically approximated as an artificial sharp boundary at some low altitude where the traced trajectory terminates. In this paper, we extend beyond this simplified assumption and investigate two realistic physical processes that terminate cosmic-ray particle propagation in the atmosphere: Bethe-Bloch energy loss mechanisms and hard scattering interactions with atmospheric atoms using total cross sections based on the Glauber-Gribov formalism. The former mechanism dominates at low rigidities (for protons below $\\sim0.57$~GV), while the latter becomes dominant at higher rigidities. Consequently, we introduce two dimensionless variables up to detailed numerical criteria: the relative rigidity shift due to Bethe-Bloch effects ($\\Delta\\mathfrak{R}/\\mathfrak{R}$), and the expected number of hard scattering events ($\\langle N\\rangle$). Using the corrected US Standard Atmosphere 1976 model, we demonstrate that the altitude dependence can be factorized as approximately $\\exp(-0.14h/\\textrm{km})$. Additionally, the effect of the local curvature radius of the trajectory near perigee can be similarly factorized. Our calculations indicate that the simplified sharp-boundary altitude should be at least $50$ km with $\\Delta\\mathfrak{R}/\\mathfrak{R}+\\langle N\\rangle\\lesssim1$ for protons, increasing by more than $15$ km for heavy nuclei such as iron.",
      "pdf_url": "https://arxiv.org/pdf/2602.03885.pdf",
      "categories": [
        "astro-ph.EP",
        "hep-ph"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.08280",
      "title": "How Internal Structure Shapes the Metallicity of Giant Exoplanets",
      "authors": [
        "Lorenzo Peerani",
        "Saburo Howard",
        "Ravit Helled"
      ],
      "abstract": "How Internal Structure Shapes the Metallicity of Giant Exoplanets Lorenzo Peerani, Saburo Howard, Ravit Helled Earth and Planetary Astrophysics (astro-ph.EP) The composition and internal structure of gas giant exoplanets encode key information about their formation and evolution. We investigate how different assumed interior structures affect the inferred bulk metallicity and its correlation with planetary mass. For a sample of 44 giant exoplanets (0.12-5.98 MJ), we computed evolutionary models with CEPAM and retrieved their bulk metallicities under three structural hypotheses: core+envelope (CE), dilute core (DC), and fully mixed (FM). Across all structures, we recover a significant positive correlation between total heavy-element mass (MZ) and planetary mass (M), and a negative correlation between bulk metallicity (Z) and M (also for Z/Zstar vs M). Dilute core structures yield metallicities comparable to CE models, regardless of the assumed extent of the composition gradient. Increasing atmospheric metallicity augments the inferred bulk metallicity, as enhanced opacities slow planetary cooling. Non-adiabatic DC models can further increase the retrieved metallicity by up to 35 percent. We find that the mass-metallicity anti-correlation is primarily driven by low-mass, metal-rich planets (M < 0.2 MJ), and that massive planets (greater than about 1 MJ) can exhibit unexpectedly high metallicities (Z approximately 0.1-0.3). Improved constraints on convective mixing, combined with upcoming accurate measurements of planetary masses, radii, and atmospheric compositions from missions such as PLATO and Ariel, will provide further constraints on interior structure and formation models of gas giant planets.",
      "pdf_url": "https://arxiv.org/pdf/2510.08280.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.00160",
      "title": "First Astrometric Limits on Binary Planets and Exomoons orbiting $β$ Pictoris b",
      "authors": [
        "Isabella Macias",
        "Sydney Jenkins",
        "Andrew Vanderburg"
      ],
      "abstract": "First Astrometric Limits on Binary Planets and Exomoons orbiting $β$ Pictoris b Isabella Macias, Sydney Jenkins, Andrew Vanderburg 16 pages, 4 figures, 4 tables. Submitted to AAS Journals. A machine-readable version of Table 4 is available in LaTeX source Earth and Planetary Astrophysics (astro-ph.EP) The search for exomoons, or moons in other star systems, has attracted significant interest in recent years, driven both by advancements in detection sensitivity and by the expanding population of known exoplanets. The $\\beta$ Pictoris system is a particularly favorable target, as its proximity and directly imaged planets allow for precise astrometric monitoring. We present astrometric constraints on the presence of binary planets and exomoons in the $\\beta$ Pictoris system using archival observations from the GRAVITY interferometer and SPHERE instruments. We calculate these limits by modeling the motion of the two orbiting planets and introducing an additional perturbation to the model that simulates the astrometric motion caused by an exomoon orbiting the planet $\\beta$ Pictoris b. We find that for short orbital periods ($\\approx50$ days), a lunar companion is only allowed if its mass remains below $\\approx 180~M_{\\oplus}$ ($0.6~M_{\\text{Jup}}$) at $3\\sigma$ confidence. At intermediate periods near 300 days, we exclude moons more massive than $\\approx 65~M_{\\oplus}$ ($0.2~M_{\\text{Jup}}$) at $3\\sigma$ confidence. At longer orbital periods, we place the tightest constraints, ruling out any potential exomoon above $\\approx 50~M_{\\oplus}$ ($0.15~M_{\\text{Jup}}$) at $700$ days and $\\approx 30~M_{\\oplus}$ ($0.1~M_{\\text{Jup}}$) at $1,100$ days (both at $3\\sigma$ confidence). These results place the first astrometric constraints on moons and binary planets in the $\\beta$ Pictoris system and demonstrate the sensitivity of interferometric observations for exomoon studies.",
      "pdf_url": "https://arxiv.org/pdf/2512.00160.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}