{
  "date": "2025-09-13",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.SR",
    "astro-ph.GA",
    "astro-ph.EP",
    "astro-ph.CO",
    "astro-ph.IM",
    "astro-ph.HE"
  ],
  "total_papers": 114,
  "gw_related_papers": 9,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2509.09086",
      "title": "Reionization optical depth and CMB-BAO tension in punctuated inflation",
      "authors": [
        "Zhiqi Huang"
      ],
      "abstract": "Reionization optical depth and CMB-BAO tension in punctuated inflation Zhiqi Huang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Within the standard six-parameter Lambda cold dark matter ($\\Lambda$CDM) model, a $2$-$3\\sigma$ tension persists between baryon acoustic oscillation (BAO) measurements from the Dark Energy Spectroscopic Instrument (DESI) and observations of the cosmic microwave background (CMB). Although this tension has often been interpreted as evidence for dynamical dark energy or a sum of neutrino masses below the established minimum, recent studies suggest it may instead originate from an underestimation of the reionization optical depth, particularly when inferred from large-scale CMB polarization. Jhaveri et al. propose that a suppression of large-scale primordial curvature power could partially cancel the contribution of $\\tau$ to the CMB low-$\\ell$ polarization power spectrum, leading to a biased low $\\tau$ measurement in standard analyses. In this work, we investigate whether punctuated inflation - which generates a suppression of primordial power on large scales through a transient fast-roll phase - can raise the inferred $\\tau$ value and thereby reconcile the consistency between CMB and BAO. For simple models with step-like features in the inflaton potential, we find that the constraint on $\\tau$ and the CMB-BAO tension remain nearly identical to those in the standard six-parameter $\\Lambda$CDM model. We provide a physical explanation for this negative result.",
      "pdf_url": "https://arxiv.org/pdf/2509.09086.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09161",
      "title": "Machine Learning Confirms GW231123 is a \"Lite\" Intermediate Mass Black Hole Merger",
      "authors": [
        "Chayan Chatterjee",
        "Kaylah McGowan",
        "Suyash Deshmukh",
        "Karan Jani"
      ],
      "abstract": "Machine Learning Confirms GW231123 is a \"Lite\" Intermediate Mass Black Hole Merger Chayan Chatterjee, Kaylah McGowan, Suyash Deshmukh, Karan Jani High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The LIGO-Virgo-KAGRA Collaboration recently reported GW231123, a black hole merger with total mass of around 190-265 solar mass. This event adds to the growing evidence of \"lite\" intermediate mass black hole (IMBH) discoveries of post-merger black holes >100 solar mass. GW231123 posed several data analysis challenges owing to waveform-model systematics and presence of noise artifacts called glitches. We present the first comprehensive machine learning analysis to further validate this event, strengthen its astrophysical inference, and characterize instrumental noise in its vicinity. Our approach uses a combination of tools tailored for specific analyses: GW-Whisper, an adaptation of OpenAI's audio transformer, ArchGEM, a Gaussian mixture model-based soft clustering and density approximation software and AWaRe, a convolutional autoencoder. We identify the data segment containing the merger with >70% confidence in both detectors and verify its astrophysical origin. We then characterize the scattered light glitch around the event, providing the first physically interpretable parameters for the glitch. We also reconstruct the real waveforms from the data with slightly better agreement to model-agnostic reconstructions than to quasi-circular models, hinting at possible astrophysics beyond current waveform families (such as non-circular orbits or environmental imprints). Finally, by demonstrating high-fidelity waveform reconstructions for simulated mergers with total masses between 100-1000 solar mass, we show that our method can confidently probe the IMBH regime. Our integrated framework offers a powerful complementary tool to traditional pipelines for rapid, robust analysis of massive, glitch-contaminated events.",
      "pdf_url": "https://arxiv.org/pdf/2509.09161.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.09202",
      "title": "Interacting k-essence field with non-pressureless Dark Matter: Cosmological Dynamics and Observational Constraints",
      "authors": [
        "Saddam Hussain",
        "Qiang Wu",
        "Tao Zhu"
      ],
      "abstract": "Interacting k-essence field with non-pressureless Dark Matter: Cosmological Dynamics and Observational Constraints Saddam Hussain, Qiang Wu, Tao Zhu Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate a class of interacting dark energy and dark matter (DM) models, where dark energy is modeled as a $k$-essence scalar field with an inverse-square potential. Two general forms of interaction are considered: one proportional to the Hubble parameter, and another independent of the Hubble parameter, depending instead on combinations of the energy densities and pressures of the dark sectors. The dynamics are analyzed using a dynamical system stability framework by constructing an autonomous system of equations. The models are tested against a wide range of observational datasets, including cosmic chronometers (CC), BAO measurements from DESI DR2, compressed Planck data (PLA), Pantheon+ (PP), DES supernovae, Big Bang Nucleosynthesis (BBN), and strong lensing data from H0LiCOW (HCW). The analysis shows that the models consistently reproduce all major cosmological epochs and yield statistically competitive results compared to the flat $\\Lambda$CDM model. The models exhibit stable late-time de-Sitter solutions, ensuring ghost-free evolution, with the Hubble constant in the range $H_0 \\sim 67$--$70$ km/s/Mpc.",
      "pdf_url": "https://arxiv.org/pdf/2509.09202.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09211",
      "title": "Brans-Dicke-like field for co-varying $G$ and $c$: observational constraints",
      "authors": [
        "J. Bezerra-Sobrinho",
        "R. R. Cuzinatto",
        "L. G. Medeiros",
        "P. J. Pompeia"
      ],
      "abstract": "Brans-Dicke-like field for co-varying $G$ and $c$: observational constraints J. Bezerra-Sobrinho, R. R. Cuzinatto, L. G. Medeiros, P. J. Pompeia 24 pages, 8 figures, 2 tables; submitted to the journal Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Ref. [Symmetry 15 (2023) 709] introduced a Brans-Dicke-like framework wherein the scalar field $\\phi$ is composed of both $G$ and $c$ which, for this reason, co-vary according to $c^{3}/G=\\text{constant}$. In this paper, we use observational data to constrain the supposed co-varying $G$ and $c$. The datasets include SN Ia, BAO and the value of $\\theta$ extracted from CMB data. A proxy function is demanded for the varying $c$ since the framework does not provide a closed set of equations for computing the functional form of either $G$ or $c$ uniquely. Accordingly, we choose three separate parameterizations for $c\\left(z\\right)$ inspired both by desirable properties of the varying speed of light (VSL) and by successful phenomenological models from the literature -- including the one by Gupta (CCC framework in e.g. Ref. [Mon. Not. R. Astron. Soc., 498 (2020) 4481-4491]. When combined with DESI, Pantheon+ data strongly favor a variable speed of light with more than $3\\sigma$ confidence level for all parameterizations considered in this paper, whereas Union2.1 suggests no variation of the speed of light. As we shall demonstrate, this apparent discrepancy is due to a strong correlation that emerges between $H_0$ and VSL.",
      "pdf_url": "https://arxiv.org/pdf/2509.09211.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09247",
      "title": "Investigating the cosmic distance duality relation with gamma-ray bursts",
      "authors": [
        "Anna Chiara Alfano",
        "Carlo Cafaro",
        "Salvatore Capozziello",
        "Orlando Luongo",
        "Marco Muccino"
      ],
      "abstract": "Investigating the cosmic distance duality relation with gamma-ray bursts Anna Chiara Alfano, Carlo Cafaro, Salvatore Capozziello, Orlando Luongo, Marco Muccino Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Deviations from the so-called {\\it cosmic distance duality relation} may result from systematic errors in distance measurements or, more interestingly, hint at new physics. Further, it can also be related to the Hubble constant tension between early and local measurements of $H_0$. Based on this, we test validity of this relation through a model-independent parameterization of the Hubble rate via the well-estabilished Bézier polynomials approach. We seek for possible departures from the relation considering three parametrizations, i) a power-law correction, ii) a logarithmic correction and iii) a Padé series $P_{n,m}(z)$ of order (1;2) with $n=1$ being the order of the numerator while $m=2$ is the order of the denominator. Then, assuming a flat scenario, we test them through Monte Carlo -- Markov chain analyses that combine low- and intermediate/high-$z$ data sets, such as observational Hubble data, the Pantheon catalog of type Ia supernovae, galaxy clusters, the second data release from the DESI Collaboration and gamma-ray bursts. In particular, we distinguish between \\emph{Analysis A} and \\emph{Analysis C}, depending whether the prompt emission $E_{iso}-E_p$ or the prompt-afterglow $L_0-E_p-T$ gamma-ray burst correlations, respectively, is fit together with the other probes previously described. Our results seem to point towards a \\emph{no violation} of the cosmic distance duality relation and a preference towards Planck's value of $H_0$.",
      "pdf_url": "https://arxiv.org/pdf/2509.09247.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09348",
      "title": "Towards systematic search for white dwarf binaries with multiband photometry",
      "authors": [
        "Alice Perego",
        "Astrid Lamberts",
        "Mathias Schultheis",
        "Nelson Christensen"
      ],
      "abstract": "Towards systematic search for white dwarf binaries with multiband photometry Alice Perego, Astrid Lamberts, Mathias Schultheis, Nelson Christensen High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Ultra-compact double white dwarfs (DWDs) represent key targets for multi-messenger astrophysics, as they may be observed both through gravitational waves and the electromagnetic (EM) spectrum. The future Laser Interferometer Space Antenna (LISA) will detect thousands of these systems, and they are predicted to be the most numerous science targets of the mission. We develop a strategy to identify LISA source candidates in multiband photometric surveys. We constructed a synthetic EM catalogue of white dwarf (WD) detections based on a population synthesis code combined with a semi-analytical model of the Milky Way and a consistent cooling model for the evolution. We compared sources in the LISA band with other WD observations in magnitude-colour and colour-colour plots. From a full sky survey with $u \\le$24.5, we find that 57$\\%$ of the sources in the LISA band occupy a specific region in colour-colour diagrams. Inside this area, we find that $\\sim 63\\%$ (6.5 $\\times 10^4$) of EM observations are LISA candidates, $\\sim 31\\%$ ($ 3.2 \\times 10^4$) are DWDs slightly outside the LISA frequency range, and only a small contamination comes from single WDs and wider binaries. We find that the colour distributions of close DWDs represent a powerful tool to distinguish potential LISA sources from the broader WD population. This is an avenue to select candidates for further follow-up and identification.",
      "pdf_url": "https://arxiv.org/pdf/2509.09348.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.09608",
      "title": "Trispectrum in Extended USR Model with Transition to SR",
      "authors": [
        "Hassan Firouzjahi",
        "Amin Nassiri-Rad"
      ],
      "abstract": "Trispectrum in Extended USR Model with Transition to SR Hassan Firouzjahi, Amin Nassiri-Rad Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We study the trispectrum in a two-phase USR-SR setup of inflation in which the USR stage is extended in the initial phase of inflation while the second stage of inflation proceeds via a slow-roll phase. A key role is played by the sharpness parameter which controls how quickly the system reaches the final attractor phase after the USR stage. We employ both $\\delta N$ and in-in formalisms and calculate trispectrum and the corresponding dimensionless parameters $g_{NL}$ and $\\tau_{NL}$. We show that both approaches yield the same results and study the shapes of trispectrum in various configurations. It is shown that the maximum value of trispectrum occurs in the setup with an infinitely sharp transition to the attractor phase while much of trispectrum is washed out in the opposite limit of a mild transition.",
      "pdf_url": "https://arxiv.org/pdf/2509.09608.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09632",
      "title": "Nonlinear Independent Component Analysis Scheme and its application to gravitational wave data analysis",
      "authors": [
        "Jun'ya Kume",
        "Koh Ueno",
        "Tatsuki Washimi",
        "Jun'ichi Yokoyama",
        "Takaaki Yokozawa",
        "Yousuke Itoh"
      ],
      "abstract": "Nonlinear Independent Component Analysis Scheme and its application to gravitational wave data analysis Jun'ya Kume, Koh Ueno, Tatsuki Washimi, Jun'ichi Yokoyama, Takaaki Yokozawa, Yousuke Itoh Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Noise subtraction is a crucial process in gravitational wave (GW) data analysis to improve the sensitivity of interferometric detectors. While linear noise coupling has been extensively studied and successfully mitigated using methods such as Wiener filtering, subtraction of non-linearly coupled and non-stationary noise remains a significant challenge. In this work, we propose a novel independent component analysis (ICA)-based framework designed to address non-linear coupling in noise subtraction. Building upon previous developments, we derive a method to estimate general quadratic noise coupling while maintaining computational transparency compared to machine learning approaches. The proposed method is tested with simulated data and real GW strain data from KAGRA. Our results demonstrate the potential of this framework to effectively mitigate complex noise structures, providing a promising avenue for improving the sensitivity of GW detectors.",
      "pdf_url": "https://arxiv.org/pdf/2509.09632.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.09647",
      "title": "Reconstructing the origin of black hole mergers using sparse astrophysical models",
      "authors": [
        "V. Gayathri",
        "Giuliano Iorio",
        "Hiromichi Tagawa",
        "Daniel Wysocki",
        "Jeremiah Anglin",
        "Imre Bartos",
        "Shubhagata Bhaumik",
        "Zolt'an Haiman",
        "Michela Mapelli",
        "R. O'Shaughnessy",
        "LingQin Xue"
      ],
      "abstract": "Reconstructing the origin of black hole mergers using sparse astrophysical models V. Gayathri, Giuliano Iorio, Hiromichi Tagawa, Daniel Wysocki, Jeremiah Anglin, Imre Bartos, Shubhagata Bhaumik, Zolt'an Haiman, Michela Mapelli, R. O'Shaughnessy, LingQin Xue High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The astrophysical origin of binary black hole mergers discovered by LIGO and Virgo remains uncertain. Efforts to reconstruct the processes that lead to mergers typically rely on either astrophysical models with fixed parameters, or continuous analytical models that can be fit to observations. Given the complexity of astrophysical formation mechanisms, these methods typically cannot fully take into account model uncertainties, nor can they fully capture the underlying processes. Here, we present a merger population analysis that can take a discrete set of simulated model distributions as its input to interpret observations. The analysis can take into account multiple formation scenarios as fractional contributors to the total set of observations, and can naturally account for model uncertainties. We apply this technique to investigate the origin of black hole mergers observed by LIGO Virgo. Specifically, we consider a model of AGN assisted black hole merger distributions, exploring a range of AGN parameters along with several {SEVN} population synthesis models that vary in common envelope efficiency parameter ($\\alpha$) and metallicity ($Z$). We estimate the posterior distributions for AGN+SEVN models using $87$ BBH detections from the $O1--O3$ observation runs. The inferred total merger rate is $46.2 {Gpc}^{-3} {yr}^{-1}$, with the AGN sub-population contributing $21.2{Gpc}^{-3}{yr}^{-1}$ and the SEVN sub-population contributing $25.0 {Gpc}^{-3} {yr}^{-1}$.",
      "pdf_url": "https://arxiv.org/pdf/2509.09647.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.06356",
      "title": "Measuring cosmic curvature with non-CMB observations",
      "authors": [
        "Peng-Ju Wu",
        "Xin Zhang"
      ],
      "abstract": "Measuring cosmic curvature with non-CMB observations Peng-Ju Wu, Xin Zhang Physical Review D 112, 063514 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The cosmic curvature $\\Omega_{K}$ is an important parameter related to the inflationary cosmology and the ultimate fate of the universe. In this work, we adopt the non-CMB observations to constrain $\\Omega_{K}$ in the $\\Lambda$CDM model and its extensions. The DESI baryon acoustic oscillation, DES type Ia supernova, cosmic chronometer, and strong gravitational lensing time delay data are considered. We find that the data combination favors an open universe in the $\\Lambda$CDM model, specifically $\\Omega_{K}=0.108\\pm0.056$ at the $1\\sigma$ confidence level, which is in $2.6\\sigma$ tension with the Planck CMB result supporting our universe being slightly closed. In the $\\Lambda$CDM extensions, the data combination is consistent with a spatially flat universe. However, the central value of $\\Omega_{K}$ is positive and has a significant deviation from zero. We adopt the Akaike information criterion to compare different cosmological models. The result shows that non-flat models fit the observational data better than the flat $\\Lambda$CDM model, which adds evidence to the argument that flat $\\Lambda$CDM is not the ultimate model of cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2411.06356.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.19631",
      "title": "Primordial Black Hole Formation from the Upward Step Model: Avoiding Overproduction",
      "authors": [
        "Xiaoding Wang",
        "Xiao-Han Ma",
        "Yi-Fu Cai"
      ],
      "abstract": "Primordial Black Hole Formation from the Upward Step Model: Avoiding Overproduction Xiaoding Wang, Xiao-Han Ma, Yi-Fu Cai Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate the formation of primordial black holes (PBHs) in an upward step inflationary model, where nonlinearities between curvature perturbations and field fluctuations introduce a cutoff, deviating from the Gaussian case. This necessitates a reevaluation of PBH formation, as $\\mathcal{R}$ is not the optimal variable for estimating abundance. Using the extended Press-Schechter formalism, we show that non-Gaussianity modifies both the curvature perturbation profile $\\mathcal{R}(r)$ and the integration path in probability space, significantly impacting PBH abundance. Our results reveal that the abundance initially increases with the parameter $h$, which characterizes the relaxation stage after the step. However, beyond a critical value ($h \\simeq 5.9$), it sharply declines before rising again. Furthermore, we demonstrate that non-Gaussianity introduces uncertainties in indirect PBH observations via gravitational waves. Notably, we present an example where a positive $f_{\\rm NL}$ does not necessarily enhance PBH production, contrary to conventional expectations. Finally, by accounting for non-perturbative effects, we resolve the overproduction of PBHs suggested by pulsar timing array (PTA) data, underscoring the critical importance of incorporating non-Gaussianity in future studies.",
      "pdf_url": "https://arxiv.org/pdf/2412.19631.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.16820",
      "title": "Isotropy, anisotropies and non-Gaussianity in the scalar-induced gravitational-wave background: diagrammatic approach for primordial non-Gaussianity up to arbitrary order",
      "authors": [
        "Jun-Peng Li",
        "Sai Wang",
        "Zhi-Chao Zhao",
        "Kazunori Kohri"
      ],
      "abstract": "Isotropy, anisotropies and non-Gaussianity in the scalar-induced gravitational-wave background: diagrammatic approach for primordial non-Gaussianity up to arbitrary order Jun-Peng Li, Sai Wang, Zhi-Chao Zhao, Kazunori Kohri 107 pages, 36 figures. Version 2: Added discussions on the infrared scaling of the SIGW energy-density spectra in Section 6 and the Appendix. Corrected the calculation of PBH abundance in Section 6. Corrected some typos and included several new references Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Produced nonlinearly by the enhanced linear cosmological curvature perturbations, the scalar-induced gravitational waves (SIGWs) can serve as a potentially powerful probe of primordial non-Gaussianity (PNG) in the early Universe. In this work, we comprehensively investigate the imprints of local-type PNG on the SIGW background beyond the widely used quadratic and cubic approximations. We develop a diagrammatic approach capable of analyzing SIGWs for PNG up to arbitrary order. Following this approach, we derive semi-analytic formulas for the energy-density fraction spectrum, the angular power spectrum, and the angular bispectrum and trispectrum to describe the isotropic component, anisotropies, and non-Gaussianity of the SIGW background, respectively. Particularly, focusing on PNG up to quartic approximation (parameterized by $f_\\mathrm{NL}$, $g_\\mathrm{NL}$, and $h_\\mathrm{NL}$), we numerically compute all contributions to these SIGW spectra. We find that PNG can significantly alter the magnitude of the SIGW energy-density spectrum, and can generate substantial anisotropies through the initial inhomogeneities in the SIGW distribution. Furthermore, we observe that the SIGW angular bispectrum and trispectrum always vanish when the primordial curvature perturbations are Gaussian; otherwise, they do not, indicating their potential utility as probes of PNG. Therefore, we anticipate that the SIGW background will provide essential information about the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2505.16820.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.10981",
      "title": "Towards high-precision inspiral gravitational waveforms from binary neutron star mergers in numerical relativity",
      "authors": [
        "Kenta Kiuchi"
      ],
      "abstract": "Towards high-precision inspiral gravitational waveforms from binary neutron star mergers in numerical relativity Kenta Kiuchi 14 pages, 8 figures, PRD accepted High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We report the performance of a newly implemented fourth-order accurate finite-volume HLLC Riemann solver in the adaptive-mesh-refinement numerical relativity code {\\tt SACRA-MPI}. First, we validate our implementation in one-dimensional special relativistic hydrodynamics tests, i.e., a simple wave and shock tube test, which have analytic solutions. We demonstrate that the fourth-order convergence is achieved for the smooth flow, which cannot be achieved in our original second-order accurate finite-volume Riemann solver. We also show that our new solver is robust for the strong shock wave emergence problem. Second, we validate the implementation in a dynamical spacetime by demonstrating that {\\tt SACRA-MPI} perfectly preserves the $\\pi$-symmetry without imposing the $\\pi$-symmetry in a short-term ($\\sim 20~{\\rm ms}$ in the inspiral and subsequent post-merger phase) non-spinning equal-mass binary neutron star merger simulations. Finally, we quantify the accuracy of $\\approx 28$ cycles inspiral gravitational waveforms from binary neutron star mergers by conducting a resolution study with $\\approx 78, 94$, $118$, and $135$ m. We find that the fourth-order accurate Riemann solver achieves the convergence order $\\approx 2.1\\pm{0.05}$--$2.4\\pm{0.27}$, i.e., slightly evolving with time, in the inspiral gravitational wave phase, while the second-order accurate Riemann solver achieves the convergence order $\\approx 2.0\\pm{0.5}$. The residual phase error towards the continuum limit at the merger is $0.27\\pm 0.07$ rad and $0.58\\pm 0.22$ rad out of a total phase of $\\approx 176$ rad, respectively, for the fourth- and second-order accurate Riemann solver.",
      "pdf_url": "https://arxiv.org/pdf/2508.10981.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.08674",
      "title": "Analytic and Numerical Constraints on QPOs in EHT and XRB Sources Using Quantum-Corrected Black Holes",
      "authors": [
        "Ahmad Al-Badawi",
        "Faizuddin Ahmed",
        "Orhan Donmez",
        "Fatih Dogan",
        "Behnam Pourhassan",
        "İzzet Sakallı",
        "Yassine Sekhmani"
      ],
      "abstract": "Analytic and Numerical Constraints on QPOs in EHT and XRB Sources Using Quantum-Corrected Black Holes Ahmad Al-Badawi, Faizuddin Ahmed, Orhan Donmez, Fatih Dogan, Behnam Pourhassan, İzzet Sakallı, Yassine Sekhmani 42 pagaes, 20 figures, 2 tables. Title is updated and minor typos have been corrected. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) This investigation examines QPOs in two quantum-corrected BH spacetimes that preserve general covariance while incorporating quantum gravitational effects through a dimensionless parameter \\zeta. We combine analytical derivations of epicyclic frequencies with comprehensive numerical simulations of BHL accretion to explore how quantum corrections manifest in observable astrophysical phenomena. Using a fiducial BH mass of M=10M_\\odot representative of stellar-mass X-ray binaries, we demonstrate that the two models exhibit fundamentally different behaviors: Model-I modifies both temporal and radial metric components, leading to innermost stable circular orbit migration proportional to \\zeta^4 and dramatic stagnation point evolution from 27M to 5M as quantum corrections strengthen. Model-II preserves the classical temporal component while altering only spatial geometry, maintaining constant stagnation points and stable cavity structures throughout the parameter range. Our numerical simulations reveal distinct QPO generation mechanisms, with Model-I showing systematic frequency evolution and cavity shrinkage that suppresses oscillations for \\zeta \\geq 3M, while Model-II maintains stable low-frequency modes up to \\zeta \\geq 5M. Power spectral density analyzes demonstrate characteristic frequency ratios (3:2, 2:1, 5:3) consistent with observations from X-ray binaries, providing specific targets for discriminating between quantum correction scenarios. The hydrodynamically derived constraints (\\zeta \\lesssim 4M) show remarkable agreement with independent EHT limits for M87* and Sgr A*, validating our theoretical framework through multiple observational channels. These results establish QPO frequency analysis as a probe for detecting quantum gravitational effects in astrophysical BHs and demonstrate the complementary nature of timing and imaging observations in constraining fundamental physics.",
      "pdf_url": "https://arxiv.org/pdf/2509.08674.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08884",
      "title": "On the extraction of Alcock-Paczynski signal from voids: a novel approach via reconstruction",
      "authors": [
        "G. Degni",
        "E. Sarpa",
        "M. Aubert",
        "E. Branchini",
        "A. Pisani",
        "H.M. Courtois"
      ],
      "abstract": "On the extraction of Alcock-Paczynski signal from voids: a novel approach via reconstruction G. Degni, E. Sarpa, M. Aubert, E. Branchini, A. Pisani, H.M. Courtois Cosmology and Nongalactic Astrophysics (astro-ph.CO) The void galaxy cross correlation function is a powerful tool to extract cosmological information. Through the void galaxy cross correlation function, cosmic voids, the underdense regions in the galaxy distribution, are used for refined deductions of the Universe's content by correcting apparent geometric distortions. This study proposes a novel procedure for optimally extracting the Alcock Paczynski, AP, signal from cosmic voids through a cosmological reconstruction technique. Employing cosmological reconstruction, specifically using the Zel'dovich approximation, we estimate the true positions of galaxies from their redshift space locations, reducing distortions introduced by peculiar velocities. Unlike previous analyses, we identify voids and measure the void galaxy cross correlation function directly in reconstructed space. This approach enables us, for the first time, to include in our analysis small nonlinear voids, typically discarded in previous studies, thus enhancing the statistical power of void studies and significantly improving their cosmological constraining power. Reconstruction is particularly effective even at small scales for voids, due to their clean and dynamically simple environment. This ability to recover information encoded on small scales significantly enhances the precision of the analysis, leading to a 23 % improvement in the constraints on the AP parameters compared to previous methods where the analysis is performed in redshift space and, consequently, to a better estimate of the derived cosmological parameters. Our analysis also includes a comprehensive set of consistency checks, demonstrating its robustness. We expect this methodology to yield a substantial gain in constraining power when applied to data from modern large scale structure surveys.",
      "pdf_url": "https://arxiv.org/pdf/2509.08884.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08886",
      "title": "A New Boundary Condition on Reionization",
      "authors": [
        "Sarah Libanore",
        "Ely D. Kovetz",
        "Julian B. Munoz",
        "Yonatan Sklansky",
        "Emilie Thélie"
      ],
      "abstract": "A New Boundary Condition on Reionization Sarah Libanore, Ely D. Kovetz, Julian B. Munoz, Yonatan Sklansky, Emilie Thélie 7 pages, 3 figures. Letter prepared for submission in PRL. Comments are welcomed! Cosmology and Nongalactic Astrophysics (astro-ph.CO) The epoch of reionization (EoR) marks the last phase transition of hydrogen in our Universe, as it evolves from cold and neutral to hot and ionized in the intergalactic medium (IGM). While its endpoint and duration can be estimated from current observations, albeit with large uncertainties, there is no known avenue to constrain its onset. We propose a novel method based on the Pearson cross-correlation coefficient between 21-cm brightness temperature maps and line-intensity maps tracing star-formation (e.g., OIII, CO, CII). This real-space estimator evolves from negative to positive as X-ray heating progresses, and saturates prior to the EoR. We predict a sharp turnover from saturation during the earliest EoR stages, when the IGM ionized fraction reaches $\\bar{x}_{\\rm HII}\\sim 1\\%-10\\%$. We show that in standard scenarios, where the IGM heating precedes reionization, the turnover is a clear, model-robust signature. Its detection will provide a unique observational anchor for the EoR onset, complementing existing probes and tightening constraints on early galaxy formation models.",
      "pdf_url": "https://arxiv.org/pdf/2509.08886.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08983",
      "title": "On the Reliability of Quasars as Cosmological Distance Indicators",
      "authors": [
        "Ariadna Montiel",
        "Sofia Samario-Nava",
        "Juan Carlos Hidalgo",
        "Jose Ignacio Cabrera"
      ],
      "abstract": "On the Reliability of Quasars as Cosmological Distance Indicators Ariadna Montiel, Sofia Samario-Nava, Juan Carlos Hidalgo, Jose Ignacio Cabrera 9 pages, 8 tables, 2 figures. Comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) The goal of the present paper is to assess the usefulness of quasars as cosmological distance indicators. We calibrate, in a model-independent way, the non-linear relation between X-ray and UV emission to derive quasar luminosity distances. Using this calibration, we construct the Hubble diagram up to redshift $z \\sim 7.5$, and test the ability of quasars to constrain the $\\Lambda$CDM and $\\omega$CDM models at low and high redshifts, in combination with the Type Ia supernova Pantheon Plus sample, as well as the latest results from DESI and Planck Compressed data. We find consistency with previous studies in the values of $\\gamma$ and $\\beta$ when using a quasar subsample with $z<1.43$. However, when the data is used to constrain the cosmological models, we find that quasars fail as reliable distance indicators, even when combined with other independent cosmological datasets.",
      "pdf_url": "https://arxiv.org/pdf/2509.08983.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09034",
      "title": "On the True Significance of the Hubble Tension: A Bayesian Error Decomposition Accounting for Information Loss",
      "authors": [
        "Nathalia M. N. da Rocha",
        "Andre L. B. Ribeiro",
        "Francisco B. S. Oliveira"
      ],
      "abstract": "On the True Significance of the Hubble Tension: A Bayesian Error Decomposition Accounting for Information Loss Nathalia M. N. da Rocha, Andre L. B. Ribeiro, Francisco B. S. Oliveira This is the accepted version of the paper Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Hubble tension, a persistent discrepancy between early and late Universe measurements of $H_0$, poses a significant challenge to the standard cosmological model. In this work, we present a new Bayesian hierarchical framework designed to meticulously decompose this observed tension into its constituent parts: standard measurement errors, information loss arising from parameter-space projection, and genuine physical tension. Our approach, employing Fisher matrix analysis with MCMC-estimated loss coefficients and explicitly modeling information loss via variance inflation factors ($\\lambda$), is particularly important in high-precision analysis where even seemingly small information losses can impact conclusions. We find that the real tension component ($T_{real}$) has a mean value of 5.94 km/s/Mpc (95\\% CI: [3.32, 8.64] km/s/Mpc). Quantitatively, approximately 78\\% of the observed tension variance is attributed to real tension, 13\\% to measurement error, and 9\\% to information loss. Despite this, our decomposition indicates that the observed $\\sim$$6.39\\sigma$ discrepancy is predominantly a real physical phenomenon, with real tension contributing $\\sim$$5.64\\sigma$. Our findings strongly suggest that the Hubble tension is robust and probably points toward new physics beyond the $\\Lambda$CDM model.",
      "pdf_url": "https://arxiv.org/pdf/2509.09034.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09395",
      "title": "Quantum Markov Chain Monte Carlo for Cosmological Functions",
      "authors": [
        "Giuseppe Sarracino",
        "Vincenzo Fabrizio Cardone",
        "Roberto Scaramella",
        "Giuseppe Riccio",
        "Andrea Bulgarelli",
        "Carlo Burigana",
        "Luca Cappelli",
        "Stefano Cavuoti",
        "Farida Farsian",
        "Irene Graziotti",
        "Massimo Meneghetti",
        "Giuseppe Murante",
        "Nicolò Parmiggiani",
        "Alessandro Rizzo",
        "Francesco Schillirò",
        "Vincenzo Testa",
        "Tiziana Trombetti"
      ],
      "abstract": "Quantum Markov Chain Monte Carlo for Cosmological Functions Giuseppe Sarracino, Vincenzo Fabrizio Cardone, Roberto Scaramella, Giuseppe Riccio, Andrea Bulgarelli, Carlo Burigana, Luca Cappelli, Stefano Cavuoti, Farida Farsian, Irene Graziotti, Massimo Meneghetti, Giuseppe Murante, Nicolò Parmiggiani, Alessandro Rizzo, Francesco Schillirò, Vincenzo Testa, Tiziana Trombetti 7 pages, 3 figures, Accepted as a Conference Paper for QAI2025, Naples Cosmology and Nongalactic Astrophysics (astro-ph.CO); Quantum Physics (quant-ph) We present an implementation of Quantum Computing for a Markov Chain Monte Carlo method with an application to cosmological functions, to derive posterior distributions from cosmological probes. The algorithm proposes new steps in the parameter space via a quantum circuit whose resulting statevector provides the components of the shift vector. The proposed point is accepted or rejected via the classical Metropolis-Hastings acceptance method. The advantage of this hybrid quantum approach is that the step size and direction change in a way independent of the evolution of the chain, thus ideally avoiding the presence of local minima. The results are consistent with analyses performed with classical methods, both for a test function and real cosmological data. The final goal is to generalize this algorithm to test its application to complex cosmological computations.",
      "pdf_url": "https://arxiv.org/pdf/2509.09395.pdf",
      "categories": [
        "astro-ph.CO",
        "quant-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09472",
      "title": "Axion-Photon Conversion in FLRW with Primordial Magnetic Fields: Explaining the Radio Excess",
      "authors": [
        "Setabuddin",
        "Md Riajul Haque",
        "Rajesh Karmakar",
        "Supratik Pal"
      ],
      "abstract": "Axion-Photon Conversion in FLRW with Primordial Magnetic Fields: Explaining the Radio Excess Setabuddin, Md Riajul Haque, Rajesh Karmakar, Supratik Pal 32 pages, 8 figures, 1 table. Comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We explore the possibility of axion-photon conversion as a common origin of two low-frequency anomalies: the isotropic radio excess (ARCADE2) and the deep global 21-cm absorption trough (EDGES). From the axion-photon action in an FLRW background with primordial magnetic fields (PMFs), we derive the scale-dependent conversion probability including plasma effects. Resonant conversion, arising when the axion mass matches the plasma-induced photon mass, produces soft photons in the MHz-GHz range. By modeling stochastic PMFs with amplitude $B_0$ and spectral index $n_{\\rm B}$, we show that axion-like particles with mass $\\sim 10^{-14}$-$10^{-12}\\,\\mathrm{eV}$ and nanogauss-level nearly scale invariant PMFs can explain both ARCADE2 and EDGES. Heating from PMF dissipation via ambipolar diffusion and turbulent decay reduces the 21-cm trough, shifting the viable parameter space. Our results stem from a consistent theoretical framework developed from first principles and a combined analysis of the radio excess and global 21-cm signal, while remaining consistent with CMB bounds on PMFs and $\\Delta N_{\\rm eff}$. We conclude that global 21-cm observations may offer potential sensitivity to axions, primordial magnetism, and dark-sector physics.",
      "pdf_url": "https://arxiv.org/pdf/2509.09472.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09562",
      "title": "The simple way to measure evolving dark energy without prior-volume effects",
      "authors": [
        "Maria Tsedrik",
        "Pedro Carrilho",
        "Chiara Moretti"
      ],
      "abstract": "The simple way to measure evolving dark energy without prior-volume effects Maria Tsedrik, Pedro Carrilho, Chiara Moretti Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a simple yet effective method to resolve prior-volume effects, also known as projection effects, in full-shape analyses of the power spectrum multipoles within the Effective Field Theory of Large-Scale Structure (EFTofLSS). By re-defining the EFTofLSS nuisance parameters to incorporate the contribution from the parameters impacting the amplitude of the EFTofLSS modelling components, we substantially mitigate projection effects. With the re-parametrisation the actual posterior maximum values are within the marginalised credible interval, eliminating significant shifts observed in the baseline analysis. We demonstrate the robustness of this method in full-shape $w_0w_a$CDM analyses on synthetic data in BOSS DR12 and DESI DR1 setups. For the evolving dark energy model, we then analyse the BOSS DR12 measurements, in combination with BAO information (from BOSS DR12, 6DF, SDSS DR7 MGS and eBOSS DR16 surveys) and 3$\\times$2pt measurements from DES Y3 -- all data combinations are converging into the $w_0-w_a$ parameter region preferred by DESI+CMB+SNIa. From total combination of these large-scale structure probes without additional CMB information we find $w_0=-0.72 \\pm 0.21, \\, w_a=-0.91^{+0.78}_{-0.64}$. Despite the low significance of deviation from standard cosmology, this result underscores the potential of our re-parametrisation approach in delivering low-redshift cosmological constraints. We argue for the use of this approach in spectroscopic Stage IV surveys, where the potential deviation from standard cosmology can be detected with higher significance.",
      "pdf_url": "https://arxiv.org/pdf/2509.09562.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09665",
      "title": "1.8 per cent measurement of $H_0$ from Cepheids alone",
      "authors": [
        "Richard Stiskalek",
        "Harry Desmond",
        "Eleni Tsaprazi",
        "Alan Heavens",
        "Guilhem Lavaux",
        "Stuart McAlpine",
        "Jens Jasche"
      ],
      "abstract": "1.8 per cent measurement of $H_0$ from Cepheids alone Richard Stiskalek, Harry Desmond, Eleni Tsaprazi, Alan Heavens, Guilhem Lavaux, Stuart McAlpine, Jens Jasche 24 pages, 12 figures. To be submitted to MNRAS. Comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) One of the most pressing problems in current cosmology is the cause of the Hubble tension. We revisit a two-rung distance ladder, composed only of Cepheid periods and magnitudes, anchor distances in the Milky Way, Large Magellanic Cloud, NGC 4258, and host galaxy redshifts. We adopt the SH0ES data for the most up-to-date and carefully vetted measurements, where the Cepheid hosts were selected to harbour also Type Ia supernovae. We introduce two important improvements: a rigorous selection modelling and a state-of-the-art density and peculiar velocity model using Manticore-Local, based on the Bayesian Origin Reconstruction from Galaxies (BORG) algorithm. We infer $H_0 = 71.7 \\pm 1.3\\,\\mathrm{km}\\,\\mathrm{s}^{-1}\\,\\mathrm{Mpc}^{-1}$, assuming the Cepheid host sample was selected by estimated supernova magnitudes. Less plausible selection criteria shift $H_0$ by about one standard deviation. The posterior has a lower central value and a 45 per cent smaller error than a previous study using the same data. The result is also slightly lower than the supernova-based SH0ES inferred value of $H_0 = 73.2 \\pm 0.9\\,\\mathrm{km}\\,\\mathrm{s}^{-1}\\,\\mathrm{Mpc}^{-1}$, and is in $3.3\\sigma$ tension with the latest standard cosmological model microwave background results. These results demonstrate that a measurement of $H_0$ of sufficient precision to weigh in on the Hubble tension is achievable using second-rung data alone, underscoring the importance of robust and accurate statistical modelling.",
      "pdf_url": "https://arxiv.org/pdf/2509.09665.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09673",
      "title": "Cosmology inference with perturbative forward modeling at the field level: a comparison with joint power spectrum and bispectrum analyses",
      "authors": [
        "Kazuyuki Akitsu",
        "Marko Simonović",
        "Shi-Fan Chen",
        "Giovanni Cabass",
        "Matias Zaldarriaga"
      ],
      "abstract": "Cosmology inference with perturbative forward modeling at the field level: a comparison with joint power spectrum and bispectrum analyses Kazuyuki Akitsu, Marko Simonović, Shi-Fan Chen, Giovanni Cabass, Matias Zaldarriaga 50 pages, 27 figues, the code available at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) We extend field-level inference to jointly constrain the cosmological parameters $\\{A,\\omega_{\\rm cdm},H_0\\}$, in both real and redshift space. Our analyses are based on mock data generated using a perturbative forward model, with noise drawn from a Gaussian distribution with a constant power spectrum. This idealized setting, where the field-level likelihood is exactly Gaussian, allows us to precisely quantify the information content in the nonlinear field on large scales. We find that field-level inference accurately recovers all cosmological parameters in both real and redshift space, with uncertainties consistent with perturbation theory expectations. We show that these error bars are comparable to those obtained from a joint power spectrum and bispectrum analysis using the same perturbative model. Finally, we perform several tests using the Gaussian field-level likelihood to fit the mock data where the true noise model is non-Gaussian, and find significant biases in the inferred cosmological parameters. These results highlight that the success of field-level inference critically depends on using the correct likelihood, which may be the primary challenge for applying this method to smaller scales even in the perturbative regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.09673.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09678",
      "title": "Cosmic $τ$ensions Indirectly Correlate with Reionization Optical Depth",
      "authors": [
        "Itamar J. Allali",
        "Lingfeng Li",
        "Praniti Singh",
        "JiJi Fan"
      ],
      "abstract": "Cosmic $τ$ensions Indirectly Correlate with Reionization Optical Depth Itamar J. Allali, Lingfeng Li, Praniti Singh, JiJi Fan 19 pages, 12 figures, 4 tables, plus appendices Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The reionization optical depth $\\tau_{\\rm reio}$ has interesting connections to existing cosmological anomalies. As first studied in the context of the Hubble tension in our previous paper, a larger $\\tau_{\\rm reio}$, which could be achieved by removing the Planck low-$\\ell$ polarization data, could boost $H_0$ slightly, resulting in a mild reduction of the tension between the early- and late-universe determinations of $H_0$. It has been shown later that a larger $\\tau_{\\rm reio}$ could also relieve other anomalies including: the tension between BAO and CMB data, the neutrino mass tension, and the latest DESI plus supernovae data's tension with the standard cosmological constant scenario. In this paper, we systematically analyze the correlations between $\\tau_{\\rm reio}$ and relevant cosmological parameters in the existing cosmic observation anomalies. In addition to Pearson correlation coefficients extracted directly from the covariance matrix, we also study partial correlation coefficients which measure intrinsic relationships between pairs of parameters removing the influence of other parameters. We show that $\\tau_{\\rm reio}$ has weak intrinsic correlations with the parameters responsible for the tensions and anomalies discussed. The large direct Pearson correlations that allow larger $\\tau_{\\rm reio}$ inferences to alleviate the cosmological tensions each arise from complicated networks through multiple parameters. As a result, the relationships between $\\tau_{\\rm reio}$ and each anomaly are not independent of each other. We also employ our method of computing correlations to clarify the impact of large scale polarization data, and comment also on the effects of CMB observations from ACT and SPT.",
      "pdf_url": "https://arxiv.org/pdf/2509.09678.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08896",
      "title": "Magnetic fields in galactic environments probed by Fast Radio Bursts",
      "authors": [
        "Ilya S. Khrykin",
        "Nicolas Tejos",
        "J. Xavier Prochaska",
        "Alexandra Mannings",
        "Lluis Mas-Ribas",
        "Kentaro Nagamine",
        "Khee-Gan Lee",
        "Bryan Gaensler",
        "Zhao Joseph Zhang",
        "Lucas Bernales-Cortes"
      ],
      "abstract": "Magnetic fields in galactic environments probed by Fast Radio Bursts Ilya S. Khrykin, Nicolas Tejos, J. Xavier Prochaska, Alexandra Mannings, Lluis Mas-Ribas, Kentaro Nagamine, Khee-Gan Lee, Bryan Gaensler, Zhao Joseph Zhang, Lucas Bernales-Cortes 13 pages, 8 figures, submitted to A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) FRBs constitute a unique probe of various astrophysical and cosmological environments via their characteristic dispersion and rotation (RM) measures that encode information about the ionized gas traversed by the FRB sightlines. In this work, we analyse observed RM measured for 14 localized FRBs at $0.05 \\lesssim z \\lesssim 0.5$, to infer total magnetic fields in various galactic environments. Additionally, we calculate $f_{\\rm gas}$ - the average fraction of halo baryons in the ionized CGM. We build a spectroscopic dataset of FRB foreground galaxy halos, acquired with VLT/MUSE and FLIMFLAM survey. We develop a novel Bayesian algorithm and use it to correlate the individual intervening halos with the observed RM. This approach allows us to disentangle the magnetic fields present in various environments traversed by the FRB. Our analysis yields the first direct FRB constraints on the strength of magnetic fields in the ISM and halos of the FRB host galaxies, as well as in halos of foreground galaxies. We find that the average magnetic field in the ISM of FRB hosts is $B_{\\rm host}^{\\rm local} = 5.44^{+1.13}_{-0.87}\\mu{\\rm G}$. Additionally, we place upper limits on average magnetic field in FRB host halos, $B_{\\rm host}^{\\rm halo} < 4.81\\mu{\\rm G}$, and in foreground intervening halos, $B_{\\rm f/g}^{\\rm halo} < 4.31\\mu{\\rm G}$. Moreover, we estimate the average fraction of cosmic baryons inside $10 \\lesssim \\log_{10} \\left( M_{\\rm halo} / M_{\\odot}\\right) \\lesssim 13.1$ halos $f_{\\rm gas} = 0.45^{+0.21}_{-0.19}$. We find that the magnetic fields inferred in this work are in good agreement with previous measurements. In contrast to previous studies that analysed FRB RMs and have not considered contributions from the halos of the foreground and/or FRB host galaxies, we show that they can contribute a non-negligible amount of RM and must be taken into account when analysing future FRB samples.",
      "pdf_url": "https://arxiv.org/pdf/2509.08896.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09012",
      "title": "Decays and annihilation of galactic dark matter: determine $D$-, $J_s$-, $J_p$- and $J_d$-factors with dark matter profiles inferred from GravSphere fit to stellar observations",
      "authors": [
        "Fedor Bezrukov",
        "Dmitry Gorbunov",
        "Ekaterina Koreshkova"
      ],
      "abstract": "Decays and annihilation of galactic dark matter: determine $D$-, $J_s$-, $J_p$- and $J_d$-factors with dark matter profiles inferred from GravSphere fit to stellar observations Fedor Bezrukov, Dmitry Gorbunov, Ekaterina Koreshkova 13 pages, 5 figures. Prepared for Physics Letters B Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Dark matter mass density profiles and velocity distributions for a set of dwarf spheroidal galaxies (dSphs) have recently been obtained (this http URL, this http URL, this http URL arXiv:2412.20585) by performing a multi-parametric fit to the stellar observations with the help of the GravSphere which solves the Jeans equation. We use these results to calculate the geometrical factors for estimation of the fluxes of cosmic rays expected from decay ($D$-factor) and annihilation ($J_s$-, $J_p$- and $J_d$-factors for $s$-, $p$- and $d$- wave processes) of dark matter particles in galaxies. The general novelty is the account for a possible anisotropy in velocities of dark matter particles. On the basis of this analysis we present empirical scaling approximations to these factors as functions of typical observables: distance to the galaxy $d$, it's half-radius $r_h$ and line-of-sight stellar velocity dispersion $\\sigma_{LOS}$. They can be applied to any galaxy, and for $D$- and $J_s$-factors we refine the estimates of (Andrew B. Pace, Louis E. Strigari arXiv:1802.06811): the shifts in the central values remain within 1-2$\\sigma$ error bars.",
      "pdf_url": "https://arxiv.org/pdf/2509.09012.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09069",
      "title": "Testing the effect of progenitor's metallicity on $^{56}$Ni mass and constraining the progenitor scenarios in Type Ia supernovae",
      "authors": [
        "Young-Lo Kim",
        "Chul Chung",
        "Yong -Cheol Kim"
      ],
      "abstract": "Testing the effect of progenitor's metallicity on $^{56}$Ni mass and constraining the progenitor scenarios in Type Ia supernovae Young-Lo Kim, Chul Chung, Yong -Cheol Kim 11 pages including 1 page of Appendix, 4 figures + 1 App figure, and 3 tables; A&A accepted (shortened the abstract to fit here) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The analytical model found that the intrinsic variation in the initial metallicity of the Type Ia supernova (SN Ia) progenitor stars ($Z_{progenitor}$) translates into a 25% variation in the $^{56}$Ni mass synthesized and, therefore, 0.2 mag difference in the observed peak luminosity of SNe Ia. Previous observational studies used the currently-observed global gas-phase metallicity of host galaxies, instead of $Z_{progenitor}$ used in the model, and showed a higher scatter in the $^{56}$Ni mass measurements compared to the model prediction. Here, we use $Z_{progenitor}$ of 34 normal SNe Ia and employ recent SN Ia explosion models with various configurations to cover the observed $^{56}$Ni mass range. Unlike previous studies, our sample covers the $Z_{progenitor}$ range, where most of the $Z_{progenitor}$ effect occurs. Linear regression returns a slope of 0.02+-0.03, which is the opposite trend to the analytical model, but at at low statistical significance level. We find that comparing our sample with SN Ia explosion models on the $Z_{progenitor}$--$^{56}$Ni mass diagram allows us to constrain the progenitor scenarios. We also explore other chemical composition indicators. For $(Fe/H)_{progenitor}$, our sample follows the trend predicted by the analytical models, but at a low significance level. Noticeably, $(\\alpha/Fe)_{progenitor}$ shows the opposite trend and a clear gap. When we split the sample at $(\\alpha/Fe)_{progenitor}$ = 0.35 $(\\alpha/Fe)_{\\odot}$, we find a 3$\\sigma$ difference in the weighted-means of the $^{56}$Ni mass. Lastly, SNe Ia in different $Z_{progenitor}$ groups show a difference of 0.14+-0.09 mag in the standardized luminosity. The present work highlights a holistic approach (from the progenitor star to the explosion with SN Ia and host galaxy observational data) to understand the underlying physics of SNe Ia for more accurate and precise cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2509.09069.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09123",
      "title": "Binary Black Hole Phase Space Discovers the Signature of Pair Instability Supernovae Mass Gap",
      "authors": [
        "Samsuzzaman Afroz",
        "Suvodip Mukherjee"
      ],
      "abstract": "Binary Black Hole Phase Space Discovers the Signature of Pair Instability Supernovae Mass Gap Samsuzzaman Afroz, Suvodip Mukherjee High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The rapidly expanding catalog of gravitational-wave detections provides a powerful probe of the formation history of compact binaries across cosmic time. In this work, we extend the Binary Compact Object (BCO) phase-space framework to the full set of events in the GWTC-4 catalog to map the observed binary formation scenarios in a data-driven way. Applying this framework, we identify distinct regions of phase-space associated with different channels and discover for the first time a unique mass-cutoff scale in a data-driven way. The mapping of these on different formation channels reveals a population of first-generation (1G) black holes sharply truncated at approximately 45.5 $M_\\odot$, consistent with the theoretically predicted pair-instability supernova (PISN) mass gap. These findings demonstrate the capability of the BCO phase-space to disentangle overlapping formation pathways, establish robust connections between gravitational-wave observations and binary evolution, and highlight the potential of upcoming observing runs to reveal rare populations and exotic origins.",
      "pdf_url": "https://arxiv.org/pdf/2509.09123.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.09293",
      "title": "The superMIGHTEE project: MeerKAT and GMRT Together to Unveil the Deep Radio Sky",
      "authors": [
        "Dharam V. Lal",
        "Russ Taylor",
        "Srikrishna Sekhar",
        "Ch. Ishwara-Chandra",
        "Sushant Dutta",
        "Sthabile Kolwa"
      ],
      "abstract": "The superMIGHTEE project: MeerKAT and GMRT Together to Unveil the Deep Radio Sky Dharam V. Lal (NCRA-TIFR), Russ Taylor (IDIA, Univ. of C.T., Univ. of W.C.), Srikrishna Sekhar (NRAO, IDIA, Univ. of C.T.), Ch. Ishwara-Chandra (NCRA-TIFR), Sushant Dutta (Univ. of C.T.), Sthabile Kolwa (UCT, Univ. of S.A.) 17 pages, 10 Figures, 5 Tables, accepted for publication in the Astrophysics Journal (2025, vol. 991, p. 9). The images and associated catalog data are available on the public data repository at the IDIA science gateway at, url: this http URL with DOI url: this http URL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) An international team of researchers has come together to undertake an ultra-broadband exploration of the deep radio sky. The superMIGHTEE project combines data from the MIGHTEE project, using the precursor Square Kilometre Array (SKA) MeerKAT telescope in South Africa, with observations from the upgraded Giant Metrewave Radio Telescope (uGMRT) in India to produce deep images at several $\\mu$Jy sensitivity over a frequency range of 200 MHz--2.5 GHz, with an angular resolution of a few arcseconds. This paper describes the initial superMIGHTEE uGMRT data release, comprising total intensity continuum images covering a total of 9.9 deg$^2$ at 650 MHz and 6.9 deg$^2$ at 400 MHz in the XMM-LSS, COSMOS, and E-CDFS deep fields. The associated radio source catalogs include 27,101 sources at 650 MHz and 10,946 sources at 400 MHz. The redshift distribution of the sources extends to $z\\sim4$ with a median value of $z=1$. An overview of the broadband spectra of the sources, in combination with the MeerKAT MIGHTEE 1280 MHz data, reveals a clear change in spectral properties at the transition from an active galactic nuclei-dominated population to a population dominated by star-forming galaxies at flux densities of a few mJy. At higher frequencies, the star-forming galaxy population exhibits an optically thin synchrotron spectral index indicative of energy injection from supernovae. At lower frequencies, the spectra flatten significantly with decreasing flux density, and the fraction of sources with peaked spectra increases. This is the first superMIGHTEE uGMRT data release. Subsequent releases will include spectropolarimetric and spectral line image cubes, as well as images at lower frequencies. The goal of the superMIGHTEE ultra-wideband dataset is to enhance our understanding of the evolution of active galactic nuclei and star-forming galaxies over cosmic time, (abridged).",
      "pdf_url": "https://arxiv.org/pdf/2509.09293.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09341",
      "title": "Detection of colour variations from gravitational microlensing observations in the quadruple quasar HE0435-1223: Implications for the accretion disk",
      "authors": [
        "Christian Sorgenfrei",
        "Robert W. Schmidt",
        "Joachim Wambsganss"
      ],
      "abstract": "Detection of colour variations from gravitational microlensing observations in the quadruple quasar HE0435-1223: Implications for the accretion disk Christian Sorgenfrei, Robert W. Schmidt, Joachim Wambsganss Accepted for publication in A&A, 9 pages, 7 figures Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present monitoring observations of quasar microlensing in the quadruple quasar HE0435-1223. The microlensing-induced light curves of the quasar images are chromatic, i.e. they depend on the applied filter band. Comparison with microlensing simulations allows us to infer properties of the accretion disk. We determine the R and V band light curves of the four images of HE0435-1223 from 79 and 80 epochs respectively, taken from 2014 to 2024 at the Las Cumbres Observatory using difference imaging analysis. We consider difference light curves to remove the intrinsic quasar variability. This reveals a prominent long-term chromatic microlensing event in image B. We use microlensing light curve simulations with both Gaussian and standard thin accretion disk brightness profiles to analyse this signal. The particularly strong signal observed in image B of HE0435-1223 makes it possible to detect a size ratio of the accretion disk in the R band compared to the V band of $1.24^{+0.08}_{-0.20}$ and $1.42^{+0.11}_{-0.22}$ for the Gaussian and the thin disk model, respectively. These values are in agreement with standard thin disk theory. For the absolute size we find large disk half-light radii of around 0.7 to 1.0 Einstein radii with an uncertainty of about 0.6 dex (depending on the filter bands and the models). Finally, our calculations show that image B undergoes caustic crossings about once per year.",
      "pdf_url": "https://arxiv.org/pdf/2509.09341.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09609",
      "title": "Constraints on Ultra-heavy DM from TeV-PeV gamma-ray diffuse measurements",
      "authors": [
        "Manuel Rocamora",
        "Pedro De La Torre Luque",
        "Miguel A. Sánchez-Conde"
      ],
      "abstract": "Constraints on Ultra-heavy DM from TeV-PeV gamma-ray diffuse measurements Manuel Rocamora, Pedro De La Torre Luque, Miguel A. Sánchez-Conde 10 pages main text, with 8 figures and appendix with 4 figures. Comments are welcome! High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Recent experiments have measured the Galactic $\\gamma$-ray diffuse emission up to PeV energies, opening a window to study acceleration of Galactic cosmic rays and their propagation up to the cosmic-ray knee. Furthermore, these observations provide a powerful tool to set strong constraints into very-heavy dark matter particles, with masses in the TeV-PeV range. In this paper, we explore the potential of the newest observations of diffuse emissions at the Galactic plane from HAWC and LHAASO to probe this kind of dark matter over a wide mass range. Here, we model secondary emissions (inverse-Compton) from the electrons and positrons produced in the annihilation/decay of dark matter, on top of their prompt $\\gamma$-ray emission, including the effects of absorption of high-energy photons via pair production. Furthermore, we show that including the astrophysical backgrounds (namely diffuse emission from cosmic-ray collisions or emission from unresolved sources) can significantly improve these limits. We find that the new measurements provided, specially by LHAASO with the combination of the WCDA and KM2A detectors, allow us to set strong constraints in decaying dark matter, being competitive and even improving the strongest constraints at the moment. We also highlight that these regions lead to constraints that are less affected by uncertainties from the dark matter distribution and discuss how CTA north and SWGO will be able to improve limits in this mass range.",
      "pdf_url": "https://arxiv.org/pdf/2509.09609.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09626",
      "title": "Environmental vs. intrinsic quenching at cosmic noon: Predictions from cosmological hydrodynamical simulations for VLT-MOONRISE",
      "authors": [
        "Paul H. Goubert",
        "Asa F. L. Bluck",
        "Joanna M. Piotrowska",
        "Paul Torrey",
        "Roberto Maiolino",
        "Thomas Pinto Franco",
        "Camilo Casimiro",
        "Nicolas Cea"
      ],
      "abstract": "Environmental vs. intrinsic quenching at cosmic noon: Predictions from cosmological hydrodynamical simulations for VLT-MOONRISE Paul H. Goubert, Asa F. L. Bluck, Joanna M. Piotrowska, Paul Torrey, Roberto Maiolino, Thomas Pinto Franco, Camilo Casimiro, Nicolas Cea Accepted to MNRAS; 31 pages; 17 figures Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present an investigation into the quenching of simulated galaxies across cosmic time, honing in on the role played by both intrinsic and environmental mechanisms at different epochs. In anticipation of VLT-MOONRISE, the first wide-field spectroscopic galaxy survey to target cosmic noon, this work provides clear predictions to compare to the future observations. We investigate the quenching of centrals, high-mass satellites, and low-mass satellites from two cosmological hydrodynamical simulations: IllustrisTNG and EAGLE. Satellites are split according to bespoke mass thresholds, designed to separate environmental and intrinsic quenching mechanisms. To determine the best parameter for predicting quiescence, we apply a Random Forest classification analysis for each galaxy class at each epoch. The Random Forest classification determines supermassive black hole mass as the best predictor of quiescence in centrals and high-mass satellites. Alternatively, the quenching of low-mass satellites is best predicted by group halo mass, at all epochs. Additionally, we investigate the evolution in the dependence of the quenched fraction with various parameters, revealing a more complex picture. There is strong evidence for the rejuvenation of star formation from z = 2 to z = 0 in EAGLE, but not in IllustrisTNG. The starkest discrepancy between simulations rests in the mass threshold analysis. While IllustrisTNG predicts the existence of environmentally quenched satellites visible within the survey limits of MOONRISE, EAGLE does not. Hence, MOONRISE will provide critical data that is needed to evaluate current models, and constrain future models, of quenching processes.",
      "pdf_url": "https://arxiv.org/pdf/2509.09626.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.22718",
      "title": "$\\texttt{SwiftC}_\\ell$: fast differentiable angular power spectra beyond Limber",
      "authors": [
        "Laura Reymond",
        "Alexander Reeves",
        "Pierre Zhang",
        "Alexandre Refregier"
      ],
      "abstract": "$\\texttt{SwiftC}_\\ell$: fast differentiable angular power spectra beyond Limber Laura Reymond, Alexander Reeves, Pierre Zhang, Alexandre Refregier 19 pages, 7 figures, submitted to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) The upcoming stage IV wide-field surveys will provide high precision measurements of the large-scale structure (LSS) of the universe. Their interpretation requires fast and accurate theoretical predictions including large scales. For this purpose, we introduce $\\texttt{SwiftC}_\\ell$, a fast, accurate and differentiable $\\texttt{JAX}$-based pipeline for the computation of the angular power spectrum beyond the Limber approximation. It uses a new FFTLog-based method which can reach arbitrary precision and includes interpolation along $k$, allowing for $k$-dependent growth factor and biases. $\\texttt{SwiftC}_\\ell$ includes a wide range of probes and effects such as galaxy clustering, including magnification bias, redshift-space distortions and primordial non-Gaussianity, weak lensing, including intrinsic alignment, cosmic microwave background (CMB) lensing and CMB integrated Sachs-Wolfe effect. We compare our pipeline to the other available beyond-Limber codes within the N5K challenge from the Rubin Observatory Legacy Survey of Space and Time (LSST) Dark Energy Science Collaboration. $\\texttt{SwiftC}_\\ell$ computes the 120 different angular power spectra over 103 $\\ell$-multipoles in 5 ms on one GPU core while the computation of the gradient is approximately 4$\\times$ slower. Using a pre-calculation, $\\texttt{SwiftC}_\\ell$ is thus about 40$\\times$ faster than the winner of the N5K challenge with comparable accuracy. Furthermore, all outputs are auto-differentiable, facilitating gradient-based sampling and robust and accurate Fisher forecasts. We showcase a Markov Chain Monte Carlo, a Hamiltonian Monte Carlo and a Fisher forecast on an LSST-like survey, illustrating $\\texttt{SwiftC}_\\ell$'s differentiability, speed and reliability in measuring cosmological parameters. The code is publicly available at this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2505.22718.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.08949",
      "title": "SLICE: SPT-CL J0546-5345 -- A prominent strong-lensing cluster at $z=1.07$",
      "authors": [
        "Joseph F. V. Allingham",
        "Adi Zitrin",
        "Miriam Golubchik",
        "Lukas J. Furtak",
        "Matthew Bayliss",
        "Catherine Cerny",
        "Jose M. Diego",
        "Alastair C. Edge",
        "Raven Gassis",
        "Michael D. Gladders",
        "Mathilde Jauzac",
        "David J. Lagattuta",
        "Gavin Leroy",
        "Marceau Limousin",
        "Guillaume Mahler",
        "Ashish K. Meena",
        "Priyamvada Natarajan",
        "Keren Sharon"
      ],
      "abstract": "SLICE: SPT-CL J0546-5345 -- A prominent strong-lensing cluster at $z=1.07$ Joseph F. V. Allingham, Adi Zitrin, Miriam Golubchik, Lukas J. Furtak, Matthew Bayliss, Catherine Cerny, Jose M. Diego, Alastair C. Edge, Raven Gassis, Michael D. Gladders, Mathilde Jauzac, David J. Lagattuta, Gavin Leroy, Marceau Limousin, Guillaume Mahler, Ashish K. Meena, Priyamvada Natarajan, Keren Sharon 12 pages, 4 figures, 1 table, published in ApJL (August 29th 2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Massive galaxy clusters act as prominent strong-lenses. Due to a combination of observational biases, cluster evolution and lensing efficiency, most of the known cluster lenses lie typically at $z_{l}\\sim0.2-0.7$, with only a few prominent examples at higher redshifts. Here we report a first strong-lensing analysis of the massive galaxy cluster SPT-CL J0546-5345 at a redshift $z_l=1.07$. This cluster was first detected through the Sunyaev-Zel'dovich effect, with a high estimated mass for its redshift of $M_{200,c} = (7.95 \\pm 0.92) \\times 10^{14}\\,M_{\\odot}$. Using recent JWST/NIRCam and archival HST imaging, we identify at least 10 secure and 6 candidate sets of multiply imaged background galaxies, which we use to constrain the mass distribution in the cluster. We derive effective Einstein radii of $\\theta_{E}= 18.1 \\pm 1.8 ''$ for a source at $z_{s}=3$, and $\\theta_{E}= 27.9 \\pm 2.8 ''$ for a source at $z_{s}=9$. The total projected mass within a $200$ kpc radius around the strong-lensing region is $M(<200\\,\\mathrm{kpc}) = (1.9 \\pm 0.3) \\times 10^{14}\\,M_{\\odot}$. While our results rely on photometric redshifts warranting spectroscopic follow-up, this central mass resembles that of the Hubble Frontier Fields clusters - although SPT-CL J0546-5345 is observed when the Universe was $\\sim 3-4$ Gyr younger. Amongst the multiply-imaged sources, we identify a hyperbolic-umbilic-like configuration, and, thanks to its point-like morphology, a possible Active Galactic Nucleus (AGN). If confirmed spectroscopically, it will add to just a handful of other quasars and AGN known to be multiply lensed by galaxy clusters.",
      "pdf_url": "https://arxiv.org/pdf/2507.08949.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.13740",
      "title": "Is Phantom Barrier Crossing Inevitable? A Cosmographic Analysis",
      "authors": [
        "Nandan Roy",
        "Soumya Chakrabarti"
      ],
      "abstract": "Is Phantom Barrier Crossing Inevitable? A Cosmographic Analysis Nandan Roy, Soumya Chakrabarti 8 pages, 7 figures, comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recent findings from the Dark Energy Spectroscopic Instrument (DESI), analyzed together with supernova observations and CMB measurements, provide statistically significant indications (at the 2-5$\\sigma$ level) of a time-varying dark energy component alongwith a possible phantom-to-quintessence transition in the recent past. In this letter, we investigate the evolution of dark energy using a model-independent cosmographic approach and explore the possibility of phantom barrier crossing. By mapping the differential equation defining jerk parameter into an anharmonic oscillator, we derive an analytical expression for the dark energy equation of state (EoS), which, remarkably, depends on a single parameter. Using DESI-DR2 BAO data, supernova data, and a compressed Planck likelihood, we constrain the cosmological parameters and find deviations from a cosmological constant at late times. Unlike the CPL parametrization, our results show no phantom barrier crossing, highlighting the power of kinematic reconstructions in probing the nature of dark energy. Furthermore, using a dynamical system approach, we demonstrate that $w_{DE}=-1$ acts as a bifurcation point with degenerate stable fixed points and therefore prevents solutions from crossing this barrier from either side.",
      "pdf_url": "https://arxiv.org/pdf/2508.13740.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.21041",
      "title": "Primordial Black Hole Triggered Type Ia Supernovae I: Impact on Explosion Dynamics and Light Curves",
      "authors": [
        "Shing-Chi Leung",
        "Seth Walther",
        "Ken'ichi Nomoto",
        "Alexander Kusenko"
      ],
      "abstract": "Primordial Black Hole Triggered Type Ia Supernovae I: Impact on Explosion Dynamics and Light Curves Shing-Chi Leung, Seth Walther, Ken'ichi Nomoto, Alexander Kusenko 21 pages, 36 figures. Submitted to Astrophysical Journal on Jun 12 2025, accepted on Jul 25 2025, published on Sep 11 2025 The Astrophysical Journal 991, 11 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Primordial black holes (PBHs) in the asteroid-mass window are compelling dark matter candidates, made plausible by the existence of black holes and by the variety of mechanisms of their production in the early universe. If a PBH falls into a white dwarf (WD), the strong tidal forces can generate enough heat to trigger a thermonuclear runaway explosion, depending on the WD mass and the PBH orbital parameters. In this work, we investigate the WD explosion triggered by the passage of PBH. We perform 2D simulations of the WD undergoing thermonuclear explosion in this scenario, with the predicted ignition site as the parameter assuming the deflagration-detonation transition model. We study the explosion dynamics and predict the associated light curves and nucleosynthesis. We find that the model sequence predicts the light curves which align with the Phillip's relation ($B_{\\max}$ vs. $\\Delta M_{15}$). Our models hint at a unifying approach in triggering Type Ia supernovae without involving two distinctive evolutionary tracks.",
      "pdf_url": "https://arxiv.org/pdf/2507.21041.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03152",
      "title": "Influence of supermassive primordial black holes on ultraviolet luminosity of high-redshift galaxies",
      "authors": [
        "Yi-Yang Li",
        "Hai-Long Huang",
        "Yun-Song Piao"
      ],
      "abstract": "Influence of supermassive primordial black holes on ultraviolet luminosity of high-redshift galaxies Yi-Yang Li, Hai-Long Huang, Yun-Song Piao Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recently James Webb Space Telescope (JWST) have observed an excess of luminous galaxies at high redshifts ($z \\gtrsim 10$). In this work, we investigate whether supermassive primordial black holes (SMPBHs) can explain it by their influence on the ultraviolet luminosity function (UV LF) of high-redshift galaxies. Through Markov Chain Monte Carlo analysis, we constrain the parameters relevant with SMPBHs against current JWST observational data. The results reveal that SMPBHs with masses $M_{\\rm PBH} \\sim 10^{6.3\\text{-}8.3} M_\\odot$, abundances $f_{\\rm PBH} \\sim 10^{-7}\\text{-}10^{-5}$, and sub-Eddington ratios $\\lambda_E \\ll 1$ can effectively enhance the bright end of the UV LF, consistent with JWST observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.03152.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08874",
      "title": "Characterizing Supernovae Host Galaxies with FrankenBlast: A Scalable Tool for Transient Host Galaxy Association, Photometry, and Stellar Population Modeling",
      "authors": [
        "Anya E. Nugent",
        "V. Ashley Villar",
        "Alex Gagliano",
        "David O. Jones",
        "Asaf Horowicz",
        "Kaylee de Soto",
        "Bingjie Wang",
        "Ben Margalit"
      ],
      "abstract": "Characterizing Supernovae Host Galaxies with FrankenBlast: A Scalable Tool for Transient Host Galaxy Association, Photometry, and Stellar Population Modeling Anya E. Nugent, V. Ashley Villar, Alex Gagliano, David O. Jones, Asaf Horowicz, Kaylee de Soto, Bingjie Wang, Ben Margalit 36 pages, 14 figures, 2 tables, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We present FrankenBlast, a customized and improved version of the Blast web application. FrankenBlast associates transients to their host galaxies, performs host photometry, and runs a innovative SED fitting code to constrain host stellar population properties--all within minutes per object. We test FrankenBlast on 14,432 supernovae (SNe), ~half of which are spectroscopically-classified, and are able to constrain host properties for 9262 events. When contrasting the host stellar masses ($M_*$), specific star formation rates (sSFR), and host dust extinction ($A_V$) between spectroscopically and photometrically-classified SNe Ia, Ib/c, II, and IIn, we determine that deviations in these distributions are primarily due to misclassified events contaminating the photometrically-classified sample. We further show that the higher redshifts of the photometrically-classified sample also force their $M_*$ and sSFR distributions to deviate from those of the spectroscopically-classified sample, as these properties are redshift-dependent. We compare host properties between spectroscopically-classified SN populations and determine if they primarily trace $M_*$ or SFR. We find that all SN populations seem to both depend on $M_*$ and SFR, with SNe II and IIn somewhat more SFR-dependent than SNe Ia and Ib/c, and SNe Ia more $M_*$-dependent than all other classes. We find the difference in the SNe Ib/c and II hosts the most intriguing and speculate that SNe Ib/c must be more dependent on higher $M_*$ and more evolved environments for the right conditions for progenitor formation. All data products and FrankenBlast are publicly available, along with a developing FrankenBlast version intended for Rubin Observatory science products.",
      "pdf_url": "https://arxiv.org/pdf/2509.08874.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08895",
      "title": "Polarimetric Diversity in Tidal Disruption Events: Comparative Study of Low-Polarised sources with AT2020mot",
      "authors": [
        "A. Floris",
        "I. Liodakis",
        "K. I. I. Koljonen",
        "E. Lindfors",
        "B. Agìs-Gonzalez",
        "A. Paggi",
        "D. Blinov",
        "K. Nilsson",
        "I. Agudo",
        "P. Charalampopoulos",
        "M. A. Dìaz Teodori",
        "J. Escudero Pedrosa",
        "J. Otero-Santos",
        "V. Piirola",
        "M. Newsome",
        "S. Van Velzen"
      ],
      "abstract": "Polarimetric Diversity in Tidal Disruption Events: Comparative Study of Low-Polarised sources with AT2020mot A. Floris, I. Liodakis, K. I. I. Koljonen, E. Lindfors, B. Agìs-Gonzalez, A. Paggi, D. Blinov, K. Nilsson, I. Agudo, P. Charalampopoulos, M. A. Dìaz Teodori, J. Escudero Pedrosa, J. Otero-Santos, V. Piirola, M. Newsome, S. Van Velzen 13 pages, 2 figures, accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Tidal disruption events (TDEs) occur when a star is disrupted by the tidal forces of a supermassive black hole (SMBH), producing bright multi-wavelength flares. Among these events, AT2020mot has so far exhibited the highest recorded optical polarisation, with tidal shocks proposed as the primary source of its polarised emission. We present a comprehensive analysis of 13 TDEs with available polarimetric observations, aiming to determine whether the unusually high polarisation of AT2020mot stems from unique physical processes or arises from mechanisms shared by other TDEs. We present new optical polarisation measurements of TDEs obtained from multiple ground-based telescopes, combining them with optical, UV, and X-ray light curves from the Zwicky Transient Facility and the Swift observatory, respectively. We derive intrinsic TDE properties, such as SMBH and stellar masses, using MOSFiT and TDEMass, and compare them with the ones of the sample population. Our population study reveals that AT2020mot agrees with the broader TDE sample in most physical properties, including blackbody temperature, luminosity, and rise timescales. However, its optical polarisation degree is exceptionally high compared to the low or undetected polarisation observed in other events. Additionally, AT2020mot appears to have an elevated column density from our MOSFiT fits, suggesting a more complex environment than is typically assumed. We conclude that although AT2020mot fits well within the general TDE population in terms of global characteristics, its extraordinarily high polarisation and higher column density challenge current models based purely on shock or reprocessing mechanisms. More extensive, time-resolved polarimetric monitoring of newly discovered TDEs will be critical to determine whether AT2020mot represents an outlier or the extreme end of a continuum of TDE properties.",
      "pdf_url": "https://arxiv.org/pdf/2509.08895.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08944",
      "title": "Old Galactic novae in the eROSITA All Sky Survey",
      "authors": [
        "Gloria Sala",
        "Frank Haberl",
        "Axel Schwope",
        "Dusán Tubín-Arenas",
        "Elif Şafak",
        "Chandreyee Maitra",
        "Jochen Greiner"
      ],
      "abstract": "Old Galactic novae in the eROSITA All Sky Survey Gloria Sala, Frank Haberl, Axel Schwope, Dusán Tubín-Arenas, Elif Şafak, Chandreyee Maitra, Jochen Greiner 18 pages, accepted for publication in Astronomy and Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Nova explosions occur on accreting white dwarfs. A thermonuclear runaway in the H-rich accreted envelope causes its ejection without destroying the white dwarf, and an increase in the luminosity by several magnitudes. Accretion is re-established some time after the explosion. The explosion of the nova itself is expected to affect the mass-transfer rate from the secondary and the accretion rate, but these effects have been little explored observationally. Most novae are observed only in outburst and the properties of the host systems are unknown. X-ray observations of novae happen mostly during outburst; only a few have been the target of dedicated X-ray observations years or decades after outburst. However, the X-ray emission long after the outburst provides a powerful diagnostics of the accretion rate and the possible magnetic nature of the white dwarf. We have explored the first two years of the SRG/eROSITA All Sky Survey (eRASS) for X-ray sources correlated with Galactic historical novae. We present the first population study of nova hosting systems in X-rays, focus on the evolution of accretion rate as a function of the time since last outburst, and look for new candidates for magnetic systems. In total, 32 X-ray counterparts of novae are found in the western Galactic hemisphere. Combined with 53 nova detections published for the eastern hemisphere, the fraction of X-ray detected novae in quiescence is 18% of the Galactic novae. We have, for the first time, enough statistics to observationally determine the evolution of accretion rate as a function of time since the last nova outburst for a time span of 120 years. The results confirm that magnetic systems remain systematically at higher fluxes and that accretion is enhanced during the first years after the outburst, as predicted theoretically. We also identify new IP candidates in AT Cnc and RR Cha.",
      "pdf_url": "https://arxiv.org/pdf/2509.08944.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08951",
      "title": "Relativistic precessing jets powered by an accreting neutron star",
      "authors": [
        "F. J. Cowie",
        "R. P. Fender",
        "I. Heywood",
        "A. K. Hughes",
        "K. Savard",
        "P. A. Woudt",
        "F. Carotenuto",
        "A. J. Cooper",
        "J. van den Eijnden",
        "K. V. S. Gasealahwe",
        "S. E. Motta",
        "P. Saikia"
      ],
      "abstract": "Relativistic precessing jets powered by an accreting neutron star F. J. Cowie, R. P. Fender, I. Heywood, A. K. Hughes, K. Savard, P. A. Woudt, F. Carotenuto, A. J. Cooper, J. van den Eijnden, K. V. S. Gasealahwe, S. E. Motta, P. Saikia Accepted for publication in MNRAS Letters High Energy Astrophysical Phenomena (astro-ph.HE) Precessing relativistic jets launched by compact objects are rarely directly measured, and present an invaluable opportunity to better understand many features of astrophysical jets. In this Letter we present MeerKAT radio observations of the neutron star X-ray binary system (NSXB) Circinus X-1 (Cir X-1). We observe a curved S-shaped morphology on $\\sim 20''$ $(\\sim1\\:\\text{pc})$ scales in the radio emission around Cir X-1. We identify flux density and position changes in the S-shaped emission on year timescales, robustly showing its association with relativistic jets. The jets of Cir X-1 are still propagating with mildly relativistic velocities $\\sim1\\:\\text{pc}$ from the core, the first time such large scale jets have been seen from a NSXB. The position angle of the jet axis is observed to vary on year timescales, over an extreme range of at least $110°$. The morphology and position angle changes of the jet are best explained by a smoothly changing launch direction, verifying suggestions from previous literature, and indicating that precession of the jets is occurring. Steady precession of the jet is one interpretation of the data, and if occurring, we constrain the precession period and half-opening angle to $>10$ years and $>33°$ respectively, indicating precession in a different parameter space to similar known objects such as SS~433.",
      "pdf_url": "https://arxiv.org/pdf/2509.08951.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09028",
      "title": "Cosmic Ray Spatial Distribution and the Galactic/Extragalactic Transition",
      "authors": [
        "Paolo Lipari",
        "Silvia Vernetto"
      ],
      "abstract": "Cosmic Ray Spatial Distribution and the Galactic/Extragalactic Transition Paolo Lipari, Silvia Vernetto High Energy Astrophysical Phenomena (astro-ph.HE) Determining the spatial distribution of Galactic cosmic rays (CRs) is fundamental to understand how these particles propagate in interstellar space and to infer their source spectra. The most sensitive method of studying this problem is observing the gamma--ray and neutrino diffuse fluxes produced in the inelastic interactions of CR protons and nuclei with interstellar gas that encode the energy and spatial distributions of the interacting particles. Most theoretical models assume that the spatial and energy dependencies of the spectra of CR protons and nuclei are factorized, so that the CR energy spectra have the same shape at all points of the Milky Way. However, on the base of the Fermi--LAT observations, some authors have tentatively inferred that particles in the inner regions of the Milky Way have significantly harder spectra. Recently the ground--based telescopes Tibet--AS$\\gamma$, LHAASO and HAWC have extended the measurements of the diffuse gamma--ray flux to much higher energies, and the IceCube neutrino telescope has obtained evidence for a $\\nu$ flux from the Galactic disk. These new measurements allow for new tests of the factorization hypothesis, and disfavor models in which the spectral shape of CR protons and nuclei is harder in the inner part of the Galaxy. In fact, the LHAASO data above 30~TeV are in better agreement with the opposite hypothesis, that cosmic rays is the inner Galaxy have softer spectra than those in the outer Galaxy. This result, that has currently only modest significance due to large statistical and systematic uncertainties, could be explained by assuming that the CR confinement volume increases with energy. An alternative explanation is that a significant fraction of cosmic rays in the multi--PeV energy range is of extragalactic origin.",
      "pdf_url": "https://arxiv.org/pdf/2509.09028.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09040",
      "title": "Suppression of pair beam instabilities in a laboratory analogue of blazar pair cascades",
      "authors": [
        "Charles D. Arrowsmith",
        "Francesco Miniati",
        "Pablo J. Bilbao",
        "Pascal Simon",
        "Archie F. A. Bott",
        "Stephane Burger",
        "Hui Chen",
        "Filipe D. Cruz",
        "Tristan Davenne",
        "Anthony Dyson",
        "Ilias Efthymiopoulos",
        "Dustin H. Froula",
        "Alice Goillot",
        "Jon T. Gudmundsson",
        "Dan Haberberger",
        "Jack W. D. Halliday",
        "Tom Hodge",
        "Brian T. Huffman",
        "Sam Iaquinta",
        "Graham Marshall",
        "Brian Reville",
        "Subir Sarkar",
        "Alexander A. Schekochihin",
        "Luis O. Silva",
        "Raspberry Simpson",
        "Vasiliki Stergiou",
        "Raoul M. G. M. Trines",
        "Thibault Vieu",
        "Nikolaos Charitonidis",
        "Robert Bingham",
        "Gianluca Gregori"
      ],
      "abstract": "Suppression of pair beam instabilities in a laboratory analogue of blazar pair cascades Charles D. Arrowsmith, Francesco Miniati, Pablo J. Bilbao, Pascal Simon, Archie F. A. Bott, Stephane Burger, Hui Chen, Filipe D. Cruz, Tristan Davenne, Anthony Dyson, Ilias Efthymiopoulos, Dustin H. Froula, Alice Goillot, Jon T. Gudmundsson, Dan Haberberger, Jack W. D. Halliday, Tom Hodge, Brian T. Huffman, Sam Iaquinta, Graham Marshall, Brian Reville, Subir Sarkar, Alexander A. Schekochihin, Luis O. Silva, Raspberry Simpson, Vasiliki Stergiou, Raoul M. G. M. Trines, Thibault Vieu, Nikolaos Charitonidis, Robert Bingham, Gianluca Gregori High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) The generation of dense electron-positron pair beams in the laboratory can enable direct tests of theoretical models of $\\gamma$-ray bursts and active galactic nuclei. We have successfully achieved this using ultra-relativistic protons accelerated by the Super Proton Synchrotron at CERN. In the first application of this experimental platform, the stability of the pair beam is studied as it propagates through a metre-length plasma, analogous to TeV $\\gamma$-ray induced pair cascades in the intergalactic medium. It has been argued that pair beam instabilities disrupt the cascade, thus accounting for the observed lack of reprocessed GeV emission from TeV blazars. If true this would remove the need for a moderate strength intergalactic magnetic field to explain the observations. We find that the pair beam instability is suppressed if the beam is not perfectly collimated or monochromatic, hence the lower limit to the intergalactic magnetic field inferred from $\\gamma$-ray observations of blazars is robust.",
      "pdf_url": "https://arxiv.org/pdf/2509.09040.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09057",
      "title": "Unraveling the emission mechanism powering long period radio transients from interacting white dwarf binaries via kinetic plasma simulations",
      "authors": [
        "Yici Zhong",
        "Elias R. Most"
      ],
      "abstract": "Unraveling the emission mechanism powering long period radio transients from interacting white dwarf binaries via kinetic plasma simulations Yici Zhong, Elias R. Most High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Recent observations of long period radio transients, such as GLEAM-X J0704-37 and ILTJ1101 + 5521, have revealed a previously unrecognized population of galactic radio transient sources associated with white dwarf - M dwarf binaries. It is an open question how to produce coherent radio emission in these systems, though a model driven by binary interaction seems likely given the nature and correlation of the emission with the binaries' orbital period. Using kinetic plasma simulations, we demonstrate that the relativistic electron cyclotron maser instability (ECMI) is a viable mechanism for generating radio pulses in white dwarf - M dwarf systems, akin to planetary radio emission, such as that from the Jupiter-Io system. We quantify the relativistic ECMI in the nonlinear regime under conditions relevant for white dwarf radio emission for the first time. Our simulations demonstrate that the ECMI can intrinsically produce partially linearly polarized emission relevant to explaining the observed emission spectrum of the two galactic sources, though the precise details will depend on the plasma composition. Our work paves the way for a systematic and fully nonlinear computational modeling of radio emission from interacting white dwarf sources.",
      "pdf_url": "https://arxiv.org/pdf/2509.09057.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09133",
      "title": "Reprocessing of X-rays emission in Ultra-Luminous X-ray sources",
      "authors": [
        "Manish Kumar",
        "Rahul Sharma",
        "Biswajit Paul"
      ],
      "abstract": "Reprocessing of X-rays emission in Ultra-Luminous X-ray sources Manish Kumar, Rahul Sharma, Biswajit Paul High Energy Astrophysical Phenomena (astro-ph.HE) With the discovery of pulsations in some of the ultra-luminous X-ray sources (ULXs), it is quite clear that most of the ULXs harbor either a neutron star or a stellar mass black hole as a compact object accreting at super-Eddington rates. In spite of having such a high accretion rate, the reprocessed emission in the ULX sources is quite meagre compared to that observed in Galactic X-ray binaries, except for some absorption lines in the winds. In this work, we investigate the extent of reprocessed emission in ULXs using three diagnostics: (i) searches for Fe $\\rm K\\alpha$ lines in bright well-known ULXs and Ultra luminous X-ray Pulsars (ULXPs), (ii) evolution of hardness ratio around the eclipse transitions in the eclipsing ULXs, and (iii) the flux ratio between eclipse and out-of-eclipse (OOE) phases in eclipsing ULXs. We placed the most stringent constraints to date on the upper limits on EW of the iron line, 11--20 eV. Furthermore, we have not observed any significant changes in the hardness ratio during the ingress or egress, while in Galactic eclipsing X-ray binaries, an increase in the hardness ratio is observed during the transitions. Finally, the reprocessing efficiency (eclipse to OOE flux ratio) is found to be larger in ULXs compared to Galactic eclipsing X-ray binaries. Based on these results, we discuss the possibility of a metal-poor or highly ionized environment surrounding the ULXs, which suppresses reprocessed emission features.",
      "pdf_url": "https://arxiv.org/pdf/2509.09133.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09224",
      "title": "Magnetic White Dwarf -- M Dwarf Binaries in Pre-polar Phase as Special Population of Long-Period Radio Transients",
      "authors": [
        "Yuan-Pei Yang"
      ],
      "abstract": "Magnetic White Dwarf -- M Dwarf Binaries in Pre-polar Phase as Special Population of Long-Period Radio Transients Yuan-Pei Yang 27 pages, 8 figures, and 1 table. Comments welcome!! High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Long-period radio transients (LPTs) are a new class of coherent radio sources with periods ranging from minutes to hours. Recently, two LPT sources, ILT J1101+5521 and GLEAM-X J0704-37, with periods of 2-3 hours has been confirmed to originate from white dwarf (WD) -- M dwarf (MD) binaries. In this work, we propose that at least some LPTs originate from the magnetic WD -- MD binaries in the pre-polar phase. The asynchronism between the WD's rotation and the binary's orbital motion allows for the unipolar-inductor mechanism or magnetosphere interaction to operate and accelerate radiating particles, with the dominant process depending on the magnetic moment ratio of the two stars. Under asynchronism condition, both the peak flux and the polarization of radio pulses will be modulated by the beat period. The pre-polar phase characterized by an extremely low accretion rate provides the relatively clean magnetospheric environment necessary for a loss-cone-driven maser (LCDM) mechanism to operate, producing the LPT emission. The observed pulse duty cycle of $10^{-3}-10^{-1}$ is attributed to a beaming effect modulated by the binary's magnetic geometry. Furthermore, the magnetized environment of a WD--MD binary is conducive to Faraday conversion with weak coupling, which implies that the polarization state of LPTs should vary significantly at different periods. Finally, we predict that LPTs from WD--MD binaries should exhibit a period distribution following $f_P(P)dP \\propto P^{-(1.67-2.33)}dP$ and a luminosity function described by $f_L(L)dL \\propto L^{-(1.80-2.67)}dL$, which can be tested by the future large sample.",
      "pdf_url": "https://arxiv.org/pdf/2509.09224.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09288",
      "title": "GRMHD Study of Accretion onto time-like Naked Singularities",
      "authors": [
        "Akhil Uniyal",
        "Indu K. Dihingia",
        "Yosuke Mizuno",
        "Włodek Kluźniak"
      ],
      "abstract": "GRMHD Study of Accretion onto time-like Naked Singularities Akhil Uniyal, Indu K. Dihingia, Yosuke Mizuno, Włodek Kluźniak High Energy Astrophysical Phenomena (astro-ph.HE) Naked singularities (NkS) are solutions to the Einstein field equations that violate the cosmic censorship conjecture. Recent studies indicate that these objects may serve as compelling mimickers of black hole shadows. In this work, we investigate the accretion dynamics of selected time-like naked singularities using general relativistic magnetohydrodynamic (GRMHD) simulations. Our objective is to determine whether naked singularities exhibit distinct signatures compared to black holes. We find that, unlike black holes, naked singularities exhibit a centrifugal barrier that prevents direct accretion of rotating matter onto the NkS. Despite reduced magnetization in the funnel region, these objects are capable of generating jet powers comparable to those observed in black holes. Additionally, we observe that accreting matter releases gravitational energy as it is driven towards the NkS, powering the strong outflow via local fluid pressure gradient or magnetic pressure forces.",
      "pdf_url": "https://arxiv.org/pdf/2509.09288.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09481",
      "title": "Spin Constraints on 4U 1630-47 via combined Continuum Fitting and Reflection methods: a comparative study using Frequentist and Bayesian statistics",
      "authors": [
        "Debtroy Das",
        "Honghui Liu",
        "Zuobin Zhang",
        "Cosimo Bambi",
        "Jiachen Jiang",
        "Johannes Buchner",
        "Andrea Santangelo",
        "Menglei Zhou"
      ],
      "abstract": "Spin Constraints on 4U 1630-47 via combined Continuum Fitting and Reflection methods: a comparative study using Frequentist and Bayesian statistics Debtroy Das, Honghui Liu, Zuobin Zhang, Cosimo Bambi, Jiachen Jiang, Johannes Buchner, Andrea Santangelo, Menglei Zhou High Energy Astrophysical Phenomena (astro-ph.HE) We present a comprehensive Bayesian spectral analysis of the black hole X-ray binary 4U 1630-47 during its 2022 outburst, using simultaneous \\textit{NICER} and \\textit{NuSTAR} observations. Using the traditional frequentist approach, we build our model combining reflection spectroscopy with continuum fitting techniques and analyse the data. In the Bayesian framework, we jointly constrain the black hole's spin, mass, inclination, and distance within a unified framework. Employing nested sampling, we capture parameter degeneracies and rigorously propagate both statistical and systematic uncertainties. Our results yield robust and precise spin measurements from both approaches. Our Bayesian analysis fetches spin $a_*= 0.93_{-0.04}^{+0.05}$, mass $M_{\\rm BH} = 9.0_{-2.0}^{+2.0} \\, M_\\odot$, distance $d_{\\rm BH} = 10.5_{-1.2}^{+1.3}$~kpc, and inclination angle $i=53.8_{-1.3}^{+1.3}$~deg. It also demonstrates the power of Bayesian inference in fetching valuable insights into the complex physics of black hole accretion and enabling high-confidence measurements of fundamental parameters.",
      "pdf_url": "https://arxiv.org/pdf/2509.09481.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09590",
      "title": "Ultra-high energy event KM3-230213A as a cosmogenic neutrino in light of minimal UHECR flux models",
      "authors": [
        "M. Yu. Kuznetsov",
        "N. A. Petrov",
        "Y. S. Savchenko"
      ],
      "abstract": "Ultra-high energy event KM3-230213A as a cosmogenic neutrino in light of minimal UHECR flux models M. Yu. Kuznetsov, N. A. Petrov, Y. S. Savchenko High Energy Astrophysical Phenomena (astro-ph.HE) Recently, the KM3NeT experiment reported the detection of a neutrino with exceptionally high energy E = 220 PeV, whose origin remains unclear. The corresponding value of the neutrino flux is in tension with the results of other high-energy neutrino experiments. In this study, we discuss the possibility that this neutrino is cosmogenic, i. e., produced by ultra-high energy cosmic rays (UHECR) during their propagation through the intergalactic medium. We adopt the UHECR flux models derived by the Telescope Array experiment, which features a predominantly light mass composition. We show that the predictions of the cosmogenic neutrino flux in these models are consistent with the measurements of the KM3NeT-only and with that of the \"global neutrino observatory\" at approximately 2${\\sigma}$ level. Notably, this result is achieved in a minimal version of the UHECR flux models, that assume one source population with a standard cosmological evolution. We also estimate the corresponding cosmogenic gamma-ray flux and show that it is consistent with Fermi-LAT IGRB measurements and UHE gamma-ray limits; the improvement of the latter can probe these predictions in future.",
      "pdf_url": "https://arxiv.org/pdf/2509.09590.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09605",
      "title": "Multiwavelength observations of a new black-widow millisecond pulsar PSR J1544-2555",
      "authors": [
        "Sergio Belmonte Diaz",
        "Tinn Thingmeearkom",
        "Adipol Phosrisom",
        "Rene Breton",
        "Marta Burgay",
        "Colin Clark",
        "Lars Nieder",
        "Martin Mayer",
        "Werner Becker",
        "Ewann Barr",
        "Sarah Buchner",
        "Kaustav Kashyap Das",
        "Vik Dhillon",
        "Oliver Dodge",
        "Elizabeth Ferrara",
        "Jean-Mathias Griessmeier",
        "Ramesh Karuppusamy",
        "Mark Kennedy",
        "Michael Kramer",
        "Prajwal Padmanabh",
        "John Paice",
        "Antonio Rodriguez",
        "Ben Stappers"
      ],
      "abstract": "Multiwavelength observations of a new black-widow millisecond pulsar PSR J1544-2555 Sergio Belmonte Diaz, Tinn Thingmeearkom, Adipol Phosrisom, Rene Breton, Marta Burgay, Colin Clark, Lars Nieder, Martin Mayer, Werner Becker, Ewann Barr, Sarah Buchner, Kaustav Kashyap Das, Vik Dhillon, Oliver Dodge, Elizabeth Ferrara, Jean-Mathias Griessmeier, Ramesh Karuppusamy, Mark Kennedy, Michael Kramer, Prajwal Padmanabh, John Paice, Antonio Rodriguez, Ben Stappers Accepted for publication in Monthly Notices of the Royal Astronomical Society. 16 pages. 11 figures High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We report the discovery of a new black-widow millisecond pulsar, PSR J1544-2555, associated with the Fermi-LAT source 4FGL J1544.2-2554. Optical, radio, and gamma-ray observations confirmed its nature as a compact spider binary system. Optical photometry from ULTRACAM revealed a \\(\\sim\\)2.7-hour orbital period, guiding MeerKAT observations that detected \\(\\sim\\)2.4-ms radio pulsations. Subsequent timing campaigns using the Murriyang Parkes Telescope, the Effelsberg 100-m Radio Telescope, and the Nançay Radio Telescope allowed us to obtain a preliminary timing solution, which enabled us to find gamma-ray pulsations. The final timing solution, spanning 16 years of Fermi-LAT gamma-ray data, also displays orbital period variations typical of spider pulsars. X-ray observations from eROSITA indicate non-thermal emission, but the relatively low count rate prohibits the search for X-ray pulsations. Optical light curve modelling using Icarus suggests the asymmetry is best explained by a spot model, where uneven heating creates localised temperature variations on the companion. While the optical spectra we obtained are compatible with the physical properties we infer for the companion star, they were not of sufficient signal-to-noise to allow for radial velocity measurements, thus limiting constraints on the neutron star's mass. The observed bluer colour near the light curve minimum suggests possible non-thermal emission from intra-binary shocks, supported by the presence of an X-ray source. This discovery exemplifies the proven capability of the Fermi-LAT catalogue in identifying millisecond pulsar candidates and highlights the role of optical surveys in detecting variable sources suitable for radio follow-up.",
      "pdf_url": "https://arxiv.org/pdf/2509.09605.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09328",
      "title": "Reconstruction of the depth of the shower maximum of air showers with the SD-750 surface detector of the Pierre Auger Observatory using neural networks",
      "authors": [
        "Steffen Hahn"
      ],
      "abstract": "Reconstruction of the depth of the shower maximum of air showers with the SD-750 surface detector of the Pierre Auger Observatory using neural networks Steffen Hahn (for the Pierre Auger Collaboration) Presented at the 39th International Cosmic Ray Conference (ICRC 2025). 8 pages, 4 figures Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) The origin of ultra-high-energy cosmic rays (UHECRs) is one of the intriguing mysteries in astroparticle physics. In order to identify their sources, we need precise knowledge of the mass composition of UHECRs. The direct detection of UHECRs is not feasible at energies above 0.1 PeV, necessitating the use of mass-sensitive observables of extended air showers induced by UHECRs interacting with the atmosphere. One way to achieve high statistics for these mass-sensitive observables is to use ground-based detector arrays, such as the Surface Detector (SD) of the Pierre Auger Observatory. The SD consists of three sub-arrays of independent detector stations arranged in triangular grids with different spacings. Recently, it has been shown that neural networks (NNs) can extract mass-sensitive observables from data taken by the SD-1500, the largest sub-detector of the SD. In this contribution, we demonstrate the feasibility of using NNs to reconstruct a high-level shower observable, the depth of the shower maximum, from data simulated for and observed by the SD-750, the second-largest detector array nested within the SD-1500. A simulation study shows that the SD-750 NN exhibits behavior similar to that of an SD-1500 NN and outperforms the latter in the energy range [1, 10) EeV. Moreover, we show that, after performing a correction and calibration procedure, the predictions of the SD-750 NN are consistent with the measurement of the depth of the shower maximum obtained by the Fluorescence Detector of the Pierre Auger Observatory.",
      "pdf_url": "https://arxiv.org/pdf/2509.09328.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09419",
      "title": "Impact of rotation on the accretion of entropy perturbations in collapsing massive stars",
      "authors": [
        "Olzhas Mukazhanov"
      ],
      "abstract": "Impact of rotation on the accretion of entropy perturbations in collapsing massive stars Olzhas Mukazhanov 26 pages, 5 figures. Submitted to Ap&SS (single-column format) Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Convection in the innermost shells of massive stars plays an important role in initiating core-collapse supernovae. When these convective motions reach the supernova shock, they create extra turbulence, which helps energize the explosion. In our earlier work, we studied the effect of rotation on the hydrodynamic evolution of convective vortices in collapsing stars. This study focuses on how rotation influences the entropy perturbations, which naturally form in turbulent convection. As these perturbations are carried inward with the collapsing star, they generate both vorticity and sound waves. Using linear perturbation theory, we model entropy waves as small disturbances on top of a steady background flow. Our results show that stellar rotation has little effect on the evolution of entropy perturbations during collapse, prior to encountering the supernova shock. This outcome is consistent with our earlier findings on the limited influence of rotation in the accretion of convective eddies.",
      "pdf_url": "https://arxiv.org/pdf/2509.09419.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.10811",
      "title": "A FLASH on Blazars: Capturing the Radio Realm of 4FGL Blazars with SKAO Pathfinders",
      "authors": [
        "Meriem Behiri",
        "Elizabeth Mahony",
        "Elaine Sadler",
        "Emily Kerrison",
        "Alberto Traina",
        "MariaVittoria Zanchettin",
        "Vincenzo Galluzzi",
        "Andrea Lapi",
        "Marcella Massardi"
      ],
      "abstract": "A FLASH on Blazars: Capturing the Radio Realm of 4FGL Blazars with SKAO Pathfinders Meriem Behiri, Elizabeth Mahony, Elaine Sadler, Emily Kerrison, Alberto Traina, MariaVittoria Zanchettin, Vincenzo Galluzzi, Andrea Lapi, Marcella Massardi 15 pages, 9 figures, Accepted for publication in Astronomy & Astrophysics (A&A). DOI: https://doi.org/10.1051/0004-6361/202554523 High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) This work investigates the multi-wavelength properties of 165 4FGL blazars from the Fermi-LAT fourth source catalogue, looking for with counterparts in the Australian SKA Pathfinder (ASKAP) First Large Absorption Survey in HI (FLASH) continuum. Using high-resolution data from FLASH and complementary radio datasets, combined with archival Atacama Large Millimeter Array (ALMA) observations, we perform detailed spectral energy distribution (SED) analyses across cm-to-mm wavelengths. Our findings reveal that most blazars exhibit re-triggered peaked spectra, indicative of emission dominated by a single emitting region. Additionally, we identify strong correlations between radio and gamma-ray luminosities, highlighting the significant role of relativistic jets in these active galactic nuclei. The inclusion of spectroscopic redshifts from Sloan Digital Sky Survey (SDSS) and Gaia enables a comprehensive analysis of the evolutionary trends and physical characteristics of the sources. Furthermore, we report a tight Radio-X-ray Correlation for Flat Spectrum Radio Quasars, contrasting with the more scattered behaviour observed in BL-Lacs, reflecting their distinct accretion and jet-driving mechanisms. These results provide critical insights into the physics of blazars and their environments, paving the way for future studies with next-generation facilities like the SKA Observatory (SKAO) for radio observations and Cherenkov Telescope Array for gamma-ray studies.",
      "pdf_url": "https://arxiv.org/pdf/2503.10811.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.09138",
      "title": "Can repeating and non-repeating FRBs be drawn from the same population?",
      "authors": [
        "Paz Beniamini",
        "Pawan Kumar"
      ],
      "abstract": "Can repeating and non-repeating FRBs be drawn from the same population? Paz Beniamini, Pawan Kumar Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Do all Fast Radio Burst (FRB) sources repeat? We present evidence that FRB sources follow a Zipf-like distribution, in which the number density of sources is approximately inversely proportional to their burst rate above a fixed energy threshold-even though both the burst rate and number density span many orders of magnitude individually. We introduce a model-independent framework that predicts the distribution of observed fluences and distances, and repetition rates of an FRB population based on an assumed burst rate distribution per source. Using parameters derived directly from observations, this framework simultaneously explains several key features of the FRB population: (i) The observed ratio of repeaters to apparent non-repeaters; (ii) The much lower ratio of apparent non-repeaters to the total number of Soft Gamma Repeater (SGR) sources within the observable Universe; And (iii) the slightly smaller average distances of known repeaters compared to non-repeaters. We further explore how survey parameters, such as radio sensitivity and observation time, influence these statistics. Notably, we find that the fraction of repeaters rises only mildly with improved sensitivity or longer exposure. This weak dependence could be misinterpreted as evidence that not all FRBs repeat. Overall, our results support the idea that a single population-likely magnetars-can account for the full observed diversity of FRB activity, from very inactive FRB sources like SGR 1935+2154 to the most active repeaters.",
      "pdf_url": "https://arxiv.org/pdf/2506.09138.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.21131",
      "title": "Temporal evolution of quasi-periodic oscillations in an accreting black hole Swift J1727.8-1613: coevolution of the disk-corona during the state transition",
      "authors": [
        "Sai-En Xu",
        "Bei You",
        "Yi Long",
        "Han He"
      ],
      "abstract": "Temporal evolution of quasi-periodic oscillations in an accreting black hole Swift J1727.8-1613: coevolution of the disk-corona during the state transition Sai-En Xu, Bei You, Yi Long, Han He 17 pages, 11 figures, accepted by ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Low-frequency quasi-periodic oscillations (QPOs) are commonly observed in black hole X-ray binaries, and their frequency has been found to correlate with various spectral properties. In this work, we present a detailed timing analysis of Swift J1727.8-1613, revealing a novel two-branch correlation between the QPO frequency and the observed disk emission, which differs from previous findings of a single correlation. Specifically, at QPO frequencies below 3 Hz, the QPO frequency is negatively correlated with the observed disk emission. This negative relation transitions to a positive one, as the QPO frequency exceeds approximately 3 Hz. The correlation between QPO frequency and Compton flux exhibits an opposite trend, with a positive correlation at lower frequencies and a negative correlation at higher ones. We interpret these behaviors as signatures of an evolving disk-corona geometry, within the framework of a Lense-Thirring precessing hot flow. Additionally, we find that during the flare state, the QPO fractional root-mean-square (rms) remains nearly constant above 15 keV, but increases with energy below this threshold. The slope of the rms-energy relation increases as the energy spectrum softens.",
      "pdf_url": "https://arxiv.org/pdf/2506.21131.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.04784",
      "title": "Asymmetric emissions of neutrinos in the cooling of rotating proto-neutron stars",
      "authors": [
        "Laura Barrio",
        "Kotaro Fujisawa",
        "Ryuichiro Akaho",
        "Hiroki Nagakura",
        "Shoichi Yamada"
      ],
      "abstract": "Asymmetric emissions of neutrinos in the cooling of rotating proto-neutron stars Laura Barrio, Kotaro Fujisawa, Ryuichiro Akaho, Hiroki Nagakura, Shoichi Yamada High Energy Astrophysical Phenomena (astro-ph.HE) We evaluate global asymmetry in the luminosities of neutrinos emitted from rapidly-rotating proto-neutron stars (PNS's). We build axisymmetric models of PNS's in mechanical equilibrium with rotation by adding prescribed angular momentum distributions by hand to non-rotational PNS models, which are extracted from a one-dimensional (spherically symmetric) PNS cooling calculation at different times: \\(t=2, 6, 10, 20, 30\\)s after a supernova explosion. We then conduct two-dimensional (spatially axisymmetric) neutrino transport calculations on top of them with the matter profiles (and the spacetime geometry) fixed. We find for the rapidly-rotating models with \\(T/|W|\\sim 5\\times 10^{-2}\\) that the neutrino luminosity changes by \\(\\sim 3 \\% \\) depending on the observer position. We give detailed analyses of the neutrino-hemispheres as well as the neutrino luminosities that are defined observer-wise. We also calculate the low-frequency (\\(\\lesssim 1{\\rm Hz}\\)) gravitational waves produced by the neutrinos radiated asymmetrically. We find that those gravitational waves, if emitted from the Galactic center, can be detected by planned detectors such as B-DECIGO, DECIGO and AILA. Finally, we look for crossings in the energy-integrated angular distributions in momentum space for the electron neutrino sector, a signature of the fast flavor conversion. We find them near the PNS surface in all models.",
      "pdf_url": "https://arxiv.org/pdf/2507.04784.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.08709",
      "title": "GeV Gamma-Rays from Molecular Clouds Illuminated by Particles Diffusing from the Adjacent Supernova Remnant G335.2+0.1 Confined in an Expanding Bubble",
      "authors": [
        "Chen Huang",
        "Xiao Zhang",
        "Yang Chen",
        "Qian-Qian Zhang",
        "Wen-Juan Zhong",
        "Xin Zhou"
      ],
      "abstract": "GeV Gamma-Rays from Molecular Clouds Illuminated by Particles Diffusing from the Adjacent Supernova Remnant G335.2+0.1 Confined in an Expanding Bubble Chen Huang, Xiao Zhang, Yang Chen, Qian-Qian Zhang, Wen-Juan Zhong, Xin Zhou Accepted for publication in ApJ. 12 pages. 10 figures & 4 tables included High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We report the detection of GeV gamma-ray emission likely associated with supernova remnant (SNR) G335.2+0.1 and the finding of a molecular cloud ($\\sim20$--$30^\\prime$ in angular size) that is very likely in physical contact with the SNR and responsible for the gamma-ray emission. Using the 16.8 yr Fermi-LAT data, an extended emission, with a significance of 13.5 $\\sigma$ and a radius 0.24° in 0.2--500 GeV in the uniform-disk model, was found to the adjacent east of the SNR. With archival Mopra CO-line data, a large molecular clump at local-standard-of-rest velocity $\\sim-48$ to $-43$ km s$^{-1}$ was revealed appearing coincident with the gamma-ray source. The SNR was found located in a cavity encircled by a 'C'-shaped ring-like molecular shell at $-45$ to $-43$ km s$^{-1}$. This morphological agreement, together with the position-velociy diagrams made along lines cutting across the cavity, suggests that the SNR was evolving in the expanding molecular bubble created by the stellar wind of the progenitor with a mass $\\gtrsim 15 M_{\\mathrm{sun}}$. The giant molecular cloud, visible at around $-46$ km s$^{-1}$, and the associated SNR are thus estimated to lie at a kinematic distance of 3.1 kpc, with the HI absorption taken into account. We suggest that the SNR has entered the radiative phase after the blastwave recently struck the cavity wall. With the evolutionary scenario of the SNR, we demonstrate that the gamma-ray emission reported here can be naturally interpreted by the hadronic interaction between the accelerated protons that escaped from the SNR shock and the eastern large molecular clump.",
      "pdf_url": "https://arxiv.org/pdf/2507.08709.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.21032",
      "title": "Revisiting the Perseus Cluster I: Resolving the Si/S/Ar/Ca ratios by Stellar Convection",
      "authors": [
        "Shing-Chi Leung",
        "Ken'ichi Nomoto",
        "Aurora Simionescu"
      ],
      "abstract": "Revisiting the Perseus Cluster I: Resolving the Si/S/Ar/Ca ratios by Stellar Convection Shing-Chi Leung, Ken'ichi Nomoto, Aurora Simionescu 21 pages, 31 figures. Submitted to the Astrophysical Journal on Jul 7 2024, accepted on Jul 24 2025, published on Sep 9 2025 The Astrophysical Journal 990, 207 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Chemical abundance measurements from stars in the Milky Way to the intragalactic medium in the Perseus Cluster have challenged the spherical explosion models. Models in the literature cannot closely match the observed element ratios, where Si, S are overproduced and Ar, Ca are underproduced. In this article, we explore the impact of the model parameters during the evolution of massive stars on the final explosive nucleosynthesis. We investigate the effects of a parametrized model of the convective process, including the mixing length parameter and the semi-convection parameter, on the production of Si-group elements. We search for the value pair that can reduce the discrepancy in the models. We conclude that a mixing length parameter of 2.2 and semi-convection parameter of 0.03 are required to fit these criteria. Using this updated value pair, we compute a sequence of massive star models from $M_{\\rm ZAMS} = $ 15 -- 40 $M_{\\odot}$. The high resolution data from future observations such as XRISM will provide further details on less constrained processes in stellar evolution and supernova explosion. Future comparison with supernova models of various progenitor metallicity will further shed light on the supernova population and their relative rates on cosmological scales.",
      "pdf_url": "https://arxiv.org/pdf/2507.21032.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.23122",
      "title": "A Comprehensive Study of the Energy and Redshift Distributions of the Fast Radio Burst Population Based on the First CHIME/FRB Catalog",
      "authors": [
        "Qing-Zhen Lei",
        "Xin-Zhe Wang",
        "Can-Min Deng"
      ],
      "abstract": "A Comprehensive Study of the Energy and Redshift Distributions of the Fast Radio Burst Population Based on the First CHIME/FRB Catalog Qing-Zhen Lei, Xin-Zhe Wang, Can-Min Deng 18 pages, 7 figures, 2 tables, published in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs) are brief, high-energy bursts of radio waves from extragalactic sources, and their origin remains an open question. In this paper, we perform a comprehensive analysis of the FRB population using the first CHIME/FRB catalog, focusing on their energy and redshift distribution, with careful consideration of selection effects. We investigate a range of models, including the Schechter function and the broken power-law function for the energy distribution, and several redshift evolution models, such as the star formation history (SFH) model, as well as models incorporating time delays relative to the SFH or additional redshift evolution factors. Our results indicate that the energy distribution of FRBs is best described by the Schechter function, with a power-law index of $\\gamma = -1.49^{+0.37}_{-0.27}$ and a characteristic cutoff energy of $E_\\mathrm{c} = 2.82^{+2.43}_{-1.47} \\times 10^{41}$ erg. Furthermore, we find no evidence for redshift evolution in the energy distribution of FRBs. In terms of their redshift distribution, our analysis shows that it follows the cosmic SFH, without requiring additional delayed components or redshift evolution factors, suggesting that most FRBs likely originate from young stellar populations. Simultaneously, we infer a local volumetric rate of $\\Phi_0 = 4.68^{+4.66}_{-2.39} \\times 10^{4} \\rm \\ Gpc^{-3}yr^{-1}$ for $E>10^{39}$ erg. These results, robust against CHIME observational biases, may provide new insights into the underlying properties of the FRB population.",
      "pdf_url": "https://arxiv.org/pdf/2507.23122.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03593",
      "title": "Unraveling the Nature of the Nuclear Transient AT2020adpi",
      "authors": [
        "Paarmita Pandey",
        "Jason Hinkle",
        "Christopher Kochanek",
        "Michael Tucker",
        "Mark Reynolds",
        "Jack Neustadt",
        "Todd Thompson",
        "Katie Auchettl",
        "Benjamin Shappee",
        "Aaron Do",
        "Dhvanil Desai",
        "W. Hoogendam",
        "C. Ashall",
        "Thomas Lowe",
        "Melissa Shahbandeh",
        "Anna Payne"
      ],
      "abstract": "Unraveling the Nature of the Nuclear Transient AT2020adpi Paarmita Pandey, Jason Hinkle, Christopher Kochanek, Michael Tucker, Mark Reynolds, Jack Neustadt, Todd Thompson, Katie Auchettl, Benjamin Shappee, Aaron Do, Dhvanil Desai, W. Hoogendam, C. Ashall, Thomas Lowe, Melissa Shahbandeh, Anna Payne Submitted to The Open Journal of Astrophysics, 11 pages, 8 figures High Energy Astrophysical Phenomena (astro-ph.HE) Transient events associated with supermassive black holes provide rare opportunities to study accretion and the environments of supermassive black holes. We present a multiwavelength study of AT2020adpi (ZTF20acvfraq), a luminous optical/UV transient in the nucleus of the galaxy WISEA J231853.77$-$103505.6 ($z=0.26$) that exhibits the properties of an ambiguous nuclear transient. Near peak, its spectral energy distribution is well described by a power law ($\\lambda L_\\lambda \\propto \\lambda^{-\\alpha}$, $\\alpha = 0.44 \\pm 0.04$), with a maximum $g$-band luminosity of $(3.6 \\pm 0.6)\\times10^{44}$ erg s$^{-1}$, which is consistent with luminous AGN flares. We detect a strong mid-infrared flare ($L_\\mathrm{peak}^{\\mathrm{MIR}} = (2.3 \\pm 0.05)\\times10^{44}$ erg s$^{-1}$) delayed by $\\sim$240 rest-frame days, indicating a hot dust echo from material at $\\sim$0.2 pc. The optical and near-infrared spectra show broad H, He I, [OIII] lines, as well as narrow Fe II, and prominent Mg II, which is a combination not typical of TDEs. Taken together, these features suggest AT2020adpi is an ambiguous nuclear transient, where an accretion episode was triggered by stellar disruption of an accretion disk or instabilities within an active nucleus. This source demonstrates the need for careful multiwavelength analysis to distinguish between extreme AGN variability and TDEs.",
      "pdf_url": "https://arxiv.org/pdf/2509.03593.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.04497",
      "title": "Dance to Demise -- How Massive Stars May Form Dense Circumstellar Shells Before Explosion",
      "authors": [
        "Sutirtha Sengupta",
        "Das Sujit",
        "Arkaprabha Sarangi"
      ],
      "abstract": "Dance to Demise -- How Massive Stars May Form Dense Circumstellar Shells Before Explosion Sutirtha Sengupta, Das Sujit, Arkaprabha Sarangi Revised in response to referee comments from The Astrophysical Journal (ApJ) Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the evolution of red supergiant (RSG) progenitors of core-collapse (CC) supernovae (SNe) with initial masses between $12-20~\\mathrm{M}_{\\odot}$ focusing on effects of enhanced mass loss due to pulsation-driven instabilities in their envelopes and subsequent dynamical ejections during advanced stages of nuclear burning. Using time-dependent mass loss rates from detailed MESA stellar evolution models, including prescriptions for both pulsation-driven superwinds and shock-induced ejections, we construct the circumstellar medium (CSM) before the SN explosion. We calculate resulting CSM density profiles and column densities considering the radiation-driven acceleration of the stellar wind. Our models produce episodes of enhanced mass loss $\\sim 10^{-4}-10^{-2}~ \\mathrm{M}_{\\odot}~\\mathrm{yr}^{-1}$ in the last centuries-decades before explosion forming dense CSM ($\\gtrsim10^{-15}~\\mathrm{g~cm}^{-3}$ at distances $\\lesssim10^{15}~\\mathrm{cm}$) - consistent with multi-wavelength observations of Type II SNe such as SN 2023ixf, SN 2020ywx, SN 2017hcc, SN 2005ip and SN 1998S. The formation of such dense CS shells, as predicted by our single star RSG models, provides a natural explanation for observed flash-ionization signatures, X-ray and radio emission, and has important implications for dust formation around Type II SNe.",
      "pdf_url": "https://arxiv.org/pdf/2508.04497.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08887",
      "title": "Dusty Clump Survival in Supernova Ejecta: Dust-Mediated Growth vs. Crushing by the Reverse Shock",
      "authors": [
        "Sergio Martínez-González"
      ],
      "abstract": "Dusty Clump Survival in Supernova Ejecta: Dust-Mediated Growth vs. Crushing by the Reverse Shock Sergio Martínez-González 4 pages, 2 figures. Accepted as a Letter in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) Understanding the interaction of dense, cold ejecta clumps with a fast reverse shock, an instance of the \"cloud-crushing\" problem, is essential to assess whether core-collapse supernovae act as net dust factories or net dust destroyers. This work assesses whether dusty ejecta clumps are destroyed by the reverse shock or instead cool, condense, and grow in mass under realistic supernova-remnant conditions. Cloud-crushing timescales are computed and compared to radiative cooling timescales, including both gas-phase cooling and dust-induced cooling, for a large grid of clump densities, dust-to-gas mass ratios, and shock velocities. When the dust-to-gas mass ratio exceeds $10^{-3}$, gas-grain collisions become efficient enough that the cooling timescale $t_{\\rm cool}$ falls below the cloud-crushing timescale $t_{\\rm cc}$ over a broad span of clump densities and shock velocities, enabling dusty clumps to survive even fast reverse shocks. For example, at clump densities $\\geq 2 \\times 10^{4}$ cm$^{-3}$, dust-to-gas mass ratios $\\sim 10^{-2}$, and shock velocities up to $2000$ km s$^{-1}$, enhanced gas-grain cooling drives the system into a regime where dusty clumps can gain additional cold mass and increase their dust masses. Strong radiative cooling can shield dust-rich clumps in supernova remnants, enabling a significant fraction of ejecta dust to be injected into the interstellar medium. These results mirror the \"growth\" regime found in studies of circumgalactic clouds and rapidly cooling shocked stellar winds, implying a larger dust survival in supernova remnants. Indeed, the dusty globules seen in the Crab Nebula occupy the predicted survival regime across a wide range of physical parameters.",
      "pdf_url": "https://arxiv.org/pdf/2509.08887.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08891",
      "title": "An Extremely-High Velocity Outflow in SMSS J2157-3602, the most luminous quasar in the first 1.3 Gyr",
      "authors": [
        "Giustina Vietri",
        "Paola Rodriguez Hidalgo",
        "Amy Rankine",
        "Luca Zappacosta",
        "Enrico Piconcelli",
        "Liliana Flores",
        "Ivano Saccheo",
        "Andrea Melandri",
        "Vincenzo Testa",
        "Patrick B. Hall",
        "Flaminia Sarnari",
        "Wendy F. Garcia Naranjo",
        "Tzitzi Romo Perez",
        "Valentina D'Odorico",
        "Giorgio Lanzuisi",
        "Toru Misawa",
        "Christopher A. Onken",
        "Cristian Vignali",
        "Christian Wolf"
      ],
      "abstract": "An Extremely-High Velocity Outflow in SMSS J2157-3602, the most luminous quasar in the first 1.3 Gyr Giustina Vietri, Paola Rodriguez Hidalgo, Amy Rankine, Luca Zappacosta, Enrico Piconcelli, Liliana Flores, Ivano Saccheo, Andrea Melandri, Vincenzo Testa, Patrick B. Hall, Flaminia Sarnari, Wendy F. Garcia Naranjo, Tzitzi Romo Perez, Valentina D'Odorico, Giorgio Lanzuisi, Toru Misawa, Christopher A. Onken, Cristian Vignali, Christian Wolf Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) We report the discovery of an extremely high-velocity outflow (EHVO) in the most luminous ($L\\rm_{Bol}$ $\\sim$ 2.29 $\\times$ 10$^{48}$ erg/s) QSO, SMSS J2157-3602, at z=4.692. Combined XSHOOTER and NIRES observations reveal that the EHVO reaches a maximum velocity of v$_\\mathrm{max} \\sim 0.13c$ and persists over rest-frame timescales of a few months to one year. SMSS J2157-3602 also exhibits one of the highest balnicity index discovered in an EHVO so far. In addition, the blueshifted CIV emission traces a high-velocity (v$\\rm_{CIV}^{50}\\sim$ 4660 km/s) outflow from the broad-line region. Thanks to an XMM-Newton observation, we also discover the X-ray weak nature of this QSO, which likely prevents the overionization of the innermost disk atmosphere and facilitates the efficient launch of the detected EHVO and BLR winds. The extraordinary luminosity of SMSS J2157-3602 and the extreme velocity of the EHVO make it a unique laboratory for testing AGN driven feedback under extreme conditions. Current uncertainties on the outflow's location and column density strengthen the case for dedicated follow-up, which will be essential to assess the full feedback potential of this remarkable quasar.",
      "pdf_url": "https://arxiv.org/pdf/2509.08891.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09011",
      "title": "The Hubble Arp Galaxy Survey",
      "authors": [
        "Julianne J. Dalcanton , Meredith J. Durbin , Benjamin F. Williams Center for Computational Astrophysics, Flatiron Institute, Department of Astronomy, University of Washington, Department of Astronomy, University of California, Berkeley)"
      ],
      "abstract": "Julianne J. Dalcanton (1,2), Meredith J. Durbin (2,3), Benjamin F. Williams (2) ((1) Center for Computational Astrophysics, Flatiron Institute, (2) Department of Astronomy, University of Washington, (3) Department of Astronomy, University of California, Berkeley) Astrophysical Journal Supplement Series, accepted; 151pgs, 92pgs of figures. Due to size limits, the ArXiv version does not include the complete set of 216 full-resolution HST images, shown alongside multiwavelength comparison images spanning from the UV to the radio. These are available in the journal, or a single, large (but beautiful) PDF on Zenodo (this https URL) Astrophysics of Galaxies (astro-ph.GA) The typical galaxy in the local universe is expected to be in a self-regulated quasi-equilibrium, displaying a settled morphology that falls within the Hubble Sequence. The Arp and Arp-Madore catalogs are filled with striking examples of galaxies that defy these expectations, making them useful targets for studying the astrophysics that controls dramatic, but short-lived, episodes of disequilibrium that mark galaxies' evolution. In this paper, we greatly expand the available Hubble Space Telescope (HST) imaging of galaxies drawn from the Arp and Arp-Madore catalogs. We present new optical F606W images and point-source photometry for 216 systems, whose sizes are well-matched to the Advanced Camera for Surveys' (ACS) wide field of view. Essentially none of the sample had been previously observed with Hubble. The resulting images display rich morphologies, revealing a variety of massive stars, HII regions, stellar clusters, dust lanes, tidal tails, backlit galaxies, and occasional chance superpositions. We provide a pedagogical guide for interpreting highly-resolved optical galaxy images, which has general application beyond this atlas. The atlas images also provide a superb starting point for more detailed studies with high-resolution imaging in other wavelengths, and spectroscopy to track kinematics and the interstellar medium (ISM). Areas of obvious scientific relevance include feedback and star formation in merging and interacting galaxies, resolved stellar populations at the extremes of stellar density, the properties of young massive stars and stellar clusters, the physics of the cold ISM and dust, and stellar and gas dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2509.09011.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09203",
      "title": "Modeling Long-Wavelength Amorphous Dust Emission Based on the Physically Motivated Soft-Potential Model",
      "authors": [
        "Masashi Nashimoto"
      ],
      "abstract": "Modeling Long-Wavelength Amorphous Dust Emission Based on the Physically Motivated Soft-Potential Model Masashi Nashimoto 19 pages, 10 figures, 3 tables, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We propose a new amorphous dust emission model based on the soft-potential (SP) model, applicable in the long-wavelength range from the far-infrared to the microwave. The SP model is widely accepted in material physics to explain amorphous thermal properties and is an extension of the two-level systems (TLS) model, which has been applied in interstellar amorphous dust physics. In the SP model, by assuming that some atoms composing amorphous dust are trapped in a double-well potential (DWP) described by a quartic function, the electric interaction can be solved directly, allowing the absorption cross-section of the amorphous dust to be calculated. We present numerical and analytical solutions for the absorption cross-section of amorphous dust and compare these results, finding good agreement for the DWP with a sufficiently high potential barrier. Our findings show that the SP model can reproduce the observed spectrum of the Perseus molecular cloud with slightly better accuracy than the conventional TLS model. Additionally, the SP model can more effectively explain various long-wavelength dust emission features, such as the spectrum flattening in the submillimeter range and anomalous microwave emission (AME), compared to the TLS model. Further comparison and verification with observational data and laboratory measurements are necessary to refine the model.",
      "pdf_url": "https://arxiv.org/pdf/2509.09203.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09279",
      "title": "Tidal Tails and Their Dynamics in Open Clusters Using Gaia DR3",
      "authors": [
        "Ira Sharma",
        "Vikrant V. Jadhav",
        "Annapurni Subramaniam"
      ],
      "abstract": "Tidal Tails and Their Dynamics in Open Clusters Using Gaia DR3 Ira Sharma, Vikrant V. Jadhav, Annapurni Subramaniam 4 pages, 2 figures, 1 table. Poster paper from IAU Symposium 398 / MODEST-25. To appear in the Proceedings of IAU Symposium 398, published by Cambridge University Press Astrophysics of Galaxies (astro-ph.GA) This research presents unsupervised machine learning and statistical techniques to detect and analyze tidal tails in five open clusters, BH 164, Alessi 2, NGC 2281, NGC 2354, and M67, with ages ranging from 60 Myr to 4 Gyr, using Gaia DR3 data. Color-magnitude diagram (CMD) matching, principal component analysis (PCA), and density-based clustering were used to detect the tails. Tidal tails were found in all clusters, extending 40 to 100 pc and containing 100 to 200 stars. Other statistical methods were used to study the stellar kinematics, photometry, and spatial distribution of the detected features. The tails had luminosity functions similar to their parent clusters, generally lacked massive stars, and showed higher binary fractions. Significant rotation was detected in M67 and NGC 2281 for the first time.",
      "pdf_url": "https://arxiv.org/pdf/2509.09279.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09355",
      "title": "The History of Galaxy Mergers in IllustrisTNG",
      "authors": [
        "Bendeguz Koncz",
        "Istvan Horvath",
        "András Péter Joó",
        "Andreas Burkert",
        "L. Viktor Tóth"
      ],
      "abstract": "The History of Galaxy Mergers in IllustrisTNG Bendeguz Koncz, Istvan Horvath, András Péter Joó, Andreas Burkert, L. Viktor Tóth Astrophysics of Galaxies (astro-ph.GA) The process of galaxy evolution over cosmic time is not yet fully understood, since there is a debate on the impact of galaxy collisions on the star formation and metallicity. The local environment of the galaxy mergers could also have a large impact on the evolution of the galaxies, but it has not yet been possible to examine it in detail. Modern simulations with larger capacity, including the newest physical knowledge and new observations with JWST, help us to answer these questions. Using the IllustrisTNG cosmological simulation, we processed the catalogue data and the merger tree files of the TNG300-1 simulation. We calculated the galaxies average star formation rate (SFR) and mass at redshifts between 0 < z < 15. We investigated the environment of galaxy mergers, with the focus on the local density, and also examined how the SFR changes in merging galaxies. We compared our findings with JWST results and highlighted differences in the star formation rate density (SFRD) history between the models and observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.09355.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09417",
      "title": "LMC+: Large-scale mapping of [CII] and [OIII] in the LMC molecular ridge, I. Dataset and line ratio analyses",
      "authors": [
        "C. Fischer",
        "S.C. Madden",
        "A. Krabbe",
        "F.L. Polles",
        "D. Fadda",
        "E. Tarantino",
        "F. Galliano",
        "C.-H. R. Chen",
        "N. Abel",
        "A. Beck",
        "L. Belloir",
        "F. Bigiel",
        "A. Bolatto",
        "M. Chevance",
        "S. Colditz",
        "N. Fischer",
        "A. Green",
        "A. Hughes",
        "R. Indebetouw",
        "C. Iserlohe",
        "M. Kaźmierczak-Barthel",
        "R. Klein",
        "A. Lambert-Huyghe",
        "V. Lebouteiller",
        "E. Mikheeva",
        "A. Poglitsch",
        "L. Ramambason",
        "W. Reach",
        "M. Rubio",
        "W. Vacca",
        "T. Wong",
        "H. Zinnecker"
      ],
      "abstract": "LMC+: Large-scale mapping of [CII] and [OIII] in the LMC molecular ridge, I. Dataset and line ratio analyses C. Fischer, S.C. Madden, A. Krabbe, F.L. Polles, D. Fadda, E. Tarantino, F. Galliano, C.-H. R. Chen, N. Abel, A. Beck, L. Belloir, F. Bigiel, A. Bolatto, M. Chevance, S. Colditz, N. Fischer, A. Green, A. Hughes, R. Indebetouw, C. Iserlohe, M. Kaźmierczak-Barthel, R. Klein, A. Lambert-Huyghe, V. Lebouteiller, E. Mikheeva, A. Poglitsch, L. Ramambason, W. Reach, M. Rubio, W. Vacca, T. Wong, H. Zinnecker 15 pages, 9 figures, 3 tables, accepted to Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) The fundamental process of star formation in galaxies involves the interplay between the fueling of star formation via molecular gas and the feedback from recently formed massive stars. This process, by which galaxies evolve, is also closely connected to the intrinsic properties of the interstellar medium (ISM). To study the role that different molecular and atomic phases of the ISM play in star formation, and to characterize their physical conditions, we zoom into our nearest neighboring galaxy, the Large Magellanic Cloud (LMC; 50 kpc). The LMC offers a view of the ISM and star formation conditions in a low metallicity environment similar to, in that regard, the epoch of the peak of star formation in the earlier universe. We present an unprecedentedly detailed analysis of a well-known star-forming regions (SFRs) at a spatial resolution of a few pc. We mapped a 610pcx260pc region in the LMC molecular ridge in [CII] and the [OIII] using the FIFI-LS instrument on the SOFIA telescope. We compare the data with the distribution of the CO (2-1) emission from ALMA, the modeled TIR luminosity as well as Spitzer/MIPS continuum and Halpha. We also provide a detailed description of the observing strategy and the data reduction. We find that [CII] and [OIII] emission is associated with the SFRs in the molecular ridge, but also extends throughout the mapped region, not obviously associated with ongoing star formation. The CO emission is clumpier than the [CII] emission and we find plentiful [CII] present where there is little CO emission, possibly holding important implications for CO-dark gas. We find a clear trend of the [CII]/TIR ratio decreasing with increasing TIR. This suggests a strong link between the [CII]-deficit and the local physical conditions instead of global properties.",
      "pdf_url": "https://arxiv.org/pdf/2509.09417.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09426",
      "title": "Gas-rich dwarf galaxy multiples in the Apertif HI survey",
      "authors": [
        "B. Šiljeg",
        "E. A. K. Adams",
        "F. Fraternali",
        "K. M. Hess",
        "A. Marasco",
        "H. Dénes",
        "J. Garrido",
        "D. M. Lucero",
        "R. Morganti",
        "S. Sánchez-Expósito",
        "J. M. van der Hulst"
      ],
      "abstract": "Gas-rich dwarf galaxy multiples in the Apertif HI survey B. Šiljeg, E. A. K. Adams, F. Fraternali, K. M. Hess, A. Marasco, H. Dénes, J. Garrido, D. M. Lucero, R. Morganti, S. Sánchez-Expósito, J. M. van der Hulst 13 pages, 10 figures, accepted for publication in Astronomy and Astrophysics Astrophysics of Galaxies (astro-ph.GA) Dwarf-dwarf galaxy encounters are a key aspect of galaxy evolution as they can ignite or temporarily suppress star formation in dwarfs and can lead to dwarf mergers. However, the frequency and impact of dwarf encounters remain poorly constrained due to limitations of spectroscopic studies, e.g. surface-brightness incompleteness of optical studies and poor spatial resolution of single-dish neutral hydrogen (HI) surveys. We aim to quantify the frequency of isolated gas-rich dwarf galaxy multiples using the untargeted, interferometric Apertif HI survey and study the impact of the interaction on star formation rates of galaxies as a function of the on-sky separation. Our parent dwarf sample consists of 2481 gas-rich galaxies with stellar masses 10^6 < M_* / M_Sun < 5*10^9, for which we identify close companions based on projected separation (r_p) and systemic velocity difference (Del_V_sys). We explore both constant thresholds for r_p and Del_V_sys corresponding to 150 kpc and 150 km/s on all galaxies in our sample, and mass-dependent thresholds based on a stellar-to-halo mass relation. We find the average number of companions per dwarf in our sample to be 13% (20%) when considering mass-dependent (constant) thresholds. In the stellar mass regime of 2*10^8 < M_* / M_Sun < 5*10^9, we find a three times higher frequency (11.6%) of dwarf companions than previously determined from optical spectroscopic studies, highlighting the power of HI for finding dwarf multiples. Furthermore, we find evidence for an increase in star formation rates (SFRs) of close dwarf galaxy pairs of galaxies with similar stellar masses.",
      "pdf_url": "https://arxiv.org/pdf/2509.09426.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09483",
      "title": "SDSS low z quasar companion galaxies",
      "authors": [
        "D. Bettoni , R. Falomo , S. Paiano INAF - Osservatorio Astronomico di Padova, INAF - IASF Palermo)"
      ],
      "abstract": "SDSS low z quasar companion galaxies D. Bettoni (1), R. Falomo (1), S. Paiano (2) ((1) INAF - Osservatorio Astronomico di Padova, (2) INAF - IASF Palermo) 9 pages, 9 figures, accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) We investigate the relationship between quasars and close companion galaxies using photometry and spectroscopy from the large data set of the SDSS DR16 survey. From the SDSS-QSO catalog of quasars, we selected objects with 0.1 < z < 0.35 and absolute magnitude M(r) <-21.3. For all these targets, we searched for candidate companion galaxies that have a projected distance from the target < 700 kpc and a radial velocity difference from the QSO DeltaV < 1000 km/sec. We find that in 447 QSO at least one companion galaxy is associated. A total of 691 associated galaxies are found in these QSO fields. In the majority of them there is just one associated galaxy but in few cases, many companions are also discovered and in two cases the QSO is found in rich galaxy environments. The possible contamination due to a chance projection of the companion galaxies is found less than 5%. Based on the available data we expect on average to find \\sim2 associated companion galaxies for each QSO. A small fraction (13%) of the companion galaxies exhibits [OII] emission lines as signature of recent star formation. However a similar fraction (16%) of unassociated galaxies in the same QSO fields show [OII] emission. This study suggests that there is no significant link between the presence of these close companion galaxies or the signature of recent star formation and the QSO nuclear activity.",
      "pdf_url": "https://arxiv.org/pdf/2509.09483.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09576",
      "title": "Build-up and survival of the disc: From numerical models of galaxy formation to the Milky Way",
      "authors": [
        "Matthew D. A. Orkney",
        "Chervin F. P. Laporte"
      ],
      "abstract": "Build-up and survival of the disc: From numerical models of galaxy formation to the Milky Way Matthew D. A. Orkney, Chervin F. P. Laporte 20 pages, 10 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) We study the build-up and survival of angular momentum in the stellar disc using a statistical suite of cosmological simulations of Milky Way-mass galaxies. Our results show that stellar kinematics at $z=0$ rarely recover the true times of disc spin-up, due to the disruptive impact of massive radial merger events. The proto-disc (i.e. Aurora) and kicked-up disc stars (the Splash) become indistinguishable at low metallicities, and the local fraction of kicked-up disc stars remains $<20$ per cent even in the case of major mergers. In contrast, observations from Gaia and legacy surveys reveal that Galactic $\\alpha$-rich populations as old as $\\tau=13.5\\,\\rm{Gyr}$ show significant rotation, with median $\\eta > 0.75$. This places strong constraints on the merger ratio between the proto-Milky Way and its last significant merger (Gaia-Sausage Enceladus, GSE), favouring values of $\\lesssim 1:7$. We present the age-metallicity relation for the stellar halo and estimate the interaction epoch at $\\tau_{\\rm{spin\\text{-}up}}\\simeq\\tau_{\\rm{GSE}}\\sim11\\,\\rm{Gyr}$. We note an abrupt dearth of halo and Splash stars after a lookback time of $10\\,\\rm{Gyr}$, marking the end of the merger interaction. Finally, we show that Globular Clusters in the metallicity range $-0.8<\\rm{[Fe/H]}<-0.3$ align with a formation time of $\\tau_{\\rm{starburst}}\\sim11\\,\\rm{Gyr}$, which we interpret as a signature of a starburst triggered by the first pericentric interaction of the GSE. This is remarkable corroboration between our GSE interaction and starburst times of $\\tau_{\\rm GSE}=\\tau_{\\rm starburst} \\sim 11\\,$Gyr.",
      "pdf_url": "https://arxiv.org/pdf/2509.09576.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09582",
      "title": "The emergence of globular clusters and globular-cluster-like dwarfs",
      "authors": [
        "Ethan D. Taylor",
        "Justin I. Read",
        "Matthew D. A. Orkney",
        "Stacy Y. Kim",
        "Andrew Pontzen",
        "Oscar Agertz",
        "Martin P. Rey",
        "Eric P. Andersson",
        "Michelle L. M. Collins",
        "Robert M. Yates"
      ],
      "abstract": "The emergence of globular clusters and globular-cluster-like dwarfs Ethan D. Taylor, Justin I. Read, Matthew D. A. Orkney, Stacy Y. Kim, Andrew Pontzen, Oscar Agertz, Martin P. Rey, Eric P. Andersson, Michelle L. M. Collins, Robert M. Yates 11 pages, 4 figures, 1 extended data figure, 1 extended data table. Published in Nature Sept 11th 2025 edition and can be accessed here: this https URL The emergence of globular clusters and globular-cluster-like dwarfs. Nature 645, 327-331 (2025) Astrophysics of Galaxies (astro-ph.GA) Globular clusters (GCs) are among the oldest and densest stellar systems in the Universe, yet how they form remains a mystery. Here we present a suite of cosmological simulations in which both dark-matter-free GCs and dark-matter-rich dwarf galaxies naturally emerge in the Standard Cosmology. We show that these objects inhabit distinct locations in the size-luminosity plane and that they have similar ages, age spread, metallicity and metallicity spread to globulars and dwarfs in the nearby Universe. About half of our simulated globulars form by means of regular star formation near the centres of their host dwarf, with the rest forming further out, triggered by mergers. The latter are more tidally isolated and more likely to survive to the present day. Finally, our simulations predict the existence of a new class of object that we call 'globular-cluster-like dwarfs' (GCDs). These form from a single, self-quenching, star-formation event in low-mass dark-matter halos at high redshift and have observational properties intermediate between globulars and dwarfs. We identify several dwarfs in our Galaxy, such as Reticulum II (refs. 2-4), that could be in this new class. If so, they promise unprecedented constraints on dark-matter models and new sites to search for metal-free stars.",
      "pdf_url": "https://arxiv.org/pdf/2509.09582.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09607",
      "title": "Discovery of Multiply Ionized Iron Emission Powered by an Active Galactic Nucleus in a z~7 Little Red Dot",
      "authors": [
        "Erini Lambrides",
        "Rebecca Larson",
        "Taylor Hutchison",
        "Pablo Arrabal Haro",
        "Bingjie Wang",
        "Brian Welch",
        "Dale D. Kocevski",
        "Chris T. Richardson",
        "Casey Papovich",
        "Jonathan R. Trump",
        "Sarah E. I. Bosman",
        "Jane R. Rigby",
        "Steven L. Finkelstein",
        "Guillermo Barro",
        "Jacqueline Antwi-Danso",
        "Arianna Long",
        "Anthony J. Taylor",
        "Jenna Cann",
        "Jeffrey McKaig",
        "Anton M. Koekemoer",
        "Nikko J. Cleri",
        "Hollis B. Akins",
        "Mic B. Bagley",
        "Danielle A. Berg",
        "Volker Bromm",
        "John Chisholm",
        "Katherine Chworowsky",
        "Sadie Coffin",
        "M. C. Cooper",
        "Olivia Cooper",
        "Isa Cox",
        "Mark Dickinson",
        "Henry C. Ferguson",
        "Maximilien Franco",
        "Jonathan P. Gardner",
        "Norman A. Grogin",
        "Michaela Hirschmann",
        "Marc Huertas-Company",
        "Intae Jung",
        "Jeyhan S. Kartaltepe",
        "Gourav P. Khullar",
        "Ray A. Lucas",
        "Elizabeth J. McGrath",
        "Alexa M. Morales",
        "Grace M. Olivier",
        "Óscar A. Chávez Ortiz",
        "Pablo G. Pérez-González",
        "Norbert Pirzkal",
        "Rachel S. Somerville",
        "Brittany Vanderhoof",
        "Benjamin J. Weiner",
        "L. Y. Aaron Yung",
        "Jorge A. Zavala"
      ],
      "abstract": "Discovery of Multiply Ionized Iron Emission Powered by an Active Galactic Nucleus in a z~7 Little Red Dot Erini Lambrides, Rebecca Larson, Taylor Hutchison, Pablo Arrabal Haro, Bingjie Wang, Brian Welch, Dale D. Kocevski, Chris T. Richardson, Casey Papovich, Jonathan R. Trump, Sarah E. I. Bosman, Jane R. Rigby, Steven L. Finkelstein, Guillermo Barro, Jacqueline Antwi-Danso, Arianna Long, Anthony J. Taylor, Jenna Cann, Jeffrey McKaig, Anton M. Koekemoer, Nikko J. Cleri, Hollis B. Akins, Mic B. Bagley, Danielle A. Berg, Volker Bromm, John Chisholm, Katherine Chworowsky, Sadie Coffin, M. C. Cooper, Olivia Cooper, Isa Cox, Mark Dickinson, Henry C. Ferguson, Maximilien Franco, Jonathan P. Gardner, Norman A. Grogin, Michaela Hirschmann, Marc Huertas-Company, Intae Jung, Jeyhan S. Kartaltepe, Gourav P. Khullar, Ray A. Lucas, Elizabeth J. McGrath, Alexa M. Morales, Grace M. Olivier, Óscar A. Chávez Ortiz, Pablo G. Pérez-González, Norbert Pirzkal, Rachel S. Somerville, Brittany Vanderhoof, Benjamin J. Weiner, L. Y. Aaron Yung, Jorge A. Zavala submitted, but comments welcome! Astrophysics of Galaxies (astro-ph.GA) Some of the most puzzling discoveries of NASA's JWST in the early Universe surround the surprising abundance of compact red sources, which show peculiar continuum shapes and broad hydrogen spectral lines. These sources, dubbed ``Little Red Dots'' or LRDs, have been the subject of intense inquiry in the literature. Any of the proposed explanations, from accreting super-massive black holes ensconced in ultra-dense gas to extremely compact star-systems, has significant implications for the earliest phases of galaxy evolution. Part of the difficulty in concretely identifying the physical mechanisms that drive their rest ultra-violet/optical spectral properties is the lack of bona fide signatures -- either star-formation or accreting super-massive black hole, that uniquely discriminate between competing interpretations. In this work, we report the discovery of several spectral features that strongly favor the existence of an accreting super-massive black hole in an LRD witnessed in the first 800 Myr of cosmic time, including several rare iron transitions and a possible [FeVII]. Additionally, we report on the properties of significant Balmer absorption and find that the small widths and relative depths of the absorption feature suggest the source of the absorber is at or beyond the outer edge of the broad-line region and does it fully cover the accreting SMBH in the center of the system. The detection of these iron features, coupled with the properties of the Balmer absorption, unveils an alternative scenario for LRDs -- one where there are direct sight-lines from the accretion disk to gas on scales at (or beyond) the broad-line gas region.",
      "pdf_url": "https://arxiv.org/pdf/2509.09607.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09617",
      "title": "Detection of a Deeply Embedded Protocluster Candidate in NGC 602 with JWST",
      "authors": [
        "Beena Meena",
        "Peter Zeidler",
        "Elena Sabbi",
        "Antonella Nota",
        "Camilla Pacifici",
        "Olivia C. Jones"
      ],
      "abstract": "Detection of a Deeply Embedded Protocluster Candidate in NGC 602 with JWST Beena Meena, Peter Zeidler, Elena Sabbi, Antonella Nota, Camilla Pacifici, Olivia C. Jones 11 pages, 5 figures, 1 table and 1 appendix; Accepted for publication in AJ Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) JWST NIRCam and MIRI photometry of NGC 602, a low-metallicity young star cluster in the Small Magellanic Cloud, reveals an extended mid-infrared bright emission feature designated as MZS-1. This feature is prominent between 10 and 25.5 microns, but is extremely faint at 7.7 microns and entirely undetected at shorter wavelengths. MZS-1 exhibits an elliptical morphology with a major axis of approximately 8 arcseconds and a minor axis of about 4 arcseconds. Its elongated shape and multiple emission peaks in the two-dimensional flux map suggest a group of deeply embedded sources with blackbody-like temperatures ranging from 100 K to 140 K. SED fitting using the Robitaille 2017 model grids identifies these sources as Stage I young stellar objects (YSOs) with masses below approximately 3 solar masses and a total stellar mass of the protocluster of about 300 solar masses (based on a Salpeter IMF). The low YSO masses are consistent with their absence in Spitzer-based catalogs due to sensitivity limits. By revealing a deeply embedded, low-mass protocluster invisible in previous surveys, this work highlights JWST's unparalleled resolution and sensitivity in uncovering the earliest stages of low-mass cluster formation in the metal-poor regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.09617.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08894",
      "title": "The Variable Sky Through the OGLE Eye",
      "authors": [
        "Patryk Iwanek"
      ],
      "abstract": "The Variable Sky Through the OGLE Eye Patryk Iwanek Review paper published in the Special Issue of the journal Universe: \"Variable Stars in the 21st Century: From Microvariability to Megavariability\". 24 pages, 12 figures, 1 table Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Optical Gravitational Lensing Experiment (OGLE) is one of the most productive and influential photometric sky surveys in the history of observational astronomy. Originally designed to detect dark matter through gravitational microlensing events, OGLE has evolved into a cornerstone of time-domain astrophysics, delivering three decades of two-band, high-cadence observations of approximately two billion stars across the Galactic bulge, disk, and Magellanic System. This review summarizes OGLE's key contributions to variable star research, including the discovery, classification and characterization of pulsating stars, eclipsing, ellipsoidal, and rotating variables, or irregular and eruptive stars. Particular emphasis is placed on the OGLE Collection of Variable Stars (OCVS), a publicly available and systematically expanded dataset that has become a fundamental resource for studies of stellar variability and evolution, Milky Way and other galaxies structure, microlensing, compact objects, exoplanets and more. The synergy between OGLE and other major sky surveys, including ASAS, ASAS-SN, ATLAS, Gaia, KMTNet, MACHO, MOA, TESS, PLATO, or ZTF further amplifies its scientific reach.",
      "pdf_url": "https://arxiv.org/pdf/2509.08894.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08962",
      "title": "Detection of Millimeter-Wavelength Flares from Two Accreting White Dwarf Systems in the SPT-3G Galactic Plane Survey",
      "authors": [
        "Y. Wan",
        "J. D. Vieira",
        "P. M. Chichura",
        "T. J. Maccarone",
        "A. J. Anderson",
        "B. Ansarinejad",
        "A. Anumarlapudi",
        "M. Archipley",
        "L. Balkenhol",
        "P. S. Barry",
        "K. Benabed",
        "A. N. Bender",
        "B. A. Benson",
        "F. Bianchini",
        "L. E. Bleem",
        "F. R. Bouchet",
        "L. Bryant",
        "E. Camphuis",
        "M. G. Campitiello",
        "J. E. Carlstrom",
        "C. L. Chang",
        "P. Chaubal",
        "A. Chokshi",
        "T.-L. Chou",
        "A. Coerver",
        "T. M. Crawford",
        "C. Daley",
        "T. de Haan",
        "K. R. Dibert",
        "M. A. Dobbs",
        "M. Doohan",
        "A. Doussot",
        "D. Dutcher",
        "W. Everett",
        "C. Feng",
        "K. R. Ferguson",
        "K. Fichman",
        "A. Foster",
        "S. Galli",
        "A. E. Gambrel",
        "R. W. Gardner",
        "F. Ge",
        "N. Goeckner-Wald",
        "R. Gualtieri",
        "F. Guidi",
        "S. Guns",
        "N. W. Halverson",
        "E. Hivon",
        "G. P. Holder",
        "W. L. Holzapfel",
        "J. C. Hood",
        "A. Hryciuk",
        "N. Huang",
        "D. L. Kaplan",
        "F. Keruzore",
        "A. R. Khalife",
        "L. Knox",
        "M. Korman",
        "K. Kornoelje",
        "C.-L. Kuo",
        "K. Levy",
        "A. E. Lowitz",
        "C. Lu",
        "G. P. Lynch",
        "A. Maniyar",
        "E. S. Martsen",
        "F. Menanteau",
        "M. Millea",
        "J. Montgomery",
        "Y. Nakato",
        "T. Natoli",
        "G. I. Noble",
        "Y. Omori",
        "A. Ouellette",
        "Z. Pan",
        "P. Paschos",
        "K. A. Phadke",
        "A. W. Pollak",
        "K. Prabhu",
        "W. Quan",
        "M. Rahimi",
        "A. Rahlin",
        "C. L. Reichardt",
        "M. Rouble",
        "J. E. Ruhl",
        "E. Schiappucci",
        "A. Simpson",
        "J. A. Sobrin",
        "A. A. Stark",
        "J. Stephen",
        "C. Tandoi",
        "B. Thorne",
        "C. Trendafilova",
        "C. Umilta",
        "A. Vitrier",
        "N. Whitehorn",
        "W. L. K. Wu",
        "M. R. Young",
        "J. A. Zebrowski"
      ],
      "abstract": "Detection of Millimeter-Wavelength Flares from Two Accreting White Dwarf Systems in the SPT-3G Galactic Plane Survey Y. Wan, J. D. Vieira, P. M. Chichura, T. J. Maccarone, A. J. Anderson, B. Ansarinejad, A. Anumarlapudi, M. Archipley, L. Balkenhol, P. S. Barry, K. Benabed, A. N. Bender, B. A. Benson, F. Bianchini, L. E. Bleem, F. R. Bouchet, L. Bryant, E. Camphuis, M. G. Campitiello, J. E. Carlstrom, C. L. Chang, P. Chaubal, A. Chokshi, T.-L. Chou, A. Coerver, T. M. Crawford, C. Daley, T. de Haan, K. R. Dibert, M. A. Dobbs, M. Doohan, A. Doussot, D. Dutcher, W. Everett, C. Feng, K. R. Ferguson, K. Fichman, A. Foster, S. Galli, A. E. Gambrel, R. W. Gardner, F. Ge, N. Goeckner-Wald, R. Gualtieri, F. Guidi, S. Guns, N. W. Halverson, E. Hivon, G. P. Holder, W. L. Holzapfel, J. C. Hood, A. Hryciuk, N. Huang, D. L. Kaplan, F. Keruzore, A. R. Khalife, L. Knox, M. Korman, K. Kornoelje, C.-L. Kuo, K. Levy, A. E. Lowitz, C. Lu, G. P. Lynch, A. Maniyar, E. S. Martsen, F. Menanteau, M. Millea, J. Montgomery, Y. Nakato, T. Natoli, G. I. Noble, Y. Omori, A. Ouellette, Z. Pan, P. Paschos, K. A. Phadke, A. W. Pollak, K. Prabhu, W. Quan, M. Rahimi, A. Rahlin, C. L. Reichardt, M. Rouble, J. E. Ruhl, E. Schiappucci, A. Simpson, J. A. Sobrin, A. A. Stark, J. Stephen, C. Tandoi, B. Thorne, C. Trendafilova, C. Umilta, A. Vitrier, N. Whitehorn, W. L. K. Wu, M. R. Young, J. A. Zebrowski Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Blind discoveries of millimeter-wave (mm-wave) transient events in non-targeted surveys, as opposed to follow-up or pointed observations, have only become possible in the past decade using cosmic microwave background surveys. Here we present the first results from the SPT-3G Galactic Plane Survey -- the first dedicated high-sensitivity, wide-field, time-domain, mm-wave survey of the Galactic Plane, conducted with the South Pole Telescope (SPT) using the SPT-3G camera. The survey field covers approximately 100 $\\text{deg}^2$ near the Galactic center. In 2023 and 2024, this survey consists of roughly 1,500 individual 20-minute observations in three bands centered at 95, 150, and 220 GHz, with plans for more observations in the coming years. We report the detection of two transient events exceeding a 5$\\sigma$ threshold in both the 95 and 150 GHz bands in the first two years of SPT-3G Galactic Plane Survey data. Both events are unpolarized and exhibit durations of approximately one day, with peak flux densities at 150 GHz of at least 50 mJy. The peak isotropic luminosities at 150 GHz are on the order of $10^{31}~\\text{erg}~\\text{s}^{-1}$. Both events are associated with previously identified accreting white dwarfs. Magnetic reconnection in the accretion disk is a likely explanation for the observed millimeter flares. In the future, we plan to expand the transient search in the Galactic Plane by lowering the detection threshold, enabling single-band detections, analyzing lightcurves on a range of timescales, and including additional data from future observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.08962.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.21119",
      "title": "Detection of the 2175Å UV Bump at z>7: Evidence for Rapid Dust Evolution in a Merging Reionisation-Era Galaxy",
      "authors": [
        "Katherine Ormerod",
        "Joris Witstok",
        "Renske Smit",
        "Anna de Graaff",
        "Jakob M. Helton",
        "Michael V. Maseda",
        "Irene Shivaei",
        "Andrew J. Bunker",
        "Stefano Carniani",
        "Francesco D'Eugenio",
        "Rachana Bhatawdekar",
        "Jacopo Chevallard",
        "Marijn Franx",
        "Nimisha Kumari",
        "Roberto Maiolino",
        "Pierluigi Rinaldi",
        "Brant Robertson",
        "Sandro Tacchella"
      ],
      "abstract": "Detection of the 2175Å UV Bump at z>7: Evidence for Rapid Dust Evolution in a Merging Reionisation-Era Galaxy Katherine Ormerod, Joris Witstok, Renske Smit, Anna de Graaff, Jakob M. Helton, Michael V. Maseda, Irene Shivaei, Andrew J. Bunker, Stefano Carniani, Francesco D'Eugenio, Rachana Bhatawdekar, Jacopo Chevallard, Marijn Franx, Nimisha Kumari, Roberto Maiolino, Pierluigi Rinaldi, Brant Robertson, Sandro Tacchella Mon Not R Astron Soc (2025) 1136-1154 Astrophysics of Galaxies (astro-ph.GA) Dust is a fundamental component of the interstellar medium within galaxies, as dust grains are highly efficient absorbers of ultraviolet (UV) and optical photons. Accurately quantifying this obscuration is crucial for interpreting galaxy spectral energy distributions (SEDs). The extinction curves in the Milky Way (MW) and Large Magellanic Cloud exhibit a strong feature known as the 2175 Å UV bump, most often attributed to small carbonaceous dust grains. This feature was recently detected in faint galaxies out to z=7.55, suggesting rapid formation channels. Here, we report the detection of a strong UV bump in a luminous Lyman-break galaxy at z_prism=7.11235, GNWY-7379420231, through observations taken as part of the NIRSpec Wide GTO survey. We fit a dust attenuation curve that is consistent with the MW extinction curve within 1{\\sigma}, in a galaxy just ~700 Myr after the Big Bang. From the integrated spectrum, we infer a young mass-weighted age (t~22-59 Myr) for this galaxy, however spatially resolved SED fitting unveils the presence of an older stellar population (t~252 Myr). Furthermore, morphological analysis provides evidence for a potential merger. The underlying older stellar population suggests the merging system could be pre-enriched, with the dust illuminated by a merger-induced starburst. Moreover, turbulence driven by stellar feedback in this bursty region may be driving polycyclic aromatic hydrocarbon formation through top-down shattering. The presence of a UV bump in GNWY-7379420231 solidifies growing evidence for the rapid evolution of dust properties within the first billion years of cosmic time",
      "pdf_url": "https://arxiv.org/pdf/2502.21119.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.14605",
      "title": "A Million Three-body Binaries Caught by Gaia",
      "authors": [
        "Dany Atallah",
        "Yonadav Barry Ginat",
        "Newlin C. Weatherford"
      ],
      "abstract": "A Million Three-body Binaries Caught by Gaia Dany Atallah, Yonadav Barry Ginat, Newlin C. Weatherford 27 pages, 9 figures, 3 tables. Submitted to ApJ. Comments welcome~ Astrophysics of Galaxies (astro-ph.GA) Gaia observations have revealed over a million stellar binary candidates within ~1 kpc of the Sun, predominantly characterized by orbital separations >10^3 AU and eccentricities >0.7. The prevalence of such wide, eccentric binaries has proven challenging to explain through canonical binary formation channels. However, recent advances in our understanding of three-body binary formation (3BBF) -- new binary assembly by the gravitational scattering of three unbound bodies (3UB) -- have shown that 3BBF in star clusters can efficiently generate wide, highly eccentric binaries. We further explore this possibility by constructing a semi-analytic model of the Galactic binary population in the solar neighborhood, originating from 3BBF in star clusters and subsequently migrating to the solar neighborhood within a Hubble time. The model relies on 3BBF scattering experiments to determine how the 3BBF rate and resulting binary properties scale with local stellar density, velocity dispersion, and physically-motivated limits to 3UB encounters within a clusters' tidal field. The Galactic star cluster population is modeled by incorporating up-to-date prescriptions for the Galaxy's star formation history as well as the birth properties and internal evolution of its star clusters. Finally, we account for binary disruption induced by perturbations from stellar interactions before cluster dissolution and the subsequent changes and disruption of binary orbital elements induced by dynamical interactions in the Galactic field. Our model closely reproduces the total number of Gaia's wide binaries and the separation and eccentricity distributions, suggesting that 3BBF may be an important formation channel for these enigmatic systems.",
      "pdf_url": "https://arxiv.org/pdf/2503.14605.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.15317",
      "title": "Euclid Quick Data Release (Q1). First Euclid statistical study of galaxy mergers and their connection to active galactic nuclei",
      "authors": [
        "Euclid Collaboration: A. La Marca",
        "L. Wang",
        "B. Margalef-Bentabol",
        "L. Gabarra",
        "Y. Toba",
        "M. Mezcua",
        "V. Rodriguez-Gomez",
        "F. Ricci",
        "S. Fotopoulou",
        "T. Matamoro Zatarain",
        "V. Allevato",
        "F. La Franca",
        "F. Shankar",
        "L. Bisigello",
        "G. Stevens",
        "M. Siudek",
        "W. Roster",
        "M. Salvato",
        "C. Tortora",
        "L. Spinoglio",
        "A. W. S. Man",
        "J. H. Knapen",
        "M. Baes",
        "D. O'Ryan",
        "N. Aghanim",
        "B. Altieri",
        "A. Amara",
        "S. Andreon",
        "N. Auricchio",
        "H. Aussel",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "P. Battaglia",
        "A. Biviano",
        "A. Bonchi",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "A. Costille",
        "F. Courbin",
        "H. M. Courtois",
        "M. Cropper",
        "A. Da Silva",
        "H. Degaudenzi",
        "G. De Lucia",
        "A. M. Di Giorgio",
        "C. Dolding",
        "H. Dole",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "A. Ealet",
        "S. Escoffier",
        "M. Fabricius",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "M. Frailis",
        "E. Franceschi",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "P. Gómez-Alvarez",
        "J. Gracia-Carpio",
        "B. R. Granett",
        "A. Grazian",
        "F. Grupp",
        "L. Guzzo",
        "S. Gwyn",
        "S. V. H. Haugan",
        "W. Holmes",
        "I. M. Hook",
        "F. Hormuth",
        "A. Hornstrup",
        "P. Hudelot",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche"
      ],
      "abstract": "Euclid Quick Data Release (Q1). First Euclid statistical study of galaxy mergers and their connection to active galactic nuclei Euclid Collaboration: A. La Marca, L. Wang, B. Margalef-Bentabol, L. Gabarra, Y. Toba, M. Mezcua, V. Rodriguez-Gomez, F. Ricci, S. Fotopoulou, T. Matamoro Zatarain, V. Allevato, F. La Franca, F. Shankar, L. Bisigello, G. Stevens, M. Siudek, W. Roster, M. Salvato, C. Tortora, L. Spinoglio, A. W. S. Man, J. H. Knapen, M. Baes, D. O'Ryan, N. Aghanim, B. Altieri, A. Amara, S. Andreon, N. Auricchio, H. Aussel, C. Baccigalupi, M. Baldi, S. Bardelli, P. Battaglia, A. Biviano, A. Bonchi, E. Branchini, M. Brescia, J. Brinchmann, S. Camera, G. Cañas-Herrera, V. Capobianco, C. Carbone, J. Carretero, M. Castellano, G. Castignani, S. Cavuoti, K. C. Chambers, A. Cimatti, C. Colodro-Conde, G. Congedo, C. J. Conselice, L. Conversi, Y. Copin, A. Costille, F. Courbin, H. M. Courtois, M. Cropper, A. Da Silva, H. Degaudenzi, G. De Lucia, A. M. Di Giorgio, C. Dolding, H. Dole, F. Dubath, C. A. J. Duncan, X. Dupac, A. Ealet, S. Escoffier, M. Fabricius, M. Farina, R. Farinelli, F. Faustini, S. Ferriol, F. Finelli, M. Frailis, E. Franceschi, S. Galeotta, K. George, B. Gillis, C. Giocoli, P. Gómez-Alvarez, J. Gracia-Carpio, B. R. Granett, A. Grazian, F. Grupp, L. Guzzo, S. Gwyn, S. V. H. Haugan, W. Holmes, I. M. Hook, F. Hormuth, A. Hornstrup, P. Hudelot, K. Jahnke, M. Jhabvala, B. Joachimi, E. Keihänen, S. Kermiche Accepted for publication as part of the A&A Special Issue `Euclid Quick Data Release (Q1)', 25 pages, 23 figures. Merger classification catalogue available at this https URL Astrophysics of Galaxies (astro-ph.GA) Galaxy major mergers are a key pathway to trigger AGN. We present the first detection of major mergers in the Euclid Deep Fields and analyse their connection with AGN. We constructed a stellar-mass-complete ($M_*>10^{9.8}\\,M_{\\odot}$) sample of galaxies from the first quick data release (Q1), in the redshift range z=0.5-2. We selected AGN using X-ray data, optical spectroscopy, mid-infrared colours, and processing \\IE observations with an image decomposition algorithm. We used CNNs trained on cosmological simulations to classify galaxies as mergers and non-mergers. We found a larger fraction of AGN in mergers compared to the non-merger controls for all AGN selections, with AGN excess factors ranging from 2 to 6. Likewise, a generally larger merger fraction ($f_{merg}$) is seen in active galaxies than in the non-active controls. We analysed $f_{merg}$ as a function of the AGN bolometric luminosity ($L_{bol}$) and the contribution of the point-source to the total galaxy light in the \\IE-band ($f_{PSF}$) as a proxy for the relative AGN contribution fraction. We uncovered a rising $f_{merg}$, with increasing $f_{PSF}$ up to $f_{PSF}=0.55$, after which we observed a decreasing trend. We then derived the point-source luminosity ($L_{PSF}$) and showed that $f_{merg}$ monotonically increases as a function of $L_{PSF}$ at z<0.9, with $f_{merg}>$50% for $L_{PSF}>2\\,10^{43}$ erg/s. At z>0.9, $f_{merg}$ rises as a function of $L_{PSF}$, though mergers do not dominate until $L_{PSF}=10^{45}$ erg/s. For X-ray and spectroscopic AGN, we computed $L_{bol}$, which has a positive correlation with $f_{merg}$ for X-ray AGN, while shows a less pronounced trend for spectroscopic AGN due to the smaller sample size. At $L_{bol}>10^{45}$ erg/s, AGN mostly reside in mergers. We concluded that mergers are strongly linked to the most powerful, dust-obscured AGN, associated with rapid supermassive black hole growth.",
      "pdf_url": "https://arxiv.org/pdf/2503.15317.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.06453",
      "title": "Mapping the Spatial Distribution of Fast Radio Bursts within their Host Galaxies",
      "authors": [
        "Alexa C. Gordon",
        "Wen-fai Fong",
        "Adam T. Deller",
        "Lachlan Marnoch",
        "Sungsoon Lim",
        "Eric W. Peng",
        "Keith W. Bannister",
        "Apurba Bera",
        "N. D. R. Bhat",
        "Tyson Dial",
        "Yuxin Dong",
        "Tarraneh Eftekhari",
        "Marcin Glowacki",
        "Kelly Gourdji",
        "Vivek Gupta",
        "Joscha N. Jahns-Schindler",
        "Akhil Jaini",
        "Charles D. Kilpatrick",
        "Chang Liu",
        "J. Xavier Prochaska",
        "Stuart D. Ryder",
        "Ryan M. Shannon",
        "Sunil Simha",
        "Nicolas Tejos",
        "Yuanming Wang",
        "Ziteng Wang"
      ],
      "abstract": "Mapping the Spatial Distribution of Fast Radio Bursts within their Host Galaxies Alexa C. Gordon (Northwestern), Wen-fai Fong, Adam T. Deller, Lachlan Marnoch, Sungsoon Lim, Eric W. Peng, Keith W. Bannister, Apurba Bera, N. D. R. Bhat, Tyson Dial, Yuxin Dong, Tarraneh Eftekhari, Marcin Glowacki, Kelly Gourdji, Vivek Gupta, Joscha N. Jahns-Schindler, Akhil Jaini, Charles D. Kilpatrick, Chang Liu, J. Xavier Prochaska, Stuart D. Ryder, Ryan M. Shannon, Sunil Simha, Nicolas Tejos, Yuanming Wang, Ziteng Wang 56 pages, 67 figures, 8 tables, accepted Astrophysics of Galaxies (astro-ph.GA) We present deep optical and near-infrared observations of the host galaxies of 34 fast radio bursts (FRBs) detected by the Commensal Real-time ASKAP Fast Transient (CRAFT) survey on the Australian SKA Pathfinder (ASKAP) to compare the locations of FRBs relative to their host light distributions. Incorporating three additional FRBs from the literature, for a total of four repeating and 33 apparently non-repeating FRBs, we determine their projected galactocentric offsets and find a median of $ 4.2^{+5.7}_{-2.5}$ kpc ($1.0^{+1.5}_{-0.6}r_e$). We model their host surface brightness profiles and develop synthetic spatial distributions of their globular clusters based on host properties. We calculate the likelihood the observed location of each FRB is consistent with the smooth light of its host galaxy, residual (primarily spiral) substructure, or globular cluster distributions. The majority of FRBs favor locations within the disks of their galaxies, while only 11$\\pm$5\\% favor a globular cluster origin, primarily those with galactocentric offsets $\\gtrsim3r_e$. At $z<0.15$, where spiral structure is apparent in 86\\% of our sample of FRB hosts, we find $\\approx 20-46\\%$ of FRBs favor an association with spiral arms. Assuming FRBs derive from magnetars, our results support multiple formation channels with the majority of progenitors associated with massive stars and a minority formed through dynamical channels. However, the moderate fraction of FRBs associated with spiral structure indicates that high star formation efficiency of the youngest and most massive stars is not a predominant driver in the production of FRB progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2506.06453.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03039",
      "title": "Machine Learning Classification of COSMOS2020 Galaxies: Quiescent vs. Star-Forming",
      "authors": [
        "Vahid Asadi",
        "Nima Chartab",
        "Akram Hasani Zonoozi",
        "Hosein Haghi",
        "Ghassem Gozalias"
      ],
      "abstract": "Machine Learning Classification of COSMOS2020 Galaxies: Quiescent vs. Star-Forming Vahid Asadi, Nima Chartab, Akram Hasani Zonoozi, Hosein Haghi, Ghassem Gozalias 16 pages, 11 figures, 6 tables, Accepted for Publication in ApJ Astrophysics of Galaxies (astro-ph.GA) Accurately distinguishing between quiescent and star-forming galaxies is essential for understanding galaxy evolution. Traditional methods, such as spectral energy distribution (SED) fitting, can be computationally expensive and may struggle to capture complex galaxy properties. This study aims to develop a robust and efficient machine learning (ML) classification method to identify quiescent and star-forming galaxies within the Farmer COSMOS2020 catalog. We utilized JWST wide-field light cones from the Santa Cruz semi-analytical modeling framework to train a supervised ML model, the CatBoostClassifier, using 28 color features derived from 8 mutual photometric bands within the COSMOS catalog. The model was validated against a testing set and compared to the SED-fitting method in terms of precision, recall, F1-score, and execution time. Preprocessing steps included addressing missing data, injecting observational noise, and applying a magnitude cut (ch1 < 26 AB) along with a redshift range of 0.2 < z < 3.5 to align the simulated and observational datasets. The ML method achieved an F1-score of 89\\% for quiescent galaxies, significantly outperforming the SED-fitting method, which achieved 54%. The ML model demonstrated superior recall (88% vs. 38%) while maintaining comparable precision. When applied to the COSMOS2020 catalog, the ML model predicted a systematically higher fraction of quiescent galaxies across all redshift bins within 0.2 < z < 3.5 compared to traditional methods like NUVrJ and SED-fitting. This study shows that ML, combined with multi-wavelength data, can effectively identify quiescent and star-forming galaxies, providing valuable insights into galaxy evolution. The trained classifier and full classification catalog are publicly available.",
      "pdf_url": "https://arxiv.org/pdf/2509.03039.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03366",
      "title": "Meet the Neighbors: Gas Rich \"Buddy Galaxies\" are Common Around Recently Quenched Massive Galaxies in the SQuIGG$\\vec{L}$E Survey",
      "authors": [
        "Anika Kumar",
        "David J. Setton",
        "Rachel Bezanson",
        "Alan Pearl",
        "Erin Stumbaugh",
        "Justin S. Spilker",
        "Vincenzo R. D'Onofrio",
        "Jenny E. Greene",
        "Katherine A. Suess",
        "Margaret E. Verrico"
      ],
      "abstract": "Meet the Neighbors: Gas Rich \"Buddy Galaxies\" are Common Around Recently Quenched Massive Galaxies in the SQuIGG$\\vec{L}$E Survey Anika Kumar, David J. Setton, Rachel Bezanson, Alan Pearl, Erin Stumbaugh, Justin S. Spilker, Vincenzo R. D'Onofrio, Jenny E. Greene, Katherine A. Suess, Margaret E. Verrico Research Notes of the American Astronomical Society (RNAAS); 4 pages, 1 figure. This work is complemented by a companion paper, Setton et al., which presents the molecular gas properties of the host post-starburst galaxies 2025, Research Notes of the AAS, Volume 9, Number 243 Astrophysics of Galaxies (astro-ph.GA) In this work, we characterize the environments of massive ($\\log(M_\\odot/M_\\star)\\sim11.2$) $z\\sim0.7$ post-starburst galaxies (PSBs) by studying serendipitously-detected CO(2-1) emitters found in targeted observations of the SQuIGG$\\vec{L}$E sample. We report $31\\pm6\\%$ of the galaxies from this survey host nearby gas-rich ``buddies'' with stellar masses $\\geq 10^{10},M_\\odot$ and molecular gas comparable to their central PSBs ($M_{H_{2}} \\sim 10^{10} M_\\odot$), but $\\sim0.8$ dex lower stellar mass ($\\sim 10^{10.4} M_\\odot$). Based on their location in position-velocity space, each buddy is consistent with being bound to the haloes of their SQuIGG$\\vec{L}$E host galaxies. We compare to the UniverseMachine model and find that SQuIGG$\\vec{L}$E galaxies host a typical number of neighbors for their stellar mass, suggesting that PSBs live in environments typical of co-eval similarly-massive galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2509.03366.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.04818",
      "title": "Turbulence inference from CO spectral observations",
      "authors": [
        "Jayashree Narayan",
        "Aris Tritsis",
        "Christoph Federrath"
      ],
      "abstract": "Turbulence inference from CO spectral observations Jayashree Narayan, Aris Tritsis, Christoph Federrath 15 pages, 6 figures, Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Turbulence influences the structure and dynamics of molecular clouds, and plays a key role in regulating star formation. We therefore need methods to accurately infer turbulence properties of molecular clouds from position-position-velocity (PPV) spectral observations. A previous method calibrated with simulation data exists to recover the 3D turbulent velocity dispersion from PPV data. However, that method relies on optically-thin conditions, ignoring any radiative transfer (RT) and chemical effects. In the present study we determine how opacity, RT, and chemical effects influence turbulence measurements with CO lines. We post-process a chemo-dynamical simulation of a turbulent collapsing cloud with a non-local thermodynamic equilibrium line RT code to generate PPV spectral cubes of the CO (1-0) and CO (2-1) lines, and obtain moment maps. We isolate the turbulence in the first-moment maps by using a Gaussian smoothing approach. We compare the CO results with the optically-thin scenario to explore how line excitation and RT impact the turbulence measurements. We find that the turbulent velocity dispersion (sigma_v) measured via CO requires a correction by a factor R_CO, with R_CO,1-0 = 0.88 (+0.09, -0.08) for the CO (1-0) line and R_CO,2-1 = 0.88 (+0.10, -0.08) for the CO (2-1) line. As a consequence, previous measurements of sigma_v were overestimated by about 10-15% on average, with potential overestimates as high as 40%, taking the 1-sigma uncertainty into account.",
      "pdf_url": "https://arxiv.org/pdf/2509.04818.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08880",
      "title": "The fate of Gaia's wide binaries: Interplay of white-dwarf recoil and tidal capture",
      "authors": [
        "Christopher E. O'Connor"
      ],
      "abstract": "The fate of Gaia's wide binaries: Interplay of white-dwarf recoil and tidal capture Christopher E. O'Connor 26 pages, 12 figures, 2 appendices; submitted to ApJ; supplemental materials at this https URL Solar and Stellar Astrophysics (astro-ph.SR) White dwarfs (WDs) receive natal velocity boosts of $\\sim 1 \\, \\mathrm{km \\, s^{-1}}$ due to recoil from asymmetric mass loss during the late asymptotic giant branch (AGB) stage. In a wide binary, the acceleration of a proto-WD exerts a torque, modifying the orbital eccentricity. Potential signatures of this effect have been detected in Gaia's astrometric binary sample. At the same time, an AGB star's puffy envelope facilitates strong tidal interactions in binaries with periapsis separations of a few AU, capturing the companion into a tighter orbit and potentially driving the system towards a common-envelope phase. Using an analytical model for wide binary evolution under asymmetric AGB mass loss, we find that recoil can induce tidal interactions in up to $30\\%$ of initially wide binaries on the AGB or post-AGB for initial separations of $\\sim 100 \\mbox{--} 1000$ AU. We relate these interactions to three recent observational puzzles: (i) The dearth of wide WD+MS and WD+WD binaries in Gaia DR3 with eccentricities $\\gtrsim 0.9$. (ii) The formation of moderately eccentric WD+MS and WD+WD binaries with orbital periods of $\\sim 100 \\mbox{--} 1000$ days, which may happen via a high-eccentricity common-envelope phase. (iii) The origin of low-luminosity, long-timescale, dust-obscured transients towards AGB progenitors, such as the ongoing event WNTR23bzdiq in M31. Our findings have potential implications for the survival and dynamical evolution of planetary systems around WD progenitors, to be investigated in future works.",
      "pdf_url": "https://arxiv.org/pdf/2509.08880.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08900",
      "title": "Exploring the History of Stellar Mergers with Chemistry: Examining the Origins of Massive $α$-Enriched Stars using Carbon Isotope Ratios",
      "authors": [
        "Zachary G. Maas",
        "Keith Hawkins",
        "Jeffrey M. Gerber",
        "Zoe Hackshaw",
        "Catherine Manea"
      ],
      "abstract": "Exploring the History of Stellar Mergers with Chemistry: Examining the Origins of Massive $α$-Enriched Stars using Carbon Isotope Ratios Zachary G. Maas, Keith Hawkins, Jeffrey M. Gerber, Zoe Hackshaw, Catherine Manea 19 pages, 5 figures, accepted for publication in The Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR) Recently discovered massive $\\alpha$-enriched (MAE) stars have surface chemistry consistent with members of the older thick disk Milky Way population but high masses ($\\sim$ 1.5 - 3 M$_{\\odot}$) that suggest these stars are young. The origin of MAE stars is not fully understood although binary interactions are likely an important formation pathway. To better constrain the history of MAE stars, we have measured metallicities, carbon isotope ratios, and CNO abundances in 49 red clump stars and four red giants. Our sample included thin disk, thick disk, and MAE stars to best constrain different formation scenarios. We observed our sample stars using the Tull spectrograph on the McDonald 2.7m telescope and derived abundances using synthetic spectra created by the Turbospectrum radiative transfer code. Overall, we find that 10 of our red clump MAE stars are consistent with the average thick disk carbon isotope ratio of $^{12}$C/$^{13}$C = 8.2 $\\pm$ 3.4. We find five MAE stars that have significantly higher carbon isotope ratios ($^{12}$C/$^{13}$C $>$ 15) than stars at similar metallicities. Two of the anomalous stars show abundance patterns consistent with AGB mass transfer while three MAE stars have $^{12}$C/$^{13}$C ratios similar to massive, single RC stars and show no clear signs of binarity from radial velocity monitoring or from the Gaia RUWE measurement. Overall, we find that carbon isotope ratio measurements provide a unique constraint when discerning the possible origins of MAE stars.",
      "pdf_url": "https://arxiv.org/pdf/2509.08900.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08925",
      "title": "Rotational radial shear in the low solar photosphere. Direct detection from high-resolution spectro-imaging",
      "authors": [
        "T. Corbard , M. Faurobert , B. Gelly , R. Douet , D. Laforgue Université Côte d'Azur, Observatoire de la Côte d'Azur, CNRS, Laboratoire Lagrange, Nice, France, CNRS-IRL2009, Tenerife, Spain)"
      ],
      "abstract": "Rotational radial shear in the low solar photosphere. Direct detection from high-resolution spectro-imaging T. Corbard (1), M. Faurobert (1), B. Gelly (2), R. Douet (2), D. Laforgue (2) ((1) Université Côte d'Azur, Observatoire de la Côte d'Azur, CNRS, Laboratoire Lagrange, Nice, France, (2) CNRS-IRL2009, Tenerife, Spain) Accepted for publication in Astronomy & Astrophysics 22 August 2025. 7 pages, 9 figures, 2 tables Solar and Stellar Astrophysics (astro-ph.SR) Radial differential rotation is an important factor in stellar dynamo theory. In the Sun, helioseismology has revealed a near surface shear layer in the upper 5 to 10% of the convection zone. At low to midlatitudes, the rotation velocity gradient decreases sharply near the surface. A depth gradient in rotational velocity was recently detected in the low photosphere using a differential interferometric method on spectroscopic data. Granular structures at different depths in the FeI 630.15 nm line showed a systematic retrograde shift compared to continuum structures, suggesting a height-related decrease in angular velocity, dependent on the assumed granulation coherence time. We use a more direct approach to measure the differential rotational velocity at different photospheric heights. We performed spectroscopic scans of the same granular region in FeI 630.15 nm and CaI 616.2 nm lines and measured displacements of images at different line chords between consecutive scans. These observations require excellent seeing, stable adaptive optics, and scanning times shorter than the granulation lifetime. Adaptive optics stabilizes continuum images but not higher-altitude rotation differences. We used THEMIS and HINODE SOT FeI data to measure formation height differences via perspective shifts observed away from the disk center with the slit radially oriented. Measurements at disk center and $\\pm$25° latitude along the central meridian show a parabolic decrease in rotational velocity with height, reaching about 16% slower rotation at 80 km above the continuum. No significant difference is found between the equator and $\\pm$25° latitudes. The low photosphere is a transition zone between the convective and radiative layers. Our measurements provide new constraints on its dynamical behavior and valuable boundary conditions for numerical simulations of the Sun s upper convection zone.",
      "pdf_url": "https://arxiv.org/pdf/2509.08925.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08999",
      "title": "HWO Target Stars and Systems: A Survey of Archival UV and X-ray Data",
      "authors": [
        "Sarah Peacock",
        "David J. Wilson",
        "Tyler Richey-Yowell",
        "Noah W. Tuchow",
        "Kevin France",
        "José A. Caballero",
        "Riccardo Spinelli",
        "Lía Corrales",
        "Aiden S. Zelakiewicz",
        "Seth Redfield",
        "Keighley Rockcliffe",
        "Allison Youngblood",
        "Cynthia S. Froning",
        "Girish M. Duvvuri",
        "Breanna A. Binder",
        "Natalie R. Hinkel",
        "Eric E. Mamajek"
      ],
      "abstract": "HWO Target Stars and Systems: A Survey of Archival UV and X-ray Data Sarah Peacock, David J. Wilson, Tyler Richey-Yowell, Noah W. Tuchow, Kevin France, José A. Caballero, Riccardo Spinelli, Lía Corrales, Aiden S. Zelakiewicz, Seth Redfield, Keighley Rockcliffe, Allison Youngblood, Cynthia S. Froning, Girish M. Duvvuri, Breanna A. Binder, Natalie R. Hinkel, Eric E. Mamajek 32 pages, 13 Figures, 6 Tables, accepted to AJ Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We assess archival high-energy data for key stars on the Habitable Worlds Observatory (HWO) Target Stars and Systems 2025 list, as stellar radiation is critical to shaping and interpreting planetary atmospheres. Using a sample of 98 nearby stars (HWO Tier 1 targets), we compile and evaluate X-ray and ultraviolet (UV) data from archival eROSITA, Chandra, XMM-Newton, ROSAT, EUVE, Swift, FUSE, IUE, GALEX, and HST. We examine spectral and temporal coverage, assess data quality, and identify major gaps. UV data are moderately available, with most coverage coming from near-UV spectra from IUE. Far fewer stars have far-UV spectra, especially from HST. In the X-ray regime, some stars have high-quality spectra, while others are limited to shallow detections or broad-band photometry. A small fraction of the sample has both X-ray and UV spectra of sufficient quality to support full spectral energy distribution modeling. Truly comprehensive coverage across X-ray, extreme-UV, and both UV bands remains extremely rare. Most datasets are single-epoch, limiting assessments of variability and flares - key factors in atmospheric photochemistry and escape. Moreover, the lack of simultaneous or contemporaneous observations across bands adds further uncertainty. Our findings underscore the need for new space-based missions and coordinated multiwavelength campaigns, ideally with overlapping coverage, to improve stellar characterization for HWO. As several key observatories age and face potential decommissioning, there is a narrow window of opportunity to secure these critical data. Investing in this effort now will directly support the science goals of HWO and enhance future studies of planetary habitability.",
      "pdf_url": "https://arxiv.org/pdf/2509.08999.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09016",
      "title": "On the origin of the dominant waves in the extended solar corona",
      "authors": [
        "Forrest Mozer",
        "Oleksiy Agapitov",
        "Orlando Romeo",
        "Vadim Roytershteyn",
        "Andrii Voshchepynets"
      ],
      "abstract": "On the origin of the dominant waves in the extended solar corona Forrest Mozer, Oleksiy Agapitov, Orlando Romeo, Vadim Roytershteyn, Andrii Voshchepynets Solar and Stellar Astrophysics (astro-ph.SR) The extended solar corona at 10-30 solar radii is essentially devoid of all waves below 100 kHz other than triggered ion acoustic waves (TIAW), which consist of a low frequency electromagnetic wave at a frequency of a few Hz coupled to one or more electrostatic waves at a few hundred Hz, such that the amplitudes of the higher frequency waves peak at a fixed phase of each low frequency wave period. All the waves in a TIAW event travel at the same phase speed, which is found to be 150 km s (the ion acoustic speed was about 100 km s). It has not been possible to explain the TIAW as a resonant wave-wave interaction, so a non-resonant interaction has been considered in which the loss of energy by the low frequency wave is used to both heat the electrons and grow the higher frequency waves. Evidence in support of this explanation is described and a PIC simulation that discusses this process is summarized. This interplay between a pair of waves, mediated by modifications of plasma parameters and energy conversion, represents a significant nonlinear process in plasma physics, the study of which will deepen the understanding of energy transfer, wave generation, and plasma dynamics in diverse astrophysical environments.",
      "pdf_url": "https://arxiv.org/pdf/2509.09016.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09029",
      "title": "Lyman-Alpha Emission from K and M Dwarfs: Intrinsic Profiles, Variability, and Flux in the Habitable Zone",
      "authors": [
        "Sarah Peacock",
        "Travis S. Barman",
        "R. O. Parke Loyd",
        "Adam C. Schneider",
        "Allison Youngblood",
        "Kenneth G. Carpenter",
        "Evgenya L. Shkolnik"
      ],
      "abstract": "Lyman-Alpha Emission from K and M Dwarfs: Intrinsic Profiles, Variability, and Flux in the Habitable Zone Sarah Peacock, Travis S. Barman, R. O. Parke Loyd, Adam C. Schneider, Allison Youngblood, Kenneth G. Carpenter, Evgenya L. Shkolnik 21 pages, 11 figures, 3 tables, accepted to ApJ Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Lyman-$\\alpha$ (Ly$\\alpha$) is the most prominent ultraviolet emission line in low-mass stars, playing a crucial role in exoplanet atmospheric photochemistry, heating, and escape. However, interstellar medium (ISM) absorption typically obscures most of the Ly$\\alpha$ profile, requiring reconstructions that introduce systematic uncertainties. We present intrinsic Ly$\\alpha$ profiles for 12 high radial velocity K and M dwarfs, where Doppler shifting minimizes ISM contamination, allowing direct measurements of $\\sim$50-95\\% of the line flux. Our sample spans the K-to-M spectral transition, enabling us to constrain the dependence of self-reversals in Ly$\\alpha$ emission profiles on effective temperature ($T_{eff}$). The depth of self-reversal, driven by non-local thermodynamic equilibrium (LTE) effects, decreases with decreasing $T_{eff}$, with M dwarfs exhibiting little to none. Two stars, Ross 1044 and Ross 451, were observed over multiple days, revealing $\\sim$20\\% Ly$\\alpha$ variability confined to the line core - implying that studies relying on reconstructions may underestimate temporal variability. We find strong correlations between Ly$\\alpha$ flux, peak-to-trough ratio, and hydrogen departure coefficients with $T_{eff}$, providing empirical constraints for stellar atmosphere models. A comparison of Ly$\\alpha$ flux in the habitable zone shows measured values for high radial velocity stars less than the reconstructed values for the rest of the sample, likely due to the older ages of the high-RV stars and/or overestimated reconstructed fluxes due to model deficiency (e.g., neglecting self-reversal). Our results establish an empirical foundation for Ly$\\alpha$ emission in K and M dwarfs, reducing uncertainties in reconstructions and improving models of stellar UV emission relevant to exoplanetary studies.",
      "pdf_url": "https://arxiv.org/pdf/2509.09029.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09317",
      "title": "High-resolution simulations of disc tearing in the GW Orionis triple system",
      "authors": [
        "Alison K. Young"
      ],
      "abstract": "High-resolution simulations of disc tearing in the GW Orionis triple system Alison K. Young Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) The disc around the pre-main-sequence triple star system GW Orionis is known from observations to be warped and broken. Theoretical modelling has produced conflicting results regarding the mechanism responsible for breaking the disc. Analytical predictions for the measured parameters of GW Ori suggest the disc is only marginally stable to tearing. We present new high-resolution simulations of GW Ori that replicate the wavelike regime expected in thick, low-turbulence protoplanetary discs for the first time to settle this question. Using the most optimistic values of misalignment and stellar mass ratio allowed by observational constraints, we find that the GW Ori disc can be torn by stellar torques alone, without need for an embedded planet. Even if the disc retains a smooth warp in simulations with similar parameters, it is likely that any small perturbation in the density or temperature structure could cause the disc to break. The new simulations rule out retrograde disc rotation relative to the stellar orbits and tentatively suggest the thicker ($h/r = 0.04$) disc better matches observations. Going forward, we should take care to ensure models of GW Ori and similar systems appropriately represent the propagation of warps. Additionally, analytical predictions are derived from idealized (and often massless) discs and it is useful to assess how each observed disc might deviate from those assumptions, especially in the context of a young and active star-forming neighbourhood.",
      "pdf_url": "https://arxiv.org/pdf/2509.09317.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.09492",
      "title": "Good things come to those who wait: Watching donor stars evolve towards a mass-transfer instability",
      "authors": [
        "Karel D. Temmink",
        "Onno R. Pols",
        "Stephen Justham",
        "Nadia Blagorodnova"
      ],
      "abstract": "Good things come to those who wait: Watching donor stars evolve towards a mass-transfer instability Karel D. Temmink, Onno R. Pols, Stephen Justham, Nadia Blagorodnova Solar and Stellar Astrophysics (astro-ph.SR) Unstable mass transfer in binary systems can lead to transients such as luminous red novae (LRNe). Observations of such transients are valuable for understanding and testing models of mass transfer. For donor stars in the Hertzsprung gap, there can be a long phase of mass-transfer evolution before instability sets in. Only few case studies of such delayed dynamical instability (DDI) mass transfer exist. None consider the full pre-instability evolution and the effects thereof on the observable properties of a binary. We systematically analyse detailed models of stable and unstable mass transfer for Hertzsprung-gap donors. We focus on identifying observable evolutionary features characteristic of ultimately unstable mass transfer and not found in stable mass-transfer binaries. Our binary evolution models, calculated with the MESA code, cover initial donor masses between $2.5 M_{\\odot}$ and $10 M_{\\odot}$ and initial accretor-to-donor mass ratios between $0.1$ and $1$. We find that the pre-instability evolution is qualitatively the same for all DDI donor stars, consisting of a long slow dimming phase followed by a shorter phase of rapid brightening. The latter phase is powered by recombination of hydrogen and accompanied by a strong increase in effective temperature, unique to unstable mass-transfer binaries. We estimate that a significant fraction of the rapid brighteners should be detectable by Gaia throughout the Galaxy. We model the progenitors of LRNe M31-2015 and V838 Mon, find a higher initial donor mass for M31 2015 than past estimates, and propose a new scenario for V838 Mon in which the known tertiary star dominates the pre-outburst photometry and the outburst results from the DDI of a more massive primary star. This work provides a comprehensive framework linking theory to observations of transients and enables improved classification and prediction of mass-transfer events.",
      "pdf_url": "https://arxiv.org/pdf/2509.09492.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09635",
      "title": "Large-scale variability in macroturbulence driven by pulsations in the rapidly rotating massive star Zeta Oph from high-cadence ESPRESSO spectroscopy and TESS photometry",
      "authors": [
        "A.J. Kalita",
        "D.M. Bowman",
        "M. Abdul-Masih",
        "S. Simón-Díaz"
      ],
      "abstract": "Large-scale variability in macroturbulence driven by pulsations in the rapidly rotating massive star Zeta Oph from high-cadence ESPRESSO spectroscopy and TESS photometry A.J. Kalita, D.M. Bowman, M. Abdul-Masih, S. Simón-Díaz 13 pages, 10 figures, Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) Despite their importance, the dynamical properties of massive stars remain poorly understood. Rotation is a key driver of internal mixing and angular momentum transport, significantly influencing massive star evolution. However, constraining rotation from spectroscopy is challenging, as spectral lines often exhibit excess broadening beyond rotation. The origin of this additional broadening, typically attributed to large-scale velocity fields and commonly referred to as macroturbulence, remains uncertain and unconstrained. Here, we present the combined analysis of TESS photometry and rapid time-series spectroscopy using the high-resolution ESPRESSO instrument at the Very Large Telescope of the European Southern Observatory for the rapidly rotating and pulsating massive star Zeta Ophiuchi. Leveraging excellent temporal coverage, our analysis demonstrates that pulsation-induced variability leads to peak-to-peak scatter as large as 88 km/s in the observed macroturbulent velocity time series. We also demonstrate that time-averaged macroturbulent velocities are spectral line specific and can exceed 100 km/s . Furthermore, the macroturbulent velocities from shorter integration times are systematically lower than those derived from stacked spectra mimicking longer exposure times typically needed for fainter stars. These results highlight the role of pulsations in driving variable macroturbulence in massive stars, while also pointing to a potential bias in spectroscopic estimates of macroturbulence for fainter massive stars.",
      "pdf_url": "https://arxiv.org/pdf/2509.09635.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08946",
      "title": "MESAlab: a Pipeline for Mapping the Blue Loop with MESA runs",
      "authors": [
        "D. Tarczay-Nehéz"
      ],
      "abstract": "MESAlab: a Pipeline for Mapping the Blue Loop with MESA runs D. Tarczay-Nehéz 3 pages, submitted to JOSS --- This manuscript was generated using a GitHub workflow and is intended solely for content verification. While its formatting (e.g., bibliography style) may differ from the final manuscript submitted to JOSS, the content is identical Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Modules for Experiments in Stellar Astrophysics (MESA; (Paxton2011, 2013, 2015, 2018, 2019, Jermyn 2023) is a widely used open-source software for modelling stellar evolution. In many studies, the computational grids covers thousands of models (e.g., Joyce et al 2024), which requires a tremendous amount of time and computational effort to process. To streamline data analysis, the mesalab package was developed. This Python-based pipeline is designed to simplify the post-processing of MESA outputs by automatically identifying various stellar evolutionary phases, with a specific focus on the ``blue loop'' -- a blue-ward excursion in the Hertzsprung-Russell Diagram (HRD) for intermediate-mass stars often associated with peculiar pulsational phenomena like ``strange modes.''",
      "pdf_url": "https://arxiv.org/pdf/2509.08946.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09504",
      "title": "YSES 2b is a background star: Differential astrometric M-dwarf measurements in time",
      "authors": [
        "Matthew Kenworthy",
        "Tomas Stolker",
        "Jens Kammerer",
        "William Balmer",
        "Arthur Vigan",
        "Sylvestre Lacour",
        "Gilles Otten",
        "Eric Mamajek",
        "Christian Ginski",
        "Mathias Nowak",
        "Steven Martos",
        "Jason Wang",
        "Emily Rickman",
        "Markus Janson",
        "Alexander Bohn",
        "Mariangela Bonavita"
      ],
      "abstract": "YSES 2b is a background star: Differential astrometric M-dwarf measurements in time Matthew Kenworthy, Tomas Stolker, Jens Kammerer, William Balmer, Arthur Vigan, Sylvestre Lacour, Gilles Otten, Eric Mamajek, Christian Ginski, Mathias Nowak, Steven Martos, Jason Wang, Emily Rickman, Markus Janson, Alexander Bohn, Mariangela Bonavita Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We wish to confirm the nature of YSES 2b, a purportedly faint companion of the young star YSES 2. We used on-sky observations from SPHERE and GRAVITY to measure the astrometric position of 2b with respect to the star YSES 2, and examined the competing hypotheses of (i) a bound substellar companion versus (ii) a distant unrelated background source with a non-zero proper motion. YSES 2b appears to be a late-type M-dwarf star over 2 kiloparsecs behind the star YSES 2. It has a transverse velocity of about 300 km/s and is located within one of the spiral arms of the Galaxy. The main discriminant was multiple epochs of GRAVITY astrometry that identified the sub-milliarcsecond parallactic motion of the star.",
      "pdf_url": "https://arxiv.org/pdf/2509.09504.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.01632",
      "title": "Probing the Turbulent Corona and Heliosphere Using Radio Spectral Imaging Observation during the Solar Conjunction of Crab Nebula",
      "authors": [
        "Peijin Zhang",
        "Surajit Mondal",
        "Bin Chen",
        "Sijie Yu",
        "Dale Gary",
        "Marin M. Anderson",
        "Judd D. Bowman",
        "Ruby Byrne",
        "Morgan Catha",
        "Xingyao Chen",
        "Sherry Chhabra",
        "Larry D'Addario",
        "Ivey Davis",
        "Jayce Dowell",
        "Katherine Elder",
        "Greg Hellbourg",
        "Jack Hickish",
        "Rick Hobbs",
        "David Hodge",
        "Mark Hodges",
        "Yuping Huang",
        "Andrea Isella",
        "Daniel C. Jacobs",
        "Ghislain Kemby",
        "John T. Klinefelter",
        "Matthew Kolopanis",
        "Nikita Kosogorov",
        "James Lamb",
        "Casey J. Law",
        "Nivedita Mahesh",
        "Brian O'Donnell",
        "Kathryn Plant",
        "Corey Posner",
        "Travis Powell",
        "Vinand Prayag",
        "Andres Rizo",
        "Andrew Romero-Wolf",
        "Jun Shi",
        "Greg Taylor",
        "Jordan Trim",
        "Mike Virgin",
        "Akshatha Vydula",
        "Sandy Weinreb",
        "David Woody"
      ],
      "abstract": "Probing the Turbulent Corona and Heliosphere Using Radio Spectral Imaging Observation during the Solar Conjunction of Crab Nebula Peijin Zhang, Surajit Mondal, Bin Chen, Sijie Yu, Dale Gary, Marin M. Anderson, Judd D. Bowman, Ruby Byrne, Morgan Catha, Xingyao Chen, Sherry Chhabra, Larry D'Addario, Ivey Davis, Jayce Dowell, Katherine Elder, Greg Hellbourg, Jack Hickish, Rick Hobbs, David Hodge, Mark Hodges, Yuping Huang, Andrea Isella, Daniel C. Jacobs, Ghislain Kemby, John T. Klinefelter, Matthew Kolopanis, Nikita Kosogorov, James Lamb, Casey J. Law, Nivedita Mahesh, Brian O'Donnell, Kathryn Plant, Corey Posner, Travis Powell, Vinand Prayag, Andres Rizo, Andrew Romero-Wolf, Jun Shi, Greg Taylor, Jordan Trim, Mike Virgin, Akshatha Vydula, Sandy Weinreb, David Woody Solar and Stellar Astrophysics (astro-ph.SR) Measuring plasma parameters in the upper solar corona and inner heliosphere is challenging because of the region's weakly emissive nature and inaccessibility for most in situ observations. Radio imaging of broadened and distorted background astronomical radio sources during solar conjunction can provide unique constraints for the coronal material along the line of sight. In this study, we present radio spectral imaging observations of the Crab Nebula (Tau A) from June 9 to June 22, 2024 when it was near the Sun with a projected heliocentric distance of 5 to 27 solar radii, using the Owens Valley Radio Observatory's Long Wavelength Array (OVRO-LWA) at multiple frequencies in the 30--80 MHz range. The imaging data reveal frequency-dependent broadening and distortion effects caused by anisotropic wave propagation through the turbulent solar corona at different distances. We analyze the brightness, size, and anisotropy of the broadened images. Our results provide detailed observations showing that the eccentricity of the unresolved source increases as the line of sight approaches the Sun, suggesting a higher anisotropic ratio of the plasma turbulence closer to the Sun. In addition, the major axis of the elongated source is consistently oriented in the direction perpendicular to the radial direction, suggesting that the turbulence-induced scattering effect is more pronounced in the direction transverse to the coronal magnetic field. Lastly, when the source undergoes large-scale refraction as the line of sight passes through a streamer, the apparent source exhibits substructures at lower frequencies. This study demonstrates that observations of celestial radio sources with lines of sight near the Sun provide a promising method for measuring turbulence parameters in the inner heliosphere.",
      "pdf_url": "https://arxiv.org/pdf/2506.01632.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.10853",
      "title": "Automatic detection of Ellerman bombs in the H$α$ line",
      "authors": [
        "A. Faryad",
        "A. G. M. Pietrow",
        "M. Verma",
        "C. Denker"
      ],
      "abstract": "Automatic detection of Ellerman bombs in the H$α$ line A. Faryad, A. G. M. Pietrow, M. Verma, C. Denker Published in Solar Physics, 19 pages, 8 figures Solar and Stellar Astrophysics (astro-ph.SR) Ellerman bombs (EBs) are small and short-lived magnetic reconnection events in the lower solar atmosphere, most commonly reported in the line wings of the H$\\alpha$ line. These events are thought to play a role in heating the solar chromosphere and corona, but their size, short lifetime, and similarity to other brightenings make them difficult to detect. We aim to automatically detect and statistically analyze EBs at different heliocentric angles to find trends in their physical properties. We developed an automated EB detection pipeline based on a star-finding algorithm. This pipeline was used on ten high-resolution H$\\alpha$ datasets from the 1-meter Swedish Solar Telescope (SST). This pipeline identifies and tracks EBs in time, while separating them from visually similar pseudo-EBs. It returns key parameters such as size, contrast, lifetime, and occurrence rates based on a dynamic threshold and the more classical static `contrast threshold` of 1.5 times the mean quiet-Sun (QS) intensity. For our dynamic threshold, we found a total of 2257 EBs from 28,772 individual detections across our datasets. On average, the full detection set exhibits an area of 0.44 arcsec$^2$ (0.37 Mm$^2$), a peak intensity contrast of 1.4 relative to the QS, and a median lifetime of 2.3 min. ...",
      "pdf_url": "https://arxiv.org/pdf/2508.10853.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.22106",
      "title": "ABC-SN: Attention Based Classifier for Supernova Spectra",
      "authors": [
        "Willow Fox Fortino",
        "Federica B. Bianco",
        "Pavlos Protopapas",
        "Daniel Muthukrishna",
        "Austin Brockmeier"
      ],
      "abstract": "ABC-SN: Attention Based Classifier for Supernova Spectra Willow Fox Fortino, Federica B. Bianco, Pavlos Protopapas, Daniel Muthukrishna, Austin Brockmeier 18 pages, 11 figures, 3 tables. To be published in the Astronomical Journal Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) While significant advances have been made in photometric classification ahead of the millions of transient events and hundreds of supernovae (SNe) each night that the Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST) will discover, classifying SNe spectroscopically remains the best way to determine most subtypes of SNe. Traditional spectrum classification tools use template matching techniques (Blondin & Tonry 2007) and require significant human supervision. Two deep learning spectral classifiers, DASH (Muthukrishna et al. 2019) and SNIascore (Fremling et al. 2021) define the state of the art, but SNIascore is a binary classifier devoted to maximizing the purity of the SN Ia-norm sample, while DASH is no longer maintained and the original work suffers from contamination of multi-epoch spectra in the training and test sets. We have explored several neural network architectures in order to create a new automated method for classifying SN subtypes, settling on an attention-based model we call ABC-SN. We benchmark our results against an updated version of DASH, thus providing the community with an up-to-date general purpose SN classifier. Our dataset includes ten different SN subtypes including subtypes of SN Ia, core collapse and interacting SNe. We find that ABC-SN outperforms DASH, and we discuss the possibility that modern SN spectra datasets contain label noise which limit the performance of all classifiers.",
      "pdf_url": "https://arxiv.org/pdf/2507.22106.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08870",
      "title": "Empirical Modeling of Zodiacal Backgrounds to Improve JWST NIRISS/SOSS Data Reduction",
      "authors": [
        "Tyler Baines",
        "Aarynn Carter",
        "Néstor Espinoza",
        "Kevin Volk",
        "Joseph Filippazzo",
        "Loic Albert"
      ],
      "abstract": "Empirical Modeling of Zodiacal Backgrounds to Improve JWST NIRISS/SOSS Data Reduction Tyler Baines, Aarynn Carter, Néstor Espinoza, Kevin Volk, Joseph Filippazzo, Loic Albert Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) Zodiacal light -- arising from both the thermal emission and scattered sunlight by interplanetary dust -- is the dominant component of the sky background in NIRISS Single Object Slitless Spectroscopy (SOSS) observations. The GR700XD grism disperses the zodiacal background across multiple diffraction orders, producing a characteristic two-dimensional, spectral order-dependent background pattern on the detector that reflects the combined contribution of overlapping orders. Observations reveal significant variability in background intensity driven by JWST's sky pointing and seasonal changes, underscoring the need for precise background subtraction during SOSS data reduction. Current methods rely on a generic background template derived during commissioning, scaled to match individual exposures. However, mis-scaled templates can leave behind structured residuals that may compromise the precision of exoplanet transit depth measurements. To improve background modeling, we conducted two calibration programs (PID 4479 and 6658) using the FULL frame readout mode and a 5-row by 2-column mosaic pattern to sample a range of sky positions. These observations enable empirical reconstruction of the sky background and provide detailed insights into its spatial and spectral characteristics. We present a library of empirically derived background templates and evaluate their performance, alongside the current template, by benchmarking against the PID 2113 dataset, which includes contemporaneous background exposures. This work supports aims to enhance background subtraction for SOSS time-series to achieve higher-precision exoplanet spectroscopy with JWST.",
      "pdf_url": "https://arxiv.org/pdf/2509.08870.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08905",
      "title": "Demonstrating Improved Contrast on the Roman Coronagraph with Spatial Linear Dark Field Control",
      "authors": [
        "Thayne Currie",
        "Olivier Guyon",
        "Ruslan Belikov",
        "Dan Sirbu",
        "Mona El Morsy"
      ],
      "abstract": "Demonstrating Improved Contrast on the Roman Coronagraph with Spatial Linear Dark Field Control Thayne Currie, Olivier Guyon, Ruslan Belikov, Dan Sirbu, Mona El Morsy 7 pages, 2 figures, 3 tables; slightly reformatted and clarified Roman Coronagraph White Paper Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) The baseline contrast floor from the Roman Coronagraph's High-Order Wavefront Sensing and Control strategy likely degrades over the course of time, requiring periodic recalibration of the dark hole. Here, we propose to consider spatial linear dark field control (sLDFC) on a one-sided deep-contrast region of the focal plane as a potential test. Implementing sLDFC on CGI will likely require some unique data acquisition strategies given the EMCCD's high flux sensitivity in long exposures/high gain: we outline three possible approaches. However, if successful, sLDFC's advances are substantial: (1) enabling us to maintain a fainter, more temporally correlated dark hole which will improve CGI's contrast after post-processing and (2) efficiently providing a reliable signal (bright field) for accurate reconstruction of residual starlight in the dark field, further boosting CGI's detection limit for bright targets.",
      "pdf_url": "https://arxiv.org/pdf/2509.08905.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09386",
      "title": "Feedback-Controlled Beam Pattern Measurement Method Using a Power-Variable Calibration Source for Cosmic Microwave Background Telescopes",
      "authors": [
        "Haruaki Hirose",
        "Masaya Hasegawa",
        "Daisuke Kaneko",
        "Taketo Nagasaki",
        "Ryota Takaku",
        "Tijmen de Haan",
        "Satoru Takakura",
        "Takuro Fujino"
      ],
      "abstract": "Feedback-Controlled Beam Pattern Measurement Method Using a Power-Variable Calibration Source for Cosmic Microwave Background Telescopes Haruaki Hirose, Masaya Hasegawa, Daisuke Kaneko, Taketo Nagasaki, Ryota Takaku, Tijmen de Haan, Satoru Takakura, Takuro Fujino Instrumentation and Methods for Astrophysics (astro-ph.IM) We demonstrate a novel beam pattern measurement method for the side lobe characterization of cosmic microwave background telescopes. The method employs a power-variable artificial microwave source under feedback control from the detector under test on the telescope. It enables us to extend the dynamic range of the beam pattern measurement without introducing nonlinearity effects from the detector. We conducted a laboratory-based proof-of-concept experiment, measuring the H-plane beam pattern of a horn antenna coupled to a diode detector at 81 GHz. We achieved a dynamic range of 77.7 dB in the beam pattern measurement, with 60.3 dB attributed to the feedback control. In addition, we verified the measurement by comparing it with other reference measurements obtained using conventional methods. The method is also applicable to general optical measurements requiring a high dynamic range to detect subtle nonidealities in the characteristics of optical devices.",
      "pdf_url": "https://arxiv.org/pdf/2509.09386.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09575",
      "title": "Deep learning-based prediction of Precipitable Water Vapor in the Chajnantor area",
      "authors": [
        "Alison Matus-Bello",
        "Silvia E. Restrepo",
        "Ricardo Bustos",
        "Yi Hu",
        "Fujia Du",
        "Jaime Cariñe",
        "Pablo García",
        "Rodrigo Reeves",
        "Zhaohui Shang"
      ],
      "abstract": "Deep learning-based prediction of Precipitable Water Vapor in the Chajnantor area Alison Matus-Bello, Silvia E. Restrepo, Ricardo Bustos, Yi Hu, Fujia Du, Jaime Cariñe, Pablo García, Rodrigo Reeves, Zhaohui Shang 8 pages, 7 figures. Submitted to A&A Instrumentation and Methods for Astrophysics (astro-ph.IM) Astronomical observations at millimeter and submillimeter wavelengths heavily depend on the amount of Precipitable Water Vapor (PWV) in the atmosphere, directly affecting the sky transparency and degrading the quality of the signals received by radio telescopes. Predictions of PWV at different forecasting horizons is crucial to support telescope operations, engineering planning, and observational scheduling and efficiency of radio observatories installed in the Chajnantor area in northern Chile. We developed and validated a Long Short-Term Memory (LSTM) deep learning-based model to predict PWV at forecasting horizons of 12, 24, 36, and 48 hours using historical data from two 183 GHz radiometers and a weather station in the Chajnantor area. We find the LSTM method is able to predict PWV in the 12 and 24 hours forecasting horizons with Mean Absolute Percentage Error (MAPE) of 22% compared to 36% of the traditional Global Forecast System (GFS) method used by Atacama Pathfinder EXperiment (APEX) and the Root Mean Square Error (RMSE) in mm are reduced by 50%. We present a first application of deep learning techniques for preliminary predictions of PWV in the Chajnantor area. The prediction performance shows significant improvements to traditional methods in 12 and 24 hours time windows. We also propose upgrades to improve our method in short (< 1 hour) and long (> 36 hours) forecasting timescales for future work.",
      "pdf_url": "https://arxiv.org/pdf/2509.09575.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09654",
      "title": "Dual-Backend Multibeam Position Switching Targeted SETI Observations toward Nearby Active Planet-Hosting Systems with FAST",
      "authors": [
        "Jian-Kang Li",
        "Zhen-Zhao Tao",
        "Pei Wang",
        "Tong-Jie Zhang"
      ],
      "abstract": "Dual-Backend Multibeam Position Switching Targeted SETI Observations toward Nearby Active Planet-Hosting Systems with FAST Jian-Kang Li, Zhen-Zhao Tao, Pei Wang, Tong-Jie Zhang 22 pages, 13 figures, 4 tables, Submitted to AJ Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) The Five-hundred-meter Aperture Spherical Telescope (FAST), the world's largest single-dish radio telescope, lists the search for extraterrestrial intelligence (SETI) as one of its key scientific objectives. In this work, we present a targeted SETI observation for 7 nearby active stars utilizing the FAST L-band multibeam receiver, employing a observational strategy that combines position switching with multibeam tracking to balance on-source integration time with the accuracy of the beam response. Using both pulsar and SETI backends, we perform a comprehensive search for narrowband drifting signals with Doppler drift rates within $\\pm 4 \\ \\mathrm{Hz\\ s^{-1}}$ and channel-width periodic signal with periods between 0.12 and 100 s and duty cycles between 10\\% and 50\\%. No credible radio technosignatures were detected from any of the target systems. Based on this null result, we place constraints on the presence of transmitters at a 95\\% confidence level, ruling out narrowband transmitters with with EIRP above $3.98\\times10^8 \\,\\mathrm{W}$ and periodic transmitter with EIRP above $1.80\\times10^{10} \\,\\mathrm{W}$,respectively, within the observation band.",
      "pdf_url": "https://arxiv.org/pdf/2509.09654.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08866",
      "title": "Uplink Pre-Compensation for Ground-to-Space Optical Communications Using Downlink Tomographic Reconstruction",
      "authors": [
        "Alex Frost",
        "Nicolas Maron",
        "Shane Walsh",
        "Benjamin Dix-Matthews",
        "Sascha Schediwy",
        "Michael Hart"
      ],
      "abstract": "Uplink Pre-Compensation for Ground-to-Space Optical Communications Using Downlink Tomographic Reconstruction Alex Frost, Nicolas Maron, Shane Walsh, Benjamin Dix-Matthews, Sascha Schediwy, Michael Hart Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) Uplink pre-compensation in ground-to-satellite optical links remains a problem, with an appropriate measurement of the wavefront error in the uplink path often not being available. We present a method that uses successive measurements of the readily accessible downlink beam to perform a tomographic reconstruction of the volume of atmosphere common to the downlink beam and the ground-station field-of-view. These measurements are done through the existing downlink wavefront sensor. From here, an estimate of the wavefront error along the uplink path can be obtained. We evaluate this method in simulation over representative atmospheric conditions and find good performance, especially for situations where the satellite point-ahead angle is many times greater than the atmosphere's isoplanatic angle. Compared to pre-compensation directly using the downlink phase, we find that this method estimates the uplink path with a residual mean-square wavefront error that is up to 8.6 times less. The hardware simplicity of this method makes it a promising solution for uplink pre-compensation implementations targeted at optical communications.",
      "pdf_url": "https://arxiv.org/pdf/2509.08866.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08901",
      "title": "ORLCA: A concept for an open-source Life Cycle Assessment repository built for research",
      "authors": [
        "Hannah Wakeling",
        "Kristin Lohwasser",
        "Peter Millington"
      ],
      "abstract": "ORLCA: A concept for an open-source Life Cycle Assessment repository built for research Hannah Wakeling, Kristin Lohwasser, Peter Millington Physics and Society (physics.soc-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Experiment (hep-ex) Comprehensive Life Cycle Assessment (LCA) as a tool to account for the full range of environmental impacts of resource use in commodities or services is a first step in reducing these impacts. There is an increasing necessity to account for these aspects in the planning, running and end-of-life of scientific experiments and research infrastructure. In the following, the concept for an Open Research Life Cycle Assessment (ORLCA) repository is presented to support this endeavour. It is designed to comply fully with the principles of findability, accessibility, interoperability, and reusability (FAIR).",
      "pdf_url": "https://arxiv.org/pdf/2509.08901.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08971",
      "title": "HARD: A Performance Portable Radiation Hydrodynamics Code based on FleCSI Framework",
      "authors": [
        "Julien Loiseau",
        "Hyun Lim",
        "Andrés Yagüe López",
        "Mammadbaghir Baghirzade",
        "Shihab Shahriar Khan",
        "Yoonsoo Kim",
        "Sudarshan Neopane",
        "Alexander Strack",
        "Farhana Taiyebah",
        "Benjamin K. Bergen"
      ],
      "abstract": "HARD: A Performance Portable Radiation Hydrodynamics Code based on FleCSI Framework Julien Loiseau, Hyun Lim, Andrés Yagüe López, Mammadbaghir Baghirzade, Shihab Shahriar Khan, Yoonsoo Kim, Sudarshan Neopane, Alexander Strack, Farhana Taiyebah, Benjamin K. Bergen Computational Physics (physics.comp-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Distributed, Parallel, and Cluster Computing (cs.DC) Hydrodynamics And Radiation Diffusion} (HARD) is an open-source application for high-performance simulations of compressible hydrodynamics with radiation-diffusion coupling. Built on the FleCSI (Flexible Computational Science Infrastructure) framework, HARD expresses its computational units as tasks whose execution can be orchestrated by multiple back-end runtimes, including Legion, MPI, and HPX. Node-level parallelism is delegated to Kokkos, providing a single, portable code base that runs efficiently on laptops, small homogeneous clusters, and the largest heterogeneous supercomputers currently available. To ensure scientific reliability, HARD includes a regression-test suite that automatically reproduces canonical verification problems such as the Sod and LeBlanc shock tubes and the Sedov blast wave, comparing numerical solutions against known analytical results. The project is distributed under an OSI-approved license, hosted on GitHub, and accompanied by reproducible build scripts and continuous integration workflows. This combination of performance portability, verification infrastructure, and community-focused development makes HARD a sustainable platform for advancing radiation hydrodynamics research across multiple domains.",
      "pdf_url": "https://arxiv.org/pdf/2509.08971.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.DC"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09450",
      "title": "A Radially Resolved Magnetic Field Threading the Disk of TW Hya",
      "authors": [
        "Richard Teague",
        "Boy Lankhaar",
        "Sean M. Andrews",
        "Chunhua Qi",
        "Roger R. Fu",
        "David J. Wilner",
        "John B. Biersteker",
        "Joan R. Najita"
      ],
      "abstract": "A Radially Resolved Magnetic Field Threading the Disk of TW Hya Richard Teague, Boy Lankhaar, Sean M. Andrews, Chunhua Qi, Roger R. Fu, David J. Wilner, John B. Biersteker, Joan R. Najita 19 pages, 14 figures, accepted by ApJL Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a new approach to detecting and characterizing a magnetic field in protoplanetary disks through the differential broadening of unpolarized molecular emission from CN. To demonstrate this technique, we apply it to new ALMA observations of the full complement of hyperfine components from the $N=1-0$ transition, achieving a spatial and spectral resolution of ${\\approx}\\,0.5^{\\prime\\prime}$ and $80~{\\rm m\\,s^{-1}}$, respectively. By fitting a model that incorporates the velocity structure of the disk, the potential non-LTE excitation of the molecule, and the Zeeman effect, we recover a radially resolved magnetic field with a strength of ${\\sim}10~{\\rm mG}$ between 60 and 120~au. The morphology of the field is also inferred through azimuthal variations in the line broadening, revealing a predominantly poloidal field at 60~au, sharply transitioning to one within the disk plane outside of the gap at 82~au. The signal-to-noise ratio of the data meant that the planar component was unable to be decomposed into toroidal and radial components. Lower limits on the local gas density ($n({\\rm H_2}) \\gtrsim 10^8~{\\rm cm^{-3}}$) from the excitation analysis of the CN emission correspond to a lower limit between 0.1 and 0.01 for the plasma $\\beta$.",
      "pdf_url": "https://arxiv.org/pdf/2509.09450.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.06174",
      "title": "On Soft Clustering For Correlation Estimators",
      "authors": [
        "Edward Berman",
        "Sneh Pandya",
        "Jacqueline McCleary",
        "Marko Shuntov",
        "Caitlin Casey",
        "Nicole Drakos",
        "Andreas Faisst",
        "Steven Gillman",
        "Ghassem Gozaliasl",
        "Natalie Hogg",
        "Jeyhan Kartaltepe",
        "Anton Koekemoer",
        "Wilfried Mercier",
        "Diana Scognamiglio",
        "COSMOS-Web: The JWST Cosmic Origins Survey"
      ],
      "abstract": "On Soft Clustering For Correlation Estimators Edward Berman, Sneh Pandya, Jacqueline McCleary, Marko Shuntov, Caitlin Casey, Nicole Drakos, Andreas Faisst, Steven Gillman, Ghassem Gozaliasl, Natalie Hogg, Jeyhan Kartaltepe, Anton Koekemoer, Wilfried Mercier, Diana Scognamiglio, COSMOS-Web: The JWST Cosmic Origins Survey Published in the Open Journal of Astrophysics Instrumentation and Methods for Astrophysics (astro-ph.IM) Properly estimating correlations between objects at different spatial scales necessitates $\\mathcal{O}(n^2)$ distance calculations. For this reason, most widely adopted packages for estimating correlations use clustering algorithms to approximate local trends. However, methods for quantifying the error introduced by this clustering have been understudied. In response, we present an algorithm for estimating correlations that is probabilistic in the way that it clusters objects, enabling us to quantify the uncertainty caused by clustering simply through model inference. These soft clustering assignments enable correlation estimators that are theoretically differentiable with respect to their input catalogs. Thus, we also build a theoretical framework for differentiable correlation functions and describe their utility in comparison to existing surrogate models. Notably, we find that repeated normalization and distance function calls slow gradient calculations and that sparse Jacobians destabilize precision, pointing towards either approximate or surrogate methods as a necessary solution to exact gradients from correlation functions. To that end, we close with a discussion of surrogate models as proxies for correlation functions. We provide an example that demonstrates the efficacy of surrogate models to enable gradient-based optimization of astrophysical model parameters, successfully minimizing a correlation function output. Our numerical experiments cover science cases across cosmology, from point spread function (PSF) modeling efforts to gravitational simulations to galaxy intrinsic alignment (IA).",
      "pdf_url": "https://arxiv.org/pdf/2504.06174.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08607",
      "title": "MasconCube: Fast and Accurate Gravity Modeling with an Explicit Representation",
      "authors": [
        "Pietro Fanti",
        "Dario Izzo"
      ],
      "abstract": "MasconCube: Fast and Accurate Gravity Modeling with an Explicit Representation Pietro Fanti, Dario Izzo Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) The geodesy of irregularly shaped small bodies presents fundamental challenges for gravitational field modeling, particularly as deep space exploration missions increasingly target asteroids and comets. Traditional approaches suffer from critical limitations: spherical harmonics diverge within the Brillouin sphere where spacecraft typically operate, polyhedral models assume unrealistic homogeneous density distributions, and existing machine learning methods like GeodesyNets and Physics-Informed Neural Networks (PINN-GM) require extensive computational resources and training time. This work introduces MasconCubes, a novel self-supervised learning approach that formulates gravity inversion as a direct optimization problem over a regular 3D grid of point masses (mascons). Unlike implicit neural representations, MasconCubes explicitly model mass distributions while leveraging known asteroid shape information to constrain the solution space. Comprehensive evaluation on diverse asteroid models including Bennu, Eros, Itokawa, and synthetic planetesimals demonstrates that MasconCubes achieve superior performance across multiple metrics. Most notably, MasconCubes demonstrate computational efficiency advantages with training times approximately 40 times faster than GeodesyNets while maintaining physical interpretability through explicit mass distributions. These results establish MasconCubes as a promising approach for mission-critical gravitational modeling applications requiring high accuracy, computational efficiency, and physical insight into internal mass distributions of irregular celestial bodies.",
      "pdf_url": "https://arxiv.org/pdf/2509.08607.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08871",
      "title": "Relativistic Time Modeling for Lunar Positioning Navigation and Timing",
      "authors": [
        "Yan Seyffert"
      ],
      "abstract": "Relativistic Time Modeling for Lunar Positioning Navigation and Timing Yan Seyffert Earth and Planetary Astrophysics (astro-ph.EP) Future lunar missions will depend on an internationally agreed upon timescale that remains accurate under the Moon's unique gravitational environment and its orbital dynamics. This thesis investigates the proposed Lunar Coordinate Time (TCL), derived analogously to Geocentric Coordinate Time (TCG) and thus aligned with current IAU proposals. We first formalise the TCL transformation and quantify its characteristics from solar system simulations. Next, we compute stationary surface-clock drifts caused by gravitational redshift and the Moon's changing orientation parameters, evaluating how accurate atomic clocks deployed on the surface of the Moon (much like for ESA's proposed NovaMoon mission) would have to be to measure these effects. Finally, we simulate relativistic proper time for ESA's Moonlight navigation satellites, identifying average drift and harmonic variations, to better understand the system that will comprise and enable a Lunar PNT (Positioning, Navigation and Timing) architecture. These kinds of investigations are an essential step toward a sustained internationally cooperative operation at the lunar south pole and beyond.",
      "pdf_url": "https://arxiv.org/pdf/2509.08871.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08994",
      "title": "Snowball Bistability Vanishes at Moderate Orbital Eccentricity",
      "authors": [
        "Xuan Ji",
        "Dorian S. Abbot"
      ],
      "abstract": "Snowball Bistability Vanishes at Moderate Orbital Eccentricity Xuan Ji, Dorian S. Abbot Earth and Planetary Astrophysics (astro-ph.EP) Snowball episodes are associated with increases in atmospheric oxygen and the complexity of life on Earth, and they may be essential for the development of complex life on exoplanets. Sustained stable Snowball episodes require a Snowball bifurcation and climate bistability between the globally ice-covered Snowball state and a state with at least some open ocean. We find that climate bistability disappears for an aquaplanet with a slab ocean in the Global Climate Model ExoCAM when the orbital eccentricity is increased to 0.2-0.3. This happens because the Snowball state loses stability as seasonal insolation variations intensify, while the warm state remains stable due to the ocean's large heat capacity. We use a low-order ice-thermodynamic model to show that the Snowball state loses stability as seasonality increases because winter freezing at the ice bottom is reduced relative to summer melting at the ice top due to ice self-insulation. Combined with previous research showing that Snowball climate bistability diminishes for planets orbiting low-mass stars, ones with longer rotation periods, and disappears entirely for tidally locked planets, our work suggests that the Snowball climate bistability may not be as robust to planetary parameters as previously thought, representing one aspect of habitability more consistent with the Rare Earth Hypothesis than the Copernican Principle.",
      "pdf_url": "https://arxiv.org/pdf/2509.08994.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09305",
      "title": "Dust growth and planet formation by disc fragmentation",
      "authors": [
        "Hans Lee",
        "Sergei Nayakshin",
        "Richard A. Booth"
      ],
      "abstract": "Dust growth and planet formation by disc fragmentation Hans Lee, Sergei Nayakshin, Richard A. Booth 6 pages, 7 figures, accepted and published in MNRAS Letters Earth and Planetary Astrophysics (astro-ph.EP) It is often argued that gravitational instability of realistic protoplanetary discs is only possible at distances larger than $\\sim 50$ au from the central star, requiring high disc masses and accretion rates, and that therefore disc fragmentation results in the production of brown dwarfs rather than gas giant planets. However, the effects of dust growth on opacity can be very significant but have not been taken into account systematically in the models of fragmenting discs. We employ dust opacity that depends on both temperature and maximum grain size to evaluate analytically the properties of a critically fragmenting protoplanetary disc. We find that dust growth may promote disc fragmentation at disc radii as small as $\\sim 30$ au. As a result, the critical disc masses and accretion rates are smaller, and the initial fragment masses are in the gas giant planet mass regime. While this suggests that formation of gas giant planets by disc fragmentation may be more likely than usually believed, we caution that numerical models of the process are needed to evaluate the effects not taken into account here, e.g., dust grain mobility and fragment evolution after disc fragmentation.",
      "pdf_url": "https://arxiv.org/pdf/2509.09305.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.21790",
      "title": "Detecting Land with Reflected Light Spectroscopy to Rule Out Waterworld O$_2$ Biosignature False Positives",
      "authors": [
        "Anna Grace Ulses",
        "Joshua Krissansen-Totton",
        "Tyler D. Robinson",
        "Victoria Meadows",
        "David C. Catling",
        "Jonathan J. Fortney"
      ],
      "abstract": "Detecting Land with Reflected Light Spectroscopy to Rule Out Waterworld O$_2$ Biosignature False Positives Anna Grace Ulses, Joshua Krissansen-Totton, Tyler D. Robinson, Victoria Meadows, David C. Catling, Jonathan J. Fortney Published in ApJ. DOI: https://doi.org/10.3847/1538-4357/adec69 Earth and Planetary Astrophysics (astro-ph.EP) The search for life outside our solar system is at the forefront of modern astronomy, and telescopes such as the Habitable Worlds Observatory (HWO) are being designed to identify biosignatures. Molecular oxygen, O$_2$, is considered a promising indication of life, yet substantial abiotic O$_2$ may accumulate from H$_2$O photolysis and hydrogen escape on a lifeless, fully (100%) ocean-covered terrestrial planet when surface O$_2$ sinks are suppressed. This so-called waterworld false positive scenario could be ruled out with land detection because exposed land precludes extremely deep oceans (~50 Earth oceans) given topographic limits set by the crushing strength of rocks. Land detection is possible because plausible geologic surfaces exhibit increasing reflectance with wavelength in the visible, whereas liquid water and ice/snow have flat or decreasing reflectance, respectively. Here, we present reflected light retrievals to demonstrate that HWO could detect land on an exo-Earth in the disk-averaged spectrum. Given a signal-to-noise ratio of 20 spectrum, Earth-like land fractions can be confidently detected with 0.3-1.1 $\\mu$m spectral coverage (resolution R~140 in the visible, R~7 in the UV, with Earth-like atmosphere and clouds). We emphasize the need for UV spectroscopy down to at least 0.3 $\\mu$m to break an O$_3$-land degeneracy. We find that the SNR and resolution requirements in the visible/UV imply that a larger aperture (~8 m) will be necessary to ensure the observing times required for land detection are feasible for most HWO terrestrial habitable zone targets. These results strongly inform the HWO minimum requirements to corroborate possible oxygen biosignatures.",
      "pdf_url": "https://arxiv.org/pdf/2506.21790.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.02418",
      "title": "Placing the Near-Earth Object Impact Probability in Context",
      "authors": [
        "C. R. Nugent",
        "K. P. Andersen",
        "James M. Bauer",
        "C. T. Jensen",
        "L. K. Kristiansen",
        "C. P. Hansen",
        "M. M. Nielsen",
        "C. F. Vestergård"
      ],
      "abstract": "Placing the Near-Earth Object Impact Probability in Context C. R. Nugent, K. P. Andersen, James M. Bauer, C. T. Jensen, L. K. Kristiansen, C. P. Hansen, M. M. Nielsen, C. F. Vestergård Published in The Planetary Science Journal. 11 pages, 2 tables, 1 figure C. R. Nugent et al 2025 Planet. Sci. J. 6 190 Earth and Planetary Astrophysics (astro-ph.EP) Near-Earth objects (NEOs) have the potential to cause extensive damage and loss of life on Earth. Advancements in NEO discovery, trajectory prediction, and deflection technology indicate that an impact could be prevented, with sufficient warning time. We derive an impact frequency of NEOs 140m and larger, using the NEOMOD2 NEO population model and JPL Horizons. We then place that frequency in context with other preventable causes of death; allowing for comparison between a planet-wide event and individual events that cause fatalities such as car crashes and carbon monoxide poisoning. We find that the chance of a $>140$ m asteroid hitting the Earth is more likely than the chance of an individual being struck by lightning.",
      "pdf_url": "https://arxiv.org/pdf/2508.02418.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.05880",
      "title": "A preliminary orbit for the satellite of dwarf planet (136472) Makemake",
      "authors": [
        "Daniel Bamberger"
      ],
      "abstract": "A preliminary orbit for the satellite of dwarf planet (136472) Makemake Daniel Bamberger Earth and Planetary Astrophysics (astro-ph.EP) I present a preliminary orbit for the satellite of dwarf planet (136472) Makemake, based on archival Hubble Space Telescope images taken on 13 days between April 2015 and February 2019. The satellite was detected on twelve of them. A best-fit circular orbit has a period of $18.023 \\pm 0.017$ d, a semi-major axis of $22250 \\pm 780$ km, and an inclination of $83.7^{\\circ} \\pm 1.0^{\\circ}$ relative to the line of sight. That orbit is nearly edge-on, raising the possibility of ongoing or imminent mutual events between Makemake and its satellite.",
      "pdf_url": "https://arxiv.org/pdf/2509.05880.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}