{
  "date": "2025-11-14",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.SR",
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.HE",
    "astro-ph.IM"
  ],
  "total_papers": 121,
  "gw_related_papers": 13,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.08895",
      "title": "Probing Intrinsic Ellipticity in Neutron Star Binaries",
      "authors": [
        "Zhiqiang Miao",
        "Huan Yang"
      ],
      "abstract": "Probing Intrinsic Ellipticity in Neutron Star Binaries Zhiqiang Miao, Huan Yang High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) We present a novel resonance mechanism that can naturally occur in neutron star binaries: a spin-orbit resonance. This resonance locks the binary into a unique state where the neutron star spin evolves alongside the orbit. The resonance requires a finite neutron star ellipticity $\\epsilon$ possibly sourced by strong internal magnetic fields in magnetars, which are motivated by population study of eccentric neutron star-black hole binary GW200105. We find that the locking probability is proportional to $\\sqrt{\\epsilon}$. We derive the phase correction in the gravitational waveform due to this resonance locking effect, and have conducted a search in all neutron star binaries up to the O4a gravitational-wave catalog, with no positive event found so far. Observations by next-generation detectors such as Einstein Telescope and Cosmic Explorer, or even the upcoming upgrade of Advanced LIGO, have the potential to detect such locking signals, enabling precise measurements of both neutron star's ellipticity and moment of inertia. Future searches should be performed to discover this resonance, or, if undetected, to place constraints on the magnetar fraction in neutron star binaries.",
      "pdf_url": "https://arxiv.org/pdf/2511.08895.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.09467",
      "title": "Revisiting the Hubble tension problem in the framework of holographic dark energy",
      "authors": [
        "Jun-Xian Li",
        "Shuang Wang"
      ],
      "abstract": "Revisiting the Hubble tension problem in the framework of holographic dark energy Jun-Xian Li, Shuang Wang 16 pages, 10 figures, 8 tables. comments are welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The Hubble tension problem is one of the most significant challenges in modern cosmology. In this paper, we study the Hubble tension problem in the framework of holographic dark energy (HDE). To perform a systematic and comprehensive analysis, we select six representative theoretical models from all four categories of HDE. For the observational data, we adopt the Baryon Acoustic Oscillation (BAO) data from the Dark Energy Spectroscopic Instrument (DESI) Data Release 2 (DR2), a collection of alternative BAO data, the Cosmic Microwave Background (CMB) distance priors from the $Planck$ 2018, the type Ia supernovae (SN) data from the PantheonPlus, Union3, and DESY5 compilations. We find that HDE models that employ the Hubble scale or its combinations as the IR cutoff cannot alleviate the Hubble tension problem. In contrast, HDE models that employ the future event horizon as the IR cutoff can significantly alleviate the Hubble tension problem. It must be stressed that these two key conclusions hold true for cases of adopting different theoretical HDE models and different observational data. Our findings advocate for further exploration of HDE models using other types of cosmological observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.09467.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.10268",
      "title": "Approximate reconstruction of inflationary potential with ACT observations",
      "authors": [
        "Zhu Yi",
        "Xingzhi Wang",
        "Qing Gao",
        "Yungui Gong"
      ],
      "abstract": "Approximate reconstruction of inflationary potential with ACT observations Zhu Yi, Xingzhi Wang, Qing Gao, Yungui Gong 11 pages, 3 figures, accepted for publication in PLB Phys. Lett. B 871 (2025) 140002 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The Atacama Cosmology Telescope (ACT) has recently reported updated measurements of the scalar spectral index $n_s$, revealing a tension with the predictions of many conventional inflationary models. In this work, we adopt a parameterization of the spectral index in the form $n_s = 1 - p/(N + \\alpha)$ with $1.338<p<1.746$, to reconstruct an inflationary potential consistent with the latest ACT data. The resulting potential is the Kachru-Kallosh-Linde-Trivedi (KKLT) potential $V(\\phi) = V_0/[1 + (M/\\phi)^n]$, where the power index is given by $n = 2(p-1)/(2-p)$. The corresponding tensor-to-scalar ratio is approximately $r \\approx 16(p-1)/[C (N+\\alpha)^p]$ with $C= 2^{2p-1} \\left[\\sqrt{p-1}/(2-p)\\right]^{2p-2} /M^{2p-2}$. Since the reconstruction under the slow-roll approximation is model-independent, the KKLT model can serve as an effective approximation to a broad class of inflationary scenarios that are consistent with the latest ACT measurements of $n_s$, at least on large scales.",
      "pdf_url": "https://arxiv.org/pdf/2505.10268.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.11853",
      "title": "On the prospects of thermalization of axion-SU(2) inflation",
      "authors": [
        "Sukannya Bhattacharya",
        "Matteo Fasiello",
        "Alexandros Papageorgiou",
        "Ema Dimastrogiovanni"
      ],
      "abstract": "On the prospects of thermalization of axion-SU(2) inflation Sukannya Bhattacharya, Matteo Fasiello, Alexandros Papageorgiou, Ema Dimastrogiovanni 34 pages, 5 figures, minor changes in text and figure, v2 matches published version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Axion inflation models coupled to a gauge sector via a Chern-Simons term exhibit an array of interesting phenomenology including a chiral gravitational wave spectrum and primordial black hole production. They may also provide a useful mechanism for generating lepton asymmetry. The possibility to embed this class of models in UV-finite theories and their intriguing, testable, signatures make for a compelling candidate for early acceleration. Due to the Chern-Simons coupling, gauge modes may undergo a finite tachyonic growth during which non-linearities become important. Naturally, this raises the question of whether such (self) interactions can lead to thermalization during inflation. We provide a set of useful criteria for sustained thermalization in an axion-$SU(2)$ model and chart the parameter space of the model accordingly. We find that the cold inflation regime constitutes a very significant fraction of the parameter space. Our analysis accounts for a initially vanishing as well as non-zero gauge field vacuum expectation value (VEV). We also consider the possibility of a dynamically generated VEV.",
      "pdf_url": "https://arxiv.org/pdf/2506.11853.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.17411",
      "title": "Consistent Initial Conditions for Early Modified Gravity in Effective Field Theory",
      "authors": [
        "Jiaming Pan",
        "Meng-Xiang Lin",
        "Gen Ye",
        "Marco Raveri",
        "Alessandra Silvestri"
      ],
      "abstract": "Consistent Initial Conditions for Early Modified Gravity in Effective Field Theory Jiaming Pan, Meng-Xiang Lin, Gen Ye, Marco Raveri, Alessandra Silvestri 13 pages, 4 figures; Updated version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Precise initial conditions (ICs) are crucial for accurate computation in cosmological perturbation theory. We derive the consistent ICs for Horndeski theory in the Effective Field Theory (EFT) approach, assuming constant EFT functions at early times. We implement the ICs into the public Boltzmann code \\texttt{EFTCAMB}, and demonstrate that the expected early-time behavior of perturbations and Weyl potential can be obtained with theory-consistent MG ICs. We identify significant deviations when comparing Cosmic Microwave Background angular power spectra in MG models obtained with consistent MG ICs versus inconsistent GR ICs. Our findings underline the importance of using accurate, theory-consistent MG ICs to ensure robust cosmological constraints on early MG models.",
      "pdf_url": "https://arxiv.org/pdf/2506.17411.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.17721",
      "title": "Inflation from a generalized exponential plateau: towards extra suppressed tensor-to-scalar ratios",
      "authors": [
        "Gerasimos Kouniatalis",
        "Emmanuel N. Saridakis"
      ],
      "abstract": "Inflation from a generalized exponential plateau: towards extra suppressed tensor-to-scalar ratios Gerasimos Kouniatalis, Emmanuel N. Saridakis 8 pages, 4 figures, version published in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate a standard minimally-coupled scalar-field inflationary scenario, which is based on a new potential, with suitably generalized plateau features, that leads to extra small tensor-to-scalar ratios. In particular, we consider a specific three-parameter potential, which has a flatter plateau and a steeper well compared to the Starobinsky potential in the Einstein frame. We study the inflationary realization and we show that it guarantees a prolonged period of slow-roll inflation and a successful exit. Additionally, the steeper minimum leads to significantly suppressed tensor perturbations, and thus to an extra-small tensor-to-scalar ratio $r$, and we show that we are able to obtain $r$ values less than $10^{-5}$. Moreover, we calculate the reheating temperature showing that in order to be in agreement with observations one of the potential parameters should remain within specific bounds. Finally, performing an inverse conformal transformation to the Jordan frame we show that the considered potential corresponds to higher-order corrections to Starobinsky potential in the Einstein frame, and these corrections are the reason for the improved behavior of the tensor-to-scalar ratio.",
      "pdf_url": "https://arxiv.org/pdf/2507.17721.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.19081",
      "title": "Lensing amplitude anomaly and varying electron mass alleviate the Hubble and $S_8$ tensions",
      "authors": [
        "Yi-Ying Wang",
        "Lei Lei",
        "Shao-Peng Tang",
        "Yi-Zhong Fan"
      ],
      "abstract": "Lensing amplitude anomaly and varying electron mass alleviate the Hubble and $S_8$ tensions Yi-Ying Wang, Lei Lei, Shao-Peng Tang, Yi-Zhong Fan 28 pages, 7 figures, 6 tables. Added Planck PR4 likelihoods. Accepted for publication in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Cosmological measurements have revealed tensions within the standard $\\Lambda$CDM model, notably discrepancies in the Hubble constant and $S_8$ parameter. A modified recombination scenario involving a time-varying electron mass has been proposed as a feasible solution to the Hubble tension without exacerbating the $S_8$ tension. Recent observations have further revealed other potential deviations from the $\\Lambda$CDM framework, such as non-flat spatial curvature and an anomalous CMB lensing amplitude. In this study, we explore whether introducing a variation in the electron mass $m_e$, allowing non-zero spatial curvature $\\Omega_K$, and a free lensing amplitude $A_{\\rm lens}$ can resolve these persistent tensions. Using the Planck Public Release (PR) 3 and ACT power spectra, Planck PR4 and ACT lensing maps, together with BAO measurements from DESI DR2, we obtain $H_0 = 69.61^{+0.60}_{-0.55} \\rm \\, km \\, s^{-1} \\, Mpc^{-1}$ and $S_8= 0.808\\pm0.012$, with $\\Delta m_e / m_e = 0.0109^{+0.0068}_{-0.0066}$ and $A_{\\rm lens} = 1.030^{+0.039}_{-0.037}$, both exceeding the $\\Lambda$CDM expectations. We find no indication of spatial curvature deviating from flatness, even when including the Cosmic Chronometers and SNe Ia samples. However, when adopting the latest Planck power spectra likelihoods, NPIPE and HiLLiPoP, we obtain lower electron masses with $\\Delta m_e / m_e = -0.0063^{+0.0095}_{-0.0099}$ and $-0.0095^{+0.0078}_{-0.0079}$, relieving the $S_8$ tension only. The lensing amplitude remains anomalously high, with $A_{\\rm lens} = 1.053^{+0.042}_{-0.040}$ and $1.075^{+0.044}_{-0.043}$. Our results point to a promising direction for cosmological models to reconcile the aforementioned discrepancies, although more precise data from future experiments will be necessary to clarify the aforementioned modifications.",
      "pdf_url": "https://arxiv.org/pdf/2508.19081.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.21175",
      "title": "Probing the H0 Tension with Holographic Dark Energy in Unimodular Gravity: Insights from DESI DR2",
      "authors": [
        "Francisco Plaza",
        "Gabriel León",
        "Lucila Kraiselburd"
      ],
      "abstract": "Probing the H0 Tension with Holographic Dark Energy in Unimodular Gravity: Insights from DESI DR2 Francisco Plaza, Gabriel León, Lucila Kraiselburd The last version matches with the one published by EPJC Eur. Phys. J. C (2025) 85: 1262 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Motivated by the recent baryon acoustic oscillation measurements of DESI DR2 collaboration, this works presents an extended analysis of a cosmological model based on holographic dark energy within the framework of Unimodular Gravity. We probe the model with an extensive set of observations: cosmic chronometers, Pantheon Plus$+$SH0ES Type Ia supernovae, DESI DR2 BAO distances, quasar X-ray/UV fluxes (two independent calibrations), and Planck 2018 CMB data. The results are analyzed to assess the modelś ability to alleviate the Hubble tension and, in comparison with the standard $\\Lambda$CDM framework, to determine which of the two scenarios is preferred according to Bayesian evidence. We conclude that the present implementation of holographic dark energy in Unimodular Gravity, while theoretically appealing, does not alleviate the Hubble tension and is not statistically preferred by Bayesian criteria when compared with the standard $\\Lambda$CDM model. Nevertheless, in neither case does the preference become very strong or conclusive against it.",
      "pdf_url": "https://arxiv.org/pdf/2508.21175.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09086",
      "title": "Reionization optical depth and CMB-BAO tension in punctuated inflation",
      "authors": [
        "Zhiqi Huang"
      ],
      "abstract": "Reionization optical depth and CMB-BAO tension in punctuated inflation Zhiqi Huang to match the version to appear in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Within the standard six-parameter Lambda cold dark matter ($\\Lambda$CDM) model, a $2$-$3\\sigma$ tension persists between baryon acoustic oscillation (BAO) measurements from the Dark Energy Spectroscopic Instrument (DESI) and observations of the cosmic microwave background (CMB). Although this tension has often been interpreted as evidence for dynamical dark energy or a sum of neutrino masses below the established minimum, recent studies suggest it may instead originate from an underestimation of the reionization optical depth, particularly when inferred from large-scale CMB polarization. Jhaveri et al. propose that a suppression of large-scale primordial curvature power could partially cancel the contribution of $\\tau$ to the CMB low-$\\ell$ polarization power spectrum, leading to a biased low $\\tau$ measurement in standard analyses. In this work, we investigate whether punctuated inflation - which generates a suppression of primordial power on large scales through a transient fast-roll phase - can raise the inferred $\\tau$ value and thereby reconcile the consistency between CMB and BAO. For simple models with step-like features in the inflaton potential, we find that the constraint on $\\tau$ and the CMB-BAO tension remain nearly identical to those in the standard six-parameter $\\Lambda$CDM model. We provide a physical explanation for this negative result.",
      "pdf_url": "https://arxiv.org/pdf/2509.09086.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08693",
      "title": "Gravity-Selected Galaxy Clusters: a Tight Mass-Richness relation and an unclear Compton $Y$-richness trend",
      "authors": [
        "S. Andreon",
        "M. Radovich"
      ],
      "abstract": "Gravity-Selected Galaxy Clusters: a Tight Mass-Richness relation and an unclear Compton $Y$-richness trend S. Andreon, M. Radovich A&A, in press. The arxiv version is prior of the editorial version, offering hyperlinks, updated references, and cosmetic improvements Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) This paper, the third in a series, investigates the scaling relations between optical richness, weak-lensing mass, and Compton $Y$ for a sample of galaxy clusters selected purely by the effect of their gravitational potential on the shapes of background galaxies. This selection method is uncommon, as most cluster samples in the literature are selected based on signals originating from cluster baryons. We analize a complete sample of 13 gravity-selected clusters at intermediate redshifts (with $0.12 \\leq z_{phot} \\leq 0.40$) with weak-lensing signal-to-noise ratios exceeding 7. We measured cluster richness by counting red-sequence galaxies, identifying two cases of line-of-sight projections in the process, later confirmed by spectroscopic data. Both clusters are sufficiently separated in redshift that contamination in richness can be straighforwardly dealt because the two red sequences do not blend each other. We find an exceptionally tight richness--mass relation using our red-sequence-based richness estimator, with a scatter of just $\\sim0.05$ dex, smaller than the intrinsic scatter of Compton Y with mass for the same sample. The lower scatter highlights the effectiveness of richness compared to Compton $Y$. No outliers are found in the richness-mass scaling, whether or not one cluster with a mass likely affected by projection effects is included in the sample. In the Compton $Y$-richness plane, the data do not delineate a clear trend. The limited sample size is not the sole reason for the unclear relation between Compton $Y$ and richness, since the same sample, with identical richness values, exhibits a highly significant and tight mass-richness correlation.",
      "pdf_url": "https://arxiv.org/pdf/2511.08693.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08716",
      "title": "How to evaluate the sufficiency and complementarity of summary statistics for cosmic fields: an information-theoretic perspective",
      "authors": [
        "Ce Sui",
        "Yi Mao",
        "Xiaosheng Zhao",
        "Tao Jing",
        "Benjamin D. Wandelt"
      ],
      "abstract": "How to evaluate the sufficiency and complementarity of summary statistics for cosmic fields: an information-theoretic perspective Ce Sui, Yi Mao, Xiaosheng Zhao, Tao Jing, Benjamin D. Wandelt Submitted to ApJL. Extended version of the conference paper arXiv:2307.04994. Comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) The advent of increasingly advanced surveys and cosmic tracers has motivated the development of new inference techniques and novel approaches to extracting information from cosmic fields. A central challenge in this endeavor is to quantify the information content carried by these summary statistics in cosmic fields. In particular, how should we assess which statistics are more informative than others and assess the exact degree of complementarity of the information from each statistic? Here, we introduce mutual information (MI) that provides, from an information-theoretic perspective, a natural framework for assessing the sufficiency and complementarity of summary statistics in cosmological data. We demonstrate how MI can be applied to typical inference tasks to make information-theoretic evaluations, using two representative examples: the cosmic microwave background map, from which the power spectrum extracts almost all information as is expected for a Gaussian random field, and the 21~cm brightness temperature map, from which the scattering transform extracts the most non-Gaussian information but is complementary to power spectrum and bispectrum. Our results suggest that MI offers a robust theoretical foundation for evaluating and improving summaries, thereby enabling a deeper understanding of cosmic fields from an information-theoretic perspective.",
      "pdf_url": "https://arxiv.org/pdf/2511.08716.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08820",
      "title": "Analytical Description of Baryonic Matter Fluctuations Using Jeans Filtering Functions in Second-Order Cosmological Perturbation Theory",
      "authors": [
        "Diego Fernando Fonseca",
        "Leonardo Castañeda",
        "Luz Ángela García"
      ],
      "abstract": "Analytical Description of Baryonic Matter Fluctuations Using Jeans Filtering Functions in Second-Order Cosmological Perturbation Theory Diego Fernando Fonseca, Leonardo Castañeda, Luz Ángela García Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmological perturbation theory provides the fundamental framework for describing the evolution of the matter-energy density field in an expanding Universe and serves as the basis for understanding the formation of large-scale structures within the $\\Lambda$CDM paradigm. We present an analytical approach to describe the evolution of fluctuations in a mixed fluid composed of cold dark matter (CDM) and baryonic matter. Assuming that the Universe is governed by General Relativity, we employ the Vlasov equation to derive the general equations of motion for this mixed cosmological fluid, incorporating baryonic effects through the stress tensor by considering only the contributions from baryonic pressure. We introduce the Jeans filtering functions as a biasing tool that allows us to describe baryonic fluctuations with CDM as a tracer, and we obtain an analytical description of the fluctuations -a novel and uncommon approach compared to the accepted computational advances currently available in this field. First- and second-order solutions are obtained through a single iteration of the equations of motion, with the aim of identifying how the filtering scale behaves in a second-order theory compared to the linear one, as well as some of its impacts on the matter power spectrum without the need to compute it explicitly. For the first time, these kind of solutions are derived entirely through an analytical method. Finally, we obtain analytical expressions for baryonic fluctuations in the density and velocity fields, which can be readily evaluated and provide valuable insights into the role of baryons in the Large-scale structure of the Universe. Consequently, these results reveal how pressure effects shift the filtering scale and how including this component could influence parameters such as the filtering mass and the temperature of the pressure-supported components.",
      "pdf_url": "https://arxiv.org/pdf/2511.08820.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08960",
      "title": "Search for host galaxies of unlocalized Fast Radio Bursts in the SDSS IV catalog",
      "authors": [
        "Luz Ángela García",
        "Eduard Piratova-Moreno",
        "Felipe González-Alarcón",
        "Jhonier Rangel"
      ],
      "abstract": "Search for host galaxies of unlocalized Fast Radio Bursts in the SDSS IV catalog Luz Ángela García, Eduard Piratova-Moreno, Felipe González-Alarcón, Jhonier Rangel Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) This theoretical work investigates different models to predict the redshift of Fast Radio Bursts (FRBs) from their observed dispersion measure (DM) and other reported properties. We performed an extensive revision of the FRBs with confirmed galaxy hosts in the literature and compiled an updated catalog. With this sample of FRBs, composed of 117 unique transients, we explore four physically motivated models that relate the DM and redshift ($z$): a linear trend (inspired by the Macquart relation), a log-parabolic function, a power-law, and a combined model from the above. We assess the success of these theoretical proposals by implementing different statistical metrics and ranking them. The DM-$z$ relations are also tested using 100 realizations of 500 simulated FRBs, which follow the observed DM trends. Relying on our theoretical modeling, we establish the probability of $\\sim$1000 FRBs with unknown $z$ (from the latest CHIME data release) to be hosted by galaxies in the SDSS archival dataset. Our validation scheme allows us to predict the FRBs with a probability threshold of $\\geq$0.95 to originate in these galaxies, using their 2D angular position in the sky, magnitude in the r-band, and redshift. This statistical proposal will be tested with upcoming data releases from DESI and new generations of galaxy surveys, such as Euclid, and it opens brilliant possibilities to localize these transients in an automatic pipeline.",
      "pdf_url": "https://arxiv.org/pdf/2511.08960.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09364",
      "title": "Recombination Clumping Factor of Physically Defined Intergalactic Medium at the Epoch of Reionization",
      "authors": [
        "Yuri Oku",
        "Renyue Cen"
      ],
      "abstract": "Recombination Clumping Factor of Physically Defined Intergalactic Medium at the Epoch of Reionization Yuri Oku, Renyue Cen Cosmology and Nongalactic Astrophysics (astro-ph.CO) The recombination clumping factor, $C$, is a key parameter in modeling cosmic reionization, but its value is sensitive to the definition of the Intergalactic Medium (IGM). We investigate the clumping factor using the GAMER adaptive mesh refinement cosmological hydrodynamical simulation code. We introduce a new, physically-motivated definition of the IGM based on the effective transmission factor of ionizing photons. We perform large-scale, full-box simulations with varying intensities of the uniform ultraviolet background, and we find that our physically-defined clumping factor is significantly lower than the values derived from traditional overdensity thresholds. We also introduce an analytic model that distinguishes between the volume-weighted and mass-weighted averages of the neutral fraction, and we find the difference in reionization timing of $\\Delta z \\sim 2$ depending on the assumed clumping factor and the relation between the volume-weighted and mass-weighted neutral fractions. Our zoom-in simulations further show that, while SN feedback increases the clumping factor locally, the effect is limited to $\\sim 100$ kpc scales and does not significantly alter the global clumping factor. The substantially lower clumping factor reduces the required ionizing photon budget, potentially alleviating tension for reionization scenarios driven by rare, bright sources like active galactic nuclei.",
      "pdf_url": "https://arxiv.org/pdf/2511.09364.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09466",
      "title": "Unbiased analysis of primordial non-Gaussianity: the multipoles of the full relativistic power spectrum",
      "authors": [
        "Chris Addis",
        "Sêcloka L. Guedezounme",
        "Jessie Hammond",
        "Chris Clarkson",
        "Federico Montano",
        "Stefano Camera",
        "Sheean Jolicoeur",
        "Roy Maartens"
      ],
      "abstract": "Unbiased analysis of primordial non-Gaussianity: the multipoles of the full relativistic power spectrum Chris Addis, Sêcloka L. Guedezounme, Jessie Hammond, Chris Clarkson, Federico Montano, Stefano Camera, Sheean Jolicoeur, Roy Maartens 43 pages, 20 figures. Comments welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO) A major goal of ongoing and future cosmological surveys of the large-scale structure is to measure local type primordial non-Gaussianity in the galaxy power spectrum through the scale-dependent bias. General relativistic effects have been shown to be degenerate with this measurement, therefore requiring a non-Newtonian approach. In this work, we develop a consistent framework to compute integrated effects, including lensing convergence, time delay, and integrated Sachs--Wolfe, along with the local relativistic projection and wide-separation corrections in the multipoles of the power spectrum. We show that, for a \\textit{Euclid}-like H$\\alpha$-line galaxy survey and a MegaMapper-like Lyman-break galaxy survey, ignoring these effects leads to a bias on the best fit measurement of the amplitude of primordial non-Gaussianity, $f_{\\rm NL}$, of around $ 3\\,\\sigma$ and $ 20 \\, \\sigma$ respectively. When we include these corrections, the uncertainty in our knowledge of the luminosity function leads to further uncertainty in our measurement of $f_{\\rm NL}$. In this work, we show that this degeneracy can be partly mitigated by using a bright-faint multi-tracer analysis, where the observed galaxy sample is subdivided into two separate populations based on luminosity, which provides a $15$--$20\\%$ improvement on the forecasted constraints of local type $f_{\\rm NL}$. In addition, we present a novel calculation of the full multi-tracer covariance with the inclusion of wide-separation corrections~-- all of these results are implemented in the \\textit{Python} code \\textsc{CosmoWAP}.",
      "pdf_url": "https://arxiv.org/pdf/2511.09466.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09482",
      "title": "From M100 to NGC 7331: A Multiband Study and Physical Parameters in Nearby Galaxies",
      "authors": [
        "Julio C. Bertua Marasca",
        "Homer Dávila Gutiérrez",
        "Víctor Huaman Ticona",
        "Javier I. Mosquera Hadatty",
        "Alejandro A. Ramírez Valadez"
      ],
      "abstract": "From M100 to NGC 7331: A Multiband Study and Physical Parameters in Nearby Galaxies Julio C. Bertua Marasca, Homer Dávila Gutiérrez, Víctor Huaman Ticona, Javier I. Mosquera Hadatty, Alejandro A. Ramírez Valadez 9 pages, 9 figures, 3 tables. Independent research project using public astronomical archives (DSS2, GALEX, 2MASS, ROSAT/XMM/Chandra) and open-source tools (Aladin, Python). Not peer-reviewed Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We study five nearby galaxies (M100/NGC 4321, NGC 1300, M 74, M 60, and NGC 7331) by combining multiband imaging (optical, UV, NIR, and X-rays) with simple photometric measurements to show how each spectral window traces different physical components: UV/blue emphasizes recent star formation, NIR outlines the old stellar mass and internal structure, and X-rays reveal compact sources and hot gas. For M100 we present a multiband mosaic with X-ray contours including the SN 1979C region. We compare isophotal morphology in NGC 1300 (barred) and M 74 (unbarred), quantify ellipticity and equivalent radius in M 60, and illustrate a Tully-Fisher distance estimate for NGC 7331, discussing assumptions (inclination, internal corrections) and consistency with classical scales. Our results underscore that a layered view reduces interpretative biases and that straightforward integrations of public data with open-source software yield robust introductory-level physical diagnostics.",
      "pdf_url": "https://arxiv.org/pdf/2511.09482.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09503",
      "title": "Probing Time-Dependent Physics with Phase-Folding CMB Maps",
      "authors": [
        "Yilun Guan"
      ],
      "abstract": "Probing Time-Dependent Physics with Phase-Folding CMB Maps Yilun Guan 14 pages, 7 figures, comments are welcomed! Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Time-resolved observations of the Cosmic Microwave Background (CMB) offer a powerful probe of time-dependent cosmological signals, such as a stochastic gravitational wave background passing through Earth, which imprints a time-varying deflection on the CMB, and time-dependent cosmic birefringence, which induces an oscillating polarization rotation. However, analyses based on time-division CMB maps are fundamentally limited by the mapmaking cadence, restricting sensitivity to frequencies below $\\sim 10^{-5}$ Hz. In this paper we develop a phase-folding mapmaking framework to enable targeted searches of such periodic cosmological signals with frequencies up to the detector sampling rate of $O(100)$ Hz. We demonstrate the power of this framework with two cosmological applications: (1) constraining a stochastic gravitational wave background via its time-dependent lensing signature, and (2) the search for an oscillating polarization rotation from axion-like particles. We show that this technique transforms CMB experiments into broadband probes of the oscillating sky, extending their constraining power from the microhertz regime up to $O(100)$ Hz-an expansion of over seven orders of magnitude in frequency. This provides a new observational window, complementary to other approaches by probing under-explored frequency ranges for gravitational waves and axion-like particles.",
      "pdf_url": "https://arxiv.org/pdf/2511.09503.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.09544",
      "title": "Mitigating Nonlinear Systematics in Weak Lensing Surveys II: Stability and Diagnostics with Intrinsic Alignment",
      "authors": [
        "Shiming Gu",
        "Ludovic van Waerbeke",
        "Francis Bernardeau",
        "Sebastien Fabbro"
      ],
      "abstract": "Mitigating Nonlinear Systematics in Weak Lensing Surveys II: Stability and Diagnostics with Intrinsic Alignment Shiming Gu, Ludovic van Waerbeke, Francis Bernardeau, Sebastien Fabbro 15 pages, 9 plots, comments welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Bernardeau-Nishimichi-Taruya (BNT) transform provides a powerful framework for analysing tomographic cosmic shear data by improving the localization of shear correlations in physical scale. It operates by performing a linear combination of the shear data vector in $\\ell$-space, yielding a transformed vector that is better localized in both redshift and $k$-space. BNT is particularly useful for estimating cosmological parameters while minimizing the impact of poorly understood nonlinear physics, without discarding large amounts of information as is typically done with simple scale cuts. In our previous work, we showed that BNT outperforms traditional weak-lensing analyses; however, that study did not include intrinsic alignments (IA). In the present work, we assess the robustness of our BNT-based $k$-cut framework in the presence of realistic IA models. We consider two cases: (i) when the assumed IA model used in sampling is close to, but not identical to, the true one, and (ii) when the assumed IA model is significantly mis-specified. In the first case, the $k$-cut framework yields precise and unbiased $S_8$ constraints even with limited knowledge of large-scale modes. In the second, the BNT transform serves as a powerful diagnostic tool, revealing internal inconsistencies in the assumed IA model across $k$- and redshift-space, indicating that the corresponding cosmological constraints cannot be trusted until a more accurate IA model is adopted.",
      "pdf_url": "https://arxiv.org/pdf/2511.09544.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08685",
      "title": "Kinematic scaling relations of disc galaxies from ionised gas at $z\\sim~1$ and their connection with dark matter halos",
      "authors": [
        "Pavel E. Mancera Piña",
        "Enrico M. Di Teodoro",
        "S. Michael Fall",
        "Antonino Marasco",
        "Mariska Kriek",
        "Marco Martorano"
      ],
      "abstract": "Kinematic scaling relations of disc galaxies from ionised gas at $z\\sim~1$ and their connection with dark matter halos Pavel E. Mancera Piña, Enrico M. Di Teodoro, S. Michael Fall, Antonino Marasco, Mariska Kriek, Marco Martorano Submitted to A&A. Version after addressing referee report Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We derive the Tully-Fisher (TFR, $M_\\ast-V_{\\rm circ, f}$) and Fall (FR, $j_\\ast-M_\\ast$) relations at redshift $z = 0.9$ using a sample of 43 main-sequence disc galaxies with H$\\alpha$ IFU data and JWST/HST imaging. The strength of our analysis lies in the use of state-of-the-art 3D kinematic models to infer galaxy rotation curves, the inclusion and morphological modelling of NIR bands, and the use of SED modelling applied to our photometry measurements to estimate stellar masses. After correcting the inferred H$\\alpha$ velocities for asymmetric drift, we find a TFR of the form $\\log(M_\\ast / M_\\odot) = a \\log(V_{\\rm circ,f} / 150~\\mathrm{km\\,s^{-1}}) + b$, with $a=3.82^{+0.55}_{-0.40}$ and $b=10.27^{+0.06}_{-0.07}$, as well as a FR of the form $\\log(j_\\ast / \\mathrm{kpc\\,km\\,s^{-1}}) = a \\log(M_\\ast / 10^{10.5} M_\\odot) + b$, with $a=0.44^{+0.06}_{-0.06}$ and $b=2.86^{+0.02}_{-0.02}$. When compared to their $z=0$ counterparts, we find moderate evolution in the TFR and strong evolution in the FR over the past $8$ Gyr. We interpret our findings in the context of the galaxy-to-halo scaling parameters $f_{\\rm M}=M_\\ast/M_{\\rm vir}$ and $f_{\\rm j}=j_\\ast/j_{\\rm vir}$. We infer that at $z=0.9$ both $f_{\\rm M}$ and $f_{\\rm j}$ are higher and less mass-dependent than at $z=0$. We speculate that the evolution of $f_{\\rm j}$ can be driven by more efficient and centrally concentrated stellar feedback at $z=0.9$, or by an appreciable dry merger history. We also show that assuming the galaxies populating our $z=0.9$ relations evolve into those populating the $z=0$ relations leads to an apparent discrepancy with the hierarchical growth of dark matter halos. To solve this issue, one needs to evoke a progenitor bias scenario, unknown systematics affecting our and previous measurements, or consider the possibility that H$\\alpha$ kinematics is not a reliable dynamical tracer.",
      "pdf_url": "https://arxiv.org/pdf/2511.08685.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09543",
      "title": "Conservation of magnetic-helicity fluctuations due to spatial decorrelation of fluxes in decaying MHD turbulence",
      "authors": [
        "Justin Kin Jun Hew",
        "David N. Hosking",
        "Christoph Federrath",
        "James R. Beattie",
        "Neco Kriel"
      ],
      "abstract": "Conservation of magnetic-helicity fluctuations due to spatial decorrelation of fluxes in decaying MHD turbulence Justin Kin Jun Hew, David N. Hosking, Christoph Federrath, James R. Beattie, Neco Kriel Fluid Dynamics (physics.flu-dyn); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Hosking & Schekochihin (2021, Phys. Rev. X 11, 041005) have proposed that statistically isotropic decaying MHD turbulence without net magnetic helicity conserves the mean square fluctuation level of magnetic helicity in large volumes -- or, equivalently, the integral over space of the two-point correlation function of the magnetic-helicity density, denoted $I_H$. Formally, the conservation and gauge invariance of $I_H$ require the vanishing of certain boundary terms related to the strength of long-range spatial correlations. These boundary terms represent the ability (or otherwise) of the turbulence to organise fluxes over arbitrarily large distances to deplete or enhance fluctuations of magnetic helicity. In this work, we present a theory of these boundary terms, employing a methodology analogous to that of Batchelor & Proudman (1956, Philos. Trans. R. Soc. A 248, 369) to determine the relevant asymptotic forms of correlation functions. We find that long-range correlations of sufficient strength to violate the conservation of $I_H$ cannot develop dynamically if the evolution equation for the magnetic vector potential is chosen to be local in space. Likewise, we find that such correlations cannot develop for a wide class of gauge choices that make this equation non-local (including the Coulomb gauge). Nonetheless, we also identify a class of non-local gauge choices for which correlations that are sufficiently strong to violate the conservation of $I_H$ do appear possible. We verify our theoretical predictions for the case of the Coulomb gauge with measurements of correlation functions in a high-resolution numerical simulation.",
      "pdf_url": "https://arxiv.org/pdf/2511.09543.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2308.00070",
      "title": "Phase transition during inflation and the gravitational wave signal at pulsar timing arrays",
      "authors": [
        "Haipeng An",
        "Boye Su",
        "Hanwen Tai",
        "Lian-Tao Wang",
        "Chen Yang"
      ],
      "abstract": "Phase transition during inflation and the gravitational wave signal at pulsar timing arrays Haipeng An, Boye Su, Hanwen Tai, Lian-Tao Wang, Chen Yang Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The gravitational wave (GW) signal offers a promising window into the dynamics of the early universe. The recent results from the pulsar timing arrays (PTAs) could be the first glimpse of such new physics. In particular, they could point to new details during inflation, which can not be probed by other means. We explore the possibility that the new results could come from the secondary GWs sourced by curvature perturbations, generated by a first-order phase transition during inflation. Based on the results of a field-theoretic lattice simulation of the phase transition process, we show that the GW signal generated through this mechanism can account for the new results from the PTAs. We analyze the spectral shape of the signal in detail. Future observations can use such information to distinguish the GW signal considered here from other possible sources.",
      "pdf_url": "https://arxiv.org/pdf/2308.00070.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.10299",
      "title": "Nature-inspired optimization, the Philippine Eagle, and cosmological parameter estimation",
      "authors": [
        "Reginald Christian Bernardo",
        "Erika Antonette Enriquez",
        "Renier Mendoza",
        "Reinabelle Reyes",
        "Arrianne Crystal Velasco"
      ],
      "abstract": "Nature-inspired optimization, the Philippine Eagle, and cosmological parameter estimation Reginald Christian Bernardo, Erika Antonette Enriquez, Renier Mendoza, Reinabelle Reyes, Arrianne Crystal Velasco 16 pages + appendices + refs, 13 figures, discussion improved, to appear in ASCOM, our codes in this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); Computational Physics (physics.comp-ph); Data Analysis, Statistics and Probability (physics.data-an) Precise and accurate estimation of cosmological parameters is crucial for understanding the Universe's dynamics and addressing cosmological tensions. In this methods paper, we explore bio-inspired metaheuristic algorithms, including the Improved Multi-Operator Differential Evolution scheme and the Philippine Eagle Optimization Algorithm (PEOA), alongside the relatively known genetic algorithm, for cosmological parameter estimation. Using mock data that underlay a true fiducial cosmology, we test the viability of each optimization method to recover the input cosmological parameters with confidence regions generated by bootstrapping on top of optimization. We compare the results with Markov chain Monte Carlo (MCMC) in terms of accuracy and precision, and show that PEOA performs comparably well under the specific circumstances provided. Understandably, Bayesian inference and optimization serve distinct purposes, but comparing them highlights the potential of nature-inspired algorithms in cosmological analysis, offering alternative pathways to explore parameter spaces and validate standard results.",
      "pdf_url": "https://arxiv.org/pdf/2505.10299.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.10450",
      "title": "Genetic algorithm demystified for cosmological parameter estimation",
      "authors": [
        "Reginald Christian Bernardo",
        "Yun Chen"
      ],
      "abstract": "Genetic algorithm demystified for cosmological parameter estimation Reginald Christian Bernardo, Yun Chen 12 pages + refs, 6 figures, discussion improved, our codes in this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); Computational Physics (physics.comp-ph); Physics Education (physics.ed-ph) Genetic algorithm (GA) belongs to a class of nature-inspired evolutionary algorithms that leverage concepts from natural selection to perform optimization tasks. In cosmology, the standard method for estimating parameters is the Markov chain Monte Carlo (MCMC) approach, renowned for its reliability in determining cosmological parameters. This paper presents a pedagogical examination of GA as a potential corroborative tool to MCMC for cosmological parameter estimation. Utilizing data sets from cosmic chronometers and supernovae with a curved $\\Lambda$CDM model, we explore the impact of GA's key hyperparameters -- such as the fitness function, crossover rate, and mutation rate -- on the population of cosmological parameters determined by the evolutionary process. We compare the results obtained with GA to those by MCMC, analyzing their effectiveness and viability for cosmological application.",
      "pdf_url": "https://arxiv.org/pdf/2505.10450.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.06274",
      "title": "The Atacama Cosmology Telescope: DR6 Power Spectrum Foreground Model and Validation",
      "authors": [
        "Benjamin Beringue",
        "Kristen M. Surrao",
        "J. Colin Hill",
        "Zachary Atkins",
        "Nicholas Battaglia",
        "Boris Bolliet",
        "Erminia Calabrese",
        "Steve K. Choi",
        "Susan E. Clark",
        "Adriaan J. Duivenvoorden",
        "Jo Dunkley",
        "Serena Giardiello",
        "Samuel Goldstein",
        "Brandon S. Hensley",
        "Renée Hložek",
        "Hidde T. Jense",
        "Darby Kramer",
        "Adrien La Posta",
        "Thibaut Louis",
        "Yogesh Mehta",
        "Kavilan Moodley",
        "Sigurd Naess",
        "Bruce Partridge",
        "Frank J. Qu",
        "Bernardita Ried Guachalla",
        "Neelima Sehgal",
        "Cristóbal Sifón",
        "Suzanne T. Staggs",
        "Hy Trac",
        "Alexander Van Engelen",
        "Edward J. Wollack"
      ],
      "abstract": "The Atacama Cosmology Telescope: DR6 Power Spectrum Foreground Model and Validation Benjamin Beringue, Kristen M. Surrao, J. Colin Hill, Zachary Atkins, Nicholas Battaglia, Boris Bolliet, Erminia Calabrese, Steve K. Choi, Susan E. Clark, Adriaan J. Duivenvoorden, Jo Dunkley, Serena Giardiello, Samuel Goldstein, Brandon S. Hensley, Renée Hložek, Hidde T. Jense, Darby Kramer, Adrien La Posta, Thibaut Louis, Yogesh Mehta, Kavilan Moodley, Sigurd Naess, Bruce Partridge, Frank J. Qu, Bernardita Ried Guachalla, Neelima Sehgal, Cristóbal Sifón, Suzanne T. Staggs, Hy Trac, Alexander Van Engelen, Edward J. Wollack Cosmology and Nongalactic Astrophysics (astro-ph.CO) We discuss the model of astrophysical emission at millimeter wavelengths used to characterize foregrounds in the multi-frequency power spectra of the Atacama Cosmology Telescope (ACT) Data Release 6 (DR6), expanding on Louis et al. (2025). We detail several tests to validate the capability of the DR6 parametric foreground model to describe current observations and complex simulations, and show that cosmological parameter constraints are robust against model extensions and variations. We demonstrate consistency of the model with pre-DR6 ACT data and observations from Planck and the South Pole Telescope. We evaluate the implications of using different foreground templates and extending the model with new components and/or free parameters. In all scenarios, the DR6 $\\Lambda$CDM and $\\Lambda$CDM+$N_{\\rm eff}$ cosmological parameters shift by less than $0.5\\sigma$ relative to the baseline constraints. Some foreground parameters shift more; we estimate their systematic uncertainties associated with modeling choices. From our constraint on the kinematic Sunyaev-Zel'dovich power, we obtain a conservative limit on the duration of reionization of $\\Delta z_{\\rm rei} < 4.4$, assuming a reionization midpoint consistent with optical depth measurements and a minimal low-redshift contribution, with varying assumptions for this component leading to tighter limits. Finally, we analyze realistic non-Gaussian, correlated microwave sky simulations containing Galactic and extragalactic foreground fields, built independently of the DR6 parametric foreground model. Processing these simulations through the DR6 power spectrum and likelihood pipeline, we recover the input cosmological parameters of the underlying cosmic microwave background field, a new demonstration for small-scale CMB analysis. These tests validate the robustness of the ACT DR6 foreground model and cosmological parameter constraints.",
      "pdf_url": "https://arxiv.org/pdf/2506.06274.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.08687",
      "title": "Interpreting Hubble tension with a cascade decaying dark matter sector",
      "authors": [
        "Quan Zhou",
        "Zixuan Xu",
        "Sibo Zheng"
      ],
      "abstract": "Interpreting Hubble tension with a cascade decaying dark matter sector Quan Zhou, Zixuan Xu, Sibo Zheng 18 pages, 5 figures; v2: typos corrected, added discussion and references Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Hubble tension can be alleviated by altering either early- or late-time $\\Lambda$CDM. So far, extensive studies have shown that only early dark energy or ad hoc combinations of those two-fold effects can reduce the tension to $3\\sigma$ level or lower. In this work, we improve the latter solution by considering a cascade decaying dark matter sector, where a parent particle produces relativistic dark matter in the early Universe and the dark matter subsequently decays to neutrinos in the late-time Universe. We parametrize this model with four model parameters, carry out a Markov Chain Monte Carlo fit to Planck 2018+BAO+Pantheon data sets, and compare it to Big Bang Nucleosynthesis limits, neutrino flux bounds, Planck data about matter power spectrum, and structure formation constraint. Within parameter regions reducing the Hubble tension to $3.2\\sigma$ and compatible with the existing constraints, the main phenomenological features include a larger $S_{8}\\sim 0.84$, smaller $n_{s}\\sim 0.95$ and larger matter power spectrum relative to the $\\Lambda$CDM, which are left for future tests.",
      "pdf_url": "https://arxiv.org/pdf/2507.08687.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.10191",
      "title": "Machine learning analysis of Photometric data from the Dark Energy Survey",
      "authors": [
        "Elcio Abdalla",
        "Filipe B. Abdalla",
        "Alessandro Marins",
        "Amilcar Queiroz",
        "Rafael M. Ribeiro",
        "Alex S. C. Souza"
      ],
      "abstract": "Machine learning analysis of Photometric data from the Dark Energy Survey Elcio Abdalla, Filipe B. Abdalla, Alessandro Marins, Amilcar Queiroz, Rafael M. Ribeiro, Alex S. C. Souza Elcio Abdalla, Filipe B Abdalla, Alessandro Marins, Amilcar Queiroz, Rafael M Ribeiro, Alex S C Souza, Monthly Notices of the Royal Astronomical Society, Volume 544, Issue 2, December 2025, Pages 1514-1529 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) In order to retrieve cosmological parameters from photometric surveys, we need to estimate the distribution of the photometric redshift in the sky with excellent accuracy. We use and apply three different machine learning methods to publicly available Dark Energy Survey data release 2 (DR2): a) Artificial Neural Network for photometric redshifts (ANNz2); b) Gaussian processes for photometric redshifts (GPz); and c) Keras, a deep learning application programming interface in Python. We compare these different techniques applied to training data obtained from the VIPERS survey. To deal with the incompleteness of the VIPERS catalogue, we use a space-partitioning data structure (K-d Tree) to estimate the reliability of the obtained photometric redshifts. We build a catalogue which is robust to the lack of training data in certain regions of colour space. We use the photometric data to create maps of overdensity as a function of the redshift distribution for more than 500 million galaxies. These maps split the sky into several onion-like redshift slices, which can be readily used for cosmological parameter estimation. On each angular slice, we create and present maps of the angular distribution of galaxies in that slice as well as an estimate of the redshift distribution, $n(z)$, related to the galaxy distribution of that slice, which is recovered from the redshift estimation methods. We achieve a sub-sample of DES galaxies, which are well matched to the VIPERS sample with an accuracy of the photometric redshifts with a $\\sigma_{68}\\sim0.035$ and a catastrophic outlier rate of the order of 3 per cent.",
      "pdf_url": "https://arxiv.org/pdf/2508.10191.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.15360",
      "title": "Quintessential inflation studied through Semiclassical Methods",
      "authors": [
        "Jordan Zambrano",
        "Miguel Agama",
        "Marcos Garzón",
        "Werner Bramer-Escamilla",
        "Clara Rojas",
        "Teófilo Vargas"
      ],
      "abstract": "Quintessential inflation studied through Semiclassical Methods Jordan Zambrano, Miguel Agama, Marcos Garzón, Werner Bramer-Escamilla, Clara Rojas, Teófilo Vargas 38 Pages, 10 Figues, comments of the Referees incorporated, accepted for publication in Int. J Mod. Phys. D. arXiv admin note: text overlap with arXiv:2203.00741 Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work, we solved the scalar and tensor perturbation equations numerically and using the improved uniform approximation method together with the third-order phase-integral method, for the $\\alpha$-attractor inflationary model. This inflationary model has become very important because it allows us to describe the initial accelerated expansion of the universe in the inflationary epoch, and the current accelerated expansion with the same potential that depends on one scalar field $\\varphi$. Once the equations for the scalar and tensor power spectra are found, we calculate the observables: the scalar-to-tensor ratio $r$, and the scalar spectral index $n_S$, concluding that semiclassical methods give excellent results compared to numerical integration. We also compare both observables in the $\\alpha$-attractor and the Starobinsky inflationary model.",
      "pdf_url": "https://arxiv.org/pdf/2509.15360.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19803",
      "title": "The richest clusters in the Coma and Leo superclusters: Properties and evolution",
      "authors": [
        "Maret Einasto",
        "Peeter Tenjes",
        "Rain Kipper",
        "Pekka Heinämäki",
        "Elmo Tempel",
        "Lauri Juhan Liivamägi",
        "Michael J. West",
        "Boris Deshev",
        "Jaan Einasto"
      ],
      "abstract": "The richest clusters in the Coma and Leo superclusters: Properties and evolution Maret Einasto, Peeter Tenjes, Rain Kipper, Pekka Heinämäki, Elmo Tempel, Lauri Juhan Liivamägi, Michael J. West, Boris Deshev, Jaan Einasto 19 pages, 12 figures, A&A, accepted, typos corrected Cosmology and Nongalactic Astrophysics (astro-ph.CO) We study the substructure, connectivity, and galaxy content of galaxy clusters A1656 and 1367 in the Coma supercluster and of A1185 in the Leo supercluster with the aim of understanding the evolution of clusters from turnaround to virialisation. We used data from the SDSS DR10 MAIN galaxy sample and from DESI cluster catalogues. The projected phase space diagram and the distribution of mass were used to identify regions of various infall stages (early and late infall, and regions of ongoing infall, i.e. regions of influence), their characteristic radii, embedded mass, and density contrasts in order to study the evolution of clusters with the spherical collapse model. We determined the substructure of clusters using normal mixture modelling and their connectivity by counting filaments in the cluster's regions of influence, analysed galaxy content of clusters, and derived scaling relations between cluster masses. All three clusters have a substructure with two to five components and up to six filaments connected to them. The radii of regions of influence are $R_\\mathrm{inf} \\approx 4$ Mpc, and the density contrast at their borders is $\\Delta\\rho_{inf} \\approx 50 - 60$. The scaling relations between the masses of clusters have a very small scatter. The galaxy content of the clusters and of their regions of influence vary from cluster to cluster. In superclusters the percentage of quiescent galaxies is higher than in low-density regions between superclusters. The collapse of the regions of influence of clusters started at redshifts $z \\approx 0.4 - 0.5$. Clusters will be virialised in $\\approx 3.3$ Gyrs. Clusters in superclusters will not merge, and their present-day turnaround regions will be virialised in $\\approx 10$ Gyrs. The large variety of properties of clusters suggests that they have followed different paths during evolution.",
      "pdf_url": "https://arxiv.org/pdf/2510.19803.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.07765",
      "title": "JWST Lensed Quasar Dark Matter Survey III: Dark Matter Sensitive Flux Ratios and Warm Dark Matter Constraint from the Full Sample",
      "authors": [
        "R. E. Keeley",
        "A. M. Nierenberg",
        "D. Gilman",
        "T. Treu",
        "X. Du",
        "C. Gannon",
        "P. Mozumdar",
        "K. C. Wong",
        "H. Paugnat",
        "S. Birrer",
        "M. Malkan",
        "A. J. Benson",
        "K. N. Abazajian",
        "T. Anguita",
        "V. N. Bennert",
        "S. G. Djorgovski",
        "S. F. Hoenig",
        "A. Kusenko",
        "T. Morishita",
        "V. Motta",
        "L. A. Moustakas",
        "W. Sheu",
        "D. Sluse",
        "D. Stern",
        "M. Stiavelli",
        "D. Williams"
      ],
      "abstract": "JWST Lensed Quasar Dark Matter Survey III: Dark Matter Sensitive Flux Ratios and Warm Dark Matter Constraint from the Full Sample R. E. Keeley, A. M. Nierenberg, D. Gilman, T. Treu, X. Du, C. Gannon, P. Mozumdar, K. C. Wong, H. Paugnat, S. Birrer, M. Malkan, A. J. Benson, K. N. Abazajian, T. Anguita, V. N. Bennert, S. G. Djorgovski, S. F. Hoenig, A. Kusenko, T. Morishita, V. Motta, L. A. Moustakas, W. Sheu, D. Sluse, D. Stern, M. Stiavelli, D. Williams Anc folder contains supplementary materials Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the full sample of measurements of the warm dust emission of 31 strongly-lensed, multiply imaged quasars, observed with JWST MIRI multiband imaging, which we use to constrain the particle properties of dark matter. The strongly lensed warm dust region of quasars is compact and statistically sensitive to a population of dark matter halos down to masses of $10^6$ M$_\\odot$. The high spatial resolution and infrared sensitivity of MIRI make it uniquely suited to measure multiply imaged warm dust emission from quasars and thus to infer the properties of low-mass dark halos. We use the measured flux ratios to test for a warm dark matter turnover in the halo mass function. To infer the dark matter parameters, we use a forward modeling pipeline which explores dark matter parameters while also accounting for tidal stripping effects on subhalos, globular clusters, and complex deflector macromodels with $m=1, m=3, \\text{ and } m=4$ elliptical multipole moments. Adopting a comparable prior on the projected density of substructure to our previous analyses, the data presented here provide a factor of 2 improvement in sensitivity to a turnover in the halo mass function. Assuming subhalo abundance predicted by the semi-analytic model galacticus we infer with a Bayes factor of 10:1, a half-mode mass $m_{\\rm{hm}} < 10^{7.8} M_{\\odot}$ (m>5.6 keV for a thermally produced dark matter particle). If instead we use a prior from N-body simulations, we infer $m_{\\rm{hm}} < 10^{7.5} M_{\\odot}$ (m>6.9 keV). This is one of the strongest constraints to date on a turnover on the halo mass function, and the flux ratios and inference methodology presented here can be used to test a broad range of dark matter physics.",
      "pdf_url": "https://arxiv.org/pdf/2511.07765.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08266",
      "title": "Euclid preparation. Non-Gaussianity of 2-point statistics likelihood: Precise analysis of the matter power spectrum distribution",
      "authors": [
        "Euclid Collaboration",
        "J. Bel",
        "S. Gouyou Beauchamps",
        "P. Baratta",
        "L. Blot",
        "C. Carbone",
        "P.-S. Corasaniti",
        "E. Sefusatti",
        "S. Escoffier",
        "W. Gillard",
        "A. Amara",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "P. Battaglia",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "V. F. Cardone",
        "J. Carretero",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "A. Costille",
        "F. Courbin",
        "H. M. Courtois",
        "A. Da Silva",
        "H. Degaudenzi",
        "S. de la Torre",
        "G. De Lucia",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "N. Fourmanoit",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "L. Guzzo",
        "S. V. H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "B. Kubik",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti",
        "D. Maino",
        "E. Maiorano",
        "O. Mansutti",
        "O. Marggraf",
        "K. Markovic",
        "M. Martinelli",
        "N. Martinet",
        "F. Marulli",
        "R. Massey",
        "E. Medinaceli",
        "Y. Mellier",
        "M. Meneghetti",
        "E. Merlin",
        "G. Meylan",
        "A. Mora",
        "M. Moresco",
        "L. Moscardini",
        "C. Neissner"
      ],
      "abstract": "Euclid preparation. Non-Gaussianity of 2-point statistics likelihood: Precise analysis of the matter power spectrum distribution Euclid Collaboration, J. Bel, S. Gouyou Beauchamps, P. Baratta, L. Blot, C. Carbone, P.-S. Corasaniti, E. Sefusatti, S. Escoffier, W. Gillard, A. Amara, S. Andreon, N. Auricchio, C. Baccigalupi, M. Baldi, S. Bardelli, P. Battaglia, A. Biviano, E. Branchini, M. Brescia, J. Brinchmann, S. Camera, G. Cañas-Herrera, V. Capobianco, V. F. Cardone, J. Carretero, S. Casas, M. Castellano, G. Castignani, S. Cavuoti, K. C. Chambers, A. Cimatti, C. Colodro-Conde, G. Congedo, C. J. Conselice, L. Conversi, Y. Copin, A. Costille, F. Courbin, H. M. Courtois, A. Da Silva, H. Degaudenzi, S. de la Torre, G. De Lucia, F. Dubath, C. A. J. Duncan, X. Dupac, M. Farina, R. Farinelli, F. Faustini, S. Ferriol, F. Finelli, N. Fourmanoit, M. Frailis, E. Franceschi, M. Fumana, S. Galeotta, K. George, B. Gillis, C. Giocoli, J. Gracia-Carpio, A. Grazian, F. Grupp, L. Guzzo, S. V. H. Haugan, W. Holmes, F. Hormuth, A. Hornstrup, K. Jahnke, M. Jhabvala, B. Joachimi, E. Keihänen, S. Kermiche, B. Kubik, M. Kunz, H. Kurki-Suonio, A. M. C. Le Brun, S. Ligori, P. B. Lilje, V. Lindholm, I. Lloro, G. Mainetti, D. Maino, E. Maiorano, O. Mansutti, O. Marggraf, K. Markovic, M. Martinelli, N. Martinet, F. Marulli, R. Massey, E. Medinaceli, Y. Mellier, M. Meneghetti, E. Merlin, G. Meylan, A. Mora, M. Moresco, L. Moscardini, C. Neissner Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the non-Gaussian features in the distribution of the matter power spectrum multipoles. Using the COVMOS method, we generate 100\\,000 mock realisations of dark matter density fields in both real and redshift space across multiple redshifts and cosmological models. We derive an analytical framework linking the non-Gaussianity of the power spectrum distribution to higher-order statistics of the density field, including the trispectrum and pentaspectrum. We explore the effect of redshift-space distortions, the geometry of the survey, the Fourier binning, the integral constraint, and the shot noise on the skewness of the distribution of the power spectrum measurements. Our results demonstrate that the likelihood of the estimated matter power spectrum deviates significantly from a Gaussian assumption on nonlinear scales, particularly at low redshift. This departure is primarily driven by the pentaspectrum contribution, which dominates over the trispectrum at intermediate scales. We also examine the impact of the finiteness of the survey geometry in the context of the Euclid mission and find that both the shape of the survey and the integral constraint amplify the skewness.",
      "pdf_url": "https://arxiv.org/pdf/2511.08266.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08684",
      "title": "Radiation-mediated shocks in gamma-ray bursts: spectral evolution",
      "authors": [
        "Filip Alamaa",
        "Frédéric Daigne"
      ],
      "abstract": "Radiation-mediated shocks in gamma-ray bursts: spectral evolution Filip Alamaa, Frédéric Daigne High Energy Astrophysical Phenomena (astro-ph.HE) Radiation-mediated shocks (RMS) occurring below the photosphere in a gamma-ray burst (GRB) jet could play a crucial role in shaping the prompt emission. In this paper, we study the time-resolved signal expected from such early shocks. An internal collision is modeled using a 1D special relativistic hydrodynamical simulation and the photon distributions in the resulting forward and reverse shocks, as well as in the common downstream region, are followed to well above the photosphere using a designated RMS simulation code. The light curve and time resolved spectrum of the resulting single pulse is computed taking into account the emission at different optical depths and angles to the line-of-sight. For the specific case considered, we find a light curve consisting of a short pulse lasting $\\sim 0.1$ s for an assumed redshift of $z = 1$. The efficiency is large, with $\\approx 23$% of the total burst energy being radiated. The spectrum has a complex shape at very early times, after which it settles into a more generic shape with a smooth curvature below the peak energy, $E_p$, and a clear high-energy power law that cuts off at $\\sim 5$ MeV in the observer frame. The spectrum becomes narrower and softer at late times with $E_p$ steadily decreasing during the pulse decay from $E_p \\approx 250~$keV to $E_p \\approx 100$ keV. The low-energy index, $\\alpha$, decreases during the bright part of the pulse from $\\alpha \\approx -0.5$ to $\\alpha \\approx -1$, although the low-energy part is better fit with a broken power law when the signal-to-noise ratio is high. The high-energy power law is generated by the reverse shock at low optical depths ($\\tau < 30$) and has an index that decreases from $\\beta \\approx -2$ to $\\beta \\approx -2.4$. These results provide support for RMSs as potential candidates for the prompt emission in GRBs.",
      "pdf_url": "https://arxiv.org/pdf/2511.08684.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08784",
      "title": "Symbolic Regression Is All You Need: From Simulations to Scaling Laws in Binary Neutron Star Mergers",
      "authors": [
        "P. Darc",
        "Clecio R. Bom",
        "Charles Kilpatrick",
        "Bernardo M. O. Fraga",
        "Gabriel S. M. Teixeira"
      ],
      "abstract": "Symbolic Regression Is All You Need: From Simulations to Scaling Laws in Binary Neutron Star Mergers P. Darc, Clecio R. Bom, Charles Kilpatrick, Bernardo M. O. Fraga, Gabriel S. M. Teixeira Accepted at Machine Learning and the Physical Sciences Workshop, NeurIPS 2025 High Energy Astrophysical Phenomena (astro-ph.HE) Gravitational wave sources with electromagnetic counterparts have highlighted the need for predictive, interpretable models linking the parameters of compact binary systems to post-merger remnants and mass outflows. In this work, we explore AI-driven symbolic regression (SR) frameworks to derive updated analytical relations for disk ejecta mass in binary neutron star mergers, trained on state-of-the-art numerical relativity simulations. Our method reveals a set of compact equations that outperform existing fitting formulae across multiple statistical metrics while remaining physically interpretable. Notably, SR also enables alternative predictor sets (e.g., $\\{M_1,M_2,\\tilde{\\Lambda}\\}$) that match or exceed the accuracy of models relying solely on compactness of the lightest neutron star ($C_1$), enabling new parameter constraints from electromagnetic observations. Unlike traditional black-box machine learning models, these closed-form expressions generalize robustly to regions of the parameter space not represented in the training data, offering a physics-informed tool for multimessenger observations and constraints on the neutron star equation of state.",
      "pdf_url": "https://arxiv.org/pdf/2511.08784.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.08828",
      "title": "Detection Prospects for AGNs with the Cherenkov Telescope Array",
      "authors": [
        "Luana Passos-Reis",
        "Elisabete M. de Gouveia Dal Pino",
        "Tarek Hassan",
        "Santiago Pita",
        "Jonathan Biteau",
        "Jean-Philippe Lenain",
        "Atreya Acharyya",
        "Alberto Domínguez",
        "Lucas Gréaux",
        "Luiz Augusto Stuani Pereira",
        "Edivaldo Moura Santos",
        "Paolo Goldoni"
      ],
      "abstract": "Detection Prospects for AGNs with the Cherenkov Telescope Array Luana Passos-Reis, Elisabete M. de Gouveia Dal Pino, Tarek Hassan, Santiago Pita, Jonathan Biteau, Jean-Philippe Lenain, Atreya Acharyya, Alberto Domínguez, Lucas Gréaux, Luiz Augusto Stuani Pereira, Edivaldo Moura Santos, Paolo Goldoni (for the CTAO Consortium) 8 pages, 4 figures. Presented at the 39th International Cosmic Ray Conference (ICRC 2025), 2025 High Energy Astrophysical Phenomena (astro-ph.HE) The Cherenkov Telescope Array Observatory (CTAO) will enable detailed studies of Active Galactic Nuclei (AGN) in the very-high-energy (VHE) regime, as the next-generation ground-based gamma-ray observatory, designed to enhance sensitivity and energy coverage (20 GeV -- 300 TeV) over current Imaging Atmospheric Cherenkov Telescopes (IACTs). In the context of the CTAO Science Collaboration, within the AGN Population working group, we developed a variability-based strategy to improve predictions of AGNs detectable by CTAO, using Fermi-LAT data and normalized excess variance (NXS) as a tracer of flux variability. By extrapolating from 30-day to 3-day timescales, we expanded the sample of sources with short-timescale variability estimates from 87 to 407. This approach allows us to identify flaring and distant AGNs that are promising CTAO targets. The results are being used to support the CTAO extragalactic science program and will be included in an upcoming Consortium publication for the AGN Population collaboration.",
      "pdf_url": "https://arxiv.org/pdf/2511.08828.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08850",
      "title": "Modelling Millisecond Pulsar Populations in Globular Clusters with NBODY6++GPU",
      "authors": [
        "Yuzhe Song",
        "Debatri Chattopadhyay",
        "Jarrod Hurley",
        "Rainer Spurzem",
        "Francesco Flammini Dotti",
        "Kai Wu"
      ],
      "abstract": "Modelling Millisecond Pulsar Populations in Globular Clusters with NBODY6++GPU Yuzhe Song, Debatri Chattopadhyay, Jarrod Hurley, Rainer Spurzem, Francesco Flammini Dotti, Kai Wu 4 pages, 1 figure. Proceedings for IAU Symposium 398/MODEST-25 High Energy Astrophysical Phenomena (astro-ph.HE) Millisecond pulsars (MSPs) are neutron stars with spin periods as short as a few milliseconds, formed through mass accretion from companion stars. In the dense environments of globular clusters (GCs), MSPs are likely to originate through dynamically assembled interacting binaries. Over 300 MSPs have been detected in GCs to date, more than half of the known Galactic MSP population. In this work, we model MSP populations in intermediate-mass GCs using the direct $N$-body code \\textsc{NBODY6++GPU}. We update the code by implementing pulsar spin-down due to magnetic braking and spin-up through accretion, and use this framework to model the pulsar population in the globular cluster M71 to investigate the pulsar population within and the associated gravitational wave transients.",
      "pdf_url": "https://arxiv.org/pdf/2511.08850.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.08966",
      "title": "The Dawn of Gravitational Wave Astronomy at Light-year Wavelengths: Insights from Pulsar Timing Arrays",
      "authors": [
        "Stephen R. Taylor"
      ],
      "abstract": "The Dawn of Gravitational Wave Astronomy at Light-year Wavelengths: Insights from Pulsar Timing Arrays Stephen R. Taylor Invited review for Springer Nature Astronomy Awardee Prize Collection. Matches version for publication High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Arrays of precisely-timed millisecond pulsars are used to search for gravitational waves with periods of months to decades. Gravitational waves affect the path of radio pulses propagating from a pulsar to Earth, causing the arrival times of those pulses to deviate from expectations based on the physical characteristics of the pulsar system. By correlating these timing residuals in a pulsar timing array (PTA), one can search for a statistically isotropic background of gravitational waves by revealing evidence for a distinctive pattern predicted by General Relativity, known as the Hellings \\& Downs curve. On June 29 2023, five regional PTA collaborations announced the first evidence for GWs at light-year wavelengths, predicated on support for this correlation pattern with statistical significances ranging from $\\sim\\!2-4\\sigma$. The amplitude and shape of the recovered GW spectrum has also allowed many investigations of the expected source characteristics, ranging from a cosmic population of supermassive binary black holes to numerous processes in the early Universe. In the future, we expect to resolve signals from individual binary systems of supermassive black holes, and probe fundamental assumptions about the background, including its polarization, anisotropy, Gaussianity, and stationarity, all of which will aid efforts to discriminate its origin. In tandem with new facilities like DSA-2000 and the SKA, fueling further observations by regional PTAs and the International Pulsar Timing Array, PTAs have extraordinary potential to be engines of nanohertz GW discovery.",
      "pdf_url": "https://arxiv.org/pdf/2511.08966.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.09103",
      "title": "Multiwavelength spectral and temporal analysis of VHE Blazar 1ES 1959+650: Tracing emission mechanisms across flux states",
      "authors": [
        "Peer Anjum",
        "Athar A. Dar",
        "Zahir Shah",
        "Bari Maqbool",
        "Ranjeev Misra"
      ],
      "abstract": "Multiwavelength spectral and temporal analysis of VHE Blazar 1ES 1959+650: Tracing emission mechanisms across flux states Peer Anjum, Athar A. Dar, Zahir Shah, Bari Maqbool, Ranjeev Misra High Energy Astrophysical Phenomena (astro-ph.HE) The high-synchrotron-peaked BL Lac object 1ES\\,1959+650 exhibited pronounced activity between MJD~60310 -- 60603, including a very high energy (VHE) detection reported by LHAASO. To investigate the underlying emission mechanisms, we performed a comprehensive temporal and spectral analysis using multiwavelength data from \\textit{Swift}-XRT/UVOT and \\textit{Fermi}-LAT, covering the optical/UV to GeV $\\gamma$-ray bands. The source shows strong energy-dependent variability, with the largest fractional variability in $\\gamma$-rays, followed by X-rays and UV/optical, consistent with leptonic emission scenarios. Based on the variability patterns, we identified distinct flux states (F1, F2, F3, F4, F5, VHE-FX1, and VHE-FX2). The X-ray spectra exhibit a clear ``harder-when-brighter'' trend across these states. We modeled the broadband spectral energy distributions (SEDs) using a one-zone model incorporating synchrotron and synchrotron self-Compton (SSC) emission, implemented in \\textsc{xspec} using $\\chi^{2}$ minimization. During the VHE detection, the corresponding X-ray/optical emission likely resembled the F2 state. Modeling the VHE SED using F1-state data led to an SSC overprediction of the VHE flux, whereas all other states were well described within the one-zone framework. Systematic trends in physical parameters are observed across flux states, including spectral hardening, increasing break energy, rising bulk Lorentz factor, and decreasing magnetic field with increasing flux. These results suggest that enhanced particle acceleration efficiency and stronger Doppler boosting drive the observed flaring activity, while the decrease in magnetic field indicates conversion of magnetic energy into particle kinetic energy, consistent with shock-driven scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2511.09103.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09129",
      "title": "Not all roads lead to merger: AGN disc properties influence the interactions of highly unequal mass black holes",
      "authors": [
        "Jordan W. N. Moncrieff",
        "Evgeni Grishin",
        "Alessandro A. Trani",
        "Fiona H. Panther",
        "Olga Pietrosanti"
      ],
      "abstract": "Not all roads lead to merger: AGN disc properties influence the interactions of highly unequal mass black holes Jordan W. N. Moncrieff, Evgeni Grishin, Alessandro A. Trani, Fiona H. Panther, Olga Pietrosanti Submitted to MNRAS, comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) As the number of gravitational-wave detections of black hole binaries grows, so does the diversity of proposed formation channels. The growing sample of systems with highly unequal masses, such as GW190814 with $m_1=23.2\\,M_{\\odot}$ and $m_2=2.59\\,M_{\\odot}$ -- corresponding to a mass ratio $q=0.112$ -- cannot be readily explained by isolated binary evolution and may originate through dynamical assembly in an active galactic nucleus (AGN). We investigate AGN discs capable of producing GW190814-like mergers using \\texttt{pAGN} to model self-consistent AGN torques, coupled with \\texttt{TSUNAMI}, a regularised N-body code including post-Newtonian terms up to 3.5 order. Suites of N-body simulations reveal possible outcomes of binary capture and merger, mean-motion resonance interactions, and other novel dynamical pathways. We develop analytical models linking the branching ratios of captures and mergers to local disc properties, applicable to black hole populations across all mass ratios. Capture probability is primarily governed by $\\mathscr{B}$, the ratio of libration time to resonance-width crossing, and is well-described by a log-Gaussian, $P(\\rm{capture}|\\mathscr{B}) = A \\exp[-(\\ln \\mathscr{B}-\\mu)^2/2\\sigma^2]$, with $A = 0.41^{+0.04}_{-0.04}$, $\\mu = 1.09^{+0.08}_{-0.07}$, $\\sigma = 1.05^{+0.08}_{-0.07}$. This fit, while an upper limit, is useful for simplified population synthesis. Finally, we explore the mass ratio AGN luminosity parameter space and find that GW190814 may be formed in a low luminosity AGN of $L_{\\rm AGN}\\approx 10^{43.5}\\ \\rm erg\\ s^{-1}$. A more systematic parameter space exploration and future population studies will further test our predictions.",
      "pdf_url": "https://arxiv.org/pdf/2511.09129.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.09406",
      "title": "Bright Cosmic-Ray Source as a Solution to Auger-TA Tensions",
      "authors": [
        "Alexander Korochkin",
        "Dmitri Semikoz",
        "Peter Tinyakov"
      ],
      "abstract": "Bright Cosmic-Ray Source as a Solution to Auger-TA Tensions Alexander Korochkin, Dmitri Semikoz, Peter Tinyakov High Energy Astrophysical Phenomena (astro-ph.HE) The ultra-high-energy cosmic ray (UHECR) spectra measured by the Pierre Auger Observatory (Auger) and the Telescope Array (TA) agree very well below $10^{19.5}$ eV but differ significantly at higher energies. We show that these differences can be explained by a single nearby source superimposed on a nearly isotropic background. Taking into account deflections in Galactic and extragalactic magnetic fields, such a source can account for the excess in the TA spectrum without producing excessive anisotropy. The required hard spectrum of the source and intermediate-mass composition are consistent with previous fits of the Auger-only spectrum and composition. This scenario offers several additional advantages: (i) the source produces a broad excess partially overlapping the TA hotspots, suggesting their possible explanation; (ii) without additional tuning, it reproduces the $\\sim90^\\circ$ shift in dipole direction observed between the Auger-only and combined Auger-TA analyses; and (iii) the best-fit position of the source lies near M82, the brightest nearby starburst galaxy, making it a plausible source of the UHECR.",
      "pdf_url": "https://arxiv.org/pdf/2511.09406.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09409",
      "title": "Compelling Evidence for a Harmonic in the Light Curve of the Supermassive Black Hole Binary Candidate PKS J1309+1154",
      "authors": [
        "A. C. S. Readhead",
        "M. F. Aller",
        "A. G. Sullivan",
        "R. D. Blandford",
        "P. Mróz",
        "P. V. De la Parra",
        "B. Molina",
        "E.R. Most",
        "M. L. Lister",
        "A. Synani",
        "H. Aller",
        "M. C. Begelman",
        "Y. Ding",
        "M. J. Graham",
        "F. Harrison",
        "T. Hovatta",
        "I. Liodakis",
        "W. Max-Moerbeck",
        "V. Pavlidou",
        "T. J. Pearson",
        "V. Ravi",
        "R. A. Reeves",
        "T. Surti",
        "K. Tassis",
        "S. E. Tremblay",
        "J. A. Zensus"
      ],
      "abstract": "Compelling Evidence for a Harmonic in the Light Curve of the Supermassive Black Hole Binary Candidate PKS J1309+1154 A. C. S. Readhead, M. F. Aller, A. G. Sullivan, R. D. Blandford, P. Mróz, P. V. De la Parra, B. Molina, E.R. Most, M. L. Lister, A. Synani, H. Aller, M. C. Begelman, Y. Ding, M. J. Graham, F. Harrison, T. Hovatta, I. Liodakis, W. Max-Moerbeck, V. Pavlidou, T. J. Pearson, V. Ravi, R. A. Reeves, T. Surti, K. Tassis, S. E. Tremblay, J. A. Zensus High Energy Astrophysical Phenomena (astro-ph.HE) We recently discovered a supermassive black hole binary (SMBHB) candidate, PKS J1309+1154, in the combined 46-yr University of Michigan Radio Astronomy Observatory (UMRAO) plus Owens Valley Radio Observatory (OVRO) blazar monitoring programs at 14.5/15 GHz. The light curve of PKS 1309+1154 exhibits a 17.9 year periodicity. We also reported a hint of a first harmonic with a 9 year periodicity in this object. Further analysis of the PKS J1309+1154 light curve provides compelling evidence that both the fundamental and the harmonic are real, confirming the existence of real periodicities in blazar light curves. This is the first case, to our knowledge, of watertight evidence for a fundamental and a harmonic periodicity in a blazar light curve. It makes PKS J1309+1154 a \\textit{strong\\/} supermassive black hole binary (SMBHB) candidate, and thus the third such candidate to be revealed through long-term radio monitoring, the other two being PKS J0805--0111 and PKS 2131--021, both discovered through the OVRO 40 m Telescope monitoring program. It is argued that hundreds of SMBHB candidates will be discovered by the Vera Rubin and Simons Observatories. Coherent searches for gravitational waves from a network of SMBHB candidates, starting immediately, are strongly motivated.",
      "pdf_url": "https://arxiv.org/pdf/2511.09409.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.09420",
      "title": "Ultra extreme high-frequency-peaked BL Lacs: a potential population of MeV synchrotron blazars?",
      "authors": [
        "A. Sciaccaluga",
        "F. Tavecchio",
        "T. Sbarrato",
        "G. Bonnoli"
      ],
      "abstract": "Ultra extreme high-frequency-peaked BL Lacs: a potential population of MeV synchrotron blazars? A. Sciaccaluga, F. Tavecchio, T. Sbarrato, G. Bonnoli 7 pages, 3 figures, submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the potential existence of a new population of BL Lacs, called ultra extreme high-energy-peaked BL Lacs (UEHBLs), whose synchrotron emission component peaks in the MeV band, extending the blazar sequence beyond its current limit. To model the spectral energy distribution of these new sources, we apply the hybrid shock-turbulence acceleration framework previously developed for extreme high-frequency-peaked BL Lacs. We present three representative realizations that produce synchrotron peaks between $0.2$ and $2$ MeV and evaluate their multiwavelenght signatures. Our results show that UEHBLs would be undetectable with current GeV (Fermi) and future TeV (CTA) facilities due to severe Klein-Nishina suppression of inverse Compton scattering, but are ideal targets for proposed MeV missions such as COSI, AMEGO-X, and e-ASTROGAM. We further identify a sample of hard X-ray sources from the Swift-BAT catalogs that exhibit the expected spectral properties of UEHBLs, potentially representing the first observational hints of this population. If confirmed, UEHBLs would provide unique insight into particle acceleration in relativistic jets, imposing strong constraints on the maximum achievable electron energies. We also discuss the expected polarization and variability signatures, including the possibility of synchrotron-driven thermal instabilities leading to MeV flares. These findings underscore the critical importance of the MeV band for discovering and characterizing the most extreme accelerators among blazars.",
      "pdf_url": "https://arxiv.org/pdf/2511.09420.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08668",
      "title": "Bridging scales: How much do supermassive black holes grow in the suppressed Bondi regime?",
      "authors": [
        "Kung-Yi Su",
        "Angelo Ricarte",
        "Priyamvada Natarajan",
        "Antonio J. Porras-Valverde",
        "Hyerin Cho",
        "Ramesh Narayan",
        "Claude-André Faucher-Giguère",
        "Philip F. Hopkins",
        "Ben S. Prather"
      ],
      "abstract": "Bridging scales: How much do supermassive black holes grow in the suppressed Bondi regime? Kung-Yi Su, Angelo Ricarte, Priyamvada Natarajan, Antonio J. Porras-Valverde, Hyerin Cho, Ramesh Narayan, Claude-André Faucher-Giguère, Philip F. Hopkins, Ben S. Prather Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The co-evolution of supermassive black holes (SMBHs) and their host galaxies remains one of the central open questions in cosmology, rooted in the coupling between accretion, feedback, and the multi-scale physics that links the event horizon to the circumgalactic medium. Here we bridge these scales by embedding a first-principles, GRMHD-informed prescription for black hole accretion and feedback--derived from multi-zone simulations that self-consistently connect inflows and outflows from the horizon to the Bondi radius--within cosmological magnetohydrodynamic zoom-in simulations of $\\sim10^{14}\\,M_\\odot$ halos. These GRMHD results predict a \"suppressed Bondi\" regime in which magnetic stresses and relativistic winds strongly reduce effective accretion rates in a spin-dependent manner. We find that black holes cannot grow efficiently by accretion until they exceed $\\sim10^{7}\\,M_\\odot$, regardless of the feedback strength. Beyond this threshold, systems bifurcate: low-spin ($\\eta\\!\\sim\\!0.02$) black holes continue to accrete without quenching star formation, while high-spin ($\\eta\\!\\gtrsim\\!0.3$) black holes quench effectively but become starved of further growth. Early, massive seeding partially alleviates this tension through merger-driven assembly, yet an additional cold or super-Eddington accretion mode appears essential to reproduce the observed SMBH population and the empirical black hole--galaxy scaling relations. Our results demonstrate that GRMHD-informed feedback models can account for the maintenance-mode behavior of low-luminosity AGN like M87*, but cannot by themselves explain the full buildup of SMBH mass across cosmic time. A unified, multi-regime framework is required to capture the evolving interplay between spin-dependent feedback, cold inflows, and mergers in driving co-evolution.",
      "pdf_url": "https://arxiv.org/pdf/2511.08668.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08676",
      "title": "Evidence for in-situ acceleration of relativistic particles in the wings of X-shaped radio galaxies",
      "authors": [
        "Dusmanta Patra",
        "Gopal-Krishna",
        "Ravi Joshi"
      ],
      "abstract": "Evidence for in-situ acceleration of relativistic particles in the wings of X-shaped radio galaxies Dusmanta Patra (SNBNCBS), Gopal-Krishna, Ravi Joshi (IIA) 7 Pages, 1 table, 1 Figure (Accepted for Publication in ApJ main Journal) Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We report evidence for in-situ acceleration/re-acceleration of relativistic particles in 11 radio wings out of a total of 68 wings sufficiently well-resolved for spectral mapping, which belong to our sample of 40 X-shaped radio galaxies (XRGs). This representative XRG sample includes 15 XRGs newly reported here, which we selected from the LOTSS-DR2 survey, following well-defined criteria. The evidence for in-situ particle acceleration comes from the observed cessation of steepening, or even flattening (i.e., gradient reversal) of the spectral index profile along the lobe into the associated wing, as determined here by combining the LoTSS-DR2 (144 MHz) and FIRST (1.4 GHz) maps. Interestingly, the afore-mentioned trends in spectral gradient, indicative of in-situ particle acceleration, are mostly found to set in near the region where the lobe plasma stream bends to connect to the wing. Such a spatial coincidence with bending of radio lobe/tail has been noticed in recent years for just a couple of radio galaxies. The large increase in such examples, as reported here, is expected to give a fillip to observational, theoretical and numerical simulation follow-up investigations of this important clue about the occurrence of in-situ particle acceleration in lobes of radio galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2511.08676.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08824",
      "title": "An axisymmetric shock breakout indicated by prompt polarized emission from the type II supernova 2024ggi",
      "authors": [
        "Yi Yang , Xudong Wen , Lifan Wang , Dietrich Baade , J. Craig Wheeler , Alexei V. Filippenko , Avishay Gal-Yam , Justyn Maund , Steve Schulze , Xiaofeng Wang , Chris Ashall , Mattia Bulla , Aleksandar Cikota , He Gao , Peter Hoeflich , Gaici Li , Divya Mishra , Ferdinando Patat , Kishore C. Patra , Sergiy S. Vasylyev , Shengyu Yan Tsinghua University, Beijing Normal University, Texas A&amp;M University, Mitchell Institute, ESO, UT Austin, UC Berkeley, Hagler Institute/TAMU, Weizmann Institute of Science, Royal Holloway University of London, CIERA/Northwestern, Virginia Tech, University of Hawaii, University of Ferrara, INFN Sezione di Ferrara, INAF, Gemini Observatory/NOIRLab, Institute for Frontier in Astronomy and Astrophysics/BNU, Florida State University, UC Santa Cruz)"
      ],
      "abstract": "An axisymmetric shock breakout indicated by prompt polarized emission from the type II supernova 2024ggi Yi Yang (1), Xudong Wen (1 and 2), Lifan Wang (3 and 4), Dietrich Baade (5), J. Craig Wheeler (6), Alexei V. Filippenko (7 and 8), Avishay Gal-Yam (9), Justyn Maund (10), Steve Schulze (11), Xiaofeng Wang (1), Chris Ashall (12 and 13), Mattia Bulla (14 and 15 and 16), Aleksandar Cikota (17), He Gao (2 and 18), Peter Hoeflich (19), Gaici Li (1), Divya Mishra (3 and 4), Ferdinando Patat (5), Kishore C. Patra (7 and 20), Sergiy S. Vasylyev (7), Shengyu Yan (1) ((1) Tsinghua University, (2) Beijing Normal University, (3) Texas A&amp;M University, (4) Mitchell Institute, (5) ESO, (6) UT Austin, (7) UC Berkeley, (8) Hagler Institute/TAMU, (9) Weizmann Institute of Science, (10) Royal Holloway University of London, (11) CIERA/Northwestern, (12) Virginia Tech, (13) University of Hawaii, (14) University of Ferrara, (15) INFN Sezione di Ferrara, (16) INAF, (17) Gemini Observatory/NOIRLab, (18) Institute for Frontier in Astronomy and Astrophysics/BNU, (19) Florida State University, (20) UC Santa Cruz) Science Advances: this https URL ESO PR: this https URL Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) The death of massive stars is triggered by an infall-induced bounce shock that disrupts the star. How such a shock is launched and propagates through the star is a decade-long puzzle. Some models assume that the shock can be reenergized by absorbing neutrinos, leading to highly aspherical explosions. Other models involve jet-powered shocks that lead to bipolar explosions reflected in the geometry of the shock-breakout emission. We report measurement of the geometry of the shock breakout through unprecedentedly early spectropolarimetry of the nearby type II supernova 2024ggi starting ~1.2 days after the explosion. The measurement indicates a well-defined symmetry axis of the shock breakout, which is also shared by the hydrogen-rich envelope that emerged after the circumstellar matter was engulfed by the ejecta, revealing a persisting and prominent symmetry axis throughout the explosion. These findings suggest that the physical mechanism driving the explosion of massive stars manifests a well-defined axial symmetry and acts on large scales.",
      "pdf_url": "https://arxiv.org/pdf/2511.08824.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09304",
      "title": "Variability of optical spectral index to support a central sub-parsec binary black hole system in quasar SDSS J001224-102226.51",
      "authors": [
        "Zhang XueGuang"
      ],
      "abstract": "Variability of optical spectral index to support a central sub-parsec binary black hole system in quasar SDSS J001224-102226.51 Zhang XueGuang (GXU) 5 pages, 4 figures, accepted to be published in A&A Letters Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) In this manuscript, variations in optical spectral index $\\alpha_{5100}$ are applied for detecting central sub-parsec binary black hole systems (sub-pc BBHs) in broad line active galactic nuclei (BLAGN), due to apparent effects of obscurations on central two BH accreting systems. For sub-pc BBHs in BLAGN, two main characteristics on $\\alpha_{5100}$ can be expected. First, if a BLAGN harbours a central sub-pc BBH, the expected unique variability in $\\alpha_{5100}$ should lead the BLAGN to be an outlier in the space of $\\alpha_{5100}$ versus continuum luminosity $L_{5100}$ determined from normal BLAGN. Second, BLAGN harbouring central sub-pc BBHs could lead to periodic variations in $\\alpha_{5100}$. Here, after checking the two-epoch SDSS spectra of quasar SDSS J0012-1022 reported as a candidate of sub-pc BBH by large velocity offset between narrow and broad Balmer emission lines, unique variability of $\\alpha_{5100}$ can be explained by effects of obscurations related to an assumed central sub-pc BBH. In the near future, to detect and report periodic variations of $\\alpha_{5100}$ for sub-pc BBHs in BLAGN should be our main objective. The results provide a new method by applications of properties of optical continuum emissions for detecting sub-pc BBHs in BLAGN.",
      "pdf_url": "https://arxiv.org/pdf/2511.09304.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09419",
      "title": "POLAR-2 - Latest Developments of the Next Generation GRB Polarimeter",
      "authors": [
        "Johannes Hulsman",
        "Philipp Azzarello",
        "Joerg Bayer",
        "Franck Cadoux",
        "Mariachiara Celato",
        "Nicolas De Angelis",
        "Yannick Favre",
        "Aaron Feder",
        "Jochen Greiner",
        "Alejandro Guzman",
        "Coralie Husi",
        "Vishal Kumar",
        "Hancheng Li",
        "Mobin Mobaseri",
        "Gabriel Pelleriti",
        "Agnieszka Pollo",
        "Nicolas Produit",
        "Dominik Rybka",
        "Andrea Santangelo",
        "Jianchao Sun",
        "Chris Tenzer",
        "Xin Wu",
        "Shuang-Nan Zhang"
      ],
      "abstract": "POLAR-2 - Latest Developments of the Next Generation GRB Polarimeter Johannes Hulsman, Philipp Azzarello, Joerg Bayer, Franck Cadoux, Mariachiara Celato, Nicolas De Angelis, Yannick Favre, Aaron Feder, Jochen Greiner, Alejandro Guzman, Coralie Husi, Vishal Kumar, Hancheng Li, Mobin Mobaseri, Gabriel Pelleriti, Agnieszka Pollo, Nicolas Produit, Dominik Rybka, Andrea Santangelo, Jianchao Sun, Chris Tenzer, Xin Wu, Shuang-Nan Zhang Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) Gamma-Ray Bursts (GRBs) are among the most energetic events in the Universe. Despite over 50 years of research and measurements their prompt emission remains poorly understood, with key questions surrounding the structure of relativistic jets, magnetic field configurations, and dominant radiation mechanisms. Polarization measurements are critical in resolving these uncertainties. The POLAR mission, operational in 2016-2017 on Tiangong-2, provided the most statistically significant GRB polarization data. Its results indicated low time-averaged polarization with hints of temporal evolution. However, POLAR's limited sensitivity, small effective area, and restricted energy range prevented more detailed time- and energy-resolved analyses in addition to a larger sample of GRB polarization measurements. POLAR-2 is designed to address these limitations by offering a fourfold increase in effective area (at least) and an extended energy range of 30-800 keV by utilizing Silicon Photomultipliers (SiPMs) and an updated module design, enabling the differentiation of competing GRB emission models. The instrument comprises of 100 polarimeter modules (each with 64 plastic scintillator bars), wherein the polarization angle is extracted through Compton Scattering of the gammas. The polarimeter module design was validated during an ESRF beam test campaign in 2023. The instrument was developed by a joint effort of Switzerland, China, Poland and Germany and is planned for launch in 2027. Currently, POLAR-2 is in its production phase with the first module targets being produced. We will provide an overview of the current status of the development.",
      "pdf_url": "https://arxiv.org/pdf/2511.09419.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.17569",
      "title": "Three-dimensional equation of state extension of quark matter in Fermi-liquid theory",
      "authors": [
        "Zhenyu Zhu",
        "Shuai Zha",
        "Sophia Han"
      ],
      "abstract": "Three-dimensional equation of state extension of quark matter in Fermi-liquid theory Zhenyu Zhu, Shuai Zha, Sophia Han High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) The cold, dense matter equation of state (EoS) determines crucial global properties of neutron stars (NSs), including the mass, radius and tidal deformability. However, a one-dimensional (1D), cold, and $\\beta$-equilibrated EoS is insufficient to fully describe the interactions or capture the dynamical processes of dense matter as realized in binary neutron star (BNS) mergers or core-collapse supernovae (CCSNe), where thermal and out-of-equilibrium effects play important roles. We develop a method to self-consistently extend a 1D cold and $\\beta$-equilibrated EoS of quark matter to a full three-dimensional (3D) version, accounting for density, temperature, and electron fraction dependencies, within the framework of Fermi-liquid theory (FLT), incorporating both thermal and out-of-equilibrium contributions. We compare our FLT-extended EoS with the original bag model and find that our approach successfully reproduces the contributions of thermal and compositional dependencies of the 3D EoS. Furthermore, we construct a 3D EoS with a first-order phase transition (PT) by matching our 3D FLT-extended quark matter EoS to the hadronic DD2 EoS under Maxwell construction, and test it through the GRHD simulations of the TOV-star and CCSN explosion. Both simulations produce consistent results with previous studies, demonstrating the effectiveness and robustness of our 3D EoS construction with PT.",
      "pdf_url": "https://arxiv.org/pdf/2506.17569.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.19645",
      "title": "On the optical emission in the mini-outburst of the black hole X-ray binary MAXI J1348-630",
      "authors": [
        "Xiao Fan",
        "Bei You",
        "Dizhan Du",
        "Han He",
        "Shuangkang Yang"
      ],
      "abstract": "On the optical emission in the mini-outburst of the black hole X-ray binary MAXI J1348-630 Xiao Fan, Bei You, Dizhan Du, Han He, Shuangkang Yang Submitted to ApJ, 13pages, 6 figures, 3 tables High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the optical emission of the black hole X-ray binary MAXI J1348-630 during its 2019 minioutburst. Using optical data from the Las Cumbres Observatory Global Telescope and X-ray data from Insight-HXMT, we performed time delay analysis, optical-X-ray correlation analysis, and spectral energy distribution (SED) fitting. Our key findings are as follows: (1) The X-ray Comptonization flux lags behind the optical emission by about 8.5 days, a delay naturally explained by the disk instability model (DIM). (2) The optical and X-ray fluxes show a power-law correlation with a slope about 0.4, which lies between the predicted values for viscous heating and X-ray reprocessing, consistent with the DIM framework. (3) SED fitting with the irradiated disk model successfully reproduces the quasi-simultaneous optical and X-ray data, and the contribution of the jet is negligible. Our results indicate that the optical emission during the mini-outburst originates from the disk, rather than the jet or hot accretion flow, and highlight the critical role of the DIM in understanding the mini-outburst of X-ray binaries.",
      "pdf_url": "https://arxiv.org/pdf/2508.19645.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25902",
      "title": "A Photometric Classifier for Tidal Disruption Events in Rubin LSST",
      "authors": [
        "Kunal Bhardwaj",
        "Asen Christov",
        "Sergey Karpov"
      ],
      "abstract": "A Photometric Classifier for Tidal Disruption Events in Rubin LSST Kunal Bhardwaj, Asen Christov, Sergey Karpov Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) Tidal Disruption Events (TDEs) are astrophysical phenomena arising when stars are disrupted by supermassive black holes. The Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST), with its unprecedented depth and cadence, will detect thousands of TDEs, motivating the need for robust photometric classifiers capable of efficiently distinguishing these events from other extragalactic transients. We aim to develop and validate a machine learning pipeline for photometric TDE identification in LSST-scale datasets. Our classifier is designed to provide high precision and recall, enabling the construction of reliable TDE catalogs for multi-messenger follow-up and statistical studies. Using the second Extended LSST Astronomical Time Series Classification Challenge (ELAsTiCC2) dataset, we fit Gaussian Processes (GP) to light curves for feature extraction (e.g., color, rise/fade times, GP length scales). We then train and tune boosted decision-tree models (XGBoost) with a custom scoring function emphasizing high-precision recovery of TDEs. Our pipeline is tested on a diverse simulation of transient and variable events, including supernovae, active galactic nuclei, and superluminous supernovae. We achieve high precision (up to 95%) while maintaining competitive recall (about 72%) for TDEs, with minimal contamination from non-TDE classes. Key predictive features include post-peak colors and GP hyperparameters, reflecting characteristic timescales and spectral behaviors of TDEs. Our photometric classifier provides a practical and scalable approach to identifying TDEs in forthcoming LSST data. By capturing essential color and temporal properties through GP-based feature extraction, it enables efficient construction of clean TDE candidate samples.",
      "pdf_url": "https://arxiv.org/pdf/2509.25902.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.07957",
      "title": "In-Orbit GRB Identification Using LLM-based model for the CXPD CubeSat",
      "authors": [
        "Cunshi Wang",
        "Zuke Feng",
        "Difan Yi",
        "Yuyang Li",
        "Lirong Xie",
        "Huanbo Feng",
        "Yi Liu",
        "Qian Liu",
        "Yang Huang",
        "Hongbang Liu",
        "Xinyu Qi",
        "Yangheng Zheng",
        "Ali Luo",
        "Guirong Xue",
        "Jifeng Liu"
      ],
      "abstract": "In-Orbit GRB Identification Using LLM-based model for the CXPD CubeSat Cunshi Wang, Zuke Feng, Difan Yi, Yuyang Li, Lirong Xie, Huanbo Feng, Yi Liu, Qian Liu, Yang Huang, Hongbang Liu, Xinyu Qi, Yangheng Zheng, Ali Luo, Guirong Xue, Jifeng Liu Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) To validate key technologies for wide field-of-view (FOV) X-ray polarization measurements, the Cosmic X-ray Polarization Detector (CXPD) CubeSat series has been developed as a prototype platform for the Low-Energy Xray Polarization Detector (LPD) onboard the POLAR-2 mission. The wide-FOV design significantly increases the complexity of the background environment, posing notable challenges for real-time gamma-ray burst (GRB) identification. In this work, we propose an in-orbit GRB identification method based on machine learning, using simulated spectral data as input. A training dataset was constructed using a Geant4-based simulator, incorporating in-orbit background and GRB events modeled within the 2-10 keV energy range. To meet the computational constraints of onboard processing, we employ a multimodal large language model (MLLM), which is fine-tuned using low-rank adaptation (LoRA) based on miniCPM-V2.6 and quantized to 4-bit precision. The model achieves perfect classification accuracy on validation data and demonstrates strong regression performance in estimating GRB spectral indices, with an RMSE of 0.118. Furthermore, we validate the feasibility of onboard deployment through a simulated satellite data processing pipeline, highlighting the potential of our approach to enable future real-time GRB detection and spectral analysis in orbit.",
      "pdf_url": "https://arxiv.org/pdf/2511.07957.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.07996",
      "title": "Towards direct imaging and orbital parameter estimation of supermassive black hole binaries with spaceborne VLBI",
      "authors": [
        "B. Hudson",
        "L. I. Gurvits",
        "E. Mooij",
        "A. Ricarte",
        "D. Palumbo"
      ],
      "abstract": "Towards direct imaging and orbital parameter estimation of supermassive black hole binaries with spaceborne VLBI B. Hudson, L. I. Gurvits, E. Mooij, A. Ricarte, D. Palumbo Submitted to Astronomy & Astrophysics. 20 pages, 21 figures Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) Direct electromagnetic observation of the orbital motion of a sub-parsec, supermassive black hole binary (SMBHB) would provide the first conclusive proof of such systems existing. Widely considered to be the sources of gravitational waves, binaries are expected to form as a natural consequence of galactic mergers and determining the processes that drive their evolution is essential for understanding cosmological evolution. In this work, we evaluate the prospects of using ground and spaceborne Very Long Baseline Interferometry (VLBI) to observe supermassive black hole binaries and estimate their orbital parameters. The Black Hole Explorer (BHEX) is considered as the primary case study. Achieving unprecedented resolution, BHEX will provide access to a new volume of binary parameter space, potentially enabling the first, confident detection of an SMBHB. A binary toy model using a post-Newtonian orbit propagation is developed and simulated observations by BHEX and a ground array of telescopes are performed. An orbit fitting approach using Bayesian dynamic nested sampling is presented and its efficacy is demonstrated on the simulated observational data for a set of example binary systems. It is found that for BHEX, binary detection requires a total flux density of 0.04 Jy with a minimum separation of ~2 $\\mu$as and an observable mass ratio dependent on the total flux. With three annual observations, BHEX could constrain semi-major axis and eccentricity of binaries with orbital periods $\\leq$10 years to within 13% of the true values. A curved trajectory could confidently be detected in binaries with period $\\leq$23 years. Proposals for how candidate sources could be identified in time for the BHEX mission are also provided. Finally, we constrain the requirements of a future spaceborne VLBI system, capable of performing a statistically significant survey of supermassive black hole binaries.",
      "pdf_url": "https://arxiv.org/pdf/2511.07996.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.08671",
      "title": "JWST/NIRSpec Reveals a Small Population of Dominant Dust-Obscured Ionizing Sources in Galaxies at 1 < z < 3",
      "authors": [
        "Si-Rui Ge",
        "Nikko J. Cleri",
        "Joel Leja",
        "Antonello Calabro",
        "Vital Fernandez"
      ],
      "abstract": "JWST/NIRSpec Reveals a Small Population of Dominant Dust-Obscured Ionizing Sources in Galaxies at 1 < z < 3 Si-Rui Ge, Nikko J. Cleri, Joel Leja, Antonello Calabro, Vital Fernandez 9 pages + appendix and references, 4 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Rest-frame optical emission line diagnostics are often used to help classify ionizing sources within galaxies. However, rest-frame optical tracers can miss sources with high dust attenuation, leading to misclassification of the dominant ionizing source. Longer wavelength tracers, such as those in the near-infrared, carry the power to diagnose ionizing sources while being more robust than optical tracers to the presence of dust. The diagnostics used in this work employ the ratios of bright near-infrared emission lines [S III] 9530, [Fe II] 12566 and [Fe II] 16443 to Paschen lines in publicly-available JWST/NIRSpec MSA medium-resolution spectroscopy of 55 galaxies at z < 3. We compare the rest-frame near-infrared and rest-frame optical diagnostics and find that ~90% of our sample have consistent classifications across wavelengths (49/55), while the remaining sources can be explained through ionizing radiation obscured by dust and/or elevated N/Fe abundances. We identify three objects classified as star-forming in the rest frame optical and as active galactic nuclei (AGN) in the rest-frame near-infrared, which we interpret as obscured AGN. We also identify three objects which are classified as AGN in the rest-frame optical and star forming in the rest-frame near-infrared. We interpret two of these objects as AGN with obscured star formation and the other with elevated N/Fe. We discuss how future spatially-resolved and/or mid-infrared spectroscopy can test the relative contributions of AGN and stars to the ionizing photon budgets of these disagreeing sources.",
      "pdf_url": "https://arxiv.org/pdf/2511.08671.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08672",
      "title": "An almost NIRCam-dark dusty star-forming galaxy at z=6.63",
      "authors": [
        "Longji Bing",
        "Seb Oliver",
        "Mengyuan Xiao",
        "Guilaine Lagache",
        "Sylvia Adscheid",
        "Daizhong Liu",
        "Benjamin Magnelli",
        "Roberto Neri",
        "Miroslava Dessauges-Zavadsky",
        "Anton M. Koekemoer",
        "Maximilien Franco",
        "Shuowen Jin",
        "Olivia R. Cooper",
        "Andreas L. Faisst",
        "Catilin M. Casey",
        "Jeyhan S. Kartaltepe",
        "Hollis Akins",
        "Alexandre Beelen",
        "David Elbaz",
        "Steven Gillman",
        "Santosh Harish",
        "Arianna S. Long",
        "Henry Joy McCracken",
        "Pascal Oesch",
        "Louise Paquereau",
        "Nicolas Ponthieu",
        "Jason Rhodes",
        "Brant Robertson",
        "David B. Sanders",
        "Marko Shuntov",
        "Stephen Wilkins"
      ],
      "abstract": "An almost NIRCam-dark dusty star-forming galaxy at z=6.63 Longji Bing, Seb Oliver, Mengyuan Xiao, Guilaine Lagache, Sylvia Adscheid, Daizhong Liu, Benjamin Magnelli, Roberto Neri, Miroslava Dessauges-Zavadsky, Anton M. Koekemoer, Maximilien Franco, Shuowen Jin, Olivia R. Cooper, Andreas L. Faisst, Catilin M. Casey, Jeyhan S. Kartaltepe, Hollis Akins, Alexandre Beelen, David Elbaz, Steven Gillman, Santosh Harish, Arianna S. Long, Henry Joy McCracken, Pascal Oesch, Louise Paquereau, Nicolas Ponthieu, Jason Rhodes, Brant Robertson, David B. Sanders, Marko Shuntov, Stephen Wilkins Astrophysics of Galaxies (astro-ph.GA) We present AC-2168, an almost NIRCam-dark, millimetre-bright galaxy in the COSMOS field. The source was identified blindly in ALMA Band-4 continuum data and remains undetected in the COSMOS-Web DR1 NIRCam catalogue. We spectroscopically confirm a redshift of $z_{\\rm spec}=6.631$ from [CII] 158 $\\mu$m and four tentatively detected CO lines in NOEMA and ALMA data. SED fitting to near-IR to millimetre photometry yields $\\rm L_{IR}=1.6\\times10^{12}\\,L_\\odot$, an SFR of $\\rm 244\\,M_\\odot/yr$, heavy dust attenuation $\\rm A_V=5.4$ mag, and a stellar mass $\\rm M_\\star=3.7\\times10^{10}\\,M_\\odot$. From the millimetre continuum and [CII] emission, we infer a warm ISM with $\\rm T_{\\rm dust}=60K$, $\\rm M_{dust}=3.0\\times10^{8}\\,M_\\odot$ and $\\rm M_{gas}=4.1\\times10^{10}\\,M_\\odot$. AC-2168 has a gas fraction ($f_{\\rm gas}=M_{\\rm gas}/(M_\\star+M_{\\rm gas})$) of $\\sim52\\%$, a short depletion time of $\\rm \\sim170Myr$, a compact ($\\rm \\sim1kpc$) dust-continuum size, and an SFR consistent with the star-forming main sequence at its mass. These properties match expectations for progenitors of massive quiescent galaxies at the peak of their assembly, as implied by NIRSpec-based SFHs of $z\\sim4-5$ systems. Using the blind detection, we estimate a space density of $\\rm 7.8^{+18.0}_{-6.5}\\times10^{-6}\\,cMpc^{-3}$ for AC-2168-like NIRCam-dark galaxies at $z\\sim6-7$, $\\sim42\\%$ of the abundance of massive quiescent galaxies at $z\\sim4-5$. No overdensity of Ly$\\alpha$ emitters or Lyman-break galaxies is found nearby, suggesting AC-2168 does not lie in a prominent protocluster and highlighting the importance of unbiased blind surveys for this population.",
      "pdf_url": "https://arxiv.org/pdf/2511.08672.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08674",
      "title": "Where Giants Dwell: Probing the Environments of Early Massive Quiescent Galaxies",
      "authors": [
        "Gabriella De Lucia",
        "Lizhi Xie",
        "Michaela Hirschmann",
        "Fabio Fontanot"
      ],
      "abstract": "Where Giants Dwell: Probing the Environments of Early Massive Quiescent Galaxies Gabriella De Lucia, Lizhi Xie, Michaela Hirschmann, Fabio Fontanot 11 pages, 10 figures, submitted to A&A Astrophysics of Galaxies (astro-ph.GA) We investigate the environments of massive quiescent galaxies at 3 < z < 5 using the GAlaxy Evolution and Assembly (GAEA) theoretical model. We select galaxies with stellar mass ~10^10.8 Msun and specific star formation rate below 0.3x t_Hubble, yielding in a sample of about 5,000 galaxies within a simulated volume of ~685 Mpc. These galaxies have formation times that cover well the range inferred from recent observational data, including a few rare objects with very short formation time-scales and early formation epochs. Model high-z quiescent galaxies are alpha-enhanced and exhibit a wide range of stellar metallicity, in broad agreement with current observational estimates. Massive high-z quiescent galaxies in our model occupy a wide range of environments, from void-like regions to dense knots at the intersections of filaments. Quiescent galaxies in underdense regions typically reside in halos that collapsed early and grew rapidly at high redshift, though this trend becomes difficult to identify observationally due to large intrinsic scatter in star formation histories. The descendants of high-z massive quiescent galaxies display a broad distribution in mass and environment by z=0, reflecting the stochastic nature of mergers. About one-third of these systems remain permanently quenched, while most rejuvenation events are merger-driven and more common in overdense regions. Our results highlight the diversity of early quiescent galaxies and caution against assuming that all such systems trace the progenitors of present day most massive clusters.",
      "pdf_url": "https://arxiv.org/pdf/2511.08674.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08678",
      "title": "Highly Efficient Identification of Extreme Emission Line Galaxies in the Local Universe: >8000 New Green Pea Candidates at 0.12 < z < 0.36",
      "authors": [
        "Heather Samonski",
        "Samir Salim",
        "John Salzer"
      ],
      "abstract": "Highly Efficient Identification of Extreme Emission Line Galaxies in the Local Universe: >8000 New Green Pea Candidates at 0.12 < z < 0.36 Heather Samonski, Samir Salim, John Salzer Accepted in ApJ Supplement Series. Catalog files will be available from the journal site and are also available upon request Astrophysics of Galaxies (astro-ph.GA) The currently known compact extreme emission-line galaxies (the \"Green Peas\", GPs) in SDSS are rare and were mostly found among serendipitous spectroscopic targets, thus leaving open the possibility that a substantial population of GPs is missed. A significantly larger number of identified GPs in the Local Universe might provide a better characterization of their high-redshift analogs and Lyman continuum escape. In this paper, we confront the challenges of robustly identifying GPs without spectroscopic information, a needed approach considering the incompleteness of spectroscopic surveys for compact sources. The principal difficulty stems from a significant contamination of photometric candidates by stars and quasars of similar color. To solve this, we introduce an SED matching method, which separates candidate GPs from contaminants on the basis of SDSS and WISE photometry of spectroscopically confirmed stars, quasars and galaxies. The method has an effectiveness of 85%, and a contamination rate of ~10%. With it we identify ~9600 GP candidates expected to lie in the 0.12 < z < 0.36 range - a tenfold increase over what would be selected using SDSS DR18 spectra. Some of the new GPs are as bright as r~19, and 1200 are predicted to have [OIII]5007 equivalent widths in excess of 500 A. The new population contains many \"Extended Peas\", which are absent among known GPs and possibly represent merging systems. We provide catalogs containing 8313 newly identified GP candidates, as well as 917 GPs confirmed using SDSS spectroscopy and 521 GPs with spectroscopic redshifts from LAMOST and other sources.",
      "pdf_url": "https://arxiv.org/pdf/2511.08678.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08683",
      "title": "Bridging scales: Modeling suppressed Bondi accretion on black holes and its impact on galaxy growth",
      "authors": [
        "Antonio J. Porras-Valverde",
        "Priyamvada Natarajan",
        "Angelo Ricarte",
        "Kung-Yi Su",
        "Hyerin Cho",
        "Ramesh Narayan",
        "Ben S. Prather"
      ],
      "abstract": "Bridging scales: Modeling suppressed Bondi accretion on black holes and its impact on galaxy growth Antonio J. Porras-Valverde, Priyamvada Natarajan, Angelo Ricarte, Kung-Yi Su, Hyerin Cho, Ramesh Narayan, Ben S. Prather Astrophysics of Galaxies (astro-ph.GA) The accretion and feedback processes governing supermassive black hole (SMBH) growth span an enormous range of spatial scales, from the Event Horizon to the circumgalactic medium. Recent general relativistic magnetohydrodynamic (GRMHD) simulations demonstrate that strong magnetic fields can substantially suppress Bondi accretion by creating magnetically arrested disk (MAD) states, reducing inflow rates by up to two orders of magnitude relative to classical Bondi predictions. We incorporate this magnetic suppression prescription from Cho et al. (2023, 2024) into the Dark Sage semi-analytic model (SAM), which tracks SMBH and galaxy co-evolution within hierarchical merger trees derived from the IllustrisTNG cosmological simulation. Implementing the suppression across different Eddington-ratio regimes, we explore its impact on black hole mass functions (BHMFs), stellar mass functions (SMFs), and AGN luminosity functions. Restricting suppression to sub-Eddington accretors ($f_{\\rm Edd} < 3 \\times 10^{-3}$) and rescaling AGN feedback efficiencies gives simultaneous agreement with observed $z = 0$ SMFs and BHMFs, as illustrated by Case D in this work. At $z > 6$, super-Eddington growth episodes dominate in the SAM, reproducing JWST-inferred luminous AGN number densities. Our results highlight the critical sensitivity of galaxy assembly to the coupling between small-scale accretion physics and large-scale feedback regulation. Magnetic suppression of hot gas accretion can reconcile low-redshift constraints while preserving the rapid black hole growth required at early cosmic epochs, thereby providing a physically motivated bridge between horizon-scale GRMHD simulations and cosmological galaxy-formation models.",
      "pdf_url": "https://arxiv.org/pdf/2511.08683.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08706",
      "title": "Identification of Candidate Halos Hosting Massive Black Hole Seeds in the \\textit{Renaissance} Simulations with Support Vector Machines",
      "authors": [
        "Brandon Pries",
        "John H. Wise"
      ],
      "abstract": "Identification of Candidate Halos Hosting Massive Black Hole Seeds in the \\textit{Renaissance} Simulations with Support Vector Machines Brandon Pries, John H. Wise 24 pages, 8 figures, 8 tables. Submitted to ApJ. Comments welcome! Astrophysics of Galaxies (astro-ph.GA) The nature of the origins of supermassive black holes remains uncertain. Multiple possible seeding pathways have been proposed across a variety of mass scales, each with their own strengths and weaknesses. One such channel is a direct collapse black hole (DCBH), thought to form from the deaths of supermassive stars in pristine atomic cooling halos in the early universe. In this work, we investigate the ability to identify halos likely to form a DCBH based on their properties using a support vector machine (SVM). We implement multiple methods to improve the accuracy of the model, including selecting subsets of critical features and optimizing SVM hyperparameters. We find that our best model requires quantities relevant to star formation, such as the metallicity, incident flux of Lyman-Werner radiation, and halo stellar mass. The SVMs produced from this work can serve as probabilistic and holistic seeding prescriptions for DCBHs in cosmological simulations.",
      "pdf_url": "https://arxiv.org/pdf/2511.08706.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08790",
      "title": "Probing the Molecular Hearts of Extreme Bipolar Planetary Nebulae with ALMA",
      "authors": [
        "Paula Moraga Baez",
        "Joel H. Kastner",
        "Jesse Bublitz",
        "Javier Alcolea",
        "Miguel Santander-Garcia",
        "Thierry Forveille",
        "Pierre Hily-Blant",
        "Bruce Balick",
        "Rodolfo Montez Jr"
      ],
      "abstract": "Probing the Molecular Hearts of Extreme Bipolar Planetary Nebulae with ALMA Paula Moraga Baez, Joel H. Kastner, Jesse Bublitz, Javier Alcolea, Miguel Santander-Garcia, Thierry Forveille, Pierre Hily-Blant, Bruce Balick, Rodolfo Montez Jr 55 pages, 27 figures; accepted by The Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present results from a program of Atacama Large Millimeter Array (ALMA) 1.3 mm (Band 6) molecular line mapping of a sample of nearby, bipolar/pinched-waist, molecule-rich PNe (NGC 6302, Hubble 5, NGC 2440, NGC 6445, NGC 2899, and NGC 2818). Maps of $^{12}$CO(2$-$1) and $^{13}$CO(2$-$1) emission as well as emission lines of HCN, HNC, HCO$^+$, CN, and CS $-$ many of these detected in these PNe for the first time $-$ reveal the molecular mass distributions, compositions, and velocity fields of the equatorial and, in some cases, polar regions of the sample PNe. In each case, the bulk of the molecular gas traces an expanding equatorial torus, with torus expansion velocities ranging from $\\sim$15 to $\\sim$50 km s$^{-1}$ and molecular masses from $\\sim$0.002 to $\\sim$0.1 $M_\\odot$. The inferred molecular torus dynamical ages, which span the range $\\sim$500 yr (Hb 5) to $\\sim$11000 yr (NGC 2818), provide support for a model wherein molecular torus ejection precedes bipolar lobe formation. Collectively, these ALMA survey results provide insight into the rapid structural evolution as well as the zones of irradiated molecular gas within bipolar PNe that are descended from relatively massive progenitors, likely residing in interacting binary systems, over $\\sim$10 kyr of the post-AGB evolution of such systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.08790.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08800",
      "title": "Model of super-Alfvénic MHD turbulence and structure functions of polarization",
      "authors": [
        "A. Lazarian",
        "D. Pogosyan",
        "Y. Hu"
      ],
      "abstract": "Model of super-Alfvénic MHD turbulence and structure functions of polarization A. Lazarian, D. Pogosyan, Y. Hu 24 pages, 10 figures, submitted to the Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) MHD turbulence driven at velocities higher than the Alfvén velocity, i.e., super-Alfvénic turbulence, is widely spread in astrophysical environments, including galaxy clusters and molecular clouds. For statistical studies of such turbulence, we explore the utility of the polarization angle structure functions $D^\\phi(R)= \\left\\langle\\sin^2(\\phi_1-\\phi_2) \\right\\rangle$, where $\\phi$ denotes the polarization angle measured at points separated by a projected distance $\\mathbf{R}$ on the plane of the sky. Lazarian, Yuen and Pogosyan, 2022, showed that in the case of super-Alfvénic turbulence, the spectral slope of $D^\\phi(\\mathbf{R})$ differs from that of the underlying magnetic fluctuations, limiting its applicability for field strength estimation with known techniques. In this work, we provide an analytical framework that explains the modification of the $D^\\phi(R)$ spectral slope in super-Alfvénic turbulence and validate our predictions with numerical simulations. We demonstrate that for super-Alfvénic turbulence, the structure function $D^\\phi (R)$ gets shallower with the increase of $M_A$. Our study makes $D^\\phi (R)$ a valuable diagnostic of super-Alfvénic turbulence and opens a way to obtain $M_A$ from observations. We also explore numerically the structure function of the polarization degree and the spectrum of the polarization directions, the latter being the Fourier transform of $D^\\phi$. We discuss the implications of our findings for turbulence and magnetic field studies in the intracluster and interstellar media.",
      "pdf_url": "https://arxiv.org/pdf/2511.08800.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08814",
      "title": "Kinetic Theory and the Mechanics of Isothermal Gas Spheres: Derivation of the Classical Emden--Chandrasekhar Equation via the Vlasov--Poisson Formalism",
      "authors": [
        "Steven D Miller"
      ],
      "abstract": "Kinetic Theory and the Mechanics of Isothermal Gas Spheres: Derivation of the Classical Emden--Chandrasekhar Equation via the Vlasov--Poisson Formalism Steven D Miller Astrophysics of Galaxies (astro-ph.GA); Mathematical Physics (math-ph) We present a derivation of the mechanics of isothermal gas spheres directly from the Vlasov--Poisson equation. By extremising the Boltzmann entropy, we obtain the Maxwell--Boltzmann distribution for a self-gravitating isothermal Newtonian gas, which is a stationary solution of the Vlasov--Poisson system. From this distribution, the corresponding Poisson--Boltzmann equation for the gravitational potential is deduced. The second variation of entropy reproduces the classical Antonov instability criterion: the critical energy is $E_c \\simeq -0.335\\,\\frac{G M^2}{R}$, below which no local entropy maximum exists and the configuration becomes unstable (the so-called \"gravothermal catastrophe\"). In this work, we assume $E>E_c$, so all equilibria lie on the stable branch, and the Antonov instability does not affect the analysis. Specializing to spherical symmetry, we recover the classical equation for the isothermal gas sphere, as originally studied by Chandrasekhar, which has applications to the formation of red giant stars. We also derive the fundamental equation of hydrostatic equilibrium, the energy integral and the virial theorem directly from the stationary Vlasov--Poisson solution, demonstrating also that an isothermal gas exhibits negative specific heat. Furthermore, we show that an isothermal gas sphere of strictly constant density is an impossibility. This exposition emphasizes some of the deep connections and self-consistency between kinetic theory, statistical mechanics, and stellar structure, while highlighting some formal aspects of classical astrophysical models.",
      "pdf_url": "https://arxiv.org/pdf/2511.08814.pdf",
      "categories": [
        "astro-ph.GA",
        "math-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08827",
      "title": "Stellar Populations with MaNGA: Iron Kink and Nitrogen Fuzz",
      "authors": [
        "Guy Worthey",
        "Tathagata Pal"
      ],
      "abstract": "Stellar Populations with MaNGA: Iron Kink and Nitrogen Fuzz Guy Worthey, Tathagata Pal 5 pages, 5 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Recent analysis of 2968 MaNGA early type galaxies has yielded two notable trends with velocity dispersion ($\\sigma$) not previously discussed in the literature. First, Fe abundance rises with $\\sigma$, but only until $\\sigma\\approx100$ km s$^{-1}$, after which it falls. This kink is reproduced by TNG100 simulations, implying that hierarchical merger processes might explain it. Second, astrophysical scatter in N is high for galaxies with $\\sigma < 100$ km s$^{-1}$. Due to the restricted list of nucleosynthetic sources for N, it is likely that asymptotic giant branch stars provide most of this N. A varied star formation history (compared to that of massive galaxies) along with variable retention and recycling of N-enriched gas might explain the fuzz of N abundance in low-$\\sigma$ galaxies. Because a timescale argument seems necessary to explain the nitrogen fuzz, and an initial mass function argument is ruled out, similar timescale arguments for the [Mg/Fe] trend as a function of velocity dispersion are supported.",
      "pdf_url": "https://arxiv.org/pdf/2511.08827.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08829",
      "title": "Gas excitation of post-starburst galaxies at 0.6 < z < 1.3",
      "authors": [
        "A. Zanella",
        "S. Belli",
        "F. M. Valentino",
        "A. Bolamperti"
      ],
      "abstract": "Gas excitation of post-starburst galaxies at 0.6 < z < 1.3 A. Zanella, S. Belli, F. M. Valentino, A. Bolamperti 11 pages, 4 figures, 4 tables, plus Appendix. Submitted to A&A Astrophysics of Galaxies (astro-ph.GA) Molecular gas traces both the fuel for star formation and the processes that regulate it. Observing its physical state (e.g., excitation) reveals when and why galaxies stop forming stars. We observed the CO(5-4) emission of 8 post-starburst galaxies at z ~ 0.6-1.3. To our knowledge, this is the first time that high-J transitions are probed for quiescent galaxies beyond the local Universe. All targets are detected in CO(2-1) or CO(3-2) and have molecular gas fractions up to 20%. Using the ratio R52=L'CO(5-4)/L'CO(2-1) as a proxy for gas excitation, we test how quenching occurs. Low R52 values would indicate suppressed fractions of dense/warm gas relative to cold and diffuse gas, while ratios typical of main-sequence galaxies would imply that quenching is still ongoing and that star formation may exhaust the remaining gas. On average our post-starbursts have R52 = 0.31, comparable to high-redshift galaxies. However, CO(5-4) non-detections, corresponding to galaxies without signs of interaction, yield R52<0.11, 2 times lower than local star-forming galaxies. The average CO Spectral Line Energy Distribution (SLED) peaks at J = 3, similar to the Milky Way. Three galaxies show signs of ongoing mergers and have R52 = 0.49 and CO SLEDs peaking at J > 4-5, similar to high-redshift galaxies. At least one requires additional mechanisms (AGN, shocks) to explain the rise of the SLED up to J=5. CO excitation helps distinguishing among mechanisms driving the low star formation efficiency (SFE) of post-starburst galaxies. The low SFE might be due to high kinetic temperatures and low gas densities yielding high excitation, or due to low gas densities implying low excitation. On average, our sample favours the latter scenario, suggesting that gas stabilization, feedback, or stripping are needed to keep galaxies quiescent, and that residual star formation alone cannot deplete the remaining molecular gas.",
      "pdf_url": "https://arxiv.org/pdf/2511.08829.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08933",
      "title": "Continuum variability in multi-epoch quasar spectra from the Sloan Digital Sky Survey",
      "authors": [
        "Minjin Kim",
        "Suyeon Son",
        "Luis C. Ho"
      ],
      "abstract": "Continuum variability in multi-epoch quasar spectra from the Sloan Digital Sky Survey Minjin Kim, Suyeon Son, Luis C. Ho Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) We examine the continuum variability of active galactic nuclei (AGNs) by analyzing the multi-epoch spectroscopic data from the Sloan Digital Sky Survey. To achieve this, we utilized approximately 2 million spectroscopy pairwise combinations observed across different epochs for $\\sim90,000$ AGNs. We estimate the ensemble variability structure function (SF) for subsamples categorized by various AGN properties, such as black hole mass, AGN luminosity ($L$), and Eddington ratio, to investigate how AGN variability depends on these parameters. We found that the SFs are strongly correlated with $L$, Eddington ratio, and rest-frame wavelength ($\\lambda$). The analysis, with each parameter held fixed, reveals that SFs depend primarily on $L$ and $\\lambda$, but not on the Eddington ratio. Consequently, under the assumption that AGNs follow a universal SF, we found that the variability timescale ($\\tau$) is proportional to both $L$ and $\\lambda$, expressed as $\\tau \\propto L^{0.62\\pm0.07} \\lambda^{1.74\\pm0.23}$. This result is broadly consistent with predictions from the standard accretion disk model ($\\tau \\propto L^{0.5} \\lambda^{2}$). However, when considering only shorter wavelengths ($\\lambda \\leq 3050$ Å) to minimize contamination from the host galaxy and the Balmer continuum, the power-law index for $\\lambda$ drops significantly to $1.12 \\pm 0.24$. This value is lower than predicted by approximately $3-$4\\ \\sigma$, suggesting that the radial temperature profile may be systematically steeper than that predicted by the standard disk model, although other mechanisms may also contribute to this discrepancy. These findings highlight the power of temporal spectroscopic data in probing AGN variability, as they allow robust estimation of continuum fluxes without interference from strong emission lines.",
      "pdf_url": "https://arxiv.org/pdf/2511.08933.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09081",
      "title": "J-PAS: A Neural Network Approach to Single Stellar Population Characterization",
      "authors": [
        "H. Domínguez Sánchez",
        "P. Coelho",
        "G. Bruzual",
        "A. Hernán-Caballero",
        "C. López Sanjuan",
        "J. A. Fernandez-Ontiveros",
        "L.A. Díaz-García",
        "L. Suelves",
        "A. Álvarez-Candal",
        "I. Breda",
        "S. Gurung-López",
        "V. Placco",
        "J. Vega-Ferrero",
        "J. M. Vílchez",
        "R. Abramo",
        "J. Alcaniz",
        "N. Benitez",
        "S. Bonoli",
        "S. Carneiro",
        "J. Cenarro",
        "D. Cristóbal-Hornillos",
        "R. Dupke",
        "A. Ederoclite",
        "C. Hernández-Monteagudo",
        "A. Marín-Franch",
        "C. Mendes de Oliveira",
        "M. Moles",
        "L. Sodré Jr",
        "K. Taylor",
        "J. Varela",
        "H. Vázquez Ramió"
      ],
      "abstract": "J-PAS: A Neural Network Approach to Single Stellar Population Characterization H. Domínguez Sánchez, P. Coelho, G. Bruzual, A. Hernán-Caballero, C. López Sanjuan, J. A. Fernandez-Ontiveros, L.A. Díaz-García, L. Suelves, A. Álvarez-Candal, I. Breda, S. Gurung-López, V. Placco, J. Vega-Ferrero, J. M. Vílchez, R. Abramo, J. Alcaniz, N. Benitez, S. Bonoli, S. Carneiro, J. Cenarro, D. Cristóbal-Hornillos, R. Dupke, A. Ederoclite, C. Hernández-Monteagudo, A. Marín-Franch, C. Mendes de Oliveira, M. Moles, L. Sodré Jr, K. Taylor, J. Varela, H. Vázquez Ramió 16 pages, 11 Figures. accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) J-PAS (Javalambre Physics of the Accelerating Universe Astrophysical Survey) will present a groundbreaking photometric survey covering 8500 deg$^2$ of the visible sky from Javalambre, capturing data in 56 narrow band filters. This survey promises to revolutionize galaxy evolution studies by observing $\\sim$10$^8$ galaxies with low spectral resolution. A crucial aspect of this analysis involves predicting stellar population parameters from the observed galaxy photometry. In this study, we combine the exquisite J-PAS photometry with state-of-the-art single stellar population (SSP) libraries to accurately predict stellar age, metallicity, and dust attenuation with a neural network (NN) model. The NN is trained on synthetic J-PAS photometry from different SSP librares (E-MILES, Charlot & Bruzual, XSL), to enhance the robustness of our predictions against individual SSP model variations and limitations. To create mock samples with varying observed magnitudes we add artificial noise in the form of random Gaussian variations within typical observational uncertainties in each band. Our results indicate that the NN can accurately estimate stellar parameters for SSP models without evident degeneracies, surpassing a bayesian SED-fitting method on the same test set. We obtain median bias, scatter and percentage of outliers $\\mu$ = (0.01 dex, 0.00 dex, 0.00 mag), $\\sigma_{NMAD}$ = (0.23 dex, 0.29 dex, 0.04 mag), f$_{o}$ = (17 %, 24 %, 1 %) at $ i \\sim$17 mag for age, metallicity and dust attenuation, respectively. The accuracy of the predictions is highly dependent on the signal-to-noise (S/N) ratio of the photometry, achieving robust predictions up to $i$ $\\sim$ 20 mag.",
      "pdf_url": "https://arxiv.org/pdf/2511.09081.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09153",
      "title": "Emission-Line and Continuum Reverberation Mapping of the NLS1 Galaxy WPVS 48",
      "authors": [
        "M.A. Probst",
        "W. Kollatschny",
        "M.W. Ochmann",
        "C. Sobrino Figaredo",
        "D. Chelouche",
        "M. Haas",
        "S. Kaspi",
        "L. Meerwart",
        "T.-O. Husser"
      ],
      "abstract": "Emission-Line and Continuum Reverberation Mapping of the NLS1 Galaxy WPVS 48 M.A. Probst, W. Kollatschny, M.W. Ochmann, C. Sobrino Figaredo, D. Chelouche, M. Haas, S. Kaspi, L. Meerwart, T.-O. Husser Astrophysics of Galaxies (astro-ph.GA) WPVS 48 is a nearby narrow-line Seyfert 1 galaxy without previous analysis of the broad-line region (BLR) by means of optical spectroscopic reverberation mapping. By studying the continuum and emission line variability of WPVS 48, we aim to infer the BLR size as well as the mass of the central supermassive black hole (SMBH). We analyse data from a dedicated optical spectroscopic reverberation mapping campaign of WPVS 48 taken with the 10 m Southern African Large Telescope (SALT) at 24 epochs over a period of 7 months between December 2013 and June 2014. WPVS 48 shows variability throughout the campaign. We find a stratified BLR, where the variability amplitude of the integrated emission lines decreases with distance to the ionizing continuum source. Specifically, the variable emission of H$\\alpha$, H$\\beta$, H$\\gamma$, He I $\\lambda5876$ originates at distances of $16.0^{+4.0}_{-2.0}$, $15.0^{+4.5}_{-1.9}$, $12.5^{+3.5}_{-2.5}$ and $14.0^{+2.5}_{-2.1}$ light-days, respectively, to the optical continuum at 5100 A. The He II $\\lambda 4686$ lag is $\\lesssim 5$ days. Based on the high S/N spectra, we identify variable emission of N III $\\lambda4640$ and C IV $\\lambda4658$ in the line complex with He II $\\lambda 4686$. We derive interband continuum delays increasing with wavelength up to $\\sim 8$ days. These delays are consistent with an additional diffuse continuum originating at the same distance as the variable Balmer emission. We derive a central black hole mass of $(1.3_{-0.6}^{+1.1})\\times10^7M_{\\odot}$ based on the integrated line-widths and distances of the BLR and discuss corrections for the inclination angle. This gives an Eddington ratio $L/L_{\\text{Edd}}\\approx 0.39$ without correction for inclination.",
      "pdf_url": "https://arxiv.org/pdf/2511.09153.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09198",
      "title": "Interstellar medium phases and abundances in the central parsec: A JWST MIRI/MRS view of the Galactic center",
      "authors": [
        "P.Vermot",
        "A. Ciurlo",
        "D. Rouan",
        "M.R. Morris",
        "E. Bron",
        "J. Le Bourlot",
        "F. Le Petit",
        "J. Qiu",
        "A. Togi",
        "A. Ghez T. Do",
        "J.R. Lu"
      ],
      "abstract": "Interstellar medium phases and abundances in the central parsec: A JWST MIRI/MRS view of the Galactic center P.Vermot, A. Ciurlo, D. Rouan, M.R. Morris, E. Bron, J. Le Bourlot, F. Le Petit, J. Qiu, A. Togi, A. Ghez T. Do, J.R. Lu Astrophysics of Galaxies (astro-ph.GA) We used newly obtained observations from the Mid-Infrared Instrument (MIRI) equipped with the Medium Resolution Spectrometer (MRS) aboard the James Webb Space Telescope (JWST) to extract spectra covering the entire spectral range from 5 to 27~$\\mu$m in the CND and in the CC. We used the photoionization code CLOUDY to generate synthetic spectra with the same spectral range and resolution, simulating a wide range of gas phases and abundances. We then determined the contribution of each phase to the spectra. Once the abundances and contribution from each phase of the gas were determined, we identified four dominant phases and performed a spatial analysis to determine their contribution to each spaxel of the datacubes. We find that in both the CND and the CC, the bulk of the emission originates from warm ionized gas with temperatures of between $10^4$ and $10^{4.8}$~K. In the CND, molecular gas contributes significantly to the flux and is spatially structured, while the CC shows minimal molecular gas content, as is expected from these regions. Coronal gas is detected in both regions at the interface between molecular and warm ionized gas. The observed abundance pattern (enhanced CNO and $\\alpha$ elements with suppressed Fe) indicates a chemically young environment, recently enriched by core-collapse supernovae and stellar winds, with a limited contribution from older Type Ia supernovae. This favors a scenario of massive, recent star formation rather than cumulative long-term enrichment.",
      "pdf_url": "https://arxiv.org/pdf/2511.09198.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09278",
      "title": "Little red dots as embryos of active galactic nuclei",
      "authors": [
        "Jian-Min Wang",
        "Yi-Lin Wang",
        "Yong-Jie Chen",
        "Jun-Rong Liu",
        "Yu-Yang Songsheng",
        "Cheng Cheng",
        "Yan-Rong Li",
        "Pu Du",
        "Hao Zhang",
        "Yu Zhao"
      ],
      "abstract": "Little red dots as embryos of active galactic nuclei Jian-Min Wang, Yi-Lin Wang, Yong-Jie Chen, Jun-Rong Liu, Yu-Yang Songsheng, Cheng Cheng, Yan-Rong Li, Pu Du, Hao Zhang, Yu Zhao Astrophysics of Galaxies (astro-ph.GA) As an unprecedented large population in the early universe, the JWST-discovered little red dots (LRDs) have garnered much attention for formation of massive black holes and galaxies, but their nature remains a mystery. The LRDs appearing as ``Chimeras\" like both active galactic nuclei (AGNs) and galaxies have stimulated renewed interest in the roadmap of central massive black hole (cMBH) formation in AGNs. In this paper, we suggest that the LRDs contain $M_{\\bullet}\\lesssim 10^6\\,M_{\\odot}$ cMBHs as demonstrated by the Sołtan argument and there is a large population of stellar-mass black holes (sMBHs with total mass of $\\mathscr{M}_{m_{\\bullet}}$) embedded inside cMBH accretion disks (cMBH-disk) as motivated by anomalous reverberations of broad H$\\beta$ line in local AGNs. This embryo structure of LRDs ($M_{\\bullet}<\\mathscr{M}_{m_{\\bullet}}$) is formed as a consequence of gravitational collapse of primordial clouds. In this Chimera, accretion onto sMBHs powers the rest-frame optical continuum of the LRDs but the UV continuum is jointly contributed by slim parts of the cMBH-disks and nuclear starbursts in the core of collapsing clouds governing the appearance of the observed V-shaped spectral energy distributions (SEDs). Outflowing clumped-envelopes are unavoidably formed by radiation pressure leading to absorption features of the Balmer lines. The present model works very well for LRDs' SEDs and avoids the issues of overly massive cMBHs. Evolution of LRDs is briefly discussed including gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2511.09278.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.09499",
      "title": "A ring-shaped starburst as a galactic wind-generating mechanism: Morphology, emission, and mass ejection",
      "authors": [
        "J. A. Osorio-Caballero",
        "A. Rodríguez-González",
        "Z. Meliani"
      ],
      "abstract": "A ring-shaped starburst as a galactic wind-generating mechanism: Morphology, emission, and mass ejection J. A. Osorio-Caballero, A. Rodríguez-González, Z. Meliani Astrophysics of Galaxies (astro-ph.GA) Star formation bursts promote the ejection of material from the hosting galaxies due to the momentum and energy injected by winds from massive stars and supernova explosions. Numerical or analytical models generally consider that the mass, momentum, and energy injections result from bursts in a nuclear star formation region. However, star formation bursts have recently been observed in ring-like regions in the nuclear part of the galaxies. One example is NGC 253, which has shown a central toroidal burst and an asymmetric galactic wind observed in thermal X-ray emission. The general aim of this work is to study the effect of mechanical energy injection from stellar winds and supernova explosions in star-forming bursts distributed in rings around the nucleus of the galaxy NGC 253. Additionally, these partial objectives allow us to analyze the asymmetry of the outflows due to the bursts position as well as to study the formation of filaments with optical emission and make comparisons with recent observations of galaxies with these types of star-forming bursts. We used the hydrodynamic code AMRVAC to simulate galactic wind ejection coming from a central ring-like starburst located at different vertical positions. We showed that including a ring-shaped starburst (RSS) generates a more complex structured wind than what would be expected for a spherical starburst injection. Besides the interaction between the wind generated by the RSS and the host galaxy, it can generate dense filamentary structures with H alpha emission. The mass flux analysis of our models shows that the variation in the vertical position of the starburst can generate a variation in the mass flux of each lobe of the wind up to an order of magnitude. However, this difference is sustained only for a short period, with the flux tending to be symmetrical once it enters into a free-wind solution.",
      "pdf_url": "https://arxiv.org/pdf/2511.09499.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09518",
      "title": "Warped Disk Galaxies: Statistical Properties from DESI Legacy Imaging Surveys DR8",
      "authors": [
        "Yiheng Wang",
        "Han Qu",
        "Jiafeng Lu",
        "Huiyuan Wang",
        "Enci Wang",
        "Xi Kang"
      ],
      "abstract": "Warped Disk Galaxies: Statistical Properties from DESI Legacy Imaging Surveys DR8 Yiheng Wang, Han Qu, Jiafeng Lu, Huiyuan Wang, Enci Wang, Xi Kang 16 pages, 11 figures, submitted. Comments are welcome Astrophysics of Galaxies (astro-ph.GA) Warped structures are often observed in disk galaxies, yet their physical origin is still under investigation. We present a systematic study of warped edge-on disk galaxies based on imaging data from the DESI Legacy Imaging Surveys DR8, with the expectation that this large sample size, enabled by wide-area surveys, will offer new perspectives on the formation of disk warps. Using a deep learning approach, we trained an EfficientNet-B3 convolutional neural network to classify the morphology of edge-on-disk galaxies into warped and non-warped categories. Our model was trained on a curated and visually verified set of labeled galaxy images and applied to a large dataset of over 595,651 edge-on disk galaxies selected from the Galaxy Zoo DESI catalog. Our results provide the largest warp catalog to date, consisting of 23996 warped edge-on disk galaxies, and reveal statistical trends between warp occurrence and galaxy properties. Compared to their non-warped counterparts, these warped disk galaxies tend to have bluer colors, lower stellar masses, higher gas fractions and star-formation rates, smaller Sérsic indices and larger disk sizes. In addition, warped disk galaxies show higher projected number densities of neighboring galaxies than their non-warped counterparts, particularly within \\( R_{\\mathrm{proj}} \\lesssim 50~\\mathrm{kpc} \\), where the local number density is roughly twice as high.",
      "pdf_url": "https://arxiv.org/pdf/2511.09518.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09389",
      "title": "Ray-trax: Fast, Time-Dependent, and Differentiable Ray Tracing for On-the-fly Radiative Transfer in Turbulent Astrophysical Flows",
      "authors": [
        "Lorenzo Branca",
        "Rune Rost",
        "Tobias Buck"
      ],
      "abstract": "Ray-trax: Fast, Time-Dependent, and Differentiable Ray Tracing for On-the-fly Radiative Transfer in Turbulent Astrophysical Flows Lorenzo Branca, Rune Rost, Tobias Buck Accepted to the 1st Workshop on Differentiable Systems and Scientific Machine Learning EurIPS 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); Computational Engineering, Finance, and Science (cs.CE) Radiative transfer is a key bottleneck in computational astrophysics: it is nonlocal, stiff, and tightly coupled to hydrodynamics. We introduce Ray-trax, a GPU-oriented, fully differentiable 3D ray tracer written in JAX that solves the time-dependent emission--absorption problem and runs directly on turbulent gas fields produced by hydrodynamic simulations. The method favors the widely used on-the-fly emission--absorption approximation, which is state of the art in many production hydro codes when scattering is isotropic. Ray-trax vectorizes across rays and sources, supports arbitrarily many frequency bins without architectural changes, and exposes end-to-end gradients, making it straightforward to couple with differentiable hydro solvers while preserving differentiability. We validate against analytical solutions, demonstrate propagation in turbulent media, and perform a simple inverse problem via gradient-based optimization. In practice, the memory footprint scales as $\\mathcal{O}(N_{\\text{src}}\\,N_{\\text{cells}})$ while remaining highly efficient on accelerators.",
      "pdf_url": "https://arxiv.org/pdf/2511.09389.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.SR",
        "cs.CE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09473",
      "title": "TIME Commissioning Observations: I. Mapping Dust and Molecular Gas in the Sgr A Molecular Cloud Complex at the Galactic Center",
      "authors": [
        "Selina F. Yang",
        "Sophie M. McAtee",
        "Benjamin J. Vaughan",
        "Abigail T. Crites",
        "Victoria L. Butler",
        "Dongwoo T. Chung",
        "Ryan P. Keenan",
        "Dang Pham",
        "James J. Bock",
        "Charles M. Bradford",
        "Tzu-Ching Chang",
        "Yun-Ting Cheng",
        "Audrey Dunn",
        "Nicholas Emerson",
        "Clifford Frez",
        "Jonathon Hunacek",
        "Chao-Te Li",
        "Ian N. Lowe",
        "King Lau",
        "Daniel P. Marrone",
        "Evan C. Mayer",
        "Guochao Sun",
        "Isaac Trumper",
        "Anthony D. Turner",
        "Ta-Shun Wei",
        "Michael Zemcov"
      ],
      "abstract": "TIME Commissioning Observations: I. Mapping Dust and Molecular Gas in the Sgr A Molecular Cloud Complex at the Galactic Center Selina F. Yang, Sophie M. McAtee, Benjamin J. Vaughan, Abigail T. Crites, Victoria L. Butler, Dongwoo T. Chung, Ryan P. Keenan, Dang Pham, James J. Bock, Charles M. Bradford, Tzu-Ching Chang, Yun-Ting Cheng, Audrey Dunn, Nicholas Emerson, Clifford Frez, Jonathon Hunacek, Chao-Te Li, Ian N. Lowe, King Lau, Daniel P. Marrone, Evan C. Mayer, Guochao Sun, Isaac Trumper, Anthony D. Turner, Ta-Shun Wei, Michael Zemcov 17 pages + 5 pages of bibliography and appendices. 14 figures, 3 tables. To be submitted to ApJ Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) We present the processing of an observation of Sagittarius A (Sgr A) with the Tomographic Ionized-carbon Mapping Experiment (TIME), part of the 2021-2022 commissioning run to verify TIME's hyperspectral imaging capabilities for future line-intensity mapping. Using an observation of Jupiter to calibrate detector gains and pointing offsets, we process the Sgr A observation in a purpose-built pipeline that removes correlated noise through common-mode subtraction with correlation-weighted scaling, and uses map-domain principal component analysis to identify further systematic errors. The resulting frequency-resolved maps recover strong 12CO(2-1) and 13CO(2-1) emission, and a continuum component whose spectral index discriminates free-free emission in the circumnuclear disk (CND) versus thermal dust emission in the 20 km s$^{-1}$ and 50 km s$^{-1}$ molecular clouds. Broadband continuum flux comparisons with the Bolocam Galactic Plane Survey (BGPS) show agreement to within $\\sim$5% in high-SNR molecular clouds in the Sgr A region. From the CO line detections, we estimate a molecular hydrogen mass of between $5.4 \\times 10^5 M_\\odot$ and $5.7 \\times 10^5 M_\\odot$, consistent with prior studies. These results demonstrate TIME's ability to recover both continuum and spectral-line signals in complex Galactic fields, validating its readiness for upcoming extragalactic CO and [C II] surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.09473.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.13954",
      "title": "The fine structure of the mean magnetic field in M31",
      "authors": [
        "Indrajit Paul",
        "R. Vasanth Kashyap",
        "Tuhin Ghosh",
        "Rainer Beck",
        "Luke Chamandy",
        "Srijita Sinha",
        "Anvar Shukurov"
      ],
      "abstract": "The fine structure of the mean magnetic field in M31 Indrajit Paul, R. Vasanth Kashyap, Tuhin Ghosh, Rainer Beck, Luke Chamandy, Srijita Sinha, Anvar Shukurov 22 pages, 17 figures, Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) To explore the spatial variations of the regular (mean) magnetic field of the Andromeda galaxy (M31), we use Fourier analysis in azimuthal angle along four rings in the galaxy's plane. The Fourier coefficients give a quantitative measure of strength of the modes, enabling us to compare expectations from mean-field dynamo models of spiral galaxies. Earlier analyses indicated that the axisymmetric magnetic field (azimuthal Fourier mode $m=0$) is sufficient to fit the observed polarization angles in a wide range of galactocentric distances ($r$). We apply a Bayesian inference approach to new, more sensitive radio continuum data at $\\lambda \\lambda3.59$, $6.18$, and $11.33$ cm and the earlier data at $\\lambda 20.46$ cm to reveal sub-dominant contributions from the modes $m=1$, 2, and 3 along with a dominant axisymmetric mode. Magnetic lines of the axisymmetric mode are close to trailing logarithmic spirals which are significantly more open than the spiral arms detectable in the interstellar dust and neutral hydrogen. The form of the $m=0$ mode is consistent with galactic dynamo theory. Both the amplitudes and the pitch angles of the higher azimuthal modes ($m>1$) vary irregularly with $r$ reflecting local variations in the magnetic field structure. The maximum strength of the mean magnetic field of $1.8-2.7 \\mu$G (for the axisymmetric part of the field) occurs at $10-14$ kpc but we find that its strength varies strongly along the azimuth; this variation gives rise to the $m=1$ mode. We suggest a procedure of Bayesian inference which is independent of the specific nature of the depolarization and applies when the magneto-ionic layer observable in polarized emission is not symmetric along the line of sight because emission from its far side is completely depolarized.",
      "pdf_url": "https://arxiv.org/pdf/2506.13954.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.08604",
      "title": "UNIONS Optical Identifications for VLASS Radio Sources in the Euclid Sky (UNVEIL) I. A Catalog of ~146,000 Radio Galaxies up to z~5",
      "authors": [
        "Yuxing Zhong",
        "Kohei Ichikawa",
        "Hendrik Hildebrandt",
        "Stephen Gwyn",
        "Akio K. Inoue",
        "Masafusa Onoue",
        "Masatoshi Imanishi",
        "Taketo Yoshida",
        "Martin Kilbinger",
        "Thomas de Boer",
        "Gregory S. H. Paek",
        "Yoshiki Matsuoka",
        "Tohru Nagao",
        "Yoshiki Toba"
      ],
      "abstract": "UNIONS Optical Identifications for VLASS Radio Sources in the Euclid Sky (UNVEIL) I. A Catalog of ~146,000 Radio Galaxies up to z~5 Yuxing Zhong, Kohei Ichikawa, Hendrik Hildebrandt, Stephen Gwyn, Akio K. Inoue, Masafusa Onoue, Masatoshi Imanishi, Taketo Yoshida, Martin Kilbinger, Thomas de Boer, Gregory S. H. Paek, Yoshiki Matsuoka, Tohru Nagao, Yoshiki Toba 20 pages and 17 figures with Appendix; Published in ApJS; the UNVEIL radio galaxy catalog can be found at this https URL Astrophysics of Galaxies (astro-ph.GA) We present results of optical identifications for Very Large Array Sky Survey (VLASS) radio sources using the Ultraviolet Near Infrared Optical Northern Survey (UNIONS). A cross-match between UNIONS and VLASS Epoch 2 catalogs yields 146,212 radio galaxies down to $r=24.5$ mag over a wide area of $\\sim4,200\\ \\mathrm{deg^2}$. We perform g-dropout selections and find $>200$ sources at $z\\sim4$ optimistically. Of 63,019 sources with valid photo-$z$, 8,692 are at $z_\\mathrm{photo}>1$, and 1,171 are at $z_\\mathrm{photo}>2$. Based on spectral luminosities at 1.4 GHz using the valid photo-$z$, we identify $\\sim49,000$ radio-loud AGNs (RLAGNs) with $\\textit{L}_\\mathrm{1.4GHz}>10^{24}$ W/Hz, and all radio galaxies at $z>1$ are RL. Adopting radio loudness instead, 138,266 out of 146,212 UNIONS-VLASS radio galaxies are RL. Thus, our catalog greatly increases the number counts of RLAGNs at $z>1$. We further cross-match the UNIONS-VLASS catalog with LOw-Frequency ARray Two-metre Sky Survey (LoTSS) at 144 MHz and Faint Images of the Radio Sky at Twenty-cm (FIRST) at 1.4 GHz, yielding 101,671 UNIONS-VLASS-LoTSS, 79,638 -FIRST, and 64,672 -LoTSS-FIRST sources, respectively. This multifrequency radio dataset reveals sources of various spectral shapes, including the steep spectrum of aged populations, the peaked spectrum of young populations, and the upturned spectrum potentially associated with transient sources. The UNIONS-VLASS radio galaxies will be covered by the Euclid wide survey, offering legacy values to benefit multi-faceted studies related to RLAGNs and beyond.",
      "pdf_url": "https://arxiv.org/pdf/2507.08604.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.14936",
      "title": "Exploring Spatially-Resolved Metallicities, Dynamics and Outflows in Low-Mass Galaxies at $z \\sim 7.6$",
      "authors": [
        "L. R. Ivey",
        "J. Scholtz",
        "A. L. Danhaive",
        "S. Koudmani",
        "G. C. Jones",
        "R. Maiolino",
        "M. Curti",
        "F. D'Eugenio",
        "S. Tacchella",
        "W. M. Baker",
        "S. Arribas",
        "S. Charlot",
        "D. Eisenstein",
        "Z. Ji",
        "M. Koller",
        "N. Laporte",
        "D. Puskás",
        "B. Robertson",
        "D. Sijacki",
        "J. A. A. Trussler",
        "C. Witten"
      ],
      "abstract": "Exploring Spatially-Resolved Metallicities, Dynamics and Outflows in Low-Mass Galaxies at $z \\sim 7.6$ L. R. Ivey, J. Scholtz, A. L. Danhaive, S. Koudmani, G. C. Jones, R. Maiolino, M. Curti, F. D'Eugenio, S. Tacchella, W. M. Baker, S. Arribas, S. Charlot, D. Eisenstein, Z. Ji, M. Koller, N. Laporte, D. Puskás, B. Robertson, D. Sijacki, J. A. A. Trussler, C. Witten Submitted to MNRAS. 28 pages, 18 figures, 5 tables Astrophysics of Galaxies (astro-ph.GA) A majority of JWST/NIRSpec/IFU studies at high redshifts to date have focused on UV-bright or massive objects, while our understanding of low-mass galaxies at early cosmic times remains limited. In this work, we present NIRSpec/IFS high-resolution observations of two low-mass ($M_* < 10^9 \\ M_\\odot$), low-metallicity ($[12 + \\log(\\text{O/H})] < 8$) galaxies at $z \\sim 7.66$, one of which we identify as hosting a Type-II AGN. We measure flat strong-line metallicity gradients, suggestive of ISM redistribution by outflows or past merging, but also identify tension with the direct-$T_\\text{e}$ metallicity gradient in one galaxy. We measure $v_\\text{rot}/\\sigma < 1$ in both galaxies, consistent with observations of lower rotational support at early cosmic times. We identify broad kinematical components decoupled from galactic rotation with velocities of $\\sim 250 - 500 \\ \\text{km} \\ \\text{s}^{-1}$ and argue these components trace outflows, for which we infer outflow rates of $\\sim 8 - 14 \\ M_\\odot \\ \\text{yr}^{-1}$ with $v_\\text{out}/v_\\text{esc} \\sim 1$. We compare our findings to results from the new large-volume AESOPICA simulations, which fully incorporate different models of black hole growth and AGN feedback. We find that our observational results of $v_\\text{out}/v_\\text{esc}$ are consistent with the simulated dwarf AGN population, hinting AGN-driven feedback may contribute to quenching both in our systems and in a wider population of low-mass galaxies in the early Universe. This novel study illustrates the necessity of deep IFU observations to decompose the complex kinematics and morphology of high-$z$ galaxies, trace outflows, and constrain the effect of feedback in the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2507.14936.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20606",
      "title": "Beyond Extreme Burstiness: Evolving Star Formation Efficiency as the Key to Early Galaxy Abundance",
      "authors": [
        "Abhijnan Kar",
        "Shadab Alam",
        "Joseph Silk"
      ],
      "abstract": "Beyond Extreme Burstiness: Evolving Star Formation Efficiency as the Key to Early Galaxy Abundance Abhijnan Kar, Shadab Alam, Joseph Silk 26 pages, 18 figures, 3 tables. Accepted in ApJ Astrophysics of Galaxies (astro-ph.GA) JWST observations have revealed an overabundance of bright galaxies at $z \\geq 9$, creating apparent tensions with theoretical predictions within standard $\\Lambda$CDM cosmology. We address this challenge using a semi-empirical approach that connects dark matter halos to observed UV luminosity through physically motivated double power-law star formation efficiency (SFE) model as a function of halo mass, redshift and perform joint Bayesian analysis of luminosity functions spanning $z = 4 - 16$ using combined HST and JWST data. Through systematic model comparison using information criteria (AIC, BIC, DIC), we identify the optimal framework requiring redshift evolution only in the low-mass slope parameter $\\alpha(z)$ while maintaining other SFE parameters constant. Our best-fitting model achieves excellent agreement with observations using modest, constant UV scatter $\\sigma_{\\rm UV} = 0.32$ dex, significantly lower than the $\\gtrsim 1.3$ dex values suggested by previous studies for $z > 13$. This reduced scatter requirement is compensated by strongly evolving star formation efficiency, with $\\alpha$ increasing toward higher redshifts, indicating enhanced star formation in low-mass halos during cosmic dawn. The model also successfully reproduces another important observational diagnostic such as effective galaxy bias and cosmic Star Formation Density (SFRD) consistently across the full redshift range. Furthermore, model predictions are consistent up to a redshift of $z\\sim 20$. Our results demonstrate that JWST's early galaxy observations can be reconciled with standard cosmology through the interplay of modest stochasticity and evolving star formation physics, without invoking extreme burstiness or exotic mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2507.20606.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.06773",
      "title": "Disentangling Milky Way halo populations at low metallicities using [Al/Fe]",
      "authors": [
        "H. Ernandes",
        "Á. Skúladóttir",
        "S. Feltzing",
        "D. Feuillet"
      ],
      "abstract": "Disentangling Milky Way halo populations at low metallicities using [Al/Fe] H. Ernandes, Á. Skúladóttir, S. Feltzing, D. Feuillet Astrophysics of Galaxies (astro-ph.GA) Differentiating between in-situ and accreted populations in the Milky Way halo is a challenging task. Various kinematic spaces are often used to identify distinct accreted populations from the in-situ Milky Way halo. However, this approach has limitations, especially at low orbital energies. To overcome this ambiguity, elemental abundances are typically used to distinguish between the populations. Yet, for many elemental abundance ratios, it remains difficult to make this distinction at low metallicities. Aluminium abundances, on the other hand, have been empirically found to be an effective discriminator, allowing for the separation of accreted and in-situ populations in the Milky Way halo even at low metallicities and low orbital energies. We aim to test the discriminating power of [Al/Fe] using a well-studied sample of high-velocity stars in the solar vicinity with high-quality spectra. With these stars, we explore the [Al/Fe] ability to separate the in-situ from accreted stars and test its limitations. We derived aluminium abundances from the Al I 3944 and 3961 {\\rm Å} lines for 45 stars observed in two ESO programmes, along with 11 stars with archival spectra. Aluminium abundances were determined using 1D LTE and 1D NLTE spectral synthesis and line profile fitting. We confirm that the low-$\\alpha$ population systematically has lower [Al/Fe] compared to high-$\\alpha$ stars. Aluminium abundances, when carefully measured and NLTE effects taken into account, are effective tracers of the chemical history of halo stars. They provide an independent constraint on origin, complementing $\\alpha$-element abundances trends, and help us to disentangle subpopulations within the accreted halo, especially in the metal-poor regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.06773.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09764",
      "title": "Witnessing downsizing in the making: quiescent and breathing galaxies at the dawn of the Universe",
      "authors": [
        "Emiliano Merlin",
        "Flaminia Fortuni",
        "Antonello Calabrò",
        "Marco Castellano",
        "Paola Santini",
        "Adriano Fontana",
        "Lucas C. Kimmig",
        "Francesco Shankar",
        "Lorenzo Napolitano",
        "Anton M. Koekemoer",
        "Ray A. Lucas",
        "Fabio Pacucci",
        "Michael C. Cooper",
        "Michaela Hirschmann",
        "Pablo G. Pérez-González",
        "Guillermo Barro",
        "Mark Dickinson",
        "Giovanni Gandolfi",
        "Norman A. Grogin",
        "Xin Wang"
      ],
      "abstract": "Witnessing downsizing in the making: quiescent and breathing galaxies at the dawn of the Universe Emiliano Merlin, Flaminia Fortuni, Antonello Calabrò, Marco Castellano, Paola Santini, Adriano Fontana, Lucas C. Kimmig, Francesco Shankar, Lorenzo Napolitano, Anton M. Koekemoer, Ray A. Lucas, Fabio Pacucci, Michael C. Cooper, Michaela Hirschmann, Pablo G. Pérez-González, Guillermo Barro, Mark Dickinson, Giovanni Gandolfi, Norman A. Grogin, Xin Wang 25 pages (14 main paper, 1 references, 10 Appendix); 20 figures; 3 tables. Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) [Shortened for arXiv] We conduct a systematic search for $\\log(M_\\ast/M_\\odot) \\geq 9.5$ quiescent galaxies at $z > 3$ in six extragalactic deep fields observed with NIRCam, with the goal of extracting their physical and statistical features in a uniform and self-consistent manner. We exploit the ASTRODEEP-JWST photometric catalogs to single out robust candidates, including sources quenched only a few tens of Myr before the observation. We apply a SED-fitting procedure which explores three functional forms of star formation history and the $\\chi^2$ probabilities of the solutions, with additional checks to minimise the contamination from interlopers, tuning our selection criteria against available spectroscopic data from the DAWN archive and simulated catalogs. We select 633 candidates, which we rank by a reliability parameter based on the probabilities of the quiescent and alternative star-forming solutions, with 291 candidates tagged as \"gold\". According to the best-fit models, 79\\% of the massive ($\\log(M_\\ast/M_\\odot) \\geq 10.5$) quiescent galaxies at $3 < z < 5$ stopped forming stars at least 150 Myr before the time of observation, while 89\\% of low-mass sources have been quenched for less than 150 Myr. The abundance of low-mass old quiescent systems does not increase significantly with time from $z = 5$ to 3: low-mass objects seem to be experiencing a short episode of quenching followed by rejuvenation (``breathing''), consistent with a downsizing scenario of galaxy formation. We also find an abrupt drop in the density of massive quiescent candidates at $z > 5$. We derive estimates for the number density of early passive galaxies up to $z = 10$ and compare them against various models: tensions with data remain in the modeling of the observed bimodality of time passed since quenching as a function of mass.",
      "pdf_url": "https://arxiv.org/pdf/2509.09764.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.18961",
      "title": "Both Stellar Mass and Gravitational Potential Shape the Gas-Phase Metallicity",
      "authors": [
        "Maria Koller",
        "Roberto Maiolino",
        "William M. Baker"
      ],
      "abstract": "Both Stellar Mass and Gravitational Potential Shape the Gas-Phase Metallicity Maria Koller, Roberto Maiolino, William M. Baker 16 pages, 12 figures, 2 tables. Accepted by MNRAS Astrophysics of Galaxies (astro-ph.GA) The relation between metallicity and galaxy mass (the so-called mass-metallicity relation) is the strongest and most prominent among scaling relations between chemical enrichment and galactic properties. However, it is unclear whether this relation primarily traces metal retention or the integrated production of metals, as past studies have obtained contrasting results. We investigate this issue through an extensive Random Forest and Partial Correlations analysis of spectral cubes of 4,500 galaxies from the MaNGA survey. We find that stellar mass ($\\rm M_*$) and baryonic gravitational potential ($\\rm \\Phi_* = M_*/R_e$) are the two most important quantities determining gas metallicity in galaxies. However, their relative roles strongly depend on the galactocentric radius -- the metallicity within 0.7~$\\rm R_e$ depends primarily on the stellar mass, while the metallicity at radii beyond 0.9~$\\rm R_e$ depends primarily on the gravitational potential. This finding can be interpreted in terms of metals in the central region ($\\rm R\\leq 0.7~R_e$) being mostly bound, regardless of the global gravitational potential and, therefore, the metallicity is determined primarily by the cumulative production of metals (hence the integrated star formation history, i.e. $\\rm M_*$); by contrast, in the galactic peripheries the retention of metals depends more critically on the gravitational potential, hence the stronger dependence of the metallicity on $\\rm \\Phi_*$ at large radii. Our finding reconciles apparent discrepancies between previous results. Finally, we find that the Star Formation Rate is the third most important parameter (after $\\rm M_*$ and $\\rm \\Phi_*$) in determining the metallicity, as expected from the Fundamental Metallicity Relation.",
      "pdf_url": "https://arxiv.org/pdf/2509.18961.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.05263",
      "title": "Ionization Sources of the Local Interstellar Clouds: Two B-stars, Three White Dwarfs, and the Local Hot Bubble",
      "authors": [
        "J. Michael Shull , Rachel M. Curran , Michael W. Topping , Jonathan D. Slavin University of Colorado, University of North Carolina, University of Arizona, Harvard/SAO)"
      ],
      "abstract": "Ionization Sources of the Local Interstellar Clouds: Two B-stars, Three White Dwarfs, and the Local Hot Bubble J. Michael Shull (1 and 2), Rachel M. Curran (2), Michael W. Topping (3), Jonathan D. Slavin (4) ((1) University of Colorado, (2) University of North Carolina, (3) University of Arizona, (4) Harvard/SAO) Final version, accepted to ApJ. An expanded (new) version of arXiv:2508.03800, now with 2 Appendices, 6 figures, 2 tables (21 pages total) Astrophysics of Galaxies (astro-ph.GA) The dominant sources of photoionizing radiation in the extreme ultraviolet (EUV) incident on the exterior of the local interstellar clouds include two nearby early B-type stars, $\\epsilon$ CMa ($124\\pm2$ pc) and $\\beta$ CMa ($151\\pm5$ pc), three hot dwarfs, and the local hot bubble (LHB). Line emission (170-912A) from highly ionized metals (Fe, Ne, Mg) in million-degree LHB plasma may be responsible for the elevated ionization fractions of helium ($n_{\\rm HeII}/n_{\\rm He} \\approx 0.4$) compared to hydrogen ($n_{\\rm HII} / n_{\\rm H} \\approx 0.2$) in the local clouds. We update the stellar parameters and ionizing flux for $\\beta$ CMa, after correcting the EUV spectra for intervening HI column density, $N_{\\rm HI} = 1.9\\pm0.1\\times10^{18}~{\\rm cm}^{-2}$, and its hotter effective temperature, $T_{\\rm eff} \\approx 25,000$K vs. 21,000K for $\\epsilon$ CMa. These two stars produce a combined H-ionizing photon flux $\\Phi_{\\rm H} \\approx 6800\\pm1400$ cm$^{-2}$ s$^{-1}$ at the external surface of the local clouds. The hot bubble could produce comparable fluxes, $\\Phi_{\\rm H} =$ 2000-9000 cm$^{-2}$ s$^{-1}$, depending on the amount of metal depletion into dust grains that survive sputtering. The radial velocities and proper motions of $\\beta$ CMa and $\\epsilon$ CMa indicate that both stars passed within $10\\pm1$ pc of the Sun $4.4\\pm0.1$ Myr ago, with 100-200 times higher local ionizing fluxes. At that time, the local clouds were likely farther from the Sun, owing to their transverse motion. Over the last few Myr, EUV radiation from these two stars left a wake of highly ionized gas in a hot, low-density cavity produced by past supernova explosions in the Sco-Cen OB association and connected with the LHB.",
      "pdf_url": "https://arxiv.org/pdf/2510.05263.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26625",
      "title": "The chemical DNA of the Magellanic Clouds IV. Unveiling extreme element production: the Eu abundance in the Small Magellanic Cloud",
      "authors": [
        "Samuele Anoardo",
        "Alessio Mucciarelli",
        "Marco Palla",
        "Lorenzo Santarelli",
        "Carmela Lardo",
        "Donatella Romano"
      ],
      "abstract": "The chemical DNA of the Magellanic Clouds IV. Unveiling extreme element production: the Eu abundance in the Small Magellanic Cloud Samuele Anoardo, Alessio Mucciarelli, Marco Palla, Lorenzo Santarelli, Carmela Lardo, Donatella Romano 9 pages, 7 figures. Accepted for publication in Astronomy and Astrophysics Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) In this study we investigate the chemical enrichment of the rapid neutron-capture process in the Small Magellanic Cloud (SMC). We measure [Eu/Fe] abundance ratios in 209 giant stars that are confirmed members of the SMC, providing the first extensive dataset of Eu abundances in this galaxy across its full metallicity range, spanning more than 1.5 dex. We compare Eu abundances with those of Mg and Ba to evaluate the efficiency of the r-process relative to $\\alpha$-capture and s-process nucleosynthesis. The SMC shows enhanced [Eu/Fe] values at all metallicities (comparable with the values measured in the Milky Way), with a clear decline as [Fe/H] increases (from $\\sim$ -1.75 dex to $\\sim$ -0.5 dex), consistent with the onset of Type Ia supernovae. In contrast, [Eu/Mg] is enhanced by about +0.5 dex at all [Fe/H], significantly above the values observed in Milky Way stars, where [Eu/Mg] remains close to solar, reflecting comparable production of r-process and $\\alpha$-capture elements. Moreover, [Ba/Eu] increases with metallicity, beginning at [Fe/H] $\\approx$ -1.5 dex, namely at a lower metallicity with respect to the Milky Way, where [Ba/Eu] starts to increase around [Fe/H] $\\approx$ -1 dex. Our findings suggest the SMC has a higher production of Eu (with respect to the $\\alpha$-elements) than the Milky Way but in line with what observed in other dwarf systems within the Local Group. We confirm that galaxies with star formation efficiencies lower than the Milky Way have high [Eu/$\\alpha$], probably indicating a stronger efficiency of the delayed sources of r-process at low metallicities.",
      "pdf_url": "https://arxiv.org/pdf/2510.26625.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04843",
      "title": "JWST provides a new view of cosmic dawn: latest developments in studies of early galaxies",
      "authors": [
        "Jorryt Matthee"
      ],
      "abstract": "JWST provides a new view of cosmic dawn: latest developments in studies of early galaxies Jorryt Matthee Original manuscript of an invited review to be published by Taylor & Francis in Contemporary Physics in Winter 2025. 34 pages, 18 figures Astrophysics of Galaxies (astro-ph.GA) Studies of the distant Universe are providing key insights into our understanding of the formation of galaxies. The advent of the James Webb Space Telescope (JWST) has significantly enhanced our observational capabilities, leading to an expanded redshift frontier, providing unprecedented detail in the characterization of early galaxies and enabling the discovery of new populations of accreting black holes. This review aims to provide an introduction to the basic processes and components that shape the observed spectra of galaxies, with a focus on their relevance to techniques with which high-redshift galaxies are selected. The review further introduces specific topics that have attracted significant attention in recent literature, including the discovery of highly efficient galaxy formation in the early Universe, the relation between galaxies and the process of reionization, new insights into the formation of the first stars and the enrichment of interstellar gas with heavy elements, and breakthroughs in our understanding of the origins of supermassive black holes.",
      "pdf_url": "https://arxiv.org/pdf/2511.04843.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.17447",
      "title": "Cepheid Metallicity in the Leavitt Law (C--MetaLL) survey: VII. Metallicity dependence of Period-Wesenheit relations based on a homogeneous spectroscopic sample",
      "authors": [
        "V. Ripepi",
        "E. Trentin",
        "G. Catanzaro",
        "M. Marconi",
        "A. Bhardwaj",
        "G. Clementini",
        "F. Cusano",
        "G. De Somma",
        "R. Molinaro",
        "T. Sicignano",
        "J. Storm"
      ],
      "abstract": "Cepheid Metallicity in the Leavitt Law (C--MetaLL) survey: VII. Metallicity dependence of Period-Wesenheit relations based on a homogeneous spectroscopic sample V. Ripepi, E. Trentin, G. Catanzaro, M. Marconi, A. Bhardwaj, G. Clementini, F. Cusano, G. De Somma, R. Molinaro, T. Sicignano, J. Storm 12 Pages + appendices. Submitted to A&A. New version including referee comments Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The C-MetaLL project has provided homogeneous spectroscopic abundances of 290 Classical Cepheids (DCEPs) for which we have the intensity-averaged magnitudes in multiple optical and near-infrared (NIR) bands, periods, pulsation modes, and Gaia parallaxes. Our goal is to derive updated period--Wesenheit--metallicity (PWZ) relations using the largest and most homogeneous metallicity sample ever used for such analyses, covering a range of $-1.3<$[Fe/H]$<+0.3$ dex. We computed several optical and NIR Wesenheit magnitudes using 275 DCEPs with reliable parallaxes, by applying a robust photometric parallax technique, which simultaneously fits all parameters -- including the global Gaia parallax counter-correction -- and handles outliers without data rejection. We find a stronger metallicity dependence ($\\gamma \\approx -0.5$ mag/dex in optical, $-0.4$ mag/dex in NIR) than recent literature reports. Gaia parallax zero-point conter-corrections ($\\epsilon$) vary smoothly across bands, with an average value of $\\sim$10 $\\mu$as, aligning with previous determinations. Applying our PWZ relations to LMC Cepheids yields distances generally consistent within $1\\sigma$ with geometric estimates. The choice of reddening law has a negligible impact, while using only fundamental-mode pulsators significantly increases the uncertainties. Including $\\alpha$-element corrections increases $|\\gamma|$ and reduces $\\epsilon$. However, we find statistically consistent $\\gamma$ values with the literature, particularly for the key Wesenheit magnitude in the HST bands, by restricting the sample to the brighter (i.e. closer) objects, or by including only pulsators with $-0.7<$[Fe/H]$<$0.2 dex. Our results hint at a large $\\gamma$ or a non-linear dependence on metallicity of DCEP luminosities at the metal-poor end, which is difficult to quantify with the precision of parallaxes of the present dataset.",
      "pdf_url": "https://arxiv.org/pdf/2508.17447.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08675",
      "title": "The binary landscape of massive stars at low $Z$: Insights from the BLOeM Campaign",
      "authors": [
        "J. I. Villaseñor",
        "H. Sana",
        "J. Bodensteiner",
        "N. Britavskiy",
        "L. R. Patrick",
        "T. Shenar",
        "the BLOeM Collaboration"
      ],
      "abstract": "The binary landscape of massive stars at low $Z$: Insights from the BLOeM Campaign J. I. Villaseñor, H. Sana, J. Bodensteiner, N. Britavskiy, L. R. Patrick, T. Shenar, the BLOeM Collaboration 5 pages, 5 figures, IAU Symposium 402 proceedings \"Massive Stars Across Redshifts in the Era of JWST and Large-Scale Surveys\" Solar and Stellar Astrophysics (astro-ph.SR) We present an overview of our recent results from the BLOeM campaign in the Small Magellanic Cloud ($Z=0.2\\,{\\rm Z}_{\\odot}$). Using nine-epoch VLT/FLAMES spectroscopy, we investigated the multiplicity of 929 massive stars. Our findings reveal contrasting binary properties across evolutionary stages: O-type stars show an intrinsic close-binary fraction of $70\\%$, and early B-type dwarfs/giants reach ${\\sim80}\\%$, exceeding higher-metallicity samples. In contrast, B0-B3 supergiants drop to ${\\sim40}\\%$, and A-F supergiants to ${\\sim8}\\%$; intrinsic variability likely inflates the latter, so the true multiplicity may be lower. OBe stars display distinct binary properties consistent with a post-interaction origin. These results have profound implications for massive-star evolution at low metallicity, including the production of exotic transients, gravitational-wave progenitors, and ionising radiation in the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2511.08675.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.08726",
      "title": "3D MHD simulations of coronal loops heated via magnetic braiding I. Continuous driving",
      "authors": [
        "Gabriele Cozzo",
        "Paola Testa",
        "Juan Martinez-Sykora",
        "Fabio Reale",
        "Paolo Pagano",
        "Franco Rappazzo",
        "Viggo Hansteen",
        "Bart De Pontieu",
        "Antonino Petralia",
        "Edoardo Alaimo",
        "Federico Fiorentino",
        "Fabio D'Anca",
        "Luisa Sciortino",
        "Michela Todaro",
        "Ugo Lo Cicero",
        "Marco Barbera"
      ],
      "abstract": "3D MHD simulations of coronal loops heated via magnetic braiding I. Continuous driving Gabriele Cozzo, Paola Testa, Juan Martinez-Sykora, Fabio Reale, Paolo Pagano, Franco Rappazzo, Viggo Hansteen, Bart De Pontieu, Antonino Petralia, Edoardo Alaimo, Federico Fiorentino, Fabio D'Anca, Luisa Sciortino, Michela Todaro, Ugo Lo Cicero, Marco Barbera Solar and Stellar Astrophysics (astro-ph.SR) The nature and detailed properties of the heating of the million-degree solar corona are important issues that are still largely unresolved. Nanoflare heating might be dominant in active regions and quiet Sun, although direct signatures of such small-scale events are difficult to observe in the highly conducting, faint corona. The aim of this work is to test the theory of coronal heating by nanoflares in braided magnetic field structures. We analyze a 3D MHD model of a multistrand flux tube in a stratified solar atmosphere, driven by twisting motions at the boundaries. We show how the magnetic structure is maintained at high temperature and for an indefinite time, by intermittent episodes of local magnetic energy release due to reconnection. We forward-modelled optically thin emission with SDO/AIA and MUSE and compared the synthetic observations with the intrinsic coronal plasma properties, focusing on the response to impulsive coronal heating. Currents build up and their impulsive dissipation into heat are also investigated through different runs. In this first paper, we describe the proliferation of heating from the dissipation of narrow current sheets in realistic simulations of braided coronal flux tubes at unprecedented high spatial resolutions.",
      "pdf_url": "https://arxiv.org/pdf/2511.08726.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08730",
      "title": "3D MHD simulations of coronal loops heated via magnetic braiding II. Automatic detection of reconnection outflows and statistical analysis of their properties",
      "authors": [
        "Gabriele Cozzo",
        "Paola Testa",
        "Juan Martinez-Sykora",
        "Paolo Pagano",
        "Fabio Reale",
        "Franco Rappazzo",
        "Viggo Hansteen",
        "Bart De Pontieu"
      ],
      "abstract": "3D MHD simulations of coronal loops heated via magnetic braiding II. Automatic detection of reconnection outflows and statistical analysis of their properties Gabriele Cozzo, Paola Testa, Juan Martinez-Sykora, Paolo Pagano, Fabio Reale, Franco Rappazzo, Viggo Hansteen, Bart De Pontieu Solar and Stellar Astrophysics (astro-ph.SR) Recent observations of fast and bursty ``nanojets'' suggest novel diagnostics of nanoflare heating in the solar corona. The aim of this work is to investigate the presence and properties of reconnection outflows, similar to observed nanojets, in numerical simulations, and explore their relationship with the nanoflare properties. This work explores their potential as diagnostics for nanoflare heating in observations. We developed an algorithm of Reconnection Outflows Automatic Detection (ROAD) in 3D MHD simulations of coronal loops. We applied the algorithm to a 3D MHD stratified coronal loop model heated by magnetic reconnection and analyzed the statistical properties of the jets produced at reconnection sites, over about one solar hour. The magnetic structure is maintained at high temperature and for an indefinite time by intermittent episodes of local magnetic energy release due to reconnection.",
      "pdf_url": "https://arxiv.org/pdf/2511.08730.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08816",
      "title": "JWST Reveals Carbon-rich Chemistry in a Transitional Disk",
      "authors": [
        "M. Volz",
        "C. C. Espaillat",
        "C. V. Pittman",
        "S. L. Grant",
        "T. Thanathibodee",
        "M. McClure",
        "B. Tabone",
        "N. Calvet",
        "F. M. Walter"
      ],
      "abstract": "JWST Reveals Carbon-rich Chemistry in a Transitional Disk M. Volz, C. C. Espaillat, C. V. Pittman, S. L. Grant, T. Thanathibodee, M. McClure, B. Tabone, N. Calvet, F. M. Walter Accepted to AJ on November 11, 2025. 26 pages, 13 figures, 8 tables Solar and Stellar Astrophysics (astro-ph.SR) We present JWST-MIRI Medium Resolution Spectrometer (MRS) observations of the Classical T Tauri stars GM Aur and RX J1615.3-3255 (J1615), both hosting transitional disks. Despite their similar stellar and disk properties, the two systems differ strikingly in their carbon-bearing molecular emission. Using local thermodynamic equilibrium (LTE) slab models to analyze spectral lines within the 13.6-17.7 micron wavelength range, we find that J1615 exhibits strong emission from H2O, HCN, C2H2, 12CO2, 13CO2, OH, and 13C12CH2, whereas GM Aur shows only H2O and OH. We measure the accretion rates of both objects using contemporaneous optical spectra and find that J1615's accretion rate is lower than that of GM Aur. We constrain the properties of the dust in both disks using SED modeling and find elevated amounts of crystalline silicates and larger dust grains in the disk of J1615. The enhanced carbon emission in J1615 may result from a combination of lower accretion rate and larger and more processed dust grains in the inner disk, conditions that together may allow carbon-rich gas to persist and be detected. These results expand the sample of protoplanetary disks around solar-mass stars with strong CO2 and C2H2 emission and identify J1615 as a carbon-rich transitional disk, providing new insights into the chemical diversity of planet-forming environments.",
      "pdf_url": "https://arxiv.org/pdf/2511.08816.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08862",
      "title": "CoronaGraph Instrument Reference stars for Exoplanets (CorGI-REx) I. Preliminary Vetting and Implications for the Roman Coronagraph and Habitable Worlds Observatory",
      "authors": [
        "Justin Hom",
        "Schuyler G. Wolff",
        "Catherine A. Clark",
        "David R. Ciardi",
        "Sarah J. Deveny",
        "Steve B. Howell",
        "Alexandra Z. Greenbaum",
        "Colin Littlefield",
        "Ramya M. Anche",
        "Vanessa P. Bailey",
        "Wolfgang Brandner",
        "Gaël Chauvin",
        "Julien H. Girard",
        "Brian Kern",
        "Eric Mamajek",
        "Bertrand Mennesson",
        "Dmitry Savransky",
        "Karl R. Stapelfeldt",
        "Beth A. Biller",
        "Marah Brinjikji",
        "Masayuki Kuzuhara",
        "Maxwell A. Millar-Blanchaer",
        "Toshiyuki Mizuki",
        "Nicholas T. Schragal",
        "Macarena C. Vega-Pallauta",
        "Jason J. Wang",
        "Robert J. De Rosa",
        "Ewan S. Douglas",
        "Bruce Macintosh",
        "Jingwen Zhang",
        "the Roman Coronagraph Community Participation Program"
      ],
      "abstract": "CoronaGraph Instrument Reference stars for Exoplanets (CorGI-REx) I. Preliminary Vetting and Implications for the Roman Coronagraph and Habitable Worlds Observatory Justin Hom, Schuyler G. Wolff, Catherine A. Clark, David R. Ciardi, Sarah J. Deveny, Steve B. Howell, Alexandra Z. Greenbaum, Colin Littlefield, Ramya M. Anche, Vanessa P. Bailey, Wolfgang Brandner, Gaël Chauvin, Julien H. Girard, Brian Kern, Eric Mamajek, Bertrand Mennesson, Dmitry Savransky, Karl R. Stapelfeldt, Beth A. Biller, Marah Brinjikji, Masayuki Kuzuhara, Maxwell A. Millar-Blanchaer, Toshiyuki Mizuki, Nicholas T. Schragal, Macarena C. Vega-Pallauta, Jason J. Wang, Robert J. De Rosa, Ewan S. Douglas, Bruce Macintosh, Jingwen Zhang, the Roman Coronagraph Community Participation Program Accepted for Publication in AJ, 27 pages, 8 figures, 6 tables Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The upcoming Roman Coronagraph will be the first high-contrast instrument in space capable of high-order wavefront sensing and control technologies, a critical technology demonstration for the proposed Habitable Worlds Observatory (HWO) that aims to directly image and characterize habitable exoEarths. The nominal Roman Coronagraph observing plan involves alternating observations of a science target and a bright, nearby reference star. High contrast is achieved using wavefront sensing and control, also known as \"digging a dark hole\", where performance depends on the properties of the reference star, requiring V<3, a resolved stellar diameter <2 mas, and no stellar multiplicity. The imposed brightness and diameter criteria limit the sample of reference star candidates to high-mass main sequence and post-main sequence objects, where multiplicity rates are high. A future HWO coronagraph may have similarly restrictive criteria in reference star selection. From an exhaustive literature review of 95 stars, we identify an initial list of 40 primary and 18 reserve reference star candidates relevant to both the Roman Coronagraph and HWO. We present results from an initial survey of these candidates with high-resolution adaptive optics imaging and speckle interferometry and identify no new companions. We discuss the need for higher-contrast observations to sufficiently vet these reference star candidates prior to Roman Coronagraph observations along with the implications of reference star criteria on observation planning for Roman and HWO.",
      "pdf_url": "https://arxiv.org/pdf/2511.08862.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08891",
      "title": "Measuring the magnetic fields in the chromospheres of low-mass stars",
      "authors": [
        "Tianqi Cang",
        "Pascal Petit",
        "Jean-François Donati",
        "Hui Tian",
        "Jianning Fu",
        "Hao Li",
        "Stefano Bellotti",
        "Xueying Hu",
        "Xiaoyu Ma",
        "Arturo Lopez Ariste",
        "Keyu Xing",
        "Julien Morin",
        "Hongpeng Lu",
        "Weikai Zong"
      ],
      "abstract": "Measuring the magnetic fields in the chromospheres of low-mass stars Tianqi Cang, Pascal Petit, Jean-François Donati, Hui Tian, Jianning Fu, Hao Li, Stefano Bellotti, Xueying Hu, Xiaoyu Ma, Arturo Lopez Ariste, Keyu Xing, Julien Morin, Hongpeng Lu, Weikai Zong 12 figs, 3 tabs, accepted by Nature Communications Solar and Stellar Astrophysics (astro-ph.SR) Magnetic fields in the upper atmospheres of solar-like stars are believed to provide an enormous amount of energy to power the hot coronae and drive large-scale eruptions that could impact the habitability of planetary systems around these stars. However, these magnetic fields have never been routinely measured on stars beyond the solar system. Through decade-long spectropolarimetric observations, we have now achieved the measurements of magnetic fields in the lower and middle chromospheres of three M-dwarfs. Our results indicate that the line-of-sight component of the chromospheric magnetic fields can reach up to hundreds of Gauss, whose sign frequently opposes that of the photospheric field. The measurements highlight the magnetic field complexity and the variation with height close to the surface of these M-dwarfs. They provide critical constraints on the energy budget responsible for heating and eruptions of stellar upper atmospheres, and enable assessments of how stellar magnetic activity may affect exoplanet environments.",
      "pdf_url": "https://arxiv.org/pdf/2511.08891.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08970",
      "title": "JW-Flare: Accurate Solar Flare Forecasting Method Based on Multimodal Large Language Models",
      "authors": [
        "Mingfu Shao",
        "Hui Wang",
        "Yuyang Li",
        "Jiaben Lin",
        "Jifeng Liu",
        "Baolin Tan",
        "Juan Guo",
        "Yin Zhang",
        "Jing Huang",
        "Jiangtao Su",
        "Yingzi Sun",
        "Haiqing Xu",
        "Jie Chen",
        "Suo Liu",
        "Yuanyong Deng",
        "Liyue Tong",
        "Yang Bai",
        "Cunshi Wang",
        "Kaifan Ji",
        "Yuqing Zhou"
      ],
      "abstract": "JW-Flare: Accurate Solar Flare Forecasting Method Based on Multimodal Large Language Models Mingfu Shao, Hui Wang, Yuyang Li, Jiaben Lin, Jifeng Liu, Baolin Tan, Juan Guo, Yin Zhang, Jing Huang, Jiangtao Su, Yingzi Sun, Haiqing Xu, Jie Chen, Suo Liu, Yuanyong Deng, Liyue Tong, Yang Bai, Cunshi Wang, Kaifan Ji, Yuqing Zhou Solar and Stellar Astrophysics (astro-ph.SR) Solar flares, the most powerful explosive phenomena in the solar system, may pose significant hazards to spaceborne satellites and ground-based infrastructure. Despite decades of intensive research, reliable flare prediction remains a challenging task. Large Language Models, as a milestone in artificial intelligence, exhibit exceptional general knowledge and next-token prediction capabilities. Here we introduce JW-Flare, the first Multimodal Large Language Models (MLLMs) explicitly trained for solar flare forecasting through fine-tuning on textual physic parameters of solar active regions and magnetic field images. This method demonstrates state-of-the-art (SOTA) performance for large flares prediction on the test dataset. It effectively identifies all 79 X-class flares from 18,949 test samples, yielding a True Skill Statistic (TSS) of 0.95 and a True Positive Rate (TPR) of 1.00, outperforming traditional predictive models. We further investigate the capability origins of JW-Flare through explainability experiments, revealing that solar physics knowledge acquired during pre-training contributes to flare forecasting performance. Additionally, we evaluate models of different parameter scales, confirming the Scaling_Law of Large Language Models in domain-specific applications, such as solar physics. This study marks a substantial advance in both the scale and accuracy of solar flare forecasting and opens a promising avenue for AI-driven methodologies in broader scientific domains.",
      "pdf_url": "https://arxiv.org/pdf/2511.08970.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09065",
      "title": "Models of long-period variables of the globular cluster 47 Tuc",
      "authors": [
        "Yu.A. Fadeyev"
      ],
      "abstract": "Models of long-period variables of the globular cluster 47 Tuc Yu.A. Fadeyev 11 pages, 6 figures, accepted to Astronomy Letters Solar and Stellar Astrophysics (astro-ph.SR) Stellar evolution computations were carried out for stars with a main sequence mass $M_\\mathrm{ZAMS}=0.86M_\\odot$ and initial metal abundance $Z=0.003$ and $Z=0.004$. Selected models of evolutionary sequences were used for calculation of radial pulsations in the RGB, eAGB and TP-AGB evolutionary stages. Not all pulsating red giants of the globular cluster 47 Tuc are shown to belong to the Mira variables because the lower limit of pulsation periods at the TP-AGB stage is $\\approx 70$ day, whereas during the eAGB evolutionary stage the periods of radial oscillations range from $\\approx 5$ to $\\approx 40$ day. Periods and luminosities of hydrodynamic models of eAGB and TP--AGB pulsating stars locate along the common period-luminosity relation. Small masses of Mira variables in the globular cluster 47 Tuc ($0.54M_\\odot\\le M\\le 0.70M_\\odot$) is the main reason for irregular large-amplitude oscillations and the dynamical instability of outer stellar layers at pulsation periods $\\Pi > 200$ day.",
      "pdf_url": "https://arxiv.org/pdf/2511.09065.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09108",
      "title": "Superhot (> 30 MK) flare observations with STIX: Joint spectral fitting",
      "authors": [
        "Muriel Zoë Stiefel",
        "Natália Bajnoková",
        "Säm Krucker"
      ],
      "abstract": "Superhot (> 30 MK) flare observations with STIX: Joint spectral fitting Muriel Zoë Stiefel, Natália Bajnoková, Säm Krucker Under peer review in A&A. 12 pages, 6 figures, 1 table Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Spectroscopic analysis of large flares (>X1) in the hard X-ray (HXR) range offers unique insights into the hottest (> 30 MK) flare plasma, the so-called superhot thermal component. To manage the high count rates in large flares, an attenuator is typically placed in front of the HXR detectors. However, this significantly limits the spectral diagnostic capabilities at lower energies, and consequently, it restricts the analysis of the lower temperatures in flares. The Spectrometer/Telescope for Imaging X-rays (STIX) on board the Solar Orbiter mission was designed to observe solar flares in hard X-rays. The imaging detectors use an attenuator during periods of high flux level. In contrast, the background (BKG) detector of STIX is never covered by the attenuator and is therefore dedicated to measure the unattenuated flux using differently sized apertures placed in front of the detector. We aim to demonstrate that joint spectral fitting using different detector configurations of STIX allows us to reliably diagnose both the hot and the superhot components in large flares. We jointly fit the HXR spectra of the STIX BKG detector and the STIX imaging detectors using SUNKIT-SPEX software package to determine the spectral parameters of both the hot and superhot thermal components in solar flares. Using joint fitting on 32 STIX flares, we corroborate that for GOES X-class flares, the HXR spectrum is better represented by two thermal components instead of an isothermal component. At the temperature peak time, the superhot HXR flux above 15 keV is typically stronger than the hot HXR flux. The GOES long-wavelength channel is dominated by the hot component with a superhot contribution up to 10%. This paper demonstrates that joint spectral fitting of the same detector type with different attenuation schemes is a simple and powerful method to monitor multithermal flare plasma.",
      "pdf_url": "https://arxiv.org/pdf/2511.09108.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09289",
      "title": "Radio Burst from a Stellar Coronal Mass Ejection",
      "authors": [
        "J. R. Callingham",
        "C. Tasse",
        "R. Keers",
        "R. D. Kavanagh",
        "H. Vedantham",
        "P. Zarka",
        "S. Bellotti",
        "P. I. Cristofari",
        "S. Bloot",
        "D. C. Konijn",
        "M. J. Hardcastle",
        "L. Lamy",
        "E. K. Pass",
        "B. J. S. Pope",
        "H. Reid",
        "H. J. A. Röttgering",
        "T. W. Shimwell",
        "P. Zucca"
      ],
      "abstract": "Radio Burst from a Stellar Coronal Mass Ejection J. R. Callingham, C. Tasse, R. Keers, R. D. Kavanagh, H. Vedantham, P. Zarka, S. Bellotti, P. I. Cristofari, S. Bloot, D. C. Konijn, M. J. Hardcastle, L. Lamy, E. K. Pass, B. J. S. Pope, H. Reid, H. J. A. Röttgering, T. W. Shimwell, P. Zucca 27 pages, 4 figures, 1 table. Accepted to Nature (embargo date lifted 1600 UTC 12 November 2025) Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Coronal mass ejections (CMEs) are massive expulsions of magnetised plasma from a star, and are the largest contributors to space weather in the Solar System. CMEs are theorized to play a key role in planetary atmospheric erosion, especially for planets that are close to their host star. However, such a conclusion remains controversial as there has not been an unambiguous detection of a CME from a star outside of our Sun. Previous stellar CME studies have only inferred the presence of a CME through the detection of other types of stellar eruptive events. A signature of a fast CME is a Type II radio burst, which is emitted from the shock wave produced as the CME travels through the stellar corona into interplanetary space. Here we report an analogue to a Type II burst from the early M dwarf StKM 1-1262. The burst exhibits identical frequency, time, and polarisation properties to fundamental plasma emission from a solar Type II burst. We demonstrate the rate of such events with similar radio luminosity from M dwarfs are 0.84$^{+1.94}_{-0.69} \\times$10$^{-3}$ per day per star. Our detection implies that we are no longer restricted to extrapolating the solar CME kinematics and rates to other stars, allowing us to establish the first observational limits on the impact of CMEs on exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2511.09289.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09296",
      "title": "Occurrence rate of stellar Type II radio bursts from a 100 star-year search for coronal mass ejections",
      "authors": [
        "David C. Konijn",
        "Harish K. Vedantham",
        "Cyril Tasse",
        "Timothy W. Shimwell",
        "Martin J. Hardcastle",
        "Joseph R. Callingham",
        "Ekaterina Ilin",
        "Alexander Drabent",
        "Philippe Zarka",
        "Floris F.S. van der Tak",
        "Sanne Bloot"
      ],
      "abstract": "Occurrence rate of stellar Type II radio bursts from a 100 star-year search for coronal mass ejections David C. Konijn, Harish K. Vedantham, Cyril Tasse, Timothy W. Shimwell, Martin J. Hardcastle, Joseph R. Callingham, Ekaterina Ilin, Alexander Drabent, Philippe Zarka, Floris F.S. van der Tak, Sanne Bloot 13 pages, 10 figures, 2 tables. Accepted for publication in Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Coronal mass ejections (CMEs) are major drivers of space weather in the Solar System, but their occurrence rate on other stars is unknown. A characteristic (deca-)metric radio burst with a time-frequency drift, known as a Type II radio burst, is a key observational signature of CMEs. We searched a total of 107 years of stellar data using time-frequency spectra that targeted all known stars within 100 parsecs in the LOFAR Two Metre Sky Survey (LoTSS) up to May 2023. This resulted in the largest unbiased search for circularly polarised stellar Type II metric radio bursts to date, with a typical 3$\\sigma$ sensitivity of 2.5 mJy for an integration time of 1 minute. We detected two drifting stellar radio bursts: the published 2-minute burst from the M dwarf StKM 1-1262 and a new 13-minute burst from the M dwarf LP 215-56. The new burst is characterised by a drift rate of $-0.060^{+0.002}_{-0.002}$ MHz s$^{-1}$, an average Stokes V flux density of $-4.5^{+1.4}_{-1.3}$ mJy, and a temporal duration of $63^{+31}_{-11}$ seconds. We constrained the occurrence rate of drifting stellar bursts by calculating Poisson upper and lower limits based on the two drifting bursts. We also fitted a cumulative burst luminosity distribution to the data using the burst detections and the non-detections; this yielded a power law index ($\\alpha$) of $-0.7^{+0.9}_{-0.6}$ and a normalisation point (N) of one burst per year with $E>6.8\\times10^{13}$ erg s$^{-1}$ Hz$^{-1}$. We find an agreement between this and the cumulative luminosity distribution of decametric SOHO/LASCO solar Type II data ($\\alpha = -0.81 \\pm 0.06 \\pm 0.02$), which suggests that the current scarcity of detected stellar Type II bursts is likely due to limited sensitivity rather than to the intrinsic rarity of these events. Additionally, we identify 19 circularly polarised stellar radio bursts without a time-frequency drift.",
      "pdf_url": "https://arxiv.org/pdf/2511.09296.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09312",
      "title": "A magnetic field study of two fast-rotating, radio bright M dwarfs. StKM 1-1262 and V374 Peg",
      "authors": [
        "S. Bellotti",
        "P.I. Cristofari",
        "J.R. Callingham",
        "J. Morin",
        "P.Petit",
        "A.A. Vidotto",
        "M. Jardine",
        "L. Arnold",
        "R.D. Kavanagh",
        "J. Llama",
        "H. Vedantham"
      ],
      "abstract": "A magnetic field study of two fast-rotating, radio bright M dwarfs. StKM 1-1262 and V374 Peg S. Bellotti, P.I. Cristofari, J.R. Callingham, J. Morin, P.Petit, A.A. Vidotto, M. Jardine, L. Arnold, R.D. Kavanagh, J. Llama, H. Vedantham 18 pages, 16 figures, 4 tables, accepted in Astronomy & Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) Radio observations at low frequencies are sensitive to the magnetic activity of stars and the plasma environment surrounding them. The accurate interpretation of the processes underlying the radio signatures requires a detailed characterisation of the stellar magnetism. We study two M dwarfs, StKM 1-1262 (M0 type, P$_\\mathrm{rot}=1.24$ d) and V374 Peg (M4 type, P$_\\mathrm{rot}=0.4455$ d), which were detected with the LOw Frequency ARray (LOFAR). StKM 1-1262 exhibited a type-II radio burst, potentially resulting from a coronal mass ejection event. V374 Peg manifested low-frequency radio emission typical of an electron-cyclotron maser instability emission mechanism. We analysed spectropolarimetric observations of these M dwarfs collected with the SpectroPolarimètre InfraRouge (SPIRou). Firstly, we refined the stellar parameters such as effective temperature, surface gravity, and metallicity, and measured the average surface magnetic flux via modelling of Zeeman broadening in unpolarised spectra. We then applied Zeeman-Doppler imaging to least-squares deconvolution line profiles in circular polarisation to reconstruct their large-scale magnetic fields. StKM 1-1262 has a total, unsigned magnetic field of $3.53\\pm0.06$ kG on average and the large-scale magnetic field topology is dipolar and moderately axisymmetric, with an average strength of 300 G. V374 Peg has an unsigned magnetic field of $5.46\\pm0.09$ kG and the large-scale field is dipolar and axisymmetric, with an average strength of 800 G. For StKM 1-1262, we found a strong anti-correlation between the total magnetic field and the effective temperature which is reminiscent of the tight link between small-scale magnetic fields and surface inhomogeneities. For V374 Peg, we found a moderate anti-correlation, possibly due to a more even distribution of surface features. (Abridged)",
      "pdf_url": "https://arxiv.org/pdf/2511.09312.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09496",
      "title": "Collisions in a system of conical jet/counterjet outflows",
      "authors": [
        "A. C. Raga",
        "Z. Meliani",
        "A. Rodríguez-González",
        "S. Cabrit",
        "G. Pineau des Forêts",
        "J.I. Castorena",
        "A. Esquivel"
      ],
      "abstract": "Collisions in a system of conical jet/counterjet outflows A. C. Raga, Z. Meliani, A. Rodríguez-González, S. Cabrit, G. Pineau des Forêts, J.I. Castorena, A. Esquivel 16 pages, 5 figures, paper in press Solar and Stellar Astrophysics (astro-ph.SR) Stars predominantly form in compact, non-hierarchical clusters. The gas outflows ejected by protostars can intersect and interact with each other, resulting in complex interactions that affect the dynamics, morphology, and evolution of these outflows. Determining the probability of an encounter between them requires a Bayesian approach that considers the collimation, length (or age), and separation between young stellar objects in the clusters. In this study, we employ a Monte Carlo approach to estimate this probability as a function of the jet opening angle and the ratio between the jet length and the separation between stars. We propose a function that predicts the number of interactions within a cluster based on the opening angle of the gas outflows ejected by protostars.",
      "pdf_url": "https://arxiv.org/pdf/2511.09496.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01167",
      "title": "Discovery of Seven Cold and Distant Brown Dwarfs with JWST RUBIES",
      "authors": [
        "Sara J. Morrissey",
        "Adam J. Burgasser",
        "Anna de Graaff",
        "Ian McConachie",
        "Gabriel Brammer"
      ],
      "abstract": "Discovery of Seven Cold and Distant Brown Dwarfs with JWST RUBIES Sara J. Morrissey (UCSD, Notre Dame), Adam J. Burgasser (UCSD), Anna de Graaff (MPIA, Harvard SAO), Ian McConachie (U. Wisconsin-Madison), Gabriel Brammer (Cosmic Dawn Center, University of Copenhagen) 34 pages, 7 figures; accepted to AJ Solar and Stellar Astrophysics (astro-ph.SR) We report near-infrared spectral model fits to seven distant L- and T-type dwarfs observed with the JWST Near Infrared Spectrograph (NIRSpec) as part of the Red Unknowns: Bright Infrared Extragalactic Survey (RUBIES). Comparison of 0.9-2.5 $\\mu$m near-infrared spectra of these sources to spectral standards indicates spectral types spanning L1 to T8 and spectrophotometric distances spanning 800-3,000 pc. Fits to three grids of spectral models yield atmosphere parameters and spectrophotometric distances largely consistent with our classifications, although fits to L dwarf spectra indicate missing components to the models. Three of our sources have vertical displacements from the Galactic plane exceeding 1~kpc, and have high probabilities of membership in the Galactic thick disk population. Of these, the L dwarf RUBIES-BD-3 (RUBIES-EGS-3081) is well-matched to subdwarf standards, while the early T dwarf RUBIES-BD-5 (RUBIES-UDS-170428) is best fit by metal-poor atmosphere models; both may be a thick disk or halo brown dwarfs. We critically examine the 1-5 $\\mu$m spectra of the current sample of 1-2 kpc mid- and late-T dwarfs, finding that temperature, surface gravity, metallicity, and vertical mixing efficiency can all contribute to observed variations in near-infrared spectral structure and the strength of the 4.2 $\\mu$m CO band. This work aims to guide ongoing JWST, Euclid, and other space-based spectral surveys that are expected to uncover thousands of low-temperature stars and brown dwarfs throughout the Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2511.01167.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03894",
      "title": "Second Generation Planet Formation in Post-AGB Discs: Testing the Role of Gravitational Instability",
      "authors": [
        "Ali Pourmand",
        "Devika Kamath",
        "Orsola De Marco",
        "Mark Wardle"
      ],
      "abstract": "Second Generation Planet Formation in Post-AGB Discs: Testing the Role of Gravitational Instability Ali Pourmand, Devika Kamath, Orsola De Marco, Mark Wardle Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Post-asymptotic giant branch (post-AGB) binary stars are evolved systems that host circumbinary discs formed through mass loss during late stage binary interactions. Their structural, morphological, kinematic, and chemical similarities to planet-forming discs suggest that these systems may act as sites of \"second generation\" planet formation. In this study, we assess whether the disc instability mechanism -- a proposed pathway for rapid, giant planet formation in some protoplanetary discs - can operate in post-AGB discs; motivated by their short lifetimes. Using the Toomre criterion under well motivated assumptions for disc structure and size, mass, and thermal properties, we assess the conditions for gravitational instability. We first benchmark our analytical framework using well studied protoplanetary disc systems (including HL Tauri, Elias 2-27, GQ Lupi) before applying the same analysis to observed post-AGB discs. We find that post-AGB discs are generally gravitationally stable at present, due primarily to their low masses. Using viscous disk theory, we find that the discs were stable against collapse even in the past, when their masses were potentially higher. In contrast, several protoplanetary discs analysed in the same way show that they likely experienced gravitationally unstable phases early on. We also find that higher viscosity parameters are better aligned with expected post-AGB disc lifetimes. Finally, we revisit the planet formation scenario proposed for the post-common envelope system NN Ser, first carried out by Schleicher and Dreizler and we show that gravitational instability could be feasible under specific, high disc mass assumptions. Overall, our results provide the first systematic theoretical assessment of gravitational instability in post-AGB discs, demonstrating that this mechanism is unlikely to dominate second generation planet formation in these systems.",
      "pdf_url": "https://arxiv.org/pdf/2509.03894.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12535",
      "title": "Using simultaneous mass accretion and external photoevaporation rates for d203-504 to constrain disc evolution processes",
      "authors": [
        "Gavin A. L. Coleman",
        "Thomas J. Haworth",
        "Ilane Schroetter",
        "Olivier Berné"
      ],
      "abstract": "Using simultaneous mass accretion and external photoevaporation rates for d203-504 to constrain disc evolution processes Gavin A. L. Coleman, Thomas J. Haworth, Ilane Schroetter, Olivier Berné Accepted for publication in MNRAS. 15 pages, 10 figures Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We cannot understand planet formation without understanding disc evolutionary processes. However, there is currently ambiguity about how protoplanetary discs transport angular momentum (e.g. via viscosity or winds) and the relative contributions and interplay of different dispersal mechanisms. A key difficulty is that for any given system only a handful of disc parameters are usually available to constrain theoretical models. Recent observations of the d203-504 disc in Orion, have yielded values of the stellar accretion rate, external photoevaporative mass loss rate, stellar mass and the disc size and mass. In particular, having the combination of accretion rate and external photoevaporative rate is new. Using this unique combination of observables, we run a suite of disc evolution simulations to constrain which scenarios can match the observed values. We explore both viscous and MHD wind-driven discs, finding that they best match observations when the angular momentum transport $\\alpha$ parameter is $3\\times10^{-4}\\leq\\alpha_{\\nu}\\leq2\\times10^{-3}$ for viscous discs, and $2\\times10^{-3}\\leq\\alpha_{\\rm DW}\\leq10^{-2}$ for MHD wind-driven discs, consistent with other estimates in the literature. As well constraining the disc properties and evolution, the d203-504 disc allows us to define a new irradiation age, since in order to match observations, it was required that the disc had only just appeared in the extreme UV environment it is currently exposed to (a known issue for proplyds referred to as the proplyd lifetime problem). This indicates that it is either very young, i.e. <0.1 Myr, or it has been shielded until recently, which would have protected the planet forming reservoir and helped facilitate planet growth despite it now residing in a harsh UV environment.",
      "pdf_url": "https://arxiv.org/pdf/2510.12535.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08886",
      "title": "Mock Observations for the CSST Mission: CPI-C -- Instrument Simulation",
      "authors": [
        "Gang Zhao",
        "Yiming Zhu",
        "Jiangpei Do",
        "Yili Chen",
        "Zhonghua Lv",
        "Bingli Niu",
        "Zhaojun Yan",
        "Bo Ma",
        "Ran Li"
      ],
      "abstract": "Mock Observations for the CSST Mission: CPI-C -- Instrument Simulation Gang Zhao, Yiming Zhu, Jiangpei Do, Yili Chen, Zhonghua Lv, Bingli Niu, Zhaojun Yan, Bo Ma, Ran Li 18 pages, 9 figures, accepted by Research in Astronomy and Astrophysics Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) To support the development of the data processing pipeline and the scientific performance assessment for the Cool Planet Imaging Coronagraph (CPI-C) on the China Space Station Telescope (CSST), we have developed the end-to-end instrument simulation program, CPISM. This paper details the core modules of CPISM that simulate the CPI-C instrument, focusing on the simulation of the high-contrast imaging optical system and the visible-band science camera. We modeled key optical components, such as the transmission apodizing filter, the wavefront corrector, and the focal plane mask using the HCIPy package. A $10^{-8}$ contrast dark hole region, consistent with design specifications, was simulated using the Electric Field Conjugation (EFC) optimization method, and broadband observation effects were considered. For the science camera, which is an electron multiplying charge-coupled device (EMCCD), we established a detailed model encompassing photon collection, charge transfer, electron multiplication (EM), and readout processes, based on test data. This model simulates complex instrumental features including dark current, charge transfer efficiency, clock-induced charge, multiplication noise factor, and various readout effects like striping and drift. We also proposed and validated an improved statistical model for the EM process to enhance simulation efficiency. CPISM can generate simulated images containing rich instrumental details, closely similar to the expected real observational data, thus laying the foundation for the development and verification of CPI-C data processing algorithms and preparations for future scientific research.",
      "pdf_url": "https://arxiv.org/pdf/2511.08886.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08898",
      "title": "Low-Frequency Noise Performance of Microstrip-Coupled Lumped-Element Aluminum KIDs using Hydrogenated Amorphous Silicon Parallel-Plate Capacitors for NEW-MUSIC",
      "authors": [
        "Simon Hempel-Costello",
        "Andrew D. Beyer",
        "Dan Cunnane",
        "Peter K. Day",
        "Fabien Defrance",
        "Cliff Frez",
        "Adriana Gavidia",
        "Sunil R. Golwala",
        "Junhan Kim",
        "Jean-Marc Martin",
        "Yann Sadou",
        "Jack Sayers",
        "Shibo Shu",
        "Shiling Yu"
      ],
      "abstract": "Low-Frequency Noise Performance of Microstrip-Coupled Lumped-Element Aluminum KIDs using Hydrogenated Amorphous Silicon Parallel-Plate Capacitors for NEW-MUSIC Simon Hempel-Costello, Andrew D. Beyer, Dan Cunnane, Peter K. Day, Fabien Defrance, Cliff Frez, Adriana Gavidia, Sunil R. Golwala, Junhan Kim, Jean-Marc Martin, Yann Sadou, Jack Sayers, Shibo Shu, Shiling Yu Instrumentation and Methods for Astrophysics (astro-ph.IM) We present measurements of the low-frequency noise of microstrip-coupled, lumped-element aluminum kinetic inductance detectors that use hydrogenated amorphous silicon parallel-plate capacitors (Al/a-Si:H MS-PPC-LEKIDs), which are under development for the Next-generation Extended Wavelength Multiband Submillimeter Inductance Camera (NEW-MUSIC). We show that, under dark conditions, these devices are generation recombination (GR) noise dominated down to 0.1 Hz and, under optical load, they are likely dominated by GR and photon noise down to tenths of a Hz and possibly lower, both in spite of the use of a-Si:H PPCs. Our measurements set limits on the low-frequency two-level-system (TLS) noise of the a-Si:H material that are consistent with higher frequency measurements in the 0.1-10 kHz regime. These results establish that our MS-PPC-LEKID design for NEW-MUSIC will be photon-noise-limited under a range of observing conditions and, more generally, that a-Si:H PPC-KIDs are a viable new detector technology for even low modulation-rate applications such as astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2511.08898.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08959",
      "title": "Improved Modeling of Quasi-Static Thermal and Optical Response of Lumped-Element Aluminum Manganese KIDs",
      "authors": [
        "Adriana Gavidia",
        "Sunil Golwala",
        "Andrew D. Beyer",
        "Daniel Cunnane",
        "Peter K. Day",
        "Fabien Defrance",
        "Clifford F. Frez",
        "Xiaolan Huang",
        "Junhan Kim",
        "Jean-Marc Martin",
        "Jack Sayers",
        "Shibo Shu",
        "Shiling Yu",
        "Yann Sadou"
      ],
      "abstract": "Improved Modeling of Quasi-Static Thermal and Optical Response of Lumped-Element Aluminum Manganese KIDs Adriana Gavidia, Sunil Golwala, Andrew D. Beyer, Daniel Cunnane, Peter K. Day, Fabien Defrance, Clifford F. Frez, Xiaolan Huang, Junhan Kim, Jean-Marc Martin, Jack Sayers, Shibo Shu, Shiling Yu, Yann Sadou Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) We report on the optical characterization of the AlMn kinetic inductance detectors (KIDs) in development for use in the Next-generation Extended Wavelength-MUltiband Sub/millimeter Inductance Camera (NEW-MUSIC) on the Leighton Chajnantor Telescope (LCT). NEW-MUSIC will cover 80-420 GHz, split into six spectral bands, with polarimetry. This broad spectral coverage will enable study of a range of scientific topics such as the accretion and feedback in galaxies and galaxy cluster evolution via the Sunyaev-Zeldovich effect, the transient synchrotron emission from the explosive deaths of massive stars and other time-domain phenomena, and dusty sources from low to high redshift (with polarization). Al KIDs have already been demonstrated for bands 2-5. AlMn KIDs will be used for the 90~GHz band, as Al's pair-breaking energy is too high. However, AlMn has only barely been explored as a KID material. To this end, we first improved the modeling techniques used for Al KIDs within BCS theory by eliminating the use of analytical approximations for the expressions of the complex conductivity and found these changes reduced fit parameter degeneracy in the analysis of AlMn. Then, we tested the addition of a gap smearing parameter, a standard extension to BCS theory in use for high kinetic inductance materials, and found it did not improve the fits.",
      "pdf_url": "https://arxiv.org/pdf/2511.08959.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08990",
      "title": "Design of a Six-band, 2.4-Octave (80--420 GHz) Hierarchically Summed Phased-Array Slot-Dipole Antenna Array for NEW-MUSIC",
      "authors": [
        "Xiaolan Huang",
        "Shibo Shu",
        "Miao Li",
        "Sunil R. Golwala",
        "Feng Liu"
      ],
      "abstract": "Design of a Six-band, 2.4-Octave (80--420 GHz) Hierarchically Summed Phased-Array Slot-Dipole Antenna Array for NEW-MUSIC Xiaolan Huang, Shibo Shu, Miao Li, Sunil R. Golwala, Feng Liu Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Experiment (hep-ex); Instrumentation and Detectors (physics.ins-det) The Next-generation Extended Wavelength Multi-band Sub/millimeter Inductance Camera (NEW-MUSIC), located on the Leighton Chajnantor Telescope (LCT), will be the first six-band trans-millimeter wave polarimeter. This paper proposes a broadband, hierarchical phased-array antenna with integrated band-defining filters necessary to realize NEW-MUSIC. It covers a spectral bandwidth of 2.4 octaves from 80~GHz to 420~GHz, a frequency range ideal for studying trans-millimeter emission from a range of time-domain sources, using the Sunyaev-Zeldovich effects to study hot plasmas in galaxy clusters and galaxies, and to observe dusty sources, from star-forming regions in our galaxy to high-redshift dusty, star-forming galaxies. To achieve these goals, three groups of superconducting lumped-element on-chip low-pass/band-pass filter-banks were designed to hierarchically sum the superconducting, broadband, non-resonant, slot-dipole antenna arrays and band-pass filter the trans-mm light before outputting it on microstripline to detectors (KIDs in the case of NEW-MUSIC).",
      "pdf_url": "https://arxiv.org/pdf/2511.08990.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09027",
      "title": "Evolution of the radio source position uncertainties in radio astrometric catalogs over the past three decades",
      "authors": [
        "Zinovy Malkin"
      ],
      "abstract": "Evolution of the radio source position uncertainties in radio astrometric catalogs over the past three decades Zinovy Malkin Accepted for publication in Research in Astronomy and Astrophysics Instrumentation and Methods for Astrophysics (astro-ph.IM) In this paper, progress in improving the coordinates uncertainty of extragalactic radio sources derived from astrometric and geodetic VLBI observations is investigated. For this purpose, 30 catalogs of radio source positions computed in 1997-2025 were analyzed. Over these years, the median source position uncertainty represented by the semi-major axis of the error ellipse for 467 sources in common to all catalogs improved by one order of magnitude: from 0.156 mas to 0.015 mas. It was also found that the improvement in the position uncertainty over time follows a power law with high accuracy. The number of observations used for determination of the coordinates of the common sources in the input catalogs increased over time from 1.3 to 14.4 million, also following a power law. A discussion of the results led us to the conclusion that the number of observations is the primary factor in improving the source positions uncertainty compared to the number of sessions in which the source was observed.",
      "pdf_url": "https://arxiv.org/pdf/2511.09027.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09074",
      "title": "Mock Observations for the CSST Mission: HSTDM--Synthetic Data Generation",
      "authors": [
        "SiYuan Tan",
        "Yan Gong",
        "YiPing Ao",
        "WenYin Duan",
        "YiLong Zhang",
        "ZhenHui Lin",
        "Xuan Zhang",
        "Yong Shi",
        "Jing Tang",
        "Jing Li",
        "RuiQing Mao",
        "Sheng-Cai Shi"
      ],
      "abstract": "Mock Observations for the CSST Mission: HSTDM--Synthetic Data Generation SiYuan Tan, Yan Gong, YiPing Ao, WenYin Duan, YiLong Zhang, ZhenHui Lin, Xuan Zhang, Yong Shi, Jing Tang, Jing Li, RuiQing Mao, Sheng-Cai Shi Instrumentation and Methods for Astrophysics (astro-ph.IM) The High Sensitivity Terahertz Detection Module (HSTDM), a key component of the backend modules on board the China Space Station Telescope (CSST), will offer great opportunities for the discovery of Terahertz Astronomy, with implications that extend well beyond China to the global astronomical this http URL is imperative that the raw data collected by HSTDM undergoes meticulous calibration and processing through the HSTDM data processing pipeline (HSTDM pipeline for short) to ensure the accuracy and effectiveness of the final science data to be archived for further this http URL process necessitates that the HSTDM pipeline address instrumental artifacts and effects as well as the coordination of data flow of the scheduled observing sequences under all observing modes of HSTDM within the CSST automated processing this http URL the understanding of CSST HSTDM data processing develops during the pipeline development stage, it becomes essential to assess the accuracy, the robustness and the performance of the HSTDM pipeline under all observing modes of HSTDM so that components of the HSTDM pipeline be rationally added, removed, amended or extended within the modular this http URL this paper, we develop practical simulation methods to facilitate this need. The contribution of synthetic data generation of HSTDM observation includes two parts: 1. HSTDM instrumental effect simulation based on both real testing profiles and simulated models; 2. Observing data flow generation based on HSTDM observing mode scenario. The simulation methods have been implemented and shown to be practical in testing the HSTDM pipeline during the development stage.",
      "pdf_url": "https://arxiv.org/pdf/2511.09074.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09107",
      "title": "Detection of Lensed Gravitational Waves from dark matter halos with deep learning",
      "authors": [
        "Mengfei Sun",
        "Jie Wu",
        "Jin Li",
        "Nan Yang",
        "Xianghe Ma",
        "Borui Wang",
        "Minghui Zhang",
        "Yuanhong Zhong"
      ],
      "abstract": "Detection of Lensed Gravitational Waves from dark matter halos with deep learning Mengfei Sun, Jie Wu, Jin Li, Nan Yang, Xianghe Ma, Borui Wang, Minghui Zhang, Yuanhong Zhong Instrumentation and Methods for Astrophysics (astro-ph.IM) Lensed gravitational waves (GWs) provide a new window into the study of dark matter substructures, yet the faint interference signatures they produce are buried in detector noise. To address this challenge, we develop a deep learning framework based on a residual one-dimensional convolutional neural network for lensed GW identification under multiband observations. The model directly processes multiband waveforms from binary neutron star systems, covering the early inspiral observed by the DECi-hertz Interferometer Gravitational wave Observatory (DECIGO) and the late inspiral observed by the Einstein Telescope (ET), corresponding approximately to the wave-optics and geometrical-optics regimes, respectively. It enables end-to-end classification of five classes: pure noise, unlensed GWs, and three representative lensed GWs corresponding to singular isothermal sphere (SIS), cored isothermal sphere (CIS), and Navarro-Frenk-White (NFW) profiles. A dataset of 10^6 simulated samples was constructed with signal-to-noise ratios (SNR) ranging from 5 to 100. The deep learning model with multiband observations achieves an accuracy of 97.0% and a macro-averaged F1 score of 0.97, significantly exceeding the single-detector performance, where DECIGO and ET reach 72.8% and 62.3%, respectively. Even in the low-SNR regime (SNR < 20), the model maintains an accuracy above 63%, while in the high-SNR regime (SNR > 80), its accuracy approaches 99.8%. These results demonstrate that multiband GW observations effectively enhance the detection of lensed GWs within complex noise environments, providing a robust and efficient pathway for the automated identification of lensed GWs in future multiband observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.09107.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.09429",
      "title": "Comprehensive Study of the Lunar Energetic Particle Environment with LunPAN",
      "authors": [
        "Johannes Hulsman",
        "Elisa Alessi",
        "Leonardo Andreasi",
        "Philipp Azzarello",
        "Benedikt Bergmann",
        "Mathilda Bolis",
        "Petr Burian",
        "Franck Cadoux",
        "Michael Campbell",
        "Camilla Colombo",
        "Hugo Cintas",
        "Antoine Delille",
        "Jindra Jelinek",
        "Xavi LLorpart",
        "Hugo Santos",
        "Mikko Viitala",
        "Xin Wu"
      ],
      "abstract": "Comprehensive Study of the Lunar Energetic Particle Environment with LunPAN Johannes Hulsman, Elisa Alessi, Leonardo Andreasi, Philipp Azzarello, Benedikt Bergmann, Mathilda Bolis, Petr Burian, Franck Cadoux, Michael Campbell, Camilla Colombo, Hugo Cintas, Antoine Delille, Jindra Jelinek, Xavi LLorpart, Hugo Santos, Mikko Viitala, Xin Wu Instrumentation and Methods for Astrophysics (astro-ph.IM) LunPAN (Lunar Particle Analyzer Network) is a three-year mission proposal designed to comprehensively map the particle spectra in the lunar radiation field. It aims to provide precise measurements of Galactic Cosmic Rays (GCR), Solar Energetic Particles (SEP), and albedo particles, including charged particles, neutrons, and gamma-rays, originating from the Moon's surface. Therefore it will contribute to fundamental space physics, lunar geology sciences, space weather prediction, and radiation risk assessment for future lunar explorations. This is achieved through two state-of-the-art instruments; this http URL and NeuPix. this http URL is a compact magnetic spectrometer designed for precise measurements of penetrating charged particles, ranging from 100 MeV to 10 GeV. Based on the this http URL project, this http URL employs thin silicon pixel sensors optimized for energy resolution and particle identification. NeuPix is a hybrid active pixel sensor system capable of detecting neutrons, gamma-rays, and lower-energy charged particles between 10MeV and 100 MeV. Utilizing innovative sensor-converter combinations, NeuPix will provide spectral measurements of lunar albedo neutrons and gamma-ray fluxes. Currently, the LunPAN mission is accepted by ESA's \"Small Missions for Exploration - Destination the Moon\" call for a pre-A phase study. We will discuss mission outline and expected scientific performance of the PixPAN and NeuPix.",
      "pdf_url": "https://arxiv.org/pdf/2511.09429.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09446",
      "title": "Development of a planar cable-driven parallel robot for submillimeter and terahertz beam mapping measurements",
      "authors": [
        "Evan C. Mayer",
        "Ian N. Lowe",
        "Daniel P. Marrone",
        "James J. Bock",
        "Charles M. Bradford",
        "Victoria L. Butler",
        "Tzu-Ching Chang",
        "Yun-Ting Cheng",
        "Dongwoo T. Chung",
        "Abigail T. Crites",
        "Audrey Dunn",
        "Nicholas Emerson",
        "Clifford Frez",
        "Jonathon Hunacek",
        "Ryan P. Keenan",
        "Chao-Te Li",
        "King Lau",
        "Guochao Sun",
        "Isaac Trumper",
        "Anthony D. Turner",
        "Benjamin Vaughan",
        "Ta-Shun Wei",
        "Michael Zemcov"
      ],
      "abstract": "Development of a planar cable-driven parallel robot for submillimeter and terahertz beam mapping measurements Evan C. Mayer, Ian N. Lowe, Daniel P. Marrone, James J. Bock, Charles M. Bradford, Victoria L. Butler, Tzu-Ching Chang, Yun-Ting Cheng, Dongwoo T. Chung, Abigail T. Crites, Audrey Dunn, Nicholas Emerson, Clifford Frez, Jonathon Hunacek, Ryan P. Keenan, Chao-Te Li, King Lau, Guochao Sun, Isaac Trumper, Anthony D. Turner, Benjamin Vaughan, Ta-Shun Wei, Michael Zemcov 33 pages, 19 figures. Submitted to SPIE Journal of Astronomical Telescopes, Instruments, and Systems Instrumentation and Methods for Astrophysics (astro-ph.IM) The spatial sensitivity pattern of millimeter-wavelength receivers is an important diagnostic of performance and is affected by the alignment of coupling optics. Characterization can be challenging in the field, particularly in the decentered and tightly packed optical configurations that are employed for many astronomical millimeter-wave cameras. In this paper, we present the design and performance of a lightweight and reconfigurable beam mapper, consisting of a bank of thermal sources positioned by a planar cable-driven robot. We describe how the measurement requirements and mechanical constraints of the Tomographic Ionized-carbon Mapping Experiment (TIME) optical relay drive the design of the mapper. To quantify the positioning performance, we predict the beam patterns at each surface to derive requirements and use a non-contact computer-vision based method built on OpenCV to track the payload position with an accuracy better than 1.0 mm. We achieve an in-plane absolute payload position error of 2.7 mm (RMSE) over a $\\sim$400 mm $\\times$ 400 mm workspace and an in-plane repeatability of 0.81 mm, offering substantial improvements in accuracy and speed over traditional handheld techniques.",
      "pdf_url": "https://arxiv.org/pdf/2511.09446.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08768",
      "title": "WATSON-Net: Vetting, Validation, and Analysis of Transits from Space Observations with Neural Networks",
      "authors": [
        "M. Dévora-Pajares",
        "F.J. Pozuelos",
        "J.C. Suárez",
        "M. González-Penedo",
        "C. Dafonte"
      ],
      "abstract": "WATSON-Net: Vetting, Validation, and Analysis of Transits from Space Observations with Neural Networks M. Dévora-Pajares, F.J. Pozuelos, J.C. Suárez, M. González-Penedo, C. Dafonte Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Context. As the number of detected transiting exoplanet candidates continues to grow, the need for robust and scalable automated tools to prioritize or validate them has become increasingly critical. Among the most promising solutions, deep learning models offer the ability to interpret complex diagnostic metrics traditionally used in the vetting process. Aims. In this work, we present WATSON-Net, a new open-source neural network classifier and data preparation package designed to compete with current state-of-the-art tools for vetting and validation of transiting exoplanet signals from space-based missions. Methods. Trained on Kepler Q1-Q17 DR25 data using 10-fold cross-validation, WATSON-Net produces ten independent models, each evaluated on dedicated validation and test sets. The ten models are calibrated and prepared to be extensible for TESS data by standardizing the input pipeline, allowing for performance assessment across different space missions. Results. For Kepler targets, WATSON-Net achieves a recall-at-precision of 0.99 (R@P0.99) of 0.903, ranking second, with only the ExoMiner network performing better (R@P0.99 = 0.936). For TESS signals, WATSON-Net emerges as the best-performing non-fine-tuned machine learning classifier, achieving a precision of 0.93 and a recall of 0.76 on a test set comprising confirmed planets and false positives. Both the model and its data preparation tools are publicly available in the dearwatson Python package, fully open-source and integrated into the vetting engine of the SHERLOCK pipeline.",
      "pdf_url": "https://arxiv.org/pdf/2511.08768.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08954",
      "title": "Progress on the ALETHEIA project and new approaches to events overlap mitigation",
      "authors": [
        "Junhui Liao"
      ],
      "abstract": "Progress on the ALETHEIA project and new approaches to events overlap mitigation Junhui Liao (on behalf of the ALETHEIA collaboration) Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) The ALETHEIA project aims to search for low-mass dark matter using liquid helium (LHe)-filled time projection chambers (TPCs). While liquid argon and liquid xenon TPCs have been extensively employed in the field of direct dark matter detection, successful development of LHe TPCs has not yet been achieved. Launched in 2020, our project has made significant progress since then. These advancements have convinced us that a single-phase LHe TPC is technologically feasible. Compared to liquid xenon and liquid argon TPCs, one of the unique challenges for LHe TPCs is event overlap caused by the 13-second lifetime scintillation. We will demonstrate that this overlap can be entirely mitigated when the LHe temperature is maintained near 1.0 K. At this temperature, electron mobility is three orders of magnitude higher than at approximately 4.0 K, which is the temperature we initially proposed for the LHe TPC.",
      "pdf_url": "https://arxiv.org/pdf/2511.08954.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.08065",
      "title": "Dynamic Diffusion Schrödinger Bridge in Astrophysical Observational Inversions",
      "authors": [
        "Ye Zhu",
        "Duo Xu",
        "Zhiwei Deng",
        "Jonathan C. Tan",
        "Olga Russakovsky"
      ],
      "abstract": "Dynamic Diffusion Schrödinger Bridge in Astrophysical Observational Inversions Ye Zhu, Duo Xu, Zhiwei Deng, Jonathan C. Tan, Olga Russakovsky Accepted to NeurIPS 2025. Code available at this https URL. Updated funding information from last version Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) We study Diffusion Schrödinger Bridge (DSB) models in the context of dynamical astrophysical systems, specifically tackling observational inverse prediction tasks within Giant Molecular Clouds (GMCs) for star formation. We introduce the Astro-DSB model, a variant of DSB with the pairwise domain assumption tailored for astrophysical dynamics. By investigating its learning process and prediction performance in both physically simulated data and in real observations (the Taurus B213 data), we present two main takeaways. First, from the astrophysical perspective, our proposed paired DSB method improves interpretability, learning efficiency, and prediction performance over conventional astrostatistical and other machine learning methods. Second, from the generative modeling perspective, probabilistic generative modeling reveals improvements over discriminative pixel-to-pixel modeling in Out-Of-Distribution (OOD) testing cases of physical simulations with unseen initial conditions and different dominant physical processes. Our study expands research into diffusion models beyond the traditional visual synthesis application and provides evidence of the models' learning abilities beyond pure data statistics, paving a path for future physics-aware generative models which can align dynamics between machine learning and real (astro)physical systems.",
      "pdf_url": "https://arxiv.org/pdf/2506.08065.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.02615",
      "title": "Radio Astronomy in the Era of Vision-Language Models: Prompt Sensitivity and Adaptation",
      "authors": [
        "Mariia Drozdova",
        "Erica Lastufka",
        "Vitaliy Kinakh",
        "Taras Holotyak",
        "Daniel Schaerer",
        "Slava Voloshynovskiy"
      ],
      "abstract": "Radio Astronomy in the Era of Vision-Language Models: Prompt Sensitivity and Adaptation Mariia Drozdova, Erica Lastufka, Vitaliy Kinakh, Taras Holotyak, Daniel Schaerer, Slava Voloshynovskiy Machine Learning and the Physical Sciences Workshop, NeurIPS 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI) Vision-Language Models (VLMs), such as recent Qwen and Gemini models, are positioned as general-purpose AI systems capable of reasoning across domains. Yet their capabilities in scientific imaging, especially on unfamiliar and potentially previously unseen data distributions, remain poorly understood. In this work, we assess whether generic VLMs, presumed to lack exposure to astronomical corpora, can perform morphology-based classification of radio galaxies using the MiraBest FR-I/FR-II dataset. We explore prompting strategies using natural language and schematic diagrams, and, to the best of our knowledge, we are the first to introduce visual in-context examples within prompts in astronomy. Additionally, we evaluate lightweight supervised adaptation via LoRA fine-tuning. Our findings reveal three trends: (i) even prompt-based approaches can achieve good performance, suggesting that VLMs encode useful priors for unfamiliar scientific domains; (ii) however, outputs are highly unstable, i.e. varying sharply with superficial prompt changes such as layout, ordering, or decoding temperature, even when semantic content is held constant; and (iii) with just 15M trainable parameters and no astronomy-specific pretraining, fine-tuned Qwen-VL achieves near state-of-the-art performance (3% Error rate), rivaling domain-specific models. These results suggest that the apparent \"reasoning\" of VLMs often reflects prompt sensitivity rather than genuine inference, raising caution for their use in scientific domains. At the same time, with minimal adaptation, generic VLMs can rival specialized models, offering a promising but fragile tool for scientific discovery.",
      "pdf_url": "https://arxiv.org/pdf/2509.02615.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07878",
      "title": "FlowLensing: Simulating Gravitational Lensing with Flow Matching",
      "authors": [
        "Hamees Sayed",
        "Pranath Reddy",
        "Michael W. Toomey",
        "Sergei Gleyzer"
      ],
      "abstract": "FlowLensing: Simulating Gravitational Lensing with Flow Matching Hamees Sayed, Pranath Reddy, Michael W. Toomey, Sergei Gleyzer Instrumentation and Methods for Astrophysics (astro-ph.IM); Computer Vision and Pattern Recognition (cs.CV) Gravitational lensing is one of the most powerful probes of dark matter, yet creating high-fidelity lensed images at scale remains a bottleneck. Existing tools rely on ray-tracing or forward-modeling pipelines that, while precise, are prohibitively slow. We introduce FlowLensing, a Diffusion Transformer-based compact and efficient flow-matching model for strong gravitational lensing simulation. FlowLensing operates in both discrete and continuous regimes, handling classes such as different dark matter models as well as continuous model parameters ensuring physical consistency. By enabling scalable simulations, our model can advance dark matter studies, specifically for probing dark matter substructure in cosmological surveys. We find that our model achieves a speedup of over 200$\\times$ compared to classical simulators for intensive dark matter models, with high fidelity and low inference latency. FlowLensing enables rapid, scalable, and physically consistent image synthesis, offering a practical alternative to traditional forward-modeling pipelines.",
      "pdf_url": "https://arxiv.org/pdf/2510.07878.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.CV"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23749",
      "title": "Re-envisioning Euclid Galaxy Morphology: Identifying and Interpreting Features with Sparse Autoencoders",
      "authors": [
        "John F. Wu",
        "Michael Walmsley"
      ],
      "abstract": "Re-envisioning Euclid Galaxy Morphology: Identifying and Interpreting Features with Sparse Autoencoders John F. Wu, Michael Walmsley Authors contributed equally to this work. Accepted to NeurIPS Machine Learning and the Physical Sciences Workshop. See trained model at this https URL, HuggingFace demo at this https URL, and code at this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Sparse Autoencoders (SAEs) can efficiently identify candidate monosemantic features from pretrained neural networks for galaxy morphology. We demonstrate this on Euclid Q1 images using both supervised (Zoobot) and new self-supervised (MAE) models. Our publicly released MAE achieves superhuman image reconstruction performance. While a Principal Component Analysis (PCA) on the supervised model primarily identifies features already aligned with the Galaxy Zoo decision tree, SAEs can identify interpretable features outside of this framework. SAE features also show stronger alignment than PCA with Galaxy Zoo labels. Although challenges in interpretability remain, SAEs provide a powerful engine for discovering astrophysical phenomena beyond the confines of human-defined classification.",
      "pdf_url": "https://arxiv.org/pdf/2510.23749.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.04973",
      "title": "Bayesian network 3D event reconstruction in the Cygno optical TPC for dark matter direct detection",
      "authors": [
        "Fernando Domingues Amaro",
        "Rita Antonietti",
        "Elisabetta Baracchini",
        "Luigi Benussi",
        "Stefano Bianco",
        "Francesco Borra",
        "Cesidio Capoccia",
        "Michele Caponero",
        "Gianluca Cavoto",
        "Igor Abritta Costa",
        "Antonio Croce",
        "Emiliano Dané",
        "Melba D'Astolfo",
        "Giorgio Dho",
        "Flaminia Di Giambattista",
        "Emanuele Di Marco",
        "Giulia D'Imperio",
        "Matteo Folcarelli",
        "Joaquim Marques Ferreira dos Santos",
        "Davide Fiorina",
        "Francesco Iacoangeli",
        "Zahoor Ul Islam",
        "Herman Pessoa Lima Júnior",
        "Ernesto Kemp",
        "Giovanni Maccarrone",
        "Rui Daniel Passos Mano",
        "David José Gaspar Marques",
        "Luan Gomes Mattosinhos de Carvalhoand Giovanni Mazzitelli",
        "Alasdair Gregor McLean",
        "Pietro Meloni",
        "Andrea Messina",
        "Cristina Maria Bernardes Monteiro",
        "Rafael Antunes Nobrega",
        "Igor Fonseca Pains",
        "Emiliano Paoletti",
        "Luciano Passamonti",
        "Fabrizio Petrucci",
        "Stefano Piacentini",
        "Davide Piccolo",
        "Daniele Pierluigi",
        "Davide Pinci",
        "Atul Prajapati",
        "Francesco Renga",
        "Rita Joana Cruz Roque",
        "Filippo Rosatelli",
        "Alessandro Russo",
        "Giovanna Saviano",
        "Pedro Alberto Oliveira Costa Silva",
        "Neil John Curwen Spooner",
        "Roberto Tesauro",
        "Sandro Tomassini",
        "Samuele Torelli",
        "Donatella Tozzi"
      ],
      "abstract": "Bayesian network 3D event reconstruction in the Cygno optical TPC for dark matter direct detection Fernando Domingues Amaro, Rita Antonietti, Elisabetta Baracchini, Luigi Benussi, Stefano Bianco, Francesco Borra, Cesidio Capoccia, Michele Caponero, Gianluca Cavoto, Igor Abritta Costa, Antonio Croce, Emiliano Dané, Melba D'Astolfo, Giorgio Dho, Flaminia Di Giambattista, Emanuele Di Marco, Giulia D'Imperio, Matteo Folcarelli, Joaquim Marques Ferreira dos Santos, Davide Fiorina, Francesco Iacoangeli, Zahoor Ul Islam, Herman Pessoa Lima Júnior, Ernesto Kemp, Giovanni Maccarrone, Rui Daniel Passos Mano, David José Gaspar Marques, Luan Gomes Mattosinhos de Carvalhoand Giovanni Mazzitelli, Alasdair Gregor McLean, Pietro Meloni, Andrea Messina, Cristina Maria Bernardes Monteiro, Rafael Antunes Nobrega, Igor Fonseca Pains, Emiliano Paoletti, Luciano Passamonti, Fabrizio Petrucci, Stefano Piacentini, Davide Piccolo, Daniele Pierluigi, Davide Pinci, Atul Prajapati, Francesco Renga, Rita Joana Cruz Roque, Filippo Rosatelli, Alessandro Russo, Giovanna Saviano, Pedro Alberto Oliveira Costa Silva, Neil John Curwen Spooner, Roberto Tesauro, Sandro Tomassini, Samuele Torelli, Donatella Tozzi Eur. Phys. J. C 85, 1261 (2025) Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Experiment (hep-ex); Data Analysis, Statistics and Probability (physics.data-an) The CYGNO experiment is developing a high-resolution gaseous Time Projection Chamber with optical readout for directional dark matter searches. The detector uses a helium-tetrafluoromethane (He:CF$_4$ 60:40) gas mixture at atmospheric pressure and a triple Gas Electron Multiplier amplification stage, coupled with a scientific camera for high-resolution 2D imaging and fast photomultipliers for time-resolved scintillation light detection. This setup enables 3D event reconstruction: photomultipliers signals provide depth information, while the camera delivers high-precision transverse resolution. In this work, we present a Bayesian Network-based algorithm designed to reconstruct the events using only the photomultipliers signals, yielding a full 3D description of the particle trajectories. The algorithm models the light collection process probabilistically and estimates spatial and intensity parameters on the Gas Electron Multiplier plane, where light emission occurs. It is implemented within the Bayesian Analysis Toolkit and uses Markov Chain Monte Carlo sampling for posterior inference. Validation using data from the CYGNO LIME prototype shows accurate reconstruction of localized and extended tracks. Results demonstrate that the Bayesian approach enables robust 3D description and, when combined with camera data, further improves the precision of track reconstruction. This methodology represents a significant step forward in directional dark matter detection, enhancing the identification of nuclear recoil tracks with high spatial resolution.",
      "pdf_url": "https://arxiv.org/pdf/2506.04973.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08691",
      "title": "No TiO detected in the hot Neptune-desert planet LTT-9779 b in reflected light at high spectral resolution",
      "authors": [
        "Sophia R. Vaughan",
        "Jayne L. Birkby",
        "Natasha E. Batalha",
        "Luke T. Parker",
        "Haochuan Yu",
        "Julia V. Seidel",
        "Michael Radica",
        "Jake Taylor",
        "Laura Kreidberg",
        "Vivien Parmentier",
        "Sergio Hoyer",
        "James S. Jenkins",
        "Annabella Meech",
        "Ricardo Ramírez Reyes",
        "Lennart van Sluijs"
      ],
      "abstract": "No TiO detected in the hot Neptune-desert planet LTT-9779 b in reflected light at high spectral resolution Sophia R. Vaughan, Jayne L. Birkby, Natasha E. Batalha, Luke T. Parker, Haochuan Yu, Julia V. Seidel, Michael Radica, Jake Taylor, Laura Kreidberg, Vivien Parmentier, Sergio Hoyer, James S. Jenkins, Annabella Meech, Ricardo Ramírez Reyes, Lennart van Sluijs 20 pages, 15 figures, 7 tables. Accepted to Astronomy and Astrophysics Earth and Planetary Astrophysics (astro-ph.EP) LTT-9779 b is an inhabitant of the hot Neptune desert and one of only a few planets with a measured high albedo. Characterising the atmosphere of this world is the key to understanding what processes dominate in creating the hot Neptune desert. We aim to characterise the reflected light of LTT-9779 b at high spectral resolution to break the degeneracy between clouds and atmospheric metallicity. This is key to interpreting its mass loss history which may illuminate how it kept its place in the desert. We use the high resolution cross-correlation spectroscopy technique on four half-nights of ESPRESSO observations in 4-UT mode (16.4-m effective mirror) to constrain the reflected light spectrum of LTT-9779 b. We do not detect the reflected light spectrum of LTT-9779 b despite these data having the expected sensitivity at the level 100 ppm. Injection tests on the post-eclipse data indicate that TiO should have been detected for a range of different equilibrium chemistry models. Therefore this non-detection suggests TiO depletion in the western hemisphere however, this conclusion is sensitive to temperature which impacts the chemistry in the upper atmosphere and the reliability of the line list. Additionally, we are able to constrain the top of the western cloud deck to $P_{\\text{top, western}}<10^{-2.0}$ bar and the top of the eastern cloud deck $P_{\\text{top, eastern}}<10^{-0.5}$ bar, which is consistent with the predicted altitude of MgSiO$_3$ and Mg$_2$SiO$_4$ clouds from JWST NIRISS/SOSS. While we do not detect the reflected light spectrum of LTT-9779 b, we have verified that this technique can be used in practice to characterise the high spectral resolution reflected light of exoplanets so long as their spectra contain a sufficient number of deep spectral lines. Therefore this technique may become an important cornerstone of exoplanet characterisation with the ELT and beyond.",
      "pdf_url": "https://arxiv.org/pdf/2511.08691.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08698",
      "title": "Isolating the gravitational influence of Uranus's winds requires close passages inward of the rings",
      "authors": [
        "Christopher R. Mankovich",
        "Marzia Parisi",
        "Damon F. Landau",
        "Janosz W. Dewberry"
      ],
      "abstract": "Isolating the gravitational influence of Uranus's winds requires close passages inward of the rings Christopher R. Mankovich, Marzia Parisi, Damon F. Landau, Janosz W. Dewberry 17 pages, 9 figures, 2 tables. Accepted to PSJ, comments most welcome Earth and Planetary Astrophysics (astro-ph.EP) Close orbits by a Uranus Orbiter and Probe (UOP) could be used to deduce Uranus's multipolar gravity field to higher precision and angular degree than the J2 and J4 currently measured from ground-based ring occultations and the Voyager 2 flyby. We examine Jn sensitivity limits obtained from simulations of candidate UOP trajectories, pairing these with Uranus interior and wind models to perform retrievals from the gravity moments. We consider zonal wind profiles derived from recent feature-tracking data, assuming that zonal winds extend into the planet along cylinders, with a radial decay function similar to those that explain Jupiter and Saturn gravity. Present knowledge of J2 and J4 permits a fairly wide range of possible wind depths in Uranus, up to 1,800 km or 7% by radius. Measuring additional gravity moments is essential to separate this unknown wind depth from other interior properties of interest, but J6 is found to be too dominated by bulk rotation to be a useful probe of the wind depth. Odd moments arising from Uranus's observed north-south asymmetric flow are strong functions of the wind depth, but the usefulness of J3 is hindered by its sensitivity to present uncertainties in the wind profile. The even moment J8, or the odd moments J5 and J7, are the best probes of the depth of Uranus's winds. J8, and most likely J5 and J7, are measurable in a highly inclined orbit making >~10 pericenter passages inward of the $\\zeta$ ring, approximately 1,000-2,500 km above Uranus's cloud tops.",
      "pdf_url": "https://arxiv.org/pdf/2511.08698.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08709",
      "title": "Conservation laws in non-inertial frames and non-conservation of energy of relative motion in two-body problem",
      "authors": [
        "Roman R. Rafikov"
      ],
      "abstract": "Conservation laws in non-inertial frames and non-conservation of energy of relative motion in two-body problem Roman R. Rafikov 5 figures, submitted to MNRAS, comments welcome Earth and Planetary Astrophysics (astro-ph.EP) The dynamics of systems of multiple gravitationally interacting bodies is often studied in a frame attached to one of the objects (e.g. a central star in a planetary system). As this frame is generally non-inertial, indirect forces appear in the equations describing the motion of bodies relative to the reference object. According to the convention adopted in celestial mechanics, the associated indirect acceleration is defined to be different for every object under consideration, whereas the gravitational coupling between each body and the reference object is described via the effective two-body potential, which does not obey the equivalence principle. Here we point out that a slightly different and more physically motivated definition of the indirect acceleration provides significant benefits when interpreting relative motion in a non-inertial frame. First, the indirect acceleration ends up being the same for all objects in the system. Second, the non-conservation of momentum, angular momentum, and energy of the whole system in a non-inertial frame naturally follow from the action of the indirect acceleration on the system as an external force. We also argue that the vis viva integral of the classical two-body problem should not be interpreted as a statement of energy conservation. In fact, the energy of relative motion is not conserved due to the work done on the two-body system by the indirect force. These results can be useful for interpreting dynamics in various astrophysical contexts, in particular the physics of disc-planet coupling.",
      "pdf_url": "https://arxiv.org/pdf/2511.08709.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09188",
      "title": "Numerical Simulation of Impact Cratering and Induced Seismic Waves in Sand Targets",
      "authors": [
        "Kenji Kurosaki",
        "Masahiko Arakawa"
      ],
      "abstract": "Numerical Simulation of Impact Cratering and Induced Seismic Waves in Sand Targets Kenji Kurosaki, Masahiko Arakawa 37 pages, 13 figures, accepted for publication in Icarus Earth and Planetary Astrophysics (astro-ph.EP) Impact cratering plays a crucial role in shaping the surfaces of small bodies, satellites, and planets, providing insights into their formation and the history of the Solar System. Small bodies are often covered with low-cohesion regolith. Using sand as a model of regolith, we constructed a numerical model for simulating impact on a sand target to investigate the mechanisms of crater formation and impact-induced seismic waves. Soda-lime glass and quartz sand targets were used for comparison. The developed sand model successfully reproduced the sound velocity measured in an experimental study. Using the new sand model, the crater formation was simulated using Smoothed Particle Hydrodynamics with a material strength parameter. The crater radius and $\\pi$-scaling law derived from the numerical simulation were consistent with the experimental study. The vertical acceleration around the surface of the crater was consistent with the experimentally measured acceleration for the impact-induced seismic wave. The developed model can provide insight for predicting the size of craters on unknown small bodies.",
      "pdf_url": "https://arxiv.org/pdf/2511.09188.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09405",
      "title": "Rapid-response characterization of near-Earth asteroid 2024 YR4 during a Torino Scale 3 alert",
      "authors": [
        "Maxime Devogèle",
        "Olivier R. Hainaut",
        "Marco Micheli",
        "Petr Pravec",
        "Juan Luis Cano",
        "Francisco Ocaña",
        "Luca Conversi",
        "Nicholas Moskovitz",
        "Julia de León",
        "Zuri Gray",
        "Mikael Granvik",
        "Grigori Fedorets",
        "Jules Bourdelle de Micas",
        "Simone Ieva",
        "Elisabetta Dotto",
        "Tracie Beuden",
        "Carson Fuls",
        "Teddy Kareta",
        "Stefano Bagnulo",
        "Maria Antonella Barucci",
        "Mirel Birlan",
        "Andrea Farina",
        "Kamil Hornoch",
        "Petr Fatka",
        "Peter Kušnirák",
        "Francesca Ferri",
        "Marcello Fulchignoni",
        "Monica Lazzarin",
        "Fiorangela La Forgia",
        "Elena Mazzotta Epifani",
        "Alessandra Mura",
        "Davide Perna",
        "Philippe Bendjoya",
        "Jean-Pierre Rivet",
        "Alberto Cellino"
      ],
      "abstract": "Rapid-response characterization of near-Earth asteroid 2024 YR4 during a Torino Scale 3 alert Maxime Devogèle, Olivier R. Hainaut, Marco Micheli, Petr Pravec, Juan Luis Cano, Francisco Ocaña, Luca Conversi, Nicholas Moskovitz, Julia de León, Zuri Gray, Mikael Granvik, Grigori Fedorets, Jules Bourdelle de Micas, Simone Ieva, Elisabetta Dotto, Tracie Beuden, Carson Fuls, Teddy Kareta, Stefano Bagnulo, Maria Antonella Barucci, Mirel Birlan, Andrea Farina, Kamil Hornoch, Petr Fatka, Peter Kušnirák, Francesca Ferri, Marcello Fulchignoni, Monica Lazzarin, Fiorangela La Forgia, Elena Mazzotta Epifani, Alessandra Mura, Davide Perna, Philippe Bendjoya, Jean-Pierre Rivet, Alberto Cellino Earth and Planetary Astrophysics (astro-ph.EP) On 27 December 2024, near-Earth object (NEO) 2024 YR$_4$ was discovered by the ATLAS survey and identified as a virtual impactor. A few weeks later, it eventually reached level 3 on the Torino Scale and was the first and only asteroid to be ever classified at that level. Here we report an intensive observational campaign combining time-series photometry in the visible, broadband visible and near-infrared colors, and low-resolution visible reflectance spectroscopy to assess its physical properties. Fourier analysis of the lightcurves yields a synodic rotation period of $P = 19.46341 \\pm 0.00008$ min, placing 2024 YR$_4$ among the fast rotators, even if such rotation is common for objects of similar $H$ magnitude. Its visible and near-infrared colors and spectra are most consistent with an Sq or K taxonomic classification, though some ambiguity remains. Finally, its phase curve exhibits a notably shallow slope ($G = 0.51 \\pm 0.11$), from which we derive an absolute magnitude of $H_\\mathrm{R} = 23.82\\pm0.09$ mag. After color correction and taking into account other models for the phase function, we report an absolute magnitude of $H_\\mathrm{V} = 24.14\\pm0.25$ mag. These characterizations, rotation period, taxonomy, and surface properties, would have been crucial for risk assessment and mitigation planning had the initially high impact probability scenario been confirmed, underscoring the importance for planetary defense of a rapid, coordinated international response.",
      "pdf_url": "https://arxiv.org/pdf/2511.09405.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09481",
      "title": "Adsorption and condensation of molecules on astrophysical dust grain surfaces: Ab-initio calculalations and kinetic Monte Carlo simulations",
      "authors": [
        "Lile Wang",
        "Feng Long",
        "Haifeng Yang",
        "Ruobing Dong",
        "Shenzhen Xu"
      ],
      "abstract": "Adsorption and condensation of molecules on astrophysical dust grain surfaces: Ab-initio calculalations and kinetic Monte Carlo simulations Lile Wang, Feng Long, Haifeng Yang, Ruobing Dong, Shenzhen Xu 14 pages, 5 figures, submitted to ApJ Earth and Planetary Astrophysics (astro-ph.EP) The adsorption of volatile molecules onto dust grain surfaces fundamentally influences dust-related processes, including condensation of gas-phase molecules, dust coagulation, and planet formation in protoplanetary disks. Using advanced {\\it ab-initio} density functional theory with r$^2$SCAN+rVV10 van der Waals functionals, we calculate adsorption energies of H$_2$, H$_2$O, and CO on carbonaceous (graphene, amorphous carbon) and silicate (MgSiO$_3$) surfaces. Results reveal fundamentally different adsorption mechanisms: weak physisorption on carbonaceous surfaces ($|\\Delta\\epsilon_{\\rm ad}|\\sim 0.1-0.2~{\\rm eV}$) versus strong chemisorption on silicates ($|\\Delta\\epsilon_{\\rm ad}|\\sim 0.5-1.5~{\\rm eV}$) via coordination bonds. Kinetic Monte Carlo simulations incorporating these energies demonstrate divergent surface evolution: carbonaceous grains exhibit distinct condensation radius compared to silicates, while the cocrystal of H$_2$O and CO significantly increases the desorption temperature of CO. The actual radii of gas-phase molecule depletion could thus be a comprehensive result of temperatures, chemical compositions, and even evolution tracks. Meanwhile, silicates maintain chemisorbed molecular coatings throughout most disk regions. Such dichotomy in surface coverage could also provide a natural mechanism for carbon depletion in inner planetary systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.09481.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09489",
      "title": "Global Distribution of the Key Species on the Surface of Europa",
      "authors": [
        "Jiazheng Li",
        "Yinsi Shou",
        "Cheng Li",
        "Xianzhe Jia"
      ],
      "abstract": "Global Distribution of the Key Species on the Surface of Europa Jiazheng Li, Yinsi Shou, Cheng Li, Xianzhe Jia Jiazheng Li et al 2025 ApJ 993 122 Earth and Planetary Astrophysics (astro-ph.EP) The icy surface of Europa is continuously bombarded by ions and electrons from Jupiter's magnetosphere. The bombardment of the particles dissociates water molecules on the surface of Europa and introduces impurities to the icy surface. Such processes lead to the generation of the non-water species on the surface of Europa. Such processes lead to the generation of the nonwater species on the surface of Europa. These chemical species are closely related to the chemistry of the icy crust and the subsurface ocean, as well as Europa's habitability. However, our knowledge of the global distribution of these species is limited due to the sparse satellite and telescope observations on Europa. In this study, we combine a Europa plasma model and a chemical-transport model to simulate the global distribution of the key nonwater species on the surface of Europa. The initial results from our model agree well with the existing observations on the distributions of H2SO4 and SO2 but they show a significant discrepancy with the observed distribution of H2O2. Sensitivity tests on the reaction rate coefficients indicate that the simulated global distribution of all three species fit the observations well if the reaction rate coefficients in the ice are reduced by one order of magnitude. This finding provides a useful constraint on the rate coefficient of the chemical reactions in the ice. Furthermore, our model predicts that the O2 on the surface ice of Europa is concentrated on the leading hemisphere. The simulated global distribution of the key species on Europa may provide useful guidance for future missions to Europa, such as Europa Clipper and JUICE.",
      "pdf_url": "https://arxiv.org/pdf/2511.09489.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08624",
      "title": "Abiogenesis on Different Star Types; a Dissipative Photochemical Perspective",
      "authors": [
        "Andrés Ledesma",
        "Karo Michaelian"
      ],
      "abstract": "Abiogenesis on Different Star Types; a Dissipative Photochemical Perspective Andrés Ledesma, Karo Michaelian Biological Physics (physics.bio-ph); Earth and Planetary Astrophysics (astro-ph.EP) The thermodynamic dissipation theory for the origin of life asserts a thermodynamic imperative for the origin of life, suggesting that the fundamental molecules of life originated as self-organized molecular photon dissipative structures (chromophores or pigments) that proliferated over the ocean surface to absorb and dissipate into heat the Archean solar soft UV-C (205-285 nm) and UV-B light ($<$320 nm) of our G-type star. Shorter wavelength hard UV-C light ($<$205 nm) may, depending on atmospheric conditions, have reached Earth's surface and ionized and dissociated or otherwise degraded these carbon-based pigment molecules (as probably occurred on Mars after losing most of its atmosphere). Here we assess the possibility for an abiogenesis of life similar to ours through molecular photon dissipative structuring on planets similar to early Earth but orbiting different star types at distances normalized to the solar constant. Emission spectra of star types are analyzed to determine the ratio of integrated photon fluxes in the soft UV-C wavelength (dissipative structuring) to hard UV-C wavelength (degradation) regions. Our analysis suggests that star types favorable to the dissipative structuring of life, potentially evolving towards complex life forms such as bacteria, are only the F, G and high mass K-types, with intelligent life only possible on G-type stars. Low mass K and M-type stars are highly unlikely to harbor life. Biosignatures related to the thermodynamic imperative of photon dissipation are proposed.",
      "pdf_url": "https://arxiv.org/pdf/2511.08624.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}