{
  "date": "2025-09-26",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.CO",
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.IM"
  ],
  "total_papers": 95,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2509.19466",
      "title": "Where did heavy binaries go? Gravitational-wave populations using Delaunay triangulation with optimized complexity",
      "authors": [
        "Rodrigo Tenorio",
        "Alexandre Toubiana",
        "Tristan Bruel",
        "Davide Gerosa",
        "Jonathan R. Gair"
      ],
      "abstract": "Where did heavy binaries go? Gravitational-wave populations using Delaunay triangulation with optimized complexity Rodrigo Tenorio, Alexandre Toubiana, Tristan Bruel, Davide Gerosa, Jonathan R. Gair High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We investigate the joint mass-redshift evolution of the binary black hole merger rate in the latest gravitational-wave detection catalog, GWTC-4.0. We present and apply a novel non-parametric framework for modeling multi-dimensional, correlated distributions based on Delaunay triangulation. Crucially, the complexity of the model -- namely, the number, positions, and weights of triangulation nodes -- is inferred directly from the data, resulting in a highly efficient approach that requires about one to two orders of magnitude fewer parameters and significantly less calibration than current state-of-the-art methods. We find no evidence for a peak at $M_{\\mathrm{tot}} \\sim 70\\,\\mathrm{M}_{\\odot}$ at low redshift ($z \\sim 0.2$), where it would correspond to the $m_1 \\sim 35\\,\\mathrm{M}_{\\odot}$ feature reported in redshift-independent mass spectrum analyses, and we infer an increased merger rate at high redshift $(z \\sim 1)$ around those masses, compatible with such a peak. We discuss the astrophysical implications of these results.",
      "pdf_url": "https://arxiv.org/pdf/2509.19466.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.19799",
      "title": "Jet-driven explosion of an accretion-induced white-dwarf collapse via a magnetorotational dynamo",
      "authors": [
        "Luciano Combi",
        "Daniel M. Siegel",
        "Brian D. Metzger"
      ],
      "abstract": "Jet-driven explosion of an accretion-induced white-dwarf collapse via a magnetorotational dynamo Luciano Combi, Daniel M. Siegel, Brian D. Metzger High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The accretion-induced collapse (AIC) of a rotating white dwarf (WD) offers a potential site of millisecond pulsars/magnetars, gamma-ray bursts, and r-process nucleosynthesis. We present three-dimensional general-relativistic magneto-hydrodynamical simulations including neutrinos of magnetorotational AIC, assuming the WD is rapidly spinning with a weak magnetic field confined below its surface (likely a prerequisite for rapid rotation). Within milliseconds after core bounce, the magnetic field is exponentially amplified near the surface of the proto-neutron star (PNS). We witness the emergence of a small-scale turbulent and mean-field, large-scale MRI-driven dynamo in the neutrino-cooled centrifugally supported disk formed around the PNS, which generates bundles of large-scale toroidal field with alternating polarity. The amplified field becomes buoyant and is advected above the PNS, generating a magnetic tower that drives a mildly relativistic striped jet. The jet breaks out of the WD, clearing the way for a powerful magnetized neutron-rich wind from the disk. Although our simulation cannot follow the long-term Kelvin-Helmholtz cooling phase of the PNS, the conditions are ripe for the formation of a GRB powered by magnetar spin-down. A similar dynamo may operate in magnetorotational core-collapse supernovae and neutron-star mergers.",
      "pdf_url": "https://arxiv.org/pdf/2509.19799.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19899",
      "title": "Calibration-independent consistency test of DESI DR2 BAO and SNIa",
      "authors": [
        "Bikash R. Dinda",
        "Roy Maartens",
        "Chris Clarkson"
      ],
      "abstract": "Calibration-independent consistency test of DESI DR2 BAO and SNIa Bikash R. Dinda, Roy Maartens, Chris Clarkson Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate the consistency between DESI DR2 BAO and three SNIa datasets, Pantheon+, Union3, and DES-Y5. Our consistency test is {calibration}-independent since it is independent of cosmological nuisance parameters such as the absolute peak magnitude $M_B$ and the comoving sound horizon at the baryon drag epoch $r_d$. {This could reduce some systematics in the observed data, if present}. Importantly, the test is also model-agnostic, independent of any model of dark energy or modified gravity. We define a tension parameter to quantify tension across different datasets compared to DESI DR2 BAO. The Pantheon+ and Union3 data have tension $\\lesssim\\! 1\\sigma$ across their redshift ranges, whereas the DES-Y5 tension is $\\gtrsim3\\sigma$ near $z=1$. This hints that DES-Y5 data has significant offset values for redshifts close to 1, compared to the other SNIa datasets. Since this consistency test is independent of cosmological nuisance parameters, the tension is minimal: other consistency tests involving differences in nuisance parameters may show greater tension.",
      "pdf_url": "https://arxiv.org/pdf/2509.19899.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20309",
      "title": "Big Bang Nucleosynthesis constraints on $f(T,L_m)$ gravity",
      "authors": [
        "Daniel F.P. Cruz",
        "David S. Pereira",
        "Francisco S.N. Lobo",
        "José P. Mimoso"
      ],
      "abstract": "Big Bang Nucleosynthesis constraints on $f(T,L_m)$ gravity Daniel F.P. Cruz, David S. Pereira, Francisco S.N. Lobo, José P. Mimoso Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this work, we investigate Big Bang Nucleosynthesis (BBN) within the framework of $f(T,{L}_m)$ gravity, where the gravitational Lagrangian is generalized as a function of the torsion scalar $T$ and the matter Lagrangian ${L}_m$. We analyze three representative $f(T,{L}_m)$ models and derive constraints on their free parameters, $\\alpha$ and $\\beta$, by combining observational bounds from the freeze-out temperature with the primordial abundances of deuterium, helium-4, and lithium-7. For each model, the parameter space consistent with all elemental $Z$-constraints and the freeze-out condition is determined. These results demonstrate that $f(T,{L}_m)$ modifications can accommodate the tight observational constraints of BBN, suggesting that minimal extensions to the matter sector provide viable alternatives to the standard cosmological description and offer a promising framework for exploring modified gravity in the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2509.20309.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.10532",
      "title": "Parity violation in framework of nonmetricity gravity",
      "authors": [
        "Zhiyuan Yu",
        "Zhengsheng Yang",
        "Taotao Qiu"
      ],
      "abstract": "Parity violation in framework of nonmetricity gravity Zhiyuan Yu, Zhengsheng Yang, Taotao Qiu Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The latest observational data of Planck satellite shows nontrivial value of polarization rotation angle caused by cosmic birefringence in the early universe. Moreover, the asymmetry of baryons versus anti-baryons still remains mysterious. Both of them indicates that there should be hidden new physics such as fundamental symmetry breaking. In this paper, we try to interpret these two events in framework of nonmetricity modified gravity. We introduce an interaction term between nonmetricity-based function and matter current, and calculate both the rotation angle and baryon-to-photon ratio. We also constrain the model parameters using the current observational data. With some specific examples, we demonstrate that in nonmetricity gravity theory, these two events can be interpreted in a unified way. Nevertheless, the minimal coupling of nonmetricity scalar and the matter current might not be favored.",
      "pdf_url": "https://arxiv.org/pdf/2508.10532.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.06145",
      "title": "Equation of State Extrapolation Systematics: Parametric vs. Nonparametric Inference of Neutron Star Structure",
      "authors": [
        "Bhaskar Biswas"
      ],
      "abstract": "Equation of State Extrapolation Systematics: Parametric vs. Nonparametric Inference of Neutron Star Structure Bhaskar Biswas High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th) The equation of state (EOS) of cold dense matter is a central open problem in nuclear astrophysics. Its inference is hindered by the lack of \\textit{ab initio} control above about twice nuclear saturation density, requiring extrapolation. Parametric schemes such as piecewise polytropes (PP) are efficient but restrictive, while nonparametric approaches like Gaussian processes (GP) allow more flexibility at the cost of larger prior volumes. We extend our hybrid EOS framework by replacing the high-density polytropic extension with a GP representation of the squared sound speed, anchored at low densities by the SLy crust EOS and a nuclear meta-model constrained by $\\chi$EFT and laboratory data. Using hierarchical Bayesian analysis, we jointly constrain the EOS and neutron star mass distribution with multi-messenger observations, including NICER radii, GW170817 and GW190425 tidal deformabilities, pulsar masses, and neutron skin experiments. We examine four scenarios defined by high-density extrapolation (PP vs.\\ GP) and hotspot geometry in the NICER modeling of PSR~J0030$+$0451 (ST+PDT vs.\\ PDT-U). GP extrapolations generally yield softer EOS posteriors with broader uncertainties. Hotspot assumptions also play an important role, shifting inferred mass--radius relations. Bayesian evidence strongly favors the ST+PDT geometry over PDT-U under both extrapolations, while GP is mildly preferred over PP. These results underscore the impact of observational modeling and EOS extrapolation on neutron star inferences, and show that a GP-based extension offers a robust way to quantify systematic uncertainties in high-density matter.",
      "pdf_url": "https://arxiv.org/pdf/2509.06145.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19462",
      "title": "Gravitational Waves from Hyperbolic Encounters of Primordial Black Holes in Dwarf Galaxies",
      "authors": [
        "Tadeo D. Gòmez-Aguilar",
        "Encieh Erfani",
        "N. M. Jimènez Cruz"
      ],
      "abstract": "Gravitational Waves from Hyperbolic Encounters of Primordial Black Holes in Dwarf Galaxies Tadeo D. Gòmez-Aguilar, Encieh Erfani, N. M. Jimènez Cruz Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We investigate the stochastic gravitational wave background (SGWB) generated by primordial black holes (PBHs) in the dense cores of dwarf galaxies (DGs), considering both hierarchical binary black hole (BBH) mergers and close hyperbolic encounters (CHEs). Extending our previous merger framework, we incorporate up to four successive generations of PBHs within a Hubble time and quantify the GW emission from both channels. Our results show that while BBHs dominate the total emission, CHEs occur earlier, provide the first GW signals, and contribute a continuous though subdominant background that becomes relatively more significant once the initial PBH population is depleted and binary formation is suppressed. We compute the resulting SGWB spectra, demonstrating that BBHs and CHEs imprint distinct frequency dependencies consistent with analytical expectations. We then compare the predicted signals with the sensitivity of observatories such as LISA, DECIGO, ET, IPTA, and SKA. The numerical implementation is publicly available at \\href{this https URL}.",
      "pdf_url": "https://arxiv.org/pdf/2509.19462.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.19494",
      "title": "Testing the Constancy of Type Ia Supernova Luminosities with Gaussian Process",
      "authors": [
        "Akshay Rana"
      ],
      "abstract": "Testing the Constancy of Type Ia Supernova Luminosities with Gaussian Process Akshay Rana 14 Pages, 04 Figures, Under review Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Data Analysis, Statistics and Probability (physics.data-an); Methodology (stat.ME) Type Ia supernovae (SNe~Ia) are central to studies of cosmic expansion, under the assumption that their absolute magnitude $M_B$ does not evolve with redshift. Even small drifts in brightness can bias cosmological parameters such as $H_0$ and $w$. Here we test this assumption using a non-parametric Gaussian Process (GP) reconstruction of the expansion history from cosmic chronometer $H(z)$ data, which provides a model-independent baseline distance modulus, $\\mu_{\\rm GP}(z)$. To propagate uncertainties, we draw Monte Carlo realizations of $H(z)$ from the GP posterior and evaluate them on a Chebyshev grid, which improves numerical stability and quadrature accuracy. Supernova observations are then compared to this baseline through residuals, $\\Delta M_B(z)$, and their derivatives. Applying this method to Pantheon+ (1701 SNe~Ia) and DES 5YR (435 SNe~Ia), we find that SNe~Ia are consistent with being standard candles within $1\\sigma$, though both datasets exhibit localized departures: near $z \\sim 1$ in Pantheon+ and at $z \\sim 0.3$--$0.5$ in DES. The presence of similar features in two independent surveys suggests they are not purely statistical. Our results point toward a possible non-monotonic luminosity evolution, likely reflecting different physical drivers at different epochs, and highlight the need for a deeper astrophysical understanding of SN~Ia populations.",
      "pdf_url": "https://arxiv.org/pdf/2509.19494.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "stat.ME"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19514",
      "title": "Nulling baryonic feedback in weak lensing surveys using cross-correlations with fast radio bursts",
      "authors": [
        "Calvin Leung",
        "Josh Borrow",
        "Kiyoshi W. Masui",
        "Shion Andrew",
        "Kai-Feng Chen",
        "Joop Schaye",
        "Matthieu Schaller"
      ],
      "abstract": "Nulling baryonic feedback in weak lensing surveys using cross-correlations with fast radio bursts Calvin Leung, Josh Borrow, Kiyoshi W. Masui, Shion Andrew, Kai-Feng Chen, Joop Schaye, Matthieu Schaller Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Baryonic feedback is a leading contaminant in studying dark matter and cosmology using cosmic shear. This has meant omitting much of the data during cosmological inference, or forward-modeling the spatial distribution of gas around dark matter halos using analytical or hydrodynamical models for baryonic feedback, which introduces nuisance parameters and model dependence. We propose a novel method of ``baryon nulling'' using cross-correlations between shear maps and fast radio burst (FRB) dispersion measures. By directly subtracting the dark matter--dispersion measure cross-correlation, the sensitivity of our nulled power spectra to feedback effects can be significantly reduced without any explicit feedback modeling. Using the FLAMINGO suite of hydrodynamic simulations, whose power spectra span a wide yet realistic range of feedback variations, we demonstrate that our method reduces sensitivity to feedback modeling at $k \\approx 1$ Mpc$^{-1}$ by about an order of magnitude. This points toward a strong synergy between the next generation of sensitive FRB surveys such as CHORD and the DSA-2000, and cosmic shear surveys such as Rubin, Euclid, and Roman.",
      "pdf_url": "https://arxiv.org/pdf/2509.19514.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19842",
      "title": "DARKSKIES: A suite of super-sampled zoom-in simulations of galaxy clusters with self-interacting dark matter",
      "authors": [
        "David Harvey",
        "Yves Revaz",
        "Matthieu Schaller",
        "Aurel Schneider",
        "Ethan Tregidga",
        "Felix Vecchi"
      ],
      "abstract": "DARKSKIES: A suite of super-sampled zoom-in simulations of galaxy clusters with self-interacting dark matter David Harvey, Yves Revaz, Matthieu Schaller, Aurel Schneider, Ethan Tregidga, Felix Vecchi Accepted in Astronomy and Astrophysics Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present the \"DARKSKIES\" suite of one hundred, zoom-in hydrodynamic simulations of massive ($M_{200}>5\\times10^{14}{\\rm M}_\\odot)$ galaxy clusters with self-interacting dark matter (SIDM). We super-sample the simulations such that $m_{\\rm DM}/m_{\\rm gas}\\sim0.1$, enabling us to simulate a dark matter particle mass of $m=0.68\\times10^{8}M_\\odot$ an order of magnitude faster, whilst exploring SIDM in the core of clusters at extremely high resolution. We calibrate the baryonic feedback to produce observationally consistent and realistic galaxy clusters across all simulations and simulate five models of velocity-independent SIDM targeting the expected sensitivity of future telescopes - $\\sigma_{\\rm DM}/m=0.,0.01,0.05,0.1,0.2$ cm$^2$/g. We find the density profiles exhibit the characteristic core even in the smallest of cross-sections, with cores developing only at late times ($z<0.5$). We investigate the dynamics of the brightest cluster galaxy inside the dark matter halo and find in SIDM cosmologies there exists a so-called wobbling not observed in collisionless dark matter. We find this wobble is driven by accreting mass on to a cored density profile with the signal peaking at $z=0.25$ and dropping thereafter. This finding is further supported by the existence of an anti-correlation between the offset between the BCG and the dark matter halo and its relative velocity in SIDM only, a hallmark of harmonic oscillation.",
      "pdf_url": "https://arxiv.org/pdf/2509.19842.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20235",
      "title": "$S_8$ from Tully-Fisher, fundamental plane, and supernova distances agree with Planck",
      "authors": [
        "Richard Stiskalek"
      ],
      "abstract": "$S_8$ from Tully-Fisher, fundamental plane, and supernova distances agree with Planck Richard Stiskalek 9 pages, 6 figures. To be submitted to MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO) Peculiar velocity measurements constrain the parameter combination $f\\sigma_8$, the product of the linear growth rate $f$ and the fluctuation amplitude $\\sigma_8$. Under the approximation that $f$ is a monotonic function of $\\Omega_{\\rm m}$, this can be related to $S_8 \\equiv \\sigma_8 \\sqrt{\\Omega_{\\rm m}/0.3}$, enabling direct comparison with weak lensing and cosmic microwave background results. We exploit this by using three classes of direct-distance tracers -- the Tully-Fisher relation, the fundamental plane, and Type~Ia supernovae -- to infer peculiar velocities. A unified hierarchical forward model jointly calibrates each distance indicator and a linear theory reconstruction of the local Universe. This is the first consistent Bayesian analysis to combine all three major classes of distance indicators within a common framework, enabling cross-checks of systematics across diverse galaxy populations. All three tracers yield consistent values of $S_8$ that are also in agreement with Planck. Our joint constraint is $S_8 = 0.819 \\pm 0.030$, with the uncertainty dominated by the 2M++ galaxy field. These results demonstrate that peculiar velocity surveys provide a robust, consistent measurement of $S_8$, and support concordance with the cosmic microwave background.",
      "pdf_url": "https://arxiv.org/pdf/2509.20235.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20363",
      "title": "Directly Probing Neutrino Interactions through CMB Phase Shift Measurements",
      "authors": [
        "Gabriele Montefalcone",
        "Subhajit Ghosh",
        "Kimberly K. Boddy",
        "Daven Wei Ren Ho",
        "Yuhsin Tsai"
      ],
      "abstract": "Directly Probing Neutrino Interactions through CMB Phase Shift Measurements Gabriele Montefalcone, Subhajit Ghosh, Kimberly K. Boddy, Daven Wei Ren Ho, Yuhsin Tsai Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Perturbations in the cosmic neutrino background produce a characteristic phase shift in the acoustic oscillations imprinted in the anisotropies of the cosmic microwave background (CMB), providing a unique observational probe of neutrino physics. In this work, we explore how this phase shift signature is altered in the presence of neutrino interactions with temperature-dependent scattering rates, motivated by physical constructions for neutrino self-interactions and neutrino-dark matter couplings. A key finding is that the phase shift in these realistic models -- characterized by gradual rather than instantaneous decoupling -- maintains the same functional form as the free-streaming template, with only the asymptotic amplitude decreasing for stronger interactions that delay decoupling. This simple parametrization enables us to directly constrain neutrino interactions through phase shift measurements in the temperature and polarization power spectra from CMB observations. Analyzing the latest data from \\textit{Planck}, the Atacama Cosmology Telescope, and the South Pole Telescope, we derive strong constraints on the neutrino decoupling redshift. Our global analysis indicates that neutrinos have been freely streaming since deep within the radiation-dominated epoch. We also explore flavor-dependent scenarios in which only one neutrino species interacts. Overall, our work establishes a signature-driven framework that exploits the clean phase shift signal in the acoustic oscillations of the CMB as a precise and robust probe of non-standard neutrino interactions in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2509.20363.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19427",
      "title": "The Cosmic Rush Hour: Rapid Formation of Bright, Massive, Disky, Star-Forming Galaxies as Signatures of Early-Universe Physics",
      "authors": [
        "Xuejian Shen",
        "Oliver Zier",
        "Mark Vogelsberger",
        "Michael Boylan-Kolchin",
        "Lars Hernquist",
        "Sandro Tacchella",
        "Rohan P. Naidu"
      ],
      "abstract": "The Cosmic Rush Hour: Rapid Formation of Bright, Massive, Disky, Star-Forming Galaxies as Signatures of Early-Universe Physics Xuejian Shen, Oliver Zier, Mark Vogelsberger, Michael Boylan-Kolchin, Lars Hernquist, Sandro Tacchella, Rohan P. Naidu 14 pages, 10 figures. To be submitted. Comments are welcome! Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Early JWST observations have revealed a high-redshift universe more vibrant than predicted by canonical galaxy-formation models within $\\Lambda$CDM, showing an excess of ultraviolet(UV)-bright, massive, and morphologically mature galaxies. Departures from $\\Lambda$CDM prior to recombination can imprint signatures on non-linear structure formation at high redshift. In this paper, we investigate one such scenario - Early Dark Energy, originally proposed to resolve the Hubble tension - and its implications for these high-redshift challenges. We present the first large-scale cosmological hydrodynamic simulations of these models. Modifications to the pre-recombination expansion history accelerate early structure formation and produce UV luminosity and stellar mass functions in excellent agreement with JWST measurements, requiring essentially no additional calibrations. Predictions converge to $\\Lambda$CDM at lower redshifts ($z \\lesssim 3$), thereby preserving all successes of $\\Lambda$CDM. This model also accelerates the emergence of stellar and gaseous disks, increasing their number densities by $\\sim 0.5$ dex at $z\\simeq 6$-7, primarily due to the higher abundance of massive galaxies. Taken together, these results demonstrate how early-universe physics can simultaneously reconcile multiple high-redshift challenges and the Hubble tension while retaining the core achievements of $\\Lambda$CDM. This opens a pathway to constraining a broad class of beyond-$\\Lambda$CDM models with forthcoming observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.19427.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19751",
      "title": "Determining Ideal Fields for Epoch of Reionisation Science Using the 21 cm Line",
      "authors": [
        "E. Jong",
        "C. Trott",
        "C. D. Nunhokee",
        "Q. Zheng"
      ],
      "abstract": "Determining Ideal Fields for Epoch of Reionisation Science Using the 21 cm Line E. Jong, C. Trott, C. D. Nunhokee, Q. Zheng Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The upcoming Square Kilometre Array Low Frequency (SKA-Low) interferometer will have the required sensitivity to detect the 21 cm line from neutral hydrogen during the Epoch of Reionisation (EoR). In preparation, we investigated the suitability of different fields for EoR science with the 21~cm line, using existing observations of candidate fields from the Murchison Widefield Array (MWA). Various image and calibration metrics were extracted from archival MWA observations centred on $z \\sim 6.8$. We explore the usefulness of these metrics and compare their behaviour between different fields of interest. In addition, a theoretical approach to quantifying the impact of different fields on the power spectrum is also provided. Gain uncertainties were calculated based on the positions of the calibrators within the beam. These uncertainties were then propagated into visibilities to produce cylindrical power spectra for various fields. Using these metrics in combination with the power spectra, we confirm that EoR0 ($\\text{R.A.} = 0^\\circ$, $\\text{Dec} = -27.0^\\circ$) is an ideal EoR field and discuss the interesting behaviour of other fields.",
      "pdf_url": "https://arxiv.org/pdf/2509.19751.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20285",
      "title": "GroundBIRD Telescope: Systematics Modelization of MKID Arrays Response",
      "authors": [
        "Yonggil Jo",
        "Alessandro Fasano",
        "Eunil Won",
        "Makoto Hattori",
        "Shunsuke Honda",
        "Chiko Otani",
        "Junya Suzuki",
        "Mike Peel",
        "Kenichi Karatsu",
        "Ricardo Génova-Santos",
        "Miku Tsujii"
      ],
      "abstract": "GroundBIRD Telescope: Systematics Modelization of MKID Arrays Response Yonggil Jo, Alessandro Fasano, Eunil Won, Makoto Hattori, Shunsuke Honda, Chiko Otani, Junya Suzuki, Mike Peel, Kenichi Karatsu, Ricardo Génova-Santos, Miku Tsujii 6 pages, 8 figures, proceeding paper to the 2025 LTD Conference Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Kinetic inductance detectors are widely used in millimeter- and submillimeter-wave astronomy, benefiting from their fast response and relative ease of fabrication. The GroundBIRD telescope employs microwave kinetic inductance detectors at 145 and 220 GHz to observe the cosmic microwave background. As a ground-based telescope, it is subject to inherent environmental systematics, namely atmospheric emission and thermal fluctuations of the focal plane temperature. This study models resonance frequency shifts induced by each source using calibrated on-site measurements of precipitable water vapor and temperature. Comparison with observational data confirms the validity of the models and identifies atmospheric loading as the dominant contributor to frequency variation under typical observation conditions.",
      "pdf_url": "https://arxiv.org/pdf/2509.20285.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.04893",
      "title": "Measuring photo-ionization rate and mean free path of HeII ionizing photons at $2.5 \\leq z \\leq 3.6$: Evidence for late and rapid HeII reionization Part-II",
      "authors": [
        "Prakash Gaikwad",
        "Frederick B. Davies",
        "Martin G. Haehnelt"
      ],
      "abstract": "Measuring photo-ionization rate and mean free path of HeII ionizing photons at $2.5 \\leq z \\leq 3.6$: Evidence for late and rapid HeII reionization Part-II Prakash Gaikwad, Frederick B. Davies, Martin G. Haehnelt 39 pages, 14 figures, 2 tables; Published in JCAP; Main results are summarized in Fig. 7, Fig. 8 and Table 2 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present measurements of the spatially averaged HeII photo-ionization rate ($\\langle \\Gamma_{\\rm HeII} \\rangle$), mean free path of HeII ionizing photons ($\\lambda_{\\rm mfp, HeII}$), and HeII fraction ($f_{\\rm HeII}$) across seven redshift bins within the redshift range $2<z<4$. The measurements are obtained by comparing the observed effective optical depth distribution of HeII ($\\tau_{\\rm eff, HeII}$) with models generated by post-processing of the Sherwood simulation suite using our code EXCITE. With EXCITE, we efficiently explore a large parameter space ($\\sim 15000$ models) by varying $\\lambda_{\\rm mfp, HeII}$ and $\\langle \\Gamma_{\\rm HeII} \\rangle$. We employ Anderson-Darling test for the cumulative distribution of $\\tau_{\\rm eff, HeII}$ to simultaneously measure $\\lambda_{\\rm mfp, HeII}$ and $\\langle \\Gamma_{\\rm HeII} \\rangle$. Our measurements account for possible observational and modeling uncertainties stemming mainly from the finite signal-to-noise ratio of the observed data and thermal parameter uncertainties. We find significant evolution, with the best-fit $\\langle \\Gamma_{\\rm HeII} \\rangle$ and $\\lambda_{\\rm mfp, HeII}$ decreasing by factors of $\\sim 4.32$ and $ \\sim 3.27$, respectively, from $z = 2.88$ to $z = 3.16$. Based on these measurements, we constrain the emissivity at the HeII ionization frequency ($\\epsilon_{228}$) and HeII ionizing photon emission rate ($\\dot{n}$), finding consistency with results from galaxy and QSO surveys. Comparison of our measured parameters with widely used uniform UVB models supports a scenario where HeII reionization is not completed before $z\\sim2.74$. Our measured evolution is complementary and in good agreement with recent measurements of thermal parameters of the IGM, suggesting a coherent picture of rather late and rapid HeII reionization.",
      "pdf_url": "https://arxiv.org/pdf/2503.04893.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.11358",
      "title": "Disentangling CMB $μ$ and $y$ spectral distortions from foregrounds with poorly defined spectral shapes",
      "authors": [
        "A.O. Mihalchenko"
      ],
      "abstract": "Disentangling CMB $μ$ and $y$ spectral distortions from foregrounds with poorly defined spectral shapes A.O. Mihalchenko 4 pages, 4 figures, Proceedings for the 29th International Symposium on Particles, String and Cosmology, Quy Nhon, Vietnam, July 6 - 13, 2024 Cosmology and Nongalactic Astrophysics (astro-ph.CO) We have presented a new approach to separate small spectral $\\mu$ and $y$ distortions of the CMB from foreground components with poorly defined spectral shapes. Our linear method, called the Least Response Method (LRM), is based on the idea of simultaneously minimizing the response to all possible foregrounds and photon noise while maintaining a constant response to the useful signal. We compared our approach with the mILC method, which is a modification of the Internal Linear Combination previously used for CMB anisotropy maps, and proved the advantages of LRM. In addition, we found the optimal temperature of the telescope optical system for any experiments related to the study of the CMB $\\mu$ distortions.",
      "pdf_url": "https://arxiv.org/pdf/2503.11358.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.14190",
      "title": "Matter Dipole and Hubble Tension due to Large Wavelength Perturbations",
      "authors": [
        "Gopal Kashyap",
        "Naveen K. Singh",
        "Pankaj Jain"
      ],
      "abstract": "Matter Dipole and Hubble Tension due to Large Wavelength Perturbations Gopal Kashyap, Naveen K. Singh, Pankaj Jain Cosmology and Nongalactic Astrophysics (astro-ph.CO) We theoretically analyze the dipole anisotropy observed in the quasar distribution from the CatWISE2020 catalog. The catalog data shows a peak around $z\\approx 1$, suggesting the presence of a large-scale dipole component. We explore the possibility that this dipole could be driven by primordial density fluctuations from modes that were superhorizon at the time of CMB decoupling but have since entered the horizon and become subhorizon. In particular, we consider the impact of adiabatic modes with wave numbers $k$ in the range $(10^{-4} - 4 \\times 10^{-3})~\\mathrm{Mpc}^{-1} $, corresponding to wavelength scales of several Gpc. Such modes can create large-scale density variations, likely causing anisotropies in the distribution of matter and, as a result, affecting the number density of observed quasars. We find that these can lead to a significant contribution to the dipole for sources up to redshifts of about 1, but are unable to explain the observed dipole. We also demonstrate that a superhorizon curvature perturbations mode, with a comoving wavenumber $k\\lesssim0.3H_0$ can lead to a significant enhancement in the locally inferred Hubble constant. This effect offers a viable explanation for the observed discrepancy between local and CMB inferred measurements of $H_0$.",
      "pdf_url": "https://arxiv.org/pdf/2504.14190.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.21542",
      "title": "Quintessence and phantoms in light of DESI 2025",
      "authors": [
        "Ioannis D. Gialamas",
        "Gert Hütsi",
        "Martti Raidal",
        "Juan Urrutia",
        "Martin Vasar",
        "Hardi Veermäe"
      ],
      "abstract": "Quintessence and phantoms in light of DESI 2025 Ioannis D. Gialamas, Gert Hütsi, Martti Raidal, Juan Urrutia, Martin Vasar, Hardi Veermäe 17 pages, 7 figures, matches published version Phys. Rev. D 112, 063551 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We analyse DESI BAO, CMB, and supernova data to explore the physical origin of the DESI indication for dynamical dark energy. Beyond the standard CPL parametrization, we explore truncated alternatives and quintessence models. We conclude that there is compelling evidence for dark energy to be decaying in the late universe, but the evidence for a phantom behaviour is less significant. Models without phantom behaviour are compatible with the data at the $2\\sigma$ CL. Furthermore, we examine a concrete quintessence scenario with a Higgs-like potential, allowing for a direct comparison with parametrized approaches and testing its consistency with current observations. This framework enables a broader investigation of late-time cosmic evolution and reveals a $93.8\\%$ preference for a future transition into an anti-de Sitter space, which may ultimately lead to a cosmological collapse of our Universe.",
      "pdf_url": "https://arxiv.org/pdf/2506.21542.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.24030",
      "title": "Listening Across the Cosmic Time: Standard Sirens from Ground- and Space-Based Missions in the Next Decade",
      "authors": [
        "Alberto Salvarese",
        "Hsin-Yu Chen",
        "Alberto Mangiagli",
        "Nicola Tamanini"
      ],
      "abstract": "Listening Across the Cosmic Time: Standard Sirens from Ground- and Space-Based Missions in the Next Decade Alberto Salvarese, Hsin-Yu Chen, Alberto Mangiagli, Nicola Tamanini Invited article for the Classical and Quantum Gravity special issue \"Gravitational Wave Physics and Astrophysics Ten Years After GW150914\" Cosmology and Nongalactic Astrophysics (astro-ph.CO) Precise measurement of the Hubble parameter will enable stringent tests of the standard model for cosmology. Standard sirens, using the luminosity distances measured by gravitational-wave observations of compact binary mergers, are expected to provide such measurements independently in the next decade. With the ground- and space-based gravitational wave observatories, the LIGO-Virgo-KAGRA (LVK) network and the Laser Interferometer Space Antenna (LISA), different types of standard sirens altogether will place constraints across a wide redshift range. In this paper, we forecast the precisions of standard siren Hubble parameter measurements and compare various scenarios, accounting for the dominant sources of systematic uncertainty. Specifically, we find a $2\\%$ constraint on $H_0$, a $1.5-3\\%$ constraint on $H(z)$ at $z=1$, and a $3-5\\%$ constraint on $H(z)$ at $z=7$ when combining LVK and LISA standard sirens with precise redshift measurements from electromagnetic counterpart observations. We do not find a significant improvement when including standard sirens with no EM counterpart, but which rely on features in the black hole mass distribution, and the potential systematics introduced by the possible redshift evolution of such features could further degrade the measurement accuracy if not properly accounted for.",
      "pdf_url": "https://arxiv.org/pdf/2506.24030.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.09673",
      "title": "Cosmology inference with perturbative forward modeling at the field level: a comparison with joint power spectrum and bispectrum analyses",
      "authors": [
        "Kazuyuki Akitsu",
        "Marko Simonović",
        "Shi-Fan Chen",
        "Giovanni Cabass",
        "Matias Zaldarriaga"
      ],
      "abstract": "Cosmology inference with perturbative forward modeling at the field level: a comparison with joint power spectrum and bispectrum analyses Kazuyuki Akitsu, Marko Simonović, Shi-Fan Chen, Giovanni Cabass, Matias Zaldarriaga 50 pages, 27 figues, the code available at this https URL v2 adds references and corrects typos Cosmology and Nongalactic Astrophysics (astro-ph.CO) We extend field-level inference to jointly constrain the cosmological parameters $\\{A,\\omega_{\\rm cdm},H_0\\}$, in both real and redshift space. Our analyses are based on mock data generated using a perturbative forward model, with noise drawn from a Gaussian distribution with a constant power spectrum. This idealized setting, where the field-level likelihood is exactly Gaussian, allows us to precisely quantify the information content in the nonlinear field on large scales. We find that field-level inference accurately recovers all cosmological parameters in both real and redshift space, with uncertainties consistent with perturbation theory expectations. We show that these error bars are comparable to those obtained from a joint power spectrum and bispectrum analysis using the same perturbative model. Finally, we perform several tests using the Gaussian field-level likelihood to fit the mock data where the true noise model is non-Gaussian, and find significant biases in the inferred cosmological parameters. These results highlight that the success of field-level inference critically depends on using the correct likelihood, which may be the primary challenge for applying this method to smaller scales even in the perturbative regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.09673.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2406.10150",
      "title": "Subhalos are Anisotropically Distributed and Aligned with the Smooth Matter Distribution of Their Host Halos",
      "authors": [
        "Lorena Mezini",
        "Andrew R. Zentner",
        "Kuan Wang",
        "Catherine Fielder"
      ],
      "abstract": "Subhalos are Anisotropically Distributed and Aligned with the Smooth Matter Distribution of Their Host Halos Lorena Mezini, Andrew R. Zentner, Kuan Wang, Catherine Fielder Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the distributions of subhalos about their hosts in two suites of zoom-in N-body simulations of halo growth -- one suite focused on Milky Way-Mass halos ($\\sim 10^{12} \\mathrm{M}_{\\odot}$) and another focused on cluster-mass halos ($\\sim 10^{15} \\mathrm{M}_{\\odot}$) in the Symphony simulation suite. We find, in agreement with previous work on this subject, that subhalos are distributed anisotropically about their host halos. In particular, the positions of subhalos lie preferentially near the major axes of their host halos, possibly implying that satellite galaxies will exhibit a similar alignment. Furthermore, we show that in two-dimensional projection subhalos are more likely to be observed near the halo center (where the central galaxy presumably resides) when the host halo is projected nearly along its major axis. This projection effect is significant. Within projected radii of a few percent of the virial radius of the host halo, the fraction of mass in subhalos is $\\sim 175\\%$ larger for Milky Way mass halos and as much as $\\sim 195\\%$ larger for cluster halos when projected along the major axis as compared to the average from a random projection. This result has consequences for many applications including the interpretation of gravitational lenses. Finally, we find that the orbital angular momentum vector of subhalos is aligned with the angular momentum vector of their host halo, indicating that a significant component of a halo's angular momentum may be carried in its subhalos. This has consequences for galaxy formation models which use host halo angular momentum as a proxy for galaxy momentum.",
      "pdf_url": "https://arxiv.org/pdf/2406.10150.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19424",
      "title": "Gravitational waves from magnetorotational core-collapse supernovae using 3D GRMHD simulations: effect of rotation and magnetic fields",
      "authors": [
        "Sophia C. Schnauck",
        "Swapnil Shankar",
        "Philipp Mösta",
        "Roland Haas",
        "Erik Schnetter"
      ],
      "abstract": "Gravitational waves from magnetorotational core-collapse supernovae using 3D GRMHD simulations: effect of rotation and magnetic fields Sophia C. Schnauck, Swapnil Shankar, Philipp Mösta, Roland Haas, Erik Schnetter High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the gravitational wave emission for 10 supernova progenitors from magnetorotational core-collapse to the supernova explosion using fully three-dimensional dynamical-spacetime general-relativistic magnetohydrodynamics simulations with the GPU-accelerated code $\\texttt{GRaM-X}$. We consider 2 progenitors of zero-age-main-sequence mass $25M_\\odot$ and 8 with zero-age-main-sequence masses of $35M_\\odot$. For these models, we explore a range of rotation rates between $0.0$ and $3.5 \\mathrm{rad}\\, \\mathrm{s}^{-1}$, along with initial seed magnetic field of either $10^{12}\\mathrm{G}$ or $10^{13}\\mathrm{G}$. The analysis of the 10 models presented provides a comprehensive and systematic initial investigation of the interplay between progenitor rotation, magnetic field strength, and progenitor structure in shaping the explosion dynamics and gravitational wave (GW) emission. We find that stronger seed magnetic fields ($10^{13}\\mathrm{G}$) suppress the GW strain amplitude relative to models with weaker initial fields ($10^{12}\\mathrm{G}$). Increasing the initial rotation rate results in a more dynamical explosion, yielding correspondingly stronger gravitational waves. In addition, the progenitor mass/composition also exhibit a significant impact on the explosion dynamics and the morphology of the resulting waveforms. Finally, we find that all of our models lie above the detectability threshold for 3rd generation detectors aLIGO, Einstein Telescope, and Cosmic explorer at a $10\\mathrm{kpc}$ distance and most would even still be detectable at $10\\mathrm{Mpc}$, opening the possibility for observing gravitational wave emission for CCSNe beyond our galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2509.19424.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.19446",
      "title": "Vacuum birefringence in the polarized X-ray emission of a radio magnetar",
      "authors": [
        "Rachael E. Stewart",
        "Hoa Dinh Thi",
        "George Younes",
        "Marcus E. Lower",
        "Matthew G. Baring",
        "Michela Negro",
        "Fernando Camilo",
        "Joel B. Coley",
        "Alice K. Harding",
        "Wynn C. G. Ho",
        "Chin-Ping Hu",
        "Philip Kaaret",
        "Paul Scholz",
        "Alex Van Kooten",
        "Zorawar Wadiasingh"
      ],
      "abstract": "Vacuum birefringence in the polarized X-ray emission of a radio magnetar Rachael E. Stewart, Hoa Dinh Thi, George Younes, Marcus E. Lower, Matthew G. Baring, Michela Negro, Fernando Camilo, Joel B. Coley, Alice K. Harding, Wynn C. G. Ho, Chin-Ping Hu, Philip Kaaret, Paul Scholz, Alex Van Kooten, Zorawar Wadiasingh High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex); Quantum Physics (quant-ph) The quantum electrodynamics (QED) theory predicts that the quantum vacuum becomes birefringent in the presence of ultra-strong magnetic fields -- a fundamental effect yet to be directly observed. Magnetars, isolated neutron stars with surface fields exceeding $10^{14}$~G, provide unique astrophysical laboratories to probe this elusive prediction. Here, we report phase- and energy-resolved X-ray polarization measurements of the radio-emitting magnetar 1E 1547.0-5408 obtained with the Imaging X-ray Polarimetry Explorer (IXPE), in coordination with the Neutron Star Interior Composition Explorer (NICER) and Parkes/Murriyang radio observations. We detect a high phase-averaged polarization degree of 65% at 2 keV, where the surface thermal emission is dominant, rising to nearly 80% at certain rotational phases, and remaining at $\\gtrsim40\\%$ throughout the radio beam crossing. We also observe a strong decrease in polarization from 2~keV to 4~keV. Detailed atmospheric radiative transfer modeling, coupled with geometrical constraints from radio polarization, demonstrate that the observed polarization behavior cannot be consistently explained without invoking magnetospheric vacuum birefringence (VB) influences. These observational findings combined with the theoretical results represent compelling evidence for naturally occurring quantum VB. This work marks a significant advance toward confirming this hallmark prediction of QED and lays the foundation for future tests of strong-field quantum physics using next-generation X-ray polarimeters.",
      "pdf_url": "https://arxiv.org/pdf/2509.19446.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ex",
        "quant-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19449",
      "title": "A Yin-Yang Galaxy Cluster Merger in Abell 1914 Revealed by XRISM",
      "authors": [
        "Annie Heinrich , Congyao Zhang , Irina Zhuravleva , Eugene Churazov , Hannah McCall , Reinout J. van Weeren , William R. Forman UChicago, Masaryk Univ., MPA, Leiden Univ., CfA)"
      ],
      "abstract": "A Yin-Yang Galaxy Cluster Merger in Abell 1914 Revealed by XRISM Annie Heinrich (1), Congyao Zhang (2,1), Irina Zhuravleva (1), Eugene Churazov (3), Hannah McCall (1), Reinout J. van Weeren (4), William R. Forman (5) ((1) UChicago, (2) Masaryk Univ., (3) MPA, (4) Leiden Univ., (5) CfA) 13 pages, 5 figures. Submitted to ApJL High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Hierarchical mergers of galaxy clusters play a key role in converting gravitational energy into thermal and kinetic energy in the local universe. Understanding this process requires the reconstruction of cluster merger geometry, with careful consideration of projection effects. With its unprecedented spectral resolution, XRISM enables the disentanglement of merging cluster components along the line-of-sight via X-rays for the first time. In this letter, we focus on the massive cluster A1914, a puzzling case wherein the galaxy and dark matter distribution appear to be in tension with the X-ray morphology. We present XRISM observations of A1914 focusing on the velocity structure of the intracluster medium (ICM). The Resolve full-array spectrum requires two merging components along the line-of-sight, with bulk velocities offset by $\\sim$1000 km/s and velocity dispersions of $\\sim$200 km/s. The sub-array maps of flux ratios, bulk velocity, and velocity dispersion show the two components are offset and overlapping in the plane of the sky, consistent with a major (mass ratio $\\sim$3), near line-of-sight merger with a pericenter distance of $\\sim$200 kpc. We conclude that the two subclusters create an overlapping spiral pattern, referred to as a ''yin-yang'' merger. This scenario is further supported by tailored hydrodynamical simulations of the A1914 merger, demonstrating that this type of merger can broadly reproduce the observed X-ray morphology, gas temperature map, gas velocity maps, dark matter distribution, and galaxy velocities. This work demonstrates the power of high-resolution X-ray spectroscopy, provided by XRISM, to resolve complex cluster merger geometries.",
      "pdf_url": "https://arxiv.org/pdf/2509.19449.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19458",
      "title": "Modeling of Dark Matter Prompt and Secondary Signatures in Dwarf Galaxies",
      "authors": [
        "Athithya Aravinthan , Julien Dörner , Julia Becker Tjus , Aritra Basu , Dominik Bomans , Samata Das , Sam Taziaux , Dominik Elsässer , Riccardo Catena Ruhr University Bochum, Faculty of Physics and Astronomy, Plasma-Astroparticle Physics, Bochum, Germany, Ruhr Astroparticle and Plasma Physics Center , Germany, Department of Space, Earth and Environment, Chalmers University of Technology, Gothenburg, Sweden, Thuringian State Observatory , Tautenburg, Germany, Max Planck Institute for Radio Astronomy, Bonn, Germany, TU Dortmund University, Department of Physics, Dortmund, Germany, Department of Physics, Chalmers University of Technology, Gothenburg, Sweden, CSIRO Space and Astronomy, Australia)"
      ],
      "abstract": "Modeling of Dark Matter Prompt and Secondary Signatures in Dwarf Galaxies Athithya Aravinthan (1 and 2), Julien Dörner (1 and 2), Julia Becker Tjus (1 and 2 and 3), Aritra Basu (4 and 5), Dominik Bomans (1 and 2), Samata Das (1 and 2), Sam Taziaux (1 and 2 and 8), Dominik Elsässer (2 and 6), Riccardo Catena (7) ((1) Ruhr University Bochum, Faculty of Physics and Astronomy, Plasma-Astroparticle Physics, Bochum, Germany, (2) Ruhr Astroparticle and Plasma Physics Center (RAPP Center), Germany, (3) Department of Space, Earth and Environment, Chalmers University of Technology, Gothenburg, Sweden, (4) Thuringian State Observatory (TLS), Tautenburg, Germany, (5) Max Planck Institute for Radio Astronomy, Bonn, Germany, (6) TU Dortmund University, Department of Physics, Dortmund, Germany, (7) Department of Physics, Chalmers University of Technology, Gothenburg, Sweden, (8) CSIRO Space and Astronomy, Australia) 9 pages, 3 figures, The Astroparticle Physics Conference ICRC 2025 High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) Dwarf Spheroidal (dSph) galaxies are very promising laboratories for the indirect search for dark matter (DM), due to their low astrophysical background in radio and gamma-ray frequencies. This is convenient when considering Weakly Interacting Dark Matter (WIMP) that can annihilate and produce radio continuum emission. Radio detections of dSph galaxies, however, prove to be difficult and motivate the consideration of transient galaxies that have just recently become quiescent. For the past several decades, the prompt emission from DM annihilation signatures has been explored through modeling and the setting of limits. In addition to the prompt annihilation signatures from neutrinos, gamma-rays, electrons, positrons, and antimatter, the secondary emission from charged annihilation products undergoing radiative loss processes also contributes to the picture. For instance, synchrotron radiation and inverse Compton scattering of charged products such as electrons and positrons can provide a significant signal. The quantitative modeling of this secondary emission with the astrophysical background is necessary to place stringent constraints on the nature of DM. In this work, the multi-wavelength secondary spectrum of DM annihilation for a dwarf galaxy is calculated using the open-source code CRPropa 3.2, which enables the self-consistent treatment of the astrophysical background and secondary emissions. We present a systematic comparison of signatures from conventional astrophysical processes to those expected from DM annihilation. The morphological differences between the two scenarios are investigated. Tests of the impact of different magnetic fields, DM masses, and DM profiles will be performed in the next steps.",
      "pdf_url": "https://arxiv.org/pdf/2509.19458.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19546",
      "title": "Probing the Origin of X-ray Flares in the Low-Hard State of GRS 1915+105 Using AstroSat and NuSTAR",
      "authors": [
        "Shahzada Akhter",
        "Sajad Boked",
        "Bari Maqbool",
        "Ranjeev Misra",
        "V. Jithesh"
      ],
      "abstract": "Probing the Origin of X-ray Flares in the Low-Hard State of GRS 1915+105 Using AstroSat and NuSTAR Shahzada Akhter, Sajad Boked, Bari Maqbool, Ranjeev Misra, V. Jithesh Accepted for publication in The Astrophysical Journal (ApJ). 24 pages, 21 figures High Energy Astrophysical Phenomena (astro-ph.HE) We performed a detailed time-resolved spectral study of GRS 1915+105 during its low-flux rebrightening phase using the broadband capabilities of AstroSat and NuSTAR in May-June 2019. The AstroSat light curves revealed erratic X-ray flares with count rates rising by a factor of $\\sim$5. Flares with simultaneous LAXPC and SXT coverage were segmented and fitted using two degenerate but physically motivated spectral models: a reflection-dominated model (hereafter Model A) and an absorption-dominated model (hereafter Model B). In Model A, the inner disk radius $(R_{in})$ shows a broken power-law dependence on flux, indicating rapid inward motion of the disk at higher flux levels. In contrast, Model B shows variable column density in the range of $10^{23}$ to $10^{24}$ cm$^{-2}$, displaying a strong anti-correlation with flux. Both models exhibit significant variation in the ionization parameter between low- and high-flux segments. The total unabsorbed luminosity in the 0.7--30~keV energy range ranged from $6.64 \\times 10^{36}$ to $6.33 \\times 10^{38}$~erg~s$^{-1}$. Across both models, several spectral parameters exhibited step-function-like behavior around flux thresholds of $5$--$10 \\times 10^{-9}$ erg cm$^{-2}$ s$^{-1}$, indicating multiple spectral regimes. The disc flux contribution, more evident in Model B, increased with total flux, supporting an intrinsic origin for the variability. These findings point to a complex interplay between intrinsic disk emission, structured winds, and variable local absorption in driving the flare activity.",
      "pdf_url": "https://arxiv.org/pdf/2509.19546.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19934",
      "title": "Dynamical properties of oscillating, viscous, transonic accretion disks around black holes",
      "authors": [
        "Sanjit Debnath",
        "Indranil Chattopadhyay",
        "Raj Kishor Joshi",
        "Philippe Laurent",
        "Priyesh Kumar Tripathi",
        "M. Saleem Khan"
      ],
      "abstract": "Dynamical properties of oscillating, viscous, transonic accretion disks around black holes Sanjit Debnath, Indranil Chattopadhyay, Raj Kishor Joshi, Philippe Laurent, Priyesh Kumar Tripathi, M. Saleem Khan Accepted for publication in ApJ, 15 pages, 9 figures High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the time evolution of sub-Keplerian transonic accretion flow onto a non-rotating black hole using axisymmetric viscous hydrodynamic simulations. We simulate the accretion flow using boundary values from semi-analytical analysis and set up three different models. Two of the models do not predict accretion shocks from the semi-analytic analysis, while one of them does. We also consider radiative cooling along with viscosity in the simulation. Our two-dimensional simulation deviated from the one-dimensional semi-analytical solution and admitted shocks in all three models. Viscous dissipation tends to push the shock front outward, and radiative cooling will push it in. Additionally, gravity is attractive. Depending on the competing strengths of all three processes, it may trigger shock oscillation. Different rates of angular-momentum transport in various layers may trigger eddies, which will enhance the shock oscillation. We show that any simple power law cannot approximate these solutions. We find that hot and higher angular-momentum flow requires higher viscosity to produce oscillatory shocks. From the temporal variation of the luminosity, shock oscillations generate QPOs in the range of sub-Hertz to a few Hertz frequencies if a ten solar mass black hole is assumed.",
      "pdf_url": "https://arxiv.org/pdf/2509.19934.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19981",
      "title": "Empirical correlation between masses of black holes and Wolf-Rayet stars derived from their mass distributions in spectroscopic binaries",
      "authors": [
        "Konstantin Postnov",
        "Ivan Shaposhnikov",
        "Anatol Cherepashchuk"
      ],
      "abstract": "Empirical correlation between masses of black holes and Wolf-Rayet stars derived from their mass distributions in spectroscopic binaries Konstantin Postnov, Ivan Shaposhnikov, Anatol Cherepashchuk (Sternberg Astronomical Institute, Moscow) 5 pages, 1 figure. Accepted for publication in MNRAS Letters High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We present observationally determined mass distributions of Wolf-Rayet (WR) stars in WR+OB binaries and black holes (BH) in spectroscopic binaries. Both WR and BH mass probability distributions can be well approximated by unbiased log-normal functions. Assuming that all WR stars with $M_\\mathrm{WR}\\gtrsim 6 M_\\odot$ after core collapse are progenitors of the BHs, the similar shape of their mass distributions before and after collapse suggests a power-law relation between them $M_{\\mathrm{BH}} \\simeq (0.39\\pm0.09) {M_{\\mathrm{WR}}}^{1.13\\pm0.09}$. Using the relation between masses of a WR star and its CO-core, we obtain the empirical relation between the BH mass and CO-core of the collapsing WR star $M_\\mathrm{BH}\\sim 0.9 M_\\mathrm{CO}$, which can be used in the population synthesis calculations.",
      "pdf_url": "https://arxiv.org/pdf/2509.19981.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20131",
      "title": "A Search for High-Energy Emission from the Remnant of Supernova 1181",
      "authors": [
        "J. Holder",
        "Qiqi Jiang"
      ],
      "abstract": "A Search for High-Energy Emission from the Remnant of Supernova 1181 J. Holder (for the VERITAS Collaboration), Qiqi Jiang Presented at the 39th International Cosmic Ray Conference, Geneva, 2025 High Energy Astrophysical Phenomena (astro-ph.HE) Over the previous millennium, only five Galactic supernovae were observed and recorded by contemporary astronomers, and their current-day counterparts subsequently identified. The remnants of four of these have all been very deeply studied, and ultimately detected, by TeV instruments after exposures of typically hundreds of hours. The measured TeV fluxes range from 1 Crab (by definition) down to 0.3% Crab. The location of the fifth supernova remnant tied to a historical record of its supernova (SN 1181) has never been studied at TeV energies. The reason for this is simple - the associated remnant was only identified as such in 2021. The remnant, Pa 30, is an unusual object whose properties are best explained as resulting from a Type Iax supernova explosion. These are a rare sub-type of Type Ia supernovae in which the merging white dwarfs are not fully destroyed by the supernova explosion, leading to a double-degenerate merger product colorfully described as a 'zombie star'. We will present the results of a search for TeV gamma-ray emission from Pa 30 with VERITAS.",
      "pdf_url": "https://arxiv.org/pdf/2509.20131.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20143",
      "title": "Density constraint of the warm absorber in NGC 5548",
      "authors": [
        "Keqin Zhao",
        "Jelle S. Kaastra",
        "Liyi Gu"
      ],
      "abstract": "Density constraint of the warm absorber in NGC 5548 Keqin Zhao, Jelle S. Kaastra, Liyi Gu High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Context. Ionized outflows in active galactic nuclei (AGNs) are thought to influence the evolution of their host galaxies and super-massive black holes (SMBHs). Distance is important to understand the kinetic power of the outflows as a cosmic feedback channel. However, the distance of the outflows with respect to the central engine is poorly constrained. The density of the outflows is an essential parameter for estimating the distance of the outflows. NGC 5548 exhibits a variety of spectroscopic features in its archival spectra, which can be used for density analysis. Aims. We aim to use the variability of the absorption lines from the archival spectra to obtain a density constraint and then estimate the distance of the outflows. Methods. We used the archival observations of NGC 5548 taken with Chandra in January 2002 to search for variations of the absorption lines. Results. We found that the Mg XII Ly${\\alpha}$ and the O VIII Ly${\\beta}$ absorption lines have significant variation on the 144 ks time scale and the 162 ks time scale during the different observation periods. Based on the variability timescales and the physical properties of the variable components that dominated these two absorption lines, we derive a lower limit on the density of the variable warm absorber components in the range of $7.2-9.0{\\times}10^{11} m^{-3}$, and an upper limit on their distance from the central source in the range of 0.2-0.5 pc.",
      "pdf_url": "https://arxiv.org/pdf/2509.20143.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20150",
      "title": "Morphology of Young Massive Stellar Clusters with Next-Generation IACTs",
      "authors": [
        "Alberto Bonollo",
        "Paolo Esposito",
        "Andrea Giuliani",
        "Patrizia Caraveo",
        "Giorgio Galanti",
        "Silvia Crestan",
        "Michela Rigoselli",
        "Sandro Mereghetti"
      ],
      "abstract": "Morphology of Young Massive Stellar Clusters with Next-Generation IACTs Alberto Bonollo, Paolo Esposito, Andrea Giuliani, Patrizia Caraveo, Giorgio Galanti, Silvia Crestan, Michela Rigoselli, Sandro Mereghetti 29 pages, 9 figures, 6 tables. Accepted and to be published on Journal of High Energy Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) The term PeVatron designates astrophysical objects capable of accelerating particles to PeV energies. Their nature and particle acceleration mechanisms are uncertain, but ultra-high-energy gamma rays are produced when particles accelerated by either leptonic or hadronic PeVatrons interact with the surrounding medium or radiation fields. The atmospheric air shower observatory LHAASO detected photons with energies above 100 TeV from 43 sources in the Galactic Plane, proving the existence of PeVatrons within the Milky Way. In particular, one of the detections was a 1.4 PeV photon in spatial correspondence with Cygnus OB2, providing a strong hint that young massive stellar clusters (YMSCs) can act as PeVatrons. The next-generation Cherenkov telescopes will have unprecedented energy and angular resolution. Therefore, they will be able to resolve spatially YMSCs better than LHAASO. We focused on a sample of 5 YMSCs and their environments visible from either hemisphere with the CTAO or ASTRI Mini-Array. We modeled the gamma-ray emission above 1 TeV. We devised methods for classifying YMSCs that could be detected as unidentified extended TeV sources and estimated the observational time needed to distinguish the morphology of different classes of sources. We study the morphology of the sources in our sample in order to identify the main features. We simulated observations of all sources with the instrument response function (IRF) of CTAO or ASTRI Mini-Array. We compare their emission distribution to the one of the TeV halos observed by HAWC. We parametrize their radial profiles in order to develop methodologies to classify them and to distinguish YMSCs from TeV halos based on their morphology. We expect some feature, such as the emission peak, to be key in differentiating between the two classes of objects. We then test them on a sample of sources of the first LHAASO catalog.",
      "pdf_url": "https://arxiv.org/pdf/2509.20150.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20180",
      "title": "Classification of Unidentified Extended LHAASO Sources based on their Gamma-Ray Morphology: Prospects for Future IACTs",
      "authors": [
        "Alberto Bonollo",
        "Paolo Esposito",
        "Andrea Giulisni",
        "Silvia Crestan",
        "Giorgio Galanti",
        "Sandro Mereghetti",
        "Michela Rigoselli"
      ],
      "abstract": "Classification of Unidentified Extended LHAASO Sources based on their Gamma-Ray Morphology: Prospects for Future IACTs Alberto Bonollo, Paolo Esposito, Andrea Giulisni, Silvia Crestan, Giorgio Galanti, Sandro Mereghetti, Michela Rigoselli 8 pages, 2 figures, 1 table. Presented at the 39th International Cosmic Ray Conference (ICRC 2025), 2025 High Energy Astrophysical Phenomena (astro-ph.HE) While Supernova Remnants (SNRs) are widely considered the primary accelerators of cosmic rays (CRs) up to hundreds of TeV, they struggle to account for the CR flux at PeV energies, suggesting the existence of additional PeVatrons. Observations from LHAASO (Large High Altitude Air Shower Observatory) have identified several PeVatron candidates, including some SNRs, pulsar wind nebulae, TeV halos and young massive star clusters (YMSCs). These objects accelerate particles that interact with the surrounding interstellar medium and radiation fields, producing very-high-energy gamma rays (>100 TeV), a key signature of both leptonic and hadronic PeVatrons. We simulate and model the emission of TeV halos and YMSCs, adopting radial emission profiles derived from observational data. Given the current angular resolution of gamma-ray instruments, these profiles often appear similar, making it challenging to distinguish between source classes. We explore how next-generation Imaging Atmospheric Cherenkov Telescopes (IACTs), namely the CTAO (Cherenkov Telescope Array Observatory) and the ASTRI Mini-Array (Astrofisica con Specchi a Tecnologia Replicante Italiana), can classify these sources based on their morphology. We test our classification methods, derived from the profile features of known sources, on simulated CTAO and ASTRI Mini-Array observations of unidentified extended sources from the first LHAASO catalog. We present the results of our analysis to highlight the potential of future IACT observations in identifying the nature of extended gamma-ray sources, refining PeVatron candidate classifications, and improving our understanding of cosmic-ray accelerators.",
      "pdf_url": "https://arxiv.org/pdf/2509.20180.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19438",
      "title": "Formation and Diagnostic Use of Carbon Lines in Stripped-Envelope Supernovae",
      "authors": [
        "Stan Barmentloo",
        "Anders Jerkstrand"
      ],
      "abstract": "Formation and Diagnostic Use of Carbon Lines in Stripped-Envelope Supernovae Stan Barmentloo, Anders Jerkstrand 15 pages, 14 figures, both excluding appendices Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Carbon is one of the main end products of nucleosynthesis in massive stars. In this work, we study the emission signatures of carbon in spectra of stripped envelope supernovae (SESNe). A grid of model nebular spectra is created using the NLTE radiative transfer code SUMO, with stellar evolution- and explosion models as inputs. In the models, [C I] {\\lambda}8727 and [C I] {\\lambda}{\\lambda}9824, 9850 are identified as the only significant optical carbon lines, with contribution from both the O/C and He/C zones. To obtain estimates of L_[C I] {\\lambda}8727, which is blended with the Ca II triplet, we introduce and apply the CaNARY code, a publicly available Monte Carlo scattering code. We study carbon lines in a sample of SESNe, and find that luminosities of [C I] {\\lambda}{\\lambda}9824, 9850 relative to the optical spectrum increase with time, just as in our model grid. However, the relative luminosities of both [C I] {\\lambda}{\\lambda}9824, 9850 and [C I] {\\lambda}8727 are overproduced in our models. Multiple explanations for this discrepancy, such as too high carbon abundances in the stellar evolution models and underestimated cooling through molecule formation, are investigated. For those SNe where both lines are clearly observed, we use an analytical formalism to constrain their ejected carbon masses to the range ~0.2 - 2 Msun. However, several SNe yield upper limits of 0.05 Msun. We also show that [C I] {\\lambda}{\\lambda}9824, 9850 is a useful line to diagnose both carbon mass and the extent of the He/C zone. We strongly encourage observers and instrumentalists to target [C I] {\\lambda}{\\lambda}9824, 9850 in future SN observing campaigns.",
      "pdf_url": "https://arxiv.org/pdf/2509.19438.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19447",
      "title": "Two-moment cosmic ray transport in RAMSES",
      "authors": [
        "Joki Rosdahl",
        "Yohan Dubois",
        "Benoit Commercon",
        "Nimatou Diallo",
        "Nai Chieh Lin",
        "Alexandre Marcowith"
      ],
      "abstract": "Two-moment cosmic ray transport in RAMSES Joki Rosdahl, Yohan Dubois, Benoit Commercon, Nimatou Diallo, Nai Chieh Lin, Alexandre Marcowith 16 pages, 10 figures. Submitted to The Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Cosmic rays (CRs) are an important source of feedback in a variety of astrophysical contexts. Magneto-hydrodynamical (MHD) simulations treating CRs as a fluid have shown that how their feedback operates is strongly dependent on their transport properties such as diffusion and streaming. In this paper we introduce the numerical implementation, in the adaptive-mesh-refinement MHD code RAMSES, of the grey two-moment formulation of CR fluid dynamics, which follows the energy density and its associated three-dimensional flux. This method is tested for CR diffusion, streaming, and advection in a series of multi-dimensional tests including shocks to check the robustness and stability of this numerical two-moment CRMHD solver. We finally use the new two-moment CR implementation in a complex simulation of an isolated galactic disc producing galaxy-wide outflows launched by small-scale supernova explosions, and compare it with a previously existing one-moment formulation in the same code.",
      "pdf_url": "https://arxiv.org/pdf/2509.19447.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19666",
      "title": "A Bolometric Luminosity Correction Recipe for AGN at Any Epoch",
      "authors": [
        "Mojegan Azadi",
        "Belinda Wilkes",
        "Joanna Kuraszkiewicz",
        "Steven. P. Willner",
        "Matthew L. N. Ashby"
      ],
      "abstract": "A Bolometric Luminosity Correction Recipe for AGN at Any Epoch Mojegan Azadi, Belinda Wilkes, Joanna Kuraszkiewicz, Steven. P. Willner, Matthew L. N. Ashby Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) Understanding how active galactic nuclei (AGN) affect their host galaxies requires determining their total radiative power across all wavelengths (i.e., bolometric luminosities). We show how AGN accretion disk spectral energy distribution (SED) templates, parameterized by supermassive black hole (SMBH) mass, Eddington ratio, spin, and inclination, can be used to estimate total radiated luminosities. Bolometric luminosities are calculated by integrating the accretion disk SEDs from 1$\\mu$m to 10keV over $0^\\circ$--$90^\\circ$ inclinations, ensuring consistent treatment of wavelength gaps, avoiding double-counting reprocessed emission, and accounting for anisotropy of visible--UV emission at different inclinations. The SED, and resulting bolometric corrections, depend strongly on SMBH mass and Eddington ratio, but only weakly on spin and inclination. Increasing SMBH mass produces cooler disks peaking at lower frequencies, whereas higher Eddington ratios (and spins) yield hotter disks peaking at higher frequencies. Larger inclinations suppress the visible--UV portion of the SED, whereas X-ray emission remains nearly isotropic. Bolometric corrections in the visible--NUV range (5100Å-3000Å) show strong dependence on SMBH mass, while X-ray bolometric corrections depend strongly on the Eddington ratio. Near the SED peak (FUV; $\\sim$1450Å), parameter dependencies are weak, making this band particularly robust for estimating bolometric corrections. The X-ray band is reliable, though dependence on the Eddington ratio introduces a wide dynamic range. Because our SEDs are intrinsic and defined in the rest-frame, their application to Type 1 AGN is straightforward. For other AGN, however, corrections for obscuration by the host galaxy and torus are required in many cases.",
      "pdf_url": "https://arxiv.org/pdf/2509.19666.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19874",
      "title": "Analytical modeling of polarization signals arising from confined circumstellar material in Type II supernovae",
      "authors": [
        "T. Nagao",
        "K. Maeda",
        "T. Matsumoto"
      ],
      "abstract": "Analytical modeling of polarization signals arising from confined circumstellar material in Type II supernovae T. Nagao, K. Maeda, T. Matsumoto 13 pages, 14 figures, submitted to A&A Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Recent observations of Type II supernovae (SNe) have brought a challenge in our understanding on the final evolutionary stage of massive stars. The early-time spectra and light curves of Type II SNe suggest that a majority of them have dense circumstellar material (CSM) in their vicinity, the so-called confined CSM. However, the mechanism of these extensive mass loss has not yet been understood. For addressing this problem, we aim to study the spatial distribution of the confined CSM, which has important information on the mechanism. We analytically calculate the polarization signals created by electron scatterings within disk-like confined CSM, and apply the results to the case of SN 2023ixf. The calculated polarization angle remains fixed at the angle aligned with the CSM disk axis, and is insensitive to the disk parameters. The calculated polarization degree evolves over a timescale of < 10 days, depending on the disk parameters: it stays constant or increases slightly while the unshocked CSM is optically thick, peaks as it becomes optically thin, and drops to zero when the shock reaches the disk's outer edge. We also find that the time evolution of the polarization in Type II SNe with confined CSM can be used for estimating the CSM parameters. In particular, the maximum degree and the rise time are strongly connected to the values of the viewing angle and the opening angle of the CSM disk, while the duration and the decline time are sensitive to the values of the mass and extension of the CSM disk. We demonstrate that the time evolution of the polarization of SN 2023ixf can be explained with a disk-like CSM. This information of the CSM is a strong constraint on the mechanism to create the confined CSM.",
      "pdf_url": "https://arxiv.org/pdf/2509.19874.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.10590",
      "title": "McFACTS II: Mass Ratio--Effective Spin Relationship of Black Hole Mergers in the AGN Channel",
      "authors": [
        "Harrison E. Cook",
        "Barry McKernan",
        "K.E. Saavik Ford",
        "Vera Delfavero",
        "Kaila Nathaniel",
        "Jake Postiglione",
        "Shawn Ray",
        "Richard O'Shaughnessy"
      ],
      "abstract": "McFACTS II: Mass Ratio--Effective Spin Relationship of Black Hole Mergers in the AGN Channel Harrison E. Cook, Barry McKernan, K.E. Saavik Ford, Vera Delfavero, Kaila Nathaniel, Jake Postiglione, Shawn Ray, Richard O'Shaughnessy Submitted to ApJ, 18 pages, 9 figures, 2 tables High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We use the Monte Carlo For AGN (active galactic nucleus) Channel Testing and Simulation (McFACTS, this https URL) code to study the effect of AGN disk and nuclear star cluster parameters on predicted mass distributions for LIGO-Virgo-KAGRA (LVK) compact binaries forming in AGN disks. The assumptions we vary include the black hole (BH) initial mass function, disk model, disk size, disk lifetime, and the prograde-to-retrograde fraction of newly formed black hole binaries. Broadly we find that dense, moderately short-lived AGN disks are preferred for producing a $(q,\\chi_{\\rm eff})$ anti-correlation like those identified from existing gravitational wave (GW) observations. Additionally, a BH initial mass function (MF $\\propto M^{-2}$) is preferred over a more top-heavy MF ($M^{-1}$). The preferred fraction of prograde-to-retrograde is $>90\\%$, to produce results consistent with observations.",
      "pdf_url": "https://arxiv.org/pdf/2411.10590.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2503.20013",
      "title": "Comparison of magnetic diffusion and reconnection in ideal and resistive relativistic magnetohydrodynamics, ideal magnetodynamics, and resistive force-free electrodynamics",
      "authors": [
        "Michael P. Grehan",
        "Tanisha Ghosal",
        "James R. Beattie",
        "Bart Ripperda",
        "Oliver Porth",
        "Fabio Bacchini"
      ],
      "abstract": "Comparison of magnetic diffusion and reconnection in ideal and resistive relativistic magnetohydrodynamics, ideal magnetodynamics, and resistive force-free electrodynamics Michael P. Grehan, Tanisha Ghosal, James R. Beattie, Bart Ripperda, Oliver Porth, Fabio Bacchini 32 pages, 17 figures, published in Phys. Rev. D Phys. Rev. D 112, 063046 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) High-energy astrophysical systems and compact objects are frequently modeled using ideal relativistic magnetohydrodynamic (MHD) or force-free electrodynamic (FFE) simulations, with the underlying assumption that the discretisation from the numerical scheme introduces an effective (numerical) magnetic resistivity that adequately resembles an explicit resistivity. However, it is crucial to note that numerical resistivity can fail to replicate essential features of explicit resistivity. In this study, we compare the 1D resistive decay and 2D reconnection properties of four commonly used physical models. We demonstrate that the 1D Ohmic decay of current sheets via numerical dissipation in both ideal MHD and magnetodynamics (MD) is subdiffusive (i.e., sub-linear in time), whereas explicit resistive FFE and resistive MHD simulations match the predictions of resistive theory adequately. For low-resolution, reconnecting current sheets in 2D, we show that ideal MHD and MD have an analogue to the Sweet--Parker regime where the scaling of the reconnection rate depends directly on the resolution. At high resolutions, ideal MHD and MD have an asymptotic reconnection rate similar to resistive MHD. Furthermore, we find that guide field-balanced current sheets in ideal MHD and MD have a qualitative structure similar to that of one in resistive MHD. Similarly, a pressure-balanced current sheet in ideal MHD is found to have a qualitative structure similar to that of one in resistive MHD. For a guide field-balanced sheet, resistive FFE is found to have a nearly identical Sweet--Parker regime compared to resistive MHD and a similar asymptotic reconnection rate for large enough Lundquist numbers, but differs in the timescale for reconnection onset in the asymptotic regime. We discuss the implications of our findings for global simulations.",
      "pdf_url": "https://arxiv.org/pdf/2503.20013.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.10981",
      "title": "X-ray polarization of accreting black holes: Cyg X-1 and Swift J1727.8-1613",
      "authors": [
        "M. Brigitte",
        "J. Svoboda"
      ],
      "abstract": "X-ray polarization of accreting black holes: Cyg X-1 and Swift J1727.8-1613 M. Brigitte, J. Svoboda 7 pages, 1 figure. Accepted for publication in the WDS'24 Proceedings of Contributed Papers, including revision of Fig. 1 WDS'24 Proceedings of Contributed Papers, Physics (eds. J. Safrankova and J. Pavlu), Prague, Matfyzpress, pp. 178-184, 2024 High Energy Astrophysical Phenomena (astro-ph.HE) The Imaging X-ray Polarimetry Explorer is an X-ray observatory measuring the X-ray polarization in the 2-8 keV energy range. Highly sensitive to the system's geometry, X-ray polarization is a unique method to probe the structure of X-ray binaries. The Imaging X-ray Polarimetry Explorer observed the High-Mass X-ray Binary Cygnus X-1 and the Low-Mass X-ray Binary Swift J1727.8-1613 in different accretion states: in the hard state and in the soft state. The X-ray polarimetry analysis of both sources shows a linear polarization degree increasing with energy, with higher values in the hard state than in the soft state. However, the linear polarization angle stays similar in both states and is aligned with the radio jet within $5^\\circ$. Furthermore, the Low-Mass X-ray Binary Swift J1727.8-1613 has a lower optical intrinsic polarization and a lower X-ray polarization degree for a softer spectrum. The similarities observed in this analysis between the X-ray polarization results of different types of X-ray Binaries show that the innermost accretion processes are independent of the companion star's type.",
      "pdf_url": "https://arxiv.org/pdf/2504.10981.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.05444",
      "title": "The soft X-ray transient EP241021a: A cosmic explosion with a complex off-axis jet and cocoon from a massive progenitor",
      "authors": [
        "Giulia Gianfagna",
        "Luigi Piro",
        "Gabriele Bruni",
        "Aishwarya Linesh Thakur",
        "Hendrik Van Eerten",
        "Maria D. Caballero-García",
        "Alberto Castro-Tirado",
        "Yong Chen",
        "Ye-hao Cheng",
        "Maria Gritsevich",
        "Sergiy Guziy",
        "Han He",
        "You-Dong Hu",
        "Shumei Jia",
        "Zhixing Ling",
        "Elisabetta Maiorano",
        "Rosita Paladino",
        "Shashi B. Pandey",
        "Roberta Tripodi",
        "Andrea Rossi",
        "Rubén Sánchez-Ramírez",
        "Shuaikang Yang",
        "Jianghui Yuan",
        "Weimin Yuan",
        "Chen Zhang"
      ],
      "abstract": "The soft X-ray transient EP241021a: A cosmic explosion with a complex off-axis jet and cocoon from a massive progenitor Giulia Gianfagna, Luigi Piro, Gabriele Bruni, Aishwarya Linesh Thakur, Hendrik Van Eerten, Maria D. Caballero-García, Alberto Castro-Tirado, Yong Chen, Ye-hao Cheng, Maria Gritsevich, Sergiy Guziy, Han He, You-Dong Hu, Shumei Jia, Zhixing Ling, Elisabetta Maiorano, Rosita Paladino, Shashi B. Pandey, Roberta Tripodi, Andrea Rossi, Rubén Sánchez-Ramírez, Shuaikang Yang, Jianghui Yuan, Weimin Yuan, Chen Zhang 18 pages, 12 figures. Accepted for publication in Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) X-ray flashes (XRFs) are fast X-ray transients thought to be softer analogs of gamma-ray bursts (GRBs). With its soft X-ray sensitivity, the Einstein Probe (EP) provides a unique opportunity to study these events. We report multiwavelength observations of EP241021a, a soft X-ray transient detected by EP, and interpret its afterglow in the context of leading XRF models. The prompt emission was observed by EP-WXT and Fermi-GBM, followed by a broad campaign across radio (uGMRT, ATCA, e-MERLIN, ALMA), optical (LBT, GTC, CAHA), and X-rays (EP-FXT). Light curves and spectra were analyzed with both empirical and physical models of GRBs and spherical expansions (both nonrelativistic and mildly relativistic cocoons). The afterglow shows multiple components, consistent with a structured jet interacting with a complex environment. The early optical and X-ray decline is explained by wide, low-Lorentz-factor ($\\gamma \\sim 40$) wings, while a rebrightening at approximately 7 days arises from the off-axis jet core. Radio data require an additional mildly relativistic cocoon ($\\gamma \\sim 2$), and a late (70 days) spectral component peaking at 50 GHz suggests a second, slower cocoon ($\\gamma \\sim 1$).",
      "pdf_url": "https://arxiv.org/pdf/2505.05444.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.04319",
      "title": "X-ray emission of the Nuclear Stellar Disk as seen by SRG/ART-XC",
      "authors": [
        "Valentin Nezabudkin",
        "Roman Krivonos",
        "Sergey Sazonov",
        "Rodion Burenin",
        "Alexander Lutovinov",
        "Ekaterina Filippova",
        "Alexey Tkachenko",
        "Mikhail Pavlinsky"
      ],
      "abstract": "X-ray emission of the Nuclear Stellar Disk as seen by SRG/ART-XC Valentin Nezabudkin, Roman Krivonos, Sergey Sazonov, Rodion Burenin, Alexander Lutovinov, Ekaterina Filippova, Alexey Tkachenko, Mikhail Pavlinsky Accepted for publication in Journal of High Energy Astrophysics; doi:https://doi.org/10.1016/j.jheap.2025.100473 High Energy Astrophysical Phenomena (astro-ph.HE) The Nuclear Stellar Disk (NSD), together with the Nuclear Stellar Cluster and the supermassive black hole Sgr A*, forms the central region of the Milky Way. Galactic X-ray background emission is known to be associated with the old stellar population, predominantly produced by accreting white dwarfs. In this work we characterize the X-ray emission of the Galactic Center (GC) region using wide-field observations with the ART-XC telescope on board the SRG observatory in the 4-12 keV energy band. Our analysis demonstrates that the X-ray emission of the GC at a spatial scale of a few hundred parsecs is dominated by the regularly shaped NSD aligned in the Galactic plane, and characterized by latitudinal and longitudinal scale heights of approximately 20 pc and approximately 100 pc, respectively. The measured flux, 6.8 (+0.1, -0.3) x 10^-10 erg/s/cm^2 in the 4-12 keV band, corresponds to a luminosity of 5.9 (+0.1, -0.3) x 10^36 erg/s, assuming the GC distance of 8.178 kpc. The average mass-normalized X-ray emissivity of the NSD, 5.6 (+0.5, -0.7) x 10^27 erg/s/M_sun, exceeds the corresponding value of the Galactic ridge by a factor of 3.3 (+0.4, -0.5), confirming other studies. We also perform a deprojection of the observed NSD surface brightness distribution in order to construct a three-dimensional X-ray luminosity density model, which can be directly compared to the existing 3D stellar mass models. Finally, we conclude that the spatial distribution of the X-ray emission from the NSD is consistent with the most recent stellar mass density distribution model within 30%, which suggests that this emission is dominated by unresolved point X-ray sources rather than by diffuse X-ray emission.",
      "pdf_url": "https://arxiv.org/pdf/2507.04319.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.01066",
      "title": "Imaging the positron annihilation line with 20 years of INTEGRAL/SPI observations",
      "authors": [
        "Hiroki Yoneda",
        "Thomas Siegert",
        "Saurabh Mittal"
      ],
      "abstract": "Imaging the positron annihilation line with 20 years of INTEGRAL/SPI observations Hiroki Yoneda, Thomas Siegert, Saurabh Mittal 18 pages, 20 figures, accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE) The e$^+$ e$^-$ annihilation line at 511 keV provides a unique probe for studying the distribution and origin of positrons in our Galaxy. The SPI spectrometer on INTEGRAL has observed this gamma-ray line for two decades. We analyze 20 years of INTEGRAL/SPI observations to produce the most sensitive all-sky map of the 511 keV line emission to date, aiming to reveal new features and provide refined measurements of known sources. We perform image deconvolution using the RL algorithm and employ bootstrap analysis to evaluate statistical uncertainties of fluxes from regions of interest. Systematic uncertainties in parameter choices are also considered. We utilize GPU acceleration to enable this computationally intensive analysis. The reconstructed image successfully recovers the basic morphological features reported in model-fitting studies: a bright central component, a broad bulge, and an elongated disk component along the Galactic plane. We also report hints of new spatial features in the reconstructed image, including an asymmetric structure in the broad bulge emission and 511 keV emission potentially associated with massive stars from the Sco-Cen and other OB associations. While the significance of these new features is marginal ($\\sim 2\\sigma$), they are spatially consistent with $^{26}$Al emission from massive stars in that region, suggesting that this 511 keV emission originates from its $\\beta^{+}$ decay. Our 20-year dataset provides the most detailed 511 keV emission map to date, reproducing global structures suggested in model-fitting approach while revealing hints of new spatial features. These findings provide insights into the origin of Galactic positrons and propagation of low-energy positrons in the interstellar medium. Future MeV gamma-ray observations, such as COSI, are expected to confirm the reported features and shed further light on the nature of positrons in our Galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2509.01066.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19422",
      "title": "Spectral Uniformity of Little Red Dots: A Natural Outcome of Coevolving Seed Black Holes and Nascent Starbursts",
      "authors": [
        "Kohei Inayoshi",
        "Kohta Murase",
        "Kazumi Kashiyama"
      ],
      "abstract": "Spectral Uniformity of Little Red Dots: A Natural Outcome of Coevolving Seed Black Holes and Nascent Starbursts Kohei Inayoshi, Kohta Murase, Kazumi Kashiyama Astrophysics of Galaxies (astro-ph.GA) The birth of seeds of massive black holes (BHs) and nascent galaxies at cosmic dawn takes place in dense gaseous environments, which play a crucial role in shaping their coevolution and radiation spectra. We investigate gas accretion during the assembly of massive halos with $M_{\\rm h}\\gtrsim 10^{10-11}~M_\\odot$ at redshifts $z\\simeq 4-10$, driving both rapid BH feeding and concurrent nuclear starbursts. As the BH grows to $\\sim 10^{6-7}~M_\\odot$ via super-Eddington accretion, the accretion power inflates a dense envelope whose effective temperature approaches the Hayashi limit at $T_{\\rm eff}\\simeq 5000~{\\rm K}$, producing red optical emission, while a coeval young stellar population of $\\sim 10^7~M_\\odot$ provides blue UV emission. This early coevolving system naturally reproduces the characteristic spectral features of the so-called little red dots (LRDs), a population of broad-line active galactic nuclei (AGNs), including the V-shaped UV-to-optical spectra and weakness of X-ray, infrared, and radio emission. Massive stars in the nuclear starburst soon explode as supernovae, injecting energy and momentum that expel gas from the nucleus, quench gas supply to the BH envelope, and ultimately drive a transition into normal AGN phases. For individual LRDs, the optical-to-UV luminosity ratio remains nearly constant at $L_{\\rm opt}/L_{\\rm UV}\\simeq 2-10$ from the onset of accretion bursts for $\\simeq 15~{\\rm Myr}$, one-third of the Salpeter time, until quenching by stellar feedback. While this ratio is sustained for the LRD population at $z\\simeq 4-8$, it declines toward lower redshifts as BHs can no longer maintain red envelopes, thereby losing the LRD characteristics.",
      "pdf_url": "https://arxiv.org/pdf/2509.19422.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19444",
      "title": "Infrared fine-structure lines at high redshift",
      "authors": [
        "Roberto Decarli",
        "Tanio Diaz-Santos"
      ],
      "abstract": "Infrared fine-structure lines at high redshift Roberto Decarli, Tanio Diaz-Santos Published in A&ARv. The data compilation and related software are available here: this https URL Astrophysics of Galaxies (astro-ph.GA) Infrared (IR) fine-structure line (FSL) emission arises from the radiative de-excitation of collisionally-excited electrons in atoms and ions. Thanks to their high luminosities and relatively simple physics, IR FSLs have quickly become the workhorse for studying the formation and evolution of galaxies in the nearby and distant Universe. In this review, we introduce the physics of FSL emission and the diagnostics of the ISM that we can derive from them via first principle arguments. We summarize the history of FSL observations with a focus on the far-IR wavelengths and a particular emphasis on the on-going efforts aimed at characterizing galaxies at cosmic noon and beyond. We explore the dependence of emission line trends, such as those observed in `line deficits' or [CII]-SFR relations, as a function of redshift and galaxy types. Once selection biases are controlled for, IR FSLs are a powerful tool to constrain the physics of galaxies. The precise redshift information inferred from fine-structure line observations have enabled tracing their ISM properties across cosmic reionization. FSL observations have also led to estimates of the mass of different ISM phases, and of the SFR of distant galaxies. It is thanks to IR FSL observations that we have been able to measure the internal dynamics of high-z galaxies, which in turns has allowed us to test, e.g., the onset of black hole - host galaxy relations in the first billion years of the Universe and the presence of gas outflows associated with the baryon cycle in galaxies. Finally, FSLs have provided important clues on the physics of the ISM in the most distant galaxies known to date. We demonstrate the strength and limitations of using IR FSLs to advance our understanding of galaxy formation and evolution in the early universe, and we outline future perspective for the field.",
      "pdf_url": "https://arxiv.org/pdf/2509.19444.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19475",
      "title": "Early galaxy evolution: The complex interstellar medium distribution of the z~7 galaxy A1689-zD1",
      "authors": [
        "Kirsten K. Knudsen",
        "Darach Watson",
        "Johan Richard",
        "David T. Frayer",
        "Seiji Fujimoto",
        "Hollis Akins",
        "Tom Bakx",
        "Nina Bonaventura",
        "Gabriel Brammer",
        "Lise Christensen",
        "Takuya Hashimoto",
        "Akio K. Inoue",
        "Hiroshi Matsuo",
        "Michał J. Michałowski",
        "Jorge A. Zavala"
      ],
      "abstract": "Early galaxy evolution: The complex interstellar medium distribution of the z~7 galaxy A1689-zD1 Kirsten K. Knudsen, Darach Watson, Johan Richard, David T. Frayer, Seiji Fujimoto, Hollis Akins, Tom Bakx, Nina Bonaventura, Gabriel Brammer, Lise Christensen, Takuya Hashimoto, Akio K. Inoue, Hiroshi Matsuo, Michał J. Michałowski, Jorge A. Zavala Astrophysics of Galaxies (astro-ph.GA) We observed the gravitationally lensed ($\\mu = 9.6\\pm0.19$) galaxy A1689-zD1 at $z = 7.1$ in bands 3, 6, and 8 of the Atacama Large Millimeter/submillimeter Array. These high-resolution observations ($\\approx 200$ pc) enabled us to separate the source into five components in the [CII] 158$\\mu$m and [OIII] 88$mu$m emission lines within a projected distance of 2 kpc. Even though these components appear to vary strongly from one another in both their line, continuum, and optical characteristics, the assembly of components do not show ordered rotation and appear consistent with simulations of a galaxy system undergoing the process of assembly. The total dynamical mass of the galaxy ($2\\times10^{10}$ M$_\\odot$) is an order of magnitude larger than the spectrally estimated stellar mass, suggesting a near-complete optical obscuration of the bulk of the stellar component. Comparing the line ratios as well as the line properties to other properties such as the star formation rate, we find that A1689-zD1 is consistent with the relations derived from local star-forming galaxies. Even though A1689-zD1 lies on local star formation scaling relations and has a high dust and stellar mass estimate, the kinematics suggest it is in an early assembly stage, which could lead to it becoming a disk galaxy at a later stage.",
      "pdf_url": "https://arxiv.org/pdf/2509.19475.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19487",
      "title": "The evolution of velocity dispersion in the Sco-Cen OB association",
      "authors": [
        "Josefa E. Großschedl , João Alves , Sebastian Ratzenböck , Núria Miret-Roig , Alvaro Hacar , Sebastian Hutschenreuter , Laura Posch Astronomical Institute of the Czech Academy of Sciences, Universität zu Köln, University of Vienna, Center for Astrophysics, Harvard and Smithsonian, FQA, Universitat de Barcelona, ICCUB, Universitat de Barcelona)"
      ],
      "abstract": "The evolution of velocity dispersion in the Sco-Cen OB association Josefa E. Großschedl (1,2,3), João Alves (3), Sebastian Ratzenböck (4), Núria Miret-Roig (5,6), Alvaro Hacar (3), Sebastian Hutschenreuter (3), Laura Posch (3) ((1) Astronomical Institute of the Czech Academy of Sciences, (2) Universität zu Köln, (3) University of Vienna, (4) Center for Astrophysics, Harvard and Smithsonian, (5) FQA, Universitat de Barcelona, (6) ICCUB, Universitat de Barcelona) 19 pages, 11 figures, 4 tables, Resubmitted to A&A September 23, 2025 (Comments Welcome!) Astrophysics of Galaxies (astro-ph.GA) We study how stellar velocity dispersion within the Scorpius-Centaurus OB association (Sco-Cen) has evolved over approximately 20 million years, from its formation to the present day. Using data from the \\textit{Gaia} mission along with supplementary stellar radial velocities, we identified a surprising sequence of abrupt jumps and intervening plateaus in the velocity dispersion correlating with star formation bursts. These changes in velocity dispersion coincide with the association expanding in size. We measure a present-day expansion rate of about 10--12\\,pc\\,Myr$^{-1}$ and observe that younger star clusters within the association exhibit higher velocities compared to older ones. This result, along with the stepwise increase in both velocity dispersion and spatial extent over time, suggests a structured and sequential star formation process rather than a random one. This phased evolution strongly suggests that stellar feedback is the primary driver of Sco-Cen's star formation history, expansion, and eventual dispersal. Our findings emphasize the value of precisely characterizing stellar populations within OB associations, particularly through the creation of detailed, high-resolution age maps.",
      "pdf_url": "https://arxiv.org/pdf/2509.19487.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19548",
      "title": "Investigating the Bulge Morphology of Dual AGN Host Galaxies from the GOTHIC survey",
      "authors": [
        "C. P. Nehal , Mousumi Das , Sudhanshu Barway , Francoise Combes , Prerana Biswas , Anwesh Bhattacharya , Snehanshu Saha Department of Physics, Indian Institute of Science Education and Research, Bhopal, India, Indian Institute of Astrophysics, Bangalore, India, Observatoire de Paris, LERMA, College ` de France, PSL University, Sorbonne University, CNRS, Paris, France, Siebel School of Computing and Data Science, University of Illinois at Urbana-Champaign, USA, APPCAIR, Department of CSIS, Birla Institute of Technology and Science, Goa and HappyMonk AI, India)"
      ],
      "abstract": "Investigating the Bulge Morphology of Dual AGN Host Galaxies from the GOTHIC survey C. P. Nehal (1), Mousumi Das (2), Sudhanshu Barway (2), Francoise Combes (3), Prerana Biswas (2), Anwesh Bhattacharya (4), Snehanshu Saha (5) ((1) Department of Physics, Indian Institute of Science Education and Research, Bhopal, India, (2) Indian Institute of Astrophysics, Bangalore, India, (3) Observatoire de Paris, LERMA, College ` de France, PSL University, Sorbonne University, CNRS, Paris, France, (4) Siebel School of Computing and Data Science, University of Illinois at Urbana-Champaign, USA, (5) APPCAIR, Department of CSIS, Birla Institute of Technology and Science, Goa and HappyMonk AI, India) 8 pages, 15 figures, Submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) We present a structural analysis of bulges in dual active galactic nuclei (AGN) host galaxies. Dual AGN arise in galaxy mergers where both supermassive black holes (SMBHs) are actively accreting. The AGN are typically embedded in compact bulges, which appear as luminous nuclei in optical images. Galaxy mergers can result in bulge growth, often via star formation. The bulges can be disky (pseudobulges), classical bulges, or belong to elliptical galaxies. Using SDSS DR18 gri images and GALFIT modelling, we performed 2D decomposition for 131 dual AGN bulges (comprising 61 galaxy pairs and 3 galaxy triplets) identified in the GOTHIC survey. We derived sérsic indices, luminosities, masses, and scalelengths of the bulges. Most bulges (105/131) are classical, with sérsic indices lying between $n=2$ and $n=8$. Among these, 64% are elliptical galaxies, while the remainder are classical bulges in disc galaxies. Only $\\sim$20% of the sample exhibit pseudobulges. Bulge masses span $1.5\\times10^9$ to $1.4\\times10^{12}\\,M_\\odot$, with the most massive systems being ellipticals. Galaxy type matching shows that elliptical--elliptical (E--E) and elliptical--disc (E--D) mergers dominate over disc--disc (D--D) mergers. At least one galaxy in two-thirds of the dual AGN systems is elliptical and only $\\sim$30% involve two disc galaxies. Although our sample is limited, our results suggest that dual AGN preferentially occur in evolved, red, quenched systems, that typically form via major mergers. They are predominantly hosted in classical bulges or elliptical galaxies rather than star-forming disc galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2509.19548.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19575",
      "title": "SDSS-V Black Hole Mapper: The Index Diagram as a tool to disentangle the influence of the Host Galaxy in Quasar spectra",
      "authors": [
        "C. A. Negrete",
        "R. Sandoval-Orozco",
        "H. Ibarra-Medel",
        "B. Tapia",
        "R. J. Assef",
        "D. Dultzin",
        "I. Lacerna",
        "S. Morrison",
        "S. F. Anderson",
        "P. Rodríguez Hidalgo C. Aydar",
        "F. E. Bauer",
        "E. Benitez",
        "D. Bizyaev",
        "W. N. Brandt",
        "J. R. Brownstein",
        "J. Buchner",
        "I. Cruz-González",
        "D. González-Buitrago",
        "H. Hernández-Toledo",
        "N. Jenaro-Ballesteros",
        "A. Koekemoer",
        "Y. Krongold",
        "M. L. Martínez-Aldama",
        "K. Pan",
        "C. Ricci",
        "M. Salvato",
        "S. F. Sánchez",
        "D. Serrano-Félix",
        "D. P. Schneider",
        "M. Sniegowska",
        "B. Trakhtenbrot",
        "Q. Wu",
        "D. Wylezalek",
        "Q. Yang",
        "R. J. Zermeño"
      ],
      "abstract": "SDSS-V Black Hole Mapper: The Index Diagram as a tool to disentangle the influence of the Host Galaxy in Quasar spectra C. A. Negrete, R. Sandoval-Orozco, H. Ibarra-Medel, B. Tapia, R. J. Assef, D. Dultzin, I. Lacerna, S. Morrison, S. F. Anderson, P. Rodríguez Hidalgo C. Aydar, F. E. Bauer, E. Benitez, D. Bizyaev, W. N. Brandt, J. R. Brownstein, J. Buchner, I. Cruz-González, D. González-Buitrago, H. Hernández-Toledo, N. Jenaro-Ballesteros, A. Koekemoer, Y. Krongold, M. L. Martínez-Aldama, K. Pan, C. Ricci, M. Salvato, S. F. Sánchez, D. Serrano-Félix, D. P. Schneider, M. Sniegowska, B. Trakhtenbrot, Q. Wu, D. Wylezalek, Q. Yang, R. J. Zermeño Astrophysics of Galaxies (astro-ph.GA) We revisit the Quasar Main Sequence (QMS) by investigating the impact of the stellar component from the host galaxy (HG) on the emission line spectra of the active galactic nuclei (AGN). We first detect spectra with broad emission lines using a line ratio method for a sample of $\\sim$3000 high SNR ($>$20) Black Hole Mapper objects (part of the fifth phase of the Sloan Digital Sky Survey). We then built the Index diagram, a novel diagnostic tool using the $z$-corrected spectra, model-free, designed to easily identify spectra with significant stellar HG contributions and to classify the AGN spectra into three categories based on AGN-HG dominance: HG-dominated (HGD), Intermediate (INT), and AGN-dominated (AGND) sources. A colour-$z$ diagram was used to refine the AGN-HG classification. We subtract the stellar contributions from the HGD and INT spectra before modeling the AGN spectrum to extract the QMS parameters. Our QMS reveals that HGD galaxies predominantly occupy the Population B region with no \\rfe, %FWHM$\\gtrsim$4000 \\kms, with outliers exhibiting \\rfe\\ $>$ 1, likely due to HG subtraction residuals and a faint contribution of \\hbbc. INT and AGND spectra show similar distributions in the Population A %FWHM(\\hbbc)$<$4000 \\kms\\ region, while in Population B, %For broader lines, a tail of AGND sources becomes apparent. Cross-matching with radio, infrared, and X-ray catalogs, we find that the strongest radio emitters are associated with HGD and INT groups. Strong X-ray emitters are found in INT and AGND sources, also occupying the AGN region in the WISE colour diagram.",
      "pdf_url": "https://arxiv.org/pdf/2509.19575.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19585",
      "title": "NEXUS: A Search for Nuclear Variability with the First Two JWST NIRCam Epochs",
      "authors": [
        "Zachary Stone",
        "Yue Shen",
        "Ming-Yang Zhuang",
        "Lei Hu",
        "Justin Pierel",
        "Junyao Li",
        "Adam J. Burgasser",
        "Jenny E. Greene",
        "Zhiwei Pan",
        "Alice E. Shapley",
        "Fengwu Sun",
        "Padmavathi Venkatraman",
        "Feige Wang"
      ],
      "abstract": "NEXUS: A Search for Nuclear Variability with the First Two JWST NIRCam Epochs Zachary Stone, Yue Shen, Ming-Yang Zhuang, Lei Hu, Justin Pierel, Junyao Li, Adam J. Burgasser, Jenny E. Greene, Zhiwei Pan, Alice E. Shapley, Fengwu Sun, Padmavathi Venkatraman, Feige Wang 16 pages, 10 figures, 1 table. Submitted to ApJ. The source catalog can be accessed here: this https URL Astrophysics of Galaxies (astro-ph.GA) The multi-cycle JWST Treasury program NEXUS will obtain cadenced imaging and spectroscopic observations around the North Ecliptic Pole during 2024-2028. Here we report a systematic search for nuclear variability among $\\sim 25\\,$k sources covered by NIRCam (F200W+F444W) imaging using the first two NEXUS epochs separated by 9 months in the observed frame. Difference imaging techniques reach $1\\sigma$ variability sensitivity of 0.18~mag (F200W) and 0.15~mag (F444W) at 28th magnitude (within 0\".2 diameter aperture), improved to $0.01$~mag and $0.02$~mag at $<25$th magnitude, demonstrating the superb performance of NIRCam photometry. The difference imaging results represent significant improvement over aperture photometry on individual epochs (by $>30\\%$). We identify 465 high-confidence variable sources among the parent sample, with 2-epoch flux difference at $>3\\sigma$ from the fiducial variability sensitivity. Essentially all these variable sources are of extragalactic origin based on preliminary photometric classifications, and follow a similar photometric redshift distribution as the parent sample up to $z_{\\rm phot}>10$. While the majority of these variability candidates are likely normal unobscured AGNs, some of them may be rare nuclear stellar transients and tidal disruption events that await confirmation with spectroscopy and continued photometric monitoring. We also constrain the photometric variability of ten spectroscopically confirmed broad-line Little Red Dots (LRDs) at $3\\lesssim z \\lesssim 7$, and find none of them show detectable variability in either band. We derive stringent $3\\sigma$ upper limits on the F444W variability of $\\sim 3-10\\%$ for these LRDs, with a median value of $\\sim 5\\%$. These constraints imply weak variability in the rest-frame optical continuum of LRDs.",
      "pdf_url": "https://arxiv.org/pdf/2509.19585.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19787",
      "title": "Radio Galaxy Zoo EMU: Harnessing Citizen Science and AI to Advance Open Science Catalogues",
      "authors": [
        "Eleni Vardoulaki",
        "Hongming Tang",
        "Micah Bowles",
        "Gary Segal",
        "Soheb Mandhai",
        "Emma L. Alexander",
        "Wendy Williams",
        "Yan Luo",
        "Lawrence Rudnick",
        "Andrew M. Hopkins",
        "O. Ivy Wong",
        "Stanislav S. Shabala",
        "the RGZ EMU collaboration"
      ],
      "abstract": "Radio Galaxy Zoo EMU: Harnessing Citizen Science and AI to Advance Open Science Catalogues Eleni Vardoulaki, Hongming Tang, Micah Bowles, Gary Segal, Soheb Mandhai, Emma L. Alexander, Wendy Williams, Yan Luo, Lawrence Rudnick, Andrew M. Hopkins, O. Ivy Wong, Stanislav S. Shabala, the RGZ EMU collaboration 4 pages, 2 figures, proceedings IAU397 Symposium UniversAI Exploring the Universe with Artificial Intelligence (editors Liodakis, Efthymiou) Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Over the past decades, significant efforts have been devoted to developing sophisticated algorithms for automatically identifying and classifying radio sources in large surveys. However, even the most advanced methods face challenges in recognising complex radio structures and accurately associating radio emission with their host galaxies. Leveraging data from the ASKAP telescope and the Evolutionary Map of the Universe (EMU) survey, Radio Galaxy Zoo EMU (RGZ EMU) was created to generate high-quality radio source classifications for training deep learning models and cataloging millions of radio sources in the southern sky. By integrating novel machine learning techniques, including anomaly detection and natural language processing, our workflow actively engages citizen scientists to enhance classification accuracy. We present results from Phase I of the project and discuss how these data will contribute to improving open science catalogues like EMUCAT.",
      "pdf_url": "https://arxiv.org/pdf/2509.19787.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19795",
      "title": "On the formation of star-forming galaxies having anomalously low-metallicity regions: the role of galaxy interaction and CGM/IGM accretion",
      "authors": [
        "Yibo Cao",
        "Zhizheng Pan"
      ],
      "abstract": "On the formation of star-forming galaxies having anomalously low-metallicity regions: the role of galaxy interaction and CGM/IGM accretion Yibo Cao, Zhizheng Pan 13 pages, 16 figures, ApJ accepted Astrophysics of Galaxies (astro-ph.GA) Gas accretion from both the circum-galactic medium (CGM)/inter-galatic medium (IGM) and interacting companion galaxy can dilute the gas phase metallicity of a galaxy. However, their relative contribution to the chemical evolution of galaxies remains to be quantified. To this end, in this work we study a sample of 510 star-forming galaxies (SFGs) having anomalously low-metallicity (ALM) regions selected from the MaNGA data available in the Data Release 17 from the Sloan Digital Sky Survey. ALM regions are defined as those having gas phase metallicities that are at least $\\sim 2\\sigma$ lower than the emprical relation between stellar mass surface density ($\\Sigma_{*}$) and gas phase metallicity, i.e., the $\\Sigma_{*}-Z$ relation. We find that ALM galaxies have higher star formation rates and \\Hi~gas fractions than normal SFGs at fixed $M_*$. $\\sim$25\\% of the ALM galaxies exhibit tidal features, while the tidal fraction is only $\\sim$12\\% for normal SFGs, indicating that galaxy interaction is an important factor responsible for the ALM phenomenon. To explore the origin of non-tidal ALM galaxies, we compare their morphologies and environments with those of mass-matched normal SFGs. We find that non-tidal ALM galaxies tend to have more disk-dominated morphologies and reside in less-dense environment. These findings suggest that cold gas accretion from the CGM/IGM is the primary cause for the ALM phenomenon, while galaxy interaction plays a minor but non-negligible role.",
      "pdf_url": "https://arxiv.org/pdf/2509.19795.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20075",
      "title": "Supergiant GCIRS 22 in the Milky Way Nuclear Star Cluster: Revised alpha abundances",
      "authors": [
        "B. Thorsbro",
        "S. Khalidy",
        "R. M. Rich",
        "M. Schultheis",
        "D. Taniguchi",
        "A. M. Amarsi",
        "G. Kordopatis",
        "G. Nandakumar",
        "S. Nishiyama",
        "N. Ryde"
      ],
      "abstract": "Supergiant GCIRS 22 in the Milky Way Nuclear Star Cluster: Revised alpha abundances B. Thorsbro, S. Khalidy, R. M. Rich, M. Schultheis, D. Taniguchi, A. M. Amarsi, G. Kordopatis, G. Nandakumar, S. Nishiyama, N. Ryde Astrophysics of Galaxies (astro-ph.GA) Context: The chemical abundances of alpha-elements in Galactic Centre (GC) supergiants provide key insights into the chemical enrichment and star formation history of the Milky Way's Nuclear Star Cluster. Previous studies have reported enhanced alpha-element abundances, raising questions about the chemical evolution of this unique region. Aims: We aim to reassess the alpha-element abundances in the GC supergiant GCIRS 22 using updated spectral modelling and non-local thermodynamic equilibrium (NLTE) corrections to resolve discrepancies from earlier abundance analyses. Methods: High-resolution near-infrared spectra of GCIRS 22 were analysed using contemporary line lists and precise stellar parameters derived from scandium line diagnostics. We applied comprehensive NLTE corrections to accurately determine the abundances of silicon and calcium. Results: Our analysis reveals solar-scale alpha abundances ([Ca/Fe] = 0.06 $\\pm$ 0.07; [Si/Fe] = $-$0.08 $\\pm$ 0.20) for GCIRS 22, significantly lower than previous LTE-based findings. NLTE corrections reduce the calcium abundance by approximately 0.3,dex compared to LTE estimates, aligning our results with recent studies and highlighting the importance of accurate NLTE modelling. Conclusions: The solar-scale alpha-element abundances observed in GCIRS 22 suggest that recent star formation in the region has not been dominated by Type II supernovae, such as those expected from a recent starburst. Our findings support a scenario of episodic star formation, characterized by intermittent bursts separated by extended quiescent phases, or potentially driven by gas inflows from the inner disk, funnelled by the Galactic bar. Future comprehensive NLTE studies of additional GC stars will be essential for refining our understanding of the region's chemical evolution and star formation history.",
      "pdf_url": "https://arxiv.org/pdf/2509.20075.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20079",
      "title": "The distribution and origin of metals in simulated Milky Way-like galaxies",
      "authors": [
        "Federico G. Iza",
        "Cecilia Scannapieco",
        "Sebastián E. Nuza",
        "Rüdiger Pakmor",
        "Robert J. J. Grand",
        "Facundo A. Gómez",
        "Volker Springel",
        "Federico Marinacci",
        "Francesca Fragkoudi"
      ],
      "abstract": "The distribution and origin of metals in simulated Milky Way-like galaxies Federico G. Iza, Cecilia Scannapieco, Sebastián E. Nuza, Rüdiger Pakmor, Robert J. J. Grand, Facundo A. Gómez, Volker Springel, Federico Marinacci, Francesca Fragkoudi 19 pages, 18 figures. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) In this study, we investigate the distribution and origin of chemical elements in different stellar components of simulated Milky Way-like galaxies in relation to their mass assembly history, stellar age, and metallicity. Using a sample of 23 simulated galaxies from the Auriga project, we analysed the evolution of heavy elements produced by stellar nucleosynthesis. To study the chemical evolution of the stellar halo, bulge, and warm and cold discs of the model galaxies, we applied a decomposition method to characterise the distribution of chemical elements at $z=0$ and traced back their origin. Our findings indicate that each stellar component has a distinctive chemical trend despite galaxy-to-galaxy variations. Specifically, stellar haloes are $\\alpha$-enhanced relative to other components, representing the oldest populations, with [Fe/H] ~ $-$0.6 and a high fraction of ex situ stars of ~ 50%. They are followed by the warm ([Fe/H] ~ $-$0.1) and cold ([Fe/H] ~ 0) discs, with in situ fractions of ~ 90% and ~ 95%, respectively. Alternatively, bulges are mainly formed in situ but host more diverse stellar populations, with [Fe/H] abundance extending over ~ 1 dex around the solar value. We conclude that one of the main drivers shaping the chemical properties of the galactic components in our simulations is the age-metallicity relation. The bulges are the least homogeneous component of the sample, as they present different levels of contribution from young stars in addition to the old stellar component. Conversely, the cold discs appear very similar in all chemical properties, despite important differences in their typical formation times. Finally, we find that a significant fraction of stars in the warm discs were in the cold disc at birth. We discuss the possible connections of this behaviour with the development of bars and interactions with satellites.",
      "pdf_url": "https://arxiv.org/pdf/2509.20079.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20080",
      "title": "Fitting the Shadows: Star Formation Scaling Relations in the Low Surface Brightness Regime",
      "authors": [
        "Hannah S. Christie",
        "Pauline Barmby",
        "Jason E. Young"
      ],
      "abstract": "Fitting the Shadows: Star Formation Scaling Relations in the Low Surface Brightness Regime Hannah S. Christie, Pauline Barmby, Jason E. Young 18 pages, 7 figures. Accepted for publication in PASP Astrophysics of Galaxies (astro-ph.GA) Classical low surface brightness (LSB) galaxies pose an important challenge to galaxy evolution models. While they are found to host large reservoirs of atomic hydrogen, they display low stellar and star-formation surface densities. Global star formation scaling relations characterize trends in the star formation behaviour of galaxies; when used to compare populations or classes of galaxies, deviations in the observed trends can be used to probe predicted differences in physical conditions. In this work we utilize the well-studied Star Forming Main Sequence and integrated Kennicutt-Schmidt Relations to characterize star formation in the LSB regime, and compare the observed trends to relations for a normal star-forming galaxies. Using a comprehensive cross-matched sample of 277 LSB galaxies from the GALEX-SDSS-WISE Legacy Catalog Release 2 and the Arecibo Legacy Fast Arecibo L-band Feed Array Catalog, we gain an in-depth view of the star formation process in the LSB regime. HI-selected LSB galaxies follow very similar trends in atomic gas-to-stellar mass ratio and the star forming main sequence to their high surface brightness counterparts. However, while LSB galaxies host comparably large atomic gas reservoirs, they prove to be largely inefficient in converting this gas to stars with a median depletion time $t_{dep} \\approx 18$ Gyr. These results are discussed in relation to previous studies which find that LSB galaxies host low atomic gas densities and are largely deficient in molecular gas, which suggest that the faint appearance of LSB galaxies may be the result of physical conditions on the sub-kpc scale.",
      "pdf_url": "https://arxiv.org/pdf/2509.20080.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20289",
      "title": "MeerKAT discovery of 164 compact radio rings toward the Galactic Plane",
      "authors": [
        "C. Bordiu",
        "F. Bufano",
        "G. Umana",
        "J.R. Rizzo",
        "C. Spingola",
        "C. Trigilio",
        "S. Loru",
        "M.D. Filipovic",
        "C. Buemi",
        "F. Cavallaro",
        "L. Cerrigone",
        "P. Leto",
        "A. Ingallinera",
        "S. Riggi",
        "A.C. Ruggeri",
        "Z. Smeaton",
        "P.A. Woudt"
      ],
      "abstract": "MeerKAT discovery of 164 compact radio rings toward the Galactic Plane C. Bordiu, F. Bufano, G. Umana, J.R. Rizzo, C. Spingola, C. Trigilio, S. Loru, M.D. Filipovic, C. Buemi, F. Cavallaro, L. Cerrigone, P. Leto, A. Ingallinera, S. Riggi, A.C. Ruggeri, Z. Smeaton, P.A. Woudt Accepted for publication in MNRAS. 24 pages, 10 figures, 3 tables Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We report the discovery of 164 compact (radius < 1 arcmin) radio rings using MeerKAT 1.3 GHz data from the SARAO MeerKAT Galactic Plane Survey (l=2-60deg, 252-358deg, |b|<1.5deg) and the Galactic Centre mosaic, from a search aimed at identifying previously uncatalogued radio sources. Within this sample, approximately 19 per cent of the rings contain a central point radio source. A multiwavelength analysis reveals a striking diversity: about 40 per cent of the rings enclose an isolated infrared point source, 50 per cent exhibit an extended counterpart in the mid- or far-infrared, and several are only detected in the radio band. We found that 17 per cent of the rings in the sample are positionally coincident (within 5 arcsec) with known entries in SIMBAD, including unclassified infrared sources, spiral galaxies, young stellar objects and long-period variable candidates. Based on these matches and exploiting ancillary multiwavelength data and catalogues, we explore several formation scenarios for the rings, such as HII regions, planetary nebulae, mass-loss relics from evolved massive stars, supernova remnants, nova shells, galaxies, galaxy cluster lenses and odd radio circles. Tentative classifications are proposed for nearly 60 per cent of the sample. These results highlight the potential of MeerKAT to uncover previously undetected compact radio structures and, particularly, recover missing Galactic radio-emitting objects.",
      "pdf_url": "https://arxiv.org/pdf/2509.20289.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20359",
      "title": "Stars and ionized gas in UGCA 320: a nearby gas-rich, dwarf Irregular galaxy",
      "authors": [
        "Adebusola B. Alabi",
        "S. Ilani Loubser",
        "Moses K. Mogotsi",
        "N. Zabel"
      ],
      "abstract": "Stars and ionized gas in UGCA 320: a nearby gas-rich, dwarf Irregular galaxy Adebusola B. Alabi, S. Ilani Loubser, Moses K. Mogotsi, N. Zabel Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) UGCA 320 is a gas-rich dwarf irregular galaxy which belongs to a nearby, relatively isolated group of dwarf galaxies. Here, we combine multi-band HST imaging data with deep long-slit SALT/RSS and integral-field VLT/MUSE spectral data to study the stellar and ionized gas components of UGCA 320. Our imaging data analysis reveals a very blue (V-I~0.1 mag), flattened radial colour profile. We detect an abundance of ionized gas in UGCA 320 powered mostly by recent star formation. The stellar disc in UGCA 320 is populated predominantly by young (~120 Myr) and metal-poor (~15-30 per cent solar metallicity) stars and it rotates in the same sense as the ionized gas disc but with higher rotation velocities, and possibly in different planes. Our analysis reveals a sharp transition in the kinematic properties of the discs at radius ~10\" (~0.3 kpc) and distortions in the outer disc region. We show that these features are consistent with a recent tidal interaction most likely with its close neighbour - UGCA 319. We discuss our results in the context of interacting dwarf galaxies and also show that similar inferences can be made independently from the long-slit data analysis as with the integral-field data.",
      "pdf_url": "https://arxiv.org/pdf/2509.20359.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20361",
      "title": "The HyLight model for hydrogen emission lines in simulated nebulae",
      "authors": [
        "Yuankang Liu",
        "Tom Theuns",
        "Tsang Keung Chan",
        "Alexander J. Richings",
        "Anna F. McLeod"
      ],
      "abstract": "The HyLight model for hydrogen emission lines in simulated nebulae Yuankang Liu, Tom Theuns, Tsang Keung Chan, Alexander J. Richings, Anna F. McLeod 26 pages, 24 figures, submitted to MNRAS. The HyLight package is available at this https URL . It can also be accessed via PyPI at this https URL Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Hydrogen recombination lines are key diagnostics of ionized gas in the interstellar medium (ISM), particularly within photoionized nebulae. Hydrodynamical simulations, even those that include radiative transfer, do not usually determine the level population of hydrogen required to compute line intensities, but rather interpolate them from pre-computed tables. Here we present the HyLight atomic model, which captures the dominant processes governing the level populations, enabling the calculation of all dipole-allowed hydrogen transitions as well as two-photon transitions from the 2s to 1s state without the need to pre-computed tables. We compare HyLight predictions to those of other codes and published tables, finding differences between the various rates of up to factors of several per cent for common transitions, including those of the Balmer and Brackett series. However, we find sub-per cent agreement between HyLight and the Cloudy spectral synthesis code when enforcing photo-ionisation equilibrium in gas under typical nebular conditions of density and temperature. Importantly, HyLight can also predict emissivities if the gas is not in photo-ionisation equilibrium. As examples, we compute the ratios between the total photoionization rate and line intensities in a nebula, and post-process a snapshot from Sparcs, a hydrodynamical code that combines radiative transfer with non-equilibrium physics, and compute mock hydrogen emission line maps which can be compared directly to observations. Implemented in Python, HyLight is an accurate tool for determining the level population in neutral hydrogen, a crucial step in bridging the gap between simulations and observations in studies of photoionized regions in galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2509.20361.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19443",
      "title": "Playing CHESS with stars. I. Search for similar stars in large spectroscopic data sets",
      "authors": [
        "J. E. Martínez Fernández",
        "S. Özdemir",
        "R. Smiljanic",
        "M. L. L. Dantas",
        "A. R. da Silva"
      ],
      "abstract": "Playing CHESS with stars. I. Search for similar stars in large spectroscopic data sets J. E. Martínez Fernández, S. Özdemir, R. Smiljanic, M. L. L. Dantas, A. R. da Silva Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Context: Massive amounts of spectroscopic data obtained by stellar surveys are feeding an ongoing revolution in our knowledge of stellar and Galactic astrophysics. Analysing these data sets to extract the best possible astrophysical parameters on short time scales represents a considerable challenge. Aims: The differential analysis method is known to return the most precise results in the spectroscopic analyses of F-, G-, and K-type stars. However, it can only be applied to stars with similar parameters. Our goal is to present a procedure that significantly simplifies the identification of spectra from stars with similar atmospheric parameters within extensive spectral datasets. This approach allows for the quick application of differential analyses in these samples, thus enhancing the precision of the results. Methods: We used projection maps created by the t-SNE dimensionality reduction algorithm applied directly to the spectra using pixels as dimensions. For testing the method, we used more than 7300 high-resolution UVES spectra of about 3000 stars in the field-of-view towards open and globular clusters. As reference, we used 1244 spectra of 274 stars with well-determined and high-quality atmospheric parameters. Results: We calibrated a spectral similarity metric that can identify stars in a t-SNE projection map with parameters that differ by $\\pm$ 200 K, $\\pm$ 0.3 dex, and $\\pm$ 0.2 dex in effective temperatures, surface gravities, and metallicities, respectively. We achieved completeness between 74-98 % and typical purity between 39-54 % in this selection. With this, we will drastically facilitate the detection of stars with similar spectra for a successful differential analysis. We used this method to evaluate the accuracy and precision of four atmospheric parameter catalogues, identifying the regions of the parameter space where spectral analysis methods needs improvement.",
      "pdf_url": "https://arxiv.org/pdf/2509.19443.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19761",
      "title": "Winding Motion of Spirals in a Gravitationally Unstable Protoplanetary Disk",
      "authors": [
        "Tomohiro C. Yoshida",
        "Hideko Nomura",
        "Kiyoaki Doi",
        "Marcelo Barraza-Alfaro",
        "Richard Teague",
        "Kenji Furuya",
        "Yoshihide Yamato",
        "Takashi Tsukagoshi"
      ],
      "abstract": "Winding Motion of Spirals in a Gravitationally Unstable Protoplanetary Disk Tomohiro C. Yoshida, Hideko Nomura, Kiyoaki Doi, Marcelo Barraza-Alfaro, Richard Teague, Kenji Furuya, Yoshihide Yamato, Takashi Tsukagoshi Published in Nature Astronomy on Sep 24, 2025, see this https URL. Supplementary Video is available at this https URL Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The discovery of wide-orbit giant exoplanets has posed a challenge to our conventional understanding of planet formation by coagulation of dust grains and planetesimals, and subsequent accretion of protoplanetary disk gas. As an alternative mechanism, the direct in-situ formation of planets or planetary cores by gravitational instability (GI) in protoplanetary disks has been proposed. However, observational evidence for GI in regions where wide-orbit planets are formed is still lacking. Theoretical studies predict that GI induces spiral arms moving at the local Keplerian speed in a disk. Here, with multiple high angular resolution observations over a seven-year time baseline using the Atacama Large Millimeter/submillimeter Array (ALMA), we report the evidence for spiral arms following the Keplerian rotation in the dust continuum disk around the young star IM Lup. This demonstrates that GI can operate in wide-orbit planet-formation regions, establishing it as a plausible formation mechanism for such planets.",
      "pdf_url": "https://arxiv.org/pdf/2509.19761.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.13696",
      "title": "SEW: A full-spectrum linear fitting with stellar population synthesis method Based on \"Equivalent Widths spectrum\"",
      "authors": [
        "Jiafeng Lu",
        "Xi Kang",
        "Shiyin Shen"
      ],
      "abstract": "SEW: A full-spectrum linear fitting with stellar population synthesis method Based on \"Equivalent Widths spectrum\" Jiafeng Lu, Xi Kang, Shiyin Shen Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a full-spectrum linear fitting method, SEW, for stellar population synthesis based on equivalent widths (EWs) to extract galaxy properties from observed spectra. This approach eliminates the need for prior assumptions about dust attenuation curves, which are instead derived as outputs of the fitting process. By leveraging the invariance of EWs and employing the Discrete Penalised Least Squares (DPLS) method to extract EWs, we address the nonlinear aspects of the fitting process by linearising the matrix equations. This enables accurate recovery of key parameters, stellar age, metallicity and dust attenuation, even under systematic calibration biases and varying attenuation conditions. Rigorous testing with mock spectra across signal-to-noise ratios (S/N = 5-30) and calibration biases demonstrates the robustness of method. The derived attenuation curves align closely with input models, and stellar population parameters are recovered with minimal bias. To facilitate adoption, we implement this method as a Python extension package for \\texttt{pPXF} (\\texttt{pPXF-SEW}). Our work addresses critical degeneracies in traditional spectral fitting and enhances the reliability of extragalactic studies.",
      "pdf_url": "https://arxiv.org/pdf/2502.13696.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.07738",
      "title": "On the Origin of Abundance Variations in the Milky Way's High-$α$ Plateau",
      "authors": [
        "Tawny Sit",
        "David H. Weinberg",
        "Emily J. Griffith"
      ],
      "abstract": "On the Origin of Abundance Variations in the Milky Way's High-$α$ Plateau Tawny Sit, David H. Weinberg, Emily J. Griffith 20 pages, 11 figures, updated to ApJ accepted version Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Using multi-element abundances from the SDSS APOGEE survey, we investigate the origin of abundance variations in Milky Way (MW) disk stars on the \"high-$\\alpha$ plateau,\" with $-0.5\\leq\\rm{[Mg/H]}\\leq-0.1$ and $0.25\\leq\\rm{[Mg/Fe]}\\leq0.35$. The elevated [$\\alpha$/Fe] ratios of these stars imply low enrichment contributions from Type Ia supernovae (SNIa), but it is unclear whether their abundance patterns reflect pure core-collapse supernova (CCSN) enrichment. We find that plateau stars with higher [Fe/Mg] ratios also have higher [X/Mg] ratios for other iron-peak elements, suggesting that the [Fe/Mg] variations in the plateau population do reflect variations in the SNIa/CCSN ratio. To quantify this finding, we fit the observed abundance patterns with a two-process model, calibrated on the full MW disk, which represents each star's abundances as the sum of a prompt CCSN process with amplitude $A_{\\text{cc}}$ and a delayed SNIa process with amplitude $A_{\\text{Ia}}$. This model is generally successful at explaining the observed trends of [X/Mg] with $A_{\\text{Ia}}/A_{\\text{cc}}$, which are steeper for elements with a large SNIa contribution (e.g., Cr, Ni, Mn) and flatter for elements with low SNIa contribution (e.g., O, Si, Ca). Our analysis does not determine the value of [Mg/Fe] corresponding to pure CCSN enrichment, but it should be at least as high as the upper edge of the plateau at $\\rm{[Mg/Fe]}\\approx0.35$, and could be significantly higher. Compared to the two-process predictions, the observed trends of [X/Mg] with $A_{\\text{Ia}}/A_{\\text{cc}}$ are steeper for (C+N) but shallower for Ce, providing intriguing but contradictory clues about AGB enrichment in the early disk.",
      "pdf_url": "https://arxiv.org/pdf/2503.07738.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.18264",
      "title": "Identification of Anomalous E+A Galaxies in GAMA Using an Isolation Forest",
      "authors": [
        "Kieran Broadbelt",
        "Kevin Pimbblet",
        "Daniel J. Farrow"
      ],
      "abstract": "Identification of Anomalous E+A Galaxies in GAMA Using an Isolation Forest Kieran Broadbelt, Kevin Pimbblet, Daniel J. Farrow Accepted for publication in MNRAS. 17 pages, 11figures Astrophysics of Galaxies (astro-ph.GA) We implement an outlier detection model, an Isolation Foest (iForest), to uncover anomalous objects in the Galaxy and Mass Assembly Fourth Data Release (GAMA DR4). The iForest algorithm is an unsupervise Machine Learning (ML) technique. The data used is the spectroscopic and photometric data from GAMA DR4, which compiless information for over 300000 objects. We select two samples of galaxies to isolate, high signal-to-noise galaxies, to analyse the iForest's robustness, and E+A galaxies, to study the extremes of their population. This results in six-subsamples of spectroscopic, photometric and combined data isolations, finding 101 anomalous objects, half of which have not been identified as outliers in other works. We also find a number of fringing errors and false emission lines, displaying the iForest's potential in detecting these errors. Finding anomalous E+A galaxies, that although selected in a normal manner, using low [OII] and strong H{\\delta} absorption, are still star-forming, with strong H{\\alpha} emission. We propose two solutions to why these E+A galaxies are still star-forming but also question if these galaxies can be truly classified as E+A galaxies. We suggest that small-scale interactions on the galaxies causes small star bursts. The radiative pressure when forming high mass stars form expels the accreting material quicker than it can be accreted. We also suggest that the Jeans limit in our anomalous E+A galaxies is so low that it is simply not possible to form O and B class stars, but not low enough to fully prevent star-formation.",
      "pdf_url": "https://arxiv.org/pdf/2509.18264.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19468",
      "title": "Efficiency of viscous angular momentum transport in dissipating Be binaries",
      "authors": [
        "Peter Quigley",
        "Carol E. Jones",
        "Kenneth Gayley",
        "Anahi Granada",
        "Stan Owocki",
        "Rina Rast",
        "Mark Suffak",
        "Atsuo T. Okazaki",
        "Asif ud-Doula",
        "Jiří Krtička",
        "Alex C. Carciofi",
        "Jeremy J. Drake"
      ],
      "abstract": "Efficiency of viscous angular momentum transport in dissipating Be binaries Peter Quigley, Carol E. Jones, Kenneth Gayley, Anahi Granada, Stan Owocki, Rina Rast, Mark Suffak, Atsuo T. Okazaki, Asif ud-Doula, Jiří Krtička, Alex C. Carciofi, Jeremy J. Drake Accepted for publication in Astrophysics and Space Science Solar and Stellar Astrophysics (astro-ph.SR) Angular momentum transport is a fundamental process shaping the structure, evolution, and lifespans of stars and disks across a wide range of astrophysical systems. Be stars offer a valuable environment for studying viscous transport of angular momentum in massive stars, thanks to their rapid rotation, observable decretion disks, and likely absence of strong magnetic fields. This study analyzes angular momentum loss in 40 Be binary simulations spanning a range of orbital separations and companion masses, using a smoothed-particle hydrodynamics (SPH) code. A novel framework is introduced to define the outer disk edge based on the behavior of the azimuthal velocity, streamlining the analysis of angular momentum transport within the system. Applying this framework reveals that systems with smaller truncation radii tend to reaccrete a larger fraction of their angular momentum during dissipation, thereby inhibiting the stars ability to regulate its surface rotation. Modification of this rate may alter the star's mass-injection duty cycle or long-term evolutionary track. Finally, a subset of the simulations were post-processed using the Monte Carlo radiative transfer code \\texttt{HDUST}, generating synthetic observables including H$\\alpha$ line profiles, V-band polarization, and UV polarization. Suggestions for observational verification of the dynamical results are demonstrated using the simulated data.",
      "pdf_url": "https://arxiv.org/pdf/2509.19468.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19482",
      "title": "A self-consistent numerical model of internal wave-induced mean flow oscillations in polar geometry",
      "authors": [
        "Florentin Daniel",
        "Daniel Lecoanet"
      ],
      "abstract": "A self-consistent numerical model of internal wave-induced mean flow oscillations in polar geometry Florentin Daniel, Daniel Lecoanet 21 pages, 10 figures, submitted to JFM Solar and Stellar Astrophysics (astro-ph.SR); Fluid Dynamics (physics.flu-dyn) The Earth's Quasi-Biennial Oscillation (QBO) is a natural example of wave-mean flow interaction and corresponds to the alternating directions of winds in the equatorial stratosphere. It is due to internal gravity waves (IGW) generated in the underlying convective troposphere. In stars, a similar situation is predicted to occur, with the interaction of a stably-stratified radiative zone and a convective zone. In this context, we investigate the dynamics of this reversing mean flow by modelling a stably-stratified envelope and a convectively unstable core in polar geometry. Here, the coupling between the two zones is achieved self-consistently, and IGW generated through convection lead to the formation of a reversing azimuthal mean flow in the upper layer. We characterise the mean-flow oscillations by their periods, velocity amplitudes, and regularity. Despite a continuous broad spectrum of IGW, our work show good qualitative agreement with the monochromatic model of Plumb and McEwan (1978). If the latter was originally developed in the context of the Earth's QBO, our study could prove relevant for its stellar counterpart in massive stars, which host convective cores and radiative envelopes.",
      "pdf_url": "https://arxiv.org/pdf/2509.19482.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19534",
      "title": "Nature of Transonic Sub-Alfvénic Turbulence and Density Fluctuations in the Near-Sun Solar Wind: Insights from Magnetohydrodynamic Simulations and Nearly-Incompressible Models",
      "authors": [
        "Giuseppe Arrò",
        "Hui Li",
        "Gary P. Zank",
        "Lingling Zhao",
        "Laxman Adhikari"
      ],
      "abstract": "Nature of Transonic Sub-Alfvénic Turbulence and Density Fluctuations in the Near-Sun Solar Wind: Insights from Magnetohydrodynamic Simulations and Nearly-Incompressible Models Giuseppe Arrò, Hui Li, Gary P. Zank, Lingling Zhao, Laxman Adhikari Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Recent Parker Solar Probe measurements have revealed that solar wind (SW) turbulence transits from a subsonic to a transonic regime near the Sun, while remaining sub-Alfvénic. These observations call for a revision of existing SW models, where turbulence is considered to be both subsonic and sub-Alfvénic. In this Letter, we introduce a new magnetohydrodynamic (MHD) model of Transonic sub-Alfvénic Turbulence (TsAT). Our model shows that turbulence is effectively nearly-incompressible (NI) and has a 2D + slab geometry not only in the subsonic limit, but also in the transonic regime, as long as it remains sub-Alfvénic, a condition essentially enforced everywhere in the heliosphere by the strong local magnetic field. These predictions are consistent with 3D MHD simulations, showing that transonic turbulence is dominated by low frequency quasi-2D incompressible structures, while compressible fluctuations are a minor component corresponding to low frequency slow modes and high frequency fast modes. Our new TsAT model extends existing NI theories of turbulence, and is potentially relevant for the theoretical and numerical modeling of space and astrophysical plasmas, including the near-Sun SW, the solar corona, and the interstellar medium.",
      "pdf_url": "https://arxiv.org/pdf/2509.19534.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19583",
      "title": "Impact of the latest 22Ne+α reaction rates on nucleosynthesis in massive stars and galactic chemical evolution",
      "authors": [
        "Emma Kotar",
        "Shuya Ota",
        "Allyson Dewey",
        "Joshua Millman",
        "Lorenzo Roberti",
        "Marco Pignatari"
      ],
      "abstract": "Impact of the latest 22Ne+α reaction rates on nucleosynthesis in massive stars and galactic chemical evolution Emma Kotar, Shuya Ota, Allyson Dewey, Joshua Millman, Lorenzo Roberti, Marco Pignatari Solar and Stellar Astrophysics (astro-ph.SR) In massive stars (initial mass of > 9 solar masses), the weak s (slow neutron capture) process produces elements between Fe and Zr, enriching the Galaxy with these elements through core-collapse supernova explosions. The weak s-process nucleosynthesis is driven by neutrons produced in the 22Ne({\\alpha}, n)25Mg reaction during convective He-core and C-shell burning. The yields of heavy elements thus depend on the 22Ne({\\alpha}, n)25Mg and the competitive 22Ne({\\alpha}, {\\gamma})26Mg reaction rates which are dominated by several narrow-resonance reactions. While the accuracy of these rates has been under debate for decades, recent experimental efforts, including ours, drastically reduced these uncertainties. In this work, we use a set of 280 massive star nucleosynthesis models calculated using different 22Ne({\\alpha}, n)25Mg and 22Ne({\\alpha}, {\\gamma})26Mg rates, and a galactic chemical evolution (GCE) study to probe their impact on the weak s-process elemental abundances in the Galaxy. The GCE was computed with the OMEGA+ code, using the new sets of stellar yields with different 22Ne+{\\alpha} rates. From GCE, we find that these rates are causing up to 0.45 dex of variations in the [Cu/Fe], [Ga/Fe], and [Ge/Fe] ratios predicted at solar metallicity. The greatest impact on the stellar nucleosynthesis and GCE results derives from uncertainties in the ({\\alpha},n) strength ({\\omega}{\\gamma}({\\alpha},n)) of the Ex=11.32 MeV resonance. We show that the variations observed in the GCE calculations for the weak s-proess elements become negligibly smaller than dispersions found in observations once the {\\omega}{\\gamma}({\\alpha},n) is accurately determined within the uncertaintiy of 10 to 20% (typically reported experimental errors for the resonance) in future nuclear physics experiments.",
      "pdf_url": "https://arxiv.org/pdf/2509.19583.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19603",
      "title": "The periodicity of three-dimensional oscillatory reconnection",
      "authors": [
        "Luiz A. C. A. Schiavo",
        "Gert J. J. Botha",
        "James A. McLaughlin"
      ],
      "abstract": "The periodicity of three-dimensional oscillatory reconnection Luiz A. C. A. Schiavo, Gert J. J. Botha, James A. McLaughlin Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Oscillatory reconnection is a dynamic, magnetic relaxation mechanism in which a perturbed null point reverts back to equilibrium via time-dependent reconnection. In this paper, we investigate the long-term periodic signal generated by a three-dimensional (3D) magnetic null point, when it is perturbed by a non-periodic driver, for a variety of driving amplitudes. We solve the 3D nonlinear magnetohydrodynamic (MHD) equations using a bespoke numerical boundary condition (a sponge region) that damps wave reflections and thus allows the long-term periodic signal at the 3D null point to be investigated. We observe multiple cycles of the 3D oscillatory reconnection mechanism for the first time. We find that the periodicity is both constant and independent of the choice of driving amplitude. Furthermore, the resultant time-dependent current density at the null point normalized by the driving amplitude is invariant. We extract a single period for oscillatory reconnection at a 3D null point, opening the future possibility of using this characteristic period as a diagnostic tool to reveal indirectly the fundamental plasma properties of 3D null points.",
      "pdf_url": "https://arxiv.org/pdf/2509.19603.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19693",
      "title": "A comprehensive Gaia spectroscopic study of stars in the Sco-Cen complex: star formation history and disk lifetime",
      "authors": [
        "Min Fang",
        "Gregory J. Herczeg"
      ],
      "abstract": "A comprehensive Gaia spectroscopic study of stars in the Sco-Cen complex: star formation history and disk lifetime Min Fang, Gregory J. Herczeg 24 pages and 20 figures, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) We re-evaluate the star formation history of the nearby Sco-Cen OB Association with a comprehensive analysis of Gaia XP spectra of more than 7,800 potential members. New spectral classifications are obtained by fitting individual XP spectra with templates derived from empirical spectra of young stars. Combining these spectral classifications in this work and in the literature with archival photometry leads to estimates of V-band extinction and stellar luminosities for a total of 8,846 sources. Employing SPOTS models with spot coverages of 0.34 and 0.51 for K and M-type stars harmonizes age estimates between K/M-type and F/G-type stars, with ages older than are obtained for low-mass stars from standard evolutionary models. These older ages lead to a disk lifetime that is approximately two times longer than reported in previous literature. Our re-evaluation of the star formation history with these revised age estimates uncovers evidence of underlying substructures within the Sco-Cen complex.",
      "pdf_url": "https://arxiv.org/pdf/2509.19693.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19723",
      "title": "Magnetic Dip Found in a Quiescent Prominence Foot via Observation and Simulation",
      "authors": [
        "Huadong Chen",
        "Chun Xia",
        "Suli Ma",
        "Yingna Su",
        "Guiping Zhou",
        "Eric Priest",
        "Lyndsay Fletcher",
        "Yuandeng Shen",
        "Weining Tu",
        "Wei Wang",
        "Jun Zhang"
      ],
      "abstract": "Magnetic Dip Found in a Quiescent Prominence Foot via Observation and Simulation Huadong Chen, Chun Xia, Suli Ma, Yingna Su, Guiping Zhou, Eric Priest, Lyndsay Fletcher, Yuandeng Shen, Weining Tu, Wei Wang, Jun Zhang Solar and Stellar Astrophysics (astro-ph.SR) Solar prominences (or filaments) are cooler and denser plasma suspended in the much hotter and rarefied solar corona. When viewed on the solar disc filament barbs or feet protrude laterally from filament spine. When observed at the limb of the Sun, they reach into the chromosphere or even further down. For a long time, the magnetic field orientation of barbs has remained a mystery due to the paradox that the barbs possess vertical fine structures and flows but are likely to be supported in a horizontal magnetic field. Here we present unambiguous observations of a magnetic dip in a quiescent prominence foot with an upward-curved field. That is indicated by the horizontal bidirectional outflows probably produced by magnetic reconnection between the fields of a tiny erupting filament and those in a prominence foot. The altitude at the bottom of the dip is about 30 Mm. At the edge of the prominence foot, the angle between the dip field and the local horizontal is about 4 degrees. Additionally, the curvature radius of the dip bottom is estimated to be around 73 Mm. We also conduct magnetofrictional simulation to self-consistently form a large-scale magnetic flux rope with magnetic dips resembling the spine and feet of the quiescent prominence. The observations shed light on the field structure of prominences which is crucial for the instability that accounts for the eruption of prominences and coronal mass ejections.",
      "pdf_url": "https://arxiv.org/pdf/2509.19723.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19739",
      "title": "Variations of the vector magnetic structures in the solar polar regions observed by Hinode",
      "authors": [
        "Shuhong Yang",
        "Chunlan Jin",
        "Qiao Song",
        "Yuzong Zhang",
        "Yin Li",
        "Yijun Hou",
        "Ting Li",
        "Guiping Zhou",
        "Yuanyong Deng",
        "Jingxiu Wang"
      ],
      "abstract": "Variations of the vector magnetic structures in the solar polar regions observed by Hinode Shuhong Yang, Chunlan Jin, Qiao Song, Yuzong Zhang, Yin Li, Yijun Hou, Ting Li, Guiping Zhou, Yuanyong Deng, Jingxiu Wang 15 pages, 7 figures. Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) Using the polar vector magnetic field data observed by Hinode from 2012 to 2021, we study the long-term variations of the magnetic flux, the flux proportion of different polarities, and the magnetic inclination with respect to the local normal in the solar polar regions above 70 degree latitude during solar cycle 24. In both polar regions after the polarity reversal, the unsigned magnetic fluxes of the dominant polarity increased to a peak of about 1.3$\\times$10$^{22}$ Mx during the solar minimum, while those of the non-dominant polarity remained stable at approximately 0.5$\\times$10$^{22}$ Mx. The proportions of the dominant polarity flux in the total flux in both polar regions increased to more than 70% at the solar minimum. These results reveal that the total magnetic flux and the number of open field lines in solar cycle 24 were larger than those in solar cycle 23, and also imply the existence of a local dynamo in polar regions. After the polarity reversal, the magnetic inclination of the dominant polarity fields decreased, indicating that the stronger the dominant polarity field, the more vertical the field lines. The inclination angle decreased with the increase of the threshold of radial magnetic flux density, revealing a fanning-out structure of the polar magnetic patches.",
      "pdf_url": "https://arxiv.org/pdf/2509.19739.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19847",
      "title": "Atmospheric Gravity Waves Modulated by the Magnetic Field Configuration",
      "authors": [
        "Oana Vesa",
        "Julio Morales",
        "Jason Jackiewicz",
        "Gangadharan Vigeesh",
        "Kevin Reardon"
      ],
      "abstract": "Atmospheric Gravity Waves Modulated by the Magnetic Field Configuration Oana Vesa, Julio Morales, Jason Jackiewicz, Gangadharan Vigeesh, Kevin Reardon Solar and Stellar Astrophysics (astro-ph.SR) Atmospheric gravity waves (AGWs) are buoyancy-driven waves excited by turbulent convection and contribute to the dynamics and energy transport of the lower solar atmosphere. We present high-resolution, multi-wavelength observations from the Interferometric Bidimensional Spectrometer and the Solar Dynamics Observatory to investigate AGW behavior across different viewing geometries and magnetic field configurations. Using Fourier spectral analysis to compute phase differences and coherence spectra, we detect the signature of propagating AGWs carrying energy upwards at temporal and spatial scales consistent with theory, simulations, and prior observations. Although AGW behavior is modulated by the magnetic field configuration, particularly the field inclination, these effects are not highly discernible in our observed $k_{\\rm{h}}-\\nu$ phase difference diagrams. After filtering to isolate the AGW regime, we compute spatial coherence-weighted phase difference maps and examine binned coherence-weighted phase differences as functions of the field strength and inclination. Our results show that AGWs are efficiently suppressed and/or reflected in intermediate to strong, vertically oriented fields in the upper photosphere, while they propagate rather freely in QS and transverse fields. These findings agree with a simulated vertical 100 G field using CO$^{5}$BOLD. Simulated $k_{\\rm{h}}-\\nu$ phase differences derived from a 3D magnetohydrodynamic dispersion relation also qualitatively agree with our upper photospheric IBIS diagnostics and reinforce that the magnetic field configuration modulates the propagation of AGWs. This work demonstrates the potential of AGWs as magneto-seismology diagnostics for probing average magnetic field properties in the lower solar atmosphere.",
      "pdf_url": "https://arxiv.org/pdf/2509.19847.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19864",
      "title": "Polarity inversion line helicities and solar eruptivity",
      "authors": [
        "K. Moraitis",
        "J.K. Thalmann"
      ],
      "abstract": "Polarity inversion line helicities and solar eruptivity K. Moraitis, J.K. Thalmann Solar and Stellar Astrophysics (astro-ph.SR) This work examines the relationship between solar eruptivity and the relative helicity that is contained around the polarity inversion line (PIL) of the magnetic field, along with its current-carrying component. To this end, we analyze the evolution of the PIL helicities in a sample of $\\sim 40$ solar active regions which exhibited more than 200 flares of class M or higher. The computation of the PIL helicities is accomplished with the help of relative field line helicity, the recently-developed proxy for the density of relative helicity, following the extrapolation of the 3D coronal magnetic field with a nonlinear force-free method. We find that, on average, the relative helicity of the PIL decreases significantly, by more than $10\\%$, during stronger eruptive flares (M5.0 class and above), while smaller changes are observed for confined and/or weaker flares. The PIL current-carrying helicity shows higher-magnitude decreases in both strong and weak flares, reaching $20\\%$ average changes during the stronger eruptive flares. Notably, the PIL current-carrying helicity displays the most pronounced distinction between eruptive and confined flares, indicating its strong potential as a diagnostic of solar eruptivity. We discuss the implications of these findings for solar flare forecasting.",
      "pdf_url": "https://arxiv.org/pdf/2509.19864.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19987",
      "title": "Validating DIRECD: Statistical Evaluation of Coronal Mass Ejections Direction Estimates from Coronal Dimmings",
      "authors": [
        "Shantanu Jain",
        "Tatiana Podladchikova",
        "Karin Dissauer",
        "Astrid Veronig",
        "Amaia Razquinn"
      ],
      "abstract": "Validating DIRECD: Statistical Evaluation of Coronal Mass Ejections Direction Estimates from Coronal Dimmings Shantanu Jain, Tatiana Podladchikova, Karin Dissauer, Astrid Veronig, Amaia Razquinn 20 pages, 14 figures, accepted for publication in The Astrophysical Journal Supplement Series Solar and Stellar Astrophysics (astro-ph.SR) Coronal mass ejections (CMEs) are among the most energetic phenomena in our solar system, with significant implications for space weather. Understanding their early dynamics remains challenging due to observational limitations in the low corona. We present a statistical evaluation of the DIRECD (Dimming InfeRred Estimation of CME Direction) method, which provides a novel approach to determining initial CME propagation directions using coronal dimmings. We analyze 33 coronal dimming events well observed by SDO/AIA and validate our DIRECD results with 3D reconstructions from the Graduated Cylindrical Shell (GCS) model. We find generally good agreement between the DIRECD-derived inclinations and the GCS model. In the meridional plane (north--south direction), the mean difference in inclinations is $0.3^\\circ \\pm 7.8^\\circ$. In the equatorial plane (east--west direction), the mean difference is $-2.9^\\circ \\pm 18.9^\\circ$. In 3D, the inclinations show a mean difference of $1.2^\\circ \\pm 10.4^\\circ$. We further visually compare our method by projecting the DIRECD cones onto LASCO/C2 observations, and verify the model's ability to capture both the primary CME structure and associated secondary dimming regions. This work establishes DIRECD as a powerful, observationally grounded technique for determining the initial CME direction, offering new insights that complement existing reconstruction methods. The technique's unique capability to determine early CME direction in the low corona using coronal dimmings observed in EUV images makes it particularly valuable for improving space weather forecasting models.",
      "pdf_url": "https://arxiv.org/pdf/2509.19987.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20040",
      "title": "The role of photospheric magnetic flux diffusion in initiation of solar eruptions",
      "authors": [
        "Xinkai Bian",
        "Chaowei Jiang",
        "Yang Wang",
        "Peng Zou",
        "Xueshang Feng",
        "Pingbing Zuo",
        "Yi Wang"
      ],
      "abstract": "The role of photospheric magnetic flux diffusion in initiation of solar eruptions Xinkai Bian, Chaowei Jiang, Yang Wang, Peng Zou, Xueshang Feng, Pingbing Zuo, Yi Wang Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Solar eruptions may occur at different evolutionary stages of active regions, during which the photospheric motions manifest in various forms, including flux emergence, sunspot rotation, shearing, converging, and magnetic flux diffusion. However, it remains unclear what are the specific roles played by these different motions in leading to eruptions. Here, we employ high resolution magnetohydrodynamic simulations to demonstrate how solar eruptions can be initiated in a single bipolar configuration, driven by first shearing and then flux diffusion at the bottom surface. Flux diffusion disperses the photospheric magnetic flux, driving portions of it toward the polarity inversion line (PIL). This process leads to the expansion of core field, enhancing the pinching effect to form the current sheet. When magnetic reconnection occurs within this current sheet, the eruption is initiated, characterized by a rapid release of magnetic energy and accompanied by the formation of a erupting flux rope. Additionally, flux diffusion contributes to magnetic cancellation near the PIL, leading to the formation of a weakly twisted magnetic flux rope prior to the eruption. However, this pre-exist flux rope plays a limited role in eruption initiation, as its spatial position remains largely unchanged throughout the eruption. These findings demonstrate that the primary role of flux diffusion is to facilitate current sheet formation, highlighting the critical role of current sheet formation in eruption initiation.",
      "pdf_url": "https://arxiv.org/pdf/2509.20040.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20047",
      "title": "Atmospheric parameters and chemical abundances of the A-type eclipsing binary system RR Lyncis A and B",
      "authors": [
        "Yoichi Takeda"
      ],
      "abstract": "Atmospheric parameters and chemical abundances of the A-type eclipsing binary system RR Lyncis A and B Yoichi Takeda 16 pages, 10 figures, 5 tables (+ online material); accepted for publication in Journal of Astrophysics and Astronomy Solar and Stellar Astrophysics (astro-ph.SR) A spectroscopic study was carried out for the double-line A-type eclipsing binary system RR Lyn A+B based on the disentangled spectra, with an aim of clarifying the differences in photospheric chemical compositions between the components, where T_eff (effective temperature) and v_t (microturbulence) were determined from Fe lines. The resulting abundances of 30 elements revealed the following characteristics. (1) The brighter/hotter A shows metal-rich trends of classical Am stars; i.e., heavier elements generally show overabundances tending to increase towards higher Z (atomic number) with exceptionally large deficit of Sc, while light elements such as CNO show underabundances. (2) Meanwhile, the abundances of fainter/cooler B are closer to the solar composition ([X/H]~0 for intermediate Z elements such as Fe group) though [X/H] does exhibit a slightly increasing tendency with Z, which suggests that B is a kind of marginal Am star with almost normal metallicity. This consequence is in contrast to the results of previous studies, which reported B to be of metal-deficient nature similar to lambda Boo stars. Such distinctions of chemical abundances between A and B may serve as a key to understanding the condition for the emergence of Am phenomenon.",
      "pdf_url": "https://arxiv.org/pdf/2509.20047.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20096",
      "title": "Residual energy of magnetohydrodynamic shocks",
      "authors": [
        "S. W. Good",
        "K. J. Palmunen",
        "C. H. K. Chen",
        "E. K. J. Kilpua",
        "T. V. Mäkelä",
        "J. Ruohotie",
        "C. P. Sishtla",
        "J. E. Soljento"
      ],
      "abstract": "Residual energy of magnetohydrodynamic shocks S. W. Good, K. J. Palmunen, C. H. K. Chen, E. K. J. Kilpua, T. V. Mäkelä, J. Ruohotie, C. P. Sishtla, J. E. Soljento 9 pages, 6 figures; accepted for publication in the Monthly Notices of the Royal Astronomical Society 2025 September 24 Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) Residual energy quantifies the difference in energy between velocity and magnetic field fluctuations in a plasma. Recent observational evidence highlights that fast-mode interplanetary shock waves have positive residual energy, in sharp contrast to the negative residual energy of the turbulence and magnetic structures that constitute the vast majority of fluctuation power in the solar wind at magnetohydrodynamic (MHD) inertial scales. In this work, we apply the Rankine-Hugoniot conditions to derive an equation for the residual energy of an MHD shock jump as a function of the shock angle, density compression ratio and Alfvén Mach number upstream of the shock. An equation for the cross helicity is similarly derived. The residual energy equation gives only positive values for super-Alfvénic (i.e. fast-mode) shocks. The residual energy and cross helicity of slow-mode shocks and tangential, contact and rotational discontinuities are also determined. A simplified form of the residual energy equation applicable to perpendicular shocks has been verified against residual energy values directly estimated from observations of 141 interplanetary shocks; the equation is found to match well with observations, particularly for shocks with higher density compression ratios and Mach numbers. The use of positive residual energy as a signature for fast-mode shock identification in spacecraft data is briefly considered, and insights from this work relating to compressive fluctuations more generally in the solar wind are discussed.",
      "pdf_url": "https://arxiv.org/pdf/2509.20096.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20125",
      "title": "On the lower mass limit for circumbinary disc fragmentation",
      "authors": [
        "Matthew Teasdale",
        "Dimitris Stamatellos"
      ],
      "abstract": "On the lower mass limit for circumbinary disc fragmentation Matthew Teasdale, Dimitris Stamatellos Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) In recent years, many wide orbit circumbinary (CB) giant planets have been discovered; some of these may have formed by gravitational fragmentation of circumbinary discs. The aim of this work is to investigate the lower mass limit for circumbinary disc fragmentation. We use the Smoothed Particle Hydrodynamics (SPH) code SEREN, which employs an approximate method for the radiative transfer, to perform 3 sets of simulations of gravitationally unstable discs. The first set of simulations covers circumstellar discs heated by a single 0.7$\\,{\\rm M}_{\\odot}$ star (CS model), the second set covers binaries with the same total stellar mass as the CS model, attended by circumbinary discs with the same temperature profile (CB fiducial model), and the third set covers circumbinary discs heated by each individual star (CB realistic model). We vary the binary separation, mass ratio and eccentricity to see their effect on disc fragmentation. For the circumstellar disc model, we find a lower disc-to-star mass ratio for fragmentation of $\\sim\\,$0.31. For the circumbinary fiducial disc model we find the same disc-to-star mass ratio for fragmentation (but slightly lower for more eccentric, equal-mass binaries; 0.26). On the other hand, realistic circumbinary discs fragment at a lower mass limit (disc-to-star mass ratio of 0.17\\,-\\,0.26), depending on the binary properties. We conclude that circumbinary discs fragment at a lower disc mass (by $\\sim 45\\%$) than circumstellar discs. Therefore, gas giant planet around binaries may be able to form by gravitational instability easier than around single stars.",
      "pdf_url": "https://arxiv.org/pdf/2509.20125.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20202",
      "title": "Solar and Stellar Activity",
      "authors": [
        "S. Bellotti",
        "J. Morin"
      ],
      "abstract": "35 pages, 10 figures, 1 table, to be published as a chapter in 'Space Environments and their Impact on Exoplanets', editor O. Cohen Solar and Stellar Astrophysics (astro-ph.SR) This chapter provides an overview of the magnetic activity of the Sun and stars, discussing its underlying physical origin, manifestations, and fundamental role in exoplanet studies. It begins with a summary of the Sun's magnetic activity from the surface towards the outer atmospheric layers, highlighting features such as sunspots, faculae, chromospheric structures, and their temporal modulation known as the activity cycle. These phenomena are sustained throughout the lifetime of the Sun by the magnetic dynamo, which is driven by differential rotation and convective flows. Furthermore, extending these concepts to other stars, the chapter examines the diagnostics that are typically employed to track and quantify the magnetic activity level of stars, and it reviews spectropolarimetry, an observational technique with which to characterise stellar magnetic fields. We finally outline results from both observations and theoretical modelling of stellar activity across distinct spectral types, and we describe the variety of methods used to search for stellar activity cycles, underscoring the multi-wavelength nature of this field of research.",
      "pdf_url": "https://arxiv.org/pdf/2509.20202.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20264",
      "title": "An Educational Guide for 2D Stellar Structure Calculations of Rapidly Rotating Stars using the ESTER code",
      "authors": [
        "Russel White",
        "Jane Pratt",
        "Michel Rieutord"
      ],
      "abstract": "An Educational Guide for 2D Stellar Structure Calculations of Rapidly Rotating Stars using the ESTER code Russel White, Jane Pratt, Michel Rieutord Lawrence Livermore National Laboratory Technical Report, FY 2025 Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Evolution STEllaire en Rotation (ESTER) code is the first 2D stellar structure code to be made open-source and freely available to the astronomy and astrophysics community. An important and novel advancement of this code is that it can reproduce the distorted shape and observable signatures (e.g., gravity darkening) of rapidly rotating stars. ESTER also calculates the steady-state large-scale flows within the star, namely their differential rotation and associated meridional circulation. In this report, we explore and document the physics implemented within version 1.1.0rc2 of the ESTER code, in a way that complements published descriptions. We illustrate this physics by plotting how stellar structure parameters vary through stellar interiors at a range of latitudes and at different angular velocities. We investigate how the thin convective envelopes of intermediate mass stars vary with latitude when rapidly rotating, becoming deeper and thicker near the equator. Simple comparisons of ESTER model predictions (e.g., central temperature and density, luminosity) with the output from the Modules for Experiments in Stellar Astrophysics (MESA) code [Paxton et al., 2010] shows generally good agreement. Additional comparisons provide important benchmarking and verification for ESTER as a comparatively young code. Finally, we provide a guide for installing and running the code on our local university cluster, aimed at helping students to begin work.",
      "pdf_url": "https://arxiv.org/pdf/2509.20264.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19442",
      "title": "Observational Constraints on Evolution of Dust Disc Properties in Upper Scorpius",
      "authors": [
        "Paola Pinilla",
        "Anibal Sierra",
        "Nicolas T. Kurtovic",
        "Rossella Anania",
        "Sean Andrews",
        "John Carpenter",
        "Osmar Guerra-Alvarado",
        "Feng Long",
        "Sebastian Marino",
        "Miguel Vioque",
        "Ke Zhang"
      ],
      "abstract": "Observational Constraints on Evolution of Dust Disc Properties in Upper Scorpius Paola Pinilla, Anibal Sierra, Nicolas T. Kurtovic, Rossella Anania, Sean Andrews, John Carpenter, Osmar Guerra-Alvarado, Feng Long, Sebastian Marino, Miguel Vioque, Ke Zhang Accepted for publication in MNRAS, available tables at this https URL Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Protoplanetary discs in the Upper Scorpius star-forming region are excellent laboratories to investigate late stages of planet formation. In this work, we analyse the morphology of the dust continuum emission of 121 discs from an ALMA Band 7 survey of the Upper Scorpius region. This analysis is done in the visibility plane, to measure the flux, geometry and characterise potential structures. We compare the results with state-of-the art gas and dust evolution models that include external photoevaporation, with mild values of the $F_{\\rm{UV}}$ of 1-40$G_0$. From the visibility analysis, 52 of the 121 discs are resolved (43%). From the resolved discs, 24 discs have structures and 28 remain as smooth discs at the mean resolution scale of $\\sim$0.1$^{\\prime \\prime}$ (~14au). Our results show no significant dust disc size evolution of the surviving discs in UpperSco when compared to discs in younger star-forming regions, such as Lupus. We find a strong, steeper-than-previously-reported correlation between dust disc size and disc millimeter continuum luminosity, in agreement with drift-dominated dust evolution models. We also find positive correlations between the dust disc mass vs. stellar mass and dust disc size vs. stellar mass. The slope of the dust disc size vs. stellar mass relationship is steeper compared to younger star forming regions. Additionally, we observe no significant correlation between dust disc properties and the environmental $F_{\\rm{UV}}$, consistent with models predicting that dust disc properties are primarily shaped by drift and dust traps. Our models predict that gas disc masses and sizes should be highly affected by the moderate $F_{\\rm{UV}}$ values that Upper Scorpius discs experience in contrast to the dust, highlighting the need for deeper and higher-resolution gas observations of these discs exposed to mild external photoevaporation.",
      "pdf_url": "https://arxiv.org/pdf/2509.19442.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19647",
      "title": "A Deep Dive into the Impact of Solar Storms on LEO Satellite Networks",
      "authors": [
        "Eunju Kang",
        "Alagappan Ramanathan",
        "Sangeetha Abdu Jyothi"
      ],
      "abstract": "A Deep Dive into the Impact of Solar Storms on LEO Satellite Networks Eunju Kang, Alagappan Ramanathan, Sangeetha Abdu Jyothi Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR); Networking and Internet Architecture (cs.NI) Low Earth Orbit (LEO) satellite networks are an important part of the global communication infrastructure today. Despite ongoing efforts to improve their resilience, they remain vulnerable to component damage and deorbiting under harsh space weather conditions. Prior work identified a modest but noticeable impact on LEO satellite network performance during solar storms, typically manifesting as an immediate rise in packet loss and a sustained increase in round-trip time (RTT). However, these studies offer only coarse-grained insights and do not capture the nuanced spatial and temporal patterns of disruption across the LEO network. In this paper, we conduct a deep dive into the impact of solar storms on LEO satellite communications. By localizing the impact of increased atmospheric drag at the level of individual satellites and orbits, we reveal significant heterogeneity in how different parts of the network are affected. We find that the degree of performance degradation varies significantly across geographic regions, depending on satellite positioning during the storm. Specifically, we find that (i) not all satellite orbits are equally vulnerable, (ii) within a given orbit, certain satellites experience disproportionate impact depending on their position relative to geomagnetic conditions, and (iii) autonomous maneuvering of satellites might be a cause of the sustained increase in RTT. Our findings uncover previously overlooked patterns of vulnerability in LEO satellite constellations and highlight the need for more adaptive, region-aware mitigation strategies to address space weather-induced network disruptions.",
      "pdf_url": "https://arxiv.org/pdf/2509.19647.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR",
        "cs.NI"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20227",
      "title": "Runaway origins of a disc mass gradient in $σ$ Orionis",
      "authors": [
        "Gavin A. L. Coleman",
        "Thomas J. Haworth",
        "Jinyoung Serena Kim"
      ],
      "abstract": "Runaway origins of a disc mass gradient in $σ$ Orionis Gavin A. L. Coleman, Thomas J. Haworth, Jinyoung Serena Kim Accepted for publication in MNRAS. 7 pages, 4 figures Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Radiation from massive stars is known to significantly affect the evolution of protoplanetary discs around surrounding stars by driving external photoevaporative winds. Typically most studies assume that the massive stars driving these winds are comoving with their associated clusters. However, it is also known that massive stars can be runaways, after being violently ejected from their birth environment through interactions with other massive stars. In this letter, we show that the well studied system $\\sigma~{\\rm Ori~AB}$ is actually a runaway system, only now passing through $\\sigma~{\\rm Orionis}$. There are multiple observable features that indicate this is the case, including significantly larger proper motions for $\\sigma~{\\rm Orionis}$ than the surrounding stars, an infrared arc of ionising gas along the predicted velocity vector, and a disparity in protoplanetary disc masses across $\\sigma~{\\rm Orionis}$. We finally use protoplanetary disc evolution models to explain the observed disparity in disc masses, showing that those discs downstream of $\\sigma~{\\rm Ori~AB}$, i.e. those yet to encounter it, have larger masses than those upstream, consistent with observations. Overall, our work highlights the importance of understanding the dynamical history of star forming regions, since the time varying UV fields provided by runway stars results in a complex history for the evolution of the protoplanetary discs.",
      "pdf_url": "https://arxiv.org/pdf/2509.20227.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.01154",
      "title": "Benchmark stars for mean stellar density and surface gravity estimates of solar-type stars",
      "authors": [
        "P. F. L. Maxted"
      ],
      "abstract": "Benchmark stars for mean stellar density and surface gravity estimates of solar-type stars P. F. L. Maxted 17 pages, 8 figures. Published in MNRAS. Including corrections to Table 1 and Table 3 described in the erratum this https URL Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Adding an independent estimate of the mean stellar density, $\\rho_{\\star}$, as a constraint in the analysis of stars that host transiting exoplanets can significantly improve the precision of the planet radius estimate in cases where the light curve is too noisy to yield an accurate value of the transit impact parameter, e.g. the light curves of Earth-size planets orbiting in the habitable zone of Sun-like stars that will be obtained by the PLATO mission. I have compiled a sample of 36 solar-type stars for which analysis of high-quality light curves together with constraints on the orbital eccentricity yield mean stellar density measurements with a median error of 2.3%. Of these, 8 are in transiting exoplanet systems and 28 in eclipsing binary systems with very low mass companions that contribute <0.1% of the total flux in the V band. A re-calibrated empirical relation for stellar mass as a function of T$_{\\rm eff}$, $\\rho_{\\star}$ and [Fe/H] has been used to find mass estimates with a typical precision of 5.2% for the stars in this sample. Examples are given of how this sample can be used to test the accuracy and precision of $\\rho_{\\star}$ and log(g) estimates from catalogues of stellar parameters for solar-type stars.",
      "pdf_url": "https://arxiv.org/pdf/2505.01154.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19453",
      "title": "The Platonic Universe: Do Foundation Models See the Same Sky?",
      "authors": [
        "UniverseTBD: Kshitij Duraphe",
        "Michael J. Smith",
        "Shashwat Sourav",
        "John F. Wu"
      ],
      "abstract": "The Platonic Universe: Do Foundation Models See the Same Sky? UniverseTBD: Kshitij Duraphe, Michael J. Smith, Shashwat Sourav, John F. Wu 9 pages, 3 tables, 1 figure. Accepted as a workshop paper to Machine Learning and the Physical Sciences at NeurIPS 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) We test the Platonic Representation Hypothesis (PRH) in astronomy by measuring representational convergence across a range of foundation models trained on different data types. Using spectroscopic and imaging observations from JWST, HSC, Legacy Survey, and DESI, we compare representations from vision transformers, self-supervised models, and astronomy-specific architectures via mutual $k$-nearest neighbour analysis. We observe consistent scaling: representational alignment generally increases with model capacity across our tested architectures, supporting convergence toward a shared representation of galaxy astrophysics. Our results suggest that astronomical foundation models can use pre-trained general-purpose architectures, allowing us to capitalise on the broader machine learning community's already-spent computational investment.",
      "pdf_url": "https://arxiv.org/pdf/2509.19453.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19758",
      "title": "Report on LEO satellite impacts on ground-based optical astronomy for the Rubin Observatory LSST",
      "authors": [
        "Phanindra Kandula",
        "Lee Kelvin",
        "Erfan Nourbakhsh",
        "Daniel Polin",
        "Tom Prince",
        "Meredith Rawls",
        "Adam Snyder",
        "Brianna Smart",
        "Christopher Stubbs",
        "Anthony Tyson",
        "Zeljko Ivezic",
        "Craig Lage",
        "Clare Saunders"
      ],
      "abstract": "Report on LEO satellite impacts on ground-based optical astronomy for the Rubin Observatory LSST Phanindra Kandula, Lee Kelvin, Erfan Nourbakhsh, Daniel Polin, Tom Prince, Meredith Rawls, Adam Snyder, Brianna Smart, Christopher Stubbs, Anthony Tyson, Zeljko Ivezic, Craig Lage, Clare Saunders Instrumentation and Methods for Astrophysics (astro-ph.IM) In August 2025 a workshop was convened to bring together experts to better understand steps that can be taken to mitigate the impact of satellite constellations on astronomical observations. At the time, just over 12,000 operational satellites were in low-Earth orbit (LEO). Although reflected sunlight and emissions all across the electromagnetic spectrum from artificial satellites impact scientific observations and the sky, the workshop focused on reflected sunlight in the wavelength range 330 nm to 1100 nm. This aligns with the Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST) planned imaging observations over the coming decade. Among other conclusions, we affirm previous recommendations that tracked satellite apparent magnitudes should be no brighter than 7th AB mag. The workshop participants discussed over 30 publications, reports, and presentations, and arrived at the Findings and Recommendations presented here. During the workshop, in addition to affirming many existing recommendations and best practices, the group discovered new issues and devised possible mitigations. These were nearly equally divided between advice to satellite builders and operators and to the observational astronomy community. While the workshop prioritized considerations for LSST, our hope is that many of the Findings and Recommendations will also apply to other observatories and constellations, and that all satellite companies will continue to engage in dialog with sky observers across the globe.",
      "pdf_url": "https://arxiv.org/pdf/2509.19758.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19984",
      "title": "First Data of the 3000 km$^2$ Radio Detector at the Pierre Auger Observatory",
      "authors": [
        "Bjarni Pont"
      ],
      "abstract": "First Data of the 3000 km$^2$ Radio Detector at the Pierre Auger Observatory Bjarni Pont (for the Pierre Auger Collaboration) Presented at the 39th International Cosmic Ray Conference (ICRC 2025). 8 pages, 7 figures Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) In this contribution, we present the status and first data from the Radio Detector (RD) at the Pierre Auger Observatory, consisting of $1660$ radio antennas deployed across the $3000$ km$^2$ surface detector array. These antennas measure the radio emission from extensive air showers in the $30-80$ MHz band, enabling electromagnetic energy measurements for air showers with zenith angles above $65°$. Combined with the muonic measurements from the water-Cherenkov detectors (WCDs), this allows mass composition studies at the highest energies. The large-scale deployment of the RD began in November 2023 and was completed in November 2024. A full end-to-end calibration shows consistency between Galactic and in-lab calibration to better than $5$\\% and includes continuous monitoring for hardware failures, ensuring, for example, antenna alignment within $5°$. We present the first data, demonstrating a strong correlation between the electromagnetic energy measured by the RD and the total shower energy measured by the WCD, confirming that the detector chain - including triggering, data readout, absolute calibration, and reconstruction is well understood. We highlight a particularly impressive $32$ EeV shower at a zenith angle of $85°$, producing a $50$ km-long radio footprint, showcasing the unique capabilities of this detector.",
      "pdf_url": "https://arxiv.org/pdf/2509.19984.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20310",
      "title": "Deep learning for exoplanet detection and characterization by direct imaging at high contrast",
      "authors": [
        "Théo Bodrito",
        "Olivier Flasseur",
        "Julien Mairal",
        "Jean Ponce",
        "Maud Langlois",
        "Anne-Marie Lagrange"
      ],
      "abstract": "Deep learning for exoplanet detection and characterization by direct imaging at high contrast Théo Bodrito, Olivier Flasseur, Julien Mairal, Jean Ponce, Maud Langlois, Anne-Marie Lagrange Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Machine Learning (cs.LG) Exoplanet imaging is a major challenge in astrophysics due to the need for high angular resolution and high contrast. We present a multi-scale statistical model for the nuisance component corrupting multivariate image series at high contrast. Integrated into a learnable architecture, it leverages the physics of the problem and enables the fusion of multiple observations of the same star in a way that is optimal in terms of detection signal-to-noise ratio. Applied to data from the VLT/SPHERE instrument, the method significantly improves the detection sensitivity and the accuracy of astrometric and photometric estimation.",
      "pdf_url": "https://arxiv.org/pdf/2509.20310.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19549",
      "title": "A High-Precision, Differentiable Code for Solar System Ephemerides",
      "authors": [
        "Ben Cassese",
        "Malena Rice",
        "Tiger Lu"
      ],
      "abstract": "A High-Precision, Differentiable Code for Solar System Ephemerides Ben Cassese, Malena Rice, Tiger Lu Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present jorbit, a python/JAX library designed to enable modern data-driven numerical studies of the solar system. Written entirely in JAX, an auto-differentiable and optionally GPU accelerated language behind many current large-scale machine learning efforts, jorbit includes an independent implementation of REBOUND's IAS15 integrator and the ability to parse precomputed ephemerides such as the JPL DE series. In its default behavior, jorbit maintains ~1 mas agreement with JPL Horizons on ~decade timescales for typical main-belt asteroids, enabling it to fully capitalize on high-precision astrometry and ranging data. We include details of the code's implementation and several worked examples, including illustrations of jorbit's ability to simulate N-body systems, forward model astrometric data, fit orbits, replicate the Minor Planet Center's \"MPChecker\" service, and contribute to modeling the effect of minor planets on stellar light curves.",
      "pdf_url": "https://arxiv.org/pdf/2509.19549.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.02746",
      "title": "21st-Century Astrobiology Missions Should Seek These High-Confidence Biosignatures",
      "authors": [
        "Christopher Temby",
        "Jan Spacek"
      ],
      "abstract": "21st-Century Astrobiology Missions Should Seek These High-Confidence Biosignatures Christopher Temby, Jan Spacek Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) This white paper was submitted to NASA's Search For Life Science Analysis Group (SFL-SAG): To ensure that the first mission designed to seek signs of extant life since 1976 is able to produce an unambiguous biological interpretation, the SFL-SAG is tasked with identifying the most high-confidence, agnostic biosignatures which are targetable, detectable, and measurable in Martian subsurface mid-latitude ice. To aid in this effort, this white paper highlights three examples of target materials or phenomena, along with associated instrument concepts, which the SFL-SAG shall prioritize in its efforts to define the appropriate astrobiological strategy. These include 1) polyelectrolyte informational biopolymers, 2) macromolecular biological homochirality, and 3) chiral-specific metabolic reactions. The Agnostic Life Finding Association (ALFA) and University of Florida (UF) support the development of instrumentation that seeks these high-confidence biosignatures.",
      "pdf_url": "https://arxiv.org/pdf/2508.02746.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.14318",
      "title": "Mapping the SO2 Shoreline in Gas Giant Exoplanets",
      "authors": [
        "Ian J. M. Crossfield",
        "Eva-Maria Ahrer",
        "Jonathan Brande",
        "Laura Kreidberg",
        "Joshua Lothringer",
        "Caroline Piaulet-Ghorayeb",
        "Jesse Polman",
        "Luis Welbanks",
        "James Kirk",
        "Diana Powell",
        "Niloofar Khorshid"
      ],
      "abstract": "Mapping the SO2 Shoreline in Gas Giant Exoplanets Ian J. M. Crossfield, Eva-Maria Ahrer, Jonathan Brande, Laura Kreidberg, Joshua Lothringer, Caroline Piaulet-Ghorayeb, Jesse Polman, Luis Welbanks, James Kirk, Diana Powell, Niloofar Khorshid 16 pages, 7 figures, >900 models and spectra at this https URL . Resubmitted to ApJ (on 29 Aug) after referee review. Updated to include HAT-P-26b reference Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) JWST has revealed sulfur chemistry in giant exoplanet atmospheres, where molecules such as SO2 trace photochemistry, metallicity, and formation and migration. To ascertain the conditions that determine whether (or how much) SO2, H2S, and other sulfur-bearing species are present in exoplanet atmospheres, we present a grid of planetary atmospheres covering metallicities from 0.3-1000x Solar and temperatures from 250-2050 K. These models map out the 'SO2 shoreline,' the region of metallicity and irradiation for which SO2 may be sufficiently abundant to be detectable. SO2 is a sensitive indicator of metallicity; expected SO2 abundances also depend strongly on overall temperature and C/O ratio; the SO2 abundance depends surprisingly weakly on XUV irradiation, also weakly on Kzz (for Teq > 600 K), and is essentially independent of internal temperature. Despite its detection in a growing number of giant planets, SO2 is never the dominant sulfur-bearing molecule: depending on temperature and metallicity, H2S, S2, NS, SO, SH, and even S8 or atomic S are frequently as common (or more so) as SO2. Nonetheless SO2 remains the most easily detectable sulfur-bearing species, followed by H2S, though perhaps SO and SH could be detectable in some gas giants. Aside from a pressing need for additional observational constraints on sulfur, we also identify the need for future work to account for the effects of clouds and hazes, fully self-consistent atmospheric models, 2D and 3D models, a wider range of planetary masses and radii, and studies to measure and refine reaction rates and molecular opacities of sulfur-bearing species",
      "pdf_url": "https://arxiv.org/pdf/2509.14318.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19492",
      "title": "Searching for GEMS: TOI-5349b is a Saturn-like planet orbiting a metal-rich early M-dwarf",
      "authors": [
        "Angeli Sandoval",
        "Caleb I. Cañas",
        "Shubham Kanodia",
        "Knicole D. Colón",
        "Andrew Monson",
        "Alexander Larsen",
        "Tera N. Swaby",
        "Henry A. Kobulnicky",
        "Philip I. Choi",
        "Sage Santomenna",
        "Pei Qin",
        "Michael Rodruck",
        "William D. Cochran",
        "Nina Brown",
        "Madison Brady",
        "Andreas Seifahrt",
        "Arvind F. Gupta",
        "Jesus Higuera",
        "Mark E. Everett",
        "Zuri Barksdale",
        "Ritvik Basant",
        "Jacob L. Bean",
        "Scott A. Diddams",
        "Giannina Guzmán Caloca",
        "Samuel Halverson",
        "Jessica Libby-Roberts",
        "Andrea S.J. Lin",
        "Rafael Luque",
        "Arpita Roy",
        "Guðmundur Stefánsson"
      ],
      "abstract": "Searching for GEMS: TOI-5349b is a Saturn-like planet orbiting a metal-rich early M-dwarf Angeli Sandoval, Caleb I. Cañas, Shubham Kanodia, Knicole D. Colón, Andrew Monson, Alexander Larsen, Tera N. Swaby, Henry A. Kobulnicky, Philip I. Choi, Sage Santomenna, Pei Qin, Michael Rodruck, William D. Cochran, Nina Brown, Madison Brady, Andreas Seifahrt, Arvind F. Gupta, Jesus Higuera, Mark E. Everett, Zuri Barksdale, Ritvik Basant, Jacob L. Bean, Scott A. Diddams, Giannina Guzmán Caloca, Samuel Halverson, Jessica Libby-Roberts, Andrea S.J. Lin, Rafael Luque, Arpita Roy, Guðmundur Stefánsson 24 pages, 8 figures, 4 tables, submitted to AAS Earth and Planetary Astrophysics (astro-ph.EP) We report the confirmation and analysis of TOI-5349b, a transiting, warm, Saturn-like planet orbiting an early M-dwarf with a period of $\\sim$3.3 days, which we confirmed as part of the Searching for GEMS (Giant Exoplanets around M-dwarf Stars) survey. TOI-5349b was initially identified in photometry from NASA's Transiting Exoplanet Survey Satellite (TESS) mission and subsequently confirmed using high-precision radial velocity (RV) measurements from the Habitable-zone Planet Finder (HPF) and MAROON-X spectrographs, and from ground-based transit observations obtained using the 0.6-m telescope at Red Buttes Observatory (RBO) and the 1.0-m telescope at the Table Mountain Facility of Pomona College. From a joint fit of the RV and photometric data, we determine the planet's mass and radius to be $0.40\\pm 0.02~\\mathrm{M_J}$ ($127.4_{-5.7}^{+5.9}~M_\\oplus$) and $0.91\\pm 0.02~\\mathrm{R_J}$ ($10.2\\pm 0.3~R_\\oplus$), respectively, resulting in a bulk density of $\\rho_p=0.66 \\pm0.06~\\mathrm{g~cm^{-3}}$ ($\\sim$0.96 the density of Saturn). We determine that the host star is a metal-rich M1-type dwarf with a mass and radius of $0.61 \\pm 0.02~M_\\odot$ and $0.58\\pm 0.01~R_\\odot$, and an effective temperature of $T_\\mathrm{eff} = 3751 \\pm 59$ K. Our analysis highlights an emerging pattern, exemplified by TOI-5349, in which transiting GEMS often have Saturn-like masses and densities and orbit metal-rich stars. With the growing sample of GEMS planets, comparative studies of short-period gas giants orbiting M-dwarfs and Sun-like stars are needed to investigate how metallicity and disk conditions shape the formation and properties of these planets.",
      "pdf_url": "https://arxiv.org/pdf/2509.19492.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19641",
      "title": "Flipping particles with nodal circulations by general relativity under the presence of an inner perturber",
      "authors": [
        "Gonzalo Carlos de Elía",
        "Macarena Zanardi",
        "Carla Florencia Coronel",
        "Agustín Dugaro"
      ],
      "abstract": "Flipping particles with nodal circulations by general relativity under the presence of an inner perturber Gonzalo Carlos de Elía, Macarena Zanardi, Carla Florencia Coronel, Agustín Dugaro 13 pages, 5 figures, Accepted for publication in Research in Astronomy and Astrophysics Earth and Planetary Astrophysics (astro-ph.EP) From a secular Hamiltonian up to the quadrupole level with general relativity (GR), we study nodal circulations with orbital flips of test particles of the Habitable Zone (HZ) around a solar-mass star, which are perturbed by an inner planetary-mass companion. Nodal circulations with orbital flips of an HZ test particle with eccentricity e2 are possible for any mass m1 and eccentricity e1 of the inner perturber and a suitable inclination i2. In particular, the greater the values of m1 and e2 , the smaller the minimum extreme inclination i2 capable of producing nodal circulations with orbital flips for each e1. As long as nodal librations with orbital flips are not possible for any i2, the greater the values of m1, e1, and e2, the larger the region of the plane ({\\Omega}2, i2) associated with nodal circulations with orbital flips. If nodal librations with orbital flips occur, the region of the plane ({\\Omega}2, i2) referred to nodal circulations with orbital flips increases with a decrease in m1 and e2, and with an increase in e1. We observe very good agreements between the analytical criteria and the N-body experiments for m1 ranging from Earth-mass planets to super-Jupiters, and small and moderate e2. The main discrepancies are found for high e2, which are more evident with an increase in m1 and e1.",
      "pdf_url": "https://arxiv.org/pdf/2509.19641.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20197",
      "title": "Gravitational scattering of ejecta in the Didymos system cannot explain the evolution of the binary's orbital period",
      "authors": [
        "Harrison Agrusa",
        "Camille Chatenet"
      ],
      "abstract": "Gravitational scattering of ejecta in the Didymos system cannot explain the evolution of the binary's orbital period Harrison Agrusa, Camille Chatenet Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) In the first few months following the DART impact on Dimorphos, it appears that the orbital period dropped by ${\\sim} 30$ s in addition to the immediate ${\\sim}30 $ min drop. This effect has been attributed to ``binary hardening,'' whereby the binary's orbital period would have gradually decreased as Dimorphos continuously scattered bound ejecta out of the system and lost angular momentum. We investigated this hypothesis with the goal of constraining the conditions that would lead to a gradual decrease in the binary's orbital period. We used $N$-body simulations to study the dynamical evolution of the Didymos system under the influence of a cloud of massive test particles. We demonstrate that the gravitational scattering of ejecta is not a plausible explanation for Dimorphos's anomalous orbital period drop under any circumstances. This is a result of Dimorphos's escape speed being low compared to its orbital velocity, making it a weak scatterer. If a significant fraction of DART ejecta was launched at low speeds, as impact models and scaling laws suggest, then the binary's orbital period was likely increased as this material was accreted back onto Didymos and Dimorphos. Therefore, some additional mechanism must have overcome this effect, leading to a net orbital period decrease.",
      "pdf_url": "https://arxiv.org/pdf/2509.20197.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2404.05805",
      "title": "Metallicity dependence of dust growth in a protoplanetary disk",
      "authors": [
        "Ryoki Matsukoba",
        "Eduard I. Vorobyov",
        "Takashi Hosokawa"
      ],
      "abstract": "Metallicity dependence of dust growth in a protoplanetary disk Ryoki Matsukoba, Eduard I. Vorobyov, Takashi Hosokawa 13 pages, 12 figures, This work has been published in ApJ as arXiv:2509.18449 Earth and Planetary Astrophysics (astro-ph.EP) In the context of planet formation, growth from micron-sized grains to kilometer-sized planetesimals is a crucial question. Since the dust growth rate depends on the amount of dust, realizing planet formation scenarios based on dust growth is challenging in environments with low metallicity, i.e. less dust. We investigate dust growth during disk evolution, particularly focusing on the relationship with metallicity. We perform two-dimensional thin-disk hydrodynamic simulations to track the disk evolution over 300 kyr from its formation. The dust motion is solved separately from the gas motion, with its distribution changing due to drag forces from the gas. Dust size growth is also accounted for, with the magnitude of the drag force varying according to the dust size. We employ three models with metallicities of 1.0, 0.1, and 0.01 ${\\rm Z}_{\\odot}$, i.e. dust-to-gas mass ratios of 10$^{-2}$, 10$^{-3}$, and 10$^{-4}$, respectively. In the disks with the metallicities $\\ge0.1$ ${\\rm Z}_{\\odot}$, the dust radii reach cm sizes, consistent with estimations from the dust growth timescale. Conversely, for the metallicity of 0.01 ${\\rm Z}_{\\odot}$, the maximum dust size is only 10$^{-2}$ cm, with almost no growth observed across the entire disk scale ($\\sim$100 au). At the metallicities $\\ge0.1$ ${\\rm Z}_{\\odot}$, the decoupling between grown dust and gas leads to non-uniform dust-to-gas mass ratios. However, deviations from the canonical value of this ratio have no impact on the gravitational instability of the disk. The formation of dust rings is confirmed in the innermost part of the disk ($\\sim$10-30 au). The dust rings where the dust-to-gas mass ratio is enhanced, and the Stokes number reaches $\\sim$0.1, are suitable environments for the streaming instability. We conjecture that planetesimal formation occurs through the streaming instability in these dust rings.",
      "pdf_url": "https://arxiv.org/pdf/2404.05805.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}