{
  "date": "2026-02-27",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.GA",
    "astro-ph.EP",
    "astro-ph.CO",
    "astro-ph.SR",
    "astro-ph.IM",
    "astro-ph.HE"
  ],
  "total_papers": 107,
  "gw_related_papers": 3,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.08672",
      "title": "Low-Mass Neutron Stars and Effective Phase Transitions from a Hybrid Van der Waals-Polytropic Equation of State",
      "authors": [
        "P. H. F. Arruda",
        "S. D. Campos"
      ],
      "abstract": "Low-Mass Neutron Stars and Effective Phase Transitions from a Hybrid Van der Waals-Polytropic Equation of State P. H. F. Arruda, S. D. Campos Theoretical study of the application of a piecewise state in neutron star astrophysics: 5 tables and 8 figures High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) We study phase-transition-like behavior in neutron stars using a simplified, piecewise equation of state that couples a modified van der Waals-type core to a polytropic crust. The model remains analytically tractable while allowing for nonlinear density dependence. We impose thermodynamic and causal consistency conditions and determine the critical densities at which the curvature of the pressure-energy density relation changes. In the non-relativistic limit, the generalized Lane-Emden equations describe a smooth core-crust transition layer. We integrate the Tolman-Oppenheimer-Volkoff equations across different $(\\tau_1,\\sigma_1)$ regimes, where these parameters encode thermal and interaction effects in the core. The resulting mass-radius sequences yield low neutron star masses $(0.99-2.05)M_{\\odot}$, and the chemical potential exhibits the characteristic signatures of phase-transition behavior at densities well above the matching point. Our results show that analytic EOS models can reproduce the key phenomenology of phase transitions and provide a controlled framework for exploring low-mass neutron star configurations.",
      "pdf_url": "https://arxiv.org/pdf/2512.08672.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21774",
      "title": "Linear Perturbations and Multi-Probe Diagnostics in Dark-Sector Selective $f(R,T_χ)$ Gravity",
      "authors": [
        "L. Yildiz",
        "D. Kayki",
        "E. Gudekli"
      ],
      "abstract": "Linear Perturbations and Multi-Probe Diagnostics in Dark-Sector Selective $f(R,T_χ)$ Gravity L. Yildiz, D. Kayki, E. Gudekli Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We develop a dark-sector selective trace-coupled extension of gravity in which the matter--curvature coupling depends exclusively on the trace of the dark-matter energy--momentum tensor, $T_{\\chi}$, defined from a canonical dark-matter field $\\chi$. This construction provides a microphysically specified trace sector, removes the usual matter-Lagrangian ambiguity of $f(R,T)$-type models, and preserves minimal coupling of visible matter by design. We derive the full field equations, the exact dark-sector exchange structure, and the linear scalar-perturbation system in gauge-ready form. In the sub-horizon regime, we derive effective modified-gravity functions governing structure growth and light deflection, and show that the model generically produces correlated, scale- and time-dependent departures from General Relativity in growth and lensing observables. Building on this structure, we formulate a perturbation-focused multi-probe framework based on redshift-space distortions, weak lensing, and CMB lensing, explicitly targeting degeneracy breaking beyond background-expansion tests. The analysis establishes the action-level and perturbation-level foundations of the model and provides a conservative, reproducible framework for translated linear-regime constraints within a dark-sector selective modified-gravity setting.",
      "pdf_url": "https://arxiv.org/pdf/2602.21774.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25088",
      "title": "From Dark Radiation to Dark Energy: Unified Cosmological Evolution in K-essence Models",
      "authors": [
        "Eladio Moreno",
        "Josue De-Santiago"
      ],
      "abstract": "From Dark Radiation to Dark Energy: Unified Cosmological Evolution in K-essence Models Eladio Moreno, Josue De-Santiago v2: Updated to match the published version in Classical and Quantum Gravity. 20 pages, 11 figures Class. Quantum Grav. 43 (2026) 045017 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We study a class of Unified Dark Matter (UDM) models based on generalized K-essence, where a single scalar field with non-canonical kinetic terms accounts for dark radiation, dark matter, and dark energy. Starting from the purely kinetic Lagrangian proposed by Scherrer (2004), we extend the analysis to quadratic and exponential scalar potentials and explore their phenomenology. All models are implemented in a modified version of \\texttt{Hi\\_CLASS} and confronted with data from \\textit{Planck} 2018, DESI DR1, and Big Bang Nucleosynthesis. The scenarios reproduce the full sequence of cosmic epochs: an early radiation-like phase, a matter-dominated era, and late-time accelerated expansion. The new models predict slightly higher values of the Hubble constant compared to $\\Lambda$CDM, thereby partially alleviating the respective tensions from $\\sim 4.4 \\sigma$ to $\\sim 3.4 \\sigma$. The quadratic potential requires an ultralight mass that makes it effectively indistinguishable from the Scherrer solution. Overall, generalized K-essence provides a minimal and observationally viable realization of UDM, offering a unified description of the dark sector with distinctive signatures in both early- and late-time cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2509.25088.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21246",
      "title": "CNN+FoF: application of deep learning to the identification of dark matter haloes",
      "authors": [
        "Soumadeep Maiti",
        "Carlos M. Correa",
        "Andrea Fiorilli",
        "Andrés N. Ruiz",
        "Dante J. Paz",
        "Alejandro Pérez Fernández",
        "Ariel G. Sánchez"
      ],
      "abstract": "CNN+FoF: application of deep learning to the identification of dark matter haloes Soumadeep Maiti, Carlos M. Correa, Andrea Fiorilli, Andrés N. Ruiz, Dante J. Paz, Alejandro Pérez Fernández, Ariel G. Sánchez 11 pages, 9 figures, submitted to MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present a deep-learning-based approach for identifying dark matter haloes in cosmological N-body simulations. Our framework consists of a volumetric Convolutional Neural Network to classify individual simulation particles as either halo or non-halo members, followed by a highly optimised and parallelised Friends-of-Friends clustering algorithm that groups the classified halo members into distinct haloes. The training data comprise simulations generated using GADGET-4, with labels obtained with the ROCKSTAR halo finder. Our models incorporate two main halo mass definitions, $M_{200\\mathrm{b}}$ and $M_{\\text{vir}}$, with similar performance. For haloes defined by the ROCKSTAR $M_{200\\mathrm{b}}$ criterion, the classification network demonstrated stable performance across multiple simulation resolutions. For the highest resolution, it achieved over $98\\%$ across all primary performance metrics when identifying halo particles. Furthermore, the FoF algorithm yielded halo catalogues with a purity generally exceeding $95\\%$ and a stable completeness of $93\\%$ for masses above $5\\times10^{11} \\, M_\\odot$. Our pipeline recovered the centre-of-mass positions, velocities and halo masses with high fidelity, yielding a halo mass function consistent to within $5\\%$ of the reference while faithfully reconstructing the internal density profiles. The primary objective of this study is to offer a faster and scalable alternative to conventional halo finders, achieving a speed-up of approximately one order of magnitude relative to ROCKSTAR, offering a promising pathway for modern simulation-based inference methods that rely on rapid and accurate structure identification.",
      "pdf_url": "https://arxiv.org/pdf/2602.21246.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21292",
      "title": "Evolution of Cosmic Voids: Structure, Galaxies, and Dynamics",
      "authors": [
        "Saeed Tavasoli"
      ],
      "abstract": "Evolution of Cosmic Voids: Structure, Galaxies, and Dynamics Saeed Tavasoli 16 pages, 7 figures, submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We investigate the structural, photometric, and dynamical evolution of cosmic voids and their galaxy populations from $z=2.09$ to the present, focusing on void size as a key evolutionary parameter. Using void catalogs from four Millennium Simulation snapshots and SDSS data at $z<0.04$, we perform a unified analysis of void demographics, galaxy properties, and internal kinematics. Our analysis reveals clear evidence that cosmic voids exhibit a significant evolutionary trend of becoming progressively emptier toward low redshift, accompanied by a marked decline in the brightness and clustering of their galaxy populations. The void galaxy luminosity function evolves significantly: $M^{*}$ fades and $\\alpha$ flattens with time, with large voids hosting brighter, more rapidly evolving galaxies than small voids. Stacked density profiles exhibit a universal shape when scaled by void radius, deepening and building more pronounced walls toward $z=0$. Galaxy spatial distributions reveal persistent size-dependent segregation, with galaxies in large voids lying farther from the center and more strongly clustered. Dynamical analysis of simulations shows coherent outward flows in all voids, with amplitudes decreasing toward $z=0$, providing a physical basis for observed redshift-space distortions. Comparison with SDSS broadly confirms these evolutionary trends but uncovers a non-zero central galaxy population in observed voids -- absent in $\\Lambda$CDM predictions -- that may challenge current galaxy formation models in extreme underdensities. Future comparisons with additional simulations and deeper high-redshift surveys will provide stronger tests of $\\Lambda$CDM in the most underdense regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.21292.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21295",
      "title": "Implications for PBH Dark Matter from a single Sub-Solar$\\unicode{x2013}$GW Detection in LVK O1$\\unicode{x2013}$O4",
      "authors": [
        "Alberto Magaraggia",
        "Nico Cappelluti"
      ],
      "abstract": "Implications for PBH Dark Matter from a single Sub-Solar$\\unicode{x2013}$GW Detection in LVK O1$\\unicode{x2013}$O4 Alberto Magaraggia, Nico Cappelluti 9 pages, 2 figures, Accepted for publication in ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) The detection of sub-solar mass black holes is a milestone of modern astrophysics as it would open a window either onto new stellar physics or could potentially unveil the nature of Dark Matter as Primordial Black Holes. On November 12, 2025, the LIGO-Virgo-KAGRA (LVK) collaboration reported the compact binary merger candidate S251112cm, a system with no obvious EM counterpart, consistent with binary black hole merger with a chirp mass in the range $0.1-0.87 \\, M_\\odot$. The probability that at least one component has mass $<$1 $M_{\\odot}$ is $>99\\%$. Inspired by this trigger, we tested if a population of PBHs formed at Quantum Chromodynamics epoch with a broad mass function could account for a signal of this type. Our results, corresponding to a predicted event rate of $0.8 \\,\\text{yr}^{-1}$ as seen by LVK O3b, suggest that the observed merger rate of $0.23^{+0.86}_{-0.218}\\,\\text{yr}^{-1}\\;(95\\%\\;\\text{C.L.})$ if the trigger is confirmed as an astrophysical event would be compatible with such a model. Our predicted detection rate is also in agreement with current LVK expectations for stellar-mass binaries, remaining consistent with a scenario in which a non-negligible fraction of the $3-200 \\;M_\\odot$ mergers observed by LVK originate from Primordial Black Holes. If confirmed, this detection would place a lower limit to the PBH abundance $f_{PBH}>0.04$ for our adopted model.",
      "pdf_url": "https://arxiv.org/pdf/2602.21295.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21443",
      "title": "Intracluster Medium Fluctuations on Scales up to 1 Mpc: A Combined eROSITA and SPT/Planck Analysis of Abell 3266",
      "authors": [
        "H. Saxena",
        "A. Heinrich",
        "J. Sayers",
        "I. Zhuravleva",
        "E. Bulbul",
        "J. Sanders",
        "C. Avestruz",
        "R. Basu Thakur",
        "E. Battistelli",
        "A. Botteon",
        "F. Cacciotti",
        "F. Columbro",
        "A. Coppolecchia",
        "S. Cray",
        "P. de Bernardis",
        "M. De Petris",
        "L. Lamagna",
        "E.T. Lau",
        "S. Masi",
        "A. Paiella",
        "F. Piacentini",
        "E. Rapaport",
        "L. Rudnick",
        "D. White",
        "J. ZuHone"
      ],
      "abstract": "Intracluster Medium Fluctuations on Scales up to 1 Mpc: A Combined eROSITA and SPT/Planck Analysis of Abell 3266 H. Saxena, A. Heinrich, J. Sayers, I. Zhuravleva, E. Bulbul, J. Sanders, C. Avestruz, R. Basu Thakur, E. Battistelli, A. Botteon, F. Cacciotti, F. Columbro, A. Coppolecchia, S. Cray, P. de Bernardis, M. De Petris, L. Lamagna, E.T. Lau, S. Masi, A. Paiella, F. Piacentini, E. Rapaport, L. Rudnick, D. White, J. ZuHone Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Galaxy clusters form through hierarchical assembly, where smaller substructures merge to build the largest gravitationally bound objects in the universe. These mergers, combined with feedback from AGN, filamentary accretion, and other energy injection processes, generate turbulence and perturbations within the intra-cluster medium (ICM). X-ray and Sunyaev-Zel'dovich (SZ) observations can be utilized to measure these ICM density and pressure inhomogeneities, in turn providing constraints on the effective Equation of State (EOS) of the perturbations and ICM velocities. In this work, we analyze deep SRG-eROSITA and Planck/SPT observations of Abell 3266 (A3266), a dynamically complex merging cluster with elongated morphology and significant substructure. We measure pressure and density fluctuations, and compute the power spectra and deprojected 3D amplitudes of these perturbations. We estimate the ratio of pressure-to-density fluctuation amplitudes as $1.00 \\pm 0.55$ and non-thermal pressure support $0.068 \\pm 0.050$. Density fluctuations are found to be stronger in the northern sector of the cluster compared to the south, consistent with ongoing accretion along a filamentary structure revealed by eROSITA. Further, we find the amplitude of density fluctuations increases with radius, qualitatively consistent with the trend found in cosmological simulations. Uncertainties in our results are dominated by the relatively low sensitivity of current Planck/SPT data, suggesting that improvements in SZ data quality could substantially improve our understanding of ICM energy injection, transport, and dissipation from this technique.",
      "pdf_url": "https://arxiv.org/pdf/2602.21443.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21493",
      "title": "Resurgence and Hyperasymptotics in Wave Optics Astronomy",
      "authors": [
        "Job Feldbrugge",
        "Samuel Crew",
        "Ue-Li Pen"
      ],
      "abstract": "Resurgence and Hyperasymptotics in Wave Optics Astronomy Job Feldbrugge, Samuel Crew, Ue-Li Pen Cosmology and Nongalactic Astrophysics (astro-ph.CO); Mathematical Physics (math-ph) With the discovery of gravitational waves and fast radio bursts, wave optics has become increasingly relevant in astrophysics. This paper studies the behaviour of random gravitational and plasma lenses, presenting the refractive and diffractive expansions, with higher-order terms that allow error estimates and embody the counterintuitive resurgence phenomenon. Specifically, we show that the diffractive expansion converges for a broad class of bounded lens models and provides an efficient description of interference patterns across frequency regimes. Next, building on Picard-Lefschetz techniques, we derive the full refractive expansion to arbitrary order, organising it into a transseries. Near caustics, the standard transseries is supplemented with uniform asymptotics. We study this transseries, with both Borel and hyperasymptotic resummation yielding systematic approximations to lensing integrals at all frequencies. Our results give a framework for modelling wave optics lensing near caustics and beyond the geometric optics approximation and thereby illustrate how tools from resurgence and asymptotic analysis can be applied to practical problems in astrophysics. Near caustic singularities, the post-refractive corrections diverge, while the uniform asymptotic expansion becomes accurate. We use the leading uniform approximation to derive the strong wave optics suppression of off-axis caustics, which clarifies their subdominant role.",
      "pdf_url": "https://arxiv.org/pdf/2602.21493.pdf",
      "categories": [
        "astro-ph.CO",
        "math-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.21580",
      "title": "Bulk and turbulent gas motions in the interacting galaxy cluster Abell 3395 South observed with XRISM",
      "authors": [
        "Naomi Ota",
        "Angie Veronica",
        "Jakob Dietl",
        "Anri Yanagawa",
        "Thomas H. Reiprich",
        "Veronica Biffi",
        "Klaus Dolag",
        "Marcus Brüggen",
        "Esra Bulbul",
        "Florian Pacaud",
        "Yoshiki Toba"
      ],
      "abstract": "Bulk and turbulent gas motions in the interacting galaxy cluster Abell 3395 South observed with XRISM Naomi Ota, Angie Veronica, Jakob Dietl, Anri Yanagawa, Thomas H. Reiprich, Veronica Biffi, Klaus Dolag, Marcus Brüggen, Esra Bulbul, Florian Pacaud, Yoshiki Toba 8 pages, 3 figures, submitted to PASJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We investigate the gas motions in the core region of the Abell~3395 South subcluster (A3395S) using high-resolution X-ray spectroscopy with XRISM/Resolve. By analyzing the Fe~XXV He$\\alpha$ emission line, we directly measure the line-of-sight bulk and turbulent velocities of the intracluster medium. We find that the one-dimensional turbulent velocity is low, at the level of $124\\pm21~{\\rm km\\,s^{-1}}$, while a significant line-of-sight bulk velocity of $263\\pm23~{\\rm km\\,s^{-1}}$ is detected. The coexistence of low turbulence and finite bulk motion suggests that A3395S has not yet reached a dynamically relaxed state. These results are consistent with the non-detection of a radio halo in A3395S, implying that turbulent particle reacceleration is currently inefficient in the cluster core. This study demonstrates that high-resolution X-ray spectroscopy with XRISM provides a powerful means to directly constrain intracluster medium dynamics in merging galaxy clusters, and it provides a reference for future comparative studies of A3395N and A3391 within the same large-scale structure.",
      "pdf_url": "https://arxiv.org/pdf/2602.21580.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21733",
      "title": "A sound horizon independent measurement of $H_0$ from BOSS, DESI and DES Y3",
      "authors": [
        "Zhiyu Lu",
        "Théo Simon",
        "Vivian Poulin",
        "Yifu Cai"
      ],
      "abstract": "A sound horizon independent measurement of $H_0$ from BOSS, DESI and DES Y3 Zhiyu Lu, Théo Simon, Vivian Poulin, Yifu Cai Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a sound horizon independent measurement of the Hubble parameter using a multiprobe large-scale structure analysis. Removing the dependency on the sound horizon with a rescaling procedure at the matter power spectrum level, we analyse the BOSS full-shape power spectrum and bispectrum (for the first time) using the effective field theory of large-scale structure up to one loop. We combine this analysis with the auto- and cross-angular power spectra from the DESI Legacy Imaging Survey DR9, the $3 \\times 2$pt analysis from DES Y3, and the CMB gravitational lensing power spectrum from Planck PR3. Our baseline analysis, that does not rely on supernovae data, yields $h = 0.702^{+0.022}_{-0.024}$, $\\Omega_m = 0.310 \\pm 0.013$, and $\\sigma_8 = 0.799 \\pm 0.020$, corresponding to $3-4 \\%$ precision measurements. When adding supernovae data from Pantheon+, we obtain a $2.6 \\%$ measurement of $h$, with $h = 0.686 \\pm 0.018$. We further note that our EFTBOSS analysis indicates a slight deviation of the BAO scale parameter (at $1.8 \\sigma$) from its $\\Lambda$CDM value, caused by the small scales of the bispectrum. We finally use the sound horizon-free EFTBOSS analysis as a diagnosis for the presence of new physics, finding that our results are consistent with the recent hints of evolving dark energy.",
      "pdf_url": "https://arxiv.org/pdf/2602.21733.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21863",
      "title": "Impact and interplay of $Λ$CDM analysis choices for LSST cosmic shear",
      "authors": [
        "N. C. Robertson",
        "C. Heymans",
        "J. Zuntz",
        "P. Burger",
        "C. D. Leonard",
        "I. G. McCarthy",
        "J. C. Paine",
        "J. Salcido",
        "N. Šarčević",
        "M. Schaller",
        "J. Schaye",
        "M. P. van Daalen"
      ],
      "abstract": "Impact and interplay of $Λ$CDM analysis choices for LSST cosmic shear N. C. Robertson, C. Heymans, J. Zuntz, P. Burger, C. D. Leonard, I. G. McCarthy, J. C. Paine, J. Salcido, N. Šarčević, M. Schaller, J. Schaye, M. P. van Daalen (for The FLAMINGO team and The LSST Dark Energy Science Collaboration) Cosmology and Nongalactic Astrophysics (astro-ph.CO) We forecast cosmological parameter constraints for a cosmic shear analysis of the Rubin Observatory Legacy Survey of Space and Time (LSST), defining an analysis framework that can accurately recover the $\\Lambda$CDM model in the presence of astrophysical and data-related systematics. When accounting for our present uncertainty on the suppression of the non-linear matter power spectrum through baryon feedback, we find that the error on the composite parameter $S_8=\\sigma_8\\sqrt{\\Omega_{\\rm m}/0.3}$ almost doubles compared to an LSST analysis which neglects this astrophysical phenomenon. After the first year of observations, LSST will extend beyond the magnitude limit of existing representative spectroscopic calibration samples, requiring photometric redshifts to be calibrated using an alternative strategy. Adopting literature measurements of the reduced redshift calibration precision found from galaxy cross-correlation techniques, combined with current levels of baryon feedback uncertainty, we forecast final year LSST cosmic shear constraints that barely improve upon the first year analysis. This forecast therefore serves as encouragement to the community to develop methodology and observations to constrain models of baryon feedback and enhance photometric redshift calibration at depths where spectroscopy is unrepresentative. With tight priors on both these systematic terms, we forecast that LSST cosmic shear can deliver constraints on $S_8$ that are more than five times as constraining as existing cosmic shear surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.21863.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21890",
      "title": "The impact of cosmic filaments on starburst galaxies across cosmic times",
      "authors": [
        "Baptiste Jego",
        "Matthieu Béthermin",
        "Katarina Kraljic",
        "Clotilde Laigle",
        "Lingyu Wang",
        "Antonio La Marca",
        "Olivier Ilbert",
        "Hollis B. Akins",
        "Caitlin M. Casey",
        "Gavin Leroy",
        "Ali Hadi",
        "Jeyhan S. Kartaltepe",
        "Anton M. Koekemoer",
        "Henry Joy McCracken",
        "Louise Paquereau",
        "Jason Rhodes",
        "Brant E. Robertson",
        "Marko Shuntov",
        "Greta Toni",
        "Can Xu"
      ],
      "abstract": "The impact of cosmic filaments on starburst galaxies across cosmic times Baptiste Jego, Matthieu Béthermin, Katarina Kraljic, Clotilde Laigle, Lingyu Wang, Antonio La Marca, Olivier Ilbert, Hollis B. Akins, Caitlin M. Casey, Gavin Leroy, Ali Hadi, Jeyhan S. Kartaltepe, Anton M. Koekemoer, Henry Joy McCracken, Louise Paquereau, Jason Rhodes, Brant E. Robertson, Marko Shuntov, Greta Toni, Can Xu Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Cosmological simulations suggest that various galaxy properties depend on their location within the cosmic web. Yet direct observational evidence of the dependence of star formation activity on distance to filaments remains scarce and is missing at z>1. We investigate how starburst, main-sequence (MS), and quenched galaxies are distributed with respect to cosmic web filaments, and how this distribution evolves with redshift. We first use the SIMBA cosmological simulation to predict the redshift evolution of the mean distance to the closest filament from z=3 to z=0 for different galaxy populations after removing stellar-mass dependencies. We then measure the corresponding signal in the COSMOS field, using COSMOS2020 and COSMOS-Web data, where accurate photometric redshifts enable reconstruction of the projected cosmic web from z=2 to z=0.5, and starbursts are identified through far-infrared spectral energy distribution fitting. In agreement with the results from SIMBA, starburst galaxies are found closer to filaments at z>1 and at larger distances at z<1, MS galaxies occupy intermediate environments with little evolution, and quenched galaxies show progressively shorter distances to filaments toward low redshift, with a crossing between starburst and MS populations around z~1. In COSMOS-Web, the relative evolution in the average distance to filaments between starburst and MS galaxies is detected at a significance level of at least 5{\\sigma}. We show that a minimal toy model in which the only environmental ingredient is the sSFR-filament distance modulation measured in simulations is sufficient to reproduce the observed differential evolution of the average filament distance between starburst and MS galaxies. These results show that the imprint of large-scale environmental effects on the star formation activity of galaxies, predicted by simulations, is detectable from z=2 down to z=0.5.",
      "pdf_url": "https://arxiv.org/pdf/2602.21890.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21975",
      "title": "How does a MOND cosmology fare on Gpc scales? - Collisionless $N$-body simulations of $ν$HDM",
      "authors": [
        "Alfie Russell",
        "Indranil Banik",
        "Oscar Cray",
        "Hongsheng Zhao"
      ],
      "abstract": "How does a MOND cosmology fare on Gpc scales? - Collisionless $N$-body simulations of $ν$HDM Alfie Russell, Indranil Banik, Oscar Cray, Hongsheng Zhao Accepted for publication in Monthly Notices of the Royal Astronomical Society (MNRAS). 24 pages, 9 figures, 2 tables Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the largest collisionless $N$-body cosmological simulations in a MOdified Newtonian Dynamics (MOND) cosmology to date. Our 4 simulations cover $\\Lambda$CDM as a baseline, a MOND with hot dark matter model known as $\\nu$HDM, and 2 unphysical models we call $\\Lambda$HDM and $\\nu$CDM to test the individual contributions of hot dark matter and MOND gravity, respectively. $\\nu$HDM reproduces the CMB power spectrum whilst also theoretically matching cluster dynamics and preserving MOND predictions for galactic rotation curves. We test its viability on cosmological scales using simulations with $256^{3}$ particles in a box of size $800/h$ comoving Mpc. We find generically that the MOND models massively overproduce large-scale structures by $z=0$, with a most massive cluster in $\\nu$HDM of $\\approx 5 \\times 10^{17} M_{\\odot}/h$ and typical peculiar velocities of several thousand km/s. We also explore a local void solution to the Hubble tension in these models. Analogues to the observed \"Local Hole'' do form in the MOND models, but values for the deceleration parameter $<-1.5$ in these regions prevent a satisfactory resolution to the Hubble tension. Whilst $\\Lambda$CDM significantly underpredicts the observed bulk flow in Cosmicflows-4, the high peculiar velocities that arise in the MOND models create the opposite problem, ruling out $\\nu$HDM at $>5\\sigma$ confidence. Observations clearly require a much milder enhancement to the rate of structure growth in $\\Lambda$CDM than is provided by the $\\nu$HDM paradigm. Our results also suggest that replacing cold dark matter with hot dark matter is unlikely to provide a viable cosmological model, regardless of the gravity law.",
      "pdf_url": "https://arxiv.org/pdf/2602.21975.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21280",
      "title": "A Path to an All-Sky Survey with Roman",
      "authors": [
        "Jiwon Jesse Han",
        "Anirudh Chiti",
        "Kai-Feng Chen",
        "Keith Bechtol",
        "Andrea Bellini",
        "Robert Benjamin",
        "Adam Bolton",
        "Ana Bonaca",
        "Alex Broughton",
        "Esra Bulbul",
        "Susan Clark",
        "Charlie Conroy",
        "Suchetha Cooray",
        "John Franklin Crenshaw",
        "Tansu Daylan",
        "Arjun Dey",
        "Alex Drlica-Wagner",
        "Tim Eifler",
        "Kareem El-Badry",
        "Richard M. Feder",
        "Peter Ferguson",
        "Shenming Fu",
        "Sebastian Gomez",
        "Ryan Hickox",
        "Christopher Hirata",
        "Easton J. Honaker",
        "Xiaosheng Huang",
        "Alexander P. Ji",
        "Michael Liu",
        "Kevin A. McKinnon",
        "Geoffrey Mo",
        "Burcin Mutlu-Pakdil",
        "Adrian M. Price-Whelan",
        "Alessandro Savino",
        "David J. Schlegel",
        "Nora Shipp",
        "Jay Strader",
        "Federica Tarsitano",
        "Adrien C.R. Thob",
        "Kim-Vy Tran",
        "Roeland P. van der Marel",
        "Feige Wang",
        "Risa Wechsler",
        "Daniel R. Weisz",
        "Dennis Zaritsky",
        "Tianqing Zhang",
        "Shreya Anand",
        "Amirnezam Amiri",
        "Abhijeet Anand",
        "Matthew L. N. Ashby",
        "Finian Ashmead",
        "Leandro Beraldo e Silva",
        "Aliza Beverage",
        "Michael R. Blanton",
        "Warren R. Brown",
        "Anthony G.A. Brown",
        "Priyanka Chakraborty",
        "Yi-Kuan Chiang",
        "Jose M. Diego",
        "Denis Erkal",
        "Simone Ferraro",
        "Lluís Galbany",
        "Marla Geha",
        "Oleg Y. Gnedin",
        "Lars Hernquist",
        "Jason A. S. Hunt",
        "Valentin D. Ivanov",
        "Venu Kalari",
        "Nitya Kallivayalil",
        "András Kovács",
        "Kyle Kremer",
        "Ting-Wen Lan",
        "Denis Leahy",
        "Jiaxuan Li",
        "Ivan Minchev",
        "GyuChul Myung",
        "Ethan O. Nadler",
        "Joan R. Najita",
        "Melissa K. Ness",
        "Jacob Nibauer",
        "Fabio Pacucci",
        "David Parkinson",
        "Ekta Patel",
        "R. Michael Rich",
        "Marina Ricci",
        "Graziano Rossi",
        "Nikolina Sarcevic",
        "Arnab Sarkar",
        "Andrew K. Saydjari",
        "Arman Shafieloo",
        "Zachary Slepian",
        "Sangmo Tony Sohn",
        "David N. Spergel",
        "Róbert Szabó",
        "Christina C. Williams",
        "John F. Wu"
      ],
      "abstract": "A Path to an All-Sky Survey with Roman Jiwon Jesse Han, Anirudh Chiti, Kai-Feng Chen, Keith Bechtol, Andrea Bellini, Robert Benjamin, Adam Bolton, Ana Bonaca, Alex Broughton, Esra Bulbul, Susan Clark, Charlie Conroy, Suchetha Cooray, John Franklin Crenshaw, Tansu Daylan, Arjun Dey, Alex Drlica-Wagner, Tim Eifler, Kareem El-Badry, Richard M. Feder, Peter Ferguson, Shenming Fu, Sebastian Gomez, Ryan Hickox, Christopher Hirata, Easton J. Honaker, Xiaosheng Huang, Alexander P. Ji, Michael Liu, Kevin A. McKinnon, Geoffrey Mo, Burcin Mutlu-Pakdil, Adrian M. Price-Whelan, Alessandro Savino, David J. Schlegel, Nora Shipp, Jay Strader, Federica Tarsitano, Adrien C.R. Thob, Kim-Vy Tran, Roeland P. van der Marel, Feige Wang, Risa Wechsler, Daniel R. Weisz, Dennis Zaritsky, Tianqing Zhang, Shreya Anand, Amirnezam Amiri, Abhijeet Anand, Matthew L. N. Ashby, Finian Ashmead, Leandro Beraldo e Silva, Aliza Beverage, Michael R. Blanton, Warren R. Brown, Anthony G.A. Brown, Priyanka Chakraborty, Yi-Kuan Chiang, Jose M. Diego, Denis Erkal, Simone Ferraro, Lluís Galbany, Marla Geha, Oleg Y. Gnedin, Lars Hernquist, Jason A. S. Hunt, Valentin D. Ivanov, Venu Kalari, Nitya Kallivayalil, András Kovács, Kyle Kremer, Ting-Wen Lan, Denis Leahy, Jiaxuan Li, Ivan Minchev, GyuChul Myung, Ethan O. Nadler, Joan R. Najita, Melissa K. Ness, Jacob Nibauer, Fabio Pacucci, David Parkinson, Ekta Patel, R. Michael Rich, Marina Ricci, Graziano Rossi, Nikolina Sarcevic, Arnab Sarkar, Andrew K. Saydjari, Arman Shafieloo, Zachary Slepian, Sangmo Tony Sohn, David N. Spergel, Róbert Szabó, Christina C. Williams, John F. Wu Comments are welcome and encouraged Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) A deep, space-based, all-sky near-infrared survey carried out with the Nancy Grace Roman Space Telescope would constitute a foundational astronomical infrastructure for decades to come. In this white paper, we present a concrete and feasible path to imaging the entire sky at $\\sim0.1''$ resolution, beginning with high-impact fields in Cycle 1 and scaling to ultra-wide coverage within the nominal mission. This first-epoch survey will reach $\\mathrm{H}\\sim25.5$ AB mag (5$\\sigma$) and maximize synergies with contemporaneous observatories, while preserving substantial time for other ambitious Roman programs. We outline representative scheduling scenarios and an example Cycle 1 program that triples early Roman-LSST overlap and delivers high-value community data products such as LSST forced photometry, joint \\textit{Gaia}-Roman astrometry, and catalogs of Galactic substructure, stong lenses, and other rare systems. The Cycle 1 program will lay the foundation for an eventual all-sky survey, while also delivering high-impact early science. We invite broad community participation in shaping and carrying out both the initial program and the long-term vision of an all-sky Roman survey.",
      "pdf_url": "https://arxiv.org/pdf/2602.21280.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21298",
      "title": "Galaxy and black hole coevolution in dark matter haloes not captured by cosmological simulations",
      "authors": [
        "Hassen M. Yesuf",
        "Connor Bottrell"
      ],
      "abstract": "Galaxy and black hole coevolution in dark matter haloes not captured by cosmological simulations Hassen M. Yesuf, Connor Bottrell 71 pages, 6 main figures, 4 tables, and 23 Extended Data and Supplementary figures. Accepted for publication in Nature Astronomy Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Star formation in galaxies is governed by internal and environmental processes, yet their relative roles are not well understood. In particular, uncertainties in measurements of active galactic nuclei (AGN) host galaxies, combined with modeling limitations, obfuscate the impact of supermassive black hole feedback across environments and over time. Here we address this with a comprehensive analysis of ~60,000 nearby AGNs (z < 0.15 and new environment and halo-mass measurements for ~500,000 AGN and non-AGN host galaxies. This benchmark enables unified comparisons with three prominent cosmological simulations--SIMBA, TNG, and EAGLE--and reveals major, contrasting shortcomings. Simulations fail to reproduce observed trends linking star formation, quiescence, AGN luminosity, stellar mass, and halo mass. While simulations qualitatively capture that AGNs are more common in low-mass halos than in rich groups or clusters, detailed host demographics diverge strongly from observations. Partial agreement exists in the stellar mass distribution within large-scale structures, yet all simulations overproduce quenched low-mass satellites in massive halos, while misrepresenting quenched fractions of massive central galaxies and those in low-density environments, which are sensitive to feedback implementation. Improved AGN physics and modeling of multi-phase gas cooling and flows are required to capture the observed interplay between black holes, galaxies, and halos.",
      "pdf_url": "https://arxiv.org/pdf/2602.21298.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21821",
      "title": "The supersonic nature of jellyfish galaxies",
      "authors": [
        "Alessandro Ignesti",
        "Francesca Loi",
        "Antonino Marasco",
        "Benedetta Vulcani",
        "Bianca M. Poggianti",
        "Christoph Pfrommer",
        "Marco Gullieuszik",
        "Alessia Moretti",
        "Paolo Serra",
        "Stephanie Tonnesen",
        "Rory Smith",
        "Cecilia Bacchini",
        "Marc A. W. Verheijen",
        "Myriam Gitti",
        "Anna Wolter",
        "Koshy George",
        "Yara Jaffe",
        "Rosita Paladino",
        "Giorgia Peluso",
        "Mario Radovich",
        "Augusto E. Lassen",
        "Neven Tomicic",
        "Peter Kamphuis"
      ],
      "abstract": "The supersonic nature of jellyfish galaxies Alessandro Ignesti, Francesca Loi, Antonino Marasco, Benedetta Vulcani, Bianca M. Poggianti, Christoph Pfrommer, Marco Gullieuszik, Alessia Moretti, Paolo Serra, Stephanie Tonnesen, Rory Smith, Cecilia Bacchini, Marc A. W. Verheijen, Myriam Gitti, Anna Wolter, Koshy George, Yara Jaffe, Rosita Paladino, Giorgia Peluso, Mario Radovich, Augusto E. Lassen, Neven Tomicic, Peter Kamphuis Accepted for publication on A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) All gas-rich galaxies in cluster environments are expected to experience ram-pressure stripping from the intra-cluster medium. However, only a fraction of these develop ongoing star-formation in their stripped tail, becoming the so-called ``jellyfish'' galaxies. In this work we provide observational evidence that magnetic fields can signal differences in the extraplanar star formation and explore what are the physical conditions that lead to the formation of a jellyfish galaxy. We first focus on JO147, a jellyfish galaxy that features weak star formation activity in its tail. Using MeerKAT radio continuum observations, we discover polarized emission only in a small fraction of its tail, with an average fraction of $~10\\%$, and a low Mach number $\\mathcal{M}=1.3-1.6$, which suggests a possible association between magnetic field draping, shock-compression of the gas, and extraplanar star formation activity. Then, we test this scenario in a sample of 17 jellyfish galaxies from the GASP project. We combine dynamical models for their orbits within the host clusters with realistic cluster temperature profiles to infer their Mach number, and we find a positive correlation between it and the star formation activity in their tail. We conclude that supersonic motion is a necessary condition for triggering star formation in the stripped tails of jellyfish galaxies. Our findings provide empirical evidence that the critical factor preventing the stripped gas evaporation is the shock compression induced by the supersonic motion through the cluster. This process likely enhances the magnetic field surrounding the galaxy and the properties of the stripped material.",
      "pdf_url": "https://arxiv.org/pdf/2602.21821.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22004",
      "title": "Probing Large-scale Structure and the Multi-Phase IGM at the Cosmic Noon -- Insights from a Joint Survey with Euclid, CSST, JPCam, and JUST",
      "authors": [
        "Jiang-Tao Li",
        "Renato A. Dupke",
        "Yan Gong",
        "Zhijie Qu",
        "Weichen Wang",
        "Xiaohu Yang",
        "Xiaodi Yu"
      ],
      "abstract": "Probing Large-scale Structure and the Multi-Phase IGM at the Cosmic Noon -- Insights from a Joint Survey with Euclid, CSST, JPCam, and JUST Jiang-Tao Li, Renato A. Dupke, Yan Gong, Zhijie Qu, Weichen Wang, Xiaohu Yang, Xiaodi Yu 44 pages, 16 figures, 3 tables, accepted for publication by RAA Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present scientific and technical justifications of a potential coordinated Euclid/CSST/JPCam/JUST survey of the Euclid Deep Field North (EDF-N), aimed at probing the multi-phase circumgalactic and intergalactic medium (CGM/IGM) at the cosmic noon over ~20 deg$^2$. The survey is structured around three connected goals: (1) improving photometric redshift (photo-z) accuracy through the combination of broad- and narrow-band photometry, enabling reliable identification of large-scale structures; (2) probing extended CGM emission with dedicated narrow-band imaging; and (3) mapping foreground IGM via absorption-line spectroscopy of background galaxies. Together, these components establish an integrated observational framework to investigate galactic ecosystems -- linking galaxies to their circumgalactic and intergalactic environments -- at cosmic noon. We show that the J-PAS-like narrow-band system used in JPCam substantially improves photo-z accuracies from only the Euclid/CSST broad-band data, especially for star-forming galaxies at z~1.0-1.4. This enables the identification of galaxy groups and (proto-)clusters directly from photo-z measurements. Stacked JPCam narrow-band imaging should also detect extended [O II]-emitting CGM halos. We then construct mock 3D gas distribution model and realistic galaxy catalog, and further construct mock CSST and JUST background galaxy spectra adding Lyalpha and Mg II absorptions. The reconstructed 3D H I field from CSST Lyalpha forest reliably recovers large-scale structures; however, our simulations indicate that detecting diffuse IGM Mg II absorption with JUST is infeasible, either through spectral stacking or via the two-point correlation function method. We conclude that constraining the metallicity of the diffuse IGM will require significantly deeper and higher-resolution spectroscopy expected from future facilities such as the 39 m E-ELT.",
      "pdf_url": "https://arxiv.org/pdf/2602.22004.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22161",
      "title": "Uncovering the absorbed atomic Universe with the [OI]63um line",
      "authors": [
        "Carlos De Breuck",
        "Kevin C. Harrington",
        "Wout Hermans",
        "Luke Maud",
        "Aniket Bhagwat",
        "Ilse De Looze",
        "Bo Peng",
        "Amit Vishwas",
        "Benedetta Casavecchia",
        "Andreas Lundgren"
      ],
      "abstract": "Uncovering the absorbed atomic Universe with the [OI]63um line Carlos De Breuck (ESO), Kevin C. Harrington (JAO/NAOJ/ESO/UDP), Wout Hermans (Gent), Luke Maud (ESO), Aniket Bhagwat (MPA), Ilse De Looze (Gent), Bo Peng (MPA), Amit Vishwas (Cornell), Benedetta Casavecchia (MPA), Andreas Lundgren (LAM) 20 Pages, accepted for publication in Astronomy & Astrophyics Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We report the discovery of strongly absorbed [OI]63um in a sample of 12 DSFGs at 4.2<z<5.8 selected from the SPT survey. This is the first systematic survey of the [OI]63um fine-structure line at z>4. Using ALMA Bands 9 and 10, we obtain spatially and spectrally resolved observations that probe the interstellar medium on sub-kpc scales. Despite reaching sensitivities 10-100x deeper than most previous studies, we detect [OI]63um in emission in only 2 sources at low significance, with the remaining galaxies yielding stringent non-detections over the full velocity range covered by robust detections of other far-infrared lines, including [CII] and [NII]205um. We identify several compact (0.05-0.2\") regions having [OI]63um absorption against the far-infrared dust continuum, some of which are possibly reaching below rest-frame CMB radiation level. We also detect narrow, spatially localised [OI]63um emission \"escape channels\" preferentially detected in regions with weak or absent dust continuum emission. We predict that similar absorption effects may appear in the [CII] line, particularly when concentrating on the regions with the densest foreground material along the line of sight. The [OI]63um line appears to be originate from a mix of compact, high optical depth [OI]63um emitting regions and sub-thermally excited, oxygen-rich molecular clouds dispersed throughout high-redshift starbursts that are capable of absorbing the ground-state line emission. Combined with a comparison to cosmological radiation hydrodynamical simulations, this supports the interpretation that regions with higher gas and dust column densities may lead to weakening an intrinsically strong [OI]63um line emission. We argue that the high [OI]63um optical depth is the dominant effect causing the strong absorption, limiting the diagnostic power of this line to trace regions of massive star formation in high-redshift DSFGs.",
      "pdf_url": "https://arxiv.org/pdf/2602.22161.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.00098",
      "title": "Improving Precision in Kinematic Weak Lensing with MIRoRS: Model-Independent Restoration of Reflection Symmetries",
      "authors": [
        "Christopher Hopp",
        "David Wittman"
      ],
      "abstract": "Improving Precision in Kinematic Weak Lensing with MIRoRS: Model-Independent Restoration of Reflection Symmetries Christopher Hopp, David Wittman 21 pages, 15 figures. Substantial revisions and additions following referee report. Accepted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present a novel, model-independent technique for fitting the cross-component of weak lensing shear, $\\gamma_\\times$, along a line of sight by combining kinematic and photometric measurements of a single lensed galaxy. Rather than relying on parametric models, we fit for the shear parameter that best transforms the velocity field to restore its underlying symmetries, while also incorporating photometric data for the change in position angle due to shear. We first validate our technique with idealized mock data, exploring the method's response to variations in shear, position angle, inclination, and noise. On this idealized mock data, our combined kinematic and photometric model demonstrates superior performance compared to traditional parametric or kinematic-only approaches. We also explore the effects of asymmetric warps and show that rotation direction can impart a small bias on the fit of $\\gamma_\\times$. Subsequently, we apply our method to a dataset of 358 halos from the Illustris TNG simulations, achieving a notable reduction in the uncertainty of $\\gamma_\\times$ to 0.039, marking a substantial improvement over previous analysis of the dataset with a parametric model. Finally, we introduce an outlier rejection method based on Moran's $I$ test for spatial autocorrelation. Identifying and filtering out halos with spatially correlated residuals reduces the overall uncertainty to 0.028. Our results underscore the efficacy of combining kinematic and photometric data for weak lensing studies, providing a more precise and targeted measurement of shear along an individual line of sight.",
      "pdf_url": "https://arxiv.org/pdf/2410.00098.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.19962",
      "title": "New bounds on Axion-Like Particles in the Ultraviolet from Legacy Data",
      "authors": [
        "Elisa Todarello"
      ],
      "abstract": "New bounds on Axion-Like Particles in the Ultraviolet from Legacy Data Elisa Todarello 16 pages, 10 figures. Accepted for publication in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We use legacy data from the Hubble Space Telescope (HST) and the International Ultraviolet Explorer (IUE) to search for a spectral line from the spontaneous decay of axion-like particle (ALP) dark matter. The HST data consist of blank sky observations taken with the Faint Object Spectrograph in the 165--240~nm wavelength range, while the IUE data consist of observations of the Virgo Cluster obtained with the long- and short-wavelength spectrographs, covering 195--325~nm and 123--200~nm, respectively. We set a 95\\% C.L. upper limit on the ALP--photon coupling $g_{a\\gamma} \\lesssim 10^{-11}~\\mathrm{GeV}^{-1}$ across the whole probed ALP mass range. Notably, we rule out values of $g_{a\\gamma}$ above $2.3 \\times 10^{-12}~\\mathrm{GeV}^{-1}$ for ALP masses between 12.4 and 14.5\\,eV, improving upon previous limits by a factor of seven.",
      "pdf_url": "https://arxiv.org/pdf/2506.19962.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.13268",
      "title": "Effective bias expansion for circumventing 21 cm foregrounds",
      "authors": [
        "Wenzer Qin",
        "Kai-Feng Chen",
        "Katelin Schutz",
        "Adrian Liu"
      ],
      "abstract": "Effective bias expansion for circumventing 21 cm foregrounds Wenzer Qin, Kai-Feng Chen, Katelin Schutz, Adrian Liu Cosmology and Nongalactic Astrophysics (astro-ph.CO) The 21 cm line of neutral hydrogen is a promising probe of the Epoch of Reionization (EoR) but suffers from contamination by spectrally smooth foregrounds, which obscure the large-scale signal along the line of sight. We explore the possibility of indirectly extracting the 21 cm signal in the presence of foregrounds by taking advantage of nonlinear couplings between large and small scales, both at the level of the density field and a biased tracer of that field. When combined with effective field theory techniques, bias expansions allow for a systematic treatment of nonlinear mode-couplings in the map between the underlying density field and the 21 cm field. We apply an effective bias expansion to density information generated with $\\texttt{21cmFAST}$ using a variety of assumptions about which information can be recovered by different surveys and density estimation techniques. We find that the 21 cm signal produced by our effective bias expansion, combined with our least optimistic foreground assumptions, produces $\\sim30\\%$ cross-correlations with the true 21 cm field. Providing complementary density information from high-redshift galaxy surveys yields a cross-correlation of 50-70%. The techniques presented here may be combined with foreground mitigation strategies in order to improve the recovery of the large-scale 21 cm signal.",
      "pdf_url": "https://arxiv.org/pdf/2508.13268.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.05187",
      "title": "Efficient evaluation of the dark-matter two-loop power spectrum in the EFT of LSS",
      "authors": [
        "Charalampos Anastasiou",
        "Andrea Favorito",
        "Matthew Lewandowski",
        "Leonardo Senatore",
        "Henry Zheng"
      ],
      "abstract": "Efficient evaluation of the dark-matter two-loop power spectrum in the EFT of LSS Charalampos Anastasiou, Andrea Favorito, Matthew Lewandowski, Leonardo Senatore, Henry Zheng v2: typos fixed, notation improvements, extended discussions, 60+17 pages, 14 figures, ancillary file included Cosmology and Nongalactic Astrophysics (astro-ph.CO) Rapid progress in cosmological Large Scale Structure (LSS) surveys motivates precise theoretical predictions. The Effective Field Theory of Large-Scale Structure (EFTofLSS) is routinely applied to data, and requires fast computation of its predictions when sampling the large space of cosmological parameters. Going beyond existing one-loop techniques, we present a method to rapidly evaluate the two-loop power spectrum. Our method decomposes the typically small difference between a given linear power spectrum and a reference power spectrum into a cosmology-independent basis of functions resembling massive scalar propagators in Quantum Field Theory. By taking the leading terms in such a small difference, we numerically evaluate the cosmology-independent loop integrals where in the integrand only the relevant combinations of basis functions appear. We achieve an efficient numerical evaluation via physically motivated local ultraviolet subtractions and by arranging the cancellation of infrared singularities locally in the integrands. Final predictions are obtained by contracting these precomputed integrals with the cosmology-dependent coordinates of the expansion in the fixed basis. We present and publicly release the precomputed integrals for the renormalized two-loop dark-matter power spectrum in the EFTofLSS. These require eight EFT counterterms, which include the effect of generated vorticity, and are sufficient to analyze the lensing galaxy signal in LSS surveys at this order.",
      "pdf_url": "https://arxiv.org/pdf/2509.05187.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.10604",
      "title": "CMB component-separated power spectrum estimation by Spectral Internal Linear Combination (SpILC)",
      "authors": [
        "Jack Y. L. Kwok",
        "William R. Coulton",
        "Niall MacCrann",
        "Fiona McCarthy",
        "Boris Bolliet",
        "Blake D. Sherwin"
      ],
      "abstract": "CMB component-separated power spectrum estimation by Spectral Internal Linear Combination (SpILC) Jack Y. L. Kwok, William R. Coulton, Niall MacCrann, Fiona McCarthy, Boris Bolliet, Blake D. Sherwin 12+6 pages, 6 figures. Submitted to PRD. v2: minor edits, changes to Appendix C Cosmology and Nongalactic Astrophysics (astro-ph.CO) Component separation methods mitigate the cross-contamination between different extragalactic and galactic contributions to cosmic microwave background (CMB) data. This is often done by linearly combining CMB maps from different frequency channels using internal linear combination (ILC) methods. We demonstrate that deriving power spectrum estimators directly by linearly combining auto- and cross-spectra instead of maps allows us to obtain a different constrained-optimization problem that allows fewer (deprojection) constraint equations than combining at map level using the constrained ILC method. Through simulations, we show that our Spectral internal linear combination (SpILC) produces CMB power spectrum estimators with more than 7 times smaller errorbars than constrained ILC (with thermal Sunyaev-Zel'dovich and cosmic infrared background deprojections) at $\\ell\\gtrsim 4000$ for Simons Observatory-like observations. Spectral ILC outperforms constrained ILC methods when some modeled components are spatially uncorrelated, e.g. the primary CMB is uncorrelated with foregrounds, and the difference in performance is most significant at noise-dominated scales. More generally, our work shows that component-separated maps with foreground deprojections do not necessarily produce minimum-variance two-or-higher-point estimators.",
      "pdf_url": "https://arxiv.org/pdf/2509.10604.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23565",
      "title": "Dark Energy Survey Year 6 Results: Clustering-redshifts and importance sampling of Self-Organised-Maps $n(z)$ realizations for $3\\times2$pt samples",
      "authors": [
        "W. d'Assignies",
        "G. M. Bernstein",
        "B. Yin",
        "G. Giannini",
        "A. Alarcon",
        "M. Manera",
        "C. To",
        "M. Yamamoto",
        "N. Weaverdyck",
        "R. Cawthon",
        "M. Gatti",
        "A. Amon",
        "D. Anbajagane",
        "S. Avila",
        "M. R. Becker",
        "K. Bechtol",
        "C. Chang",
        "M. Crocce",
        "J. De Vicente",
        "S. Dodelson",
        "J. Fang",
        "A. Ferté",
        "D. Gruen",
        "E. Legnani",
        "A. Porredon",
        "J. Prat",
        "M. Rodriguez-Monroy",
        "C. Sánchez",
        "T. Schutt",
        "I. Sevilla-Noarbe",
        "D. Sanchez Cid",
        "M. A. Troxel",
        "T. M. C. Abbott",
        "F. Andrade-Oliveira",
        "M. Aguena",
        "O. Alves",
        "D. Bacon",
        "J. Blazek",
        "S. Bocquet",
        "D. Brooks",
        "R. Camilleri",
        "A. Carnero Rosell",
        "M. Carrasco Kind",
        "J. Carretero",
        "F. J. Castander",
        "L. N. da Costa",
        "M. E. da Silva Pereira",
        "T. M. Davis",
        "S. Desai",
        "P. Doel",
        "C. Doux",
        "A. Drlica-Wagner",
        "T. Eifler",
        "J. Elvin-Poole",
        "S. Everett",
        "B. Flaugher",
        "P. Fosalba",
        "J. Frieman",
        "J. Garcia-Bellido",
        "E. Gaztanaga",
        "P. Giles",
        "G. Gutierrez",
        "S. R. Hinton",
        "D. L. Hollowood",
        "K. Honscheid",
        "D. Huterer",
        "B. Jain",
        "D. J. James",
        "K. Kuehn",
        "O. Lahav",
        "S. Lee",
        "J. L. Marshall",
        "J. Mena-Fernandez",
        "F. Menanteau",
        "R. Miquel",
        "J. Muir",
        "J. Myles",
        "R. L. C. Ogando",
        "A. Palmese",
        "M. Paterno",
        "P. Petravick",
        "A. A. Plazas Malagon",
        "M. Raveri",
        "A. Roodman",
        "S. Samuroff",
        "E. Sanchez",
        "E. Sheldon",
        "T. Shin",
        "M. Smith",
        "E. Suchyta",
        "M. E. C. Swanson",
        "G. Tarle",
        "D. Thomas",
        "V. Vikram",
        "A. R. Walker"
      ],
      "abstract": "Dark Energy Survey Year 6 Results: Clustering-redshifts and importance sampling of Self-Organised-Maps $n(z)$ realizations for $3\\times2$pt samples W. d'Assignies, G. M. Bernstein, B. Yin, G. Giannini, A. Alarcon, M. Manera, C. To, M. Yamamoto, N. Weaverdyck, R. Cawthon, M. Gatti, A. Amon, D. Anbajagane, S. Avila, M. R. Becker, K. Bechtol, C. Chang, M. Crocce, J. De Vicente, S. Dodelson, J. Fang, A. Ferté, D. Gruen, E. Legnani, A. Porredon, J. Prat, M. Rodriguez-Monroy, C. Sánchez, T. Schutt, I. Sevilla-Noarbe, D. Sanchez Cid, M. A. Troxel, T. M. C. Abbott, F. Andrade-Oliveira, M. Aguena, O. Alves, D. Bacon, J. Blazek, S. Bocquet, D. Brooks, R. Camilleri, A. Carnero Rosell, M. Carrasco Kind, J. Carretero, F. J. Castander, L. N. da Costa, M. E. da Silva Pereira, T. M. Davis, S. Desai, P. Doel, C. Doux, A. Drlica-Wagner, T. Eifler, J. Elvin-Poole, S. Everett, B. Flaugher, P. Fosalba, J. Frieman, J. Garcia-Bellido, E. Gaztanaga, P. Giles, G. Gutierrez, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. Huterer, B. Jain, D. J. James, K. Kuehn, O. Lahav, S. Lee, J. L. Marshall, J. Mena-Fernandez, F. Menanteau, R. Miquel, J. Muir, J. Myles, R. L. C. Ogando, A. Palmese, M. Paterno, P. Petravick, A. A. Plazas Malagon, M. Raveri, A. Roodman, S. Samuroff, E. Sanchez, E. Sheldon, T. Shin, M. Smith, E. Suchyta, M. E. C. Swanson, G. Tarle, D. Thomas, V. Vikram, A. R. Walker Cosmology and Nongalactic Astrophysics (astro-ph.CO) This work is part of a series establishing the redshift framework for the $3\\times2$pt analysis of the Dark Energy Survey Year 6 (DES Y6). For DES Y6, photometric redshift distributions are estimated using self-organizing maps (SOMs), calibrated with spectroscopic and many-band photometric data. To overcome limitations from color-redshift degeneracies and incomplete spectroscopic coverage, we enhance this approach by incorporating clustering-based redshift constraints (clustering-z, or WZ) from angular cross-correlations with BOSS and eBOSS galaxies, and eBOSS quasar samples. We define a WZ likelihood and apply importance sampling to a large ensemble of SOM-derived $n(z)$ realizations, selecting those consistent with the clustering measurements to produce a posterior sample for each lens and source bin. The analysis uses angular scales of 1.5-5 Mpc to optimize signal-to-noise while mitigating modeling uncertainties, and marginalizes over redshift-dependent galaxy bias and other systematics informed by the N-body simulation Cardinal. While a sparser spectroscopic reference sample limits WZ constraining power at $z>1.1$, particularly for source bins, we demonstrate that combining SOMPZ with WZ improves redshift accuracy and enhances the overall cosmological constraining power of DES Y6. We estimate an improvement in $S_8$ of approximately 10\\% for cosmic shear and $3\\times2$pt analysis, primarily due to the WZ calibration of the source samples.",
      "pdf_url": "https://arxiv.org/pdf/2510.23565.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26767",
      "title": "Unbiased Primordial Gravitational Wave Inference from the CMB with SMICA",
      "authors": [
        "Alexander Steier",
        "Shamik Ghosh",
        "Jacques Delabrouille"
      ],
      "abstract": "Unbiased Primordial Gravitational Wave Inference from the CMB with SMICA Alexander Steier, Shamik Ghosh, Jacques Delabrouille 18 pages, 9 figures. Version published in JCAP Alexander Steier et al JCAP02(2026)080 Cosmology and Nongalactic Astrophysics (astro-ph.CO) The detection of primordial gravitational waves in Cosmic Microwave Background B-mode polarization observations requires accurate and robust subtraction of astrophysical contamination. We show, using a blind Spectral Matching Independent Component Analysis, that it is possible to infer unbiased estimates of the primordial B-mode signal from ground-based observations of a small patch of sky even for highly complex foreground contamination. This work, originally performed in the context of configuration studies for a future CMB-S4 observatory, is highly relevant for the analysis of observations by the current generation of CMB experiments.",
      "pdf_url": "https://arxiv.org/pdf/2510.26767.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.16386",
      "title": "XMM-Newton observations of ten high-redshift CAMIRA clusters of galaxies",
      "authors": [
        "Naomi Ota",
        "Ikuyuki Mitsuishi",
        "Nobuhiro Okabe",
        "Masamune Oguri",
        "Yoshiki Toba",
        "Kuga Harada",
        "Marie Kondo",
        "Satoshi Miyazaki",
        "Koki Sakuta",
        "Kosuke Sato",
        "Anri Yanagawa",
        "Anje Yoshimoto"
      ],
      "abstract": "XMM-Newton observations of ten high-redshift CAMIRA clusters of galaxies Naomi Ota, Ikuyuki Mitsuishi, Nobuhiro Okabe, Masamune Oguri, Yoshiki Toba, Kuga Harada, Marie Kondo, Satoshi Miyazaki, Koki Sakuta, Kosuke Sato, Anri Yanagawa, Anje Yoshimoto 10 pages, 5 figures, PASJ accepted Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present results from XMM-Newton observations of ten high-redshift ($0.81 < z < 1.17$) galaxy clusters selected from the CAMIRA catalog based on high richness ($N > 40$). These massive clusters, identified in the Hyper Suprime-Cam Subaru Strategic Program field, provide an ideal sample for probing the dynamical state of the intracluster medium (ICM) in the early Universe. We performed uniform X-ray imaging and spectral analyses to measure the ICM temperature and bolometric luminosity, and investigated cluster morphology through offsets between the brightest cluster galaxy (BCG) and the X-ray peak. Extended X-ray emission was detected from all targets, but only one system was classified as dynamically relaxed, indicating a low relaxed fraction ($\\sim 10\\%$) at high redshift. By combining this high-$z$ sample with a lower-redshift CAMIRA cluster sample, we derived scaling relations among richness, temperature, luminosity, and mass. The results are broadly consistent with predictions from both the self-similar model and the baseline model incorporating the mass--concentration relation. We find no significant redshift evolution, strengthening the view that cluster scaling relations are largely established by $z \\sim 1$. We also examined the AGN fraction among member galaxies and found significantly higher AGN activity in high-redshift clusters, particularly in the outskirts, suggesting enhanced AGN triggering during early cluster assembly and a possible connection to the thermodynamic state of dynamically young clusters. These findings provide new insights into the formation and evolution of massive clusters and the thermodynamic history of the ICM, and complement large-area X-ray surveys such as eROSITA.",
      "pdf_url": "https://arxiv.org/pdf/2601.16386.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.20483",
      "title": "Cosmology with galaxy clusters using machine learning. Application to eROSITA Data",
      "authors": [
        "Fucheng Zhong",
        "Nicola R. Napolitano",
        "Johan Comparat",
        "Klaus Dolag",
        "Caroline Heneka",
        "Zhiqi Huang",
        "Xiaodong Li",
        "Weipeng Lin",
        "Giuseppe Longo",
        "Mario Radovich",
        "Crescenzo Tortora"
      ],
      "abstract": "Cosmology with galaxy clusters using machine learning. Application to eROSITA Data Fucheng Zhong, Nicola R. Napolitano, Johan Comparat, Klaus Dolag, Caroline Heneka, Zhiqi Huang, Xiaodong Li, Weipeng Lin, Giuseppe Longo, Mario Radovich, Crescenzo Tortora Submitted, 15 pages and 12 figures. Comments are welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Context: We present the first Cosmological Parameter inferences from eROSITA X-ray observations of galaxy clusters using a Machine Learning algorithm. Methods: We train a Random Forest using mock catalogs of clusters from Magneticum multi-cosmology hydrodynamical simulations. We apply the trained ML algorithm to observed X-ray features (gas luminosity, mass, and temperature) at different redshifts from the eROSITA eFEDS and eRASS1 catalogs. Results: We obtain cosmological constraints with precision comparable to those from standard analyses, such as weak lensing and cluster abundances. We infer $\\Omega_{\\rm m}=0.30^{+0.03}_{-0.02}$, $\\sigma_8=0.81\\pm0.01$, and $h_0=0.710\\pm0.004$. The recovered parameters show no tension in the $\\Omega_{\\rm m}-\\sigma_8$ space, but a significant deviation of $h_0$ from the Planck estimates. These inferences remain rather stable against variations of the input observable set and parameter space coverage. These results indicate that correlations among intracluster properties contain cosmological information beyond that encoded in the cluster abundance alone, which can be captured by machine learning trained on multi-cosmology simulations. Conclusions: ML algorithms trained on multi-cosmology hydrodynamical simulations can effectively infer cosmological parameters directly from galaxy cluster data. This is a change of paradigm in the context of cosmological parameter inferences. This approach complements traditional cluster-count analyses and is particularly suited to large upcoming surveys, where systematic uncertainties in mass calibration may otherwise dominate the error budget. It also highlights the potential of large-scale X-ray surveys to deliver independent tests of the standard cosmological model.",
      "pdf_url": "https://arxiv.org/pdf/2602.20483.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.05323",
      "title": "SKYSURF. X. A Novel Method for Measuring Integrated Galaxy Light",
      "authors": [
        "Delondrae D. Carter",
        "Timothy Carleton",
        "Daniel J. Henningsen",
        "Rogier A. Windhorst",
        "Seth H. Cohen",
        "Scott A. Tompkins",
        "Rosalia O'Brien",
        "Anton M. Koekemoer",
        "Juno Li",
        "Zak Goisman",
        "Simon P. Driver",
        "Aaron S. G. Robotham",
        "Rolf A. Jansen",
        "Norman A. Grogin",
        "Sabine Bellstedt",
        "Haina Huang",
        "Tejovrash Acharya",
        "Jessica M. Berkheimer",
        "Haley Abate",
        "Connor Gelb",
        "Isabela Huckabee",
        "John MacKenty"
      ],
      "abstract": "SKYSURF. X. A Novel Method for Measuring Integrated Galaxy Light Delondrae D. Carter, Timothy Carleton, Daniel J. Henningsen, Rogier A. Windhorst, Seth H. Cohen, Scott A. Tompkins, Rosalia O'Brien, Anton M. Koekemoer, Juno Li, Zak Goisman, Simon P. Driver, Aaron S. G. Robotham, Rolf A. Jansen, Norman A. Grogin, Sabine Bellstedt, Haina Huang, Tejovrash Acharya, Jessica M. Berkheimer, Haley Abate, Connor Gelb, Isabela Huckabee, John MacKenty Published in ApJS, 283, 21 (2026). Updated to match the final journal version Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We describe the drizzling pipeline and contents of the drizzled database for Hubble Space Telescope Cycle 27-29 Archival Legacy project \"SKYSURF,\" the largest archival project ever approved for Hubble. SKYSURF aims to investigate the extragalactic background light using all 143,914 ACSWFC, WFC3UVIS, and WFC3IR images that have been taken by Hubble since its launch in 2002. SKYSURF has produced 38,027 single-visit mosaics and 7,893 multi-visit mosaics across 28 ACSWFC, WFC3UVIS, and WFC3IR filters using nonstandard drizzling methods, which include preserving the lowest sky-level of each visit/group in the drizzled products, applying wider apertures for cosmic-ray rejection, correcting effects caused by charge transfer efficiency degradation, and removing potential light gradients from input images via sky-map subtraction. We generate source catalogs for all drizzled products with SExtractor and provide updated star-galaxy separation parameters and integrated galaxy light (IGL) estimates for 25 of the 28 SKYSURF filters (wavelength range 0.2-1.7 um) using a novel IGL fitting method made possible by the vast SKYSURF dataset. We discuss the data processing and data analysis challenges encountered, detail our solutions, and offer suggestions that may facilitate future large-scale IGL investigations with Webb, SPHEREx, and Roman.",
      "pdf_url": "https://arxiv.org/pdf/2507.05323.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21290",
      "title": "Global Magnetohydrodynamic Simulations of Monster Shocks in Neutron Star Magnetospheres",
      "authors": [
        "Michael P. Grehan",
        "Bart Ripperda",
        "Andrei M. Beloborodov",
        "Christopher Thompson",
        "Elias R. Most"
      ],
      "abstract": "Global Magnetohydrodynamic Simulations of Monster Shocks in Neutron Star Magnetospheres Michael P. Grehan, Bart Ripperda, Andrei M. Beloborodov, Christopher Thompson, Elias R. Most 24 pages, 18 figures, submitted to the Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) Waves launched from the neutron star surface or inner magnetosphere propagate through the magnetosphere as small perturbations, but can grow relative to the background magnetic field and steepen into ``monster shocks'' -- ultra-relativistic magnetized shocks which can power high-energy emission from magnetars, neutron star mergers and collapse. They occur in magnetically dominated plasma and are described by relativistic magnetohydrodynamics (MHD). We present global relativistic MHD simulations of monster shocks in unperturbed and perturbed (``wrinkled'') backgrounds with a global dipolar geometry. Our simulations confirm analytical predictions for equatorial shocks and provide new insight into the behavior of oblique shocks off the equator. Simulations where the shock is formed through Alfvén mode to fast mode conversion are also presented, demonstrating the generic nature of the monster shock mechanism. We explore how the presence of additional modes in the magnetosphere modifies the shock behavior. Modes of comparable amplitude can fragment the shock front, substantially reduce the magnetization, produce localized enhancements in the Lorentz factor relative to an unperturbed dipole background, and intermittently generate additional shocks along a line of sight.",
      "pdf_url": "https://arxiv.org/pdf/2602.21290.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21291",
      "title": "Collapse of Magnetized White Dwarfs as site of Heavy Element Formation and Kilonova Signal",
      "authors": [
        "Tetyana Pitik",
        "David Radice",
        "Daniel Kasen",
        "Fabio Magistrelli",
        "Patrick Chi-Kit Cheong",
        "Sebastiano Bernuzzi"
      ],
      "abstract": "Collapse of Magnetized White Dwarfs as site of Heavy Element Formation and Kilonova Signal Tetyana Pitik, David Radice, Daniel Kasen, Fabio Magistrelli, Patrick Chi-Kit Cheong, Sebastiano Bernuzzi High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) We present the first end-to-end calculation connecting the accretion-induced collapse (AIC) of a magnetized, rapidly rotating white dwarf to observable kilonova signatures, combining 2D general-relativistic neutrino-magnetohydrodynamic simulations, followed by radiation hydrodynamics with in-situ nuclear network and 2D Monte Carlo radiative transfer with spatially resolved heating rates. Unlike all previous unmagnetized AIC models - which predicted proton-rich, $^{56}$Ni-dominated ejecta - strong magnetic fields eject ${\\sim 0.2 M_\\odot}$ of neutron-rich material $(\\langle Y_e \\rangle \\sim 0.24)$ on dynamical timescales, before neutrino irradiation can raise the electron fraction, enabling strong $r$-process nucleosynthesis up to and beyond the third peak. The resulting kilonova is lanthanide-rich $(X_{\\rm lan} \\approx 6\\%)$ and dominated by near-infrared emission. We compute synthetic light curves in the LSST and JWST bands and find striking agreement, without parameter tuning, between the observations of AT 2023vfi/GRB 230307A and our broadband light curves for polar viewing angles. These results establish magnetized AIC as a viable channel for heavy $r$-process element production and a compelling progenitor candidate for long-duration gamma-ray bursts with kilonova signatures.",
      "pdf_url": "https://arxiv.org/pdf/2602.21291.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21294",
      "title": "Shock-induced chiral magnetic effect",
      "authors": [
        "Steven P. Harris",
        "Srimoyee Sen"
      ],
      "abstract": "Shock-induced chiral magnetic effect Steven P. Harris, Srimoyee Sen High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); Nuclear Theory (nucl-th) Weak-interaction-mediated chiral imbalance generation in idealized massless electrons during core-collapse supernovae was once proposed to be the source of strong magnetic fields found in neutron stars. The effect goes by the name of chiral plasma instability (CPI). However, it was found that a finite electron mass damps out this process, inactivating the instability and preventing magnetic field growth. In this work we show that the instability can survive in the presence of abrupt density and temperature perturbation that drives the system sufficiently far out of weak equilibrium. As an example, we work with such perturbations generated by shockwaves which are common during both core collapse as well as neutron star mergers. We find that the chiral imbalance resulting from shock waves, under the right conditions of density and temperature, can sustain the chiral plasma instability despite the damping from the electron mass. Additionally, in an already magnetized medium, the chiral magnetic effect resulting from shock wave density and temperature perturbation can generate substantial ohmic heating. Our results imply that shockwaves during core-collapse supernovae and merging neutron stars can act as a source of strong heating in a magnetized medium as well as CPI.",
      "pdf_url": "https://arxiv.org/pdf/2602.21294.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21412",
      "title": "Complex Analysis of Askaryan Radiation: UHE-$ν$ Identification and Reconstruction using the Hilbert Envelope of Observed Signals",
      "authors": [
        "J. C. Hanson",
        "R. Hartig"
      ],
      "abstract": "Complex Analysis of Askaryan Radiation: UHE-$ν$ Identification and Reconstruction using the Hilbert Envelope of Observed Signals J. C. Hanson, R. Hartig High Energy Astrophysical Phenomena (astro-ph.HE) The detection of ultra-high energy neutrinos (UHE-$\\nu$), with enegies above 10 PeV, has been a long-time goal in astroparticle physics. Autonomous, radio-frequency (RF) UHE-$\\nu$ detetectors have been deployed in polar regions that rely on the Askaryan effect in ice for the neutrino signal. The Askaryan effect occurs when the excess negative charge within a UHE-$\\nu$ cascade radiates in a dense medium. UHE-$\\nu$ can induce cascades that radiate in the RF bandwidth above thermal backgrounds. To identify UHE-$\\nu$ signals in data from Askaryan-class detectors, analytic models of the Askaryan electromagnetic field have been created and matched to simulations and laboratory measurements. These models describe the Askaryan electromagnetic field, but leave the effects of signal propagation through polar ice and RF channel response to simulations. In this work, a fully analytic Askaryan model that accounts for these effects is presented. First, formulas for the observed voltage trace and its Hilbert envelope are calculated. Second, the analytic model is compared to UHE-$\\nu$ signals at 100 PeV from NuRadioMC, a key Monte Carlo toolset in the field. Correlation coefficients between the analytic signal envelope and MC data in excess of $0.94$ are found, and 99.99% of UHE-$\\nu$ signals pass a correlation threshold of $\\rho\\geq 0.4$. Analysis of RF thermal noise reveals that just 0.2 background events have $\\rho\\geq 0.4$ in 5 years at a 1 Hz thermal trigger rate. Finally, we describe future work related to the measurement of the logarithm of the UHE-$\\nu$ cascade energy.",
      "pdf_url": "https://arxiv.org/pdf/2602.21412.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21516",
      "title": "Short-duration GRB 250221A Afterglow Driven by Two-Component Jets from merger of compact star",
      "authors": [
        "Xiao Tian",
        "Hou-Jun Lü",
        "XiaoXuan Liu",
        "Xiao-Fei Dong",
        "Jia Ren",
        "Wen-Long Zhang",
        "EnWei Liang"
      ],
      "abstract": "Short-duration GRB 250221A Afterglow Driven by Two-Component Jets from merger of compact star Xiao Tian, Hou-Jun Lü, XiaoXuan Liu, Xiao-Fei Dong, Jia Ren, Wen-Long Zhang, EnWei Liang 14 pages, 5 figures, and 1 table. Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) GRB 250221A is a short gamma-ray burst (GRB) at redshift $z=0.768$, with a duration of 1.8 s and no extended emission in either Swift/BAT or Konus-Wind bands. A remarkable re-brightening feature in both optical and X-ray bands was observed at $\\sim 0.6$ days after the burst trigger, but no supernova or kilonova signature was detected. The burst properties and empirical correlations or distributions (e.g., duration, spectral hardness, location in the Amati correlation, $\\varepsilon-$value, $f_{\\rm eff}$ parameter, and physical offset) favor a compact binary merger origin. However, a dense circumburst medium with $n\\sim 80\\rm~cm^{-3}$, obtained by adopting the energy injection into a jet to interpret the late-time re-brightening is inconsistent with the compact binary merger origin. In this paper, we propose a two-component jet model to explain the multiwavelength afterglow observations of GRB 250221A, in which the relativistic narrow jet ($\\rm \\theta_{c} \\sim 3.8^\\circ$) produces the prompt and the early decay afterglow emission, while the mildly relativistic wide jet ($\\rm \\theta_{w} \\sim 4.4^\\circ$) dominates at later times, resulting in the observed re-brightening feature. If this is the case, one can obtain a lower medium density with $n\\sim 0.72\\rm~cm^{-3}$ which is a little bit higher than that of short GRBs in merger environments, but falls into the reasonable and acceptable range. Finally, a possible kilonova emission is also discussed within the scenario of compact star merger origin of GRB 250221A.",
      "pdf_url": "https://arxiv.org/pdf/2602.21516.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21624",
      "title": "AT2024lhc and AT2024kmq in the landscape of featureless tidal disruption events",
      "authors": [
        "Yuhan Yao",
        "Ryan Chornock",
        "Andrew Mummery",
        "Raffaella Margutti",
        "Marat Gilfanov",
        "Muryel Guolo",
        "Eric R. Coughlin",
        "Wenbin Lu",
        "Joheen Chakraborty",
        "Dheeraj R. Pasham",
        "Kate D. Alexander",
        "Olivia Aspegren",
        "Charlotte R. Angus",
        "Xinze Guo",
        "Xander J. Hall",
        "Erica Hammerstein",
        "K.-Ryan Hinds",
        "Anna Y. Q. Ho",
        "Xiaoshan Huang",
        "Elias Kammoun",
        "Natalie LeBaron",
        "Matteo Lucchini",
        "Zoë McGrath",
        "Matt Nicholl",
        "Daniel A. Perley",
        "R. Michael Rich",
        "Genevieve Schroeder",
        "Xinyue Sheng",
        "Jesper Sollerman",
        "Jean Somalwar",
        "Jacob R. Wise",
        "Michael W. Coughlin",
        "Andrew Drake",
        "Matthew J. Graham",
        "George Helou",
        "Joahan C. Jaimes",
        "Mansi M. Kasliwal",
        "Ashish A. Mahabal",
        "Pavel Medvedev",
        "Josiah Purdum",
        "Ben Rusholme",
        "Rashid Sunyaev"
      ],
      "abstract": "AT2024lhc and AT2024kmq in the landscape of featureless tidal disruption events Yuhan Yao, Ryan Chornock, Andrew Mummery, Raffaella Margutti, Marat Gilfanov, Muryel Guolo, Eric R. Coughlin, Wenbin Lu, Joheen Chakraborty, Dheeraj R. Pasham, Kate D. Alexander, Olivia Aspegren, Charlotte R. Angus, Xinze Guo, Xander J. Hall, Erica Hammerstein, K.-Ryan Hinds, Anna Y. Q. Ho, Xiaoshan Huang, Elias Kammoun, Natalie LeBaron, Matteo Lucchini, Zoë McGrath, Matt Nicholl, Daniel A. Perley, R. Michael Rich, Genevieve Schroeder, Xinyue Sheng, Jesper Sollerman, Jean Somalwar, Jacob R. Wise, Michael W. Coughlin, Andrew Drake, Matthew J. Graham, George Helou, Joahan C. Jaimes, Mansi M. Kasliwal, Ashish A. Mahabal, Pavel Medvedev, Josiah Purdum, Ben Rusholme, Rashid Sunyaev 24 pages, 16 figures, submitted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) We study AT2024kmq and AT2024lhc, two tidal disruption events (TDEs) with blue featureless spectra associated with high-mass black holes ($M_{\\rm BH}\\sim 10^8\\,M_\\odot$). Both events show optical precursors consistent with shock dissipation from stream self-intersection. Their X-ray emission is luminous ($L_{\\rm X}\\sim 10^{44}\\,{\\rm erg\\,s^{-1}}$), highly variable (with minimum observed variability timescales of 1.3\\,hr and 4.8\\,hr for factor of $\\sim3$ flux changes), long-lasting ($>1\\,\\rm yr$), emerging no later than the optical peak, and well characterized by power-laws with $1.7<\\Gamma<3$ (where $f_\\nu \\propto \\nu^{1-\\Gamma}$). The X-ray properties and radio non-detections support a compact corona ($\\lesssim 10 r_{\\rm g}$) producing Comptonized X-ray emission. Using all published featureless TDEs, we find statistically significant bimodality in the distribution of their peak UV/optical blackbody luminosities and radii. We assemble a comparison TDE sample with early-time X-ray observations with eROSITA, in which we find different $M_{\\rm BH}$ distributions in TDEs with different X-ray spectral evolution properties: low-mass black holes ($M_{\\rm BH} \\sim 10^6 M_\\odot$) remain soft ($\\Gamma>4$) within $t\\lesssim 2$\\,yr, intermediate masses ($\\sim 10^7 M_\\odot$) transition from soft to hard at $\\sim$1 yr, while high masses ($\\sim 10^8 M_\\odot$) are hard ($1.5<\\Gamma\\lesssim 3$) from the outset. We interpret this result as evidence that the soft-to-hard state transition in TDEs occurs at the critical threshold of $\\dot{M}_{\\rm acc} \\sim 0.03 \\dot M_{\\rm Edd}$ (similar to X-ray binaries), using the fact that the transition timescale predicted by simple disk theory scales with black hole mass as $t_{\\rm tr}\\propto M_{\\rm BH}^{-3/4}$.",
      "pdf_url": "https://arxiv.org/pdf/2602.21624.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21651",
      "title": "$r$-mode stabilization in rotating hyperon-rich neutron stars and its implications for GW190814",
      "authors": [
        "Athira S",
        "Monika Sinha"
      ],
      "abstract": "$r$-mode stabilization in rotating hyperon-rich neutron stars and its implications for GW190814 Athira S, Monika Sinha High Energy Astrophysical Phenomena (astro-ph.HE) The GW190814 event, involving a black hole of mass $22.2$--$24.3 M_{\\odot}$ and a compact object of mass $2.50$--$2.67 M_{\\odot}$, challenges our understanding of the mass gap between the heaviest neutron stars and the lightest black holes. If the secondary is a neutron star exceeding $2.5 M_{\\odot}$, hyperons are likely to appear in its core, softening the equation of state. Rapid rotation can offset some of this softening, enabling higher maximum masses, but it may simultaneously excite the Chandrasekhar--Friedman--Schutz $r$-mode instability. Bulk viscosity arising from nonleptonic weak interactions in hyperonic matter provides an efficient damping mechanism that can stabilize such configurations. In this work, we investigate the combined effects of rotation, thermal evolution, and hyperon-induced bulk viscosity on the stability of massive neutron stars. We demonstrate a direct connection between the suppression of $r$-mode instabilities and the long-term dynamical stability of hyperon-rich stars, offering a plausible interpretation of the GW190814 secondary as a rapidly rotating, hyperon-rich neutron star rather than a low-mass black hole. Our unified framework extends beyond previous studies restricted to static equations of state or extreme viscous damping assumptions, providing new insights into the stability of massive, exotic neutron star configurations.",
      "pdf_url": "https://arxiv.org/pdf/2602.21651.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21661",
      "title": "Spectral and photometric variability of SS 433 observed with XRISM and simultaneous optical and near-infrared telescopes",
      "authors": [
        "Yusuke Sakai",
        "Shinya Yamada",
        "Yuta Okada",
        "Toshihiro Takagi",
        "Tomoya Usuki",
        "Megumi Shidatsu",
        "Shogo B Kobayashi",
        "Robert Petre",
        "Yoshihiro Ueda",
        "Hideki Uchiyama",
        "Miho Tan",
        "Taro Kotani",
        "Taichi Igarashi",
        "Mami Machida",
        "Haruka Sakemi",
        "Nobuyuki Kawai",
        "Daiki Miura",
        "Hiroya Yamaguchi",
        "Kanta Fujiwara",
        "Daichi Hiramatsu",
        "Keisuke Isogai",
        "Chulsoo Kang",
        "Mariko Kimura",
        "Katsuhiro L Murata",
        "Takahiro Nagayama",
        "Taichi Nakamoto",
        "Kosuke Namekata",
        "Yuki Niida",
        "Yuu Niino",
        "Masafumi Niwano",
        "Kyuseok Oh",
        "Shigeyuki Sako",
        "Mahito Sasada",
        "Hiromasa Suzuki",
        "Kenta Taguchi",
        "Ichiro Takahashi",
        "Miyu Uenishi",
        "Yoichi Yatsu",
        "Marina Yoshimoto"
      ],
      "abstract": "Spectral and photometric variability of SS 433 observed with XRISM and simultaneous optical and near-infrared telescopes Yusuke Sakai, Shinya Yamada, Yuta Okada, Toshihiro Takagi, Tomoya Usuki, Megumi Shidatsu, Shogo B Kobayashi, Robert Petre, Yoshihiro Ueda, Hideki Uchiyama, Miho Tan, Taro Kotani, Taichi Igarashi, Mami Machida, Haruka Sakemi, Nobuyuki Kawai, Daiki Miura, Hiroya Yamaguchi, Kanta Fujiwara, Daichi Hiramatsu, Keisuke Isogai, Chulsoo Kang, Mariko Kimura, Katsuhiro L Murata, Takahiro Nagayama, Taichi Nakamoto, Kosuke Namekata, Yuki Niida, Yuu Niino, Masafumi Niwano, Kyuseok Oh, Shigeyuki Sako, Mahito Sasada, Hiromasa Suzuki, Kenta Taguchi, Ichiro Takahashi, Miyu Uenishi, Yoichi Yatsu, Marina Yoshimoto Accepted for publication in PASJ. The paper is 18 pages long with 16 figures High Energy Astrophysical Phenomena (astro-ph.HE) We present results from coordinated multiwavelength observations of the SS 433, obtained with XRISM, optical telescopes, and near-infrared camera during 2024 April and 2025 March. The XRISM exposures amounted to ~200 ks in 2024 and ~100 ks in 2025. With XRISM/Resolve's high spectral resolution and large effective area, we clearly resolved numerous emission lines even in short time segments, achieving improved accuracy in Doppler-shift measurements relative to earlier observations. The simultaneously obtained X-ray and optical Doppler shifts suggest a possible tendency for the optical emission to lag slightly behind the X-rays. In the Resolve data, the Doppler shifts of the two jet components exhibited apparent asymmetries, with jet speeds fluctuating around ~0.26$\\pm$0.01$c$ in 2024 and ~0.30$\\pm$0.01$c$ in 2025. The velocity variations indicated modulations on a timescale of ~6.3 d, with a phase offset of about -90$^{\\circ}$ relative to the nutation cycle. The observed line widths and flux of the approaching and receding jets appear consistent with the expected geometrical effects, indicating systematically larger line widths in the inner regions of the jets, as proposed by Shidatsu et al. (2025). Optical light curves show flares of ~400 s in 2024 and ~1600 s in 2025, with amplitudes up to ~15% during out-of-eclipse intervals, while the XRISM/Xtend light curves show no significant variability within the overlapping intervals and given the statistical uncertainties. Near-infrared photometry in 2024, obtained during an out-of-eclipse interval at a different epoch from the optical observations, showed no flare-like variability, and the X-ray band also remained constant within uncertainties. These coordinated observations provide a foundation for future XRISM studies aimed at probing the dynamical properties of the relativistic jets in SS 433.",
      "pdf_url": "https://arxiv.org/pdf/2602.21661.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21795",
      "title": "Classical, large scale 3D MHD simulations of interacting pulsar wind nebulae",
      "authors": [
        "D. M.-A. Meyer",
        "D. F. Torres"
      ],
      "abstract": "Classical, large scale 3D MHD simulations of interacting pulsar wind nebulae D. M.-A. Meyer, D. F. Torres High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Magnetized rotating neutron stars, or pulsars, are a possible end product of massive star evolution. Their relativistic wind successively interacts with the supernova ejecta of their defunct progenitor, then with the circumstellar medium of the progenitor, and eventually with the interstellar medium. If a massive star is static with respect to its ambient medium, then its resulting circumstellar medium is elongated along the direction of the local magnetic field, and its supernova remnant transiently appears as a rectangle. The pulsar wind nebula forming in it is, in its turn, elongated, as long as the pulsar axis of rotation matches the direction of the local magnetization. In this work, we explore how the angle between the direction of the local magnetic field of the interstellar medium and the pulsar axis of rotation influences the shaping of its pulsar wind nebula with 3D MHD simulations are carried out with the PLUTO. We use those models to perform radiative transfer calculations to derive non-thermal radio emission maps of the pulsar wind nebulae. When the polar elongation of the pulsar develop, they bend in opposite directions under the effects of the cavity carved by the stellar wind and already filled by supernova ejecta. This induces a complex distribution of magnetized supernova ejecta and pulsar wind, resulting in various observable structures, appearing as rectangles, circles, or irregular oblong shapes, in the radio waveband. The angle between the direction of the pulsar rotation axis and that of the local ambient magnetization is a governing parameter for the shaping and non-thermal radio properties of the pulsar wind nebulae of static massive stars; however, the mixing of material, once the pulsar wind nebula is old (50 to 80 kyr), is not strongly affected by that factor.",
      "pdf_url": "https://arxiv.org/pdf/2602.21795.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21920",
      "title": "Probing Dark Photon Dark Matter with CTAO",
      "authors": [
        "Júlia G. Mamprim",
        "Aion Viana",
        "Vitor de Souza"
      ],
      "abstract": "Probing Dark Photon Dark Matter with CTAO Júlia G. Mamprim, Aion Viana, Vitor de Souza High Energy Astrophysical Phenomena (astro-ph.HE) The dark photon is a new hypothetical gauge boson arising in extensions of the Standard Model, and constitutes a compelling dark matter candidate. As dark photon dark matter (DPDM), it can interact with electromagnetic fields via kinetic mixing, and the inelastic scattering process $\\gamma \\gamma' \\to e^+ e^-$ becomes kinematically allowed for gamma rays above a characteristic energy threshold. This interaction imprints unique spectral attenuation features at very-high-energies (VHE), offering an observational probe of DPDM models. Using the Cherenkov Telescope Array Observatory (CTAO) Instrument Response Functions (IRFs), we simulate observations of VHE sources and forecast novel sensitivities to the kinetic mixing parameter for the photon-dark photon scattering process. Our study focuses on three key astrophysical targets: the Crab Nebula and the blazars Markarian 421 and Markarian 501. Additionally, we investigate the impact of dark matter spikes around black holes on the upper limits. Our results demonstrate that CTAO can probe the DPDM parameter space down to a mixing parameter of $\\varepsilon \\sim 10^{-8}$ for masses around $m_{A^{\\prime}} \\sim 10^{-1}~\\textrm{eV}$ through high-energy spectral attenuation, at a $95\\%$ confidence level.",
      "pdf_url": "https://arxiv.org/pdf/2602.21920.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22040",
      "title": "IGR J12580+0134: A Candidate for Repeating Partial Tidal Disruption Events Supported by Multi-Wavelength Observations",
      "authors": [
        "Po Ma",
        "Shao-Yu Fu",
        "Linhui Wu",
        "Wei-Hua Lei",
        "Qiang Yuan"
      ],
      "abstract": "IGR J12580+0134: A Candidate for Repeating Partial Tidal Disruption Events Supported by Multi-Wavelength Observations Po Ma, Shao-Yu Fu, Linhui Wu, Wei-Hua Lei, Qiang Yuan 13 pages, 6 figures, 2 tables, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Repeating partial tidal disruption events (pTDEs) provide a direct probe of stellar orbits and episodic mass loss around supermassive black holes, but robust identification requires multi-band and multi-epoch evidence. We investigate whether the late-time radio rebrightening of the nuclear transient IGR J12580+0134 in NGC 4845 can be explained as a repeating pTDE, using multi-epoch Karl G. Jansky VLA observations together with X-ray constraints from Swift/XRT and NICER. The radio light curves show two distinct episodes, with the L-band peaks separated by $\\approx1513$ days. Modeling the second episode with a synchrotron afterglow framework using Markov Chain Monte Carlo fitting favors a non-relativistic outflow $v\\simeq0.03c$, with an isotropic-equivalent kinetic energy of order $10^{50}$ erg propagating in an approximately constant-density circumnuclear medium. No significant contemporaneous brightening is detected by Swift/XRT during the 2016 radio flare, while faint NICER flares in 2023 suggest intermittent low-level accretion. The recurrence timescale and radio energetics therefore make IGR J12580+0134 a possible candidate for a repeating pTDE system, motivating continued sensitive radio and X-ray monitoring to test future reactivations.",
      "pdf_url": "https://arxiv.org/pdf/2602.22040.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22105",
      "title": "Forward hadron production in proton-air collisions above LHC energies through the fluctuations of extensive air showers",
      "authors": [
        "Lorenzo Cazon",
        "Ruben Conceição",
        "Miguel Alexandre Martins",
        "Felix Riehn"
      ],
      "abstract": "Forward hadron production in proton-air collisions above LHC energies through the fluctuations of extensive air showers Lorenzo Cazon, Ruben Conceição, Miguel Alexandre Martins, Felix Riehn High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph) Primary proton-air interactions at ultra-high energies leave a physically interpretable imprint on the correlated fluctuations of the depth of shower maximum and the muon content in extensive air showers. This imprint reflects the stochasticity in the partition of the primary energy among secondary particles in the first interaction. We show that these fluctuations can be accessed through a probabilistic description that isolates sensitivity to hadronic physics in the initial collision, while treating the subsequent shower development as effectively universal. The uncertainties resulting from this universality are smaller than the spread among current hadronic interaction models and comparable to current experimental uncertainties. Consequently, the joint observable space defined by these two quantities provides a new probe of hadron production in kinematic regimes far beyond the reach of human-made accelerators.",
      "pdf_url": "https://arxiv.org/pdf/2602.22105.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ex",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22148",
      "title": "Fermi-LAT 16-year Source List",
      "authors": [
        "J. Ballet",
        "P. Bruel",
        "T.H. Burnett",
        "B. Lott"
      ],
      "abstract": "J. Ballet, P. Bruel, T.H. Burnett, B. Lott (for the Fermi-LAT collaboration) High Energy Astrophysical Phenomena (astro-ph.HE) The current Fermi-LAT source catalog (4FGL-DR4: 7194 sources over 14 years) was built incrementally from the 8-year catalog. In a survey mission like Fermi, data accumulate on each source over time, so after 16 years (reached in August 2024) and twice the data for the original 4FGL sources we have more precise localization (by 24% on average). It is thus time to generate a new original catalog, which implies, beyond adding the sources newly detectable after two more years, changing the existing source names (derived from their coordinates) and reviewing the associations. We present an early 16-year list (FL16Y) of 7220 sources, which relocalizes all sources and improves a few aspects of the catalog analysis, but still uses the same model of interstellar diffuse emission as 4FGL-DR4.",
      "pdf_url": "https://arxiv.org/pdf/2602.22148.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22165",
      "title": "Whistler-Alfvén turbulence in a non-neutral ultrarelativistic pair plasma",
      "authors": [
        "Stanislav Boldyrev",
        "Mikhail Medvedev"
      ],
      "abstract": "Whistler-Alfvén turbulence in a non-neutral ultrarelativistic pair plasma Stanislav Boldyrev, Mikhail Medvedev High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Plasma Physics (physics.plasm-ph) The large-scale dynamics of most conventional space and astrophysical plasmas are predominantly governed by Alfvén modes, which are low-frequency magnetohydrodynamic modes existing in magnetized media. At scales smaller than the ion gyroscale or frequencies exceeding the ion cyclotron frequency, the Alfvén modes transform into kinetic-Alfvén or whistler modes that significantly contribute to plasma dynamics. However, this scenario reverses in non-neutral pair plasmas, such as those found in the magnetospheres of pulsars and magnetars, around rotating black holes and in their relativistic jets, as well as in certain laboratory plasmas. In these systems, the large-scale dynamics is governed by hybrid whistler-Alfvén modes, which transform into pure Alfvén modes at smaller scales. We derive the nonlinear equations that describe the dynamics of whistler-Alfvén modes in ultrarelativistic non-neutral magnetically dominated pair plasma and discuss the spectrum of turbulence governed by these equations.",
      "pdf_url": "https://arxiv.org/pdf/2602.22165.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22168",
      "title": "Collisionless Accretion of Finite-Angular-Momentum Plasma onto a Spinning Black Hole",
      "authors": [
        "John M. Mehlhaff",
        "Alexander Y. Chen",
        "Martin Luepker",
        "Yajie Yuan"
      ],
      "abstract": "Collisionless Accretion of Finite-Angular-Momentum Plasma onto a Spinning Black Hole John M. Mehlhaff, Alexander Y. Chen, Martin Luepker, Yajie Yuan 11 pages, 4 figures, comments welcome! High Energy Astrophysical Phenomena (astro-ph.HE) In low-luminosity active galactic nuclei like M87* and Sgr A*, the accretion disk around the central supermassive black hole is tenuous and collisionless. As a result, the usual ideal magnetohydrodynamics (MHD) approximation may not be applicable. In this Letter, we report on the first fully kinetic simulations of the accretion process where the plasma initially has finite angular momentum. The simulated accretion flow behaves remarkably similarly to the magnetically arrested disk (MAD) regime of ideal MHD, reproducing episodes of magnetic flux saturation and eruption typical of MADs. The resemblance to fluid models owes largely to kinetic instabilities, which regulate pressure anisotropy in the disk, allowing fluid terms to dominate the angular momentum transfer. In addition, by handling vacuum regions effectively, our kinetic approach probes the matter supply to the jet funnel. We observe no efficient penetration of the accreting material into this region, which suggests that a pair discharge may be required to sustain the Blandford-Znajek process.",
      "pdf_url": "https://arxiv.org/pdf/2602.22168.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21440",
      "title": "On the Importance of the Convective Urca Process in 3D Simulations of a Simmering White Dwarf",
      "authors": [
        "Ferran Poca-Amorós",
        "Brendan Boyd",
        "Dean M. Townsley",
        "Alan Calder"
      ],
      "abstract": "On the Importance of the Convective Urca Process in 3D Simulations of a Simmering White Dwarf Ferran Poca-Amorós, Brendan Boyd, Dean M. Townsley, Alan Calder 19 pages, 12 figures, Accepted to the Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Type Ia supernovae are bright thermonuclear explosions that are important to numerous areas of astronomy. However, the origins of these events are poorly understood. One proposed setting is that of a near Chandrasekhar mass white dwarf that undergoes runaway carbon burning in the core. During the thousand years leading up to the explosion, the white dwarf undergoes a simmering phase where slow carbon burning heats the core and drives convection. A poorly understood aspect of this phase is the convective Urca process, which links convection with weak nuclear reactions. We use the low Mach number code MAESTROeX to perform full 3D simulations as is required to accurately capture the turbulent convection. We present simulations with and without the A=23 convective Urca process, which have relaxed to a steady state. We characterize the effects of the convective Urca process on the neutrino losses, the nuclear energy generation, and the convective boundary. We find that the size of the convection zone is substantially reduced by the convective Urca process, though convection still extends past the Urca shell. Our findings on the structure of the convective zone and the compositional changes can be used to inform 1D stellar models that track the longer-timescale evolution.",
      "pdf_url": "https://arxiv.org/pdf/2602.21440.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21502",
      "title": "A Decade-Long Increasing Mid-Infrared Luminosity in Galaxy NGC6447: a Turning-On Candidate of Active Galactic Nucleus",
      "authors": [
        "Xinyu Dai , Nate Adams , Natalie Kovacevic , Kaitlyn Parrinello , Marko Micic , Heechan Yuk , Zijun Gao , Lorelei Starling , Francesco Shankar University of Oklahoma University of Southampton)"
      ],
      "abstract": "A Decade-Long Increasing Mid-Infrared Luminosity in Galaxy NGC6447: a Turning-On Candidate of Active Galactic Nucleus Xinyu Dai (1), Nate Adams (1), Natalie Kovacevic (1), Kaitlyn Parrinello (1), Marko Micic (1), Heechan Yuk (1), Zijun Gao (1), Lorelei Starling (1), Francesco Shankar (2) ((1) University of Oklahoma (2) University of Southampton) Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) It is widely expected that the obscured accretion stage can be the initial turning-on stage of active galactic nuclei from quiescent galaxies. We present mid-infrared light curves of NGC 6447 in 3.5$\\mu$m and 4.6 $\\mu$m bands observed by WISE/NEOWISE, which show an almost monotonic increasing trend of 1.2 mag over 14 years. The optical light curve from ASAS-SN during the same period is consistent with a constant showing no variability. The mid-infrared color evolution shows that the galaxy transitioned into an active galactic nucleus (AGN) in 2018. The SPHEREx spectrum reveals an increasing continuum resembling warm to hot dust emission from an AGN. NuSTAR detected an X-ray source with a 2-30 keV luminosity of $8.4\\times10^{41}$ ergs/s at the lower boundary of AGN X-ray emission range, and a factor of >7 variability in one year compared to the Swift upper limit. NGC 6447 was classified as a quiescent galaxy in the literature. The multi-wavelength timing and spectral properties of NGC 6447 are consistent with the expected AGN turning on event, where the obscuring material around the AGN central engine is gradually dispersed, revealing the central engine. This example shows that long-term infrared variability can be a powerful tool to find similar sources. Based on the sample selection statistics, we estimate the duration of the episodes of AGN accretion (duty cycle) signified by the turning-on event as $10^4$-$10^6$ yr.",
      "pdf_url": "https://arxiv.org/pdf/2602.21502.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21507",
      "title": "Conditional Image Diffusion with Interferometric Closure Invariants: Independent EHT Imaging of Centaurus~A and 3C~279",
      "authors": [
        "Samuel Lai",
        "Nithyanandan Thyagarajan",
        "O. Ivy Wong",
        "Foivos Diakogiannis"
      ],
      "abstract": "Conditional Image Diffusion with Interferometric Closure Invariants: Independent EHT Imaging of Centaurus~A and 3C~279 Samuel Lai, Nithyanandan Thyagarajan, O. Ivy Wong, Foivos Diakogiannis 17 pages, 10 figures, 1 table, accepted by PASA Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We present independent imaging analyses of Event Horizon Telescope (EHT) observations of the active galactic nuclei in radio galaxy Centaurus~A and quasar 3C~279 using Generative Deep learning Image Reconstruction with Closure Terms (GenDIReCT), a recently developed machine-learning framework built on conditional diffusion models that uses interferometric closure invariants as primary observables. For Centaurus~A, our reconstruction reveals two prominent emission ridges ($\\simeq 80\\,\\mu$as each) along the jet sheath with a brightness ratio of $1.4\\pm 0.1$ and an opening angle of $12.3\\pm 0.3$~deg. For 3C~279, we identify three distinct components in the image, with the southern jet ejecta on sub-parsec scale exhibiting a proper motion of $4.6\\pm 1.0\\,\\mu$as over $\\approx 5.39$ days away from the northern components, corresponding to an apparent superluminal velocity of $\\simeq 10\\pm 2$ times light speed. These measurements are consistent with those reported by the EHT Collaboration. The results are significant because we demonstrate that: (1) imaging from interferometric aperture synthesis data, especially in VLBI and most acutely in extremely sparse arrays like the EHT, remains a severely ill-posed and challenging inverse problem, yet closure invariants preserve robust morphological information that can strongly constrain structural features, and (2) more importantly, closure-invariant imaging largely avoids calibration systematics, thus providing a fundamentally independent view of spatial structure with very high angular resolution. The generative nature of GenDIReCT further allows us to sample and characterise clusters of plausible image solutions for each dataset. As a calibration-independent, generative imaging approach, GenDIReCT offers a robust and truly independent blind-imaging tool for current and future VLBI experiments.",
      "pdf_url": "https://arxiv.org/pdf/2602.21507.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21837",
      "title": "pythonradex: a fast Python re-implementation of RADEX with extended functionality",
      "authors": [
        "Gianni Cataldi"
      ],
      "abstract": "pythonradex: a fast Python re-implementation of RADEX with extended functionality Gianni Cataldi Journal of Open Source Software, 2026, 11(118), 9233 Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) A common task in astronomical research is to estimate the physical parameters (temperature, mass, density etc.) of a gas by using observed line emission. This often requires a calculation of how the radiation propagates via emission and absorption (so-called radiative transfer). In radio and infrared astronomy, the Fortran code RADEX (van der Tak et al., 2007) is a popular tool to solve the non-LTE radiative transfer of a uniform medium in a simplified geometry. I present pythonradex, a Python re-implementation of RADEX. Written in Python, it provides an easy and intuitive user interface, improved performance as well as additional functionality not included in RADEX, such as continuum effects and overlapping lines. In addition, pythonradex provides a self-consistent computation of the total flux for all geometries, including spherical geometries.",
      "pdf_url": "https://arxiv.org/pdf/2602.21837.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.19556",
      "title": "A deep X-ray and UV look into the reflaring stage of the accreting millisecond pulsar SAX J1808.4-3658",
      "authors": [
        "Caterina Ballocco",
        "Alessandro Papitto",
        "Arianna Miraval Zanon",
        "Giulia Illiano",
        "Tiziana Di Salvo",
        "Filippo Ambrosino",
        "Luciano Burderi",
        "Sergio Campana",
        "Francesco Coti Zelati",
        "Alessandro Di Marco",
        "Christian Malacaria",
        "Maura Pilia",
        "Juri Poutanen",
        "Tuomo Salmi",
        "Andrea Sanna"
      ],
      "abstract": "A deep X-ray and UV look into the reflaring stage of the accreting millisecond pulsar SAX J1808.4-3658 Caterina Ballocco, Alessandro Papitto, Arianna Miraval Zanon, Giulia Illiano, Tiziana Di Salvo, Filippo Ambrosino, Luciano Burderi, Sergio Campana, Francesco Coti Zelati, Alessandro Di Marco, Christian Malacaria, Maura Pilia, Juri Poutanen, Tuomo Salmi, Andrea Sanna 12 pages, 12 figures, 3 tables. Revised version published in A&A High Energy Astrophysical Phenomena (astro-ph.HE) We present an X-ray and UV high-time-resolution monitoring of the final flaring phase of the 2022 outburst of the AMSP SAX J1808.4-3658, based on simultaneous XMM-Newton and HST observations. The uninterrupted coverage provided by XMM-Newton enabled a detailed characterization of the spectral and temporal evolution of the source X-ray emission, as the flux varied by approximately 1 order of magnitude. We detected coherent X-ray pulsations during the whole X-ray observation, down to a 0.5-10 keV luminosity of $L_{X(low)0.5-10} \\simeq 6.21^{+0.20}_{-0.15}\\times 10^{34} d^2_{3.5}erg/s$, among the lowest ever observed in this source. At the lowest flux levels, we observed significant variations in pulse amplitude and phase. These variations were anticorrelated with the X-ray source flux. We found a sharp phase jump of $\\sim 0.4$ cycles, accompanied by a doubling of the pulse amplitude and a softening of the X-ray emission. We interpreted changes in the X-ray pulse profiles as drifts of emission regions on the neutron-star surface, driven by an increase in the inner-disk radius when the mass-accretion rate decreased. The dependence of the pulse phase on the X-ray flux was consistent with a magnetospheric radius scaling as $R_{m} \\propto \\dot{M}^{\\Lambda}$, with $\\Lambda = -0.17(9)$, in broad agreement with theoretical predictions. Simultaneous HST observations confirmed the presence of significant UV pulsations at an X-ray luminosity approximately a factor of two lower than during the 2019 outburst, extending the range of mass accretion rates at which UV pulsations have been detected. The measured pulsed UV luminosity, $L_{pulsed}^{UV}=1.1(3) \\times 10^{32}erg/s$, was consistent with that observed during the 2019 outburst. Such a UV luminosity exceeds the predictions of standard emission models, as further confirmed by the shape of the pulsed spectral energy distribution.",
      "pdf_url": "https://arxiv.org/pdf/2506.19556.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07026",
      "title": "Prolonged fallback and late-time rebrightening episodes in stellar tidal disruptions as imprints of a galactic environment",
      "authors": [
        "Cedric Oña",
        "Sean Fortuna",
        "Ian Vega"
      ],
      "abstract": "Prolonged fallback and late-time rebrightening episodes in stellar tidal disruptions as imprints of a galactic environment Cedric Oña, Sean Fortuna, Ian Vega 21 pages, 8 figures, 4 tables. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) Classic models of tidal disruption events (TDEs), employing a purely Keplerian description of stellar debris dynamics, have proven remarkably successful in describing the observed emission of these transients. We extend these simple models by including the gravitational influence of a spherically symmetric mass distribution representing either a dark matter halo or the broader galactic environment, rather than treating the disruption as an isolated star-black hole encounter. We retain a minimal, fully Newtonian setup so that the role of the host galaxy remains transparent and straightforward to interpret. Within this extended model, we find that the host potential can imprint clear signatures on the light curve that lie outside the predictive scope of traditional models, such as phases of shallow decay and episodes of late-time rebrightening. These environment-driven signatures, however, emerge only on very long timescales unless the host is unrealistically ultra-compact. For most real systems, the environmental influence turns on far too late to be captured by current observations, which explains why the early evolution of TDEs occurring in typical galaxies is essentially unaffected by the host potential and why the classic models have been so successful. Only at much longer times does the broader galactic structure begin to reshape the fallback dynamics, gradually steering the system away from the canonical $t^{-5/3}$ decay. This provides an exciting opportunity for next-generation time domain surveys to extend monitoring and track late-time TDE evolution in search of delayed signals that quietly encode information about the surrounding galactic mass.",
      "pdf_url": "https://arxiv.org/pdf/2510.07026.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.20786",
      "title": "Simultaneous JWST, NuSTAR, and VLA Monitoring of Sgr A*: A Unified Picture of the Variable IR, X-ray and Radio Emission",
      "authors": [
        "F. Yusef-Zadeh",
        "M. Wardle",
        "R. G. Arendt",
        "C. O. Heinke",
        "C. J. Chandler",
        "H. Bushouse",
        "G. A. Moellenbrock abd J. M. Michail"
      ],
      "abstract": "Simultaneous JWST, NuSTAR, and VLA Monitoring of Sgr A*: A Unified Picture of the Variable IR, X-ray and Radio Emission F. Yusef-Zadeh, M. Wardle, R. G. Arendt, C. O. Heinke, C. J. Chandler, H. Bushouse, G. A. Moellenbrock abd J. M. Michail 27 pages, 14 figures, accepted ApJL High Energy Astrophysical Phenomena (astro-ph.HE) Flux variability is a fundamental channel of information from Sgr A* because of its direct probe of processes occurring within an accretion disk under strong gravity. We present simultaneous IR, X-ray and radio observations of Sgr A* on 2024 Apr 05 using JWST, NuSTAR, and VLA. We report the detection of a strong X-ray flare with a luminosity of $\\sim5.2x10^{35}$ erg/s coincident with a bright near-IR flare, and a brightening in radio about an hour later. We investigate the candidate physical mechanisms for the X-ray flare emission and conclude that this can best be explained by inverse Compton scattering of near-IR flare radiation. We propose a dynamic scenario analogous to a coronal mass ejection in which a magnetic flux rope is ejected from Sgr A*'s inner accretion flow with a current sheet extending down from the rope to the bulk of the accretion flow. Reconnection within the sheet produces oppositely directed flows of accelerated particles moving upwards towards the rope and downwards towards the accretion flow. Infrared radiation from the approaching energetic electrons is enhanced by beaming and up-scattered by thermal electrons in the accretion flow to produce the strong X-ray flare. Meanwhile, the relativistic electrons moving in the opposite direction away from the disk experience weaker magnetic fields so radiate at longer wavelengths by feeding into the magnetic flux tube and adiabatically cooled during its subsequent expansion. This physical picture attempts to unify the origin of the variable emission from Sgr A* at IR, X-ray and radio/submm wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2512.20786.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.13113",
      "title": "Tidal capture and repeating partial tidal disruption events of giant stars",
      "authors": [
        "Di Wang",
        "Fa-Yin Wang"
      ],
      "abstract": "Tidal capture and repeating partial tidal disruption events of giant stars Di Wang, Fa-Yin Wang 9 pages,9 figures. The published version in Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) When an object is scattered near a supermassive black hole (SMBH), tidal oscillations excited within it reduce its orbital energy, leading to capture by the SMBH. This process, called tidal capture, can also occur when the object approaches even closer to the SMBH, resulting in a partial tidal disruption event (pTDE). Previous studies on pTDEs of main-sequence stars have shown that as the disruption intensifies, dynamical effects dominate over tidal oscillations, causing the remnant material to acquire a kick velocity instead of being captured by the SMBH. In this work, we performed hydrodynamic numerical simulations of pTDEs involving giant stars. We found that for weaker disruptions, the dynamical behavior of the remnant material resembles that of main-sequence stars. However, as the disruptions deepen, the remnant material transitions from gaining energy to losing energy, leading to capture by the SMBH. This behavior markedly differs from that of main-sequence stars, demonstrating that the presence of a compact core significantly influences the dynamical processes in pTDEs. Our simulations reveal that the energy change of the remnant material strongly correlates with asymmetric mass -- lossspecifically, the difference in mass outflow between the Lagrange points L1 and L2. This suggests that the energy change stems from asymmetric mass loss, consistent with conclusions from previous studies on main-sequence stars. However, quantitative analysis contradicts earlier models, indicating that the dynamical model of pTDEs requires further refinement. Finally, we discuss the characteristics of repeating pTDEs produced by this process and their potential observability, as well as the implications for the long-term orbital evolution of high eccentricity extreme mass ratio inspiral systems.",
      "pdf_url": "https://arxiv.org/pdf/2601.13113.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.20523",
      "title": "AT 2024wpp: the most luminous fast-evolving optical transient linked to the merger explosion of a black-hole binary",
      "authors": [
        "Jialian Liu",
        "Bao Wang",
        "Xiaofeng Wang",
        "David Aguado",
        "Weili Lin",
        "Nancy-Elias Rosa",
        "Qichun Liu",
        "Frederick Poidevin",
        "Ismael Perez-Fournon",
        "Long Li",
        "Ailing Wang",
        "Yi Yang",
        "Zigao Dai",
        "Alexei V. Filippenko",
        "Thomas G. Brink",
        "Di Xiao",
        "Wenxiong Li",
        "Yifang Liang",
        "Xuefeng Wu",
        "Samaporn Tinyanont",
        "Jinjun Geng",
        "Shengyu Yan",
        "Weimin Yuan",
        "Jujia Zhang",
        "Xiangyun Zeng",
        "WeiKang Zheng",
        "Yuanming Wang",
        "Tao An",
        "YongZhi Cai",
        "Jeff Cooke",
        "Lixin Dai",
        "Andrea Farina",
        "Maokai Hu",
        "Ye Li",
        "Chichuan Jin",
        "Yuan Liu",
        "David Lopez Fernandez-Nespral",
        "Alicia Lopez Oramas",
        "Andrea Reguitti",
        "Xinwen Shu",
        "Cuiying Song",
        "Hui Sun",
        "Ning-chen Sun",
        "Lifan Wang",
        "Tinggui Wang",
        "Junjie Wei",
        "Qingyu Wu",
        "Danfeng Xiang",
        "Lei Yang",
        "Liping Li",
        "Zhenyu Wang"
      ],
      "abstract": "AT 2024wpp: the most luminous fast-evolving optical transient linked to the merger explosion of a black-hole binary Jialian Liu, Bao Wang, Xiaofeng Wang, David Aguado, Weili Lin, Nancy-Elias Rosa, Qichun Liu, Frederick Poidevin, Ismael Perez-Fournon, Long Li, Ailing Wang, Yi Yang, Zigao Dai, Alexei V. Filippenko, Thomas G. Brink, Di Xiao, Wenxiong Li, Yifang Liang, Xuefeng Wu, Samaporn Tinyanont, Jinjun Geng, Shengyu Yan, Weimin Yuan, Jujia Zhang, Xiangyun Zeng, WeiKang Zheng, Yuanming Wang, Tao An, YongZhi Cai, Jeff Cooke, Lixin Dai, Andrea Farina, Maokai Hu, Ye Li, Chichuan Jin, Yuan Liu, David Lopez Fernandez-Nespral, Alicia Lopez Oramas, Andrea Reguitti, Xinwen Shu, Cuiying Song, Hui Sun, Ning-chen Sun, Lifan Wang, Tinggui Wang, Junjie Wei, Qingyu Wu, Danfeng Xiang, Lei Yang, Liping Li, Zhenyu Wang High Energy Astrophysical Phenomena (astro-ph.HE) Fast blue optical transients (FBOTs) represent one of the most exotic astrophysical transients, exhibiting unusually strong emission across X-ray, optical, and radio wavelengths. Their physical origins remain highly debated, with proposed explanations ranging from stellar explosion to tidal disruption event (TDE). Here we report observations of the most luminous FBOT, AT 2024wpp whose post-peak luminosity rebrightens in X ray and becomes flattening in optical in a manner follows the decay rate characteristic of TDEs ($L_{\\rm bol} \\propto t^{-5/3}$). This invokes energy contribution of accretion by a central compact object, getting further corroborations from hardening of X-ray spectral index and detection of outflow inferred from the emission lines at similar phase. Detailed modeling of luminsoity evolution favors a coalesce explosion of a 34 M$_{\\odot}$ Wolf-Rayet star with a 15 M$_{\\odot}$ black hole (BH), demonstrating that some FBOTs may be associated with TDE of a stellar blackhole.",
      "pdf_url": "https://arxiv.org/pdf/2602.20523.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.05459",
      "title": "The possible accretion discs of GN-z11 at redshift z = 10.6, MoM-z14 at z = 14.44 and other high redshift objects",
      "authors": [
        "A. C. Fabian",
        "J. Jiang",
        "W.M. Baker",
        "R. Maiolino",
        "X. Ji",
        "I. Juodzbalis",
        "J. Scholtz"
      ],
      "abstract": "The possible accretion discs of GN-z11 at redshift z = 10.6, MoM-z14 at z = 14.44 and other high redshift objects A. C. Fabian, J. Jiang, W.M. Baker, R. Maiolino, X. Ji, I. Juodzbalis, J. Scholtz 6 pages, 5 figures, Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The JWST has enabled the discovery of Active Galactic Nuclei at high redshifts. The intrinsic UV spectrum of GN-z11 at redshift z=10.6 has a spectral slope compatible with a standard accretion disc. By fitting a disc model to its spectrum, we find that the mass of the black hole must be above 1.12 x 10^7 Msun in order that it lies below the Eddington limit. We define this mass as the Eddington mass of the black hole. We note that the spectral shape is consistent with that of accreting stellar mass black holes sources in their soft state, for which no variability is expected. Mom-z14 is a more distant object at $z=14.44$ and has a similar UV slope. Disc model-fitting gives a similar result but lower mass accretion rate. We also examine3 further high redshift objects: GS z14-1, GHZ2 and PAN-z14-1 at z=13.86, 12.34 and 13.53, again obtaining similar results. If sub-Eddington accretion discs are indeed the origin of much of the UV emission from these objects, then the existence of massive black holes less than 304 and 290 Myr after the Big Bang point either to exceptional black hole seeds or to primordial black holes. The observed spread of UV spectral slopes in high redshift objects suggests that our approach may be relevant to about half of that population.",
      "pdf_url": "https://arxiv.org/pdf/2509.05459.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04337",
      "title": "Massive stars exploding in a He-rich circumstellar medium XII. SN 2024acyl: A fast, linearly declining Type Ibn supernova with early flash-ionisation features",
      "authors": [
        "Y.-Z. Cai",
        "A. Pastorello",
        "K. Maeda",
        "J.-W. Zhao",
        "Z.-Y. Wang",
        "Z.-H. Peng",
        "A. Reguitti",
        "L. Tartaglia",
        "A. V. Filippenko",
        "Y. Pan",
        "G. Valerin",
        "B. Kumar",
        "Z. Wang",
        "M. Fraser",
        "J. P. Anderson",
        "S. Benetti",
        "S. Bose",
        "T. G. Brink",
        "E. Cappellaro",
        "T.-W. Chen",
        "X.-L. Chen",
        "N. Elias-Rosa",
        "A. Esamdin",
        "A. Gal-Yam",
        "M. González-Bañuelos",
        "M. Gromadzki",
        "C. P. Gutiérrez",
        "A. Iskandar",
        "C. Inserra",
        "T. Kangas",
        "E. Kankare",
        "T. Kravtsov",
        "H. Kuncarayakti",
        "L.-P. Li",
        "C.-X. Liu",
        "X.-K. Liu",
        "P. Lundqvist",
        "K. Matilainen",
        "S. Mattila",
        "S. Moran",
        "T. E. Müller-Bravo",
        "T. Nagao",
        "T. Petrushevska",
        "G. Pignata",
        "I. Salmaso",
        "S. J. Smartt",
        "J. Sollerman",
        "M. D. Stritzinger",
        "S. Srivastav",
        "L.-T. Wang",
        "S.-Y. Yan",
        "Y. Yang",
        "Y.-P. Yang",
        "W. Zheng",
        "X.-Z. Zou",
        "L.-Y. Chen",
        "X.-L. Du",
        "Q.-L. Fang",
        "A. Fiore",
        "F. Ragosta",
        "S. Zha",
        "J.-J. Zhang",
        "X.-W. Liu",
        "J.-M. Bai",
        "B. Wang",
        "X.-F. Wang"
      ],
      "abstract": "Massive stars exploding in a He-rich circumstellar medium XII. SN 2024acyl: A fast, linearly declining Type Ibn supernova with early flash-ionisation features Y.-Z. Cai, A. Pastorello, K. Maeda, J.-W. Zhao, Z.-Y. Wang, Z.-H. Peng, A. Reguitti, L. Tartaglia, A. V. Filippenko, Y. Pan, G. Valerin, B. Kumar, Z. Wang, M. Fraser, J. P. Anderson, S. Benetti, S. Bose, T. G. Brink, E. Cappellaro, T.-W. Chen, X.-L. Chen, N. Elias-Rosa, A. Esamdin, A. Gal-Yam, M. González-Bañuelos, M. Gromadzki, C. P. Gutiérrez, A. Iskandar, C. Inserra, T. Kangas, E. Kankare, T. Kravtsov, H. Kuncarayakti, L.-P. Li, C.-X. Liu, X.-K. Liu, P. Lundqvist, K. Matilainen, S. Mattila, S. Moran, T. E. Müller-Bravo, T. Nagao, T. Petrushevska, G. Pignata, I. Salmaso, S. J. Smartt, J. Sollerman, M. D. Stritzinger, S. Srivastav, L.-T. Wang, S.-Y. Yan, Y. Yang, Y.-P. Yang, W. Zheng, X.-Z. Zou, L.-Y. Chen, X.-L. Du, Q.-L. Fang, A. Fiore, F. Ragosta, S. Zha, J.-J. Zhang, X.-W. Liu, J.-M. Bai, B. Wang, X.-F. Wang 19 pages, 12 figures. Accepted for publication in Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) We present a photometric and spectroscopic analysis of the Type Ibn supernova (SN) 2024acyl. It rises to an absolute magnitude peak of about -17.58 mag in 10.6 days, and displays a rapid linear post-peak light-curve decline in all bands, similar to most SNe Ibn. The optical pseudobolometric light curve peaks at $(3.5\\pm0.8) \\times 10^{42}$ erg s$^{-1}$, with a total radiated energy of $(5.0\\pm0.4) \\times 10^{48}$ erg. The spectra are dominated by a blue continuum at early stages, with narrow P Cygni He I lines and flash-ionisation emission lines of C III, N III, and He II. The P Cygni He I features gradually evolve and become emission-dominated in late-time spectra. Our multi-band light-curve modelling yields estimates of the ejecta mass of $M_{\\rm ej} = 0.49^{+0.11}_{-0.09}$ M$_\\odot$ with a kinetic energy of $E_{\\rm k} = 0.06^{+0.01}_{-0.01} \\times 10^{51}$ erg, and a $^{56}$Ni mass of $M_{\\rm Ni} = 0.018$ M$_\\odot$. The inferred CSM properties are characterised by a mass of $M_{\\rm CSM} = 0.51^{+0.05}_{-0.04}$ M$_\\odot$, an inner radius of $R_0 = 17.8^{+3.6}_{-3.0}$ AU, and a density of $\\rho_{\\rm CSM} =(8.3_{-1.2}^{+2.7})\\times10^{-12}$ g cm$^{-3}$. The multi-epoch spectra are well reproduced by the CMFGEN/he4p0 model, corresponding to a He-ZAMS mass of 4 M$_\\odot$ (H-ZAMS mass 18.11 M$_\\odot$, pre-SN mass 3.16 M$_\\odot$). These findings are consistent with a scenario of an SN powered by ejecta-CSM interaction, originating from a low-mass helium star that evolved within an interacting binary system where the CSM with some residual hydrogen may originate from the mass-transfer process. In addition, a channel of core-collapse explosion of a late-type Wolf-Rayet star with H, or an Ofpe/WN9 star with fallback accretion, cannot be entirely ruled out.",
      "pdf_url": "https://arxiv.org/pdf/2511.04337.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21002",
      "title": "Constraints on dynamically-formed massive black holes in Little Red Dots from X-ray non-detections",
      "authors": [
        "M. Liempi",
        "D.R.G. Schleicher",
        "M. A. Latif",
        "R. Schneider",
        "F. Flammini Dotti",
        "A. Escala",
        "M.C. Vergara"
      ],
      "abstract": "Constraints on dynamically-formed massive black holes in Little Red Dots from X-ray non-detections M. Liempi, D.R.G. Schleicher, M. A. Latif, R. Schneider, F. Flammini Dotti, A. Escala, M.C. Vergara Accepted for publication 23/02/2026 (A&A) Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The existence of massive, compact galaxies (Little Red Dots, LRDs) at $z \\sim 2$ challenges early structure formation models, suggesting rapid stellar and black hole (BH) assembly. While LRDs are efficient environments for BH growth, many show no X-ray evidence of strong AGN emission. We utilize a subsample of X-ray non-detected LRDs to test the compatibility of collision-based BH formation scenarios and constrain physical parameters like metallicity and column density. Our results indicate LRDs are ideal birthplaces for massive BHs, particularly given a mass-radius relation $R_{gal} \\propto M_{gal}^{0.6}$. Collision-based models suggest seed masses larger than those in the local Universe, consistent with high-redshift BH mass-radius relations. We modeled BH seed formation and X-ray emission (0.3-7 keV) against observed upper limits. We find that mass-radius exponents $> 0.55$ favor the collision-based scenario; however, consistency with stacked X-ray analysis requires specific accretion and obscuration parameters. Constant or increasing SFR scenarios with high Eddington ratios are feasible but necessitate larger column densities or higher metal enrichment. Alternatively, moderate sub-Eddington accretion reconciles massive seeds with observed masses and X-ray weakness. We conclude that even if LRDs began as starbursts, they should eventually evolve into AGNs.",
      "pdf_url": "https://arxiv.org/pdf/2602.21002.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21283",
      "title": "The DECam MAGIC Survey: Uncovering the Tidal Tails of the Crater II Dwarf Galaxy",
      "authors": [
        "Kaia R. Atzberger",
        "Andrew B. Pace",
        "Nitya Kallivayalil",
        "Anirudh Chiti",
        "Denis Erkal",
        "William Cerny",
        "Guilherme Limberg",
        "Vinicius M. Placco",
        "Deepthi S. Prabhu",
        "Guy S. Stringfellow",
        "A. Katherina Vivas",
        "Astha Chaturvedi",
        "Peter S. Ferguson",
        "Alexander H. Riley",
        "David J. Sand",
        "Jeffrey L. Carlin",
        "Yumi Choi",
        "Denija Crnojević",
        "Alex Drlica-Wagner",
        "Alexander P. Ji",
        "Ting S. Li",
        "Clara E. Martínez-Vázquez",
        "Gustavo E. Medina",
        "Noelia E. D. Noël",
        "Alistair R. Walker",
        "Julio A. Carballo-Bello",
        "David J. James",
        "Burçin Mutlu-Pakdil",
        "Mahdieh Navabi",
        "Joanna D. Sakowska"
      ],
      "abstract": "The DECam MAGIC Survey: Uncovering the Tidal Tails of the Crater II Dwarf Galaxy Kaia R. Atzberger, Andrew B. Pace, Nitya Kallivayalil, Anirudh Chiti, Denis Erkal, William Cerny, Guilherme Limberg, Vinicius M. Placco, Deepthi S. Prabhu, Guy S. Stringfellow, A. Katherina Vivas, Astha Chaturvedi, Peter S. Ferguson, Alexander H. Riley, David J. Sand, Jeffrey L. Carlin, Yumi Choi, Denija Crnojević, Alex Drlica-Wagner, Alexander P. Ji, Ting S. Li, Clara E. Martínez-Vázquez, Gustavo E. Medina, Noelia E. D. Noël, Alistair R. Walker, Julio A. Carballo-Bello, David J. James, Burçin Mutlu-Pakdil, Mahdieh Navabi, Joanna D. Sakowska 27 pages, 14 figures, 2 tables, Submitted to ApJ, Data available via Zenodo at this https URL Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Crater II (CraII), a large and low-density dwarf spheroidal galaxy, has unusual observed properties that are difficult to reproduce in cold dark matter simulations. Ongoing tidal disruption may help explain the discrepancies, as evidenced by the recent discovery of tidal tails. Here we present metallicity-sensitive narrowband photometry of the Ca II H and K lines from the Dark Energy Camera, covering $128$ deg$^2$ across the center and identified tidal tails of CraII as part of the Mapping the Ancient Galaxy in CaHK (MAGIC) survey. Our combined photometric metallicity, color-magnitude, proper motion, and parallax selections identify 162 CraII candidates. Of these, 37 candidates are located in the tidal tails which extend at least $7^\\circ$ ($\\sim 95$ kpc) from the center of CraII, suggesting it has lost $\\gtrsim 25$% of its initial stellar mass. We confirm low contamination rates with dedicated control fields and highlight the extremely low surface brightness stellar features that can be uncovered with CaHK data, as faint as $\\sim 36$ mag arcsec$^{-2}$. We also make the first detection of a metallicity gradient ($-0.34\\pm0.17~{\\rm dex}~{\\rm deg}^{-1}$) in the center of the galaxy and infer a stream width of $w\\sim 0.8^\\circ$, roughly 50% larger than the CraII half-light radius. The detection of candidates in the most distant CraII pointings from its center implies that the tidal tails extend beyond our footprint. We compare the CraII stream to $N$-body models with \"cored\" and \"cuspy\" dark matter halo progenitors, determining that CraII's density profile is still ambiguous and warrants further modeling.",
      "pdf_url": "https://arxiv.org/pdf/2602.21283.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21286",
      "title": "NOCTURNE. III. Unidentified variable emission in the nuclear regions of PKS 2153-69",
      "authors": [
        "Miguel Coloma Puga",
        "Marco Berton",
        "Pierpaolo Condò",
        "Abigail García-Pérez",
        "Emilia Järvelä",
        "Anne Lähteenmäki",
        "Swayamtrupta Panda"
      ],
      "abstract": "NOCTURNE. III. Unidentified variable emission in the nuclear regions of PKS 2153-69 Miguel Coloma Puga, Marco Berton, Pierpaolo Condò, Abigail García-Pérez, Emilia Järvelä, Anne Lähteenmäki, Swayamtrupta Panda Submitted to Revista Mexicana de Astrofísica y Astronomía Serie de Conferencias, 4 pages Astrophysics of Galaxies (astro-ph.GA) Historically, the study of the central regions of Type 1 AGN has been limited by the combination of the host galaxy spectrum with strong emission from the accretion disk and NLR/BLR, which prevented us from accurately probing the galactic and AGN properties in the central regions. Integral field spectroscopy allows us to correct for this effect and study both the unobscured cores of AGN host galaxies as well as the uncontaminated spectra of their central engines with unprecedented precision. Using MUSE WFM observations, in this work, we present a combined method for modelling and subtracting QSO light in type-1 AGN alongside results for one such source, PKS 2153-68 (z=0.028), both jetted and gamma-ray emitting. After separating the host galaxy and AGN spectra, we discuss the discovery of an unresolved and yet-to-be-identified high-velocity ($\\sim$25000 km/s) short timescale ($\\leq$1 yr) variable emission, unlike anything observed in other variable AGN.",
      "pdf_url": "https://arxiv.org/pdf/2602.21286.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21329",
      "title": "FRESCO: Constraining Dust Attenuation and Star-Formation Rates of $z\\sim 2$ Star-Forming Galaxies with JWST Paschen and Ground-Based Balmer Emission Line Observations",
      "authors": [
        "Michael A. Wozniak",
        "Naveen A. Reddy",
        "Pascal A. Oesch",
        "Ivan Kramarenko",
        "Jorryt Matthee",
        "Chloe Neufeld",
        "Irene Shivaei",
        "Bahram Mobasher",
        "Alice E. Shapley",
        "Brian Siana"
      ],
      "abstract": "FRESCO: Constraining Dust Attenuation and Star-Formation Rates of $z\\sim 2$ Star-Forming Galaxies with JWST Paschen and Ground-Based Balmer Emission Line Observations Michael A. Wozniak, Naveen A. Reddy, Pascal A. Oesch, Ivan Kramarenko, Jorryt Matthee, Chloe Neufeld, Irene Shivaei, Bahram Mobasher, Alice E. Shapley, Brian Siana Astrophysics of Galaxies (astro-ph.GA) We present new constraints on dust attenuation and star-formation rates (SFRs) for 77 galaxies at redshifts $z=1.43-2.65$, using Paschen emission line detections from the JWST FRESCO survey and ground-based Balmer line measurements from the MOSDEF survey. Using nebular and continuum emission maps, we find that Paschen emission covers a smaller area than continuum emission observed in the F210M (2.1 $\\mu$m; rest-frame optical) and F444W (4.4 $\\mu$m; rest-frame near-IR) bands, and is preferentially located toward galaxy outskirts. These results suggest that current star formation is concentrated in regions farther from galaxy centers than older stellar populations traced by the continuum, indicative of inside-out star formation. With a careful accounting of slit-loss corrections for ground-based measurements, we calculate nebular reddening and dust-corrected SFRs using the Balmer decrement (H$\\alpha$/H$\\beta$) and Paschen-to-Balmer line ratios (Pa$\\alpha$/H$\\alpha$ and Pa$\\beta$/H$\\alpha$), assuming the Milky Way extinction curve. On average, Paschen-derived reddening and SFRs agree with Balmer-derived values; however, two galaxies exhibit significantly higher Paschen reddening and four show significantly higher Paschen SFRs. We find that non-unity dust covering fractions bias the Balmer decrement toward less reddened OB associations, while decrements involving the Paschen lines are less affected by this bias. These results highlight the enhanced sensitivity of the Paschen lines to the most heavily obscured OB associations in $z\\sim2$ galaxies, particularly in galaxies with patchy dust geometries. Future studies using Paschen lines exclusively to measure nebular reddening will yield more robust constraints on the dustiest star-forming regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.21329.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21339",
      "title": "Probing the magnetic fields and dust properties in the young embedded star-forming region AFGL 6366S using Near Infrared and Optical linear polarimetry",
      "authors": [
        "Samrat Biswas",
        "Biman J Medhi",
        "Motohide Tamura",
        "H.S Das",
        "Jungmi Kwon"
      ],
      "abstract": "Probing the magnetic fields and dust properties in the young embedded star-forming region AFGL 6366S using Near Infrared and Optical linear polarimetry Samrat Biswas, Biman J Medhi, Motohide Tamura, H.S Das, Jungmi Kwon 23 pages, 11 figures, 9 tables, accepted for publication at ApJ Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present Near-Infrared (NIR) and Optical linear polarimetry towards the partially embedded cluster AFGL 6366S. The polarization ranges from 0.44-10.3 per cent in NIR and 0.16-11.22 per cent in Optical bands. The position angle spans $1^\\circ - 179^\\circ$ in both NIR and Optical bands. About 22 stars exhibit intrinsic polarization signatures. A polarization hole is evident towards the densest ($\\sim 3.4 \\times 10^{23} \\mathrm{cm}^{-2}$) and warmest ($\\sim 28.8 \\mathrm{K}$) central cluster region. It is attributable to depolarization induced by Radiative Torque Disruption (RAT-D) of large grains and a modest contribution from magnetic-field tangling. The local magnetic field towards the cluster's central region is significantly misaligned with both the large-scale Galactic field and the long axis of the filament present in the region. The field morphology wraps around two dense molecular clumps of radii 0.34 pc and 0.22 pc and $\\mathrm N(\\mathrm H_2)$ = $(7.9 \\pm 1.1) \\times 10^{22}$ cm$^{-2}$ and $(4.3 \\pm 0.5) \\times 10^{22}$ cm$^{-2}$, respectively. The clumps are embedded in the filamentary structure and represent locally accelerated stages of mass accumulation. Gravitationally driven mass flows, largely perpendicular to the local magnetic field, produce a U-shaped field curvature across the filament axis. The plane-of-sky magnetic field strengths towards the two clumps are $ 447.91 \\pm 83.81 \\mu\\mathrm{G}$ and $396.66 \\pm 73.64 \\mu\\mathrm{G}$. The corresponding mass-to-flux ratios ($\\lambda \\sim 1.34$ and $0.82$) indicate that one clump is magnetically supercritical and the other is subcritical. The Alfven Mach numbers ($\\mathcal{M}_A$) $\\sim$ 0.395 and 0.393 indicate that both the clumps are in sub-Alfvénic state.",
      "pdf_url": "https://arxiv.org/pdf/2602.21339.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21353",
      "title": "The MeerKAT 1.3 GHz Survey of the Large Magellanic Cloud",
      "authors": [
        "W. D. Cotton",
        "N. Rajabpour",
        "M. D. Filipović",
        "F. Camilo",
        "R. Z. E. Alsaberi",
        "L. H. Bester",
        "A. C. Bradley",
        "E. J. Crawford",
        "M. Ghavam",
        "O. K. Khattab",
        "Z. J. Smeaton",
        "O. M. Smirnov",
        "J. Th. van Loon",
        "V. Velović"
      ],
      "abstract": "The MeerKAT 1.3 GHz Survey of the Large Magellanic Cloud W. D. Cotton, N. Rajabpour, M. D. Filipović, F. Camilo, R. Z. E. Alsaberi, L. H. Bester, A. C. Bradley, E. J. Crawford, M. Ghavam, O. K. Khattab, Z. J. Smeaton, O. M. Smirnov, J. Th. van Loon, V. Velović 14 pages, 13 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) We present a radio-continuum survey of the LMC using the MeerKAT telescope, describe the full-Stokes products included in the first data release, and highlight some initial results. The observations are centred at 1.3 GHz with a bandwidth of 0.8 GHz. The imaging products comprise six fields of view, each encompassing $\\sim$5$^\\circ$ $\\times$ 5$^\\circ$ with the resulting images achieving a resolution of 8\". The median broad-band Stokes~I image root-mean-square noise value is $\\sim$11 $\\mu$Jy beam$^{-1}$. The survey enables a variety of astrophysical studies, which we showcase with the presentation of a few findings. Within the LMC we identify a new supernova remnant candidate; present planetary nebulae and Wolf-Rayet stars without previous radio detections; and show the MeerKAT view of the well-known star-forming region 30 Doradus. We also present some examples of interesting foreground and background sources in the field, including the AB~Dor multiple-star system, a radio ring galaxy, a possible Odd Radio Circle, and a remarkable bent-tail radio galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2602.21353.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21405",
      "title": "The turbulence driving mode in NGC7793 and NGC1313",
      "authors": [
        "Lewis J Miller",
        "Kathryn Grasha",
        "Christoph Federrath"
      ],
      "abstract": "The turbulence driving mode in NGC7793 and NGC1313 Lewis J Miller, Kathryn Grasha, Christoph Federrath 18 pages, 9 figures, 3 tables, accepted for publication by MNRAS (19/02/26), results presented at Stellar Origins 2025 Astrophysics of Galaxies (astro-ph.GA) We present spatially resolved measurements of turbulence driving modes across entire extragalactic discs of NGC7793 and NGC1313, using Atacama Large Millimetre/submillimetre Array (ALMA) CO(J=2-1) observations at 13pc resolution. By applying a kernel-based analysis of density and velocity fluctuations, we map the turbulence driving parameter, b, which characterises the balance between solenoidal ($b\\sim0.3$) and compressive ($b\\sim1$) turbulent driving regimes. b is quantified as the ratio of the turbulent density fluctuations relative to the turbulent sonic Mach number, M. Both galaxies show predominantly solenoidal driving on average for the regions where we find valid results ($b\\geq 0.33(\\pm 0.05)^{+0.14}_{-0.10}$ in NGC7793; $b\\geq 0.24(\\pm 0.03)^{+0.10}_{-0.07}$ in NGC1313), noting that this is without including the influences of magnetic fields, making these measurements lower limits. We find substantial spatial variation of b, including localised regions of strongly compressive driving. NGC1313 exhibits higher turbulent Mach numbers and density dispersions than NGC7793, consistent with the disturbed morphology and recent satellite interaction in NGC1313. The turbulence in both NGC7793 and NGC1313 is supersonic ($3\\lesssim M\\lesssim 20$), and NGC1313 shows a radially decreasing trend of M with galactocentric radius. Radial trends indicate more solenoidal driving in the galaxy centres, potentially reflecting enhanced shear, and increasingly compressive modes in the outskirts. These results demonstrate that turbulence driving varies systematically with galactic environment and cannot be assumed uniform across discs. Our study applies a previously established method to larger scales and new data, linking local turbulence physics to global star formation regulation in galaxies, providing a new avenue for testing theoretical models with future integral field units and ALMA surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.21405.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21500",
      "title": "Revisiting the Origin of the Star-Forming Main Sequence Based on a Volume-Limited Sample of ~25,000 Galaxies",
      "authors": [
        "Yang Gao",
        "Shujiao Liang",
        "Qinghua Tan",
        "Enci Wang",
        "Huilan Liu",
        "Hongmei Wang",
        "Tao Jing",
        "Xiaolong Wang",
        "Kaihui Liu",
        "Ning Gai",
        "Yanke Tang",
        "Yifan Wang",
        "Yutong Li"
      ],
      "abstract": "Revisiting the Origin of the Star-Forming Main Sequence Based on a Volume-Limited Sample of ~25,000 Galaxies Yang Gao, Shujiao Liang, Qinghua Tan, Enci Wang, Huilan Liu, Hongmei Wang, Tao Jing, Xiaolong Wang, Kaihui Liu, Ning Gai, Yanke Tang, Yifan Wang, Yutong Li 3 figures. Invited and accepted by Universe Astrophysics of Galaxies (astro-ph.GA) We revisit the extensively debated star-forming main sequence (SFMS)-a tight correlation between the star formation rate and stellar mass in both kiloparsec-resolved and integrated galaxies. We statistically explore the fundamental drivers of star formation at global scales, using a large volume-limited sample of 24,954 local star-forming galaxies to overcome the limitations of previous works. Based on the mid-infrared 12 micron luminosity, stellar mass, and g-r color, we estimate the molecular gas mass for the considered sample. At galaxy-wide scales, we establish global relations between the surface densities of the star formation rate, stellar mass, and molecular gas mass . These global density relations are connected with and follow similar trends as the resolved SFMS, the Kennicutt-Schmidt (KS) relation, and the molecular gas main sequence (MGMS). Taking advantage of this large catalog, we show that the scatters in the global KS and MGMS relations are smaller than that of the global relation between the star formation rate surface density and stellar mass surface density, and their Pearson correlation coefficients are higher. More importantly, multivariate regression and partial correlation analyses demonstrate that the apparent correlation between the star formation rate surface density and stellar mass surface density is entirely mediated by the molecular gas surface density, with its best-fit parameters directly derivable from those of the KS and MGMS relations. Overall, our findings suggest that the correlation between stellar mass and molecular gas, as well as that between molecular gas and star formation, are more direct and fundamental. The star-forming main sequence thus appears to be a natural by-product of these two tighter relations.",
      "pdf_url": "https://arxiv.org/pdf/2602.21500.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21560",
      "title": "Performance assessment of the gPLUTO code for the numerical modeling of radio galaxy evolution",
      "authors": [
        "Gourab Giri",
        "Andrea Mignone",
        "Alessio Suriano",
        "Marco Rossazza",
        "Stefano Truzzi"
      ],
      "abstract": "Performance assessment of the gPLUTO code for the numerical modeling of radio galaxy evolution Gourab Giri, Andrea Mignone, Alessio Suriano, Marco Rossazza, Stefano Truzzi Accepted for publication: Astronomy and Computing (Special issue: HPC in Cosmology and Astrophysics) Astrophysics of Galaxies (astro-ph.GA) High-resolution tri-axial simulations are indispensable for realistically co-modeling the dynamical signatures and the radiative fingerprints of astrophysical jets, which are becoming increasingly important in modern computational studies of jet physics. However, such simulations impose extreme computational requirements that often exceed the capabilities of conventional CPU-based codes. GPU-accelerated simulations offer a transformative solution to mitigate these limitations. In this work, we present a detailed performance benchmarking of the recently developed GPU-enabled PLUTO code (gPLUTO), demonstrating runtime speed-ups ranging from an order of magnitude to (approximately) over 30 relative to CPU-only configurations. A direct comparison between computations of extragalactic jet propagation performed at different grid resolutions confirm the physical fidelity and production readiness of the gPLUTO code, while underscoring the importance of resolving the jet radius adequately to capture the jet dynamics accurately. Leveraging GPU-PLUTO's capabilities, we finally present an application by performing high-resolution simulations of giant radio galaxy jets (GRGs $\\gtrsim 1$ Mpc), representing the first such well-resolved 3D study to our knowledge (resolving scales down to 500 pc). These simulations probe a range of environmental effects on GRG jets, clarifying their formation from central galaxies within host cosmic structures, rapid peripheral expansion, and the development of asymmetric cocoon morphologies.",
      "pdf_url": "https://arxiv.org/pdf/2602.21560.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21676",
      "title": "AVID: A Near-Major Post-Merger of Late-Type Dwarfs beneath a Regularly Rotating HI Disk (VCC 693)",
      "authors": [
        "Fujia Li",
        "Hong-Xin Zhang",
        "Elias Brinks",
        "Se-Heon Oh",
        "Rory Smith",
        "Zesen Lin",
        "Weibin Sun",
        "Yu-Zhu Sun",
        "Tie Li",
        "Minsu Kim",
        "Jaebeom Kim",
        "Lijun Chen",
        "Lanyue Zhang",
        "Patrick Côté",
        "Alessandro Boselli",
        "Pierre-Alain Duc",
        "Laura Ferrarese",
        "Matteo Fossati",
        "Stephen Gwyn",
        "Xu Kong",
        "Sanjaya Paudel",
        "Eric W. Peng",
        "Thomas H. Puzia",
        "Rubén Sánchez-Janssen",
        "Matthew Taylor",
        "Yinghe Zhao"
      ],
      "abstract": "AVID: A Near-Major Post-Merger of Late-Type Dwarfs beneath a Regularly Rotating HI Disk (VCC 693) Fujia Li, Hong-Xin Zhang, Elias Brinks, Se-Heon Oh, Rory Smith, Zesen Lin, Weibin Sun, Yu-Zhu Sun, Tie Li, Minsu Kim, Jaebeom Kim, Lijun Chen, Lanyue Zhang, Patrick Côté, Alessandro Boselli, Pierre-Alain Duc, Laura Ferrarese, Matteo Fossati, Stephen Gwyn, Xu Kong, Sanjaya Paudel, Eric W. Peng, Thomas H. Puzia, Rubén Sánchez-Janssen, Matthew Taylor, Yinghe Zhao 19 pages (excluding appendices), 16 figures (excluding appendices), Accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) On the periphery of galaxy clusters, moderately high galaxy densities and velocity dispersions favour interactions and mergers that influence galaxy evolution prior to cluster infall. Observational studies of this phase in dwarfs remain rare. We present a high-resolution study of the merger remnant VCC 693 in the outskirts of Virgo cluster, using observations from the Atomic gas in Virgo Interacting Dwarf galaxies (AVID) project. We explore the origin of VCC 693 and the consequences of the merger on its star formation and structure through a joint analysis of VLA and FAST HI emission line observations, together with complementary optical imaging and spectroscopy. We employ hydrodynamical simulations to help interpret the observations. Our analysis favours a near-major merger between two dwarfs with a stellar mass ratio of 3:1-4:1, with one likely gas-poor progenitor (i.e., a damp merger). The optical appearance of VCC 693 is dominated by complex tidal structures throughout the system, whereas the HI gas has settled to a regular rotating disk. Compared with similar-mass dwarfs, the central star formation and gas-phase metallicity are moderately enhanced. The global star formation rate, HI gas content, and HI-to-optical size ratio of VCC 693 are broadly consistent with those of typical dwarfs of similar mass, albeit somewhat lower. Decomposition of the HI rotation curve into baryonic and dark matter indicates a high halo concentration, suggesting post-merger relaxation into a more centrally peaked configuration. Together with two recent studies of AVID post-merger systems, these results support the view that even major dwarf mergers can produce remnants with overall stellar structures indistinguishable from ordinary dwarfs, and that the environmental effects in cluster outskirts can promote damp or mixed mergers, constituting an integral part of galactic pre-processing.",
      "pdf_url": "https://arxiv.org/pdf/2602.21676.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21739",
      "title": "A Robust Analysis of QU-fitting Behavior for 800-1088 MHz and 1296-1440 MHz",
      "authors": [
        "Lindsey Oberhelman",
        "Cameron L. Van Eck",
        "N. M. McClure-Griffiths",
        "Yik Ki Ma",
        "Alec J. M. Thomson",
        "Jason M. Price",
        "Shinsuke Ideguchi",
        "Craig S. Anderson",
        "Marijke Haverkorn",
        "Denis Leahy",
        "Takuya Akahori",
        "Jennifer West"
      ],
      "abstract": "A Robust Analysis of QU-fitting Behavior for 800-1088 MHz and 1296-1440 MHz Lindsey Oberhelman, Cameron L. Van Eck, N. M. McClure-Griffiths, Yik Ki Ma, Alec J. M. Thomson, Jason M. Price, Shinsuke Ideguchi, Craig S. Anderson, Marijke Haverkorn, Denis Leahy, Takuya Akahori, Jennifer West Astrophysics of Galaxies (astro-ph.GA) QU-fitting is a powerful tool for interpreting spectro-polarimetric radio continuum observations by linking them to physical models, enabling estimates of the magnetic fields in, for example, the Milky Way, galaxy clusters, and radio jets. We present a comprehensive investigation into the effectiveness and limitations of QU-fitting within the ASKAP POSSUM survey frequency ranges (800-1088 MHz and 1296-1440 MHz) with projections to other spectro-polarimetric radio observations. We simulate different physical polarization sources: Faraday simple, Burn slab, internal turbulence, external turbulence, and two-component models in the POSSUM frequencies, and assess their observational degeneracies and fit accuracies. Our results highlight the model-dependent nature of reliable fitting and identify specific regions of parameter space where model selection, and therefore characterization of the physical medium, becomes ambiguous. For QU-fitting we find the Bayes factor, computed using the marginal likelihood, outperforms more traditionally used goodness-of-fit metrics such as Bayesian Information Criterion (BIC), Akaike Information Criterion (AIC), and chi-squared for model selection. We provide empirical relationships to delineate the boundaries where model distinguishability is impossible. Finally, we evaluate how accurately QU-fitting recovers model parameters and their associated uncertainties, thereby assessing its ability to correctly characterize the Faraday-rotating medium in both point and extended sources in Faraday depth space.",
      "pdf_url": "https://arxiv.org/pdf/2602.21739.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21748",
      "title": "Formation timescales for stellar bars in diverse galactic discs",
      "authors": [
        "Matthew Frosst",
        "Danail Obreschkow",
        "Aaron Ludlow"
      ],
      "abstract": "Formation timescales for stellar bars in diverse galactic discs Matthew Frosst, Danail Obreschkow, Aaron Ludlow 12 pages, 7 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We study the formation of stellar bars using 145 simulations of disc galaxies embedded in live and static dark matter haloes. We use the exponential bar growth timescale, $\\tau_{\\rm bar}$, to quantify how disc structure and kinematics regulate the onset and rate of secular bar formation. We extend previous work to thicker and more turbulent discs, motivated by those observed at high redshift ($z>1$). By revisiting several commonly used disc stability criteria - the Efstathiou-Lake-Negroponte parameter ($\\epsilon_{\\rm ELN}$), the Ostriker-Peebles ratio ($t_{\\rm OP}$), and the disc stellar mass fraction within 2.2 disc scale radii ($f_{\\rm disc}$) - we find that $\\tau_{\\rm bar}$, when expressed in terms of the disc's orbital period, follows a tight power law with each criteria. In Milky Way-like discs embedded in live haloes, bars form within a Hubble time if $f_{\\rm disc} \\geq 0.18$, $t_{\\rm OP} \\geq 0.27$, and $\\epsilon_{\\rm ELN} \\leq 1.44$. We show discs with higher velocity dispersion experience delayed bar growth and introduce an empirical relation that correctly describes the bar formation timescales of all our live halo models. Bars in static haloes grow at roughly half the rate of those in live haloes and require substantially greater disc instability to do so.",
      "pdf_url": "https://arxiv.org/pdf/2602.21748.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21790",
      "title": "CALIMA: On-the-fly dust and PAH evolution for radiation-hydrodynamics galaxy formation simulations",
      "authors": [
        "Francisco Rodríguez Montero",
        "Yohan Dubois",
        "Harley Katz",
        "Adrianne Slyz",
        "Julien Devriendt"
      ],
      "abstract": "CALIMA: On-the-fly dust and PAH evolution for radiation-hydrodynamics galaxy formation simulations Francisco Rodríguez Montero, Yohan Dubois, Harley Katz, Adrianne Slyz, Julien Devriendt To be submitted. 53 pages, 25 figures. Comments welcome Astrophysics of Galaxies (astro-ph.GA) Dust grains and polycyclic aromatic hydrocarbons (PAHs) actively contribute to the thermodynamics, chemistry, and radiative state of the interstellar medium (ISM), yet most ISM models and galaxy simulations either exclude them altogether or adopt simplified treatments. We present CALIMA, a new module for dust and PAH formation and evolution in radiation-hydrodynamics simulations for RAMSES, designed to self-consistently couple dust physics to radiative transfer and non-equilibrium thermochemistry in a multiphase ISM. The model employs a two-size, two-composition dust framework with log-normal grain populations, explicitly evolving stellar dust injection, turbulence-informed gas-phase accretion, shattering, coagulation, thermal and non-thermal sputtering, and shock destruction, while PAHs are separate components with their own evolution. The evolving dust populations and radiation field determine local, wavelength-dependent opacities, photoelectric heating efficiencies, grain-assisted recombination, dust-gas collisional heating/cooling, and H$_2$ formation on both grains and PAHs. Updated treatments of thermal sputtering and collisional cooling that include finite grain sizes and modern ion-solid physics reduce sputtering rates at high temperatures and extend the regime where dust significantly cools hot gas. One-zone ISM tests show that dust and PAH evolution modifies classical thermal phase diagrams and C-bearing chemistry, while isolated disc galaxy simulations reveal environment-dependent variations in dust-to-metal ratio, small-to-large grain ratio, PAH fraction, and interstellar radiation field intensity that drive non-trivial structure in infrared emission, UV transparency, and H$_2$ formation. CALIMA provides a physically motivated framework to interpret dust- and PAH-based observables and to assess dust-mediated feedback in galaxy formation across cosmic time.",
      "pdf_url": "https://arxiv.org/pdf/2602.21790.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21875",
      "title": "The Dawes Review: A Decade of Ultra-Diffuse Galaxies",
      "authors": [
        "Jonah S. Gannon",
        "Anna Ferré-Mateu",
        "Duncan A. Forbes"
      ],
      "abstract": "The Dawes Review: A Decade of Ultra-Diffuse Galaxies Jonah S. Gannon, Anna Ferré-Mateu, Duncan A. Forbes 30 pages, 20 figures, 2 tables. Accepted for Publication in PASA Astrophysics of Galaxies (astro-ph.GA) It has been 10 years since the initial discovery of Ultra-Diffuse Galaxies (UDGs) in the Coma cluster and the revelation that large, low surface brightness galaxies may constitute a greater fraction of galaxies than first thought. This left an open question: Are UDGs something special, or just an extension of the previously known dwarf galaxy population? Seeking to answer this question, in the decade following, dedicated simulations have studied and proposed a myriad of formation pathways to create UDGs. Observations have then pushed the limits of world-class observatories to perform detailed studies of these galaxies in large numbers across the full range of environments in the local Universe. These observations stress test simulations and challenge previous galaxy formation wisdom, with UDGs posing many open puzzles beyond just their unknown formation mechanism. To provide a few pertinent examples: there is observational evidence that not all UDGs follow the standard stellar mass -- halo mass relationship; there is evidence for UDGs with extraordinarily high levels of alpha enhancement; and there is evidence that some UDGs are much more globular cluster rich than other dwarfs of similar stellar mass. In this Dawes review, we undertake the task of summarising the decade of science since the discovery of UDGs. We focus on the quiescent population of UDGs and review their general properties, their proposed formation scenarios, their internal properties and their globular cluster systems. We also provide a brief conjecture on some future directions for the next decade of UDG research.",
      "pdf_url": "https://arxiv.org/pdf/2602.21875.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22035",
      "title": "Optical Spectroscopy of Dwarf Galaxies at $z\\sim 0.15$ in the COSMOS Field: Star Formation and Dust Properties",
      "authors": [
        "Zahra Sattari",
        "Daniel D. Kelson",
        "Bahram Mobasher",
        "Nima Chartab",
        "Vihang Mehta",
        "Harry I. Teplitz",
        "Shannon G. Patel"
      ],
      "abstract": "Optical Spectroscopy of Dwarf Galaxies at $z\\sim 0.15$ in the COSMOS Field: Star Formation and Dust Properties Zahra Sattari, Daniel D. Kelson, Bahram Mobasher, Nima Chartab, Vihang Mehta, Harry I. Teplitz, Shannon G. Patel 13 pages, 8 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We present a spectroscopic study of low-mass galaxies (LMGs;$10^8\\leq\\rm M_*/M_\\odot\\leq10^9$) at $z\\sim0.15$ in COSMOS field, and compare it to a control sample of intermediate-mass galaxies (IMGs;$10^9\\leq\\rm M_*/M_\\odot\\leq10^{10}$) at $z\\sim0.35$. We examine their star formation rates (SFRs), dust attenuation properties, and the relationship between nebular and stellar reddening. For both samples, SFRs derived from H$\\alpha$ are strongly correlated with SFRs from fitting simple star formation histories (SFHs) to the galaxies' spectral energy distributions. In fitting a joint SFR-$\\rm M_*$ relation, we obtain a slope of $\\rm {\\Delta log(SFR_{H\\alpha})}/{\\Delta log(M_*/M_\\odot)}=1.01\\pm0.03$, indicating that fair ensembles of SFHs for galaxies at these stellar masses are well-described by scale-free, self-similar forms. We also examine their dust attenuation properties and the relationship between nebular and stellar reddening, exploring how these quantities vary with stellar mass and specific SFR (sSFR). Nebular attenuation increases with stellar mass for IMGs but is lower and less mass-dependent in LMGs, consistent with their reduced dust content. In all cases, stellar continuum attenuation is lower than nebular attenuation, as expected from the two-component dust model. The nebular-to-stellar color excess ratio in both samples is consistent with the canonical factor of 2.27. The ratio is mass-independent, but rises with sSFR in IMGs and remains constant in LMGs. These results suggest that in LMGs, efficient dispersal of birth clouds keeps the differential attenuation approximately constant across sSFR. Thus, although LMGs follow the same global SFR-$\\rm M_*$ scaling as massive galaxies, their lower dust content and feedback-maintained ISM produce distinct attenuation behavior relative to IMGs.",
      "pdf_url": "https://arxiv.org/pdf/2602.22035.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22079",
      "title": "Overlap Zoo Beta: A Catalogue of ~800 Occulting Pairs in the DESI Legacy Survey using Citizen Science",
      "authors": [
        "T. Butrum",
        "B. Holwerda",
        "W. C. Keel",
        "C. Robertson",
        "I. Castellano",
        "S. Pandey",
        "S. M. R. Adnan",
        "L. C. Bills",
        "D. Patel",
        "K. Cook",
        "T. Hardin",
        "A. Palao",
        "B. Connelly",
        "M. Morton"
      ],
      "abstract": "Overlap Zoo Beta: A Catalogue of ~800 Occulting Pairs in the DESI Legacy Survey using Citizen Science T. Butrum, B. Holwerda, W. C. Keel, C. Robertson, I. Castellano, S. Pandey, S. M. R. Adnan, L. C. Bills, D. Patel, K. Cook, T. Hardin, A. Palao, B. Connelly, M. Morton 15 pages, 7 figures, 8 tables, and a link to the catalogue included. Soon to be published in PASA Astrophysics of Galaxies (astro-ph.GA) Overlapping galaxies, in which a foreground galaxy partially overlaps a background galaxy, offer a unique opportunity to measure dust attenuation, a key nuisance parameter in galaxy studies, empirically and in great detail by modelling the light of both the foreground and background galaxy and inferring the missing light in the overlapping region. However, the current catalogue of overlapping pairs is relatively limited in number compared to catalogues dedicated to individual galaxies. Expanding this catalogue is not only a necessity to facilitate further detailed dust studies beyond the few limited studies conducted thus far, but also to improve pair-to-pair variance and support automated identification through machine learning techniques. To achieve this, we utilise galaxies classified as \"overlapping\" from Galaxy Zoo DECaLS (GZD-1, -2, and -5), along with images from Data Release 10 (DR10) of the DESI Legacy Survey, in our individual citizen science project to classify these pairs directly using volunteers. This new catalogue will not only provide a wealth of targets for future dust studies but will also contribute to a deeper understanding of these pairs and dust as a whole.",
      "pdf_url": "https://arxiv.org/pdf/2602.22079.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22151",
      "title": "Stellar associations powering HII regions $\\unicode{x2013}$ II. Escape fraction of ionizing photons",
      "authors": [
        "Fabian Scheuermann",
        "Kathryn Kreckel",
        "Jia Wei Teh",
        "Francesco Belfiore",
        "Brent Groves",
        "Ashley T. Barnes",
        "Médéric Boquien",
        "Mélanie Chevance",
        "Daniel A. Dale",
        "Oleg Egorov",
        "Simon C. O. Glover",
        "Kathryn Grasha",
        "Stephen Hannon",
        "Ralf S. Klessen",
        "Kirsten L. Larson",
        "Janice C. Lee",
        "Fu-Heng Liang",
        "Laura A. Lopez",
        "J. Eduardo Méndez-Delgado",
        "Justus Neumann",
        "Eve Ostriker",
        "Hsi-An Pan",
        "Lise Ramambason",
        "Francesco Santoro",
        "Eva Schinnerer",
        "David A. Thilker",
        "Qiushi Chris Tian",
        "Leonardo Úbeda",
        "Bradley C. Whitmore",
        "Thomas G. Williams"
      ],
      "abstract": "Stellar associations powering HII regions $\\unicode{x2013}$ II. Escape fraction of ionizing photons Fabian Scheuermann, Kathryn Kreckel, Jia Wei Teh, Francesco Belfiore, Brent Groves, Ashley T. Barnes, Médéric Boquien, Mélanie Chevance, Daniel A. Dale, Oleg Egorov, Simon C. O. Glover, Kathryn Grasha, Stephen Hannon, Ralf S. Klessen, Kirsten L. Larson, Janice C. Lee, Fu-Heng Liang, Laura A. Lopez, J. Eduardo Méndez-Delgado, Justus Neumann, Eve Ostriker, Hsi-An Pan, Lise Ramambason, Francesco Santoro, Eva Schinnerer, David A. Thilker, Qiushi Chris Tian, Leonardo Úbeda, Bradley C. Whitmore, Thomas G. Williams 15 pages, 12 figures. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Newly formed stars have a profound impact on their environment by depositing energy and momentum into the surrounding gas. However, only a fraction of the stellar feedback is retained in the cloud and observational constraints are needed to further our understanding of this process. In a sample of 19 nearby galaxies, we match HII regions from PHANGS$\\unicode{x2013}$MUSE to their ionizing stellar source from PHANGS$\\unicode{x2013}$HST and measure the percentage of ionizing radiation that is leaking into the surrounding diffuse ionized gas (DIG). Based on a catalogue, where each HII region is powered by a single young and massive stellar association, we measure a photon escape fraction of $f_\\mathrm{esc}=82^{+12}_{-24}$ per cent. Comparable results are obtained when different procedures are used to match the ionized gas to its source. All samples we study contain a substantial fraction of objects (up to 20 per cent), where the stellar source is not sufficient to produce the H$\\alpha$ flux observed from the nebula. Many of them are probably related to uncertain age estimates, but we also find numerous regions, where a significant fraction of the ionizing photon budget is contributed by stars that reside outside the boundaries of the HII region. This motivates the use of an alternative galaxy-wide approach, in which we include all HII regions and stellar sources, not just the ones that show a clear overlap. When summing up the ionization budget over entire galaxies, we measure slightly lower, but consistent values.",
      "pdf_url": "https://arxiv.org/pdf/2602.22151.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22204",
      "title": "Recovering 3D Magnetic Turbulence from Single-Frequency Faraday Screens",
      "authors": [
        "Aliaksandr Melnichenka",
        "Alex Lazarian",
        "Dmitri Pogosyan"
      ],
      "abstract": "Recovering 3D Magnetic Turbulence from Single-Frequency Faraday Screens Aliaksandr Melnichenka, Alex Lazarian, Dmitri Pogosyan Astrophysics of Galaxies (astro-ph.GA) Statistics of polarized synchrotron radiation carry information about the properties of the underlying turbulence. Different statistical measures constructed from observables probe turbulence properties in different ways. We consider a setup in which synchrotron radiation is emitted in a distant volume and then passes through a turbulent screen that induces Faraday rotation. Using both MHD simulations and synthetic turbulence spectra, we explore the spectrum of observed polarization directions measured at a single frequency as a diagnostic for recovering the statistics of turbulence in both the emitting region and the Faraday-rotation screen. We compare these results with our analytical expectations. We also compare the spectrum of polarization direction (SPD) with the wavelength-derivative diagnostic introduced and analytically explored by Lazarian \\& Pogosyan. We demonstrate that the SPD exhibits greater sensitivity to turbulence in the Faraday screen. We provide an observer-friendly criterion to determine whether the SPD samples turbulence in the synchrotron-emitting region or in the Faraday screen. These results open a practical pathway for extracting turbulence statistics from existing and forthcoming single-band radio polarimetry.",
      "pdf_url": "https://arxiv.org/pdf/2602.22204.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22206",
      "title": "SIRIUS: The relation between the diversity of dwarf galaxies and their formation histories",
      "authors": [
        "Chi-Hong Lin",
        "Michiko S Fujii",
        "Takayuki R Saitoh",
        "Yutaka Hirai"
      ],
      "abstract": "SIRIUS: The relation between the diversity of dwarf galaxies and their formation histories Chi-Hong Lin, Michiko S Fujii, Takayuki R Saitoh, Yutaka Hirai Submitted to PASJ, comments are welcome. (18 pages, 14 figures) Astrophysics of Galaxies (astro-ph.GA) Low-mass dwarf galaxies ($M_{\\rm vir} \\lesssim 10^9\\rm\\ M_\\odot$) are fundamental cosmological building blocks, yet the physical processes driving their structural diversity remain poorly understood. Recent numerical simulations have suggested a diversity in the stellar-to-halo mass ratio in this halo mass range, but either the number of samples obtained from the same simulation setup or the numerical resolution was limited. We performed high-resolution cosmological zoom-in simulations for eight galaxies with a dark matter halo mass of $\\sim 10^9\\rm\\ M_{\\odot}$ up to $t=1.2$ Gyr at which most gas in the galaxies has been expelled. Our samples have a scatter of an order of magnitude in the halo mass at the reionization epoch. The stellar-to-halo mass ratio expected at $z=0$ scatters nearly two orders of magnitude with $5\\times10^{-5}$ to $2\\times10^{-3}$. We also observed variation in the compactness of their stellar distributions. Some of our simulated galaxies exhibit a stellar half-mass radius of $\\sim30$ pc, which is as small as that of ultra-compact dwarfs. The formation condition for such a compact stellar distribution is understood as an analog of the condition for the formation of dense, massive star clusters. We found that when the central gas surface density exceeds a critical threshold ($\\Sigma_{\\rm gas} \\gtrsim 30\\rm\\ M_\\odot \\rm\\ {pc}^{-2}$), the star formation becomes highly efficient and results in dense stellar systems. These results suggest that UCDs can form in situ even in isolated dark matter halos.",
      "pdf_url": "https://arxiv.org/pdf/2602.22206.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21586",
      "title": "HATPI Pre-Perihelion Time-series Photometry of the Interstellar Comet 3I/ATLAS",
      "authors": [
        "Joel D. Hartman",
        "Gáspár Á. Bakos",
        "Andrés Jordán",
        "Sarah Thiele",
        "Zoltán Csubry",
        "Geert Jan Talens",
        "Attila Bódi",
        "Sándor Pigai",
        "István Domsa",
        "Anthony Keyes",
        "Vincent Suc",
        "Adriana Gaitan",
        "Antoine Thibault"
      ],
      "abstract": "HATPI Pre-Perihelion Time-series Photometry of the Interstellar Comet 3I/ATLAS Joel D. Hartman, Gáspár Á. Bakos, Andrés Jordán, Sarah Thiele, Zoltán Csubry, Geert Jan Talens, Attila Bódi, Sándor Pigai, István Domsa, Anthony Keyes, Vincent Suc, Adriana Gaitan, Antoine Thibault 18 pages, 7 figures, accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) HATPI is a recently commissioned time-domain facility at Las Campanas Observatory, Chile, that uses 64 wide-angle, 9.6 cm diameter lenses and back-illuminated CCDs, yielding a mosaic field-of-view of 7,100 square arcdegrees, observing the night sky at a cadence of 45 s and a spatial scale of 19.7 arcsec pixel$^{-1}$. In this paper, we present moving object time-series photometry with this facility, focusing on the interstellar comet 3I/ATLAS. 3I/ATLAS was first robustly recovered by HATPI on the night of 2025 July 2 (one night after its discovery) at a Gaia $G$-band magnitude of $G = 17.796 \\pm 0.082$ mag ($\\pm 0.030$ mag systematic uncertainty). The comet then increased in brightness to $G = 14.071 \\pm 0.073$ mag $\\pm 0.030$ mag by 2025 Sep 13, after which it became unobservable by HATPI as it approached perihelion. Before 3I/ATLAS achieved a brightness of $G = 16.396 \\pm 0.029$ mag $\\pm 0.030$ mag on 2025 Aug 6, it could be detected when stacking all HATPI observations from a single night, while after this date it is sufficiently bright to detect in individual 45 s exposures. We do not detect evidence for significant short-time-scale variations in the brightness of 3I/ATLAS after Aug 6. Compared to other light curves in the literature, the HATPI photometry exhibits a somewhat steeper rise in brightness with decreasing heliocentric distance, $r_{H}$. The HATPI magnitudes are well-fit as a power law function of $r_{H}$, with an exponential index of $n = 5.167 \\pm 0.095$, over the range $2.14$ AU $ < r_{H} < 4.44$ AU, compared to $n = 3.94 \\pm 0.10$ when fitting together with other literature observations. We find that the phase function is constrained to $\\beta = 0.0552 \\pm 0.0032$ mag deg$^{-1}$.",
      "pdf_url": "https://arxiv.org/pdf/2602.21586.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21882",
      "title": "A deep HST view of the open cluster NGC2158: binaries, mass functions, and M-dwarf discontinuity",
      "authors": [
        "A. V. Marchuk",
        "F. Muratore",
        "A. P. Milone",
        "M. V. Legnardi",
        "F. D'Antona",
        "G. Cordoni",
        "A. Mastrobuono-Battisti",
        "E. Bortolan",
        "F. Dell'Agli",
        "E. Dondoglio",
        "E. P. Lagioia",
        "A. F. Marino",
        "M. Tailo",
        "C. Ventura",
        "P. Ventura",
        "T. Ziliotto"
      ],
      "abstract": "A deep HST view of the open cluster NGC2158: binaries, mass functions, and M-dwarf discontinuity A. V. Marchuk, F. Muratore, A. P. Milone, M. V. Legnardi, F. D'Antona, G. Cordoni, A. Mastrobuono-Battisti, E. Bortolan, F. Dell'Agli, E. Dondoglio, E. P. Lagioia, A. F. Marino, M. Tailo, C. Ventura, P. Ventura, T. Ziliotto 11 pages, 8 figures. Accepted for publication in Astronomy & Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) A significant fraction of stars in both the Galactic field and stellar clusters are members of binary systems. Understanding their properties is therefore essential for a comprehensive view of stellar structure, evolution, and cluster dynamics. Despite extensive studies of cluster binaries, key issues remain unresolved, particularly for photometric binaries among low-mass stars. While the binary fraction in the field strongly depends on stellar mass, cluster studies have generally suggested an approximately constant fraction over the limited mass ranges explored. In addition, the mass function (MF) of very low-mass stars is still poorly constrained in clusters older than a few hundred Myr. We use deep Hubble Space Telescope imaging of the intermediate-age open cluster NGC 2158 to investigate its binary population and derive the luminosity and MFs down to ~0.14 solar masses, enabling the first detailed analysis of binaries in this cluster. We measure a global binary fraction of 38%, consistent with other open clusters, and find a clear mass dependence: it decreases from ~52% at 1.0 solar masses to ~11% at 0.2 solar masses. This trend mirrors that of Galactic field stars, suggesting similar binary properties. The MF is characterized by three regimes: high-mass stars (alpha= -2.49 +- 0.19), low-mass stars (alpha= -1.11 +- 0.09), and very low-mass stars (alpha= -0.08 +- 0.07). The slope change near 1.0 solar mass agrees with recent surveys, though we find a deficit below ~0.3 solar masses. We also detect a main-sequence discontinuity around ~0.3 solar masses, possibly linked to the 3He-driven instability predicted by stellar models and analogous to the Jao Gap seen in nearby field stars.",
      "pdf_url": "https://arxiv.org/pdf/2602.21882.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22012",
      "title": "MESA Isochrones and Stellar Tracks. II. Models with alpha-enhanced chemical composition",
      "authors": [
        "A Dotter",
        "E Bauer",
        "MJ Park",
        "C Conroy",
        "A Milone",
        "M Joyce",
        "M Cantiello"
      ],
      "abstract": "MESA Isochrones and Stellar Tracks. II. Models with alpha-enhanced chemical composition A Dotter, E Bauer, MJ Park, C Conroy, A Milone, M Joyce, M Cantiello 15 pages, 8 figures, accepted for publication in ApJS; new server at this https URL Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We update and expand the MESA Isochrones and Stellar Tracks (MIST) database to include variations in the alpha-capture elements, specifically [alpha/Fe]=-0.2, 0, +0.2, +0.4, and +0.6 for -3 <= [Fe/H] <= +0.5. Variations in [alpha/Fe] are included in a self-consistent manner from the stellar interior models to the synthetic spectra used to translate these models in the observational plane. We describe a number of updates to the physics utilized in these models as well as new information provided by the models. We validate the models with comparisons to other stellar evolution models including the previous generation of MIST and other models from the literature. MIST data products including stellar evolutiont tracks, isochrones, and bolometric correction tables can be obtained from the MIST project website, this https URL. All necessary files to reproduce MIST models are available from Zenodo.",
      "pdf_url": "https://arxiv.org/pdf/2602.22012.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22048",
      "title": "Dynamical masses of YSOs with the VLBA: DYNAMO VLBA: Trigonometric parallaxes and proper motions of YSOs in Orion",
      "authors": [
        "Sergio A. Dzib",
        "Jazmín Ordóñez-Toro",
        "Laurent Loinard",
        "Marina Kounkel",
        "Gisela Ortiz-Leon",
        "Phillip A. B. Galli",
        "Luis F. Rodríguez",
        "Amy J. Mioduszewski",
        "Josep M. Masqué",
        "Eoin O'Kelly",
        "Jan Forbrich",
        "Karla Moo-Herrera"
      ],
      "abstract": "Dynamical masses of YSOs with the VLBA: DYNAMO VLBA: Trigonometric parallaxes and proper motions of YSOs in Orion Sergio A. Dzib, Jazmín Ordóñez-Toro, Laurent Loinard, Marina Kounkel, Gisela Ortiz-Leon, Phillip A. B. Galli, Luis F. Rodríguez, Amy J. Mioduszewski, Josep M. Masqué, Eoin O'Kelly, Jan Forbrich, Karla Moo-Herrera Accepeted for publication in A&A, 12 pages, 5 figures, 8 tables Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We present results from a multi-epoch Very Long Baseline Array (VLBA) survey of compact radio sources in the Orion complex, conducted within both the DYNAMO-VLBA and the GOBELINS projects. Our observations detected 216 compact radio sources, of which 58 yielded reliable multi-epoch astrometric solutions. For these sources, we derived trigonometric parallaxes and proper motions with typical precisions of about 0.05 mas and 0.10 mas yr$^{-1}$, respectively. The measured parallaxes range between 2.26 and 2.65 mas, corresponding to distances of 380 - 440 pc, and delineate the depth of the Orion star-forming complex. We determine mean distances of $405\\pm16$ pc for NGC 2068, $403\\pm5$ pc for NGC 2024, $407\\pm12$ pc for the $\\sigma$ Orionis region, $388.5\\pm1.7$ pc for the Orion Nebula Cluster (ONC), and $438\\pm12$ pc for L1641. A comparison with Gaia DR3 astrometry for 28 common sources reveals negligible mean parallax offsets ($\\Delta\\varpi=-0.02\\pm0.01$ mas) and small systematic differences in proper motions ($\\sim$0.07 mas yr$^{-1}$), likely due to residual rotation of the Gaia reference frame. Our results demonstrate the capability of high-precision radio astrometry to map embedded stellar populations and to provide an independent calibration of the Gaia reference system in obscured regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.22048.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.03218",
      "title": "The Rise of Ionized Gas Filaments in Early-Type Galaxies",
      "authors": [
        "Ryan Eskenasy",
        "Valeria Olivares",
        "Yuanyuan Su"
      ],
      "abstract": "The Rise of Ionized Gas Filaments in Early-Type Galaxies Ryan Eskenasy, Valeria Olivares, Yuanyuan Su 26 pages, 10 figures, Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) Multiphase filamentary nebulae are ubiquitous in the brightest cluster galaxies (BCGs) of cool-core clusters, providing insight into baryon cycling and the feeding and feedback of supermassive black holes. However, BCGs account for less than 1% of all early-type galaxies (ETGs). To broaden our understanding of how multiphase filamentary nebulae form in ETGs and connect to the greater picture of galaxy evolution, it is crucial to explore ETGs that are outside of the dense centers of galaxy clusters or groups. We present VLT-MUSE IFU observations of 126 nearby non-central ETGs, detecting warm ionized gas in 62 of them. 35/62 host rotating gas disks with the majority of them morphologically and kinematically aligned with their stellar components, suggesting stellar mass loss may dominate their warm-gas origin. The remaining 27 host filamentary nebulae, often decoupled from the stellar components, resembling those observed in BCGs. These filamentary sources display unique emission line properties that cannot be fully explained by photoionization from post-asymptotic giant branch stars, active galactic nuclei, or fast gas shocks alone. For the twelve filamentary sources that have Chandra data, their soft X-ray emission exceeds or is consistent with (within uncertainties) unresolved low-mass X-ray binary emission, indicating that filamentary systems generally host an appreciable hot gas reservoir. We suggest that cooling-related processes, e.g., self-irradiation associated with the cooling hot gas, may contribute to the powering of warm gas line emission, similar to cool-core clusters, though the detailed mechanisms and physical conditions may differ. As a case study, we investigate NGC 4374, a non-central ETG with extensive Chandra observations, and find that its warm filaments are over-pressured compared to the hot filaments - opposite to what is observed in cool-core clusters.",
      "pdf_url": "https://arxiv.org/pdf/2507.03218.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.04067",
      "title": "COLIBRE: calibrating subgrid feedback in cosmological simulations that include a cold gas phase",
      "authors": [
        "Evgenii Chaikin",
        "Joop Schaye",
        "Matthieu Schaller",
        "Sylvia Ploeckinger",
        "Yannick M. Bahé",
        "Alejandro Benítez-Llambay",
        "Camila Correa",
        "Victor J. Forouhar Moreno",
        "Carlos S. Frenk",
        "Filip Huško",
        "Roi Kugel",
        "Robert McGibbon",
        "Alexander J. Richings",
        "James W. Trayford",
        "Josh Borrow",
        "Robert A. Crain",
        "John C. Helly",
        "Cedric G. Lacey",
        "Aaron Ludlow",
        "Folkert S. J. Nobels"
      ],
      "abstract": "COLIBRE: calibrating subgrid feedback in cosmological simulations that include a cold gas phase Evgenii Chaikin, Joop Schaye, Matthieu Schaller, Sylvia Ploeckinger, Yannick M. Bahé, Alejandro Benítez-Llambay, Camila Correa, Victor J. Forouhar Moreno, Carlos S. Frenk, Filip Huško, Roi Kugel, Robert McGibbon, Alexander J. Richings, James W. Trayford, Josh Borrow, Robert A. Crain, John C. Helly, Cedric G. Lacey, Aaron Ludlow, Folkert S. J. Nobels 41 pages, 20 figures (including appendices); accepted for publication in MNRAS; images, videos, and interactive visualizations are available on the COLIBRE website at this https URL Astrophysics of Galaxies (astro-ph.GA) We present the calibration of stellar and active galactic nucleus (AGN) feedback in the subgrid model for the new COLIBRE hydrodynamical simulations of galaxy formation. COLIBRE directly simulates the multi-phase interstellar medium and the evolution of dust grains, which is coupled to the chemistry. COLIBRE is calibrated at three resolutions: particle masses of $m_{\\rm gas} \\approx m_{\\rm dm} \\sim 10^7$ (m7), $10^6$ (m6), and $10^5~\\mathrm{M_\\odot}$ (m5). To calibrate the COLIBRE feedback at m7 resolution, we run Latin hypercubes of $\\approx 200$ simulations that vary up to four subgrid parameters in cosmological volumes of ($50~\\mathrm{cMpc}$)$^{3}$. We train Gaussian process emulators on these simulations to predict the $z=0$ galaxy stellar mass function (GSMF) and size - stellar mass relation (SSMR) as functions of the model parameters, which we then fit to observations. The trained emulators not only provide the best-fitting parameter values but also enable us to investigate how different aspects of the prescriptions for supernova and AGN feedback affect the predictions. In particular, we demonstrate that while the observed $z=0$ GSMF and SSMR can be matched individually with a relatively simple supernova feedback model, simultaneously reproducing both necessitates a more sophisticated prescription. We show that the calibrated m7 COLIBRE model not only reproduces the calibration target observables, but also matches various other galaxy properties to which the model was not calibrated. Finally, we apply the calibrated m7 model to the m6 and m5 resolutions and, after slight manual adjustments of the subgrid parameters, achieve a similar level of agreement with the observed $z=0$ GSMF and SSMR.",
      "pdf_url": "https://arxiv.org/pdf/2509.04067.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20361",
      "title": "The HyLight model for hydrogen emission lines in simulated nebulae",
      "authors": [
        "Yuankang Liu",
        "Tom Theuns",
        "Tsang Keung Chan",
        "Alexander J. Richings",
        "Anna F. McLeod"
      ],
      "abstract": "The HyLight model for hydrogen emission lines in simulated nebulae Yuankang Liu, Tom Theuns, Tsang Keung Chan, Alexander J. Richings, Anna F. McLeod 30 pages, 28 figures. Accepted for publication in MNRAS. The HyLight package is available at this https URL . It can also be accessed via PyPI at this https URL . The input scripts for the Cloudy models used in this paper can be accessed at this https URL Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Hydrogen recombination lines provide key diagnostics of ionized gas in galaxies, yet most hydrodynamical simulations estimate hydrogen level populations using interpolated emissivity tables rather than computing them directly from local physical conditions. We present HyLight, a Python-based atomic model that calculates hydrogen level populations and line emissivities from the gas density, temperature, and ionization state, enabling accurate predictions in both equilibrium and non-equilibrium environments. Benchmark comparisons show that HyLight reproduces Cloudy predictions for Balmer, Paschen, and Brackett emissivities to within 1 per cent under typical photoionized nebular conditions, while discrepancies of several tens of per cent arise relative to other published calculations. As an illustrative application, we use HyLight to compute photoionization-to-line intensity ratios in an HII nebula and generate synthetic hydrogen emission maps from a radiation-hydrodynamical simulation that includes non-equilibrium thermochemistry. Combining physical consistency with flexibility, HyLight provides a robust framework for connecting hydrodynamical simulations with observational diagnostics of photoionized regions, and enhances our ability to interpret hydrogen emission in complex, non-equilibrium astrophysical environments.",
      "pdf_url": "https://arxiv.org/pdf/2509.20361.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.08684",
      "title": "A Vertically Orientated Dark Matter Halo Marks a Flip of the Galactic Disk",
      "authors": [
        "Ling Zhu",
        "Runsheng Cai",
        "Xi Kang",
        "Xiang-Xiang Xue",
        "Chengqun Yang",
        "Lan Zhang",
        "Shude Mao",
        "Chao Liu"
      ],
      "abstract": "A Vertically Orientated Dark Matter Halo Marks a Flip of the Galactic Disk Ling Zhu, Runsheng Cai, Xi Kang, Xiang-Xiang Xue, Chengqun Yang, Lan Zhang, Shude Mao, Chao Liu Astrophysics of Galaxies (astro-ph.GA) Unveiling the 3D shape of the Milky Way's dark-matter halo is critical to understanding its formation history. We created an innovative dynamical model with minimal assumptions on the internal dynamical structures and accommodates a highly flexible triaxial DM halo. By applying the method to 6D phase-space data of K-giant stars from LAMOST + Gaia, we robustly determine the 3D dark-matter distribution of the Milky Way out to approximately $50$ kpc. We discover a triaxial, nearly oblate dark-matter halo with $q_{\\rm DM} = Z/X= 0.92\\pm0.08$, $p_{\\rm DM} = Y/X= 0.8\\pm0.2$ averagely within 50 kpc, where $Z$ axis is defined perpendicular to the stellar disk. The axes ratio $q_{\\rm DM} > p_{\\rm DM}$ is strongly preferred; the long-intermediate axis plane of the dark-matter halo is unexpectedly vertical to the Galactic disk, yet aligned with the `plane of satellites'. This striking configuration suggests that the Galactic disk (and the inner halo) has flipped, likely torqued by minor mergers, from an original alignment with the outer dark-matter halo and satellite plane, as supported by Milky Way analogues from Auriga and TNG50. By allowing $q_{\\rm DM}(r)$ and $p_{\\rm DM}(r)$ vary with radii, we find tentative evidence that the dark-matter halo is twisted, that it agrees alignment with the disk in the inner regions and transitions to a vertical orientation at $r\\gtrsim 20$ kpc, supporting the disk flip scenario prediction. Such disk reorientation is non-trivial yet its physical mechanism is straightforward to comprehend and naturally originates a vertical satellite plane. Our findings offer a unified framework that links dark-matter halo orientation, satellite alignment, and disk evolution, reinforcing the internal consistency of the Milky Way in $\\Lambda$CDM model.",
      "pdf_url": "https://arxiv.org/pdf/2510.08684.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.12454",
      "title": "The influence of AGN feedback on star formation in red spiral galaxies",
      "authors": [
        "Moreom Akter , Wayne A. Barkhouse , Sandanuwan P Kalawila Vithanage , Gihan L. Gamage , Omar López-Cruz University of North Dakota, Gettysburg College, New Mexico State University-Alamogordo, Instituto Nacional de Astrofisica, Optica y Electronica)"
      ],
      "abstract": "The influence of AGN feedback on star formation in red spiral galaxies Moreom Akter (1), Wayne A. Barkhouse (1), Sandanuwan P Kalawila Vithanage (2), Gihan L. Gamage (3), Omar López-Cruz (4) ((1) University of North Dakota, (2) Gettysburg College, (3) New Mexico State University-Alamogordo, (4) Instituto Nacional de Astrofisica, Optica y Electronica) 39 pages, 11 figures, 5 tables; Accepted for publication in New Astronomy Astrophysics of Galaxies (astro-ph.GA) We investigated the influence of Active Galactic Nuclei (AGN) feedback on star formation in red spiral galaxies by analyzing a sample of 324 red and 273 blue face-on spirals selected from 115 low-redshift galaxy clusters. This multi-wavelength dataset combines optical emission line data from the Sloan Digital Sky Survey with X-ray fluxes from Chandra and XMM-Newton X-ray space telescopes. Using diagnostic emission line ratios, we constructed Baldwin-Phillips-Terlevich (BPT) diagrams, introduced in 1981 to classify galaxies based on nuclear activity. Our analysis reveals that most red spirals exhibit AGN or low-ionization nuclear emission-line region (LINER) signatures, based on optical data, as determined by their location in the BPT, Cid Fernandes, and Mazzolari diagrams. These results are consistent with the presence of negative feedback from AGNs quenching star formation. Conversely, X-ray analysis reveals that many blue spirals exhibit high X-ray luminosities and are situated in the AGN region of emission line ratio diagrams, suggesting that AGN-driven positive feedback may be enhancing star formation. Our findings support the hypothesis that AGN feedback plays a key role in the evolution of spiral galaxies, particularly in quenching star formation and driving the transition from blue to red spiral systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.12454.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.07793",
      "title": "Hot, Photoionized X-ray Gas in Two Luminous Type 2 Quasars: Chandra-HST Evidence for a Wind-Driven Sequence",
      "authors": [
        "Anna Trindade Falcão",
        "S. Kraemer",
        "L. Feuillet",
        "R. Middei",
        "T. J. Turner",
        "J. Reeves",
        "V. Braito",
        "A. Ptak",
        "H. R. Schmitt",
        "T. C. Fischer",
        "D. M. Crenshaw",
        "Luis C. Ho",
        "M. Revalski",
        "T. Storchi-Bergmann",
        "M. Vestergaard",
        "C. M. Gaskell",
        "W. P. Maksym",
        "M. Elvis",
        "M. J. Ward",
        "H. Netzer"
      ],
      "abstract": "Hot, Photoionized X-ray Gas in Two Luminous Type 2 Quasars: Chandra-HST Evidence for a Wind-Driven Sequence Anna Trindade Falcão, S. Kraemer, L. Feuillet, R. Middei, T. J. Turner, J. Reeves, V. Braito, A. Ptak, H. R. Schmitt, T. C. Fischer, D. M. Crenshaw, Luis C. Ho, M. Revalski, T. Storchi-Bergmann, M. Vestergaard, C. M. Gaskell, W. P. Maksym, M. Elvis, M. J. Ward, H. Netzer Astrophysics of Galaxies (astro-ph.GA) We present new Chandra/ACIS-S imaging spectroscopy of two luminous type 2 quasars, FIRST J120041.4+314745 ($z$=0.116) and 2MASX J13003807+5454367 ($z$=0.088), and compare their X-ray emission with Hubble Space Telescope [O III]$\\lambda$5007 morphologies and kinematics. Both systems show kiloparsec-scale soft X-ray emission. In FIRST J120041, the X-ray morphology is clumpy and closely follows the [O III] structures, with surface-brightness peaks co-spatial with the highest [O III] velocities (600-750 km s$^{-1}$) and broadest line widths ($\\sim$1700 km s$^{-1}$). In 2MASX J130038, the X-ray emission is centrally concentrated and weakly correlated with rotational [O III] kinematics. Spectral modeling indicates that photoionization dominates the soft X-rays in both quasars. The inferred hot-gas reservoirs are substantial, $M_{\\rm x-ray}\\sim4.5\\times10^{8}M_\\odot$ (FIRST J120041) and $M_{\\rm x-ray}\\sim1.8\\times10^{8}M_\\odot$ (2MASX J130038), exceeding the outflowing [O III] masses by factors of $\\sim$4 and $\\sim$16. In 2MASX J130038, we identify a tentative blueshifted Fe XXVI Ly$\\alpha$ line at $E_{\\rm rest}=7.14\\pm0.06$ keV ($v\\sim7600$ km s$^{-1}$), consistent with a hot wind confined to the inner few hundred parsecs. Combining these results with a broader sample of twelve type 2 quasars, we argue that luminous quasars evolve along a continuous feedback sequence regulated by progressive clearing of circumnuclear gas. As AGN radiation and winds pierce the surrounding medium, systems transition from heavily enshrouded, compact configurations to phases where the X-ray and [O III] components strongly couple and, eventually, to energetically dominant outflows. FIRST J120041 and 2MASX J130038 represent two points along this sequence, tracing the emergence and growth of hot winds as primary drivers of quasar-scale feedback.",
      "pdf_url": "https://arxiv.org/pdf/2512.07793.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.15186",
      "title": "Probing Heavily Obscured AGN in Major Galaxy Mergers Using the mm-X-ray Correlation",
      "authors": [
        "M. Droguett-Callejas",
        "E. Treister",
        "L. Barcos-Muñoz",
        "M. Johnstone",
        "F. E. Bauer",
        "T. Kawamuro",
        "N. Torres-Albà",
        "C. Ricci",
        "M. Koss",
        "Y. Song",
        "A. Peca",
        "A. Evans",
        "J. González"
      ],
      "abstract": "Probing Heavily Obscured AGN in Major Galaxy Mergers Using the mm-X-ray Correlation M. Droguett-Callejas, E. Treister, L. Barcos-Muñoz, M. Johnstone, F. E. Bauer, T. Kawamuro, N. Torres-Albà, C. Ricci, M. Koss, Y. Song, A. Peca, A. Evans, J. González The Astrophysical Journal Letters, Volume 999, Number 1, 2026, L11 Astrophysics of Galaxies (astro-ph.GA) The study of heavily obscured supermassive black hole (SMBH) growth in late-stage galaxy mergers is challenging: column densities $N_{\\mathrm{H}}>10^{24},\\mathrm{cm}^{-2}$ can block most nuclear emission, leaving significant gaps in the SMBH growth census. Millimeter-wave continuum emission offers a potential window into this obscured phase, as it can trace Active Galactic Nuclei (AGN) activity through mechanisms less affected by dust extinction. In this work, we test whether the observed correlation between millimeter ($\\sim200,\\mathrm{GHz}$) and hard X-ray (14 - 150,keV) luminosities can be used to plausibly identify hidden AGN in local (Ultra)Luminous Infrared Galaxies (U)LIRGs, including systems hosting confirmed dual AGN. We identify three sources -- one confirmed AGN and two strong candidates -- presenting significant evidence of AGN activity. The confirmed dual AGN lie within $\\sim3\\sigma$ of the mm--X-ray correlation, suggesting this relation can be used to identify hidden pairs. By combining the position of each source relative to this correlation with independent star formation rate constraints, we propose a method to disentangle AGN and star formation contributions for sources with measured column densities. While our analysis is based on a small, heterogeneous local sample and relies on empirical scaling relations, these results indicate that millimeter continuum emission may provide a useful complementary diagnostic for obscured SMBH growth. ALMA observations at high angular resolutions are particularly valuable for this approach, while future facilities such as the ngVLA will be essential to test its robustness in larger and more distant samples.",
      "pdf_url": "https://arxiv.org/pdf/2601.15186.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22656",
      "title": "The size-velocity dispersion relationship of Galactic HII regions",
      "authors": [
        "Lin Ma",
        "Yunning Zhao",
        "Wei Zhang",
        "Youliang Feng",
        "Shiming Wen",
        "Shichao Han",
        "Chaojian Wu",
        "Juanjuan Ren",
        "Jianjun Chen",
        "Yuzhong Wu",
        "Zhongrui Bai",
        "Yonghui Hou",
        "Yongheng Zhao",
        "Hong Wu"
      ],
      "abstract": "The size-velocity dispersion relationship of Galactic HII regions Lin Ma, Yunning Zhao, Wei Zhang, Youliang Feng, Shiming Wen, Shichao Han, Chaojian Wu, Juanjuan Ren, Jianjun Chen, Yuzhong Wu, Zhongrui Bai, Yonghui Hou, Yongheng Zhao, Hong Wu 19 pages, 5 figures, accepted by RAA Astrophysics of Galaxies (astro-ph.GA) The size-velocity dispersion ($\\sigma$) relation, while well established for giant HII regions, remains uncertain for their smaller counterparts (physical radii R < 20 pc). Thanks to the LAMOST MRS-N dataset's large sky coverage and high spatial/spectral resolution, we examined this relationship using 10 isolated Galactic HII regions with R < 20 pc. Our results reveal two key findings: (1) these small-size HII regions remarkably follow the same size-$\\sigma$ relation as giant HII regions, suggesting this correlation could serve as a novel distance indicator for Galactic HII regions; and (2) we find distinct dynamical behaviors between younger and older HII regions. Specifically, in younger (< 0.5 Myr), ionization-bounded HII regions, the velocity dispersion shows no correlation with expansion velocity, indicating that turbulence is driven primarily by stellar winds and ionization processes. In contrast, in older (> 0.5 Myr), matter-bounded HII regions, a clear correlation emerges, implying that expansion-driven processes begin to play a significant role in generating turbulence. We therefore propose an evolutionary transition in the primary turbulence mechanisms, from being dominated by stellar winds and radiation to being increasingly influenced by expansion-driven dynamics, during the evolution of HII regions. Considering the small sample size used in this work, particularly the inclusion of only two young HII regions, which also have large uncertainties in their expansion velocities, further confirmation of this interpretation will require higher-resolution 2D spectroscopy to resolve blended kinematic components along the line of sight for more accurate estimation of expansion velocities, along with an expanded sample that specifically includes more young HII regions.",
      "pdf_url": "https://arxiv.org/pdf/2601.22656.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.13678",
      "title": "AT 2025abao: the fourth luminous red nova in M 31",
      "authors": [
        "A. Reguitti",
        "A. Pastorello",
        "G. Valerin",
        "F. D. Romanov",
        "A. Siviero",
        "Y.-Z. Cai",
        "S. Ciroi",
        "N. Elias-Rosa",
        "T. Iijima",
        "E. Kankare",
        "N. Koivisto",
        "T. Kravtsov",
        "E. Mason",
        "K. Matilainen",
        "A. C. Mura",
        "P. Ochner",
        "T. M. Reynolds",
        "M. D. Stritzinger"
      ],
      "abstract": "AT 2025abao: the fourth luminous red nova in M 31 A. Reguitti, A. Pastorello, G. Valerin, F. D. Romanov, A. Siviero, Y.-Z. Cai, S. Ciroi, N. Elias-Rosa, T. Iijima, E. Kankare, N. Koivisto, T. Kravtsov, E. Mason, K. Matilainen, A. C. Mura, P. Ochner, T. M. Reynolds, M. D. Stritzinger 12 pages, 16 figures, submitted to A&A Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We present photometric and spectroscopic observations of luminous red nova (LRN) AT 2025abao, the fourth discovered in M 31. The LRN, associated to the AGB star WNTR23bzdiq, was discovered during the fast rise following the minimum phase. It reached the peak at $g=15.1$ mag ($M_g=-9.5\\pm0.1$ mag), and then it settled onto a long-duration plateau in the red bands, lasting 70 days, while it was slowly linearly declining in the blue bands. The object showed similarities at peak with the canonical LRNe V838 Monocerotis, V1309 Scorpii, and with the faint and fast-evolving AT 2019zhd, the third LRN in M31, though the later evolution is different. Spectroscopically, AT 2025abao evolved as a canonical LRN: the early spectra present a blue continuum with narrow Balmer lines in emission; at peak, the spectral continuum has cooled to a yellow colour, with a photospheric temperature of 6000 K. Balmer lines have weakened while absorption lines from metals (Fe I, Fe II, Sc II, Ba II, Ti II) have developed, and in particular broad (FWHM$\\sim$700 km/s) from the UV Ca II H&K lines. Medium- and high-resolution spectra reveal a counter-P Cygni absorption profile in H$\\alpha$. Finally, late time spectra show an orange continuum ($T\\sim$4000-5000 K), a return in strength of the Balmer lines and the formation of molecular absorption bands. AT 2025abao is the rare case of a LRN with detailed archival information regarding the progenitor system. For the first time, we obtained the spectral energy distribution in the infrared of the precursor of a LRN, which is consistent with that of an M giant/AGB. We propose that the dichotomy of light curve behaviour in LRNe (two peaks vs. plateau) can be explained by the extent and H-richness of the common envelope.",
      "pdf_url": "https://arxiv.org/pdf/2602.13678.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21289",
      "title": "Testing models for fully and partially stripped low-mass stars with Gaia: Implications for hot subdwarfs, binary RR Lyrae, and black hole impostors",
      "authors": [
        "Pranav Nagarajan",
        "Kareem El-Badry",
        "Alexey Bobrick",
        "Giuliano Iorio",
        "Francisco Molina",
        "Joris Vos",
        "Maja Vučković"
      ],
      "abstract": "Testing models for fully and partially stripped low-mass stars with Gaia: Implications for hot subdwarfs, binary RR Lyrae, and black hole impostors Pranav Nagarajan, Kareem El-Badry, Alexey Bobrick, Giuliano Iorio, Francisco Molina, Joris Vos, Maja Vučković 22 pages, 11 figures, Submitted to PASP Solar and Stellar Astrophysics (astro-ph.SR) When low-mass ($\\lesssim 2$ $M_{\\odot}$) red giants lose their envelopes to a companion just before the helium flash, the resulting mass transfer can produce binaries hosting hot subdwarfs, horizontal branch stars, and undermassive red clump stars. Recent work predicts a continuum of such products, from fully stripped hot subdwarfs to partially stripped horizontal branch and red clump stars, and suggests that young, metal-rich RR Lyrae can form when partial stripping leaves a helium-burning star in the instability strip. To enable direct comparison with observations, we model these binaries in a simulated Milky Way-like galaxy with a realistic metallicity-dependent star formation history and 3D dust map, generate epoch astrometry using Gaia's scanning law, and fit it with the cascade of astrometric models applied in Gaia DR3. We compare the simulated population to DR3 observations of hot subdwarfs, RR Lyrae, and red giants with high astrometric mass functions. The model significantly overpredicts the number of hot subdwarfs with astrometric binary solutions, partly because the predicted flux ratios are more unequal than observed. It also predicts $\\gtrsim 100$ RR Lyrae with DR3 astrometric orbital solutions, while none are observed. We conclude that RR Lyrae in au-scale binaries may be substantially rarer than predicted. In contrast, the model plausibly explains the population of red clump stars with high astrometric mass functions, which we interpret as potential black hole impostors. We predict that $\\sim 10 \\times$ more stripped-star binaries will be detectable in DR4, whose sensitivity to longer periods will more strongly test wide-orbit systems.",
      "pdf_url": "https://arxiv.org/pdf/2602.21289.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21413",
      "title": "Calibration of the [C/N] and [Y/Mg] chemical clocks with asteroseismic ages from the TESS space mission",
      "authors": [
        "E. Pakštienė",
        "G. Tautvaišienė",
        "V. Bagdonas",
        "H. Kjeldsen",
        "M.L. Winther",
        "A. Drazdauskas",
        "C. Viscasillas Vázquez",
        "Y. Chorniy",
        "Š. Mikolaitis",
        "R. Minkevičiūtė",
        "E. Stonkutė"
      ],
      "abstract": "Calibration of the [C/N] and [Y/Mg] chemical clocks with asteroseismic ages from the TESS space mission E. Pakštienė, G. Tautvaišienė, V. Bagdonas, H. Kjeldsen, M.L. Winther, A. Drazdauskas, C. Viscasillas Vázquez, Y. Chorniy, Š. Mikolaitis, R. Minkevičiūtė, E. Stonkutė Solar and Stellar Astrophysics (astro-ph.SR) Context. Stellar ages are typically very difficult to estimate for field stars. New empirical methods, based on abundance ratios of chemical elements, are emerging and need to be calibrated. Aims. Our main aim is to contribute to revealing relations between [C/N] and [Y/Mg] ratios and stellar ages by determining astroseismic ages and non-local thermodynamic equilibrium (NLTE) abundances, and accounting for stellar evolutionary stages and birth places in the Galaxy. Methods. We searched for solar pulsations in a sample of 1250 bright F, G, and K giants using data from the TESS space telescope and determined asteroseismic ages using the BASTA and PARAM codes. For the [Y/Mg] relations with age, we determined abundances accounting for deviations from the local thermodynamic equilibrium. For the [C/N] relations with age, we separated stars according to their evolutionary stages. Results. We determined asteroseismic ages for 218 giants and derived [Y/Mg] and [C/N] relations with age for subsamples of stars in three regions of the Galactic thin disc and the thick disc. Conclusions. The [Y/Mg]-age relation exhibits a clear radial dependence across the Galactic disc, with a steeper trend in the outer disc, progressively flatter relations towards the inner disc, and a very flat trend in the thick disc. NLTE abundances of Mg and especially of Y have to be used in order to obtain a more precise stellar age evaluation from [Y/Mg] ratios. When using [C/N] abundance ratios as stellar age indicators, evolutionary stages of stars have to be taken into account.",
      "pdf_url": "https://arxiv.org/pdf/2602.21413.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21683",
      "title": "Retarded Stellar Dynamo in Tidally Deformed M Dwarfs",
      "authors": [
        "Song Wang",
        "Wenbo Li",
        "Henggeng Han",
        "Dali Kong",
        "Jifeng Liu",
        "Xinlin Zhao"
      ],
      "abstract": "Retarded Stellar Dynamo in Tidally Deformed M Dwarfs Song Wang, Wenbo Li, Henggeng Han, Dali Kong, Jifeng Liu, Xinlin Zhao 7 figures and 1 table in main text; 5 tables and 1 figure in supplement. Accepted by SCPMA Solar and Stellar Astrophysics (astro-ph.SR) Current studies of stellar dynamos primarily focus on spherical stars, leaving their behavior in distorted stars largely unexplored. We utilize stars of varying distortions to examine the relation between stellar cycle periods ($P_{\\rm cyc}$) and rotational periods ($P_{\\rm rot}$), which are closely linked to dynamo processes. By analyzing a sample of tidally distorted M dwarfs in cataclysmic variables, we identify an anti-correlation between $P_{\\rm cyc}$ and $P_{\\rm rot}$, in contrast to the lack of such a relation in single M dwarfs. This means that stars with greater deformation have longer cycle periods, suggesting variations in dynamo behavior under non-spherical geometries. Our numerical simulations further reveal that, the thermal convection weakens in highly distorted stars, and subsequently, the differential rotation is also reduced. These effects may lengthen the conversion timescale between poloidal and toroidal magnetic fields, potentially explaining the newly discovered $P_{\\rm cyc}$-$P_{\\rm rot}$ relation in cataclysmic variables.",
      "pdf_url": "https://arxiv.org/pdf/2602.21683.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21725",
      "title": "Is Mira B a low mass white dwarf?",
      "authors": [
        "R. K. Zamanov",
        "V. Irincheva",
        "B. Spassov",
        "A. Kurtenkov",
        "D. Marchev",
        "M. Minev",
        "M. F. Bode",
        "L. Dankova",
        "B. Borisov",
        "M. Dechev",
        "G. Yordanova"
      ],
      "abstract": "Is Mira B a low mass white dwarf? R. K. Zamanov, V. Irincheva, B. Spassov, A. Kurtenkov, D. Marchev, M. Minev, M. F. Bode, L. Dankova, B. Borisov, M. Dechev, G. Yordanova Solar and Stellar Astrophysics (astro-ph.SR) We report photometric observations in Johnson B and V bands of the short term variability (flickering) of Mira (omicron Ceti). The observations were performed during 7 nights in the period August - October 2025, in the course of the last minimum of the Mira pulsations. The observed peak-to-peak amplitude of the flickering is 0.11-0.28 mag in B band. For the flickering source we find luminosity in the range 0.10-0.46 L_sun. Using the amplitude-flux relation, we estimate an average luminosity of the accretion disc L_d = 0.91 +/- 0.28 L_sun. Assuming that the white dwarf accretes material through Wind Roche Lobe Overflow (WRLOF), we find that Mira B is a low mass white dwarf with M_wd = 0.24 +/- 0.04 M_sun accreting at a rate 6.8x10^{-9} M_sun/yr. This value of the mass is in the range of the extremely low mass white dwarfs. The data are available on Zenodo: this http URL",
      "pdf_url": "https://arxiv.org/pdf/2602.21725.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21726",
      "title": "Sub-second cadence structure of optical flares on AD Leo",
      "authors": [
        "B. Schmercz",
        "B. Seli",
        "K. Vida",
        "L. Kriskovics",
        "A. Görgei",
        "K. Oláh",
        "Zs. Regály"
      ],
      "abstract": "Sub-second cadence structure of optical flares on AD Leo B. Schmercz, B. Seli, K. Vida, L. Kriskovics, A. Görgei, K. Oláh, Zs. Regály 10 pages, 8 figures accepted to A&A Solar and Stellar Astrophysics (astro-ph.SR) Stellar flares are sudden brightenings caused by magnetic reconnection and are frequently observed on late-type stars. High-cadence photometry of flares provides valuable insights into the mechanisms of these events, yet such observations remain scarce. We seek to explore the sub-second fine structure of stellar flares and assess the information content in high-speed photometry. New 0.3 s-cadence photometry from a six-year-long observing campaign of the active M-dwarf AD Leo is presented. We use time--frequency analysis to detect quasi-periodic pulsations in the decay phase of flares. We explore statistical measures of time series complexity of the detected flares to quantify the information gain achievable with high-cadence photometry. We detect 42 flares in 211 hours of observations. The flare frequency distribution is consistent with the previous literature. We find no quasi-periodic pulsations with periods below a few seconds, and identify two candidate signals with periods around 1 and 3 min. Using different measures of complexity on the binned flare light curves we confirm the advantages of high observing cadence. However, we also find a plateau up to a binning of ~4--5 s for a few complex flares, suggesting that an exposure time of a few seconds is usually enough to retain most of the information carried by a single-filter observation. New photometric observations of AD Leo revealed sub-structures of flare light curves on the timescale of a few seconds, but we found no features on timescales below that.",
      "pdf_url": "https://arxiv.org/pdf/2602.21726.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21850",
      "title": "The accretion discs in WZ Sge-type stars in deep quiescence. How do they outburst?",
      "authors": [
        "Vitaly Neustroev",
        "Paula Kvist",
        "Miikka Siitonen",
        "Veera Vuolteenaho"
      ],
      "abstract": "The accretion discs in WZ Sge-type stars in deep quiescence. How do they outburst? Vitaly Neustroev, Paula Kvist, Miikka Siitonen, Veera Vuolteenaho 16 pages (+4 pages of references). This paper is based on a talk presented at the 87th Fujihara Seminar: The 50th Anniversary Workshop of the Disk Instability Model in Compact Binary Stars, held on 22-26 September 2025 in Tomakomai, Japan. To be published in the Proceedings of Science this https URL Solar and Stellar Astrophysics (astro-ph.SR) WZ Sge-type stars are an extreme subclass of dwarf novae characterised by very rare, large-amplitude superoutbursts. Within the disc instability model (DIM), such events are explained as being triggered by enhanced mass transfer from the donor star. We present an analysis of observations of a sample of WZ Sge-type systems in deep quiescence to assess the consistency of DIM predictions with their observed properties. We find that accretion discs in quiescent WZ Sge-type systems have very low mass-accretion rates of a few $\\times$$10^{-13}$ M$_\\odot$ yr$^{-1}$. The discs are entirely optically thin, and their physical conditions -- such as surface density and effective temperature -- remain well below the DIM thresholds required to trigger an outburst. Observationally, no increase in disc brightness is detected prior to the superoutburst, indicating the absence of a transition to an optically thick state, in contrast to DIM predictions of a gradual disc thickening preceding the instability. We therefore find no observational evidence that superoutbursts in WZ Sge-type systems are triggered by enhanced mass transfer from the donor. Furthermore, the inferred mass-transfer rates in these objects ($\\dot{M}_{\\rm tr}$~5$\\times$$10^{-12}$ M$_\\odot$ yr$^{-1}$) are at least an order of magnitude lower than commonly assumed. We argue that the widely adopted value of $\\dot{M}_{\\rm tr}$ for the prototype object WZ Sge is likely overestimated. Finally, we show that in quiescence the accretion disc radius in all systems is close to the tidal truncation radius and exceeds the 3:1 resonance radius, confirming earlier results and calling into question the standard interpretation of superhump formation.",
      "pdf_url": "https://arxiv.org/pdf/2602.21850.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22007",
      "title": "Spectroscopic study of five Mira stars",
      "authors": [
        "David Boyd"
      ],
      "abstract": "Spectroscopic study of five Mira stars David Boyd Journal of the British Astronomical Association, 136, 1, 37-43 (2026) Solar and Stellar Astrophysics (astro-ph.SR) Mira stars are popular with amateur astronomers because they are generally bright and their pulsations produce large changes in brightness. This also means they are eminently suitable to study using spectroscopy. We report here on spectroscopic observations of five Mira stars: RY Cep, SU Cam, T Cep, V667 Cas and OR Cep. We describe the lifecycle of a Mira star and explain how the carbon-oxygen balance in its atmosphere determines its spectral classification. Atmospheric pulsations in these stars produce shocks which generate Balmer emission. We present graphically their different spectral behaviours and development of emission lines.",
      "pdf_url": "https://arxiv.org/pdf/2602.22007.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.01082",
      "title": "Relationship Between Major Stellar Physical Parameters and Normal Mode Frequencies in Accreting White Dwarf Stars",
      "authors": [
        "Praphull Kumar",
        "Dean M. Townsley",
        "Hunter Anz"
      ],
      "abstract": "Relationship Between Major Stellar Physical Parameters and Normal Mode Frequencies in Accreting White Dwarf Stars Praphull Kumar, Dean M. Townsley, Hunter Anz 14 pages, 14 figures, and 1 table. Published in the Open Journal of Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) White dwarfs (WDs) are the final fate of about 97\\% of the stars in our galaxy, making them vital tracers of stellar history. A fraction of WDs exist in cataclysmic variable (CV) systems, accreting matter from a nearby companion star. A subset of CVs undergo episodic rapid mass transfer, termed dwarf novae (DNe) outbursts. Some accreting WDs exhibit near sinusoidal photometric variations, interpreted as $g$ mode pulsations. However, identifying pulsation modes in accreting WDs remains challenging due to the paucity of available observed modes. In this work, we present a comprehensive computation of the observable $g$ mode frequencies across a range of WD parameters, varying the WD mass, size of the newly accreted layer and core temperature. We also introduce a novel method for mode identification based on the time evolution of pulsation periods following an accretion episode. Our mode identification method does not rely on the direct detection of the consecutive radial mode orders, frequently required in isolated WDs. Moreover, this work improves upon our previous WD modeling efforts. We use a more realistic core temperature in addition to thermohaline mixing and element diffusion enabled during the accretion phase.",
      "pdf_url": "https://arxiv.org/pdf/2512.01082.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.06083",
      "title": "A Test of Substellar Evolutionary Models with High-Precision Ages from Asteroseismology and Gyrochronology for the Benchmark System HR 7672AB",
      "authors": [
        "Yaguang Li",
        "Michael C. Liu",
        "Trent J. Dupuy",
        "Daniel Huber",
        "Jingwen Zhang",
        "Daniel Hey",
        "R.R. Costa",
        "Jens Reersted Larsen",
        "J. M. Joel Ong",
        "Sarbani Basu",
        "Travis S. Metcalfe",
        "Yixiao Zhou",
        "Jennifer van Saders",
        "Timothy R. Bedding",
        "Marc Hon",
        "Hans Kjeldsen",
        "Tiago L. Campante",
        "Mário J. P. F. G. Monteiro",
        "Mia Sloth Lundkvist",
        "Mark Lykke Winther",
        "Ashley Chontos",
        "Nicholas Saunders",
        "Theron W. Carmichael",
        "Antonin Bouchez",
        "Carlos Alvarez",
        "Samuel A. U. Walker",
        "Aldo G. Sepulveda",
        "Howard Isaacson",
        "Andrew W. Howard",
        "Steven R. Gibson",
        "Samuel Halverson",
        "Kodi Rider",
        "Arpita Roy",
        "Ashley D. Baker",
        "Jerry Edelstein",
        "Chris Smith",
        "Benjamin J. Fulton",
        "Josh Walawender"
      ],
      "abstract": "A Test of Substellar Evolutionary Models with High-Precision Ages from Asteroseismology and Gyrochronology for the Benchmark System HR 7672AB Yaguang Li, Michael C. Liu, Trent J. Dupuy, Daniel Huber, Jingwen Zhang, Daniel Hey, R.R. Costa, Jens Reersted Larsen, J. M. Joel Ong, Sarbani Basu, Travis S. Metcalfe, Yixiao Zhou, Jennifer van Saders, Timothy R. Bedding, Marc Hon, Hans Kjeldsen, Tiago L. Campante, Mário J. P. F. G. Monteiro, Mia Sloth Lundkvist, Mark Lykke Winther, Ashley Chontos, Nicholas Saunders, Theron W. Carmichael, Antonin Bouchez, Carlos Alvarez, Samuel A. U. Walker, Aldo G. Sepulveda, Howard Isaacson, Andrew W. Howard, Steven R. Gibson, Samuel Halverson, Kodi Rider, Arpita Roy, Ashley D. Baker, Jerry Edelstein, Chris Smith, Benjamin J. Fulton, Josh Walawender 31 pages, 16 figures, accepted by ApJ, comments welcome Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) We present high-precision measurements for HR~7672AB, composed of a Sun-like (G0V) star and an L~dwarf companion. Three nights of precise (70 cm/s) radial velocity (RV) asteroseismology with the Keck Planet Finder clearly detect 5-minute oscillations from the primary HR~7672A, and modeling of the frequency spectrum yields an asteroseismic age of $1.87\\pm0.65$~Gyr. We also determine a gyrochronological age of $2.58\\pm0.47$~Gyr, and we combine these two results for a final age of $2.26\\pm0.40$~Gyr. In addition, we obtained new RVs for HR~7672A and new astrometry for the companion HR~7672B. From a joint orbit fit, we measured a dynamical mass of $1.111\\pm0.017$~$\\text{M}_\\odot$ for HR~7672A and $75.39\\pm0.67$~$\\text{M}_{\\text{Jup}}$ for HR~7672B. This places the companion near the stellar/substellar boundary and thus particularly sensitive to differences in model predictions. The joint precision in host star age (18\\% uncertainty) and companion mass (0.9\\% uncertainty) makes HR~7672AB an exceptional substellar benchmark. Combined with the companion's luminosity, we use these measurements to test predictions from six brown dwarf cooling models. The best agreement occurs with the Chabrier et al. (2023) models, which incorporate a new equation of state, resulting in predictions that agree within $<$0.3$\\sigma$ with all the observations. The other 5 sets of models agree at the 1--3$\\sigma$ level depending on the particular test, and some models struggle to predict a sufficient low luminosity for HR~7672B at any age given its dynamical mass. We also detected a weak seismic signal in near-simultaneous TESS photometry of HR~7672A, with the resulting RV-to-photometry oscillation amplitude ratio consistent with solar values.",
      "pdf_url": "https://arxiv.org/pdf/2512.06083.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11376",
      "title": "Varying core-envelope coupling efficiency identified from stellar rotation--activity relation",
      "authors": [
        "Henggeng Han",
        "Song Wang",
        "Huiqin Yang",
        "Xue Li",
        "Chuanjie Zheng",
        "Xiangyu Li",
        "Cunshi Wang",
        "Jifeng Liu"
      ],
      "abstract": "Varying core-envelope coupling efficiency identified from stellar rotation--activity relation Henggeng Han, Song Wang, Huiqin Yang, Xue Li, Chuanjie Zheng, Xiangyu Li, Cunshi Wang, Jifeng Liu Solar and Stellar Astrophysics (astro-ph.SR) Core-envelope coupling provides a reasonable explanation of the spin-down stalling of stars in open clusters, which was not predicted by classical gyrochronology. However, it remains an open question whether the coupling efficiency is constant or variable. M dwarfs, possessing thicker convective envelopes and thus longer coupling timescales than other late-type stars, are ideal objects for this investigation. In this work, based on the $R_{\\rm{HK}}^{'}$ measurements from LAMOST and DESI spectra, we construct new rotation--activity relations for M dwarfs. Unlike the traditional picture, we suggest that the new relation consists of three distinct regimes of fast, intermediate, and slow rotation, closely matching the three sequences of gyrochronology, namely the ``Convective'' sequence, ``Gap'', and ``Interface'' sequence. Our study reveals, for the first time, a variable activity decay rate in the intermediate-rotation regime (i.e., the ``Gap'' region). This implies a varying core-envelope coupling efficiency, peaking towards the end of this region. It also coincides with the well-known stage of stalled stellar spin-down.",
      "pdf_url": "https://arxiv.org/pdf/2512.11376.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.07137",
      "title": "Assessment of DKIST/VTF Capabilities for the Detection of Local Acoustic Source Wavefronts",
      "authors": [
        "Corinne Morrell",
        "Mark P. Rast",
        "Shah Mohammad Bahauddin",
        "Ivan Milić"
      ],
      "abstract": "Assessment of DKIST/VTF Capabilities for the Detection of Local Acoustic Source Wavefronts Corinne Morrell, Mark P. Rast, Shah Mohammad Bahauddin, Ivan Milić Solar and Stellar Astrophysics (astro-ph.SR) Recent studies have demonstrated that temporal filtering can successfully identify local-acoustic-source wavefronts in radiative magnetohydrodynamic simulations of the solar photosphere. Extending this capability to observations promises new insight into the stochastic excitation of solar p-modes, the source depth distribution below the photosphere, and the dominant physical processes underlying acoustic wave excitation. Such measurements would also enable improved characterization of the complex wavefield in the lower chromosphere and open the possibility of ultra-local helioseismic diagnostics. In this work, we assess an observational strategy for the detection of local acoustic wavefronts on the Sun using the Visible Tunable Filter (VTF) instrument on the National Science Foundation's Daniel K. Inouye Solar Telescope (DKIST). Because wavefront identification requires high spatial and temporal resolution and is limited by the small amplitudes of the wave perturbations, we focus on identifying specific wavelength combinations within spectral lines that maximize the sensitivity to the wave signal. Under the cadence and spectral resolution constraints of DKIST/VTF observations and for the particular simulated wavefront we examine, this approach suggests two possible strategies: fast monochromatic imaging at 6302.425 A, or ordered interleaved observations in the blue wing of either the Fe I 6302.5 A or Fe I 5250.6 A line (between 6302.419 A and 6302.465 A, or between 5250.579 A and 5250.607 A respectively).",
      "pdf_url": "https://arxiv.org/pdf/2602.07137.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22194",
      "title": "Electrical coupling of a horizontal dipole antenna to a dielectric half-space: applications to radio astronomy from the lunar surface",
      "authors": [
        "Kaja M. Rotermund",
        "Aritoki Suzuki",
        "Stuart D. Bale",
        "Anže Slosar"
      ],
      "abstract": "Electrical coupling of a horizontal dipole antenna to a dielectric half-space: applications to radio astronomy from the lunar surface Kaja M. Rotermund, Aritoki Suzuki, Stuart D. Bale, Anže Slosar Instrumentation and Methods for Astrophysics (astro-ph.IM) The far side of the Moon, shielded from terrestrial radio frequency interference and beyond the influence of Earth's ionosphere, should offer a uniquely quiet environment for radio astronomy and cosmological experiments. The radio sky below 30 MHz is largely unexplored and is thought to contain spectral signatures of new physics in the early, high-redshift Universe. Achieving precision measurements in this band requires accurate understanding of antenna performance and systematics. For upcoming lunar surface radio astronomy missions, this modeling will be challenging because antennas will deploy at heights that are only a small fraction of a wavelength above the lunar regolith, where strong coupling between the antenna and the surface can significantly alter impedance, radiation patterns, and efficiency. The challenge is compounded by the layered dielectric structure of the regolith and the tendency for permittivity to increase with depth, both of which are difficult to represent faithfully in numerical simulations. In this work, we review theoretical predictions for the behavior of a simple horizontal dipole above a dielectric half-space, representing the lunar regolith, and compare them with simulation results obtained using the Ansys HFSS integral equation solver. We quantify how the antenna impedance and beam pattern couple to the sky for a representative lunar surface radio astronomy experiment. The results show that surface induced effects decrease rapidly, even for modest increases in antenna height above the regolith. Conversely, a dipole antenna placed on or very near the lunar surface will exhibit complex spectral response that renders systematics control very difficult without detailed information on regolith properties.",
      "pdf_url": "https://arxiv.org/pdf/2602.22194.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.14407",
      "title": "QUIJOTE-TFGI polarization calibration -- Ground characterization and on-sky validation with Tau A and the Moon",
      "authors": [
        "Alessandro Fasano",
        "Mateo Fernández-Torreiro",
        "Guillermo Pascual-Cisneros",
        "Roger John Hoyland",
        "Francisco Javier Casas-Reinares",
        "Ricardo Tanausú Génova-Santos",
        "Michael William Peel",
        "Rafael Rebolo-López",
        "José Alberto Rubiño-Martín"
      ],
      "abstract": "QUIJOTE-TFGI polarization calibration -- Ground characterization and on-sky validation with Tau A and the Moon Alessandro Fasano, Mateo Fernández-Torreiro, Guillermo Pascual-Cisneros, Roger John Hoyland, Francisco Javier Casas-Reinares, Ricardo Tanausú Génova-Santos, Michael William Peel, Rafael Rebolo-López, José Alberto Rubiño-Martín 20 pages, 16 figures, submitted to A&A Instrumentation and Methods for Astrophysics (astro-ph.IM) Our objective is to characterize the QUIJOTE Thirty and Forty GHz instrument (TFGI), calibrate it with a reference calibration signal on the ground, compare our results with on-sky calibration based on bright sources, and study the stability of the calibration parameters over time. First, from the ground, we fit the data using a reference calibration signal (a diode) introduced to resolve degeneracies among the various instrument angles. Finally, we utilize on-sky observations of Tau A and the Moon to validate the results. By creating calibration datasets obtained with the reference diode, we evaluate the data quality and quantify phase switch errors to account for the fine polarization response. We also utilize Tau A and Moon observations to calibrate the system's response and stability over time. In addition, we calculate the refraction index of the Moon to be $n_{Moon}$ = 1.209 $\\pm$ 0.007 (stat) $\\pm$ 0.005 (sys) at 31 GHz under smooth-surface assumption. The results from fitting the instrument phase-switch error angle align with 0 deg at 2$\\sigma$ precision, indicating that no further correction is required within a few percent precision. The calibrations with astrophysical sources (Tau A and the Moon) yield consistent results that constrain the polarization angle and responsivity. The polarization efficiency aligns well with ground measurements and the Tau A characterization, whereas the Moon-based calibration is more affected by systematics. We find hints of responsivity variations over time, although the relative responsivity between channels is found to remain stable. In the future, we conclude that installing a live calibrator will enhance performance by continuously monitoring responsivity and, in turn, improving the mitigation of systematic effects.",
      "pdf_url": "https://arxiv.org/pdf/2512.14407.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21349",
      "title": "Rattle-and-Break: the Impact of Planetesimal Scattering on Super-Earth Resonant Chains",
      "authors": [
        "Sam Hadden",
        "Yanqin Wu"
      ],
      "abstract": "Rattle-and-Break: the Impact of Planetesimal Scattering on Super-Earth Resonant Chains Sam Hadden, Yanqin Wu Earth and Planetary Astrophysics (astro-ph.EP) The spacings of super-Earths in multi-transiting systems exhibit a distribution that is broad and mostly featureless, with the exception of notable excesses of planet pairs situated a few percent wide of first-order mean motion resonances (MMRs). In this work, we extend the so-called \"breaking-the-chains\" model to account for both of these characteristics. Assuming that super-Earths are settled into stable chains of resonances after disk-driven migration, we show that scattering a planetesimal population that contains only a few percent of a system's mass can reorganize primordial chains in remarkable ways. The planetesimal scattering \"rattles\" the chains by repelling adjacent planet pairs wide of their initial MMRs. Some chains remain rattled but otherwise intact and make up the observed excesses wide of MMRs. In other systems, however, this initial rattling sows the seeds of later orbital instabilities that break the chains entirely. If individual planetesimals' masses are of order a Pluto mass or so, the onset of these instabilities can occur tens or hundreds of Myr after birth, naturally explaining the apparent disappearance of near-resonant pairs on this timescale. The origin of such Pluto-mass debris is currently unknown.",
      "pdf_url": "https://arxiv.org/pdf/2602.21349.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21400",
      "title": "Formation of Water-rich Giant Planet Satellites at Decretion Disk Ice Lines",
      "authors": [
        "Teng Ee Yap",
        "David J. Stevenson"
      ],
      "abstract": "Formation of Water-rich Giant Planet Satellites at Decretion Disk Ice Lines Teng Ee Yap, David J. Stevenson Yap, T. E., & Stevenson, D. J. (2026). Formation of Water-rich Giant Planet Satellites at Decretion Disk Ice Lines. The Planetary Science Journal, 7(2), 44 Earth and Planetary Astrophysics (astro-ph.EP) The volatile budgets of giant planet satellites are critical to unraveling the origin of their building blocks within the circumplanetary disks that hosted them. The Galilean moons Ganymede and Callisto, as well as the Saturnian moon Titan, are known to be anomalously water rich on the basis of their mean densities and interior models informed by gravity data from Galileo and Cassini, characterized by ice-to-rock ratios around unity. Here, we show that the water-ice sublimation line in a decreting circumplanetary disk lends itself to the formation of a water-rich solid reservoir, serving as a natural site for the birthplace of icy satellites. Fundamentally, this reflects how interior to the ice line, water vapor is advected outward, while beyond it, water ice drifts inward as pebbles. Using a semi-analytic model for dust and vapor evolution, we simulate vapor and ice accumulation at the ice line, showing that solids just beyond it achieve steady-state ice-to-rock ratios a factor of a few higher than elsewhere in the disk. For typical disk parameters, this ice buildup occurs within a timescale of a few thousand years. We propose this as a first-order process that explains, at least to some extent, the compositions of three aforementioned satellites. We explore the impact of uncertain turbulence parameters on our results, namely the turbulent Schmidt number and Shakura-Sunyaev alpha, before discussing them in the context of icy satellite D/H ratios. We conclude by evaluating alternative scenarios for explaining water-rich satellites, based on the conversion of CO to CH4, with water as a by-product.",
      "pdf_url": "https://arxiv.org/pdf/2602.21400.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.21912",
      "title": "Tidal disruptions of rubble piles: The case of Phobos",
      "authors": [
        "Harrison Agrusa",
        "Patrick Michel"
      ],
      "abstract": "Tidal disruptions of rubble piles: The case of Phobos Harrison Agrusa, Patrick Michel Published in A&A. For published version and associated movie, see this https URL Earth and Planetary Astrophysics (astro-ph.EP) Many small satellites in the Solar System have sub-synchronous orbits, meaning their orbits are decaying due to tidal dissipation. Unless they have substantial material strength, they will eventually tidally disrupt before reaching their planet's surface. We studied the fate of rubble-pile satellites as they migrate inward, with a particular focus on the case of Phobos. We used a combination of analytic estimates and numerical simulations to determine the failure mode and tidal disruption distance of a Phobos-like satellite, as a function of its shape and cohesive strength. Both analytically and numerically, we identify a regime for satellites with low cohesive strengths whereby their surface can be tidally stripped without undergoing internal failure. Our numerical simulations demonstrate that Phobos will be destroyed beyond 2 Mars radii if it has a bulk strength similar to those estimated for small bodies recently visited by spacecraft. Based on our results and some additional arguments, we suggest that previous studies on the fate of Phobos have overestimated its strength, and therefore underestimated its tidal disruption distance. We also speculate that if Phobos undergoes some tidal stripping, its ultimate fate may be determined by runaway collisional erosion rather than a pure tidal disruption. However, the ultimate tidal disruption distance for Phobos will depend on its unknown internal structure and bulk material properties, which will be constrained by JAXA's Martian Moons eXploration (MMX) mission and its IDEFIX rover. These results have implications for theories about the origin and evolution of the Martian moons and for tidal disruptions of other small, irregularly shaped satellites.",
      "pdf_url": "https://arxiv.org/pdf/2602.21912.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22050",
      "title": "Survival of Protoplanetary Disks in Upper Scorpius from Population Synthesis Models with External Photoevaporation",
      "authors": [
        "Jingyi Ping",
        "Rossella Anania",
        "Paola Pinilla",
        "Miguel Vioque"
      ],
      "abstract": "Survival of Protoplanetary Disks in Upper Scorpius from Population Synthesis Models with External Photoevaporation Jingyi Ping, Rossella Anania, Paola Pinilla, Miguel Vioque 17 pages, 19 figures, 3 tables. Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) We present population synthesis models of viscous protoplanetary disks subject to mild external far-ultraviolet (FUV) radiation fields ($F_{\\rm UV}=1\\text{-}100\\,$G$_0$). Our simulations focus on gas disk evolution, exploring stellar masses drawn from an Initial Mass Function and a range of initial disk conditions. We quantify the fraction of surviving disks across $10\\,\\mathrm{Myr}$ of evolution, track the evolution of gas disk mass and size, and compare our results with observations of protoplanetary disks in the Upper Scorpius region, including the ten targets studied by the AGE-PRO ALMA Large Program. We find that models combining viscous evolution with external photoevaporation yield disk lifetimes of $3\\text{-}7\\,\\mathrm{Myr}$, consistent with observed dispersal timescales, particularly for $10^{-4} \\leq \\alpha \\leq 10^{-2}$. Low-mass stars ($0.1\\,$M$_\\odot$) are more susceptible to disk dispersal due to their weaker gravitational binding, with their fraction among all surviving disks dropping from $76\\%$ at birth to $51\\%$ by $10\\,\\mathrm{Myr}$. The majority of the long-lived disks are those with low viscosity $\\alpha < 10^{-3.5}$ and initial characteristic radius $R_c < 125\\,\\mathrm{AU}$, while the initial disk-to-star mass ratio does not play an important role. The median gas disk mass and radius of the surviving disks exhibit a sharp decline in the first $0.2\\,\\mathrm{Myr}$ of evolution, followed by a slight increase that reflects survivorship bias. We also explore correlations between gas disk mass and size vs. stellar mass and FUV strength. Our findings highlight the critical role of external photoevaporation in shaping disk populations even at moderate levels of FUV radiation fields.",
      "pdf_url": "https://arxiv.org/pdf/2602.22050.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.22180",
      "title": "Exocometary physics: material release and tails",
      "authors": [
        "Théo Vrignaud",
        "Dennis Bodewits",
        "Jake Hanlon",
        "Matthew M. Knight",
        "Tim D. Pearce",
        "Daryl Zeligman",
        "Dimitri Veras",
        "Geraint H. Jones"
      ],
      "abstract": "Exocometary physics: material release and tails Théo Vrignaud, Dennis Bodewits, Jake Hanlon, Matthew M. Knight, Tim D. Pearce, Daryl Zeligman, Dimitri Veras, Geraint H. Jones Accepted for publication in Space Science Reviews. Chapter written for the the workshop 'Exocomets: Bridging our Understanding of Minor Bodies in Solar and Exoplanetary Systems' (July 2024), at the International Space Science Insitute (ISSI), Bern Earth and Planetary Astrophysics (astro-ph.EP) Despite decades of observations, the physical processes governing mass loss from small bodies beyond our Solar System remain poorly constrained. These exocomets are often treated as analogs of Solar System comet, yet the stellar environments they inhabit spans a wide range in terms of luminosity, stellar winds, and evolutionary stage, leading to potentially very diverse physical behaviors. Within our Solar System, small bodies lose material through a range of mechanisms, including sublimation, desorption, impacts, and/or sputtering. Once released, the composition and dynamics of the ejecta are then altered by additional processes, such as dust sublimation, ionization, and radiation pressure. In extrasolar systems, these mechanisms unfold under vastly different radiative and plasma conditions, leading to a rich diversity of mass-loss pathways and observable signatures. This work reviews our understanding of the mechanisms driving mass loss from small bodies and the subsequent evolution of ejecta in diverse stellar environments. We compare the physical and chemical mechanisms that drive gas and dust production, and investigate how they scale with stellar luminosity, temperature, and activity. We then examine the processes that modify the composition of the ejecta (e.g., dust sublimation, dissociation, or ionisation) and its dynamics (e.g., radiation pressure or stellar winds). To illustrate how these processes vary across different stellar environments, we use four well-studied planetary systems as case studies: the Sun, $\\beta$ Pictoris, AU Microscopii, and WD 1145+017. By exploring how cometary tails behave under such diverse conditions, this work provides a physical framework for interpreting exocometary activity and sheds light on why A-type stars, such as the famous $\\beta$ Pictoris, are over-represented in the population of exocomet-hosting stars.",
      "pdf_url": "https://arxiv.org/pdf/2602.22180.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.06966",
      "title": "GEMS JWST: Transmission spectroscopy of TOI-5205b reveals significant stellar contamination and a metal-poor atmosphere",
      "authors": [
        "Caleb I. Cañas",
        "Jacob Lustig-Yaeger",
        "Shang-Min Tsai",
        "Simon Müller",
        "Ravit Helled",
        "Dana R. Louie",
        "Giannina Guzmán Caloca",
        "Shubham Kanodia",
        "Peter Gao",
        "Jessica Libby-Roberts",
        "Kevin K. Hardegree-Ullman",
        "Knicole D. Colón",
        "Ian Czekala",
        "Megan Delamer",
        "Te Han",
        "Andrea S.J. Lin",
        "Suvrath Mahadevan",
        "Erin M. May",
        "Joe P. Ninan",
        "Anjali A. A. Piette",
        "Guðmundur Stefánsson",
        "Kevin B. Stevenson",
        "Johanna Teske",
        "Nicole L. Wallack"
      ],
      "abstract": "GEMS JWST: Transmission spectroscopy of TOI-5205b reveals significant stellar contamination and a metal-poor atmosphere Caleb I. Cañas, Jacob Lustig-Yaeger, Shang-Min Tsai, Simon Müller, Ravit Helled, Dana R. Louie, Giannina Guzmán Caloca, Shubham Kanodia, Peter Gao, Jessica Libby-Roberts, Kevin K. Hardegree-Ullman, Knicole D. Colón, Ian Czekala, Megan Delamer, Te Han, Andrea S.J. Lin, Suvrath Mahadevan, Erin M. May, Joe P. Ninan, Anjali A. A. Piette, Guðmundur Stefánsson, Kevin B. Stevenson, Johanna Teske, Nicole L. Wallack 29 pages + appendix, 23 figures including 6 figure sets, 13 tables, data behind the figures will appear in journal, accepted for publication in AJ. Updates from first version: improvements to the spot fitting and associated retrievals. Updates from second version: abstract revised to satisfy journal word limit Earth and Planetary Astrophysics (astro-ph.EP) Recent discoveries of transiting giant exoplanets ($R_p\\gtrsim8\\mathrm{~R_\\oplus}$) around M dwarfs (GEMS) present an opportunity to investigate their atmospheric compositions and explore how such massive planets form around low-mass stars contrary to the prediction from formation models. We present the first transmission spectra of TOI-5205b, a short-period ($P=1.63~\\mathrm{days}$) Jupiter-like planet ($M_p=1.08~\\mathrm{M_J}$ and $R_p=0.94~\\mathrm{R_J}$) orbiting an M4 dwarf ($M_\\star=0.392~\\mathrm{M_\\odot}$, $R_\\star=0.394~\\mathrm{R_\\odot}$). We obtained three transits using the PRISM mode of the JWST Near Infrared Spectrograph (NIRSpec) spanning $0.6-5.3$ um. The data reveal significant stellar contamination that is evident in the light curves as spot-crossing events and in the transmission spectra as a larger transit depth at bluer wavelengths. Atmospheric retrievals demonstrate that stellar contamination from unocculted starspots and faculae is the dominant component of the transmission spectrum at wavelengths $\\lambda\\lesssim3.0$ um, reducing the sensitivity to the presence of clouds or hazes in our models and preventing detection of $\\mathrm{H_2O}$. The wavelength coverage enabled a robust detection of $\\mathrm{CH_4}$ and $\\mathrm{H_2S}$, which have detectable molecular features between $3.0-5.0$ um. For both clear or cloudy atmospheres, Bayesian retrievals consistently favored an atmosphere with sub-solar metallicity ($3\\sigma$ upper limit of $\\log\\mathrm{[M/H]}\\lesssim-1.24$) and super-solar C/O ratio ($3\\sigma$ lower limit of $\\log\\mathrm{[C/O]}\\gtrsim0.09$), although this may partly be driven by the non-detection of water due to stellar contamination. Planetary interior models predict a bulk metallicity of 10--20\\%, which is larger than the atmospheric metallicity and suggests that the interior of TOI-5205b is decoupled from its atmosphere.",
      "pdf_url": "https://arxiv.org/pdf/2502.06966.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03723",
      "title": "Observational imprints of tidal internal gravity wave dissipation in star-planet systems",
      "authors": [
        "Yaroslav A. Lazovik",
        "Adrian J. Barker"
      ],
      "abstract": "Observational imprints of tidal internal gravity wave dissipation in star-planet systems Yaroslav A. Lazovik, Adrian J. Barker 23 pages, 23 figures. Accepted for publication in MNRAS Earth and Planetary Astrophysics (astro-ph.EP) Tidal interactions play a crucial role in the orbital evolution of close-in star-planet systems. There are numerous manifestations of tides, including planetary orbital migration, breaking resonant chains, tidal heating, orbital circularization, spin-orbit alignment, and stellar and planetary spin synchronization. In the present study, we focus on the dissipation of internal gravity waves within stars. We examine two mechanisms: wave breaking in stars with radiative cores and magnetic wave conversion in stars with convective cores. Applying tidal prescriptions modelling these processes, we demonstrate that the enhanced stellar rotation of both TOI-2458 and GJ 504 can be explained by the previous engulfment of a hot Jupiter caused by gravity wave damping. Furthermore, we show that the observed population of hot Jupiters can be divided into two distinct subsamples: those that are too young for gravity wave dissipation and those where it is ongoing. These subsamples exhibit qualitatively different orbital period distributions: young systems have a uniform distribution, while older systems show a steep decline at short orbital periods. Using a population synthesis approach, we successfully reproduce the main features of the older hot Jupiter sample based on the distribution of the younger systems. According to our estimates, up to 13% of the main-sequence stars within the mass range [0.7,1.5] $M_{\\odot}$ that once hosted a hot Jupiter may have since engulfed it. Our results highlight the key role of internal gravity wave dissipation in shaping the orbital architectures of hot Jupiter systems.",
      "pdf_url": "https://arxiv.org/pdf/2602.03723.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10260",
      "title": "Cold and eccentric: a high-spectral resolution view of 51 Eri b with VLT/HiRISE",
      "authors": [
        "A. Denis",
        "A. Vigan",
        "G. Chauvin",
        "A. Lacquement",
        "H. Beust",
        "M. Ravet",
        "J. Costes",
        "A. Radcliffe",
        "S. Martos",
        "W. Balmer",
        "T. Stolker",
        "P. Palma Bifani",
        "B. Rajpoot",
        "A. Simonnin",
        "S. Petrus",
        "T. Forveille",
        "M. Janson",
        "A. Reiners",
        "N. Godoy",
        "D. Cont",
        "L. Nortmann",
        "K. Hoy",
        "A. Zurlo",
        "H. Anwand-Heerwart",
        "Y. Charles",
        "A. Costille",
        "M. El Morsy",
        "J. Garcia",
        "M. Houllé",
        "M. Lopez",
        "G. Murray",
        "E. Muslimov",
        "G.P.P.L. Otten",
        "J. Paufique",
        "M. Phillips",
        "U. Seemann",
        "A. Viret",
        "G. Zins"
      ],
      "abstract": "Cold and eccentric: a high-spectral resolution view of 51 Eri b with VLT/HiRISE A. Denis, A. Vigan, G. Chauvin, A. Lacquement, H. Beust, M. Ravet, J. Costes, A. Radcliffe, S. Martos, W. Balmer, T. Stolker, P. Palma Bifani, B. Rajpoot, A. Simonnin, S. Petrus, T. Forveille, M. Janson, A. Reiners, N. Godoy, D. Cont, L. Nortmann, K. Hoy, A. Zurlo, H. Anwand-Heerwart, Y. Charles, A. Costille, M. El Morsy, J. Garcia, M. Houllé, M. Lopez, G. Murray, E. Muslimov, G.P.P.L. Otten, J. Paufique, M. Phillips, U. Seemann, A. Viret, G. Zins 9 pages, 8 figures, Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) Discovered almost 10 years ago, the giant planet 51 Eridani b is one of the least separated (0.2 arcsec) and faintest (J = 19.74 mag) directly imaged exoplanets known to date. Its atmospheric properties have been thoroughly investigated through low- and medium-resolution spectroscopic observations, enabling robust characterization of the planet's bulk parameters. However, the planet's intrinsically high contrast renders high-resolution spectroscopic observations difficult, despite their potential to yield key measurements essential for a more comprehensive characterization. This study seeks to constrain the planet's radial velocity, enabling a full 3D orbital solution when integrated with previous measurements. We have obtained 4 high-contrast high-resolution (R = 140000) spectroscopic datasets of the planet, collected over a two-year interval with the HiRISE visitor instrument at the VLT to derive the planet's radial velocity. Using self-consistent models of atmosphere, we were able to derive the radial velocity of the planet at each of the 4 epochs. These radial velocity measurements were then used in combination with all existing relative astrometry in order to constrain the orbit of the planet. Our radial velocity measurements allow us to break the degeneracy along the line of sight, making it now possible the unambiguous interpretation of the phase curve of the companion. We further constrain the orbital parameters, particularly the eccentricity, for which we derive e = 0.55 (-0.07, +0.03). The relatively high eccentricity indicates that the system has experienced dynamical interactions induced by an external perturber. We place constraints on the mass and semi-major axis of a hypothetical, unseen outer planet capable of producing the observed high eccentricities.",
      "pdf_url": "https://arxiv.org/pdf/2602.10260.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}