{
  "date": "2026-02-16",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.CO",
    "astro-ph.IM",
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "total_papers": 111,
  "gw_related_papers": 11,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.00155",
      "title": "aurel: A Python package for automatic relativistic calculations",
      "authors": [
        "Robyn L. Munoz",
        "Christian T. Byrnes",
        "Will J. Roper"
      ],
      "abstract": "aurel: A Python package for automatic relativistic calculations Robyn L. Munoz, Christian T. Byrnes, Will J. Roper 5 pages, aurel available at this https URL To be submitted to JOSS Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); Computational Physics (physics.comp-ph) \\texttt{aurel} is an open-source Python package designed to \\emph{au}tomatically calculate \\emph{rel}ativistic quantities. It uses an efficient, flexible and user-friendly caching and dependency-tracking system, ideal for managing the highly nonlinear nature of general relativity. The package supports both symbolic and numerical calculations. The symbolic part extends \\texttt{SymPy} with additional tensorial calculations. The numerical part computes a wide range of tensorial quantities, such as curvature, matter kinematics and much more, directly from any spacetime and matter data arrays using finite-difference methods. Inputs can be either generated from analytical expressions or imported from Numerical Relativity (NR) simulations, with helper functions provided to read in data from standard NR codes. Given the increasing use of NR, \\texttt{aurel} offers a timely post-processing tool to support the popularisation of this field.",
      "pdf_url": "https://arxiv.org/pdf/2602.00155.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11268",
      "title": "Tango of Titans: Centaurus A and M83 as a Local Group Analog",
      "authors": [
        "David Benisty",
        "Noam Libeskind",
        "Dmitry Makarov"
      ],
      "abstract": "Tango of Titans: Centaurus A and M83 as a Local Group Analog David Benisty, Noam Libeskind, Dmitry Makarov Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Centaurus A (CenA) and M83 form one of the most massive galaxy pairs in the nearby Universe. Although their observed heliocentric velocities suggest motion that is not obviously indicative of mutual attraction, this work presents evidence that CenA and M83 are in fact infalling toward each other, exhibiting a dynamical interaction analogous to the binary-like motion of the Milky Way and Andromeda in the Local Group (LG). Using the Timing Argument (TA), calibrated with analog galaxy pairs from the AbacusSummit simulation, we estimate the total mass of the CenA/M83 system under the assumption that the line-of-sight (LoS) velocity is dominated by motion toward the system's barycenter. This yields a total mass of $(6.36 \\pm 1.30) \\cdot 10^{12}\\, M_\\odot$. The inferred mass agrees well with independent estimates based on virial mass measurements and $K$-band luminosity--to-mass ratios. Together, the consistent bound signature and robust mass determination highlight the CenA/M83 system as a compelling nearby analog to the LG. Further discussion of NGC 4945 as a main perturber (as the Large Magellanic Could) for the CenA is also discussed.",
      "pdf_url": "https://arxiv.org/pdf/2602.11268.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11281",
      "title": "DeepRed: an architecture for redshift estimation",
      "authors": [
        "Alessandro Meroni",
        "Nicolò Oreste Pinciroli Vago",
        "Piero Fraternali"
      ],
      "abstract": "DeepRed: an architecture for redshift estimation Alessandro Meroni, Nicolò Oreste Pinciroli Vago, Piero Fraternali Accepted for publication in Neural Computing and Applications Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); General Relativity and Quantum Cosmology (gr-qc) Estimating redshift is a central task in astrophysics, but its measurement is costly and time-consuming. In addition, current image-based methods are often validated on homogeneous datasets. The development and comparison of networks able generalize across different morphologies, ranging from galaxies to gravitationally-lensed transients, and observational conditions, remain an open challenge. This work proposes DeepRed, a deep learning pipeline that demonstrates how modern computer vision architectures, including ResNet, EfficientNet, Swin Transformer, and MLP-Mixer, can estimate redshifts from images of galaxies, gravitational lenses, and gravitationally-lensed supernovae. We compare these architectures and their ensemble to both neural networks (A1, A3, NetZ, and PhotoZ) and a feature-based method (HOG+SVR) on simulated (DeepGraviLens) and real (KiDS, SDSS) datasets. Our approach achieves state-of-the-art results on all datasets. On DeepGraviLens, DeepRed achieves a significant improvement in the Normalized Mean Absolute Deviation compared to the best baseline (PhotoZ): 55% on DES-deep (using EfficientNet), 51% on DES-wide (Ensemble), 52% on DESI-DOT (Ensemble), and 46% on LSST-wide (Ensemble). On real observations from the KiDS survey, the pipeline outperforms the best baseline (NetZ), improving NMAD by 16% on a general test set without high-probability lenses (Ensemble) and 27% on high-probability lenses (Ensemble). For non-lensed galaxies in the SDSS dataset, the MLP-Mixer architecture achieves a 5% improvement over the best baselines (A3 and NetZ). SHAP shows that the models correctly focus on the objects of interest with over 95% localization accuracy on high-quality images, validating the reliability of the predictions. These findings suggest that deep learning is a scalable, robust, and interpretable solution for redshift estimation in large-scale surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.11281.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI",
        "cs.LG",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11282",
      "title": "Measurement prospects for the pair-instability mass cutoff with gravitational waves",
      "authors": [
        "Matthew Mould",
        "Jack Heinzel",
        "Sofia Alvarez-Lopez",
        "Cailin Plunkett",
        "Noah E. Wolfe",
        "Salvatore Vitale"
      ],
      "abstract": "Measurement prospects for the pair-instability mass cutoff with gravitational waves Matthew Mould, Jack Heinzel, Sofia Alvarez-Lopez, Cailin Plunkett, Noah E. Wolfe, Salvatore Vitale High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) Pair-instability supernovae leave behind no compact remnants, resulting in a predicted gap in the distribution of stellar black-hole masses. Gravitational waves from binary black-hole mergers probe the relevant mass range and analyses of the LIGO-Virgo-KAGRA catalog (GWTC-4) indicate a possible mass cutoff at $40$-$50M_\\odot$. However, the robustness of this result is yet to be tested. To this end, we simulate a comprehensive suite of gravitational-wave catalogs with full Bayesian parameter estimation and analyze them with parametric population models. For catalogs similar to GWTC-4, confident identification of a cutoff is not guaranteed, but GWTC-4 results are compatible with the best constraints among our simulations. Conversely, spurious false identification of a cutoff is unlikely. For catalogs expected by the end of the O4 observing run, uncertainty in the cutoff mass is reduced by $\\gtrsim20\\%$, but a cutoff at $40$-$50M_\\odot$ yields only a lower bound on the $^{12}\\mathrm{C}(\\alpha,\\gamma)^{16}\\mathrm{O}$ reaction rate, which in terms of the S-factor at $300\\,\\mathrm{keV}$ may be $S_{300}\\gtrsim125\\,\\mathrm{keV}\\,\\mathrm{b}$ at $90\\%$ credibility by the end of O4. Relative uncertainties on the Hubble parameter $H_0$ from gravitational-wave data alone can still be up to $100\\%$. We also analyze GWTC-4 with the nonparametric PixelPop population model, finding that some mass features are more prominent than in parametric models but a sharp cutoff is not required. However, the parametric model passes a likelihood-based predictive test in GWTC-4 and the PixelPop results are consistent with those from our simulated catalogs where a cutoff is present. We use the simple focus of this study to emphasize that such tests are necessary to make astrophysical claims from gravitational-wave catalogs going forward.",
      "pdf_url": "https://arxiv.org/pdf/2602.11282.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.IM",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.11652",
      "title": "Numerical simulation of the stochastic formalism including non-Markovianity",
      "authors": [
        "Masahiro Kawasaki",
        "Tomotaka Kuroda"
      ],
      "abstract": "Numerical simulation of the stochastic formalism including non-Markovianity Masahiro Kawasaki, Tomotaka Kuroda Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We numerically investigate stochastic dynamics in cosmology by solving Langevin equations for Infrared (IR) modes with stochastic noises generated by Ultraviolet (UV) modes at the coarse-graining scale. By construction, the stochastic formalism relies on the separation of scales, which requires solving the equations for UV modes on top of the evolving IR modes for all modes at every time step, leading to a non-Markovian system in general. In this paper, working on a de Sitter background, we analyze several representative models by simultaneously solving the Langevin equations for IR modes and the equations for UV modes at each time step. We demonstrate that once the effects of effective masses are treated consistently by our simulation, the flat direction in the minimal supersymmtric model (MSSM) does not saturate but instead evolves as an exactly flat direction. Furthermore, we investigate memory effects in simple two models; $V=\\lambda\\phi^4$ and $V=\\mu\\phi\\chi + \\lambda\\phi^4$, and non-Markovian contributions can lead to quantitative differences, even in stationary configurations, when compared with Markovian approximations, particularly in the strong-coupling regime.",
      "pdf_url": "https://arxiv.org/pdf/2602.11652.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12115",
      "title": "Search for Sub-Solar Mass Binaries in the First Part of LIGO's Fourth Observing Run",
      "authors": [
        "Keisi Kacanja",
        "Kanchan Soni",
        "Aleyna Akyuz",
        "Alexander H. Nitz"
      ],
      "abstract": "Search for Sub-Solar Mass Binaries in the First Part of LIGO's Fourth Observing Run Keisi Kacanja, Kanchan Soni, Aleyna Akyuz, Alexander H. Nitz High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We report the first results of a sub-solar mass compact binary search using the data from the first part of the fourth observing run (O4a) of the Advanced LIGO detectors. Sub-solar mass neutron stars or primordial black holes are not expected to form via standard stellar evolution, and their observation would signify a new class of astrophysical object or the discovery of dark matter. Our search covers binaries with primary masses 0.1 to 2 $\\textrm{M}_\\odot$ and secondary masses 0.1 to 1 $\\textrm{M}_\\odot$. We explicitly incorporate tidal effects up to $7\\times10^5$ for extremely low mass neutron stars. No statistically significant candidates are identified. The advanced sensitivity of the O4a run enables an improvement in the sub-solar mass black hole merger rate limits by more than $2 \\times$ over the previous three observing runs (O1-O3b). We place a $90\\%$ confidence upper limit on the merger rate $\\mathcal{R}_{90}$ for sub-solar mass black holes to be $< 1.77\\times10^4 \\textrm{Gpc}^{-3} \\textrm{yr}^{-1}$ for a chirp mass of 0.2 $\\textrm{M}_\\odot$. We place the first constraints for binary neutron stars with tidal deformabilities up to $\\sim 7\\times10^5$ and improve the merger rate estimate by a factor $\\sim 4$ in comparison to previous O3 tidal searches for tidal deformabilities $< 10^4$. We further constrain the fraction of dark matter composed of primordial black hole $f_{\\rm PBH}< 2\\%$ for a chirp mass of 0.1 $\\textrm{M}_\\odot$. Our results significantly expand the observational search space for sub-solar binaries and provide rigorous constraints on the local abundance of compact objects that may arise from non-standard formation mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2602.12115.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12252",
      "title": "The Dark Side of the Moon: Listening to Scalar-Induced Gravitational Waves",
      "authors": [
        "D. Blas",
        "J. W. Foster",
        "Y. Gouttenoire",
        "A. J. Iovino",
        "I. Musco",
        "S. Trifinopoulos",
        "M. Vanvlasselaer"
      ],
      "abstract": "The Dark Side of the Moon: Listening to Scalar-Induced Gravitational Waves D. Blas, J. W. Foster, Y. Gouttenoire, A. J. Iovino, I. Musco, S. Trifinopoulos, M. Vanvlasselaer 8 pages, 4 figures, 1 appendix with 1 additional figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The collapse of large-amplitude primordial curvature perturbations into planetary-mass primordial black holes generates a scalar-induced gravitational wave background in the $\\mu $Hz frequency range that may be detectable by future Lunar Laser Ranging and Satellite Laser Ranging data. We derive projected constraints on the primordial black hole population from a null detection of stochastic gravitational wave background by these experiments, including the impact of the electroweak phase transition on the abundance of planetary-mass primordial black holes. We also discuss the connection between the obtained projected constraints and the recent microlensing observations by the HSC collaboration of the Andromeda Galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2602.12252.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.14747",
      "title": "Structural Limitations on Constraining the Time Evolution of Dark Energy",
      "authors": [
        "Seokcheon Lee"
      ],
      "abstract": "Structural Limitations on Constraining the Time Evolution of Dark Energy Seokcheon Lee 6 pages, 2 figures, Final version accepted for publication in Physics Letters B. Match published version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Cosmological constraints on a time-varying dark energy equation of state are fundamentally limited by the integral structure through which the equation of state enters cosmological observables. We rigorously derive the linear response kernel that maps perturbations in the equation of state \\omega(z) to comoving distance fluctuations \\delta D(z). By adopting a Fourier mode expansion \\delta \\omega(z) = \\sin(kz), we obtain the exact analytic form of the distance response in terms of Sine and Cosine integrals. We show that this mapping involves a double integration over redshift, which acts as an intrinsic low-pass filter with a characteristic \\sim k^{-2} scaling in redshift space. This structural limitation is visualized in a schematic diagram and confirmed by observational verification using the full covariance matrix of the Pantheon+ supernova dataset. Our analysis reveals a steep hierarchy in Fisher eigenvalues where the information content drops by an order of magnitude already at the second eigenmode. Consequently, distance-based probes effectively constrain only a single dominant mode of \\omega(z). This implies that the difficulty in constraining dynamical parameters such as w_a is not due to data precision, but is a necessary consequence of the observable's integral nature, which renders it structurally blind to the instantaneous rate of change d\\omega/da.",
      "pdf_url": "https://arxiv.org/pdf/2512.14747.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17088",
      "title": "Gravitational wave oscillations in Multi-Proca dark energy models",
      "authors": [
        "Gabriel Gomez",
        "Jose F. Rodriguez"
      ],
      "abstract": "Gravitational wave oscillations in Multi-Proca dark energy models Gabriel Gomez, Jose F. Rodriguez Accepted for publication in JCAP. Matches the accepted version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational wave oscillations arise from the exchange of energy between the metric perturbations and additional tensor modes. This phenomenon can occur even when the extra degrees of freedom consist of a triplet of massive Abelian vector fields, as in Multi-Proca dark energy models. In this work, we study gravitational wave oscillations in this class of models minimally coupled to gravity with a general potential, allowing also for a kinetic coupling between the vector field and dark matter that can, in principle, enhance the modulation of gravitational wave amplitudes. After consistently solving the background dynamics, requiring the model parameters to reproduce a phase of late-time accelerated expansion, we assess the accuracy of commonly used analytical approximations and quantify the impact of gravitational wave amplitude modulation for current detectors (LIGO--Virgo) and future missions such as LISA. Although oscillations are present in these scenarios, we find that the effective mass scale (the mixing mass) governing the phenomenon is $m_g \\sim \\mu_A$, where $\\mu_A$ is the (time-dependent) effective mass of the vector dark-energy field. Detectability of gravitational wave oscillations, however, requires $m_g \\gg H_0$, which is in tension with the ultra-light masses typically needed to drive accelerated expansion $\\mu_A \\sim H_0 \\sim 10^{-33}\\,\\mathrm{eV}$. Therefore, if gravitational wave oscillations were to be detected at the corresponding frequencies, they could not be attributed to these classes of dark-energy models.",
      "pdf_url": "https://arxiv.org/pdf/2512.17088.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.21820",
      "title": "Forecasting Constraints on Cosmology and Modified Gravitational-wave Propagation by Strongly Lensed Gravitational Waves Associating with Galaxy Surveys",
      "authors": [
        "Anson Chen",
        "Jun Zhang"
      ],
      "abstract": "Forecasting Constraints on Cosmology and Modified Gravitational-wave Propagation by Strongly Lensed Gravitational Waves Associating with Galaxy Surveys Anson Chen, Jun Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational lensing of gravitational wave (GW) will become the next frontier in studying cosmology and gravity. While time-delay cosmography using quadruply lensed GW events associated with optical images of the lens systems can provide precise measurement of the Hubble constant ($H_0$), they are considered to be much rarer than doubly lensed events. In this work, we analyze time-delay cosmography with doubly lensed GW events for the first time. We generate mock doubly lensed GW events with designed sensitivity of the LIGO-Virgo-KAGRA (LVK) O5 network, with LIGO post-O5 upgrade, and with Einstein Telescope (ET) + Cosmic Explorer (CE) respectively, and select the events that can be associated with future galaxy surveys. Over 1000 realizations, we find an average of 0.2(2.4) qualified events with the LVK O5(post-O5) network. Whereas with the ET+CE network, we find an average of 73.2 qualified events over 100 realizations. Using the Singular Isothermal Sphere (SIS) lens model, we jointly estimate waveform parameters and the impact parameter with doubly lensed GW signals, and then forecast the constraints on cosmological parameters and modified GW propagation by combining time-delay cosmography and the standard siren approach. The average posterior gives a constraint on $H_0$ with a relative uncertainty of $14\\%$, $10\\%$ and $0.42\\%$ in the $\\Lambda$CDM model for the LVK O5, LVK post-O5, and ET+CE network, respectively. While the LVK network gives uninformative constraints on the $(w_0,w_a)$ dynamical dark energy model, the ET+CE network yields a moderate constraint of $w_0=-1.02^{+0.31}_{-0.22}$ and $w_a=0.48^{+0.99}_{-1.54}$. In addition, our method can provide precise constraints on modified GW propagation effects jointly with $H_0$.",
      "pdf_url": "https://arxiv.org/pdf/2601.21820.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.09705",
      "title": "Non-minimally Coupled Running Curvaton: A Unified Approach to Early-Universe Inflation and Phantom Dark Energy",
      "authors": [
        "Bichu Li",
        "Lei-Hua Liu"
      ],
      "abstract": "Non-minimally Coupled Running Curvaton: A Unified Approach to Early-Universe Inflation and Phantom Dark Energy Bichu Li, Lei-Hua Liu 13 figures, 3 figures, references updated Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Recent observations from the Dark Energy Spectroscopic Instrument (DESI) 2024, combined with CMB and SNIa data, indicate a preference for a dynamical dark energy equation of state that crosses the phantom divide ($w < -1$). This finding challenges the standard $\\Lambda$CDM model and minimally coupled scalar field scenarios, including the original Running Curvaton model, which is typically constrained to the quintessence regime. In this work, we propose a unified cosmological framework by extending the Running Curvaton model via a non-minimal gravitational coupling of the form $\\xi \\chi^2 R$. We demonstrate that this geometric modification allows the effective equation of state to naturally evolve from a quintessence-like to a phantom-like regime in the Jordan frame, thereby providing a superior fit to the DESI observational contours ($w_0 > -1, w_a < 0$). Crucially, we show that the introduction of non-minimal coupling does not compromise the model's success in describing the early universe. Through a parameter re-tuning mechanism involving the coupling constant ($g_0^{obs} = g_0 + 2\\xi$), the predictions for the primordial power spectrum (spectral index $n_s$) and local-type non-Gaussianity ($f_{NL}$) remain strictly preserved and consistent with Planck data. Furthermore, we perform a comprehensive stability analysis within the Horndeski framework, verifying that the model remains free from ghost and gradient instabilities ($c_s^2 = 1$). Our results suggest that the non-minimally coupled Running Curvaton offers a robust, stable, and unified description of inflation and late-time accelerated expansion compatible with the latest precision cosmology data.",
      "pdf_url": "https://arxiv.org/pdf/2602.09705.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11264",
      "title": "Time delays and stationarity in quasar light curves",
      "authors": [
        "Namu Kroupa",
        "David Yallup",
        "Will Handley"
      ],
      "abstract": "Time delays and stationarity in quasar light curves Namu Kroupa, David Yallup, Will Handley Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a fully Bayesian framework for time delay inference and stationarity tests in quasar light curves using marginalised Gaussian processes. The model separates a deterministic, non-stationary drift (piecewise linear mean) from stationary stochastic variability (Matérn and Spectral Mixture kernels), and jointly models multiple images with per-image microlensing. Bayesian evidence and parameter posteriors are obtained via nested sampling and marginalised over model choices. Applied to the quasars WFI J2033 - 4723, B 1608 + 656, and HE 0435 - 1223, we find strong evidence for non-stationarity in B 1608 + 656 and HE 0435 - 1223, while WFI J2033 - 4723 is consistent with stationarity. The stochastic component favours an Markovian exponential kernel for B 1608 + 656 and a non-Markovian Matérn-$\\frac32$ kernel for WFI J2033 - 4723 and HE 0435 - 1223. Multi-length-scale Spectral Mixture kernels are disfavoured. Time delays are shown to be robust to model assumptions and consistent with prior work within the error. We further identify and mitigate a likelihood pathology which biases toward large delays, providing a practical nested sampling convergence protocol.",
      "pdf_url": "https://arxiv.org/pdf/2602.11264.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11279",
      "title": "SPT-3G D1: Compton-$y$ maps using data from the SPT-3G and Planck surveys",
      "authors": [
        "A. S. Maniyar",
        "F. Bianchini",
        "W. L. K. Wu",
        "S. Raghunathan",
        "A. J. Anderson",
        "B. Ansarinejad",
        "M. Archipley",
        "L. Balkenhol",
        "D. R. Barron",
        "P. S. Barry",
        "K. Benabed",
        "A. N. Bender",
        "B. A. Benson",
        "L. E. Bleem",
        "S. Bocquet",
        "F. R. Bouchet",
        "L. Bryant",
        "E. Camphuis",
        "M. G. Campitiello",
        "J. E. Carlstrom",
        "J. Carron",
        "C. L. Chang",
        "P. Chaubal",
        "P. M. Chichura",
        "A. Chokshi",
        "T.-L. Chou",
        "A. Coerver",
        "T. M. Crawford",
        "C. Daley",
        "T. de Haan",
        "K. R. Dibert",
        "M. A. Dobbs",
        "M. Doohan",
        "A. Doussot",
        "D. Dutcher",
        "W. Everett",
        "C. Feng",
        "K. R. Ferguson",
        "N. C. Ferree",
        "K. Fichman",
        "A. Foster",
        "S. Galli",
        "A. E. Gambrel",
        "A. K. Gao",
        "R. W. Gardner",
        "F. Ge",
        "N. Goeckner-Wald",
        "R. Gualtieri",
        "F. Guidi",
        "S. Guns",
        "N. W. Halverson",
        "E. Hivon",
        "A. Y. Q. Ho",
        "G. P. Holder",
        "W. L. Holzapfel",
        "J. C. Hood",
        "A. Hryciuk",
        "N. Huang",
        "T. Jhaveri",
        "F. Kéruzoré",
        "A. R. Khalife",
        "L. Knox",
        "M. Korman",
        "K. Kornoelje",
        "C.-L. Kuo",
        "K. Levy",
        "Y. Li",
        "A. E. Lowitz",
        "C. Lu",
        "G. P. Lynch",
        "T. J. Maccarone",
        "E. S. Martsen",
        "F. Menanteau",
        "M. Millea",
        "J. Montgomery",
        "Y. Nakato",
        "T. Natoli",
        "G. I. Noble",
        "Y. Omori",
        "A. Ouellette",
        "Z. Pan",
        "P. Paschos",
        "K. A. Phadke",
        "A. W. Pollak",
        "K. Prabhu",
        "W. Quan",
        "M. Rahimi",
        "A. Rahlin",
        "C. L. Reichardt",
        "M. Rouble",
        "J. E. Ruhl",
        "E. Schiappucci",
        "A. C. Silva Oliveira",
        "A. Simpson",
        "J. A. Sobrin",
        "A. A. Stark",
        "J. Stephen",
        "C. Tandoi",
        "B. Thorne",
        "C. Trendafilova"
      ],
      "abstract": "SPT-3G D1: Compton-$y$ maps using data from the SPT-3G and Planck surveys A. S. Maniyar, F. Bianchini, W. L. K. Wu, S. Raghunathan, A. J. Anderson, B. Ansarinejad, M. Archipley, L. Balkenhol, D. R. Barron, P. S. Barry, K. Benabed, A. N. Bender, B. A. Benson, L. E. Bleem, S. Bocquet, F. R. Bouchet, L. Bryant, E. Camphuis, M. G. Campitiello, J. E. Carlstrom, J. Carron, C. L. Chang, P. Chaubal, P. M. Chichura, A. Chokshi, T.-L. Chou, A. Coerver, T. M. Crawford, C. Daley, T. de Haan, K. R. Dibert, M. A. Dobbs, M. Doohan, A. Doussot, D. Dutcher, W. Everett, C. Feng, K. R. Ferguson, N. C. Ferree, K. Fichman, A. Foster, S. Galli, A. E. Gambrel, A. K. Gao, R. W. Gardner, F. Ge, N. Goeckner-Wald, R. Gualtieri, F. Guidi, S. Guns, N. W. Halverson, E. Hivon, A. Y. Q. Ho, G. P. Holder, W. L. Holzapfel, J. C. Hood, A. Hryciuk, N. Huang, T. Jhaveri, F. Kéruzoré, A. R. Khalife, L. Knox, M. Korman, K. Kornoelje, C.-L. Kuo, K. Levy, Y. Li, A. E. Lowitz, C. Lu, G. P. Lynch, T. J. Maccarone, E. S. Martsen, F. Menanteau, M. Millea, J. Montgomery, Y. Nakato, T. Natoli, G. I. Noble, Y. Omori, A. Ouellette, Z. Pan, P. Paschos, K. A. Phadke, A. W. Pollak, K. Prabhu, W. Quan, M. Rahimi, A. Rahlin, C. L. Reichardt, M. Rouble, J. E. Ruhl, E. Schiappucci, A. C. Silva Oliveira, A. Simpson, J. A. Sobrin, A. A. Stark, J. Stephen, C. Tandoi, B. Thorne, C. Trendafilova 18 pages, 8 figures, comments and requests for missing citations welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present thermal Sunyaev-Zel'dovich (tSZ) Compton-$y$ parameter maps constructed from two years (2019-2020) of observations with the South Pole Telescope (SPT) third-generation camera, SPT-3G, combined with data from the Planck satellite. Using a linear combination (LC) pipeline, we obtain a suite of reconstructions that explore different trade-offs between statistical sensitivity and suppression of astrophysical contaminants, including minimum-variance, CMB-deprojected, and CIB-deprojected $y$-maps. We validate these maps through different statistical techniques such as auto- and cross-power spectra with large-scale structure tracers as well as stacking on cluster locations. These tests are used to understand the balance between noise and astrophysical foreground residuals (such as the CIB) in combination with the recovery of the tSZ signal for different maps. For example, results from stacking at the location of clusters confirm the robustness of the recovered tSZ signal over the $\\sim 1500\\: {\\rm deg}^2$ SPT-3G survey field used in this analysis. The high-resolution and low-noise maps produced here provide an important cosmological tool for future studies, including measurements of the Compton-$y$ map power spectrum, cross-correlations with other tracers of the large-scale structure, detailed modeling of cluster pressure profiles, and study of the thermodynamic state of the baryons in the Universe.",
      "pdf_url": "https://arxiv.org/pdf/2602.11279.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11310",
      "title": "Linear Growth of Matter Perturbations Probed by Redshift-Space Distortions in Interacting $Λ(t)$CDM Cosmologies",
      "authors": [
        "A. A. Escobal",
        "H. A. P. Macedo",
        "J. F. Jesus",
        "R. C. Nunes",
        "J. A. S. Lima"
      ],
      "abstract": "Linear Growth of Matter Perturbations Probed by Redshift-Space Distortions in Interacting $Λ(t)$CDM Cosmologies A. A. Escobal, H. A. P. Macedo, J. F. Jesus, R. C. Nunes, J. A. S. Lima Cosmology and Nongalactic Astrophysics (astro-ph.CO) In the context of a spatially flat $\\Lambda(t)$CDM cosmology, we investigate interacting dark energy (IDE) scenarios characterized by phenomenological interaction terms proportional to the Hubble expansion rate and the dark energy density. Our analysis is performed at both the background and linear perturbation levels, with particular emphasis on the evolution of dark matter density fluctuations. Cosmological constraints are derived from a joint analysis of CMB distance priors, Baryon Acoustic Oscillations (BAO), Type Ia supernovae (SNe Ia) from Pantheon+, Redshift-Space Distortions (RSD), and $H(z)$ data from Cosmic Chronometers (CC). Using the linear growth of matter perturbations, we estimate the clustering parameter $S_8$ within IDE extensions of the flat $\\Lambda(t)$CDM framework. At the perturbative level, we consider interaction terms of the form $Q_{\\text{I}}=\\varepsilon a H\\bar{\\rho}_{\\Lambda(t)}$ (Model I) and $Q_{\\text{II}}=\\varepsilon H\\bar{\\rho}_{\\Lambda(t)}$ (Model II). From the combined dataset, we obtain the constraints $S_8 = 0.870 \\pm 0.026$ for Model I and $S_8 = 0.872 \\pm 0.026$ for Model II. Finally, we discuss the implications for the coupling parameter $\\varepsilon$, taking into account the semi-analytical approximations and observational data employed in this study.",
      "pdf_url": "https://arxiv.org/pdf/2602.11310.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11512",
      "title": "Stone Skipping Black Holes in Ultralight Dark Matter Solitons",
      "authors": [
        "Alan Zhang",
        "Yourong Wang",
        "J. Luna Zagorac",
        "Richard Easther"
      ],
      "abstract": "Stone Skipping Black Holes in Ultralight Dark Matter Solitons Alan Zhang, Yourong Wang, J. Luna Zagorac, Richard Easther Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The orbit of a black hole moving within an ultralight dark matter (ULDM) soliton is naively expected to decay due to dynamical friction. However, single black holes can undergo ``stone skipping'', with their orbital radius varying quasi-periodically. We show that stone skipping is induced by the dipole excitation of the soliton. We model it as resonance in a forced, damped harmonic oscillator, demonstrating that the coherent response of the soliton can significantly modify the dynamics of objects orbiting within it. This suggests that a dipole perturbation of a soliton can modify inspiral timescales if the black holes masses are significantly less than the soliton mass, with implications for supermassive black hole dynamics, the final parsec problem and gravitational wave observations in a ULDM cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2602.11512.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.11751",
      "title": "Evolution of submillimeter galaxies across cosmic-web environments",
      "authors": [
        "Ankit Kumar",
        "M. Celeste Artale",
        "Antonio D. Montero-Dorta",
        "Lucia Guaita",
        "Joop Schaye",
        "Kyoung-Soo Lee",
        "Alexandra Pope",
        "Facundo Rodriguez",
        "Eric Gawiser",
        "Ho Seong Hwang",
        "Paulina Troncoso Iribarren",
        "Jaehyun Lee",
        "Seong-Kook Lee",
        "Changbom Park",
        "Yujin Yang"
      ],
      "abstract": "Evolution of submillimeter galaxies across cosmic-web environments Ankit Kumar, M. Celeste Artale, Antonio D. Montero-Dorta, Lucia Guaita, Joop Schaye, Kyoung-Soo Lee, Alexandra Pope, Facundo Rodriguez, Eric Gawiser, Ho Seong Hwang, Paulina Troncoso Iribarren, Jaehyun Lee, Seong-Kook Lee, Changbom Park, Yujin Yang 13 pages, 6 figures, submitted to A&A [abstract reduced to meet arXiv character limit] Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Submillimeter galaxies (SMGs) provide valuable insights into galaxy formation and evolution and are likely influenced by their cosmic environment. However, their rarity makes environmental trends difficult to establish. We use the FLAMINGO simulation, which simultaneously reproduces the redshift distribution and number counts of SMGs. We use the DisPerSE to identify filamentary structures at $z=4$, 3, 2, 1.5, and 1. We define inner cluster-halo, outer cluster-halo, inner filament, outer filament, and void/wall environments at each redshift considering mass evolution of cluster-halos and density evolution of filaments. For a fixed stellar-mass cut of $M_* \\geq 10^{9}$ M$_{\\odot}$, the fraction of SMGs in the inner cluster-halo environment declines from $\\sim30\\%$ at $z=4$ to $\\sim3\\%$ by $z=1$, and similar trends are observed in other environments. The abundance of SMGs within a cluster-halo increases with halo mass, mirroring the increase in the total galaxy population. Consequently, the ratio of SMG halo occupation to that of all galaxies is largely insensitive to halo mass, but varies with redshift. In contrast, the ratio of the halo occupation of non-SMGs to that of all galaxies declines with halo mass and shows little redshift evolution. We show that the central and satellite SMGs form two distinct populations in inner cluster-halos. SMGs occupy the metal-rich side of the metallicity distribution, but rarely attain the highest metallicities because ongoing enrichment is limited by gas depletion. The brightest SMGs (S$_{850} > 10$ mJy) are found exclusively in inner cluster-halos, highlighting a strong connection between SMG luminosity and environmental density. Our results show that SMGs dominate star formation in dense environments, contributing up to $80\\%$ of the SFR in inner cluster-halos at $z=4$, but less than $50\\%$ in low-density regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.11751.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11936",
      "title": "Probing Dynamical Dark Energy with Late-Time Data: Evidence, Tensions, and the Limits of the $w_0w_a$CDM Framework",
      "authors": [
        "Tengpeng Xu",
        "Suresh Kumar",
        "Yun Chen",
        "Abraão J. S. Capistrano",
        "Özgür Akarsu"
      ],
      "abstract": "Probing Dynamical Dark Energy with Late-Time Data: Evidence, Tensions, and the Limits of the $w_0w_a$CDM Framework Tengpeng Xu, Suresh Kumar, Yun Chen, Abraão J. S. Capistrano, Özgür Akarsu Cosmology and Nongalactic Astrophysics (astro-ph.CO) We test the dynamical dark-energy $w_0w_a$CDM (CPL) framework against $\\Lambda$CDM using CMB anisotropies and lensing together with late-time distance probes: DESI DR2 BAO, the completed SDSS-IV BAO consensus compilation, a transverse/angular BAO compilation (BAOtr), and the Cepheid-calibrated PantheonPlus SN~Ia likelihood (PP\\&SH0ES). We find that CPL inferences are strongly dataset-dependent. With CMB data alone, the broad geometric degeneracy in $(H_0,\\Omega_{\\rm m},w_0,w_a)$ admits an extrapolation tail that can extend to $q_0<-1$ (super-acceleration), whereas adding DESI DR2 BAO pulls the reconstruction toward a weakly accelerating or nearly coasting present-day Universe ($q_0\\simeq 0$). In contrast, combining CMB with PP\\&SH0ES and BAOtr yields a conventional moderately accelerating expansion ($-1<q_0\\lesssim 0$) and substantially reduces the Hubble tension. Across all combinations, $w(z\\to\\infty)=w_0+w_a<-1$, while at post-recombination redshifts the expansion remains matter dominated ($q\\to1/2$). The origin of this behavior can be traced to low-redshift distance information: BAOtr and DESI prefer different BAO distance ratios at $z\\lesssim 0.5$, which propagates into divergent expansion histories in CPL. In all cases, $r_{\\rm d}$ stays nearly unchanged, indicating that shifts in $H_0$ arise from late-time expansion freedom rather than early-Universe physics. Bayesian evidence mirrors this contingency: it is strong for CPL mainly when PP\\&SH0ES and/or BAOtr are included, while it is inconclusive for CMB-only and CMB+DESI and moderately favors $\\Lambda$CDM for CMB+SDSS. Overall, our results show that the apparent support for CPL and its ability to ease the Hubble tension are not universal but depend sensitively on the adopted low-redshift distance data, motivating either more flexible late-time models or closer scrutiny of residual systematics in current BAO determinations.",
      "pdf_url": "https://arxiv.org/pdf/2602.11936.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11989",
      "title": "Simulation-Based Cosmological Mass Calibration of XXL Galaxy Clusters using HSC Weak Lensing",
      "authors": [
        "Sut-Ieng Tam",
        "Keiichi Umetsu",
        "Adam Amara",
        "Dominique Eckert",
        "Manon Regamey",
        "Nicolas Cerardi",
        "I-Non Chiu",
        "Mauro Sereno",
        "Florian Pacaud",
        "Sunayana Bhargava",
        "Christian Garrel",
        "Fabio Gastaldello",
        "Elias Koulouridis",
        "Ben Maughan",
        "Rogerio Monteiro-Oliveira",
        "Marguerite Pierre"
      ],
      "abstract": "Simulation-Based Cosmological Mass Calibration of XXL Galaxy Clusters using HSC Weak Lensing Sut-Ieng Tam, Keiichi Umetsu, Adam Amara, Dominique Eckert, Manon Regamey, Nicolas Cerardi, I-Non Chiu, Mauro Sereno, Florian Pacaud, Sunayana Bhargava, Christian Garrel, Fabio Gastaldello, Elias Koulouridis, Ben Maughan, Rogerio Monteiro-Oliveira, Marguerite Pierre 36 pages, 18 figures; submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a cosmological analysis of the X-ray-selected galaxy cluster sample from the XXL survey, employing a simulation-based inference (SBI) framework to jointly constrain cosmological parameters and X-ray scaling relations through forward modeling of cluster counts, X-ray observables, and weak-lensing measurements. Our analysis combines X-ray data from the XMM-XXL survey with shear measurements from the three-year shape catalog of the Hyper Suprime-Cam Subaru Strategic Program. The analysis focuses on the XXL C1 sample, comprising 171 clusters for abundance modeling, a subset of 86 clusters located within the XXL-N region for lensing-based mass calibration, and 162 clusters with X-ray temperature and luminosity measurements used to constrain scaling relations. Using the density-estimation likelihood-free inference (DELFI) algorithm, we construct a forward model with 12 parameters that incorporates the XXL selection function and cluster population modeling and accounts for key systematic effects including cluster miscentering, photometric redshift bias, and mass-dependent weak-lensing bias. Our SBI analysis yields a constraint on the cosmological parameter $S_8 \\equiv \\sigma_8 (\\Omega_{m}/0.3)^{0.5} = 0.867 \\pm 0.063$, with an additional 3% systematic uncertainty from neural network stochasticity. The result is consistent with Planck and recent cluster-based measurements. The inferred temperature-mass relation is consistent with self-similar expectations within uncertainties, whereas the luminosity-temperature relation exhibits a slope steeper than the self-similar prediction. From the resulting posterior distribution of the forward model, we derive lensing-calibrated mass estimates for all individual XXL clusters with measured X-ray temperatures or luminosities. These results provide a self-consistent mass calibration for future multi-probe cosmological analyses of the XXL sample.",
      "pdf_url": "https://arxiv.org/pdf/2602.11989.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12019",
      "title": "Is cosmic birefringence due to dark energy or dark matter? Simulation-based inference",
      "authors": [
        "Florie Carralot",
        "Patricia Diego-Palazuelos",
        "Adriaan J. Duivenvoorden",
        "Eiichiro Komatsu",
        "Nicoletta Krachmalnicoff",
        "Carlo Baccigalupi"
      ],
      "abstract": "Is cosmic birefringence due to dark energy or dark matter? Simulation-based inference Florie Carralot, Patricia Diego-Palazuelos, Adriaan J. Duivenvoorden, Eiichiro Komatsu, Nicoletta Krachmalnicoff, Carlo Baccigalupi Cosmology and Nongalactic Astrophysics (astro-ph.CO) Simulation-based inference (SBI) is a powerful inference technique for cases where the exact functional form of the likelihood is not known. A prime example is the likelihood of cross-correlation power spectra of the cosmic microwave background (CMB) fields at low multipoles, $\\ell\\lesssim 10$. In this paper, we investigate a parity-violating cross-correlation between $E$- and $B$- mode polarization fields using SBI. The $EB$ correlation at low $\\ell$ is essential to distinguish between possible axion dark energy and dark matter interpretations of `cosmic birefringence', a rotation of the plane of linear polarization of the CMB, recently reported from WMAP, Planck, and Atacama Cosmology Telescope data. We use neural likelihood estimation to infer the likelihood of the $EB$ correlation at low $\\ell$ and show that it is highly non-Gaussian. We then employ neural posterior estimation to constrain the scalar field mass ($m_\\phi$), the cosmic birefringence amplitude ($g\\phi_\\mathrm{in}/2$), and the instrumental miscalibration angle ($\\alpha$), from simulated datasets. We find that the posterior on $m_{\\phi}$ shows two regimes, with a transition marked by $10^{-32}$ eV, highlighting a strong sensitivity to the scale dependence of cosmic birefringence. To quantify this behavior, we compute the probability $p(m_{\\phi} < 10^{-32}$\\,eV) for various fiducial values of $m_{\\phi}$. We find that $\\alpha$ and the contribution of lensed $B$ modes ultimately limit our ability to exclude the dark energy scenario fully.",
      "pdf_url": "https://arxiv.org/pdf/2602.12019.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12174",
      "title": "Probing baryonic feedback with fast radio bursts: joint analyses with cosmic shear and galaxy clustering",
      "authors": [
        "Amy Wayland",
        "David Alonso",
        "Robert Reischke"
      ],
      "abstract": "Probing baryonic feedback with fast radio bursts: joint analyses with cosmic shear and galaxy clustering Amy Wayland, David Alonso, Robert Reischke Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmological inference from weak lensing (WL) surveys is increasingly limited by uncertainties in baryonic physics, which suppress the non-linear matter power spectrum on small scales. Multi-probe analyses that incorporate complementary tracers of the gas distribution around haloes offer a pathway to calibrate these effects and recover unbiased cosmological information. In this work, we forecast the constraining power of a joint analysis combining fiducial data from a Stage-IV WL survey with measurements of the dispersion measure from fast radio bursts (FRBs). We evaluate the ability of this approach to simultaneously constrain cosmological parameters and the astrophysical processes governing baryonic feedback, and we quantify the impact of key FRB systematics, including redshift uncertainties and source clustering. We find that, even after accounting for these effects, a 3$\\times$2-point analysis of WL and FRBs significantly improves cosmological constraints, reducing the degradation factor on $S_8$ by $\\sim 80\\%$ compared to WL alone. We further show that FRBs alone are sensitive only to a degenerate combination of the key baryonic parameters, $\\log_{10} M_{\\rm c}$ and $\\eta_{\\rm b}$, and that the inclusion of WL measurements breaks this degeneracy. Finally, we extend our framework to incorporate galaxy clustering measurements using Luminous Red Galaxy and Emission Line Galaxy samples, performing a unified 6$\\times$2-point analysis of WL, dispersion measures of FRBs, and galaxy clustering. While this combined approach tightens constraints on $\\Omega_{\\rm m}$ and $\\log_{10} M_{\\rm c}$, it does not lead to a significant improvement in $S_8$ constraints beyond those obtained from WL and FRBs alone.",
      "pdf_url": "https://arxiv.org/pdf/2602.12174.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12232",
      "title": "Extending the Cosmological Collider: New Scaling Regimes and Constraints from BOSS",
      "authors": [
        "Daniel Green",
        "Jiashu Han",
        "Benjamin Wallisch"
      ],
      "abstract": "Extending the Cosmological Collider: New Scaling Regimes and Constraints from BOSS Daniel Green, Jiashu Han, Benjamin Wallisch Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Primordial non-Gaussianity generated by additional fields during inflation offers a compelling observational target. Heavy fields imprint characteristic oscillatory signals in non-Gaussian correlation functions of the inflaton, a process sometimes referred to as cosmological-collider physics. These distinct signatures are compelling windows into ultra-high-energy physics, but are often suppressed, making standard equilateral non-Gaussianity the most promising discovery channel in many scenarios. In this paper, we show that direct couplings between the inflaton and additional fields can lead to a wide variety of novel, observationally relevant signals which open new parameter regimes that simultaneously exhibit the characteristics of light and heavy fields. We identify these primordial signatures in the late-time observables of the large-scale structure of the Universe, where they most significantly modify the scale-dependent bias of the galaxy power spectrum to include an oscillatory modulation around a non-trivial power law. We explore the full range of parameters that phenomenologically arise in these models and study the sensitivity of current and future galaxy surveys, finding that this new class of primordial non-Gaussianity is particularly accessible in near-term surveys due to its oscillatory feature. Finally, we perform an analysis of existing data from the final release of the Baryon Oscillation Spectroscopic Survey (BOSS DR12). While we find no evidence for a signal, we demonstrate significant improvements in sensitivity over respective non-oscillatory scenarios and place the first constraints on this extended parameter space of oscillatory non-Gaussianity.",
      "pdf_url": "https://arxiv.org/pdf/2602.12232.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12238",
      "title": "Status of the $S_8$ Tension: A 2026 Review of Probe Discrepancies",
      "authors": [
        "Ioannis Pantos",
        "Leandros Perivolaropoulos"
      ],
      "abstract": "Status of the $S_8$ Tension: A 2026 Review of Probe Discrepancies Ioannis Pantos, Leandros Perivolaropoulos Cosmology and Nongalactic Astrophysics (astro-ph.CO) The parameter $S_8 \\equiv \\sigma_8 (\\Omega_m/0.3)^{0.5}$ quantifies the amplitude of matter density fluctuations. A persistent discrepancy exists between early-universe CMB observations and late-universe probes. This review assesses the ``$S_8$ tension'' against a new 2026 baseline: a unified ``Combined CMB'' framework incorporating Planck, ACT DR6, and SPT-3G. This combined analysis yields $S_8 = 0.836^{+0.012}_{-0.013}$, providing a higher central value and reduced uncertainties compared to Planck alone. Compiling measurements from 2019--2026, we reveal a striking bifurcation: DES Year 6 results exhibit a statistically significant tension of $2.4\\sigma$--$2.7\\sigma$ \\citep{DESY6}, whereas KiDS Legacy results demonstrate statistical consistency at $<1\\sigma$ \\citep{Wright2025}. We examine systematic origins of this dichotomy, including photometric redshift calibration, intrinsic alignment modeling, and shear measurement pipelines. We further contextualize these findings with cluster counts (where eROSITA favors high values while SPT favors low), galaxy-galaxy lensing, and redshift-space distortions. The heterogeneous landscape suggests survey-specific systematic effects contribute substantially to observed discrepancies, though new physics beyond $\\Lambda$CDM cannot be excluded.",
      "pdf_url": "https://arxiv.org/pdf/2602.12238.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12277",
      "title": "Reionization Bubbles from Real-Space Cross Correlations of Line Intensity Maps",
      "authors": [
        "Emilie Thélie",
        "Sarah Libanore",
        "Yonatan Sklansky",
        "Julian B. Muñoz",
        "Ely D. Kovetz"
      ],
      "abstract": "Reionization Bubbles from Real-Space Cross Correlations of Line Intensity Maps Emilie Thélie, Sarah Libanore, Yonatan Sklansky, Julian B. Muñoz, Ely D. Kovetz 11 pages, 8 figures, 1 table. Comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We propose a new way to reconstruct the ionized-bubble size distribution during the Epoch of Reionization (EoR) through the real-space cross-correlation of 21-cm and star-forming line-intensity maps. Understanding the evolution and timing of the EoR is crucial for both astrophysics and cosmology, and a wealth of information on the first sources can be extracted from the study of ionized bubbles. Nevertheless, directly mapping bubbles is challenging due to the high redshifts involved, possible selection biases, and foregrounds in 21-cm maps. Here, we exploit the real-space cross-correlation $\\xi_{21,\\nu}$ between 21-cm and line-intensity mapping (LIM) signals to reconstruct the evolution of bubble sizes during reionization. For the first time, we show that $\\xi_{21,\\nu}(r)$ departs from a saturation level for each separation $r$ when bubbles of size $r$ begin to form, providing a handle for the onset of bubbles of each radius. Moreover, we demonstrate that $\\xi_{21,\\nu}$ evolves from positive to negative as the EoR progresses, reaching a minimum (i.e. maximum anti-correlation) when bubbles of radius $r$ reach peak abundance. We show that these results are robust to changes in the astrophysical model as well as the timing/topology of reionization. This real-space observable complements usual Fourier-space estimators by capturing the localized nature of bubbles, offering new insights into the sources driving cosmic reionization.",
      "pdf_url": "https://arxiv.org/pdf/2602.12277.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11269",
      "title": "The Quasar Proximity Effect as an Alternative Probe of Quasar Pair Distances",
      "authors": [
        "Huanqing Chen",
        "Camille Avestruz",
        "Jakob Wiest"
      ],
      "abstract": "The Quasar Proximity Effect as an Alternative Probe of Quasar Pair Distances Huanqing Chen, Camille Avestruz, Jakob Wiest 8 pages, 4 figures, comments welcome Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recently discovered quasar pairs at high redshifts ($z\\gtrsim$5) are likely precursors to supermassive black hole mergers, providing a promising window to high redshift quasar growth mechanisms. However, the large uncertainties on their relative distances along the line-of-sight ($d_{\\rm l.o.s.}$) limits our ability to characterize quasar pairs. In this study, we explore synthetic quasar proximity zone spectra as an alternative method to constrain the line-of-sight distance of quasar pairs. We find that for small sky-plane separations ($d_{\\rm sky}\\approx 10-100$ pkpc), a simple peak finding algorithm can easily distinguish between scenarios of $d_{\\rm l.o.s.} \\lesssim1$ pMpc and $\\gtrsim1$ pMpc. For cases where the true $d_{\\rm l.o.s.} \\geq 3$ pMpc, the accuracy of $d_{\\rm l.o.s.}$ estimation is $\\approx 0.2$ pMpc. Large sky-plane separations of $d_{\\rm sky}=1$ pMpc have larger absolute uncertainties in $d_{\\rm l.o.s.}$ estimates, but the method can still easily distinguish between scenarios where $d_{\\rm l.o.s.}\\lesssim4$ pMpc and $\\gtrsim4$ pMpc. $d_{\\rm l.o.s.}$ estimates have an uncertainty of $\\approx$0.5 pMpc when true $d_{\\rm l.o.s.} \\gtrsim4$ pMpc. Our proof-of-concept study illustrates the potential use of quasar proximity zones to constrain the 3-dimensional quasar pair configuration, providing an avenue to characterize quasar pairs.",
      "pdf_url": "https://arxiv.org/pdf/2602.11269.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11273",
      "title": "Tailored mass estimators for Milky Way dwarf Spheroidals",
      "authors": [
        "Sofia L. Splawska",
        "Raphaël Errani",
        "Jorge Peñarrubia",
        "Matthew G. Walker"
      ],
      "abstract": "Tailored mass estimators for Milky Way dwarf Spheroidals Sofia L. Splawska, Raphaël Errani, Jorge Peñarrubia, Matthew G. Walker 14 pages, 8 figures. submitted to ApJ, comments welcome Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Assuming spherical symmetry and dynamical equilibrium within a given gravitational potential, a dwarf spheroidal (dSph) galaxy's globally averaged stellar velocity dispersion depends entirely on the shape of its stellar density profile. Thus, the dynamical inference of a dSph's gravitational potential is necessarily sensitive to assumptions about that shape. Relaxing standard assumptions, we fit flexible stellar density models to observations of the Milky Way's known dSph satellites. Considering various choices for the density profile shape and spatial extent of a host dark matter halo, we use the virial theorem to propagate observational uncertainties about the shapes of the inferred dSph stellar density profiles to uncertainties in the inferred dynamical masses. We find that the observed structural diversity of the Milky Way dSph population implies a large range of potential systematic errors (up to factors of 10) associated with standard dynamical mass estimators. We show that accounting for these observational and systematic uncertainties can significantly alter the appearance and behavior of dSph dynamical scaling relations, including enclosed dynamical mass vs. stellar mass and the Radial Acceleration Relation.",
      "pdf_url": "https://arxiv.org/pdf/2602.11273.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.03969",
      "title": "Differentiable Fuzzy Cosmic-Web for Field Level Inference",
      "authors": [
        "P. Rosselló",
        "F.-S. Kitaura",
        "D. Forero-Sánchez",
        "F. Sinigaglia",
        "G. Favole"
      ],
      "abstract": "Differentiable Fuzzy Cosmic-Web for Field Level Inference P. Rosselló, F.-S. Kitaura, D. Forero-Sánchez, F. Sinigaglia, G. Favole Cosmology and Nongalactic Astrophysics (astro-ph.CO) A comprehensive analysis of the cosmological large-scale structure derived from galaxy surveys involves field-level inference, which requires a forward modelling framework that simultaneously accounts for structure formation and tracer bias. While structure formation models are well-understood, the development of an effective field-level bias model remains challenging within Bayesian reconstruction methods, which we address in this work. To bridge this gap, we have developed a differentiable model that integrates augmented Lagrangian perturbation theory, nonlinear, nonlocal, and stochastic biasing. At the core of our approach is the HICOBIAN model, which provides a description of a field with a positive number of tracers while incorporating a long- and short-range nonlocal framework and deviations from Poissonity in the likelihood. A key insight of our model is that transitions between cosmic-web regions are inherently smooth, which we implement using sigmoid-based gradient operations. This enables a fuzzy, and, hence, differentiable hierarchical cosmic-web description, making the model well-suited for machine learning frameworks. We test the practical implementation of this model through GPU-accelerated computations implemented in JaX, the BRIDGE code, enabling scalable evaluation of complex biasing. Our approach accurately reproduces the primordial density field within associated error bars derived from Bayesian posterior sampling within a self-specified setting as validated by two- and three-point statistics in Fourier space. Furthermore, we demonstrate that the methodology approaches the maximum encoded information consistent with Poisson noise. We also demonstrate that the bias parameters of a higher-order nonlocal bias model can be accurately reconstructed within the Bayesian framework for bias models with eight parameters.",
      "pdf_url": "https://arxiv.org/pdf/2506.03969.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.12283",
      "title": "How the cosmic voids contribute to stalling and quenching the giant galaxies on their surfaces",
      "authors": [
        "Geonwoo Kang",
        "Jounghun Lee"
      ],
      "abstract": "How the cosmic voids contribute to stalling and quenching the giant galaxies on their surfaces Geonwoo Kang, Jounghun Lee (Seoul National University) Accepted for publication in JCAP, 17 figures, 6 tables, high-z results included and redshift-space effect as well as dependence on void-finding algorithms taken into account in the revision Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We report a numerical hint that the formations of cosmic voids may be closely linked with the mechanism through which the giant galaxies on void surfaces establish elliptical shapes, redder colors, and lower specific star formation rates (sSFR). Identifying the voids from the TNG300-1 simulations via the Void-Finder algorithm~\\cite{HV02} at $z=0$, $0.5$ and $1$, we explore if and how the shapes of the TNG galaxies located on void surfaces are aligned with the directions toward the void centers. Noting that only the giant void-surface galaxies with stellar masses $M_{\\star}\\ge 10^{10.5}\\,h^{-1}\\,M_{\\odot}$ exhibit significant tendency of perpendicular alignments, we dichotomize them into two $M_{\\star}$-controlled samples according to their morphologies (elliptical or spiral), colors (redder or bluer), sSFR (lower or higher) and stellar ages (older or younger). It is found at all of the three redshifts that the perpendicular alignments of void-surface galaxies become stronger for the cases that they have elliptical shapes, redder colors, and lower sSFR, but showing weak dependence on the stellar ages. It is also shown that the numerical results are well described by the analytical one-parameter model developed by Lee~\\cite{lee19} under the assumption of the existence of a linear scaling between the covariance matrices of galaxy shape axes and local tidal tensors. We test the robustness of alignment signals against the variation of void-finder algorithms and its feasibility against the redshift-space and projection effects. Our results lead us to speculate that the formation and expansion of voids may have an effect of stalling and quenching the giant void-surface galaxies by compressing adjacent matter and then preventing them from radial infall/accretion.",
      "pdf_url": "https://arxiv.org/pdf/2508.12283.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.01441",
      "title": "Galaxy assembly bias in cosmological hydrodynamical simulations: a comparison between SIMBA and IllustrisTNG",
      "authors": [
        "Hong-Gang Yang",
        "Marcos Pellejero",
        "John Peacock",
        "Romeel Davé"
      ],
      "abstract": "Galaxy assembly bias in cosmological hydrodynamical simulations: a comparison between SIMBA and IllustrisTNG Hong-Gang Yang, Marcos Pellejero, John Peacock, Romeel Davé 13 pages, 12 figures, accepted for publication in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Modelling of large-scale structure is increasingly concerned with galaxy assembly bias (GAB), the dependence of galaxy clustering on quantities other than halo mass. We investigate how baryonic physics affects the strength and redshift evolution of GAB using the largest runs of two state-of-the-art cosmological hydrodynamical simulations: SIMBA and IllustrisTNG. We quantify GAB by comparing the clustering of stellar-mass-selected galaxies to that of shuffled samples, where galaxies are randomly reassigned to haloes of similar mass. We find that GAB in both simulations increases from approximately zero at $z=5$ to a $\\sim\\,5\\%$ change in clustering amplitude at $z=2$. After this epoch, the trends diverge: GAB in TNG continues to increase, reaching $\\sim\\,10\\%$ at $z=0$, while in SIMBA it decreases to nearly zero. By further shuffling galaxies within bins of halo mass and cosmic environment -- characterised by smoothed matter overdensity ($\\delta_5$) and tidal anisotropy ($\\alpha_5$) -- we show that most of the GAB in both simulations can be attributed to the overdensity, while tidal anisotropy contributes negligibly in both simulations. Exploring this effect from the point of view of the halo occupation distribution (HOD), we find that numbers of central and satellite galaxies vary with overdensity -- but only near the respective turn-on masses for these two constituents: the galaxy contents of high-mass haloes are very nearly independent of environment. We present a simple parameterisation that allows the HOD modelling to be modified to reflect this form of density-dependent GAB.",
      "pdf_url": "https://arxiv.org/pdf/2511.01441.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.19332",
      "title": "Revisiting model-independent constraints on spatial curvature and cosmic ladders calibration: updated and forecast analyses",
      "authors": [
        "Arianna Favale",
        "Adrià Gómez-Valent",
        "Marina Migliaccio"
      ],
      "abstract": "Revisiting model-independent constraints on spatial curvature and cosmic ladders calibration: updated and forecast analyses Arianna Favale, Adrià Gómez-Valent, Marina Migliaccio 16 pages, 6 figures, 5 tables. New Appendix A and C. Updated to match version accepted by MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO) Model-independent approaches have gained increasing attention as powerful tools to investigate persistent tensions between cosmological observations and the predictions of $\\Lambda$CDM. Notably, recent DESY5 Type Ia Supernovae (SNIa) and DESI Baryon Acoustic Oscillation (BAO) data challenge the validity of the cosmological constant, and they remain in tension with SH0ES local distance ladder measurements under standard pre-recombination physics. Building on our previous work, MNRAS 523 (2023) 3, 3406-3422, we present a follow-up analysis of the model-independent calibration of the local and inverse distance ladders using cosmic chronometers (CCH) data and Gaussian Processes. We jointly constrain the SNIa absolute magnitude, $M$, the comoving sound horizon at the baryon-drag epoch, $r_d$, and the spatial curvature parameter, $\\Omega_k$, using CCH with DESY5 and DESI DR1/DR2. We find this data combination compatible with a flat universe at $\\sim1.7\\sigma$, with $\\Omega_k=-0.143\\pm0.085$, showing weaker compatibility than with Pantheon+, while the ladder calibrators read $M=-19.324_{-0.095}^{+0.092}$ and $r_d=(144.00^{+5.38}_{-4.88}$) Mpc. Although current uncertainties limit the precision of our constraints and prevent us from arbitrating the Hubble tension, it is nevertheless instructive to explore the constraining power of our methodology with future SNIa, CCH, and BAO from surveys such as LSST, Euclid, and DESI. We present the first forecast analysis for the triad $(M,\\Omega_k,r_d)$, finding that, in an optimistic scenario, upcoming data will improve agnostic constraints on $M$ by $\\sim$54% and on $r_d$ by $\\sim$66%, enabling a $\\sim2$% determination of $H_0$. Precision on $\\Omega_k$ will increase by $\\sim50$%. Our analysis outlines which improvements in future data - whether in quality, quantity, or redshift coverage - are likely to most effectively tighten these constraints.[abridged]",
      "pdf_url": "https://arxiv.org/pdf/2511.19332.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.14578",
      "title": "Kinematic Reconstruction of $Λ(t)$CDM Models",
      "authors": [
        "P. A. S. Guillen",
        "J. F. Jesus",
        "R. Valentim"
      ],
      "abstract": "Kinematic Reconstruction of $Λ(t)$CDM Models P. A. S. Guillen, J. F. Jesus, R. Valentim Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work, we have \\textbf{analysed} two kinematic parametrizations for $\\Lambda(t)$CDM models, namely, the linear expansions $\\Lambda(z)=\\Lambda_0+\\Lambda_1z$ and $Q(z)=Q_0+Q_1z$, where $Q$ is the interaction term. In the case of the $Q(z)$ parametrization, we have also tested the particular case of a constant interaction term, $Q(z)=Q_0$. In order to constrain the free parameters of these models, we have used Cosmic Chronometers (CC), SNe Ia data (Pantheon+\\&SH0ES) and BAO data. As a general result, we have found weak constraints over the free parameters of the analysed models. In the case of $\\Lambda(z)$, we have found for the $\\Lambda$ variation parameter, $\\Omega_{\\Lambda1}\\equiv\\frac{\\Lambda_1}{3H_0^2}=0.02\\pm0.14$. In the case of the $Q(z)$ parametrization, we have worked with the dimensionless interaction term $\\gQ(z)\\equiv\\frac{8\\pi GQ(z)}{3H_0^3}$, from which we have found $\\gQ_0 = 2.2 \\pm 2.7$ and $\\gQ_1 = -6.2 \\pm 7.6$. In the particular case of a constant interaction term, we have found $\\gQ_0 = 0.18 \\pm 0.7$. All these constraints are at 68\\% c.l. The constraints we have obtained are compatible with the standard $\\Lambda$CDM model, although still providing a large margin for $\\Lambda$ variation.",
      "pdf_url": "https://arxiv.org/pdf/2512.14578.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11259",
      "title": "3D insights into SN 1987A: ALMA observations compared to hydrodynamical explosion simulations",
      "authors": [
        "R. Wesson , M. Gabler , M. Lyons , J. Wildman , Mikako Matsuura , H.-T. Janka , B. Giudici , P. Cigan , H.L. Gomez , R. Indebetouw , A.M.S. Richards , A. Wongwathanarat Cardiff University, UK, University College London, UK, Maynooth University, Ireland, Universitat de València, Spain, MPI for Astrophysics, Garching, Germany, U.S. Naval Observatory, United States, National Radio Astronomy Observatory, United States, University of Virginia, United States, University of Manchester, UK)"
      ],
      "abstract": "3D insights into SN 1987A: ALMA observations compared to hydrodynamical explosion simulations R. Wesson (1,2,3), M. Gabler (4), M. Lyons (1), J. Wildman (1), Mikako Matsuura (1), H.-T. Janka (5), B. Giudici (4), P. Cigan (6), H.L. Gomez (1), R. Indebetouw (7,8), A.M.S. Richards (9), A. Wongwathanarat (5) ((1) Cardiff University, UK, (2) University College London, UK, (3) Maynooth University, Ireland, (4) Universitat de València, Spain, (5) MPI for Astrophysics, Garching, Germany, (6) U.S. Naval Observatory, United States, (7) National Radio Astronomy Observatory, United States, (8) University of Virginia, United States, (9) University of Manchester, UK) 25 pages, 26 figures. Submitted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) We obtain three-dimensional distributions of CO and SiO molecules from high spatial resolution (0.03--0.06\") ALMA observations of SN 1987A at two different epochs. The evolution between these two epochs is consistent with homologous expansion. From these 3D maps, we reconstruct the 3D mass distributions of the ejecta in CO and SiO molecules, which we compare with those obtained by state-of-the-art, long-time hydrodynamical supernova explosion models computed with the Prometheus-HotB code for 10 different progenitors, including both red and blue supergiants. The models which best match the mass distributions correspond to explosions of binary-merger blue supergiant progenitors; at least two such models approximately reproduce the observed CO morphology. In contrast, the SiO velocity distribution and morphology are not as well reproduced in these models, indicating insufficient mixing of Si into the outer layers already at the progenitor stage. The theoretical models suggest a strong correlation between the centre of mass of the densest carbon- and oxygen-rich ejecta and the direction of the neutron-star kick. If such a correlation also applies to the CO emission in the ejecta of SN 1987A, the kick of the compact remnant is expected to point towards the observer, at an angle of approximately $45^\\circ$ to the north.",
      "pdf_url": "https://arxiv.org/pdf/2602.11259.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11274",
      "title": "Evolution of the transitional millisecond pulsar PSR J1023+0038 from Aqueye+ and NICER observations",
      "authors": [
        "Silvia Conforti",
        "Luca Zampieri",
        "Michele Fiori",
        "Alessia Spolon",
        "Giampiero Naletto",
        "Aleksandr Burtovoi"
      ],
      "abstract": "Evolution of the transitional millisecond pulsar PSR J1023+0038 from Aqueye+ and NICER observations Silvia Conforti, Luca Zampieri, Michele Fiori, Alessia Spolon, Giampiero Naletto, Aleksandr Burtovoi 8 pages, 4 figures. Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE) Transitional millisecond pulsars (tMSPs) are old neutron stars spun up by accretion from a low-mass companion. These objects can switch between two emission regimes: rotation-powered radio pulsar and accreting X-ray pulsar. The origin of their optical and X-ray pulsations is still debated, although one model attributes them to synchrotron emission produced in a shock between the pulsar wind and the accretion flow. The small phase lag observed between optical and X-ray pulses in PSR J1023+0038 supports a common origin. We present a new measurement of the phase lag between optical and X-ray pulse profiles of PSR J1023+0038 and investigate the evolution of the time of passage at the ascending node ($T_{\\rm{asc}}$) up to 2023. We performed a timing analysis of optical observations obtained with Aqueye+ between 2021 and 2023 and of X-ray data from NICER in 2023. We derive updated values of $T_{\\rm{asc}}$ and measure the optical - X-ray phase lag from simultaneous observations. We find that $T_{\\rm{asc}}$ increases by about 20 s per year. In January 2023, we measure a phase lag of $0.067 \\pm 0.018$, corresponding to $112.3 \\pm 30.7\\,\\mu$s. Since 2017, the evolution of $T_{\\rm{asc}}$ follows a parabolic trend, indicating an increase in the orbital period and orbital separation of the system. This behaviour is consistent with non-conservative Roche-lobe overflow, with the donor losing mass at a rate much higher than the accretion rate. The phase lag measurement further supports a common origin of the optical and X-ray pulsations.",
      "pdf_url": "https://arxiv.org/pdf/2602.11274.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11474",
      "title": "Unification Model of Active Galactic Nuclei by Photoionization Equilibrium Calculation Based on Radiative Hydrodynamic Simulations",
      "authors": [
        "Atsushi Tanimoto",
        "Keiichi Wada",
        "Yuki Kudoh",
        "Nozomu Kawakatu",
        "Mariko Nomura",
        "Hirokazu Odaka"
      ],
      "abstract": "Unification Model of Active Galactic Nuclei by Photoionization Equilibrium Calculation Based on Radiative Hydrodynamic Simulations Atsushi Tanimoto, Keiichi Wada, Yuki Kudoh, Nozomu Kawakatu, Mariko Nomura, Hirokazu Odaka 17 pages, 8 figures, accepted by ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) To investigate the origin of the dependence of the covering factor on the Eddington ratio suggested by X-ray observations, we examined the angular distribution of HI and HII based on two-dimensional radiative hydrodynamic simulations. To calculate the Compton-thin covering factor $C_{22}$ and Compton-thick covering factor $C_{24}$ of HI alone, we performed one-dimensional photoionization equilibrium calculations with the XSTAR code based on radiative hydrodynamic simulations. The results obtained are as follows. (1) The Compton-thin covering factor $C_{22}$ of HI and HII is independent of the Eddington ratio and is approximately $70\\%$, while $C_{22}$ of HI alone is also independent of the Eddington ratio and is approximately $30\\%$. (2) The Compton-thick covering factor $C_{24}$ of HI has the same value as $C_{22}$ of HI. (3) Our $C_{24}$ is consistent with that obtained from X-ray observations. (4) Our $C_{22}$ agrees with that obtained from X-ray observations in a high Eddington ratio, while our $C_{22}$ is smaller than that from X-ray observations in a low Eddington ratio. (5) To explain the difference between $C_{22}$ obtained from theoretical calculations and that inferred from X-ray observations, a Compton-thin gas is required in regions extending at least $10~\\mathrm{pc}$ beyond the current computational regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.11474.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11529",
      "title": "Searching for Anisotropy in the Gravitational Wave Background Using the Parkes Pulsar Timing Array",
      "authors": [
        "Yiqin Chen",
        "Shi-Yi Zhao",
        "Zhi-Zhang Peng",
        "Xingjiang Zhu",
        "N. D. Ramesh Bhat",
        "Zu-Cheng Chen",
        "Małgorzata Curyło",
        "Valentina Di Marco",
        "George Hobbs",
        "Agastya Kapur",
        "Wenhua Ling",
        "Rami Mandow",
        "Saurav Mishra",
        "Daniel J. Reardon",
        "Christopher J. Russell",
        "Ryan M. Shannon",
        "Jacob Cardinal Tremblay",
        "Jingbo Wang",
        "Lei Zhang",
        "Andrew Zic"
      ],
      "abstract": "Searching for Anisotropy in the Gravitational Wave Background Using the Parkes Pulsar Timing Array Yiqin Chen, Shi-Yi Zhao, Zhi-Zhang Peng, Xingjiang Zhu, N. D. Ramesh Bhat, Zu-Cheng Chen, Małgorzata Curyło, Valentina Di Marco, George Hobbs, Agastya Kapur, Wenhua Ling, Rami Mandow, Saurav Mishra, Daniel J. Reardon, Christopher J. Russell, Ryan M. Shannon, Jacob Cardinal Tremblay, Jingbo Wang, Lei Zhang, Andrew Zic Accepted for publication in Physical Review D. 11 pages, 5 figures High Energy Astrophysical Phenomena (astro-ph.HE) In recent years, several pulsar timing array collaborations have reported evidence for a nanohertz gravitational wave background (GWB). Such a background signal could be produced by supermassive binary black holes, early-Universe processes such as inflation and phase transitions, or a mixture of both. One way to disentangle different contributions to the GWB is to search for anisotropic signatures. In this work, we search for anisotropy in the GWB using the third data release of the Parkes Pulsar Timing Array. Our analysis employs both the radiometer method and the spherical harmonic basis to characterize the distribution of GWB power across the sky. We calculate the angular power in the lowest five frequency bins and compare it with detection thresholds determined under the null hypothesis of isotropy. In the 5.26 nHz frequency bin, we identify a hotspot in the reconstructed sky map with a $p$-value of $0.016$ (the lowest in our analysis), which we attribute to noise fluctuations. While our search reveals no statistically significant anisotropy, we expect that the precise measurement of angular power spectrum of the GWB will become instrumental in determining the origin of the nanohertz GWB signal.",
      "pdf_url": "https://arxiv.org/pdf/2602.11529.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.11624",
      "title": "Understanding coronal geometry in NGC 4593 using Fourier frequency-resolved covariance and time-lag spectral analysis",
      "authors": [
        "Shree Suman",
        "Mayukh Pahari",
        "Gulab Dewangan",
        "Ian M McHardy"
      ],
      "abstract": "Understanding coronal geometry in NGC 4593 using Fourier frequency-resolved covariance and time-lag spectral analysis Shree Suman (IIT Hyderabad), Mayukh Pahari (IIT Hyderabad), Gulab Dewangan (IUCAA, Pune), Ian M McHardy (University of Southampton, UK) 21 pages, 9 tables, 12 figures, accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Understanding disc-corona geometry through X-ray reverberation variability studies in Seyfert galaxies is crucial, yet our knowledge mostly relies on flux-averaged mean spectral analysis. In this study, we investigate the origin of the large X-ray variability of the Seyfert 1 galaxy NGC 4593 using two \\xmm{} observations, which are at least 65 ksec long and have a 0.3-10 keV X-ray flux difference by a factor of $\\sim$2.5. We extracted mean spectra, Fourier-frequency resolved covariance, and time-lag spectra and performed modelling of all spectra in a self-consistent manner. From the best-fit covariance spectra, we have shown that energy-dependent covariance during low flux shows dominances of direct powerlaw continuum over reflection continuum at all Fourier frequencies (2.1 $-$ 390 $\\times$ 10$^{-5}$ Hz). However, during high flux, the variabilities are dominated by the reflection components most of the time. Our results are further supported by the Fourier frequency-dependent time-lag (between soft: 0.3-1 keV and hard: 1-5 keV bands) spectral modeling during high and low fluxes. A significant change is observed in the X-ray reverberation delay timescale from 483 $\\pm$ 135 sec (during high flux) to $<$96 sec (during low flux), indicating a change in coronal size at least by a factor of $\\sim$2 (from $<$3.3 R$_g$ to $>$7.2 R$_g$) during low to high flux transitions.",
      "pdf_url": "https://arxiv.org/pdf/2602.11624.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11765",
      "title": "Population synthesis predictions of the Galactic compact binary gravitational wave foreground detectable by LISA",
      "authors": [
        "Jake McMillan , Adam Ingram , Cordelia Dashwood Brown , Andrei Igoshev , Matthew Middleton , Grzegorz Wiktorowicz , Simone Scaringi School of Mathematics, Statistics, and Physics, Newcastle University, Centre for Advanced Instrumentation, Department of Physics, Durham University, School of Physics and Astronomy, University of Southampton, Nicolaus Copernicus Astronomical Center, Polish Academy of Sciences, Centre for Extragalactic Astronomy, Department of Physics, Durham University, INAF - Osservatorio Astronomico di Capodimonte)"
      ],
      "abstract": "Population synthesis predictions of the Galactic compact binary gravitational wave foreground detectable by LISA Jake McMillan (1 and 2), Adam Ingram (1), Cordelia Dashwood Brown (3), Andrei Igoshev (1), Matthew Middleton (3), Grzegorz Wiktorowicz (4), Simone Scaringi (5 and 6) ((1) School of Mathematics, Statistics, and Physics, Newcastle University, (2) Centre for Advanced Instrumentation, Department of Physics, Durham University, (3) School of Physics and Astronomy, University of Southampton, (4) Nicolaus Copernicus Astronomical Center, Polish Academy of Sciences, (5) Centre for Extragalactic Astronomy, Department of Physics, Durham University, (6) INAF - Osservatorio Astronomico di Capodimonte) High Energy Astrophysical Phenomena (astro-ph.HE) We use population synthesis modelling to predict the gravitational wave (GW) signal that the Laser Interferometer Space Antenna (LISA) will detect from the Galactic population of compact binary systems. We implement a realistic star formation history with time and position-dependent metallicity, and account for the effect of supernova kicks on present-day positions. We consider all binaries that have a white dwarf (WD), neutron star (NS), or black hole primary in the present-day. We predict that the summed GW signal from all Galactic binaries will already be detectable 3 months into the LISA mission, by measuring the power spectrum of the total GW strain. We provide a simple publicly available code to calculate such a power spectrum from a user-defined binary population. In the full 4 year baseline mission lifetime, we conservatively predict that $>2000$ binaries could be individually detectable as GW sources. We vary the assumed common envelope (CE) efficiency $\\alpha$, and find that it influences both the shape of the power spectrum and the relative number of detectable systems with WD and NS progenitors. In particular, the ratio of individually detectable binaries with chirp mass $\\mathcal{M} < M_\\odot$ to those with $\\mathcal{M} \\geqslant M_\\odot$ increases with $\\alpha$. We therefore conclude that LISA may be able to diagnose the CE efficiency, which is currently poorly constrained.",
      "pdf_url": "https://arxiv.org/pdf/2602.11765.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.11809",
      "title": "Impact of crust-core connection procedures on the tidal deformability of neutron stars",
      "authors": [
        "Junbo Pang",
        "Hong Shen",
        "Jinniu Hu"
      ],
      "abstract": "Impact of crust-core connection procedures on the tidal deformability of neutron stars Junbo Pang, Hong Shen, Jinniu Hu 14 pages, 10 figures, 3 tables, has been accepted by Physical Review C High Energy Astrophysical Phenomena (astro-ph.HE) We study the impact of crust-core connection procedures on various neutron-star properties, especially on the tidal deformability. We consider three types of connection procedures to treat the discontinuity in a nonunified equation of state around the crust-core transition: (1) the direct connection procedure, (2) the crossover connection procedure, and (3) the segmented method. Our results indicate that the mass-radius relations of neutron stars are almost unaffected by the details of the connection procedure. However, the tidal deformabilities of neutron stars are sensitive to the crust-core connection procedures. The tidal deformability is closely related to gravitational-wave measurements. For a canonical 1.4$M_\\odot$ neutron star, uncertainties in the tidal deformability $\\Lambda_{1.4}$ from different connection procedures can exceed 20\\%. We find that the direct connection procedure yields significantly larger uncertainties in the tidal deformability, while the segmented method and crossover connection procedure provide relatively stable results.",
      "pdf_url": "https://arxiv.org/pdf/2602.11809.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.11847",
      "title": "Monitoring the upper atmospheric temperature and interplanetary magnetic field with the GRAPES-3 muon telescope",
      "authors": [
        "S. Paul",
        "K.P. Arunbabu",
        "M. Chakraborty",
        "S.K. Gupta",
        "B. Hariharan",
        "Y. Hayashi",
        "P. Jagadeesan",
        "A. Jain",
        "M. Karthik",
        "H. Kojima",
        "S. Kawakami",
        "P.K. Mohanty",
        "Y. Muraki",
        "P.K. Nayak",
        "T. Nonaka",
        "A. Oshima",
        "M. Rameez",
        "K. Ramesh",
        "S. Shibata",
        "K. Tanaka"
      ],
      "abstract": "Monitoring the upper atmospheric temperature and interplanetary magnetic field with the GRAPES-3 muon telescope S. Paul, K.P. Arunbabu, M. Chakraborty, S.K. Gupta, B. Hariharan, Y. Hayashi, P. Jagadeesan, A. Jain, M. Karthik, H. Kojima, S. Kawakami, P.K. Mohanty, Y. Muraki, P.K. Nayak, T. Nonaka, A. Oshima, M. Rameez, K. Ramesh, S. Shibata, K. Tanaka High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Galactic Cosmic Rays (GCRs) have to travel through the heliosphere before they interact with the Earth's atmosphere. During this, they are deflected by the Sun's magnetic field, causing variations in this field to imprint on the flux, spectrum and angular distribution of GCRs detected at or near Earth. Studies of these variations over the past several decades have revealed the impact of both transient phenomena such as solar flares, coronal holes, sunspot activity and coronal mass ejections (CMEs) as well as their effects such as Forbush Decreases (FDs), precursors and Ground-Level Enhancements (GLEs). Periodic variations, such as due to the solar diurnal modulation, the 27-day solar rotation, the 11-year solar cycle, and the 22-year solar magnetic cycle have also been characterized. These Sun-induced phenomena are most prominent in GCR intensity variations up to $\\sim$30 GeV/nuc, beyond which the influence of solar modulation decreases rapidly as the gyro-radii of GCRs exceed the characteristic size of the heliosphere ($\\sim$100 AU).",
      "pdf_url": "https://arxiv.org/pdf/2602.11847.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11876",
      "title": "Spectro-timing origin of large amplitude X-ray variability in GRS 1915+105 using AstroSat/LAXPC and SXT",
      "authors": [
        "Shree Suman",
        "Shuvajit Khatua",
        "Vishal Jadoliya",
        "Prathamesh Narayan Gupta",
        "Mayukh Pahari"
      ],
      "abstract": "Spectro-timing origin of large amplitude X-ray variability in GRS 1915+105 using AstroSat/LAXPC and SXT Shree Suman (IIT Hyderabad), Shuvajit Khatua (RRI Bangalore), Vishal Jadoliya (IIT Hyderabad), Prathamesh Narayan Gupta (DTU New Delhi), Mayukh Pahari (IIT Hyderabad) 22 pages, 9 figures, 6 tables. Accepted for publication in Research in Astronomy and Astrophysics (RAA) High Energy Astrophysical Phenomena (astro-ph.HE) The origin of the large-amplitude, quasi-periodic X-ray flux variations in several classes of the Galactic microquasar GRS~1915+105 remains unresolved. We address this issue through flux-resolved, broadband (0.8-20 keV) spectral modelling and simultaneous covariance spectral analysis during two $\\kappa$ and two $\\omega$ class observations using \\textit{AstroSat}/SXT and LAXPC. The lightcurves show strong, quasi-periodic oscillations involving rapid transitions between bright bursts and deep dips on timescales of a few tens of seconds. Flux-resolved spectroscopy indicates that high-flux intervals in both classes are dominated by a hot, optically thick accretion disc with steep Comptonized emission, whereas low-flux intervals correspond to a cooler or partially recessed disc and a harder coronal continuum. These transitions involve a systematic 1-2 keV drop in disc temperature and a pronounced hardening of the Comptonized component, with flux reductions of up to a factor of five. Using covariance spectra across 0.015-5 Hz, we show that the rapid coherent variability arises almost entirely from the disc, which exhibits strong energy-dependent variations, while the Comptonized component contributes minimally. The combined results suggest that radiation-pressure-driven structural changes in the disc, with a slower coronal response, produce the observed oscillations, consistent with cyclic disc evacuation and refilling in the $\\kappa$ and $\\omega$ classes.",
      "pdf_url": "https://arxiv.org/pdf/2602.11876.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12051",
      "title": "The Interstellar Scintillation of the Radio-Loud Magnetar XTE J1810-197",
      "authors": [
        "Rui Wang",
        "Zhen Yan",
        "Zhiqiang Shen",
        "Zhenlong Liao",
        "Zhipeng Huang",
        "Yajun Wu",
        "Rongbing Zhao",
        "Xiaowei Wang",
        "Jie Liu",
        "Kuo Liu",
        "Fan Yang",
        "Yangyang Lin",
        "Chuyuan Zhang"
      ],
      "abstract": "The Interstellar Scintillation of the Radio-Loud Magnetar XTE J1810-197 Rui Wang, Zhen Yan, Zhiqiang Shen, Zhenlong Liao, Zhipeng Huang, Yajun Wu, Rongbing Zhao, Xiaowei Wang, Jie Liu, Kuo Liu, Fan Yang, Yangyang Lin, Chuyuan Zhang 7 pages, 5 figures, accepted by Chinese Physics Letters High Energy Astrophysical Phenomena (astro-ph.HE) We present a comprehensive interstellar scintillation (ISS) study of the radio-loud magnetar XTE~J1810$-$197, based on six years of multi-frequency monitoring (2018$-$2024) with the Shanghai Tian Ma Radio Telescope (TMRT) at 7.0, 8.6, and 14.0~GHz. The scintillation parameters--decorrelation bandwidth $\\Delta\\nu_{\\rm d}$, decorrelation time $\\Delta\\tau_{\\rm d}$, and drift rate $dt/d\\nu$--are fully characterized. Our measured $\\Delta\\tau_{\\rm d}$ implies $\\Delta\\tau_{\\rm d} < 4$~s at 575-725~MHz under a Kolmogorov spectrum, which is shorter than the magnetar's 5.54~s spin period. This result naturally explains the previously reported absence of pulse-to-pulse coherence at these frequencies. Kinematic modeling locates the dominant scattering screen at $1.6\\pm0.1$~kpc away from the Earth, within the Sagittarius Arm. The screen coincides with the HII region JCMTSE~J180921.2$-$201932 and is unrelated to the magnetar's 2018 outburst suggested by earlier studies. A scintillation arc detected at 14.0~GHz represents the highest-frequency arc observed to date. The asymmetry of arcs is linearly correlated with a dispersion-measure gradient across the screen ($r = 0.959$, $p < 10^{-8}$). We also measure its refractive scintillation timescale, which is only $1.21\\pm0.19$~d. Clear DISS at 14~GHz effectively resolves the debate over a possible strong-to-weak scattering transition at this frequency. These results extend the ISS characterization of magnetars to previously unexplored frequencies and provide a precise probe of the ionized interstellar medium in the Sagittarius Arm.",
      "pdf_url": "https://arxiv.org/pdf/2602.12051.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12165",
      "title": "Poloidal Field Amplification through Compression-Shear Dynamics in Schwarzschild Accretion: Pathways to MAD States",
      "authors": [
        "Malihe Mousapour Gharghabi",
        "Jamshid Ghanbari",
        "Mahboobe Moeen Moghaddas"
      ],
      "abstract": "Poloidal Field Amplification through Compression-Shear Dynamics in Schwarzschild Accretion: Pathways to MAD States Malihe Mousapour Gharghabi, Jamshid Ghanbari, Mahboobe Moeen Moghaddas High Energy Astrophysical Phenomena (astro-ph.HE) The amplification of magnetic fields in black hole accretion flows governs key high-energy phenomena such as magnetically arrested disks and relativistic jets. We develop a semi-analytical general relativistic framework that extends classical compressional amplification models by incorporating rotational shear, and apply it to large-scale poloidal magnetic field evolution in accretion flows around a Schwarzschild black hole. By parameterizing the azimuthal velocity as a fraction of the Keplerian value ($\\xi \\in [0,1]$), from purely radial infall ($\\xi=0$) to Keplerian rotation ($\\xi=1$), we examine the combined effects of radial compression and shear. Purely radial flows maximize amplification of both $B_r$ and $B_\\theta$ due to strong compression. In rotating flows, a distinct dichotomy emerges: sub-Keplerian regimes ($\\xi<1$) preferentially enhance $B_r$, whereas Keplerian rotation strengthens $B_\\theta$ via shear. The transition from subsonic outer regions to supersonic relativistic inner regions further accelerates magnetic growth, revealing effects absent in earlier analytical treatments. These results show that rotational support controls both amplification efficiency and magnetic geometry, with sub-Keplerian phases particularly favorable for advecting the radial flux required for MAD formation. This work provides an analytical bridge between classical accretion theory and modern GRMHD simulations, with implications for X-ray binaries, AGNs, and EHT-scale systems.",
      "pdf_url": "https://arxiv.org/pdf/2602.12165.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12195",
      "title": "A simple model for extracting astrophysics from black hole images",
      "authors": [
        "Alexandra G. Guerrero",
        "Daniel E. Holz"
      ],
      "abstract": "A simple model for extracting astrophysics from black hole images Alexandra G. Guerrero, Daniel E. Holz High Energy Astrophysical Phenomena (astro-ph.HE) The Event Horizon Telescope (EHT) is providing unprecedented high-resolution images of supermassive black holes. These images are fundamentally related to properties of the luminous accretion disks, since black holes themselves produce no light. We develop a simple prescription to relate observational features of black hole images to a toy model for the intensity profile of the associated accretion disk. We apply our model to the original EHT image of M87*, as well as to the reanalyzed image from the PRIMO algorithm, providing generic, simultaneous constraints on the mass of the black hole and properties of the accretion disk emission. While current images lack the resolution to confidently detect the photon ring, the consideration of multiple image parameters are found to contain enough information to provide constraints on the inner edge of the accretion disk along with the black hole mass. Using observed features of the original EHT image, we constrain the mass of M87* to be $6.6^{+1.2}_{-1.0}\\times 10^9 M_\\odot$ to 68$\\%$ confidence, and find that emission may extend all the way to the black hole horizon. When instead using constraints from the PRIMO algorithm's image along with constraints on the brightness asymmetry provided by the original EHT analysis, we find M87*'s mass to be $ 6.4^{+0.7}_{-0.7}\\times 10^9 M_\\odot$ to 68$\\%$ confidence, with the inner edge of the accretion disk between $3M$ and $5.3M$. Both analyses rule out an inner edge of the accretion disk coinciding with the innermost stable circular orbit for a Schwarzschild black hole. Furthermore, the narrow ring width reported in the PRIMO image also confidently rules out emission increasing all the way down to the black hole horizon. Further assumptions on the mass of M87* and connections between the accretion disk cutoff and physical radii allow for rudimentary black hole spin estimates.",
      "pdf_url": "https://arxiv.org/pdf/2602.12195.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12272",
      "title": "The Wandering Supermassive Black Hole Powering the off-nuclear TDE AT2024tvd",
      "authors": [
        "M. Guolo",
        "A. Mummery",
        "S. van Velzen",
        "M. Nicholl",
        "S. Gezari",
        "Y. Yao",
        "K. C. Chambers",
        "T. de Boer",
        "M. E. Huber",
        "C.-C. Lin",
        "T. B. Lowe",
        "E. A. Magnier",
        "G. Paek",
        "R. Wainscoat"
      ],
      "abstract": "The Wandering Supermassive Black Hole Powering the off-nuclear TDE AT2024tvd M. Guolo, A. Mummery, S. van Velzen, M. Nicholl, S. Gezari, Y. Yao, K. C. Chambers, T. de Boer, M. E. Huber, C.-C. Lin, T. B. Lowe, E. A. Magnier, G. Paek, R. Wainscoat High Energy Astrophysical Phenomena (astro-ph.HE) We present an analysis of the spectral energy distribution (SED) of the off-nuclear tidal disruption event (TDE) AT2024tvd during its late-time plateau phase, combining X-ray spectra and UV/optical photometry. Using a fully relativistic, compact accretion disk model with self-consistent inner-disk Comptonization, we reproduce the observed SED without significant residuals. The inferred black hole mass ${\\rm log}{10}(M{\\bullet}/M_\\odot) \\approx 6.0 \\pm 0.2$, and the inferred disk parameters place AT2024tvd within known TDE-disk scaling relations ($L_{\\rm bol}^{\\rm disk}/L_{\\rm Edd} \\propto T_{\\rm p}^4 \\propto M_{\\bullet}^{-1}$, $L_{\\rm plat} \\propto M_{\\bullet}^{2/3}$, $R_{\\rm out}/r_{\\rm g} \\propto M_{\\bullet}^{-2/3}$). Our results show that: (i) there is no \\textit{detected} star cluster or dwarf galaxy associated with the source, down to a mass limit of $\\log_{10}(M_{\\rm gal}/M_{\\odot}) \\leq 7.6$; (ii) the black hole is a wandering supermassive, rather than intermediate-mass, black hole; and (iii) the source represents an extreme case of black hole-to-host mass ratio, with $M_{\\bullet}/M_{\\rm gal} > 3\\%$, consistent with a heavily tidally stripped nucleus. The latter aligns with cosmological simulations predicting that surviving host remnants of most wandering black holes should not retain a detectable stellar overdensity when located at small halo-centric distances. We discuss differences with previous analyses of this source and highlight why our modeling approach provides a more physically consistent solution with more reliable parameter inference.",
      "pdf_url": "https://arxiv.org/pdf/2602.12272.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12282",
      "title": "Ubiquitous yet forgotten: broad absorptions in the optical spectra of low-mass X-ray binaries",
      "authors": [
        "D. Mata Sanchez",
        "T. Munoz-Darias",
        "J. Casares",
        "M. A. P. Torres",
        "M. Armas Padilla"
      ],
      "abstract": "Ubiquitous yet forgotten: broad absorptions in the optical spectra of low-mass X-ray binaries D. Mata Sanchez, T. Munoz-Darias, J. Casares, M. A. P. Torres, M. Armas Padilla Main text (15 pages, 8 Figures) + Appendix (7 pages, 8 Figures). Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE) Optical outburst spectra of low-mass X-ray binaries enable studies of extreme accretion and ejection phenomena. While some of their spectroscopic features have been analysed in detail, the appearance of broad absorptions in the optical regime has been traditionally neglected. In this work, we introduce the first population study dedicated to these features with the aim to understand their fundamental properties and discuss them in the context of their origin. We complement the study with a spectroscopic database of six low-mass X-ray binaries during outburst, in order to assess their evolution. We find that broad absorptions are ubiquitous, with the majority of black hole low-mass X-ray binaries exhibiting them in spite of a typically scarce outburst coverage. Their detection does not depend on the orbital inclination or the compact object nature, but they seem favoured in systems with orbital periods shorter than < 11 h. They predominantly occur in the hydrogen Balmer series, being stronger at shorter wavelengths, and they are detected across all X-ray states. We find that the normalised depth of these broad absorptions is anti-correlated with the system luminosity, and that they show constant line ratios over the whole sample. Based on these properties, we favour a scenario where BAs arise from a stable, optically thick layer of the accretion disc, below the hotter chromosphere-like region producing the emission line components. Our study is consistent with the continuous presence of broad absorptions during the whole outburst, with their visibility being conditioned by the emission lines filling the broad absorption profile and veiling by the X-ray reprocessed continuum.",
      "pdf_url": "https://arxiv.org/pdf/2602.12282.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11261",
      "title": "BlastBerries: How Supernovae Affect Lyman Continuum Escape Fractions and Ionizing Photon Production in Local Analogs of High-Redshift Galaxies",
      "authors": [
        "Miranda Y. Kong",
        "David O. Jones",
        "Nicole E. Drakos",
        "Sangeeta Malhotra",
        "Kartheik Iyer",
        "Brian C. Lemaux",
        "Rohan P. Naidu",
        "Thomas de Boer",
        "Ken C. Chambers",
        "John Fairlamb",
        "Willem B. Hoogendam",
        "Mark E. Huber",
        "Chien-Cheng Lin",
        "Thomas Bernard Lowe",
        "Eugene A. Magnier",
        "Paloma Mínguez",
        "Gregory S. H. Paek",
        "Angie Schultz",
        "Richard J. Wainscoat"
      ],
      "abstract": "BlastBerries: How Supernovae Affect Lyman Continuum Escape Fractions and Ionizing Photon Production in Local Analogs of High-Redshift Galaxies Miranda Y. Kong, David O. Jones, Nicole E. Drakos, Sangeeta Malhotra, Kartheik Iyer, Brian C. Lemaux, Rohan P. Naidu, Thomas de Boer, Ken C. Chambers, John Fairlamb, Willem B. Hoogendam, Mark E. Huber, Chien-Cheng Lin, Thomas Bernard Lowe, Eugene A. Magnier, Paloma Mínguez, Gregory S. H. Paek, Angie Schultz, Richard J. Wainscoat Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) While compact, star-forming galaxies are believed to play a key role in cosmic reionization, the physical mechanisms enabling the escape of ionizing photons through the galactic interstellar medium remain unclear. Supernova (SN) feedback is one possible mechanism for clearing neutral gas channels to allow the escape of Lyman continuum photons. Here, we use SN discoveries in low-redshift analogs of high-redshift star-forming galaxies -- Green Pea galaxies and their even lower-redshift counterparts, Blueberry (BB) galaxies -- to understand how SNe shape the properties of their host galaxies at high redshifts. We cross-match 1242 BB galaxies with transient discovery reports and identify 11 SNe, ten of which are likely core-collapse SNe, and compare their hosts to the larger BB population. We find that SN-hosting BBs exhibit elevated star formation rates, burstier star formation histories within the last $\\sim$50 Myr, and higher stellar masses. We estimate the occurrence rates of SNe in BB galaxies, finding that the SN rate may be slightly suppressed in BBs compared to field galaxies of similar mass, but we are unable to fully control for observational uncertainties. Finally, SN hosts show bluer UV slopes than non-host BB galaxies at 2.1$\\sigma$ significance and lower ionizing photon production efficiency at 7.9$\\sigma$ significance; the former result offers modest support for the hypothesis that SN-driven feedback plays a role in facilitating the escape of ionizing photons, while the latter may imply that SN-driven quenching decreases the rate of ionizing photon production in compact star-forming galaxies during the epoch of reionization.",
      "pdf_url": "https://arxiv.org/pdf/2602.11261.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11270",
      "title": "The Curious Case of Centaurus A II: On the Subject of the Quenched satellites",
      "authors": [
        "Sachi Weerasooriya",
        "Mia Sauda Bovill",
        "Matthew A. Taylor",
        "Andrew J. Benson",
        "Cameron Leahy",
        "Alexis Vazquez",
        "Niusha Ahvazi",
        "Pamela M. Marcum",
        "Alejandro S. Borlaff"
      ],
      "abstract": "The Curious Case of Centaurus A II: On the Subject of the Quenched satellites Sachi Weerasooriya, Mia Sauda Bovill, Matthew A. Taylor, Andrew J. Benson, Cameron Leahy, Alexis Vazquez, Niusha Ahvazi, Pamela M. Marcum, Alejandro S. Borlaff Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The satellite system of Centaurus A presents a curious cosmological puzzle: while the global population is consistent with theoretical expectations, its inner regions (d<150 kpc) exhibit a deficit of luminous satellite galaxies. Using the Galacticus semi-analytic model applied to high-resolution N-body merger trees, we investigate potential quenching mechanisms to explain this trend. Our fiducial models, calibrated to the Milky Way, reproduce the overall Cen A population but overpredict the number of bright inner-halo satellites by a factor of 4 +- 1 at Mv < -15.8. We find that this is not due to statistical variance. Instead, the spatial coincidence of this deficiency with Cen A's massive, kiloparsec-scale radio lobes suggests a powerful environmental driver. We explore a range of physical scenarios, including enhanced tidal disruption, reionization quenching, and suppressed accretion into halos from the surrounding intergalactic medium. Our results indicate that AGN-driven thermal feedback at z < 5 can significantly suppress star formation in satellites, effectively truncating the bright end of the inner luminosity function. Our work suggests that the \"Curious Case of Centaurus A\" may provide evidence of AGN feedback within the host galaxy that regulates the survival and evolution of its dwarf galaxy satellites.",
      "pdf_url": "https://arxiv.org/pdf/2602.11270.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11341",
      "title": "Filling The Pockets: The Spherical Nature of 3D Deflagration in Thermonuclear Supernovae",
      "authors": [
        "S. Shiber",
        "P. Hoeflich",
        "T. Mera",
        "E. Fereidouni",
        "Z. Levy",
        "D. Maci",
        "C. Ashall",
        "E. Baron",
        "M. Shahbandeh",
        "K. Medler",
        "W. B. Hoogendam",
        "C. M. Pfeffer"
      ],
      "abstract": "Filling The Pockets: The Spherical Nature of 3D Deflagration in Thermonuclear Supernovae S. Shiber, P. Hoeflich, T. Mera, E. Fereidouni, Z. Levy, D. Maci, C. Ashall, E. Baron, M. Shahbandeh, K. Medler, W. B. Hoogendam, C. M. Pfeffer 11 pages, 4 figures, submitted to ApjL Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate thermonuclear explosions within the delayed detonation framework. While spherical delayed detonation models generally reproduce key observational features, a fundamental inconsistency emerges in three dimensions: 3D hydrodynamic simulations exhibit insufficient white dwarf expansion during the deflagration phase. We identify the early deflagration stage, when the burning is dominated by the laminar speed, as a critical phase and explore potential solutions using three dimensional magnetohydrodynamic simulations performed with the FLASH code. In hydrodynamical simulations, the early deflagration phase produces large pockets of unburned C/O, leading to inefficient burning. Much of the released energy is deposited into buoyantly rising plumes rather than into the global pre-expansion of the white dwarf, which is required to produce the partially burned layers characteristic of SNe Ia. In contrast, when preexisting turbulent velocity fields and strong magnetic fields, on scales expected from the smoldering phase, are included, the effective burning approaches that in spherical models. Both turbulence and magnetic fields promote the entrainment of burned material into unburned pockets, addressing a long-standing problem in multi-dimensional deflagration models. The resulting streaks of burned material enable the conductive ignition of the surrounding unburned fuel. The dominant effect is not a change in the small-scale flame physics (~10^{-3} cm), but rather enhanced mixing between burned and unburned material. As expected, this mechanism is most efficient when the turbulent length scales are smaller than those of the unburned plumes.",
      "pdf_url": "https://arxiv.org/pdf/2602.11341.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11600",
      "title": "An optical transient candidate of $\\lesssim$ 2-second duration captured by wide-field video observations",
      "authors": [
        "Noriaki Arima",
        "Mamoru Doi",
        "Shigeyuki Sako",
        "Yuu Niino",
        "Ryou Ohsawa",
        "Nozomu Tominaga",
        "Masaomi Tanaka",
        "Michael Richmond",
        "Shinsuke Abe",
        "Naoto Kobayashi",
        "Sohei Kondo",
        "Yuki Mori",
        "Ko Arimatsu",
        "Toshihiro Kasuga",
        "Shin-ichiro Okumura",
        "Jun-ichi Watanabe",
        "Takuya Yamashita"
      ],
      "abstract": "An optical transient candidate of $\\lesssim$ 2-second duration captured by wide-field video observations Noriaki Arima, Mamoru Doi, Shigeyuki Sako, Yuu Niino, Ryou Ohsawa, Nozomu Tominaga, Masaomi Tanaka, Michael Richmond, Shinsuke Abe, Naoto Kobayashi, Sohei Kondo, Yuki Mori, Ko Arimatsu, Toshihiro Kasuga, Shin-ichiro Okumura, Jun-ichi Watanabe, Takuya Yamashita Accepted for publication in PASJ; 15 pages, 14 figures, 3 tables Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Recent time-domain surveys have revealed rapid transients that evolve on timescales of $\\lesssim 10$ days, expanding the transient population into the short-duration regime. The transient search on even shorter timescales, particularly those lasting only seconds or less, remains a largely unexplored frontier. Very short-duration optical transients could serve as potential counterparts to millisecond-duration fast radio bursts (FRBs), providing clues to their origins. However, the optical search for transients on such short timescales has been limited primarily by instrumental constraints. Here we report the discovery of an optical transient candidate (TMG20200322) with a duration of $\\lesssim 2$~s by wide-field video observations in the direction of the Earth's shadow. TMG20200322 was detected in just two consecutive images of 1-second exposure time, with its shape becoming elongated in the second frame. PSF shape variability analysis of field stars reveals that such an elongated PSF cannot be explained by atmospheric fluctuations. We investigate the potential origins of TMG20200322 in two scenarios: meteoroid impact flashes on near-Earth asteroids (NEAs) and head-on meteors in the Earth's atmosphere. None of the scenarios provides a satisfactory explanation for this transient. We derive a sky-projected rate of the TMG20200322 event of $R_{\\mathrm{trans}} = (3.4 \\times 10^{-2})^{+0.13}_{-0.028}$~deg$^{-2}$~day$^{-1}$ and an upper limit on second-timescale transients with durations of $1~\\mathrm{s} \\leq \\tau \\lesssim 15~\\mathrm{s}$ of $R_{\\mathrm{trans}} \\lesssim 0.10$~deg$^{-2}$~day$^{-1}$ for the non-detection case. We highlight that continuous monitoring observations in the direction of the Earth's shadow could be a key strategy to unveil a new population of optical transients on timescales of seconds or less.",
      "pdf_url": "https://arxiv.org/pdf/2602.11600.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11838",
      "title": "NE2025: An Updated Electron Density Model for the Galactic Interstellar Medium",
      "authors": [
        "S.K. Ocker",
        "J.M. Cordes"
      ],
      "abstract": "NE2025: An Updated Electron Density Model for the Galactic Interstellar Medium S.K. Ocker, J.M. Cordes 32 pages, 17 figures, submitted to ApJ and comments welcome Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Free electrons in the Galactic interstellar medium (ISM) disperse and scatter coherent radio waves, by amounts that depend on the distance to the radio source. Models of the Galactic electron density are thus widely used to predict distances and scattering of compact radio sources (including pulsars, fast radio bursts (FRBs), and long-period transients), in addition to mitigating ISM foregrounds in Galactic and extragalactic studies. We use a sample of 171 precise pulsar distances, based entirely on parallaxes and globular cluster associations, as well as scattering measurements of 568 pulsars, active galactic nuclei, and masers, to update the NE2001 Galactic electron density model. We refit the thick and thin disks and three of the spiral arms. The new parameters for these large-scale components significantly repartition free electrons between the thick disk and spiral arms, thereby correcting NE2001's systematic underestimation of pulsar distance and scattering. Sightlines with excessive dispersion and scattering are used to identify new clumps that are added to the model, in addition to refining clumps that were already included (e.g., Cygnus, Vela, and Gum). The Galactic Center component is revised, yielding scattering time predictions that are $10^3$ times smaller than the Galactic Center in NE2001. The updated model, NE2025, provides a factor of $20\\times$ improvement in median distance prediction accuracy and $100\\%$ median improvement in scattering predictions based on DM, relative to NE2001. There is a $15\\times$ improvement in median distance prediction accuracy relative to YMW16. NE2025 is available on Github and the Python Package Interface.",
      "pdf_url": "https://arxiv.org/pdf/2602.11838.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.14778",
      "title": "Disappearance of a massive star in the Andromeda Galaxy due to formation of a black hole",
      "authors": [
        "Kishalay De",
        "Morgan MacLeod",
        "Jacob E. Jencson",
        "Elizabeth Lovegrove",
        "Andrea Antoni",
        "Erin Kara",
        "Mansi M. Kasliwal",
        "Ryan M. Lau",
        "Abraham Loeb",
        "Megan Masterson",
        "Aaron M. Meisner",
        "Christos Panagiotou",
        "Eliot Quataert",
        "Robert Simcoe"
      ],
      "abstract": "Disappearance of a massive star in the Andromeda Galaxy due to formation of a black hole Kishalay De, Morgan MacLeod, Jacob E. Jencson, Elizabeth Lovegrove, Andrea Antoni, Erin Kara, Mansi M. Kasliwal, Ryan M. Lau, Abraham Loeb, Megan Masterson, Aaron M. Meisner, Christos Panagiotou, Eliot Quataert, Robert Simcoe Published in Science on February 12, 2026 High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) When a massive star reaches the end of its lifetime, its core collapses and releases neutrinos that drive a shock into the outer layers (stellar envelope). A sufficiently strong shock ejects the envelope, producing a supernova. If the shock fails to eject it, the envelope is predicted to fall back onto the collapsing core, producing a stellar-mass black hole (BH) and causing the star to disappear. We report observations of M31-2014-DS1, a hydrogen-depleted supergiant in the Andromeda Galaxy. In 2014 it brightened in the mid-infrared. From 2017 to 2022 it faded by factors of $\\gtrsim10^4$ in optical light, becoming undetectable, and $\\gtrsim10$ in total light. We interpret these observations, and those of a previous event in NGC 6946, as evidence for failed supernovae forming stellar-mass BHs.",
      "pdf_url": "https://arxiv.org/pdf/2410.14778.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.14836",
      "title": "Long-Term Multidimensional Models of Core-Collapse Supernovae: Progress and Challenges",
      "authors": [
        "H.-Thomas Janka"
      ],
      "abstract": "Long-Term Multidimensional Models of Core-Collapse Supernovae: Progress and Challenges H.-Thomas Janka (MPI Astrophysics, Garching) 40 pages, 8 figures; minor revisions due to referee comments; Annual Review of Nuclear and Particle Science 75, 425 (2025), article DOI: this https URL errors in Fig.8d corrected, new version consistent with arXiv:2602.02651 High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); Nuclear Theory (nucl-th) Self-consistent, multidimensional core-collapse supernova (SN) simulations, especially in 3D, have achieved tremendous progress over the past 10 years. They are now able to follow the entire evolution from core collapse through bounce, neutrino-triggered shock revival, shock breakout at the stellar surface to the electromagnetic SN outburst and the subsequent SN remnant phase. Thus they provide general support for the neutrino-driven explosion mechanism by reproducing observed SN energies, neutron-star (NS) kicks, and diagnostically relevant radioactive isotope yields; they allow to predict neutrino and gravitational-wave signals for many seconds of proto-NS cooling; they confirm correlations between explosion and progenitor or remnant properties already expected from previous spherically symmetric (1D) and 2D models; and they carve out various scenarios for stellar-mass black-hole (BH) formation. Despite these successes it is currently unclear which stars explode or form BHs, because different modeling approaches disagree and suggest the possible importance of the 3D nature of the progenitors and of magnetic fields. The role of neutrino flavor conversion in SN cores still needs to be better understood, the nuclear equation of state including potential phase transitions implies major uncertainties, the SN 1987A neutrino measurements raise new puzzles, and tracing a possible correlation of NS spins and kicks requires still more refined SN simulations.",
      "pdf_url": "https://arxiv.org/pdf/2502.14836.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.05517",
      "title": "A possible origin of the overlapping light curve of eRO-QPE1",
      "authors": [
        "Wen-Long Xu",
        "Hui-Hui Wang",
        "Yi-Gu Chen",
        "Yu-Zhe Li",
        "Wei-Hua Lei"
      ],
      "abstract": "A possible origin of the overlapping light curve of eRO-QPE1 Wen-Long Xu, Hui-Hui Wang, Yi-Gu Chen, Yu-Zhe Li, Wei-Hua Lei Accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Quasi-Periodic Eruptions (QPEs) are recurrent X-ray eruptions discovered so far in the nuclei of low-mass galaxies. However, despite considerable observational progress, the origin of QPEs remains unclear. A variety of models have been proposed to explain their nature, but a definitive understanding has yet to be reached. Recently, chaotic mixtures of multiple overlapping eruptions with varying amplitudes have been observed in eRO-QPE1 obs1-features not reported in any other known QPE sources. This complex behavior presents a challenge to the existing QPE models. In this paper, we propose that the overlapping features may be the result of gravitational lensing. We analyze the light curve of eRO-QPE1 and compare its features to predictions from gravitational lensing scenarios. We discuss the implications for the trigger mechanism of QPEs in general. We show that the unique overlapping features observed in eRO-QPE1 may be naturally reproduced by gravitational lensing effects, without invoking a different physical origin from other known QPE sources.",
      "pdf_url": "https://arxiv.org/pdf/2506.05517.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.08779",
      "title": "Constraining Super-Heavy Dark Matter with the KM3-230213A Neutrino Event",
      "authors": [
        "Roberto Aloisio",
        "Antonio Ambrosone",
        "Carmelo Evoli"
      ],
      "abstract": "Constraining Super-Heavy Dark Matter with the KM3-230213A Neutrino Event Roberto Aloisio, Antonio Ambrosone, Carmelo Evoli 7 pages. 4 Figures. Published on Physical Review D High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Recently, the KM3NeT collaboration detected an astrophysical neutrino event, KM3-230213A, with an energy of approximately $220~\\rm PeV$, providing unprecedented insights into the ultra-high-energy Universe. In this study, we introduce a novel likelihood framework designed to leverage this event to constrain the properties of super-heavy dark matter (SHDM) decay. Our approach systematically integrates multi-messenger constraints from galactic and extragalactic neutrino flux measurements by IceCube, the absence of comparable neutrino events at IceCube and Auger observatories, and the latest gamma-ray experiment upper limits. Our findings impose the most stringent constraints to date, placing a lower bound on the SHDM lifetime at $\\gtrsim 5\\cdot 10^{29}-10^{30} \\rm s$. Importantly, we identify, for the first time, the significant potential of galactic neutrino flux measurements in advancing dark matter research. Future investigations targeting astrophysical neutrinos originating from the Galactic Center at energies above $10~\\rm PeV$ will be crucial, not only for understanding the origin of the cosmic-ray knee but also for exploring the possible contributions of super-heavy dark matter to our Universe.",
      "pdf_url": "https://arxiv.org/pdf/2508.08779.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.03386",
      "title": "The strong Fe K line and spin of the black-hole X-ray binary MAXI J1631-479",
      "authors": [
        "Andrzej A. Zdziarski",
        "Swadesh Chand",
        "Gulab Dewangan",
        "Ranjeev Misra",
        "Michal Szanecki",
        "Bei You",
        "Maxime Parra",
        "Gregoire Marcel"
      ],
      "abstract": "The strong Fe K line and spin of the black-hole X-ray binary MAXI J1631-479 Andrzej A. Zdziarski, Swadesh Chand, Gulab Dewangan, Ranjeev Misra, Michal Szanecki, Bei You, Maxime Parra, Gregoire Marcel The Astrophysical Journal Letters, 998:L37 (8pp), 2026 High Energy Astrophysical Phenomena (astro-ph.HE) We study the transient black hole binary MAXI J1631--479 in its soft spectral state observed simultaneously by the NICER and NuSTAR instruments. Its puzzling feature is the presence of a strong and broad Fe K line, while the continuum consists of a strong disk blackbody and a very weak power-law tail. The irradiation of the disk by a power-law spectrum fitting the tail is much too weak to account for the strong line. Two solutions were proposed in the past. One invoked an intrinsic Fe K disk emission, and the other invoked disk irradiation by the returning blackbody emission. We instead find that the strong line is naturally explained by the irradiation of the disk by the spectrum from Comptonization of the disk blackbody by coronal relativistic electrons. The shape of the irradiating spectrum at $\\lesssim$10 keV reflects that of the disk blackbody; it is strongly curved and has a higher flux than that of a fit with a power-law irradiation. That flux accounts for the line. While this result is independent of the physical model used for the disk intrinsic emission, the value of the fitted spin strongly depends on it. When using a Kerr disk model for a thin disk with a color correction, the fitted spin corresponds to a retrograde disk, unlikely for a Roche-lobe overflow binary. Then, a model accounting for both the disk finite thickness and radiative transfer yields a spin of $a_*\\approx0.8$--0.9, which underlines the strong model-dependence of X-ray spin measurements.",
      "pdf_url": "https://arxiv.org/pdf/2511.03386.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16204",
      "title": "Fastest or Significant: A Systematic Framework for Validating Global Minimum Variability Timescale Measurements of Gamma-ray Bursts",
      "authors": [
        "S. Bala",
        "P. Veres",
        "A. Goldstein",
        "R. Sonawane",
        "R. Samanta",
        "S. Iyyani"
      ],
      "abstract": "Fastest or Significant: A Systematic Framework for Validating Global Minimum Variability Timescale Measurements of Gamma-ray Bursts S. Bala, P. Veres, A. Goldstein, R. Sonawane, R. Samanta, S. Iyyani High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) The minimum variability timescale (MVT) is a key observable used to probe the central engines of Gamma-Ray Bursts (GRBs) by constraining the emission region size and the outflow Lorentz factor. However, its interpretation is often ambiguous: statistical noise and analysis choices can bias measurements, making it difficult to distinguish genuine source variability from artifacts. Here we perform a comprehensive suite of simulations to establish a quantitative framework for validating Haar-based MVT measurements. We show that in multi--component light curves, the MVT returns the most statistically significant structure in the interval, which is not necessarily the fastest intrinsic timescale, and can therefore converge to intermediate values. Reliability is found to depend jointly on the MVT value and its signal-to-noise ratio ($\\mathrm{SNR}_{\\mathrm{MVT}}$), with shorter intrinsic timescales requiring proportionally higher $\\mathrm{SNR}_{\\mathrm{MVT}}$ to be resolved. We use this relation to define an empirical MVT Validation Curve, and provide a practical workflow to classify measurements as robust detections or upper limits. Applying this procedure to a sample of Fermi-GBM bursts shows that several published MVT values are better interpreted as upper limits. These results provide a path toward standardizing MVT analyses and highlight the caution required when inferring physical constraints from a single MVT measurement in complex events.",
      "pdf_url": "https://arxiv.org/pdf/2512.16204.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24729",
      "title": "Are NICER and GW170817 constraints suggesting a compactified scenario for Neutron stars?",
      "authors": [
        "Asim Kumar Saha",
        "Tuhin Malik",
        "Ritam Mallick"
      ],
      "abstract": "Are NICER and GW170817 constraints suggesting a compactified scenario for Neutron stars? Asim Kumar Saha, Tuhin Malik, Ritam Mallick 14 pages, 6 Figures and 3 Tables High Energy Astrophysical Phenomena (astro-ph.HE) Astrophysical observations from NICER and gravitational wave data constrain the properties of matter at the cores of neutron stars, enabling us to probe high-density matter with greater accuracy. To understand its implications for neutron stars, three distinct class-agnostic equation-of-state ensembles are constructed using the speed-of-sound parametrisation, which can describe matter in neutron-star cores. Bayesian analysis is employed to constrain the parameters, namely, the squared speed of sound and chemical potential, using the observational data. The Bayesian inference shows that the observations effectively constrain the low-density region of the equation of state. The astrophysical bound favours a softer, low-density equation of state in which the phase transition occurs at intermediate densities, thereby reducing the upper mass bounds for neutron stars. For the equation of state with density discontinuity, the discontinuities are preferably small. The equation of state with maximum mass configuration shows considerable stiffening from very low density, providing pressure support to generate maximum mass. In contrast, the equation of state with the maximum compact stellar configuration has a softer low-density equation of state, followed by pronounced stiffening, yielding the maximum compact configuration. The observationally favoured EoS shares the same qualitative structure as the maximum-compactness EoS: relative softness at intermediate densities transitioning to stiffness at high densities, a configuration gravity naturally favours.",
      "pdf_url": "https://arxiv.org/pdf/2512.24729.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07354",
      "title": "Supernovae drive large-scale, incompressible turbulence through small-scale instabilities",
      "authors": [
        "James R. Beattie"
      ],
      "abstract": "Supernovae drive large-scale, incompressible turbulence through small-scale instabilities James R. Beattie 11 pages, 5 figures + 7 appendix figure, submitted to ApJL. Comments welcome. Significant additions since the first upload. Some relevant movies here this https URL Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); Fluid Dynamics (physics.flu-dyn) The sources of turbulence in our Galaxy may be diverse, but core-collapse supernovae (SNe) alone provide enough energy to sustain a steady-state galactic turbulence cascade at the observed velocity dispersion. By localizing and analyzing supernova remnants (SNRs) in high-resolution SN-driven galactic disk cut-out simulations from Beattie et al. 2025, I show that isolated SNRs source incompressible turbulence through baroclinic vorticity generation localized at the unstable contact discontinuity. Through the spherical harmonic power spectrum of the corrugations, I provide evidence that this process is seeded by surface instabilities and 2D turbulence on the shell, which corrugates and folds the interface, becoming the strongest source of baroclinicity in the simulations. I present an analytical relation for a baroclinicity-fed incompressible mode (co)spectrum, which matches that observed in the simulated SNRs, and reveals a $\\propto k^{3/4}$ spectrum that drives the turbulence. I show that vortex stretching allows for modes to be shed from the contact discontinuity into the surrounding medium and derive a timescale criterion for this process, revealing that young SNRs with radii close to the cooling radius are efficient at radiating turbulence. The unstable layer produces a spectrum of incompressible modes $\\propto k^{-3/2}$ locally within the SNRs. Through the inverse cascade mechanism revealed in Beattie et al. 2025, this opens the possibility that the $k^{-3/2}$ spectrum, arising from corrugated folds in the unstable layer, imprints itself on kiloparsec scales, thereby connecting small-scale structure in the layer to the large-scale incompressible turbulence cascade.",
      "pdf_url": "https://arxiv.org/pdf/2509.07354.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13736",
      "title": "The collision and merger products of stars do not look alike: A magnetohydrodynamics comparison",
      "authors": [
        "Pavan Vynatheya",
        "Taeho Ryu",
        "Chen Wang",
        "Alison Sills",
        "Rüdiger Pakmor"
      ],
      "abstract": "The collision and merger products of stars do not look alike: A magnetohydrodynamics comparison Pavan Vynatheya, Taeho Ryu, Chen Wang, Alison Sills, Rüdiger Pakmor 19 pages, 10 figures, 3 tables, Accepted for publication by ApJ (with some revision) Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) A significant fraction of stars experience close interactions, including collisions resulting from gravitational encounters and mergers within close binary systems. These processes can produce more massive stars that may give rise to relatively rare objects such as blue stragglers. Distinguishing the outcomes of collisions and mergers is challenging yet essential for interpreting observations. This study utilizes the magnetohydrodynamics code AREPO to simulate collisions and mergers of $5$ to $10 \\,\\mathrm{M}_{\\odot}$ main-sequence stars, systematically comparing the properties of the resulting products. Both collisions and mergers yield more massive, strongly magnetized, rapidly and differentially rotating stars with cores enriched in hydrogen, but notable quantitative differences emerge. Merger products exhibit core hydrogen fractions up to $10\\%$ higher than those of collision products. In both scenarios, turbulent mixing amplifies magnetic field energies by $9$ to $12$ orders of magnitude. However, magnetic fields in small-impact-parameter collision products display small-scale reversals that may dissipate over time, whereas merger products and large-impact-parameter collision products develop large-scale ordered, potentially long-lived magnetic fields. Additionally, only merger products display magnetically driven, bipolar outflows with radial velocities exceeding $300$ to $400 \\,\\mathrm{km}\\,\\mathrm{s}^{-1}$. These distinctions may result in different long-term evolutionary outcomes, which warrant further investigation in future studies.",
      "pdf_url": "https://arxiv.org/pdf/2510.13736.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11257",
      "title": "The connection between surface brightness and satellite systems for central galaxies through Illustris TNG",
      "authors": [
        "Silvio Rodriguez",
        "Yamila Yaryura",
        "Jose A. Benavides",
        "Diego Garcia Lambas",
        "Susana Pedrosa",
        "Laura D. Baravalle",
        "Laura Ceccarelli",
        "Heliana E. Luparello",
        "Lucas Bignone",
        "Gaspar Galaz"
      ],
      "abstract": "The connection between surface brightness and satellite systems for central galaxies through Illustris TNG Silvio Rodriguez, Yamila Yaryura, Jose A. Benavides, Diego Garcia Lambas, Susana Pedrosa, Laura D. Baravalle, Laura Ceccarelli, Heliana E. Luparello, Lucas Bignone, Gaspar Galaz 8 pages, 8 figures, accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) We analyse different properties of central low-surface-brightness galaxies (LSBGs) and their satellite systems using the simulation Illustris TNG-100, in order to deepen our understanding of the formation mechanism of LSBGs in a $\\Lambda$CDM cosmology. We find differences in the spin and the concentrations of the LSBGs haloes and the host haloes of high-surface-brightness galaxies (HSBGs), consistent with previous studies. By analysing their spatial and kinematical distribution of satellites, we find that LSBGs tend to have a larger number of satellites than HSBGs and with a larger velocity dispersion. Moreover, we obtain a continuous relation between the number of satellites and surface brightness, particularly for massive central galaxies. We also find a relation between surface brightness and the relative tangential velocity of the satellites. For a given stellar mass, the existence of LSBGs is strongly correlated with their satellite system dominated by rotation. Furthermore, the satellite system is systematically in counter-rotation with respect to the primary disc in LSBGs. We propose that this fact reflects that these galaxies have not experienced a significantly high rate of mergers, which are more likely associated with radial orbits expected in systems of galaxies with a high surface brightness.",
      "pdf_url": "https://arxiv.org/pdf/2602.11257.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11280",
      "title": "First statistical constraints on galactic scale outflows properties traced by their extended Mg II emission with MUSE",
      "authors": [
        "Ismael Pessa",
        "Lutz Wisotzki",
        "Tanya Urrutia",
        "Nicolas F. Bouché",
        "Floriane Leclercq",
        "Ramona Augustin",
        "Yucheng Guo",
        "Daria Kozlova",
        "Haruka Kusakabe",
        "John Pharo"
      ],
      "abstract": "First statistical constraints on galactic scale outflows properties traced by their extended Mg II emission with MUSE Ismael Pessa, Lutz Wisotzki, Tanya Urrutia, Nicolas F. Bouché, Floriane Leclercq, Ramona Augustin, Yucheng Guo, Daria Kozlova, Haruka Kusakabe, John Pharo 24 pages + appendix, accepted for publication in A&A. A slightly modified abstract is presented here due to the arXiv limit Astrophysics of Galaxies (astro-ph.GA) Galaxies evolve within vast gaseous halos that fuel star formation and carry signatures of feedback-driven outflows. Deep integral field data have enabled the study of MgII halos, which trace galaxy-scale outflows in emission, but their faintness has limited studies to single-object analyses. Here, we present the first statistical study of MgII-emitting halos using deep MUSE observations of 47 star-forming galaxies at $0.7<z<2.0$. Building on our previous work, where we developed and applied an outflow modeling framework for a single MgII halo, we now extend this approach to a larger sample, enabling robust population-level insights on the properties of circumgalactic outflows traced by their extended MgII emission. We detect extended emission out to tens of kiloparsecs and model the outflows as an ensemble of radially accelerating shells. Galaxies with MgII outflows tend to have higher SFRs, sSFRs, and younger stellar populations, consistent with star-formation-driven winds. The observations are consistent with winds that accelerate linearly with radius, from launching velocities of ~60 km/s up to maximum velocities that correlate with stellar mass and reach ~490 km/s. Their inner regions are highly opaque, and we find a tentative trend between stellar mass and central optical depth. The opening angle of the outflow shows some dependency on the host-galaxy stellar mass, with less massive galaxies showing primarily wide opening angles, and more massive galaxies showing a broader range of values, with both wide and narrow opening angles. The distribution of the spatial extent of MgII halos exhibits a clear peak at half-light radius (HLR) of ~5 kpc, with an extended tail of larger HLR values, up to ~20 kpc. Compact halo sizes (HLR $< 8$ kpc) correlate with stellar mass, but extended halos do not, which could suggest a difference in the powering mechanism between compact and extended halos.",
      "pdf_url": "https://arxiv.org/pdf/2602.11280.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11347",
      "title": "Using astrochemical models to simulate reactivity experiments on cold surfaces",
      "authors": [
        "Valeriia Sokolova",
        "Basile Husquinet",
        "Stephan Diana",
        "Paola Caselli",
        "Emanuele Congiu",
        "Wiebke Riedel",
        "Olli Sipila",
        "Anton Vasyunin",
        "Valentine Wakelam",
        "Francois Dulieu"
      ],
      "abstract": "Using astrochemical models to simulate reactivity experiments on cold surfaces Valeriia Sokolova, Basile Husquinet, Stephan Diana, Paola Caselli, Emanuele Congiu, Wiebke Riedel, Olli Sipila, Anton Vasyunin, Valentine Wakelam, Francois Dulieu 50 pages, 14 Figures, 9 Tables. Accepted to ACS Earth and Space Chemistry special issue 'Eric Herbst Festschrift' Astrophysics of Galaxies (astro-ph.GA) The development of molecular complexity during stellar and planetary formation owes much to the interaction of gas and dust. When the first astrochemical models including solid-state chemistry were developed more than forty years ago, data from dedicated laboratory experiments were limited. Since then, many groups have developed specific experimental setups to address this issue, but astrochemical models have rarely been directly confronted with these new results. We want to demonstrate whether it is possible to use rate-equation-type astrochemical models developed in the context of the Interstellar Medium to compare them with laboratory astrophysics experiments. In this work, we use the case of low-temperature hydrogenation of CO, which is known to lead to methanol, among other molecules. We carried out 9 experiments, varying the experimental parameters such as temperature and dose. We give quantitative results and take care of detailing the vocabulary used in the experiments. We use astrochemical codes, NAUTILUS, pyRate and MONACO, to reproduce our experimental conditions, which requires good control of the change of vocabulary and scales, especially for fluxes and time scales. This work demonstrates that it is possible to use different astrochemical codes to compare modelling results directly with the output of experiments. There are discrepancies between models and experiments, as well as between models, but a fair agreement is achieved. We discuss the possible origin of the differences, which could originate from the chemical network or the difference in the description of physical processes.",
      "pdf_url": "https://arxiv.org/pdf/2602.11347.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11356",
      "title": "ALMA Band1 observations of the rhoOphW filament I. Enhanced power from excess microwave emission at high spatial frequencies",
      "authors": [
        "Simon Casassus",
        "Matias Vidal",
        "Miguel Carcamo",
        "Laurent Verstraete",
        "Nathalie Ysard",
        "Emilie Habart"
      ],
      "abstract": "ALMA Band1 observations of the rhoOphW filament I. Enhanced power from excess microwave emission at high spatial frequencies Simon Casassus, Matias Vidal, Miguel Carcamo, Laurent Verstraete, Nathalie Ysard, Emilie Habart Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The rhoOphW photo-dissociation region (PDR) is an example source of bright excess microwave emission (EME), over synchrotron, free-free, and the Rayleigh-Jeans tail of the sub-millimetre (sub-mm) dust continuum. Its filamentary morphology follows roughly that of the IR poly-cyclic aromatic hydrocarbon (PAHs) bands. The EME signal in rhoOphW drops abruptly above ~30GHz and its spectrum can be interpreted in terms of electric-dipole radiation from spinning dust grains, or ``spinning dust''. Deep and high-fidelity imaging and spectroscopy of rhoOphW may reveal the detailed morphology of the EME signal, free from imaging priors, while also enabling a search for fine structure in its spectrum. The same observations may constrain the spectral index of the high-frequency drop. An ALMA Band1 mosaic yields a deep deconvolved image of the filament at 36-44GHz, which we use as template for the extraction of a spectrum via cross-correlation in the uv-plane. Simulations and cross-correlations on near-infrared ancillary data yield estimates of flux-loss and biases. The spectrum is a power law, with no detectable fine structure. It follows a spectral index alpha=-0.78+-0.05, in frequency, with some variations along the filament. Interestingly, the Band1 power at high spatial frequencies increases relative to that of the IR signal, with a factor of two more power in Band1 at ~20'' than at ~100'' (relative to IRAC3.6um). An extreme of such radio-only structures is a compact EME source, without IR counterpart. It is embedded in strong and filamentary Band1 signal, while the IRAC maps are smooth in the same region. We provide multi-frequency intensity estimates for spectral modelling.",
      "pdf_url": "https://arxiv.org/pdf/2602.11356.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11418",
      "title": "Evidence for Shallow Nebular Attenuation Curves and Patchy Dust Geometry at z~2 with Pa-beta/H-alpha Measurements from JWST-MegaScience Medium Band Photometry",
      "authors": [
        "Brian Lorenz",
        "Katherine A. Suess",
        "Mariska Kriek",
        "Sedona H. Price",
        "Joel Leja",
        "Hakim Atek",
        "Abhiyan Barailee",
        "Rachel Bezanson",
        "Gabriel Brammer",
        "Sam E. Cutler",
        "Pratika Dayal",
        "Anna de Graaf",
        "Jenny E. Greene",
        "Lukas J. Furtak",
        "Ivo Labbe",
        "Danilo Marchesini",
        "Michael V. Maseda",
        "Tim B. Miller",
        "Abby Mintz",
        "Ikki Mitsuhashi",
        "Themiya Nanayakkara",
        "Erica Nelson",
        "Richard Pan",
        "Natalia Porraz Barrera",
        "Bingjie Wang",
        "John R. Weaver",
        "Christina C. Williams",
        "Katherine E. Whitaker"
      ],
      "abstract": "Evidence for Shallow Nebular Attenuation Curves and Patchy Dust Geometry at z~2 with Pa-beta/H-alpha Measurements from JWST-MegaScience Medium Band Photometry Brian Lorenz, Katherine A. Suess, Mariska Kriek, Sedona H. Price, Joel Leja, Hakim Atek, Abhiyan Barailee, Rachel Bezanson, Gabriel Brammer, Sam E. Cutler, Pratika Dayal, Anna de Graaf, Jenny E. Greene, Lukas J. Furtak, Ivo Labbe, Danilo Marchesini, Michael V. Maseda, Tim B. Miller, Abby Mintz, Ikki Mitsuhashi, Themiya Nanayakkara, Erica Nelson, Richard Pan, Natalia Porraz Barrera, Bingjie Wang, John R. Weaver, Christina C. Williams, Katherine E. Whitaker 10 pages, 5 figures, submitted to ApJL Astrophysics of Galaxies (astro-ph.GA) We constrain the nebular attenuation curve and investigate dust geometry in star-forming galaxies at cosmic noon using photometric medium-band emission line measurements. We measure H-alpha emission line fluxes for a sample of 209 star-forming galaxies at 1.2<z<2.4 in MegaScience/UNCOVER with stellar masses spanning $7.85<\\log_{10}(M_*/M_\\odot)<11.0$. For 66 of these galaxies, we also measure a Pa-beta flux. We find that the Pa-beta/H-alpha line ratio increases strongly with stellar mass and star-formation rate (SFR) across our full mass range, indicating that more massive galaxies are dustier. We compare our results with a mass-, SFR-, and redshift-matched sample of galaxies from the MOSDEF survey with spectroscopic measurements of H-alpha/H-beta, finding that a shallow Reddy et al. (2025) nebular attenuation curve is more consistent with our observations than the typically assumed Cardelli et al. (1989) attenuation curve, especially for massive galaxies. This shallow attenuation curve could be explained by low dust covering fractions in star-forming regions. Through comparison to other studies, we show that assuming this shallower attenuation curve can increase the inferred A_Halpha,neb by up to 1 magnitude at high masses. We observe no trend between A_Halpha,neb and axis ratio, indicating that nebular attenuation is likely localized to small clumps. Altogether, our results strongly suggest that dust geometry is patchy and non-uniform, especially in massive galaxies. Our results highlight the ability of JWST medium bands to probe emission lines for large samples of galaxies, and statistically constrain dust properties in upcoming large programs.",
      "pdf_url": "https://arxiv.org/pdf/2602.11418.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11450",
      "title": "The \"bubbly\" interstellar medium as origin for the inhomogeneous internal metallicity distributions in large disk galaxies",
      "authors": [
        "Benjamin Metha",
        "Michele Trenti",
        "Colin Norman"
      ],
      "abstract": "The \"bubbly\" interstellar medium as origin for the inhomogeneous internal metallicity distributions in large disk galaxies Benjamin Metha, Michele Trenti, Colin Norman 13 pages, 7 figures. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Resolved metallicity studies of local disk galaxies have revealed that their interstellar media (ISMs) are far from chemically homogeneous, displaying significant ($\\sim 0.05$ dex) variations in the metallicity on characteristic scales of a few hundred parsecs. Such data is at odds with most analytical models, where the ISM is predicted to be more well-mixed. Here, we suggest that the observed small-scale features seen in galaxies may be superbubbles of metal-enriched gas created by a collection of core collapse supernovae with tight spatial (and temporal) correlation. In this scenario, the size of the metallicity fluctuations (superbubble radius, $\\phi$) is set by the disk scale height of the galaxy in question (after which point shock breakout favours preferential expansion along directions perpendicular to the dense disc), and the amount of additional metals contained within a fluctuation is proportional to the star formation efficiency in superbubble regions ($\\epsilon$). To test this theory, we analysed metallicity maps from the PHANGS-MUSE sample of galaxies using a geostatistical forward-modelling approach. We find $\\phi \\simeq 300$ pc and $\\epsilon = 0.1-0.2$, in good agreement with our theoretical model. Further, these small-scale parameters are found to be related to the global galaxy properties, suggesting that the local structure of the interstellar medium of galaxies is not universal. Such a model of star formation paints a new picture of galaxy evolution in the modern universe: in large local galaxies, star formation appears steady and regular when averaged over large scales. However, on small scales, these large galaxies remain intrinsically bursty like their smaller, high-redshift counterparts.",
      "pdf_url": "https://arxiv.org/pdf/2602.11450.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11617",
      "title": "The ALMA-QUARKS Survey: Discovery of Dusty Fibrils inside Massive Star-forming Clumps",
      "authors": [
        "Yan-Kun Zhang",
        "Tie Liu",
        "Wenyu Jiao",
        "Pak-Shing Li",
        "Jia Zeng",
        "Chao Zhang",
        "Pablo García",
        "Mika Juvela",
        "Guido Garay",
        "Amelia M. Stutz",
        "Sami Dib",
        "Dezhao Meng",
        "Jian-Cheng Feng",
        "Dongting Yang",
        "Fengwei Xu",
        "Anandmayee Tej",
        "Enrique Vázquez-Semadeni",
        "Gilberto C. Gómez",
        "Yong Zhang",
        "Xindi Tang",
        "Paul F. Goldsmith",
        "Kee-Tae Kim",
        "James O. Chibueze",
        "Zhiyuan Ren",
        "Patricio Sanhueza",
        "Aiyuan Yang",
        "Jihye Hwang",
        "Shanghuo Li",
        "Tapas Baug",
        "Shivani Gupta",
        "Swagat R. Das",
        "Gang Wu",
        "Jianjun Zhou",
        "Chang Won Lee",
        "Lokesh Dewangan",
        "Prasanta Gorai",
        "Tianning Lyu",
        "Lei Zhu"
      ],
      "abstract": "The ALMA-QUARKS Survey: Discovery of Dusty Fibrils inside Massive Star-forming Clumps Yan-Kun Zhang, Tie Liu, Wenyu Jiao, Pak-Shing Li, Jia Zeng, Chao Zhang, Pablo García, Mika Juvela, Guido Garay, Amelia M. Stutz, Sami Dib, Dezhao Meng, Jian-Cheng Feng, Dongting Yang, Fengwei Xu, Anandmayee Tej, Enrique Vázquez-Semadeni, Gilberto C. Gómez, Yong Zhang, Xindi Tang, Paul F. Goldsmith, Kee-Tae Kim, James O. Chibueze, Zhiyuan Ren, Patricio Sanhueza, Aiyuan Yang, Jihye Hwang, Shanghuo Li, Tapas Baug, Shivani Gupta, Swagat R. Das, Gang Wu, Jianjun Zhou, Chang Won Lee, Lokesh Dewangan, Prasanta Gorai, Tianning Lyu, Lei Zhu Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We report the discovery of more than 323 superfine dusty filamentary structures (fibrils) inside 121 massive star forming clumps that are located in widely different Galactic environments (Galactocentric distances of $\\sim$0.5-12.7 kpc). These fibrils are identified from the 1.3~mm continuum emission in the ALMA-QUARKS survey, which has a linear resolution of $\\sim900$ AU for a source at $\\sim$3 kpc, using the \\textit{FilFinder} software. Using \\textit{RadFil} software, we find that the typical width of these fibrils is $\\sim$0.01 pc, which is about ten times narrower than that of dusty filaments in nearby clouds identified by the \\textit{Herschel} Space Observatory. The mass ($M$) versus length ($L$) relation for these fibrils follows $M\\propto L^{2}$, similar to that of Galactic filaments identified in space (e.g., \\textit{Herschel}) and ground-based single-dish (e.g., \\textit{APEX}) surveys. However, these fibrils are significantly denser ($\\mathrm{N_{H_2} = 10^{23}-10^{24}\\ cm^{-2}}$) than the filaments found in previous \\textit{Herschel} surveys ($\\mathrm{N_{H_2} = 10^{20}-10^{23}\\ cm^{-2}}$). This work contributes a large sample of superfine fibrils in massive clumps, following the identification of large 0.1-pc wide filaments and associated internal velocity coherent fibers in nearby molecular clouds, further emphasizing the crucial role played by filamentary structures in star formation at various physical scales.",
      "pdf_url": "https://arxiv.org/pdf/2602.11617.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11644",
      "title": "A Multiwavelength Evaluation of AGN in the Post-Starburst Phase",
      "authors": [
        "Yuanze Luo",
        "Kate Rowlands",
        "Katherine Alatalo",
        "Lauranne Lanz",
        "Timothy Heckman",
        "Elizaveta Sazonova",
        "Pallavi Patil",
        "Omar Almaini",
        "Vincenzo R. D'Onofrio",
        "K. Decker French",
        "Justin Otter",
        "Andreea O. Petric",
        "Namrata Roy",
        "Maya Skarbinski",
        "Justin S. Spilker",
        "Margaret E. Verrico",
        "Vivienne Wild"
      ],
      "abstract": "A Multiwavelength Evaluation of AGN in the Post-Starburst Phase Yuanze Luo, Kate Rowlands, Katherine Alatalo, Lauranne Lanz, Timothy Heckman, Elizaveta Sazonova, Pallavi Patil, Omar Almaini, Vincenzo R. D'Onofrio, K. Decker French, Justin Otter, Andreea O. Petric, Namrata Roy, Maya Skarbinski, Justin S. Spilker, Margaret E. Verrico, Vivienne Wild 21 pages, 13 figures; Accepted for publication by ApJ Astrophysics of Galaxies (astro-ph.GA) The quenching of star formation is a crucial phase in galaxy evolution. Although active galactic nuclei (AGN) feedback has been proposed as a key driver of this transition, the lack of strong AGN in nearby quenching galaxies raises questions about its effectiveness. In this study, we investigate AGN activity in post-starburst galaxies (PSBs), star-forming galaxies (SFGs), and quiescent galaxies (QGs) at $z<$ 0.2, using multiwavelength data from eROSITA/eFEDS (X-ray), WISE (mid-infrared), and FIRST (radio). We assess AGN incidence and strength across different stages and apply stacking techniques to undetected galaxies to recover average AGN properties. Comparisons between observed luminosity and that expected from star formation (L$_{\\rm obs}$/L$_{\\rm SF}$) show that PSBs are consistent with star formation dominating their radio and X-ray emission. Although PSBs exhibit a MIR AGN incidence rate twice that of SFGs, their estimated AGN luminosities are small compared to those of MIR AGN in the literature. PSBs overall do not display significantly enhanced AGN emission relative to mass- and redshift-matched SFGs and QGs. While the presence of obscured, low-luminosity AGN in PSBs cannot be excluded, such AGN, if present, could be fueled by residual gas from the preceding starburst and may not play a dominant role in quenching. Our findings suggest that AGN's role in quenching at low redshift is more subtle than violently removing the gas -- the feedback is likely more \"preventive\" than \"ejective\".",
      "pdf_url": "https://arxiv.org/pdf/2602.11644.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11681",
      "title": "The faint end of the UV luminosity function at $0.4 < z < 0.7$ from the Hubble Frontier Fields",
      "authors": [
        "Lei Sun",
        "Xiao-Lei Meng",
        "Xin Wang",
        "Hu Zhan",
        "Anahita Alavi",
        "Nicha Leethochawalit",
        "Brian Siana",
        "Hang Zhou",
        "Shengzhe Wang",
        "Shamuhawu Hailanhazi"
      ],
      "abstract": "The faint end of the UV luminosity function at $0.4 < z < 0.7$ from the Hubble Frontier Fields Lei Sun, Xiao-Lei Meng, Xin Wang, Hu Zhan, Anahita Alavi, Nicha Leethochawalit, Brian Siana, Hang Zhou, Shengzhe Wang, Shamuhawu Hailanhazi 16 pages, 10 figures. Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) By extending the Hubble Frontier Fields (HFF) observations to the F225W band using HST WFC3/UVIS, we measure the rest-frame UV luminosity function (LF) of galaxies at $0.4 < z < 0.7$, pushing into the low-luminosity galaxy regime. In this first paper of a series, we describe the HST Cycle-27 GO-15940 F225W observations and data reduction, and present a corresponding catalog for the Abell 2744 field, which is the most data-rich HFF cluster field. Combining deep Near-UV imaging and the high magnification from strong gravitational lensing of the foreground cluster, we identify 152 faint galaxies with $-19.5 < M_{UV} < -12.1$ at $0.4 < z < 0.7$ through hybrid photometric-spectroscopic redshift selection from the Abell 2744 F225W catalog. Using a sample defined by a $50\\%$ completeness cut and applying the maximum likelihood estimation, we derive the best-fit Schechter parameters for the UV LF at $z \\sim 0.55$ down to $M_\\text{UV} < -13.5$ mag, including a faint-end slope of $\\alpha = -1.324^{+0.072}_{-0.074}$. We incorporate a curvature parameter $\\delta$ in parameter estimation to account for a possible turn-over at the faint end of the UV LF, leveraging the exceedingly low luminosities probed by our sample. Our results rule out a turn-over brighter than $M_{UV} = -15.5$ at the $3\\sigma$ confidence level.",
      "pdf_url": "https://arxiv.org/pdf/2602.11681.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11736",
      "title": "Subaru High-$z$ Exploration of Low-Luminosity Quasars (SHELLQs). XXV. Large-scale environments of low-luminosity quasars at $z\\sim6$ traced by Ly$α$ emitters",
      "authors": [
        "Junya Arita",
        "Nobunari Kashikawa",
        "Yoshiki Matsuoka",
        "Masafusa Onoue",
        "Michael A. Strauss",
        "Kentaro Koretomo",
        "Yoshihiro Takeda",
        "Ryo Emori",
        "Wanqiu He",
        "Hiroki Hoshi",
        "Masatoshi Imanishi",
        "Rikako Ishimoto",
        "Kei Ito",
        "Kazushi Iwasawa",
        "Satoshi Kikuta",
        "Yongming Liang",
        "Camryn L. Phillips",
        "Shunta Shimizu",
        "John D. Silverman",
        "Yoshiki Toba",
        "Takehiro Yoshioka"
      ],
      "abstract": "Subaru High-$z$ Exploration of Low-Luminosity Quasars (SHELLQs). XXV. Large-scale environments of low-luminosity quasars at $z\\sim6$ traced by Ly$α$ emitters Junya Arita, Nobunari Kashikawa, Yoshiki Matsuoka, Masafusa Onoue, Michael A. Strauss, Kentaro Koretomo, Yoshihiro Takeda, Ryo Emori, Wanqiu He, Hiroki Hoshi, Masatoshi Imanishi, Rikako Ishimoto, Kei Ito, Kazushi Iwasawa, Satoshi Kikuta, Yongming Liang, Camryn L. Phillips, Shunta Shimizu, John D. Silverman, Yoshiki Toba, Takehiro Yoshioka 19 pages, 16 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) High-$z$ quasars are believed to reside in massive dark matter haloes (DMHs), suggesting that they reside in galaxy overdense regions. However, previous observations have shown a range of environments around them. The previous targets are limited to bright quasars ($M_{1450}\\lesssim-25$), for which photoevaporation may hinder galaxy formation in their vicinity. Here, we present Subaru/Hyper-Suprime Cam observations of the environments of four low-luminosity quasars ($-24<M_{1450}<-22$) at $z\\sim6.18$, which are expected to have a smaller photoevaporation effect. We detect Lyman $\\alpha$ emitters (LAEs) around them with narrowband NB872 imaging, and measure the local LAE overdensity. One quasar (J0844$-$0132) resides in an overdense region ($\\delta_\\mathrm{LAE}=3.77\\pm0.97$), whereas the other three fields are consistent with normal fields. The result is confirmed over the proximity zone of each quasar, suggesting that the diverse environment around quasars is independent of photoevaporation. We find no significant correlation between the LAE overdensities and the properties of host galaxies and supermassive black holes. Our quasars have host stellar mass measurements from JWST, allowing us to compare them with the LAE overdensity around galaxies without quasar activity with comparable stellar masses. We find that the LAE overdensity in the J0844$-$0132 field is stronger than that of galaxies with similar stellar mass at $z\\sim6$, while the other quasar fields show a comparable LAE overdensity.",
      "pdf_url": "https://arxiv.org/pdf/2602.11736.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11783",
      "title": "Characterising Ly$α$ damping wings at the onset of reionisation: Evidence for highly efficient star formation driven by dense, neutral gas in UV-bright galaxies at $z>9$",
      "authors": [
        "Clara L. Pollock",
        "Kasper E. Heintz",
        "Joris Witstok",
        "Rashmi Gottumukkala",
        "Gabriel Brammer",
        "Sownak Bose",
        "Alex J. Cameron",
        "Pratika Dayal",
        "Pieter van Dokkum",
        "Johan Fynbo",
        "Viola Gelli",
        "Matthew J. Hayes",
        "Akio K. Inoue",
        "Claudia del P. Lagos",
        "Peter Laursen",
        "Romain A. Meyer",
        "Rohan Naidu",
        "Pascal Oesch",
        "Lucie E. Rowland",
        "Nial R. Tanvir",
        "Sandro Tacchella",
        "Chamilla Terp",
        "Francesco Valentino",
        "Fabian Walter",
        "John Weaver",
        "Callum Witten"
      ],
      "abstract": "Characterising Ly$α$ damping wings at the onset of reionisation: Evidence for highly efficient star formation driven by dense, neutral gas in UV-bright galaxies at $z>9$ Clara L. Pollock, Kasper E. Heintz, Joris Witstok, Rashmi Gottumukkala, Gabriel Brammer, Sownak Bose, Alex J. Cameron, Pratika Dayal, Pieter van Dokkum, Johan Fynbo, Viola Gelli, Matthew J. Hayes, Akio K. Inoue, Claudia del P. Lagos, Peter Laursen, Romain A. Meyer, Rohan Naidu, Pascal Oesch, Lucie E. Rowland, Nial R. Tanvir, Sandro Tacchella, Chamilla Terp, Francesco Valentino, Fabian Walter, John Weaver, Callum Witten Astrophysics of Galaxies (astro-ph.GA) One of the major conundrums in contemporary extragalactic astrophysics is the apparent overabundance of a remarkable population of UV-bright galaxies at redshifts $z\\gtrsim 9$. We analyse galaxies spectroscopically observed by JWST/NIRSpec Prism and confirmed to lie at $z>9$, with sufficient signal-to-noise to carefully model their rest-frame UV to optical continua and line emission. In particular, we model the damped Lyman-$\\alpha$ (Ly$\\alpha$) absorption (DLA) features of each galaxy to place observational constraints on the gas assembly of neutral atomic hydrogen (HI) onto the galaxy halos at the onset of cosmic reionisation. Based on the derived HI column densities and star-formation rate (SFR) surface densities, we show that all galaxies are highly efficient at forming stars on rapid $\\sim 10-100\\,$Myr depletion timescales, greatly in excess compared to the canonical local universe Kennicutt-Schmidt relation and predictions from state-of-the-art galaxy formation simulations. The dense HI gas appears to also drive the offset from the fundamental-metallicity relation of these galaxies though its dust-to-gas ratio is seemingly consistent with values derived for local galaxies except for the lowest metallicity sight-lines. Our results provide the first robust observational constraints on the impact of pristine HI gas on early galaxy assembly, and imply that a combination of highly efficient star formation and low dust obscuration can likely explain the UV-brightness of galaxies at cosmic dawn.",
      "pdf_url": "https://arxiv.org/pdf/2602.11783.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.11068",
      "title": "A Portrait of the Cosmic Reionisation History in the Context of the Early Dark Energy Model",
      "authors": [
        "Weiyang Liu",
        "Xin Wang",
        "Hu Zhan",
        "Karl Glazebrook",
        "Mengtao Tang",
        "Michele Trenti"
      ],
      "abstract": "A Portrait of the Cosmic Reionisation History in the Context of the Early Dark Energy Model Weiyang Liu, Xin Wang, Hu Zhan, Karl Glazebrook, Mengtao Tang, Michele Trenti 14 pages, 4 figures, resubmitted after addressing the referee report Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Recent JWST observations of Lyman-$\\alpha$ emission at $z \\sim 11-6$ indicate a rapid reionization of the intergalactic medium within the first $\\sim700$ Myr. The required Lyman continuum (LyC) photon budget may naturally arise from the unexpectedly high galaxy number densities revealed by JWST, reducing the need for scenarios invoking very high LyC escape fractions ($f_{\\rm esc}\\gtrsim0.2$) or dominant contributions from ultra-faint galaxies ($M_{\\rm UV}>-15$) in the standard $\\Lambda$CDM framework. In this work, we model the reionization history under the Early Dark Energy (EDE) paradigm -- originally proposed to ease the Hubble tension -- which also explains the observed over-abundance of high-$z$ galaxies without extreme star formation efficiencies. The EDE model yields reionization histories consistent with current constraints while requiring only moderate LyC escape fractions and UV luminosity densities ($f_{\\rm esc}\\sim 0.05-0.1$, $M_{\\rm UV}\\lesssim -17$ to $-15$). Our results suggest that, once key astrophysical parameters are better constrained, the reionization history could serve as an independent and complementary probe of EDE cosmologies.",
      "pdf_url": "https://arxiv.org/pdf/2601.11068.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11864",
      "title": "Selecting Optimal Stellar Calibration Fields for the CSST Imaging Survey",
      "authors": [
        "Chenxiaoji Ling",
        "Juanjuan Ren",
        "Li Shao",
        "Zhimin Zhou",
        "Peng Wei",
        "Youhua Xu",
        "Jinyu Hu",
        "Xin Zhang",
        "Su Yao",
        "Hu Zhan",
        "Chao Liu"
      ],
      "abstract": "Selecting Optimal Stellar Calibration Fields for the CSST Imaging Survey Chenxiaoji Ling, Juanjuan Ren, Li Shao, Zhimin Zhou, Peng Wei, Youhua Xu, Jinyu Hu, Xin Zhang, Su Yao, Hu Zhan, Chao Liu 20 pages, 7 figures, submitted to RAA Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Chinese Space Station Survey Telescope (CSST) will perform a decade-long high-precision wide-field imaging survey that relies on rigorous on-orbit calibration. This necessitates stable celestial benchmark fields to maintain photometric and astrometric consistency throughout the mission lifetime. We establish comprehensive selection criteria including observational visibility, stellar number density, bright-star contamination, and interstellar dust extinction. Using the CSST Observation Strategy Analysis Tool (COSAT) and all-sky dust maps from Planck and SFD, we constrain eligible regions to the ranges of ecliptic latitude $ |\\beta| > 50^\\circ$ and galactic latitude $|b| > 15^\\circ$. From an initial sample of 29 candidate clusters meeting these spatial constraints, six globular clusters (M13, M92, NGC 104, NGC 362, NGC 1261, and NGC 1851) are identified as optimal calibration fields, fulfilling all the critical criteria. These selected clusters are recommended as optimal calibration field candidates for CSST's on-orbit calibration program, and are fundamental to achieving unprecedented photometric precision in CSST's space-based survey.",
      "pdf_url": "https://arxiv.org/pdf/2602.11864.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12017",
      "title": "Velocities of Free Floaters in a Sea of Stars",
      "authors": [
        "Jun Yan Lau",
        "Dong Lai"
      ],
      "abstract": "Velocities of Free Floaters in a Sea of Stars Jun Yan Lau, Dong Lai Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We investigate the velocity evolution of free-floating planets and interstellar objects (``free floaters'') through gravitational scatterings by field stars (with the stellar mass $m$ much larger than the mass of the floater, $m_p$). We show that the equilibrium velocity -- where dynamical friction balances stochastic acceleration -- is given by $\\sigma \\sqrt{2\\ln(m/m_p)}$ (where $\\sigma$ is the velocity disperson of the field stars), diverging from the standard energy equipartition scaling. While the timescale to reach this equilibrium is prohibitively long, we find that slow floaters ($v \\lesssim \\sigma$) undergo mass-independent acceleration, doubling their velocities within a few relaxation times. Consequently, free floaters initially following the Maxwellian distribution of their parent stars develop distinctly non-Maxwellian velocity distributions on a relaxation timescale. Since the relaxation time of the Galactic disk is longer than the age, our results suggest that the kinematics of low-mass free floaters in the disk may preserve signatures of their parent stars and ejection history.",
      "pdf_url": "https://arxiv.org/pdf/2602.12017.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12060",
      "title": "The Outflow of the B335 Protostar II: After the Outburst",
      "authors": [
        "Klaus W. Hodapp",
        "Adwin Boogert",
        "Doug Johnstone",
        "Valentin J. M. Le Gouellec",
        "Eleni Tsiakaliari",
        "Helen J. Fraser",
        "Laurie L. Chu",
        "Thomas Greene",
        "Marcia J. Rieke"
      ],
      "abstract": "The Outflow of the B335 Protostar II: After the Outburst Klaus W. Hodapp, Adwin Boogert, Doug Johnstone, Valentin J. M. Le Gouellec, Eleni Tsiakaliari, Helen J. Fraser, Laurie L. Chu, Thomas Greene, Marcia J. Rieke 45 pages, 28 figures, this paper has been submitted to the AAS Journals and will probably be published in the ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The B335 protostar has undergone a major outburst detected in the scattered light of its outflow cavity that has not yet ended. B335 therefore offers the rare opportunity to study its effect on the jet of a protostellar object. Photometry of background stars behind B335 is used to map visual continuum extinction and H$_2$O ice absorption and demonstrates that the outflow has carved out a cavity. Precise proper motions of the shock fronts emerging from the B335 protostar were obtained. The kinematic age of the most prominent shock front (3E) corresponds to the early phases of the ongoing outburst of the B335 protostar. Shock 3E shows strong CO gas emission, as well as H$_2$ and [\\ion{Fe}{2}] emission. Older shock fronts show diminished CO emission and are dominated by H$_2$ and [\\ion{Fe}{2}]. The emission feature 0E, closest to the protostar, is distinct in proper motion and radial velocity from the other shock fronts in the jet. In the span of 4\\arcsec\\ closest to the protostar, the continuum extinction in front of the outflow cavity increases by A$_V$~$\\approx$~200 mag. The CO-line-removed spectra close to the protostar show the unsaturated absorption features of $^{13}$CO$_2$, OCN$^-$, and OCS have strongly increasing column densities toward the protostar. The ice characteristics are overall similar to those found in lines of sight with less extinction. The central regions of the bipolar nebula show CO gas emission, but at distances of a few arcsec from the protostar, absorption by CO gas is also detected.",
      "pdf_url": "https://arxiv.org/pdf/2602.12060.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.10610",
      "title": "Searching for strong lensing by late-type galaxies in UNIONS",
      "authors": [
        "J. A. Acevedo Barroso , B. Clément , F. Courbin , R. Gavazzi , C. Lemon , K. Rojas , D. Scott , S. Gwyn , F. Hammer , M. J. Hudson , E. A. Magnier Institute of Physics, Laboratory of Astrophysics, Ecole Polytechnique Fédérale de Lausanne , Observatoire de Sauverny, 1290 Versoix, Switzerland, SCITAS, Ecole Polytechnique Fédérale de Lausanne , 1015 Lausanne, Switzerland, Institut de Ciències del , Universitat de Barcelona , Martí i Franquès 1, 08028 Barcelona, Spain, Institució Catalana de Recerca i Estudis Avançats , Passeig de Lluís Companys 23, 08010 Barcelona, Spain, Laboratoire d'Astrophysique de Marseille, UMR7326, Aix-Marseille Université, CNRS, CNES, 13013 Marseille, France, Institut d'Astrophysique de Paris, UMR 7095, CNRS, and Sorbonne Université, 98 bis boulevard Arago, 75014 Paris, France, Oskar Klein Centre, Department of Physics, Stockholm University, SE-106 91 Stockholm, Sweden, University of Applied Sciences and Arts of Northwestern Switzerland, School of Engineering, 5210 Windisch, Switzerland, Institute of Cosmology and Gravitation, University of Portsmouth, Burnaby Rd, Portsmouth PO1 3FX, UK, Department of Physics and Astronomy, University of British Columbia, Vancouver, BC V6T 1Z1, Canada, Canadian Astronomy Data Centre, Herzberg Astronomy and Astrophysics, National Research Council, 5071 West Saanich Rd Victoria BC V9E 2E7, Canada, LIRA, Observatoire de Paris, Université PSL, CNRS, Place Jules Janssen 92195, Meudon, France, Department of Physics and Astronomy, University of Waterloo, Waterloo, ON, N2L 3G1, Canada, Waterloo Centre for Astrophysics, Waterloo, ON, N2L 3G1, Canada, Perimeter Institute for Theoretical Physics, 31 Caroline St. N., Waterloo, ON, N2L 2Y5, Canada, Institute for Astronomy, University of Hawaii, 2680 Woodlawn Drive, Honolulu, HI 96822, USA)"
      ],
      "abstract": "Searching for strong lensing by late-type galaxies in UNIONS J. A. Acevedo Barroso (1), B. Clément (1 and 2), F. Courbin (1 and 3 and 4), R. Gavazzi (5 and 6), C. Lemon (1 and 7), K. Rojas (8 and 9), D. Scott (10), S. Gwyn (11), F. Hammer (12), M. J. Hudson (13 and 14 and 15), E. A. Magnier (16) ((1) Institute of Physics, Laboratory of Astrophysics, Ecole Polytechnique Fédérale de Lausanne (EPFL), Observatoire de Sauverny, 1290 Versoix, Switzerland, (2) SCITAS, Ecole Polytechnique Fédérale de Lausanne (EPFL), 1015 Lausanne, Switzerland, (3) Institut de Ciències del (ICCUB), Universitat de Barcelona (IEEC-UB), Martí i Franquès 1, 08028 Barcelona, Spain, (4) Institució Catalana de Recerca i Estudis Avançats (ICREA), Passeig de Lluís Companys 23, 08010 Barcelona, Spain, (5) Laboratoire d'Astrophysique de Marseille, UMR7326, Aix-Marseille Université, CNRS, CNES, 13013 Marseille, France, (6) Institut d'Astrophysique de Paris, UMR 7095, CNRS, and Sorbonne Université, 98 bis boulevard Arago, 75014 Paris, France, (7) Oskar Klein Centre, Department of Physics, Stockholm University, SE-106 91 Stockholm, Sweden, (8) University of Applied Sciences and Arts of Northwestern Switzerland, School of Engineering, 5210 Windisch, Switzerland, (9) Institute of Cosmology and Gravitation, University of Portsmouth, Burnaby Rd, Portsmouth PO1 3FX, UK, (10) Department of Physics and Astronomy, University of British Columbia, Vancouver, BC V6T 1Z1, Canada, (11) Canadian Astronomy Data Centre, Herzberg Astronomy and Astrophysics, National Research Council, 5071 West Saanich Rd Victoria BC V9E 2E7, Canada, (12) LIRA, Observatoire de Paris, Université PSL, CNRS, Place Jules Janssen 92195, Meudon, France, (13) Department of Physics and Astronomy, University of Waterloo, Waterloo, ON, N2L 3G1, Canada, (14) Waterloo Centre for Astrophysics, Waterloo, ON, N2L 3G1, Canada, (15) Perimeter Institute for Theoretical Physics, 31 Caroline St. N., Waterloo, ON, N2L 2Y5, Canada, (16) Institute for Astronomy, University of Hawaii, 2680 Woodlawn Drive, Honolulu, HI 96822, USA) Replacement after peer review. 25 pages, 11 figures. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Recent wide-field galaxy surveys have led to an explosion in the number of galaxy-scale strong gravitational lens candidates. However, the vast majority of them feature massive luminous red galaxies as the main deflectors, with late-type galaxies being vastly under-represented. This work presents a dedicated search for lensing by edge-on late-type galaxies in the Ultraviolet Near Infrared Optical Northern Survey (UNIONS). The search covers $3600$ deg$^2$ of $r$-band observations taken from the Canada-France-Hawaii Telescope. We considered all sources with magnitudes in the range $17 < r < 20.5$, without any colour pre-selection, yielding a parent sample of seven million sources. We characterised our parent sample via the visual inspection of $120\\,000$ sources selected at random. From it, we estimate, with a 68% confidence interval, that 1 in every $30\\,000$ sources is an edge-on lens candidate, with at least eight high-quality candidates in the parent sample. Our search relied on a convolutional neural network (CNN) to select a reduced sample of candidates, which we followed with a visual inspection to curate the final sample. The CNN was trained from scratch using simulated $r$-band observations of edge-on lenses, and real observations of non-lenses. We found 61 good edge-on lens candidates using the CNN. Moreover, combining the CNN candidates with those found serendipitously and those identified while characterising the parent sample, we discovered 4 grade A, 20 grade B, and 58 grade C edge-on lens candidates, effectively doubling the known sample of these systems. We also discovered 16 grade A, 16 grade B, and 18 grade C lens candidates of other types. Finally, based on the characterisation of the parent sample, we estimate that our search found around 60% of the bright grade A and B edge-on lens candidates within the parent sample.",
      "pdf_url": "https://arxiv.org/pdf/2503.10610.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.06922",
      "title": "The Ly$α$ and Continuum Origins Survey. III. Investigating the Link between Galaxy Morphology, Merger Properties and LyC Escape",
      "authors": [
        "Alexandra Le Reste",
        "Anne E. Jaskot",
        "Jordanne Brazie",
        "Claudia Scarlata",
        "Sophia R. Flury",
        "Kameswara B. Mantha",
        "Alaina Henry",
        "Matthew J. Hayes",
        "Göran Östlin",
        "Alberto Saldana-Lopez",
        "Trinh X. Thuan",
        "Maxime Trebitsch",
        "Xinfeng Xu",
        "Ricardo O. Amorín",
        "Cody A. Carr",
        "Floriane Leclercq",
        "Daniel Schaerer",
        "Aaron Smith",
        "Jens Melinder",
        "M. S. Oey",
        "Swara Ravindranath",
        "Michael Rutkowski",
        "Bingjie Wang"
      ],
      "abstract": "The Ly$α$ and Continuum Origins Survey. III. Investigating the Link between Galaxy Morphology, Merger Properties and LyC Escape Alexandra Le Reste, Anne E. Jaskot, Jordanne Brazie, Claudia Scarlata, Sophia R. Flury, Kameswara B. Mantha, Alaina Henry, Matthew J. Hayes, Göran Östlin, Alberto Saldana-Lopez, Trinh X. Thuan, Maxime Trebitsch, Xinfeng Xu, Ricardo O. Amorín, Cody A. Carr, Floriane Leclercq, Daniel Schaerer, Aaron Smith, Jens Melinder, M. S. Oey, Swara Ravindranath, Michael Rutkowski, Bingjie Wang Astrophysics of Galaxies (astro-ph.GA) Characterizing the mechanisms and galaxy properties conducive to the emission and escape of ionizing (LyC) emission is necessary to accurately model the Epoch of Reionization, and identify the sources that powered it. The Ly$\\alpha$ and Continuum Origins Survey (LaCOS) is the first program to obtain uniform, multi-wavelength subkiloparsec imaging for a large sample (42) of galaxies observed in LyC and enable statistically robust studies between LyC and resolved galaxy properties. Here, we characterize the morphology and galaxy merger properties of LaCOS galaxies and investigate their connection with the escape fraction of LyC emission $f_{esc}^{LyC}$. We find strong anticorrelations between $f_{esc}^{LyC}$ and size ($r_{20}$, $r_{50}$, and $r_{80}$) measured in filters containing emission from star-forming regions, and with the asymmetry and clumpiness in F150LP, the bluest filter in our dataset, tracing UV continuum and Ly$\\alpha$. We find that $\\geq48\\%$ of LaCOS galaxies, and $\\geq41\\%$ of LaCOS LyC-emitters are visually classified as galaxy mergers. Galaxies robustly identified as mergers in LaCOS are at advanced stages of interaction, close to coalescence. The $f_{esc}^{LyC}$ properties of robust mergers and low-probability mergers cannot be differentiated statistically, and we only find significant difference between the two populations in terms of their of their sizes and LyC luminosity: robust mergers having larger values. We conclude that (i) $f_{esc}^{LyC}$ tends to be larger in galaxies with a small number of compact, centrally-located, UV-emitting star-forming regions, (ii) at advanced stages of interaction represent a sizable fraction of LyC-emitting samples at $z\\sim0.3$, $z\\sim0$, and (iii) mergers can facilitate the escape of LyC photons from galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2509.06922.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.14912",
      "title": "Dynamics in the Cores of Self-Interacting Dark Matter Halos: Reduced Stalling and Accelerated Core Collapse",
      "authors": [
        "Frank C. van den Bosch",
        "Shashank Dattathri"
      ],
      "abstract": "Dynamics in the Cores of Self-Interacting Dark Matter Halos: Reduced Stalling and Accelerated Core Collapse Frank C. van den Bosch, Shashank Dattathri 25 pages, 16 figures. Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) Self-interacting dark matter (SIDM) is an intriguing alternative to the standard cold dark matter (CDM) paradigm, which predicts that dark matter halos typically have large, isothermal cores. Numerical simulations have shown that dynamical friction ceases to operate in cores of (roughly) constant density, a phenomenon known as core stalling. In addition, such cores often are unstable to a dipole instability that gives rise to dynamical buoyancy, causing massive central objects to move outward. Thus far, these manifestations of core dynamics have only been demonstrated in collisionless systems. In this paper, we use idealized N-body simulations to study whether core stalling and dynamical buoyancy operate in SIDM halos. We find that if the self-interactions are sufficiently strong, neither core stalling nor buoyancy are present, and a massive perturber will quickly sink all the way to the center of its host. In doing so, it gravitationally contracts the core, catalyzing a strongly accelerated core collapse. The reason why core dynamics are so different in SIDM halos is that self-interactions drive the halo's distribution function to a featureless exponential, removing any inflections or plateaus that are responsible for the dipole instability and core stalling in the case of CDM. We discuss implications of our finding for constraining the nature of dark matter by using observations of massive objects such as supermassive black holes (SMBHs), globular clusters, and nuclear star clusters in the central regions of galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2511.14912.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16549",
      "title": "N-emitters as possible sign-posts of GC formation",
      "authors": [
        "D. Schaerer",
        "R. Marques-Chaves",
        "H. Atek",
        "N. Prantzos",
        "C. Charbonnel",
        "M. Talia",
        "I. Morel",
        "M. Dessauges-Zavadsky",
        "Y.I. Izotov",
        "N. Guseva"
      ],
      "abstract": "N-emitters as possible sign-posts of GC formation D. Schaerer, R. Marques-Chaves, H. Atek, N. Prantzos, C. Charbonnel, M. Talia, I. Morel, M. Dessauges-Zavadsky, Y.I. Izotov, N. Guseva 9 pages, 5 figures. Astronomy & Astrophysics Letters, final version before formal acceptance Astrophysics of Galaxies (astro-ph.GA) Based on the finding of unusual chemical abundance ratios of N-emitters, which resemble those of globular cluster (GC) stars, their compactness, high ISM densities and other properties, it has been suggested that N-emitters could indicate the formation sites of globulars. A recent statistical study of the N-emitter population has quantified the frequency $f_N$ of these rare objects and their redshift evolution (Morel et al. 2025). Using these results we here test if N-emitters trace the formation of GCs and use the observed cosmic star-formation rate density evolution to predict the cosmological evolution of the GC population with time, their age distribution, and the total present-day stellar mass density formed in globulars. The predicted age distribution of GCs strongly resembles the typical asymmetric observed distributions in the Galaxy and ellipiticals, with a peak at $\\sim 11.5-12$ Gyr and a longer tail extending to younger ages. We derive a total stellar mass density formed in N-emitters down to redshift zero of $(2-7) \\times 10^5$ M$_{\\odot}$ Mpc$^{-3}$, which matches within a factor $\\sim 2$ the observed fraction of stellar mass found in the GC population at $z=0$. These results provide additional indirect arguments supporting the hypothesis that N-emitters could represent sign-posts of a short phase of GC formation.",
      "pdf_url": "https://arxiv.org/pdf/2512.16549.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16708",
      "title": "On the Origin of Kinematic Structure in the Young Association Serpens OB2",
      "authors": [
        "Michael A. Kuhn , Robert A. Benjamin , Simran S. Singh , University of Hertfordshire, University of Wisconsin-Whitewater)"
      ],
      "abstract": "On the Origin of Kinematic Structure in the Young Association Serpens OB2 Michael A. Kuhn (1), Robert A. Benjamin (2), Simran S. Singh (1),  ((1) University of Hertfordshire, (2) University of Wisconsin-Whitewater) Accepted for publication in MNRAS; Supplementary material is available at this https URL Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The Serpens OB2 association (l ~ 18.5 deg, b ~ 1.9 deg, d = 1950 +/- 30 pc) is a large star-forming complex ~65 pc above the Galactic midplane, with a clumpy, elongated structure extending ~50 pc parallel to the plane. We analyse probable association members, including OB stars and low-to-intermediate-mass young stellar objects (YSOs) from the SPICY catalogue. We use 13CO MWISP data to trace the molecular clouds. The OB stars are concentrated toward the centre of the association, coincident with a gap in the molecular clouds, and toward the side nearest the Galactic plane. The YSOs are distributed throughout the association, but cluster around molecular-cloud clumps. Using Gaia DR3 proper motions to probe the association's internal kinematics, we find aligned stellar velocities on length scales <2 pc, two-point statistics that show increasing velocity differences and predominantly divergent motions at larger separations, and distinct velocities for star clusters within the association. Finally, the association exhibits gradual but statistically significant global expansion perpendicular to the Galactic plane, with a spatial gradient of 0.10 +/- 0.02 km/s/pc. The clumpy stellar distribution, correlated velocities on small scales, and increasingly divergent motions on larger scales are consistent with an initial velocity field inherited from a turbulent molecular cloud modified by stellar feedback. The global vertical expansion may arise from large-scale turbulence or feedback-driven shell expansion, with the H II region Sh 2-54 preferentially pushing the molecular gas away from the Galactic plane. Ser OB2 demonstrates that the multi-scale expansion of an OB association can begin even while star formation is still ongoing throughout the complex.",
      "pdf_url": "https://arxiv.org/pdf/2512.16708.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.11174",
      "title": "Deep Submillimeter and Radio Observations in the SSA22 Field. IV. Spectral Energy Distributions, Star Formation Histories, and the Infrared-Radio Correlation of the 850 $μ$m-selected SMGs",
      "authors": [
        "Xin Zeng",
        "Yiping Ao",
        "Ken Mawatari",
        "Hideki Umehata"
      ],
      "abstract": "Deep Submillimeter and Radio Observations in the SSA22 Field. IV. Spectral Energy Distributions, Star Formation Histories, and the Infrared-Radio Correlation of the 850 $μ$m-selected SMGs Xin Zeng, Yiping Ao, Ken Mawatari, Hideki Umehata 36 pages, 15 figures; Submitted to ApJ; Comments are welcome Astrophysics of Galaxies (astro-ph.GA) We analyze the spectral energy distributions (SEDs), star formation histories (SFHs), and infrared-radio correlation (IRRC) of 221 850 $\\mu$m-selected submillimeter galaxies (SMGs) in the SSA22 deep field. The median mass-weighted age is 567 Myr. Most galaxies in our sample began forming $\\sim$ 1.68 Gyr after the Big Bang, entered the `SMG phase' after $\\sim$ 1 Gyr of evolution -- when they are predominantly observed -- and largely transitioned out of the `SMG phase' to become quiescent within an additional $\\sim$ 0.2 Gyr. A subset of massive galaxies shows rapid early assembly with high star formation efficiencies ($\\sim$0.2-0.8). The majority of SMGs reside at the high-mass end of the star-forming main sequence, with a characteristic stellar mass of $M_{star} \\sim 10^{11}$ M$_\\odot$, above which galaxies are predominantly either on the main sequence or already quenched. We observe a downsizing trend: more massive galaxies tend to ``mature\" earlier, completing their major episodes of star formation at higher redshifts compared to lower-mass systems. Our sample contributes $\\sim$ 21% (28%) to the cosmic star formation rate density (stellar mass density), including the overdensity, with its relative contribution peaking at 50-60% in the redshift range $z=2.5-3.5$. The median infrared-radio correlation parameter $q_{IR}$ is 2.37, evolving as $(1+z)^{-0.11}$, likely due to AGN contributions at high redshift and intrinsic differences between low- and high-redshift populations.",
      "pdf_url": "https://arxiv.org/pdf/2601.11174.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.11215",
      "title": "Deep Submillimeter and Radio Observations in the SSA22 Field. III. Multiwavelength Identifications and Properties of the 850 $μ$m-selected Submillimeter Galaxies",
      "authors": [
        "Xin Zeng",
        "Yiping Ao",
        "Zongfei Lyu",
        "Daizhong Liu",
        "Emanuele Daddi",
        "Ken Mawatari",
        "Hideki Umehata"
      ],
      "abstract": "Deep Submillimeter and Radio Observations in the SSA22 Field. III. Multiwavelength Identifications and Properties of the 850 $μ$m-selected Submillimeter Galaxies Xin Zeng, Yiping Ao, Zongfei Lyu, Daizhong Liu, Emanuele Daddi, Ken Mawatari, Hideki Umehata 50 pages, 27 figures; Submitted to ApJ; Comments are welcome Astrophysics of Galaxies (astro-ph.GA) We present a multiwavelength analysis of 850 $\\mu$m-selected SMGs (deblended S$_{\\rm 850}\\gtrsim$ 1mJy) in the SSA22 field, where our deepest JCMT/SCUBA-2 observations reach a sensitivity of $\\sigma_{850}\\sim$ 0.80mJy beam$^{-1}$. Using multiple identification methods, we have identified 248 deblended SMG candidates for 192 SCUBA-2 sources. The average multiplicity of SCUBA-2 sources is $\\sim$26%, with brighter sources exhibiting higher multiplicity. After applying quality cuts based on SED fitting reliability, our final sample comprises 221 SMGs associated with 186 SCUBA-2 sources. The SSA22 SMGs have a median infrared luminosity of (2.25$\\pm$0.25) $\\times$10$^{12}$ L$_{\\odot}$, with $\\sim$ 63% ($\\sim$ 8%) of the sample classified as ULIRGs (HLIRGs). The median redshift of the sample is $z = 2.00 \\pm 0.08$, while optically faint galaxies exhibit higher median redshift ($\\sim 2.20 \\pm 0.17$). The comoving volume density of SMGs increases by a factor of $\\sim 6$ at $z \\lesssim 4$, plateauing at $\\sim$ 1.78-3.16 $\\times$ 10$^{-5}$ cMpc$^{-3}$ over $z \\sim$ 1-3 (including the overdensity). The significant overdensity of SMGs within large-scale structures demonstrates their reliability as tracers of cosmic structure formation at high redshift. The median stellar mass and SFR of our SMG sample are $(1.55 \\pm 0.22) \\times 10^{11}$ M$_\\odot$ and $166 \\pm 25$ M$_\\odot$ yr$^{-1}$, respectively. We observe a clear ``downsizing\" signature: after cosmic noon ($z \\lesssim 2$), massive SMGs exhaust their gas reservoirs and transition to quiescence, while lower-mass SMGs continue forming stars and dominate the cosmic SFR density. The sample has a median dust mass of (1.95 $\\pm$ 0.14) $\\times$ 10$^{9}$ M$_{\\odot}$. The dust fraction ($ M_{\\text{dust}}/M_{\\text{star}}$) has a median value of (1.4 $\\pm$ 0.2) $\\times$ 10$^{-2}$. The median $A_V$ of SMGs is 3.09$\\pm$0.07mag.",
      "pdf_url": "https://arxiv.org/pdf/2601.11215.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16977",
      "title": "ReveaLLAGN 1: JWST Emission-Line Spectra Reveal Low-Luminosity AGN with UV-Deficient SEDs and Warm Molecular Gas",
      "authors": [
        "Kameron Goold",
        "Anil Seth",
        "Mallory Molina",
        "David Ohlson",
        "Nischal Acharya",
        "Torsten Böker",
        "Antoine Dumont",
        "Michael Eracleous",
        "Anja Feldmeier-Krause",
        "Juan Antonio Fernández-Ontiveros",
        "Elena Gallo",
        "Andy D. Goulding",
        "Kayhan Gültekin",
        "Luis C. Ho",
        "Nadine Neumayer",
        "Richard M. Plotkin",
        "Almudena Prieto",
        "Jessie C. Runnoe",
        "Shobita Satyapal",
        "Glenn van de Ven",
        "Jonelle L. Walsh",
        "Feng Yuan",
        "Nora Lützgendorf"
      ],
      "abstract": "ReveaLLAGN 1: JWST Emission-Line Spectra Reveal Low-Luminosity AGN with UV-Deficient SEDs and Warm Molecular Gas Kameron Goold, Anil Seth, Mallory Molina, David Ohlson, Nischal Acharya, Torsten Böker, Antoine Dumont, Michael Eracleous, Anja Feldmeier-Krause, Juan Antonio Fernández-Ontiveros, Elena Gallo, Andy D. Goulding, Kayhan Gültekin, Luis C. Ho, Nadine Neumayer, Richard M. Plotkin, Almudena Prieto, Jessie C. Runnoe, Shobita Satyapal, Glenn van de Ven, Jonelle L. Walsh, Feng Yuan, Nora Lützgendorf Accepted to The Astrophysical Journal, February 11, 2026. 25 pages, 10 figures Astrophysics of Galaxies (astro-ph.GA) We present near- and mid-infrared spectra of eight Low-Luminosity Active Galactic Nuclei (LLAGN), spanning nearly four orders of magnitude in black hole mass and Eddington ratio, obtained with JWST/NIRSpec and MIRI as part of the ReveaLLAGN program along with identical archival data of Cen A. The high spatial resolution of JWST cleanly separates AGN emission from host-galaxy contamination, enabling detections of high-ionization potential lines more than an order of magnitude fainter than previously measured. Emission-line diagnostics reveal a transition at log($L_{bol}/L_{Edd}$) ~ -3.5, where the spectral energy distribution becomes increasingly deficient in ultraviolet photons. We find that rotational H$_2$ excitation temperatures are elevated (~500 K higher) compared to both higher-luminosity AGN and star-forming galaxies, while the H$_2$(0-0)S(3)/PAH$_{11.3 \\mu m}$ ratios are consistent with those observed in the AGN population. We discuss the possible roles of outflows, jets, and X-ray dominated regions in shaping the interstellar medium surrounding LLAGN. Silicate emission at ~10 $\\mu$m, localized to the nuclear region, is detected in most ReveaLLAGN targets. This dataset offers the first comprehensive JWST-based characterization of infrared emission lines in the nuclear regions of LLAGN.",
      "pdf_url": "https://arxiv.org/pdf/2601.16977.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.08447",
      "title": "Stratification of the AGN-Driven multi-phase outflows in the dwarf Seyfert galaxy NGC 4395",
      "authors": [
        "Payel Nandi",
        "Luis Colina",
        "Rogemar A. Riffel",
        "Miguel Pereira Santaella",
        "C. S. Stalin",
        "D. J. Saikia",
        "Javier Alvarez-Marquez",
        "Markus Kissler-Patig"
      ],
      "abstract": "Stratification of the AGN-Driven multi-phase outflows in the dwarf Seyfert galaxy NGC 4395 Payel Nandi, Luis Colina, Rogemar A. Riffel, Miguel Pereira Santaella, C. S. Stalin, D. J. Saikia, Javier Alvarez-Marquez, Markus Kissler-Patig 27 pages, 12 figures, Accepted for the publication in The Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) We present a multi-wavelength study of nuclear outflows in the nearby dwarf Seyfert galaxy NGC~4395, which hosts an intermediate-mass black hole. Using \\textit{JWST}/NIRSpec and MIRI IFU spectroscopy (1.66--28.6~$\\mu$m), together with ALMA and Gemini/GMOS data, we probe the ionised and molecular gas on parsec scales. The JWST nuclear spectra reveal 134 emission lines, including H\\,\\textsc{i}, He, numerous fine-structure lines, H$_2$ rotational/ro-vibrational transitions, and several PAH bands. Modelling of the H$_2$ rotational lines reveals three warm/hot molecular components ($T\\!\\approx\\!580$, 1480, and 2900~K), along with a cold ($<50$~K) phase traced by ALMA CO(2--1). Outflow signatures are detected in cold and warm/hot molecular gas, in H\\,\\textsc{i}, and in 36 fine-structure lines spanning ionisation potentials of 7.6--300~eV. Ionised outflow velocities range from 127 to 716~km\\,s$^{-1}$, with blueshifted and redshifted components consistent with a stratified biconical geometry. The cold molecular gas shows a mass outflow rate nearly 1--2 orders of magnitude larger than that of the warm/hot molecular and ionised phases. The kinetic coupling efficiency is 0.003--0.12\\% for the coronal-line gas and 0.4--1.4\\% for the H\\,\\textsc{i} outflow, indicating that only the low-ionisation gas significantly impacts the surrounding ISM. Outflow velocity and the fraction of flux in the outflowing component increase with ionisation potential, implying that the most highly ionised gas originates closest to the AGN and is most efficiently accelerated.",
      "pdf_url": "https://arxiv.org/pdf/2602.08447.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.18322",
      "title": "The Timescales of Embedded Star Formation as Observed in STARFORGE",
      "authors": [
        "Tobin M. Wainer",
        "Julianne J. Dalcanton",
        "Michael Y. Grudić",
        "Stella S. R. Offner",
        "Adam Smercina",
        "Benjamin F. Williams",
        "L. Clifton Johnson",
        "J. Peltonen",
        "Eric W. Koch",
        "Kartik R. Neralwar"
      ],
      "abstract": "The Timescales of Embedded Star Formation as Observed in STARFORGE Tobin M. Wainer, Julianne J. Dalcanton, Michael Y. Grudić, Stella S. R. Offner, Adam Smercina, Benjamin F. Williams, L. Clifton Johnson, J. Peltonen, Eric W. Koch, Kartik R. Neralwar 32 pages, 16 Figures, 1 table. Published in the Astrophysical Journal, DOI https://doi.org/10.3847/1538-4357/ae38b7. Interactive Figures are made available with journal publication Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Star formation occurs within dusty molecular clouds that are then disrupted by stellar feedback. However, the timing and physical mechanisms that govern the transition from deeply embedded to exposed stars remain uncertain. Using the STARFORGE simulations, we analyze the evolution of ``embeddedness'', identifying what drives emergence. We find the transition from embedded to exposed is fast for individual stars, within 1.3 Myr after the star reaches its maximum mass. This rapid transition is dominated by massive stars, which accrete while remaining highly obscured until their feedback eventually balances, then overcomes, the local accretion. For these massive stars, their maximum mass is reached simultaneously with their emergence. Once these stars are revealed, their localized, pre-supernova feedback then impacts the cloud, driving gas clearance. Because massive stars dominate the luminosity, their fast, local evolution dominates the light emergence from the dust. We calculate the dependence of these processes on the mass of the cloud and find that emergence always depends on when massive stars form, which scales with the cloud's free-fall time. We also measure the evolution of dust and H$\\alpha$ luminosities, where for $\\sim$2 Myr, these tracers outshine the emerging stellar continuum, reaching their peak when gas and dust remain tightly coupled to the massive stars. These results closely resemble observationally observed lifetimes, tying the observable dust and line emission directly to the same localized processes that drive stellar emergence, evidence that our simulated de-embedding physics is representative of real star-forming regions. Thus, because the initial embedding of the most luminous stars is highly local, the emergence of stars is a faster, earlier, more local event than the overall disruption of the cloud by gas expulsion.",
      "pdf_url": "https://arxiv.org/pdf/2509.18322.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11227",
      "title": "Tidal triggers and the predictability of solar activity",
      "authors": [
        "F. Stefani",
        "G.M. Horstmann",
        "G. Mamatsashvili",
        "T. Weier"
      ],
      "abstract": "Tidal triggers and the predictability of solar activity F. Stefani, G.M. Horstmann, G. Mamatsashvili, T. Weier Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Magneto-Rossby waves in the solar tachocline are currently considered to be one of the main determinants of solar activity. In particular, they can give rise to the quasi-biennial oscillation (QBO). The latter was recently shown to be dominated by a phase-stable period of around 1.7 years. By analyzing 72 ground-level enhancement (GLE) events and 37 S-flares, we determine that this period is close to 1.723 years. This, in turn, is the dominant beat between the periods of the spring tides of the tidally dominant planets Venus, Earth, and Jupiter, which are suspected to synchronize not only the QBO, but also the 11.07-year Schwabe cycle. We demonstrate that recent events, such as the solar storm of 2024 May 10 and the strong X-flare of 2026 February 1, align well with maxima of the tidal forcing. By contrast, the Carrington event (1959 September 1) does not fit this pattern.",
      "pdf_url": "https://arxiv.org/pdf/2602.11227.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11649",
      "title": "Dynamic modeling of coronal abundances during flares on M-dwarf stars",
      "authors": [
        "David H. Brooks",
        "Jeffrey W. Reep",
        "Andy S.H. To",
        "Luke Fushimi Benavitz",
        "Lucas A. Tarr"
      ],
      "abstract": "Dynamic modeling of coronal abundances during flares on M-dwarf stars David H. Brooks, Jeffrey W. Reep, Andy S.H. To, Luke Fushimi Benavitz, Lucas A. Tarr To be Published in Philosophical Transactions A of the Royal Society. Special Issue on Solar Atmospheric Abundances in Space and Time Solar and Stellar Astrophysics (astro-ph.SR) Solar atmospheric elemental abundances are now known to vary both in space and time. Dynamic modeling of these changes is therefore necessary to improve the accuracy of radiative hydrodynamic simulations. Recent studies have shown that including spatio-temporal variations in coronal abundances during solar flares leads to the formation of coronal condensations (rain), which are otherwise difficult to create in impulsively heated field aligned hydrodynamic flare models. These simulations start with a solar corona dominated by the first ionization potential (FIP) effect, and evaporate photospheric material into the post-flare loops. We here explore perhaps the most extreme non-solar starting condition for the coronal composition in these simulations: an initial corona dominated by the inverse FIP (iFIP) effect, such as is observed on active M-dwarf stars. We show that a flaring event in a corona enriched with high FIP elements leads to a solution similar to the solar case. Coronal rain is harder to form by this method during flares on M-dwarfs, however, if the corona is depleted of low FIP elements.",
      "pdf_url": "https://arxiv.org/pdf/2602.11649.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11853",
      "title": "Three-dimensional mapping of coronal magnetic field and plasma parameters in a solar flare",
      "authors": [
        "Tatyana Kaltman",
        "Sijie Yu",
        "Gregory D. Fleishman",
        "Daniel F. Ryan"
      ],
      "abstract": "Three-dimensional mapping of coronal magnetic field and plasma parameters in a solar flare Tatyana Kaltman, Sijie Yu, Gregory D. Fleishman, Daniel F. Ryan 11 pages, 11 figures. Accepted for publication in Astronomy & Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) Diagnosing solar flare conditions is essential for understanding coronal energy release. Using combined microwave and X-ray data, we reconstruct three-dimensional maps of the magnetic field and plasma parameters in the SOL2021-05-07 flare. We use imaging spectroscopy from the Expanded Owens Valley Solar Array (EOVSA) to derive spatial maps of the magnetic field strength, thermal and nonthermal electron densities, and the power-law index of nonthermal electrons through gyrosynchrotron modeling. Simultaneous X-ray observations from Hinode/XRT and Solar Orbiter/STIX, obtained from different vantage points, enable a stereoscopic reconstruction of the flaring loop. By correlating the positions of microwave and thermal X-ray sources, we associate the three-dimensional coordinates with the microwave-derived plasma parameters. We derive observational three-dimensional maps of magnetic field strength, Alfvén speed, and plasma beta in the flaring volume, revealing a magnetically dominated environment. These spatially resolved diagnostics provide valuable constraints for models of magnetic reconnection and flare dynamics and represent a step toward a realistic three-dimensional characterization of energy release in solar eruptive events.",
      "pdf_url": "https://arxiv.org/pdf/2602.11853.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11884",
      "title": "Signatures of Damping Nonlinear Oscillations by KHI-induced Turbulence in Synthetic Observations",
      "authors": [
        "Sihui Zhong",
        "Andrew Hillier",
        "Iñigo Arregui"
      ],
      "abstract": "Signatures of Damping Nonlinear Oscillations by KHI-induced Turbulence in Synthetic Observations Sihui Zhong, Andrew Hillier, Iñigo Arregui 22 pages, 9 figures, 3 tables, accepted by ApJ Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Large-amplitude decaying kink oscillations of coronal loops are strongly influenced by nonlinear processes, such as Kelvin-Helmholtz instability (KHI) and turbulence, though comprehensive theory and observational confirmation remain limited. Building on the recently developed theory on nonlinear damping by KHI-induced turbulence in impulsively driven transverse loop oscillations, we investigate its observational signatures using 3D magnetohydrodynamic simulations and forward-modelled EUV images. The simulated oscillations exhibit time-varying frequency shifts and damping rates, which are broadly consistent with nonlinear turbulence-damping theory. Additionally, they exhibit excitation of higher-order modes, slightly increased periods relative to the linear kink period, and reduced displacement amplitudes. These features are generally preserved in synthetic observations, though resolving higher-order modes requires higher spatial resolution than currently available. For loops embedded in a hotter background, hotter channels (e.g., 193 Angstroms) are more sensitive to boundary dynamics, thus their oscillations decay faster with smaller displacements and larger phase shifts than those in cooler channels (e.g., 171 Angstroms). Comparisons of simulated and synthetic oscillations show close agreement at the early stage. At later times, synthetic oscillations exhibit smaller displacements and larger phase shifts, due to turbulence-induced asymmetry in the loop cross-section. Bayesian fitting shows that the initial oscillation amplitude and kink period are robustly constrained, whereas parameters controlling the damping profile are degenerate, indicating that additional observables would aid reliable seismological inference. These results provide a quantitative basis for identifying nonlinear damping and detecting KHI-driven turbulence in transverse loop oscillations.",
      "pdf_url": "https://arxiv.org/pdf/2602.11884.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11994",
      "title": "Surface brightness-colour relations of Milky Way and Magellanic Clouds classical Cepheids based on Gaia magnitudes",
      "authors": [
        "M.C. Bailleul",
        "N. Nardetto",
        "V. Hocdé",
        "P. Kervella",
        "W. Gieren",
        "J. Storm",
        "G. Pietrzyński",
        "A. Gallenne",
        "D. Graczyk",
        "G. Bras",
        "O. Creevey",
        "A. Recio Blanco",
        "P. de Laverny",
        "P.A. Palicio",
        "W. Kiviaho"
      ],
      "abstract": "Surface brightness-colour relations of Milky Way and Magellanic Clouds classical Cepheids based on Gaia magnitudes M.C. Bailleul, N. Nardetto, V. Hocdé, P. Kervella, W. Gieren, J. Storm, G. Pietrzyński, A. Gallenne, D. Graczyk, G. Bras, O. Creevey, A. Recio Blanco, P. de Laverny, P.A. Palicio, W. Kiviaho Solar and Stellar Astrophysics (astro-ph.SR) Aims: We derive SBCRs for classical Cepheids in the Milky Way and in the Magellanic Clouds using the photometric data available in the Gaia database, and we quantify the metallicity effect. Methods: We first selected the data on the basis of a number of quality criteria and chose the best photometric data and the best parallaxes available in Gaia for Milky Way classical Cepheids. Secondly, we compiled an extensive list of period-radius (PR) relations available in the literature, and we also provide a new PR relation based on interferometric data in our previous work. Thirdly, combining the radius of classical Cepheids with distance estimates (based on Gaia parallaxes for the Milky Way and on eclipsing binaries for the Magellanic Clouds), we derived the surface brightness and colour of about 1700 classical Cepheids. Results: We first derived a new PR relation based on interferometric data and distances from the literature of seven classical Cepheids: $\\mathrm{\\log(R/R_{\\odot}) = 1.133_{\\pm 0.019} + 0.688_{\\pm 0.016} log(P)}$. The metallicity does not affect the PR relations. Secondly, we calculated three different SBCRs for the Milky Way and Large and Small Magellanic Cloud classical Cepheids based on this new PR relation that clearly show the dependence of the metallicity on the SBCR based on Gaia magnitudes alone. Finally, we derived relations between the slopes, the zero points (ZP), and the metallicity ([Fe/H]) of these three SBCRs: $\\mathrm{Slope_{SBCR}=-0.0663_{\\pm 0.0121} [Fe/H] - 0.3010_{\\pm 0.0030}}$ and $\\mathrm{ZP_{SBCR}=-0.1016_{\\pm 0.0091} [Fe/H] + 3.9988_{\\pm 0.0029}}$. Conclusions: These new SBCRs, dedicated to classical Cepheids in the Milky Way and Magellanic Clouds, are of particular importance to apply the inverse Baade-Wesselink method to classical Cepheids observed by Gaia in a forthcoming study.",
      "pdf_url": "https://arxiv.org/pdf/2602.11994.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11923",
      "title": "The Radius Cliff is a Waterfall: Explaining Sub-Neptune Exoplanets with Steam Worlds",
      "authors": [
        "Aritra Chakrabarty",
        "Gijs D. Mulders",
        "Artyom Aguichine",
        "Natalie Batalha"
      ],
      "abstract": "The Radius Cliff is a Waterfall: Explaining Sub-Neptune Exoplanets with Steam Worlds Aritra Chakrabarty, Gijs D. Mulders, Artyom Aguichine, Natalie Batalha 22 pages, 9 figures, accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) The demographics of Kepler planets provide a key testbed for models of planet formation and evolution, particularly for explaining the radius valley separating super-Earths and sub-Neptunes. A primordial interpretation based on differences in bulk densities -- where rocky and water-rich planets form via migration pathways -- offers an alternative to atmospheric loss scenarios. Updated interior structure models of water worlds with adiabatic steam atmospheres reproduce the observed valley near $\\sim2~R_\\oplus$ more accurately. Furthermore, migration models from our Genesis library suggest that these formation pathways can also account for the distinct period distributions of super-Earths and sub-Neptunes, as well as the emergence of the hot Neptune desert. Motivated by this, we develop a Bayesian hierarchical mixture model for close-in Kepler planets ($P<100$ days), combining rocky planets and water worlds without H/He envelopes. The inferred mass distributions of rocky and water-rich planets peak at $\\sim2.6~M_\\oplus$ and $\\sim7~M_\\oplus$, respectively, with the water mass fraction of water worlds peaking at $\\sim41\\%$. Water worlds provide a good representation of the Kepler sub-Neptune population, with the radius cliff emerging as a ``waterfall\" -- a sharp decline in their occurrence. However, our mass-radius analysis shows that water worlds alone cannot explain planets with $R \\gtrsim 3~R_\\oplus$, implying that at least $\\sim20\\%$ of sub-Neptunes in the sample are enriched in H/He gas.",
      "pdf_url": "https://arxiv.org/pdf/2602.11923.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.15361",
      "title": "Full non-LTE multi-level radiative transfer I. An atom with three bound infinitely sharp levels",
      "authors": [
        "Tristan Lagache",
        "Frédéric Paletou",
        "Malali Sampoorna"
      ],
      "abstract": "Full non-LTE multi-level radiative transfer I. An atom with three bound infinitely sharp levels Tristan Lagache, Frédéric Paletou, Malali Sampoorna 10 pages, 8 figures, in production in Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) The standard nonlocal thermodynamic equilibrium (non-LTE) multi-level radiative transfer problem only takes into account the deviation of the radiation field and atomic populations from their equilibrium distribution. We aim to show how to solve for the full non-LTE (FNLTE) multi-level radiative transfer problem, also accounting for deviation of the velocity distribution of the massive particles from Maxwellian. We considered, as a first step, a three-level atom with zero natural broadening. In this work, we present a new numerical scheme. Its initialisation relies on the classic, multi-level approximate Lambda-iteration (MALI) method for the standard non-LTE problem. The radiative transfer equations, the kinetic equilibrium equations for atomic populations, and the Boltzmann equations for the velocity distribution functions were simultaneously iterated in order to obtain self-consistent particle distributions. During the process, the observer's frame absorption and emission profiles were re-computed at every iterative step by convolving the atomic frame quantities with the relevant velocity distribution function. We validate our numerical strategy by comparing our results with the standard non-LTE solutions in the limit of a two-level atom with Hummer's partial redistribution in frequency, and with a three-level atom with complete redistribution. In this work, we considered the so-called cross-redistribution problem. We then show new FNLTE results for a simple three-level atom while evaluating the assumptions made for the emission and absorption profiles of the standard non-LTE problem with partial and cross-redistribution.",
      "pdf_url": "https://arxiv.org/pdf/2506.15361.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02581",
      "title": "The nature of ASASSN-24fw's occultation: modelling the event as dimming by optically thick rings around a sub-stellar companion",
      "authors": [
        "Sarang Shah",
        "Jonathan P. Marshall",
        "Carlos del Burgo",
        "Gergely Hajdu",
        "Isabel Rebollido",
        "Bogumił Pilecki",
        "Ashish Mahabal",
        "Mansi M. Kasliwal",
        "Viraj Karambelkar",
        "Matthew J. Graham",
        "Stanislav G. Djorgovski",
        "Daniel Stern",
        "Sascha T. Zeegers",
        "Bacham Eswar Reddy",
        "Ciska Kemper"
      ],
      "abstract": "The nature of ASASSN-24fw's occultation: modelling the event as dimming by optically thick rings around a sub-stellar companion Sarang Shah, Jonathan P. Marshall, Carlos del Burgo, Gergely Hajdu, Isabel Rebollido, Bogumił Pilecki, Ashish Mahabal, Mansi M. Kasliwal, Viraj Karambelkar, Matthew J. Graham, Stanislav G. Djorgovski, Daniel Stern, Sascha T. Zeegers, Bacham Eswar Reddy, Ciska Kemper Accepted for publication and in press Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) ASASSN-24fw is a main-sequence F-type star that experienced a rapid and long-lasting dimming event beginning in late 2024 and continuing until mid 2025. Its pre-dimming spectral energy distribution shows a persistent infrared excess with a fractional luminosity of approximately 0.5 percent. We model this excess using a two-component blackbody fit and find dust components with temperatures of about 1070 K and 390 K. Archival light curves indicate that ASASSN-24fw was photometrically stable prior to the event, suggesting that the dimming is caused by an external occulting body rather than intrinsic stellar variability. The event lasted about 275 days and exhibits a distinctive flat-bottomed profile of nearly 200 days, unlike most long-duration occultation events reported in the last decade. We analyze the light curve and spectra obtained during dimming to study the properties of both the star and the occulting material. A parametric light-curve model reveals multiple ingress phases, consistent with variations in the density and structure of the obscuring material. A second transit model favors an occulting body consistent with a gas giant or brown dwarf with a minimum mass of about 3.4 Jupiter masses and surrounded by an extended circumplanetary disk or rings of radius roughly 0.17 au. Near-infrared spectra taken during dimming show enhanced infrared excess and spectral features consistent with a late-type companion, approximately M8. We also detect variable H-alpha emission, suggesting evolving gas and dust in the occulting structure. Imaging from LCOGT identifies a nearby object within 3 arcsec, likely a bound companion at a projected separation of about 3000 au. Systems like ASASSN-24fw appear rare, and continued follow-up will help constrain the nature of the occulting body and the circumstellar environment.",
      "pdf_url": "https://arxiv.org/pdf/2511.02581.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09716",
      "title": "Simulated Operational Testing of the Prototype Implementation of the SOFIE Model: The 2025 Space Weather Prediction Testbed Exercise",
      "authors": [
        "Weihao Liu",
        "Lulu Zhao",
        "Igor V. Sokolov",
        "Kathryn Whitman",
        "Tamas I. Gombosi",
        "Nishtha Sachdeva",
        "Eric T. Adamson",
        "Hazel M. Bain",
        "Claudio Corti",
        "M. Leila Mays",
        "Michelangelo Romano",
        "Carina R. Alden",
        "Madeleine M. Anastopulos",
        "Mary E. Aronne",
        "Janet E. Barzilla",
        "Wesley T. Cook",
        "Shawn D. Dahl",
        "Hannah Hermann",
        "Anthony J. Iampietro",
        "A. Steve Johnson",
        "Elizabeth A. Juelfs",
        "Melissa R. Kane",
        "Jonathan D. Lash",
        "Kimberly Moreland",
        "Briana K. Muhlestein",
        "Teresa Nieves-Chinchilla",
        "Edward Semones",
        "James F. Spann",
        "Earl M. Spencer",
        "Luke A. Stegeman",
        "Christopher J. Stubenrauch",
        "Kenneth L. Tegnell"
      ],
      "abstract": "Simulated Operational Testing of the Prototype Implementation of the SOFIE Model: The 2025 Space Weather Prediction Testbed Exercise Weihao Liu, Lulu Zhao, Igor V. Sokolov, Kathryn Whitman, Tamas I. Gombosi, Nishtha Sachdeva, Eric T. Adamson, Hazel M. Bain, Claudio Corti, M. Leila Mays, Michelangelo Romano, Carina R. Alden, Madeleine M. Anastopulos, Mary E. Aronne, Janet E. Barzilla, Wesley T. Cook, Shawn D. Dahl, Hannah Hermann, Anthony J. Iampietro, A. Steve Johnson, Elizabeth A. Juelfs, Melissa R. Kane, Jonathan D. Lash, Kimberly Moreland, Briana K. Muhlestein, Teresa Nieves-Chinchilla, Edward Semones, James F. Spann, Earl M. Spencer, Luke A. Stegeman, Christopher J. Stubenrauch, Kenneth L. Tegnell Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM); Space Physics (physics.space-ph) The CLEAR Space Weather Center of Excellence's solar energetic particle (SEP) model, SOlar wind with FIeld lines and Energetic particles (SOFIE), was run and evaluated on-site during the Space Weather Prediction Testbed (SWPT) exercise at the National Oceanic and Atmospheric Administration's Space Weather Prediction Center (NOAA/SWPC) in May 2025. As a physics-based SEP model, SOFIE simulates the acceleration and transport of energetic particles by the coronal mass ejection (CME)-driven shock in the solar corona and inner heliosphere, and has been validated against historical events. However, questions remain regarding whether a physics-based model, traditionally considered computationally expensive, could meet operational needs. The SWPT exercise offered a valuable opportunity to evaluate SOFIE under simulated operational conditions. On-site interactive feedback from SWPC forecasters, Space Radiation Analysis Group (SRAG) console operators, Community Coordinated Modeling Center (CCMC) personnel, and Moon-to-Mars Space Weather Analysis Office (M2M SWAO) analysts led to significant strategic improvements in the model configuration. The simulation grid was optimized by combining a coarser background grid with higher-resolution regions along the CME path and toward Earth, reducing computational cost without compromising accuracy. In this work, we present the simulated operational performance of SOFIE and its capability to predict SEP fluxes significantly faster than real time. During the SWPT exercise, SOFIE completed a 4-day SEP simulation within 5 hours using 1,000 central processing unit cores, although the earliest SEP forecast was obtained a few hours after CME onset. This marks a milestone in demonstrating SOFIE's operational usefulness and robustness to support future human space exploration.",
      "pdf_url": "https://arxiv.org/pdf/2511.09716.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.01543",
      "title": "Characterizing the Post-Red Supergiant binary system AFGL 4106 and its complex nebula with SPHERE/VLT",
      "authors": [
        "G. Tomassini",
        "E. Lagadec",
        "I. El Mellah",
        "R. D. Oudmaijer",
        "A. Chiavassa",
        "M. N'Diaye",
        "P. de Laverny",
        "N. Nardetto",
        "A. Matter"
      ],
      "abstract": "Characterizing the Post-Red Supergiant binary system AFGL 4106 and its complex nebula with SPHERE/VLT G. Tomassini, E. Lagadec, I. El Mellah, R. D. Oudmaijer, A. Chiavassa, M. N'Diaye, P. de Laverny, N. Nardetto, A. Matter Solar and Stellar Astrophysics (astro-ph.SR) Aims: We aim to characterize the physical and morphological properties of the binary system AFGL 4106, composed of two evolved massive stars. Understanding its mass-loss processes and circumstellar environment offers insight into the late stages of stellar evolution in massive binary systems. Methods: We obtained high-angular--resolution, high-contrast imaging using VLT/SPHERE with ZIMPOL (optical) and IRDIS (near-infrared) across multiple filters. We used aperture photometry to extract the spectral energy distributions (SEDs) of each star, and applied radiative transfer modelling to study the system and its surrounding dusty environment. Results: The observations resolve both components of the binary and unveil a complex, dusty nebula featuring asymmetric structures and cavities. SED fitting yields stellar temperatures of T$_1 = 6723\\pm196$ K and T$_2 = 3394\\pm264$ K, along with bolometric luminosities of L$_1 = (7.9 \\pm 0.18) \\times 10^4$ L$_\\odot$ and L$_2 = (3.8 \\pm 0.11) \\times 10^4$ L$_\\odot$. These values support the classification of the primary as being in a post-red supergiant (post-RSG) phase and the secondary as an active red supergiant (RSG). The luminosity ratio, combined with the inferred radii, indicates that both stars are at close yet distinct stages of their evolution. The binary is surrounded by an extended shell whose asymmetric morphology and large-scale features suggest interaction with the stellar winds and interstellar medium (ISM), and possibly the presence of a third, undetected companion. Conclusions: These observations provide the first resolved view of AFGL 4106's system and its dusty envelope. Our analysis sets constraints on the physical properties and evolutionary status of the system. This work contributes to understanding mass-loss processes in massive binaries and the shaping of nebulae around evolved stars.",
      "pdf_url": "https://arxiv.org/pdf/2512.01543.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10477",
      "title": "Data-driven Magnetohydrodynamic Simulation of the Initiation of a Coronal Mass Ejection with Multiple Stages",
      "authors": [
        "J. H. Guo",
        "S. Poedts",
        "B. Schmieder",
        "Y. Guo",
        "C. Zhou",
        "H. Wu",
        "Y. W. Ni",
        "Z. Zhong",
        "Y. H. Zhou",
        "S. H. Li",
        "P. F. Chen"
      ],
      "abstract": "Data-driven Magnetohydrodynamic Simulation of the Initiation of a Coronal Mass Ejection with Multiple Stages J. H. Guo, S. Poedts, B. Schmieder, Y. Guo, C. Zhou, H. Wu, Y. W. Ni, Z. Zhong, Y. H. Zhou, S. H. Li, P. F. Chen Accepted for publication in A&A Letter Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Coronal mass ejections (CMEs) are the primary drivers of adverse space-weather events, yet their initiation and onset prediction remain insufficiently understood due to the complexity of the magnetic topology and physical processes in real solar source regions. Here, based on fully observational-data-driven magnetohydrodynamic simulation, we successfully reproduce the initiation of a CME originating from the super active region AR 13663, with only a one-minute time lag between the flare peak in observations and the velocity peak of the rising flux rope in the simulation. Moreover, the eruptive structure exhibits a multi-stage kinematic evolution: an initial slow acceleration, a plateau at a nearly stationary height, and a subsequent impulsive acceleration. These stages correspond to torus instability, the downward tension force exerted by the overlying toroidal field, and fast magnetic reconnection, respectively. Our results highlight the inherently multistage nature of CME initiation in real events. In configurations with strong overlying toroidal fields, the downward toroidal-field-induced tension force can suppress the rise of the flux rope and produce a plateau phase at a nearly stable height, even when torus instability occurs. In contrast, the subsequent fast magnetic reconnection beneath the flux rope can drive the impulsive eruption more effectively. The close agreement between the observed and simulated peak times over one minute demonstrates the strong potential of our data-driven model for predicting CME onset.",
      "pdf_url": "https://arxiv.org/pdf/2602.10477.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.09753",
      "title": "The democratic detrender: Ensemble-Based Removal of the Nuisance Signal in Stellar Time-Series Photometry",
      "authors": [
        "Daniel A. Yahalomi",
        "David Kipping",
        "Diana Solano-Oropeza",
        "Madison Li",
        "Avishi Poddar",
        "Xunhe Zhang",
        "Yassine Abaakil",
        "Benjamin Cassese",
        "Alex Teachey",
        "Jiajing Liu",
        "Farai Sundai",
        "Lila Valaskovic"
      ],
      "abstract": "The democratic detrender: Ensemble-Based Removal of the Nuisance Signal in Stellar Time-Series Photometry Daniel A. Yahalomi, David Kipping, Diana Solano-Oropeza, Madison Li, Avishi Poddar, Xunhe (Andrew)Zhang, Yassine Abaakil, Benjamin Cassese, Alex Teachey, Jiajing Liu, Farai Sundai, Lila Valaskovic 16 pages, 10 figures, accepted to ApJS. For source code, documentation, and tutorials, see this https URL Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Accurate, precise, and computationally efficient removal of unwanted activity that exists as a combination of periodic, quasi-periodic, and non-periodic systematic trends in time-series photometric data is a critical step in exoplanet transit analysis. Throughout the years, many different modeling methods have been used for this process, often called \"detrending.\" However, there is no community-wide consensus regarding the favored approach. In order to mitigate model dependency, we present an ensemble-based approach to detrending via community-of-models and the democratic detrender: a modular and scalable open-source coding package that implements ensemble detrending. The democratic detrender allows users to select from a number of packaged detrending methods (including cosine filtering, Gaussian processes, and polynomial fits) or provide their own set of detrended light curves via methods of their choosing. It then combines the individually detrended light curves into a single method marginalized light curve. Additionally, the democratic detrender inflates each data point's uncertainty based on the scatter between detrenders, thereby propagating model-selection uncertainty into the final light curve. This ensemble strategy does not guarantee improvement over the single best-performing detrending method, but it substantially reduces the risk of selecting a detrending solution that is poorly calibrated or overfit to noise.",
      "pdf_url": "https://arxiv.org/pdf/2411.09753.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11620",
      "title": "Design and characterization of W-band and D-band calibration sources for the AliCPT-1 experiment",
      "authors": [
        "Xu-Fang Li",
        "Cong-Zhan Liu",
        "Ai-Mei Zhang",
        "Zheng-Wei Li",
        "Xue-Feng Lu",
        "Zhong-Xue Xin",
        "Guo-Feng Wang",
        "Yong-Ping Li",
        "Yong-Jie Zhang",
        "Shi-Bo Shu",
        "Yi-Fei Zhang",
        "Ya-Qiong Li",
        "Zhi Chang",
        "Dai-Kang Yan"
      ],
      "abstract": "Design and characterization of W-band and D-band calibration sources for the AliCPT-1 experiment Xu-Fang Li, Cong-Zhan Liu, Ai-Mei Zhang, Zheng-Wei Li, Xue-Feng Lu, Zhong-Xue Xin, Guo-Feng Wang, Yong-Ping Li, Yong-Jie Zhang, Shi-Bo Shu, Yi-Fei Zhang, Ya-Qiong Li, Zhi Chang, Dai-Kang Yan Journal of Astronomical Telescopes,Instruments, and Systems, 2026, Vol. 12 Instrumentation and Methods for Astrophysics (astro-ph.IM) Ali Cosmic Microwave Background Polarization Telescope (AliCPT-1) is the first Chinese cosmic microwave background experiment aiming to make sensitive polarization maps of the potential B-mode signal from inflationary gravitational waves. The telescope was deployed on the Tibet Ali site at 5250 m above sea level in early 2025. Before and after each observation season, the instrument performance must be carefully calibrated, including the far field beam performance, far sidelobe, spectral response, polarization angle, and cross-polar beam response. To characterize these optical performances, several calibrators have been developed. We developed a W-band source and a D-band source for the AliCPT-1 telescope's beam characterizations. We present the design and performance of the two calibration sources.",
      "pdf_url": "https://arxiv.org/pdf/2602.11620.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.11728",
      "title": "Beyond One-Thousandth Energy Resolution with an AlMn TES Detector",
      "authors": [
        "Liangpeng Xie",
        "Yifei Zhang",
        "Zhengwei Li",
        "Zhouhui Liu",
        "Shibo Shu",
        "Junjie Zhou",
        "Xufang Li",
        "Haoyu Li",
        "He Gao",
        "Yudong Gu",
        "Xuefeng Lu",
        "Yong Zhao",
        "Congzhan Liu"
      ],
      "abstract": "Beyond One-Thousandth Energy Resolution with an AlMn TES Detector Liangpeng Xie, Yifei Zhang, Zhengwei Li, Zhouhui Liu, Shibo Shu, Junjie Zhou, Xufang Li, Haoyu Li, He Gao, Yudong Gu, Xuefeng Lu, Yong Zhao, Congzhan Liu 6 pages, 8 figures, submitted to APL Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Experiment (hep-ex); Instrumentation and Detectors (physics.ins-det) The superconducting Transition-Edge Sensor (TES) is a critical technology for next-generation X-ray spectrometers, known for its exceptional energy resolution. In the last decade, TESs based on AlMn alloy films have been extensively used in several cosmic microwave background (CMB) experiments. The advantages of simple fabrication process and easily tunable critical temperature make them an alternative to bilayer TESs. However, they have rarely been applied to X-ray detection until now. We developed an annular AlMn TES for X-ray detection and tested it in a dilution refrigerator with a Superconducting Quantum Interference Device (SQUID) amplifier, achieving an Full Width at Half Maximum (FWHM) of 12.1 +- 0.3 eV at 17.48 keV. To the best of our knowledge, this is the first demonstration of an AlMn TES achieving an energy resolution below 0.1%, highlighting its potential for high-resolution X-ray detection.",
      "pdf_url": "https://arxiv.org/pdf/2602.11728.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12110",
      "title": "Testing and Validation of the Updated Pixel-Based Non-Linearity Calibration File for WFC3/IR",
      "authors": [
        "K. Huynh",
        "V. Bajaj",
        "M. Marinelli",
        "J. Mack",
        "S. Shenoy",
        "N. Grogin"
      ],
      "abstract": "Testing and Validation of the Updated Pixel-Based Non-Linearity Calibration File for WFC3/IR K. Huynh, V. Bajaj, M. Marinelli, J. Mack, S. Shenoy, N. Grogin Instrumentation and Methods for Astrophysics (astro-ph.IM) The WFC3\\IR channel has an innate non-linear response to incident photons, which is corrected for in the calwf3 pipeline with the NLINFILE reference file. The 2009 solution is based on an average polynomial correction for each IR quadrant and is found to be poorly constrained at high fluence levels (e-) approaching the saturation limit. Using a variety of image types, sources, and sample sequences, we test a new pixel-based linearity correction developed by Shenoy et al. (2025). In nearly all cases, the new correction improves the linearity at fluence levels higher than 50,000 e-, with improvements up to 7% for pixels with fluences approaching the saturation limit (80,000 e-) in the last ima reads. The pixel-based solution also significantly decreases the number of cosmic rays erroneously flagged (due to non-linearity correction errors) during ramp fitting in calwf3, leading to improved photometric accuracy in the calibrated flt data and higher signal-to-noise ratios, particularly in Quad 1 (upper-left detector quadrant). Because the new solution tends to make sources brighter, we recalibrate the five HST flux standards used to compute the IR zeropoints and find a negligible impact (0.1-0.2%) on the published values by Calamida et al. (2024), smaller than the RMS dispersion (0.5%) in the observed to synthetic flux ratios for all five flux standards. The new NLINFILE 9au15283i this http URL was delivered to CRDS in October 2025 and will be used to reprocess all WFC3/IR imaging and grism observations in the MAST archive. An updated reference file a2412448i this http URL was delivered in February 2026, improving the results at the highest fluence levels by a few tenths of a percent. Please consult the Addendum for details.",
      "pdf_url": "https://arxiv.org/pdf/2602.12110.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12075",
      "title": "Efficient parallel finite-element methods for planetary gravitation: DtN and multipole expansions",
      "authors": [
        "Ziheng Yu",
        "Alex D.C. Myhill",
        "David Al-Attar"
      ],
      "abstract": "Efficient parallel finite-element methods for planetary gravitation: DtN and multipole expansions Ziheng Yu, Alex D.C. Myhill, David Al-Attar Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Mathematical Physics (math-ph); Geophysics (physics.geo-ph) The Poisson equation governing a planet's gravitational field is posed on the unbounded domain, $\\mathbb{R}^3$, whereas finite-element computations require bounded meshes. We implement and compare three strategies for handling the infinite exterior in the finite-element method: (i) naive domain truncation; (ii) Dirichlet-to-Neumann (DtN) map on a truncated boundary; (iii) multipole expansion on a truncated boundary. While all these methods are known within the geophysical literature, we discuss their parallel implementations within modern open-source finite-element codes, focusing specifically on the widely-used MFEM package. We consider both calculating the gravitational potential for a static density structure and computing the linearised perturbation to the potential caused by a displacement field - a necessary step for coupling self-gravitation into planetary dynamics. In contrast to some earlier studies, we find that the domain truncation method can provide accurate solutions at an acceptable cost, with suitable coarsening of the mesh within the exterior domain. Nevertheless, the DtN and multipole methods provide superior accuracy at a lower cost within large-scale parallel geophysical simulations despite their need for non-local communication associated with spherical harmonic expansions. The DtN method, in particular, admits an efficient parallel implementation based on an MPI-communicator limited to processors that contain part of the mesh's outer boundary. A series of further illustrative calculations are provided to show the potential of the DtN and multipole methods within realistic geophysical modelling.",
      "pdf_url": "https://arxiv.org/pdf/2602.12075.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "math-ph"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12201",
      "title": "Oxygen left behind: Atmospheric Enrichment due to Fractionation in Sub-Neptunes using BOREAS",
      "authors": [
        "Marilina Valatsou",
        "Caroline Dorn",
        "Pierlou Marty",
        "James E. Owen"
      ],
      "abstract": "Oxygen left behind: Atmospheric Enrichment due to Fractionation in Sub-Neptunes using BOREAS Marilina Valatsou, Caroline Dorn, Pierlou Marty, James E. Owen Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The evolution of exoplanetary atmospheres is strongly influenced by atmospheric escape, particularly for close-in planets. Fractionation during atmospheric loss can preferentially remove lighter elements such as hydrogen, while retaining heavier species like oxygen. In this study, we investigate how and under what conditions hydrodynamic escape and chemical fractionation jointly shape the mass and composition of exoplanet atmospheres, especially for mixed H2 + H2O atmospheres. We develop BOREAS, a self-consistent mass loss model coupling a 1D Parker wind formulation with a mass-dependent fractionation scheme, which we apply across a range of planet masses, radii, equilibrium temperatures, and incident XUV fluxes, allowing us to track hydrogen and oxygen escape rates at different snapshots in time. We find that oxygen is efficiently retained over most of the parameter space. Significant oxygen loss occurs under high incident XUV fluxes, while at intermediate fluxes oxygen loss is largely confined to low-gravity planets. Where oxygen is retained, irradiation is too weak to drive significant escape of hydrogen and thus limiting atmospheric enrichment. By contrast, our model predicts that sub-Neptunes undergo substantial atmospheric enrichment over approx. 200 Myr when hydrogen escape is efficient and accompanied by partial oxygen entrainment. Notably, our results imply that sub-Neptunes near the radius valley can evolve into water-rich planets, in agreement with GJ 9827 d. Present-day water-rich atmospheres may have originated from water-poor envelopes under some conditions, highlighting the need to include chemical fractionation in evolution models. BOREAS is publicly available.",
      "pdf_url": "https://arxiv.org/pdf/2602.12201.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.22092",
      "title": "Impact of Charge Transfer Inefficiency on transit light-curves: A correction strategy for PLATO",
      "authors": [
        "Shaunak Mishra",
        "Reza Samadi",
        "Diane Bérard"
      ],
      "abstract": "Impact of Charge Transfer Inefficiency on transit light-curves: A correction strategy for PLATO Shaunak Mishra, Reza Samadi, Diane Bérard 12 pages, 13 figures, 5 tables. Accepted for publication in Astronomy & Astrophysics (A&A) Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) PLATO is designed to detect Earth-sized exoplanets around solar-type stars and to measure their radii with accuracy better than \\(2\\%\\) via the transit method. Charge transfer inefficiency (CTI), a by-product of radiation damage to CCDs, can jeopardise this accuracy and therefore must be corrected. We assessed and quantified the impact of CTI on transit-depth measurements and developed a correction strategy that restores CTI-biased depths within the accuracy budget. Using a calibration dataset generated with PLATOSim to simulate a realistic stellar field, we modelled the parallel overscan signal as a sum of exponential decays and used least-squares fitting to infer the number of trap species and initial estimates for the release times (\\(\\tau_{r,k}\\)). Smearing was modelled with an exponential-plus-constant function and removed on a column-wise basis. We modelled the spatial variation in trap density with a quadratic polynomial in radial distance from the focal-plane center. The polynomial coefficients (\\(a_{p,k}\\)), the well-fill power index (\\(\\beta\\)), and the release times (\\(\\tau_{r,k}\\)) were adjusted via an iterative application of the extended pixel edge response (EPER) method combined with a CTI correction algorithm, yielding the final calibration model. In the worst-case scenario (8-year mission, high-CTI zone), CTI induced a bias of about \\(4\\%\\) in measured transit depth, reduced to a residual of \\(0.06\\%\\) after correction - well within PLATO's accuracy requirements. From the calibrated parameters, we derived a correction scheme that brought the photometric measurements within PLATO's noise budget, ensuring that the mission's precision requirements are met.",
      "pdf_url": "https://arxiv.org/pdf/2510.22092.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.02007",
      "title": "The Astrometric Resoeccentric Degeneracy: Eccentric Single Planets Mimic 2:1 Resonant Planet Pairs in Astrometry",
      "authors": [
        "Daniel A. Yahalomi",
        "Tiger Lu",
        "Philip J. Armitage",
        "Megan Bedell",
        "Andrew R. Casey",
        "Adrian M. Price-Whelan",
        "Malena Rice"
      ],
      "abstract": "The Astrometric Resoeccentric Degeneracy: Eccentric Single Planets Mimic 2:1 Resonant Planet Pairs in Astrometry Daniel A. Yahalomi, Tiger Lu, Philip J. Armitage, Megan Bedell, Andrew R. Casey, Adrian M. Price-Whelan, Malena Rice 14 pages, 2 figures, accepted to ApJL. Code available at this https URL Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Detections of long-period giant exoplanets will expand dramatically with Gaia Data Release 4 (DR4), but interpreting these signals will require care. We derive the astrometric resoeccentric degeneracy: an astrometric analogue of the well-known radial velocity degeneracy in which a single eccentric planet can mimic two circular planets near a 2:1 period ratio. To first order in eccentricity, the sky-projected motion of a single eccentric orbit decomposes into a fundamental mode and first harmonic with an amplitude proportional to that eccentricity. A pair of coplanar, circular planets in a 2:1 orbital resonance produces the same harmonic structure: the outer planet sets the fundamental mode, while the inner planet supplies an apparent first harmonic. We present a mapping between the harmonic amplitudes and effective eccentricity ($e_\\mathrm{eff}$) of a single planet that mimics a 2:1 configuration, demonstrating that $e_\\mathrm{eff} = \\, 2^{1/3}(M_{p,2}/M_{p,1})$, the masses of the inner and outer planets, respectively. Using simulated Gaia data we show that (1) coplanar 2:1 systems are statistically indistinguishable from a single eccentric planet and (2) mutual inclination can break this degeneracy. This bias favors detecting mutually inclined systems, often fingerprints of a dynamically hot history -- traces for processes such as planet-planet scattering or secular chaos. Determining the planetary architectures in which this degeneracy holds will be essential for measuring cool-giant occurrence rates with Gaia and for inferring their dynamical evolution histories.",
      "pdf_url": "https://arxiv.org/pdf/2512.02007.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10330",
      "title": "Efficient reduction of stellar contamination and noise in planetary transmission spectra using neural networks",
      "authors": [
        "David S. Duque-Castaño",
        "Lauren Flor-Torres",
        "Jorge I. Zuluaga"
      ],
      "abstract": "Efficient reduction of stellar contamination and noise in planetary transmission spectra using neural networks David S. Duque-Castaño, Lauren Flor-Torres, Jorge I. Zuluaga 16 pages, 11 figures. Submitted to Astronomy & Astrophysics. Unabridged version Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Context: JWST has enabled transmission spectroscopy at unprecedented precision, but stellar heterogeneities (spots and faculae) remain a dominant contamination source that can bias atmospheric retrievals if uncorrected. Aims: We present a fast, unsupervised methodology to reduce stellar contamination and instrument-specific noise in exoplanet transmission spectra using denoising autoencoders, improving the reliability of retrieved atmospheric parameters. Methods: We design and train denoising autoencoder architectures on large synthetic datasets of terrestrial (TRAPPIST-1e analogues) and sub-Neptune (K2-18b analogues) planets. Reconstruction quality is evaluated with the $\\chi^2$ statistic over a wide range of signal-to-noise ratios, and atmospheric retrieval experiments on contaminated spectra are used to compare against standard correction approaches in accuracy and computational cost. Results: The autoencoders reconstruct uncontaminated spectra while preserving key molecular features, even at low S/N. In retrieval tests, pre-processing with denoising autoencoders reduces bias in inferred abundances relative to uncorrected baselines and matches the accuracy of simultaneous stellar-contamination fitting while reducing computational time by a factor of three to six. Conclusions: Denoising autoencoders provide an efficient alternative to conventional correction strategies and are promising components of future atmospheric characterization pipelines for both rocky and gaseous exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2602.10330.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11271",
      "title": "Gas-depleted planet formation occurred in the four-planet system around the red dwarf LHS 1903",
      "authors": [
        "Thomas G. Wilson",
        "Anna M. Simpson",
        "Andrew Collier Cameron",
        "Ryan Cloutier",
        "Vardan Adibekyan",
        "Ancy Anna John",
        "Yann Alibert",
        "Manu Stalport",
        "Jo Ann Egger",
        "Andrea Bonfanti",
        "Nicolas Billot",
        "Pascal Guterman",
        "Pierre F. L. Maxted",
        "Attila E. Simon",
        "Sergio G. Sousa",
        "Malcolm Fridlund",
        "Mathias Beck",
        "Anja Bekkelien",
        "Sebastien Salmon",
        "Valerie Van Grootel",
        "Luca Fossati",
        "Alexander James Mustill",
        "Hugh P. Osborn",
        "Tiziano Zingales",
        "Matthew J. Hooton",
        "Laura Affer",
        "Suzanne Aigrain",
        "Roi Alonso",
        "Guillem Anglada",
        "Alexandros Antoniadis-Karnavas",
        "Tamas Barczy",
        "David Barrado Navascues",
        "Susana C. C. Barros",
        "Wolfgang Baumjohann",
        "Thomas Beck",
        "Willy Benz",
        "Federico Biondi",
        "Xavier Bonfils",
        "Luca Borsato",
        "Alexis Brandeker",
        "Christopher Broeg",
        "Lars A. Buchhave",
        "Maximilian Buder",
        "Juan Cabrera",
        "Sebastian Carrazco Gaxiola",
        "David Charbonneau",
        "Sebastien Charnoz",
        "David R. Ciardi",
        "Karen A. Collins",
        "Kevin I. Collins",
        "Rosario Cosentino",
        "Szilard Csizmadia",
        "Patricio E. Cubillos",
        "Shweta Dalal",
        "Mario Damasso",
        "James R. A. Davenport",
        "Melvyn B. Davies",
        "Magali Deleuil",
        "Laetitia Delrez",
        "Olivier D. S. Demangeon",
        "Brice-Olivier Demory",
        "Victoria DiTomasso",
        "Diana Dragomir",
        "Courtney D. Dressing",
        "Xavier Dumusque",
        "David Ehrenreich",
        "Anders Erikson",
        "Emma Esparza-Borges",
        "Andrea Fortier",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Davide Gandolfi",
        "Adriano Ghedina",
        "Steven Giacalone",
        "Holden Gill",
        "Michael Gillon",
        "Yilen Gomez Maqueo Chew",
        "Manuel Gudel",
        "Pere Guerra",
        "Maximilian N. Gunther",
        "Nathan Hara",
        "Avet Harutyunyan",
        "Yuya Hayashi",
        "Raphaelle D. Haywood",
        "Rae Holcomb",
        "Keith Horne",
        "Sergio Hoyer",
        "Chelsea X. Huang",
        "Masahiro Ikoma",
        "Kate G. Isaak",
        "James A. G. Jackman",
        "Jon M. Jenkins",
        "Eric L. N. Jensen",
        "Daniel Jontof-Hutter",
        "Yugo Kawai",
        "Laszlo L. Kiss",
        "Ben S. Lakeland",
        "Jacques Laskar",
        "David W. Latham",
        "Alain Lecavelier des Etangs"
      ],
      "abstract": "Gas-depleted planet formation occurred in the four-planet system around the red dwarf LHS 1903 Thomas G. Wilson, Anna M. Simpson, Andrew Collier Cameron, Ryan Cloutier, Vardan Adibekyan, Ancy Anna John, Yann Alibert, Manu Stalport, Jo Ann Egger, Andrea Bonfanti, Nicolas Billot, Pascal Guterman, Pierre F. L. Maxted, Attila E. Simon, Sergio G. Sousa, Malcolm Fridlund, Mathias Beck, Anja Bekkelien, Sebastien Salmon, Valerie Van Grootel, Luca Fossati, Alexander James Mustill, Hugh P. Osborn, Tiziano Zingales, Matthew J. Hooton, Laura Affer, Suzanne Aigrain, Roi Alonso, Guillem Anglada, Alexandros Antoniadis-Karnavas, Tamas Barczy, David Barrado Navascues, Susana C. C. Barros, Wolfgang Baumjohann, Thomas Beck, Willy Benz, Federico Biondi, Xavier Bonfils, Luca Borsato, Alexis Brandeker, Christopher Broeg, Lars A. Buchhave, Maximilian Buder, Juan Cabrera, Sebastian Carrazco Gaxiola, David Charbonneau, Sebastien Charnoz, David R. Ciardi, Karen A. Collins, Kevin I. Collins, Rosario Cosentino, Szilard Csizmadia, Patricio E. Cubillos, Shweta Dalal, Mario Damasso, James R. A. Davenport, Melvyn B. Davies, Magali Deleuil, Laetitia Delrez, Olivier D. S. Demangeon, Brice-Olivier Demory, Victoria DiTomasso, Diana Dragomir, Courtney D. Dressing, Xavier Dumusque, David Ehrenreich, Anders Erikson, Emma Esparza-Borges, Andrea Fortier, Izuru Fukuda, Akihiko Fukui, Davide Gandolfi, Adriano Ghedina, Steven Giacalone, Holden Gill, Michael Gillon, Yilen Gomez Maqueo Chew, Manuel Gudel, Pere Guerra, Maximilian N. Gunther, Nathan Hara, Avet Harutyunyan, Yuya Hayashi, Raphaelle D. Haywood, Rae Holcomb, Keith Horne, Sergio Hoyer, Chelsea X. Huang, Masahiro Ikoma, Kate G. Isaak, James A. G. Jackman, Jon M. Jenkins, Eric L. N. Jensen, Daniel Jontof-Hutter, Yugo Kawai, Laszlo L. Kiss, Ben S. Lakeland, Jacques Laskar, David W. Latham, Alain Lecavelier des Etangs Accepted for publication in Science Earth and Planetary Astrophysics (astro-ph.EP) Small exoplanet radii show two populations, referred to as super-Earths and sub-Neptunes, separated by a gap known as the radius valley. This may be produced by the removal of atmospheres due to stellar or internal heating, or lack of an initial envelope. We us transit photometry and radial velocity measurements to detect and characterize four planets orbiting LHS 1903, a red dwarf (M-dwarf) star in the Milky Way's thick disk. The planets have orbital periods between 2.2 and 29.3 days, and span the radius valley within a single planetary system. The derived densities indicate that LHS 1903 b is rocky, while LHS 1903 c and LHS 1903 d have extended atmospheres. Although the most distant planet from the host star, LHS 1903 e, has no gaseous envelope, indicating it formed from gas-depleted material.",
      "pdf_url": "https://arxiv.org/pdf/2602.11271.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11317",
      "title": "Revealing Exotic Nanophase Iron in Lunar Samples Through Impact-Driven Spatial Fingerprints",
      "authors": [
        "Ziyu Huang",
        "Masatoshi Hirabayashi"
      ],
      "abstract": "Revealing Exotic Nanophase Iron in Lunar Samples Through Impact-Driven Spatial Fingerprints Ziyu Huang, Masatoshi Hirabayashi 9 pages, 4 figures, in press at PSJ Earth and Planetary Astrophysics (astro-ph.EP); Materials Science (cond-mat.mtrl-sci) Nanophase iron (npFe) plays a crucial role in controlling the optical, chemical, and physical evolution of lunar regolith grains. While in-situ formation of npFe via reduction of native Fe-bearing minerals has long been considered a dominant pathway, recent mineralogical evidence from this http URL et al. (2025) reveals that the source of a significant fraction of npFe may be delivered directly by exotic micrometeoroid impacts (exotic npFe). Yet the atomic-scale processes governing how exotic np-Fe forms and survives during hypervelocity impacts remain largely unknown. To quantitatively compare in-situ and exotic delivery and formation of npFe, we perform a series of innovative atomistic modeling of micrometeoroid impacts with distinct projectile target compositions: (1) SiO$_2$ projectiles on Fe$_2$SiO$_4$ targets (in-situ formation), (2) Fe$_2$SiO$_4$ projectiles on SiO$_2$ targets (exotic delivery). Our results reveal distinct mechanistic fingerprints: in-situ np-Fe forms diffusely and radially around the impact site, whereas exotic np-Fe is efficiently retained and concentrated in asymmetric, momentum-aligned clusters. These contrasting spatial signatures provide a potential diagnostic criterion for distinguishing exotic versus in-situ np-Fe in returned lunar soils. In agreement with Chang'e-5 observations, our simulations demonstrate that exotic np-Fe production can be substantial, particularly in Fe-poor terrains such as highland regions. These findings highlight the need to account for exotic np-Fe when interpreting space weathering processes and remote-sensing data for the Moon and other airless bodies.",
      "pdf_url": "https://arxiv.org/pdf/2602.11317.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11531",
      "title": "Eccentricity Evolution of Warm Jupiters: The Role of Distant Perturbers and Nearby Companions",
      "authors": [
        "Ying He",
        "Dong-Hong Wu",
        "Sheng Jin"
      ],
      "abstract": "Eccentricity Evolution of Warm Jupiters: The Role of Distant Perturbers and Nearby Companions Ying He, Dong-Hong Wu, Sheng Jin 13 pages, 9 figures. Accepted for publication in The Astrophysical Journal Earth and Planetary Astrophysics (astro-ph.EP) Warm Jupiters-giant exoplanets with orbital periods between 10 and 200 days-exhibit a broad range of eccentricities and are often accompanied by nearby low-mass planets. Understanding the origins of their orbital architectures requires examining both their migration histories and subsequent dynamical interactions. In this study, we perform extensive N-body simulations to explore how distant giant planet perturbers affect the eccentricity evolution of warm Jupiters and the role of nearby super-Earth companions in mediating these interactions. We find that while distant perturbers can induce large-amplitude eccentricity oscillations in warm Jupiters via the von Zeipel-Lidov-Kozai mechanism, the presence of nearby super-Earth companions often suppresses these variations via strong dynamical coupling. This mechanism naturally leads to a bimodal eccentricity distribution: warm Jupiters with nearby companions tend to maintain low eccentricities, whereas those without exhibit significantly broader eccentricity distributions. We show that reproducing the observed eccentricity distribution of warm Jupiters lacking nearby companions is most naturally explained if a substantial fraction of distant perturbers occupy dynamically extreme orbits, either with large mutual inclinations or high orbital eccentricities. These results support a scenario in which warm Jupiters experience substantial post-disk dynamical evolution, shaped jointly by distant perturbers and nearby companions.",
      "pdf_url": "https://arxiv.org/pdf/2602.11531.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11560",
      "title": "Analysis of Karin and Koronis2 asteroid families: new findings and challenges",
      "authors": [
        "David Vokrouhlický",
        "David Nesvorný",
        "William F. Bottke"
      ],
      "abstract": "Analysis of Karin and Koronis2 asteroid families: new findings and challenges David Vokrouhlický, David Nesvorný, William F. Bottke 25 pages, 15 figures, accepted for publication in The Astronomical Journal Earth and Planetary Astrophysics (astro-ph.EP) We use our home catalog of the asteroid proper elements to study the Karin family. The hierarchical clustering method provides formal identification with 3,863 members, but this set also includes objects from the neighboring Koronis2 and Kuitaisi families, as well as interlopers originating from the much older Koronis family. By tracking the trajectories of cluster objects backward in time, we identified 2,161 asteroids whose orbits converged with that of their parent body (832) Karin at $5.72\\pm 0.09$ My ago ($95$\\% C.L.). This method of calculating the family's age is based on a novel convergence metric that is directly related to the velocities at which fragments were ejected from (832) Karin. We analyze the extent to which members $\\leq 1.5$ km in diameter had drifted in semimajor axis due to Yarkovsky thermal forces and find it reflects the tilt of their rotation poles away from the ecliptic, recording the influence of the YORP torque. Karin's size frequency distribution in the $\\simeq(0.8-3)$ km range follows a power-law with a cumulative slope index $-3.20\\pm 0.01$. Removing members of the Karin family from the original group, we examine the Koronis2 family, whose members are associated with (158) Koronis. We find it difficult for large members of the Koronis2 family to converge with the orbit of (158) Koronis within its previously estimated age of $7.6$ My. Achieving such convergence would require the Koronis2 family to be older than $10$ My, but our result must be verified with a direct numerical approach in the future.",
      "pdf_url": "https://arxiv.org/pdf/2602.11560.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11818",
      "title": "Global magnetohydrodynamic simulations of the inner regions of protoplanetary discs. II. Vertical-net-flux regime",
      "authors": [
        "Matthew J. O. Roberts",
        "Henrik N. Latter",
        "Geoffroy Lesur"
      ],
      "abstract": "Global magnetohydrodynamic simulations of the inner regions of protoplanetary discs. II. Vertical-net-flux regime Matthew J. O. Roberts, Henrik N. Latter, Geoffroy Lesur Earth and Planetary Astrophysics (astro-ph.EP) The inner regions of protoplanetary discs, which encompass the putative habitable zone, are dynamically complex, featuring a relatively well-ionised, turbulent active zone located interior to a poorly ionised 'dead' zone. In this second paper, we investigate a model of the magnetohydrodynamic processes around the interface between these two regions, using five three-dimensional global magnetohydrodynamic simulations of discs threaded by a large-scale poloidal-net-flux magnetic field. We employ physically motivated profiles for Ohmic resistivity and ambipolar diffusion, alongside a simplified thermodynamic model comprising a cool disc and hot corona. Our results show that, first, the interface acts as a one-way barrier to inward transport of large-scale magnetic flux from the dead zone. This leads to magnetic flux depletion throughout most of the active zone, whereby it either advects inwards to the inner numerical boundary or accumulates just inside the interface. Second, two sources of strong variability emerge from the interface due to the difficulty of maintaining a constant, vertically integrated electrical current across distinct and evolving magnetic-field states. Third, despite the weak magnetothermal wind in the dead zone, a pressure maximum forms at the interface, leading to Rossby-wave-induced vortices. Fourth, unlike the model of Iwasaki et. al (2024), there is no 'transition zone' devoid of magnetic flux and magnetic winds. Instead, multiple outflow zones span all disc radii reflecting the radially varying launch conditions, with an inner turbulent wind impinging upon an outer, more laminar one. Fifth, a heated corona prevents the 'puffing up' of poloidal-net-flux, active disc regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.11818.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12071",
      "title": "Thermal and Dielectric Properties of Juno's Regolith at One Millimeter Wavelength",
      "authors": [
        "Jian-Yang Li",
        "Timothy N. Titus",
        "Arielle Moullet",
        "Henry H. Hsieh"
      ],
      "abstract": "Thermal and Dielectric Properties of Juno's Regolith at One Millimeter Wavelength Jian-Yang Li, Timothy N. Titus, Arielle Moullet, Henry H. Hsieh Earth and Planetary Astrophysics (astro-ph.EP) We present the modeling results of the thermal lightcurve of asteroid (3) Juno at the wavelength of $\\lambda$ = 1.3 mm measured by the Atacama Large Millimeter-submillimeter Array. A thermophysical model together with a radiative transfer model suggest a thermal inertia of 13$\\pm$10 [J m$^{-2}$ K$^{-1}$ s$^{-0.5}$], an equivalent emissivity of 0.8$\\pm$0.1, a loss tangent of 0.4$\\pm$0.3, and an index of refraction 1.8$\\pm$0.3. Based on previous laboratory measurements, the modeled index of refraction suggests a regolith porosity of about 45%. However, thermal inertia models using the material parameters of ordinary chondrite indicate a grain size of 10s $\\mu$m and require a high porosity of $\\sim$90% to explain the low thermal inertia. In order to explain such a contradiction, we postulate that some repulsive mechanism might be in effect to reduce the contact of grains and therefore the thermal inertia. The loss tangent of Juno's regolith corrected for the modeled thermal skin depth is in the order of 0.5, much higher than that of the lunar regolith and indicating an electrical skin depth of L = 0.1 - 1.4 mm that is within the thermal skin depth. The shape of the rotational lightcurve of Juno in the mm wavelengths is dominated by its irregular shape, but rotational variations in the thermal and/or dielectric properties cannot be ruled out. Our results demonstrate that mm-wavelength observations of asteroids provide an extra dimension of constraints to the porosity and grain size of asteroid regolith compared to the thermal infrared observations.",
      "pdf_url": "https://arxiv.org/pdf/2602.12071.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.16737",
      "title": "Zooming into the water snowline: high resolution water observations of the HL Tau disk",
      "authors": [
        "M. Leemker",
        "S. Facchini",
        "P. Curone",
        "L. Rampinelli",
        "M. Benisty",
        "A. Garufi",
        "E. Humphreys"
      ],
      "abstract": "Zooming into the water snowline: high resolution water observations of the HL Tau disk M. Leemker, S. Facchini, P. Curone, L. Rampinelli, M. Benisty, A. Garufi, E. Humphreys Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) Water is one of the central molecules for the formation and habitability of planets. In particular, the region where water freezes-out, the water snowline, could be a favorable location to form planets in protoplanetary disks. We use high resolution ALMA observations to spatially resolve H$_2$O, H$^{13}$CO$^+$ and SO emission in the HL Tau disk. A rotational diagram analysis is used to characterize the water reservoir seen with ALMA and compare this to the reservoir visible at mid- and far-IR wavelengths. We find that the H$_2$O 183 GHz line has a compact central component and a diffuse component that is seen out to ~75 au. A radially resolved rotational diagram shows that the excitation temperature of the water is ~350 K independent of radius. The steep drop in the water brightness temperature outside the central beam of the observations where the emission is optically thick is consistent with the water snowline being located inside the central beam ($\\lesssim 6$ au) at the height probed by the observations. Comparing the ALMA lines to those seen at shorter wavelengths shows that only 0.02%-2% of the water reservoir is visible at mid- and far-IR wavelengths, respectively, due to optically thick dust hiding the emission whereas 35-70% is visible with ALMA. An anti-correlation between the H$_2$O and H$^{13}$CO$^+$ emission is found but this is likely caused by optically thick dust hiding the H$^{13}$CO$^+$ emission in the disk center. Finally, we see SO emission tracing the disk and for the first time in SO a molecular outflow and the infalling streamer out to ~2\". The velocity structure hints at a possible connection between the SO and the H$_2$O emission. Spatially resolved observations of H$_2$O lines at (sub-)mm wavelengths provide valuable constraints on the location of the water snowline, while probing the bulk of the gas-phase reservoirs.",
      "pdf_url": "https://arxiv.org/pdf/2511.16737.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.19707",
      "title": "Sequential Fragmentation of C/2025 K1 (ATLAS) After Its Near-Sun Passage",
      "authors": [
        "Dennis Bodewits",
        "John W. Noonan",
        "Michael S. P. Kelley",
        "Carrie E. Holt",
        "Tim A. Lister",
        "Helen Usher",
        "Colin Snodgrass",
        "Bjorn Davidsson",
        "Sarah Greenstreet"
      ],
      "abstract": "Sequential Fragmentation of C/2025 K1 (ATLAS) After Its Near-Sun Passage Dennis Bodewits, John W. Noonan, Michael S. P. Kelley, Carrie E. Holt, Tim A. Lister, Helen Usher, Colin Snodgrass, Bjorn Davidsson, Sarah Greenstreet Earth and Planetary Astrophysics (astro-ph.EP) Comet C/2025 K1 (ATLAS) reached perihelion at 0.33 au on 2025 October 8. Daily monitoring by the LCO Outbursting Objects Key Project revealed a major activity increase between November 2 and 4, accompanied by rapid changes in coma morphology. Serendipitous HST/STIS acquisition images obtained on November 8-10 captured the comet only days after this event and resolved five fragments, providing an early high-resolution view of a nucleus in the process of disruption. Fragment motions and morphologies indicate a hierarchical fragmentation sequence, including a slow secondary split of fragment II. Back extrapolation shows that both the primary and secondary breakups preceded their associated photometric outbursts by roughly one to three days. This consistent lag, together with the appearance of thin, short-lived arclets around fragment I in the first HST epoch, suggests that freshly exposed interior material warms rapidly but requires time before dust can be released efficiently. Given the comet's close perihelion passage, rotational instability driven by enhanced outgassing torques is a plausible contributor to nucleus disintegration and dust release, and may represent the primary source of the observed brightening. These combined ground- and space-based observations provide rare, time-resolved constraints on the thermal and structural evolution of a fragmented comet near perihelion and highlight the scientific value of capturing a nucleus within days of disruption, when thermal adjustment, dust mantle re-formation, and outgassing-driven torques jointly govern the onset of activity.",
      "pdf_url": "https://arxiv.org/pdf/2511.19707.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}