{
  "date": "2025-12-16",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.IM",
    "astro-ph.HE",
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.CO",
    "astro-ph.GA"
  ],
  "total_papers": 105,
  "gw_related_papers": 4,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.10862",
      "title": "Inflation in light of ACT/SPT: a new perspective from Weyl gravity",
      "authors": [
        "Qing-Yang Wang"
      ],
      "abstract": "Inflation in light of ACT/SPT: a new perspective from Weyl gravity Qing-Yang Wang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Recent measurements from the Atacama Cosmology Telescope (ACT) and the South Pole Telescope (SPT) have placed the strictest constraints on the primordial scalar perturbation spectrum, reporting a spectral index of $n_s\\sim0.967-0.98$ at 95% confidence level. This result indicates a stronger scale invariance of the scalar perturbation than earlier estimates, posing challenges for numerous inflation models. In this work, we propose an appealing inflationary scenario from the Weyl scale-invariant gravity theory dominated by the higher-order curvatures. Specifically, the exponential curvature extensions are introduced to suppress the mass divergence of the inflaton. We find such scenario naturally yields leading-order predictions of $n_s\\simeq1-3/(2N)\\sim0.97-0.975$ or $n_s\\simeq1-5/(3N)\\sim0.967-0.972$ for various models, in excellent agreement with the ACT/SPT constraints. This result builds a concrete bridge between theoretical and observational scale invariance, implying an enduring cosmic echo of the primordial symmetry.",
      "pdf_url": "https://arxiv.org/pdf/2512.10862.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11020",
      "title": "Geometry of non-Gaussianity in transient non-attractor inflation",
      "authors": [
        "Mohammad Hossein Namjoo",
        "Bahar Nikbakht"
      ],
      "abstract": "Geometry of non-Gaussianity in transient non-attractor inflation Mohammad Hossein Namjoo, Bahar Nikbakht 29 pages, plus an appendix, 16 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Inflationary models predicting abundant primordial black holes (PBHs) and large amplitude of scalar-induced gravitational waves (SIGWs) often rely on amplified fluctuations over limited scales, typically driven by phase transitions, particle production, or departures from slow-roll evolution. While the power spectrum of these models has been extensively studied, higher-order correlations are much less understood. Motivated by the complex physics involved and the fact that PBH and SIGW formation are both sensitive to non-linearities, we present a detailed study of the bispectrum as the leading non-linear effect in these scenarios. We refer to the scale- and shape-dependence of the bispectrum collectively as its geometry; and define a scale-dependent shape correlator to disentangle the two dependencies. Generally, we find that for the scales most affected by phase transitions and particle production (including the power spectrum peak), the bispectrum is strongest near the equilateral configuration, while non-attractor phases tend to produce correlations near the squeezed configuration. We further propose a simplified bispectrum estimator, resembling local-type non-Gaussianity but with scale-dependent amplitude, that captures the main features of the full bispectrum. As an implication of our results, we show that incorporating the bispectrum significantly broadens the range of scales with a substantial probability of large smoothed density contrasts compared to linear analysis. This suggests that non-linearities can alter not only PBH abundance and SIGW amplitude but also their mass and frequency spectra. In particular, and in contrast with the usual assumption, our results hint that the second-highest peak of the power spectrum may produce more PBHs than the highest peak.",
      "pdf_url": "https://arxiv.org/pdf/2512.11020.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.11059",
      "title": "Milky Way Globular Clusters: Nurseries for Dynamically-Formed Binary Black Holes",
      "authors": [
        "Federico Angeloni",
        "Konstantinos Kritos",
        "Raffaella Schneider",
        "Emanuele Berti",
        "Luca Graziani",
        "Stefano Torniamenti",
        "Michela Mapelli"
      ],
      "abstract": "Milky Way Globular Clusters: Nurseries for Dynamically-Formed Binary Black Holes Federico Angeloni, Konstantinos Kritos, Raffaella Schneider, Emanuele Berti, Luca Graziani, Stefano Torniamenti, Michela Mapelli 11+3 pages, 8 figures; submitted to A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present a novel self-consistent theoretical framework to characterize the formation, evolution, and merger sites of dynamically-formed black hole binaries, with a focus on explaining the most massive events observed by the LIGO-Virgo-KAGRA Collaboration. Our approach couples the galaxy formation model GAMESH with cluster population synthesis codes to trace the cosmic evolution of globular clusters simultaneously with mergers of massive black holes. Our reference model, which includes prescriptions for both cluster formation and disruption depending on properties of specific galaxies, accurately reproduces the observed age-mass distribution of the Milky Way globular clusters. We find that approximately 30% of the globular clusters observed in our galaxy's halo may have originated from satellite galaxies of the Milky Way. We confirm that hierarchical black hole mergers provide a significant contribution to the formation of black holes in and above the pair-instability mass gap. However, quantifying their contribution is challenging, as different population synthesis codes yield divergent results in terms of black hole mass function and merger rates. Furthermore, we characterize the host galaxies where massive black holes form in terms of their dark matter, stellar mass, and metallicity. Ultimately, we demonstrate that the merger and birth rate densities of binary black holes increase with redshift till z = 5. This cosmic evolution is a crucial signature with significant implications for future detectors like the LISA, the Einstein Telescope and Cosmic Explorer, which will be capable to probe the high-redshift Universe.",
      "pdf_url": "https://arxiv.org/pdf/2512.11059.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11678",
      "title": "One-loop power spectrum corrections in interacting dark energy cosmologies",
      "authors": [
        "Emanuelly Silva",
        "Gabriel Hartmann",
        "Rafael C. Nunes"
      ],
      "abstract": "One-loop power spectrum corrections in interacting dark energy cosmologies Emanuelly Silva, Gabriel Hartmann, Rafael C. Nunes 18 pages, 2 figures,1 table. Comments are welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Interacting Dark Energy (IDE) models offer a promising avenue to explore possible exchanges of energy and momentum between dark matter and dark energy, providing a dynamical extension of the standard $\\Lambda$CDM paradigm. Such interactions modify the growth of cosmic structures, imprinting distinctive signatures on the matter power spectrum that can be tested through large-scale structure (LSS) observations. In this work, we compute the one-loop corrections to the matter power spectrum in IDE models. We then reinterpret these results within the standard framework of the Effective Field Theory of Large-Scale Structure (EFTofLSS), which provides a consistent description of mildly non-linear scales and allows for reliable comparisons with observational data. We investigate two commonly studied forms of the coupling function, $Q$, namely $Q = \\xi \\mathcal{H} \\rho_{\\rm m}$ and $Q = \\xi \\mathcal{H} \\rho_{\\rm DE}$, and introduce a novel interaction term, $Q = \\Gamma \\, \\rho_{\\rm m} \\, \\rho_{\\rm DE} \\, \\theta_{\\rm m}$, characterized by the non-linear coupling constant $\\Gamma$, which links the interaction strength to the velocity divergence of dark matter. This coupling function is proposed to isolate the effects solely of the IDE model on mildly non-linear scales. Using Full-Shape (FS) measurements of the galaxy power spectrum from BOSS DR12, we constrain the interaction rate $\\Gamma$, the cosmological parameters, and the bias parameters. We find $\\Gamma = 0.0039 \\pm 0.0082$, which is highly consistent with the $\\Lambda$CDM model. This work opens the possibility of testing IDE models at mildly non-linear scales, potentially providing new insights for this class of models beyond the standard $\\Lambda$CDM framework.",
      "pdf_url": "https://arxiv.org/pdf/2512.11678.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2407.12890",
      "title": "Modeling reflection spectra of super-Eddington X-ray sources",
      "authors": [
        "Swarnim Shashank",
        "Askar B. Abdikamalov",
        "Honghui Liu",
        "Temurbek Mirzaev",
        "Jiachen Jiang",
        "Cosimo Bambi",
        "Fergus Baker",
        "Andrew Young"
      ],
      "abstract": "Modeling reflection spectra of super-Eddington X-ray sources Swarnim Shashank, Askar B. Abdikamalov, Honghui Liu, Temurbek Mirzaev, Jiachen Jiang, Cosimo Bambi, Fergus Baker, Andrew Young 10 pages, 7 figures, accepted for publication on ApJ High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Relativistic reflection is a common feature in the X-ray observations of accreting compact objects. We present reflux, a new X-ray reflection model for spectral analysis of super-Eddington sources. We develop two relativistic reflection frameworks for super-Eddington accretion: a slim-disk model that self-consistently accounts for disk thickening and self-shadowing, and an optically thick wind model that treats reflection off a funnel-shaped outflow. The slim-disk model offers a geometry where the inner disk thickness is proportional to radius, becoming thicker as the mass accretion rate increases. The wind model measures the opening angle of the funnel, the wind speed, and wind acceleration radius. The slim-disk profile reduces the brightness of the blue horn in the Fe K emission line for a fixed emissivity and significantly changes the intensity profile for a lamppost geometry. The wind model shows a blue-shifted iron line due to high velocity outflows. Both models assume a spherically symmetric spacetime. We apply the wind model to the XMM-Newton spectrum of the tidal disruption event Swift J1644+57, where the Fe K profile is expected to be shaped by scattering in an outflowing funnel. We constrain the opening angle of the funnel and find a high velocity of the wind.",
      "pdf_url": "https://arxiv.org/pdf/2407.12890.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11039",
      "title": "KiDS-Legacy: Constraints on Horndeski gravity from weak lensing combined with galaxy clustering and cosmic microwave background anisotropies",
      "authors": [
        "Benjamin Stölzner",
        "Robert Reischke",
        "Matteo Grasso",
        "Matteo Cataneo",
        "Benjamin Joachimi",
        "Arthur Loureiro",
        "Alessio Spurio Mancini",
        "Angus H. Wright",
        "Marika Asgari",
        "Maciej Bilicki",
        "Andrej Dvornik",
        "Christos Georgiou",
        "Benjamin Giblin",
        "Catherine Heymans",
        "Hendrik Hildebrandt",
        "Shahab Joudaki",
        "Konrad Kuijken",
        "Shun-Sheng Li",
        "Laila Linke",
        "Constance Mahony",
        "Lauro Moscardini",
        "Lucas Porth",
        "Mario Radovich",
        "Tilman Tröster",
        "Maximilian von Wietersheim-Kramsta",
        "Ziang Yan",
        "Mijin Yoon",
        "Yun-Hao Zhang"
      ],
      "abstract": "KiDS-Legacy: Constraints on Horndeski gravity from weak lensing combined with galaxy clustering and cosmic microwave background anisotropies Benjamin Stölzner, Robert Reischke, Matteo Grasso, Matteo Cataneo, Benjamin Joachimi, Arthur Loureiro, Alessio Spurio Mancini, Angus H. Wright, Marika Asgari, Maciej Bilicki, Andrej Dvornik, Christos Georgiou, Benjamin Giblin, Catherine Heymans, Hendrik Hildebrandt, Shahab Joudaki, Konrad Kuijken, Shun-Sheng Li, Laila Linke, Constance Mahony, Lauro Moscardini, Lucas Porth, Mario Radovich, Tilman Tröster, Maximilian von Wietersheim-Kramsta, Ziang Yan, Mijin Yoon, Yun-Hao Zhang 21 pages, 13 figures, 5 tables, to be submitted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present constraints on modified gravity from a cosmic shear analysis of the final data release of the Kilo-Degree Survey (KiDS-Legacy) in combination with DESI measurements of baryon acoustic oscillations, eBOSS observations of redshift space distortions, and cosmic microwave background anisotropies from Planck. We study the Horndeski class of modified gravity models in an effective field theory framework employing a parameterisation that satisfies stability conditions by construction and, for the first time, present a cosmological analysis in this inherently stable parameter basis. Cosmic shear constrains the Horndeski parameter space significantly, matching or surpassing the CMB contribution. Adopting the de-mixed kinetic term of the scalar field perturbation, $D_{\\rm kin}$, and the deviation of the Planck mass from its fiducial value, $\\Delta M_*^2\\equiv M_*^2-1$, as model parameters, we constrain their present values to be $\\Delta \\hat{M}_*^2=0.32^{+0.07}_{-0.21}$ and $\\hat{D}_{\\rm kin} = 3.74^{+0.69}_{-1.92}$, which deviate from general relativity at $1.5\\sigma$ and $1.9\\sigma$, respectively. We derive constraints on the structure growth parameter $S_8=0.813^{+0.008}_{-0.011}$, which is compatible with the $\\Lambda$CDM constraint at $0.54\\sigma$. We obtain the deviation of the effective Newtonian coupling from the GR value as $\\Delta \\mu_{\\infty,{\\rm eff}}=0.066\\pm0.023$, corresponding to a $2.9\\sigma$ significance. Although modified gravity provides a slightly better fit to the data, a model comparison shows only a weak preference for modified gravity at the $1.4\\sigma$ level. When adopting a dynamical dark energy model of the background cosmology, the inferred modified gravity parameter constraints are stable with respect to a $\\Lambda$CDM background, while a mild preference at $1.57\\sigma$ for dynamical dark energy remains.",
      "pdf_url": "https://arxiv.org/pdf/2512.11039.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11041",
      "title": "KiDS-Legacy: Constraining dark energy, neutrino mass, and curvature",
      "authors": [
        "Robert Reischke",
        "Benjamin Stölzner",
        "Benjamin Joachimi",
        "Angus H. Wright",
        "Marika Asgari",
        "Maciej Bilicki",
        "Nora Elisa Chisari",
        "Andrej Dvornik",
        "Christos Georgiou",
        "Benjamin Giblin",
        "Joachim Harnois-Déraps",
        "Catherine Heymans",
        "Hendrik Hildebrandt",
        "Henk Hoekstra",
        "Shahab Joudaki",
        "Konrad Kuijken",
        "Shun-Sheng Li",
        "Laila Linke",
        "Arthur Loureiro",
        "Constance Mahony",
        "Lauro Moscardini",
        "Lucas Porth",
        "Mario Radovich",
        "Tilman Tröster",
        "Maximilian von Wietersheim-Kramsta",
        "Ziang Yan",
        "Mijin Yoon",
        "Yun-Hao Zhang"
      ],
      "abstract": "KiDS-Legacy: Constraining dark energy, neutrino mass, and curvature Robert Reischke, Benjamin Stölzner, Benjamin Joachimi, Angus H. Wright, Marika Asgari, Maciej Bilicki, Nora Elisa Chisari, Andrej Dvornik, Christos Georgiou, Benjamin Giblin, Joachim Harnois-Déraps, Catherine Heymans, Hendrik Hildebrandt, Henk Hoekstra, Shahab Joudaki, Konrad Kuijken, Shun-Sheng Li, Laila Linke, Arthur Loureiro, Constance Mahony, Lauro Moscardini, Lucas Porth, Mario Radovich, Tilman Tröster, Maximilian von Wietersheim-Kramsta, Ziang Yan, Mijin Yoon, Yun-Hao Zhang 14 pages, 8 figures, submitted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) We constrain minimally extended cosmological models with the cosmic shear analysis of the final data release from the Kilo-Degree Survey (KiDS-Legacy) in combination with external probes. Due to the consistency of the KiDS-Legacy analysis with the Cosmic Microwave Background (CMB), we can combine these data sets reliably for the first time. Additionally, we use CMB lensing, galaxy redshift-space distortions, and baryon acoustic oscillations. We assess, in turn, the effects of spatial curvature, varying neutrino masses, and an evolving dark energy component on cosmological constraints from KiDS-Legacy alone and in combination with external probes. We find KiDS-Legacy to be consistent with the fiducial flat $\\Lambda$CDM analysis with $c^2 \\sum m_\\nu\\leq 1.5\\,$eV, $w_0 = -1.0\\pm 0.7$ and $w_a = -1.3^{+1.9}_{-2.0}$ while $\\Omega_K = 0.08^{+0.16}_{-0.17}$ (1$\\sigma$ bounds) with almost equal goodness-of-fit. $w_0w_a$CDM is not a significant improvement over $\\Lambda$CDM when cosmic shear and CMB lensing are combined, yielding a Bayes factor $B = 0.07$. If all probes are combined, however, $B$ increases to 2.73, corresponding to a $2.6\\sigma$ suspicousness tension. The constraint on $S_8 = \\sigma_8\\sqrt{\\Omega_\\mathrm{m}/0.3}$ is robust to opening up the parameter space for cosmic shear. Adding all external datasets to KiDS-Legacy, we find with $S_8 = 0.816 \\pm 0.006$ in $\\Lambda$CDM and $S_8 = 0.837 \\pm 0.008$ in $w_0 w_a$CDM for all probes combined.",
      "pdf_url": "https://arxiv.org/pdf/2512.11041.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.11163",
      "title": "Insights for Early Dark Energy with Big Bang Nucleosynthesis",
      "authors": [
        "Christopher Cook",
        "Joel Meyers"
      ],
      "abstract": "Insights for Early Dark Energy with Big Bang Nucleosynthesis Christopher Cook, Joel Meyers Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Big Bang Nucleosynthesis (BBN), as one of the earliest processes in the universe accessible to direct observation, offers a powerful and independent probe of the cosmic expansion history. With recent advances in both theory and observation, including efficient and flexible BBN codes, percent-level measurements of primordial deuterium and helium-4 abundances, refined measurements of nuclear reaction rates, and precise determinations of the baryon density from the cosmic microwave background, particularly keen insights can be gained from BBN. In this work, we leverage these developments to place model-independent constraints on deviations from the Standard Model expansion history during BBN. Using the latest abundance data, we apply principal component analysis to identify the most constrained and physically meaningful modes of expansion history variation. This approach allows us to impose the most general constraints on early dark energy during the epoch of BBN. We further examine whether general modifications to the expansion rate could alleviate the long-standing lithium problem. Our results demonstrate that BBN, sharpened by modern data and statistical techniques, remains an indispensable probe of dark energy and new physics in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2512.11163.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11353",
      "title": "Cosmological Implication of Cross-correlation between Galaxy Clustering and 21-cm Line Intensity Mapping",
      "authors": [
        "Yong-Seon Song",
        "Minji Oh",
        "Kyungjin Ahn",
        "Feng Shi"
      ],
      "abstract": "Cosmological Implication of Cross-correlation between Galaxy Clustering and 21-cm Line Intensity Mapping Yong-Seon Song, Minji Oh, Kyungjin Ahn, Feng Shi submitted to ApJ; Comments are welcome; 18 pages, 5 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO) The apparent anisotropies of galaxy clustering and 21-cm mapping in redshift space offer a unique opportunity to simultaneously probe cosmic expansion and gravity on cosmological scales through the Alcock-Paczynski (AP) effect and redshift-space distortions (RSD). Although improved theoretical models exist for anisotropic clustering, their applicability is limited by the non-perturbative smearing effect caused by the randomness of relative velocities. Here, we consider an alternative approach using the statistical power of cross-correlation between galaxy clustering and 21-cm line intensity mapping. Based on Fisher matrix analysis, fully incorporating nonlinear RSD, we estimate the benefit of combining both observables. We find that, for spectroscopy surveys like DESI combined with 21-cm line-intensity mapping surveys, the constraint on the growth of structure is improved by a factor of two relative to the galaxy auto-correlation, while the constraint on the cosmic expansion is only slightly improved. Crucially, such an observation can strongly constrain the neutral hydrogen (HI) content Omega_HI to a sub-percent level. This level of precision unlocks the potential of this method to probe post-reionization astrophysics with enhanced precision. It would far surpass existing constraints from stacked 21-cm emission (resulting in ~ 50%-100% uncertainties) and break the degeneracy between Omega_HI and the HI bias b_HI inherent in linear-regime power spectrum analysis. This cross-correlation approach effectively compensates for the loss of constraining power when using galaxy clustering alone.",
      "pdf_url": "https://arxiv.org/pdf/2512.11353.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11383",
      "title": "Observational evidence of tidal torque in the primordial Universe",
      "authors": [
        "Ming-Jie Sheng",
        "Hao-Ran Yu",
        "Min Bao",
        "Bing-Hang Chen",
        "Fang-Na Shao",
        "Qi Guo",
        "Yanmei Chen",
        "Huiyuan Wang",
        "Ue-Li Pen",
        "Jie Wang",
        "Xiaohu Yang"
      ],
      "abstract": "Observational evidence of tidal torque in the primordial Universe Ming-Jie Sheng, Hao-Ran Yu, Min Bao, Bing-Hang Chen, Fang-Na Shao, Qi Guo, Yanmei Chen, Huiyuan Wang, Ue-Li Pen, Jie Wang, Xiaohu Yang 22 pages, 4 figures, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Tidal torque theory (TTT) predicts that galaxy angular momenta are imprinted by the early tidal field acting on their proto-structures, which are preserved through cosmic evolution and provide the potentially most precise measurement of the early universe. We test this prediction using the gas component of central massive elliptical galaxies, whose angular momenta respond sensitively to external torques. By comparing the observed gas angular momentum vectors with those predicted from the primordial density field reconstructed by ELUCID for the nearby universe, we conclusively detect a strong direction correlation with a significance of about $7\\sigma$. These results provide the first robust observational confirmation of TTT and open a new window for cosmological measurements of neutrino mass and other cosmological parameters.",
      "pdf_url": "https://arxiv.org/pdf/2512.11383.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11568",
      "title": "The magnitude of the dark ages 21-cm signal in the context of existing early and late time constraints on $Λ$CDM",
      "authors": [
        "H. T. J. Bevins"
      ],
      "abstract": "The magnitude of the dark ages 21-cm signal in the context of existing early and late time constraints on $Λ$CDM H. T. J. Bevins Cosmology and Nongalactic Astrophysics (astro-ph.CO) The dark ages 21-cm signal is a promising probe of the currently unobserved infant universe between the formation of the Cosmic Microwave Background around $z \\approx 1100$ and the first galaxies around $z\\approx 30$. A detection of the signal will help researchers understanding the nature of dark matter and dark energy, the expansion of the universe and any extensions to the concordance $\\Lambda$CDM model that could explain the reported Cosmic Dawn 21-cm signal from EDGES and the Hubble tension. In this letter we take existing constraints on the $\\Lambda$CDM cosmological model from two early time probes, Planck and WMAP, and two late time probes, DES galaxy lensing and clustering and Baryon Acoustic Oscillations, and propagate these through to constraints on the magnitude of the dark ages 21-cm signal. We constrain the magnitude and central frequency of the signal while methodically accounting for uncertainties in the cosmological parameters. We find that within the context of our modelling assumptions and the $\\Lambda$CDM paradigm, the depth of the dark ages 21-cm signal is known to better than 1 mK and the central frequency to within 0.05 MHz.",
      "pdf_url": "https://arxiv.org/pdf/2512.11568.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11639",
      "title": "Dark sector interactions in the $w \\rightarrow -1$ limit: velocity locking in pure momentum exchange models",
      "authors": [
        "Nathan Cruickshank",
        "Robert Crittenden",
        "Kazuya Koyama",
        "Marco Bruni"
      ],
      "abstract": "Dark sector interactions in the $w \\rightarrow -1$ limit: velocity locking in pure momentum exchange models Nathan Cruickshank, Robert Crittenden, Kazuya Koyama, Marco Bruni Cosmology and Nongalactic Astrophysics (astro-ph.CO) Models of interacting dark energy (DE) and dark matter (DM) involving pure momentum exchange are a promising avenue for resolving cosmological tensions. However, the behaviour of these interactions in the theoretically challenging limit where the DE equation of state, $w$, approaches $-1$ is not fully understood. We demonstrate that a generic feature of these models is a $w$-dependent velocity-locking mechanism, which systematically shifts the onset of matter power spectrum suppression to smaller scales as $w \\rightarrow -1$. The suppression magnitude depends on the difference in fluid velocities. In this limit, however, the interaction's drag dominates over the DE pressure support and causes the DE velocity to track that of the DM fluid at larger scales. This mechanism provides a physical explanation for the weaker constraints found in the literature when $w\\approx-1$ in models where the interaction strength does not explicitly depend on $w$. We also demonstrate that the common approximation of neglecting DE perturbations ($\\delta_{\\mathrm{DE}}=\\theta_{\\mathrm{DE}}=0$) fails in this limit. By artificially increasing the velocity difference between the fluids, this simplification incorrectly removes the $w$-dependent velocity-locking mechanism and erases the shift in power spectrum suppression to smaller scales. This leads to an overestimation of the constraining power of cosmological data on the interaction strength.",
      "pdf_url": "https://arxiv.org/pdf/2512.11639.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11700",
      "title": "The Domain Adaptation problem in photometric redshift estimation: a solution applied to the HSC Survey",
      "authors": [
        "M. Treyer",
        "R. Ait-Ouahmed",
        "S. Arnouts",
        "J. Pasquet",
        "E. Bertin",
        "G. Desprez",
        "V. Picouet",
        "M. Sawicki"
      ],
      "abstract": "The Domain Adaptation problem in photometric redshift estimation: a solution applied to the HSC Survey M. Treyer, R. Ait-Ouahmed, S. Arnouts, J. Pasquet, E. Bertin, G. Desprez, V. Picouet, M. Sawicki Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) The multi-band HSC-CLAUDS survey comprises several sky regions with varying observing conditions, only one of which, the COSMOS Ultra Deep Field (UDF), offers extensive redshift coverage. We aim to exploit a complete sample of labeled galaxies from the COSMOS UDF at i<25 (z<~5) to train a convolutional neural network (CNN) and infer more accurate photometric redshifts in the other regions than those currently available from SED-fitting methods. To address the severe domain mismatch problem we observed when applying the trained CNN to regions other than the COSMOS UDF, we developed an unsupervised adversarial domain adaptation network that we grafted onto the CNN. The method is validated by three tests: the predicted redshifts are compared to the spectroscopic redshifts that are available for limited samples of mostly bright galaxies; the predicted redshift distributions of the entire galaxy population of a given field in several intervals of magnitude are compared to those of the COSMOS UDF, assumed to be representative; the redshifts predicted for a sample of galaxies selected by narrow-band filter observations sensitive to [OII] emitters at z~1.47 are compared to those of confirmed [OII] emission line galaxies. The results show successful domain adaptation: the network is able to transfer its redshift classification capability learnt from the COSMOS UDF to other regions of HSC-CLAUDS. Accuracy varies depending on magnitude and redshift, following that of the labels we used, but far exceeds that of currently available photometric redshifts. The catalogs of CNN redshifts we inferred for the XMM, DEEP2 and ELAIS fields and for the remaining COSMOS region (~4 million sources in total at i<25) are made public.",
      "pdf_url": "https://arxiv.org/pdf/2512.11700.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11795",
      "title": "Solving the Cosmological Vlasov-Poisson Equations with Physics-Informed Kolmogorov-Arnold Networks",
      "authors": [
        "Nicolas Cerardi",
        "Emma Tolley",
        "Ashutosh Mishra"
      ],
      "abstract": "Solving the Cosmological Vlasov-Poisson Equations with Physics-Informed Kolmogorov-Arnold Networks Nicolas Cerardi, Emma Tolley, Ashutosh Mishra 10 pages, 10 figures, Accepted for publication in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cold dark matter (CDM) evolves as a collisionless fluid under the Vlasov-Poisson equations, but N-body simulations approximate this evolution by discretising the distribution function into particles, introducing discreteness effects at small scales. We present a physics-informed neural network approach that evolves CDM fields without any use of N-body data or methods, using a Kolmogorov-Arnold network (KAN) to model the continuous displacement field for one-dimensional halo collapse. Physical constraints derived from the Vlasov-Poisson equations are embedded directly into the loss function, enabling accurate evolution beyond the first shell crossing. The trained model achieves sub-percent errors on the residuals even after seven shell crossings and matches N-body results while providing a resolution-free representation of the displacement field. In addition, displacement errors do not grow over time, a very interesting feature with respect to N-body methods. It can also reconstruct initial conditions through backward evolution when sufficient final-state information is available. Although current runtimes exceed those of N-body methods, this framework offers a new route to high-fidelity CDM evolution without particle discretisation, with prospects for extension to higher dimensions.",
      "pdf_url": "https://arxiv.org/pdf/2512.11795.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11022",
      "title": "An Active Galaxy Cluster Merger at Cosmic Noon Revealed by JWST Weak Lensing and Multiwavelength Probes",
      "authors": [
        "Zachary P. Scofield",
        "Kyle Finner",
        "Hyungjin Joo",
        "M. James Jee",
        "Wonki Lee",
        "Sangjun Cha",
        "Jinhyub Kim",
        "Yu-Heng Lin",
        "Ranga-Ram Chary",
        "Andreas Faisst",
        "Bomee Lee"
      ],
      "abstract": "An Active Galaxy Cluster Merger at Cosmic Noon Revealed by JWST Weak Lensing and Multiwavelength Probes Zachary P. Scofield, Kyle Finner, Hyungjin Joo, M. James Jee, Wonki Lee, Sangjun Cha, Jinhyub Kim, Yu-Heng Lin, Ranga-Ram Chary, Andreas Faisst, Bomee Lee 15 pages, 5 figures, submitted to ApJL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The galaxy cluster XLSSC 122 is a rare system at $z = 1.98$, hosting surprisingly evolved member galaxies when the Universe was only one-third of its present age. Leveraging deep JWST/NIRCam imaging, we perform a weak-lensing analysis and reconstruct the cluster's mass distribution, finding a mass peak that coincides with both the X-ray peak and the position of the brightest cluster galaxy. We obtain mass and concentration estimates of $M_{200\\rm c}=1.6 \\pm 0.3\\times 10^{14}~M_{\\odot}$ and $c_{200 \\rm c}=6.3 \\pm 0.3$, respectively, in agreement with recent strong-lensing estimates. The high concentration in particular motivates tests against empirical and simulation-derived mass--concentration relations. Placing our weak-lensing mass map in the context of Chandra X-ray data, MeerKAT radio imaging, ALMA+ACA/ACT Sunyaev-Zel'dovich (SZ) mapping, and a new JWST intracluster light measurement, we identify consistent NE--SW elongation across datasets and a pronounced offset along the same axis between the SZ and mass/X-ray peaks, pointing to significant merger activity. XLSSC 122 thus serves as a JWST pilot study for high-$z$ lensing, demonstrating the telescope's unique ability to map cluster mass distributions at $z\\sim2$ and motivating a uniform sample of analogous systems with joint lensing, X-ray, SZ, and radio data to probe cluster assembly at Cosmic Noon.",
      "pdf_url": "https://arxiv.org/pdf/2512.11022.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11128",
      "title": "Constraints on the intergalactic magnetic field from Fermi-LAT observations of GRB 221009A",
      "authors": [
        "Lea Burmeister",
        "Paolo Da vela",
        "Francesco Longo",
        "Guillem Marti-Devesa",
        "Manuel Meyer",
        "Francesco Saturni",
        "Antonio Stamerra",
        "Peter Veres"
      ],
      "abstract": "Constraints on the intergalactic magnetic field from Fermi-LAT observations of GRB 221009A Lea Burmeister, Paolo Da vela, Francesco Longo, Guillem Marti-Devesa, Manuel Meyer, Francesco Saturni, Antonio Stamerra, Peter Veres Under review in PRL. 14 pages, 9 figures, 2 tables High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) A cosmological origin of the magnetic fields in large scale structures of the Universe would require a non-negligible magnetic field in cosmic voids, which, however, remains undetected. Gamma-ray emission from gamma-ray bursts (GRBs) offers the opportunity to indirectly probe such an intergalactic magnetic field (IGMF), as gamma rays interact with cosmic radiation fields, producing electron-positron pairs, and initiate an electromagnetic cascade. The deflection of the pairs in the IGMF results in a time-delayed signal at GeV energies. Using observations with the Fermi Large Area Telescope of the GRB 221009A, we are able to derive the most stringent constraints to date from the non-observation of the cascade and rule out magnetic fields B < 2.5 x 10^{-17} G at 95% confidence level for a coherence length larger than 1 Mpc. Our results are comparable to limits obtained from blazar observations but do not suffer from assumptions on the duty cycle of the gamma-ray source or whether inverse-Compton scattering losses dominate over the development of plasma instabilities.",
      "pdf_url": "https://arxiv.org/pdf/2512.11128.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11397",
      "title": "Intergalactic magnetic field lower limits up to the redshift $z\\approx3$",
      "authors": [
        "Ievgen Vovk"
      ],
      "abstract": "Intergalactic magnetic field lower limits up to the redshift $z\\approx3$ Ievgen Vovk 19 pages (inc. references), 9 figures, submitted to the Journal of High Energy Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Large-scale intergalactic magnetic fields may contain a mixture of galactic and cosmogenic contributions, that can be probed via observations of $\\gamma$-ray \"echo\" from sources at cosmological distances. While these contributions may be disentangled based on the difference in their redshift evolution, thus far indications of non-negligible magnetic field have been found only at low redshifts. This work aims at extending the intergalactic magnetic field constraints to redshifts $z\\gtrsim 1$ using 17-year long all-sky observations of high-redshift active galactic nuclei with Fermi/LAT $\\gamma$-ray telescope. Combing the Fermi/LAT measurements in the 0.1 GeV - 1 TeV energy range with the Monte Carlo simulations of the $\\gamma$-ray \"echo\", it is shown that the zero field strength hypothesis at $z = [0.5; 3]$ is disfavoured at the $\\approx 9\\sigma$ significance level, yielding the lower limit of $B \\gtrsim 1\\times10^{-18}$ cG for the magnetic field correlation length above 1 Mpc. It is further shown that the same data put a lower limit on the volume-filling fraction of this field of $f\\gtrsim 90\\%$ in the redshift range considered. It is also demonstrated that the derived limits are not substantially affected by either source flux variability or the assumed $\\gamma$-ray emission attenuation model. Implications of these limits for intergalactic magnetic field origin are discussed.",
      "pdf_url": "https://arxiv.org/pdf/2512.11397.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11656",
      "title": "The multiphase interstellar medium as a common origin for magnetic misalignment and TB parity violation",
      "authors": [
        "Andrea Bracco",
        "Ari J. Cukierman",
        "Raphael Skalidis",
        "François Boulanger"
      ],
      "abstract": "The multiphase interstellar medium as a common origin for magnetic misalignment and TB parity violation Andrea Bracco, Ari J. Cukierman, Raphael Skalidis, François Boulanger Submitted to A&A, comments are welcome Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present an original data analysis and a physical model that provide new insights into the origin of, and relationship between, two observables of the dusty, polarized Galaxy at intermediate and high latitudes: (i) the misalignment between HI filamentary structures and magnetic fields and (ii) the positive $TB$ correlation measured in Planck data suggesting parity violation in the interstellar medium (ISM). We confirm an observational link between the two effects and find that both are predominantly produced at large angular scales ($\\geq 10^\\circ$, multipoles $\\ell \\leq 20$) with a significantly stronger signal in the northern hemisphere. We propose a model in which filaments and magnetic fields appear misaligned in projection because they are sourced by cold and warm gas phases distributed in different proportions in the Solar neighborhood, from the wall of the Local Bubble to larger distances. These projection effects at large angular scales can produce coherent signatures that propagate to smaller scales in power spectra without invoking local, small-scale filament misalignment. Within this frame, HI filaments remain statistically aligned with the magnetic field in 3D, although with a projected scatter of tens of degrees that requires further investigation. The multiphase, geometrical model presented in this work is supported by Planck polarization data at 30 GHz, where synchrotron radiation dominates, and at 217 and 353 GHz, where dust emission dominates. Our analysis also incorporates starlight polarization measurements. The model introduced here suggests a new interpretation of two unexplained observables and emphasizes the role of the large-scale magnetized ISM in shaping polarized Galactic emission, which has important implications for both Galactic astrophysics and cosmological foreground characterization.",
      "pdf_url": "https://arxiv.org/pdf/2512.11656.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11790",
      "title": "GLIMPSE-D: An Exotic Balmer-Jump Object at z=6.20? Revisiting Photometric Selection and the Cosmic Abundance of Pop III Galaxies",
      "authors": [
        "Seiji Fujimoto",
        "Yoshihisa Asada",
        "Rohan P. Naidu",
        "John Chisholm",
        "Hakim Atek",
        "Gabriel Brammer",
        "Danielle A. Berg",
        "Daniel Schaerer",
        "Vasily Kokorev",
        "Lukas J. Furtak",
        "Johan Richard",
        "Alessandra Venditti",
        "Volker Bromm",
        "Angela Adamo",
        "Adelaide Claeyssens",
        "Miroslava Dessauges-Zavadsky",
        "Qinyue Fei",
        "Tiger Yu-Yang Hsiao",
        "Damien Korber",
        "Julian B. Munoz",
        "Richard Pan",
        "Alberto Saldana-Lopez"
      ],
      "abstract": "GLIMPSE-D: An Exotic Balmer-Jump Object at z=6.20? Revisiting Photometric Selection and the Cosmic Abundance of Pop III Galaxies Seiji Fujimoto, Yoshihisa Asada, Rohan P. Naidu, John Chisholm, Hakim Atek, Gabriel Brammer, Danielle A. Berg, Daniel Schaerer, Vasily Kokorev, Lukas J. Furtak, Johan Richard, Alessandra Venditti, Volker Bromm, Angela Adamo, Adelaide Claeyssens, Miroslava Dessauges-Zavadsky, Qinyue Fei, Tiger Yu-Yang Hsiao, Damien Korber, Julian B. Munoz, Richard Pan, Alberto Saldana-Lopez 24pages, 16 figures, 4 tables. Submitted to the Open Journal of Astrophysics. Comments and feedback are warmly welcomed! Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present deep JWST/NIRSpec G395M spectroscopy of GLIMPSE-16043, a promising $z\\sim6$ Pop III candidate originally identified through NIRCam photometry as having weak [OIII]$\\lambda\\lambda4959,5007$ emission. Our follow-up reveals clear [OIII] emission, ruling out a genuine zero-metallicity nature. However, the combination of the measured line fluxes and photometry indicates that its spectral energy distribution requires an extraordinarily strong Balmer jump ($-1.66 \\pm 0.47$ mag) and H$\\alpha$ equivalent width ($3750\\pm1800$ Å), features that cannot be reproduced by current stellar+nebular or pure nebular photoionization models. The only models approaching the observations to almost within $1\\sigma$ involve a hot ($T_{\\rm eff}\\!\\simeq\\!10^{4.7}$ K) single blackbody embedded in a low-$T_{\\rm e}$ nebular environment, suggestive of scenarios such as a tidal-disruption event or a microquasar with strong disk winds. This cautions that photometric Pop~III selections are vulnerable to contamination when the rest-frame optical continuum is undetected. Motivated by this, we refine the photometric Pop III selection criteria to exclude the locus of extreme Balmer-jump objects. The revised criteria also recover the recently reported spectroscopic candidate AMORE6, demonstrating that the updated selection preserves sensitivity to genuine Pop III-like sources while removing key contaminants. Applying the refined criteria across legacy survey fields and five newly released CANUCS lensing cluster fields, we revisit the Pop III UV luminosity function and estimate the Pop III cosmic star-formation rate density to be $\\approx[10^{-6}$--$10^{-4}]$~$M_{\\odot}$~yr$^{-1}$~cMpc$^{-3}$ at $z\\simeq6$--7, falling in the range of current theoretical predictions.",
      "pdf_url": "https://arxiv.org/pdf/2512.11790.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.04838",
      "title": "Dynamical Galactic Halo Reconstruction from Rotation Curves in Self-Interacting Fuzzy Dark Matter",
      "authors": [
        "Milos Indjin",
        "I-Kang Liu",
        "Nick P. Proukakis",
        "Gerasimos Rigopoulos",
        "Aditya Verma"
      ],
      "abstract": "Dynamical Galactic Halo Reconstruction from Rotation Curves in Self-Interacting Fuzzy Dark Matter Milos Indjin, I-Kang Liu, Nick P. Proukakis, Gerasimos Rigopoulos, Aditya Verma Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Fuzzy Dark Matter with an explicitly non-zero quartic self-interaction (gFDM) is shown to be a viable model for simultaneously fitting 17 dark-matter-dominated galaxies from the SPARC database, constraining both the boson mass, $m$, and the self-coupling constant, $g$, to values within the range $\\log_{10}\\left(\\frac{m}{\\mathrm{eV}/c^2}\\right) = \\log_{10}(1.98)-22^{+0.8}_{-0.6}$ and $\\log_{10}\\left(\\frac{g}{\\mathrm{Jm}^3/kg}\\right) = \\log_{10}(1.45)-28^{+0.4}_{-1.2}$; this is based on the combination of an appropriately constructed static super-Gaussian profile for the inner galactic core (`soliton') region, and a Navarro-Frenk-White profile for the surrounding halo region. Identification of these parameters enables the explicit {\\em dynamical} reconstruction of potential host halos for such galaxies, for which we outline a procedure with a proof-of-principle demonstration for two galaxies (UGCA444, UGC07866) shown to yield viable rotation curves over a dynamical period of $O(1) \\, Gyr$.",
      "pdf_url": "https://arxiv.org/pdf/2502.04838.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.16076",
      "title": "Optimal intrinsic alignment estimators in the presence of redshift-space distortions",
      "authors": [
        "Claire Lamman",
        "Jonathan Blazek",
        "Daniel J. Eisenstein"
      ],
      "abstract": "Optimal intrinsic alignment estimators in the presence of redshift-space distortions Claire Lamman, Jonathan Blazek, Daniel J. Eisenstein Published in the Open Journal of Astrophysics. For an accessible summary of this paper, see this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present estimators for quantifying intrinsic alignments in large spectroscopic surveys that efficiently capture line-of-sight (LOS) information while being relatively insensitive to redshift-space distortions (RSD). We demonstrate that changing the LOS integration range, Pimax, as a function of transverse separation outperforms the conventional choice of a single Pimax value. This is further improved by replacing the flat Pimax cut with a LOS weighting based on shape projection and RSD. Although these estimators incorporate additional LOS information, they are projected correlations that exhibit signal-to-noise ratios comparable to 3D correlation functions, such as the IA quadrupole. Using simulations from Abacus Summit, we evaluate these estimators and provide recommended Pimax values and weights for projected separations of 1 - 100 Mpc/h. These will improve measurements of intrinsic alignments in large cosmological surveys and the constraints they provide for both weak lensing and direct cosmological applications.",
      "pdf_url": "https://arxiv.org/pdf/2504.16076.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.19436",
      "title": "Sensitivity of the redshifted 21 cm signal from the Dark Ages to parameters of primordial magnetic fields",
      "authors": [
        "Bohdan Novosyadlyj",
        "Yurii Kulinich",
        "Nazar Fortuna",
        "Anton Rudakovskyi"
      ],
      "abstract": "Sensitivity of the redshifted 21 cm signal from the Dark Ages to parameters of primordial magnetic fields Bohdan Novosyadlyj, Yurii Kulinich, Nazar Fortuna, Anton Rudakovskyi 10 pages, 9 figures; accepted for publication in A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) We analyse the impact of the decaying magnetic turbulence of primordial magnetic fields (PMFs) and ambipolar diffusion on the ionisation and thermal history of the Dark Ages Universe ($30\\le z\\le300$), and its imprint on the spectral profile of the global signal in the redshifted 21 cm hydrogen line. The heating function caused by decaying magnetic turbulence monotonically decreases after cosmological recombination; its amplitude strongly depends on the strength of the PMFs' $B_0$ and weakly depends on the spectral index of the initial power spectrum of the PMFs' $n_{\\rm B}$. The heating function caused by ambipolar diffusion, in contrast, noticeably depends on the spectral index in the range $-3\\lesssim n_{\\rm B}\\lesssim4$ but is subdominant in the Dark Ages epoch for PMF models with $B_0\\lesssim0.5$ nG. We computed the ionisation and thermal history of intergalactic gas from the cosmological recombination up to the end of the Dark Ages epoch for a range of PMF parameters, $0.05\\lesssim B_0\\lesssim0.5$ nG, $-2.9\\lesssim n_{\\rm B}\\lesssim4$, and show the essentially distinguished thermal evolution from one in the Lambda cold dark matter ($\\Lambda$CDM) model. We also show that the profile of the redshifted 21 cm hydrogen line is very sensitive to the PMF parameters from this range and can be used for their constraints in conjunction with other observational data.",
      "pdf_url": "https://arxiv.org/pdf/2506.19436.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.00293",
      "title": "Fuzzy dark matter halos with repulsive self-interactions: coherent soliton and halo vortex network with moderate self-coupling",
      "authors": [
        "Milos Indjin",
        "Nick Keepfer",
        "I-Kang Liu",
        "Nick P. Proukakis",
        "Gerasimos Rigopoulos"
      ],
      "abstract": "Fuzzy dark matter halos with repulsive self-interactions: coherent soliton and halo vortex network with moderate self-coupling Milos Indjin, Nick Keepfer, I-Kang Liu, Nick P. Proukakis, Gerasimos Rigopoulos Cosmology and Nongalactic Astrophysics (astro-ph.CO); Quantum Gases (cond-mat.quant-gas) We examine the impact of moderate repulsive self-interactions on fuzzy dark matter halos generated by merging smaller Gaussian density concentrations. We study the size of the core and the granules, the spatial dependence of the field's coherence, the turbulent vortex tangle and the oscillation frequency of the central soliton, covering the range from quantum-pressure-dominated to self-interaction-dominated stabilisation of the solitonic core. For the probed self-coupling strengths $g$ and with a fixed initial configuration, mergers with increasing $g$ result in cores with increased size and a reduced central density, oscillating with decreased frequency, in accordance with expectations from the study of isolated Self-interacting Fuzzy Dark Matter (SFDM) solitons. By contrast, the characteristic granule size and typical inter-vortex distances in the surrounding halo are only mildly affected, growing much less relative to the core. The total length of the vortex network, although less robust, shows no signs of decay over our simulation timescales. The generated halos therefore develop central self-interaction-dominated cores, but with the outer halos still supported by quantum-pressure and classical kinetic energy in equipartition as in the non-interacting case. Furthermore, measures of coherence of the field clearly separate the condensed core, identified via the Penrose-Onsager (largest eigenvalue) mode of the entire classical field, from the surrounding quasi-coherent halo. Unlike the $g=0$ case, we observe a relative increase of incoherent fluctuations coexisting with the coherent mode at the centre of the halo with increasing $g$, a phenomenon also observed in laboratory condensates at non-zero temperature.",
      "pdf_url": "https://arxiv.org/pdf/2507.00293.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.02779",
      "title": "Euclid: Photometric redshift calibration with self-organising maps",
      "authors": [
        "W. Roster",
        "A. H. Wright",
        "H. Hildebrandt",
        "R. Reischke",
        "O. Ilbert",
        "W. d'Assignies D.",
        "M. Manera",
        "M. Bolzonella",
        "D. C. Masters",
        "S. Paltani",
        "W. G. Hartley",
        "Y. Kang",
        "H. Hoekstra",
        "B. Altieri",
        "A. Amara",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "A. Balestra",
        "S. Bardelli",
        "P. Battaglia",
        "R. Bender",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "V. F. Cardone",
        "J. Carretero",
        "R. Casas",
        "S. Casas",
        "F. J. Castander",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "A. Costille",
        "F. Courbin",
        "H. M. Courtois",
        "M. Cropper",
        "A. Da Silva",
        "H. Degaudenzi",
        "S. de la Torre",
        "G. De Lucia",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "S. Dusini",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "S. Farrens",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "P. Fosalba",
        "N. Fourmanoit",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "W. Gillard",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "S. V. H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "P. Hudelot",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "B. Kubik",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "D. Le Mignant",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "D. Maino",
        "E. Maiorano",
        "O. Mansutti",
        "O. Marggraf",
        "M. Martinelli"
      ],
      "abstract": "Euclid: Photometric redshift calibration with self-organising maps W. Roster, A. H. Wright, H. Hildebrandt, R. Reischke, O. Ilbert, W. d'Assignies D., M. Manera, M. Bolzonella, D. C. Masters, S. Paltani, W. G. Hartley, Y. Kang, H. Hoekstra, B. Altieri, A. Amara, S. Andreon, N. Auricchio, C. Baccigalupi, M. Baldi, A. Balestra, S. Bardelli, P. Battaglia, R. Bender, A. Biviano, E. Branchini, M. Brescia, S. Camera, G. Cañas-Herrera, V. Capobianco, C. Carbone, V. F. Cardone, J. Carretero, R. Casas, S. Casas, F. J. Castander, M. Castellano, G. Castignani, S. Cavuoti, K. C. Chambers, A. Cimatti, C. Colodro-Conde, G. Congedo, C. J. Conselice, L. Conversi, Y. Copin, A. Costille, F. Courbin, H. M. Courtois, M. Cropper, A. Da Silva, H. Degaudenzi, S. de la Torre, G. De Lucia, F. Dubath, C. A. J. Duncan, X. Dupac, S. Dusini, S. Escoffier, M. Farina, R. Farinelli, S. Farrens, F. Faustini, S. Ferriol, F. Finelli, P. Fosalba, N. Fourmanoit, M. Frailis, E. Franceschi, M. Fumana, S. Galeotta, K. George, W. Gillard, B. Gillis, C. Giocoli, J. Gracia-Carpio, A. Grazian, F. Grupp, S. V. H. Haugan, W. Holmes, F. Hormuth, A. Hornstrup, P. Hudelot, K. Jahnke, M. Jhabvala, B. Joachimi, E. Keihänen, S. Kermiche, B. Kubik, H. Kurki-Suonio, A. M. C. Le Brun, D. Le Mignant, S. Ligori, P. B. Lilje, V. Lindholm, I. Lloro, D. Maino, E. Maiorano, O. Mansutti, O. Marggraf, M. Martinelli Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The Euclid survey aims to trace the evolution of cosmic structures up to redshift $z$ $\\sim$ 3 and beyond. Its success depends critically on obtaining highly accurate mean redshifts for ensembles of galaxies $n(z)$ in all tomographic bins, essential for deriving robust cosmological constraints. However, photometric redshifts (photo-$z$s) suffer from systematic biases arising from various sources of uncertainty. To address these challenges, we utilised self-organising maps (SOMs) with mock samples resembling the Euclid Wide Survey (EWS), to validate Euclid's uncertainty requirement of $|\\Delta\\langle z \\rangle| = \\langle z_{\\text{est}} \\rangle - \\langle z \\rangle \\leq 0.002 (1+z)$ per tomographic bin, assuming DR3-level data. We observe that defining the redshift tomography using the mean spectroscopic redshift (spec-$z$) per SOM cell, results in none of the ten tomographic redshift bins satisfying the requirement. In contrast, the redshift tomography on the photo-$z$s of the EWS-like sample yields superior results, with eight out of ten bins [$0 < z\\leq 2.5$] meeting the Euclid requirement. To enhance the realism of our study, we morph our calibration sample to mimic the C3R2 survey in incremental steps. In this context, a maximum of six out of ten bins meet the requirement, strongly advocating the adoption of a redshift tomography defined by the photo-$z$s of individual galaxies rather than the commonly used mean spec-$z$ of SOM cells. To examine the impact on the expected biases for $\\Omega_{\\text{m}}$, $\\sigma_{8}$, and $\\Delta w_{0}$ measured by Euclid, we perform a Fisher forecast for cosmic shear only, based on our redshift uncertainties. Here, we find that even under an evaluation of the uncertainty where the impact of the redshift bias is substantial, most absolute biases remain below 0.1$\\sigma$ in the idealised scenario and below 0.3$\\sigma$ in the more realistic case.",
      "pdf_url": "https://arxiv.org/pdf/2508.02779.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.16097",
      "title": "Forecasting the Constraint on the Hu-Sawicki $f(R)$ Modified Gravity in the CSST $3\\times2$pt Photometric Survey",
      "authors": [
        "Jun-Hui Yan",
        "Yan Gong",
        "Qi Xiong",
        "Xuelei Chen",
        "Qi Guo",
        "Ming Li",
        "Yun Liu",
        "Wenxiang Pei"
      ],
      "abstract": "Forecasting the Constraint on the Hu-Sawicki $f(R)$ Modified Gravity in the CSST $3\\times2$pt Photometric Survey Jun-Hui Yan, Yan Gong, Qi Xiong, Xuelei Chen, Qi Guo, Ming Li, Yun Liu, Wenxiang Pei 13 pages, 9 figures, 1 table. Accepted for publication in ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) We forecast the constraint on the Hu-Sawicki $f(R)$ model from the photometric survey operated by the Chinese Space Station Survey Telescope (CSST). The simulated $3\\times2$pt data of galaxy clustering, weak lensing, and galaxy-galaxy lensing measurements within 100 deg$^{2}$ are used in the analysis. The mock observational maps are constructed from a light cone, redshift sampling and noise. The angular power spectra are measured with pseudo-$C_\\ell$ estimators and compared to theory in the same basis using validated weighting functions and an analytic covariance matrix that includes Gaussian, connected non-Gaussian, and super-sample terms. We model the theoretical spectra using two methods. The first one uses MGCAMB to compute the linear modified-gravity clustering power spectra, and the second one adopts the FREmu emulator with a baseline of nonlinear $\\Lambda$CDM prescription. Parameter inference is performed with Cobaya, and the cosmological and modified-gravity parameters are sampled within the emulator training domain, which is jointly fitted with the systematic parameters. We find that the predictions from the two methods are in good agreement at the overlapping large scales, and the emulator method can correctly provide additional high-$\\ell$ information. The $1\\sigma$ upper bounds of $\\log_{10}|f_{R0}|$ are found to be $<-5.42$ for cosmic shear only case and $<-5.29$ for the 100 deg$^2$ CSST $3\\times2$pt probe. The full CSST photometric survey with 17,500 deg$^2$ survey area is expected to further improve the constraint precision by about one order of magnitude. Our results demonstrate that the CSST $3\\times2$pt survey can deliver strict tests on $f(R)$ gravity.",
      "pdf_url": "https://arxiv.org/pdf/2511.16097.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.09303",
      "title": "Galaxy Cluster Detection and Dynamical Analysis in the VIPERS High-Redshift Spectroscopic Survey",
      "authors": [
        "Mohamed H. Abdullah",
        "Omnia I. Adly",
        "Gillian Wilson",
        "Magdy Y. Amin",
        "A. Ahmed"
      ],
      "abstract": "Galaxy Cluster Detection and Dynamical Analysis in the VIPERS High-Redshift Spectroscopic Survey Mohamed H. Abdullah, Omnia I. Adly, Gillian Wilson, Magdy Y. Amin, A. Ahmed 13 pages, 3 figures, submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a dynamical analysis of galaxy clusters identified in the VIPERS spectroscopic survey within the redshift range 0.5 <= z <= 1.2. Cluster candidates were first detected as overdense regions in redshift space through the Finger-of-God (FoG) effect, and cluster membership was assigned using the GalWeight technique within the FoG-GalWeight methodology developed by our team. For each cluster, we derived the virial radius (R200), velocity dispersion (sigma200), and virial mass (M200) using the virial mass estimator. We identified ten VIPERS clusters spanning a mass range of 0.59 x 10^14 <= M200/(h^-1 Msun) <= 4.32 x 10^14 and velocity dispersions of 360 <= sigma200 <= 900 km s^-1. We cross-matched the VIPERS clusters with published catalogs and found at least one matching system for each cluster, offering external validation for our detections. We investigated the velocity dispersion-mass relation for these systems and obtained log(sigma200) = (2.73 +/- 0.06) + (0.36 +/- 0.18) log(M200), with an intrinsic scatter of sigma_int = 0.04 +/- 0.07. The derived relation is consistent with theoretical predictions from N-body and hydrodynamical simulations, confirming the reliability of the FoG-GalWeight methodology and the robustness of the virial mass estimator. Our findings demonstrate that the velocity dispersion can serve as a reliable and direct proxy for cluster mass, even at high redshift, without requiring additional dynamical mass modeling.",
      "pdf_url": "https://arxiv.org/pdf/2512.09303.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.08028",
      "title": "The Luminosity Function and Clustering of H$α$ Emitting Galaxies at $z\\approx4-6$ from a Complete NIRCam Grism Redshift Survey",
      "authors": [
        "Xiaojing Lin",
        "Eiichi Egami",
        "Fengwu Sun",
        "Haowen Zhang",
        "Xiaohui Fan",
        "Jakob M. Helton",
        "Feige Wang",
        "Andrew J. Bunker",
        "Zheng Cai",
        "Daniel J. Eisenstein",
        "Daniel T. Jaffe",
        "Zhiyuan Ji",
        "Xiangyu Jin",
        "Maria Anne Pudoka",
        "Sandro Tacchella",
        "Wei Leong Tee",
        "Pierluigi Rinaldi",
        "Brant Robertson",
        "Yang Sun",
        "Christopher N. A. Willmer",
        "Chris Willott",
        "Junyu Zhang",
        "Yongda Zhu"
      ],
      "abstract": "The Luminosity Function and Clustering of H$α$ Emitting Galaxies at $z\\approx4-6$ from a Complete NIRCam Grism Redshift Survey Xiaojing Lin, Eiichi Egami, Fengwu Sun, Haowen Zhang, Xiaohui Fan, Jakob M. Helton, Feige Wang, Andrew J. Bunker, Zheng Cai, Daniel J. Eisenstein, Daniel T. Jaffe, Zhiyuan Ji, Xiangyu Jin, Maria Anne Pudoka, Sandro Tacchella, Wei Leong Tee, Pierluigi Rinaldi, Brant Robertson, Yang Sun, Christopher N. A. Willmer, Chris Willott, Junyu Zhang, Yongda Zhu Main text 19 pages, 11 figures. Accepted by ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We study the luminosity function (LF) and clustering properties of 888 H$\\alpha$ emitters (HAEs) at $3.75 < z < 6$ in the GOODS-N field. The sample, built from JWST CONGRESS and FRESCO NIRCam grism surveys using a novel redshift assignment algorithm, spans $\\sim$62 arcmin$^2$ and reaches $L_{\\rm H\\alpha} \\sim 10^{41.2} {\\rm erg s^{-1}}$. We identify two prominent filamentary protoclusters at $z \\approx 4.41$ and $z \\approx 5.19$, hosting 98 and 144 HAEs, respectively. The observed H$\\alpha$ LFs show similar shallow faint-end slopes for both protocluster and field galaxies at $z=3.75-5$, and for the protocluster at $z=5-6$ ($\\alpha\\approx 1.2$ to $-1.3$). In contrast, the field LF at $z=5-6$ is much steeper ($\\alpha=-1.87_{-0.23}^{+0.30}$), suggesting that protocluster galaxies at $z > 5$ are more evolved, resembling those at $z=3.75-5$. The observed star formation rate density from H$\\alpha$, integrated down to 0.45 ${\\rm M_\\odot yr^{-1}}$, is $0.050^{+0.002}_{-0.003}$ and $0.046^{+0.006}_{-0.004} M_\\odot {\\rm yr}^{-1} {\\rm Mpc}^{-3}$ at $z=3.75-5$ and $z=5-6$, with protoclusters contributing $\\sim$25% and 55%, respectively. This implies that a large fraction of star formation at $z > 4$ occurs in protoclusters. We conduct the first star-formation-rate-limited 3D clustering analysis at $z > 4$. We find the filamentary protocluster geometry flattens the power-law shape of the HAE auto-correlation functions, with slopes much shallower than typically assumed. The auto-correlation function of field HAEs have correlation lengths of $r_0 = 4.61^{+1.00}_{-0.68} h^{-1}{\\rm Mpc}$ at $z \\approx 4-5$ and $r_0 = 6.23^{+1.68}_{-1.13} h^{-1}{\\rm Mpc}$ at $z=5-6$. Comparing the observed correlation functions with the UniverseMachine simulation, we infer the dark matter (sub-)halo masses of HAEs to be $\\log (M_h/M_\\odot)=11.0-11.2$ at $z\\approx 4-6$, with a scatter of 0.4 dex.",
      "pdf_url": "https://arxiv.org/pdf/2504.08028.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.02896",
      "title": "The Large-scale Environments of Low-luminosity AGNs at $3.9 < z < 6$ and Implications for Their Host Dark Matter Halos from a Complete NIRCam Grism Redshift Survey",
      "authors": [
        "Xiaojing Lin",
        "Xiaohui Fan",
        "Fengwu Sun",
        "Junyu Zhang",
        "Eiichi Egami",
        "Jakob M. Helton",
        "Feige Wang",
        "Haowen Zhang",
        "Andrew J. Bunker",
        "Zheng Cai",
        "Zhiyuan Ji",
        "Xiangyu Jin",
        "Roberto Maiolino",
        "Maria Anne Pudoka",
        "Pierluigi Rinaldi",
        "Brant Robertson",
        "Sandro Tacchella",
        "Wei Leong Tee",
        "Yang Sun",
        "Christopher N. A. Willmer",
        "Chris Willott",
        "Yongda Zhu"
      ],
      "abstract": "The Large-scale Environments of Low-luminosity AGNs at $3.9 < z < 6$ and Implications for Their Host Dark Matter Halos from a Complete NIRCam Grism Redshift Survey Xiaojing Lin, Xiaohui Fan, Fengwu Sun, Junyu Zhang, Eiichi Egami, Jakob M. Helton, Feige Wang, Haowen Zhang, Andrew J. Bunker, Zheng Cai, Zhiyuan Ji, Xiangyu Jin, Roberto Maiolino, Maria Anne Pudoka, Pierluigi Rinaldi, Brant Robertson, Sandro Tacchella, Wei Leong Tee, Yang Sun, Christopher N. A. Willmer, Chris Willott, Yongda Zhu Main text 15 pages; 9 figures; Accepted by the ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We study the large-scale environments and clustering properties of 28 low-luminosity AGNs at $z=3.9-6$ in the GOODS-N field. Our sample, identified from the JWST NIRCam Imaging and WFSS data in CONGRESS and FRESCO surveys with either broad H$\\alpha$ emission lines or V-shape continua, are compared to 782 H$\\alpha$ emitters (HAEs) selected from the same data. These AGNs are located in diverse large-scale environments and do not preferentially reside in denser environments compared to HAEs. Their overdensity field, $\\delta$, averaged over (15 $h^{-1}$cMpc)$^3$, ranges from $-0.56$ to 10.56, and shows no clear correlation with broad-line luminosity, black hole (BH) masses, or the AGN fraction. It suggests that $> 10$ cMpc structures do not significantly influence BH growth. We measure the two-point cross-correlation function of AGNs with HAEs, finding a comparable amplitude to that of the HAE auto-correlation. This indicates similar bias parameters and host dark matter halo masses for AGNs and HAEs. The correlation length of field AGNs is 4.26 $h^{-1}$cMpc, and 7.66 $h^{-1}$cMpc at $3.9 < z < 5$ and $5 < z < 6$, respectively. We infer a median host dark matter halo mass of $\\log (M_h/M_\\odot)\\approx 11.0-11.2$ and host stellar masses of $\\log (M_\\star/M_\\odot) \\approx 8.4-8.6$ by comparing with the UniverseMachine simulation. Our clustering analysis suggests that low-luminosity AGNs at high redshift reside in normal star-forming galaxies with overmassive BHs. They represent an intrinsically distinct population from luminous quasars and could be a common phase in galaxy evolution.",
      "pdf_url": "https://arxiv.org/pdf/2505.02896.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.10659",
      "title": "The Discovery of Little Red Dots in the Local Universe: Signatures of Cool Gas Envelopes",
      "authors": [
        "Xiaojing Lin",
        "Xiaohui Fan",
        "Zheng Cai",
        "Fuyan Bian",
        "Hanpu Liu",
        "Fengwu Sun",
        "Yilun Ma",
        "Jenny E. Greene",
        "Michael A. Strauss",
        "Richard Green",
        "Jianwei Lyu",
        "Jaclyn B. Champagne",
        "Andy D. Goulding",
        "Kohei Inayoshi",
        "Xiangyu Jin",
        "Gene C. K. Leung",
        "Mingyu Li",
        "Weizhe Liu",
        "Yichen Liu",
        "Junjie Mao",
        "Maria Anne Pudoka",
        "Wei Leong Tee",
        "Ben Wang",
        "Feige Wang",
        "Yunjing Wu",
        "Jinyi Yang",
        "Haowen Zhang",
        "Yongda Zhu"
      ],
      "abstract": "The Discovery of Little Red Dots in the Local Universe: Signatures of Cool Gas Envelopes Xiaojing Lin, Xiaohui Fan, Zheng Cai, Fuyan Bian, Hanpu Liu, Fengwu Sun, Yilun Ma, Jenny E. Greene, Michael A. Strauss, Richard Green, Jianwei Lyu, Jaclyn B. Champagne, Andy D. Goulding, Kohei Inayoshi, Xiangyu Jin, Gene C. K. Leung, Mingyu Li, Weizhe Liu, Yichen Liu, Junjie Mao, Maria Anne Pudoka, Wei Leong Tee, Ben Wang, Feige Wang, Yunjing Wu, Jinyi Yang, Haowen Zhang, Yongda Zhu Main text 27 pages, 15 figures, 5 tables. Measurement and line identification updated; more absorption features in Figure 12. No changes to major conclusions. Accepted by ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Solar and Stellar Astrophysics (astro-ph.SR) JWST observations have revealed a population of high-redshift \"little red dots\" (LRDs) that challenge conventional AGN models. We report the discovery of three local LRDs at $z = 0.1$-$0.2$, initially selected from the SDSS database, with follow-up optical/near-IR spectroscopy and photometry. They exhibit properties fully consistent with those of high-redshift LRDs, including broad hydrogen and helium emission lines, compact morphologies, V-shaped UV-optical SED, declining near-IR continua, and no significant variability. Two sources were targeted but not detected in X-rays with statistical significance. All three sources show blue-shifted He I absorption, while two exhibit H$\\alpha$ and Na D absorption lines. We detect full Balmer and Paschen line series in all three objects, along with abundant narrow [Fe II] emission in two. The emission line analyses suggest narrow lines originate from AGN-powered, metal-poor regions with minimal dust; broad lines come from inner regions with exceptionally high density or atypical dust properties; and [Fe II] emission arises from dense gas between broad and narrow-line regions. One of our objects, J1025+1402 (nicknamed $The~Egg$), shows extremely high equivalent width Na D, K I, and Ca II triplet absorption lines, along with other potential low-ionization absorption features, suggesting the presence of a cool ($\\sim$5000 K), metal-enriched gas envelope. The optical/near-IR continua of these LRDs are also consistent with theoretical models featuring an atmosphere around black holes. The WISE-detected IR emission is consistent with weak dust emission of $T \\sim 10^2-10^3$ K. We propose a conceptual model consisting of a largely thermalized cool-gas envelope surrounding the central black hole and an extended emission line region with high-density outflowing gas to explain the observed properties of these local LRDs.",
      "pdf_url": "https://arxiv.org/pdf/2507.10659.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.09021",
      "title": "Interpretable machine learning of halo gas density profiles: a sensitivity analysis of cosmological hydrodynamical simulations",
      "authors": [
        "Daniele Sorini",
        "Sownak Bose",
        "Mathilda Denison",
        "Romeel Davé"
      ],
      "abstract": "Interpretable machine learning of halo gas density profiles: a sensitivity analysis of cosmological hydrodynamical simulations Daniele Sorini, Sownak Bose, Mathilda Denison, Romeel Davé Submitted to The Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Stellar and AGN-driven feedback processes affect the distribution of gas on a wide range of scales, from within galaxies well into the intergalactic medium. Yet, it remains unclear how feedback, through its connection to key galaxy properties, shapes the radial gas density profile in the host halo. We tackle this question using suites of the EAGLE, IllustrisTNG, and Simba cosmological hydrodynamical simulations, which span a variety of feedback models. We develop a random forest algorithm that predicts the radial gas density profile within haloes from the total halo mass and five global properties of the central galaxy: gas and stellar mass; star formation rate; mass and accretion rate of the central black hole (BH). The algorithm reproduces the simulated gas density profiles with an average accuracy of $\\sim$80-90% over the halo mass range $10^{9.5} \\, \\mathrm{M}_{\\odot} < M_{\\rm 200c} < 10^{15} \\, \\mathrm{M}_{\\odot}$ and redshift interval $0<z<4$. For the first time, we apply Sobol statistical sensitivity analysis to full cosmological hydrodynamical simulations, quantifying how each feature affects the gas density as a function of distance from the halo centre. Across all simulations and redshifts, the total halo mass and the gas mass of the central galaxy are the most strongly tied to the halo gas distribution, while stellar and BH properties are generally less informative. The exact relative importance of the different features depends on the feedback scenario and redshift. Our framework can be readily embedded in semi-analytic models of galaxy formation to incorporate halo gas density profiles consistent with different hydrodynamical simulations. Our work also provides a proof of concept for constraining feedback models with future observations of galaxy properties and of the surrounding gas distribution.",
      "pdf_url": "https://arxiv.org/pdf/2512.09021.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11032",
      "title": "Impact of in-situ nuclear networks and atomic opacities on neutron star merger ejecta dynamics, nucleosynthesis, and kilonovae",
      "authors": [
        "Fabio Magistrelli",
        "Sebastiano Bernuzzi",
        "Albino Perego",
        "Maximilian Jacobi",
        "Christopher J. Fontes"
      ],
      "abstract": "Impact of in-situ nuclear networks and atomic opacities on neutron star merger ejecta dynamics, nucleosynthesis, and kilonovae Fabio Magistrelli, Sebastiano Bernuzzi, Albino Perego, Maximilian Jacobi, Christopher J. Fontes High Energy Astrophysical Phenomena (astro-ph.HE) Modeling binary neutron star merger (BNSM) ejecta evolution requires simulations involving hydrodynamics, nuclear reactions, and radiative processes. The impact of nuclear burning and atomic opacity is poorly understood and often treated with simplified prescriptions. We systematically investigate different treatments of nuclear heating, thermalization, and opacities in radiation-hydrodynamics simulations of BNSM ejecta and kilonova light curves. Ejecta from long-term numerical-relativity simulations are evolved to ~30 days using a 2D ray-by-ray approach. We compare simplified heating-rates, thermalization prescriptions, and gray opacities with in-situ nuclear networks (NN) that track energy deposition, and include a composition-dependent thermalization scheme and frequency-dependent, atomic-physics-based opacities. Coupling NN and hydrodynamics affects nucleosynthesis and kilonova emission. Assuming homologous expansion alters the abundance evolution and produces a narrower second $r$-process peak and a third peak shifted to higher mass numbers. Nuclear heating back-reaction delays and reddens the early emission. A constant thermalization underestimates the early luminosity and overestimates the late emission. Analytical opacities yield dimmer and redder kilonovae at early times ($t\\lesssim$ hour) and a prolonged emission at $t\\gtrsim5$ days. Resolving the first hundreds of milliseconds of hydrodynamics is essential for robust nucleosynthesis calculations, and composition-dependent thermalization and frequency-dependent, atomic opacities are needed to accurately capture the ejecta temperature and kilonova brightness and color evolution. Analytic nuclear-power fits with simplified thermalization and opacities can reproduce the density and temperature evolution of the ejecta. [Abridged].",
      "pdf_url": "https://arxiv.org/pdf/2512.11032.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11058",
      "title": "Globular Clusters GMRT Pulsar Search (GCGPS) II: Discovery of five MSPs in M69 and M70",
      "authors": [
        "Jyotirmoy Das , Jayanta Roy , Paulo C. C. Freire , Scott M Ransom , Bhaswati Bhattacharyya , Karel Adámek , Wes Armour , Sanjay Kudale , Mekhala V. Muley National Center for Radio Astrophysics , Pune, India, Max-Planck-Institut für Radioastronomie , Bonn, Germany, National Radio Astronomy Observatory , Charlottesville, Virginia, United States, Department of Physics, Silesian University in Opava, Opava, 74601, Czech Republic, Oxford e-Research Center , Oxford, United Kingdom, Giant Metrewave Radio Telescope , Pune, India)"
      ],
      "abstract": "Globular Clusters GMRT Pulsar Search (GCGPS) II: Discovery of five MSPs in M69 and M70 Jyotirmoy Das (1), Jayanta Roy (1), Paulo C. C. Freire (2), Scott M Ransom (3), Bhaswati Bhattacharyya (1), Karel Adámek (4), Wes Armour (5), Sanjay Kudale (1 and 6), Mekhala V. Muley (6) ((1) National Center for Radio Astrophysics (NCRA), Pune, India, (2) Max-Planck-Institut für Radioastronomie (MPIfR), Bonn, Germany, (3) National Radio Astronomy Observatory (NRAO), Charlottesville, Virginia, United States, (4) Department of Physics, Silesian University in Opava, Opava, 74601, Czech Republic, (5) Oxford e-Research Center (OeRC), Oxford, United Kingdom, (6) Giant Metrewave Radio Telescope (GMRT), Pune, India) 13 pages, 2 tables, and 7 figures; Submitted to Astrophysical Journal (ApJ) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) This paper reports recent discoveries from the Globular Clusters GMRT Pulsar Search (GCGPS) survey, which aims to uncover pulsars in the globular clusters (GCs) of the Milky Way using the upgraded Giant Metrewave Radio Telescope (uGMRT). Utilising the Band-4 (550$-$750 MHz) and Band-3 (300$-$500 MHz) receivers, the survey targets GCs accessible to uGMRT ($-53^\\circ\\,<\\,\\delta\\,<\\,-17^\\circ$), excluding the declination range that can be covered by the Five-hundred-meter Aperture Spherical radio Telescope (FAST). The survey focuses on GCs that have not previously been searched with comparable sensitivity in these radio frequencies. In this paper, we present the discovery of the five MSPs in two GCs, $-$ NGC~6637 (M69) and NGC~6681 (M70), each hosting MSPs identified here for the first time. Observations of M69 led to the discovery of two MSPs: J1831$-$3220A (M69A) and J1831$-$3220B (M69B), both of which we localize with arcsecond precision using interferometric imaging. Observations of M70 resulted in three new MSPs: J1843$-$3217A (M70A), J1843$-$3217B (M70B), and J1843$-$3217C (M70C). Although direct imaging did not yield precise localizations for these MSPs, we provide initial estimates based on uGMRT beam forming and imaging analysis. Additionally, we present preliminary imaging results for other observed GCs, and in cases of non-detections, we report upper limits on pulsed emission based on the rms noise levels in the image plane.",
      "pdf_url": "https://arxiv.org/pdf/2512.11058.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11266",
      "title": "Probable Quasi-Periodic Oscillations in the {\\tt TESS} observations of blazars in the Swift X-ray Survey",
      "authors": [
        "Ashutosh Tripathi",
        "Paul J. Wiita",
        "Krista Lynne Smith"
      ],
      "abstract": "Probable Quasi-Periodic Oscillations in the {\\tt TESS} observations of blazars in the Swift X-ray Survey Ashutosh Tripathi, Paul J. Wiita, Krista Lynne Smith Accepted to Monthly Notices of Royal Astronomical Society, 12 pages, 6 figures High Energy Astrophysical Phenomena (astro-ph.HE) This work presents possible quasi-periodic oscillations in the Transiting Exoplanet Survey Satellite observations of blazars that are in the 157-month hard X-ray survey done by Swift's Burst Alert Telescope. We report observations from four sources, J1104.4+3812, J1654.0+3946, J0353.4-6830, and J1941.3-6216, that show at least 3$\\sigma$ local significance in generalized Lomb-Scargle periodogram and weighted wavelet Z-transform methods. These results are also checked using a continuous autoregressive moving average analysis that also predicts the absent data tentatively using stochastic differential equations. Each of these four sources exhibits a nominal QPO signal frequency in the range of 0.5--1.1 d$^{-1}$, resulting in at least 5 putative cycles. However, when the number of frequencies examined and the number of sources examined are both taken into account, the global significances are reduced to $\\approx2.2\\sigma$ for J1654.0+3964 (Mrk 501), and to $\\approx1.9\\sigma$ for other sources. These QPOs are thought to arise from the processes within the relativistic jet. Plausible explanations include the kink instability, which arises due to current-driven instabilities in the plasma or the precession of substructures, or mini-jets, within the jets.",
      "pdf_url": "https://arxiv.org/pdf/2512.11266.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11283",
      "title": "The energy structure function of fast radio bursts supports a stochastic origin model",
      "authors": [
        "Yi-Nan Chen",
        "Yong-Kun Zhang",
        "Zi-Gao Dai"
      ],
      "abstract": "The energy structure function of fast radio bursts supports a stochastic origin model Yi-Nan Chen, Yong-Kun Zhang, Zi-Gao Dai Total of 11 pages, 10 figures, accepted by MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) The origin of fast radio bursts (FRBs) has remained a mystery up to now. There are two kinds of process invoking neutron stars as an origin of FRBs, namely inner-driven starquakes and outer-driven collisions with interstellar objects (ISOs). The former origin should exhibit an earthquake-like statistical behavior while the latter should show a stochastic process. In this paper, we introduce a new statistical method by making use of the energy structure function of active repeating FRBs and earthquakes. We find that the energy structure function of FRBs exhibits a very different statistical behavior compared to that of earthquakes. On small time-interval scales, the energy of an earthquake show a tendency to decay with time-interval and the energy difference of a pair of events increases with time-interval. Such a behavior is not found in FRBs, whose energy function is very similar to those of a stochastic process. Our result shows that repeating FRBs may have an origin process differing from that of earthquakes, i.e., FRBs arise from a series of unrelated events such as collisions of a neutron star with ISOs.",
      "pdf_url": "https://arxiv.org/pdf/2512.11283.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11404",
      "title": "Impacts of hydrogen envelope on supernova fallback and the resulting compact remnant masses",
      "authors": [
        "Kengo Shinoda",
        "Yudai Suwa",
        "Ryosuke Hirai",
        "Ryo Sawada",
        "Kengo Tomida",
        "Kazunari Iwasaki",
        "Takeru K. Suzuki"
      ],
      "abstract": "Impacts of hydrogen envelope on supernova fallback and the resulting compact remnant masses Kengo Shinoda, Yudai Suwa, Ryosuke Hirai, Ryo Sawada, Kengo Tomida, Kazunari Iwasaki, Takeru K. Suzuki 11 pages, 11 figures, 1 table; submitted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Fallback in core-collapse supernovae plays a central role in setting compact-remnant masses and may produce late-time emission. In hydrogen rich progenitors, the reverse shock arising at the hydrogen-helium interface has the potential to dramatically enhance fallback, yet its overall impact across a broad explosion-energy range has not been systematically quantified. Using one-dimensional hydrodynamic simulations for metal-poor progenitors with $M_{\\rm ZAMS}=18$-$28\\,M_\\odot$ and models with and without hydrogen envelopes, we explore fallback over explosion energies of $10^{48}$-$10^{52}\\,{\\rm erg}$. We find a robust and universal mass-transition behaviour: when the explosion energy reaches only $2$-$3$ times the binding energy of the hydrogen envelope, the reverse shock returns to the centre and sharply increases the remnant mass by $\\gtrsim 2\\,M_\\odot$. Above this threshold, the reverse shock escapes and hydrogen-rich and stripped-envelope progenitors yield nearly identical remnant masses. By normalizing the results with the envelope binding energy, we show that all progenitor models converge to a common fallback relation. We further provide a simple analytic prescription that connects explosion energy, hydrogen-envelope binding energy, and final compact-remnant mass. This relation provides an important link between progenitor properties and compact-remnant masses, and is useful for population-synthesis and galactic chemical-evolution studies.",
      "pdf_url": "https://arxiv.org/pdf/2512.11404.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11425",
      "title": "Measurement of the cosmic ray nickel energy spectrum from 10 GeV/n to 2 TeV/n with the DAMPE",
      "authors": [
        "F. Alemanno",
        "Q. An",
        "P. Azzarello",
        "F. C. T. Barbato",
        "P. Bernardini",
        "X. J. Bi",
        "H. V. Boutin",
        "I. Cagnoli",
        "M. S. Cai",
        "E. Casilli",
        "J. Chang",
        "D. Y. Chen",
        "J. L. Chen",
        "Z. F. Chen",
        "Z. X. Chen",
        "P. Coppin",
        "M. Y. Cui",
        "T. S. Cui",
        "I. De Mitri",
        "F. de Palma",
        "A. Di Giovanni",
        "T. K. Dong",
        "Z. X. Dong",
        "G. Donvito",
        "J. L. Duan",
        "K. K. Duan",
        "R. R. Fan",
        "Y. Z. Fan",
        "F. Fang",
        "K. Fang",
        "C. Q. Feng",
        "L. Feng",
        "S. Fogliacco",
        "J. M. Frieden",
        "P. Fusco",
        "M. Gao",
        "F. Gargano",
        "E. Ghose",
        "K. Gong",
        "Y. Z. Gong",
        "D. Y. Guo",
        "J. H. Guo",
        "S. X. Han",
        "Y. M. Hu",
        "G. S. Huang",
        "X. Y. Huang",
        "Y. Y. Huang",
        "M. Ionica",
        "L. Y. Jiang",
        "W. Jiang",
        "Y. Z. Jiang",
        "J. Kong",
        "A. Kotenko",
        "D. Kyratzis",
        "S. J. Lei",
        "B. Li",
        "M. B. Li",
        "W. L. Li",
        "W. H. Li",
        "X. Li",
        "X. Q. Li",
        "Y. M. Liang",
        "C. M. Liu",
        "H. Liu",
        "J. Liu",
        "S. B. Liu",
        "Y. Liu",
        "F. Loparco",
        "M. Ma",
        "P. X. Ma",
        "T. Ma",
        "X. Y. Ma",
        "G. Marsella",
        "M. N. Mazziotta",
        "D. Mo",
        "Y. Nie",
        "X. Y. Niu",
        "A. Parenti",
        "W. X. Peng",
        "X. Y. Peng",
        "C. Perrina",
        "E. Putti Garcia",
        "R. Qiao",
        "J. N. Rao",
        "Y. Rong",
        "A. Serpolla",
        "R. Sarkar",
        "P. Savina",
        "Z. Shangguan",
        "W. H. Shen",
        "Z. Q. Shen",
        "Z. T. Shen",
        "L. Silveri",
        "J. X. Song",
        "H. Su",
        "M. Su",
        "H. R. Sun",
        "Z. Y. Sun",
        "A. Surdo",
        "X. J. Teng"
      ],
      "abstract": "Measurement of the cosmic ray nickel energy spectrum from 10 GeV/n to 2 TeV/n with the DAMPE F. Alemanno, Q. An, P. Azzarello, F. C. T. Barbato, P. Bernardini, X. J. Bi, H. V. Boutin, I. Cagnoli, M. S. Cai, E. Casilli, J. Chang, D. Y. Chen, J. L. Chen, Z. F. Chen, Z. X. Chen, P. Coppin, M. Y. Cui, T. S. Cui, I. De Mitri, F. de Palma, A. Di Giovanni, T. K. Dong, Z. X. Dong, G. Donvito, J. L. Duan, K. K. Duan, R. R. Fan, Y. Z. Fan, F. Fang, K. Fang, C. Q. Feng, L. Feng, S. Fogliacco, J. M. Frieden, P. Fusco, M. Gao, F. Gargano, E. Ghose, K. Gong, Y. Z. Gong, D. Y. Guo, J. H. Guo, S. X. Han, Y. M. Hu, G. S. Huang, X. Y. Huang, Y. Y. Huang, M. Ionica, L. Y. Jiang, W. Jiang, Y. Z. Jiang, J. Kong, A. Kotenko, D. Kyratzis, S. J. Lei, B. Li, M. B. Li, W. L. Li, W. H. Li, X. Li, X. Q. Li, Y. M. Liang, C. M. Liu, H. Liu, J. Liu, S. B. Liu, Y. Liu, F. Loparco, M. Ma, P. X. Ma, T. Ma, X. Y. Ma, G. Marsella, M. N. Mazziotta, D. Mo, Y. Nie, X. Y. Niu, A. Parenti, W. X. Peng, X. Y. Peng, C. Perrina, E. Putti Garcia, R. Qiao, J. N. Rao, Y. Rong, A. Serpolla, R. Sarkar, P. Savina, Z. Shangguan, W. H. Shen, Z. Q. Shen, Z. T. Shen, L. Silveri, J. X. Song, H. Su, M. Su, H. R. Sun, Z. Y. Sun, A. Surdo, X. J. Teng High Energy Astrophysical Phenomena (astro-ph.HE) Nickel, one of the most stable elements alongside iron, is the most abundant heavy element beyond iron in cosmic rays. With DAMPE's excellent charge resolution and broad energy range, a high-precision energy spectrum provides valuable insights into the acceleration sources of heavy nuclei and their propagation through the interstellar medium. In this analysis, we report the direct measurement of cosmic-ray nickel spectrum from 10 GeV/n to 2 TeV/n with nine years of flight data. The nickel spectrum is consistent with a single power law with spectral index -2.60 +/- 0.03 from 40 GeV/n to 1 TeV/n. This work provides an accurate measurement of differential flux of nickel with kinetic energy extending to TeV/n for the first time.",
      "pdf_url": "https://arxiv.org/pdf/2512.11425.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11488",
      "title": "The Polarized X-ray Universe: Insights and Discoveries",
      "authors": [
        "Arbind Pradhan",
        "Sree Bhattacherjee",
        "Biplob Sarkar"
      ],
      "abstract": "The Polarized X-ray Universe: Insights and Discoveries Arbind Pradhan, Sree Bhattacherjee, Biplob Sarkar 11 pages, 0 figure, The manuscript will appear as a book chapter in the forthcoming book entitled \"Advances in Physical Sciences: Theories, Applications, and Innovations High Energy Astrophysical Phenomena (astro-ph.HE) Polarization is one of the fundamental natures of electromagnetic radiation. The detection of polarization or polarized photons from distant X-ray radiating systems (such as X-ray binaries (XBs), active galactic nuclei (AGN), pulsars, and stars) complements the timing, spectral, and imagining analysis to better understand the physical mechanisms taking place in these sources. Polarization has enhanced the understanding of the internal geometry of these systems and their vicinity. Polarized X-rays can be generated either directly through non-thermal physical processes in the presence of a magnetic field(B) or through the scattering of unpolarized thermal radiation within plasma structures such as an accretion disk. X-ray polarization can measure the two important independent parameters, the polarization degree (PD) and polarization angle (PA) of the X-ray photons. These parameters are crucial as they reveal the characteristics of particles in such a strong magnetic and gravitational field. In this chapter, we have discussed (i) the basic idea of polarization, (ii) some distant sources radiating polarized X-ray photons, (iii) missions dedicated to observing polarized X-ray photons, and (iv) recent breakthroughs and upcoming missions.",
      "pdf_url": "https://arxiv.org/pdf/2512.11488.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11572",
      "title": "JWST and HST observations of the host galaxy and supernova, SN 2024aihh in EP240801a at z=1.67",
      "authors": [
        "Agnes P.C. van Hoof",
        "Andrew J. Levan",
        "Peter G. Jonker",
        "Morgan Fraser",
        "Luca Izzo",
        "Andrew S. Fruchter",
        "Joyce N. D. van Dalen",
        "Nial R. Tanvir",
        "Jens Hjorth",
        "Antonio Martin-Carrillo",
        "Nikhil Sarin",
        "Laura C. Cotter",
        "Jonathan A. Quirola-Vásquez",
        "Maria E. Ravasio",
        "Javi Sánchez-Sierras",
        "Manuel A. P. Torres",
        "Shuai-Qing Jiang",
        "Dong Xu"
      ],
      "abstract": "JWST and HST observations of the host galaxy and supernova, SN 2024aihh in EP240801a at z=1.67 Agnes P.C. van Hoof, Andrew J. Levan, Peter G. Jonker, Morgan Fraser, Luca Izzo, Andrew S. Fruchter, Joyce N. D. van Dalen, Nial R. Tanvir, Jens Hjorth, Antonio Martin-Carrillo, Nikhil Sarin, Laura C. Cotter, Jonathan A. Quirola-Vásquez, Maria E. Ravasio, Javi Sánchez-Sierras, Manuel A. P. Torres, Shuai-Qing Jiang, Dong Xu 18 pages, 7 figures and 3 tables. Version accepted by ApJL High Energy Astrophysical Phenomena (astro-ph.HE) We present James Webb Space Telescope (JWST) and Hubble Space Telescope (HST) observations of the counterpart of EP240801a, at z=1.67, the first fast X-ray transient (FXT) identified as an X-ray flash (XRF) by the Einstein Probe (EP) and Fermi-GBM. Our observations reveal strong photometric and spectroscopic evidence for an associated broad-lined Type Ic supernova (SN) SN 2024aihh, the most distant spectroscopically identified gamma ray-burst (GRB)-SN to date. The SN exhibits similar luminosity and light curve evolution to the proto-type GRB-SN 1998bw with an absolute magnitude of the SN at $\\sim$23 days rest-frame of $M_{F140W} \\approx$-19 mag. The SN is located in a host galaxy with complex morphology at a large ($\\sim$6 kpc) offset in a region of relatively low surface brightness. The region around the SN has a modest star formation rate and is dominated by an intermediate mass-weighted age (1.4$\\pm$0.3 Gyr) population, despite the apparent presence of a young, massive broad-lined Type Ic SN progenitor. These observations demonstrate that observations with HST and JWST can greatly extend the redshift range over which the GRB/FXT-SN connection can be studied, including in relatively low luminosity, X-ray rich events. They demonstrate little apparent evolution in the SN properties from local examples despite EP240801a originating from an epoch 10 Gyr ago.",
      "pdf_url": "https://arxiv.org/pdf/2512.11572.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11028",
      "title": "Chemical composition and enrichment of the Centaurus cluster core seen by XRISM/Resolve",
      "authors": [
        "F. Mernier",
        "K. Fukushima",
        "A. Simionescu",
        "M. Kondo",
        "A. Majumder",
        "T. Plšek",
        "N. Werner",
        "Y. Fujita",
        "K. Sato",
        "K. Matsushita",
        "M. Loewenstein",
        "R. Mushotzky",
        "J.-P. Breuer",
        "R. Fujimoto",
        "Y. Fukazawa",
        "I. Hatsukade",
        "K. Nakazawa",
        "M. Urata",
        "N. Yamasaki"
      ],
      "abstract": "Chemical composition and enrichment of the Centaurus cluster core seen by XRISM/Resolve F. Mernier, K. Fukushima, A. Simionescu, M. Kondo, A. Majumder, T. Plšek, N. Werner, Y. Fujita, K. Sato, K. Matsushita, M. Loewenstein, R. Mushotzky, J.-P. Breuer, R. Fujimoto, Y. Fukazawa, I. Hatsukade, K. Nakazawa, M. Urata, N. Yamasaki 24 pages, 12 figures. Accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Hot, X-ray emitting atmospheres pervading galaxy clusters are rich in metals, which have been synthesised and released by asymptotic giant branch (AGB) stars, core-collapse supernovae (SNcc) and Type Ia supernovae (SNIa) over cosmic history. This makes the intracluster medium (ICM) an ideal astrophysical system to constrain its chemical composition, hence ultimately understand metal production and enrichment on megaparsec scales. In this work, we take advantage of the unprecedented ~5 eV resolution offered by XRISM/Resolve to measure the chemical composition of the core of the bright, nearby, and metal-rich Centaurus cluster (287 ks) with unprecedented accuracy. We use these measurements to provide constraints on the stellar populations having enriched the cluster core. We derived the Fe abundance and its relative Si/Fe, S/Fe, Ar/Fe, Ca/Fe, Cr/Fe, Mn/Fe, and Ni/Fe ratios. We completed this high-resolution view with N/Fe, O/Fe, Ne/Fe, and Mg/Fe ratios obtained with XMM-Newton/RGS archival data. Similarly to the core of Perseus, we find that nine out of our 11 measured abundance ratios are formally consistent with the chemical composition of our Solar System. However, the (super-solar) N/Fe and (half-solar) Mg/Fe ratios significantly differ from Perseus and/or other systems, thus provide tension with the picture of a fully solar composition ubiquitous to all systems. In addition, possible uncertainties in O/Fe and Ne/Fe with atomic codes highlight the need for studying more systems at high spectral resolution to assess (or rule out) the universality of the ICM composition in clusters' cool cores. Combinations of (AGB+)SNcc+SNIa yield models can reproduce our observed X/Fe ratios in all cases. However, whether two distinct populations of SNIa are needed depends on the weight of our RGS measurements. We also briefly discuss the possibility of a multi-metallicity gas phase in this respect.",
      "pdf_url": "https://arxiv.org/pdf/2512.11028.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11062",
      "title": "Effects of Varied Cosmic Ray Feedback from AGN on Massive Galaxy Properties",
      "authors": [
        "Charvi Goyal",
        "Sam B. Ponnada",
        "Philip F. Hopkins",
        "Sarah Wellons",
        "Jose A. Benavides",
        "Kung-Yi Su"
      ],
      "abstract": "Effects of Varied Cosmic Ray Feedback from AGN on Massive Galaxy Properties Charvi Goyal, Sam B. Ponnada, Philip F. Hopkins, Sarah Wellons, Jose A. Benavides, Kung-Yi Su 12 pages, 5 figures, 1 table, submitted to PASP. Comments and questions are welcome! Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Active galactic nuclei (AGN) provide energetic feedback necessary to `turn off' star formation in high-mass galaxies (M$_{\\rm halo} \\geq $ 10$^{12.5}$ M$_{\\odot}$, $10.4 \\leq \\log(\\frac{M_*}{M_\\odot}) \\leq 11$) as observed. Cosmic rays (CRs) have been proposed as a promising channel of AGN feedback, but the nature of CR feedback from AGN remains uncertain. We analyze a set of high-resolution simulations of massive galaxies from the Feedback in Realistic Environments (FIRE-3) project including multi-channel AGN feedback, explicitly evolving kinetic/mechanical, radiative, and spectrally-resolved CRs from the central black hole. Specifically, we explore different CR feedback and transport assumptions, calibrated to Milky Way local ISM constraints, and compare them to observed galaxy scaling relations. We find that all parameterizations explored self-regulate within agreement with observed galaxy scaling relations, demonstrating that CR injection efficiencies varied by $\\sim$1.5 dex and locally-variable transport produce quenched galaxies with reasonable bulk properties; however, they feature orders-of-magnitude variant circumgalactic medium (CGM) gas properties. Our results indicate that multi-wavelength synthetic observations probing these varied halo properties from larger simulated samples in conjunction with observational comparisons may place novel constraints on how AGN physically quench star formation in massive galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2512.11062.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11103",
      "title": "The Crab Nebula Revisited Using HST/WFC3",
      "authors": [
        "William P. Blair",
        "Ravi Sankrit",
        "Dan Milisavljevic",
        "Tea Temim",
        "J. Martin Laming",
        "Patrick Slane",
        "Ziwei Ding",
        "Thomas Martin"
      ],
      "abstract": "The Crab Nebula Revisited Using HST/WFC3 William P. Blair, Ravi Sankrit, Dan Milisavljevic, Tea Temim, J. Martin Laming, Patrick Slane, Ziwei Ding, Thomas Martin 34 pages, 30 figures, one Appendix; accepted Dec. 8, 2025, for The Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) It has been over 24 years since the iconic Crab Nebula has been visited by the high spatial resolution eye of the Hubble Space Telescope. The expanding nebula is dynamic on these timescales, with many of the outer filaments of the nebula known to show proper motions of 0.3'' or more per year. Over time, it has become increasingly difficult to compare the fine scale structure of the nebula with recent data at other wavelengths. We have re-observed the Crab in an HST Cycle 31 program using the WFC3 camera and filters similar to those previously used to make the existing mosaic that dates from 1999-2000 and was obtained with the WFPC2 camera. Two central fields were observed with the F487N filter, providing an uncontaminated hydrogen band for comparison. We also observed two primarily continuum band filters (F547M and F763M), allowing us to study the optical synchrotron nebula component of the Crab's emission. We compare these new data to the first epoch of WFPC2 data as well as to more contemporaneous NIR/MIR imagery from JWST. Finally, we highlight two previously unrecognized groupings of filaments with similar emission characteristics that are nearly diametrically opposed from the pulsar but whose origin remains uncertain.",
      "pdf_url": "https://arxiv.org/pdf/2512.11103.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.11144",
      "title": "Asteroid Occultations with VERITAS: Observations and Considerations",
      "authors": [
        "Joshua Bartkoske",
        "Anne Duerr",
        "Dave Kieda"
      ],
      "abstract": "Asteroid Occultations with VERITAS: Observations and Considerations Joshua Bartkoske (for the VERITAS Collaboration), Anne Duerr, Dave Kieda Presented at the 39th International Cosmic Ray Conference (ICRC 2025). 9 pages, 3 figures Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Occultations, the covering up of one celestial body by another celestial body, have been used in astronomy for millennia to learn about the sun and moon. Since 2018, VERITAS has implemented a program to detect predicted asteroid occultations, where an asteroid covers up a star. VERITAS has attempted to observe over 100 occultations to date and successfully observed 20 occultations. With these occultations, VERITAS can directly measure the smallest angular diameters of any instrument or technique in the optical for stars between magnitude 9 and 13. Each angular diameter is measured by fitting the diffraction pattern observed by the central VERITAS pixel at the start and end of an occultation. Once a planned FADC upgrade is complete, VERITAS will begin a program to search for serendipitous occultations within its full field of view (3 deg). Serendipitous occultations of sub-km trans-Neptunian objects (TNOs) have the potential to constrain models of solar system formation. This work details how VERITAS predicts and observes occultations as well as the overall status of the asteroid occultation program and future steps for observing occultations of both asteroids and TNOs.",
      "pdf_url": "https://arxiv.org/pdf/2512.11144.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11162",
      "title": "Classifying High-Energy Celestial Objects with Machine Learning Methods",
      "authors": [
        "Alexis Mathis",
        "Daniel Yu",
        "Nolan Faught",
        "Tyrian Hobbs."
      ],
      "abstract": "Classifying High-Energy Celestial Objects with Machine Learning Methods Alexis Mathis, Daniel Yu, Nolan Faught, Tyrian Hobbs. (Northeastern University) Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); Machine Learning (stat.ML) Machine learning is a field that has been growing in importance since the early 2010s due to the increasing accuracy of classification models and hardware advances that have enabled faster training on large datasets. In the field of astronomy, tree-based models and simple neural networks have recently garnered attention as a means of classifying celestial objects based on photometric data. We apply common tree-based models to assess performance of these models for discriminating objects with similar photometric signals, pulsars and black holes. We also train a RNN on a downsampled and normalized version of the raw signal data to examine its potential as a model capable of object discrimination and classification in real-time.",
      "pdf_url": "https://arxiv.org/pdf/2512.11162.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "stat.ML"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11447",
      "title": "The hydrogen-free circumstellar interaction in the Type Ib supernova 2021efd: A clue to the mechanism of the helium-layer stripping",
      "authors": [
        "N. Pyykkinen",
        "T. Nagao",
        "H. Kuncarayakti",
        "M.D. Stritzinger",
        "T. Kangas",
        "K. Maeda",
        "P. Chen",
        "J. Sollerman",
        "C. Burns",
        "S. Bose",
        "G. Folatelli",
        "L. Ferrari",
        "N. Morrell",
        "A. Reguitti",
        "I. Salmaso",
        "S. Mattila",
        "A. Gal-Yam",
        "C. Fremling",
        "S. Anand",
        "M. Kasliwal",
        "C.P. Gutiérrez",
        "L. Galbany",
        "W. Hoogendam",
        "S. Schulze",
        "C. Ashall",
        "K. Medler",
        "C.M. Pfeffer",
        "P. Lundqvist",
        "B. Rusholme",
        "J. Adler"
      ],
      "abstract": "The hydrogen-free circumstellar interaction in the Type Ib supernova 2021efd: A clue to the mechanism of the helium-layer stripping N. Pyykkinen, T. Nagao, H. Kuncarayakti, M.D. Stritzinger, T. Kangas, K. Maeda, P. Chen, J. Sollerman, C. Burns, S. Bose, G. Folatelli, L. Ferrari, N. Morrell, A. Reguitti, I. Salmaso, S. Mattila, A. Gal-Yam, C. Fremling, S. Anand, M. Kasliwal, C.P. Gutiérrez, L. Galbany, W. Hoogendam, S. Schulze, C. Ashall, K. Medler, C.M. Pfeffer, P. Lundqvist, B. Rusholme, J. Adler Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Stripped-envelope supernovae (SESNe), including Type IIb, Ib, and Ic supernovae (SNe), originate from the explosions of massive stars whose outer envelopes have been largely removed during their lifetimes. The main stripping mechanism for the hydrogen (H) envelope in the progenitors of SESNe is often considered to be interaction with a binary companion, while that for the helium (He) layer is unclear. We conducted photometric and spectroscopic observations of the Type Ib SN 2021efd, which shows signs of interaction with H-free circumstellar material (CSM). Around 30 days after the r-band light curve (LC) peak, until at least ~ 770 days, its LCs display excessive luminosity compared to regular SESNe and at least three distinct peaks. The light curve evolution is similar to that of SN 2019tsf, whose previously unpublished spectrum at 400 days is also presented here. The nebular spectrum of SN 2021efd shows narrow emission lines (~ 1000 km/s) in various species. Our observations suggest that SN 2021efd is a Type Ib SN interacting with CSM with the following parameters: The estimated CSM mass, composition, and distribution are at least a few times 0.1 M_sun, H-free, and clumpy, respectively. Based on the estimated ejecta properties, we conclude that this event is a transitional SN whose progenitor was experiencing He-layer stripping at the epoch of the explosion, and was on the way to becoming a carbon-oxygen star from a He star. The estimated CSM properties suggest that the progenitor had some episodic mass ejections with a rate of ~ 0.001-0.01 M_sun/yr for the last decade and slightly smaller before this final phase at least from ~ 200 years before the explosion, for the assumed CSM velocity of 100 km/s. For the case of ~ 1000 km/s, the necessary mass-loss rate would be increased by a factor of ten, and the timescales decreased by a factor of ten.",
      "pdf_url": "https://arxiv.org/pdf/2512.11447.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2203.15624",
      "title": "Microphysics of diffusive shock acceleration: impact on the spectrum of accelerated particles",
      "authors": [
        "Pierre Cristofari",
        "Pasquale Blasi",
        "Damiano Caprioli"
      ],
      "abstract": "Microphysics of diffusive shock acceleration: impact on the spectrum of accelerated particles Pierre Cristofari, Pasquale Blasi, Damiano Caprioli 11 pages, 6 figures, accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Diffusive shock acceleration at collisionless shocks remains the most likely process for accelerating particles in a variety of astrophysical sources. While the standard prediction for strong shocks is that the spectrum of accelerated particles is universal, $f(p)\\propto p^{-4}$, numerous phenomena affect this simple conclusion. In general, the non-linear dynamical reaction of accelerated particles leads to a concave spectrum, steeper than $p^{-4}$ at momenta below a few tens of GeV/c and harder than the standard prediction at high energies. However, the non-linear effects become important in the presence of magnetic field amplification, which in turn leads to higher values of the maximum momentum $p_{max}$. It was recently discovered that the self-generated perturbations that enhance particle scattering, when advected downstream, move in the same direction as the background plasma, so that the effective compression factor at the shock decreases and the spectrum becomes steeper. We investigate the implications of the excitation of the non-resonant streaming instability on these spectral deformations, the dependence of the spectral steepening on the shock velocity and the role played by the injection momentum.",
      "pdf_url": "https://arxiv.org/pdf/2203.15624.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.03835",
      "title": "Neutrino quantum kinetics in three flavors",
      "authors": [
        "Shashank Shalgar",
        "Irene Tamborra"
      ],
      "abstract": "Neutrino quantum kinetics in three flavors Shashank Shalgar, Irene Tamborra 26 pages, including 12 figures and two appendices. Matches version accepted for publication in JCAP High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) The impact of neutrino flavor conversion on the supernova mechanism is yet to be fully understood. We present multi-energy and multi-angle solutions of the neutrino quantum kinetic equations in three flavors, without employing any attenuation term for the neutrino self-interaction strength and taking into account neutrino advection and non-forward collisions with the background medium. Flavor evolution is explored within a spherically symmetric shell surrounding the region of neutrino decoupling in the interior of a core-collapse supernova, relying on the output of a spherically symmetric core-collapse supernova model with a progenitor mass of $18.6 M_\\odot$. We select two representative post-bounce times: $t_{\\rm pb} = 0.25$ s (no angular crossings are present and flavor conversion is triggered by slow collective effects) and $t_{\\rm pb} = 1$ s (angular crossings trigger fast flavor instabilities). We find that flavor equipartition is achieved for the late post-bounce time ($t_{\\rm pb} = 1$ s), where the (anti)neutrino emission properties among different flavors tend to approach each other. In this case, $\\bar\\nu_e$ tends to $\\bar\\nu_x = (\\bar\\nu_\\mu + \\bar\\nu_\\tau)/2$ and a similar trend holds for neutrinos. However, flavor equipartition does not occur for our early post-bounce time ($t_{\\rm pb} = 0.25$ s). Accounting for weak-magnetism corrections, crossings in the $\\mu$ and $\\tau$ lepton number angular distributions arise; however, such crossings have a magnitude smaller than the one occurring in the electron sector and negligibly affect flavor evolution. Because of flavor conversion, the neutrino heating rate increases up to $30\\%$ with respect to the case where flavor conversion is neglected.",
      "pdf_url": "https://arxiv.org/pdf/2503.03835.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.06962",
      "title": "Patterns of X-ray and $γ$-ray Flares: from Blazar to Maganetar and Sun",
      "authors": [
        "Haiyun Zhang",
        "Dahai Yan",
        "Lijuan Dong",
        "Ping Zhang",
        "Ruijing Tang",
        "Jianeng Zhou",
        "Lian Tao",
        "Li Zhang",
        "Niansheng Tang"
      ],
      "abstract": "Patterns of X-ray and $γ$-ray Flares: from Blazar to Maganetar and Sun Haiyun Zhang, Dahai Yan, Lijuan Dong, Ping Zhang, Ruijing Tang, Jianeng Zhou, Lian Tao, Li Zhang, Niansheng Tang 12 pages, 7 figures, accepted by ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Using Gaussian process methods, we analyzed the light curves of three extreme solar X-ray flares observed by the RHESSI satellite. Their variability characteristics were then compared with those of HXMT-HE X-ray burst (XRB; in SGR 1935+2154) associated with fast radio burst (FRB) 200428 and blazar $\\gamma$-ray giant flares, to investigate the origins of these extreme flaring events. The variability patterns of the solar X-ray flares follow the stochastically driven damped simple harmonic oscillator (SHO) model. The derived timescales $t_{\\rm B\\underline{} steep}$ and $t_{\\rm B\\underline{~} flat}$ (corresponding to PSD breaks) are in the range of 4-7 s and 16-53 s, respectively. The FRB-associated HXMT-HE burst has a $Q$ value near 0.3, matching those of the solar flares occurred on 23 July 2002 (flare 1) and 3 November 2003 (flare 2). By contrast, blazar $\\gamma$-ray giant flares show $Q >$ 0.3, similar to the solar flare occurred on 25 February 2014 (flare 3). We proposed that the critically damped state of the system may be the condition triggering the association between the XRB in SGR 1935+2154 and the FRB. In this scenario, the critical damping $Q$ value of the system is around 0.3, not the theoretical 0.5. The similarity in $Q$ values might imply that the FRB-associated HXMT-HE XRB and solar X-ray flares 1 $\\&$ 2 share comparable dynamic behavior, while blazar $\\gamma$-ray flares and solar X-ray flare 3 exhibit another distinct but similar dynamic behavior. Like solar X-ray flares, these extreme flares may all be related to the magnetic reconnection process.",
      "pdf_url": "https://arxiv.org/pdf/2505.06962.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.16169",
      "title": "Constraining the Extragalactic Magnetic Field: Auger Data Meet UHECR Propagation Modeling",
      "authors": [
        "Ala'a AL-Zetoun",
        "Arjen van Vliet",
        "Andrew M. Taylor",
        "Walter Winter"
      ],
      "abstract": "Constraining the Extragalactic Magnetic Field: Auger Data Meet UHECR Propagation Modeling Ala'a AL-Zetoun, Arjen van Vliet, Andrew M. Taylor, Walter Winter High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Recent analyses from the Pierre Auger Collaboration suggest correlations between the arrival directions of Ultra-High-Energy Cosmic Rays (UHECRs) and catalogs of starburst galaxies (SGBs) and jetted active galactic nuclei (AGNs). We revisit these analyses using the same methodology as \\auger , but explicitly incorporating UHECR deflections in turbulent extragalactic magnetic fields (EGMFs). We demonstrate that while for SBGs the same sources as for the generic \\auger\\ analysis dominate the catalog correlations, jetted AGNs are dominated by Centaurus~A when accounting for source distances and deflections. Using our framework, we derive 90\\% confidence level upper limits on the local EGMF strength of 4.4~nG~Mpc$^{1/2}$ for SBGs and 6.7~nG~Mpc$^{1/2}$ for jetted AGNs. Assuming instead that the UHECR deflections predominantly arise from the Galactic magnetic field (GMF), we obtain a GMF upper limit of $1.4 \\, \\mu$G~kpc$^{1/2}$ for a Galactic halo size of 30~kpc.",
      "pdf_url": "https://arxiv.org/pdf/2506.16169.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.13248",
      "title": "Detection of low-luminosity X-ray pulsations from the accreting millisecond pulsar IGR J17511-3057: An ever-thinning thread between bright accretion and sub-luminous states",
      "authors": [
        "Giulia Illiano",
        "Alessandro Papitto",
        "Sergio Campana",
        "Alessio Marino",
        "Arianna Miraval Zanon",
        "Francesco Carotenuto",
        "Francesco Coti Zelati",
        "Maria Cristina Baglio",
        "Filippo Ambrosino",
        "Christian Malacaria",
        "Caterina Ballocco",
        "Gaurava K. Jaisawal",
        "Marco M. Messa",
        "Emilie Parent",
        "Thomas D. Russell",
        "Andrea Sanna",
        "Anastasios Tzioumis"
      ],
      "abstract": "Detection of low-luminosity X-ray pulsations from the accreting millisecond pulsar IGR J17511-3057: An ever-thinning thread between bright accretion and sub-luminous states Giulia Illiano, Alessandro Papitto, Sergio Campana, Alessio Marino, Arianna Miraval Zanon, Francesco Carotenuto, Francesco Coti Zelati, Maria Cristina Baglio, Filippo Ambrosino, Christian Malacaria, Caterina Ballocco, Gaurava K. Jaisawal, Marco M. Messa, Emilie Parent, Thomas D. Russell, Andrea Sanna, Anastasios Tzioumis Accepted for publication in Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) After nearly a decade in quiescence, the accreting millisecond pulsar IGR J17511$-$3057 displayed a new outburst on 2025 February 11, its third since discovery, following previous activity in 2009 and 2015. We report on an XMM-Newton Target of Opportunity observation performed on 2025 March 4, more than twenty days after the outburst onset. From the X-ray spectrum - well described by an absorbed Comptonization model - we estimated an unabsorbed 0.5$-$10 keV luminosity of $L_X \\sim 7 \\times 10^{33} \\, \\mathrm{erg \\, s^{-1}}$ (assuming a source distance equal to the upper limit of $6.9$ kpc). To place this in context, we analyzed an archival Chandra observation performed in 2019, which yielded a quiescent luminosity of $L_\\mathrm{X,q} \\sim 2 \\times 10^{32} \\, \\mathrm{erg \\, s^{-1}}$ in the same energy band. Although this comparison indicates that the source was still well above its quiescent level during the XMM-Newton observation, the estimated low luminosity during the late stage of the 2025 outburst would typically place the source in the propeller regime. Nevertheless, we unexpectedly detected coherent X-ray pulsations with an amplitude peaking at $\\sim$42% in the 0.3$-$3 keV band. We also observed a spectral softening compared to the early stages of the outburst. Finally, we report a 3$\\sigma$ upper limit of 60 $\\mu$Jy beam$^{-1}$ on the source flux density at 5.5 GHz from ATCA observations acquired on 2025 April 12, following a decline of the accretion activity, as indicated by our analysis of NICER data from 2025 March 15, which revealed no significant X-ray pulsations at a luminosity level of $L_X \\sim 1 \\times 10^{34} \\, \\mathrm{erg \\, s^{-1}}$. We discuss our findings in the context of other accreting millisecond pulsars and draw comparisons with transitional systems in the sub-luminous disk state.",
      "pdf_url": "https://arxiv.org/pdf/2507.13248.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05268",
      "title": "A Mass-Independent Damping Timescale in Black Hole Accretion Systems",
      "authors": [
        "Haoyang Zhang",
        "Shenbang Yang",
        "Li Zhang",
        "Benzhong Dai"
      ],
      "abstract": "A Mass-Independent Damping Timescale in Black Hole Accretion Systems Haoyang Zhang, Shenbang Yang, Li Zhang, Benzhong Dai High Energy Astrophysical Phenomena (astro-ph.HE) The scaling laws reveal the underlying structural similarities shared by astrophysical systems across vastly different scales. In black hole accretion systems, the scaling relations between the characteristic damping timescales (CDTs) of light curves and black hole mass offer valuable insights into the underlying physical structure of accretion disks. Here, we investigate the long-term hard X-ray CDTs of 106 black hole and neutron star accretion systems using light curves from the \\textit{Swift} Burst Alert Telescope 157-month catalog. Unexpectedly, for the first time, we discover a mass-independent CDT in these black hole accretion systems, in contrast to well-established scaling laws. This puzzling phenomenon can be attributed to conductive timescales arising from disk--corona interactions, instead of the intrinsic accretion disk processes characterized by scaling laws, and it may further modulate jet emission in blazars. This result demonstrates thermal conduction as a key mechanism driving hard X-ray variability and offers new observational evidence for the disk--corona--jet connection.",
      "pdf_url": "https://arxiv.org/pdf/2511.05268.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.02136",
      "title": "AT2022zod: An Unusual Tidal Disruption Event in an Elliptical Galaxy at Redshift 0.11",
      "authors": [
        "Kristen C. Dage",
        "Phelipe Darc",
        "Thallis Pessi",
        "Rupesh Durgesh",
        "Shravya Shenoy",
        "Lilianne Nakazono",
        "Celine Boehm",
        "Ana L. Chies-Santos",
        "Rafael S. de Souza",
        "Zsofia V. Kovacs-Stermeczky",
        "Arash Bahramian",
        "Bahar Bidaran",
        "Emille E. O. Ishida",
        "Alberto Krone-Martins",
        "Aarya A. Patil",
        "Reinaldo R. Rosa",
        "Andressa Wille",
        "Richard M. Plotkin",
        "Behzad Tahmasebzadeh"
      ],
      "abstract": "AT2022zod: An Unusual Tidal Disruption Event in an Elliptical Galaxy at Redshift 0.11 Kristen C. Dage, Phelipe Darc, Thallis Pessi, Rupesh Durgesh, Shravya Shenoy, Lilianne Nakazono, Celine Boehm, Ana L. Chies-Santos, Rafael S. de Souza, Zsofia V. Kovacs-Stermeczky, Arash Bahramian, Bahar Bidaran, Emille E. O. Ishida, Alberto Krone-Martins, Aarya A. Patil, Reinaldo R. Rosa, Andressa Wille, Richard M. Plotkin, Behzad Tahmasebzadeh (for the COIN collaboration) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Tidal Disruption Events (TDEs) have long been hypothesized as valuable indicators of black holes, offering insight into their demographics and behaviour out to high redshift. TDEs have also enabled the discovery of a few Massive Black Holes (MBHs) with inferred masses of $10^4$--$10^6\\,M_\\odot$, often associated with the nuclei of dwarf galaxies or ultra-compact dwarf galaxies (UCDs). Here we present AT2022zod, an extreme and short-lived optical flare in an elliptical galaxy at z=0.11, residing within 3kpc of the galaxy's centre. Its luminosity and ~30-day duration make it unlikely to have originated from the host galaxy's central supermassive black hole (SMBH), which estimate to have a mass around $10^8\\,M_\\odot$. Assuming that the emission mechanism is consistent with known observed TDEs, we find that such a rapidly evolving transient could either be produced by a MBH in the intermediate-mass range or, alternatively, result from the tidal disruption of a star on a non-parabolic orbit around the central SMBH. We suggest that the most plausible origin for AT2022zod is the tidal disruption of a star by a MBH embedded in a UCD. As the Vera C. Rubin Observatory's Legacy Survey of Space and Time comes online, we propose that AT2022zod serves as an important event for refining search strategies and characterization techniques for intermediate-mass black holes.",
      "pdf_url": "https://arxiv.org/pdf/2512.02136.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.10564",
      "title": "Wind-mediated Eddington-limited emission in a $10^{4}M_\\odot$ Black Hole Tidal Disruption Event",
      "authors": [
        "Paola Martire",
        "Elena Maria Rossi",
        "Nicholas Chamberlain Stone",
        "Elad Steinberg",
        "Konstantinos Kilmetis",
        "Itai Linial"
      ],
      "abstract": "Wind-mediated Eddington-limited emission in a $10^{4}M_\\odot$ Black Hole Tidal Disruption Event Paola Martire, Elena Maria Rossi, Nicholas Chamberlain Stone, Elad Steinberg, Konstantinos Kilmetis, Itai Linial High Energy Astrophysical Phenomena (astro-ph.HE) Observations of tidal disruption events (TDEs) have already produced tens of strong candidate flares, and their number will greatly increase with upcoming wide field surveys. Nevertheless, the origin of the measured luminosity peak at early times is still unknown, and the ultimate sources of energy dissipation in TDEs are not fully understood. Here we present the first three-dimensional end-to-end simulation of a TDE by a $10^{4}M_\\odot$ intermediate mass black hole (IMBH) with realistic parameters, run with the radiation-hydrodynamics code RICH. We find that the stellar debris fails to circularize efficiently, while a low-density, radiation-driven wind forms near pericenter and expands quasi-spherically. Radiation is advected by this outflow and released at the photosphere, which expands to radii of $\\approx10^{13}$ cm and reaches temperatures of ~few $10^{4}$K at the peak of the light curve. The resulting luminosity briefly exceeds the Eddington limit before settling near that value. We systematically test the numerical convergence of our simulation by running it at three resolutions. While the nozzle shock at pericenter may be under-resolved, we find that global results are qualitatively converged and, largely, quantitatively robust. The upcoming Vera Rubin Observatory's LSST (g and r band) and ULTRASAT (near UV) will be able to observe events like our simulated IMBH TDE up to redshifts of z$\\approx$0.1 and z$\\approx$0.06, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2512.10564.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.10986",
      "title": "Experimental investigation of O2 diffusion and entrapment in interstellar amorphous solid water (ASW)",
      "authors": [
        "Lina Coulaud",
        "Julia C. Santos",
        "Ko-Ju Chuang"
      ],
      "abstract": "Experimental investigation of O2 diffusion and entrapment in interstellar amorphous solid water (ASW) Lina Coulaud, Julia C. Santos, Ko-Ju Chuang 12 pages, 13 figures, submitted to Astronomy and Astrophysics Astrophysics of Galaxies (astro-ph.GA) Interstellar ices are mainly composed of amorphous solid water (ASW) containing small amounts of hypervolatiles, such as O2, whose diffusion-limited reactions play a key role in space chemistry. Although O2 is an important precursor molecule present during the early stages of ice formation, its surface diffusion in ASW remains poorly constrained. In this study, we experimentally investigate the surface diffusion and the entrapment efficiency of O2 in porous ASW under astrophysically relevant conditions. Experiments were conducted in an ultra-high vacuum chamber and monitored using infrared (IR) spectroscopy and quadrupole mass spectrometry. Diffusion coefficients were extracted through a novel approach applicable to IR-inactive molecules, by fitting the mass spectrometer signal during the isothermal phase with a Fickian model. These coefficients were then used to derive the diffusion energy barrier of O2 in ASW. Entrapment efficiencies were measured by analyzing the subsequent temperature-programmed desorption phase. We measured the surface diffusion coefficients at different temperatures (35 K, 40 K, 45 K) and water ice coverages (40 ML, 60 ML, 80 ML), yielding values on the order of 1E-16 to 1E-15 cm^2 s^-1. From these values, we derived a diffusion energy barrier of ED = 10 +/- 3 meV (116 +/- 35 K), corresponding to a chi ratio of about 0.1. Entrapment measurements revealed that a residual amount of about 20% of O2 remains trapped in the ASW matrix at the highest temperatures investigated. This work demonstrates that the surface diffusion of IR-inactive molecules can be experimentally quantified using mass spectrometry. Our findings show that O2 exhibits a low diffusion barrier, indicating high mobility in interstellar water ices. Moreover, we suggest these water ices likely retain a residual fraction of hypervolatiles entrapped within their structure.",
      "pdf_url": "https://arxiv.org/pdf/2512.10986.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11033",
      "title": "Dynamical disequilibrium in dwarf galaxies: rethinking gas dynamics, rotation curves, and dark matter inference",
      "authors": [
        "Diego Dado",
        "Kyle A. Oman",
        "Katherine E. Harborne",
        "Francesca Fragkoudi",
        "Joop Schaye",
        "Matthieu Schaller",
        "Alejandro Benítez-Llambay",
        "Evgenii Chaikin",
        "Carlos S. Frenk",
        "Filip Huško",
        "Sylvia Ploeckinger",
        "Alexander J. Richings"
      ],
      "abstract": "Dynamical disequilibrium in dwarf galaxies: rethinking gas dynamics, rotation curves, and dark matter inference Diego Dado (Durham-ICC), Kyle A. Oman (Durham-ICC), Katherine E. Harborne (Durham-ICC), Francesca Fragkoudi (Durham-ICC), Joop Schaye (Leiden Observatory), Matthieu Schaller (Leiden Observatory), Alejandro Benítez-Llambay (Milano-Bicocca), Evgenii Chaikin (Leiden Observatory), Carlos S. Frenk (Durham-ICC), Filip Huško (Leiden Observatory), Sylvia Ploeckinger (University of Vienna), Alexander J. Richings (University of Hull) Astrophysics of Galaxies (astro-ph.GA) We quantify departures from hydrodynamical and centrifugal equilibrium in the gas discs of low-mass ($10^{10.75}<M_\\mathrm{200c}/\\mathrm{M}_\\odot<10^{11}$) galaxies from the COLIBRE cosmological hydrodynamical simulations. We evaluate the full Eulerian acceleration balance in the midplane and show that disequilibrium is widespread: equilibrium-based circular velocity estimates typically have errors of $\\geq 10$ per cent ($\\approx 75$ per cent of midplane gas by mass). Disequilibrium is strongest and the largest associated errors occur in the inner few kiloparsecs that are crucial for constraining the dark matter density profile. Correcting the circular velocity to account for pressure and convective terms does not reliably improve its recovery in strongly perturbed systems where time-dependent forces dominate the residual acceleration budget. Stellar feedback, self-gravitating gas clumps and AGN energy injection account for most strong local perturbations, and large-scale gravitational asymmetries act as a scaffold for disequilibrium. We classify gas discs into coherent, perturbed, and slow/erratic rotators and show that this classification correlates with galaxy properties like mass, morphology and tracers of recent feedback. A majority of galaxies in our sample would be unsuitable for standard rotation curve analysis. Much of the observed diversity in the shapes of dwarf galaxy rotation curves may stem from non-equilibrium gas motions rather than diversity in mass profiles - resolving the discrepancy is then first and foremost a problem in gas dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2512.11033.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11035",
      "title": "The abundance of thin dwarf galaxies: a challenge for cosmological hydrodynamical simulations",
      "authors": [
        "José A. Benavides",
        "Laura V. Sales",
        "Julio F. Navarro",
        "Simon D. M. White",
        "Carlos S. Frenk",
        "Kyle A. Oman",
        "Shaun Cole"
      ],
      "abstract": "The abundance of thin dwarf galaxies: a challenge for cosmological hydrodynamical simulations José A. Benavides, Laura V. Sales, Julio F. Navarro, Simon D. M. White, Carlos S. Frenk, Kyle A. Oman, Shaun Cole Submitted to The Open Journal of Astrophysics; 15 pages, 13 figures Astrophysics of Galaxies (astro-ph.GA) We study the prevalence of thin galaxies as a function of stellar mass in the range $10^7<M_{\\star}/\\rm{M_\\odot}<10^{11}$ using data from the GAMA, DESI, ALFALFA and Nearby Galaxy catalogs. We use the distribution of projected axis ratios, $q$, to infer the abundance of intrinsically flat galaxies needed to reproduce the observed abundance of highly elongated systems in projection. We find that as many as $40\\%$ of galaxies in the mass range $10^9<M_{\\star}/\\rm{M_\\odot}<10^{10}$ are intrinsically flatter than $1$:$5$ (i.e., $c/a<0.2$), a fraction that rises to $\\sim 80\\%$ for $c/a<0.3$. Although the incidence of thin galaxies decreases towards lower and higher $M_{\\star}$, they are still quite common in dwarfs: $\\sim 30\\%$ and $\\sim 65\\%$ of $\\sim 10^8 ~ \\rm{M_\\odot}$ galaxies are inferred to be intrinsically flatter than $c/a=0.2$ and $0.3$, respectively. A comparison of these results with several state-of-the-art cosmological hydrodynamical simulations (TNG50, FIREbox, Romulus25) reveals a distinctive lack of thin simulated dwarfs. In particular, there are no $M_{\\star} < 10^9 ~ \\rm{M_{\\odot}}$ simulated galaxies flatter than $c/a=0.2$, in clear contrast with observational samples. This discrepancy likely reflects limitations in resolution and in the treatment of baryonic physics, suggesting that our understanding of the mechanisms regulating the formation of disk galaxies less massive than the Milky Way is still quite incomplete. Our results present a clear challenge to current numerical models of dwarf galaxy formation, which future models should attempt to meet.",
      "pdf_url": "https://arxiv.org/pdf/2512.11035.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11038",
      "title": "Intermediate Mass Black Hole Binary Evolution in Nuclear Star Clusters: the effect of the stellar mass black hole population",
      "authors": [
        "Fazeel Mahmood Khan",
        "Peter Berczik",
        "Margarita Sobolenko",
        "Andreas Just",
        "Rainer Spurzem",
        "Kelly Holley-Bockelmann",
        "Andrea Valerio Macciò"
      ],
      "abstract": "Intermediate Mass Black Hole Binary Evolution in Nuclear Star Clusters: the effect of the stellar mass black hole population Fazeel Mahmood Khan, Peter Berczik, Margarita Sobolenko, Andreas Just, Rainer Spurzem, Kelly Holley-Bockelmann, Andrea Valerio Macciò Accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) In this study, we investigate the dynamics of Intermediate-Mass Black Hole (IMBH) binaries within Nuclear Star Clusters (NSCs) that contain a population of stellar-mass black holes (BHs). We examine how these stellar and BH populations influence the dynamics of the IMBH binary and, in turn, how the evolving IMBH binary affects the surrounding stellar and BH populations. We conduct high-resolution $N$-body simulations of NSCs constructed based on observational parameters from two local dwarf galaxies: NGC205 and NGC404. For the first time, we achieve a star particle mass resolution of $1\\rm\\;M_{\\odot}$ and a BH mass resolution of $10\\rm\\;M_{\\odot}$. This level of resolution is crucial for accurately modeling the collisional dynamics of these dense systems. Including stellar-mass BHs within the stellar population significantly influences the IMBH binary dynamics, nearly doubling the sinking rate and halving the merger time. During the initial phase of the inspiral, the IMBH binary disrupts both the stellar and BH cusps. However, the BH cusp quickly regains its steep slope due to its shorter relaxation time and continues to dominate the evolution of the IMBH binary, despite being much less massive compared to the stellar component. We uncover an interesting mechanism in which BHs first efficiently extract energy from the IMBH binary and then transfer this energy to the surrounding stars, allowing the BHs to spiral back toward the center of the system and restart the process. Our results imply that, although stellar mass BHs are a minor component of a stellar population, they can significantly facilitate IMBH growth within NSCs via mergers. We also notice that these dense systems can potentially boost Intermediate Mass Ratio Inspirals (IMRIs) predominantly on radial orbits.",
      "pdf_url": "https://arxiv.org/pdf/2512.11038.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11042",
      "title": "MIRACLE III. JWST/MIRI expose the hidden role of the AGN outflow in NGC 1068",
      "authors": [
        "C. Marconcini",
        "A. Marconi",
        "M. Ceci",
        "A. Feltre",
        "M. Tartenas",
        "K. Zubovas",
        "I. Lamperti",
        "G. Cresci",
        "L. Ulivi",
        "F. Mannucci",
        "E. Bertola",
        "C. Bracci",
        "E. Cataldi",
        "Q. D'Amato",
        "J.A. Fernandez-Ontiveros",
        "J. Fritz",
        "E. Hatziminaoglou",
        "I. E. Lopez",
        "M. Ginolfi",
        "C. Gruppioni",
        "M. Mingozzi",
        "B. Moreschini",
        "G. Sabatini",
        "F. Salvestrini",
        "M. Scialpi",
        "G. Tozzi",
        "A. Vidal-Garcia",
        "C. Vignali",
        "G. Venturi",
        "M.V. Zanchettin"
      ],
      "abstract": "MIRACLE III. JWST/MIRI expose the hidden role of the AGN outflow in NGC 1068 C. Marconcini, A. Marconi, M. Ceci, A. Feltre, M. Tartenas, K. Zubovas, I. Lamperti, G. Cresci, L. Ulivi, F. Mannucci, E. Bertola, C. Bracci, E. Cataldi, Q. D'Amato, J.A. Fernandez-Ontiveros, J. Fritz, E. Hatziminaoglou, I. E. Lopez, M. Ginolfi, C. Gruppioni, M. Mingozzi, B. Moreschini, G. Sabatini, F. Salvestrini, M. Scialpi, G. Tozzi, A. Vidal-Garcia, C. Vignali, G. Venturi, M.V. Zanchettin 18 pages, 12 figures, submitted to A&A Astrophysics of Galaxies (astro-ph.GA) We present new JWST IFS observations of the active galaxy NGC 1068, combining Mid-IR and optical IFS data from MIRI and MUSE to characterize the multi-phase circumnuclear gas properties and its interaction with the AGN outflow and radio jet. MIRI data trace the multiphase gas emission up to 400 pc from the nucleus at 20--60 pc resolution, unveiling a clumpy ionized structure around the radio hot-spots and a rotating warm molecular disc. Innovative Mid-IR diagnostic diagrams highlight the role of the AGN as the main excitation source for the ionized gas in the entire MIRI field of view, consistent with optical diagnostics, and supporting the AGN-driven wind scenario. Density sensitive [NeV] and [ArV] Mid-IR transitions reveal high-density clumps (n_e > 10**4 cm**-3) along the edges of the jet and outflow, tracing gas compression by the expanding wind. We combined multi-cloud kinematic (MOKA) and photo-ionization (HOMERUN) modeling to characterize the ionized outflow properties and found that [OIV] traces an outflow 300 km/s faster than that inferred from [OIII], showing that the two lines originate from distinct gas components. This kinematic dichotomy is confirmed by the photoionization analysis, which requires a dust-poor component dominating the optical lines and a dust-rich component responsible for the Mid-IR emission. The Mid-IR-revealed dusty component carries a significantly larger ionized-gas mass than what can be inferred from optical lines alone, showing that most of the outflowing mass is hidden from classical optical diagnostics. Our modelling point to a two-stage acceleration scenario, with velocities up to ~2000 km/s, consistent with an energy-driven wind. Our findings indicates that the outflow entrains up to a few 10**6 solar masses of ionized gas and couples efficiently with the surrounding ISM, injecting turbulence and impacting the host-galaxy environment.",
      "pdf_url": "https://arxiv.org/pdf/2512.11042.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11046",
      "title": "Dynamical constraints on the S2 (S0-2) star possible companions",
      "authors": [
        "Rodrigo P. Silva",
        "Alexandre C. M. Correia",
        "Tjarda C. N. Boekholt",
        "Paulo J. V. Garcia"
      ],
      "abstract": "Dynamical constraints on the S2 (S0-2) star possible companions Rodrigo P. Silva, Alexandre C. M. Correia, Tjarda C. N. Boekholt, Paulo J. V. Garcia 10 pages; Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) The center of the Galaxy harbors a supermassive black hole, Sgr\\,A*, which is surrounded by a massive star cluster known as the S-cluster. The most extensively studied star in this cluster is the B-type main-sequence S2 star (also known as S0-2). These types of stars are commonly found in binary systems in the Galactic field, but observations do not seem to detect a companion to S2. This absence may be attributed to observational biases or to a dynamically hostile environment caused by phenomena such as tidal disruption or mergers. Using a $N$-body code with first-order post-Newtonian corrections, we investigate whether S2 can host a stellar or planetary companion. We perform $10^{5}$ simulations adopting uniform distributions for the orbital elements of the companion. Our results show that companions may exist for orbital periods shorter than 100~days, eccentricities below 0.8, and across the full range of mutual inclinations. The number of surviving companions increases with shorter orbital periods, lower eccentricities, and nearly coplanar orbits. We also find that the disruption mechanisms include mergers driven by Lidov-Kozai cycles and breakups that occur when the companion surpasses the Hill radius of its orbit. Finally, we find that the presence of a companion would alter S2's astrometric signal by no more than $ 5\\,\\mu{\\rm as}$. Current radial-velocity detection limits constrain viable stellar binary configurations to approximately 4.4\\% of the simulated cases. Including astrometric limits reduces to 4.3\\%. Imposing an additional constraint that any companion must have a mass $\\lesssim 2\\,M_{\\odot}$ (otherwise it would be visible) narrows the fraction of undetectable stellar binaries to just 3.0\\%.",
      "pdf_url": "https://arxiv.org/pdf/2512.11046.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11050",
      "title": "Balmer Transition Signatures from Gas-Enshrouded, Dust-Poor Active Galactic Nuclei",
      "authors": [
        "Zu Yan",
        "Kohei Inayoshi",
        "Kejian Chen",
        "Jingsong Guo"
      ],
      "abstract": "Balmer Transition Signatures from Gas-Enshrouded, Dust-Poor Active Galactic Nuclei Zu Yan, Kohei Inayoshi, Kejian Chen, Jingsong Guo 15 pages, 6 figures, comments welcome Astrophysics of Galaxies (astro-ph.GA) Little red dots (LRDs), a population of active galactic nuclei (AGNs) recently discovered by JWST, show distinctive Balmer-transition features, including prominent Balmer absorption, pronounced Balmer breaks, and large equivalent widths of broad $\\mathrm{H}\\alpha$ emission, all of which indicate the presence of dense gas surrounding their central black holes. A further key property of LRDs is their large Balmer decrements with broad $\\mathrm{H}\\alpha/\\mathrm{H}\\beta$ line-flux ratios far exceeding the Case B recombination value. These ratios of $\\mathrm{H}\\alpha/\\mathrm{H}\\beta>3$ have often been interpreted as evidence for heavy dust extinction ($A_V\\gtrsim 3$ mag), however such dust would inevitably produce strong near-to-mid infrared re-emission that is hardly seen in JWST/MIRI observations. To investigate the physical origin of these observed Balmer features, we perform radiation transfer calculations through dust-free, dense gas. We show that the observed large Balmer decrements ($\\mathrm{H}\\alpha/\\mathrm{H}\\beta$ and $\\mathrm{H}\\alpha/\\mathrm{H}\\gamma$) naturally arise from Balmer resonance scattering without invoking dust. At sufficiently high densities ($n_\\mathrm{H} \\gtrsim 10^{{8}-{10}}~\\mathrm{cm^{-3}}$), the elevated multiple Balmer-line ratios converge to values that closely mimic dust reddening, explaining why LRD spectra resemble obscured AGNs. Furthermore, when the Balmer break and broad Balmer lines originate in the same dense gas, their strengths are physically linked, allowing us to constrain the density structure and infer a low broad-line region gas mass of $\\sim O(10~M_\\odot)$. Such a small gas reservoir would be enriched by even a single supernova, implying that LRDs with observed low-metallicity signatures likely experienced minimal star formation in their nuclei.",
      "pdf_url": "https://arxiv.org/pdf/2512.11050.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11070",
      "title": "Connection Between Dwarf Galaxies and Globular Clusters: Insights from the Perseus Cluster Using Subaru Imaging and Keck Spectroscopy",
      "authors": [
        "Yimeng Tang",
        "Aaron J. Romanowsky",
        "Song Huang",
        "Nobuhiro Okabe",
        "Jean P. Brodie",
        "Kevin A. Bundy",
        "Maria Luisa Buzzo",
        "Timothy Carleton",
        "Anna Ferré-Mateu",
        "Duncan A. Forbes",
        "Jonah S. Gannon",
        "Steven R. Janssens",
        "Arsen Levitskiy",
        "Alexi M. Musick"
      ],
      "abstract": "Connection Between Dwarf Galaxies and Globular Clusters: Insights from the Perseus Cluster Using Subaru Imaging and Keck Spectroscopy Yimeng Tang, Aaron J. Romanowsky, Song Huang, Nobuhiro Okabe, Jean P. Brodie, Kevin A. Bundy, Maria Luisa Buzzo, Timothy Carleton, Anna Ferré-Mateu, Duncan A. Forbes, Jonah S. Gannon, Steven R. Janssens, Arsen Levitskiy, Alexi M. Musick 22 pages, 13 figures. Resubmitted to ApJ after revision Astrophysics of Galaxies (astro-ph.GA) We present a systematic study of 189 dwarf galaxies and their globular cluster (GC) systems in the Perseus cluster, based on deep Subaru Hyper Suprime-Cam imaging and Keck spectroscopy, supplemented by literature data. This constitutes the largest sample of dwarfs in a single galaxy cluster to date with simultaneous deep imaging, spectroscopic coverage, and GC measurements, while uniquely spanning a broad and continuous range of galaxy properties. We find an anti-correlation between GC specific mass and galaxy stellar mass for dwarfs in Perseus similar to observations in other clusters. At fixed stellar mass, dwarfs with lower surface brightness or larger effective radius tend to be more GC-rich -- suggesting either high GC formation efficiency in an earlier compact-galaxy phase, or less efficient GC disruption. The correlation between GC richness and axis ratio in Perseus is weaker than in other environments. We find some connection between GC richness and infall time, but not with the clear correlations found in Virgo, Coma, and cosmological simulations. More complete observations are needed to test for cluster-to-cluster variations in galaxy and GC evolutionary histories. This work demonstrates the potential of new wide-field imaging and spectroscopy surveys for understanding GCs and dwarf galaxies, and highlights the need for further work in theoretical modeling.",
      "pdf_url": "https://arxiv.org/pdf/2512.11070.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11175",
      "title": "The Interplay of Stellar Evolution and Collisions in Galactic Nuclei",
      "authors": [
        "Jaden S. Sidhu",
        "Sanaea C. Rose",
        "Frederic A. Rasio"
      ],
      "abstract": "The Interplay of Stellar Evolution and Collisions in Galactic Nuclei Jaden S. Sidhu, Sanaea C. Rose, Frederic A. Rasio Astrophysics of Galaxies (astro-ph.GA) Nuclear star clusters (NSCs) surrounding supermassive black holes (SMBHs) are among the densest stellar environments in the universe. In these environments, collisions can shape the stellar mass function and produce exotic stellar populations. In this work, we investigate how stellar collisions couple with stellar evolution in the inner parsec of an NSC. We simulate the evolution of a sample of $1000$ $1$ $M_\\odot$ stars embedded in a uniform cluster of dynamically relaxed 0.5 $M_\\odot$ stars. Using COSMIC to evolve stellar properties in time , we track the mass, radius, and evolutionary state of the stars as they collide in the cluster. Our results show that most stars within $0.1$~pc of the SMBH experience a collision while on the main-sequence. However, outside of this distance, stars collide during the red giant phase, when the stellar radius increases dramatically. We find that the most common type of collision -- main-sequence or red giant -- over the lifetime of the cluster depends on the steepness of the stellar cusp, which determines the spatial distribution of the stars in the cluster. These results show that stellar evolution plays a fundamental role in shaping the collisional history of stars in nuclear star clusters. Lastly, we consider whether the closest known stars to the Milky Way's SMBH have experienced a collision. We estimate that several of the S-stars have a high probability of experiencing a collision over their main-sequence lifetime, perhaps with implications for their observed youth and properties.",
      "pdf_url": "https://arxiv.org/pdf/2512.11175.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11207",
      "title": "Synthetic polarization observations of magnetized pillars in HII regions: The limitations of the Davis-Chandrasekhar-Fermi method",
      "authors": [
        "Luis Andrés Hernández-Cruz",
        "Manuel Zamora-Avilés",
        "Abraham Luna",
        "Raúl Naranjo-Romero",
        "José Franco",
        "Aina Palau",
        "Alejandro García-Pérez",
        "Javier Ballesteros-Paredes"
      ],
      "abstract": "Synthetic polarization observations of magnetized pillars in HII regions: The limitations of the Davis-Chandrasekhar-Fermi method Luis Andrés Hernández-Cruz, Manuel Zamora-Avilés, Abraham Luna, Raúl Naranjo-Romero, José Franco, Aina Palau, Alejandro García-Pérez, Javier Ballesteros-Paredes Astrophysics of Galaxies (astro-ph.GA) We investigated the morphology and strength of magnetic fields in pillar-shaped structures at the boundaries of HII regions by combining three-dimensional radiation-magnetohydrodynamic, R-MHD, simulations with synthetic polarimetric observations. Our analysis focuses on the first pillar formed self-consistently in the simulation and is used as a proof of concept to test the applicability of the Davis-Chandrasekhar-Fermi (DCF) method under conditions dominated by external agents. The pillar arises as the ionization front compresses a dense clump, producing a magnetically aligned, elongated structure whose morphology and field configuration closely resemble those observed in real systems such as the pillars of M16. Synthetic dust-polarization maps at 850 $\\mu$m reproduce the large-scale magnetic morphology of the simulated pillar, confirming that polarimetry is a reliable tracer of magnetic field geometry. However, magnetic field strengths inferred using DCF-type methods systematically overestimate intrinsic values from the simulations by factors $\\gtrsim 2$. We attribute this discrepancy to the fact that field alignment and amplification are primarily driven by external gas pressure from the expanding HII region rather than internal turbulence, thus violating key assumptions of the DCF method. Our results highlight the need for caution when applying classical DCF-based analysis to pillars or other structures shaped by external compressions.",
      "pdf_url": "https://arxiv.org/pdf/2512.11207.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11309",
      "title": "Kennicutt-Schmidt relation of galaxies over 13 billion years in the COLIBRE hydrodynamical simulations",
      "authors": [
        "Claudia del P. Lagos , Joop Schaye, Matthieu Schaller, Danail Obreschkow, Yannick M. Bahe, Alejandro Benitez-Llambay, Evgenii Chaikin, Camila Correa, Timothy A. Davis, Carlos S. Frenk, Filip Husko, Melanie Kaasinen, Robert J. McGibbon, Kyle Oman, Sylvia Ploeckinger, Alexander J. Richings, James W. Trayford, Jing Wang, Ruby J. Wright International Centre for Radio Astronomy Research , M468, University of Western Australia, Crawley, WA, Australia, Cosmic Dawn Center , Denmark)"
      ],
      "abstract": "Kennicutt-Schmidt relation of galaxies over 13 billion years in the COLIBRE hydrodynamical simulations Claudia del P. Lagos (1,2), Joop Schaye, Matthieu Schaller, Danail Obreschkow, Yannick M. Bahe, Alejandro Benitez-Llambay, Evgenii Chaikin, Camila Correa, Timothy A. Davis, Carlos S. Frenk, Filip Husko, Melanie Kaasinen, Robert J. McGibbon, Kyle Oman, Sylvia Ploeckinger, Alexander J. Richings, James W. Trayford, Jing Wang, Ruby J. Wright ((1) International Centre for Radio Astronomy Research (ICRAR), M468, University of Western Australia, Crawley, WA, Australia, (2) Cosmic Dawn Center (DAWN), Denmark) 27 pages; 19 main body of the paper. Submitted to MNRAS. Comments are welcome! Astrophysics of Galaxies (astro-ph.GA) We investigate the correlation between star formation rate (SFR) surface density and gas surface density (known as the Kennicutt-Schmidt, KS, relation) at kiloparsec (kpc) scales across cosmic time ($0\\le z \\le 8$) using the COLIBRE state-of-the-art cosmological hydrodynamical simulations. These simulations feature on-the-fly non-equilibrium chemistry coupled to dust grain evolution and detailed radiative cooling down to $\\approx 10$~K, enabling direct predictions for the atomic (HI) and molecular (H$_2$) KS relations. At $z\\approx 0$, COLIBRE reproduces the observed (spatially-resolved) KS relations for HI and H$_2$, including the associated scatter, which we predict to be significantly correlated with stellar surface density, local specific SFR (sSFR), and gas metallicity. We show that the HI KS relation steepens for lower-mass galaxies, while the H$_2$ KS relation shifts to higher normalisation in galaxies with higher sSFRs. The H$_2$ depletion time decreases by a factor of $\\approx 20$ from $z = 0$ to $z = 8$, primarily due to the decreasing gas-phase metallicity. This results in less H$_2$ and more HI being associated with a given SFR at higher redshift. We also find that galaxies with higher sSFRs have a larger molecular gas content and higher star formation efficiency per unit gas mass on kpc scales. The predicted evolution of the H$_2$ depletion time and its correlation with a galaxy's sSFR agree remarkably well with observations in a wide redshift range, $0\\le z\\le 5$.",
      "pdf_url": "https://arxiv.org/pdf/2512.11309.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11409",
      "title": "The Influential Roles of Gravity, Turbulence, and Magnetic Fields in Shaping the Physical Evolution of Dense Massive Clumps",
      "authors": [
        "Moses Onyemaechi Asogwa",
        "Seblu Humne Negu",
        "Gemechu Muleta Kumssa",
        "Innocent Okwudili Eya"
      ],
      "abstract": "The Influential Roles of Gravity, Turbulence, and Magnetic Fields in Shaping the Physical Evolution of Dense Massive Clumps Moses Onyemaechi Asogwa, Seblu Humne Negu, Gemechu Muleta Kumssa, Innocent Okwudili Eya Accepted for publication in Research in Astronomy and Astrophysics (RAA). This submission is the accepted manuscript version following peer review but prior to IOP Publishing copyediting and typesetting Astrophysics of Galaxies (astro-ph.GA) We explore the roles of the three competitors, namely, gravity, turbulence, and magnetic fields, in controlling star formation (SF) within dense, massive clumps identified in the ATLASGAL survey. By examining scaling relations, virial parameters, and turbulent energy spectra, we evaluate the dynamical state of these clumps. We observe a weak velocity dispersion-size relation (sigma proportional to L^0.11), which is much shallower than the classical Larson-like relations, suggesting that turbulence does not mainly drive internal dynamics. The turbulent energy spectrum, E(k) proportional to k^-1.21, is also less steep than what is expected for both incompressible and compressible turbulence. We equally observe a decreasing trend in the virial parameter with increasing mass (alpha_vir proportional to M^-0.37), indicating that more massive clumps are increasingly gravitationally bound. These trends indicate an increasing relative dominance of gravity over turbulence at smaller scales, aligning with multiscale collapse scenarios; however, the absolute energy balance remains unquantifiable with the current data. Although magnetic fields are not directly measured, their potential influence is considered in the interpretation of pressure balance and dynamical support. Our findings imply that gravitational processes appear to primarily regulate the structure and evolution of massive clumps.",
      "pdf_url": "https://arxiv.org/pdf/2512.11409.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11500",
      "title": "Laboratory rotational spectroscopy and interstellar search for the protein precursor 4-oxobutanenitrile (HCOCH$_2$CH$_2$CN)",
      "authors": [
        "V. M. Rivilla",
        "E. R. Alonso",
        "W. Song",
        "A. Insausti",
        "A. Maris",
        "F. J. Basterretxea",
        "S. Melandri",
        "I. Jiménez-Serra",
        "E. J. Cocinero"
      ],
      "abstract": "Laboratory rotational spectroscopy and interstellar search for the protein precursor 4-oxobutanenitrile (HCOCH$_2$CH$_2$CN) V. M. Rivilla, E. R. Alonso, W. Song, A. Insausti, A. Maris, F. J. Basterretxea, S. Melandri, I. Jiménez-Serra, E. J. Cocinero Accepted in Monthly Notices of the Royal Astronomical Society Astrophysics of Galaxies (astro-ph.GA) Understanding the presence and distribution of prebiotic precursors in the interstellar medium (ISM) is key to tracing the chemical origins of life. Among them, 4-oxobutanenitrile (\\ch{HCOCH2CH2CN}) has been identified in laboratory simulations as a plausible intermediate in the formation of glutamic acid, a proteinogenic amino acid. Here, we report its gas-phase rotational spectrum, measured using two complementary techniques: chirped-pulse Fourier transform microwave (CP-FTMW) spectroscopy (2$-$18 GHz) and free-jet millimeter-wave (FJ$-$AMMW) absorption spectroscopy (59.6$-$80 GHz). Quantum chemical calculations revealed nine low-energy conformers, of which the TC conformer was assigned based on the measured spectra. The resulting spectroscopic parameters were used to search for the molecule in the ultradeep spectral survey of the G+0.693-0.027 molecular cloud, located in the Galactic Center. No signal attributable to 4$-$oxobutanenitrile was detected. A stringent upper limit to its column density was derived ($N<$ 4 $\\times$10$^{12}$ cm$^{-2}$), corresponding to a molecular abundance of $<$ 2.9 $\\times$10$^{-11}$ relative to H$_{2}$. This upper limit lies well below the observed abundances of simpler structurally related species containing $-$HCO and $-$CN groups, underscoring the challenge of detecting increasingly complex prebiotic molecules in the ISM and the need for future, more sensitive astronomical facilities.",
      "pdf_url": "https://arxiv.org/pdf/2512.11500.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11665",
      "title": "Rapid sinking and efficient mergers of supermassive black holes in compact high-redshift galaxies",
      "authors": [
        "Atte Keitaanranta",
        "Peter H. Johansson",
        "Alexander Rawlings",
        "Toni Tuominen",
        "Antti Rantala",
        "Thorsten Naab",
        "Shihong Liao",
        "Bastián Reinoso"
      ],
      "abstract": "Rapid sinking and efficient mergers of supermassive black holes in compact high-redshift galaxies Atte Keitaanranta, Peter H. Johansson, Alexander Rawlings, Toni Tuominen, Antti Rantala, Thorsten Naab, Shihong Liao, Bastián Reinoso Astrophysics of Galaxies (astro-ph.GA) We present a cosmological zoom-in simulation targeting the high redshift compact progenitor phase of massive galaxies, with the most massive galaxy reaching a stellar mass of $M_{\\star}=8.5\\times 10^{10} \\ M_{\\odot}$ at $z=5$. The dynamics of supermassive black holes (SMBHs) is modelled from seeding down to their coalescence at sub-parsec scales due to gravitational wave (GW) emission by utilising a new version of the KETJU code, which combines regularised integration of sufficiently massive SMBHs with a dynamical friction subgrid model for lower-mass SMBHs. All nine massive galaxies included in this study go through a gas-dominated phase of early compaction in the redshift range of $z\\sim 7-9$, starting at stellar masses of $M_\\star\\gtrsim 10^8\\ \\mathrm{M}_\\odot$ and ending at a few times $M_{\\star}\\sim 10^9\\ \\mathrm{M}_\\odot$. The sizes, masses and broad band fluxes of these compact systems are in general agreement with the population of systems observed with JWST known as `Little Red Dots'. In the compact phase, the stellar and SMBH masses grow rapidly, leading to a sharp decline in the central gas fractions. The outer regions, however, remain relatively gas-rich, leading to subsequent off-centre star formation and size growth. Due to the very high central stellar densities ($\\rho_{\\star}\\gtrsim 10^{13}\\,\\mathrm{M_\\odot/kpc^3}$), the SMBHs merge rapidly, typically just $\\sim 4-35\\ \\mathrm{Myr}$ after the SMBH binaries have become bound. Combining KETJU with the phenomenological PhenomD model resolves the complete evolution of the GW emission from SMBH binaries through the Pulsar Timing Array frequency waveband up to the final few orbits that produce GWs observable with the future LISA mission.",
      "pdf_url": "https://arxiv.org/pdf/2512.11665.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.11694",
      "title": "A Spatially Resolved Evolutionary Sequence of Multi-wavelength AGN Host Galaxies",
      "authors": [
        "Gaoxiang Jin",
        "Guinevere Kauffmann",
        "Y. Sophia Dai",
        "Martin J. Hardcastle",
        "Bohan Yue"
      ],
      "abstract": "A Spatially Resolved Evolutionary Sequence of Multi-wavelength AGN Host Galaxies Gaoxiang Jin, Guinevere Kauffmann, Y. Sophia Dai, Martin J. Hardcastle, Bohan Yue 18 pages, 14 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) We study the spatially resolved star formation, gas ionisation, and outflow properties of 1813 active galactic nuclei (AGNs) from the MaNGA survey, which we classify into infrared (IR), broad-line (BL), narrow-line (NL), and radio (RD) AGNs based on their mid-infrared colours, optical spectra, and/or radio photometry. We also provide estimations of AGN power at different wavelengths. AGN incidence is found to increase with stellar mass following a power-law, with the high-mass end dominated by RDAGNs and the low-mass end dominated by NLAGNs. Compared to their mass-matched non-AGN counterparts, we find that IRAGNs, BLAGNs, and NLAGNs on average show enhanced specific star formation rates, younger stellar populations, and harder ionisation towards the centre. RDAGNs, in contrast, show radial profiles similar to quiescent galaxies. [OIII] outflows are more common and stronger in BL/IRAGNs, while RDAGNs on average show no outflow features. The outflow incidence increases with [OIII] luminosity, and the features in BL/IRAGNs on average extend to ~2 kpc from the nuclei. We further discuss a possible evolutionary sequence of AGNs and their host galaxies, where AGNs with strong emission lines or dust tori are present in star-forming galaxies. Later, young compact radio jets emerge, the host galaxies gradually quench, and the AGN hosts eventually evolve into globally quiescent systems with larger radio jets that prevent further gas cooling.",
      "pdf_url": "https://arxiv.org/pdf/2512.11694.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11710",
      "title": "Looking into the faintEst WIth MUSE (LEWIS): on the nature of ultra-diffuse galaxies in the Hydra I cluster. V. Integrated stellar population properties",
      "authors": [
        "Goran Doll",
        "Chiara Buttitta",
        "Enrichetta Iodice",
        "Anna Ferré-Mateu",
        "Jesus Falcòn-Barroso",
        "Ignacio Martìn-Navarro",
        "Maurizio Paolillo",
        "Luca Rossi",
        "Duncan A. Forbes",
        "Chiara Spiniello",
        "Johanna Hartke",
        "Marco Gullieuszik",
        "Magda Arnaboldi",
        "Michele Cantiello",
        "Enrico Maria Corsini",
        "Giuseppe D'Ago",
        "Michael Hilker",
        "Antonio La Marca",
        "Steffen Mieske",
        "Marco Mirabile",
        "Marina Rejkuba",
        "Marilena Spavone"
      ],
      "abstract": "Looking into the faintEst WIth MUSE (LEWIS): on the nature of ultra-diffuse galaxies in the Hydra I cluster. V. Integrated stellar population properties Goran Doll, Chiara Buttitta, Enrichetta Iodice, Anna Ferré-Mateu, Jesus Falcòn-Barroso, Ignacio Martìn-Navarro, Maurizio Paolillo, Luca Rossi, Duncan A. Forbes, Chiara Spiniello, Johanna Hartke, Marco Gullieuszik, Magda Arnaboldi, Michele Cantiello, Enrico Maria Corsini, Giuseppe D'Ago, Michael Hilker, Antonio La Marca, Steffen Mieske, Marco Mirabile, Marina Rejkuba, Marilena Spavone 22 Pages, Accepted for publication on A&A Astrophysics of Galaxies (astro-ph.GA) Context: This paper presents new results from the ESO Large Programme Looking into the faintEst WIth MUSE (LEWIS). The sample consists of low-surface brightness (LSB) and ultra-diffuse galaxies (UDGs) located inside 0.4 R$_{vir}$ of the Hydra I cluster. Integral field spectroscopy is acquired for 24 galaxies with the MUSE spectrograph mounted on the Very Large Telescope (VLT). Aims: Our main objective is to analyse possible correlations between the environment and the integrated stellar population properties. Methods: For each galaxy, we extract the 1D stacked spectrum in an aperture of one effective radius and adopt previously published stellar kinematics to derive age, metallicity and [Mg/Fe] through a full spectral fitting technique. Results: We find that the analysed LEWIS sample has a mean metallicity of [M/H] = -0.9 dex, a mean age of 10 Gyr, comparable to results of UDGs in other clusters. According to the projected phase-space, galaxies can be classified into two groups: early infallers, with slightly higher metallicities ([M/H]$_{early} = -0.8 \\pm 0.1$ dex), and late infallers, with slightly lower values ([M/H]$_{late} = -1.0 \\pm 0.1$ dex). Two types of galaxies are found in the early-infall region: half of them have metallicities consistent with the dwarf mass-metallicity relation, while the other half show higher values. Moreover, they display different timescales for stellar mass assembly. Conclusions: We identified different classes of UDGs in the Hydra I cluster, which suggest different formation mechanisms taking place. Almost all of the UDGs and LSBs in the cluster are consistent with the puffed-up dwarf formation scenario, having dwarf-like metallicities and being consistent with the dwarf mass-metallicity relation. In the innermost regions of the cluster, where metal-richer UDGs lie, tidal or environmental effects might have influenced their formation and evolution.",
      "pdf_url": "https://arxiv.org/pdf/2512.11710.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11744",
      "title": "The low-mass and structured stellar halo of M83 argues against a merger origin for its starburst and extended neutral hydrogen disk",
      "authors": [
        "Eric F. Bell",
        "Benjamin Harmsen",
        "Matthew Cosby",
        "Paul A. Price",
        "Sarah Pearson",
        "Antonela Monachesi",
        "Roelof S. de Jong",
        "Richard D'Souza",
        "Katya Gozman",
        "Jacob Nibauer",
        "Michael P. Busch",
        "Jeremy Bailin",
        "Benne W. Holwerda",
        "In Sung Jang",
        "Adam Smercina"
      ],
      "abstract": "The low-mass and structured stellar halo of M83 argues against a merger origin for its starburst and extended neutral hydrogen disk Eric F. Bell, Benjamin Harmsen, Matthew Cosby, Paul A. Price, Sarah Pearson, Antonela Monachesi, Roelof S. de Jong, Richard D'Souza, Katya Gozman, Jacob Nibauer, Michael P. Busch, Jeremy Bailin, Benne W. Holwerda, In Sung Jang, Adam Smercina 31 pages, 15 figures. Accepted to AAS Journals December 10, 2025. The Subaru and HST photometric catalogs are available at this https URL Astrophysics of Galaxies (astro-ph.GA) A merger origin has been suggested for M83's massive, metal-rich extended HI disk and nuclear starburst. We observe M83's stellar halo to test this idea. We train nearest-neighbor star-galaxy separation on wide-area Subaru imaging with Hubble Space Telescope data to map M83's halo in resolved stars. We find that M83 has an extended, very low density smooth stellar halo of old and metal-poor [M/H]$\\sim -1.15$ RGB stars with a mass between 15 and 40 kpc of $\\log_{10}M_{*,15-40,maj}/M_{\\odot}=8.02\\pm0.10$. In addition to M83's well-known Northern Stream, our ground-based Subaru imaging reveals a new stream to M83's south, which modeling suggests could be its trailing arm. The combined stream masses are $\\log_{10}M_{stream}/M_{\\odot}=7.93\\pm0.10$, with metallicity [M/H]$= -1.0\\pm0.2$. The stream progenitor was only recently accreted, as its stellar populations suggest that it formed stars until $2.1\\pm1.3$ Gyr ago. M83 lies on the stellar halo mass-metallicity correlation seen for other Milky Way mass galaxies, albeit with low stellar halo mass. We infer a total accreted mass of $\\log_{10}M_{*,accreted}/M_{\\odot}=8.78^{+0.22}_{-0.28}$, with the most massive past merger having $\\log_{10}M_{*,dom}/M_{\\odot}=8.5\\pm0.3$. We identify plausible M83 analogs in TNG-50 with similar stellar halos, finding that while a recent accretion can create a prominent stellar stream, such accretions do not trigger starburst activity, nor do they deliver enough gas to form M83's extended Hi disk. We conclude that other non-merger mechanisms, such as secular evolution or accretion of gas from the IGM, are likely to be responsible for M83's remarkable properties.",
      "pdf_url": "https://arxiv.org/pdf/2512.11744.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11758",
      "title": "The Effect of a Non-universal Extinction Curve on the Wesenheit Function and Cepheid Distances",
      "authors": [
        "D. M. Skowron",
        "M. L. Fouesneau",
        "R. Drimmel",
        "S. Khanna"
      ],
      "abstract": "The Effect of a Non-universal Extinction Curve on the Wesenheit Function and Cepheid Distances D. M. Skowron, M. L. Fouesneau, R. Drimmel, S. Khanna 8 pages, 5 figures, 1 table, submitted to AAS Journals Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The Wesenheit function is widely used to reduce the effects of interstellar reddening in distance measurements. Its construction, however, relies on the assumption of a universal extinction curve and on fixed values of the total-to-selective extinction ratio, Rv. Recent studies have shown that Rv varies significantly across the Milky Way and between different galaxies, raising concerns about systematic biases in Wesenheit magnitudes and period-Wesenheit relations. In this work, we discuss the impact of non-universal extinction on Wesenheit indices by combining the Rv-dependent extinction curve with a grid of stellar atmosphere models. We compute the integrated extinction in optical and near-infrared passbands, derive Rv-dependent R coefficients for multiple Wesenheit indices, and examine how changes in Rv propagate into Wesenheit magnitudes and Cepheid distances in our Galaxy. We find that the R coefficients in the Wesenheit functions vary strongly with Rv. For classical Cepheids in the Milky Way disk, variations of Rv within the typical observed range (2.6-3.6) can lead to substantial differences in the Wesenheit function, reaching +-0.7 mag from the mean for the Gaia-based Wesenheit index W_G and resulting in distance errors of almost 40%. Near-infrared Wesenheit indices are much less sensitive to Rv changes. Our results clearly show that accounting for variable Rv is essential when applying period-Wesenheit relations, particularly in the optical regime, or that near or mid infrared based distances should be used. While we present this effect for classical Cepheids, it applies to all pulsating stars for which period-Wesenheit relations are used to infer distances.",
      "pdf_url": "https://arxiv.org/pdf/2512.11758.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11501",
      "title": "Dynamical evolution of massless particles in star clusters with NBODY6++GPU-MASSLESS: II. The long-term evolution of free-floating comets",
      "authors": [
        "Francesco Flammini Dotti",
        "M.B.N. Kouwenhoven",
        "Kai Wu",
        "Abbas Askar",
        "Peter Berczik",
        "Mirek Giersz",
        "Rainer Spurzem",
        "Ian Dobbs-Dixon"
      ],
      "abstract": "Dynamical evolution of massless particles in star clusters with NBODY6++GPU-MASSLESS: II. The long-term evolution of free-floating comets Francesco Flammini Dotti, M.B.N. Kouwenhoven, Kai Wu, Abbas Askar, Peter Berczik, Mirek Giersz, Rainer Spurzem, Ian Dobbs-Dixon 15 pages, 31 figures, accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Context. Comets, asteroids, planetesimals, free-floating planets and brown dwarfs, are continuously injected into the intra-cluster environment after expulsion from their host planetary systems or binary system. The dynamics of large populations of such free-floating comets (ffcs) in a star cluster environment is not yet fully understood. Aims. We investigate the dynamical evolution of comet populations in star clusters, and characterize the kinematics and ejection rates of ffc in a star cluster. Moreover, we determine whether a different initial energy distribution affects the mass segregation of the less massive population. Methods. We carry out simulations using the N-body code NBODY6++GPU-MASSLESS (Flammini Dotti et al. 2025), which allows fast integration of star clusters that contain large numbers of massless particles, to characterize the dynamics of populations of low-mass particles with sub-virial and super-virial distributions. Results. Comets do not participate in the mass segregation process, similarly to planet-size objects, regardless of their initial energy distribution. The latter is slightly changing the whole dynamical evolution at the start of the simulation. We only observe an initial relaxation or collapse of the objects for super-virial and sub-virial ratios, respectively. The external regions of the ffcs population tend to be pulled back in the cluster core at the end of the simulation, suggesting the gravitational pull of the stars is pulling them back in the core. This phenomenon occurs at later times if the system in virial equilibrium. Compared to less massive bodies, brown dwarfs experiences more mass segregation the inner regions tend to be more mixed with the stellar population",
      "pdf_url": "https://arxiv.org/pdf/2512.11501.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11687",
      "title": "Transformer Embeddings for Fast Microlensing Inference",
      "authors": [
        "Nolan Smyth",
        "Laurence Perreault-Levasseur",
        "Yashar Hezaveh"
      ],
      "abstract": "Transformer Embeddings for Fast Microlensing Inference Nolan Smyth, Laurence Perreault-Levasseur, Yashar Hezaveh Accepted to NeurIPS 2025 ML4PS workshop Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The search for free-floating planets (FFPs) is a key science driver for upcoming microlensing surveys like the Nancy Grace Roman Galactic Exoplanet Survey. These rogue worlds are typically detected via short-duration microlensing events, the characterization of which often requires analyzing noisy, irregularly-sampled observations. We present a pipeline for this task using simulation-based inference. We use a Transformer encoder to learn a compressed summary representation of the raw time-series data, which in turn conditions a neural posterior estimator. We demonstrate that our method produces accurate and well-calibrated posteriors over three orders of magnitude faster than traditional methods. We also demonstrate its performance on KMT-BLG-2019-2073, a short-duration FFP candidate event.",
      "pdf_url": "https://arxiv.org/pdf/2512.11687.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.14682",
      "title": "Extreme Neutral Outflow in a non-AGN Quiescent Galaxy at z~1.3",
      "authors": [
        "Yang Sun",
        "Zhiyuan Ji",
        "George H. Rieke",
        "Francesco D'Eugenio",
        "Yongda Zhu",
        "Fengwu Sun",
        "Xiaojing Lin",
        "Andrew J. Bunker",
        "Jianwei Lyu",
        "Pierluigi Rinaldi",
        "Christopher N. A. Willmer"
      ],
      "abstract": "Extreme Neutral Outflow in a non-AGN Quiescent Galaxy at z~1.3 Yang Sun, Zhiyuan Ji, George H. Rieke, Francesco D'Eugenio, Yongda Zhu, Fengwu Sun, Xiaojing Lin, Andrew J. Bunker, Jianwei Lyu, Pierluigi Rinaldi, Christopher N. A. Willmer 24 pages, 12 figure, Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We report the discovery of a substantial sodium doublet (Na D $\\lambda\\lambda$5890, 5896Å)-traced neutral outflow in the quiescent galaxy JADES-GS-206183 at $z=1.317$. Its JWST/NIRSpec-MSA spectrum shows a deep, blueshifted Na D absorption, revealing a neutral outflow with $v_{\\rm out}=828^{+79}_{-49}\\,\\mathrm{km\\,s^{-1}}$ and a mass outflow rate of $\\log(\\dot{M}_{\\rm out}/\\mathrm{M_{\\odot}\\,yr^{-1}})=2.40^{+0.11}_{-0.16}$. This outflow rate exceeds that of any neutral outflows identified beyond $z\\sim1$ by the same line and is comparable with those in local galaxies with intensive star formation or luminous AGN. JADES-GS-206183 is also a peculiar quiescent galaxy with a spiral$+$bar morphology, high dust attenuation ($A_V=2.27\\pm0.23$ mag). Paschen $\\alpha$ (Pa$\\alpha$) emission from the FRESCO NIRCam grism confirms its low star formation rate ($\\mathrm{SFR_{Pa\\alpha}}=10.78\\pm 0.55\\,\\mathrm{M_{\\odot}\\,yr^{-1}}$), placing it 0.5 dex below the main-sequence ($\\log(\\mathrm{sSFR/yr^{-1}})=-10.2$). Despite the systematics introduced by different star formation history (SFH) priors, the SED modeling, combining HST-to-NIRCam photometry with the VLT/MUSE spectrum, suggests that JADES-GS-206183 experienced an older episode of star formation 0.5-2 Gyr ago and a possible rejuvenation within recent $\\sim$10 Myr. Moreover, rest-frame optical lines indicate that the current AGN activity of JADES-GS-206183, if present, is also weak. Even though we tentatively detect a broad component of the H$\\alpha$ line, it likely traces an ionized outflow rather than an AGN. The results demonstrate that the Na D outflow in JADES-GS-206183 is highly unlikely to be driven by current star formation or nuclear activity. Instead, it may represent a long-lasting fossil outflow from past AGN activity, potentially co-triggered with the early phase of rejuvenation.",
      "pdf_url": "https://arxiv.org/pdf/2504.14682.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.12110",
      "title": "Dynamical Properties and Velocity Dispersion-Mass Relation of $z \\sim 1$ Galaxy Clusters from the GOGREEN and GCLASS Surveys",
      "authors": [
        "Shrouk Abdulshafy",
        "Mohamed H. Abdullah",
        "Gillian Wilson",
        "Michael L. Balogh",
        "Raouf H. Mabrouk"
      ],
      "abstract": "Dynamical Properties and Velocity Dispersion-Mass Relation of $z \\sim 1$ Galaxy Clusters from the GOGREEN and GCLASS Surveys Shrouk Abdulshafy, Mohamed H. Abdullah, Gillian Wilson, Michael L. Balogh, Raouf H. Mabrouk 15 pages, 5 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) We investigate a sample of 14 galaxy clusters from the GOGREEN and GCLASS (GG) spectroscopic datasets within the redshift range $(0.87 \\leq z \\leq 1.37)$ and cluster masses $\\mathrm{M}_{200} \\gtrsim 2\\times 10^{14}$ \\hm. Using the highly effective GalWeight technique for cluster membership assignment developed by our own team, we derive the dynamical parameters of these clusters through the virial mass estimator. We examine the velocity dispersion-cluster mass relation $(\\sigma \\mathrm{MR})$ for the GG cluster sample. We find, $\\log{\\sigma_{200}} = (2.94\\pm0.02) + (0.37\\pm0.07)\\log{\\mathrm{M}_{200}}$ with an intrinsic scatter of $(\\sigma_\\mathrm{int} = 0.02 \\pm 0.02)$. Our results demonstrate that the $(\\sigma \\mathrm{MR})$ relation is consistent with predictions from cosmological simulations, highlighting the reliability of the GalWeight technique for cluster membership assignment. Furthermore, the $(\\sigma \\mathrm{MR})$ validates the robustness of the virial mass estimator in accurately recovering cluster masses and associated parameters. Importantly, our findings confirm that velocity dispersion can be used directly to estimate cluster mass without relying on dynamical mass estimators.",
      "pdf_url": "https://arxiv.org/pdf/2505.12110.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.05781",
      "title": "Data-driven dust inference at mid-to-high Galactic latitudes using probabilistic machine learning",
      "authors": [
        "Matthew O'Callaghan",
        "Kaisey S. Mandel",
        "Gerry Gilmore"
      ],
      "abstract": "Data-driven dust inference at mid-to-high Galactic latitudes using probabilistic machine learning Matthew O'Callaghan, Kaisey S. Mandel, Gerry Gilmore Astrophysics of Galaxies (astro-ph.GA) We present a method for accurately and precisely inferring photometric dust extinction towards stars at mid-to-high Galactic latitudes using probabilistic machine learning to model the colour-magnitude distribution of zero-extinction stars in these regions. Photometric dust maps rely on a robust method for inferring stellar reddening. At high Galactic latitudes, where extinction is low, such inferences are particularly susceptible to contamination from modelling errors and prior assumptions, potentially introducing artificial structure into dust maps. In this work, we demonstrate the use of normalising flows to learn the conditional probability distribution of the photometric colour-magnitude relations of zero-extinction stars, conditioned on Galactic cylindrical coordinates for stars at mid-to-high Galactic latitudes. By using the normalising flow to model the colour-magnitude diagram, we infer the posterior distribution of dust extinction towards stars along different lines of sight by marginalising over the colour-magnitude flow. We validate our method using data from Gaia, Pan-STARRS, and 2MASS, showing that we can recover unbiased posteriors and successfully detect dust along the line-of-sight in two calibration regions at mid-Galactic latitude that have been extensively studied in the context of polarisation surveys.",
      "pdf_url": "https://arxiv.org/pdf/2508.05781.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.18367",
      "title": "The impact of radial migration on disk galaxy star formation histories I. Biases in spatially resolved estimates",
      "authors": [
        "I. Minchev",
        "K. Attard",
        "B. Ratcliffe",
        "M. Martig",
        "J. Walcher",
        "S. Khoperskov",
        "J.P. Bernaldez",
        "L. Marques",
        "K. Sysoliatina",
        "C. Chiappini",
        "M. Steinmetz",
        "R.S. de Jong"
      ],
      "abstract": "The impact of radial migration on disk galaxy star formation histories I. Biases in spatially resolved estimates I. Minchev, K. Attard, B. Ratcliffe, M. Martig, J. Walcher, S. Khoperskov, J.P. Bernaldez, L. Marques, K. Sysoliatina, C. Chiappini, M. Steinmetz, R.S. de Jong 10 pages, 6 figures, including a new Fourier analysis figure. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Knowledge of the spatially resolved star formation history (SFH) of disk galaxies provides crucial insight into disk assembly, quenching, and chemical evolution. However, most reconstructions, both for the Milky Way and for external galaxies, implicitly assume that stars formed at their present-day radii. Using a range of zoom-in cosmological simulations, we show that stellar radial migration introduces strong and systematic biases in such SFH estimates. In the inner disk (R < h_d), early star formation is typically underestimated by 25-50% and late star formation overestimated, giving the misleading impression of prolonged, moderate activity. An exception occurs in the very central bin considered (~ 0.4h_d), which is consistently overestimated due to a net inflow of inward migrators. At intermediate radii and in the outer disk, migration drives the opposite trend: intermediate-age populations are overestimated by 100-200% as stars born in the inner disk migrate outward, whereas genuinely in-situ populations are underestimated by ~ 50% as they themselves continue to migrate. The net effect is that SFH peaks are suppressed and broadened, and the true rate of inside-out disk growth is systematically underestimated. These distortions affect all galaxies in our sample and have direct implications for interpreting spatially resolved SFHs from IFU surveys such as CALIFA and MaNGA, where present-day radii are often used as proxies for stellar birth sites. Correcting these biases will require accounting for disk mass, bar presence, disk kinematics and morphology, while recent birth-radius estimation techniques for Milky Way stars offer a promising path forward.",
      "pdf_url": "https://arxiv.org/pdf/2508.18367.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.13911",
      "title": "Spatially resolved broad line region in a quasar at z=4: Dynamical black hole mass and prominent outflow",
      "authors": [
        "GRAVITY+ Collaboration",
        "K. Abd El Dayem",
        "N. Aimar",
        "A. Berdeu",
        "J.-P. Berger",
        "G. Bourdarot",
        "P. Bourget",
        "W. Brandner",
        "Y. Cao",
        "C. Correia",
        "S. Cuevas Cardona",
        "R. Davies",
        "D. Defrère",
        "A. Drescher",
        "A. Eckart",
        "F. Eisenhauer",
        "M. Fabricius",
        "A. Farah",
        "H. Feuchtgruber",
        "N.M. Förster Schreiber",
        "A. Foschi",
        "P. Garcia",
        "R. Garcia Lopez",
        "R. Genzel",
        "S. Gillessen",
        "T. Gomes",
        "F. Gonté",
        "V. Gopinath",
        "J. Graf",
        "M. Hartl",
        "X. Haubois",
        "F. Haußmann",
        "L.C. Ho",
        "S. Hönig",
        "M. Houllé",
        "S. Joharle",
        "C. Keiman",
        "P. Kervella",
        "J. Kolb",
        "L. Kreidberg",
        "A. Labdon",
        "S. Lacour",
        "O. Lai",
        "S. Lai",
        "R. Laugier",
        "J.-B. Le Bouquin",
        "J. Leftley",
        "R. Li",
        "B. Lopez",
        "D. Lutz",
        "F. Mang",
        "A. Mérand",
        "F. Millour",
        "M. Montargès",
        "N. More",
        "N. Morujão",
        "H. Nowacki",
        "M. Nowak",
        "S. Oberti",
        "C. Onken",
        "J. Osorno",
        "T. Ott",
        "T. Paumard",
        "K. Perraut",
        "G. Perrin",
        "R. Petrov",
        "P.-O. Petrucci",
        "N. Pourré",
        "S. Rabien",
        "C. Rau",
        "D. Ribeiro",
        "S. Robbe-Dubois",
        "M. Sadun Bordoni",
        "M. Salman",
        "J. Sanchez-Bermudez",
        "D. Santos",
        "J. Sauter",
        "M. Scialpi",
        "J. Scigliuto",
        "J. Shangguan",
        "P. Shchekaturov",
        "T. Shimizu",
        "F. Soulez",
        "C. Straubmeier",
        "E. Sturm",
        "M. Subroweit",
        "C. Sykes",
        "L.J. Tacconi",
        "H. Übler",
        "G. Ulbricht",
        "F. Vincent",
        "R. Webster",
        "E. Wieprecht",
        "J. Woillez",
        "C. Wolf"
      ],
      "abstract": "Spatially resolved broad line region in a quasar at z=4: Dynamical black hole mass and prominent outflow GRAVITY+ Collaboration, K. Abd El Dayem, N. Aimar, A. Berdeu, J.-P. Berger, G. Bourdarot, P. Bourget, W. Brandner, Y. Cao, C. Correia, S. Cuevas Cardona, R. Davies, D. Defrère, A. Drescher, A. Eckart, F. Eisenhauer, M. Fabricius, A. Farah, H. Feuchtgruber, N.M. Förster Schreiber, A. Foschi, P. Garcia, R. Garcia Lopez, R. Genzel, S. Gillessen, T. Gomes, F. Gonté, V. Gopinath, J. Graf, M. Hartl, X. Haubois, F. Haußmann, L.C. Ho, S. Hönig, M. Houllé, S. Joharle, C. Keiman, P. Kervella, J. Kolb, L. Kreidberg, A. Labdon, S. Lacour, O. Lai, S. Lai, R. Laugier, J.-B. Le Bouquin, J. Leftley, R. Li, B. Lopez, D. Lutz, F. Mang, A. Mérand, F. Millour, M. Montargès, N. More, N. Morujão, H. Nowacki, M. Nowak, S. Oberti, C. Onken, J. Osorno, T. Ott, T. Paumard, K. Perraut, G. Perrin, R. Petrov, P.-O. Petrucci, N. Pourré, S. Rabien, C. Rau, D. Ribeiro, S. Robbe-Dubois, M. Sadun Bordoni, M. Salman, J. Sanchez-Bermudez, D. Santos, J. Sauter, M. Scialpi, J. Scigliuto, J. Shangguan, P. Shchekaturov, T. Shimizu, F. Soulez, C. Straubmeier, E. Sturm, M. Subroweit, C. Sykes, L.J. Tacconi, H. Übler, G. Ulbricht, F. Vincent, R. Webster, E. Wieprecht, J. Woillez, C. Wolf accepted by A&A (15 pages, 9 figures) Astrophysics of Galaxies (astro-ph.GA) We present the first near-infrared interferometric data of a QSO at z=4. The K-band observations were performed with GRAVITY+ on the VLTI using all four UTs, detecting a differential phase signal that traces the spatially resolved kinematics for both the \\hb\\ and \\hg\\ lines in the broad line region. We fit the two lines simultaneously with an updated model that includes distinct rotating and conical outflowing components. For the best fit model, more than 80\\% of the \\hi\\ line emission from the BLR originates in an outflow with a velocity up to $10^4$ km s$^{-1}$. This is oriented so that our line of sight is along an edge of the conical structure, which produces the prominent blue wing on the line profile. A combination of anisotropic line emission and mid-plane opacity lead to the single-sided phase signal. The model is able to qualitatively match both the outflowing \\civ\\ line profile and the systemic \\oi\\ fluorescent emission. The derived black hole mass of $8\\times10^8$ M$_\\odot$ is the highest redshift black hole mass measurement to date obtained directly from BLR dynamics. It is an order of magnitude lower than that inferred from various single epoch scaling relations, and implies that the accretion is highly super-Eddington. With reference to recent simulations, the data suggest that this QSO is emitting close to its radiative limit in a regime where strong outflows are expected around a polar conical region.",
      "pdf_url": "https://arxiv.org/pdf/2509.13911.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.11779",
      "title": "Spatial Profiles of 3I/ATLAS CN and Ni Outgassing from Keck/KCWI Integral Field Spectroscopy",
      "authors": [
        "W. B. Hoogendam",
        "B. J. Shappee",
        "J. J. Wray",
        "B. Yang",
        "K. J. Meech",
        "C. Ashall",
        "D. D. Desai",
        "K. Hart",
        "J. T. Hinkle",
        "A. Hoffman",
        "E. M. Hu",
        "D. O. Jones",
        "K. Medler"
      ],
      "abstract": "Spatial Profiles of 3I/ATLAS CN and Ni Outgassing from Keck/KCWI Integral Field Spectroscopy W. B. Hoogendam, B. J. Shappee, J. J. Wray, B. Yang, K. J. Meech, C. Ashall, D. D. Desai, K. Hart, J. T. Hinkle, A. Hoffman, E. M. Hu, D. O. Jones, K. Medler 7 pages, 5 figures. To be submitted to the Open Journal of Astrophysics Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Cometary activity from interstellar objects provides a unique window into the environs of other stellar systems. We report blue-sensitive integral field unit spectroscopy of the interstellar object 3I/ATLAS from the Keck-II-mounted Keck Cosmic Web Imager on August 24, 2025 UT. We confirm previously reported CN and Ni outgassing, and present, for the first time, the radial profiles of Ni and CN emission in 3I/ATLAS. We find a characteristic $e$-folding radius of $593.7\\pm14.8$ km for Ni and $841.0\\pm15.4$ km for CN; this suggests that the Ni emission is more centrally concentrated in the nucleus of the comet and favors hypotheses involving easily dissociated species such as metal carbonyls or metal-polycyclic-aromatic-hydrocarbon molecules. Additional integral field spectroscopy after perihelion will offer a continued opportunity to determine the evolution of the radial distributions of species in interstellar comet 3I/ATLAS.",
      "pdf_url": "https://arxiv.org/pdf/2510.11779.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11043",
      "title": "Seeking Spectroscopic Binaries with Data-Driven Models",
      "authors": [
        "Isabel Angelo",
        "Erik Petigura",
        "Megan Bedell"
      ],
      "abstract": "Seeking Spectroscopic Binaries with Data-Driven Models Isabel Angelo, Erik Petigura, Megan Bedell Accepted to ApJ; 19 pages, 11 figures Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) Data-driven stellar classification has a long and important history in astronomy, dating as far back as Annie Jump Cannon's \"by eye\" classifications of stars into spectral types still used today. In recent years, data-driven spectroscopy has proven to be an effective means of deriving stellar properties for large samples of stars, sidestepping issues with computational efficiency, incomplete line lists, and radiative transfer calculations associated with physical stellar models. A logical application of these algorithms is the detection of unresolved stellar binaries, which requires accurate spectroscopic models to resolve flux contributions from a fainter secondary star in the spectrum. Here we use The Cannon to train a data-driven model on spectra from the Keck High Resolution Echelle Spectrometer. We show that our model is competitive with existing data-driven models in its ability to predict stellar properties Teff, stellar radius, [Fe/H], vsin(i), and instrumental PSF, particularly when we apply a novel wavelet-based processing step to spectra before training. We find that even with accurate estimates of star properties, our model's ability to detect unresolved binaries is limited by its approx. 3% accuracy in per-pixel flux predictions, illuminating possible limitations of data-driven model applications.",
      "pdf_url": "https://arxiv.org/pdf/2512.11043.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11120",
      "title": "First Detection of an Ultracool Dwarf at 340 MHz: VLITE Observations of EI Cancri AB",
      "authors": [
        "Michele L. Silverstein",
        "Tracy E. Clarke",
        "Wendy M. Peters",
        "Emil Polisensky",
        "Jackie Villadsen",
        "Jordan M. Stone"
      ],
      "abstract": "First Detection of an Ultracool Dwarf at 340 MHz: VLITE Observations of EI Cancri AB Michele L. Silverstein, Tracy E. Clarke, Wendy M. Peters, Emil Polisensky, Jackie Villadsen, Jordan M. Stone 13 pages, 2 figures, 3 tables, resubmitted to AAS Journals Solar and Stellar Astrophysics (astro-ph.SR) Magnetically driven phenomena such as flaring events and aurorae lead ultracool dwarfs to emit at radio frequencies. Despite decades of scrutiny, a comprehensive physical understanding of their radio emission at different frequencies remains elusive, spurring on additional study of these complex objects. The VLA Low-band Ionosphere and Transient Experiment (VLITE) is a commensal instrument operating at 340 MHz on the Very Large Array. A key advantage of 340 MHz observations is their sensitivity to circumstellar disks and planets at understudied distances from the stellar disk, intermediate between GHz and low MHz sensitivities. Hard-to-find coronal mass ejections are also predicted to be detectable at 340 MHz. However, this frequency regime is relatively unprobed in ultracool dwarf studies, with few searches and no published detections to date. Here we highlight our investigation of the nearby M7-M7 binary, EI Cancri. EI Cancri AB is magnetically active, yet has an uncharacteristically long 83-day candidate rotation period within the system. With the VLITE detection of the EI Cancri system, we present the first ever detection of ultracool dwarf emission at 340 MHz.",
      "pdf_url": "https://arxiv.org/pdf/2512.11120.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11160",
      "title": "The magnetic origin of the outer boundary of sunspots",
      "authors": [
        "Markus Schmassmann , Nazaret Bello González , Jan Jurčák , Rolf Schlichenmaier Institut für Sonnenphysik , Freiburg, Germany, Astronomical Institute of the Czech Academy of Sciences, Ondřejov)"
      ],
      "abstract": "The magnetic origin of the outer boundary of sunspots Markus Schmassmann (1), Nazaret Bello González (1), Jan Jurčák (2), Rolf Schlichenmaier (1) ((1) Institut für Sonnenphysik (KIS), Freiburg, Germany, (2) Astronomical Institute of the Czech Academy of Sciences, Ondřejov) submitted to Astronomy & Astrophysics; 9 pages, 7 figures, 3 tables, incl. appendix; links to 2 videos in the PDF; shortened abstract compared to PDF Solar and Stellar Astrophysics (astro-ph.SR) Context. Sunspot boundaries are commonly outlined by contours of the continuum intensity. However, their magnetic nature has not yet been fully characterised. Aims. We investigate the properties of the outer boundary of a long-lived sunspot to identify the magnetic property that defines it. Methods. We analysed the magnetic properties of AR NOAA11591 spot during its two passages across the solar disc, using SDO/HMI continuum intensity and magnetic field, and determined their contours to outline the outer boundary. Results. During the 1st disc passage, in which the sunspot is in its stable phase, the intensity contours at 0.9 of the mean quiet Sun intensity and isocontours of the magnetic field strength of 625G provide an almost perfect match between the two contours. With these thresholds, the time-averaged area of mismatch is minimised, yielding an average distance between the contours of 0.58 pixel, corresponding to less than 0.26 arcsec. During the 2nd disc passage, the spot shows clear signs of decay, and we find that the 0.9 intensity and 625G magnetic isocontours detach from each other, coupled to the disappearance of penumbra. In this super-equipartition area, granulation still operates. Conclusions. Based on a comparison with simulation data from our previous work, and in agreement with findings of other authors, we conclude that the outer boundary of stable sunspots is defined by an invariant magnetic field: the equipartition field. From the discrepancy between intensity and magnetic contours during the decaying phase of the sunspot, we surmise that alongside the well-established (magneto-)convective regimes of the photosphere - granular, penumbral, and umbral - a super-equipartition granular regime can be identified. In this regime, bright, but smaller granules occur where the magnetic field exceeds equipartition but remains sub-critical for convection suppression.",
      "pdf_url": "https://arxiv.org/pdf/2512.11160.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11182",
      "title": "Free Energy Sources of Ion-scale Waves Observed by Parker Solar Probe",
      "authors": [
        "Niranjana Shankarappa",
        "Kristopher G. Klein",
        "Mihailo M. Martinović",
        "Trevor A. Bowen",
        "Davin E. Larson",
        "Roberto Livi",
        "Ali Rahmati",
        "Phyllis L. Whittlesey",
        "Michael L. Stevens"
      ],
      "abstract": "Free Energy Sources of Ion-scale Waves Observed by Parker Solar Probe Niranjana Shankarappa, Kristopher G. Klein, Mihailo M. Martinović, Trevor A. Bowen, Davin E. Larson, Roberto Livi, Ali Rahmati, Phyllis L. Whittlesey, Michael L. Stevens Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Parker Solar Probe (PSP) observes abundant circularly polarized ion-scale waves throughout the inner heliosphere. These waves are a signature of the interplay between plasma microinstabilities and turbulent dissipation. We perform a mission-wide statistical survey of ion-scale waves observed by PSP, investigating if the waves correspond to specific free energy sources in the measured proton velocity distributions. We find that left-handed waves (LHWs) are frequently observed, with the fraction of time they are observed increasing closer to the Sun, reaching $\\sim$30\\%. Right-handed waves (RHWs) are less frequently observed, with the associated time fraction decreasing closer to the Sun. The observed LHWs are generally consistent with parallel propagating ion cyclotron wave (ICW) storms that occur continuously for extended periods of time. Turbulent energy spectra are consistently steeper when LHW storms are observed; these wave storms mediate the spatial transport of the free energy associated with temperature anisotropy. The observed RHWs are generally consistent with oblique and parallel fast magnetosonic waves (FMWs), and their observation is well correlated with enhanced proton parallel heat flux, which quantifies the presence of secondary proton populations. Using observations and the SAVIC machine learning instability identification algorithm, we identify a threshold on the proton heat flux beyond which FMWs are likely to be driven unstable by the proton beams. We are thus able to associate trends in the observed ion-scale waves with known sources of free energy for Encounters 3 through 24 of the PSP's prime science phase.",
      "pdf_url": "https://arxiv.org/pdf/2512.11182.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11236",
      "title": "The Response of Rotating Stellar Convection to Latitudinally-Varying Heat Flux",
      "authors": [
        "Kinfe Teweldebirhan",
        "Rituparna Curt",
        "Nicholas A. Featherstone"
      ],
      "abstract": "The Response of Rotating Stellar Convection to Latitudinally-Varying Heat Flux Kinfe Teweldebirhan, Rituparna Curt, Nicholas A. Featherstone Solar and Stellar Astrophysics (astro-ph.SR) We investigate how rotating convection responds to the imposition of a latitudinally-varying heat flux at the base of the convective layer. This study is motivated by the solar near-surface shear layer, whose flows are thought to transition from a buoyancy-dominated regime near the photosphere to a rotation-dominated regime at depth. Here, we conduct a suite of spherical 3-D, nonlinear simulations of rotating convection that operate in either the buoyancy-dominated (high-Rossby-number, high-Ro) or rotation-dominated (low-Rossby-number, low-Ro) regime. At the base of each model convection zone, we impose a heat flux whose latitudinal variation is opposite to the variation that the system would ordinarily develop. In both the low- and high-Ro regimes, a strong thermal wind balance is sustained in the absence of forcing. With a larger flux variation, this balance becomes stronger at high latitudes and weaker at low latitudes. The resulting differential rotation weakens in response and, at sufficiently high forcing, its latitudinal variation reverses for both low- and high-Ro systems. At fixed forcing, there exists a Rossby number above which the convective flows efficiently mix heat laterally, and the imposed flux variation does not imprint to the surface. At sufficiently high-Ro, thermal wind balance is no longer satisfied. We discuss these results within the context of the Sun's near-surface region, which possesses a weakened differential rotation when compared to the deep convection, along with little-to-no variation of photospheric emissivity in latitude.",
      "pdf_url": "https://arxiv.org/pdf/2512.11236.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11376",
      "title": "Varying core-envelope coupling efficiency identified from stellar rotation--activity relation",
      "authors": [
        "Henggeng Han",
        "Song Wang",
        "Huiqin Yang",
        "Xue Li",
        "Chuanjie Zheng",
        "Xiangyu Li",
        "Cunshi Wang",
        "Jifeng Liu"
      ],
      "abstract": "Varying core-envelope coupling efficiency identified from stellar rotation--activity relation Henggeng Han, Song Wang, Huiqin Yang, Xue Li, Chuanjie Zheng, Xiangyu Li, Cunshi Wang, Jifeng Liu Solar and Stellar Astrophysics (astro-ph.SR) Core-envelope coupling provides a reasonable explanation of the spin-down stalling of stars in open clusters, which was not predicted by classical gyrochronology. However, it remains an open question whether the coupling efficiency is constant or variable. M dwarfs, possessing thicker convective envelopes and thus longer coupling timescales than other late-type stars, are ideal objects for this investigation. In this letter, we present a new analysis using LAMOST and DESI spectra to construct the rotation--activity ($R_{\\rm{HK}}^{'}$--Ro) relation for M dwarfs. The new relation consists of three distinct regimes of fast, intermediate, and slow rotation, closely matching the three sequences of gyrochronology, namely the ``Convective'' sequence, ``Gap'', and ``Interface'' sequence. Our study reveals, for the first time, a variable activity decay rate in the intermediate-rotation regime (i.e., the ``Gap'' region). This implies a varying core-envelope coupling efficiency, peaking towards the end of this region. It also coincides with the well-known stage of stalled stellar spin-down.",
      "pdf_url": "https://arxiv.org/pdf/2512.11376.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11487",
      "title": "Type II and Type III Solar Radio Burst Classification Using Transfer Learning",
      "authors": [
        "Herman le Roux",
        "Ruhann Steyn",
        "Du Toit Strauss",
        "Mark Daly",
        "Peter T. Gallagher",
        "Jeremiah Scully",
        "Shane A. Maloney",
        "Christian Monstein",
        "Gunther Drevin"
      ],
      "abstract": "Type II and Type III Solar Radio Burst Classification Using Transfer Learning Herman le Roux, Ruhann Steyn, Du Toit Strauss, Mark Daly, Peter T. Gallagher, Jeremiah Scully, Shane A. Maloney, Christian Monstein, Gunther Drevin 18 pages, 4 figures, Solar Physics Springer Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Sun periodically emits intense bursts of radio emission known as solar radio bursts (SRBs). These bursts can disrupt radio communications and be indicative of large solar events that can disrupt technological infrastructure on Earth and in space. The risks posed by these events highlight the need for automated SRB classification, providing the potential to improve event detection and real-time monitoring. This would advance the techniques used to study space weather and related phenomena. A dataset containing images of radio spectra was created using data recorded by the Compound Astronomical Low frequency Low cost Instrument for Spectroscopy and Transportable Observatory (e-Callisto) network. This dataset comprises three categories: empty spectrograms; spectrograms containing Type II SRBs; and spectrograms containing Type III SRBs. These images were used to fine-tune several popular pre-trained deep learning models for classifying Type II and Type III SRBs. The evaluated models included VGGnet-19, MobileNet, ResNet-152, DenseNet-201, and YOLOv8. Testing the models on the test set produced F1 scores ranging from 87\\% to 92\\%. YOLOv8 emerged as the best-performing model among them, demonstrating that using pre-trained models for event classification can provide an automated solution for SRB classification. This approach provides a practical solution to the limited number of data samples available for Type II SRBs.",
      "pdf_url": "https://arxiv.org/pdf/2512.11487.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11728",
      "title": "The Impact of Initial Mass Dependent Convective Boundary Mixing on the Structure and Fates of Massive Stars",
      "authors": [
        "Emily E. Whitehead",
        "Raphael Hirschi",
        "Vishnu Varma",
        "Bernhard Mueller",
        "Federico Rizzuti",
        "Cyril Georgy",
        "W.D. Arnett"
      ],
      "abstract": "The Impact of Initial Mass Dependent Convective Boundary Mixing on the Structure and Fates of Massive Stars Emily E. Whitehead, Raphael Hirschi, Vishnu Varma, Bernhard Mueller, Federico Rizzuti, Cyril Georgy, W.D. Arnett Solar and Stellar Astrophysics (astro-ph.SR) While convection has been known to play a key role in stars for many decades, its implementation in one-dimensional stellar evolution codes still represents a major uncertainty today. The purpose of this work is to investigate the impact of initial mass dependent convective boundary mixing (CBM), often referred to as overshooting, on the frequency and type of nuclear burning shell interactions that occur in low metallicity massive stars and the subsequent effect on their fates. Two grids of models were calculated using the Modules for Experiments in Stellar Astrophysics (MESA) code and a 22-isotope nuclear network, each with a different strength of CBM applied. One grid uses the typical CBM value for diffusive overshooting used in literature whereas the other grid uses CBM values guided by the results of 3D convection simulations. Interactions between the carbon, neon and oxygen shells (C-Ne-O) are common throughout both grids. The higher CBM grid also exhibits more frequent H-He and He-C interactions at lower initial masses than in the lower CBM grid. Several models also undergo multiple interaction events during evolution. While future work will be needed to fully assess the impact of the new CBM and the interactions it leads to, one expects interesting effects like unusual nucleosynthesis including more common or enhanced i- and gamma-process nucleosynthesis. Furthermore, SN precursors and a significant change to the pre-SN structure are also expected, with many models not having the commonly expected onion-ring like structure and having a different explosion probability.",
      "pdf_url": "https://arxiv.org/pdf/2512.11728.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.10130",
      "title": "The AURORA Survey: Constraining Chemical Enrichment Pathways at Cosmic Noon with Argon Abundances",
      "authors": [
        "Jack Foley",
        "Alice Shapley",
        "Ryan Sanders",
        "Naveen A. Reddy",
        "Michael W. Topping",
        "Thomas M. Stanton",
        "Max Pettini",
        "Fergus Cullen",
        "Richard S. Ellis",
        "N. M. Förster Schreiber",
        "Tucker Jones",
        "Anthony J. Pahl",
        "Leonardo Clarke",
        "Natalie Lam"
      ],
      "abstract": "The AURORA Survey: Constraining Chemical Enrichment Pathways at Cosmic Noon with Argon Abundances Jack Foley, Alice Shapley, Ryan Sanders, Naveen A. Reddy, Michael W. Topping, Thomas M. Stanton, Max Pettini, Fergus Cullen, Richard S. Ellis, N. M. Förster Schreiber, Tucker Jones, Anthony J. Pahl, Leonardo Clarke, Natalie Lam 16 pages, 4 figures, 1 table, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present argon abundances from a sample of 46 star-forming galaxies at $z=2-3.5$ from the Assembly of Ultradeep Rest-Optical Observations Revealing Astrophysics (AURORA) program. Although argon is an $\\alpha-$element produced by Core Collapse Supernovae (CCSNe), the latest supernova yield models suggest additional argon production and enrichment by Type Ia supernovae (SNe Ia), unlike other $\\alpha-$elements such as oxygen. To study the relationship between argon and oxygen abundances, we construct two median-stacked composite spectra for separate $z=2.0-2.6$ and $z=2.8-3.5$ redshift bins, presenting more representative measurements than previous samples that require individual detection of faint lines. Abundance ratios were determined using an empirical calibration based on the strength of the [ArIII]$\\lambda7137$ emission line relative to the [OIII]$\\lambda5008$ emission line. With this calibration, we estimate argon abundances (Ar/O) of $0.42^{+0.12}_{-0.10}\\mbox{(Ar/O)}_{\\odot}$ for the $\\langle z \\rangle = 2.26$ bin and $0.42^{+0.12}_{-0.11}\\mbox{(Ar/O)}_{\\odot}$ for the $\\langle z \\rangle = 3.15$ bin, suggesting minimal SNe Ia and dominant CCSNe enrichment in this sample. Comparison of our abundance measurements of $z\\sim 2-3$ AURORA galaxies with chemical evolution modeling of Milky Way stars shows consistency with the Milky Way Bulge component, suggesting a rapid star-formation timescale. However, even larger samples of actively star-forming galaxies with available argon abundances, as well as comparisons between argon abundance and other critical galaxy properties (e.g., sSFR) and models (e.g., one tuned specifically to this redshift range) are needed to draw stronger conclusions on the role of argon in galactic chemical enrichment at Cosmic Noon.",
      "pdf_url": "https://arxiv.org/pdf/2512.10130.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11005",
      "title": "Stellar physics at sub-nanoradian angular resolution",
      "authors": [
        "P. Batista",
        "J. Biteau",
        "C. Carlile",
        "J. Cortina",
        "D. Della Volpe",
        "D. Dravins",
        "M. Fiori",
        "S. Funk",
        "W. Guerin",
        "T. Hassan",
        "C. Ingenhütt",
        "I. Jiménez Martínez",
        "R. Kaiser",
        "G. Koziol",
        "O. Lai",
        "Q. Luce",
        "E. Lyard",
        "R. Mirzoyan",
        "A. W. M. Mitchell",
        "A. Nomerotski",
        "N. Produit",
        "A. Raiola",
        "P. Saha",
        "T. Schweizer",
        "V. Sliusar",
        "A. Spolon",
        "L. Stanic",
        "R. Walter",
        "L. Zampieri",
        "J. von Zanthier",
        "A. Zmija",
        "J. Aufdenberg",
        "C. F. Bender",
        "J. J. Hermes",
        "D. Kieda",
        "M. Lisa",
        "A. Mueninghoff",
        "K. N. Rai",
        "K. van Tilburg"
      ],
      "abstract": "Stellar physics at sub-nanoradian angular resolution P. Batista, J. Biteau, C. Carlile, J. Cortina, D. Della Volpe, D. Dravins, M. Fiori, S. Funk, W. Guerin, T. Hassan, C. Ingenhütt, I. Jiménez Martínez, R. Kaiser, G. Koziol, O. Lai, Q. Luce, E. Lyard, R. Mirzoyan, A. W. M. Mitchell, A. Nomerotski, N. Produit, A. Raiola, P. Saha, T. Schweizer, V. Sliusar, A. Spolon, L. Stanic, R. Walter, L. Zampieri, J. von Zanthier, A. Zmija, J. Aufdenberg, C. F. Bender, J. J. Hermes, D. Kieda, M. Lisa, A. Mueninghoff, K. N. Rai, K. van Tilburg White paper for the ESO call \"What science questions will astronomy need to answer in the 2040s?\" Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Many stars -- if they could be imaged with enough angular resolution -- would exhibit features expected from theory but not possible to extract from spectra. We may group these by increasing complexity as follows. First, smooth variations in brightness across the surface, resembling solar limb darkening but much more prominent and involving more processes in stars with fast spin or external tides. Next, there are periodic features: not only oscillations, but also convective cells and starspots, which appear to transit across a star as its spins, and exoplanets that really do transit across the star. Then, there are transients like flares. Current optical interferometers provide synthetic apertures of a few hundred metres and angular resolutions down to about nanoradian ($\\simeq 0.2\\,$milliarcsecond), enough to resolve some of the above features on the nearest upper main-sequence stars, giants and supergiants. Ongoing projects aims to km-scale synthetic apertures, enough to measure the radius of the nearest white dwarf. In this White Paper we briefly discuss what could be observed with synthetic apertures over $\\sim20\\,$km -- resolving detail on white dwarfs at the level currently possible on supergiants.",
      "pdf_url": "https://arxiv.org/pdf/2512.11005.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11631",
      "title": "UK White Paper on Magnetic Reconnection",
      "authors": [
        "Alexander J. B. Russell",
        "James A. McLaughlin",
        "Philippa Browning",
        "Jennifer Carter",
        "Luca Franci",
        "Heli Hietala",
        "Andrew Hillier",
        "Gunnar Hornig",
        "David MacTaggart",
        "Sarah Matthews",
        "James McKevitt",
        "Eric Priest",
        "Jack Reid",
        "Ben Snow",
        "Julia Stawarz",
        "Anthony Yeates",
        "Jeffersson Andres Agudelo Rueda",
        "William Bate",
        "Giulio Del Zanna",
        "Jonathan Eastwood",
        "Lucie Green",
        "Anshu Kumari",
        "Mike Lockwood",
        "Thomas Neukirch",
        "David Pontin",
        "Andy Smith",
        "Maria-Theresia Walach",
        "Peter Wyper"
      ],
      "abstract": "UK White Paper on Magnetic Reconnection Alexander J. B. Russell, James A. McLaughlin, Philippa Browning, Jennifer Carter, Luca Franci, Heli Hietala, Andrew Hillier, Gunnar Hornig, David MacTaggart, Sarah Matthews, James McKevitt, Eric Priest, Jack Reid, Ben Snow, Julia Stawarz, Anthony Yeates, Jeffersson Andres Agudelo Rueda, William Bate, Giulio Del Zanna, Jonathan Eastwood, Lucie Green, Anshu Kumari, Mike Lockwood, Thomas Neukirch, David Pontin, Andy Smith, Maria-Theresia Walach, Peter Wyper White paper submitted to UK Space Frontiers 2035 on 28 November 2025. A full list of signatories is appended at the end. 6 pages plus title page, list of authors and signatories, and references Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) Magnetic reconnection powers explosive releases of magnetic energy, heating and particle acceleration throughout the plasma universe. Knowledge of this universal process is vital to understanding the Heliosphere, as it plays a key role in solar flares, coronal mass ejections, coronal heating, solar wind acceleration, geomagnetic storms, and interactions between the solar wind and planetary magnetospheres. As such, reconnection underpins multiple science objectives of multiple future space missions. The UK plays a leading role in this international field, through a combination of in situ measurements from Earth's magnetosphere and the solar wind, observations of the solar corona and chromosphere, and world-class numerical simulations and theory. This white paper identifies: Nine priority science objectives for reconnection research in the next decade; Recommendations to guide investment in theory, simulations and infrastructure; Mission priorities and required measurements to ensure the UK maintains and improves its world-class credentials in reconnection science.",
      "pdf_url": "https://arxiv.org/pdf/2512.11631.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.01140",
      "title": "A sudden fine-scale bright kernel captured by Hi-C Flare in 11 MK emission during an M1.6-class solar flare's post-maximum phase",
      "authors": [
        "Sanjiv K. Tiwari",
        "Navdeep K. Panesar",
        "Ronald L. Moore",
        "Sabrina L. Savage",
        "Amy R. Winebarger",
        "Genevieve D. Vigil",
        "Juraj Lorincik",
        "Vanessa Polito",
        "Bart De Pontieu",
        "Leon Golub",
        "Ken Kobayashi",
        "Patrick Champey",
        "Jenna Samra",
        "Anna Rankin",
        "Robert W. Walsh",
        "Crisel Suarez",
        "Christopher S. Moore",
        "Adam R. Kobelski",
        "Jeffery W. Reep",
        "Charles Kankelborg"
      ],
      "abstract": "A sudden fine-scale bright kernel captured by Hi-C Flare in 11 MK emission during an M1.6-class solar flare's post-maximum phase Sanjiv K. Tiwari, Navdeep K. Panesar, Ronald L. Moore, Sabrina L. Savage, Amy R. Winebarger, Genevieve D. Vigil, Juraj Lorincik, Vanessa Polito, Bart De Pontieu, Leon Golub, Ken Kobayashi, Patrick Champey, Jenna Samra, Anna Rankin, Robert W. Walsh, Crisel Suarez, Christopher S. Moore, Adam R. Kobelski, Jeffery W. Reep, Charles Kankelborg With minor updates to the previous version; 15 pages, 7 figures; ApJ Letters: this https URL Solar and Stellar Astrophysics (astro-ph.SR) On April 17, 2024, the third successful Hi-C sounding rocket flight, Hi-C Flare, recorded coronal images in Fe XXI 129 A emission from 11 MK plasma during the post-maximum phase of an M1.6-class solar flare, achieving unprecedented spatial (~300 km) and temporal (1.3 s) resolutions. The flare started at 21:55 UT, peaked at 22:08 UT, and lasted ~40 minutes. Hi-C observed for over five minutes (22:15:45 to 22:21:25), starting roughly eight minutes after flare maximum. A sudden compact bright burst - 875 +/- 25 km wide, lasting 90 +/- 1.3 s, exhibiting a proper motion of ~50 km/s, and splitting into two toward the end - occurs near the foot of some post-flare loops. Its size and brightness are reminiscent of flare-ribbon kernels during a flare's rapid rise phase, kernels marking sites of sudden heating and hot plasma upflow, making its occurrence during the late phase surprising. Such isolated brightenings in a flare's post-maximum phase are rare, and have not been previously reported. The kernel was detected in all SDO/AIA channels. Its 1600 A light curve peaked ~50 s earlier than its 131 A light curve, similar to that of flare-ribbon kernels, albeit with a smaller delay of ~25 s, during the impulsive phase of the flare. In SDO/HMI magnetograms, the kernel sits in unipolar positive magnetic flux near an embedded clump of negative flux. Although localized magnetic reconnection within the kernel (a microflare) cannot be ruled out for its cause, the observations favor the localized brightening being an isolated, exceptionally late flare-ribbon kernel, resulting from an exceptionally late burst of the flare's coronal reconnection.",
      "pdf_url": "https://arxiv.org/pdf/2512.01140.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.09977",
      "title": "Decisively Demonstrating Roman CGI's TTR5 Requirement by Reimaging a Newly-Discovered Brown Dwarf Orbiting a Bright Accelerating Star",
      "authors": [
        "Thayne Currie",
        "Mona El Morsy",
        "Brianna Lacy",
        "Masayuki Kuzuhara",
        "Naoshi Murakami",
        "Danielle Bovie"
      ],
      "abstract": "Decisively Demonstrating Roman CGI's TTR5 Requirement by Reimaging a Newly-Discovered Brown Dwarf Orbiting a Bright Accelerating Star Thayne Currie, Mona El Morsy, Brianna Lacy, Masayuki Kuzuhara, Naoshi Murakami, Danielle Bovie 7 pages, 2 figures, reformatted and updated Roman CGI white paper Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) We propose Roman Coronagraph project HLC/575 nm observations of a newly-discovered brown dwarf (HIP 71618 B) from the Subaru/OASIS survey of young accelerating stars, which is supported by NASA headquarters with the directive to identify targets for the Roman Coronagraph that could fulfill TTR5 requirements and be observed during the technology demonstration phase. The target and multiple bright PSF references are within/close to the Roman Continuous Viewing Zone. A high SNR detection of this companion would singlehandedly fulfill TTR5 and would be the first optical detection of a companion at $<$10$^{-6}$ contrast. Roman CPP reference star vetting prioritizing stars that can be paired with HIP 71618 would aid the execution of a successful technology demonstration. Additional similar targets may be discovered from OASIS over the next few years that could increase CGI scheduling flexibility and enhance its scientific and technical return. A close collaborative partnership with the CPP team could ensure that they are schedulable.",
      "pdf_url": "https://arxiv.org/pdf/2512.09977.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11142",
      "title": "libyt: an In Situ Interface Connecting Simulations with yt, Python, and Jupyter Workflows",
      "authors": [
        "Shin-Rong Tsai",
        "Hsi-Yu Schive",
        "Matthew J. Turk"
      ],
      "abstract": "libyt: an In Situ Interface Connecting Simulations with yt, Python, and Jupyter Workflows Shin-Rong Tsai, Hsi-Yu Schive, Matthew J. Turk Submitted to the Astrophysical Journal Supplement Series (ApJS). 34 pages with 13 figures and 4 tables Instrumentation and Methods for Astrophysics (astro-ph.IM) In the exascale computing era, handling and analyzing massive datasets have become extremely challenging. In situ analysis, which processes data during simulation runtime and bypasses costly intermediate I/O steps, offers a promising solution. We present libyt (this https URL), an open-source C library that enables astrophysical simulations to analyze and visualize data in parallel computation with yt or other Python packages. libyt can invoke Python routines automatically or provide interactive entry points via a Python prompt or a Jupyter Notebook. It requires minimal intervention in researchers' workflow, allowing users to reuse job submission scripts and Python routines. We describe libyt's architecture for parallel computing in high-performance computing environments, including its bidirectional connection between simulation codes and Python, and its integration into the Jupyter ecosystem. We detail its methods for reading AMR simulations and handling in-memory data with minimal overhead, and procedures for yielding data when requested by Python. We describe how libyt maps simulation data to yt frontends, allowing post-processing scripts to be converted into in situ analysis with just two lines of change. We document libyt's API and demonstrate its integration into two astrophysical simulation codes, GAMER and Enzo, using examples including core-collapse supernovae, isolated dwarf galaxies, fuzzy dark matter, the Sod shock tube test, Kelvin-Helmholtz instability, and the AGORA galaxy simulation. Finally, we discuss libyt's performance, limitations related to data redistribution, extensibility, architecture, and comparisons with traditional post-processing approaches.",
      "pdf_url": "https://arxiv.org/pdf/2512.11142.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11202",
      "title": "amc: The Automated Mission Classifier for Telescope Bibliographies",
      "authors": [
        "John F. Wu",
        "Joshua E. G. Peek",
        "Sophie J. Miller",
        "Jenny Novacescu",
        "Achu J. Usha",
        "Christopher A. Wilkinson"
      ],
      "abstract": "amc: The Automated Mission Classifier for Telescope Bibliographies John F. Wu, Joshua E. G. Peek, Sophie J. Miller, Jenny Novacescu, Achu J. Usha, Christopher A. Wilkinson Accepted to IJCNLP-AACL WASP 2025 workshop. Code available at: this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI); Digital Libraries (cs.DL); Machine Learning (cs.LG) Telescope bibliographies record the pulse of astronomy research by capturing publication statistics and citation metrics for telescope facilities. Robust and scalable bibliographies ensure that we can measure the scientific impact of our facilities and archives. However, the growing rate of publications threatens to outpace our ability to manually label astronomical literature. We therefore present the Automated Mission Classifier (amc), a tool that uses large language models (LLMs) to identify and categorize telescope references by processing large quantities of paper text. A modified version of amc performs well on the TRACS Kaggle challenge, achieving a macro $F_1$ score of 0.84 on the held-out test set. amc is valuable for other telescopes beyond TRACS; we developed the initial software for identifying papers that featured scientific results by NASA missions. Additionally, we investigate how amc can also be used to interrogate historical datasets and surface potential label errors. Our work demonstrates that LLM-based applications offer powerful and scalable assistance for library sciences.",
      "pdf_url": "https://arxiv.org/pdf/2512.11202.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI",
        "cs.DL",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11313",
      "title": "The Simons Observatory: Development of a Pipeline to Detect Rapid Transients in Time-Ordered Data",
      "authors": [
        "Justin Clancy",
        "Carlo Bacciagalupi",
        "Josh Borrow",
        "Nadia Dachlythra",
        "Allen M. Foster",
        "Yilun Guan",
        "Carlos Hervias-Caimapo",
        "Adam D. Hincks",
        "Renee Hlozek",
        "Erika Hornecker",
        "Kevin M. Huffenberger",
        "Simran K. Nerval",
        "John Orlowski-Scherer",
        "Mike W. Peel",
        "Christian L. Reichardt",
        "Cristian Vargas"
      ],
      "abstract": "The Simons Observatory: Development of a Pipeline to Detect Rapid Transients in Time-Ordered Data Justin Clancy, Carlo Bacciagalupi, Josh Borrow, Nadia Dachlythra, Allen M. Foster, Yilun Guan, Carlos Hervias-Caimapo, Adam D. Hincks, Renee Hlozek, Erika Hornecker, Kevin M. Huffenberger, Simran K. Nerval, John Orlowski-Scherer, Mike W. Peel, Christian L. Reichardt, Cristian Vargas Instrumentation and Methods for Astrophysics (astro-ph.IM) We introduce a method for detecting astrophysical transients evolving on timescales of milliseconds to minutes using cosmic microwave background (CMB) survey telescopes. While previous transient searches in CMB data operate in map space, our pipeline directly processes the raw time-ordered data, enabling sensitivity to fast, dynamic signals. We integrate our detection approach into the Simons Observatory time-domain pipeline and assess the performance on simulated observations with injected stellar flare-like light curves. For events flaring with a timescale of 0.5 s, the pipeline detects $\\gtrsim90$% of events at flux densities of 800, 1150, 1650, and 4250 mJy when measured in the 93, 145, 225, and 280 GHz bands respectively. For longer $\\ge5$ second flares, the 90% detection thresholds are reduced by a factor of four. We are able to determine the position of detected events in each observing band, with a positional uncertainty at the detection threshold comparable to the telescope resolution at that band. These results demonstrate the readiness of this pipeline for incorporation into upcoming Simons Observatory data analyses.",
      "pdf_url": "https://arxiv.org/pdf/2512.11313.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11064",
      "title": "An Open Benchmark of One Million High-Fidelity Cislunar Trajectories",
      "authors": [
        "Travis Yeager",
        "Denvir Higgins",
        "Peter Mcgill",
        "Kerianne Pruett",
        "Alexx Perloff",
        "Tara Grice",
        "Michael Schneider"
      ],
      "abstract": "An Open Benchmark of One Million High-Fidelity Cislunar Trajectories Travis Yeager, Denvir Higgins, Peter Mcgill, Kerianne Pruett, Alexx Perloff, Tara Grice, Michael Schneider Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Cislunar space spans from geosynchronous altitudes to beyond the Moon and will underpin future exploration, science, and security operations. We describe and release an open dataset of one million numerically propagated cislunar trajectories generated with the open-source Space Situational Awareness Python package (SSAPy). The model includes high-degree Earth/Moon gravity, solar gravity, and Earth/Sun radiation pressure; other planetary gravities are omitted by design for computational efficiency. Initial conditions uniformly sample commonly used osculating-element ranges, and each trajectory is propagated for up to six years under a single, fixed start epoch. The dataset is intended as a reusable benchmark for method development (e.g., space domain awareness, navigation, and machine learning pipelines), a reference library for statistical studies of orbit families, and a starting point for community-driven extensions (e.g., alternative epochs). We report empirically observed stability trends (e.g., a band near 5 GEO and persistence of some co-orbital classes including L4/L5 librators) as dataset descriptors rather than new dynamical results. The chief contribution is the scale, fidelity, organization (CSV/HDF5 with full state time series and metadata), and open availability, which together lower the barrier to comparative and data-driven studies in the cislunar regime.",
      "pdf_url": "https://arxiv.org/pdf/2512.11064.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11292",
      "title": "CPI-C: Cool Planet Imaging Coronagraph on Chinese Space Station Survey Telescope",
      "authors": [
        "Jiangpei Dou",
        "Xi Zhang",
        "Gang Zhao",
        "Mingming Xu",
        "Zhen Wu",
        "Gang Wang",
        "Baoning Yuan",
        "Lingyi Kong",
        "Yiming Zhu",
        "Bingli Niu",
        "Zhonghua Lv",
        "Yongjun Qi",
        "Shu Jiang",
        "Bo Chen",
        "Wei Guo",
        "Di Wang",
        "Yinglu Lin",
        "Liping Zheng",
        "Jing Guo",
        "Ruokun Li",
        "Liyan Xu",
        "Huihai Wu",
        "Cheng Wen",
        "Shuwei Miao",
        "Boyang Lv",
        "Weimiao Li"
      ],
      "abstract": "CPI-C: Cool Planet Imaging Coronagraph on Chinese Space Station Survey Telescope Jiangpei Dou, Xi Zhang, Gang Zhao, Mingming Xu, Zhen Wu, Gang Wang, Baoning Yuan, Lingyi Kong, Yiming Zhu, Bingli Niu, Zhonghua Lv, Yongjun Qi, Shu Jiang, Bo Chen, Wei Guo, Di Wang, Yinglu Lin, Liping Zheng, Jing Guo, Ruokun Li, Liyan Xu, Huihai Wu, Cheng Wen, Shuwei Miao, Boyang Lv, Weimiao Li 41 pages, 27 figures, accepted by Research in Astronomy and Astrophysics Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Cool Planet Imaging Coronagraph (CPI-C) on Chinese Space Station Survey Telescope (CSST) is proposed to direct image the cool planets around nearby solar-type stars (within 40 pc). The core scientific objective of CPI-C is to conduct high-contrast directly imaging surveys of exoplanets ranging in size from Neptune-like to Jupiter-like, located at separations of 0.5 to 5 AU from their host stars, and to perform systematic spectroscopic analysis of the detected planets through high-precision multi-band photometry. CPI-C employs a step-transmission apodization technique to suppress the diffraction noises from the telescope pupil and a precise phase correction technique to eliminate the speckle noises due to imperfections of the optical surfaces. The contrast requirement is better than $10^{-8}$ at an inner working angle (IWA) of $3-4\\lambda/D$, in the visible wavelength from 600 nm to 900 nm. CPI-C will be the first space-based instrument capable of directly imaging the reflection light from the cool exoplanets in the visible wavelength enabling the measurement of key physical parameters such as the effective temperature, surface gravity, radius, mass, and other key parameters. The potential observation results will significantly contribute to further understand the formation and evolution mechanisms of planets, which will also lay a solid foundation for future confirmation of the Earth-twins in the next generation space flagship missions.",
      "pdf_url": "https://arxiv.org/pdf/2512.11292.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11365",
      "title": "Temporal Substepping Scheme for Magnetohydrodynamics with Cell-based Adaptive Mesh Refinement on Staggered Grid",
      "authors": [
        "Ilja Honkonen",
        "Riku Jarvinen",
        "David Phillips"
      ],
      "abstract": "Temporal Substepping Scheme for Magnetohydrodynamics with Cell-based Adaptive Mesh Refinement on Staggered Grid Ilja Honkonen, Riku Jarvinen, David Phillips Space Physics (physics.space-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Computational Physics (physics.comp-ph); Plasma Physics (physics.plasm-ph) We present a new algorithm for numerical magnetohydrodynamics on staggered meshes preserving $\\nabla \\cdot B = 0$. Our algorithm is based on the constrained transport method and supports both cell-based adaptive mesh refinement and temporal substepping. We handle resolution changes directly on the logically Cartesian grid without needing interpolation or projection between nested or neighboring grids, nor coupling the solution between refinement levels.",
      "pdf_url": "https://arxiv.org/pdf/2512.11365.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/1806.08050",
      "title": "Portable Adaptive Optics for Exoplanet Imaging",
      "authors": [
        "Yongtian Zhu",
        "Jiangpei Dou",
        "Xi Zhang",
        "Gang Zhao",
        "Jing Guo",
        "Leopoldo Infante"
      ],
      "abstract": "Portable Adaptive Optics for Exoplanet Imaging Yongtian Zhu, Jiangpei Dou, Xi Zhang, Gang Zhao, Jing Guo, Leopoldo Infante 12 pages, 12 figures, 3 tables, published in RAA Res. Astron. Astrophys. 21 082 (2021) Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) The Portable Adaptive Optics (PAO) is a low-cost and compact system, designed for 4-meter class telescopes that have no Adaptive Optics (AO), because of the physical space limitation at the Nasmyth or Cassegrain focus and the historically high cost of the conventional AO. The initial scientific observations of the PAO are focused on the direct imaging of exoplanets and sub-stellar companions. This paper discusses the PAO concept and the associated high-contrast imaging performance in our recent observational runs. PAO is delivering a Strehl ratio better than $60\\%$ in $H$ band under median seeing conditions of $1 ''$. Combined with our dedicated image rotation and subtraction (IRS) technique and the optimized IRS (O-IRS) algorithm, the averaged contrast ratio for a $5\\leq V\\rm_{mag} \\leq 9$ primary star is $1.3 \\times 10^{-5}$ and $3.3 \\times 10^{-6}$ at angular distance of $0.36 ''$ under exposure time of 7 minutes and 2 hours, respectively. PAO has successfully revealed the known exoplanet of $\\kappa$ And b, in our recent observation at 3.5-meter ARC telescope at Apache Point Observatory. We have performed the associated astrometry and photometry analysis of the recovered $\\kappa$ And b planet, which gives a projected separation of $0.984 \\pm 0.05 ''$, a position angle of $51.1 \\pm 0.5^{\\circ}$, and a mass of $10.15_{-1.255}^{+2.19}M_{\\rm Jup}$. These results demonstrate that PAO can be used for direct imaging of exoplanets with medium-sized telescopes.",
      "pdf_url": "https://arxiv.org/pdf/1806.08050.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.18333",
      "title": "Estimation of Temporal Muon Signals in Water-Cherenkov Detectors of the Surface Detector of the Pierre Auger Observatory",
      "authors": [
        "Margita Kubátová"
      ],
      "abstract": "Estimation of Temporal Muon Signals in Water-Cherenkov Detectors of the Surface Detector of the Pierre Auger Observatory Margita Kubátová (for the Pierre Auger Collaboration) Presented at the 2nd European AI for Fundamental Physics Conference (EuCAIFCon2025). Submission to SciPost Physics Proceedings Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Experiment (hep-ex) The Surface Detector (SD) of the Pierre Auger Observatory is a 3000 km$^2$ array of stations, whose main components are Water-Cherenkov Detectors (WCDs) recording ground-level signals from Extensive Air Showers (EASs) initiated by Ultra-High-Energy Cosmic Rays (UHECRs). Understanding the physics of UHECRs requires knowledge of their mass composition, for which the number of ground muons is a key probe. Isolating the muon component is difficult, as different types of particles contribute to the SD signal. We apply a recurrent neural network to estimate the muon content of the SD signals, showing small bias in simulations and weak dependence on selected hadronic interaction model.",
      "pdf_url": "https://arxiv.org/pdf/2509.18333.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11181",
      "title": "Mantle Differentiation, Mixing and Interior-Exterior Exchange",
      "authors": [
        "Takashi Nakagawa",
        "Charitra Jain",
        "Diogo L. Lourenco",
        "Maxim D. Baller",
        "Paul J. Tackley"
      ],
      "abstract": "Mantle Differentiation, Mixing and Interior-Exterior Exchange Takashi Nakagawa, Charitra Jain, Diogo L. Lourenco, Maxim D. Baller, Paul J. Tackley Chapter 2.4 in The Archean Earth 2nd edition (2025) Earth and Planetary Astrophysics (astro-ph.EP) We review the formation of large-scale heterogeneity in the solid Earth from the magma ocean phase to the present day, focusing on lower-mantle structure and evolution, as well as continental formation and its impact on interior-exterior volatile exchange. The solidification of the magma ocean sets the \"initial condition\" for solid-state mantle structure and evolution, partitioning volatiles between the surface and interior, and differentiating major and trace elements between mantle reservoirs. A possibly long-lived basal magma ocean is a potential reservoir for iron and incompatible trace elements with important implications for the present-day structure of the lowermost mantle and the distribution of heat-producing elements. With emergent plate tectonics and mantle convection, the production of oceanic crust is the dominant differentiation mechanism, and may contribute to lower-mantle heterogeneity. In turn, convection acts to re-mix heterogeneity. Thus, the structure of the lower mantle records the early differentiation of our planet, as well as long-term evolution. The formation of continental crust and lithosphere has also an important influence on deep-mantle structure and composition, because the distribution of continents can control the scale of plate tectonics, and thus affect mantle convection patterns. While the formation of continental crust and lithosphere, scenarios can be tested by self-consistent long-term evolution models. The exchange of water between the surface and mantle also plays an important role in the dynamics of Earth\\' s deep interior. By using relative sea-level change as a proxy for the interior-exterior exchange of water, it is possible to constrain the deep-mantle water cycle. Based on a comprehensive review of these topics, we conclude with several open questions that should be addressed by future studies.",
      "pdf_url": "https://arxiv.org/pdf/2512.11181.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11204",
      "title": "On the Border: Searching for Cometary Activity Near the Centaur-JFC Transition Line",
      "authors": [
        "A. Fraser Gillan",
        "Alan Fitzsimmons",
        "Colin Orion Chandler",
        "Colin Snodgrass",
        "Joseph Murtagh"
      ],
      "abstract": "On the Border: Searching for Cometary Activity Near the Centaur-JFC Transition Line A. Fraser Gillan, Alan Fitzsimmons, Colin Orion Chandler, Colin Snodgrass, Joseph Murtagh Accepted for publication in The Planetary Science Journal (PSJ) Earth and Planetary Astrophysics (astro-ph.EP) Current wide-field surveys discover ~15 Jupiter-family comets (JFCs) each year, typically identified via visual detection of a dust coma or tail. The same surveys also discover many asteroids that have distant JFC-like orbits, but with no reported activity. We observed asteroids on Jupiter-crossing orbits beyond the depth of typical survey imaging using the 2.5 m Isaac Newton Telescope. We used deep imaging to observe 16 asteroids in this region, plus 7 known comets for comparison. Three asteroids (2011 WM183, (669525) 2012 XO144, and 2020 RX133) showed surface brightness profiles consistent with low-level activity, equating to ~19% of our total sample. We note that 2020 RX133 is a Jupiter Trojan. When we considered the heliocentric distance range of the asteroids at the time they showed activity, this fraction increased to 33% of the targets in the 3.16 \\leq Rh \\leq 4.56 au region, and therefore it is possible to infer that at least ~30 asteroids with Tj \\leq 3.05 and in the 4.05 < a < 5.05 au parameter space may potentially exhibit low-level activity. We also estimated nuclear radii for the three active targets of r_n = 1.8 \\pm 0.2 km, r_n \\leq 0.8 km, and r_n \\leq 0.5 km for (669525) 2012 XO144, 2011 WM183, and 2020 RX133 respectively. The median color index for the observed asteroids is (g-r)_{PS1} = 0.52 \\pm 0.13, aligning with those expected for D-type asteroids.",
      "pdf_url": "https://arxiv.org/pdf/2512.11204.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11459",
      "title": "A review on combinatorial approach to aggregation",
      "authors": [
        "Michał Łepek",
        "Agata Fronczak",
        "Piotr Fronczak"
      ],
      "abstract": "A review on combinatorial approach to aggregation Michał Łepek, Agata Fronczak, Piotr Fronczak 34 pages, 19 figures, a mini-review on the combinatorial solutions to the Marcus-Lushnikov irreversible aggregation Statistical Mechanics (cond-mat.stat-mech); Earth and Planetary Astrophysics (astro-ph.EP); Soft Condensed Matter (cond-mat.soft); Mathematical Physics (math-ph); Chemical Physics (physics.chem-ph) Recently, a combinatorial approach to discrete, finite, and irreversibly aggregating systems has been progressively developed. In this work, we review its achievements up to the present moment, focusing on the practical aspects and discussing its limitations. First, we present the assumptions and combinatorial foundations of the approach, which are based on direct counting of the system states, in contrast to the previous approaches of Smoluchowski and Marcus--Lushnikov. A method to obtain combinatorial expressions for the average number of clusters of a given size and the corresponding standard deviation is described by solving the simplest example of a constant kernel. Then, we extend consideration to a number of kernels (e.g., additive, product, linear--chain, condensation), which were recently solved by explicitly finding the number of internal states of the cluster of a given size. Next, we show that theoretical predictions for any given kernel may be obtained with no need to find an explicit solution but using a recursive expression. We exploit this opportunity to present the use of combinatorial expressions to solve kernels related to the real processes of aerosol growth and planetesimal formation. At this point, a comparison to numerical results appears. Other potential application fields are indicated, including dust agglomeration and polymer growth. Finally, issues related to the varying precision of the theoretical predictions are summarized. In the last section, we propose open problems.",
      "pdf_url": "https://arxiv.org/pdf/2512.11459.pdf",
      "categories": [
        "astro-ph.EP",
        "math-ph"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.06480",
      "title": "Slantwise convection and heat transport in icy moon oceans",
      "authors": [
        "Yaoxuan Zeng",
        "Malte F. Jansen"
      ],
      "abstract": "Slantwise convection and heat transport in icy moon oceans Yaoxuan Zeng, Malte F. Jansen Earth and Planetary Astrophysics (astro-ph.EP); Fluid Dynamics (physics.flu-dyn) Ocean heat transport on icy moons shapes the ice shell topography, a primary observable of these moons. Two key processes control the heat transport: baroclinic instability driven by surface buoyancy contrasts and convective instability driven by heating from the core. However, global ocean simulations cannot accurately resolve convection under realistic icy moon conditions and instead often use Earth-based convective parameterizations, which capture only vertical convective mixing and cannot represent rotation-aligned slantwise convection on icy moons. We use high-resolution convection-resolving simulations to investigate ocean heat transport by slantwise convection in a parameter regime relevant to icy moons, isolated from baroclinic instability. Total heat transport follows the Coriolis-Inertial-Archimedean scaling with an added latitude dependence. The vertical transport increases with latitude, and the meridional transport is poleward. These results indicate that slantwise convection redistributes heat toward the poles, favoring a poleward-thinning ice shell, qualitatively consistent with Enceladus's observed ice thickness distribution.",
      "pdf_url": "https://arxiv.org/pdf/2508.06480.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24839",
      "title": "Non-linear spiral waves in accretion discs",
      "authors": [
        "Joshua J. Brown",
        "Gordon I. Ogilvie"
      ],
      "abstract": "Non-linear spiral waves in accretion discs Joshua J. Brown, Gordon I. Ogilvie 35 pages, 21 figures, accepted MNRAS Earth and Planetary Astrophysics (astro-ph.EP) We derive a simple, accurate, non-linear, global equation governing spiral density waves in thin, non-self-gravitating, inviscid accretion discs. These discs may have any slowly varying surface density or temperature profile. For specific 'self-similar' disc profiles, solutions to our equation match (novel) smooth non-linear exact spiral solutions derived via a separate method, which highlight that non-linear spiral waves need not shock. Indeed, at low amplitudes, we find that dispersion can overcome wave steepening, and may prevent the inner spiral wakes excited by low mass planets (below roughly 1% of a thermal mass) embedded in protoplanetary discs from shocking. At high amplitudes, we find a simple universal description of non-linear spiral waves with shocks, as well as caps on the possible amplitude and wave action flux of non-linear spirals both with and without shocks, depending on how many arms they have. We further find that highly non-linear spirals are far more loosely wound than their linear counterparts. These developments shed light on why two-armed spirals are prevalent across a range of astrophysical systems which don't necessarily possess an intrinsic twofold symmetry, and why they appear surprisingly loosely wound in observations. These results are supported by very high-resolution numerical simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.24839.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.03128",
      "title": "Characterization of debris disks observed with SPHERE",
      "authors": [
        "N. Engler",
        "J. Milli",
        "N. Pawellek",
        "R. Gratton",
        "P. Thébault",
        "C. Lazzoni",
        "J. Olofsson",
        "H. M. Schmid",
        "S. Ulmer-Moll",
        "C. Perrot",
        "J.-C. Augereau",
        "S. Desidera",
        "G. Chauvin",
        "M. Janson",
        "C. Xie",
        "Th. Henning",
        "A. Boccaletti",
        "S. B. Brown-Sevilla",
        "E. Choquet",
        "C. Dominik",
        "M. Samland",
        "A. Zurlo",
        "M. Feldt",
        "T. Fusco",
        "C. Ginski",
        "J. H. Girard",
        "D. Gisler",
        "R. G. van Holstein",
        "A.-M. Lagrange",
        "M. Langlois",
        "A.-L. Maire",
        "D. Mesa",
        "P. Rabou",
        "L. Rodet",
        "T. Schmidt",
        "A. Vigan"
      ],
      "abstract": "Characterization of debris disks observed with SPHERE N. Engler, J. Milli, N. Pawellek, R. Gratton, P. Thébault, C. Lazzoni, J. Olofsson, H. M. Schmid, S. Ulmer-Moll, C. Perrot, J.-C. Augereau, S. Desidera, G. Chauvin, M. Janson, C. Xie, Th. Henning, A. Boccaletti, S. B. Brown-Sevilla, E. Choquet, C. Dominik, M. Samland, A. Zurlo, M. Feldt, T. Fusco, C. Ginski, J. H. Girard, D. Gisler, R. G. van Holstein, A.-M. Lagrange, M. Langlois, A.-L. Maire, D. Mesa, P. Rabou, L. Rodet, T. Schmidt, A. Vigan 57 pages, 33 figures, 13 tables Earth and Planetary Astrophysics (astro-ph.EP) This study aims to characterize debris disks observed with SPHERE across multiple programs, with the goal of identifying systematic trends in disk morphology, dust mass, and grain properties as a function of stellar parameters. We analyzed a sample of 161 young stars using SPHERE observations at optical and near-IR wavelengths. Disk geometries were derived from ellipse fitting and model grids, while dust mass and properties were constrained by modified blackbody (MBB) and size distribution (SD) modeling of SEDs. The dynamical modeling was performed to assess whether the observed disk structures can be explained by the presence of unseen planets. We resolved 51 debris disks, including four new detections: HD 36968, BD-20 951, and the inner belts of HR 8799 and HD 36546. In addition, we found a second transiting giant planet in the HD 114082 system, with a radius of 1.29 $R_{\\rm Jup}$ and an orbital distance of ~1 au. We identified nine multi-belt systems, with outer-to-inner belt radius ratios of $1.5-2$, and found close agreement between scattered-light and millimeter-continuum belt radii. They scale weakly with stellar luminosity ($R_{\\rm belt} \\propto L_{\\star}^{0.11}$), but show steeper dependencies when separated by CO and CO$_2$ freeze-out regimes. Disk fractional luminosities follow collisional decay trends, declining as $t_{\\rm age}^{-1.18}$ for A and $t_{\\rm age}^{-0.81}$ for F stars. The inferred dust masses span $10^{-5}-1\\,M_\\oplus$ from MBB and $0.01-1\\,M_\\oplus$ from SD modeling. These masses scale as $R_{\\rm belt}^n$ with $n>2$ in belt radius and super-linearly with stellar mass, consistent with trends seen in protoplanetary disks. Analysing correlation between disk polarized flux and IR excess, we found an offset of ~1 dex between total-intensity (HST) and polarized fluxes. A new parametric approach to estimate dust albedo and maximum polarization fraction is introduced.",
      "pdf_url": "https://arxiv.org/pdf/2512.03128.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}