{
  "date": "2025-10-16",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.SR",
    "astro-ph.HE",
    "astro-ph.CO",
    "astro-ph.GA",
    "astro-ph.EP",
    "astro-ph.IM"
  ],
  "total_papers": 108,
  "gw_related_papers": 5,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.12881",
      "title": "Revealing evolution of Dark Energy density from observations",
      "authors": [
        "José Blanco",
        "Víctor H. Cárdenas an Cauhtémoc Campuzano"
      ],
      "abstract": "Revealing evolution of Dark Energy density from observations José Blanco, Víctor H. Cárdenas an Cauhtémoc Campuzano Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present a model--independent reconstruction of the normalized dark energy density function, $X(z) \\equiv \\rho_{\\mathrm{de}}(z)/\\rho_{\\mathrm{de}}(0)$, derived directly from the DES-SN5YR Type~Ia supernova sample. The analysis employs an inversion formalism that relates the derivative of the distance modulus, $\\mu^{\\prime}(z)$, to the expansion history, allowing the data to determine the shape of $X(z)$ without assuming a specific equation--of--state or dark energy density parameterization. A statistically optimized binning of the supernova sample (using 17 intervals following the Freedman--Diaconis criterion and 34 following Scott's rule) ensures a stable estimation of $\\mu^{\\prime}(z)$ and a controlled propagation of uncertainties throughout the inversion process. The resulting $X(z)$ remains statistically consistent with a constant value within one standard deviation across the entire redshift range, showing no significant evidence for an evolving dark energy component at present. In a direct comparison among $\\Lambda$CDM, CPL, and the quadratic $X^2(z)$ parameterization -- where CPL and $X^2(z)$ each introduce two additional free parameters relative to $\\Lambda$CDM -- the CPL model attains the best statistical agreement with the data, albeit only marginally and strictly within this restricted model set. These outcomes indicate that current observations are compatible with an almost constant dark energy density ($w \\simeq -1$), while the inversion framework remains sensitive to subtle departures that forthcoming high--precision surveys could resolve.",
      "pdf_url": "https://arxiv.org/pdf/2510.12881.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12984",
      "title": "When Tiny Halos Stir Spacetime: Gravitational Waves from Fifth-Force Mergers",
      "authors": [
        "Xinpeng Wang",
        "Yifan Lu",
        "Zachary S. C. Picker",
        "Alexander Kusenko",
        "Misao Sasaki"
      ],
      "abstract": "When Tiny Halos Stir Spacetime: Gravitational Waves from Fifth-Force Mergers Xinpeng Wang, Yifan Lu, Zachary S. C. Picker, Alexander Kusenko, Misao Sasaki Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Dark matter fermions interacting via attractive fifth forces mediated by a light mediator can form dark matter halos in the very early universe. We show that bound systems composed of these halos are capable of generating gravitational wave (GW) signals detectable today, even when the individual halos are very light. The Yukawa force dominates the dynamics of these halo binaries, rather than gravity. As a result, large GW signals can be produced at initially extremely high frequencies, which are then redshifted to frequency bands accessible to current or future GW observatories. In addition, the resulting GW signals carry distinctive features that enable future observations to distinguish them from conventional ones. Notably, even if only a tiny fraction of dark matter experiences strong fifth-force interactions, such effects provide a new avenue to discover self-interacting dark matter through GW observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.12984.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.13066",
      "title": "Gravitational-Wave Signatures of Highly Eccentric Stellar-Mass Binary Black Holes in Galactic Nuclei",
      "authors": [
        "Evgeni Grishin",
        "Isobel M. Romero-Shaw",
        "Alessandro A. Trani"
      ],
      "abstract": "Gravitational-Wave Signatures of Highly Eccentric Stellar-Mass Binary Black Holes in Galactic Nuclei Evgeni Grishin, Isobel M. Romero-Shaw, Alessandro A. Trani MNRAS submitted, comments welcome! High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) A significant fraction of compact-object mergers in galactic nuclei are expected to be eccentric in the Laser-Interferometer-Space-Antenna (LISA) frequency sensitivity range, $10^{-4} - 10^{-1}\\ \\rm Hz$. Several compact binaries detected by the LIGO-Virgo-KAGRA Collaboration may retain hints of residual eccentricity at $10$~Hz, suggesting dynamical or triple origins for a significant fraction of the gravitational-wave-observable population. In triple systems, von-Zeipel-Lidov-Kozai oscillations perturb both the eccentricity and the argument of pericentre, $\\omega$, of the inner black hole binary. The latter could be fully \\textit{circulating}, where $\\omega$ cycles through $2\\pi$, or may \\textit{librate}, with $\\omega$ ranges about a fixed value with small or large variation. We use \\texttt{TSUNAMI}, a regularised N-body code with up to 3.5 post-Newtonian (PN) term corrections, to identify four different families of orbits: (i) circulating, (ii) small and (iii) large amplitude librating, and (iv) merging orbits. We develop and demonstrate a new method to construct gravitational waveforms using the quadrupole formula utilising the instantaneous {\\it total} acceleration of each binary component in \\texttt{TSUNAMI}. We show that the four orbital families have distinct waveform phenomenologies, enabling them to be distinguished if observed in LISA. The orbits are also distinguishable from an isolated binary or from a binary perturbed by a different tertiary orbit, even if the secular timescale is the same. Future burst timing models will be able to distinguish the different orbital configurations. For efficient binary formation, about $\\sim 50$ binaries can have librating orbits in the Galactic Centre.",
      "pdf_url": "https://arxiv.org/pdf/2510.13066.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.11758",
      "title": "Reconstruction of dark energy and late-time cosmic expansion using the Weighted Function Regression method",
      "authors": [
        "Alex González-Fuentes",
        "Adrià Gómez-Valent"
      ],
      "abstract": "Reconstruction of dark energy and late-time cosmic expansion using the Weighted Function Regression method Alex González-Fuentes, Adrià Gómez-Valent 44 pages, 10 figures, 7 tables. Added references and comments. New appendices A and C Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Recent data from multiple supernova catalogs and DESI, when combined with CMB, suggest a non-trivial evolution of dark energy (DE) at the $2.5-4\\sigma$ CL. This evidence is typically quantified using the CPL parametrization of the DE equation-of-state parameter which corresponds to a first-order Taylor expansion around $a = 1$. However, this truncation is to some extent arbitrary and may bias our interpretation of the data, potentially leading us to mistake spurious features of the best-fit CPL model for genuine physical properties of DE. In this work, we apply the Weighted Function Regression (WFR) method to eliminate the subjectivity associated with the choice of truncation order. We assign Bayesian weights to the various orders and compute weighted posterior distributions of the quantities of interest. Using this model-agnostic approach, we reconstruct some of the most relevant background quantities, examining the robustness of our results against variations in the CMB and SNIa likelihoods. Furthermore, we extend our analysis by allowing for negative DE. Our results corroborate previous indications of dynamical DE, now confirmed for the first time using the WFR method. The combined analysis of CMB, BAO, and SNIa data favors a DE component that transitions from phantom to quintessence at redshift $z_{\\rm cross}\\sim 0.4$. The probability of phantom crossing lies between 96.21% and 99.97%, depending on the SNIa data set used, and hence a simple monotonic evolution of the DE density is excluded at the $\\sim 2-4\\sigma$ CL. Moreover, we find no significant evidence for a negative dark energy density below $z\\sim 2.5-3$. Our reconstructions do not address the Hubble tension, yielding values of $H_0$ consistent with the Planck/$\\Lambda$CDM range. If SH0ES measurements are not affected by systematic biases, the evidence for dynamical dark energy may need to be reassessed. [abridged]",
      "pdf_url": "https://arxiv.org/pdf/2506.11758.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.10514",
      "title": "Evidence for Evolving Dark Energy from LRG1-2 and Low-$z$ SNe Ia Data",
      "authors": [
        "Himanshu Chaudhary",
        "Salvatore Capozziello",
        "Vipin Kumar Sharma",
        "Isidro Gómez-Vargas",
        "G. Mustafa"
      ],
      "abstract": "Evidence for Evolving Dark Energy from LRG1-2 and Low-$z$ SNe Ia Data Himanshu Chaudhary, Salvatore Capozziello, Vipin Kumar Sharma, Isidro Gómez-Vargas, G. Mustafa Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We present observational evidences indicating that dark energy may be evolving with time, thereby challenging the core assumptions of the standard $\\Lambda$CDM model. Our investigation extends beyond the standard $\\Lambda$CDM model by exploring a range of dynamical dark energy models. Our analysis reveals that the predicted value of the matter density parameter $\\Omega_m$ by the DESI DR2 LRG1 and LRG3+ELG1 datapoints deviates from the standard $\\Lambda$CDM prediction and from different supernova compilations. We find that analyzing the LRG1 and LRG2 tracers strongly affects the model predictions especially $\\omega_0$, which shifts from $-1$ to slightly higher values. This suggests that the evidence of evolving dark energy in the DESI DR2 data is driven by the LRG1 and LRG2 tracers. When we exclude low-redshift supernovae data, particularly from the DES-SN5YR compilation, the model predictions are restored to the $\\Lambda$CDM paradigm. This effect is particularly evident in the GEDE model, where removing low-redshift supernovae data leads to $\\Delta = 0$, effectively recovering $\\Lambda$CDM paradigm. Our analysis confirms that the evidence for dynamical dark energy is substantial, particularly at low redshift ($z \\lesssim 0.3$). The reconstruction of $\\omega(z)$ and $f_{DE}(z)$, using a combination of DESI DR2 BAO measurements, CMB distance priors, and supernovae datasets, further supports the evolving nature dark energy. These results favor a dynamical dark-energy scenario characterized by $\\omega_0>-1$, $\\omega_a<0$, and $\\omega_0+\\omega_a<-1$ (Quintom-B). Bayesian analysis of model evidence reveals that the inclusion of low-redshift supernovae data significantly strengthens the support for evolving dark energy models such as JBP and Mirage, while models revert to inconclusive or weak support when low-redshift data are excluded.",
      "pdf_url": "https://arxiv.org/pdf/2508.10514.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12865",
      "title": "Probabilistic Inference of Cosmological Density Parameters from Synthetic Hubble Expansion Data of Varying SNR Using Diverse Artificial Neural Network Architectures",
      "authors": [
        "Zijian Jin",
        "Jaehyon Rhee"
      ],
      "abstract": "Probabilistic Inference of Cosmological Density Parameters from Synthetic Hubble Expansion Data of Varying SNR Using Diverse Artificial Neural Network Architectures Zijian Jin, Jaehyon Rhee 14 pages, 3 figures, 8 tables, submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) This paper builds upon ParamANN's novel approach (S. Pal & R. Saha 2024) of using ANNs to infer cosmological density parameters by determining optimal architecture for varying synthetic Hubble data SNRs in estimating the density parameters $\\Omega_{m, 0}$ and $\\Omega_{\\Lambda, 0}$ across redshift values $z \\in [0, 1]$. To generate the synthetic data, this study randomly sampled initial free parameter values at $z=0$ from theoretically motivated priors and evolved them backwards using the first Friedmann Equation to generate clean $H(z)$ curves. Then, this paper adds realistic noise of high, normal, and low SNR by sampling relative uncertainties from a Gaussian KDE on 47 real data observations compiled by A. Bouali et al. (2023). In the end, this study found that a RNN that uses BiLSTM is the most effective for high and normal SNR data across four quantitative metrics. On the other hand, a combination of convolution and recurrent layers that uses GRU performed the best for low SNR data across the same four metrics. A comparison between the results of this paper's ANN predictions and those of ParamANN shows that all architectures tested in this paper regardless of training SNR are statistically consistent within 1 standard deviation of ParamANN. However, most ANN results are not statistically consistent within 3 standard deviations of Planck Collaboration et al. (2020), showing a significant difference between ANN and the more traditional MCMC methods used by Planck collaboration.",
      "pdf_url": "https://arxiv.org/pdf/2510.12865.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13121",
      "title": "Strong Progenitor Age-bias in Supernova Cosmology. II. Alignment with DESI BAO and Signs of a Non-Accelerating Universe",
      "authors": [
        "Junhyuk Son",
        "Young-Wook Lee",
        "Chul Chung",
        "Seunghyun Park",
        "Hyejeon Cho"
      ],
      "abstract": "Strong Progenitor Age-bias in Supernova Cosmology. II. Alignment with DESI BAO and Signs of a Non-Accelerating Universe Junhyuk Son, Young-Wook Lee, Chul Chung, Seunghyun Park, Hyejeon Cho Published in MNRAS, 10 figures, 2 tables, Cosmology and Nongalactic Astrophysics (astro-ph.CO) Supernova (SN) cosmology is based on the key assumption that the luminosity standardization process of Type Ia SNe remains invariant with progenitor age. However, direct and extensive age measurements of SN host galaxies reveal a significant (5.5{\\sigma}) correlation between standardized SN magnitude and progenitor age, which is expected to introduce a serious systematic bias with redshift in SN cosmology. This systematic bias is largely uncorrected by the commonly used mass-step correction, as progenitor age and host galaxy mass evolve very differently with redshift. After correcting for this age-bias as a function of redshift, the SN dataset aligns more closely with the w0waCDM model recently suggested by the DESI BAO project from a combined analysis using only BAO and CMB data. This result is further supported by an evolution-free test that uses only SNe from young, coeval host galaxies across the full redshift range. When the three cosmological probes (SNe, BAO, CMB) are combined, we find a significantly stronger (> 9{\\sigma}) tension with the {\\Lambda}CDM model than that reported in the DESI papers, suggesting a time-varying dark energy equation of state in a currently non-accelerating universe.",
      "pdf_url": "https://arxiv.org/pdf/2510.13121.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13129",
      "title": "Numerical Cosmology",
      "authors": [
        "Romain Teyssier"
      ],
      "abstract": "Lectures given at the Les Houches Summer School \"The Dark Universe\" July/August 2025. 44 pages and 10 figures (excluding references). Prepared for submission to SciPost Physics Lecture Notes Cosmology and Nongalactic Astrophysics (astro-ph.CO) In these lecture notes, we describe the current state-of-the-art for numerical simulations of large-scale structure and galaxy formation. Numerical simulations play a central role in the preparation and the exploitation of large-scale galaxy surveys, in which galaxies are the fundamental observational objects. We first describe basic methods for collisionless N-body dynamics that enable us to model dark matter accurately by solving the Vlasov-Poisson equations. We then discuss simple methods to populate dark matter halos with galaxies, such as Halo and Sub-halo Abundance Matching techniques and baryonification techniques for capturing baryonic effects on the matter distribution. We finally describe how to model the gas component by solving the Euler-Poisson equations, focusing on the foundational assumptions behind these equations, namely local thermo-dynamical equilibrium, and the nature of the truncation errors of the numerical scheme, namely numerical diffusion. We show a few examples of simulations of a Milky-Way-like halo without cooling, with cooling and with star formation. We finally describe different subgrid prescriptions recently developed to model star formation, supernovae feedback and active galactic nuclei and how they impact cosmological simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.13129.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13294",
      "title": "Global linear analysis of the magneto-thermal instability in a stratified spherical model of the intracluster medium",
      "authors": [
        "J.M. Kempf",
        "H. Latter"
      ],
      "abstract": "Global linear analysis of the magneto-thermal instability in a stratified spherical model of the intracluster medium J.M. Kempf, H. Latter 20 pages, 6 figures, accepted for publication in A&A, arXiv abstract slightly shortened Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) The buoyancy stability properties of the ICM are modified because of the anisotropic transport of heat along the magnetic field lines. This feature gives rise to the MTI when the temperature gradient is aligned with the gravity, which occurs in the outskirts of galaxy clusters. Most previous linear analyses of the MTI adopted a local, Boussinesq approach. However, the conduction length, which sets the characteristic length scale of the MTI, might be a non-negligible fraction of the scale height in the ICM. We want to assess the impact of locality assumptions on the linear physics of the MTI. Another goal is to unveil the deeper connections between these global MTI modes and their MRI counterparts in accretion discs. Our third objective is to provide a new benchmark against which any numerical code implementing the Braginskii heat flux in spherical geometry can be tested. We perform a global linear analysis of the MTI in a spherical stratified model of the ICM. We use a combination of analytical results, corroborated by numerical results obtained with both a pseudo-spectral solver and IDEFIX, to better explain the physics of the global MTI modes. We obtain scaling laws and approximate expressions for the growth rates of the global modes. We show that the associated functions are confined within an inner region, limited by a turning point, where the mode is allowed to grow. The most unstable local MTI modes correspond to the portion of the global mode localised near the turning point. This phenomenology is similar to that of the global MRI modes. Finally, direct simulations successfully reproduce the global MTI modes and their growth rates, with errors smaller than 1%. Overall, this study provides us with new insights on the linear theory of the global MTI in the ICM, and a useful numerical test bench for any astrophysical fluid dynamics code embedding anisotropic heat flux.",
      "pdf_url": "https://arxiv.org/pdf/2510.13294.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13436",
      "title": "Examining a new form of non-standard dark matter using DESI DR2 data",
      "authors": [
        "Yan-Hong Yao",
        "Yi-Hao Shen",
        "Tian-Nuo Li",
        "Guo-Hong Du",
        "Yungui Gong"
      ],
      "abstract": "Examining a new form of non-standard dark matter using DESI DR2 data Yan-Hong Yao, Yi-Hao Shen, Tian-Nuo Li, Guo-Hong Du, Yungui Gong Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work, we propose a non-standard dark matter (NSDM) model in which the equation of state (EoS) of dark matter (DM) is parameterized as $w_{\\rm dm} = w_2 a^2$, and this DM model is motivated by the idea that DM must become cold dark matter (CDM) in the neighborhood of the scale factor $a = 0$, which implies that both the EoS of DM, $w_{\\rm dm}$, and its derivative with respect to the scale factor, ${\\rm d}w_{\\rm dm}/{\\rm d}a$, vanish at $a = 0$. By incorporating the latest cosmological datasets -- including the Planck2018 Cosmic Microwave Background (CMB) distance priors, the Baryon Acoustic Oscillation measurements from the Data Release 2 of the Dark Energy Spectroscopic Instrument (DESI), together with three independent Type Ia Supernova datasets, namely the Dark Energy Survey Year 5 (DESY5) compilation, the Union3 compilation, and the PantheonPlus sample -- we constrain the $\\Lambda w_2$DM, $ww_2$DM, and $w_0w_aw_2$DM models, which are constructed by replacing CDM with NSDM in the $\\Lambda $CDM, $w$CDM, and $w_0w_a$CDM models, respectively. We find that there is a preference for a negative DM EoS at more than the $3\\sigma$ confidence level for the data combinations CMB+DESI+Union3 and CMB+DESI+DESY5. Moreover, for all data combinations, replacing CDM with NSDM in the $w$CDM and $w_0w_a$CDM models significantly reduces the probability of violating the null energy condition. Furthermore, both $ww_2$DM and $w_0w_aw_2$DM are favored over $\\Lambda $CDM with a significance comparable to that of the $w_0w_a$CDM model.",
      "pdf_url": "https://arxiv.org/pdf/2510.13436.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13477",
      "title": "Probing Primordial black holes with the distortion of Stochastic Gravitational Wave Background",
      "authors": [
        "Mingqi Sun",
        "Liao Kai",
        "Xi-Long Fan"
      ],
      "abstract": "Probing Primordial black holes with the distortion of Stochastic Gravitational Wave Background Mingqi Sun, Liao Kai, Xi-Long Fan Cosmology and Nongalactic Astrophysics (astro-ph.CO) The stochastic gravitational-wave background (SGWB), arising from the incoherent superposition of numerous compact binary coalescences, serves as a powerful probe of both astrophysical populations and fundamental physics. In this work, we investigate the influence of gravitational lensing on the SGWB, focusing on primordial black holes (PBHs) as potential lenses. Assuming PBHs as dark matter candidates with a broad cosmic distribution, we show that their lensing optical depth can be significantly enhanced, producing pronounced effects with relative deviations at the 10^-1 level. By systematically varying the PBH mass (M_PBH) and abundance (f_PBH), we demonstrate that the mass predominantly determines the frequency-dependent diffraction features of the spectrum, while the abundance primarily amplifies the overall lensing-induced deviation. Although the SGWB from binary black holes has not yet been observed, our analytical results provide theoretical insight into the possible imprint of lensing on its spectrum and suggest that future detections could offer a novel avenue to constrain dark matter scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2510.13477.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.13509",
      "title": "Euclid: Exploring observational systematics in cluster cosmology -- a comprehensive analysis of cluster counts and clustering",
      "authors": [
        "A. Fumagalli",
        "M. Costanzi",
        "T. Castro",
        "A. Saro",
        "S. Borgani",
        "M. Romanello",
        "F. Marulli",
        "E. Tsaprazi",
        "P. Monaco",
        "B. Altieri",
        "A. Amara",
        "L. Amendola",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "A. Balestra",
        "S. Bardelli",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H. M. Courtois",
        "A. Da Silva",
        "H. Degaudenzi",
        "S. de la Torre",
        "G. De Lucia",
        "A. M. Di Giorgio",
        "H. Dole",
        "M. Douspis",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "S. Dusini",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "P. Fosalba",
        "N. Fourmanoit",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "L. Guzzo",
        "S. V. H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "B. Kubik",
        "M. Kümmel",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti",
        "D. Maino",
        "E. Maiorano",
        "O. Mansutti",
        "O. Marggraf",
        "M. Martinelli",
        "N. Martinet",
        "R. J. Massey",
        "E. Medinaceli",
        "S. Mei",
        "Y. Mellier",
        "M. Meneghetti",
        "E. Merlin"
      ],
      "abstract": "Euclid: Exploring observational systematics in cluster cosmology -- a comprehensive analysis of cluster counts and clustering A. Fumagalli (1 and 2), M. Costanzi (3 and 1 and 4), T. Castro (1 and 5 and 4 and 6), A. Saro (3 and 4 and 1 and 5 and 6), S. Borgani (3 and 4 and 1 and 5 and 6), M. Romanello (7 and 8), F. Marulli (9 and 8 and 10), E. Tsaprazi (11), P. Monaco (3 and 1 and 5 and 4 and 6), B. Altieri (12), A. Amara (13), L. Amendola (14), S. Andreon (15), N. Auricchio (8), C. Baccigalupi (4 and 1 and 5 and 16), M. Baldi (7 and 8 and 10), A. Balestra (17), S. Bardelli (8), A. Biviano (1 and 4), E. Branchini (18 and 19 and 15), M. Brescia (20 and 21), S. Camera (22 and 23 and 24), G. Cañas-Herrera (25 and 26 and 27), V. Capobianco (24), C. Carbone (28), J. Carretero (29 and 30), S. Casas (31), M. Castellano (32), G. Castignani (8), S. Cavuoti (21 and 33), K. C. Chambers (34), A. Cimatti (35), C. Colodro-Conde (36), G. Congedo (37), L. Conversi (38 and 12), Y. Copin (39), F. Courbin (40 and 41), H. M. Courtois (42), A. Da Silva (43 and 44), H. Degaudenzi (45), S. de la Torre (46), G. De Lucia (1), A. M. Di Giorgio (47), H. Dole (48), M. Douspis (48), F. Dubath (45), C. A. J. Duncan (37 and 49), X. Dupac (12), S. Dusini (50), S. Escoffier (51), M. Farina (47), R. Farinelli (8), F. Faustini (32 and 52), S. Ferriol (39), F. Finelli (8 and 53), P. Fosalba (54 and 55), N. Fourmanoit (51), M. Frailis (1), E. Franceschi (8), M. Fumana (28), S. Galeotta (1), K. George (56), B. Gillis (37), C. Giocoli (8 and 10), J. Gracia-Carpio (57), A. Grazian (17), F. Grupp (57 and 56), L. Guzzo (58 and 15 and 59), S. V. H. Haugan (60), W. Holmes (61), F. Hormuth (62), A. Hornstrup (63 and 64), K. Jahnke (65), M. Jhabvala (66), B. Joachimi (67), E. Keihänen (68), S. Kermiche (51), A. Kiessling (61), B. Kubik (39), M. Kümmel (56), M. Kunz (69), H. Kurki-Suonio (70 and 71), A. M. C. Le Brun (72), S. Ligori (24), P. B. Lilje (60), V. Lindholm (70 and 71), I. Lloro (73), G. Mainetti (74), D. Maino (58 and 28 and 59), E. Maiorano (8), O. Mansutti (1), O. Marggraf (75), M. Martinelli (32 and 76), N. Martinet (46), R. J. Massey (77), E. Medinaceli (8), S. Mei (78 and 79), Y. Mellier (80 and 81), M. Meneghetti (8 and 10), E. Merlin Cosmology and Nongalactic Astrophysics (astro-ph.CO) This study explores the impact of observational and modelling systematic effects on cluster number counts and cluster clustering and provides model prescriptions for their joint analysis, in the context of the \\Euclid survey. Using 1000 \\Euclid-like cluster catalogues, we investigate the effect of systematic uncertainties on cluster summary statistics and their auto- and cross-covariance, and perform a likelihood analysis to evaluate their impact on cosmological constraints, with a focus on the matter density parameter $\\Omega_{\\rm m}$ and on the power spectrum amplitude $\\sigma_8$. Combining cluster clustering with number counts significantly improves cosmological constraints, with the figure of merit increasing by over 300\\% compared to number counts alone. We confirm that the two probes are uncorrelated, and the cosmological constraints derived from their combination are almost insensitive to the cosmology dependence of the covariance. We find that photometric redshift uncertainties broaden cosmological posteriors by 20--30\\%, while secondary effects like redshift-space distortions (RSDs) have a smaller impact on the posteriors -- 5\\% for clustering alone, 10\\% when combining probes -- but can significantly bias the constraints if neglected. We show that clustering data below $60\\,h^{-1}\\,$Mpc provides additional constraining power, while scales larger than acoustic oscillation scale add almost no information on $\\Omega_{\\rm m}$ and $\\sigma_8$ parameters. RSDs and photo-$z$ uncertainties also influence the number count covariance, with a significant impact, of about 15--20\\%, on the parameter constraints.",
      "pdf_url": "https://arxiv.org/pdf/2510.13509.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13752",
      "title": "Effects of primordial magnetic fields on 21 cm multifrequency angular power spectra",
      "authors": [
        "Kerstin E. Kunze"
      ],
      "abstract": "Effects of primordial magnetic fields on 21 cm multifrequency angular power spectra Kerstin E. Kunze Cosmology and Nongalactic Astrophysics (astro-ph.CO) The cosmic 21 cm line signal of neutral hydrogen provides the possibility to constrain the matter power spectrum. Primordial magnetic fields present before decoupling have an effect on the linear matter power spectrum. The redshifted 21 cm line signal is observed at different frequencies allowing to determine multifrequency angular power spectra. These are presented for cosmological models including the adiabatic, primordial curvature mode as well as the compensated magnetic mode for different values of the magnetic field parameters. For multifrequency angular power spectra frequency ranges have been set around central frequencies of uGMRT Band 3 data as well as MeerKAT L band data. For these signal-over-noise ratios are obtained as well as for SKA1-MID which is part of the currently under construction SKAO.",
      "pdf_url": "https://arxiv.org/pdf/2510.13752.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13803",
      "title": "Density reconstruction from biased tracers: Testing the equivalence principle through consistency relations",
      "authors": [
        "Lawrence Dam",
        "Omar Darwish"
      ],
      "abstract": "Density reconstruction from biased tracers: Testing the equivalence principle through consistency relations Lawrence Dam, Omar Darwish Cosmology and Nongalactic Astrophysics (astro-ph.CO) Consistency relations of large-scale structure offer a unique and powerful test of the weak equivalence principle (EP) on cosmological scales. If the EP is violated, different tracers will undergo different accelerations in response to a uniform gravitational field, and this loss of universality manifests as a dipole with a characteristic $1/K$ scale dependence in the squeezed limit of the bispectrum. In this work we show that such a violation can be identified with a particular anti-symmetric {modulation} in the local cross-power spectrum of distinct tracers. Based on this observation, we propose to test the EP using quadratic estimators as a more practical alternative to the conventional approach of directly estimating the bispectrum. We apply our quadratic estimator to a DESI-like survey and forecast constraints on the overall amplitude of EP violation. Including mildly nonlinear scales in our reconstruction ($k_\\mathrm{max}\\simeq0.15\\, h\\,\\mathrm{Mpc}^{-1}$), we find that our estimator is competitive with the more exhaustive direct bispectrum approach. This means surveys like DESI can already benefit from the quadratic estimator approach.",
      "pdf_url": "https://arxiv.org/pdf/2510.13803.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13805",
      "title": "$\\texttt{SBi3PCF:}$ Simulation-based inference with the integrated 3PCF",
      "authors": [
        "David Gebauer",
        "Anik Halder",
        "Stella Seitz",
        "Dhayaa Anbajagane"
      ],
      "abstract": "$\\texttt{SBi3PCF:}$ Simulation-based inference with the integrated 3PCF David Gebauer, Anik Halder, Stella Seitz, Dhayaa Anbajagane 28 pages + appendix. 21 figures. Comments are welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present $\\texttt{SBi3PCF}$, a simulation-based inference (SBI) framework for analysing a higher-order weak lensing statistic, the integrated 3-point correlation function (i3PCF). Our approach forward-models the cosmic shear field using the $\\texttt{CosmoGridV1}$ suite of N-body simulations, including a comprehensive set of systematic effects such as intrinsic alignment, baryonic feedback, photometric redshift uncertainty, shear calibration bias, and shape noise. Using this, we have produced a set of DES Y3-like synthetic measurements for 2-point shear correlation functions $\\xi_{\\pm}$ (2PCFs) and i3PCFs $\\zeta_{\\pm}$ across 6 cosmological and 11 systematic parameters. Having validated these measurements against theoretical predictions and thoroughly examined for potential systematic biases, we have found that the impact of source galaxy clustering and reduced shear on the i3PCF is negligible for Stage-III surveys. Furthermore, we have tested the Gaussianity assumption for the likelihood of our data vector and found that while the sampling distribution of the 2PCF can be well approximated by a Gaussian function, the likelihood of the combined 2PCF + i3PCF data vector including filter sizes of $90'$ and larger can deviate from this assumption. Our SBI pipeline employs masked autoregressive flows to perform neural likelihood estimation and is validated to give statistically accurate posterior estimates. On mock data, we find that including the i3PCF yields a substantial $63.8\\%$ median improvement in the figure of merit for $\\Omega_m - \\sigma_8 - w_0$. These findings are consistent with previous works on the i3PCF and demonstrate that our SBI framework can achieve the accuracy and realism needed to analyse the i3PCF in wide-area weak lensing surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.13805.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12860",
      "title": "Spatial Variations of Polarized Synchrotron Emission in the QUIJOTE MFI Data",
      "authors": [
        "J. M. Casas",
        "L. Bonavera",
        "J. González-Nuevo",
        "J. A. Rubiño-Martín",
        "R. T. Génova-Santos",
        "R. B. Barreiro",
        "M. M. Cueli",
        "D. Crespo",
        "R. Fernández-Fernández",
        "J. A. Cano"
      ],
      "abstract": "Spatial Variations of Polarized Synchrotron Emission in the QUIJOTE MFI Data J. M. Casas, L. Bonavera, J. González-Nuevo, J. A. Rubiño-Martín, R. T. Génova-Santos, R. B. Barreiro, M. M. Cueli, D. Crespo, R. Fernández-Fernández, J. A. Cano Submitted to Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Polarized synchrotron emission from ultra-relativistic electrons spiraling the Galactic magnetic field has become one of the most relevant emissions in the Interstellar medium these last years due to the improvement in the quality of low-frequency observations. One of the recent experiments designed to explore this emission is the QUIJOTE experiment. We aim to study the spatial variations of the synchrotron emission in the QUIJOTE MFI data, by dividing the sky into physically separated regions. For such task, we firstly use a novel component separation method based on artificial neural networks to clean the synchrotron maps. After training the network with simulations, we fit both $EE$ and $BB$ spectra by assuming a power-law model. Then, we give estimations for the index $\\alpha_{S}$, the amplitude, and the ratio between $B$ and $E$ amplitudes. When analyzing the real data, we found a clear spatial variation of the synchrotron properties along the sky at 11 GHz, obtaining a steeper index in the Galactic plane of $\\alpha_{S}^{EE} = -3.1 \\pm 0.3$ and $\\alpha_{S}^{BB} = -3.1 \\pm 0.4$ and a flatter one at high Galactic latitudes of $\\alpha_{S}^{EE} = -3.05 \\pm 0.2$ and $\\alpha_{S}^{B} = -2.98 \\pm 0.27$. We found average values at all sky of $\\alpha_{S}^{EE} = -3.04 \\pm 0.21$ and $\\alpha_{S}^{BB} = -3.00 \\pm 0.34$. Furthermore, after obtaining an average value of $A_{S}^{EE} = 3.31 \\pm 0.08$ $\\mu K^{2}$ and $A_{S}^{BB} = 0.93 \\pm 0.02$ $\\mu K^{2}$, we estimate a ratio between $B$ and $E$ amplitudes of $A_{S}^{BB}/A_{S}^{EE} = 0.28 \\pm 0.08$. Based on the results we conclude that, although neural networks seem to be valuable methods to apply on real ISM observations, combined analyses with Planck, WMAP and/or CBASS data are mandatory to reduce the contamination from QUIJOTE maps and then improve the accuracy of the estimations.",
      "pdf_url": "https://arxiv.org/pdf/2510.12860.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12932",
      "title": "Strategy for identifying Vera C. Rubin Observatory kilonova candidates for targeted gravitational-wave searches",
      "authors": [
        "Simon Stevenson",
        "Anais Möller",
        "Jade Powell"
      ],
      "abstract": "Strategy for identifying Vera C. Rubin Observatory kilonova candidates for targeted gravitational-wave searches Simon Stevenson, Anais Möller, Jade Powell High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Since the observation of the binary neutron star merger GW170817 and the associated kilonova AT2017gfo, the next joint gravitational-wave/optical kilonova has been highly anticipated. Overlapping observations between the Vera C. Rubin Observatory and the international gravitational-wave detector network are expected soon. Wide-field survey facilities, such as Rubin, can serve dual roles in gravitational-wave astronomy: conducting dedicated optical counterpart searches following gravitational-wave triggers and, through surveys such as the Legacy Survey of Space and Time (LSST), providing opportunities for fortuitous kilonova discoveries during routine operations. We use simulations to develop a strategy for identifying kilonova candidates observed by Rubin and processed by the Fink broker. These candidates can be used as astrophysical triggers for a targeted gravitational-wave search. We simulate kilonovae light-curves for the first year of Rubin with the latest observing strategy for the Wide-Fast-Deep and the Deep Drilling Fields. Assuming a kilonova rate of 250 Gpc$^{-3}$ yr$^{-1}$, we find that Rubin brokers should observe $\\sim 4$ kilonovae per year with at least one alert above a signal-to-noise ratio of 5 within the gravitational-wave detector horizon ($\\sim 350$ Mpc). Most of these will be faint, and detected 1-2 days following the neutron star merger. Photometric and spectroscopic follow-up will be limited to large telescopes. Using archival data from the Zwicky Transient Facility (ZTF) and our proposed selection criteria, we estimate a minimum contamination of at least 30 events per month from other transients and variables, even under our strictest selection criteria. A deep gravitational-wave search targeting Rubin kilonova candidates may lead to the next multi-messenger discovery.",
      "pdf_url": "https://arxiv.org/pdf/2510.12932.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.12991",
      "title": "Probing the magneto-ionic medium of the Milky Way using pulsars",
      "authors": [
        "Saakshi Dhakal",
        "Amit Seta"
      ],
      "abstract": "Probing the magneto-ionic medium of the Milky Way using pulsars Saakshi Dhakal, Amit Seta 16 pages, 6 figures, accepted in MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Magnetic fields are fundamental to the dynamics of the interstellar medium (ISM) in spiral galaxies and are often separated into large-scale, regular ($\\boldsymbol{B}$) and small-scale, random ($\\boldsymbol{b}$) components. The thermal electron density, $n_{\\rm e}$, can also be divided into large-scale, diffuse, $\\langle n_{\\rm e} \\rangle$, and small-scale, clumpy, $\\delta n_{\\rm e}$, components. Estimating the properties of $b$ and $\\delta n_{\\rm e}$ from observations, even within the Milky Way, has long been challenging. This work addresses the challenge using pulsars, which probe the Milky Way's magneto-ionic medium. Using data of more than 1200 pulsars from the Australia Telescope National Facility pulsar catalogue, we combine dispersion (${\\rm DM}$) and rotation (${\\rm RM}$) measures with theoretical models to estimate both small- and large-scale properties of the Galactic magnetic field and thermal electron density. We find no significant correlation between the average parallel magnetic field strength, $\\langle B_{\\parallel} \\rangle [\\mu{\\rm G}] = 1.232\\,{\\rm RM}\\,[{\\rm rad\\,m^{-2}}]/{\\rm DM}\\,[{\\rm pc\\,cm^{-3}}]$, and pulsar distance. For pulsars within $20\\,{\\rm kpc}$, we estimate $|B| \\approx 1.2\\,\\mu{\\rm G}$ and $\\langle n_{\\rm e} \\rangle \\approx 0.05\\,{\\rm cm}^{-3}$. More importantly, we determine correlation lengths of small-scale components, $\\ell_{b} \\approx 20$ -- $30\\,{\\rm pc}$ and $\\ell_{\\delta n_{\\rm e}} \\approx 250$ -- $300\\,{\\rm pc}$. At smaller distances, $B$ remains roughly constant, while $\\langle n_{\\rm e} \\rangle$ increases and both length scales decrease. These results refine our understanding of fundamental scales in the magneto-ionic medium, aiding the interpretation of extragalactic ${\\rm RM}$s and providing insights into the role of magnetic fields in galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.12991.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13140",
      "title": "Galaxy Protoclusters as Drivers of Cosmic Reionization: I. Bubble Overlap at Redshift z ~ 7 in LAGER-z7OD1",
      "authors": [
        "Crystal L. Martin",
        "Weida Hu",
        "Isak G. B. Wold",
        "Andreas Faisst",
        "Cristobal Moya-Sierralta",
        "Sangeeta Malhotra",
        "James E. Rhoads",
        "Luis Felipe Barrientos",
        "Yuichi Harikane",
        "Leopoldo Infante",
        "Anton Koekemoer",
        "Jorge Gonzalez Lopez",
        "Masami Ouchi",
        "Junyan Xu",
        "Jiayang Yang",
        "L. Y. Aaron Yung",
        "John R. Weaver",
        "Henry McCrackenm",
        "Zhenya Zheng"
      ],
      "abstract": "Galaxy Protoclusters as Drivers of Cosmic Reionization: I. Bubble Overlap at Redshift z ~ 7 in LAGER-z7OD1 Crystal L. Martin, Weida Hu, Isak G. B. Wold, Andreas Faisst, Cristobal Moya-Sierralta, Sangeeta Malhotra, James E. Rhoads, Luis Felipe Barrientos, Yuichi Harikane, Leopoldo Infante, Anton Koekemoer, Jorge Gonzalez Lopez, Masami Ouchi, Junyan Xu, Jiayang Yang, L. Y. Aaron Yung, John R. Weaver, Henry McCrackenm, Zhenya Zheng Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Since the launch of JWST, the sample size of reionization-era Lyman-alpha-emitters (LAEs) has been steadily growing; yet inferences about the neutral hydrogen fraction in the intergalactic medium exhibit increasing variance at redshift z ~ 7, possibly indicating significant field-to-field fluctuations in the progression of cosmic reionization. In this paper, we present new JWST/NIRSpec and Keck/LRIS spectra of nine LAEs in the redshift z ~ 7 protocluster, LAGER-z7OD1. Measurements of Lyman-alpha-transmission and Lyman-alpha velocity offset along multiple sightlines map the Lyman-alpha damping wing optical depth across the galaxy overdensity. In the standard context of inside-out ionization, we estimate radii of ionized bubbles (R(min) = 0.07 - 0.69 Mpc) based on the distance from each LAE to the first neutral patch along the sightline. The resulting 3D topology reveals three distinct sub-clusters where the ionized bubbles are approaching overlap. Five of the nine LAEs plausibly ionized their bubbles, a few bursts of star formation and a modest escape fraction are sufficient. We demonstrate, however, that the actual ionized volumes are likely larger, at least R(ism) = 0.42 - 1.29 Mpc, based on an empirical model for interstellar attenuation of Lyman-alpha. Modeling galactic attenuation of Lyman-alpha significantly increases the inferred intergalactic transmission (thus enlarging the ionized pathlength). The errorbars on the reddening correction allow fully overlapping bubbles, and our results are consistent with accelerated reionization in the protocluster.",
      "pdf_url": "https://arxiv.org/pdf/2510.13140.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13187",
      "title": "Some problems associated with the standardization of the light curve of type 1a supernovae",
      "authors": [
        "A. P. Mahtessian",
        "G. S. Karapetian",
        "H. F. Khachatryan",
        "M. A. Hovhannisyan",
        "L. A. Mahtessian",
        "L. E. Byzalov",
        "J. M. Sarkissian"
      ],
      "abstract": "Some problems associated with the standardization of the light curve of type 1a supernovae A. P. Mahtessian, G. S. Karapetian, H. F. Khachatryan, M. A. Hovhannisyan, L. A. Mahtessian, L. E. Byzalov, J. M. Sarkissian High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We show that the parameters used to standardize the luminosity of Type 1a supernovae in the SALT2 and SiFTO models are strongly dependent on the redshift z. Consequently, when standardized with increasing z, the average absolute magnitudes of Type 1a supernovae are artificially increased. This means that for a given apparent magnitude they are, on average, assigned larger distances than they actually are, creating the appearance of their recession with acceleration and requiring the introduction of the concept of antigravity (dark energy) to explain it. We also show that after standardization, Type 1a supernovae cease to be standard candles. We therefore argue that such a standardization is not suitable for measuring the distances to Type 1a supernovae, and hence the accelerating expansion of the Universe is called into question.",
      "pdf_url": "https://arxiv.org/pdf/2510.13187.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.09893",
      "title": "Modified gravity constraints with Planck ISW-lensing bispectrum",
      "authors": [
        "Anton Chudaykin",
        "Martin Kunz",
        "Julien Carron"
      ],
      "abstract": "Modified gravity constraints with Planck ISW-lensing bispectrum Anton Chudaykin, Martin Kunz, Julien Carron 12+1 pages, 5 figures, 3 tables; v2: minor corrections, results unchanged; v3: matched version accepted by Phys. Rev. D Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We present updated constraints on modified gravity by including the Integrated Sachs-Wolfe (ISW) effect from CMB lensing-CMB temperature cross-correlations, based on the latest Planck PR4 maps. Utilizing the Effective Field Theory of dark energy approach and adopting the $w_0w_a$CDM background cosmological model, we find that including the CMB ISW lensing cross-correlations tighten constraints on the modified gravity parameters by approximately $20\\%$, reducing the viable parameter space by $40-80\\%$. We derive constraints from Planck CMB, Planck and ACT CMB lensing, DESI DR1 BAO, CMB ISW-lensing, and type Ia supernovae (SN Ia) data. The constraints on the EFT parameters controlling the kinetic braiding and non-minimal coupling are consistent with General Relativity (GR) at the $95\\%$ CL. In particular, we obtain a bound on the kinetic braiding parameter, $c_B < 1.2$ at $95\\%$ CL. In the $w_0$-$w_a$ parameter space, our results imply a crossing of the phantom divide, $w=-1$. The modified gravity model shows a mild preference over $\\Lambda$CDM at the $1.8\\sigma$, $2.6\\sigma$ and $3.2\\sigma$ levels for the combinations with Pantheon+, Union3 and DESY5 supernova datasets. We find that using the latest $\\texttt{HiLLiPoP}+\\texttt{LoLLiPoP}$ likelihoods alleviates the departure of modified gravity parameters from the GR-values compared to results using {\\it Planck} 2018 data. This paper underlines the importance of the ISW lensing probe in constraining late-time modifications of gravity.",
      "pdf_url": "https://arxiv.org/pdf/2503.09893.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.14190",
      "title": "Matter Dipole and Hubble Tension due to Large Wavelength Perturbations",
      "authors": [
        "Gopal Kashyap",
        "Naveen K. Singh",
        "Pankaj Jain"
      ],
      "abstract": "Matter Dipole and Hubble Tension due to Large Wavelength Perturbations Gopal Kashyap, Naveen K. Singh, Pankaj Jain Phys. Rev. D 112, 083524 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO) We theoretically analyze the dipole anisotropy observed in the quasar distribution from the CatWISE2020 catalog. The catalog data shows a peak around $z\\approx 1$, suggesting the presence of a large-scale dipole component. We explore the possibility that this dipole could be driven by primordial density fluctuations from modes that were superhorizon at the time of CMB decoupling but have since entered the horizon and become subhorizon. In particular, we consider the impact of adiabatic modes with wave numbers $k$ in the range $(10^{-4} - 4 \\times 10^{-3})~\\mathrm{Mpc}^{-1} $, corresponding to wavelength scales of several Gpc. Such modes can create large-scale density variations, likely causing anisotropies in the distribution of matter and, as a result, affecting the number density of observed quasars. We find that these can lead to a significant contribution to the dipole for sources up to redshifts of about 1, but are unable to explain the observed dipole. We also demonstrate that a superhorizon curvature perturbations mode, with a comoving wavenumber $k\\lesssim0.3H_0$ can lead to a significant enhancement in the locally inferred Hubble constant. This effect offers a viable explanation for the observed discrepancy between local and CMB inferred measurements of $H_0$.",
      "pdf_url": "https://arxiv.org/pdf/2504.14190.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.20656",
      "title": "A joint analysis of 3D clustering and galaxy x CMB-lensing cross-correlations with DESI DR1 galaxies",
      "authors": [
        "M. Maus",
        "M. White",
        "N. Sailer",
        "A. Baleato Lizancos",
        "S. Ferraro",
        "S. Chen",
        "J. DeRose",
        "J. Aguilar",
        "S. Ahlen",
        "S. BenZvi",
        "D. Bianchi",
        "D. Brooks",
        "E. Burtin",
        "F. J. Castander",
        "E. Chaussidon",
        "T. Claybaugh",
        "A. Cuceu",
        "A. de la Macorra",
        "A. de Mattia",
        "P. Doel",
        "A. Font-Ribera",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "S. Gontcho A Gontcho",
        "G. Gutierrez",
        "J. Guy",
        "K. Honscheid",
        "C. Howlett",
        "M. Ishak",
        "R. Kehoe",
        "D. Kirkby",
        "T. Kisner",
        "A. Kremin",
        "O. Lahav",
        "C. Lamman",
        "M. Landriau",
        "L. Le Guillou",
        "M. E. Levi",
        "M. Manera",
        "A. Meisner",
        "R. Miquel",
        "S. Nadathur",
        "J. A. Newman",
        "N. Palanque-Delabrouille",
        "W. J. Percival",
        "F. Prada",
        "I. Pérez-Ràfols",
        "A. J. Ross",
        "G. Rossi",
        "L. Samushia",
        "E. Sanchez",
        "D. Schlegel",
        "M. Schubnell",
        "H. Seo",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarlé",
        "B. A. Weaver",
        "P. Zarrouk",
        "R. Zhou",
        "H. Zou"
      ],
      "abstract": "A joint analysis of 3D clustering and galaxy x CMB-lensing cross-correlations with DESI DR1 galaxies M. Maus, M. White, N. Sailer, A. Baleato Lizancos, S. Ferraro, S. Chen, J. DeRose, J. Aguilar, S. Ahlen, S. BenZvi, D. Bianchi, D. Brooks, E. Burtin, F. J. Castander, E. Chaussidon, T. Claybaugh, A. Cuceu, A. de la Macorra, A. de Mattia, P. Doel, A. Font-Ribera, J. E. Forero-Romero, E. Gaztañaga, S. Gontcho A Gontcho, G. Gutierrez, J. Guy, K. Honscheid, C. Howlett, M. Ishak, R. Kehoe, D. Kirkby, T. Kisner, A. Kremin, O. Lahav, C. Lamman, M. Landriau, L. Le Guillou, M. E. Levi, M. Manera, A. Meisner, R. Miquel, S. Nadathur, J. A. Newman, N. Palanque-Delabrouille, W. J. Percival, F. Prada, I. Pérez-Ràfols, A. J. Ross, G. Rossi, L. Samushia, E. Sanchez, D. Schlegel, M. Schubnell, H. Seo, J. Silber, D. Sprayberry, G. Tarlé, B. A. Weaver, P. Zarrouk, R. Zhou, H. Zou Cosmology and Nongalactic Astrophysics (astro-ph.CO) The spectroscopic data from DESI Data Release 1 (DR1) galaxies enables the analysis of 3D clustering by fitting galaxy power spectra and reconstructed correlation functions in redshift space. Given low measurements of the amplitude of structure from cosmic shear at $z\\sim1$, redshift space distortions (RSD) + Baryon Acoustic Oscillation (BAO) signals from DESI galaxies combined with weak lensing can break degeneracies and provide a tight alternative constraint on the $z\\sim1$ amplitude of structure. In this paper we perform joint analyses that combine full-shape + post-reconstruction information from the DESI DR1 BGS and LRG samples along with angular cross-correlations with Planck PR4 and ACT DR6 CMB lensing maps. We show that adding galaxy-lensing cross-correlations tightens clustering amplitude constraints, improving $\\sigma_8$ uncertainties by $\\sim 40\\%$ over RSD+BAO alone. We also include angular galaxy-galaxy and galaxy-lensing spectra using photometric samples from the DESI Legacy Survey to further improve constraints. Our headline results are $\\sigma_8 = 0.803\\pm 0.017$, $\\Omega_{\\rm m} = 0.3037\\pm 0.0069$, and $S_8 = 0.808\\pm 0.017$. Given DESI's preference for higher $\\sigma_8$ compared to lower values from BOSS, we perform a catalog-level comparison of LRG samples from both surveys. We test sensitivity to dark energy assumptions by relaxing our $\\Lambda$CDM prior and allowing for evolving dark energy via the $w_0-w_a$ parameterization. We find our $S_8$ constraints to be relatively unchanged despite a $~3.5\\sigma$ tension with the cosmological constant model when combining with the Union3 supernova likelihood. Finally we test general relativity (GR) by allowing the gravitational slip parameter ($\\gamma$) to vary, and find $\\gamma = 1.17\\pm0.11$ in mild ($\\sim1.5\\sigma$) tension with the GR value of $1.0$.",
      "pdf_url": "https://arxiv.org/pdf/2505.20656.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12553",
      "title": "Mass dependence of halo baryon fractions from the kinetic Sunyaev-Zeldovich effect",
      "authors": [
        "Finn A. Roper",
        "Yan-Chuan Cai",
        "John A. Peacock"
      ],
      "abstract": "Mass dependence of halo baryon fractions from the kinetic Sunyaev-Zeldovich effect Finn A. Roper, Yan-Chuan Cai, John A. Peacock 15 pages, 7 figures. Submitted to MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We detect the kinetic Sunyaev-Zeldovich imprint of peculiar motions of galaxy groups and clusters, using the photometric DESI Legacy Survey together with cosmic microwave background (CMB) maps from the Atacama Cosmology Telescope (ACT). We develop a comprehensive forward model based on the AbacusSummit cosmological simulations: mock galaxy group catalogues and synthetic kSZ maps are generated, together with a reconstructed peculiar velocity field that allows for photo-$z$ errors, redshift-space distortions, and survey masks. We investigate possible contamination from the cosmic infrared background (CIB), finding that CIB effects are subdominant to the kSZ signal in the relevant ACT frequency channel. We then predict the kSZ signal expected when stacking CMB temperature maps around groups, taking account of their estimated radial velocity. Comparing the model with observations, we are able to constrain the total baryon fraction within haloes, as well as their internal gas profiles. We find evidence for mass dependence of the halo baryon fraction within the virial radius. The gas fraction in massive groups is consistent with the universal baryon fraction, but low-mass groups ($10^{12.5} \\lesssim M\\,/h^{-1}\\mathrm{M}_\\odot \\lesssim 10^{14}$) are depleted to $0.21 \\pm 0.06$ times the universal baryon fraction. We find this low virial baryon fraction to be consistent with an extended gas profile, for which the total baryon content reaches the universal value well beyond the virial radius. This conclusion is consistent with previous analyses using X-ray, kSZ, and weak lensing, and plausibly reflects energetic feedback processes from the galaxies in these haloes.",
      "pdf_url": "https://arxiv.org/pdf/2510.12553.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07209",
      "title": "20 GeV halo-like excess of the Galactic diffuse emission and implications for dark matter annihilation",
      "authors": [
        "Tomonori Totani"
      ],
      "abstract": "20 GeV halo-like excess of the Galactic diffuse emission and implications for dark matter annihilation Tomonori Totani 32 pages, 16 figures. Accepted for publication in JCAP High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Fifteen years of the Fermi Large Area Telescope (LAT) data in the halo region of the Milky Way (MW) are analyzed to search for gamma rays from dark matter annihilation. Gamma-ray maps within the region of interest ($|l| \\le 60^\\circ$, $10^\\circ \\le |b| \\le 60^\\circ$) are modeled using point sources, the GALPROP models of cosmic-ray interactions, isotropic background, and templates of Loop I and the Fermi bubbles, and then the presence of a halo-like component is further examined. A statistically significant halo-like excess is found with a spectral peak around 20 GeV, while its flux is consistent with zero below 2 GeV and above 200 GeV. Examination of the fit residual maps indicates that a spherically symmetric halo component fits the map data well. The radial profile agrees with annihilation by the smooth NFW density profile, and may be slightly shallower than this, especially in the central region. Various systematic uncertainties are investigated, but the 20 GeV peak remains significant. In particular, the halo excess with a similar spectrum is detected even relative to the LAT standard background model, which contains non-template patches adjusted to match the observed map. The halo excess spectrum can be fitted by annihilation with a particle mass $m_\\chi \\sim$ 0.5-0.8 TeV and cross section $\\langle \\sigma \\upsilon \\rangle \\sim$ (5-8)$\\times 10^{-25} \\ \\rm cm^3 \\, s^{-1}$ for the $b\\bar{b}$ channel. This cross section is larger than the upper limits from dwarf galaxies and the canonical thermal relic value, but considering various uncertainties, especially the density profile of the MW halo, the dark matter interpretation of the 20 GeV ``Fermi halo'' remains feasible. The prospects for verification through future observations are briefly discussed.",
      "pdf_url": "https://arxiv.org/pdf/2507.07209.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.11772",
      "title": "MESA-QUEST: Tracing the formation of direct collapse black hole seeds via quasi-stars",
      "authors": [
        "Andrew D. Santarelli",
        "Claire B. Campbell",
        "Ebraheem Farag",
        "Earl P. Bellinger",
        "Priyamvada Natarajan",
        "Matthew E. Caplan"
      ],
      "abstract": "MESA-QUEST: Tracing the formation of direct collapse black hole seeds via quasi-stars Andrew D. Santarelli, Claire B. Campbell, Ebraheem Farag, Earl P. Bellinger, Priyamvada Natarajan, Matthew E. Caplan 14 pages, 3 figures, submitted to the Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The origin of the first supermassive black holes (SMBHs) observed at redshifts $z\\geq 9$ remains one of the most challenging open questions in astrophysics. Their rapid emergence suggests that massive ``heavy seeds'' must have formed early, possibly through the direct collapse of pristine gas clouds in the first galaxies. We present MESA-QUEST, a new framework built upon the Modules for Experiments in Stellar Astrophysics (MESA) code, designed to model the structure and evolution of quasi-stars -- massive, radiation-supported envelopes hosting accreting black holes at their cores -- believed to be the progenitors of direct-collapse black hole (DCBH) seeds. Our implementation introduces flexible boundary conditions representing both Bondi accretion and saturated-convection regimes, and explores the impact of several stellar wind and mass-loss prescriptions, including Reimers, Dutch, and super-Eddington radiation-driven winds. We find that quasi-stars can grow central black holes to $\\geq 10^3\\,M_{\\odot}$ under favorable conditions, with saturated-convection models yielding BH-to-total mass ratios up to 0.55$M_*$ -- five times higher than Bondi-limited cases. However, strong radiation-driven winds can dramatically curtail growth, potentially quenching heavy-seed formation unless balanced by sustained envelope accretion. Our results delineate the physical limits under which quasi-stars can remain stable and produce heavy seeds capable of evolving into the earliest SMBHs detected by JWST and Chandra. Future extensions will incorporate rotation, magnetic fields, and GR-radiation hydrodynamics to refine accretion physics and constrain the viability of the quasi-star pathway for early SMBH formation.",
      "pdf_url": "https://arxiv.org/pdf/2510.11772.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12869",
      "title": "Unified kinetic theory of induced scattering: Compton, Brillouin, and Raman processes in magnetized electron and positron pair plasma",
      "authors": [
        "Rei Nishiura",
        "Shoma F. Kamijima",
        "Kunihito Ioka"
      ],
      "abstract": "Unified kinetic theory of induced scattering: Compton, Brillouin, and Raman processes in magnetized electron and positron pair plasma Rei Nishiura, Shoma F. Kamijima, Kunihito Ioka 34 pages, 6 figures. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) We present a unified theoretical framework for induced (stimulated) scattering-parametric instabilities of electromagnetic waves, including induced Compton, stimulated Brillouin, and stimulated Raman scattering (SRS) in strongly magnetized electron-positron pair plasma. By solving the dispersion relations derived from kinetic theory, taking into account the ponderomotive force due to the beat of incident and scattered waves, we obtain analytical expressions for the linear growth rates of the ordinary, neutral, and charged modes of density fluctuations. Our results clarify which type of scattering dominates under different thermal coupling, resonance, and density conditions. In strong magnetic fields, scattering of perpendicularly polarized waves is generally suppressed, but by different powers of the cyclotron frequency. Moreover, SRS, which is forbidden in unmagnetized electron and positron pair plasma, becomes possible in the charged mode. This framework enables a comprehensive evaluation of induced scattering in extreme astrophysical and laboratory plasma, such as fast radio burst (FRB) emission and propagation in magnetar magnetospheres.",
      "pdf_url": "https://arxiv.org/pdf/2510.12869.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12895",
      "title": "Mean Motion Resonances in AGN Disks",
      "authors": [
        "Marguerite Epstein-Martin",
        "Nicholas Stone",
        "Juliette Becker"
      ],
      "abstract": "Mean Motion Resonances in AGN Disks Marguerite Epstein-Martin, Nicholas Stone, Juliette Becker High Energy Astrophysical Phenomena (astro-ph.HE) Mean motion resonances (MMRs) are a generic outcome of convergent migration for bodies embedded in accretion disks around a central mass. Long studied in planetary systems, the same phenomenon should occur for stellar-mass black holes (BHs) in AGN disks. In this work, we derive simple analytic criteria describing when BH pairs are driven out of resonance, and use them to chart MMR stability across AGN parameter space, accounting for disruption from general-relativistic apsidal precession, hydrodynamic turbulence, and stellar stirring. Across plausible AGN disk models, we find three MBH mass regimes: (i) for $M/ M_\\odot\\gtrsim 10^{7.5}$, first order resonances are generically unstable; (ii) for $M/ M_\\odot\\lesssim 10^{6.5}$, stable MMRs are always present; (iii) for $10^{6.5}\\lesssim M / M_\\odot \\lesssim 10^{7.5}$, stability depends on disk mass flux, the summed mass of the orbiters, and the nuclear-cusp slope. When present, stable MMRs commonly occur between an inner anti-trap and an outer trap set by thermal torque, a region where embedded objects migrate outward in the disk. These results imply that high-mass AGN allow convergent migration to proceed to LVK-band mergers largely without resonant chains, whereas low/intermediate-mass AGN can host MMRs, with the potential to reshape merger pathways.",
      "pdf_url": "https://arxiv.org/pdf/2510.12895.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12965",
      "title": "Cosmic Ray Transport and Gamma-Ray Signatures in the Interstellar Medium",
      "authors": [
        "Lucas Barreto-Mota",
        "Elisabete M. de Gouveia Dal Pino",
        "Siyao Xu",
        "Alexandre Lazarian",
        "Rafael Alves-Batista",
        "Gaetano Di Marco",
        "Stela Adduci Faria"
      ],
      "abstract": "Cosmic Ray Transport and Gamma-Ray Signatures in the Interstellar Medium Lucas Barreto-Mota, Elisabete M. de Gouveia Dal Pino, Siyao Xu, Alexandre Lazarian, Rafael Alves-Batista, Gaetano Di Marco, Stela Adduci Faria High Energy Astrophysical Phenomena (astro-ph.HE) The interaction of cosmic rays (CRs) with magnetic fields and the interstelar medium (ISM) leads to the production of nonthermal radiation. Although this has been a topic of study for many years, it still poses many challenges to the understanding of these processes. In this work we present a short review of recent advances in the understanding of CR propagation in magnetohydrodynamical (MHD) turbulence, in particular the process of mirror diffusion, and how it can help explain recent observational constraints for CR diffusion away from sources. We also present preliminary results from Monte Carlo simulations of CR cascading and propagation within a young massive stellar cluster (YMSC), aimed at probing the origin of very-high-energy (VHE) emission from these sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.12965.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12982",
      "title": "Galactic X-ray Transients in the First eROSITA All Sky Survey",
      "authors": [
        "Vikash Maan",
        "Aman Katira",
        "Kunal. P. Mooley"
      ],
      "abstract": "Galactic X-ray Transients in the First eROSITA All Sky Survey Vikash Maan, Aman Katira, Kunal. P. Mooley 30 pages, 18 figures, Accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Although a multitude of studies have focused on targeted observations of Galactic X-ray transients, blind surveys and population studies have been limited. We have used the ROSAT, eROSITA and Gaia source catalogs to find Galactic X-ray transients having timescales $<$30 years. We report the properties of 738 transients found in our search, majority of which are active stars or interacting binaries. We have also found $\\sim$40 compact object systems among which are at least 8 newly-identified white-dwarf systems, 3 known X-ray binaries, and one known pulsar. We use eROSITA (soft X-ray) spectra of the Galactic transients to show that two distinct types of flaring systems are prevalent: one having peak around 1 keV, well fit by thermal models, and another having peak below 0.2 keV and requiring a power-law component. Our study also reveals that single star or interacting binary systems (X-ray transients) involving giant stars exhibit significantly higher X-ray luminosities than systems involving only main-sequence stars or young stellar objects. Finally, we discuss the properties of the transients in the context of their putative emission mechanisms, the fraction of transients with respect to the total population, and the rates of Galactic transients expected in blind searches of the X-ray sky.",
      "pdf_url": "https://arxiv.org/pdf/2510.12982.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13015",
      "title": "Exploring the connection between compact object mergers and fast X-ray transients: The cases of LXT 240402A & EP250207b",
      "authors": [
        "R. L. Becerra",
        "Yu-Han Yang",
        "Eleonora Troja",
        "Massine El Kabir",
        "Simone Dichiara",
        "Niccolò Passaleva",
        "Brendan O'Connor",
        "Roberto Ricci",
        "Chris Fryer",
        "Lei Hu",
        "Qinyu Wu",
        "Muskan Yadav",
        "Alan M. Watson",
        "Anastasia Tsvetkova",
        "Camila Angulo-Valdez",
        "María D. Caballero-García",
        "Alberto J. Castro-Tirado",
        "C. C. Cheung",
        "Dmitry Frederiks",
        "Maria Gritsevich",
        "J. E. Grove",
        "M. Kerr",
        "William H. Lee",
        "Alexandra L. Lysenko",
        "Margarita Pereyra Talamantes",
        "Anna Ridnaia",
        "Rubén Sánchez-Ramírez",
        "Hui Sun",
        "Dmitry Svinkin",
        "Mikhail Ulanov",
        "R. Woolf",
        "Bing Zhang"
      ],
      "abstract": "Exploring the connection between compact object mergers and fast X-ray transients: The cases of LXT 240402A & EP250207b R. L. Becerra, Yu-Han Yang, Eleonora Troja, Massine El Kabir, Simone Dichiara, Niccolò Passaleva, Brendan O'Connor, Roberto Ricci, Chris Fryer, Lei Hu, Qinyu Wu, Muskan Yadav, Alan M. Watson, Anastasia Tsvetkova, Camila Angulo-Valdez, María D. Caballero-García, Alberto J. Castro-Tirado, C. C. Cheung, Dmitry Frederiks, Maria Gritsevich, J. E. Grove, M. Kerr, William H. Lee, Alexandra L. Lysenko, Margarita Pereyra Talamantes, Anna Ridnaia, Rubén Sánchez-Ramírez, Hui Sun, Dmitry Svinkin, Mikhail Ulanov, R. Woolf, Bing Zhang Submitted to A&A. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) The connection between compact object mergers and some extragalactic fast X-ray transients (FXRTs) has long been hypothesized, but never ultimately established. In this work, we investigate two FXRTs, the LEIA X-ray Transient LXT\\,240402A and the Einstein Probe EP\\,250207b, whose precise positions lie close to nearby ($z\\!\\lesssim\\!0.1$) quiescent galaxies with negligible probability of chance coincidence, identifying them as particularly promising cases of merger-driven explosions in the local Universe. We used Chandra to derive accurate localizations for both events and secure otherwise ambiguous associations with their optical counterparts. Deep optical and near-infrared observations with VLT, GTC, and LBT were performed to characterize the surrounding environment and search for kilonova emission, the hallmark of neutron star mergers. Complementary early-time X-ray monitoring with Swift and Einstein Probe was used to constrain the non-thermal afterglow. We find that both FXRTs remain compatible with a compact binary merger progenitor, which produced low-mass ejecta and kilonova emission subdominant to the afterglow. However, alternative explanations such as a distant ($z\\!\\gtrsim\\!1$) core-collapse supernova cannot be conclusively ruled out.",
      "pdf_url": "https://arxiv.org/pdf/2510.13015.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13074",
      "title": "Gravitational-Wave Signatures of Highly Eccentric Stellar Binary Black-Holes in Galactic Nuclei",
      "authors": [
        "Evgeni Grishin",
        "Isobel M. Romero-Shaw",
        "Alessandro A. Trani"
      ],
      "abstract": "Gravitational-Wave Signatures of Highly Eccentric Stellar Binary Black-Holes in Galactic Nuclei Evgeni Grishin, Isobel M. Romero-Shaw, Alessandro A. Trani 4 pages, 3 figures. Proceedings contribution to IAU Symposium 398 (MODEST-25, Seoul, June 2025); to appear in the IAU Proceedings Series High Energy Astrophysical Phenomena (astro-ph.HE) A significant fraction of gravitational-wave mergers are expected to be eccentric in the Laser-Interferometer-Space-Antenna (LISA) frequency band, $10^{-4} - 10^{-1}$ Hz. Several LIGO-Virgo-KAGRA events show potential hints of residual eccentricity at 10 Hz, pointing to dynamical or triple origins for part of the population, where von-Zeipel-Lidov-Kozai oscillations can perturb both the eccentricity and the inclination of the binary. Moreover, the argument of pericentre, $\\omega$ could be fully circulating, or librating, with a limited range for $\\omega$. We use TSUNAMI, a regularised N-body code with 3.5PN corrections to identify four different orbital families: (i) circulating, (ii) small-amplitude and (iii) large-amplitude librating, and (iv) merging. We develop a new method to construct gravitational-wave waveforms using the quadrupole formula from the instantaneous acceleration in TSUNAMI. The four orbital families have distinct waveform phenomenologies, enabling them to be distinguished if observed in LISA. In particular, the properties of the tertiary companion can be inferred and serve as an independent mass measurement and distinguish field triple dynamics from galactic dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2510.13074.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.13249",
      "title": "Monte Carlo simulation of the Compton scattering and disk reflection of a cylinder with hot electrons moving away from a black hole",
      "authors": [
        "Wei Meng",
        "Yuan You",
        "Shuang-Nan Zhang",
        "Jia-Ying Cao"
      ],
      "abstract": "Monte Carlo simulation of the Compton scattering and disk reflection of a cylinder with hot electrons moving away from a black hole Wei Meng, Yuan You, Shuang-Nan Zhang, Jia-Ying Cao 26 pages, 27 figures, 2 tables, submitted High Energy Astrophysical Phenomena (astro-ph.HE) For accreting black holes (BHs), the lamp-post scenario is a simple and popular model: a hot and point-like corona is located above the black hole, irradiating the accretion disk with hard X-ray radiation, which is believed to be generated by inverse Compton scattering in the corona. Although the lamp-post model successfully explains the disk reflection component, it fails to address the origin of seed photons and the geometry of the hot corona, because this model simplistically treats the corona as a point-like source generating a cutoff powerlaw spectrum. In this paper, we make simulations on a possible physical realization of the lamp-post scenario: the shape of the scattering zone is set to be a cylinder, corresponding to the jet base near a BH. The source of seed photons in this system is assumed to be the multicolor blackbody radiation of the accretion disk. In our simulations, the Compton scattering process is simulated with a custom Monte Carlo program based on the Geant4 package and the disk reflection process is simulated with the xilconv model in XSPEC. Our simulation results have confirmed that the relativistic motion of the jet can weaken or even completely suppress the reflection of the accretion disk, and simultaneously, the Comptonization of disk photons in the jet can still make a major contribution to the observed X-ray spectrum in high energy range. We discuss the implications of our simulation results, in light of the recent observations of a very weak reflection component in the presence of a strong hard X-ray radiation from the outburst of Swift J1727.8-1613.",
      "pdf_url": "https://arxiv.org/pdf/2510.13249.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13337",
      "title": "Relativistic reflection within an extended hot plasma geometry",
      "authors": [
        "Alexey D. Nekrasov",
        "Thomas Dauser",
        "Javier A. Garcia",
        "Dominic J. Walton",
        "Christian M. Fromm",
        "Andrew J. Young",
        "Fergus J. E. Baker",
        "Amy M. Joyce",
        "Ole Koenig",
        "Stefan Licklederer",
        "Julia Haefner",
        "Joern Wilms"
      ],
      "abstract": "Relativistic reflection within an extended hot plasma geometry Alexey D. Nekrasov, Thomas Dauser, Javier A. Garcia, Dominic J. Walton, Christian M. Fromm, Andrew J. Young, Fergus J. E. Baker, Amy M. Joyce, Ole Koenig, Stefan Licklederer, Julia Haefner, Joern Wilms 14 pages, 10 figures, accepted for publication by A&A, the new RELXILL model can be downloaded at this https URL High Energy Astrophysical Phenomena (astro-ph.HE) Reflection of X-rays at the inner accretion disk around black holes imprints relativistically broadened features in the observed spectrum. Besides the black hole properties and the ionization and density of the accretion disk the features also depend on the location and geometry of the primary source of X-rays, often called the corona. We present a fast general relativistic model for spectral fitting of a radially extended, ring-like corona above the accretion disk. A commonly used model to explain observed X-ray reflection spectra is the lamp post, which assumes a point-like source on the rotational axis of the black hole. While often being able to explain the observations, this geometric model does not allow for a constraint on the radial size of the corona. We therefore extend the publicly available relativistic reflection model RELXILL by implementing a radially extended, ring-like primary source. With the new RELXILL model allowing us to vary the position of the primary source in two dimensions, we present simulated line profiles and spectra and discuss implications of data fitting compared to the lamp post model. We then apply this extended RELXILL model to XMM-Newton and NuSTAR data of the radio-quiet Seyfert-2 AGN ESO 033-G002. The new model describes the data well, and we are able to constrain the distance of the source to the black hole to be less than three gravitational radii, while the angular position of the source is poorly constrained. We show that a compact, radially extended corona close to the ISCO can explain the observed relativistic reflection equally well as the point-like lamp post corona. The model is made freely available to the community.",
      "pdf_url": "https://arxiv.org/pdf/2510.13337.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13403",
      "title": "Evidence for Neutrino Emission from X-ray Bright Active Galactic Nuclei with IceCube",
      "authors": [
        "R. Abbasi",
        "M. Ackermann",
        "J. Adams",
        "S. K. Agarwalla",
        "J. A. Aguilar",
        "M. Ahlers",
        "J.M. Alameddine",
        "S. Ali",
        "N. M. Amin",
        "K. Andeen",
        "C. Argüelles",
        "Y. Ashida",
        "S. Athanasiadou",
        "S. N. Axani",
        "R. Babu",
        "X. Bai",
        "J. Baines-Holmes",
        "A. Balagopal V.",
        "S. W. Barwick",
        "S. Bash",
        "V. Basu",
        "R. Bay",
        "J. J. Beatty",
        "J. Becker Tjus",
        "P. Behrens",
        "J. Beise",
        "C. Bellenghi",
        "B. Benkel",
        "S. BenZvi",
        "D. Berley",
        "E. Bernardini",
        "D. Z. Besson",
        "E. Blaufuss",
        "L. Bloom",
        "S. Blot",
        "I. Bodo",
        "F. Bontempo",
        "J. Y. Book Motzkin",
        "C. Boscolo Meneguolo",
        "S. Böser",
        "O. Botner",
        "J. Böttcher",
        "J. Braun",
        "B. Brinson",
        "Z. Brisson-Tsavoussis",
        "R. T. Burley",
        "D. Butterfield",
        "M. A. Campana",
        "K. Carloni",
        "J. Carpio",
        "S. Chattopadhyay",
        "N. Chau",
        "Z. Chen",
        "D. Chirkin",
        "S. Choi",
        "B. A. Clark",
        "A. Coleman",
        "P. Coleman",
        "G. H. Collin",
        "D. A. Coloma Borja",
        "A. Connolly",
        "J. M. Conrad",
        "D. F. Cowen",
        "C. De Clercq",
        "J. J. DeLaunay",
        "D. Delgado",
        "T. Delmeulle",
        "S. Deng",
        "P. Desiati",
        "K. D. de Vries",
        "G. de Wasseige",
        "T. DeYoung",
        "J. C. Díaz-Vélez",
        "S. DiKerby",
        "T. Ding",
        "M. Dittmer",
        "A. Domi",
        "L. Draper",
        "L. Dueser",
        "D. Durnford",
        "K. Dutta",
        "M. A. DuVernois",
        "T. Ehrhardt",
        "L. Eidenschink",
        "A. Eimer",
        "P. Eller",
        "E. Ellinger",
        "D. Elsässer",
        "R. Engel",
        "H. Erpenbeck",
        "W. Esmail",
        "S. Eulig",
        "J. Evans",
        "P. A. Evenson",
        "K. L. Fan",
        "K. Fang",
        "K. Farrag",
        "A. R. Fazely",
        "A. Fedynitch",
        "N. Feigl"
      ],
      "abstract": "Evidence for Neutrino Emission from X-ray Bright Active Galactic Nuclei with IceCube R. Abbasi, M. Ackermann, J. Adams, S. K. Agarwalla, J. A. Aguilar, M. Ahlers, J.M. Alameddine, S. Ali, N. M. Amin, K. Andeen, C. Argüelles, Y. Ashida, S. Athanasiadou, S. N. Axani, R. Babu, X. Bai, J. Baines-Holmes, A. Balagopal V., S. W. Barwick, S. Bash, V. Basu, R. Bay, J. J. Beatty, J. Becker Tjus, P. Behrens, J. Beise, C. Bellenghi, B. Benkel, S. BenZvi, D. Berley, E. Bernardini, D. Z. Besson, E. Blaufuss, L. Bloom, S. Blot, I. Bodo, F. Bontempo, J. Y. Book Motzkin, C. Boscolo Meneguolo, S. Böser, O. Botner, J. Böttcher, J. Braun, B. Brinson, Z. Brisson-Tsavoussis, R. T. Burley, D. Butterfield, M. A. Campana, K. Carloni, J. Carpio, S. Chattopadhyay, N. Chau, Z. Chen, D. Chirkin, S. Choi, B. A. Clark, A. Coleman, P. Coleman, G. H. Collin, D. A. Coloma Borja, A. Connolly, J. M. Conrad, D. F. Cowen, C. De Clercq, J. J. DeLaunay, D. Delgado, T. Delmeulle, S. Deng, P. Desiati, K. D. de Vries, G. de Wasseige, T. DeYoung, J. C. Díaz-Vélez, S. DiKerby, T. Ding, M. Dittmer, A. Domi, L. Draper, L. Dueser, D. Durnford, K. Dutta, M. A. DuVernois, T. Ehrhardt, L. Eidenschink, A. Eimer, P. Eller, E. Ellinger, D. Elsässer, R. Engel, H. Erpenbeck, W. Esmail, S. Eulig, J. Evans, P. A. Evenson, K. L. Fan, K. Fang, K. Farrag, A. R. Fazely, A. Fedynitch, N. Feigl High Energy Astrophysical Phenomena (astro-ph.HE) Recently, IceCube reported neutrino emission from the Seyfert galaxy NGC 1068. Using 13.1 years of IceCube data, we present a follow-up search for neutrino sources in the northern sky. NGC 1068 remains the most significant neutrino source among 110 preselected gamma-ray emitters while also being spatially compatible with the most significant location in the northern sky. Its energy spectrum is characterized by an unbroken power-law with spectral index $\\gamma = 3.4 \\pm 0.2$. Consistent with previous results, the observed neutrino flux exceeds its gamma-ray counterpart by at least two orders of magnitude. Motivated by this disparity and the high X-ray luminosity of the source, we selected 47 X-ray bright Seyfert galaxies from the Swift/BAT spectroscopic survey that were not included in the list of gamma-ray emitters. When testing this collection for neutrino emission, we observe a 3.3$\\sigma$ excess from an ensemble of 11 sources, with NGC 1068 excluded from the sample. Our results strengthen the evidence that X-ray bright cores of active galactic nuclei are neutrino emitters.",
      "pdf_url": "https://arxiv.org/pdf/2510.13403.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13533",
      "title": "The Formation Rate and Luminosity Function of Fast X-ray transients from Einstein probe",
      "authors": [
        "Yizhou Guo",
        "Houdun Zeng",
        "Junjie Wei",
        "Hao Zhou",
        "Zhiping Jin",
        "Xuefeng Wu",
        "Daming Wei"
      ],
      "abstract": "The Formation Rate and Luminosity Function of Fast X-ray transients from Einstein probe Yizhou Guo, Houdun Zeng, Junjie Wei, Hao Zhou, Zhiping Jin, Xuefeng Wu, Daming Wei 9 pages, 4 figures, and 1 table High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Following its launch on January 9, 2024, the Einstein Probe (EP) telescope has detected hundreds of fast X-ray transients (FXTs), yet their physical origins remain elusive. Understanding their luminosity function and formation rate is crucial for elucidating their nature. Based on the latest catalog of EP-detected FXTs, we present, a model-independent, non-parametric approach to derive the luminosity function and formation rate of FXTs. Our analysis reveals significant cosmological luminosity evolution, characterized by a scaling relationship of $(1+z)^{3.58}$. After accounting for this evolution, we establish that the local luminosity function is best represented by a broken power law, with a break luminosity of $(4.17 \\pm 0.34) \\times 10^{46}$ erg/s. The formation rate exhibits a gentle decline with redshift, following the relation $(1+z)^{-0.21}$, yielding a local rate of approximately $28.0_{-16.4}^{+27.3}$ Gpc$^{-3}$ yr$^{-1}$. This rate is comparable to that of low-luminosity long gamma-ray bursts (LGRBs). Our findings indicate a potential correlation between FXTs and LGRBs, supporting the majority of FXTs may be linked to collapsar progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2510.13533.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13556",
      "title": "The 2024 outburst of the neutron star LMXB EXO 0748-676: an investigation of bursts and eclipses with AstroSat",
      "authors": [
        "Aromal P",
        "Unnati Kashyap",
        "Manoneeta Chakraborty",
        "Sudip Bhattacharyya",
        "Thomas J. Maccarone",
        "Vijay Choudhary"
      ],
      "abstract": "The 2024 outburst of the neutron star LMXB EXO 0748-676: an investigation of bursts and eclipses with AstroSat Aromal P, Unnati Kashyap, Manoneeta Chakraborty, Sudip Bhattacharyya, Thomas J. Maccarone, Vijay Choudhary High Energy Astrophysical Phenomena (astro-ph.HE) We present a detailed analysis of the Type-I (thermonuclear) X-ray bursts and eclipses observed from the neutron star low-mass X-ray binary (LMXB) EXO 0748--676 with AstroSat during the second known outburst of the source following a 16-year-long quiescence period. We detect three thermonuclear X-ray bursts, with two displaying simultaneous coverage in the soft X-rays. Simultaneous UV observations show evidence of reprocessed burst emissions in the far-ultraviolet band. The time-resolved spectral analysis reveals the photospheric radius expansion (PRE) nature for two bursts. We estimate the distance to the source to be $7.42\\pm0.53$ kpc using the peak flux of PRE. Notably, one of the bursts exhibited a secondary peak, $\\sim30$ s after the primary, particularly dominating in the softer X-rays, which reveals a correlation with the evolution of burst hotspot radius with no temperature dependence. The burst properties and corresponding flux values suggest that mixed H/He burning may have fueled the bursts. We also detect evidence of a soft excess during one burst, likely arising from the interaction of the burst photons with the surroundings. We uncover evidence for a hard X-ray deficit during the peak of all bursts and a hard lag of $\\sim4$ s, which can be attributed to the Compton cooling of the corona by the burst photons. We also probe the temporal evolution and the energy dependence of the eclipses, which offer insights into the binary environment. Our study helps gain deeper insight into the physics of burst ignition, flame propagation, the burst-accretion interaction, and the evolution of LMXBs.",
      "pdf_url": "https://arxiv.org/pdf/2510.13556.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13574",
      "title": "Hyperons and $Δ$'s in rotating protoneutron stars: Local properties",
      "authors": [
        "Franciele M. da Silva",
        "Adamu Issifu",
        "Luis C. N. Santos",
        "Tobias Frederico",
        "Débora P. Menezes"
      ],
      "abstract": "Hyperons and $Δ$'s in rotating protoneutron stars: Local properties Franciele M. da Silva, Adamu Issifu, Luis C. N. Santos, Tobias Frederico, Débora P. Menezes High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) The structural evolution of rotating protoneutron stars encodes essential information about their observable signatures, while microscopic properties provide complementary knowledge to advance observational investigations. Using a relativistic mean-field model with density-dependent couplings that account for temperature and particle composition, we investigate rotation, neutrino-emission-driven changes in angular momentum, particle distributions, temperature profiles, and sound speed to probe the internal dynamics of protoneutron star matter. Additionally, we track the evolution of macroscopic quantities such as energy distribution and gravitational mass and establish direct links between microphysics and global evolution. Extending the framework of Phys. Rev. D 112, 023007 (2025), which focuses on the global properties of rotating protoneutron star evolution, our results reveal that protoneutron star deformation and thermal evolution are governed by angular momentum, mass, and composition. Exotic matter (hyperons and $\\Delta$-resonances) and rapid rotation enhance deformation leading to a reduction in core temperature, whereas slowly rotating stars like PSR J0740$+$6620 remain nearly spherical. Our predicted equatorial radii for PSR J0740$+$6620, $13.0\\ \\mathrm{km} < R_e < 13.5\\ \\mathrm{km}$, are consistent with NICER measurements. These findings constrain the EoS, requiring a self-consistent treatment of rotation, mass-dependent compression, and composition-driven modeling to accurately model protoneutron star evolution in the context of multi-messenger astrophysics.",
      "pdf_url": "https://arxiv.org/pdf/2510.13574.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13610",
      "title": "Solar Cycle Variation of Sustained Gamma-ray Emission Events from the Sun and Related Energetic Events",
      "authors": [
        "N. Gopalswamy",
        "P. Mäkela",
        "S. Akiyama",
        "S. Yashiro",
        "H. Xie"
      ],
      "abstract": "Solar Cycle Variation of Sustained Gamma-ray Emission Events from the Sun and Related Energetic Events N. Gopalswamy, P. Mäkela, S. Akiyama, S. Yashiro, H. Xie 10 pages, 5 figures, 2 tables, Proc 17th workshop on Solar Influences on the Magnetosphere, Ionosphere and Atmosphere Primorsko, Bulgaria, June 2025 High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The sustained gamma ray emission (SGRE) from the Sun is one of the fascinating high energy phenomena closely related to the acceleration of protons to energies >300 MeV. Here we report on the solar cycle variation of SGRE events based on observations from Fermi's Large Area Telescope (LAT). This report covers solar cycles (SCs) 24 and 25 during which Fermi has been operating. Since SGRE events are closely related to solar energetic particle (SEP) events and interplanetary type II radio bursts caused by fast and wide coronal mass ejections (CMEs), we consider these phenomena as well. Many studies have shown that SC 25 is similar or slightly stronger than SC 24. The number of SEP events, GLE events, IP type II bursts, and fast and wide CMEs confirm this conclusion. However, the number of SGRE events observed by Fermi LAT has diminished significantly in SC 25 relative to SC 24. One of the issues has been the reduced coverage of the Sun since 2018 due to a mechanical problem with a solar array of the Fermi mission. By identifying the Fermi LAT gaps and the number of energetic events (fast and wide CMEs, interplanetary type II bursts) we conclude that about three times more SGRE events must have occurred than the 15 events observed by Fermi.",
      "pdf_url": "https://arxiv.org/pdf/2510.13610.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13739",
      "title": "XRISM Resolves Relativistic Effects from the Innermost Accretion Disk in Serpens X-1",
      "authors": [
        "R. M. Ludlam",
        "J. M. Miller",
        "E. M Cackett",
        "J. A. Garcia"
      ],
      "abstract": "XRISM Resolves Relativistic Effects from the Innermost Accretion Disk in Serpens X-1 R. M. Ludlam, J. M. Miller, E. M Cackett, J. A. Garcia 10 pages, 4 figures, 2 tables, accepted for publication in ApJL High Energy Astrophysical Phenomena (astro-ph.HE) We present the first XRISM/Resolve observation of the persistently accreting neutron star (NS) low-mass X-ray binary Serpens X-1. The source was observed on October 17th, 2024, for approximately 350 ks of elapsed time, resulting in 171 ks of exposure. The source exhibited 22% variability with respect to the average count rate of 73.1 count/s during the observation, but remained in a spectrally soft state throughout. The time averaged spectrum was analyzed in conjunction with spectra extracted from periods of different count rate to check for variations in spectral components. The unprecedented energy resolution of 4.5 eV at 6 keV of XRISM/Resolve provides a detailed look at the shape and structure of the Fe emission line within the data, which shows a dual-peaked structure with an extended red-wing, and steep decline in the blue-wing of the line profile. Fits with the reflection model relxillNS are able to describe the structure in the Fe line region, and confirms previous results that the disk is close to the NS ($R_{\\rm in}$ = $1.02_{-0.01}^{+0.21}\\ R_{\\rm ISCO}$). These models also measure a low systemic inclination ($i=5^{\\circ}\\pm1^{\\circ}$), confirming prior X-ray and optical studies. Alternative models were explored to describe the structure of the Fe line profile, however, relativistic reflection provides the simplest and statistically best explanation of the data.",
      "pdf_url": "https://arxiv.org/pdf/2510.13739.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13741",
      "title": "Dynamics and Observational Signatures of Core-Collapse Supernovae with Central Engines: Hydrodynamics Simulations with Monte Carlo Post-Processing",
      "authors": [
        "Kiran Eiden",
        "Daniel Kasen"
      ],
      "abstract": "Dynamics and Observational Signatures of Core-Collapse Supernovae with Central Engines: Hydrodynamics Simulations with Monte Carlo Post-Processing Kiran Eiden, Daniel Kasen High Energy Astrophysical Phenomena (astro-ph.HE) A long-lived central engine embedded in expanding supernova ejecta can alter the dynamics and observational signatures of the event, producing an unusually luminous, energetic, and/or rapidly-evolving transient. We use two-dimensional hydrodynamics simulations to study the effect of a central energy source, varying the amount, rate, and isotropy of the energy deposition. We post-process the results with a time-dependent Monte Carlo radiation transport code to extract observational signatures. The engine excavates a bubble at the centre of the ejecta, which becomes Rayleigh-Taylor unstable. Sufficiently powerful engines are able to break through the edge of the bubble and accelerate, shred, and compositionally mix the entire ejecta. The breakout of the engine-driven wind occurs at distinct rupture points, and the outflowing high-velocity gas may eventually give rise to radio emission. The dynamical impact of the engine leads to faster rising optical light curves, with photon escape facilitated by the faster expansion of the ejecta and the opening of low-density channels. For models with strong engines, the spectra are initially hot and featureless, but later evolve to resemble those of broad-line Ic supernovae. Under certain conditions, line emission from ionized, low-velocity material near the centre of the ejecta may be able to escape and produce narrow emission similar to that seen in interacting supernovae. We discuss how variability in the engine energy reservoir and injection rate could give rise to a heterogeneous set of events spanning multiple observational classes, including the fast blue optical transients, broad-line Ic supernovae, and superluminous supernovae.",
      "pdf_url": "https://arxiv.org/pdf/2510.13741.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13765",
      "title": "Optimizing Supernova Classification with Interpretable Machine Learning Models",
      "authors": [
        "Anurag Garg"
      ],
      "abstract": "Optimizing Supernova Classification with Interpretable Machine Learning Models Anurag Garg (Ministry of Education, Abu Dhabi, UAE) 9 pages, 6 figures. Accepted for publication in Journal of Astrophysics and Astronomy (JAA), Ref: JOAA-D-25-00085R1. Uses this http URL class file High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Photometric classification of Type Ia supernovae (SNe Ia) is critical for cosmological studies but remains difficult due to class imbalance and observational noise. While deep learning models have been explored, they are often resource-intensive and lack interpretability. We present a computationally efficient and interpretable classification framework that maintains high performance on imbalanced datasets. We emphasize the use of PR-AUC and F1-score as more informative metrics than ROC-AUC in severely imbalanced settings. Using an XGBoost ensemble optimized via Bayesian hyperparameter tuning, we classified light curves from the Supernova Photometric Classification Challenge (SPCC), comprising 21,318 events with a 3.19 imbalance ratio (non-Ia to Ia). Our model achieved a PR-AUC of $0.993^{+0.03}_{-0.02}$, an F1-score of $0.923 \\pm 0.008$, and a ROC-AUC of $0.976 \\pm 0.004$, matching or exceeding deep learning performance on precision-recall trade-offs while using fewer resources. Despite slightly lower overall accuracy, our method balances false positives and false negatives, improving the efficiency of spectroscopic follow-up. We show that optimized ensemble models offer a reproducible and lightweight alternative to complex architectures, particularly for large-scale surveys such as the Legacy Survey of Space and Time (LSST) where transparency and efficiency are essential.",
      "pdf_url": "https://arxiv.org/pdf/2510.13765.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13776",
      "title": "Polarization dynamics of X-ray synchrotron emission from a multi-zone blazar jet",
      "authors": [
        "Benjamin de Jonge",
        "Haocheng Zhang",
        "Manel Errando",
        "Andrea Gokus",
        "Pazit Rabinowitz"
      ],
      "abstract": "Polarization dynamics of X-ray synchrotron emission from a multi-zone blazar jet Benjamin de Jonge, Haocheng Zhang, Manel Errando, Andrea Gokus, Pazit Rabinowitz High Energy Astrophysical Phenomena (astro-ph.HE) The polarization of X-ray synchrotron emission in blazars offers a direct probe into the magnetic field geometry and particle acceleration processes operating in relativistic jets. We use particle-in-cell simulations of magnetic reconnection and magnetized turbulence, coupled to polarization-sensitive radiative transfer code, to interpret IXPE observations of Mrk 421 during a high flux state recorded in December of 2023. To evaluate the fitness of the theoretical scenarios, we rely on a quantitative comparison the statistical properties of simulated and observed X-ray flux and polarization light curves using five evaluation metrics, rather than attempting to fit individual data points. We propose a multi-zone model where jet emission is represented as the sum of the radiative output of many independent cells, each described by a simulation run viewed at different orientations. Comparison of ensembles of simulated Stokes-parameter light curves with IXPE data shows that magnetic reconnection dominated models provide the best match to the observed X-ray flux and polarization dynamics. The optimal configuration corresponds to N = 15 emitting cells, which reproduces the observed amplitudes and timescales of the X-ray flux and polarization variations. Magnetized turbulence models underpredict both the flux and polarization variability. Our results indicate that a multi-zone, reconnection-powered emission scenario can describe the X-ray polarization behavior of Mrk 421 and establish a quantitative framework for testing theoretical models against IXPE observations of other high-synchrotron-peaked blazars.",
      "pdf_url": "https://arxiv.org/pdf/2510.13776.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13788",
      "title": "Investigating double bump air showers with the SKA-Low",
      "authors": [
        "V. De Henau",
        "S. Bouma",
        "J. Bray",
        "S. Buitink",
        "A. Corstanje",
        "M. Desmet",
        "E. Dickinson",
        "L. van Dongen",
        "B. Hare",
        "H. He",
        "J.R. Hörandel",
        "T. Huege",
        "C.W. James",
        "M. Jetti",
        "P. Laub",
        "H.-J. Mathes",
        "K. Mulrey",
        "A. Nelles",
        "O. Scholten",
        "C. Sterpka",
        "S. ter Veen",
        "K. Terveer",
        "P. Turekova",
        "T.N.G. Trinh",
        "S. Saha",
        "S. Sharma",
        "R. Spencer",
        "D. Veberič",
        "K. Watanabe",
        "M. Waterson",
        "C. Zhang",
        "P. Zhang",
        "Y. Zhang"
      ],
      "abstract": "Investigating double bump air showers with the SKA-Low V. De Henau, S. Bouma, J. Bray, S. Buitink, A. Corstanje, M. Desmet, E. Dickinson, L. van Dongen, B. Hare, H. He, J.R. Hörandel, T. Huege, C.W. James, M. Jetti, P. Laub, H.-J. Mathes, K. Mulrey, A. Nelles, O. Scholten, C. Sterpka, S. ter Veen, K. Terveer, P. Turekova, T.N.G. Trinh, S. Saha, S. Sharma, R. Spencer, D. Veberič, K. Watanabe, M. Waterson, C. Zhang, P. Zhang, Y. Zhang Presented at the 39th International Cosmic Ray Conference (ICRC 2025). 9 pages, 6 figures High Energy Astrophysical Phenomena (astro-ph.HE) Double-bump showers are a rare class of extensive air showers (EAS) predicted by Monte Carlo simulations. They occur when a high-energy secondary particle, the leading particle, travels significantly farther than the rest, creating a distinct double-peaked longitudinal profile. So far, no experiment has been able to directly detect these showers. The unique radio footprint of double-bump showers, characterized by multiple Cherenkov rings, provides a way to reconstruct longitudinal profiles from radio observations. With its dense antenna array and broad frequency range, the Square Kilometer Array Observatory (SKAO) will be the first experiment capable of detecting these features, offering a new opportunity to probe hadronic interactions and constrain particle cross sections at high energies. In our analysis, we simulate the EAS using CORSIKA with the CoREAS plugin for radio. We developed a new method based on the Akaike information criterion to identify double bump showers in simulations by analyzing their longitudinal profiles. Then we investigate the prevalence of these double bump showers across different cosmic ray primary particles and various hadronic interaction models. We create a skeleton of the EAS which consists of all the particles with at least $1\\%$ of the primary energy, allowing us to confirm the leading particle hypothesis and track shower development following these particles. This will enable us to relate the attributes of the leading particle to measurable parameters. Depending on the exact shower properties, the radio footprint of a double bump shower can create a complex interference pattern, consisting of multiple rings. From this information, the longitudinal profiles can be extracted. SKA due to its dense antenna array and frequency range will be the first experiment able to observe these double bump showers in detail.",
      "pdf_url": "https://arxiv.org/pdf/2510.13788.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12958",
      "title": "Simulation-Based Pretraining and Domain Adaptation for Astronomical Time Series with Minimal Labeled Data",
      "authors": [
        "Rithwik Gupta",
        "Daniel Muthukrishna",
        "Jeroen Audenaert"
      ],
      "abstract": "Simulation-Based Pretraining and Domain Adaptation for Astronomical Time Series with Minimal Labeled Data Rithwik Gupta, Daniel Muthukrishna, Jeroen Audenaert Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); Machine Learning (cs.LG) Astronomical time-series analysis faces a critical limitation: the scarcity of labeled observational data. We present a pre-training approach that leverages simulations, significantly reducing the need for labeled examples from real observations. Our models, trained on simulated data from multiple astronomical surveys (ZTF and LSST), learn generalizable representations that transfer effectively to downstream tasks. Using classifier-based architectures enhanced with contrastive and adversarial objectives, we create domain-agnostic models that demonstrate substantial performance improvements over baseline methods in classification, redshift estimation, and anomaly detection when fine-tuned with minimal real data. Remarkably, our models exhibit effective zero-shot transfer capabilities, achieving comparable performance on future telescope (LSST) simulations when trained solely on existing telescope (ZTF) data. Furthermore, they generalize to very different astronomical phenomena (namely variable stars from NASA's \\textit{Kepler} telescope) despite being trained on transient events, demonstrating cross-domain capabilities. Our approach provides a practical solution for building general models when labeled data is scarce, but domain knowledge can be encoded in simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.12958.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "astro-ph.SR",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12978",
      "title": "Toward First-Principles Multi-Messenger Predictions: Coupling Nuclear Networks with GR Radiation-MHD in {\\tt Gmunu}",
      "authors": [
        "Patrick Chi-Kit Cheong",
        "Christopher L. Fryer"
      ],
      "abstract": "Toward First-Principles Multi-Messenger Predictions: Coupling Nuclear Networks with GR Radiation-MHD in {\\tt Gmunu} Patrick Chi-Kit Cheong, Christopher L. Fryer Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) We present a new implementation of nuclear reaction networks in the \\texttt{G}eneral-relativistic \\texttt{mu}ltigrid \\texttt{nu}merical (\\texttt{Gmunu}) code, a framework for general relativistic radiation magnetohydrodynamics (GRRMHD). The extended code self-consistently evolves nuclear species coupled to hydrodynamics, magnetic fields, and neutrino radiation transport under the conformal flatness approximation to Einstein's equations. Four approximate nuclear networks are included, with stiff source terms integrated using implicit-explicit Runge-Kutta schemes. Validation is performed through benchmarks including conserved-to-primitive recovery with a tabulated stellar equation of state, one-zone silicon burning, and hydrodynamic tests of shock tubes, acoustic pulses, and detonation fronts of Type Ia supernovae. These tests confirm accurate coupling between nuclear reactions and fluid dynamics, conserving electron and nuclear mass fractions to machine precision. As an application, we conduct spherically symmetric core-collapse supernova simulations. The models reproduce the expected non-exploding behavior of standard progenitors, while enhanced neutrino heating revives the shock. Including nuclear burning modifies the post-shock composition and dynamics, converting silicon and oxygen layers into iron-group nuclei and strengthening the explosion. This demonstrates the impact of explosive burning on ejecta composition and shock evolution, and establishes the stability of the coupled GR radiation-MHD-nuclear framework. The implementation is fully compatible with multidimensional GRMHD simulations and represents the first GRRMHD code combining M1 neutrino transport with fully coupled nuclear burning.",
      "pdf_url": "https://arxiv.org/pdf/2510.12978.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13629",
      "title": "The Supernova 1987A system and its recent evolution - a review",
      "authors": [
        "Michael J. Barlow"
      ],
      "abstract": "The Supernova 1987A system and its recent evolution - a review Michael J. Barlow 31 pages, 14 figures. Final accepted version. To appear in the journal `Contemporary Physics' published by Taylor and Francis Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Supernova 1987A was the closest supernova event to be observed in nearly 400 years. The outflowing ejecta from the explosion continues to interact with extended circumstellar material and with the equatorial ring (ER) in the triple ring system, while observations of the system have continued across the whole electromagnetic spectrum. This review mainly focuses on works published over the past ten years on Supernova 1987A and its remnant. These include (a) submillimetre, infrared and X-ray studies of molecules, ions and dust in the ejecta, and (b) infrared, optical and X-ray studies of dust and ionized gas in the ER and in the surrounding circumstellar medium, including their time evolution as the ER is shocked and eroded by the impact of high velocity ejecta. Since 2022, the James Webb Space Telescope has become available for high angular resolution infrared observations of Supernova 1987A and has made significant contributions to both (a) and (b) above. Its discovery of redshifted narrow-line emission from multiple ion species located at the centre of the ejecta strongly requires the presence there of either a cooling hot neutron star, or a pulsar wind nebula, to power the emission.",
      "pdf_url": "https://arxiv.org/pdf/2510.13629.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13736",
      "title": "The collision and merger products of stars do not look alike: A magnetohydrodynamics comparison",
      "authors": [
        "Pavan Vynatheya",
        "Taeho Ryu",
        "Chen Wang",
        "Alison Sills",
        "Rüdiger Pakmor"
      ],
      "abstract": "The collision and merger products of stars do not look alike: A magnetohydrodynamics comparison Pavan Vynatheya, Taeho Ryu, Chen Wang, Alison Sills, Rüdiger Pakmor 16 pages, 7 figures, 3 tables, Submitted to ApJ Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) A significant fraction of stars experience close interactions, including collisions resulting from gravitational encounters and mergers within close binary systems. These processes can produce more massive stars that may give rise to relatively rare objects such as blue stragglers. Distinguishing the outcomes of collisions and mergers is challenging yet essential for interpreting observations. This study utilizes the magnetohydrodynamics code AREPO to simulate collisions and mergers of $5$ to $10 \\,\\mathrm{M}_{\\odot}$ main-sequence stars, systematically comparing the properties of the resulting products. Both collisions and mergers yield more massive, strongly magnetized, rapidly and differentially rotating stars with cores enriched in hydrogen, but notable quantitative differences emerge. Merger products exhibit core hydrogen fractions up to $10\\%$ higher than those of collision products. In both scenarios, turbulent mixing amplifies magnetic field energies by $9$ to $12$ orders of magnitude. However, magnetic fields in small-impact-parameter collision products display small-scale reversals that may dissipate over time, whereas merger products and large-impact-parameter collision products develop large-scale ordered, potentially long-lived magnetic fields. Additionally, only merger products display magnetically driven, bipolar outflows with radial velocities exceeding $300$ to $400 \\,\\mathrm{km}\\,\\mathrm{s}^{-1}$. These distinctions may result in divergent long-term evolutionary outcomes, which warrant further investigation in future studies.",
      "pdf_url": "https://arxiv.org/pdf/2510.13736.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2407.18867",
      "title": "Catalog of outbursts of neutron star LMXBs",
      "authors": [
        "Craig O. Heinke",
        "Junwen Zheng",
        "Thomas J. Maccarone",
        "Nathalie Degenaar",
        "Arash Bahramian",
        "Gregory R. Sivakoff",
        "Simrat Toor"
      ],
      "abstract": "Catalog of outbursts of neutron star LMXBs Craig O. Heinke, Junwen Zheng, Thomas J. Maccarone, Nathalie Degenaar, Arash Bahramian, Gregory R. Sivakoff, Simrat Toor Published in ApJS. 60 pages, 11 figures, 10 (very long) tables. Outbursts continue to be updated at this https URL ; please contact C Heinke (heinke@ualberta.ca) with missed outburst information Heinke et al. 2025, ApJ Supplement, vol. 279, issue 2, id 57 High Energy Astrophysical Phenomena (astro-ph.HE) Many X-ray binaries are transiently accreting. Having statistics on their recurrence times is helpful to address questions related to binary evolution and populations, as well as the physics of binary systems. We compile a catalog of known outbursts of 87 transient neutron star (identified through bursts or pulsations) low-mass X-ray binaries, until mid-2025. Most outbursts are taken from the literature, but we also identify some outbursts from public X-ray monitoring lightcurves. We find 109 outbursts not previously identified in the literature; most are from the frequent transients GRS 1747-312 and the Rapid Burster MXB 1730-335, though we suspect that two outbursts from Liller 1 may be from another transient, besides the Rapid Burster. We also find new outbursts for 10 other systems, and verify substantial quiescent intervals for XMM J174457-2850.3, XMMU J174716.1-281048, and AX J1754.2-2754. Outburst detection has been relatively efficient since 1996 for outbursts above $F_X$(2-10)$=3\\times10^{-10}$ ergs/s/cm$^2$. While several systems have many known outbursts, 40 of the 87 systems we track have zero or one recorded outburst between 1996 and 2023. This suggests that many faint Galactic Center X-ray binaries may be neutron star X-ray binaries, though we cannot completely rule out the proposition that most neutron star X-ray binaries undergo frequent outbursts below all-sky monitor detection limits.",
      "pdf_url": "https://arxiv.org/pdf/2407.18867.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.13677",
      "title": "Bayesian Quantification of Observability and Equation of State of Twin Stars",
      "authors": [
        "Xavier Grundler",
        "Bao-An Li"
      ],
      "abstract": "Bayesian Quantification of Observability and Equation of State of Twin Stars Xavier Grundler, Bao-An Li 21 pages with 10 figures. Phys. Rev. D in press High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th) The possibility of discovering twin stars, two neutron stars (NSs) with the same mass but different radii, is usually studied in forward modelings by using a restricted number of NS matter equation of state (EOS) encapsulating a first-order phase transition from hadronic to quark matter (QM). Informing our likelihood function with the NS radius data from GW170817 and using a meta-model with 9-parameters capable of mimicking most NS EOSs available in the literature, we conduct a Bayesian quantification of the observability and underlying EOSs of twin stars. Of the accepted EOSs, between 12-18\\% yield twin stars, depending on the restrictions we place on the second branch. The possibility of twin stars remains robust even under recent observational constraints. We show that many of these twin star scenarios are observable with currently available levels of accuracy in measuring NS radii. We also present the marginalized posterior probability density functions (PDFs) of every EOS parameter for each of four mass-radius correlation topologies. We find that the inferred EOS depends sensitively on not only whether twin stars are present, but also the category of twin stars, indicating that the observation of twin stars would provide a strong constraint on the underlying EOS. In particular, for two coexisting hybrid stars having QM cores at different densities, the PDF for QM speed of sound squared $c_{\\rm qm}^2$ has two peaks, one below and another above the conformal limit $c_{\\rm qm}^2=1/3$ predicted by perturbative QCD.",
      "pdf_url": "https://arxiv.org/pdf/2506.13677.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR",
        "nucl-ex",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.02234",
      "title": "Gravitational Redshift for Rapidly Rotating Neutron Stars",
      "authors": [
        "Zsombor Jakab",
        "Sharon Morsink"
      ],
      "abstract": "Gravitational Redshift for Rapidly Rotating Neutron Stars Zsombor Jakab, Sharon Morsink Accepted by ApJ. Revision includes changes based on the referee's comments, and smaller figure files High Energy Astrophysical Phenomena (astro-ph.HE) The Oblate Schwarzschild (OS) approximation is a method often used to compute the flux of X-rays emitted from a rapidly rotating neutron star. In this approximation, the oblate shape of the rotating star is embedded in the Schwarzschild metric, which is used to compute the redshift of photon energies as they propagate from the star to the telescope. In this paper, we demonstrate that there are small errors introduced by the standard treatment of photon redshift in the OS approximation and provide a simple method to correct these errors. These errors are constant in phase, so this results in a constant absolute reduction in the flux. For PSR J0740+6620, the most rapidly spinning of the pulsars observed by NICER, we estimate the flux errors are less than 1\\%, which is an order of magnitude smaller than the uncertainty in the distance, so this does not affect the mass and radius constraints found for this pulsar. The errors for the other pulsars observed by NICER are even smaller. However, this correction should be included when analyzing data for more rapidly rotating X-ray pulsars with spin frequencies near 600 Hz.",
      "pdf_url": "https://arxiv.org/pdf/2507.02234.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.04375",
      "title": "Low-frequency spectra of neutron star + OB supergiant binaries: Does wind density drive persistent and flaring modes of accretion?",
      "authors": [
        "J. van den Eijnden",
        "L. Sidoli",
        "M. Díaz Trigo",
        "I. El Mellah",
        "V. Sguera",
        "N. Degenaar",
        "F. Fürst",
        "V. Grinberg",
        "P. Kretschmar",
        "S. Martínez-Núñez",
        "J. C. A. Miller-Jones",
        "K. Postnov",
        "T. D. Russell"
      ],
      "abstract": "Low-frequency spectra of neutron star + OB supergiant binaries: Does wind density drive persistent and flaring modes of accretion? J. van den Eijnden, L. Sidoli, M. Díaz Trigo, I. El Mellah, V. Sguera, N. Degenaar, F. Fürst, V. Grinberg, P. Kretschmar, S. Martínez-Núñez, J. C. A. Miller-Jones, K. Postnov, T. D. Russell Accepted for publication in MNRAS. 20 pages, 10 figures, 4 tables. Updated Zenodo DOI for Data Reproduction Package Mon Not R Astron Soc (2025) 862-880 High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Neutron star high-mass X-ray binaries are well-studied in wavebands between the infrared and hard X-rays. Their low-frequency millimeter and radio properties, on the other hand, remain poorly understood. We present observations of the millimeter and radio emission of binaries where a neutron star accretes from an OB supergiant. We report ALMA and NOEMA millimeter observations of twelve systems, supplemented by VLA radio observations of six of those targets. Our targets include six Supergiant X-ray Binaries (SgXBs), four Supergiant Fast X-ray Transients (SFXTs), and two intermediate systems. Nine out of twelve targets, including all SFXTs, are detected in at least one millimeter band, while in the radio, only two targets are detected. All detected targets display inverted radio/millimeter spectra, with spectral indices in the range $\\alpha =0.6-0.8$ for those systems where accurate SED fits could be performed. We conclude, firstly, that the low-frequency SEDs of neutron star SFXTs and SgXBs are dominated by free-free emission from the OB supergiant's stellar wind, and that jet emission is unlikely to be observed unless the systems can be detected at sub-GHz frequencies. Secondly, we find that SFXTs are fainter at 100 GHz than prototypical SgXBs, probably due to systematically less dense winds in the former, as supported further by the differences in their fluorescence Fe K$\\alpha$ lines. We furthermore compare the stellar wind constraints obtained from our millimeter observations with those from IR/optical/UV studies and bow shock detections, and present evidence for long-term stellar wind variability visible in the thermal emission.",
      "pdf_url": "https://arxiv.org/pdf/2508.04375.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12848",
      "title": "Constraining Ultra-Light Dark Matter mass with Dwarf Galaxy Rotation Curves",
      "authors": [
        "Tian-yao Fang",
        "Ming-Chung Chu"
      ],
      "abstract": "Constraining Ultra-Light Dark Matter mass with Dwarf Galaxy Rotation Curves Tian-yao Fang, Ming-Chung Chu Astrophysics of Galaxies (astro-ph.GA) While ultra-light bosonic dark matter (ULDM) in a Bose-Einstein condensate (BEC) state could naturally account for the central core in some galaxies and resolve the core-cusp problem, the dark matter density distribution in the outer regions of galaxies remains less explored. We propose a trial wavefunction to model the ULDM distribution beyond the BEC core. We derive the corresponding rotation velocity curve, which shows excellent agreement with those of 12 dwarf spheroidal galaxies. The best-fit ULDM particle mass for each dwarf galaxy falls within a strikingly narrow range of $m=(1.8-3.2)\\times 10^{-23}\\text{eV}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.12848.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12892",
      "title": "ALMAGAL VIII. Cataloging Hierarchical Mass Structure from Cores to Clumps across the Galactic Disk",
      "authors": [
        "Jennifer Wallace , Taevis Kolz , Cara Battersby , Aleksandra Kuznetsova , Álvaro Sánchez-Monge , Eugenio Schisano , Alessandro Coletta , Qizhou Zhang , Sergio Molinari , Peter Schilke , Paul T. P. Ho , Rolf Kuiper , Tianwei Zhang , Thomas Möller , Ralf S. Klessen , Maria T. Beltrán , Floris van der Tak , Stefania Pezzuto , Henrik Beuther , Alessio Traficante , Davide Elia , Leonardo Bronfman , Pamela Klaassen , Dariusz C. Lis , Luca Moscadelli , Kazi Rygl , Milena Benedettini , Chi Yan Law , Jofre Allande , Alice Nucara , Patrick M. Koch , Won-ju Kim , Patricio Sanhueza , Gary Fuller , Georgie Stroud , Beth Jones , Crystal Brogan , Todd Hunter , Aida Ahmadi , Adam Avison , Katharine Johnston , Sheng-Yuan Liu , Chiara Mininni , Yu-Nung Su University of Connecticut, Department of Physics, University of Oregon, Department of Physics Institut de Ciències de l'Espai , CSIC, Institut d'Estudis Espacials de Catalunya , INAF-Istituto di Astrofisica e Planetologia Spaziale, Dipartimento di Fisica, Sapienza Università di Roma, Center for Astrophysics | Harvard and Smithsonian, I. Physikalisches Institut, Universität zu Köln, Institute of Astronomy and Astrophysics, Academia Sinica, East Asian Observatory, Faculty of Physics, University of Duisburg-Essen, Research Center for Astronomical computing, Zhejiang Laboratory, Universität Heidelberg, Zentrum für Astronomie, Institut für Theoretische Astrophysik, Universität Heidelberg, Interdisziplinäres Zentrum für Wissenschaftliches Rechnen, INAF-Osservatorio Astrofisico di Arcetri, Space Research Organization Netherlands , Kapteyn Astronomical Institute, University of Groningen, Max Planck Institute for Astronomy, Departamento de Astronomía, Universidad de Chile, UK Astronomy Technology Centre, Royal Observatory Edinburgh, Jet Propulsion Laboratory, California Institute of Technology, INAF-Istituto di Radioastronomia and Italian ALMA Regional Centre, Dipartimento di Fisica e Astronomia, Università degli Studi di Firenze, Max-Planck-Institut für Radioastronomie, Jodrell Bank Centre for Astrophysics, Oxford Road, The University of Manchester, National Radio Astronomy Observatory, Leiden Observatory, Leiden University, SKA Observatory, Jodrell Bank, UK ALMA Regional Centre Node, School of Engineering and Physical Sciences, Isaac Newton Building, University of Lincoln)"
      ],
      "abstract": "ALMAGAL VIII. Cataloging Hierarchical Mass Structure from Cores to Clumps across the Galactic Disk Jennifer Wallace (1), Taevis Kolz (1 and 2), Cara Battersby (1), Aleksandra Kuznetsova (1), Álvaro Sánchez-Monge (3 and 4), Eugenio Schisano (5), Alessandro Coletta (5 and 6), Qizhou Zhang (7), Sergio Molinari (5), Peter Schilke (8), Paul T. P. Ho (9 and 10), Rolf Kuiper (11), Tianwei Zhang (12 and 8), Thomas Möller (8), Ralf S. Klessen (13 and 14), Maria T. Beltrán (15), Floris van der Tak (16 and 17), Stefania Pezzuto (5), Henrik Beuther (18), Alessio Traficante (5), Davide Elia (5), Leonardo Bronfman (19), Pamela Klaassen (20), Dariusz C. Lis (21), Luca Moscadelli (15), Kazi Rygl (22), Milena Benedettini (5), Chi Yan Law (15), Jofre Allande (15 and 23), Alice Nucara (5), Patrick M. Koch (9), Won-ju Kim (8 and 24), Patricio Sanhueza (9), Gary Fuller (8 and 25), Georgie Stroud (25), Beth Jones (8), Crystal Brogan (26), Todd Hunter (26), Aida Ahmadi (27), Adam Avison (28 and 25 and 29), Katharine Johnston (30), Sheng-Yuan Liu (9), Chiara Mininni (5), Yu-Nung Su (9) ((1) University of Connecticut, Department of Physics, (2) University of Oregon, Department of Physics (3) Institut de Ciències de l'Espai (ICE), CSIC, (4) Institut d'Estudis Espacials de Catalunya (IEEC), (5) INAF-Istituto di Astrofisica e Planetologia Spaziale, (6) Dipartimento di Fisica, Sapienza Università di Roma, (7) Center for Astrophysics | Harvard and Smithsonian, (8) I. Physikalisches Institut, Universität zu Köln, (9) Institute of Astronomy and Astrophysics, Academia Sinica, (10) East Asian Observatory, (11) Faculty of Physics, University of Duisburg-Essen, (12) Research Center for Astronomical computing, Zhejiang Laboratory, (13) Universität Heidelberg, Zentrum für Astronomie, Institut für Theoretische Astrophysik, (14) Universität Heidelberg, Interdisziplinäres Zentrum für Wissenschaftliches Rechnen, (15) INAF-Osservatorio Astrofisico di Arcetri, (16) Space Research Organization Netherlands (SRON), (17) Kapteyn Astronomical Institute, University of Groningen, (18) Max Planck Institute for Astronomy, (19) Departamento de Astronomía, Universidad de Chile, (20) UK Astronomy Technology Centre, Royal Observatory Edinburgh, (21) Jet Propulsion Laboratory, California Institute of Technology, (22) INAF-Istituto di Radioastronomia and Italian ALMA Regional Centre, (23) Dipartimento di Fisica e Astronomia, Università degli Studi di Firenze, (24) Max-Planck-Institut für Radioastronomie, (25) Jodrell Bank Centre for Astrophysics, Oxford Road, The University of Manchester, (26) National Radio Astronomy Observatory, (27) Leiden Observatory, Leiden University, (28) SKA Observatory, Jodrell Bank, (29) UK ALMA Regional Centre Node, (30) School of Engineering and Physical Sciences, Isaac Newton Building, University of Lincoln) 29 pages, 12 figures, submitted to the Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) Investigating the multi-scale fragmentation of dense clumps into compact cores is essential for understanding the processes that govern the initial distribution of mass in stellar clusters and how high-mass stars ($>8~M_{\\odot}$) form. We present a catalog of the hierarchical continuum structure from 904 clumps observed in the ALMAGAL program, a high resolution ($0.15-0.8$\\arcsec) 1.38 mm Atacama Large Millimeter/submillimeter Array (ALMA) large program targeting dense clumps capable of high-mass star formation throughout the Galactic disk. We use \\verb|astrodendro|, a dendrogram-based algorithm, on a uniform linear resolution (2000 au) version of the data to extract 5160 continuum structures with effective radii spanning $800-42000$ au and estimated masses between $~0.05-670~M_{\\odot}$. With our large sample, we statistically examine the difference in clump properties for regions with varying levels of hierarchical complexity. We find that clumps exhibiting the richest hierarchical morphology have distributions with higher dust temperatures, surface densities, luminosity-to-mass (\\textit{L/M}) ratios, and most massive core (MMC) masses, indicating that these regions tend to be at later evolutionary stages. We find a positive correlation between the mass of cores from the ALMAGAL core catalog and the surface density of their surrounding structures identified in this work. However, this correlation is weaker for cores in more evolved clumps, where lower mass cores can be found at higher local surface densities. This could indicate that some cores accrete mass less efficiently from the intra-clump reservoir than others, despite the total available mass increasing over time, a scenario that is congruent with a clump-fed core accretion model.",
      "pdf_url": "https://arxiv.org/pdf/2510.12892.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12942",
      "title": "Only the Special Survive: Evolution of Long-Lived Star Clusters in Galaxy Simulations",
      "authors": [
        "Alessa I. Wiggins",
        "Sarah Loebman",
        "Peter Frinchaboy"
      ],
      "abstract": "Only the Special Survive: Evolution of Long-Lived Star Clusters in Galaxy Simulations Alessa I. Wiggins, Sarah Loebman, Peter Frinchaboy 3 pages, 2 figures, Proceedings of the IAU Symposium 395 Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) In this work, we aim to answer one crucial question behind the discrepancy between chemical trends of field stars and clusters in the Galactic disk: is the chemical gradient mismatch driven by cluster migration and differential survivability as a function of galactic location? To answer this question, we explored the evolution of long-lived (> 1 Gyr) star clusters in Milky Way-galaxy simulations. In particular, we investigated why some star clusters remain bound over billions of years. We have traced the unique trajectories for a sample of open clusters around two FIRE galaxies throughout cosmic time. Additionally, we characterized the small-scale environment surrounding these clusters over their orbital history. We see that clusters across both FIRE galaxies spend the majority of their lives in under-dense regions of gas, except for brief passages where they interact with gas clouds, causing their orbits to be altered.",
      "pdf_url": "https://arxiv.org/pdf/2510.12942.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13070",
      "title": "Galactic chemical evolution with the short-lived isotopes Mn-53, Fe-60, Hf-182, and Pu-244",
      "authors": [
        "Benjamin Wehmeyer",
        "Andrés Yagüe López",
        "Benoit Côté",
        "Maria K. Pető",
        "Chiaki Kobayashi",
        "Maria Lugaro"
      ],
      "abstract": "Galactic chemical evolution with the short-lived isotopes Mn-53, Fe-60, Hf-182, and Pu-244 Benjamin Wehmeyer, Andrés Yagüe López, Benoit Côté, Maria K. Pető, Chiaki Kobayashi, Maria Lugaro Astrophysics of Galaxies (astro-ph.GA) We run a three-dimensional Galactic chemical evolution (GCE) model to follow the propagation of Mn-53 from supernovae of type Ia (SNIa), Fe-60 from core-collapse supernovae (CCSNe), Hf-182 from intermediate mass stars (IMSs), and Pu-244 from neutron star mergers (NSMs) in the Galaxy. We compare the GCE of these short-lived radioactive isotopes (SLRs) to recent detections on the deep-sea floor. We find that although these SLRs originate from different sites, they often arrive conjointly on Earth.",
      "pdf_url": "https://arxiv.org/pdf/2510.13070.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13152",
      "title": "The Dependency of Bar Formation Timescale on Disk Mass Fraction, Toomre $Q$, and Scale Height",
      "authors": [
        "Bin-Hui Chen",
        "Juntai Shen"
      ],
      "abstract": "The Dependency of Bar Formation Timescale on Disk Mass Fraction, Toomre $Q$, and Scale Height Bin-Hui Chen, Juntai Shen 9 pages, 5 figures, accepted for publication on ApJ Astrophysics of Galaxies (astro-ph.GA) Bars are one of the most prominent galactic structures. The classical swing-amplification theory can qualitatively describe the spontaneous bar instability of stellar disks. Still, it cannot quantify the bar formation process or explain why some disk galaxies do not have a bar. Recent studies found that the bar formation timescale depends exponentially on the disk mass fraction of the host galaxy (dubbed as \"Fujii relation\"), but they only explored a limited parameter space, where the physical effects of Toomre $Q$ (local disk stability parameter) and disk scale height of the host galaxies are not fully explored. In this work, we check the robustness of the Fujii relation in a higher-dimensional parameter space of disk mass fraction, Toomre $Q$, and scale height. We find that the Fujii relation holds for disk galaxies with physically reasonable Toomre $Q$ and scale height. Furthermore, the bar formation timescale also approximately linearly depends on both Toomre $Q$ and scale height, with a more prolonged bar formation in a hotter or thicker disk. We propose an empirical relation to combine the dependency of the bar formation timescale on the three parameters. Based on the empirical relation and recent observations, we estimate that the bar formation timescale in pure stellar disks ranges from $0.20_{-0.06}^{+0.09}~\\mathrm{Gyr}$ to $12.20_{-2.80}^{+3.37}~\\mathrm{Gyr}$ or even significantly beyond the Hubble timescale in some extreme cases.",
      "pdf_url": "https://arxiv.org/pdf/2510.13152.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13153",
      "title": "Dependency of the Bar Formation Timescale On The Halo Spin",
      "authors": [
        "Bin-Hui Chen",
        "Sandeep Kumar Kataria",
        "Juntai Shen",
        "Meng Guo"
      ],
      "abstract": "Dependency of the Bar Formation Timescale On The Halo Spin Bin-Hui Chen, Sandeep Kumar Kataria, Juntai Shen, Meng Guo 10 pages, 6 figures, accepted for publication on ApJ, welcome comments Astrophysics of Galaxies (astro-ph.GA) Bars are among the most prominent structures in disk galaxies. While the widely accepted swing-amplification theory provides a qualitative framework for their formation, the detailed physical processes remain incompletely understood. Previous studies have shown that the bar formation timescale in isolated galaxies depends exponentially on the disk mass fraction (the so-called \"Fujii relation\") and linearly on disk hotness and thickness. However, the influence of dark matter halo spin on bar formation has not been systematically investigated. In this work, we construct a suite of $N$-body models of disk and halo with varying disk mass fractions and amounts of random motions. By introducing prograde and retrograde spins in the dark matter halo, we explore how halo spin modifies the established empirical relations governing bar formation timescales. We find that these relations remain valid in both prograde and retrograde halo spin models. For rapid bar formation (short timescale), the effect of halo spin is nearly negligible. In contrast, for moderately slow bar formation, prograde (retrograde) halo spin tends to accelerate (suppress) bar onset. In cases of extremely slow bar formation, halo spin introduces a stronger but more stochastic influence. These trends might arise from the exchange of angular momentum between the stellar disk and the dark matter halo.",
      "pdf_url": "https://arxiv.org/pdf/2510.13153.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13240",
      "title": "Discovery of red galaxy candidates at z ~ 12: Early dust growth or significant nebular emission with high-temperature stars?",
      "authors": [
        "Ikki Mitsuhashi",
        "Katherine A. Suess",
        "Joel Leja",
        "Pratika Dayal",
        "Robert Feldmann",
        "Seiji Fujimoto",
        "Harley Katz",
        "Themiya Nanayakkara",
        "Desika Narayanan",
        "Sedona H. Price",
        "John R. Weaver",
        "Christina C. Williams",
        "Ivo Labbe",
        "Rachel Bezanson",
        "Hakim Atek",
        "Gabriel Brammer",
        "Sam E. Cutler",
        "Lukas J. Furtak",
        "Richard Pan",
        "Bingjie Wang",
        "Katherine E. Whitaker"
      ],
      "abstract": "Discovery of red galaxy candidates at z ~ 12: Early dust growth or significant nebular emission with high-temperature stars? Ikki Mitsuhashi, Katherine A. Suess, Joel Leja, Pratika Dayal, Robert Feldmann, Seiji Fujimoto, Harley Katz, Themiya Nanayakkara, Desika Narayanan, Sedona H. Price, John R. Weaver, Christina C. Williams, Ivo Labbe, Rachel Bezanson, Hakim Atek, Gabriel Brammer, Sam E. Cutler, Lukas J. Furtak, Richard Pan, Bingjie Wang, Katherine E. Whitaker Astrophysics of Galaxies (astro-ph.GA) We report the discovery of two z ~ 12 galaxy candidates with unusually red UV slopes (betaUV ~> -1.5), and probe the origin of such colors at cosmic dawn. From Prospector fits to the UNCOVER/MegaScience dataset -- deep JWST/NIRCam imaging of Abell 2744 in 20 broad- and medium-bands -- we identify several new z > 10 galaxies. Medium-band data improve redshift estimates, revealing two lensed (mu ~ 3.3) z ~ 12 galaxies in a close pair with beta_UV ~> -1.5 at an UV absolute magnitude of M_UV ~ -19 mag, lying away from typical scatter on previously known MUV-betaUV relations. SED fitting with Prospector, Bagpipes, and EAZY support their high-z nature, with probability of low-z interlopers of p(z < 7) < 10%. The potential low-z interlopers are z ~ 3 quiescent galaxies (QGs), but unexpected to be detected at the given field of view unless z ~ 3 QG stellar mass function has a strong turn up at log Mstar/Msun ~ 9. Unlike typical blue high-redshift candidates (beta_UV ~< -2.0), these red slopes require either dust or nebular continuum reddening. The dust scenario implies Av ~ 0.8 mag, which is larger than theoretical predictions, but is consistent with a dust-to-stellar mass ratio (log M_dust/M_star ~ -3). The nebular scenario demands dense gas (log nH /cm^3 ~ 4.0) around hot stars (log Teff [K] ~ 4.9). Spectroscopic follow-up is essential to determine their true nature and reveal missing galaxies at the cosmic dawn.",
      "pdf_url": "https://arxiv.org/pdf/2510.13240.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13241",
      "title": "The dependence of black hole formation in open clusters on the cluster formation process",
      "authors": [
        "Jian-Wen Zhou"
      ],
      "abstract": "The dependence of black hole formation in open clusters on the cluster formation process Jian-Wen Zhou Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) We performed N-body simulations of both individual cluster evolution and subcluster coalescence, demonstrating that cluster evolution and its outcomes strongly depend on the cluster formation process through comparisons of different gas expulsion modes and formation channels. The evolution of star clusters is significantly shaped by the gas expulsion mode, with faster expulsion producing greater mass loss. A broader degeneracy exists among initial cluster mass, gas expulsion timescale, and formation channel (monolithic vs. coalescence), which manifests in both evolutionary pathways and black hole production. In individual cluster simulations, slower gas expulsion enables progressively lower-mass clusters to retain central black holes within the tidal radius. As the gas expulsion mode transitions from fast to moderate to slow, the fraction of high-velocity stars decreases. Variations in gas expulsion mode and formation channel ultimately influence the stellar velocity distribution (within the tidal radius), and thus the expansion speed, which governs both cluster mass loss and black hole retention. Slowly expanding clusters are more likely to retain black holes and multiple systems, making them prime candidates for black hole searches with {\\it Gaia}. Our results highlight the crucial influence of early gas expulsion and cluster formation mechanisms on the dynamical evolution of star clusters and black hole production. These factors should be carefully incorporated into the initial conditions of N-body simulations, which necessarily rely on input from the star formation community.",
      "pdf_url": "https://arxiv.org/pdf/2510.13241.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13288",
      "title": "Old open clusters NGC 188 and M 67 in Gaia DR3",
      "authors": [
        "Anton F. Seleznev",
        "Maxim V. Kulesh"
      ],
      "abstract": "Old open clusters NGC 188 and M 67 in Gaia DR3 Anton F. Seleznev, Maxim V. Kulesh Astrophysics of Galaxies (astro-ph.GA) We performed a statistical study of two old open clusters NGC 188 and M 67 using Gaia DR3 data. No tidal tails of the clusters were detected, which most likely had been destroyed when the cluster passed through the Galactic plane. The size estimates of the clusters depend on the range of astrometric parameters and stellar magnitudes of the stars used for star counts. The mass spectra of two clusters differ significantly. NGC 188 shows a deficit of low-mass stars compared to M 67. In the halo region of NGC 188 (compared to the core region of the cluster), there is a relative excess of the low-mass stars (just as in the case of M 67) and a deficit of stars in the mass range from 0.66 to 0.9 solar masses. Comparison with the Hunt & Reffert samples showed that almost all the stars from these samples are contained among the stars we selected for counting. Moreover, the group probability of these stars belonging to clusters, estimated by the uniform background method, is higher than 60%. It is shown that the velocity dispersion of single stars (selected according to the `stellar magnitude -- color index' diagrams) is significantly smaller than the velocity dispersion of unresolved binary stars.",
      "pdf_url": "https://arxiv.org/pdf/2510.13288.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13657",
      "title": "Condensation sequence of circumstellar cluster seeds (CSCCS)",
      "authors": [
        "David Gobrecht"
      ],
      "abstract": "Condensation sequence of circumstellar cluster seeds (CSCCS) David Gobrecht Frontiers, Astrononmy and Space Science,Section Astrochemistry, Volume 12, 2025 Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Traditionally, the condensation sequence of circumstellar dust is predicted based on the thermodynamic stabilities of specific condensates in the macroscopic bulk phase. However, at the (sub-)nanometer scale clusters with non-crystalline structures and significantly different properties are energetically favoured. For this reason, we study the thermodynamic stabilities of metal oxide clusters with generic stoichiometries of M$_2$O$_3$ and M$_3$O$_4$, where M represents a metal atom. With an upper size limit of 50 atoms, we consider clusters with sizes n=1$-$10 for (M$_2$O$_3$)$_n$, and n=1$-$7 for (M$_3$O$_4$)$_n$. The M$_2$O$_3$ clusters comprise alumina (Al$_2$O$_3$), Mg-rich pyroxene (MgSiO$_3$) and a size-limited sample of titanates (CaTiO$_3$), whereas the M$_3$O$_4$ clusters include spinel (MgAl$_2$O$_4$), Mg-rich olivine (Mg$_2$SiO$_4$) and calcium aluminates (CaAl$_2$O$_4$). We find that, apart from the alumina monomer, the aluminum-bearing clusters (Al$_2$O$_3$)$_n$, n=1$-$10, and (MgAl$_2$O$_4$)$_n$, n=1$-$7, are favoured over their silicate counterparts (MgSiO$_3$)$_n$, n=1$-$10 and (Mg$_2$SiO$_4$)$_n$, n=1$-$7. Also, we find that calcium aluminate clusters, CaAl$_2$O$_4$, are energetically more favourable than magnesium aluminate clusters, MgAl$_2$O$_4$. Furthermore, for a limited data set of (CaTiO$_3$)$_n$, n=1$-$2, clusters we find significantly larger stabilities than for the other considered (M$_2$O$_3$)$_n$ clusters, namely Al$_2$O$_3$ and MgSiO$_3$. Future investigations, in particular on titanates and on Ca-rich silicates, are required to draw a more thorough and complete picture of the condensation sequence at the (sub-)nanoscale.",
      "pdf_url": "https://arxiv.org/pdf/2510.13657.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13719",
      "title": "The Stellar Morphology & Size of X-ray-selected Active Galactic Nuclei Host Galaxies Revealed by JWST",
      "authors": [
        "Bovornpratch Vijarnwannaluk",
        "Zhen-Kai Gao",
        "Wei-Hao Wang",
        "Chian-Chou Chen",
        "Abdurrahman Naufal",
        "Adarsh Ranjan",
        "Bau-Ching Hsieh",
        "Chayan Mondal",
        "Chayan Mondal",
        "Chih-Yuan Chang",
        "Hiddo S.B. Algera",
        "Li-Wen Liao",
        "Masayuki Akiyama",
        "Seong Jin Kim",
        "Shoichiro Mizukoshi",
        "Tomotsugo Goto",
        "Yu-Yen Chang",
        "Caitlin Casey",
        "Jeyhan S. Kartaltepe",
        "Hollis B. Akins",
        "Marko Shuntov",
        "Maximilien Franco",
        "Santosh Harish"
      ],
      "abstract": "The Stellar Morphology & Size of X-ray-selected Active Galactic Nuclei Host Galaxies Revealed by JWST Bovornpratch Vijarnwannaluk, Zhen-Kai Gao, Wei-Hao Wang, Chian-Chou Chen, Abdurrahman Naufal, Adarsh Ranjan, Bau-Ching Hsieh, Chayan Mondal, Chayan Mondal, Chih-Yuan Chang, Hiddo S.B. Algera, Li-Wen Liao, Masayuki Akiyama, Seong Jin Kim, Shoichiro Mizukoshi, Tomotsugo Goto, Yu-Yen Chang, Caitlin Casey, Jeyhan S. Kartaltepe, Hollis B. Akins, Marko Shuntov, Maximilien Franco, Santosh Harish Astrophysics of Galaxies (astro-ph.GA) We investigate the stellar shape and size-mass relationship of X-ray selected Active Galactic Nuclei (AGN) host galaxies using the high-angular resolution and deep sensitivity in the near-infrared of the COSMOS-Web JWST survey field. We present the rest-frame 1-$\\mu m$ size, stellar mass, Sersic index, axis-ratio, Gini-$M_{20}$ parameters of 690 moderate luminosity AGNs between redshift 0-3 and with stellar mass $\\log M_s\\sim 10.75$. We find that AGN host galaxies have an effective radius of 1-5 kpc, which is between star-forming (SFG) and quiescent galaxies (QGs) of the same stellar mass. AGN hosts have similar size-mass trends as SFG and QGs, being smaller at higher redshift for the same stellar mass. The slope of the size-mass relationship of AGN host galaxies is steeper than that of star-forming galaxies. Their rest-frame 1$\\mu m$ stellar morphology indicates a significant spheroidal component. We observed a low merger fraction (6%) in our sample as well as substructures similar to disks, bars, and spiral arms in the residual images, which are in tension with evolutionary pathways that require major mergers. However, it may also be due to the different timescales between mergers and AGN activity.",
      "pdf_url": "https://arxiv.org/pdf/2510.13719.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13737",
      "title": "Comparing subgrid models for cosmic ray diffusion in a magnetized isolated galaxy simulation",
      "authors": [
        "Sarah Thiele",
        "Romain Teyssier"
      ],
      "abstract": "Comparing subgrid models for cosmic ray diffusion in a magnetized isolated galaxy simulation Sarah Thiele, Romain Teyssier Accepted version for MNRAS, 12 figures Monthly Notices of the Royal Astronomical Society (2025) Astrophysics of Galaxies (astro-ph.GA) Galactic cosmic rays (CRs) play a crucial role in galaxy formation and evolution by altering gas dynamics and chemistry across multiple scales. Typical numerical simulations of CR transport assume a constant diffusion coefficient for the entire galaxy, despite both numerical and theoretical studies showing that it can change by orders of magnitude depending on the phase of the interstellar medium. Only a few simulations exist that self-consistently calculate CR transport with diffusion, streaming, and advection by the background gas. In this study we explore three subgrid models for CR diffusion, based on popular theories of CR transport. We post-process an isolated, star-forming MHD galactic disk simulated using the RAMSES code. The resulting diffusion coefficients depend solely on the subgrid turbulent kinetic energy and the MHD state variables of the plasma. We use these models to calculate coefficients for vertical transport. We find that they depend critically on the local magnetic field tilt angle. Across models, our resulting diffusion coefficients range from $10^{26}~\\rm cm^2s^{-1}$ to $10^{31}~\\rm cm^2s^{-1}$, and yield CR energy densities at the midplane from $1$ to $100 ~\\rm eV cm^{-3}$, suggesting varied degrees of backreaction on their environment. Using simple approximations, we show that the gamma ray luminosity of the galaxy depends primarily on the gas surface density and the turbulent confinement of CRs by the galactic corona.",
      "pdf_url": "https://arxiv.org/pdf/2510.13737.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12940",
      "title": "J-PLUS: Turning Off the Bright Stars",
      "authors": [
        "Sepideh Eskandarlou",
        "Mohammad Akhlaghi",
        "Johan H. Knapen",
        "Carlos López-Sanjuan",
        "Raúl Infante-Sainz",
        "Helena Domínguez Sánchez",
        "Zahra Sharbaf",
        "Héctor Vázquez Ramió",
        "Juan Antonio Fernández Ontiveros",
        "César Iñiguez García",
        "Tamara Civera Lorenzo",
        "David José Muniesa Gallardo",
        "Paula R.T. Coelho",
        "Alessandro Ederoclite",
        "Jesus Varela",
        "Fran Jiménez-Esteban",
        "A. Javier Cenarro",
        "Antonio Marín-Franch",
        "Renato A. Dupke",
        "Mariano Moles",
        "Carlos Hernández-Monteagudo",
        "Rahna P.T.",
        "David Cristóbal-Hornillos",
        "Jailson Alcaniz",
        "Laerte Sodré Jr.",
        "Raul E. Angulo"
      ],
      "abstract": "J-PLUS: Turning Off the Bright Stars Sepideh Eskandarlou, Mohammad Akhlaghi, Johan H. Knapen, Carlos López-Sanjuan, Raúl Infante-Sainz, Helena Domínguez Sánchez, Zahra Sharbaf, Héctor Vázquez Ramió, Juan Antonio Fernández Ontiveros, César Iñiguez García, Tamara Civera Lorenzo, David José Muniesa Gallardo, Paula R.T. Coelho, Alessandro Ederoclite, Jesus Varela, Fran Jiménez-Esteban, A. Javier Cenarro, Antonio Marín-Franch, Renato A. Dupke, Mariano Moles, Carlos Hernández-Monteagudo, Rahna P.T., David Cristóbal-Hornillos, Jailson Alcaniz, Laerte Sodré Jr., Raul E. Angulo Accepted for publication in A&A. Supplementary data on Zenodo (this http URL), project source on Gitlab (this https URL) and archived on Software Heritage (swh:1:dir:fc95ed9ad173de6fa64690e3d71ab041c630f32c; see text for usage). Abstract is summarized to fit arXiv limit Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) Photometric surveys require precise point spread function (PSF) characterization, as it varies across filters and is crucial for accurate photometry and low surface brightness (LSB) studies. However, the small PSF size provided by default pipelines suits only barely resolved objects, making it difficult to analyze regions near bright stars (rendering those regions unusable). These components are then combined to generate a final PSF for each exposure and filter, spanning 15 mag arcsec-2 in surface brightness and 4 arcmin in radius in the broad bands. In narrow-band filters, the J-PLUS PSF exhibits two rings, whereas in broad-band filters, only one ring is observed. Additionally, the position of the ring shifts with filter wavelength: as the filters become redder, the ring radius increases. We find that there is no significant variation in the extended PSF observed as a function of time (within 2.5h) or position in the field of view. The radial profile of NGC 4212 (which is close to a star) is also studied before/after PSF-subtraction. We developed a novel method to determine the central coordinates of saturated stars, and classify stars without using Gaia magnitudes. Additionally, mirror reflections are automatically detected and masked. Furthermore, in combining different stars and various components of the PSF, we avoided the use of a fixed radius by introducing a new method that does not depend on radial measurements. Accurate characterization of the extended PSF and its subtraction improves sky subtraction, increases the effective area of the survey by about 10%, and enables the study of extended large LSB features in wide area surveys like J-PLUS. Our pipeline is published as free software (GNU GPLv3) an can be customized to other surveys such as J-PAS, where its impact will be even greater due to its depth. This paper is fully reproducible and produced from Commit 4860c70.",
      "pdf_url": "https://arxiv.org/pdf/2510.12940.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13141",
      "title": "Statistical properties of compressible isothermal turbulence from sub- to supersonic conditions",
      "authors": [
        "F. Thiesset",
        "C. Federrath"
      ],
      "abstract": "Statistical properties of compressible isothermal turbulence from sub- to supersonic conditions F. Thiesset, C. Federrath Fluid Dynamics (physics.flu-dyn); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) This paper investigates the statistical properties of isothermal turbulence in both the subsonic and supersonic regimes. The focus is on the influence of the Mach number ($Ma$) and the Reynolds number ($Re$) on both the space-local and scale-dependent fluctuations of relevant gas variables, the density, velocity, their derivatives, and the kinetic energy. We carry out hydrodynamical simulations with explicit viscosity and therefore controlled $Re$. We confirm previous work that the probability density functions (PDFs) of the gas density are approximately log-normal and depend on $Ma$. In contrast, derivatives of the density and velocity field are sensitive to $Re$, with the probability of extreme events growing with $Re$. The PDFs of the density gradient and velocity divergence (dilatation) exhibit increasingly heavy tails with growing $Ma$, signalling enhanced internal intermittency. At sufficiently high $Ma$, the statistics of dilatation are observed to saturate at a level determined solely by $Re$, suggesting that turbulent dilatation becomes limited by viscous effects. We also examine the scale-by-scale distribution of kinetic energy through a compressible form of the Kármán-Howarth-Monin (KHM) equation. In the intermediate range of scales, a marked difference is found between subsonic and supersonic turbulence: while Kolmogorov-like scaling applies in the sub- and transonic regimes, supersonic turbulence aligns more closely with Burgers turbulence predictions. The analysis of individual terms in the KHM equation highlights the role of the pressure-velocity coupling as an additional mechanism for converting kinetic energy from large to small scales. Moreover, the contributions of the KHM terms exhibit non-monotonic behaviour with increasing $Ma$, with dilatational effects becoming more pronounced and acting to oppose the cascade of kinetic energy.",
      "pdf_url": "https://arxiv.org/pdf/2510.13141.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13222",
      "title": "Prospects for the Crossing of Comet 3I/ATLAS's Ion Tail",
      "authors": [
        "Samuel R. Grant",
        "Geraint H. Jones"
      ],
      "abstract": "Prospects for the Crossing of Comet 3I/ATLAS's Ion Tail Samuel R. Grant, Geraint H. Jones Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) During October - November 2025, interstellar comet 3I/ATLAS, will pass upstream of the Europa Clipper and Hera spacecraft. Here, we identify two potential opportunities for in-situ observations of 3I's ion tail by immersion, facilitated by the close alignment between the comet's hyperbolic trajectory with the ecliptic plane. During the period 30 October - 6 November 2025, it is predicted that Europa Clipper will potentially be immersed within the ion tail of 3I/ATLAS, providing the opportunity to detect the signatures of an interstellar comet's ion tail. Characteristic changes to the solar wind are also expected to be observed; a magnetic draping structure associated with the comet may be identifiable. It is further predicted that spacecraft Hera will possibly be immersed within the ion tail of 3I/ATLAS during the period 25 October - 1 November 2025.",
      "pdf_url": "https://arxiv.org/pdf/2510.13222.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.20869",
      "title": "Origin of the two-armed vertical phase-spiral in the inner Galactic disk",
      "authors": [
        "Rimpei Chiba",
        "Neige Frankel",
        "Chris Hamilton"
      ],
      "abstract": "Origin of the two-armed vertical phase-spiral in the inner Galactic disk Rimpei Chiba, Neige Frankel, Chris Hamilton 20 pages. Accepted for publication in MNRAS after 1st revision Mon Not R Astron Soc (2025), Volume 543, Issue 3, pp. 2159-2179 Astrophysics of Galaxies (astro-ph.GA) Gaia recently revealed a two-armed spiral pattern in the vertical phase-space distribution of the inner Galactic disk (guiding radius $R_\\textrm{g} \\sim 6.2$ kpc), indicating that some non-adiabatic perturbation symmetric about the mid-plane is driving the inner disk out of equilibrium. The non-axisymmetric structures in the disk (e.g., the bar or spiral arms) have been suspected to be the major source for such a perturbation. However, both the lifetime and the period of these internal perturbations are typically longer than the period at which stars oscillate vertically, implying that the perturbation is generally adiabatic. This issue is particularly pronounced in the inner Galaxy, where the vertical oscillation period is shorter and therefore adiabatically shielded more than the outer disk. We show that two-armed phase spirals can naturally form in the inner disk if there is a vertical resonance that breaks the adiabaticity; otherwise, their formation requires a perturber with an unrealistically short lifetime. We predict analytically and confirm with simulations that a steadily rotating (non-winding) two-armed phase spiral forms near the resonance when stars are subject to both periodic perturbations (e.g., by spiral arms) and stochastic perturbations (e.g., by giant molecular clouds). Due to the presence of multiple resonances, the vertical phase-space exhibits several local phase spirals that rotate steadily at distinct frequencies, together forming a global phase spiral that evolves over time. Our results demonstrate that, contrary to earlier predictions, the formation of the two-armed phase spiral does not require transient perturbations with lifetimes shorter than the vertical oscillation period.",
      "pdf_url": "https://arxiv.org/pdf/2503.20869.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.13597",
      "title": "Constraining cosmic ray transport models using circumgalactic medium properties and observables",
      "authors": [
        "Yue Samuel Lu",
        "Dušan Kereš",
        "Philip F. Hopkins",
        "Sam B. Ponnada",
        "Claude-André Faucher-Giguère",
        "Cameron B. Hummels"
      ],
      "abstract": "Constraining cosmic ray transport models using circumgalactic medium properties and observables Yue Samuel Lu, Dušan Kereš, Philip F. Hopkins, Sam B. Ponnada, Claude-André Faucher-Giguère, Cameron B. Hummels 20 pages, of which 15 are the main text, with 7 figures and one table. Resubmitted to MNRAS following the first referee report. Sec 3.2 was significantly expanded with a new figure (Fig. 4) Astrophysics of Galaxies (astro-ph.GA) Cosmic rays (CRs) are a pivotal non-thermal component of galaxy formation and evolution. However, the intricacies of CR physics, particularly how they propagate in the circumgalactic medium (CGM), remain largely unconstrained. In this work, we study CGM properties in FIRE-2 (Feedback In Realistic Environments) simulations of the same Milky Way (MW)-mass halo at $z=0$ with different CR transport models that produce similar diffuse $\\sim$ GeV $\\gamma$-ray emission, as an attempt to further constrain CR transport models. We study the gas morphology and thermal properties, and generate synthetic observations of rest-frame UV ion absorption columns and X-ray emission. CRs lower galaxy masses and star formation rates (SFRs) while supporting more cool CGM gas, which boosts the HI and OVI column densities in the CGM, bringing simulations more in line with observations, but there can be large differences between CR transport models and resolution levels. X-ray emission within and close to galaxies is consistent with thermal (free-free and metal-line) emission plus X-ray binaries, while more extended ($\\sim 100\\,$kpc) CGM emission is potentially dominated by inverse Compton (IC) scattering, motivating future work on the spatially resolved X-ray profiles. Although comparisons with observations are sensitive to sample selection and mimicking the details of observations, and our analysis did not result in strong constraints on CR models, the differences between simulations are significant and could be used as a framework for future studies.",
      "pdf_url": "https://arxiv.org/pdf/2505.13597.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.20407",
      "title": "Neutral gas phase distribution from HI morphology: phase separation with scattering spectra and variational autoencoders",
      "authors": [
        "Minjie Lei",
        "S. E. Clark",
        "Rudy Morel",
        "E. Allys",
        "Iryna S. Butsky",
        "Caleb Redshaw",
        "Drummond B. Fielding"
      ],
      "abstract": "Neutral gas phase distribution from HI morphology: phase separation with scattering spectra and variational autoencoders Minjie Lei, S. E. Clark, Rudy Morel, E. Allys, Iryna S. Butsky, Caleb Redshaw, Drummond B. Fielding Astrophysics of Galaxies (astro-ph.GA) Unraveling the multi-phase structure of the diffuse interstellar medium (ISM) as traced by neutral hydrogen (HI) is essential to understanding the lifecycle of the Milky Way. However, HI phase separation is a challenging and under-constrained problem. The neutral gas phase distribution is often inferred from the spectral line structure of HI emission. In this work, we develop a data-driven phase separation method that extracts HI phase structure solely from the spatial morphology of HI emission intensity structures. We combine scattering spectra (SS) statistics with a Gaussian-mixture variational autoencoder (VAE) model to: 1. derive an interpretable statistical model of different HI phases from their multi-scale morphological structures; 2. use this model to decompose the 2D channel maps of GALFA-HI emission in diffuse high latitude ($|b|>30$\\degree) regions over narrow velocity channels ($\\Delta v=3$ km/s) into cold neutral medium (CNM), warm neutral medium (WNM), and noise components. We integrate our CNM map over velocity channels to compare it to an existing map produced by a spectrum-based method, and find that the two maps are highly correlated, while ours recovers more spatially coherent structures at small scales. Our work illustrates and quantifies a clear physical connection between the HI morphology and HI phase structure, and unlocks a new avenue for improving future phase separation techniques by making use of both HI spectral and spatial information to decompose HI in 3D position-position-velocity (PPV) space. These results are consistent with a physical picture where processes that drive HI phase transitions also shape the morphology of HI gas, imprinting a sparse, filamentary CNM that forms out of a diffuse, extended WNM.",
      "pdf_url": "https://arxiv.org/pdf/2505.20407.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.05189",
      "title": "H3+ in irradiated protoplanetary disks: Linking far-ultraviolet radiation and water vapor",
      "authors": [
        "Javier R. Goicoechea",
        "Octavio Roncero",
        "Evelyne Roueff",
        "John H. Black",
        "Ilane Schroetter",
        "Olivier Berné"
      ],
      "abstract": "H3+ in irradiated protoplanetary disks: Linking far-ultraviolet radiation and water vapor Javier R. Goicoechea, Octavio Roncero, Evelyne Roueff, John H. Black, Ilane Schroetter, Olivier Berné Accepted for publication in A&A (20 September 2025). 19 pages including appendix Astrophysics of Galaxies (astro-ph.GA) The likely JWST detection of vibrationally excited H3+ emission in Orion's irradiated disk system d203-506 raises the important question of whether cosmic-ray ionization is enhanced in disks within clustered star-forming regions, or whether alternative mechanisms contribute to H3+ formation and excitation. We present a detailed model of the photodissociation region (PDR) component of a protoplanetary disk -comprising the outer disk surface and the photoevaporative wind - exposed to strong external far-ultraviolet (FUV) radiation. We investigate key gas-phase reactions involving excited H2 that lead to the formation of H3+ in the PDR, including detailed state-to-state dynamical calculations of reactions H2(v>=0) + HOC+ -> H3+ + CO and H2(v>=0) + H+ -> H2+ + H. We also consider the effects of photoionization of vibrationally excited H2(v>=4), a process not previously included in PDR or disk models. We find that these FUV-driven reactions dominate the formation of H3+ in the PDR of strongly irradiated disks, largely independently of cosmic-ray ionization. The predicted H3+ abundance in the disk PDR peaks at x(H3+)~1E-8, coinciding with regions of enhanced HOC+ and water vapor abundances, and is linked to the strength of the external FUV field (G0). The predicted H3+ column density (~1E13 cm^-2) agrees with the presence of H3+ in the PDR of d203-506. We also find that formation pumping, resulting from exoergic reactions between excited H2 and HOC+, drives the vibrational excitation of H3+ in these regions. We expect this photochemistry to be highly active in disks where G_0 > 1E3. The H3+ formation pathways studied here may also be relevant in the inner disk region (near the host star), in exoplanetary ionospheres, and in the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2506.05189.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.16512",
      "title": "Galactic echoes",
      "authors": [
        "Rimpei Chiba",
        "Jupiter Ding",
        "Chris Hamilton",
        "Matthew W. Kunz",
        "Scott Tremaine"
      ],
      "abstract": "Rimpei Chiba, Jupiter Ding, Chris Hamilton, Matthew W. Kunz, Scott Tremaine 12 pages. Accepted for publication in MNRAS after 1st revision Mon Not R Astron Soc (2025), Volume 543, Issue 1, pp. 190-201 Astrophysics of Galaxies (astro-ph.GA); Plasma Physics (physics.plasm-ph) Gaia has revealed a variety of substructures in the phase space of stars in the Solar neighborhood, including the vertical `Snail' in $(z,v_z)$ space. Such substructures are often interpreted as the incompletely phase-mixed response of the disc stars to a single perturbation, such as an impulsive encounter with a satellite galaxy. In this paper we consider the possibility that such structures contain manifestations of phase space echoes. First established in plasma physics in the 1960s, echoes arise when a collisionless system is perturbed twice: the macroscopic responses to both perturbations mix to small scales in phase space, whereupon they couple nonlinearly, producing a third macroscopic `echo' response without the need for a third perturbation. We derive the galactic analogue of the plasma echo theory using angle-action variables and apply it to a one-dimensional model of vertical motion in the Milky Way. We verify the predicted echo behavior using idealized test particle simulations, both with and without the inclusion of diffusion through orbital scattering off molecular clouds. While we conclude that the Gaia Snail itself is unlikely a (pure) echo effect, the basic physics we uncover is sufficiently generic that we expect phase-space echoes to be common in disc galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2506.16512.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07896",
      "title": "CO desorption from interstellar icy grains induced by IR excitation of superhydrogenated PAHs",
      "authors": [
        "L. Slumstrup",
        "J. D. Thrower",
        "A. T. Hopkinson",
        "G. Wenzel",
        "R. Jaganathan",
        "J. G. M. Schrauwen",
        "B. Redlich",
        "S. Ioppolo",
        "L. Hornekær"
      ],
      "abstract": "CO desorption from interstellar icy grains induced by IR excitation of superhydrogenated PAHs L. Slumstrup, J. D. Thrower, A. T. Hopkinson, G. Wenzel, R. Jaganathan, J. G. M. Schrauwen, B. Redlich, S. Ioppolo, L. Hornekær 13 pages, 5 Figures, 3 Tables. Post peer-review and layout corrections. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Infrared (IR) radiation dominates dense, interstellar clouds, yet its effect on icy grains remains largely unexplored. Its potential role in driving the photodesorption of volatile species from such grains has recently been demonstrated, providing a crucial link between the solid state reservoir of molecules and the gas phase. In this work, we investigate IR-induced photodesorption of CO for astrophysically relevant ice systems containing perhydropyrene (PHP). This fully superhydrogenated version of pyrene is used as an analogue for large carbonaceous molecules such as polycyclic aromatic hydrocarbons (PAHs) and related species, as well as hydrogenated carbonaceous grains. The abundance and range of strong IR absorption bands of these carbonaceous species make them interesting candidates for IR-induced effects. We present IR spectroscopic and mass spectrometric measurements probing the effects of IR radiation on two ice systems: a layered ice with CO on top of PHP, and a CO:PHP mixed ice. These ices were irradiated with IR radiation from the FELIX IR Free Electron Laser (FEL) FEL-2. In accordance with previous studies, we confirm that direct excitation of CO is not an efficient pathway to CO desorption, indicating that another energy dissipation mechanism exists. We demonstrate that vibrational excitation of the PHP CH stretching modes leads to efficient CO photodesorption. The derived photodesorption yields are an order of magnitude higher for the layered than the mixed system and comparable to those previously obtained for CO photodesorption from CO on amorphous solid water upon excitation of H$_2$O vibrational modes. Our results indicate that IR excitation of carbonaceous molecules and grains in dense clouds could potentially play an important role in the desorption of volatile species such as CO from icy grains.",
      "pdf_url": "https://arxiv.org/pdf/2507.07896.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.20386",
      "title": "Revisiting the Radial Metallicity Gradient-Age Relation in the Milky Way's Thin and Thick Disks",
      "authors": [
        "Ao Chen",
        "Juntai Shen",
        "Chun Wang",
        "Yang Huang"
      ],
      "abstract": "Revisiting the Radial Metallicity Gradient-Age Relation in the Milky Way's Thin and Thick Disks Ao Chen, Juntai Shen, Chun Wang, Yang Huang 9 pages, 9 figures, to be submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) Galactic disks typically exhibit a negative radial metallicity gradient, indicating faster enrichment in the inner regions. Recent studies report that this gradient becomes flatter with increasing stellar age in the Milky Way's (MW) thin disk, while the thick disk exhibits a mildly positive gradient across all ages. In this work, we revisit the metallicity gradient-age relation (MGAR) in both the thin and thick disks of the MW. We use spectroscopic data from LAMOST DR8 and stellar ages calibrated with asteroseismology. Our results show a steadily flattening MGAR in the thin disk and confirm a positive gradient $\\sim0.013\\,\\mathrm{dex\\,kpc^{-1}}$ in the thick disk. The flattening in the thin disk may be caused by large-scale radial migration induced by transient spiral arms, or by a time-dependent steepening of the interstellar medium (ISM) metallicity gradient as suggested by recent FIRE2 simulations. The positive gradient in the thick disk may reflect early enrichment of the outer regions by strong feedback or starburst-driven outflows in a turbulent, gas-rich proto-disk. These findings suggest distinct chemodynamical evolution paths for the MW's thin and thick disks and provide valuable constraints for future models of Galactic chemical evolution.",
      "pdf_url": "https://arxiv.org/pdf/2508.20386.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.11966",
      "title": "GALACTICNUCLEUS: A high angular resolution JHKs imaging survey of the Galactic centre",
      "authors": [
        "Á. Martínez Arranz",
        "R. Schödel",
        "H. Bouy",
        "F. Nogueras-Lara"
      ],
      "abstract": "GALACTICNUCLEUS: A high angular resolution JHKs imaging survey of the Galactic centre Á. Martínez Arranz, R. Schödel, H. Bouy, F. Nogueras-Lara Astrophysics of Galaxies (astro-ph.GA) The center of the Milky Way is a unique environment of great astrophysical interest, but its extreme crowding and extinction make it difficult to study. The GALACTICNUCLEUS survey, a high-angular-resolution near-infrared imaging program, was designed to overcome these challenges. We present the methodology and first results of its second data release, which includes major improvements in reduction, calibration, and analysis, providing deeper photometry, improved astrometry, and high-precision proper motions across the Nuclear Stellar Disk. Observations were obtained with VLT/HAWK-I in two epochs separated by seven years, using speckle holography and a ground-layer adaptive optics system. Proper motions were derived both relative, by aligning epochs within the survey, and absolute, by tying to the Gaia reference frame. The new release achieves photometry about one magnitude deeper and astrometry about ten times more precise than the first release. Proper motions reach an accuracy of about 0.5 mas/yr relative to Gaia. In the Arches field, our clustering analysis recovers the cluster with mean velocities consistent with HST-based results. The second data release of the GALACTICNUCLEUS survey provides the most precise ground-based proper motion catalogs of the Galactic Center to date, enabling studies of the Nuclear Stellar Disk, young star kinematics, and new stellar cluster detections.",
      "pdf_url": "https://arxiv.org/pdf/2510.11966.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.12213",
      "title": "Is the Interstellar Object 3I/ATLAS Alien Technology?",
      "authors": [
        "Adam Hibberd",
        "Adam Crowl",
        "Abraham Loeb"
      ],
      "abstract": "Is the Interstellar Object 3I/ATLAS Alien Technology? Adam Hibberd, Adam Crowl, Abraham Loeb International Journal of Aerodynamic Control & Avionic Mechanics. 2025 Volume 1 Issue 1 Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) At this early stage of its passage through our Solar System, 3I/ATLAS, the recently discovered interstellar interloper, has displayed various anomalous characteristics, determined from photometric and astrometric observations. As largely a pedagogical exercise, in this paper we present additional analysis into the astrodynamics of 3I/ATLAS, and hypothesize that this object could be technological, and possibly hostile as would be expected from the 'Dark Forest' resolution to the 'Fermi Paradox'. We show that 3I/ATLAS approaches surprisingly close to Venus, Mars and Jupiter, with a probability of $\\lesssim 0.005$\\%. Furthermore the low retrograde tilt of 3I/ATLAS's orbital plane to the ecliptic offers various benefits to an Extra-terrestrial Intelligence (ETI), since it allows the object access to our planet with relative impunity. The eclipse by the Sun from Earth of 3I/ATLAS at perihelion, would allow it to conduct a clandestine reverse Solar Oberth Manoeuvre, an optimal high-thrust strategy for interstellar spacecraft to brake and stay bound to the Sun. An optimal intercept of Earth would entail an arrival in late November/early December of 2025, and also, a non-gravitational acceleration of $\\sim{5.9} \\times 10^{-5}$ au day$^{-2}$, normalized at 1 au from the Sun, would indicate an intent to intercept the planet Jupiter, not far off its path, and a strategy to rendezvous with it after perihelion.",
      "pdf_url": "https://arxiv.org/pdf/2507.12213.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01405",
      "title": "Advancing Interstellar Science: A Global Framework for Comprehensive Study of Interstellar Objects",
      "authors": [
        "Omer Eldadi",
        "Gershon Tenenbaum",
        "Abraham Loeb"
      ],
      "abstract": "Advancing Interstellar Science: A Global Framework for Comprehensive Study of Interstellar Objects Omer Eldadi, Gershon Tenenbaum, Abraham Loeb Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The operation of the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) marks a transformative moment in humanity's capacity to detect and characterize interstellar objects (ISOs). With projections indicating an increase from a few detections per decade to potentially one every few months, humanity stands at the threshold of unprecedented scientific opportunity offering revolutionary insights into the nature of rocky materials, building blocks of life and technological products from other star systems. This white paper proposes the establishment of the United Nations Committee on Interstellar Objects (UNCIO), a specialized body designed to coordinate global scientific research, maximize observational coverage, and ensure optimal scientific return from these extraordinary objects from outside the solar system through systematic investigation in cosmochemistry, astrobiology, planetary sciences, fundamental physics, advanced technologies and materials science. The proposed framework addresses critical gaps in our current international infrastructure: the absence of coordinated detection, classification and intercept capabilities, insufficient protocols for rapid scientific response and international policy decisions to time-sensitive observations, and the need for effective science communication to maintain government and public support for these ambitious investigations and global threats to Earth. Drawing from successful international collaborations in areas such as the International Space Station (ISS) and the European Organization for Nuclear Research (CERN), UNCIO would operate through a dual structure: an executive board for time-critical scientific decisions and an expanded committee for comprehensive stakeholder representation. This initiative is not merely aspirational but urgently practical.",
      "pdf_url": "https://arxiv.org/pdf/2510.01405.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12969",
      "title": "High-Resolution Modelling of Coronae and Winds in Solar-type Stars with Varying Rotation Rates I. X-ray Coronae",
      "authors": [
        "Yue-Hong Chen",
        "Julián D. Alvarado-Gómez",
        "Xin Cheng",
        "Yu Dai",
        "Tong Shi",
        "Katja Poppenhäger",
        "Chen Xing",
        "Shun Inoue",
        "Jörn Warnecke",
        "Maarit J. Korpi-Lagg",
        "Mingde Ding"
      ],
      "abstract": "High-Resolution Modelling of Coronae and Winds in Solar-type Stars with Varying Rotation Rates I. X-ray Coronae Yue-Hong Chen, Julián D. Alvarado-Gómez, Xin Cheng, Yu Dai, Tong Shi, Katja Poppenhäger, Chen Xing, Shun Inoue, Jörn Warnecke, Maarit J. Korpi-Lagg, Mingde Ding Solar and Stellar Astrophysics (astro-ph.SR) Stellar coronae are believed to be the main birthplace of various stellar magnetic activities. However, the structures and properties of stellar coronae remain poorly understood. Using the Space Weather Modelling Framework with the Alfvén Wave Solar Model (SWMF-AWSoM) and dynamo-generated surface magnetic maps, here we model the coronae of four solar-type stars. By incorporating the Sun, our work covers a range of stars with the rotation varying from 1.0 to 23.3 $\\Omega_\\odot$ (periods of 25 to 1 days). Guided by observations, we scale the magnetic field strength with increasing rotation, covering a range between 6.0 G to 1200 G approximately. In our models, energy release associated with small-scale magnetic flux is a key source of coronal heating and is essential for reproducing realistic coronal structures. Our models capture dense (1$-$2 orders of magnitude higher than solar values) and ultra-hot ($\\sim 10\\,\\mathrm{MK}$) coronae dominated by closed field structures. Using the CHIANTI atomic database, we also compute synthetic X-ray spectra and derive the corresponding X-ray luminosities $(L_X)$, which follow a scaling law to magnetic field $L_X \\propto \\langle|\\mathbf{B}|\\rangle^{1.75}$. Furthermore, the coronal X-ray emission is found to be rotationally modulated by the alternating presence of bright active regions and dark coronal holes. These results provide new insights into the extremely high-energy coronae of rapidly rotating solar-type stars, which differ markedly from the Sun.",
      "pdf_url": "https://arxiv.org/pdf/2510.12969.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13014",
      "title": "Beyond OCCAM: Measuring Optical Neutron Capture Abundances of Open Cluster Stars",
      "authors": [
        "Natalie Myers",
        "Sarah Loebman",
        "Henrique Reggiani",
        "Peter Frinchaboy"
      ],
      "abstract": "Beyond OCCAM: Measuring Optical Neutron Capture Abundances of Open Cluster Stars Natalie Myers, Sarah Loebman, Henrique Reggiani, Peter Frinchaboy 3 pages, 2 figures, Proceedings of the IAU Symposium 395 Solar and Stellar Astrophysics (astro-ph.SR) Open clusters have long been used to determine ages of stars, as well as calibrate stellar evolution models and other methods of age-dating stellar groups, e.g., gyrochronology, asteroseismology, and chemical clocks. In this work, we have obtained new high-resolution (R $\\ge$ 50,000), high-S/N, optical data for 3+ stellar members in open clusters, using Keck/HIRES, with membership derived from the Open Cluster Chemical Abundances and Mapping (OCCAM) survey. From these new Keck/HIRES data, we have derived neutron capture abundances for stars in seven distant outer Galaxy open cluster",
      "pdf_url": "https://arxiv.org/pdf/2510.13014.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13339",
      "title": "Abundance of heavy r-process elements in CEMP-rs stars: The role of the i-process",
      "authors": [
        "A. M. Riyas",
        "D. Karinkuzhi",
        "S. Van Eck",
        "A. Choplin",
        "S. Goriely",
        "L. Siess",
        "M. V. Keerthy",
        "A. Jorissen",
        "T. Merle"
      ],
      "abstract": "Abundance of heavy r-process elements in CEMP-rs stars: The role of the i-process A. M. Riyas, D. Karinkuzhi, S. Van Eck, A. Choplin, S. Goriely, L. Siess, M. V. Keerthy, A. Jorissen, T. Merle Accepted for publication in The Astrophysical Journal (ApJ), 34 pages, 13 figures Solar and Stellar Astrophysics (astro-ph.SR) Carbon-enhanced metal-poor (CEMP) stars are ancient stars enriched in carbon and heavy elements. Some of these stars exhibit enhanced s-process and/or r-process elements, hence are classified as CEMP-s, CEMP-rs, or CEMP-r. This classification is challenging due to the limited availability of heavy element abundances, particularly among r-process elements. Heavy r-process elements such as terbium, holmium, thulium, ytterbium, lutetium, tantalum, and iridium have rarely been measured because their sensitive lines are located in the ultraviolet. However, they provide sensitive diagnostics of the s-, r-, and i- nucleosynthetic processes. In this work, we aim to obtain a secure classification of CEMP-s and -rs stars and investigate whether the i-process can account for the measured abundance patterns in CEMP-rs stars. We derive the abundance profiles, notably for twelve heavy r-elements, including, in some cases, tantalum, using high-resolution UVES spectra of seventeen CEMP-s and -rs stars. Based on indicators such as the [s/r] abundance ratio or the model-independent 'abundance distance', nine stars are confirmed as CEMP-rs and six as CEMP-s. The classification of two objects remains uncertain. The i-process satisfactorily reproduces the abundance patterns of CEMP-rs stars. However, larger samples are needed to confirm trends with metallicity and clarify how CEMP-rs stars differ from CEMP-s stars.",
      "pdf_url": "https://arxiv.org/pdf/2510.13339.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13388",
      "title": "ON the stability of triangular Lagrangian points in the spatial restricted three-body problem",
      "authors": [
        "Stepan P. Sosnitskii"
      ],
      "abstract": "ON the stability of triangular Lagrangian points in the spatial restricted three-body problem Stepan P. Sosnitskii Solar and Stellar Astrophysics (astro-ph.SR) In the present paper, which is a development of an earlier study by the author \\cite{Sosnitskii08}, we consider the stability of triangular libration points in the spatial circular restricted three-body problem and improve the result of author's work \\cite{Sosnitskii08}. Unlike \\cite{Sosnitskii08}, where the instability of libration points was established on the base of reduced approximate equations, we succeeded in this paper to use a new approach that made it possible to prove the instability of triangular libration points on the base of a closed complete system of equations. The relationship between the Lyapunov stability and Birkhoff stability (formal stability) is also discussed",
      "pdf_url": "https://arxiv.org/pdf/2510.13388.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13486",
      "title": "Recent progress on interstellar radionuclides on Earth and the Moon",
      "authors": [
        "Dominik Koll",
        "Sebastian Fichter",
        "Michael Hotchkis",
        "Martin Martschini",
        "Silke Merchel",
        "Stefan Pavetich",
        "Annabel Rolofs",
        "Steve Tims",
        "Sebastian Zwickel",
        "Anton Wallner"
      ],
      "abstract": "Recent progress on interstellar radionuclides on Earth and the Moon Dominik Koll, Sebastian Fichter, Michael Hotchkis, Martin Martschini, Silke Merchel, Stefan Pavetich, Annabel Rolofs, Steve Tims, Sebastian Zwickel, Anton Wallner Solar and Stellar Astrophysics (astro-ph.SR); Nuclear Experiment (nucl-ex) The detection of interstellar radionuclides in geological archives provides insights into nucleosynthesis in stars and stellar explosions as well as interstellar medium dynamics in the Local Bubble and the Local Interstellar Cloud. In this work, current projects to detect interstellar radionuclides with accelerator mass spectrometry will be reviewed. These projects aim to address unsolved questions regarding the timing and the origin of the influxes and to establish new radionuclides for future searches. For the first time, experimental evidence for an inhomogeneous deposition of interstellar 60Fe onEarthwill be presented and another potential source for 60Fe on Earth and the Moon, primary galactic cosmic rays, will be introduced.",
      "pdf_url": "https://arxiv.org/pdf/2510.13486.pdf",
      "categories": [
        "astro-ph.SR",
        "nucl-ex"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13593",
      "title": "Measuring the precise photometric period of the probable intermediate polar 1RXS J014549.6+514314 based on extensive photometry",
      "authors": [
        "V. P. Kozhevnikov"
      ],
      "abstract": "Measuring the precise photometric period of the probable intermediate polar 1RXS J014549.6+514314 based on extensive photometry V. P. Kozhevnikov 13 pages, 8 figures, submitted for publication in AN Solar and Stellar Astrophysics (astro-ph.SR) Recently, in the VSX database, G. Murawski reported the discovery of an oscillation with a period of about 40 min in the probable cataclysmic variable 1RXS J014549.6+514314. To confirm the existence of this oscillation and precisely measure its period, I conducted extensive photometric observations of the object over 25 nights between 2022 and 2024. The total duration of these observations was 139 hr. The observations revealed the oscillation on each observation night. This oscillation was coherent throughout all the observations covering 18 months. Due to the large coverage of observations, I was able to determine the oscillation period with high precision. It was found to be 41.485867+\\-0.000026 min. The semi-amplitude of the oscillation was large, averaging 0.154(2) mag. The pulse profile of the oscillation did not change during the observations and followed a perfect sinusoidal pattern. With the high precision of the period, I created an ephemeris for the oscillation with a validity time of 30 years. This ephemeris can be used in future studies of changes in the oscillation period. Although short-period X-ray oscillations have not yet been detected in 1RXS J014549.6+514314, the high coherence of its 41-minute oscillation suggests that this object is most likely to be an intermediate polar.",
      "pdf_url": "https://arxiv.org/pdf/2510.13593.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13728",
      "title": "Planetary-mass companions to a retired B star BD+37 3172 and a retired F star BD+42 2315",
      "authors": [
        "Andrzej Niedzielski",
        "Robert Jaros",
        "Artur Paczuski",
        "Monika Adamów",
        "Aleksander Wolszczan",
        "Eva Villaver",
        "Gracjan Maciejewski",
        "Beata Deka-Szymankiewicz"
      ],
      "abstract": "Planetary-mass companions to a retired B star BD+37 3172 and a retired F star BD+42 2315 Andrzej Niedzielski, Robert Jaros, Artur Paczuski, Monika Adamów, Aleksander Wolszczan, Eva Villaver, Gracjan Maciejewski, Beata Deka-Szymankiewicz Acta Astronomica, December 2023, Vol. 73, no. 4, p. 291-313 Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Radial velocity searches may lead to detection of exoplanets at large orbital separations only if long-enough time-series of data are available. Therefore publication of precise measurements collected in the past is very valuable even if not successfully completed with a definitive detection. Here we present 309 precise ($\\sigma$RV$\\approx$5-7 m s$^{-1}$) multi-epoch radial velocities for 28 stars observed with the Hobby-Eberly Telescope and its High Resolution Spectrograph between 2004 and 2013. Based on the observations gathered we present a low mass companion ($m_{p}\\sin{i}$ = 10.6 $M_{J}$ in 1887.76 $\\pm$ 0.01 d, 4.65 au orbit with $e$ = 0.59 $\\pm$ 0.01) to a K giant BD+37 3172 ($M$=3.75$\\pm$ 0.86 M$_{\\odot}$), and a planetary mass companion (m$_{p}\\sin{i}$=0.55 M$_{J}$ in 123.05$\\pm$0.04 day, 0.55 au orbit with e=0.73$\\pm$0.03) to a K giant BD+42 2315 ($M$=1.38$\\pm$ 0.30 M$_{\\odot}$). We also present two preliminary detections of new spectroscopic binaries: BD+56 2957 (K5) and HD 236555 (G5).",
      "pdf_url": "https://arxiv.org/pdf/2510.13728.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.02671",
      "title": "Double-faced white dwarfs and the magnetic inhibition of convection",
      "authors": [
        "Sivan Ginzburg"
      ],
      "abstract": "Double-faced white dwarfs and the magnetic inhibition of convection Sivan Ginzburg major revision (section 3 revamped, altering the conclusions), to appear in MNRAS Solar and Stellar Astrophysics (astro-ph.SR) About one in five white dwarfs undergoes spectral evolution from a helium atmosphere to hydrogen and then back to helium. These short-lived hydrogen envelopes - the result of residual hydrogen diffusion - are eventually destroyed by either hydrogen or helium convection. An emerging class of double-faced white dwarfs seems to catch this process in the act, with varying amounts of hydrogen across regions of the stellar surface. Here, we quantitatively test the hypothesis that these inhomogeneities are the result of the magnetic inhibition of convection. We compute the critical magnetic field $B_{\\rm crit}(M,T_{\\rm eff})$ required to inhibit convection in both hydrogen and helium for $0.6-1.2\\,M_\\odot$ white dwarfs using two methods. Initially, we estimated $B_{\\rm crit}\\sim\\sqrt{8\\pi P}$ where $P$ is the pressure at the base of the convection zone, finding that most (three out of four) of the observed magnetic double-faced white dwarfs could potentially be explained by the magnetic inhibition of hydrogen convective energy transfer, with measured $B\\gtrsim B_{\\rm crit}^{\\rm H}$. Then, we incorporated the magnetic field consistently into the stellar structure and directly computed the boundary of convective mixing. With this more appropriate method, we find that only half (two out of four) of the stars could be explained by the magnetic inhibition of helium convection, with $B\\gtrsim B_{\\rm crit}^{\\rm He}$. Specifically, order of unity variations in the magnetic field's strength or orientation across the surface could account for the double-faced nature of these stars. Given our mixed results, other - including non-magnetic - scenarios should be considered as well.",
      "pdf_url": "https://arxiv.org/pdf/2509.02671.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21517",
      "title": "The EBLM project XVI. Spin-orbit alignment of the low mass eclipsing binary EBLM J0021-16",
      "authors": [
        "Becca Spejcher",
        "David V. Martin",
        "Jake Pandina",
        "Andy Zhang",
        "Max Ammons",
        "Wata Thubthong",
        "Amaury Triaud",
        "Ritika Sethi",
        "Noah Vowell",
        "Adrian Barker",
        "Pierre Maxted",
        "Alison Duck",
        "Shelby Summers",
        "François Bouchy",
        "Monika Lendl",
        "Maxime Marmier",
        "Malte Tewes",
        "Stéphane Udry"
      ],
      "abstract": "The EBLM project XVI. Spin-orbit alignment of the low mass eclipsing binary EBLM J0021-16 Becca Spejcher, David V. Martin, Jake Pandina, Andy Zhang, Max Ammons, Wata Thubthong, Amaury Triaud, Ritika Sethi, Noah Vowell, Adrian Barker, Pierre Maxted, Alison Duck, Shelby Summers, François Bouchy, Monika Lendl, Maxime Marmier, Malte Tewes, Stéphane Udry Error in original measurement of true obliquity. Amended value is 29 degrees instead of 4 degrees Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Thousands of tight ($<1$ AU) main sequence binaries have been discovered, but it is uncertain how they formed. There is likely too much angular momentum in a collapsing, fragmenting protostellar cloud to form such binaries in situ, suggesting some post processing. One probe of a binary's dynamical history is the angle between the stellar spin and orbital axes -- its obliquity. The classical method for determining stellar obliquity is the Rossiter-McLaughlin effect. It has been applied to over 100 hot Jupiters, but to less than a dozen stellar binaries. In this paper, we present the Rossiter-McLaughlin measurement of EBLM J0021-16, a $0.19M_\\odot$ M-dwarf eclipsing a $1.05M_\\odot$ G-dwarf on a 5.97 day, almost-circular orbit. We combine CORALIE spectroscopy with TESS photometry of primary and secondary eclipses and star spot modulation. We show that the orbital axis is well-aligned with the primary star's spin axis, with a true 3D obliquity of $\\psi=4.01\\pm0.54^{\\circ}$. EBLM J0021-16 becomes one of only a handful of eclipsing binaries where a true obliquity has been measured. Finally, we derive the M-dwarf's mass and radius to a fractional precision better than 1\\%. The radius of the M dwarf is inflated by 6\\% ($7.4\\sigma$) with respect to stellar models, consistent with many other M-dwarfs in the literature.",
      "pdf_url": "https://arxiv.org/pdf/2509.21517.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.05513",
      "title": "Empirical Optimization of the Source-Surface Height in the PFSS extrapolation",
      "authors": [
        "Munehito Shoda",
        "Kyogo Tokoro",
        "Daikou Shiota",
        "Shinsuke Imada"
      ],
      "abstract": "Empirical Optimization of the Source-Surface Height in the PFSS extrapolation Munehito Shoda, Kyogo Tokoro, Daikou Shiota, Shinsuke Imada accepted for publication in The Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) The potential field source surface (PFSS) method is a widely used magnetic field extrapolation technique in the space weather community. The only free parameter in the PFSS method is the source-surface height ($R_{\\rm SS}$), beyond which all field lines are open. Although $R_{\\rm SS}$ is known to vary with solar activity, there is no consensus on how to determine it for a given surface magnetic field distribution. In this study, we investigate the nature of $R_{\\rm SS}$ using a long-period (2006-2023) data, covering two solar minima and one maximum. We adopt ADAPT-GONG magnetograms and determine $R_{\\rm SS}$ by matching the open flux estimated from observations at 1 au with that calculated using the PFSS method. Our analysis reveals that $R_{\\rm SS}$ increases slightly after the solar minima and around the solar maximum, and that it can be characterized by both the mean unsigned photospheric magnetic field strength and the dipolarity parameter $f_{\\rm dip}$, defined as $f_{\\rm dip} = B_{\\rm dip}^2/(B_{\\rm dip}^2 + B_{\\rm quad}^2 + B_{\\rm oct}^2)$, with $B_{\\rm dip}$, $B_{\\rm quad}$, and $B_{\\rm oct}$ denoting the magnitudes of dipolar, quadrupolar, and octupolar components of photospheric radial magnetic field, respectively. Our results suggest that $R_{\\rm SS}$ does not exhibit a simple monotonic dependence on the solar activity and must be determined by properly considering both surface magnetic field strength and global field structure.",
      "pdf_url": "https://arxiv.org/pdf/2510.05513.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12500",
      "title": "Polarization from Rapidly Rotating Massive Stars",
      "authors": [
        "J. Patrick Harrington",
        "Richard Ignace",
        "Kenneth G. Gayley"
      ],
      "abstract": "Polarization from Rapidly Rotating Massive Stars J. Patrick Harrington, Richard Ignace, Kenneth G. Gayley accepted to Astrophysics & Space Science Solar and Stellar Astrophysics (astro-ph.SR) Stellar rotation has long been recognized as important to the evolution of stars, by virtue of the chemical mixing it can induce and how it interacts with binary mass transfer. Binary interaction and rapid rotation are both common in massive stars and involve processes of angular momentum distribution and transport. An important question is how this angular momentum transport leads to the creation of two important classes of rapidly rotating massive stars, Be stars defined by disklike emission lines, and Bn stars defined by rotationally broadened absorption lines. A related question is what limits this rotation places on how conservative the mass transfer can be. Central to addressing these issues is knowledge of how close to rotational break-up stars can get before they produce a disk. Here we calculate diagnostics of this rotational criticality using the continuum polarization arising from a combination of rotational stellar distortion (i.e., oblateness) and redistribution of stellar flux (i.e., gravity darkening), and compare polarizations produced in the von Zeipel approximation with the approach of Espinosa Lara & Rieutord (ELR). Both produce similar photospheric polarizations that rise significantly in the far ultraviolet (FUV) for B stars, with a stronger signal in the von Zeipel case. For early main-sequence and subgiant stars, it reaches a maximum of ~1% at 140 nm for stars rotating at 98% of critical, when seen edge-on. Rotational rates above 80% critical result in polarizations of several tenths of a percent, at high inclination. These predicted stable signal strengths indicate that determinations of near-critical rotations in B stars could be achieved with future spectropolarimetric instrumentation that can reach deep into the FUV, such as CASSTOR, the Polstar mission concept, or the POLLUX detector design.",
      "pdf_url": "https://arxiv.org/pdf/2510.12500.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02260",
      "title": "Mapping the Cloud-Driven Atmospheric Dynamics & Chemistry of an Isolated Exoplanet Analog with Harmonic Signatures",
      "authors": [
        "Michael K. Plummer",
        "Francis P. Cocchini",
        "Peter A. Kearns",
        "Allison McCarthy",
        "Étienne Artigau",
        "Nicolas B. Cowan",
        "Roman Akhmetshyn",
        "Johanna Vos",
        "Evert Nasedkin",
        "Channon Visscher",
        "Björn Benneke",
        "René Doyon",
        "Stanimir A. Metchev",
        "Jason F. Rowe",
        "Genaro Suárez"
      ],
      "abstract": "Mapping the Cloud-Driven Atmospheric Dynamics & Chemistry of an Isolated Exoplanet Analog with Harmonic Signatures Michael K. Plummer, Francis P. Cocchini, Peter A. Kearns, Allison McCarthy, Étienne Artigau, Nicolas B. Cowan, Roman Akhmetshyn, Johanna Vos, Evert Nasedkin, Channon Visscher, Björn Benneke, René Doyon, Stanimir A. Metchev, Jason F. Rowe, Genaro Suárez Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR); Atmospheric and Oceanic Physics (physics.ao-ph); Geophysics (physics.geo-ph) Young planetary-mass objects and brown dwarfs near the L/T spectral transition exhibit enhanced spectrophotometric variability over field brown dwarfs. Patchy clouds, auroral processes, stratospheric hot spots, and complex carbon chemistry have all been proposed as potential sources of this variability. Using time-resolved, low-to-mid-resolution spectroscopy collected with the JWST/NIRISS and NIRSpec instruments, we apply harmonic analysis to SIMP J0136, a highly variable, young, isolated planetary-mass object. Odd harmonics (k=3) at pressure levels (> 1 bar) corresponding to iron and forsterite cloud formation suggest North/South hemispheric asymmetry in the cloudy, and likely equatorial, regions. We use the inferred harmonics, along with 1-D substellar atmospheric models, to map the flux variability by atmospheric pressure level. These vertical maps demonstrate robust interaction between deep convective weather layers and the overlying stratified and radiative atmosphere. We identify distinct time-varying structures in the near-infrared that we interpret as planetary-scale wave (e.g., Rossby or Kelvin)-associated cloud modulation. We detect variability in water (S/N = 14.0), carbon monoxide (S/N = 13.0), and methane (S/N = 14.9) molecular signatures. Forsterite cloud modulation is anti-correlated with overlying carbon monoxide and water abundances and correlated with deep methane absorption, suggesting complex interaction between cloud formation, atmospheric chemistry, and temperature structure. Furthermore, we identify distinct harmonic behavior between methane and carbon monoxide absorption bands, providing evidence for time-resolved disequilibrium carbon chemistry. At the lowest pressures (< 100 mbar), we find that the mapped methane lines transition from absorption to emission, supporting evidence of high-altitude auroral heating via electron precipitation.",
      "pdf_url": "https://arxiv.org/pdf/2510.02260.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12853",
      "title": "Diffusion models for polarimetric reconstruction of circumstellar environments",
      "authors": [
        "Quentin Villegas",
        "Laurence Denneulin",
        "Simon Prunet",
        "André Ferrari",
        "Nelly Pustelnik",
        "Éric Thiébaut",
        "Julian Tachella",
        "Maud Langlois"
      ],
      "abstract": "Diffusion models for polarimetric reconstruction of circumstellar environments Quentin Villegas, Laurence Denneulin (LRE), Simon Prunet (LAGRANGE), André Ferrari (LAGRANGE), Nelly Pustelnik (Phys-ENS), Éric Thiébaut (CRAL), Julian Tachella (Phys-ENS, CNRS), Maud Langlois (CRAL) in French language. GRETSI 2025 -- XXXe Colloque sur le Traitement du Signal et des Images, Aug 2025, Strasboug, France Instrumentation and Methods for Astrophysics (astro-ph.IM) In this paper, we propose an approach combining diffusion models and inverse problems for the reconstruction of circumstellar disk images. Our method builds upon the Rhapsodie framework for polarimetric imaging, substituting its classical prior with a diffusion model trained on synthetic data. Our formulation explicitly incorporates stellar leakage while efficiently handling missing data and high level noise inherent to high-contrast polarimetric imaging. Experiments show significant improvement over conventional methods within our framework of assumptions, opening new perspectives for studying circumstellar environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.12853.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12861",
      "title": "Simulation of Time-dependent Karhunen-Loeve Phase Screens: an Ergodic Approach",
      "authors": [
        "Richard J. Mathar"
      ],
      "abstract": "Simulation of Time-dependent Karhunen-Loeve Phase Screens: an Ergodic Approach Richard J. Mathar 14 pages, 7 figures, mode list in the anc directory Instrumentation and Methods for Astrophysics (astro-ph.IM) Time-dependent phase screens in ground-based astronomy are typically simulated in the so-called frozen-screen approximation by establishing a static phase screen on a large pupil and dragging an aperture equivalent to the size of the actual input pupil across this oversized phase screen. The speed of this motion sweeping through the large phase screen is equivalent to a wind speed that changes the phase screen as a function of time. The ergodic ansatz replaces this concept by constructing the structure function in a three-dimensional volume -- a sphere for reasons of computational efficiency -- , sampling phase screens by two-dimensional planar cuts through that volume, and dragging them along the surface normal at some speed which generates a video of a phase screen. This manuscript addresses the linear algebra of populating the three-dimensional volume with phase screens of the von-Karman model of atmospheric turbulence.",
      "pdf_url": "https://arxiv.org/pdf/2510.12861.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12920",
      "title": "InferA: A Smart Assistant for Cosmological Ensemble Data",
      "authors": [
        "Justin Z. Tam",
        "Pascal Grosset",
        "Divya Banesh",
        "Nesar Ramachandra",
        "Terece L. Turton",
        "James Ahrens"
      ],
      "abstract": "InferA: A Smart Assistant for Cosmological Ensemble Data Justin Z. Tam, Pascal Grosset, Divya Banesh, Nesar Ramachandra, Terece L. Turton, James Ahrens Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI) Analyzing large-scale scientific datasets presents substantial challenges due to their sheer volume, structural complexity, and the need for specialized domain knowledge. Automation tools, such as PandasAI, typically require full data ingestion and lack context of the full data structure, making them impractical as intelligent data analysis assistants for datasets at the terabyte scale. To overcome these limitations, we propose InferA, a multi-agent system that leverages large language models to enable scalable and efficient scientific data analysis. At the core of the architecture is a supervisor agent that orchestrates a team of specialized agents responsible for distinct phases of the data retrieval and analysis. The system engages interactively with users to elicit their analytical intent and confirm query objectives, ensuring alignment between user goals and system actions. To demonstrate the framework's usability, we evaluate the system using ensemble runs from the HACC cosmology simulation which comprises several terabytes.",
      "pdf_url": "https://arxiv.org/pdf/2510.12920.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12938",
      "title": "Calibration of the ComPair Balloon Instrument",
      "authors": [
        "Nicholas Kirschner",
        "Zachary Metzler",
        "Lucas D. Smith",
        "Carolyn Kierans",
        "Regina Caputo",
        "Nicholas Cannady",
        "Makoto Sasaki",
        "Daniel Shy",
        "Priyarshini Ghosh",
        "Sean Griffin",
        "J. Eric Grove",
        "Elizabeth Hays",
        "Iker Liceaga-Indart",
        "Emily Kong",
        "Julie McEnery",
        "John Mitchell",
        "A. A. Moiseev",
        "Lucas Parker",
        "Jeremy S. Perkins",
        "Bernard Phlips",
        "Adam J. Schoenwald",
        "Clio Sleator",
        "Jacob Smith",
        "Janeth Valverde",
        "Sambid Wasti",
        "Richard Woolf",
        "Eric Wulf",
        "Anna Zajczyk"
      ],
      "abstract": "Calibration of the ComPair Balloon Instrument Nicholas Kirschner, Zachary Metzler, Lucas D. Smith, Carolyn Kierans, Regina Caputo, Nicholas Cannady, Makoto Sasaki, Daniel Shy, Priyarshini Ghosh, Sean Griffin, J. Eric Grove, Elizabeth Hays, Iker Liceaga-Indart, Emily Kong, Julie McEnery, John Mitchell, A. A. Moiseev, Lucas Parker, Jeremy S. Perkins, Bernard Phlips, Adam J. Schoenwald, Clio Sleator, Jacob Smith, Janeth Valverde, Sambid Wasti, Richard Woolf, Eric Wulf, Anna Zajczyk Instrumentation and Methods for Astrophysics (astro-ph.IM) ComPair, the prototype of the All-sky Medium Energy Gamma-ray Observatory (AMEGO) mission concept, is a combined Compton imager and pair production telescope. It consists of four subsystems: a double-sided silicon strip detector (DSSD) Tracker, a virtual Frisch-grid cadmium zinc telluride (CZT) Low Energy Calorimeter, a cesium iodide (CsI) High Energy Calorimeter, and a plastic scintillator Anti-Coincidence Detector (ACD) to reject the charged particle background. These subsystems work together to reconstruct events, by tracking the locations and energies of gamma-ray scatters and pair production events. To quantify ComPair's scientific capabilities prior to a balloon launch in 2023, calibrations were performed to benchmark the instrument's performance in terms of angular resolution, energy resolution, and effective area. In this paper we provide an overview of the ComPair instrument and detail the calibration campaign. Finally, we compare our results to the expected performance based on simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.12938.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13032",
      "title": "Improved Absolute Polarization Calibrator for BICEP CMB Polarimeters",
      "authors": [
        "A. R. Polish",
        "P. A. R. Ade",
        "Z. Ahmed",
        "M. Amiri",
        "D. Barkats",
        "R. Basu Thakur",
        "C. A. Bischoff",
        "D. Beck",
        "J. J. Bock",
        "H. Boenish",
        "V. Buza",
        "B. Cantrall",
        "J. R. Cheshire IV",
        "J. Connors",
        "J. Cornelison",
        "M. Crumrine",
        "A. J. Cukierman",
        "E. Denison",
        "L. Duband",
        "M. Echter",
        "M. Eiben",
        "B. D. Elwood",
        "S. Fatigoni",
        "J. P. Filippini",
        "A. Fortes",
        "M. Gao",
        "C. Giannakopoulos",
        "N. Goeckner-Wald",
        "D. C. Goldfinger",
        "S. Gratton",
        "J. A. Grayson",
        "A. Greathouse",
        "P. K. Grimes",
        "G. Hall",
        "G. Halal",
        "M. Halpern",
        "E. Hand",
        "S. A. Harrison",
        "S. Henderson",
        "T. D. Hoang",
        "J. Hubmayr",
        "H. Hui",
        "K. D. Irwin",
        "J. H. Kang",
        "K. S. Karkare",
        "S. Kefeli",
        "J. M. Kovac",
        "C. Kuo",
        "K. Lasko",
        "K. K. Lau",
        "M. Lautzenhiser",
        "A. Lennox",
        "T. Liu",
        "S. Mackey",
        "N. Maher",
        "K. G. Megerian",
        "L. Minutolo",
        "L. Moncelsi",
        "Y. Nakato",
        "H. T. Nguyen",
        "R. O'Brient",
        "S. N. Paine",
        "A. Patel",
        "M. A. Petroff",
        "T. Prouve",
        "C. Pryke",
        "C. D. Reintsema",
        "T. Romand",
        "M. Salatino",
        "A. Schillaci",
        "B. Schmitt",
        "B. Singari",
        "A. Soliman",
        "T. St. Germaine",
        "A. Steiger",
        "B. Steinbach",
        "R. Sudiwala",
        "K. L. Thompson",
        "C. Tsai",
        "C. Tucker",
        "A. D. Turner",
        "C. Verges",
        "A. G. Vieregg",
        "A. Wandui",
        "A. C. Weber",
        "J. Willmert",
        "W. L. K. Wu",
        "H. Yang",
        "C. Yu",
        "L. Zheng",
        "C. Zhang",
        "S. Zhang"
      ],
      "abstract": "Improved Absolute Polarization Calibrator for BICEP CMB Polarimeters A. R. Polish, P. A. R. Ade, Z. Ahmed, M. Amiri, D. Barkats, R. Basu Thakur, C. A. Bischoff, D. Beck, J. J. Bock, H. Boenish, V. Buza, B. Cantrall, J. R. Cheshire IV, J. Connors, J. Cornelison, M. Crumrine, A. J. Cukierman, E. Denison, L. Duband, M. Echter, M. Eiben, B. D. Elwood, S. Fatigoni, J. P. Filippini, A. Fortes, M. Gao, C. Giannakopoulos, N. Goeckner-Wald, D. C. Goldfinger, S. Gratton, J. A. Grayson, A. Greathouse, P. K. Grimes, G. Hall, G. Halal, M. Halpern, E. Hand, S. A. Harrison, S. Henderson, T. D. Hoang, J. Hubmayr, H. Hui, K. D. Irwin, J. H. Kang, K. S. Karkare, S. Kefeli, J. M. Kovac, C. Kuo, K. Lasko, K. K. Lau, M. Lautzenhiser, A. Lennox, T. Liu, S. Mackey, N. Maher, K. G. Megerian, L. Minutolo, L. Moncelsi, Y. Nakato, H. T. Nguyen, R. O'Brient, S. N. Paine, A. Patel, M. A. Petroff, T. Prouve, C. Pryke, C. D. Reintsema, T. Romand, M. Salatino, A. Schillaci, B. Schmitt, B. Singari, A. Soliman, T. St. Germaine, A. Steiger, B. Steinbach, R. Sudiwala, K. L. Thompson, C. Tsai, C. Tucker, A. D. Turner, C. Verges, A. G. Vieregg, A. Wandui, A. C. Weber, J. Willmert, W. L. K. Wu, H. Yang, C. Yu, L. Zheng, C. Zhang, S. Zhang As submitted to the proceedings of the mm Universe conference, 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM) Cosmic birefringence is a hypothesized parity violation in electromagnetism that predicts a frequency-independent polarization rotation as light propagates. This would rotate the light from the Cosmic Microwave Background, producing an unexpected EB correlation. However, cosmic birefringence angle is degenerate with instrument polarization angle, and breaking this degeneracy requires an absolute polarization calibration. We calibrate the BICEP3 telescope (a 95GHz CMB polarimeter) by observing a rotating polarized source (RPS) with both the telescope and a small test receiver called the In-Situ Absolute Angle Calibrator (ISAAC).",
      "pdf_url": "https://arxiv.org/pdf/2510.13032.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13064",
      "title": "First Demonstration of Kernel Phase Interferometry on JWST/MIRI: Prospects for Future Planet Searches Around Post Main Sequence Stars",
      "authors": [
        "Chelsea Adelman",
        "Steph Sallum",
        "Matthew De Furio",
        "Josh Eisner"
      ],
      "abstract": "First Demonstration of Kernel Phase Interferometry on JWST/MIRI: Prospects for Future Planet Searches Around Post Main Sequence Stars Chelsea Adelman, Steph Sallum, Matthew De Furio, Josh Eisner 11 pages, 5 figures. Submitted to SPIE Optics and Photonics Astronomical Applications Proceedings Volume 13627, Techniques and Instrumentation for Detection of Exoplanets XI, paper #13627-21 Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) Kernel phase interferometry (KPI) is a post-processing technique that treats a conventional telescope as an interferometer by accurately modeling a telescope pupil as an array of virtual subapertures. KPI provides angular resolution within the diffraction limit by eliminating instrumental phase errors to first order. It has been successfully demonstrated to boost angular resolution on both space- and ground-based observatories, and is especially useful for enhancing space telescopes, as their diameters are smaller than the largest ground-based facilities. Here we present the first demonstration of KPI on JWST/MIRI data at 7.7 microns, 10 microns, and 15 microns. We generate contrast curves for 16 white dwarfs from the MIRI Exoplanets Orbiting White dwarfs (MEOW) Survey, finding significantly deeper contrast at small angular separations compared to traditional imaging with JWST/MIRI, down to within $\\lambda$/D. Additionally, we use our KPI setup to successfully recover four known companions orbiting white dwarfs and brown dwarfs. This analysis shows that at these wavelengths KPI can uniquely access the orbital parameter space where inward-migrating post-main-sequence giant exoplanets are now thought to exist. We discuss the prospects for applying KPI to a larger sample of white dwarfs observed with JWST, increasing the volume of directly imaged close-in post-main-sequence exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2510.13064.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13502",
      "title": "A New Method for Aperture Masking Interferometric Imaging: Demonstration with the JWST",
      "authors": [
        "Christopher Carilli",
        "Bojan Nikolic",
        "Laura Torino",
        "N. Thyagarajan",
        "Ubaldo Iriso"
      ],
      "abstract": "A New Method for Aperture Masking Interferometric Imaging: Demonstration with the JWST Christopher Carilli (NRAO), Bojan Nikolic (Cavendish), Laura Torino (ALBA-CELLS), N. Thyagarajan (CSIRO), Ubaldo Iriso (ALBA-CELLS) 18 pages, 7 figures, 2 tables, submitted to Optical Engineering (SPIE) Instrumentation and Methods for Astrophysics (astro-ph.IM); Accelerator Physics (physics.acc-ph); Optics (physics.optics) We present a new method for aperture masking interferometric (AMI) imaging at near-IR wavelengths using radio astronomical techniques. The method starts with derivation of interferometric visibilities from a Fourier transform of the interferograms. An iterative joint optimization process is then employed, using self-calibration of the interferometric element-based complex voltage gains (i.e. electric fields), and CLEAN deconvolution to obtain the source structure. We demonstrate the efficacy of the method using the NIRISS aperture masking interferometer on the James Webb Space Telescope (JWST) at 4.8~$\\mu$m and 3.8~$\\mu$m. Due to a number of effects (the large pixel size, charge migration, near-field optics), the method also requires an initial visibility-based amplitude normalization using observations of a well know point-source calibration star. We employ early science observations of the dusty binary Wolf-Rayet star WR137. Images with a dynamic range (peak/rms) of $\\sim 240$ on the target, and $\\sim 1000$ on the calibrator, are synthesized from a short integration. The self-calibration process determines the photon path-lengths through the optical system to each aperture using data on the target source itself, thereby representing an essentially 'real-time', precise wavefront error sensor. Four independent measures of the JWST mirror segment pistons (two wavelengths for two sources), agree to within 10~nm to 15~nm, comparable to the expected errors based on an analysis of closure phases on the calibrator star. Including a baseline-based phase correction improves the dynamic range of the final images by about 23\\%.",
      "pdf_url": "https://arxiv.org/pdf/2510.13502.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13506",
      "title": "Design of an Imaging Air Cherenkov Telescope array layout with differential programming",
      "authors": [
        "Cyril Alispach",
        "Matthieu Heller",
        "Teresa Montaruli"
      ],
      "abstract": "Design of an Imaging Air Cherenkov Telescope array layout with differential programming Cyril Alispach, Matthieu Heller, Teresa Montaruli 9 pages, 15 figures, presented at Fifth MODE Workshop on Differentiable Programming for Experiment Design (MODE2025) on the 8-13 June 2025 in Kolymbari, Crete, Greece Instrumentation and Methods for Astrophysics (astro-ph.IM); Computational Physics (physics.comp-ph) Current optimization of ground-based Cherenkov telescopes arrays, also called Imaging Air Cherenkov Telescope (IACT) arrays, relies on brute-force human-driven approaches based on large simulations requiring both high amount of storage and long computation time. To explore the full phase space of telescope positioning of a given array even more simulations would be required. To optimize any array layout, we explore the possibility of developing a differential program with surrogate models of IACT arrays based on high-level instrument response functions (IRFs). The simulation time of a single telescope to a cosmic-ray event can be significantly reduced with its instrument response function or with generative models. However, it is not straight forward to model the array of telescopes from a set of single telescope surrogate models as the array is a stereoscopic imaging system. The complexity increases as well if the telescopes in the array are of different types. Additionally, the optimum of the array layout depends on the scientific use case. Current array layout optimization are obtained by minimizing the sensitivity of the array, a metric that depends on several high-level parameters such as the trigger efficiency, the energy and angular resolution, as well as the background rejection capability. The variety of telescopes types in IACT arrays, such as in the Cherenkov Telescope Array Observatory (CTAO), not only extends the sensitive energy range but also allows for cross-calibration of the instruments. Therefore, the optimal array layout is not only which minimizes sensitivity but also which reduces the systematic uncertainties. We focus on the optimization of a telescope array based on the SST-1M IACTs in Hanle, Ladakh India aiming at building a generic optimization pipeline for future ground-based cosmic-ray observatories",
      "pdf_url": "https://arxiv.org/pdf/2510.13506.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12871",
      "title": "Eccentric Disks With Self-Gravity",
      "authors": [
        "Yoram Lithwick",
        "Eugene Chiang",
        "Leon Mikulinsky",
        "Zhenbang Yu"
      ],
      "abstract": "Eccentric Disks With Self-Gravity Yoram Lithwick, Eugene Chiang, Leon Mikulinsky, Zhenbang Yu Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Can a disk orbiting a central body be eccentric, when the disk feels its own self-gravity and is pressureless? Contradictory answers appear in the literature. We show that such a disk can be eccentric, but only if it has a sharply truncated edge: the surface density $\\Sigma$ must vanish at the edge, and the $\\Sigma$ profile must be sufficiently steep at the point where it vanishes. If either requirement is violated, an eccentric disturbance leaks out of the bulk of the disk into the low density edge region, and cannot return. An edge where $\\Sigma$ asymptotes to zero but never vanishes, as is often assumed for astrophysical disks, is insufficiently sharp. Similar results were shown by Hunter & Toomre (1969) for galactic warps. We demonstrate these results in three ways: by solving the eigenvalue equation for the eccentricity profile; by solving the initial value problem; and by analyzing a new and simple dispersion relation that is valid for any wavenumber, unlike WKB. As a byproduct, we show that softening the self-gravitational potential is not needed to model a flat disk, and we develop a softening-free algorithm to model the disk's Laplace-Lagrange-like equations. The algorithm is easy to implement and is more accurate than softening-based methods at a given resolution by many orders of magnitude.",
      "pdf_url": "https://arxiv.org/pdf/2510.12871.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12903",
      "title": "Towards High-Resolution Orbitrap Mass Spectrometry for Next- Generation In-Situ Space Dust Analysis",
      "authors": [
        "M. Malečková",
        "I. Zymak",
        "A. Spesyvyi",
        "M. Polášek",
        "B. Cherville",
        "M. Lacko",
        "M. Ferus",
        "A. Charvat",
        "J. Žabka",
        "B. Abel"
      ],
      "abstract": "Towards High-Resolution Orbitrap Mass Spectrometry for Next- Generation In-Situ Space Dust Analysis M. Malečková, I. Zymak, A. Spesyvyi, M. Polášek, B. Cherville, M. Lacko, M. Ferus, A. Charvat, J. Žabka, B. Abel 31 pages, 7 figures, 58 references Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Cosmic and planetary dust hold vital clues to the chemical evolution of the solar system, yet in situ analysis of their molecular and elemental composition remains technically challenging. Here we present laboratory results from HANKA (High-resolution mass Analyzer for Nano-scale Kinetic Astro materials), a compact Orbitrap-based mass spectrometer developed towards the goal of a universal dust detector for space applications. Using infrared laser ablation and plasma formation under vacuum, we analyzed solid-state samples representative of Lunar, Martian, and Meteoritic material. The resulting mass spectra - recorded at resolving powers of R=60000 - reveal complex, but characteristic element mixtures. These results demonstrate the single event sensitivity of HANKA, and its mass resolution with the ability to resolve complex mass spectra and possibly differentiate geochemical signatures across planetary bodies. The dynamic range of 3-4 orders of magnitude enables even the detection of trace compounds. The minimalistic impact sampling approach enables fast, high-precision compositional mass analysis without complex sample preparation, making the instrument well-suited for orbital, surface, or flyby missions with expected dust impacts. Our system consists of an IR-laser system that simulates impacts of nano to micron sized solid-state dust and ice particles from space. It therefore allows to perform so called analogue experiments in the laboratory. We conclude that IR- laser pulses on a solid-state material are not only well suited for ice particle impact analogues but also a good analogue experiment for solid state particle impacts on a dust detector electrode in space. Moreover, the IR laser is employed only for an optimal analogue experiment simulating the impact event - it is not necessary in space on a spacecraft detecting space dust.",
      "pdf_url": "https://arxiv.org/pdf/2510.12903.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/1801.05383",
      "title": "The Third Workshop on Extremely Precise Radial Velocities: The New Instruments",
      "authors": [
        "Jason T. Wright",
        "Paul Robertson"
      ],
      "abstract": "The Third Workshop on Extremely Precise Radial Velocities: The New Instruments Jason T. Wright, Paul Robertson Table available as PDF at this https URL Research Notes of the AAS 1, 51 (2017) Instrumentation and Methods for Astrophysics (astro-ph.IM) The Third Workshop on Extremely Precise Radial Velocities was held at the Penn Stater Conference Center and Hotel in State College, Pennsylvania, USA from 2016 August 14 to 17, and featured over 120 registrants from around the world. Here we provide a brief description of the conference, its format, and its session topics and chairs. 23 instrument teams were represented in plenary talks, and we present a table containing the basic characteristics of their new precise Doppler velocimeters.",
      "pdf_url": "https://arxiv.org/pdf/1801.05383.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.05881",
      "title": "The Online Data Filter for the KM3NeT Neutrino Telescopes",
      "authors": [
        "O. Adriani",
        "S. Aiello",
        "A. Albert",
        "A.R. Alhebsi",
        "M. Alshamsi",
        "S. Alves Garre",
        "A. Ambrosone",
        "F. Ameli",
        "M. Andre",
        "L. Aphecetche",
        "M. Ardid",
        "S. Ardid",
        "J. Aublin",
        "F. Badaracco",
        "L. Bailly-Salins",
        "Z. Bardacova",
        "B. Baret",
        "A. Bariego-Quintana",
        "Y. Becherini",
        "M. Bendahman",
        "F. Benfenati Gualandi",
        "M. Benhassi",
        "M. Bennani",
        "D.M. Benoit",
        "E. Berbee",
        "E. Berti",
        "V. Bertin",
        "P. Betti",
        "S. Biagi",
        "M. Boettcher",
        "D. Bonanno",
        "S. Bottai",
        "A.B. Bouasla",
        "J. Boumaaza",
        "M. Bouta",
        "M. Bouwhuis",
        "C. Bozza",
        "R.M. Bozza",
        "H.Branzas",
        "F. Bretaudeau",
        "M. Breuhaus",
        "R. Bruijn",
        "J. Brunner",
        "R. Bruno",
        "E. Buis",
        "R. Buompane",
        "J. Busto",
        "B. Caiffi",
        "D. Calvo",
        "A. Capone",
        "F. Carenini",
        "V. Carretero",
        "T. Cartraud",
        "P. Castaldi",
        "V. Cecchini",
        "S. Celli",
        "L. Cerisy",
        "M. Chabab",
        "A. Chen",
        "S. Cherubini",
        "T. Chiarusi",
        "M. Circella",
        "R. Clark",
        "R. Cocimano",
        "J.A.B. Coelho",
        "A. Coleiro",
        "A. Condorelli",
        "R. Coniglione",
        "P. Coyle",
        "A. Creusot",
        "G. Cuttone",
        "R. Dallier",
        "A. De Benedittis",
        "G. De Wasseige",
        "V. Decoene",
        "P. Deguire",
        "I. Del Rosso",
        "L.S. Di Mauro",
        "I. Di Palma",
        "A.F. Diaz",
        "D. Diego-Tortosa",
        "C. Distefano",
        "A. Domi",
        "C. Donzaud",
        "D. Dornic",
        "E. Drakopoulou",
        "D. Drouhin",
        "J.-G. Ducoin",
        "P. Duverne",
        "R. Dvornicky",
        "T. Eberl",
        "E. Eckerova",
        "A. Eddymaoui",
        "T. van Eeden",
        "M. Eff",
        "D. van Eijk",
        "I. El Bojaddaini",
        "S. El Hedri",
        "S. El Mentawi",
        "A. Enzenhofer"
      ],
      "abstract": "The Online Data Filter for the KM3NeT Neutrino Telescopes O. Adriani, S. Aiello, A. Albert, A.R. Alhebsi, M. Alshamsi, S. Alves Garre, A. Ambrosone, F. Ameli, M. Andre, L. Aphecetche, M. Ardid, S. Ardid, J. Aublin, F. Badaracco, L. Bailly-Salins, Z. Bardacova, B. Baret, A. Bariego-Quintana, Y. Becherini, M. Bendahman, F. Benfenati Gualandi, M. Benhassi, M. Bennani, D.M. Benoit, E. Berbee, E. Berti, V. Bertin, P. Betti, S. Biagi, M. Boettcher, D. Bonanno, S. Bottai, A.B. Bouasla, J. Boumaaza, M. Bouta, M. Bouwhuis, C. Bozza, R.M. Bozza, H.Branzas, F. Bretaudeau, M. Breuhaus, R. Bruijn, J. Brunner, R. Bruno, E. Buis, R. Buompane, J. Busto, B. Caiffi, D. Calvo, A. Capone, F. Carenini, V. Carretero, T. Cartraud, P. Castaldi, V. Cecchini, S. Celli, L. Cerisy, M. Chabab, A. Chen, S. Cherubini, T. Chiarusi, M. Circella, R. Clark, R. Cocimano, J.A.B. Coelho, A. Coleiro, A. Condorelli, R. Coniglione, P. Coyle, A. Creusot, G. Cuttone, R. Dallier, A. De Benedittis, G. De Wasseige, V. Decoene, P. Deguire, I. Del Rosso, L.S. Di Mauro, I. Di Palma, A.F. Diaz, D. Diego-Tortosa, C. Distefano, A. Domi, C. Donzaud, D. Dornic, E. Drakopoulou, D. Drouhin, J.-G. Ducoin, P. Duverne, R. Dvornicky, T. Eberl, E. Eckerova, A. Eddymaoui, T. van Eeden, M. Eff, D. van Eijk, I. El Bojaddaini, S. El Hedri, S. El Mentawi, A. Enzenhofer Instrumentation and Methods for Astrophysics (astro-ph.IM) The KM3NeT research infrastructure comprises two neutrino telescopes located in the deep waters of the Mediterranean Sea, namely ORCA and ARCA. KM3NeT/ORCA is designed for the measurement of neutrino properties and KM3NeT/ARCA for the detection of high-energy neutrinos from the cosmos. Neutrinos are indirectly detected using three-dimensional arrays of photo-sensors which detect the Cherenkov light that is produced when relativistic charged particles emerge from a neutrino interaction. The analogue pulses from the photo-sensors are digitised offshore and all digital data are sent to a station on shore where they are processed in real time using a farm of commodity servers and custom software. In this paper, the design and performance of the software that is used to filter the data are presented. The performance of the data filter is evaluated in terms of its efficiency, purity and capacity. The efficiency is measured by the effective volumes of the sensor arrays as a function of the energy of the neutrino. The purity is measured by a comparison of the event rate caused by muons produced by cosmic ray interactions in the Earth's atmosphere with the event rate caused by the background from decays of radioactive elements in the sea water and bioluminescence. The capacity is measured by the minimal number of servers that is needed to sustain the rate of incoming data. The results of these evaluations comply with all specifications. The count rates of all photo-sensors are measured with a sampling frequency of 10 Hz. These data are input to the simulations of the detector response and will also be made available for interdisciplinary research.",
      "pdf_url": "https://arxiv.org/pdf/2506.05881.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.00264",
      "title": "The evolution of PUCHEROS from a basic to a competitive tool for stellar astrophysics",
      "authors": [
        "Luca Antonucci",
        "Leonardo Vanzi",
        "Abner Zapata",
        "Mauricio Flores",
        "Angelica Suarez",
        "Rafael Brahm",
        "Tzu Shen",
        "Manuel Parra",
        "Rafael Ormazabal",
        "Gerardo Avila",
        "Petr Kabath",
        "Artie Hatzes",
        "Pavol Gajdos",
        "Marek Skarka",
        "Jiri Zak",
        "Petra Odert",
        "Jozef Liptak",
        "Robert Greimel",
        "Martin Leitzinger"
      ],
      "abstract": "The evolution of PUCHEROS from a basic to a competitive tool for stellar astrophysics Luca Antonucci, Leonardo Vanzi, Abner Zapata, Mauricio Flores, Angelica Suarez, Rafael Brahm, Tzu Shen, Manuel Parra, Rafael Ormazabal, Gerardo Avila, Petr Kabath, Artie Hatzes, Pavol Gajdos, Marek Skarka, Jiri Zak, Petra Odert, Jozef Liptak, Robert Greimel, Martin Leitzinger 13 pages, 20 figures. This version corresponds to the accepted manuscript. The final published version is available in MNRAS: DOI this https URL. Published version PDF is attached Monthly Notices of the Royal Astronomical Society 542 (2025) 1730-1742 Instrumentation and Methods for Astrophysics (astro-ph.IM) We present PUCHEROS +, a new spectrograph developed as an enhanced version of PUCHEROS (Pontificia Universidad Catolica High Echelle Resolution Optical Spectrograph), which was the first high-resolution spectrograph built at the Pontificia Universidad Catolica de Chile (UC). With respect to its predecessor, PUCHEROS + includes a substantial number of improvements, mainly: a new scientific detector, improved objective optics, calibration system, guiding, active thermal control, and remote observing mode. These upgrades convert our early prototype into a much more powerful instrument for science. With a spectral resolution of R = 18000, a spectral range between 400 and 730 nm and an instrument efficiency of about 30 per cent, PUCHEROS + was tested at the ESO (European Southern Observatory) 1.52-m telescope where it has reached a limiting magnitude of about 12 in V band and radial velocity precision of about 30 m/s. The instrument was conceived as a pathfinder for the high-resolution echelle spectrograph PLATOSpec and at the same time, it demonstrates that a compact, relatively low-cost spectrograph can be efficiently employed for long-term monitoring campaigns and as support facility for space missions, in particular if operated remotely at relatively small- or medium-sized telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2509.00264.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.04659",
      "title": "Introducing The SHell misAlignment Detection for straylight Estimation (SHADE) algorithm: the case of XMM-Newton",
      "authors": [
        "S.Piscitelli",
        "G. Ponti",
        "M. Civitani",
        "D. Spiga"
      ],
      "abstract": "Introducing The SHell misAlignment Detection for straylight Estimation (SHADE) algorithm: the case of XMM-Newton S.Piscitelli, G. Ponti, M. Civitani, D. Spiga Instrumentation and Methods for Astrophysics (astro-ph.IM) When performing X-ray observations with a Wolter-I telescope, the presence of bright off-axis sources can introduce unfocused rays, known as straylight, which contaminate the detector and compromise the scientific analysis. Among the different components of straylight, single reflections off the hyperboloid section of the mirror shells often produce arc-like patterns on the detector. These arcs depend not only on the off-axis angle of the source but also on the geometrical alignment of the individual shells. In this paper, we introduce the SHell misAlignment Detection for straylight Estimation (SHADE) algorithm, a novel and flexible tool designed to infer the misalignment parameters of individual shells, reproduce the geometry of straylight arcs and predict its pattern on the detector. SHADE allows us to model each shell displacement with two parameters: $(\\gamma,\\xi)$ that represents the tilt amplitude and direction. While the algorithm is general and applicable to any Wolter-like telescope, we demonstrate its effectiveness using a set of XMM-Newton observations of the low-mass X-ray binary GX5-1. As a proof of concept, we recover the best-fit misalignment parameters for a selected shell, obtaining $\\gamma = 21.9''^{+10.3}_{-9.02}$ and $\\xi = 5.88^{+1.02}_{-0.97}$ rad. SHADE represents a new approach to diagnosing mirror misalignments from straylight patterns and can support both pre and post-launch calibration efforts and future telescope designs.",
      "pdf_url": "https://arxiv.org/pdf/2510.04659.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.03436",
      "title": "Spectral Mixture Modeling with Laboratory Near-Infrared Data I: Insights into Compositional Analysis of Europa",
      "authors": [
        "A. Emran"
      ],
      "abstract": "Spectral Mixture Modeling with Laboratory Near-Infrared Data I: Insights into Compositional Analysis of Europa A. Emran 19 pages, 4 figures, Published in Icarus Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Europa's surface composition and physical characteristics are commonly constrained using spectral deconvolution through linear mixture (LM) modeling and radiative transfer-based (RT) intimate mixture modeling. Here, I compared the results of these two spectral modeling- LM versus RT- against laboratory spectra of water (H$_{2}$O) ice and sulfuric acid octahydrate (SAO; H$_{2}$SO$_{4}$$\\cdot$8H$_{2}$O) mixtures measured at near-infrared wavelengths ($\\sim$1.2-2.5 $\\mu$m) with grain sizes of 90-106 $\\mu$m (Hayes and Li, 2025). The modeled abundances indicate that the RT more closely reproduces the laboratory abundances, with deviations within $\\pm$5% for both H$_{2}$O ice and H$_{2}$SO$_{4}$$\\cdot$8H$_{2}$O with $\\sim$100 $\\mu$m grains. In contrast, the LM shows slightly larger discrepancies, typically ranging from $\\pm$5-15% from the true abundances. Interestingly, both LM and RT tend to consistently overestimate the abundance of H$_{2}$SO$_{4}$$\\cdot$8H$_{2}$O and underestimate H$_{2}$O ice across all mixtures. Nonetheless, when H$_{2}$SO$_{4}$$\\cdot$8H$_{2}$O either dominates (>80% as observed on Europa's trailing hemisphere; Carlson et al. 2005) or is present only in trace amounts ($\\sim$10% on areas in Europa's leading hemisphere; Dalton III et al. 2013; Ligier et al. 2016), both the LM and RT render acceptable results within $\\pm$10% uncertainty. Thus, spectral modeling using the RT is preferred for constraining the surface composition across Europa, although the LM remains viable in specific compositional regimes.",
      "pdf_url": "https://arxiv.org/pdf/2510.03436.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13479",
      "title": "Chaotic Dynamics and Zero-Velocity Structures in the Pluto-Charon CR3BP",
      "authors": [
        "Abdul Wahab Jbara"
      ],
      "abstract": "Chaotic Dynamics and Zero-Velocity Structures in the Pluto-Charon CR3BP Abdul Wahab Jbara (Independent Researcher) Earth and Planetary Astrophysics (astro-ph.EP) Pluto and Charon are a dwarf binary system with a high mass ratio $\\mu$, preventing Trojan companions. This instability creates ideal intersections for low-energy pathways that spacecraft can traverse and serves as an important test case for stability at Lagrange points for high $\\mu$ binaries. This study models the Pluto-Charon system in the planar Circular Restricted Three-Body Problem (CR3BP) and compares the tadpole and horseshoe orbits of a massless particle with known low-$\\mu$ orbits. Moreover, it compares the trajectories for instances where the L1 neck is opened and closed, and exhibits the corresponding zero-velocity curves; RK4 integration was used to update the position and velocity of the particle. The simulations consistently showed chaotic and unpredictable trajectories, where small changes in initial parameters could completely alter the results; trajectories displayed the influence of higher values of $\\mu$ on the stability of binary systems. These findings confirm that Pluto-Charon cannot host long-lived Trojan companions and instead behaves as a system of chaotic transport. Future work could extend the study to include the spatial or elliptic three-body problem, further refining the understanding of instability in high-$\\mu$ binaries.",
      "pdf_url": "https://arxiv.org/pdf/2510.13479.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13527",
      "title": "Investigating the Formation of Planets Interior to in situ Hot Jupiters",
      "authors": [
        "Devansh Mathur",
        "Juliette Becker"
      ],
      "abstract": "Investigating the Formation of Planets Interior to in situ Hot Jupiters Devansh Mathur, Juliette Becker Earth and Planetary Astrophysics (astro-ph.EP) The population of hot Jupiters with adjacent planetary companions is small but growing, and inner companions appear to be a nearly ubiquitous outcome within this subset of the exoplanet census. While most hot Jupiters are believed to form via tidal migration, the presence of adjacent companions is not easily explained by this formation mechanism, requiring consideration of additional formation mechanisms such as disk migration and in situ formation. In this work, we explore the possibility of in situ formation for both hot Jupiters and their interior companions. Using numerical simulations performed with the N-body integrator REBOUND, we investigate the growth of interior companions under various assumptions about disk conditions and hot Jupiter final orbital positions. Our results show that if a sufficiently high density of planetary embryos is transported to short orbital radii, it is feasible for both hot Jupiters and their interior companions to form in situ, providing a viable explanation for a subset of observed planetary architectures.",
      "pdf_url": "https://arxiv.org/pdf/2510.13527.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.19872",
      "title": "The Cosmic Shoreline Revisited: A Metric for Atmospheric Retention Informed by Hydrodynamic Escape",
      "authors": [
        "Xuan Ji",
        "Richard D. Chatterjee",
        "Brandon Park Coy",
        "Edwin S. Kite"
      ],
      "abstract": "The Cosmic Shoreline Revisited: A Metric for Atmospheric Retention Informed by Hydrodynamic Escape Xuan Ji, Richard D. Chatterjee, Brandon Park Coy, Edwin S. Kite Earth and Planetary Astrophysics (astro-ph.EP) The \"cosmic shoreline,\" a semi-empirical relation that separates airless worlds from worlds with atmospheres as proposed by K. J. Zahnle & D. C. Catling, is now guiding large-scale JWST surveys aimed at detecting rocky exoplanet atmospheres. We expand upon this framework by revisiting the shoreline using existing hydrodynamic escape models applied to Earth-like, Venus-like, and steam atmospheres for rocky exoplanets, and we estimate energy-limited escape rates for CH4 atmospheres. We determine the critical instellation required for atmospheric retention by calculating time-integrated atmospheric mass loss. Our analysis introduces a new metric for target selection in the Rocky Worlds Director's Discretionary Time and refines expectations for rocky planet atmosphere searches. Exploring initial volatile inventory ranging from 0.01% to 1% of planetary mass, we find that its variation prevents the definition of a unique clear-cut shoreline, though nonlinear escape physics can reduce this sensitivity to initial conditions. Additionally, uncertain distributions of high-energy stellar evolution and planet age further blur the critical instellations for atmospheric retention, yielding broad shorelines. Hydrodynamic escape models find atmospheric retention is markedly more favorable for higher-mass planets orbiting higher-mass stars, with carbon-rich atmospheres remaining plausible for 55 Cancri e despite its extreme instellation. We caution that our estimates are sensitive to processes with poorly understood dynamics, such as atomic line cooling. Finally, we illustrate how density measurements can be used to statistically test the existence of the cosmic shorelines, emphasizing the need for more precise mass and radius measurements.",
      "pdf_url": "https://arxiv.org/pdf/2504.19872.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12495",
      "title": "Limits of Standard Tidal Models at Quaoar: Matching Weywot's Orbit, Missing the Spin",
      "authors": [
        "Zsolt Regaly",
        "Viktoria Frohlich",
        "Csaba Kiss"
      ],
      "abstract": "Limits of Standard Tidal Models at Quaoar: Matching Weywot's Orbit, Missing the Spin Zsolt Regaly, Viktoria Frohlich, Csaba Kiss Accepted for publication in PASP Earth and Planetary Astrophysics (astro-ph.EP) Weywot, Quaoar's small satellite, follows a nearly circular orbit at a distance of 12.9 times Quaoar's diameter and coexists with a compact ring system. Nevertheless, Quaoar's flattening of 0.16, slow 17.7hr rotation and Weywot's low mass are difficult to reconcile with conventional tidal-evolution theory. We assess whether standard tides can reproduce the present-day architecture of the Quaoar-Weywot system and identify the initial conditions required. Orbit-averaged integrations spanning 4.5Gyr were carried out with two formalisms: (i) a constant phase-lag (CPL) and (ii) an Andrade creep-tide (ACT) framework. With the nominal Weywot mass, both tidal prescriptions converge on Weywot's observed orbital distance for a wide range of initial orbital distances and eccentricities; eccentricity is damped and present-day tidal torques are negligible, rendering the orbit quasi-stationary. Quaoar's spin, however, remains essentially unchanged from its inferred primordial period based on its present-day flattening, and does not reproduce the observed value. A match is possible only if Weywot is 5-10x more massive than current estimates and if its initial eccentricity is finely tuned; such scenarios are inconsistent with occultation-derived masses and imply an implausibly dense satellite. Based on the best fitting viscoelastic parameters, the most plausible composition for Quaoar is found to be a partially differentiated dwarf planet containing roughly equal masses of silicate rock and H2O-dominated warm (150-180K) ices. Standard tidal models reproduce Weywot's semimajor axis but cannot account for Quaoar's slow 17.7hr rotation without invoking an unrealistically massive satellite or external torques, suggesting that non-tidal processes - such as a largely primordial spin, early satellite loss, or a retrograde secondary giant impact - must have influenced Quaoar's rotational evolution.",
      "pdf_url": "https://arxiv.org/pdf/2510.12495.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}