{
  "date": "2025-12-30",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.IM",
    "astro-ph.SR",
    "astro-ph.GA",
    "astro-ph.HE",
    "astro-ph.CO"
  ],
  "total_papers": 63,
  "gw_related_papers": 8,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.21359",
      "title": "ESO Expanding Horizons White Paper: Electromagnetic counterparts of massive BH mergers with LISA",
      "authors": [
        "M. Dotti",
        "F. Mannucci",
        "R. Buscicchio",
        "M. Colpi",
        "Q. D'Amato",
        "A. Franchini",
        "A. De Rosa",
        "Z. Haiman",
        ". Izquierdo-Villalba",
        "A. Mangiagli",
        "M. Scialpi P. Severgnini",
        "C. Vignali",
        "M. Volonteri"
      ],
      "abstract": "ESO Expanding Horizons White Paper: Electromagnetic counterparts of massive BH mergers with LISA M. Dotti, F. Mannucci, R. Buscicchio, M. Colpi, Q. D'Amato, A. Franchini, A. De Rosa, Z. Haiman, . Izquierdo-Villalba, A. Mangiagli, M. Scialpi P. Severgnini, C. Vignali, M. Volonteri ESO \"Expanding Horizons\" white paper Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The Laser Interferometer Space Antenna (LISA), adopted by ESA and scheduled for the second half of the next decade, will drive a new revolution in the rapidly growing field of gravitational-wave astronomy, by extending GW observations into the hiterto unexplored millihertz regime. One of the key source classes of LISA is merging massive black hole binaries in the 1e4-1e7 Msun mass range detectable to very high redshifts $z\\sim 15$. MBHBs lighter than 1e6 Msun can potentially be identified during their inspiral weeks before coalescence, allowing for complementary electromagnetic observations before, during, and after the two MBHs merge. This white paper aims at defining the optimal strategy to maximize the number of detected EM counterparts of LISA MBHB events.",
      "pdf_url": "https://arxiv.org/pdf/2512.21359.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.21370",
      "title": "Detection of Lensed Gravitational Waves in the Millihertz Band Using Frequency-Domain Lensing Feature Extraction Network",
      "authors": [
        "Tianlong Wang",
        "Tianyu Zhao",
        "Minghui Du",
        "Ziren Luo",
        "Peng Dong",
        "Peng Xu"
      ],
      "abstract": "Detection of Lensed Gravitational Waves in the Millihertz Band Using Frequency-Domain Lensing Feature Extraction Network Tianlong Wang, Tianyu Zhao, Minghui Du, Ziren Luo, Peng Dong, Peng Xu Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) The space-based gravitational wave (GW) detectors are expected to observe lensed GW events, offering new opportunities for cosmology and fundamental physics. In the millihertz frequency band, the GW wavelength is often comparable to the Schwarzschild radius of the lens, where wave-optics effects are significant. Although traditional matched filtering is effective, the intense computational resources required motivate the search for more efficient alternatives to accelerate candidate event screening. To address this bottleneck, we introduce a Dual-Channel Lensing feature extraction eXtended Long Short-Term Memory Network (DCL-xLSTM). Unlike conventional recurrent architectures, DCL-xLSTM employs a matrix-valued memory structure and a memory-mixing mechanism to effectively capture amplitude diffraction patterns that span the entire millihertz frequency band. Trained on data generated by Point Mass (PM) and Singular Isothermal Sphere (SIS) models accounting for the transition from wave-optics to geometric-optics, the proposed method achieves an area under the curve (AUC) exceeding 0.99, maintaining a true positive rate (TPR) above 98% at a false positive rate (FPR) below 1%. The network is robust against variations in signal-to-noise ratio, lens type, and lens mass, establishing its viability as a high-efficiency tool for future space-based GW detection.",
      "pdf_url": "https://arxiv.org/pdf/2512.21370.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.21392",
      "title": "Sensitivity of Weak Lensing Surveys to Gravitational Waves from Inspiraling Supermassive Black Hole Binaries",
      "authors": [
        "Tal Adi",
        "Kris Pardo",
        "Olivier Doré"
      ],
      "abstract": "Sensitivity of Weak Lensing Surveys to Gravitational Waves from Inspiraling Supermassive Black Hole Binaries Tal Adi, Kris Pardo, Olivier Doré Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) We explore the sensitivity of upcoming and idealized weak lensing surveys to gravitational waves (GWs) emitted by inspiraling supermassive black hole binaries (SMBHBs) in the nanohertz to microhertz frequency band. This range, situated between the reach of pulsar timing arrays and space-based interferometers, remains observationally underexplored. Building upon the formalism for GW-induced shear distortions, we develop a signal-to-noise framework that incorporates realistic survey characteristics, including cadence, angular resolution, and depth. We model the effective galaxy population using a redshift- and luminosity-dependent distribution to evaluate the noise power spectral density across the survey. Applying this framework to both LSST-like and idealized survey configurations, we derive characteristic strain sensitivity curves and identify the detectable parameter space for SMBHBs. We find that while current surveys are limited by angular resolution, an ideal full-sky survey with milliarcsecond-level precision and rapid cadence could detect continuous GW signals from SMBHBs at cosmological distances and partially bridge the PTA-LISA sensitivity gap. Our analysis highlights the potential and limitations of weak-lensing surveys for low-frequency GW astronomy, with angular resolution emerging as the dominant constraint.",
      "pdf_url": "https://arxiv.org/pdf/2512.21392.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.21406",
      "title": "On the Cooling of Compact Stars in Light of the HESS J1731-347 Remnant",
      "authors": [
        "D. Nanopoulos",
        "P. Laskos-Patkos",
        "Ch. C. Moustakidis"
      ],
      "abstract": "On the Cooling of Compact Stars in Light of the HESS J1731-347 Remnant D. Nanopoulos, P. Laskos-Patkos, Ch. C. Moustakidis v1: 27 pages, 6 figures, 5 tables High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th) Recent analyses on the central compact object in the HESS J1731-347 supernova remnant reported not only surprising structural properties (mass $M$ and radius $R$), but also an interesting thermal evolution. More precisely, it has been estimated that $M=0.77^{+0.20}_{-0.17}M_\\odot$ and $R=10.4^{+0.86}_{-0.78}$ km (at the $1\\sigma$ level), while a redshited surface temperature of $153^{+4}_ {-2}$ keV at an age of 2-6 kyrs has been reported. In the present work, we conduct an in-depth investigation on the possible nature (hadronic, hybrid, quark) of this compact object by attempting to not only explain its mass and radius but also the corresponding estimations for its temperature and age. In the case of hybrid stars we also examine possible effects of the symmetry energy on the activation of different neutrino emitting process, and hence on the resulting cooling curves. We found that the reported temperature and age may be compatible to hadronic stellar configurations regardless of whether pairing effects are included. In the scenario of hybrid stars, we found that the strange quark matter core has to be in a superconducting state in order to reach an agreement with the observational constraints. In addition, the hadronic phase must be soft enough so that the direct Urca process is not activated. Furthermore, we have shown that the considered cooling constraints can be reconciled within the framework of strange stars. However, quark matter has to be in a superconducting state and the quark direct Urca process needs to be blocked.",
      "pdf_url": "https://arxiv.org/pdf/2512.21406.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21520",
      "title": "Multiband Gravitational Wave Detection Prospects for M31 UCXB-1 System in Low and Middle Frequency Band",
      "authors": [
        "Xiao Guo",
        "Zhoujian Cao",
        "Zhiwei Chen"
      ],
      "abstract": "Multiband Gravitational Wave Detection Prospects for M31 UCXB-1 System in Low and Middle Frequency Band Xiao Guo, Zhoujian Cao, Zhiwei Chen 10 pages, 11 figures, comments are welcome! High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The recent discovery of M31 UCXB-1, the first extragalactic ultracompact X-ray binary (UCXB) with an orbital period of $T_{\\rm orb} \\sim 465$ s, presents a unique laboratory for studying close binary evolution and an unprecedented target for continuous gravitational wave (GW) searches. Its identification as a strong candidate black hole-white dwarf (BH-WD) system, combined with its exceptionally short period and high X-ray luminosity, suggests it may be one of the most vital low-frequency GW sources in M31. In this \\textit{Letter}, we investigate the detectability of its GW signal for future space-borne detectors in multiband GW detection. We find that while its signal-to-noise ratio (S/N) for low-frequency detectors remains marginal for high-confidence detection, middle-frequency detectors such as DECIGO and BBO are far more promising, potentially achieving S/N $\\varrho>8$ within reasonable observational duration. With a primary mass of only $m_1 > 5.4M_\\odot$ (or $6.6M_\\odot$), the network of all low and middle frequency detector (or BBO alone) is capable of detecting GW from this system with a $\\varrho > 8$, during 10-year observation. Furthermore, orbital eccentricity can enhance the GW strain at higher harmonics, further improving its detectability, especially for middle-frequency detectors. This study establishes M31 UCXB-1 as a key prototype of short-period UCXBs, cementing its role as a cornerstone for multiband, multi-messenger astrophysics and a vital bridge between X-ray astronomy and the future GW era.",
      "pdf_url": "https://arxiv.org/pdf/2512.21520.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.21658",
      "title": "Particle production and Higgs reheating",
      "authors": [
        "Aarav Shah",
        "Kanabar Jay",
        "Maxim Khlopov",
        "Oem Trivedi",
        "Maxim Krasnov"
      ],
      "abstract": "Particle production and Higgs reheating Aarav Shah, Kanabar Jay, Maxim Khlopov, Oem Trivedi, Maxim Krasnov Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Reheating is essential for transforming the cold, vacuum dominated Universe at the end of inflation into the hot thermal bath required by the Standard Model. In many well motivated inflationary models, however, the inflaton has no direct couplings to other fields, raising the question of how the Universe becomes repopulated with particles. We address this question within the framework of geometric reheating, where energy transfer occurs purely through gravitational effects. Focusing on a Higgs inflationary scenario with a non-minimal curvature coupling $\\xi \\phi^2 R$, we derive the post-inflationary dynamics and compute particle production using the Bogoliubov formalism. We show that the rapid, oscillatory evolution of the curvature scalar after inflaton acts as a time dependent gravitational pump, creating scalar spectator particles even in the absence of explicit interactions. This curvature driven production mechanism provides a natural and efficient route to reheating, demonstrating that gravity alone can initiate the standard thermal history and bridge inflation with radiation domination in minimal, coupling free models of the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2512.21658.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21667",
      "title": "Numerical simulation of lunar response to gravitational waves and its 3D topographic effect using the spectral-element method",
      "authors": [
        "Lei Zhang",
        "Han Yan",
        "Jinhai Zhang",
        "Xian Chen"
      ],
      "abstract": "Numerical simulation of lunar response to gravitational waves and its 3D topographic effect using the spectral-element method Lei Zhang, Han Yan, Jinhai Zhang, Xian Chen Accepted for publication in Physical Review D Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); Geophysics (physics.geo-ph) The Moon has been regarded as a natural Weber bar capable of amplifying gravitational waves (GWs) for detecting events across a wide range of frequencies. However, accurately determining the amplification effects remains challenging due to the absence of 3D numerical simulation methods. In this study, we develop a high-order 3D finite element method (spectral-element method, SEM) to numerically simulate the lunar response to GWs below 20 mHz. We verify the accuracy of our method by comparing the resonant peaks of our results with those from semi-analytical solutions and find that the frequency deviation is less than 3% for the first peak at about 1 mHz and less than 0.8% for the subsequent peaks up to 10 mHz. Using this method, we evaluate the amplification of GW signals due to 3D topographic effects of the Moon, and we find enhancements at a series of specific frequency components. These results highlight the non-negligible effect of surface topography on the lunar response to GWs, as a fundamental factor that holds significant implications across both global and regional analyses. Our work paves the way for a comprehensive evaluation of the Moon's resonant response to GWs, helpful for the strategic planning of lunar GW detections.",
      "pdf_url": "https://arxiv.org/pdf/2512.21667.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.21729",
      "title": "Golden and Silver Dark Sirens for precise H0 measurement with HETDEX",
      "authors": [
        "Yixuan Dang",
        "Ish Gupta",
        "Robin Ciardullo",
        "Erin Mentuch Cooper",
        "Shiksha Pandey",
        "Dustin Davis",
        "Surhud More",
        "Rachel Gray",
        "Hsin-Yu Chen",
        "Daniel J. Farrow",
        "Caryl Gronwall",
        "Donghui Jeong",
        "Shun Saito",
        "Donald P. Schneider",
        "B. S. Sathyaprakash"
      ],
      "abstract": "Golden and Silver Dark Sirens for precise H0 measurement with HETDEX Yixuan Dang, Ish Gupta, Robin Ciardullo, Erin Mentuch Cooper, Shiksha Pandey, Dustin Davis, Surhud More, Rachel Gray, Hsin-Yu Chen, Daniel J. Farrow, Caryl Gronwall, Donghui Jeong, Shun Saito, Donald P. Schneider, B. S. Sathyaprakash Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational waves (GWs) from compact binary coalescences are standard sirens that provide a direct measure of the source's luminosity distance, enabling an independent measurement of the Hubble constant (H0). While a bright siren -- a GW event with an identified electromagnetic (EM) counterpart -- provided the first such constraint, most detections, currently dominated by black hole mergers, lack EM signatures. A measurement of H0 is still possible with these dark sirens by statistically associating GW events with galaxies in existing catalogs based on the sky localization. In this work, we explore the potential of two subsets of sirens: rare golden dark sirens, for which a single galaxy dominates the H0 posterior, and silver dark sirens, which are far more common but have a larger set of plausible host galaxies. Using the fifth internal data release of the Hobby-Eberly Telescope Dark Energy Experiment (HETDEX), we assess the suitability of the Visible Integral-field Replicable Unit Spectrograph (VIRUS) for spectroscopic follow-up of dark sirens. VIRUS exposures of the standard HETDEX depth provide precise redshifts and exquisite completeness within z = 0.2. After a single year of observations with the upgraded LIGO-A# network, the combined sample of golden and silver dark sirens with z < 0.2 and follow-up VIRUS observations can potentially yield a few-percent constraint on H0. Our predictions suggest that spectroscopic redshift surveys such as HETDEX can play a key role in realizing high-precision cosmology with dark sirens in the near future. Standard-siren distance measurements offer a critical, fully independent path to the local value of H0 to resolve the Hubble tension.",
      "pdf_url": "https://arxiv.org/pdf/2512.21729.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.21955",
      "title": "Superradiant and dynamical spin-down of neutron stars with gravitational wave implications",
      "authors": [
        "Indra Kumar Banerjee",
        "Sandeep Chatterjee",
        "Biswarup Das",
        "Ujjal Kumar Dey"
      ],
      "abstract": "Superradiant and dynamical spin-down of neutron stars with gravitational wave implications Indra Kumar Banerjee, Sandeep Chatterjee, Biswarup Das, Ujjal Kumar Dey High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) Neutron stars such as pulsars and magnetars lose angular momentum primarily through electromagnetic dipole radiation, gravitational waves, $r$-mode oscillation, and also affected by fallback accretion processes. However, anomalous spin variations, particularly sudden enhanced spin-down rates, indicate additional spin-down mechanisms. We propose superradiant spin-down as a potential explanation for these events. By modelling the interplay between conventional and superradiant spin-down channels, we evaluate their impact on neutron star rotational evolution. We also discuss gravitational-wave emission produced by quadrupole deformation, $r$-mode oscillations, and axion-induced bosonic clouds around an isolated neutron star, highlighting their potential as distinct multimessenger probes in upcoming detectors.",
      "pdf_url": "https://arxiv.org/pdf/2512.21955.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.22044",
      "title": "Inferring Eccentricity of Binary Black Holes from Spin-Orbit Misalignment",
      "authors": [
        "Vishal Baibhav"
      ],
      "abstract": "Inferring Eccentricity of Binary Black Holes from Spin-Orbit Misalignment Vishal Baibhav High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Orbital eccentricity remains one of the least accessible parameters in observations of binary black hole (BBH) systems, largely erased by gravitational radiation long before detection. We introduce a new method to recover this lost parameter by using a more accessible and routinely measurable quantity: spin-orbit misalignment. In isolated binary evolution, a natal kick from the second supernova both tilts the orbital plane and injects orbital eccentricity, forging a direct and quantifiable connection between spin-tilt and post-supernova eccentricity. By measuring this spin-tilt using gravitational waves, we can not only constrain the natal kick, but we can also reconstruct the binary's formation eccentricity. We apply this method to GW190412 and GW241011, assuming an isolated formation channel, and show how their eccentricity at formation can be constrained even in the absence of direct eccentricity measurements. As more advanced detectors come online, improved signal-to-noise ratios will tighten spin-tilt constraints, allowing more precise and reliable estimates of BBH formation eccentricity. Combining this method with multiband observations from LISA and next-generation (XG) detectors will allow us to recover not only eccentricity but also the binary's orbital separation and redshift at formation, offering a clearer picture of the birth environments of BBH systems and processes that drive their merger.",
      "pdf_url": "https://arxiv.org/pdf/2512.22044.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.22075",
      "title": "Primordial black holes and smooth coarse-graining in excursion set theory",
      "authors": [
        "Daiki Saito",
        "Koki Tokeshi"
      ],
      "abstract": "Primordial black holes and smooth coarse-graining in excursion set theory Daiki Saito, Koki Tokeshi Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The excursion-set formalism enables us to infer the mass distribution of collapsed objects, such as primordial black holes (PBHs), by the language of stochastic processes. Within the framework, this article investigates how a smooth coarse-graining procedure affects the resulting PBH mass function. As a demonstrative example, we employ a Gaussian window function, for which the stochastic noise becomes fully correlated across scales. It is found that these correlated noises result in a mass function of PBHs, whose maximum and its neighbourhood are predominantly determined by the probability that the density contrast exceeds a given threshold at each mass scale. Our results clarify the role of noise correlations induced by smooth coarse-graining and highlight their importance in predicting the abundance of PBHs.",
      "pdf_url": "https://arxiv.org/pdf/2512.22075.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22085",
      "title": "Searching for Cosmological Collider in the Planck CMB Data II: collider templates and Modal analysis",
      "authors": [
        "Petar Suman",
        "Dong-Gang Wang",
        "Wuhyun Sohn",
        "James R. Fergusson",
        "E.P.S. Shellard"
      ],
      "abstract": "Searching for Cosmological Collider in the Planck CMB Data II: collider templates and Modal analysis Petar Suman, Dong-Gang Wang, Wuhyun Sohn, James R. Fergusson, E.P.S. Shellard Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Signatures of massive particles during inflation are highly informative targets for cosmological experiments. With recent progress on both theoretical and observational frontiers, we have reached the point where these novel signals of primordial non-Gaussianities (PNG) can be systematically tested with increasingly precise data. In this paper, we present the results of improved CMB data analysis for cosmological collider signals using Planck CMB data. To set the stage, we first construct a set of simplified but characteristic collider templates which are accurate over a broad range of particle masses, spins and sound speeds. In order to break degeneracies with single-field PNG, we propose an orthogonalization scheme such that the collider templates are uncorrelated with the highly constrained equilateral and orthogonal shapes. On this basis, we deploy the Modal bispectrum estimator for the Planck analysis and perform a systematic scan of parameters to search for the most significant collider signal. The maximum signal-to-noise ratio is found to be $2.35\\sigma$ for massive spin-0 exchange after taking into account the look-elsewhere effect. In addition, we cross-validate the Modal analysis with the CMB-BEST pipeline, which demonstrates the consistency of results across the benchmark examples of collider templates. Given the low signal-to-noise ratio regime we find at the current stage of PNG observations, we believe the orthogonalization procedure provides an optimized strategy for future tests of the cosmological collider with the ability to rule out single field inflation.",
      "pdf_url": "https://arxiv.org/pdf/2512.22085.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.02609",
      "title": "One-loop correction to primordial tensor modes during radiation era",
      "authors": [
        "Markus B. Fröb",
        "Dražen Glavan",
        "Paolo Meda",
        "Ignacy Sawicki"
      ],
      "abstract": "One-loop correction to primordial tensor modes during radiation era Markus B. Fröb, Dražen Glavan, Paolo Meda, Ignacy Sawicki 20 pages, 2 figures. Minor corrections, published version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The ability to infer properties of primordial inflation relies on the conservation of the superhorizon perturbations between their exit during inflation, and their re-entry during radiation era. Any considerable departure from this property would require reinterpreting the data. This is why it is important to understand how superhorizon perturbations interact with the thermal plasma driving the radiation dominated Universe. We model the plasma by free photons in a thermal state and compute the one-loop correction to the power spectrum of primordial tensor perturbations. This correction grows in time and is not suppressed by any small parameter. While one-loop result is not reliable because it invalidates perturbation theory, it signals potentially interesting effects that should be investigated further.",
      "pdf_url": "https://arxiv.org/pdf/2504.02609.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21432",
      "title": "A Modal Approach to Constrain Inflation through Numerical Bispectra",
      "authors": [
        "Bowei Zhang",
        "E.P.S. Shellard",
        "James R. Fergusson"
      ],
      "abstract": "A Modal Approach to Constrain Inflation through Numerical Bispectra Bowei Zhang, E.P.S. Shellard, James R. Fergusson Cosmology and Nongalactic Astrophysics (astro-ph.CO) Constraining inflationary models with high precision bispectra across broad parameter ranges is a challenging task, requiring intensive computations at all stages, first, predicting the primordial inflation bispectrum from quantum field theory, secondly, projecting this forward with transfer functions to the late universe and, finally, comparing with the bispectrum extracted from the observational data and matching mock catalogues. Here, the longstanding separable \\texttt{Modal} pipeline for constraining primordial bispectrum templates using WMAP and Planck CMB data has been supplemented by the more recently developed \\texttt{Primodal} code to accurately calculate bispectra numerically from inflation models, showing great potential for enhanced computational efficiency; \\texttt{Primodal} exploits the in-in separability of the tree-level in-in formalism, together with a separable mode-expansion technique to bypass the need for point-by-point bispectrum calculations. Building upon this progress, we propose a bispectrum pipeline that systematically explores the parameter space of inflationary Lagrangians, numerically computing the tree-level bispectrum (and power spectrum) for each scenario and comparing with the \\texttt{Modal} bispectrum decompositions obtained from the Planck 2018 data. Our pipeline identifies and excludes disfavored scenarios through this analysis, providing direct constraints on the parameter space, the sound speed and other quantities from the surviving observationally viable scenarios. This is preparatory work for a planned analysis using much higher-resolution CMB data from the Simons Observatory. To validate our pipeline, we perform a proof-of-concept analysis of the IR DBI inflation model, obtaining constraints of $c_s \\geq 0.073$ for the sound speed and $\\beta \\leq 0.39$ for the parameter space, demonstrating the pipeline's accuracy and effectiveness.",
      "pdf_url": "https://arxiv.org/pdf/2512.21432.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21888",
      "title": "Implications of Cosmic Birefringence for Multi-Field ALP Dark Matter",
      "authors": [
        "Jialiang Shao",
        "Ippei Obata",
        "Dongdong Zhang"
      ],
      "abstract": "Implications of Cosmic Birefringence for Multi-Field ALP Dark Matter Jialiang Shao, Ippei Obata, Dongdong Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Cosmic birefringence, characterized by the observed rotation of the polarization plane of the cosmic microwave background (CMB) radiation, serves as a critical probe for testing theories beyond the standard cosmological scenario. As a major component of the universe, dark matter plays a pivotal role in cosmic evolution, particularly in the formation of large-scale structures. However, its fundamental nature remains elusive. Axion-like particles (ALPs), as promising dark matter candidates, possess unique advantages in naturally explaining such phenomena. Previous studies on the implications of cosmic birefringence for these ultralight ALP fields have focused on single-field models with conventional potentials. These models face exclusion due to the washout effect - a suppression of the CMB polarization power spectrum induced by oscillatory dynamics of the scalar field within the mass range of less than $10^{-23}$ eV. To address this limitation, we develop a more general theoretical framework incorporating two ALP fields, providing analytical approximations and numerical calculations. Our findings reveal that the superposition of two ALP fields with distinct masses can relax the constraints imposed by the washout effect and reconcile with observations.",
      "pdf_url": "https://arxiv.org/pdf/2512.21888.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21903",
      "title": "TITAN DR1: An Improved, Validated, and Systematically-Controlled Recalibration of ATLAS Photometry toward Type Ia Supernova Cosmology",
      "authors": [
        "Elijah G. Marlin",
        "Yukei S. Murakami",
        "Dillon Brout",
        "Jack W. Tweddle",
        "Brodie Popovic",
        "Ken W. Smith",
        "Stephen J. Smartt",
        "Daniel M. Scolnic",
        "David Jones",
        "Erik R. Peterson",
        "Adam G. Riess",
        "Maria Vincenzi",
        "Nora F. Sherman",
        "Maria Acevedo",
        "Jasper Milstein",
        "Mitchell Dixon",
        "Armin Rest"
      ],
      "abstract": "TITAN DR1: An Improved, Validated, and Systematically-Controlled Recalibration of ATLAS Photometry toward Type Ia Supernova Cosmology Elijah G. Marlin, Yukei S. Murakami, Dillon Brout, Jack W. Tweddle, Brodie Popovic, Ken W. Smith, Stephen J. Smartt, Daniel M. Scolnic, David Jones, Erik R. Peterson, Adam G. Riess, Maria Vincenzi, Nora F. Sherman, Maria Acevedo, Jasper Milstein, Mitchell Dixon, Armin Rest Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) ATLAS (Asteroid Terrestrial Last Alert System) is a time-domain survey using four telescopes, covering the entire sky. It has observed over 10,000 spectroscopically confirmed Type Ia supernovae (SNe~Ia), with thousands of cosmology-grade light curves (to be released as TITAN DR1). To prepare this massive, low-redshift dataset for cosmology, we evaluate and cross-calibrate ATLAS forced photometry using tertiary stars from the DES (Dark Energy Survey) Y6 release. The 5000 deg$^2$ DES footprint overlaps regions both in and out of the PS1 (Pan-STARRS DR1) footprint, allowing tests of the primary calibrator for the ATLAS Refcat2 catalog. Initial offsets are at the $\\sim$40 mmag scale. To improve this we determine $\\Delta$ zeropoint offsets for two cases: (1) pixel-to-pixel offsets within individual CCDs (reduced from $\\sim$8 to $\\sim$4 mmag RMS) and (2) chip-to-chip offsets across the 9 CCDs and filters (reduced from $\\sim$17 to $\\sim$3 mmag RMS). We also identify the largest systematic uncertainty as a transmission-function color dependence, requiring shifts in the assumed ATLAS filters at the $\\sim$30 mmag level if uncorrected. We validate our calibration using (a) CALSPEC standards, (b) an independent tertiary catalog, and (c) distance moduli of cross-matched SNe~Ia, all showing improved consistency. Overall, we estimate combined calibration-related systematics at the $\\sim$5--10 mmag level, supporting competitive cosmological constraints with the TITAN SN~Ia dataset.",
      "pdf_url": "https://arxiv.org/pdf/2512.21903.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.21925",
      "title": "Redshift-space distortion constraints on the neutrino mass and models to alleviate the Hubble tension",
      "authors": [
        "Yo Toda",
        "Osamu Seto"
      ],
      "abstract": "Redshift-space distortion constraints on the neutrino mass and models to alleviate the Hubble tension Yo Toda, Osamu Seto Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We discuss the neutrino mass and Hubble tension solutions and examine their effects on the redshift-space distortion (RSD) observations. An analysis with RSD data indicates smaller amplitude of perturbation. Including RSD data results in a slightly weaker upper limit on the neutrino mass than that derived for data without RSD, which is common in other extended models too. We have evaluated the impacts of RSD observations on some extended models, including the varying electron mass model, a time-dependent dark energy model with two parameter equations of state (EOS), and a model where the number of neutrino species is free. When we estimate the cosmological parameters for data including RSD, we found that the EOS parameter for dark energy is larger than that of the cosmological constant, and the effective number of neutrino species is smaller than the standard value, which infers a smaller present Hubble parameter $H_0$. From the viewpoint of cosmological tensions, the varying electron mass model with nonzero neutrino mass option looks promising to relax the Hubble tension and the $S_8$ tension simultaneously.",
      "pdf_url": "https://arxiv.org/pdf/2410.21925.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.14898",
      "title": "Self-Interacting Dark Matter with Mass Segregation: A Unified Explanation of Dwarf Cores and Small-Scale Lenses",
      "authors": [
        "Daneng Yang",
        "Yi-Zhong Fan",
        "Siyuan Hou",
        "Yue-Lin Sming Tsai"
      ],
      "abstract": "Self-Interacting Dark Matter with Mass Segregation: A Unified Explanation of Dwarf Cores and Small-Scale Lenses Daneng Yang, Yi-Zhong Fan, Siyuan Hou, Yue-Lin Sming Tsai 20 pages, 12 figures. In version two, we: (1) introduce a parametric model for two-component SIDM that accounts for mass segregation; (2) provide a new discussion of baryonic effects; (3) include a statistical interpretation of the GGSL signal; and (4) demonstrate the numerical robustness of our analysis Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) In two-component self-interacting dark matter (SIDM) models with inter-species interactions, mass segregation arises naturally from collisional relaxation, enhancing central densities and gravothermal evolution. We demonstrate that models with velocity-dependent interactions, both within and between species, can connect several small-scale observations while remaining consistent with cluster-scale constraints. This combination enables core formation in dwarf halos, where the presence of baryons increases the inner densities and enhances the predicted strong lensing signatures. Using cosmological and controlled simulations alongside an accurate parametric model, we show that this framework explains the structure of dark perturbers observed in strong lensing systems, and significantly increases the efficiency of small-scale lenses by a factor of $\\sim 5$, consistent with the galaxy-galaxy strong lensing excess reported in clusters. Importantly, mass segregation can enhance the Einstein radii of SIDM halos relative to their CDM counterparts, overcoming a key challenge in one-component SIDM scenarios. Our results establish mass segregation in two-component SIDM as a self-consistent and testable model capable of simultaneously addressing multiple small-scale challenges in structure formation.",
      "pdf_url": "https://arxiv.org/pdf/2506.14898.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23343",
      "title": "Cosmological Prediction from the joint observation of MeerKAT and CSST at $z$ = 0.4 $\\sim$ 1.2",
      "authors": [
        "Yu-Er Jiang",
        "Yan Gong",
        "Qi Xiong",
        "Wenxiang Pei",
        "Yun Liu",
        "Furen Deng",
        "Zi-yan Yuwen",
        "Meng Zhang",
        "Xingchen Zhou",
        "Xuelei Chen",
        "Yin-Zhe Ma",
        "Qi Guo",
        "Bin Yue"
      ],
      "abstract": "Cosmological Prediction from the joint observation of MeerKAT and CSST at $z$ = 0.4 $\\sim$ 1.2 Yu-Er Jiang, Yan Gong, Qi Xiong, Wenxiang Pei, Yun Liu, Furen Deng, Zi-yan Yuwen, Meng Zhang, Xingchen Zhou, Xuelei Chen, Yin-Zhe Ma, Qi Guo, Bin Yue 20 pages, 13 figures, and 1 table Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cross-correlating neutral hydrogen (HI) 21cm intensity mapping with galaxy surveys provides an effective probe of astrophysical and cosmological information. This work presents a cross-correlation analysis between MeerKAT single-dish HI intensity mapping and Chinese Space Station Survey Telescope (CSST) spectroscopic galaxy surveys in $z=0.4\\sim1.2$, which will share a survey area of several thousand square degrees. Utilizing Jiutian-1G cosmological simulation, we simulate the observational data of MeerKAT and CSST with survey areas from $\\sim1600$ to $600$ deg$^2$ at $z=0.5$, 0.7, and 1. The effects of beam pattern, polarization leakage, and different foregrounds in the MeerKAT HI intensity mapping are considered in the simulation. After employing foreground removal with the principal component analysis (PCA) method and performing signal compensation, we derive the cross-power spectra of MeerKAT and CSST. We perform the joint constraint using the CSST galaxy auto-power spectra and MeerKAT-CSST cross-power spectra with the least-squares fitting method. The constraint results show that, in the simulated survey area, the relative accuracy can achieve $6\\%\\sim 8\\%$ for the parameter products $\\Omega_{\\rm HI}b_{\\rm HI}b_{g}r_{\\mathrm{HI},g}$ and $\\Omega_{\\rm HI}b_{\\rm HI}r_{\\mathrm{HI},g}$ at the three redshifts, which is $3\\sim4$ times smaller than the current result. These findings indicate that the full MeerKAT-CSST joint observation with thousands of square degrees overlapping survey area can be a powerful probe of large-scale structure, and has the ability to provide information on cosmic evolution of HI and galaxies in a wide redshift range.",
      "pdf_url": "https://arxiv.org/pdf/2509.23343.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.18577",
      "title": "The Extended Baryonic Tully-Fisher Relation for SDSS MaNGA Galaxies",
      "authors": [
        "Nitya Ravi",
        "Kelly A. Douglass",
        "Regina Demina"
      ],
      "abstract": "The Extended Baryonic Tully-Fisher Relation for SDSS MaNGA Galaxies Nitya Ravi, Kelly A. Douglass, Regina Demina 19 pages, 16 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The baryonic Tully-Fisher relation (BTFR), a relationship between rotational velocity and baryonic mass in spiral galaxies, probes the relative content of baryonic and dark matter in galaxies and thus provides a good test of Lambda CDM. Using H-alpha kinematics to model the rotation curves of spiral galaxies, we construct the BTFR for 5743 SDSS MaNGA DR17 galaxies. To extend the BTFR to higher masses using elliptical galaxies, we estimate their total masses from their stellar velocity dispersions using the virial theorem and define the effective rotational velocity as the velocity a rotation-supported galaxy would exhibit given this mass. The baryonic mass of spiral galaxies is composed of stellar, HI, H2, and He mass, while only the stellar mass is used for the baryonic content of ellipticals. We construct and fit the BTFR for a matched subsample of spiral and elliptical MaNGA and IllustrisTNG 100-1 (TNG100) galaxies, finding BTFR slopes between 3.2 and 4.0. We fit a joint BTFR for the 5743 MaNGA spiral and elliptical galaxies and find a BTFR slope of 3.54 (+0.65/-0.48), which is in good agreement with TNG100 galaxies with baryonic masses greater than 10^9 Msun for which we find a BTFR slope of 3.57 (+0.48/-0.37). Within this mass range, the MaNGA galaxies are consistent with both the Lambda CDM simulation and the prediction from MOND; a sample of lower mass galaxies is necessary to differentiate between the two models.",
      "pdf_url": "https://arxiv.org/pdf/2512.18577.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21415",
      "title": "Impact of the EPOS.LHC-R hadronic interaction model on the Centaurus A ultrahigh-energy cosmic-ray scenario",
      "authors": [
        "Silvia Mollerach",
        "Esteban Roulet"
      ],
      "abstract": "Impact of the EPOS.LHC-R hadronic interaction model on the Centaurus A ultrahigh-energy cosmic-ray scenario Silvia Mollerach, Esteban Roulet High Energy Astrophysical Phenomena (astro-ph.HE) We discuss the impact of the recent this http URL-R hadronic interaction model on the scenario in which most of the cosmic rays with energies above 5 EeV originate in the nearby Centaurus A radiogalaxy. The heavier composition inferred when considering this hadronic model implies that the amount of H and He emitted by the source is reduced compared to what was found with previous hadronic models. The elements of the CNO group play a more predominant role in the instep region just above the ankle while the elements of the Si and Fe groups can contribute significantly in the suppression region of the energy spectrum above 50 EeV. We also obtain the predictions for the amplitude of the dipolar anisotropy in different energy bins above 4 EeV, showing that they can be well consistent with the measurements for appropriate values of the extragalactic turbulent magnetic field and source lifetime. A new method to extract the information on the cosmic ray masses from that of the depth of the maximum development of the air showers is also introduced.",
      "pdf_url": "https://arxiv.org/pdf/2512.21415.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21500",
      "title": "Numerical Simulations of the Circularized Accretion Flow in Population III Star Tidal Disruption Events. I. The Accretion Flow and the Wind",
      "authors": [
        "Yu-Heng Sheng",
        "De-Fu Bu",
        "Xiao-Hong Yang",
        "Yi-Ren Chang",
        "Liang Chen"
      ],
      "abstract": "Numerical Simulations of the Circularized Accretion Flow in Population III Star Tidal Disruption Events. I. The Accretion Flow and the Wind Yu-Heng Sheng, De-Fu Bu, Xiao-Hong Yang, Yi-Ren Chang, Liang Chen 23pages,21figures,accepted by ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Tidal Disruption Events (TDEs) have recently been proposed as potential probes for Population III stars. However, the properties of the accretion flow and the wind from the Pop III star TDE system are not clear. By performing radiative hydrodynamic simulations, we study the 'circularized' accretion flow of the Pop III star TDE system. The masses of the black hole (BH) and the disrupted star are $10^6$ and $300$ solar masses, respectively. We focus on the properties of the wind. We find that the black hole accretion rate is highly super-Eddington. A strong wind is driven by radiation pressure. Due to the presence of a strong wind, only $25\\%$--$35\\%$ of the fallback debris is accreted by the BH. The remaining part is taken away by the wind. The kinetic power of the wind can be as high as $10^{46} {\\rm \\ erg \\ s^{-1}}$. The properties of the wind obtained in this paper may be useful for understanding the radiation properties of Pop III star TDEs in the context of the wind 'reprocessing' model.",
      "pdf_url": "https://arxiv.org/pdf/2512.21500.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21669",
      "title": "VLBI Diagnostics of Off-axis Jets in Radio Flares of Tidal Disruption Events",
      "authors": [
        "Tatsuya Matsumoto"
      ],
      "abstract": "VLBI Diagnostics of Off-axis Jets in Radio Flares of Tidal Disruption Events Tatsuya Matsumoto 13 pages, 9 figures, 1 table, submitted to ApJ, comments welcome!!! High Energy Astrophysical Phenomena (astro-ph.HE) The origin of late-time radio flares in tidal disruption events remains unclear. In particular, the peculiar radio flare observed in AT2018hyz has motivated two leading scenarios: a delayed outflow launched $\\sim1000\\,\\rm days$ after discovery, or an off-axis relativistic jet directed far from our line of sight. Very long baseline interferometry (VLBI) imaging provides the most direct way to distinguish between these scenarios. In this paper, we calculate synthetic radio images for both models and examine their observational signatures. The motion of the emission centroid is the most powerful diagnostic for breaking the degeneracy. In the delayed-outflow scenario, the centroid motion is confined within a non-relativistic distance, whereas in the off-axis jet scenario it exhibits apparent superluminal motion. Detecting such superluminal motion would therefore provide a smoking-gun signature of the off-axis jet interpretation. We also find that the jet image exhibits characteristic features, including a non-monotonic evolution of the image aspect ratio. These results are expected to be generic and applicable to other jetted explosions, such as microquasars and gamma-ray bursts.",
      "pdf_url": "https://arxiv.org/pdf/2512.21669.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21676",
      "title": "Investigating the signs of evolutionary characteristics in the energy spectrum of shock wave acceleration",
      "authors": [
        "Xu-Lin Dong",
        "Wei-Kang Gao",
        "Yi-Qing Guo",
        "Shu-Wang Cui"
      ],
      "abstract": "Investigating the signs of evolutionary characteristics in the energy spectrum of shock wave acceleration Xu-Lin Dong, Wei-Kang Gao, Yi-Qing Guo, Shu-Wang Cui High Energy Astrophysical Phenomena (astro-ph.HE) Under ideal conditions, the theory of shock acceleration for cosmic rays predicts that different elements should exhibit strictly identical spectral indices when accelerated to the same rigidity (R). However, recent high-precision measurements of elemental energy spectra have definitively established the existence of variations in spectral indices across different elements. This study constrains the spectral indices of cosmic-ray elements using AMS-02 and DAMPE observations within the Spatially Dependent Propagation (SDP) model. For elements with A/Z = 2, spectral indices shows significant positive correlations with both atomic number Z and mass number A, likely due to A or Z-dependent fragmentation cross-sections. Predictions indicate that the observed spectra of Ni and Zn will align with the Fe spectrum, while their injection spectra will exhibit slightly softer spectral indices compared to Fe. Future observations from AMS-02, DAMPE and HERD are expected to verify these findings, while theoretical models are needed to systematically explain this phenomenon.",
      "pdf_url": "https://arxiv.org/pdf/2512.21676.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21885",
      "title": "Spectral State Switching in Mrk 421: Results from the AstroSat LAXPC/SXT Observations",
      "authors": [
        "Sikandar Akbar",
        "Zahir Shah",
        "Ranjeev Misra",
        "Naseer Iqbal"
      ],
      "abstract": "Spectral State Switching in Mrk 421: Results from the AstroSat LAXPC/SXT Observations Sikandar Akbar, Zahir Shah, Ranjeev Misra, Naseer Iqbal submitted to Journal of High Energy Astrophysics(JHEAP) High Energy Astrophysical Phenomena (astro-ph.HE) We carried a detailed time and flux resolved X-ray spectral analysis of the high-synchrotron-peaked blazar Mrk\\,421 using simultaneous AstroSat and LAXPC20/SXT observations. The 100\\,s binned LAXPC20 light curve obtained during 3--8 January 2017 reveals pronounced flux variability. The source exhibits a fractional variability amplitude of $F_{\\mathrm{rms}} = 0.210 \\pm 0.005$ in the SXT band and $F_{\\mathrm{rms}} = 0.316 \\pm 0.006$ in the LAXPC20 band. During this interval, the source reached a peak count rate of 122.94\\,counts\\,s$^{-1}$. This enabled us to carry flux resolved spectroscopy by selecting ten flux states, S1--S10 each having a width of 8\\,counts\\,s$^{-1}$. We noted that the spectra in these flux states are well described by a synchrotron-convolved broken power-law (BPL), which consistently provides a better fit than a log-parabola. The low-energy particle index (index before the break) is found to cluster around two discrete values across flux states indicating two spectra states in the source. The break energy consistently moves to high energy with increase in flux level in these states. Time-resolved spectroscopy (10-ks segments) confirms that the flux histogram is best modelled as a double lognormal distribution and the index histogram is bimodal. Inclusion of two additional long observations spanning 2017-2019 shows the same double-state behaviour on longer timescales. Together, the results indicate that Mrk\\,421 routinely occupies two dominant spectral; in a leptonic synchrotron framework this can be explained by Gaussian-like fluctuations in acceleration conditions producing lognormal flux states.",
      "pdf_url": "https://arxiv.org/pdf/2512.21885.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21889",
      "title": "Long-term monitoring of repeating FRB 20220912A with the uGMRT at low radio frequencies",
      "authors": [
        "Ajay Kumar",
        "Yogesh Maan",
        "Banshi Lal",
        "Yash Bhusare",
        "Shriharsh P. Tendulkar",
        "Visweshwar Ram Marthi",
        "Puja Majee"
      ],
      "abstract": "Long-term monitoring of repeating FRB 20220912A with the uGMRT at low radio frequencies Ajay Kumar, Yogesh Maan, Banshi Lal, Yash Bhusare, Shriharsh P. Tendulkar, Visweshwar Ram Marthi, Puja Majee 22 Pages, 16 Figures, 1 Table, Submitted to ApJ, Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) Some repeating FRBs exhibit occasional extreme repetition rates, but very few show a sustained high activity level. One such hyperactive repeater is FRB 20220912A, which was discovered by CHIME/FRB Collaboration on 2022 September 12. Here, we present results from a long-term monitoring campaign of FRB 20220912A using the upgraded Giant Metrewave Radio Telescope (uGMRT) in the frequency range from 300 to 750 MHz. Over the course of nearly two years, we detected a total of 643 bursts in this frequency range. The source exhibited extreme activity for a few months after its discovery and sustained its active phase for over 500 days, with unsystematic modulations in the activity during this phase. The cumulative energy distributions in both bands show a break, consistent with other active repeaters like FRB 20121102A, FRB 202011124A, etc., suggesting common underlying emission mechanisms. Moreover, we show that the energy distribution shape for FRB 20220912A remains broadly same across a large range of frequencies and over time. Overall, the extended high activity, estimated total energy output, persistent power-law tails in the energy distributions, and the lack of detectable short timescale periodicity favor progenitor models invoking young dynamic magnetars, potentially emitting pulses across large rotation phase ranges.",
      "pdf_url": "https://arxiv.org/pdf/2512.21889.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21892",
      "title": "A Rare Millisecond Pulsar with Cross-Pole Emission: Single-Pulse Insights from PSR J1857+0943",
      "authors": [
        "Shi-jun Dang",
        "Ji-guang Lu",
        "Peng Jiang",
        "Yu-lan Liu",
        "Jin-tao Xie",
        "Habtamu Menberu Tedila",
        "Fei-fei Kou",
        "Jian-ping Yuan",
        "Zhi-gang Wen",
        "Shuang-qiang Wang",
        "Lun-hua Shang",
        "Zu-rong Zhou",
        "Wen-ming Yan",
        "Qi-jun Zhi",
        "Na Wang"
      ],
      "abstract": "A Rare Millisecond Pulsar with Cross-Pole Emission: Single-Pulse Insights from PSR J1857+0943 Shi-jun Dang, Ji-guang Lu, Peng Jiang, Yu-lan Liu, Jin-tao Xie, Habtamu Menberu Tedila, Fei-fei Kou, Jian-ping Yuan, Zhi-gang Wen, Shuang-qiang Wang, Lun-hua Shang, Zu-rong Zhou, Wen-ming Yan, Qi-jun Zhi, Na Wang 11 pages,8 fiugres,submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Studies of subpulse variability in millisecond pulsars (MSPs) offer important constraints on their emission physics. Using the high sensitivity of FAST, we present the first identification of distinct single pulse fluctuation behaviour in PSR J1857+0943. We find that the third component(MP\\_C3) of the main pulse may originate from a different region than the other two main-pulse components and may instead share a common origin with the interpulse. This conclusion is supported by four observational evidence as follows: First, the LRCCF shows a clear anticorrelation between MP\\_C3 and the interpulse. Second, the single-pulse polarization at the main-pulse longitude reveals obvious component mixing. Third, the modulation period of the interpulse components is roughly twice that of MP\\_C3. Fourth, the reduced modulation index in MP\\_C3 suggests possible mixing of emission from different regions. The interpretation in this letter contrasts with the usual assumption that the main pulse and interpulse originate from opposite magnetic poles. Hence, PSR J1857+0943 provides a rare laboratory for probing component-dependent plasma behaviour in an MSP magnetosphere. Our results offer direct evidence that the main pulse can include emission associated with more than one magnetic pole and highlight the importance of single-pulse diagnostics for understanding the geometry and dynamics of pulsars with interpulse emission. In addition, we analyse the jitter properties of this pulsar and measure a one-hour jitter of $\\sigma_{J,1\\rm h} = 78 \\pm 3~\\mathrm{ns}$ at 1.25 GHz, consistent with previous studies.",
      "pdf_url": "https://arxiv.org/pdf/2512.21892.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21899",
      "title": "The First X-ray Polarimetry of GRS 1739--278 Reveals Its Rapidly Spinning Black Hole",
      "authors": [
        "Qing-Chang Zhao",
        "Michal Dovciak",
        "Han-Cheng Li",
        "Lian Tao",
        "Hua Feng",
        "Federico Vincentelli",
        "Giorgio Matt",
        "Philip Kaaret",
        "Shuang-Nan Zhang"
      ],
      "abstract": "The First X-ray Polarimetry of GRS 1739--278 Reveals Its Rapidly Spinning Black Hole Qing-Chang Zhao, Michal Dovciak, Han-Cheng Li, Lian Tao, Hua Feng, Federico Vincentelli, Giorgio Matt, Philip Kaaret, Shuang-Nan Zhang Acceptance for publication in APJL High Energy Astrophysical Phenomena (astro-ph.HE) We present a joint spectro-polarimetric analysis of the black hole X-ray binary GRS~1739--278 during its 2025 mini-outburst, using simultaneous observations from \\ixpe\\ and \\nustar. The \\ixpe\\ data show a polarization degree of ${\\rm PD} = (2.3 \\pm 0.4)\\%$ and a polarization angle of ${\\rm PA} = 62^\\circ \\pm 5^\\circ$ in the 2--8~keV range. The model-independent analysis reveals that the PD increases from $\\sim 2\\%$ at 2~keV to $\\sim 10\\%$ in the 6--8~keV band, while the PA remains stable across the \\ixpe\\ band within statistical uncertainties. Broadband spectral modeling of the combined \\ixpe\\ and \\nustar\\ datasets shows that hard Comptonization contributes negligibly in this soft-state observation, while a substantial reflected component is required in addition to the thermal disk emission. We then model the \\ixpe\\ Stokes spectra using the \\texttt{kynbbrr} model. The best-fitting results indicate that high-spin configurations enhance the contribution of reflected returning radiation, which dominates the observed polarization properties. From the \\texttt{kynbbrr} modeling, we infer an extreme black hole spin of $a = 0.994^{+0.004}_{-0.003}$ and a system inclination of $i = 54^\\circ{}^{+8^\\circ}_{-4^\\circ}$. Owing to the large contribution from returning radiation, the observed polarization direction is nearly parallel to the projected system axis, the position angle of which is predicted to be $58^\\circ \\pm 4^\\circ$. Our results demonstrate that X-ray polarimetry, combined with broadband spectroscopy, directly probes the geometry and relativistic effects in accretion disks around stellar-mass black holes.",
      "pdf_url": "https://arxiv.org/pdf/2512.21899.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22028",
      "title": "Multiband optical variability on diverse timescales of the blazar Ton 599 from 2011 to 2023",
      "authors": [
        "O. Vince",
        "C. M. Raiteri",
        "M. Villata",
        "A. C. Gupta",
        "J. Kovačević-Dojčinović",
        "M. Lakićević",
        "L. Č. Popović",
        "P. Kushwaha",
        "D. O. Mirzaqulov",
        "S. A. Ehgamberdiev",
        "D. Carosati",
        "S. G. Jorstad",
        "A. P. Marscher",
        "Z. R. Weaver",
        "J. R. Webb",
        "P. S. Smith",
        "W. P. Chen",
        "A. Tsai",
        "H. C. Lin",
        "G. A. Borman",
        "T. S. Grishina",
        "V. A. Hagen-Thorn",
        "E. N. Kopatskaya",
        "E. G. Larionova",
        "V. M. Larionov",
        "L. V. Larionova",
        "D. A. Morozova",
        "S. S. Savchenko",
        "I. S. Troitskiy",
        "Y. V. Troitskaya",
        "A. A. Vasilyev",
        "A. V. Zhovtan",
        "E. V. Shishkina",
        "O. M. Kurtanidze",
        "M. G. Nikolashvili",
        "S. O. Kurtanidze",
        "R. Ivanidze",
        "J. A. Acosta-Pulido",
        "M. I. Carnerero",
        "G. Damljanović",
        "M. Stojanovic",
        "M. D. Jovanovic",
        "V. V. Vlasyuk",
        "O. I. Spiridonova",
        "A. S. Moskvitin",
        "T. Pursimo",
        "D. Elsässer",
        "M. Feige",
        "L. Kunkel",
        "J. Ledermann",
        "D. Reinhart",
        "A. Scherbantin",
        "K. Schoch",
        "R. Steineke",
        "C. Lorey",
        "I. Agudo",
        "J. Escudero Pedrosa",
        "F. J. Aceituno",
        "G. Bonnoli",
        "V. Casanova",
        "D. Morcuende",
        "A. Sota",
        "V. Bozhilov",
        "A. Valcheva",
        "E. Zaharieva",
        "M. Minev",
        "A. Strigachev",
        "R. Bachev",
        "B. Mihov",
        "L. Slavcheva-Mihova",
        "A. C. Sadun",
        "A. Takey",
        "A. Shokry",
        "M. A. El-Sadek",
        "A. Marchiniand G. Verna"
      ],
      "abstract": "Multiband optical variability on diverse timescales of the blazar Ton 599 from 2011 to 2023 O. Vince, C. M. Raiteri, M. Villata, A. C. Gupta, J. Kovačević-Dojčinović, M. Lakićević, L. Č. Popović, P. Kushwaha, D. O. Mirzaqulov, S. A. Ehgamberdiev, D. Carosati, S. G. Jorstad, A. P. Marscher, Z. R. Weaver, J. R. Webb, P. S. Smith, W. P. Chen, A. Tsai, H. C. Lin, G. A. Borman, T. S. Grishina, V. A. Hagen-Thorn, E. N. Kopatskaya, E. G. Larionova, V. M. Larionov, L. V. Larionova, D. A. Morozova, S. S. Savchenko, I. S. Troitskiy, Y. V. Troitskaya, A. A. Vasilyev, A. V. Zhovtan, E. V. Shishkina, O. M. Kurtanidze, M. G. Nikolashvili, S. O. Kurtanidze, R. Ivanidze, J. A. Acosta-Pulido, M. I. Carnerero, G. Damljanović, M. Stojanovic, M. D. Jovanovic, V. V. Vlasyuk, O. I. Spiridonova, A. S. Moskvitin, T. Pursimo, D. Elsässer, M. Feige, L. Kunkel, J. Ledermann, D. Reinhart, A. Scherbantin, K. Schoch, R. Steineke, C. Lorey, I. Agudo, J. Escudero Pedrosa, F. J. Aceituno, G. Bonnoli, V. Casanova, D. Morcuende, A. Sota, V. Bozhilov, A. Valcheva, E. Zaharieva, M. Minev, A. Strigachev, R. Bachev, B. Mihov, L. Slavcheva-Mihova, A. C. Sadun, A. Takey, A. Shokry, M. A. El-Sadek, A. Marchiniand G. Verna 22 pages, 12 figures (+1 in Appendix), 9 tables (+1 in Appendix) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) (Shortened)Context: We analyze the optical variability of the FSRQ Ton 599 using BVRI photometry from the WEBT collaboration (2011-2023), complemented by photometric and spectroscopic data from the Steward Observatory.\\\\ Aims: To characterize short- and long-term optical variability -- including flux distributions, intranight changes, color evolution, and spectra -- to constrain physical parameters and processes in the central engine.\\\\ Methods: We tested flux distributions in each filter against normal and log-normal, explored the RMS-flux relation and derived PSDs. We quantified intranight variability using a $\\chi^2$ test and fractional variability. From variability timescales, we estimated the emitting region size and magnetic field. Long-term variability was studied by segmenting the light curve into 12 intervals and analyzing flux statistics. For multi-filter flares, we computed spectral slopes, redshift-corrected fluxes, monochromatic luminosities and generated Color-magnitude and color-time diagrams. From low-flux spectra, we measured Mg II line and estimated the black hole mass.\\\\ Results: Ton 599 showed strong optical variability. Log-normal distributions fit the fluxes better, and all bands show a positive RMS-flux relation with red-noise this http URL variability is detected, and used in constraining the emission region and magnetic this http URL R band reaches a peak flux of 23.5 mJy, corresponding to a monochromatic luminosity of $log({\\nu}L{\\nu})= 48.48 [erg/s]$. We found a redder-when-brighter trend at low fluxes (thermal), achromatic behavior at intermediate levels (possibly due to jet orientation changes), and a bluer-when-brighter trend at high fluxes (synchrotron). Long-term color changes are modest, short-term are significant, with a negative correlation between the amplitude of color changes and the average flux. The estimated SMBH mass is order of $10^8 M_\\odot$.",
      "pdf_url": "https://arxiv.org/pdf/2512.22028.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22117",
      "title": "Radio Supernovae",
      "authors": [
        "Esha Kundu"
      ],
      "abstract": "35 pages, 29 figures. Review paper, published in the journal \"Universe\", in the special issue \"A Multiwavelength View of Supernovae\" High Energy Astrophysical Phenomena (astro-ph.HE) Supernovae (SNe), the catastrophic end of stars' lives, are among the most energetic phenomena in the universe. Mapping the aftermath of the explosions to the properties of pre-SN stars is challenging due to the lack of knowledge about the evolution of different types of stars. The immediate surroundings of pre-SN stars carry the signature of the progenitors, and radio observations are the best way to examine the ambient media. Since radio emission originates from the interaction of supersonic SN ejecta with the relatively stationary circumstellar medium, with a few years of radio study, the mass-loss history of progenitor stars can be probed from just before the explosion of the star to thousands of years before the onset of the SN. Moreover, this can provide crucial details about the explosions, which are poorly understood to date. In this paper, we review the radio properties of different types of core-collapse explosions and thermonuclear runaways to understand their mass-loss evolution--which allows us to unravel the imprints of the progenitors on the surrounding media and thus the nature of the exploded stars. Additionally, we discuss the current state of the art in this field, including existing and the next-generation radio facilities with enhanced capabilities that provide further details about these explosions.",
      "pdf_url": "https://arxiv.org/pdf/2512.22117.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21407",
      "title": "Neural Network for Simulating Radio Emission from Extensive Air Showers",
      "authors": [
        "Pranav Sampathkumar",
        "Tim Huege",
        "Andreas Haungs",
        "Ralph Engel"
      ],
      "abstract": "Neural Network for Simulating Radio Emission from Extensive Air Showers Pranav Sampathkumar, Tim Huege, Andreas Haungs, Ralph Engel Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS 2025). arXiv admin note: substantial text overlap with arXiv:2507.07713 Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) Cosmic ray shower detection using large radio arrays has gained significant traction in recent years. With massive improvements in signal modelling and microscopic simulations, the analysis of incoming events is still severely limited by the simulation cost of radio emission to interpret the data. In this work, we show that a neural network can be used for simulating such radio pulses. This work serves as a proof of concept that simple neural networks can be used for emergent deterministic macroscopic phenomena of microscopic simulations. We also demonstrate how such a neural network can be used for the physics use case of $X_\\mathrm{max}$ reconstruction, while retaining comparable resolution to using full Monte-Carlo simulations for radio emission. Code available at this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2512.21407.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21728",
      "title": "A self-consistent 3D MHD model producing a solar blowout jet",
      "authors": [
        "Yajie Chen",
        "Hardi Peter",
        "Damien Przybylski",
        "Lakshmi Pradeep Chitta",
        "Sudip Mandal"
      ],
      "abstract": "A self-consistent 3D MHD model producing a solar blowout jet Yajie Chen, Hardi Peter, Damien Przybylski, Lakshmi Pradeep Chitta, Sudip Mandal Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Context. Solar blowout jets are a distinct subclass of ubiquitous extreme-ultraviolet (EUV) and X-ray coronal jets. Aims. Most existing models of blowout jets prescribe an initial magnetic field configurations and apply ad-hoc changes in the photosphere to trigger the jets. In contrast, we aim for a self-consistent magneto-convective description of the jet initiation. Methods. We employ a 3D radiation magnetohydrodynamic (MHD) model of a solar coronal hole region using the MURaM code. The computational domain extends from the upper convection zone to the lower corona. We synthesize the emission in the extreme UV and X-rays for a direct comparison to observations and examine the evolution of the magnetic field structure of the event. Results. In the simulation a twisted flux tube forms self-consistently, emerges through the surface and interacts with the pre-existing open field. Initially the resulting jet is of the standard type with a narrow spire. The release of the twist into the open field causes a broadening of the jet spire turning the jet into a blowout type. At the same time this creates a fast heating front propagating at the local Alfvén speed. The properties of the modeled jet closely match observations of blowout jets: a slow (180 km/s) mass upflow and a fast (500 km/s) propagating front form, the latter being a signature of the heating front. Also the timing of the jet with respect to the flux emergence and subsequent cancellation matches observations. Conclusions. The near-surface magneto-convection self-consistently generates a twisted flux tube that emerges through the photosphere. The tube then interacts with the pre-existing magnetic field by means of interchange reconnection. This transfers the twist to the open field region and produces a blowout jet that matches the main characteristics of this type of jet found in observations.",
      "pdf_url": "https://arxiv.org/pdf/2512.21728.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.15353",
      "title": "Detection of very high-energy gamma-ray emission from the radio galaxy M87 with LHAASO",
      "authors": [
        "Zhen Cao",
        "F. Aharonian",
        "Axikegu",
        "Y. X. Bai",
        "Y. W. Bao",
        "D. Bastieri",
        "X. J. Bi",
        "Y. J. Bi",
        "W. Bian",
        "A. V. Bukevich",
        "Q. Cao",
        "W. Y. Cao",
        "Zhe Cao",
        "J. Chang",
        "J. F. Chang",
        "A. M. Chen",
        "E. S. Chen",
        "H. X. Chen",
        "Liang Chen",
        "Lin Chen",
        "Long Chen",
        "M. J. Chen",
        "M. L. Chen",
        "Q. H. Chen",
        "S. Chen",
        "S. H. Chen",
        "S. Z. Chen",
        "T. L. Chen",
        "Y. Chen",
        "N. Cheng",
        "Y. D. Cheng",
        "M. C. Chu",
        "M. Y. Cui",
        "S. W. Cui",
        "X. H. Cui",
        "Y. D. Cui",
        "B. Z. Dai",
        "H. L. Dai",
        "Z. G. Dai",
        "Danzengluobu",
        "X. Q. Dong",
        "K. K. Duan",
        "J. H. Fan",
        "Y. Z. Fan",
        "J. Fang",
        "J. H. Fang",
        "K. Fang",
        "C. F. Feng",
        "H. Feng",
        "L. Feng",
        "S. H. Feng",
        "X. T. Feng",
        "Y. Feng",
        "Y. L. Feng",
        "S. Gabici",
        "B. Gao",
        "C. D. Gao",
        "Q. Gao",
        "W. Gao",
        "W. K. Gao",
        "M. M. Ge",
        "T. T. Ge",
        "L. S. Geng",
        "G. Giacinti",
        "G. H. Gong",
        "Q. B. Gou",
        "M. H. Gu",
        "F. L. Guo",
        "J. Guo",
        "X. L. Guo",
        "Y. Q. Guo",
        "Y. Y. Guo",
        "Y. A. Han",
        "O. A. Hannuksela",
        "M. Hasan",
        "H. H. He",
        "H. N. He",
        "J. Y. He",
        "Y. He",
        "Y. K. Hor",
        "B. W. Hou",
        "C. Hou",
        "X. Hou",
        "H. B. Hu",
        "Q. Hu",
        "S. C. Hu",
        "C. Huang",
        "D. H. Huang",
        "T. Q. Huang",
        "W. J. Huang",
        "X. T. Huang",
        "X. Y. Huang",
        "Y. Huang",
        "Y. Y. Huang",
        "X. L. Ji",
        "H. Y. Jia",
        "K. Jia",
        "H. B. Jiang",
        "K. Jiang",
        "X. W. Jiang"
      ],
      "abstract": "Detection of very high-energy gamma-ray emission from the radio galaxy M87 with LHAASO Zhen Cao, F. Aharonian, Axikegu, Y. X. Bai, Y. W. Bao, D. Bastieri, X. J. Bi, Y. J. Bi, W. Bian, A. V. Bukevich, Q. Cao, W. Y. Cao, Zhe Cao, J. Chang, J. F. Chang, A. M. Chen, E. S. Chen, H. X. Chen, Liang Chen, Lin Chen, Long Chen, M. J. Chen, M. L. Chen, Q. H. Chen, S. Chen, S. H. Chen, S. Z. Chen, T. L. Chen, Y. Chen, N. Cheng, Y. D. Cheng, M. C. Chu, M. Y. Cui, S. W. Cui, X. H. Cui, Y. D. Cui, B. Z. Dai, H. L. Dai, Z. G. Dai, Danzengluobu, X. Q. Dong, K. K. Duan, J. H. Fan, Y. Z. Fan, J. Fang, J. H. Fang, K. Fang, C. F. Feng, H. Feng, L. Feng, S. H. Feng, X. T. Feng, Y. Feng, Y. L. Feng, S. Gabici, B. Gao, C. D. Gao, Q. Gao, W. Gao, W. K. Gao, M. M. Ge, T. T. Ge, L. S. Geng, G. Giacinti, G. H. Gong, Q. B. Gou, M. H. Gu, F. L. Guo, J. Guo, X. L. Guo, Y. Q. Guo, Y. Y. Guo, Y. A. Han, O. A. Hannuksela, M. Hasan, H. H. He, H. N. He, J. Y. He, Y. He, Y. K. Hor, B. W. Hou, C. Hou, X. Hou, H. B. Hu, Q. Hu, S. C. Hu, C. Huang, D. H. Huang, T. Q. Huang, W. J. Huang, X. T. Huang, X. Y. Huang, Y. Huang, Y. Y. Huang, X. L. Ji, H. Y. Jia, K. Jia, H. B. Jiang, K. Jiang, X. W. Jiang High Energy Astrophysical Phenomena (astro-ph.HE) The nearby radio galaxy M87 is a very-high-energy (VHE) gamma-ray emitter established by observations with ground-based gamma-ray detectors. Here we report the long-term monitoring of M87 from 2021 to 2024 with Large High Altitude Air Shower Observatory (LHAASO). M87 has been detected by LHAASO with a statistical significance $\\sim 9\\sigma$. The observed energy spectrum extends to 20 TeV, with a possible hardening at $\\sim 20$ TeV and then a clear softening at higher energies. Assuming that the intrinsic spectrum is described by a single power law up to 20 TeV, a tight upper bound on the extragalactic background light (EBL) intensity is obtained. A strong VHE flare lasting eight days, with the rise time of $\\tau_{r}^{\\rm rise} = 1.05\\pm0.49$~days and decay time of $\\tau_{d}^{\\rm decay} = 2.17\\pm0.58$~days, was found in early 2022. A possible GeV flare is seen also in the Fermi-LAT data during the VHE flare period. The variability time as short as one day seen in the LHAASO data suggests a compact emission region with a size of $\\sim 3\\times 10^{15}\\delta\\, {\\rm cm}$ ($\\delta$ being the Doppler factor of the emitting region), corresponding to a few Schwarzschild radii of the central supermassive black hole in M87. The continuous monitoring of the source reveals a duty cycle of $\\sim 1\\%$ for VHE flares with a flux above $ 10^{-11}{\\rm~erg~cm^{-2}~s^{-1}}$.",
      "pdf_url": "https://arxiv.org/pdf/2410.15353.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.13315",
      "title": "Sombrero Galaxy as an Accelerator of Ultrahigh Energy Cosmic Ray Nuclei",
      "authors": [
        "Luis A. Anchordoqui",
        "Karem Peñaló Castillo"
      ],
      "abstract": "Sombrero Galaxy as an Accelerator of Ultrahigh Energy Cosmic Ray Nuclei Luis A. Anchordoqui, Karem Peñaló Castillo Matching version to be published in PRD High Energy Astrophysical Phenomena (astro-ph.HE) Motivated by a recent proposal that points to the Sombrero galaxy as a source of the highest energy cosmic rays, we investigate the feasibility of accelerating light and heavy nuclei in the supermassive black hole located at the center of this dormant galaxy. We show that cosmic ray nuclei concentrated in the immediate vicinity of the supermassive black hole could be efficiently accelerated up to the maximum observed energies without suffering catastrophic spallations. Armed with our findings we stand against the conventional wisdom and conjecture that accelerators of the highest energy cosmic rays must anti-correlate with the (electromagnetic) source power.",
      "pdf_url": "https://arxiv.org/pdf/2503.13315.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.14447",
      "title": "Precise measurements of the cosmic ray proton energy spectrum in the \"knee'' region",
      "authors": [
        "The LHAASO Collaboration",
        "Zhen Cao",
        "F. Aharonian",
        "Y.X. Bai",
        "Y.W. Bao",
        "D. Bastieri",
        "X.J. Bi",
        "Y.J. Bi",
        "W. Bian",
        "A.V. Bukevich",
        "C.M. Cai",
        "W.Y. Cao",
        "Zhe Cao",
        "J. Chang",
        "J.F. Chang",
        "A.M. Chen",
        "E.S. Chen",
        "G.H. Chen",
        "H.X. Chen",
        "Liang Chen",
        "Long Chen",
        "M.J. Chen",
        "M.L. Chen",
        "Q.H. Chen",
        "S. Chen",
        "S.H. Chen",
        "S.Z. Chen",
        "T.L. Chen",
        "X.B. Chen",
        "X.J. Chen",
        "Y. Chen",
        "N. Cheng",
        "Y.D. Cheng",
        "M.C. Chu",
        "M.Y. Cui",
        "S.W. Cui",
        "X.H. Cui",
        "Y.D. Cui",
        "B.Z. Dai",
        "H.L. Dai",
        "Z.G. Dai",
        "Danzengluobu",
        "Y.X. Diao",
        "X.Q. Dong",
        "K.K. Duan",
        "J.H. Fan",
        "Y.Z. Fan",
        "J. Fang",
        "J.H. Fang",
        "K. Fang",
        "C.F. Feng",
        "H. Feng",
        "L. Feng",
        "S.H. Feng",
        "X.T. Feng",
        "Y. Feng",
        "Y.L. Feng",
        "S. Gabici",
        "B. Gao",
        "C.D. Gao",
        "Q. Gao",
        "W. Gao",
        "W.K. Gao",
        "M.M. Ge",
        "T.T. Ge",
        "L.S. Geng",
        "G. Giacinti",
        "G.H. Gong",
        "Q.B. Gou",
        "M.H. Gu",
        "F.L. Guo",
        "J. Guo",
        "X.L. Guo",
        "Y.Q. Guo",
        "Y.Y. Guo",
        "Y.A. Han",
        "O.A. Hannuksela",
        "M. Hasan",
        "H.H. He",
        "H.N. He",
        "J.Y. He",
        "X.Y. He",
        "Y. He",
        "S. Hernandez-Cadena",
        "B.W. Hou",
        "C. Hou",
        "X. Hou",
        "H.B. Hu",
        "S.C. Hu",
        "C. Huang",
        "D.H. Huang",
        "J.J. Huang",
        "T.Q. Huang",
        "W.J. Huang",
        "X.T. Huang",
        "X.Y. Huang",
        "Y. Huang",
        "Y.Y. Huang",
        "X.L. Ji",
        "H.Y. Jia"
      ],
      "abstract": "Precise measurements of the cosmic ray proton energy spectrum in the \"knee'' region The LHAASO Collaboration, Zhen Cao, F. Aharonian, Y.X. Bai, Y.W. Bao, D. Bastieri, X.J. Bi, Y.J. Bi, W. Bian, A.V. Bukevich, C.M. Cai, W.Y. Cao, Zhe Cao, J. Chang, J.F. Chang, A.M. Chen, E.S. Chen, G.H. Chen, H.X. Chen, Liang Chen, Long Chen, M.J. Chen, M.L. Chen, Q.H. Chen, S. Chen, S.H. Chen, S.Z. Chen, T.L. Chen, X.B. Chen, X.J. Chen, Y. Chen, N. Cheng, Y.D. Cheng, M.C. Chu, M.Y. Cui, S.W. Cui, X.H. Cui, Y.D. Cui, B.Z. Dai, H.L. Dai, Z.G. Dai, Danzengluobu, Y.X. Diao, X.Q. Dong, K.K. Duan, J.H. Fan, Y.Z. Fan, J. Fang, J.H. Fang, K. Fang, C.F. Feng, H. Feng, L. Feng, S.H. Feng, X.T. Feng, Y. Feng, Y.L. Feng, S. Gabici, B. Gao, C.D. Gao, Q. Gao, W. Gao, W.K. Gao, M.M. Ge, T.T. Ge, L.S. Geng, G. Giacinti, G.H. Gong, Q.B. Gou, M.H. Gu, F.L. Guo, J. Guo, X.L. Guo, Y.Q. Guo, Y.Y. Guo, Y.A. Han, O.A. Hannuksela, M. Hasan, H.H. He, H.N. He, J.Y. He, X.Y. He, Y. He, S. Hernandez-Cadena, B.W. Hou, C. Hou, X. Hou, H.B. Hu, S.C. Hu, C. Huang, D.H. Huang, J.J. Huang, T.Q. Huang, W.J. Huang, X.T. Huang, X.Y. Huang, Y. Huang, Y.Y. Huang, X.L. Ji, H.Y. Jia Science Bulletin 70(2025)4173-4180 High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex) We report the high-purity identification of cosmic-ray (CR) protons and a precise measurement of their energy spectrum from 0.15 to 12 PeV using the Large High Altitude Air Shower Observatory (LHAASO). Abundant event statistics, combined with the simultaneous detection of electrons/photons, muons, and Cherenkov light in air showers, enable spectroscopic measurements with statistical and systematic precision comparable to satellite data at lower energies. The proton spectrum shows significant hardening relative to low-energy extrapolations, culminating at 3 PeV, followed by sharp softening. This distinct spectral structure closely aligned with the knee in the all-particle spectrum points to the emergence of a new CR component at PeV energies that might be linked to the dozens of PeVatrons recently discovered by LHAASO, and offers crucial clues to the origin of Galactic cosmic rays.",
      "pdf_url": "https://arxiv.org/pdf/2505.14447.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ex"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.05737",
      "title": "Search for Lorentz Invariance Violation with spectral lags of GRB 190114C using profile likelihood",
      "authors": [
        "Vyaas Ramakrishnan",
        "Shantanu Desai"
      ],
      "abstract": "Search for Lorentz Invariance Violation with spectral lags of GRB 190114C using profile likelihood Vyaas Ramakrishnan, Shantanu Desai 14 pages, 4 figures. Accepted in Int J. of Modern Physics D High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We search for Lorentz invariance violation (LIV) using the spectral lag data for GRB 190114C using frequentist analysis, where we deal with the astrophysical nuisance parameters using profile likelihood. For this use case, we find a global minima for the $\\chi^2$ as a function of energy scale of LIV ($E_{QG}$), well below the Planck scale. The best-fit $2\\sigma$ central intervals for $E_{QG}$ are given by $2.81^{+0.96}_{-0.72}\\times 10^{14}$ GeV and $9.10^{+2.59}_{-0.64}\\times 10^{5}$ for linear and quadratic LIV, respectively and agree with the Bayesian estimates hitherto obtained in a previous work. Therefore, the results from frequentist analysis GRB 190114C agrees with Bayesian analysis and presents yet another proof of principles applications of profile likelihood in the search for LIV.",
      "pdf_url": "https://arxiv.org/pdf/2506.05737.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12291",
      "title": "NICER Magnetar Burst Catalog",
      "authors": [
        "Che-Yen Chu",
        "Chin-Ping Hu",
        "Teruaki Enoto",
        "George A. Younes",
        "Andrea Sanna",
        "Sebastien Guillot",
        "Rachael Stewart",
        "Zaven Arzoumanian",
        "Matthew G. Baring",
        "Marlon L. Bause",
        "Tolga Güver",
        "Wynn C. G. Ho",
        "Chryssa Kouveliotou",
        "Alex Van Kooten",
        "Zorawar Wadiasingh",
        "Keith C. Gendreau"
      ],
      "abstract": "Che-Yen Chu, Chin-Ping Hu, Teruaki Enoto, George A. Younes, Andrea Sanna, Sebastien Guillot, Rachael Stewart, Zaven Arzoumanian, Matthew G. Baring, Marlon L. Bause, Tolga Güver, Wynn C. G. Ho, Chryssa Kouveliotou, Alex Van Kooten, Zorawar Wadiasingh, Keith C. Gendreau 12 pages of main body, 5 pages of appendix tables, 10 figures, submitted to ApJS High Energy Astrophysical Phenomena (astro-ph.HE) In this paper, we present a comprehensive catalog of short bursts from magnetars based on eight years of NICER observations. A total of 1130 bursts were identified, making this the largest magnetar burst catalog to date. The sample is dominated by SGR 1935+2154, which contributes 76% of all detected bursts. We analyzed burst durations, spectral properties, and their correlations across multiple sources. Bursts from SGR 1935+2154 exhibit significantly longer durations, with a mean of 317 ms, compared to a mean of 23 ms for bursts from other magnetars. Two microsecond-scale bursts were detected for the first time, originating from 1E 1048.1-5937 and CXOU J010043.1-721134. Spectral analysis in the 0.5--8 keV range using both blackbody and power-law models shows that bursts with higher fluences have harder spectra. In contrast, correlations between burst duration and spectral parameters are weak or absent. This catalog provides a valuable dataset for studying magnetar short bursts, enabling future modeling efforts and improving our understanding of the diversity and physical mechanisms of magnetar bursts.",
      "pdf_url": "https://arxiv.org/pdf/2512.12291.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21240",
      "title": "Minijets and Broken Stationarity in a Blazar : Novel Insights into the Origin of $γ$-ray Variability in CTA 102",
      "authors": [
        "Agniva Roychowdhury"
      ],
      "abstract": "Minijets and Broken Stationarity in a Blazar : Novel Insights into the Origin of $γ$-ray Variability in CTA 102 Agniva Roychowdhury 8 pages, 8 figures. Accepted for publication in The Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) High-energy blazar light curves, in X-rays and beyond, have historically preferred a log-normal flux distribution, signifying multiplicative processes either in the jet itself or due to connection(s) with accretion. Here we present 18 year archival Fermi-LAT light curves (0.1-100 GeV) of the flat spectrum radio quasar (FSRQ) CTA 102 from August 2008 to November 2025, which underwent a huge flare in 2017, with a $\\sim$ factor of 100 jump in $\\gamma$-ray flux, along with similar flaring in X-rays. Our statistical analyses confirm that neither the pre nor the post-flare total GeV light curves follow a strictly log-normal distribution. Instead, we observe a statistically significant reduction in skewness from the pre to the post-flare light curves, which implies the blazar transitioned from an energetic state with frequent flaring to a more plateaued state with occasional flaring. We further find that this state transition can be explained through magnetic relaxation, where many reconnection events caused the 2017 flare, after which the magnetic field was ordered and its energy reached a minimum. To explain this further, we use a Monte Carlo simulation of a modified minijets-in-a-jet model where GeV flares are produced only when a maximum number of minijets move toward the broad line region and towards the line of sight, in the context of an external Compton model. The flux distributions (both observed and simulated) could be fit by a modified log-normal power-law distribution, implying our minijets model can reproduce the GeV flares in CTA 102 as well as their flux distributions.",
      "pdf_url": "https://arxiv.org/pdf/2512.21240.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.10060",
      "title": "High-energy astrochemistry in the molecular interstellar medium",
      "authors": [
        "Brandt A. L. Gaches",
        "Serena Viti"
      ],
      "abstract": "High-energy astrochemistry in the molecular interstellar medium Brandt A. L. Gaches, Serena Viti Accepted by ACS Earth and Space Chemistry (Eric Herbst Festschrift) Astrophysics of Galaxies (astro-ph.GA); Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE) In the past decade, there has been a significant shift in astrochemistry with a renewed focus on the role of non-thermal processes on the molecular interstellar medium, in particular energetic particles (such as cosmic ray particles and fast electrons) and X-ray radiation. This has been brought about in large part due to new observations of interstellar complex organic molecules (iCOMS) in environments that would inhibit their formation, such as cold, dense gas in prestellar cores or in the highly energetic environments in galactic centers. In parallel, there has been a plethora of new laboratory investigations on the role of high-energy radiation and electrons on the chemistry of astrophysical ices, demonstrating the ability of this radiation to induce complex chemistry. In recent years, theoretical models have also begun to include newer cosmic-ray-driven processes in both the gas and ice phases. In this review, we unify aspects of the chemistry driven by X-ray radiation and energetic particles into a ``high-energy astrochemistry'', defining this term and reviewing the underlying chemical processes. We conclude by examining various laboratories where high-energy astrochemistry is at play and identify future issues to be tackled.",
      "pdf_url": "https://arxiv.org/pdf/2512.10060.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.EP",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21376",
      "title": "A Velocity Coupled Radial Acceleration Ansatz for Disk-Galaxy Rotation Curves: Fits to SPARC, Bayesian Inference, and Parameter Identifiability",
      "authors": [
        "Nalin Dhiman"
      ],
      "abstract": "A Velocity Coupled Radial Acceleration Ansatz for Disk-Galaxy Rotation Curves: Fits to SPARC, Bayesian Inference, and Parameter Identifiability Nalin Dhiman Astrophysics of Galaxies (astro-ph.GA); Computational Physics (physics.comp-ph) Observed rotation curves of disk galaxies remain a sharp empirical probe of the relationship between baryons and dynamics. We study a minimal, explicitly \\emph{phenomenological} alternative to standard halo parameterizations: an additional inward \\emph{radial} acceleration proportional to the local \\emph{tangential} speed, $a_{\\vca}(r)=\\gamma(r)\\,v(r)$, with a saturating coupling $\\gamma(r)=\\vinf/(r+\\rzero)$. Combining this ansatz with the circular-motion condition yields a quadratic equation for $v(r)$ with a closed-form physical this http URL fit this ``velocity-coupled acceleration'' (\\vca) model to $N_\\mathrm{gal}=171$ rotation curves from the SPARC sample using the published baryonic decompositions (gas, disk, bulge), and we compare to two commonly used two-parameter halo models (NFW and Burkert) using an identical optimization pipeline and error this http URL a fiducial systematic error floor $\\sigma_0=5~\\mathrm{km\\,s^{-1}}$, the \\vca model is typically competitive with an NFW halo and performs comparably (though not uniformly better) than a Burkert halo in information-criterion this http URL further perform MCMC inference for \\vca parameters, quantify posterior predictive coverage, and show that parameter posteriors exhibit a strong $\\vinf$--$\\rzero$ degeneracy for many galaxies; only $47/171$ galaxies yield well-identified posteriors under simple width-based criteria. We also perform a simple radial holdout cross-validation (outer 30\\% of radii) and find predictive RMSE comparable to NFW and Burkert under this this http URL..",
      "pdf_url": "https://arxiv.org/pdf/2512.21376.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21632",
      "title": "Can A Kinematically Hot and Thick Disk Form A Bar? : Role of Highly Spinning Dark Matter Halos",
      "authors": [
        "Sandeep Kumar Kataria"
      ],
      "abstract": "Can A Kinematically Hot and Thick Disk Form A Bar? : Role of Highly Spinning Dark Matter Halos Sandeep Kumar Kataria 7 pages, 6 figure, submitted to ApJ, comments are welcome Astrophysics of Galaxies (astro-ph.GA) Recent JWST observations claim the existence of a significant fraction of bars in the kinematically hotter and thicker disk at high redshift Universe. These observations challenge the current understanding of disk stability in galaxies similar to the Milky Way. The analytical work and N-body simulations suggest that the kinematically hot (dispersion-dominated) and thick disk are stable against bar formation. In this work, we perform the controlled N-body simulations of a kinematically hot and thick disk, which is residing in a non-rotating and spinning dark matter halo. We report that the disk, which is classically stable against bar instability in the live and non-rotating halo, leads to bar formation in a spinning halo environment. The spinning halo model is 8 times more efficient in transporting angular momentum from the disk to the halo compared to the non-spinning halo. We claim that Ostriker-Peebles and ELN bar formation criteria do not predict bar formation for both the non-roating and spinning halo. The recent criteria from Jang-Kim successfully predict the bar stability for the non-rotating halo model, but not for the spinning halo model. These results provide an important insight into the bar formation processes for thick and hot disks at high redshift.",
      "pdf_url": "https://arxiv.org/pdf/2512.21632.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21674",
      "title": "A systematic study on the aromatic and aliphatic hydrocarbon emission features of nearby galaxies using AKARI near-IR spectra",
      "authors": [
        "Tsubasa Kondo",
        "Hidehiro Kaneda",
        "Shinki Oyabu",
        "Takuma Kokusho",
        "Toyoaki Suzuki",
        "Risako Katayama",
        "Eiko Kozaki",
        "Itsuka Yachi",
        "Keita Yoshida",
        "Shohei Ono"
      ],
      "abstract": "A systematic study on the aromatic and aliphatic hydrocarbon emission features of nearby galaxies using AKARI near-IR spectra Tsubasa Kondo, Hidehiro Kaneda, Shinki Oyabu, Takuma Kokusho, Toyoaki Suzuki, Risako Katayama, Eiko Kozaki, Itsuka Yachi, Keita Yoshida, Shohei Ono 14 pages, 13 figures, accepted for publication in PASJ Astrophysics of Galaxies (astro-ph.GA) Interstellar hydrocarbon dust containing aromatic and aliphatic hydrocarbons, like polycyclic aromatic hydrocarbons (PAHs), is believed to be processed by various factors including UV radiation fields and mechanical shocks in the galactic environments. We systematically investigate the processing of hydrocarbon dust, especially the likely causes for the variations of the luminosity ratio of aliphatic to aromatic hydrocarbon emission features, using the near-infrared (IR) spectral features at wavelengths 3.3 um and 3.4-3.6 um observed with AKARI/IRC. We analyzed 243 near-IR spectra of 240 star-forming (U)LIRGs (the total IR luminosity, $L_\\rm{IR}>10^{11}\\ L_\\odot$), 119 spectra of 105 star-forming IRGs ($10^{10}\\ L_\\odot<L_\\rm{IR}<10^{11}\\ L_\\odot$), and 94 spectra of 65 sub-IRGs ($L_\\rm{IR}<10^{10}\\ L_\\odot$), in addition to 232 spectra of 36 Galactic HII regions as a reference sample. We performed near-IR spectral model fitting to estimate the luminosities of the aromatic and aliphatic hydrocarbon features and the HI recombination line Br$\\rm{\\alpha}$. The result indicates that the luminosity ratios of the aliphatic to the aromatic hydrocarbons ($L_\\rm{ali}/L_\\rm{aro}$) in the sample galaxies show considerably large variations, compared to those in the Galactic HII regions, $L_\\rm{ali}/L_\\rm{aro}$ systematically decreasing with $L_\\rm{IR}$ and $L_\\rm{Br\\alpha}$. We find that (sub-)IRGs with continuum colors bluer at 4 um tend to have higher $L_\\rm{ali}/L_\\rm{aro}$, which is likely to reflect the intrinsic nature of PAHs outside the HII region where the PAHs remain non-processed by strong UV radiation fields. We also find that some ULIRGs with continuum colors redder at 4 um show extremely low $L_\\rm{ali}/L_\\rm{aro}$, which is likely to be caused by blending aliphatic emission and absorption features due to the presence of an obscured galactic nucleus in merger systems.",
      "pdf_url": "https://arxiv.org/pdf/2512.21674.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21780",
      "title": "The rotation curve of the Milky Way measured by Classical Cepheids from Gaia DR3",
      "authors": [
        "Qikang Feng",
        "Yang Huang",
        "Huawei Zhang",
        "Jifeng Liu"
      ],
      "abstract": "The rotation curve of the Milky Way measured by Classical Cepheids from Gaia DR3 Qikang Feng, Yang Huang, Huawei Zhang, Jifeng Liu 10 pages, 8 figures, 1 table; Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We determine the rotation curve (RC) of the Milky Way in the range 6 < R < 18 kpc using a sample of 903 carefully selected classical Cepheids with precise proper motions and high-quality radial velocities from \\emph{Gaia} DR3. Their distances can be accurately measured from the well-known Period-Wesenheit relations. The RC is computed from the three-dimensional velocity components of these Cepheids. Generally, the RC shows a slight decline with distance from the Galactic center. On top of this general trend, the newly constructed RC shows a dip around R ~ 10-11 kpc, followed by a bump around R ~ 13-14 kpc. This feature has also been reported in other RC measurements, mostly in RCs traced by young tracers like Cepheids. To better constrain the Milky Way mass, an averaged RC is then constructed by combining measurements from this work and previous efforts. Due to the ambiguous nature of the dip-and-bump feature, this averaged RC is constructed only within the radial range where the RC appears to be less influenced by this feature. By using this averaged RC, we determine the circular velocity at solar position and also build a parameterized mass model of our Milky Way. The result for the circular velocity at the solar position is $V_c(R_0) = 236.8 \\pm 0.8\\ \\mathrm{km\\,s^{-1}}$, which is in good agreement with previous measurements. The local dark matter density and the enclosed dark matter halo mass within 18 kpc are estimated from the averaged RC under different baryonic models, yielding a series of consistent results: a local density of $0.33-0.40\\ \\mathrm{GeV\\,cm^{-3}}$ and an enclosed mass of $1.19-1.45 \\times 10^{11}\\ M_\\odot$.",
      "pdf_url": "https://arxiv.org/pdf/2512.21780.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21927",
      "title": "A large, long-lived, slowly-expanding superbubble across the Perseus Arm",
      "authors": [
        "Bingqiu Chen",
        "Guangxing Li",
        "Haibo Yuan",
        "Maosheng Xiang",
        "Jixuan Zhou",
        "Pinjian Chen",
        "Martin Krause",
        "Ashley Coombs"
      ],
      "abstract": "A large, long-lived, slowly-expanding superbubble across the Perseus Arm Bingqiu Chen, Guangxing Li, Haibo Yuan, Maosheng Xiang, Jixuan Zhou, Pinjian Chen, Martin Krause, Ashley Coombs Published in Nature Communications Nature Communications volume 16, Article number: 10558 (2025) Astrophysics of Galaxies (astro-ph.GA) Stellar feedback is a crucial mechanism in galactic evolution, as demonstrated by the widespread bubbles observed with JWST. In this study, we combine data from Gaia and LAMOST to obtain a sample of young O-B2 stars with full three-dimensional velocity information. Focusing on the largest known superbubble in the Milky Way, we identify groups of O-B2 stars at its periphery, exhibiting a transverse velocity of 25.8 km/s and an expansion velocity of 6.2 km/s. Using these velocities, we calculate a crossing time t_cross ~ 20 Myr and an expansion timescale t_expansion ~ 80 Myr. We estimate a survival timescale t_survival ~ 250 Myr and a supernova interval t_SN ~ 0.1 Myr. Together with the Galactic shear timescale t_shear ~ 30 Myr, these values satisfy t_SN < t_shear < t_survival. The energy and momentum from supernovae are sufficient to sustain the bubble's growth against ambient pressure. This indicates that repeated supernovae replenish energy faster than shear and turbulent distort the cavity. Our analysis classifies the Giant Oval Cavity as a large, quasi-stationary superbubble, similar to the Phantom Bubble observed by JWST, stabilised by the interplay between stellar feedback and Galactic disk dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2512.21927.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21454",
      "title": "Early Planet Formation in Embedded Disks (eDisk). XIX. Structures of molecular outflows",
      "authors": [
        "Anton Feeney-Johansson",
        "Yuri Aikawa",
        "Shigehisa Takakuwa",
        "Nagayoshi Ohashi",
        "Adele Plunkett",
        "Jes K. Jorgensen",
        "Hsien Shang",
        "Zhi-Yun Li",
        "Rajeeb Sharma",
        "Woojin Kwon",
        "Jeong-Eun Lee",
        "Leslie W. Looney",
        "Yao-Lun Yang",
        "Mayank Narang",
        "Itziar de Gregorio-Monsalvo",
        "eDisk team"
      ],
      "abstract": "Early Planet Formation in Embedded Disks (eDisk). XIX. Structures of molecular outflows Anton Feeney-Johansson, Yuri Aikawa, Shigehisa Takakuwa, Nagayoshi Ohashi, Adele Plunkett, Jes K. Jorgensen, Hsien Shang, Zhi-Yun Li, Rajeeb Sharma, Woojin Kwon, Jeong-Eun Lee, Leslie W. Looney, Yao-Lun Yang, Mayank Narang, Itziar de Gregorio-Monsalvo, eDisk team Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) As part of the ALMA Large Program \"Early Planet Formation in Embedded Disks\" (eDisk), 12CO (2 - 1) was observed towards 19 nearby low-mass protostars. Of these objects, 15 sources are found to show molecular outflow emission. Based on their morphological and kinematical structures, the CO outflows are classified into three types: a wind-driven shell, where ambient material is swept up by a wide-angle wind from the star, a bow shock, and a slow disk wind, which is a conical or parabolic flow with onion-like velocity structure. We categorize 11 outflows as a slow disk wind, 7 as a wind-driven shell, and 1 as a bow shock. Four of these outflows were found to show signs of both slow disk wind and wind-driven shell characteristics. Five objects show misalignment between the red- and blue-shifted outflows. Seven objects show significant misalignment between the outflow axis (either or both of the red- and blue-shifted outflows) and the minor axis of the dust continuum emission around the protostar. For the objects showing wind-driven shell emission, we compare simple parametrized models with the observations to derive physical properties of the observed shells, such as their dynamical ages. This shows evidence of a time variability in the outflows, such as changes in their direction. In some objects, large differences are seen between the properties of the red- and blue-shifted outflows, possibly indicating differences in the properties of the ambient medium with which the outflow interacts.",
      "pdf_url": "https://arxiv.org/pdf/2512.21454.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21969",
      "title": "From emission to absorption: the FAST observation of the OH 18-cm lines from the Comet C2025/A6",
      "authors": [
        "Dongyue Jiang",
        "Lei Qian",
        "Minglei Guo",
        "Qiaoli Hao",
        "Menglin Huang",
        "Peng Jiang",
        "Hongfei Liu",
        "Chun Sun",
        "Xingyi Wang",
        "Qingliang Yang",
        "Naiping Yu",
        "Lei Zhao",
        "Yutao Zhao",
        "Liyun Zhang",
        "Yichi Zhang",
        "Tongjie Zhang",
        "Zhichen Pan"
      ],
      "abstract": "From emission to absorption: the FAST observation of the OH 18-cm lines from the Comet C2025/A6 Dongyue Jiang, Lei Qian, Minglei Guo, Qiaoli Hao, Menglin Huang, Peng Jiang, Hongfei Liu, Chun Sun, Xingyi Wang, Qingliang Yang, Naiping Yu, Lei Zhao, Yutao Zhao, Liyun Zhang, Yichi Zhang, Tongjie Zhang, Zhichen Pan Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We observed comet C/2025 A6 with FAST telescope equipped with the ultra-wideband receiver from 23$^{\\rm rd}$ October to 8$^{\\rm th}$ November 2025 and detected the OH 18-cm lines for the first time. The OH lines underwent a reversal from emission to absorption from 23$^{\\rm rd}$ October to 5$^{\\rm th}$ November, which is mainly caused by variations in the heliocentric velocity. Through trapezoidal fitting of the OH line profiles, we derive expansion velocities of the water that rise as the heliocentric distance decreases. Based on these results, we estimated the OH production rates of C/2025 A6 for 23$^{\\rm rd}$ October, 26$^{\\rm th}$ October, 4$^{\\rm th}$ November, and 5$^{\\rm th}$ November and it presents a significant upward trend.",
      "pdf_url": "https://arxiv.org/pdf/2512.21969.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.22902",
      "title": "HI Content of Group Galaxies from the FAST All Sky HI Survey",
      "authors": [
        "Shulan Yan",
        "Andrew Ma",
        "Qingzheng Yu",
        "Taotao Fang",
        "Chuan He",
        "Ming Zhu"
      ],
      "abstract": "HI Content of Group Galaxies from the FAST All Sky HI Survey Shulan Yan, Andrew Ma, Qingzheng Yu, Taotao Fang, Chuan He, Ming Zhu 13 pages,8 figures,accepted by ApJ Astrophysics of Galaxies (astro-ph.GA) We investigate the atomic gas (HI) content of galaxies in groups using early data from the FAST All Sky HI survey (FASHI). Taking advantage of FAST's blind, wide-area coverage and uniform sensitivity, we assemble a sample of $230$ group galaxies belonging to $182$ groups at $z\\leq0.03$. These groups were identified using a halo-based group finder, and they have an median membership of $4$ galaxies. We also derived a matched control sample of isolated systems, and apply censored-data modeling to include both detections and non-detections. At fixed stellar mass and color, we find that the global median HI fraction of group galaxies differs from that of controls by only $-0.04$ dex ($95\\%$ CI [$-0.18,\\ 0.16$]), indicating at most a mild average offset. The signal is not uniform across populations: satellites are HI-poor (median $\\Delta f_{\\mathrm{HI}}=-0.12$ dex), whereas centrals are not HI-deficient (median $\\Delta f_{\\mathrm{HI}}=0.13$ dex). Group galaxies located within $0.5R_{180}$ and in denser systems (richness $>10$ or local density $\\Sigma>10\\ \\mathrm{gal\\ Mpc^{-2}}$) show stronger negative offsets, whereas galaxies in the outskirts are statistically indistinguishable from the controls. These results refine earlier reports of global group HI deficiency: with deeper blind data and uniform treatment of upper limits, we show that HI depletion is primarily confined to satellites and compact cores rather than being ubiquitous across groups.",
      "pdf_url": "https://arxiv.org/pdf/2510.22902.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21688",
      "title": "The Effect of Magnetic Field Dissipation in the Inner Heliosheath: Reconciling Global Heliosphere Model and Voyager Data",
      "authors": [
        "Sergey D. Korolkov",
        "Igor I. Baliukin",
        "Merav Opher"
      ],
      "abstract": "The Effect of Magnetic Field Dissipation in the Inner Heliosheath: Reconciling Global Heliosphere Model and Voyager Data Sergey D. Korolkov, Igor I. Baliukin, Merav Opher Solar and Stellar Astrophysics (astro-ph.SR) Global ideal magnetohydrodynamic models of the heliosphere typically predict a greatly exaggerated magnetic field pile-up in the inner heliosheath (IHS), the region between the termination shock and heliopause. However, Voyager 1 and 2 observations show only a gradual increase throughout this region. This mismatch is largely attributed to the simplified assumption of a unipolar solar magnetic field in many global models, which neglects the complex, folded structure of the heliospheric current sheet (HCS). The IHS, especially at low heliolatitudes, contains these compressed sector boundaries, widely considered prime locations for magnetic dissipation via reconnection. To align global model simulations with observations without incurring the prohibitive computational cost of resolving the kinetic-scale current sheet, this work introduces a phenomenological term into the magnetic field induction equation. This term captures the macroscopic effect of magnetic energy dissipation due to unresolved HCS dynamics. It is designed to mitigate the artificial magnetic pile-up, preserve the topological integrity of the magnetic field lines, and avoid explicit magnetic diffusion. This study demonstrates that incorporating a phenomenological dissipation term into global heliospheric models helps to resolve the longstanding discrepancy between simulated and observed magnetic field profiles in the IHS. The proposed mechanism reduces exaggerated magnetic energy (converts it into thermal energy), aligns model output with Voyager measurements of both magnetic field and proton density, and produces the outward shift in termination shock position and a reduction of the IHS thickness. We found that the characteristic time for magnetic field dissipation of about 6 years provides improved agreement with Voyager data in the IHS.",
      "pdf_url": "https://arxiv.org/pdf/2512.21688.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21846",
      "title": "Comprehensive study of solar type II radio bursts and the properties of the associated shock waves",
      "authors": [
        "K. Bhandari",
        "D. E. Morosan",
        "S. Normo"
      ],
      "abstract": "Comprehensive study of solar type II radio bursts and the properties of the associated shock waves K. Bhandari, D. E. Morosan, S. Normo 13 pages (9 page main body, 4 page appendix), 13 figures Solar and Stellar Astrophysics (astro-ph.SR) Type II radio bursts are solar radio emissions generated by electrons accelerated by coronal shocks. These bursts are typically found close to expanding coronal mass ejections (CMEs), making them valuable for studying the properties and dynamics of CME-driven shocks in the solar corona. Here, we aim to determine the regions in the solar corona where shock waves accelerate electrons and determine their characteristic properties. To do this, we combine radio observations of type II solar radio bursts with magneto-hydrodynamic (MHD) simulations of the solar corona. We analyse ten type II radio bursts from Solar Cycle 25 exhibiting emissions. The novelty of this study lies in using radio imaging data for all type II bursts to examine the positions of the radio sources. The radio source positions, combined with a geometrical fitting of the CME shock and the MHD simulations, are used to determine essential shock parameters at the acceleration region, such as the Alfvén Mach number $(M_{\\rm A}$ and $\\theta_{\\rm BN}$. The shock parameters are then combined with the properties of the radio emission and the associated eruption in a comprehensive study. We found that for all events, the type II bursts are located near or inside coronal streamers. The estimated shock speeds are high, resulting in the formation of super-critical shocks $(3.6~\\leq~M_{\\rm A}~\\leq~6.4$) at the type II locations. In most events, type II bursts are located at oblique shocks rather than near-perpendicular geometries, suggesting that the shock structure is more complex at local scales than the simple spherical shock models usually applied to CME shocks. Our results suggest that CME-streamer interaction regions are necessary for the generation of type II bursts, as they provide ideal plasma conditions for the formation of super-critical shocks and the subsequent acceleration of electrons.",
      "pdf_url": "https://arxiv.org/pdf/2512.21846.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21872",
      "title": "Compact Ca II K Brightenings Precede Solar Flares: A Dunn Solar Telescope Pilot Study",
      "authors": [
        "Aman Priyadarshi M. Kumar",
        "Juie Shetye",
        "Sean G. Sellers",
        "Damian J. Christian"
      ],
      "abstract": "Compact Ca II K Brightenings Precede Solar Flares: A Dunn Solar Telescope Pilot Study Aman Priyadarshi M. Kumar, Juie Shetye, Sean G. Sellers, Damian J. Christian Solar and Stellar Astrophysics (astro-ph.SR) We present a uniform analysis of compact Ca II K (3934 Å) brightenings that occur near flare kernels and assess their value as short-lead indicators of solar flare onset. Using high-cadence imaging from the Rapid Oscillations in the Solar Atmosphere (ROSA) instrument at the Dunn Solar Telescope (DST), we examine eight flare sequences (seven C-class and one B-class) obtained between 2021 and 2025. Fixed, detector-coordinate regions of interest are used to generate mean-intensity light curves, which are detrended and smoothed to isolate impulsive brightenings. In every event, a compact Ca II K brightening is detected within or adjacent to the flaring region that peaks 10--45 min before the primary kernel and the corresponding rise in GOES 1--8 Å flux. The measured temporal offsets scale with the deprojected separation between the brightening and flare kernels, implying an apparent propagation speed of $\\sim$30--35 km s$^{-1}$ that is consistent with chromospheric reconnection. Complementary Spectropolarimeter for Infrared and Optical Regions (SPINOR) spectropolarimetry for one event shows topological reconfiguration from closed to open or extended connectivity, supporting a reconnection-driven origin. These results demonstrate that compact Ca II K brightenings are reproducible, physically meaningful precursors to flare onset. Their simplicity and cadence make them attractive chromospheric indicators, and future work will evaluate their predictive skill alongside established UV/EUV and magnetic diagnostics.",
      "pdf_url": "https://arxiv.org/pdf/2512.21872.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22003",
      "title": "Cosmic-Ray-Constrained LSTM Model for Geomagnetic Storm Prediction",
      "authors": [
        "Zongyuan Ge",
        "Chenwaner Zhang",
        "Wei Zhou",
        "Hongyu Zeng",
        "Guiping Zhou"
      ],
      "abstract": "Cosmic-Ray-Constrained LSTM Model for Geomagnetic Storm Prediction Zongyuan Ge, Chenwaner Zhang, Wei Zhou, Hongyu Zeng, Guiping Zhou Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) Geomagnetic storms (GSTs) driven by solar wind-magnetosphere coupling can severely disrupt technological systems, motivating the need for improved prediction accuracy and longer warning times. In this study, we develop a physics-informed Long Short-Term Memory (LSTM) model that incorporates cosmic-ray flux modulation as an additional precursor signal. As coronal mass ejection (CME)-driven disturbances propagate through the heliosphere, enhanced turbulence and magnetic-field compression reduce galactic cosmic-ray (GCR) flux measured by ground-based neutron monitors (Forbush decreases), providing early information that can precede near-Earth solar-wind signatures by 1--3 days. We integrate multi-source space-weather data, spanning 1995-2020, including cosmic-ray observations, solar wind plasma parameters, interplanetary magnetic-field data, and geomagnetic indices. Based on these data, we construct a 19-dimensional feature vector that includes flux background levels, decrease-related indicators, and inter-station correlation measures as model inputs. Employing a 50-unit LSTM architecture, the proposed model achieves root-mean-square errors (RMSE) of 5.106 nT, 8.315 nT, 10.854 nT, 12.883 nT, and 14.788 nT for 2-, 6-, 12-, 24-, and 48-hour predictions, respectively. Incorporating cosmic-ray information further improves 48-hour forecast skill by up to 25.84% (from 0.178 to 0.224). These results demonstrate the value of physics-informed deep learning and cosmic-ray precursors for advancing space-weather forecasting.",
      "pdf_url": "https://arxiv.org/pdf/2512.22003.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21357",
      "title": "Habitability of exoplanets orbiting flaring stars",
      "authors": [
        "Rebecca Szabó , Valentin D. Ivanov , M. Švanda Astronomický ústav Univerzity Karlovy, Czech Republic, European Southern Observatory, Germany)"
      ],
      "abstract": "Habitability of exoplanets orbiting flaring stars Rebecca Szabó (1), Valentin D. Ivanov (2), M. Švanda (1) ((1) Astronomický ústav Univerzity Karlovy, Czech Republic, (2) European Southern Observatory, Germany) This contribution was submitted as a White Paper for the ESO Expanding Horizon initiative. Details of the call here this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) As of late 2025 there are about 70 exoplanets that meet the formal criterion of having equilibrium temperatures allowing the presence of liquid water and about 50 of them orbit M-stars, known for their strong chromospheric activity. Most of these stars are close to the Sun and the planet-to-star mass and luminosity ratios are advantageous, allowing for a more detailed follow-up than of planets orbiting hotter and more massive stars. Many more planets orbiting late-type stars are expected to be discovered by Gaia and PLATO in the following years. However, the lingering question remains whether the UV and X-ray emission, associated with the stellar activity, allows for complex life. A comprehensive study focused on properties of flaring exoplanet hosts and their activity, on a much larger scale than these few tens (soon to become hundreds) of stars with habitable planets is called for, to answer the question if such stars can harbor habitable planets. The proposed Wide Field Survey telescope is well suited for this study.",
      "pdf_url": "https://arxiv.org/pdf/2512.21357.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22061",
      "title": "Small-scale turbulent dynamo for low-Prandtl number fluid: comparison of the theory with results of numerical simulations",
      "authors": [
        "A.V. Kopyev",
        "A.S. Il'yn",
        "V.A. Sirota",
        "K.P. Zybin"
      ],
      "abstract": "Small-scale turbulent dynamo for low-Prandtl number fluid: comparison of the theory with results of numerical simulations A.V. Kopyev, A.S. Il'yn, V.A. Sirota, K.P. Zybin Fluid Dynamics (physics.flu-dyn); Solar and Stellar Astrophysics (astro-ph.SR) Context: During the last decades, significant progress has been made in both numerical simulations of turbulent dynamo and theoretical understanding of turbulence. However, there is still lack of quantitative comparison between the simulations and the theory of the dynamo. Results: We study the critical magnetic Reynolds number ($Rm_c$) and the growth rate near the threshold both in the limit of very high and in the case of moderate Reynolds numbers. We argue that in Kazantsev equation for magnetic field generation, one should use the quasi-Lagrangian correlator of velocities instead of Eulerian, as usually implied when comparing theory and simulations. The theoretical results obtained with this correlator agree well with numerical results. We also propose the explanation of the decrease of $Rm_c$ as a function of Reynolds number ($Re$) at intermediate-high $Re$. It is probably due to Reynolds-dependent intermittency of the velocity structure function: we show that the scaling exponent of this function in the inertial range affects strongly the magnetic field generation, and it is known to be an increasing function of the Reynolds number. Conclusions: Use of quasi-Lagrangian correlator in the Kazantsev theory gives good accordance with numerical simulations. An ideal way to compare them should be to find the correlator substituted to the Kazantsev equation and the generation properties in the same simulation. At least one has to use universal parameters independent of the properties of pumping scale. Reynolds-dependent intermittency can explain recently observed decrease of the critical magnetic Reynolds number at small Prandtl numbers.",
      "pdf_url": "https://arxiv.org/pdf/2512.22061.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23959",
      "title": "Probing the large-scale magnetic field inside the Sun from three decades of observed surface magnetograms",
      "authors": [
        "Soumyadeep Chatterjee",
        "Gopal Hazra"
      ],
      "abstract": "Probing the large-scale magnetic field inside the Sun from three decades of observed surface magnetograms Soumyadeep Chatterjee, Gopal Hazra 16 pages, 10 figures. Accepted for publication in ApJL. Comments are welcome Solar and Stellar Astrophysics (astro-ph.SR) Space-weather and disturbances in the heliosphere are manifestations of the solar magnetic field, which is solely driven by the interior dynamo, and constraining the solar interior magnetic field and its oscillatory behavior is one of the major challenges in solar physics. Observationally, none of the techniques, including helioseismology, are able to provide an estimation of the interior magnetic field. We reconstruct, for the first time, the dynamics of the interior large-scale magnetic fields by assimilating observed line-of-sight photospheric magnetogram data from MDI/SOHO & HMI/SDO along with helioseismic differential rotation data over three decades (1996-2025) into a 3D Babcock-Leighton dynamo model. The assimilation of observational magnetogram data allows us in realistic modelling of Babcock-Leighton mechanism as observed on the Sun without any simplified parameterization. As a result, our data-driven model successfully reproduces key observational features such as the surface butterfly diagram, accurate polar field evolution, and axial dipole moment. The reconstructed interior field dominated by toroidal component exhibits an equatorward migration and reproduces the realistic amplitude and modulation of cycles 23-25. We observe that the non-axisymmetric behaviour of the interior toroidal field becomes less prominent as we move deep towards the tachocline according to our model. A strong correlation between the simulated toroidal field and sunspot number establishes our 3D magnetogram-driven model as a robust predictive model of the solar cycle.",
      "pdf_url": "https://arxiv.org/pdf/2509.23959.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.11615",
      "title": "Towards sub-milliarcsecond astrometric precision using seeing-limited imaging",
      "authors": [
        "Noam Segev",
        "Eran O. Ofek",
        "Yossi Shvartzvald",
        "Krzysztof A. Rybicki",
        "Chung-Uk Lee",
        "Dong-Jin Kim",
        "Jennifer C. Yee",
        "Michael D. Albrow",
        "Sun-Ju Chung",
        "Andrew Gould",
        "Cheongho Han",
        "Kyu-Ha Hwang",
        "Youn Kil Jung",
        "In-Gu Shin",
        "Hongjing Yang",
        "Weicheng Zang",
        "Sang-Mok Cha",
        "Hyoun-Woo Kim",
        "Seung-Lee Kim",
        "Yoon-Hyun Ryu",
        "Dong-Joo Lee",
        "Yongseok Lee",
        "Byeong-Gon Park",
        "Richard W. Pogge"
      ],
      "abstract": "Towards sub-milliarcsecond astrometric precision using seeing-limited imaging Noam Segev, Eran O. Ofek, Yossi Shvartzvald, Krzysztof A. Rybicki, Chung-Uk Lee, Dong-Jin Kim, Jennifer C. Yee, Michael D. Albrow, Sun-Ju Chung, Andrew Gould, Cheongho Han, Kyu-Ha Hwang, Youn Kil Jung, In-Gu Shin, Hongjing Yang, Weicheng Zang, Sang-Mok Cha, Hyoun-Woo Kim, Seung-Lee Kim, Yoon-Hyun Ryu, Dong-Joo Lee, Yongseok Lee, Byeong-Gon Park, Richard W. Pogge 19 pages, 16 figures, 2 tables. Submitted to MNRAS Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) The Earth's atmospheric turbulence degrades the precision of ground-based astrometry. Here, we discuss these limitations and propose that, with proper treatment of systematics and by leveraging the many epochs available from the Korean Microlensing Telescope Network (KMTNet), seeing-limited observations can reach sub-milliarcsecond precision. Such observations may be instrumental for the detection of Galactic black holes via microlensing. We present our methodology and pipeline for precise astrometric measurements using seeing-limited observations. The method is a variant of Gaia's Astrometric Global Iterative Solution (AGIS) that includes several detrending steps. Tests on 6,500 images of the same field, obtained by KMTNet with typical seeing condition of 1 arcsecond and pixel scale of 0.4 arcsecond, suggest that we can achieve, at the bright end (mag<17), per-epoch relative astrometric precision of ~5 and relative proper motion precision of 0.1-0.2 mas/yr over a baseline of approximately five years, using data from the Cerro Tololo Inter-American Observatory (CTIO) site. Time binning on 5--20 day cadences improves the bright-source precision to ~2 mas per coordinate on astrometric microlensing-relevant timescales. The precision is estimated using bootstrap simulations and further validated by comparing results from two independent KMTNet telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2507.11615.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21949",
      "title": "WST spectroscopic variability alerts: discovery space, data flow system requirements",
      "authors": [
        "Valenitn D. Ivanov"
      ],
      "abstract": "WST spectroscopic variability alerts: discovery space, data flow system requirements Valenitn D. Ivanov contributed talk at SS7a \"WST: the Wide-field spectroscopic facility at EAS\", EAS 23-27.062025, Ireland Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) The enormous multiplexity of the WST opens up the possibility to trigger alerts for variable objects - an option that has been reserved so far only for imaging surveys. WST can go further by detecting spectroscopic line profile and line strength variations. I review previous alert-issuing surveys that are limited to imaging, and describe some of the new research possibilities that this feature of the data flow system (DFS) would open up. The latter range from variability of emission line stars, such as Bes, WRs and LBVs to variability of active galaxies and quasars, including the so-called changing look objects that shift between Type 1 and Type 2. Furthermore, I describe the requirements that the WST DFS must meet to make this feasible. The most critical aspect is the rapid data processing for timely follow-up. Next, the alert system is tightly connected with the data reduction and archive, because it will need an extensive and continuously updated spectral reference database. The new spectra will have to be compared against these reference spectra to identify variations. The reference spectra can either be \"native\" from the WST itself or they can originate from other spectroscopic surveys. Two options for the DFS are considered: one is to conduct an automated search of the WST's own archive, and potentially of other spectroscopic archives and a second option is to allow the users to submit reference spectra on their own. The spectroscopic alert system will open up a completely new discovery space that is not accessible to the existing or planned near-future surveys. Finally, I discuss the advantages of moving the variability detection to physical parameters by modeling the observed and reference spectra and comparing the derived fitting parameters. This strategy offers a robust method for alert ranking.",
      "pdf_url": "https://arxiv.org/pdf/2512.21949.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20908",
      "title": "Probabilistic Link Budget Analysis for Low Earth Orbit Satellites in the Optical Regime",
      "authors": [
        "Dhruv Shivkant",
        "Shreyaans Jain",
        "Rohit K Ramakrishnan"
      ],
      "abstract": "Probabilistic Link Budget Analysis for Low Earth Orbit Satellites in the Optical Regime Dhruv Shivkant, Shreyaans Jain, Rohit K Ramakrishnan Instrumentation and Methods for Astrophysics (astro-ph.IM); Atmospheric and Oceanic Physics (physics.ao-ph); Optics (physics.optics) Low Earth Orbit (LEO) optical satellite communication systems face performance challenges due to atmospheric effects such as scintillation, turbulence, wavefront distortion, beam spread, and jitter. This paper presents a comprehensive mathematical model to characterize these effects and their impact on signal propagation. We develop a methodology for dynamically calculating link budgets at any location and time by integrating these models into a probabilistic framework. The approach accounts for spatial and temporal variations in atmospheric conditions, enabling accurate estimation of link loss probabilities. Simulations validate the model's accuracy and applicability to real-world LEO satellite systems. This work offers a robust tool for optimizing link performance and enhancing the reliability of satellite networks, providing valuable insights for system designers and operators.",
      "pdf_url": "https://arxiv.org/pdf/2507.20908.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09386",
      "title": "Feedback-Controlled Beam Pattern Measurement Method Using a Power-Variable Calibration Source for Cosmic Microwave Background Telescopes",
      "authors": [
        "Haruaki Hirose",
        "Masaya Hasegawa",
        "Daisuke Kaneko",
        "Taketo Nagasaki",
        "Ryota Takaku",
        "Tijmen de Haan",
        "Satoru Takakura",
        "Takuro Fujino"
      ],
      "abstract": "Feedback-Controlled Beam Pattern Measurement Method Using a Power-Variable Calibration Source for Cosmic Microwave Background Telescopes Haruaki Hirose, Masaya Hasegawa, Daisuke Kaneko, Taketo Nagasaki, Ryota Takaku, Tijmen de Haan, Satoru Takakura, Takuro Fujino 20 pages, 9 figures, revised after referee review Instrumentation and Methods for Astrophysics (astro-ph.IM) We demonstrate a novel beam pattern measurement method for the side lobe characterization of cosmic microwave background telescopes. The method employs a power-variable artificial microwave source under feedback control from the detector under test on the telescope. It enables us to extend the dynamic range of the beam pattern measurement without introducing nonlinearity effects from the detector. We conducted a laboratory-based proof-of-concept experiment, measuring the H-plane beam pattern of a horn antenna coupled to a diode detector at 81 GHz. We gained an additional dynamic range of 60.3 dB attributed to the feedback control. In addition, we verified the measurement by comparing it with other reference measurements obtained using conventional methods. The method is also applicable to general optical measurements requiring a high dynamic range to detect subtle nonidealities in the characteristics of optical devices.",
      "pdf_url": "https://arxiv.org/pdf/2509.09386.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.14120",
      "title": "Vertically resolved minimal-set k-distribution for thermal infrared absorption: an application to the atmosphere of Venus",
      "authors": [
        "Boris Fomin",
        "Mikhail Razumovskiy"
      ],
      "abstract": "Vertically resolved minimal-set k-distribution for thermal infrared absorption: an application to the atmosphere of Venus Boris Fomin, Mikhail Razumovskiy v2: slightly revised version. Submitted to JQSRT Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The FKDM $k$-distribution technique is applied to parameterize absorption of thermal radiation in the lower and middle atmosphere of Venus, targeting modeling scenarios where the cost of full radiative transfer calculations necessitates efficient parameterizations (e.g. climate modeling). Line-by-line reference modeling based on a Monte Carlo method for radiative transfer is built into the $k$-distribution terms construction process, explicitly controlling accuracy. From 16 bands across $10$--$6000~\\mathrm{cm^{-1}}$, the method produces 32 $k$-terms, band-averaged Planck function values and per-band spectral points for computing Venus cloud optical properties. The FKDM $k$-distribution technique does not require the inter-level correlation assumption common for the correlated $k$-distribution method. We supply height-dependent $k(z)$ functions tabulated on the same vertical grid as the input temperature-pressure profile, designed for direct use in radiative transfer solvers and avoiding additional remapping of the pre-tabulated $k$-data. Our implementation of the technique yielded acceptable accuracy below 90~km ($<1.2~\\mathrm{K\\,day^{-1}}$ for cooling rates; $<2\\%$ for fluxes), while requiring substantially fewer $k$-terms than recent implementations of the correlated-$k$ method. A Fortran driver that generates $k(z)$ functions for an arbitrary Venus atmospheric profile is provided in a public repository.",
      "pdf_url": "https://arxiv.org/pdf/2512.14120.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21470",
      "title": "Elemental abundance pattern and temperature inversion on the dayside of HAT-P-70b observed with CARMENES and PEPSI",
      "authors": [
        "B. Guo",
        "F. Yan",
        "Th. Henning",
        "L. Nortmann",
        "M. Stangret",
        "D. Cont",
        "E. Pallé",
        "D. Shulyak",
        "K. G. Strassmeier",
        "I. Ilyin",
        "F. Lesjak",
        "A. Reiners",
        "S. Liu",
        "K. Molaverdikhani",
        "G. Scandariato",
        "E. Keles",
        "J. A. Caballero",
        "P. J. Amado",
        "A. Quirrenbach",
        "I. Ribas",
        "S. Góngora",
        "A. P. Hatzes",
        "M. López-Puertas",
        "D. Montes",
        "K. Poppenhaeger",
        "E. Schlawin",
        "A. Schweitzer",
        "D. Sicilia"
      ],
      "abstract": "Elemental abundance pattern and temperature inversion on the dayside of HAT-P-70b observed with CARMENES and PEPSI B. Guo, F. Yan, Th. Henning, L. Nortmann, M. Stangret, D. Cont, E. Pallé, D. Shulyak, K. G. Strassmeier, I. Ilyin, F. Lesjak, A. Reiners, S. Liu, K. Molaverdikhani, G. Scandariato, E. Keles, J. A. Caballero, P. J. Amado, A. Quirrenbach, I. Ribas, S. Góngora, A. P. Hatzes, M. López-Puertas, D. Montes, K. Poppenhaeger, E. Schlawin, A. Schweitzer, D. Sicilia 18 pages, 15 figures. Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) Ground-based high-resolution spectroscopy has identified various chemical species in the atmospheres of ultra-hot Jupiters, including neutral and ionized metals, providing key insights into planet formation through refractory element abundances. We observed the dayside thermal emission spectrum of the UHJ HAT-P-70b using the high-resolution spectrographs CARMENES and PEPSI. Through cross-correlation analysis, we detect emission signals of Al i, AlH, Ca ii, Cr i, Fe i, Fe ii, Mg i, Mn i, and Ti i, marking the first detection of Al i and AlH in an exoplanetary atmosphere. Tentative signals of C i, Ca i, Na i, NaH, and Ni i are also identified. These detections enable atmospheric retrievals to constrain the thermal profile and elemental abundances of the planet's dayside hemisphere. The retrieved temperature-pressure profile reveals a strong thermal inversion. The chemical free retrieval yields a metallicity of [Fe/H] = 0.38(+0.74/-1.11), while the chemical equilibrium retrieval gives [Fe/H] = 0.23(+1.08/-0.98), both consistent with solar metallicity. We also tentatively find an enhanced abundance of Ni, possibly due to the accretion of Ni-rich planetesimals during formation. On the other hand, elements with condensation temperatures above 1400 K (e.g., Ca, Ti, and V) appear slightly depleted, which may be caused by nightside cold trapping. However, Al, with the highest condensation temperature at 1653K, displays a solar like abundance, which might reflect the formation-related enrichment of Al. Our retrieval indicates extremely high volume mixing ratios of metal ions (Fe ii and Ca ii), which are significantly inconsistent with predictions from chemical equilibrium models. This disequilibrium suggests that the atmosphere is likely undergoing significant hydrodynamic escaping, which enhances the atmospheric density at high altitudes where the ionic lines are formed.",
      "pdf_url": "https://arxiv.org/pdf/2512.21470.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21493",
      "title": "Episodic planetesimal disruptions triggered by dissipation of gas disk",
      "authors": [
        "Kang Shuai",
        "Li-Yong Zhou",
        "Hejiu Hui"
      ],
      "abstract": "Episodic planetesimal disruptions triggered by dissipation of gas disk Kang Shuai, Li-Yong Zhou, Hejiu Hui Earth and Planetary Astrophysics (astro-ph.EP) Catastrophic disruptions of planetesimals occur in high-velocity collisions. Radioisotope dating of planetesimal disruption events recorded in meteorites confirms frequent catastrophic collisions in the first $\\sim$10 Myr of the Solar System, reflecting a violent environment of the time. However, the nebula gas can damp the eccentricity of planetesimals and suppress the frequency of planetesimal collisions. Strong dynamical mechanisms that excited the protoplanetary disk are required. Here we show that the sweeping secular resonances of Jupiter and Saturn induced by the nebular gas dissipation, together with the mean motion resonances of Jupiter, can trigger a large number of catastrophic collisions, which occur episodically when the secular resonances are at $\\sim$2-3 au and continue thereafter. After the gas dissipation completes, catastrophic collisions decrease in frequency, with scattering by planetary embryos becoming the major driving force of the collisions. Our results suggest that the violent environment excited by secular and mean motion resonances can be ubiquitous in protoplanetary disks during nebula dissipation.",
      "pdf_url": "https://arxiv.org/pdf/2512.21493.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21342",
      "title": "An Enhanced \"Flux-Corrected Transport\"-Based Plasmasphere Refilling Model",
      "authors": [
        "Jaden Fitzpatrick",
        "Kausik Chatterjee",
        "Naomi Maruyama"
      ],
      "abstract": "An Enhanced \"Flux-Corrected Transport\"-Based Plasmasphere Refilling Model Jaden Fitzpatrick, Kausik Chatterjee, Naomi Maruyama Submitted for Review in the Journal of Geophysical Research: Space Physics Space Physics (physics.space-ph); Earth and Planetary Astrophysics (astro-ph.EP); Plasma Physics (physics.plasm-ph) A previously developed multi-ion, two-stream Flux-Corrected Transport (FCT) hydrodynamic model for plasmasphere refilling has been extended to incorporate self-consistent electron temperature evolution. The past assumption of a constant temperature along the modeled flux tube has been replaced by solving the electron energy equation, permitting spatially and temporally varying temperature. This improvement provides a more physically complete representation of the pressure and ambipolar electric-field gradients that influence ion transport. The extended model allows us to investigate two-stage refilling behavior established by prior observations and simulations. The model continues to reproduce the expected dominance of H+, enhanced early-time O+ contributions, and the coupling between H+ and He+ through the ambipolar electric field during the transition between stages. Sensitivity experiments with modified initial ion concentrations, including cases representing seasonal effects, highlight the distinct roles of each ion species in shaping the refilling trajectory. Comparisons across L-shells 3 and 4 further confirm the robustness of the model framework for future extension to three-dimensional geometries. Overall, by incorporating more realistic temperature variations, this enhanced model strengthens the physical understanding for interpreting complex multi-ion transport processes during plasmasphere recovery following geomagnetic storms.",
      "pdf_url": "https://arxiv.org/pdf/2512.21342.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08994",
      "title": "Snowball Bistability Vanishes at Moderate Orbital Eccentricity",
      "authors": [
        "Xuan Ji",
        "Dorian S. Abbot"
      ],
      "abstract": "Snowball Bistability Vanishes at Moderate Orbital Eccentricity Xuan Ji, Dorian S. Abbot 16 pages, 9 figures, accepted for publication in PSJ Earth and Planetary Astrophysics (astro-ph.EP) Snowball episodes are associated with increases in atmospheric oxygen and the complexity of life on Earth, and they may be essential for the development of complex life on exoplanets. Sustained, stable Snowball episodes require a Snowball bifurcation and climate bistability between the globally ice-covered Snowball state and a state with at least some open ocean. We find that climate bistability disappears for an aquaplanet with a slab ocean in the global climate model ExoCAM when the orbital eccentricity is increased to 0.2-0.3. This happens because the Snowball state ceases to exist as seasonal insolation variations intensify, while the warm state remains stable due to the ocean's large heat capacity. We use a low-order ice-thermodynamic model to show that the Snowball state ceases to exist as seasonality increases because winter freezing at the ice bottom is reduced relative to summer melting at the ice top due to ice self-insulation. Combined with previous research showing that Snowball climate bistability diminishes for planets orbiting low-mass stars and ones with longer rotation periods, and that it disappears entirely for tidally locked planets, our work suggests that the Snowball climate bistability may not be as robust to planetary parameters as previously thought, representing one aspect of habitability more consistent with the rare Earth hypothesis than the Copernican principle.",
      "pdf_url": "https://arxiv.org/pdf/2509.08994.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}