{
  "date": "2026-02-20",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.GA",
    "astro-ph.HE",
    "astro-ph",
    "astro-ph.CO",
    "astro-ph.IM",
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "total_papers": 90,
  "gw_related_papers": 8,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.15912",
      "title": "Foiling Black Hole Foils: Revealing Horizon Alternatives with Baryonic Atmospheres",
      "authors": [
        "Shokoufe Faraji",
        "Avery E. Broderick"
      ],
      "abstract": "Foiling Black Hole Foils: Revealing Horizon Alternatives with Baryonic Atmospheres Shokoufe Faraji, Avery E. Broderick High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Event horizons are a defining feature of black holes. Consequently, there have been many efforts to probe their existence in astrophysical black hole candidates, spanning ten orders of magnitude in mass. Nevertheless, horizons remain an obstacle to unifying general relativity and quantum mechanics, most sharply presented by the information paradox. This has motivated a proliferation of horizonless alternatives (black hole foils) that avoid event horizons and are therefore benign. We show that for typical accreting astronomical targets, largely independent of a foil's underlying microphysics, a horizonless compact surface will generically be ensconced within an optically thick, scattering dominated baryonic settling layer that efficiently reprocesses the kinetic energy of infalling matter into observable thermal emission. The emergent photosphere luminosity is driven toward the accretion-powered equilibrium value and is only weakly sensitive to the foil redshift. These atmospheres are convectively stable and naturally imply that the emitting photosphere forms at modest redshift even when the surface redshift is extreme. Moreover, local gas-surface interaction provides a microphysical lower bound on the effective base temperature, insulating the atmosphere from arbitrarily cold foils. The unknown properties of the foil enter only through local boundary conditions controlling baryon processing and thermal coupling at the surface, making the solutions broadly applicable to horizonless alternatives that do not invoke significant additional nonlocal interactions. Thus, under minimal assumptions (GR exterior and local surface interactions), horizonless foils are generically observationally exposed: the absence of a thermal photosphere directly constrains or rules out broad classes of such models.",
      "pdf_url": "https://arxiv.org/pdf/2602.15912.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15929",
      "title": "Supermassive black holes swallow stellar objects at high rates: from Little Red Dots to Black Hole Stars",
      "authors": [
        "Konstantinos Kritos",
        "Joseph Silk"
      ],
      "abstract": "Supermassive black holes swallow stellar objects at high rates: from Little Red Dots to Black Hole Stars Konstantinos Kritos, Joseph Silk High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Supermassive black hole growth plausibly occurs via runaway astrophysical black hole mergers in nuclear star clusters that form intermediate mass black hole seeds at high redshifts. Such a model of Little Red Dots yields an order-of-magnitude higher rate of tidal disruption events than that of black hole captures. Our prediction, normalised to our proposed resolution of SMBH seeding, yields detectable TDE rates at high redshift. The resulting dense gas cocoons generate the nuclei of LRDs, each incorporating a central massive black-hole-star, with comparable masses in gas, stars, and massive black hole within a scale of around a parsec as inferred from the various spectral signatures.",
      "pdf_url": "https://arxiv.org/pdf/2602.15929.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/astro-ph/9604047",
      "title": "Prompt And Delayed Radio Bangs At Kilohertz By SN 1987A: A Test For Graviton-Photon Conversion",
      "authors": [
        "D. Fargion"
      ],
      "abstract": "Prompt And Delayed Radio Bangs At Kilohertz By SN 1987A: A Test For Graviton-Photon Conversion D. Fargion (Phys. Dept., University of Rome ``La Sapienza'' and INFN) 20 pages , latex file , article style , PS version available via anonymous login to this ftp URL Astrophysics (astro-ph); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) A sequence of prompt and delayed radio signals at tens of kilohertz should reach the Earth (or Jupiter) due to graviton--photon conversion in interstellar as well as local planetary magnetic fields. These radio fluxes may be a detectable probe of a huge gravitational burst expected from Supernovae explosions. The earliest prompt radio signal, coinciding with the neutrino burst, is due to conversion in the terrestrial (or Jovian) magnetic field and is below the micro-Jansky (or milli-Jansky) level for a galactic Supernova like SN1987A. A later radio signal, a ``tail'', due to the same graviton - radio wave conversion in random interstellar fields will maintain a relic radio ``noise'' for hundreds or thousands of years and might even be still detectable by a very sensitive network of satellite antennas at the kilohertz band. Exact solutions are presented here for the graviton-photon conversion in a refractive medium, as well as their consequences for high energy supernovae and the 2.726 K background radiation.",
      "pdf_url": "https://arxiv.org/pdf/astro-ph/9604047.pdf",
      "categories": [
        "astro-ph",
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2307.11043",
      "title": "Adiabatic or Non-Adiabatic? Unraveling the Nature of Initial Conditions in the Cosmological Gravitational Wave Background",
      "authors": [
        "Lorenzo Valbusa Dall'Armi",
        "Alina Mierna",
        "Sabino Matarrese",
        "Angelo Ricciardone"
      ],
      "abstract": "Adiabatic or Non-Adiabatic? Unraveling the Nature of Initial Conditions in the Cosmological Gravitational Wave Background Lorenzo Valbusa Dall'Armi, Alina Mierna, Sabino Matarrese, Angelo Ricciardone Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The non-thermal nature of the cosmological gravitational wave background (CGWB) makes it difficult to define the initial condition for the graviton distribution, which determines the initial contribution to the CGWB anisotropies. Specifically, unlike Cosmic Microwave Background (CMB) photons, primordial gravitational waves (GWs) are not necessarily subject to adiabatic initial conditions. For the CGWB generated by quantum fluctuations of the metric during inflation the initial conditions are not adiabatic. The violation of adiabaticity arises from the presence of independent tensor perturbations during inflation, which behave as two extra fields that affect the standard single-clock argument. The non-adiabatic initial contribution enhances the total CGWB angular power spectrum compared to the standard adiabatic case. Given the high degree of correlation between the CGWB and Cosmic Microwave Background (CMB) anisotropies, we present the constrained realization maps of the CGWB built using the high-resolution CMB Planck maps for different initial conditions.",
      "pdf_url": "https://arxiv.org/pdf/2307.11043.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.10088",
      "title": "Can GW231123 have a stellar origin?",
      "authors": [
        "Djuna Croon",
        "Davide Gerosa",
        "Jeremy Sakstein"
      ],
      "abstract": "Can GW231123 have a stellar origin? Djuna Croon, Davide Gerosa, Jeremy Sakstein 5 pages, 2 figures. Updated to version published in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) The gravitational wave event GW231123 detected by the LIGO interferometers during their fourth observing run features two black holes with source-frame masses of $137^{+23}_{-18} M_\\odot$ and $101^{+22}_{-50} M_\\odot$ -- in the range of the pair-instability black hole mass gap predicted by standard stellar evolution theory. Both black holes are also inferred to be rapidly spinning ($\\chi_1 \\simeq 0.9$, $\\chi_2 \\simeq 0.8$). The primary object in GW231123 is the heaviest stellar mass black hole detected to date, which, together with its extreme rotation, raises questions about its astrophysical origin. Accounting for the unusually large spin of $\\sim 0.9$ with hierarchical mergers requires some degree of fine tuning. We investigate whether such a massive, highly spinning object could plausibly form from the collapse of a single rotating massive star. We simulate stars with an initial core mass of $160\\,M_\\odot$ -- sufficient to produce BH masses at the upper edge of the 90\\% credible interval for $m_1$ in GW231123 -- across a range of rotation rates and $^{12}\\mathrm{C}(\\alpha,\\gamma)^{16}\\mathrm{O}$ reaction rates. We allow for differential rotation to explore the high-spin regime. In this limit of weak angular momentum transport, we find that: (i) rotation shifts the pair-instability mass gap to higher masses, introducing an important correlation between masses and spins in gravitational wave predictions; and (ii) highly spinning BHs with masses $\\gtrsim 150 \\rm M_\\odot$ can form above the mass gap. Our results suggest that the primary object of GW231123 may be the first directly observed black hole that formed via direct core collapse following the photodisintegration instability.",
      "pdf_url": "https://arxiv.org/pdf/2508.10088.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.20967",
      "title": "A Universal CMB $B$-Mode Spectrum from Early Causal Tensor Sources",
      "authors": [
        "Kylar Greene",
        "Aurora Ireland",
        "Gordan Krnjaic",
        "Yuhsin Tsai"
      ],
      "abstract": "A Universal CMB $B$-Mode Spectrum from Early Causal Tensor Sources Kylar Greene, Aurora Ireland, Gordan Krnjaic, Yuhsin Tsai 15 pages, 5 figures; v2 added citations Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Many early universe scenarios predict post-inflationary tensor perturbations from causality-limited, sub-horizon sources. While the microphysical details may differ, as long as these sources are bounded in duration and correlation length, their tensor power spectra exhibit a universal scaling behavior at small wavenumber: $P_h(k) \\propto k^3$, corresponding to white noise on super-horizon scales at the time of production. If these early causal tensor sources (ECTs) exclusively produce gravitational waves before redshift $z \\sim 10^5$, this scaling is realized on all of the scales observed in the cosmic microwave background (CMB), and thus yields a universal multipole distribution for the $B$-mode angular power spectrum. Unlike the scale-invariant distributions of inflationary $B$ modes, ECTs generically predict enhanced power on small scales and suppressed power on large scales, which allows these source classes to be distinguished given measurements over a sufficient range of angular scales. In this paper, we introduce a unified framework for characterizing ECTs and demonstrate how their universal infrared scaling manifests in low-frequency observables, including CMB $B$ modes and stochastic gravitational wave spectral densities. We illustrate this mapping with representative case studies of this universality class involving first-order phase transitions, topological defects, and enhanced scalar perturbations, which source tensor modes at second order in perturbation theory.",
      "pdf_url": "https://arxiv.org/pdf/2601.20967.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.15951",
      "title": "MadEvolve: Evolutionary Optimization of Cosmological Algorithms with Large Language Models",
      "authors": [
        "Tianyi Li",
        "Shihui Zang",
        "Moritz Münchmeyer"
      ],
      "abstract": "MadEvolve: Evolutionary Optimization of Cosmological Algorithms with Large Language Models Tianyi Li, Shihui Zang, Moritz Münchmeyer Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG) We develop a general framework to discover scientific algorithms and apply it to three problems in computational cosmology. Our code, MadEvolve, is similar to Google's AlphaEvolve, but places a stronger emphasis on free parameters and their optimization. Our code starts with a baseline human algorithm implementation, and then optimizes its performance metrics by making iterative changes to its code. As a further convenient feature, MadEvolve automatically generates a report that compares the input algorithm with the evolved algorithm, describes the algorithmic innovations and lists the free parameters and their function. Our code supports both auto-differentiable, gradient-based parameter optimization and gradient-free optimization methods. We apply MadEvolve to the reconstruction of cosmological initial conditions, 21cm foreground contamination reconstruction and effective baryonic physics in N-body simulations. In all cases, we find substantial improvements over the base algorithm. We make MadEvolve and our three tasks publicly available at this http URL.",
      "pdf_url": "https://arxiv.org/pdf/2602.15951.pdf",
      "categories": [
        "astro-ph.CO",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16077",
      "title": "The Carousel Lens II: Cosmological Constraints with GIGA-Lens",
      "authors": [
        "Felipe Urcelay",
        "Xiaosheng Huang",
        "William Sheu",
        "Jackson H. O'Donnell",
        "Tesla Jeltema",
        "Demetrius Y. Williams",
        "Sean Xu",
        "Shrihan Agarwal",
        "Greg Aldering",
        "David Álvarez-García",
        "Harsh Ambardekar",
        "Tania M. Barone",
        "Fuyan Bian",
        "Adam S. Bolton",
        "Aleksandar Cikota",
        "Gerrit S. Farren",
        "Karl Glazebrook",
        "Taylor Hoyt",
        "Aniket Jain",
        "Tucker Jones",
        "Glenn G. Kacprzak",
        "Emerald Lin",
        "Saul Perlmutter",
        "David Rubin",
        "David J. Schlegel",
        "Ethan Silver",
        "Christopher J. Storfer",
        "Nao Suzuki",
        "Jannik Truong",
        "Mónica Úbeda",
        "Keerthi Vasan G. C"
      ],
      "abstract": "The Carousel Lens II: Cosmological Constraints with GIGA-Lens Felipe Urcelay, Xiaosheng Huang, William Sheu, Jackson H. O'Donnell, Tesla Jeltema, Demetrius Y. Williams, Sean Xu, Shrihan Agarwal, Greg Aldering, David Álvarez-García, Harsh Ambardekar, Tania M. Barone, Fuyan Bian, Adam S. Bolton, Aleksandar Cikota, Gerrit S. Farren, Karl Glazebrook, Taylor Hoyt, Aniket Jain, Tucker Jones, Glenn G. Kacprzak, Emerald Lin, Saul Perlmutter, David Rubin, David J. Schlegel, Ethan Silver, Christopher J. Storfer, Nao Suzuki, Jannik Truong, Mónica Úbeda, Keerthi Vasan G. C Cosmology and Nongalactic Astrophysics (astro-ph.CO) The nature of dark matter and dark energy are among the central questions in cosmology. Strong gravitational lenses with multiple source planes provide a geometric probe of cosmology: the ratio of deflection angles at different redshifts depends only on angular-diameter distances, constraining the matter density $\\Omega_m$ and the dark energy equation of state $w$. However, constraints from this technique have historically lagged behind those from the CMB, SNe Ia, and BAO. In this work, we present new cosmological constraints from the Carousel Lens, a cluster-scale lens with more than 40 extended images from 11 spectroscopically confirmed sources. Its relaxed core and rich set of extended images behind the main halo make it particularly suitable for cosmological inference. Using the GIGA-Lens pipeline, we construct a pixel-level lens model including six HST-detected sources and four mass components. From this model, we obtain $w$CDM constraints of $\\Omega_m = 0.34^{+0.16}_{-0.13}$ and $w = -1.31^{+0.35}_{-0.32}$ from the Carousel Lens alone, accounting for both statistical and systematic uncertainties. We further project that including four additional known higher-redshift sources, assuming similar fractional uncertainties, could improve the constraining power by ~80%, bringing the precision close to that of the CMB and SNe Ia. For an evolving dark energy model ($w_0w_a$CDM), the Carousel Lens alone yields constraints comparable to the CMB, providing an independent and complementary probe alongside SN Ia and BAO. While currently systematic uncertainties dominate, which we quantify through simulations, our results demonstrate that relaxed multi-source-plane cluster lenses can deliver competitive cosmological constraints. Further improvements are expected from reductions in systematics and from incorporating higher-redshift sources (known and new) with high-resolution imaging.",
      "pdf_url": "https://arxiv.org/pdf/2602.16077.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16107",
      "title": "Effects of Symmetron on growth and RSD multipoles",
      "authors": [
        "Gerardo Morales-Navarrete",
        "Jorge L. Cervantes-Cota"
      ],
      "abstract": "Effects of Symmetron on growth and RSD multipoles Gerardo Morales-Navarrete, Jorge L. Cervantes-Cota Contribution to: 24th International Conference on General Relativity and Gravitation (GR24) and 16th Edoardo Amaldi Conference on Gravitational (Amaldi16) Waves Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work, we investigate the effects of the growth rate scale dependence in the Symmetron modified gravity (MG) model on cosmic structure formation and we analyze the redshift-space distortion (RSD) multipoles, comparing with the Hu-Sawicki $f(R)$ model (specifically the F6) and the standard $\\Lambda$CDM model. The analysis employs a scale-dependent growth equation and utilizes the fk-PT perturbation theory approach, implemented in the FOLPS-nu code, to compute the full 1-loop power spectrum multipoles, in particular, the monopole and quadrupole ($\\ell=0,2$, respectively). The results show that at redshift $z=0$, the monopole of both MG models is suppressed compared to $\\Lambda$CDM, with the Symmetron being closer to the standard model, while the quadrupole presents the opposite behavior. To validate the pipeline, we use General Relativity (GR) mock catalogs (EZMocks), since suitable Symmetron simulations are not available. The main result is that the Markov Chain Monte Carlo (MCMC) analysis successfully recovers the expected GR limit (i.e., $\\beta_0 \\approx 0$) from the Symmetron model when applied to this mock data, confirming the viability of our methodology for cosmological inference. Then, we conclude that the pipeline is prepared to test MG models against current and near-future galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.16107.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16134",
      "title": "First Detection of the Baryon Acoustic Oscillation (BAO) Feature in the 3-Point Correlation Function of DESI DR1 Luminous Red Galaxies",
      "authors": [
        "Farshad Kamalinejad",
        "Zachary Slepian",
        "Alex Krolewski",
        "Alessandro Greco",
        "William Ortolá Leonard",
        "Jessica Chellino",
        "Matthew Reinhard",
        "Elena Fernández-García",
        "Francisco Prada",
        "J. Aguilar",
        "S. Ahlen",
        "A. Anand",
        "C. Bebek",
        "D. Bianchi",
        "D. Brooks",
        "T. Claybaugh",
        "A. Cuceu",
        "K. S. Dawson",
        "A. de la Macorra",
        "R. Demina",
        "P. Doel",
        "J. Edelstein",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "S. Gontcho A Gontcho",
        "G. Gutierrez",
        "H. K. Herrera-Alcantar",
        "K. Honscheid",
        "C. Howlett",
        "D. Huterer",
        "M. Ishak",
        "R. Joyce",
        "S. Juneau",
        "D. Kirkby",
        "T. Kisner",
        "A. Kremin",
        "O. Lahav",
        "C. Lamman",
        "M. Landriau",
        "L. Le Guillou",
        "M. Manera",
        "A. Meisner",
        "R. Miquel",
        "J. A. Newman",
        "W. J. Percival",
        "C. Poppett",
        "I. Pérez-Ràfols",
        "L. Samushia",
        "E. Sanchez",
        "D. Schlegel",
        "M. Schubnell",
        "H. Seo",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarlé",
        "B. A. Weaver",
        "C. Zhao",
        "H. Zou"
      ],
      "abstract": "First Detection of the Baryon Acoustic Oscillation (BAO) Feature in the 3-Point Correlation Function of DESI DR1 Luminous Red Galaxies Farshad Kamalinejad, Zachary Slepian, Alex Krolewski, Alessandro Greco, William Ortolá Leonard, Jessica Chellino, Matthew Reinhard, Elena Fernández-García, Francisco Prada, J. Aguilar, S. Ahlen, A. Anand, C. Bebek, D. Bianchi, D. Brooks, T. Claybaugh, A. Cuceu, K. S. Dawson, A. de la Macorra, R. Demina, P. Doel, J. Edelstein, J. E. Forero-Romero, E. Gaztañaga, S. Gontcho A Gontcho, G. Gutierrez, H. K. Herrera-Alcantar, K. Honscheid, C. Howlett, D. Huterer, M. Ishak, R. Joyce, S. Juneau, D. Kirkby, T. Kisner, A. Kremin, O. Lahav, C. Lamman, M. Landriau, L. Le Guillou, M. Manera, A. Meisner, R. Miquel, J. A. Newman, W. J. Percival, C. Poppett, I. Pérez-Ràfols, L. Samushia, E. Sanchez, D. Schlegel, M. Schubnell, H. Seo, J. Silber, D. Sprayberry, G. Tarlé, B. A. Weaver, C. Zhao, H. Zou Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the first detection of the 3-Point Correlation Function (3PCF) Baryon Acoustic Oscillation (BAO) signal from the DESI Data Release 1 (DR1) sample of Luminous Red Galaxies (LRGs), which contains over 2.1 million galaxies. Our analysis is based on a tree-level redshift-space bispectrum template, which is then transformed to position space using the Fast Fourier Transform on Logarithmic scales (FFTLog) algorithm. We detect the BAO feature with a significance of approximately $8.1\\sigma$ using the EZmock covariance matrix and $8.5\\sigma$ using the analytical covariance matrix, for the full LRG redshift range ($0.4<z<1.1$), denoted as the $z_{\\rm full}$ sample. We use the Abacus altMTL mocks, the most precise DESI DR1 mock catalogs currently available, to validate our model. We find that our model fits the mocks well, with a small offset of $0.6\\%$ in the recovered BAO scale, which we treat as a systematic error due to modeling. We measure the angle-averaged distance, $D_{\\rm V}(z = 0.68)/r_{\\rm d} = 15.88 \\pm 0.27$ ($1.72\\%$ precision) when using the covariance matrix estimated from EZmocks and $D_{\\rm V}(z = 0.68)/r_{\\rm d} = 15.72 \\pm 0.18$ ($1.12\\%$ precision) when using the analytical Gaussian covariance matrix. Our results show excellent agreement with the DESI DR1 2PCF BAO measurements as well. We also explore several other ways to estimate the error and find between $1.7$--$2.2\\%$ precision on the BAO scale from the EZmock covariance matrix and between $1.1$--$1.5\\%$ precision from the analytical covariance matrix. This work represents the first detection of the BAO feature in the DESI 3PCF, establishing its ability to probe the expansion history of the Universe with future DESI 3PCF measurements.",
      "pdf_url": "https://arxiv.org/pdf/2602.16134.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16295",
      "title": "SPT-CL J0417-4748: A Deep Chandra Study of a Relaxed Galaxy Cluster Without Central Star Formation",
      "authors": [
        "Taweewat Somboonpanyakul",
        "Adam B. Mantz",
        "Steven W. Allen",
        "Anthony M. Flores",
        "R. Glenn Morris",
        "Haley R. Stueber",
        "Lindsey E. Bleem",
        "Benjamin Floyd",
        "Julie Hlavacek-Larrondo",
        "Keunho J. Kim"
      ],
      "abstract": "SPT-CL J0417-4748: A Deep Chandra Study of a Relaxed Galaxy Cluster Without Central Star Formation Taweewat Somboonpanyakul, Adam B. Mantz, Steven W. Allen, Anthony M. Flores, R. Glenn Morris, Haley R. Stueber, Lindsey E. Bleem, Benjamin Floyd, Julie Hlavacek-Larrondo, Keunho J. Kim 14 pages, 9 figures, Accepted for publication in ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present an in-depth Chandra X-ray analysis of the galaxy cluster SPT-CL J0417$-$4748 (hereafter SPT J0417), at z = 0.58, with a focus on its thermodynamic properties and the apparent absence of central star formation. Utilizing a total Chandra exposure of 103 ks, we find that the large-scale X-ray morphology is consistent with a dynamically relaxed, cool-core system. The intracluster medium (ICM) shows a central density of 0.08+/-0.01 cm^{-3}, a central pseudo-entropy of 26^{+6}_{-5} keVcm^{2} and a central cooling time of 515^{+96}_{-75} Myr, values typical of massive cool-core clusters. Despite these conditions, no evidence of recent or ongoing star formation is detected in the brightest cluster galaxy (BCG). Spectral energy distribution (SED) fitting of DES photometry indicates that the bulk of the stellar population formed at z~1.25, with no significant star formation over the past ~3 Gyr, while optical spectra from Magellan show no [O II] emission. Complementary ASKAP radio and Spitzer infrared data indicate a lack of strong current AGN activity in the BCG. SPT J0417 exemplifies massive, relaxed, cool-core clusters in which cooling and star formation appear almost completely quenched, providing valuable insights into how AGN feedback regulates the long-term thermal balance of the intracluster medium.",
      "pdf_url": "https://arxiv.org/pdf/2602.16295.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16364",
      "title": "High significance detection at 4.8 GHz of the radio halo in the Coma galaxy cluster with the Sardinia Radio Telescope",
      "authors": [
        "P. Marchegiani",
        "M. Murgia",
        "F. Loi",
        "V. Vacca",
        "F. Govoni",
        "S. Cocchi",
        "F. Gandossi"
      ],
      "abstract": "High significance detection at 4.8 GHz of the radio halo in the Coma galaxy cluster with the Sardinia Radio Telescope P. Marchegiani, M. Murgia, F. Loi, V. Vacca, F. Govoni, S. Cocchi, F. Gandossi 9 pages, 5 figures, 3 tables; accepted for publication in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the results of observations of the radio halo in the Coma galaxy cluster at 4.8 GHz performed with the Sardinia Radio Telescope. The radio halo in this cluster is detected for the first time at this frequency with a statistical significance higher than $3\\sigma$. After the removal of the Radio Frequency Interference and of the discrete sources contribution, and after the correction for the Sunyaev-Zel'dovich effect, we estimate a flux density of $61\\pm11$ mJy, higher than the value previously reported in literature at this frequency. By using the value we obtained, it is possible to estimate an integrated spectral index between 4.8 and 6.6 GHz of $\\alpha\\sim1.17$, where $F(\\nu)\\propto \\nu^{-\\alpha}$, indicating a possible higher-frequency slowdown of the spectral steepening observed between 1.4 and 4.8 GHz. Such a spectral behavior is compatible with turbulent re-acceleration if the seed electrons have a spectrum extending up to high energies, as in the case of continuous injection by hadronic interactions or dark matter annihilation. We also report the detection at 4.8 GHz of a polarized spot inside the halo, without an evident counterpart, already detected at 6.6 GHz.",
      "pdf_url": "https://arxiv.org/pdf/2602.16364.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16448",
      "title": "Euclid preparation. Impact of galaxy intrinsic alignment modelling choices on Euclid 3x2pt cosmology",
      "authors": [
        "Euclid Collaboration: D. Navarro-Gironés",
        "I. Tutusaus",
        "M. Crocce",
        "S. Gouyou Beauchamps",
        "R. Paviot",
        "B. Joachimi",
        "J. Ruiz-Zapatero",
        "D. Sciotti",
        "N. Tessore",
        "G. Cañas-Herrera",
        "P. Carrilho",
        "J. M. Coloma-Nadal",
        "H. Hoekstra",
        "A. Porredon",
        "B. Altieri",
        "S. Andreon",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "S. Camera",
        "V. Capobianco",
        "C. Carbone",
        "V. F. Cardone",
        "J. Carretero",
        "F. J. Castander",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H. M. Courtois",
        "A. Da Silva",
        "H. Degaudenzi",
        "G. De Lucia",
        "H. Dole",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "S. Farrens",
        "S. Ferriol",
        "F. Finelli",
        "P. Fosalba",
        "S. Fotopoulou",
        "N. Fourmanoit",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "S. V. H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "S. Kermiche",
        "A. Kiessling",
        "M. Kilbinger",
        "B. Kubik",
        "K. Kuijken",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti",
        "O. Mansutti",
        "O. Marggraf",
        "M. Martinelli",
        "N. Martinet",
        "F. Marulli",
        "E. Medinaceli",
        "M. Meneghetti",
        "E. Merlin",
        "G. Meylan",
        "A. Mora",
        "M. Moresco",
        "L. Moscardini",
        "R. Nakajima",
        "C. Neissner",
        "S.-M. Niemi",
        "C. Padilla"
      ],
      "abstract": "Euclid preparation. Impact of galaxy intrinsic alignment modelling choices on Euclid 3x2pt cosmology Euclid Collaboration: D. Navarro-Gironés (1), I. Tutusaus (2 and 3 and 4), M. Crocce (2 and 3), S. Gouyou Beauchamps (3 and 2), R. Paviot (5), B. Joachimi (6), J. Ruiz-Zapatero (6), D. Sciotti (7 and 8), N. Tessore (9), G. Cañas-Herrera (10 and 1), P. Carrilho (11), J. M. Coloma-Nadal (2), H. Hoekstra (1), A. Porredon (12), B. Altieri (13), S. Andreon (14), C. Baccigalupi (15 and 16 and 17 and 18), M. Baldi (19 and 20 and 21), S. Bardelli (20), A. Biviano (16 and 15), E. Branchini (22 and 23 and 14), M. Brescia (24 and 25), S. Camera (26 and 27 and 28), V. Capobianco (28), C. Carbone (29), V. F. Cardone (7 and 8), J. Carretero (12 and 30), F. J. Castander (2 and 3), M. Castellano (7), G. Castignani (20), S. Cavuoti (25 and 31), K. C. Chambers (32), C. Colodro-Conde (33), G. Congedo (10), C. J. Conselice (34), L. Conversi (35 and 13), Y. Copin (36), F. Courbin (37 and 38 and 39), H. M. Courtois (40), A. Da Silva (41 and 42), H. Degaudenzi (43), G. De Lucia (16), H. Dole (44), F. Dubath (43), C. A. J. Duncan (10), X. Dupac (13), S. Escoffier (45), M. Farina (46), R. Farinelli (20), S. Farrens (5), S. Ferriol (36), F. Finelli (20 and 47), P. Fosalba (3 and 2), S. Fotopoulou (48), N. Fourmanoit (45), M. Frailis (16), E. Franceschi (20), M. Fumana (29), S. Galeotta (16), K. George (49), B. Gillis (10), C. Giocoli (20 and 21), J. Gracia-Carpio (50), A. Grazian (51), F. Grupp (50 and 52), S. V. H. Haugan (53), W. Holmes (54), F. Hormuth (55), A. Hornstrup (56 and 57), K. Jahnke (58), S. Kermiche (45), A. Kiessling (54), M. Kilbinger (5), B. Kubik (36), K. Kuijken (1), M. Kunz (59), H. Kurki-Suonio (60 and 61), A. M. C. Le Brun (62), S. Ligori (28), P. B. Lilje (53), V. Lindholm (60 and 61), I. Lloro (63), G. Mainetti (64), O. Mansutti (16), O. Marggraf (65), M. Martinelli (7 and 8), N. Martinet (66), F. Marulli (67 and 20 and 21), E. Medinaceli (20), M. Meneghetti (20 and 21), E. Merlin (7), G. Meylan (68), A. Mora (69), M. Moresco (67 and 20), L. Moscardini (67 and 20 and 21), R. Nakajima (65), C. Neissner (70 and 30), S.-M. Niemi (71), C. Padilla 23 pages, 16 figures, submitted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Euclid galaxy survey will provide unprecedented constraints on cosmology, but achieving unbiased results will require an optimal characterisation and mitigation of systematic effects. Among these, the intrinsic alignments (IA) of galaxies are one of the dominant contaminants of the weak lensing (WL) and galaxy-galaxy lensing (GGL) probes. In this work, we assess IA modelling choices for Euclid DR1 3x2pt analyses by comparing the performance of the two most commonly used IA models, nonlinear alignment (NLA) and tidal alignment tidal torquing (TATT), along with several variations. Our analyses combine three perspectives: i) the constraining power on the IA and cosmological parameters for each IA model, ii) the bias that results when the IA analysis model differs from the model used to generate the synthetic data vector, and iii) the degeneracies between IA and photometric redshift (photo-z) nuisance parameters. Among the IA models analysed, the redshift-dependent TATT model (zTATT) provides the most flexible description of IA, with a similar constraining power compared to simpler IA models, making it a well-motivated choice for Euclid DR1 3x2pt analyses.",
      "pdf_url": "https://arxiv.org/pdf/2602.16448.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16575",
      "title": "Chiral gravitational waves from multi-phase magnetogenesis",
      "authors": [
        "H. V. Ragavendra",
        "Gianmassimo Tasinato",
        "L. Sriramkumar"
      ],
      "abstract": "Chiral gravitational waves from multi-phase magnetogenesis H. V. Ragavendra, Gianmassimo Tasinato, L. Sriramkumar Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmological vector fields are central to many early-Universe phenomena, including inflationary dynamics, primordial magnetogenesis, and dark-matter scenarios. However, constructing models able to generate cosmological magnetic fields while avoiding strong coupling, backreaction, and cosmic microwave background constraints remains challenging. We study a novel mechanism in which brief non--slow-roll phases during inflation amplify primordial magnetic fields at small scales, while maintaining theoretical consistency and observational viability. We incorporate parity-violating interactions in the vector sector and demonstrate, for the first time in a non--slow-roll framework, that chirality can significantly boost magnetic-field amplitudes and imprint distinctive polarization-dependent spectral features. We complement detailed numerical computations with an analytical treatment yielding compact expressions for chiral vector mode functions that reproduce the main spectral properties. We then develop a systematic formalism to evaluate the stochastic gravitational-wave background naturally induced at second order by these amplified fields, identifying both an intensity component and a circularly polarized contribution with characteristic frequency profiles. We discuss detection prospects with future multiband gravitational-wave observatories, showing that chiral signatures could provide a distinctive observational probe. Our results introduce new avenues for enhancing primordial magnetic fields and their associated gravitational-wave signals, opening promising possibilities for their future detection and interpretation, both with cosmological and gravitational wave probes.",
      "pdf_url": "https://arxiv.org/pdf/2602.16575.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.16651",
      "title": "Interpreting the HI 21-cm cosmology maps through Largest Cluster Statistics III: Impact of the lightcone effect",
      "authors": [
        "Hemanth Potluri",
        "Manas Mohit Dosibhatla",
        "Leon Noble",
        "Chandra Shekhar Murmu",
        "Suman Majumdar",
        "Samit Kumar Pal",
        "Saswata Dasgupta",
        "Satadru Bag",
        "Abhirup Datta"
      ],
      "abstract": "Interpreting the HI 21-cm cosmology maps through Largest Cluster Statistics III: Impact of the lightcone effect Hemanth Potluri, Manas Mohit Dosibhatla, Leon Noble, Chandra Shekhar Murmu, Suman Majumdar, Samit Kumar Pal, Saswata Dasgupta, Satadru Bag, Abhirup Datta 23 pages, 5 figures, 1 table. To be submitted to JCAP. Comments and suggestions are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) The redshifted 21-cm signal emitted by neutral Hydrogen (HI) is a promising probe to understand the evolution of the topology of ionized regions during the Epoch of Reionization (EoR). The topology of ionized regions allows us to infer the nature and properties of ionizing sources, i.e., early galaxies and AGNs. Traditional Fourier statistics, such as the power spectrum, help us quantify the strength of fluctuations in this field at different length scales but do not preserve its phase information. Analyzing the 21-cm brightness temperature field in the image domain retains its non-Gaussian characteristics and morphological information. One such approach is to track the coalescence of multiple ionized regions to form one contiguous ionized region spanning the universe. This is referred to as percolation, and its onset is quantified by a sharp rise in the value of the Largest Cluster Statistic (LCS) approaching unity. In this work, we carry out a percolation analysis of 21-cm brightness temperature fields by studying the redshift evolution of the LCS along a lightcone to distinguish between several simulated reionization scenarios. We have extended previous results on reionization model comparison from the analysis of coeval 21-cm maps to understand how the lightcone effect biases the observed percolation behavior and affects the distinguishability of the source models. We estimate the LCS of subvolumes of different sizes in the 21-cm lightcone maps and study their redshift evolution for different reionization scenarios using a moving volume approach. We find that the percolation transition inferred from a lightcone approaches that from the coeval box as we increase the bandwidth of the moving volume in all but one reionization scenario.",
      "pdf_url": "https://arxiv.org/pdf/2602.16651.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16659",
      "title": "Updated Constraints on Infrared Cutoff Models and Implications for Large-Scale CMB Anomalies",
      "authors": [
        "Ujjwal Upadhyay",
        "Yashi Tiwari",
        "Tarun Souradeep"
      ],
      "abstract": "Updated Constraints on Infrared Cutoff Models and Implications for Large-Scale CMB Anomalies Ujjwal Upadhyay, Yashi Tiwari, Tarun Souradeep 34 pages, 12 figures, 6 tables. Comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) The nearly scale-invariant primordial power spectrum provides the standard initial conditions for cosmological perturbations. However, the largest scales remain only weakly constrained by CMB observations, leaving room for deviations such as an infrared (IR) cut-off. This possibility is further motivated by the persistence of large-scale CMB anomalies, most notably the low quadrupole power. In this work, we revisit several broad classes of phenomenologically motivated IR cut-off scenarios using parametrised functional forms of the primordial power spectrum. We confront these models with the latest CMB, BAO, and supernova data and derive updated constraints on the cut-off scale and associated features. Our results remain consistent with earlier studies, showing that although such models suppress power at low multipoles, the improvement in fit is marginal and does not overcome the associated parameter penalties. We therefore find no statistically significant evidence favouring IR cut-off models over the standard power-law spectrum with current data. We further explore the interplay between IR cut-off features and a possible increase in the reionisation optical depth, motivated by the recent CMB-BAO tension highlighted by DESI DR2 within the $\\Lambda$CDM framework. We show that the additional freedom introduced by large-scale suppression is generally insufficient to support a substantial increase in optical depth, owing to the weak statistical preference for suppressed large-scale temperature power. Finally, we examine the implications of IR cut-off models for large-scale CMB anomalies by analysing the corresponding anomaly statistics within a Bayesian framework.",
      "pdf_url": "https://arxiv.org/pdf/2602.16659.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15935",
      "title": "Little Red Dots as Globular Clusters in Formation",
      "authors": [
        "John Chisholm",
        "Danielle A. Berg",
        "Michael Boylan-Kolchin",
        "Anna de Graaf",
        "Lukas J. Furtak",
        "Vasily Kokorev",
        "Jorryt Matthee",
        "Julian B. Muñoz",
        "Rohan P. Naidu",
        "Andreas A.C. Sander"
      ],
      "abstract": "Little Red Dots as Globular Clusters in Formation John Chisholm, Danielle A. Berg, Michael Boylan-Kolchin, Anna de Graaf, Lukas J. Furtak, Vasily Kokorev, Jorryt Matthee, Julian B. Muñoz, Rohan P. Naidu, Andreas A.C. Sander Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Solar and Stellar Astrophysics (astro-ph.SR) Little Red Dots (LRDs), among the most enigmatic high-redshift discoveries by JWST, are commonly believed to be powered by accreting supermassive black holes. Here, we explore the possibility that these sources are globular clusters in formation, with rest-frame UV arising from a very young stellar population and rest-frame optical from a short-lived supermassive ($>10^4$ M$_\\odot$) star. The spectral profiles of LRDs are broadly consistent with this scenario, though the observed temperatures and bolometric luminosities favor emission reprocessed by optically thick, continuum-driven winds not fully captured by current models. The LRD $z\\sim5-7$ UV luminosity function naturally evolves, under standard evolutionary and mass-loss prescriptions, into a present-day mass function with a turnover at $\\log_{10}(M_\\ast$/$M_\\odot)=5.3$ and an exponential cutoff at high masses, consistent with local globular-cluster populations. We estimate the total present-day number density of LRDs formed across all redshifts to be $\\approx0.3$ Mpc$^{-3}$, similar to local globular clusters. The observed LRD redshift range matches the age distribution of metal-poor globular clusters, without current LRD counterparts to the metal-rich population. If LRDs are globular clusters in formation, we predict chemical abundance patterns characteristic of multiple stellar populations, including enhanced He and N, and potential Na-O and Al-Mg anti-correlations. These results offer a local perspective to explore this surprisingly abundant population of distant sources, and a potential new window into extreme stellar astrophysics in the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2602.15935.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15940",
      "title": "The large cores of dark matter and globular clusters in AS1063. Possible evidence of self-interacting dark matter. Or not",
      "authors": [
        "Jose M. Diego"
      ],
      "abstract": "The large cores of dark matter and globular clusters in AS1063. Possible evidence of self-interacting dark matter. Or not Jose M. Diego Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Deep JWST images of AS1063 reveals tens of thousands of globular clusters in the galaxy cluster AS1063. When compared with the lensing model based on the same JWST data, the distribution of globular clusters traces closely the distribution of lensing mass (mostly composed of dark matter). Interestingly, both the distributions of dark matter and globular clusters have large central cores. However the size of the core in the distribution of globular clusters is about half the size the core of the dark matter distribution. We argue that the standard cold dark matter and fuzzy dark matter models struggle to explain these large cores. Meanwhile, the self interacting dark matter with a velocity dependent cross section, combined with core stalling, offers a natural explanation to the existence of these cores if $\\sigma_{\\rm SI}\\approx 0.3$ cm$^2$ g$^{-1}$ for galaxy cluster halos. But we also discuss how the lack of hydrodynamical N-body simulations capable of resolving globular clusters in galaxy cluster scale halos, hinders the possibility of ruling out the standard non-collisional dark matter scenario. Future high-resolution hydrodynamical simulations of galaxy clusters, with several trillion particles, and containing over a hundred thousand globular clusters, can provide the insight needed to transform the epistemic nature of dark matter into an ontological one",
      "pdf_url": "https://arxiv.org/pdf/2602.15940.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15949",
      "title": "The LOFAR Two-metre Sky Survey: VII. Third Data Release",
      "authors": [
        "T. W. Shimwell",
        "M. J. Hardcastle",
        "C. Tasse",
        "A. Drabent",
        "A. Botteon",
        "W.L. Williams",
        "P.N. Best",
        "H.J.A. Röttgering",
        "M. Brüggen",
        "G. Brunetti",
        "J.R. Callingham",
        "K. T. Chyży",
        "J.E. Conway",
        "F. De Gasperin",
        "M. Haverkorn",
        "C. Horellou",
        "N. Jackson",
        "G.K. Miley",
        "L.K. Morabito",
        "R. Morganti",
        "S.P. O'Sullivan",
        "D.J. Schwarz",
        "D.J.B. Smith",
        "R.J. van Weeren",
        "H.K. Vedantham",
        "G.J. White",
        "A. Ahmadi",
        "L. Alegre",
        "M. Arias",
        "B. Asabere",
        "B. Bahr-Kalus",
        "B. Barkus",
        "M. Bilicki",
        "L. Böhme",
        "M. Brentjens",
        "M. Brienza",
        "D.J. Bomans",
        "A. Bonafede",
        "M. Bonato",
        "E. Bonnassieux",
        "J.M. Boxelaar",
        "S. Camera",
        "R. Cassano",
        "J. Chilufya",
        "M. Cianfaglione",
        "J.H. Croston",
        "V.Cuciti",
        "P.Dabhade",
        "E. De Rubeis",
        "J.M.G.H.J. de Jong",
        "D. Dallacasa",
        "R.J. Dettmar",
        "K.J. Duncan",
        "G. Di Gennaro",
        "H.W. Edler",
        "C. Groeneveld",
        "G. Gürkan",
        "M. Hajduk",
        "C.L. Hale",
        "V. Heesen",
        "D.N. Hoang",
        "M. Hoeft",
        "H. Holties",
        "M.A. Horton",
        "M. Iacobelli",
        "M. Jamrozy",
        "M.J. Jarvis",
        "V. Jelic",
        "M. Kadler",
        "R. Kondapally",
        "M. Kunert-Bajraszewska",
        "M. Loose",
        "M. Magliocchetti",
        "K. Małek",
        "C. Manzano",
        "J.P. McKean",
        "M. Mevius",
        "B. Mingo",
        "A. Miskolczi",
        "A. Misra",
        "J. Moldón",
        "D.G. Nair",
        "S.J. Nakoneczny",
        "E. Orru",
        "M. Pashapour-Ahmadabadi",
        "T. Pasini",
        "J. Petley",
        "J.C.S. Pierce",
        "I. Prandoni",
        "D. Rafferty",
        "K. Rajpurohit",
        "C.J. Riseley",
        "I.D. Roberts",
        "S. Sethi",
        "A. Shulevski",
        "M. Stein",
        "C. Stuardi",
        "F. Sweijen",
        "S. ter Veen",
        "R. Timmerman"
      ],
      "abstract": "The LOFAR Two-metre Sky Survey: VII. Third Data Release T. W. Shimwell, M. J. Hardcastle, C. Tasse, A. Drabent, A. Botteon, W.L. Williams, P.N. Best, H.J.A. Röttgering, M. Brüggen, G. Brunetti, J.R. Callingham, K. T. Chyży, J.E. Conway, F. De Gasperin, M. Haverkorn, C. Horellou, N. Jackson, G.K. Miley, L.K. Morabito, R. Morganti, S.P. O'Sullivan, D.J. Schwarz, D.J.B. Smith, R.J. van Weeren, H.K. Vedantham, G.J. White, A. Ahmadi, L. Alegre, M. Arias, B. Asabere, B. Bahr-Kalus, B. Barkus, M. Bilicki, L. Böhme, M. Brentjens, M. Brienza, D.J. Bomans, A. Bonafede, M. Bonato, E. Bonnassieux, J.M. Boxelaar, S. Camera, R. Cassano, J. Chilufya, M. Cianfaglione, J.H. Croston, V.Cuciti, P.Dabhade, E. De Rubeis, J.M.G.H.J. de Jong, D. Dallacasa, R.J. Dettmar, K.J. Duncan, G. Di Gennaro, H.W. Edler, C. Groeneveld, G. Gürkan, M. Hajduk, C.L. Hale, V. Heesen, D.N. Hoang, M. Hoeft, H. Holties, M.A. Horton, M. Iacobelli, M. Jamrozy, M.J. Jarvis, V. Jelic, M. Kadler, R. Kondapally, M. Kunert-Bajraszewska, M. Loose, M. Magliocchetti, K. Małek, C. Manzano, J.P. McKean, M. Mevius, B. Mingo, A. Miskolczi, A. Misra, J. Moldón, D.G. Nair, S.J. Nakoneczny, E. Orru, M. Pashapour-Ahmadabadi, T. Pasini, J. Petley, J.C.S. Pierce, I. Prandoni, D. Rafferty, K. Rajpurohit, C.J. Riseley, I.D. Roberts, S. Sethi, A. Shulevski, M. Stein, C. Stuardi, F. Sweijen, S. ter Veen, R. Timmerman 15 figures, 2 tables and 22 pages. The catalogues, images and uv-data associated with this data release are publicly available via this https URL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present the third data release of the LOFAR Two-metre Sky Survey (LoTSS-DR3). The survey images cover 88% of the northern sky and were created from 12,950 hrs of data (18.6 PB) accumulated over 10.5 years. The images were produced through direction-independent and direction-dependent calibration pipelines that correct for instrumental effects as well as spatially and temporally varying ionospheric distortions. In our 120-168 MHz continuum mosaic images with an angular resolution of 6 arcsec (9 arcsec below declination 10$^\\circ$) we catalogue 13,667,877 sources, formed from 16,943,656 Gaussian components. The scatter in the astrometric precision approximately follows the expected noise-like behaviour but with an additional systematic component of at least 0.24 arcsec that is likely due to calibration imperfections. The random flux density scale error is 6%, while the systematic offset was previously shown to be within 2%. The median sensitivity of our mosaics is 92$\\mu$Jy beam$^{-1}$. Completeness simulations, accounting for realistic source models, time- and bandwidth-smearing effects, and astrometric errors, indicate that we detect more than 95% of compact sources with integrated flux densities exceeding 9 times the local root mean square (RMS) noise. However, the recovered source counts in a particular integrated flux density bin do not match the injected counts until flux densities exceed 45 times the local RMS noise. The Euclidean-normalised differential source counts derived from the survey constrain the radio source population over five orders of magnitude and are in good agreement with previous deep and wide-area surveys. All data products are publicly available, including catalogues, individual-field Stokes I, Q, U, and V images, mosaicked Stokes I images, and $uv$ data with associated direction-dependent calibration solutions.",
      "pdf_url": "https://arxiv.org/pdf/2602.15949.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15952",
      "title": "Gas Accretion versus BH Merger driven Growth Modes of Supermassive Black Holes and Implications for the Little Red Dots",
      "authors": [
        "Paramita Barai"
      ],
      "abstract": "Gas Accretion versus BH Merger driven Growth Modes of Supermassive Black Holes and Implications for the Little Red Dots Paramita Barai 11 pages, 8 figures. Accepted for publication in Astronomy and Astrophysics (A&A) Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the growth of central supermassive black holes in galaxies, aiming to distinguish between gas accretion versus BH merger-driven growth modes. By performing and analysing cosmological hydrodynamical simulations of $(50 ~ {\\rm Mpc})^3$ comoving boxes, we also study how the BH feedback parameters affect the coevolution between SMBHs and their host galaxies. Starting as $10^5 M_{\\odot}$ seeds, we find that the BHs grow initially via BH mergers to $\\sim 10^7 M_{\\odot}$. Gas accretion onto the BHs is initially low, then increases with time, and reaches the Eddington rate after $7-9$ Gyrs. The BHs then undergo very fast growth via efficient gas accretion over a period of $600 - 700$ Myr, when the BH mass increases $10^2 - 10^3$ times, causing their predominant growth from $10^7 M_{\\odot}$ to $(10^9 - 10^{10}) M_{\\odot}$. Taking into account the cosmological gas inflows and outflows, SMBHs do not grow to more than $10^{10} M_{\\odot}$ by $z=0$, because of gas depletion from galaxy centers driven by AGN feedback. In terms of SMBH - host galaxy coevolution along the $M_{\\rm BH} - M_{\\star}$ relation, we find that they initially lie below and thereby move upward toward the relation. We make some physical implications of the growth of high-$z$ Little Red Dots recently observed by JWST: the normal-mass SMBHs had predominantly undergone BH merger driven evolution, whereas the overmassive BHs underwent periods of Eddington-limited or super-Eddington bursts of gas accretion.",
      "pdf_url": "https://arxiv.org/pdf/2602.15952.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15974",
      "title": "Stellar microlensing as a probe of Primordial Black Holes: status and prospects",
      "authors": [
        "Anne M. Green"
      ],
      "abstract": "Stellar microlensing as a probe of Primordial Black Holes: status and prospects Anne M. Green Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Stellar microlensing is a powerful tool for probing dark matter in the form of planetary and stellar mass compact objects (COs), in particular primordial black holes (PBHs). Under standard assumptions, current observations exclude COs in the mass range $10^{-11} \\lesssim M/M_{\\odot} \\lesssim 10^{4}$ making up all of the dark matter. We provide an overview, aimed at theorists working on PBHs, of the history, theory, observational status, and future prospects of the field.",
      "pdf_url": "https://arxiv.org/pdf/2602.15974.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2402.10697",
      "title": "Dark Energy Survey: Galaxy Sample for the Baryonic Acoustic Oscillation Measurement from the Final Dataset",
      "authors": [
        "J. Mena-Fernández",
        "M. Rodríguez-Monroy",
        "S. Avila",
        "A. Porredon",
        "K. C. Chan",
        "H. Camacho",
        "N. Weaverdyck",
        "I. Sevilla-Noarbe",
        "E. Sanchez",
        "L. Toribio San Cipriano",
        "J. De Vicente",
        "I. Ferrero",
        "R. Cawthon",
        "A. Carnero Rosell",
        "J. Elvin-Poole",
        "G. Giannini",
        "M. Adamow",
        "K. Bechtol",
        "A. Drlica-Wagner",
        "R. A. Gruendl",
        "W. G. Hartley",
        "A. Pieres",
        "A. J. Ross",
        "E. S. Rykoff",
        "E. Sheldon",
        "B. Yanny",
        "T. M. C. Abbott",
        "M. Aguena",
        "S. Allam",
        "O. Alves",
        "A. Amon",
        "F. Andrade-Oliveira",
        "J. Annis",
        "D. Bacon",
        "J. Blazek",
        "S. Bocquet",
        "D. Brooks",
        "J. Carretero",
        "F. J. Castander",
        "C. Conselice",
        "M. Crocce",
        "L. N. da Costa",
        "M. E. S. Pereira",
        "T. M. Davis",
        "N. Deiosso",
        "S. Desai",
        "H. T. Diehl",
        "S. Dodelson",
        "C. Doux",
        "S. Everett",
        "J. Frieman",
        "J. García-Bellido",
        "E. Gaztanaga",
        "G. Gutierrez",
        "S. R. Hinton",
        "D. L. Hollowood",
        "K. Honscheid",
        "D. Huterer",
        "K. Kuehn",
        "O. Lahav",
        "S. Lee",
        "C. Lidman",
        "H. Lin",
        "J. L. Marshall",
        "F. Menanteau",
        "R. Miquel",
        "J. Myles",
        "R. L. C. Ogando",
        "A. Palmese",
        "W. J. Percival",
        "A. A. Plazas Malagón",
        "A. Roodman",
        "R. Rosenfeld",
        "S. Samuroff",
        "D. Sanchez Cid",
        "B. Santiago",
        "M. Schubnell",
        "M. Smith",
        "E. Suchyta",
        "M. E. C. Swanson",
        "G. Tarle",
        "D. Thomas",
        "C. To",
        "D. L. Tucker",
        "A. R. Walker",
        "J. Weller",
        "P. Wiseman",
        "M. Yamamoto"
      ],
      "abstract": "Dark Energy Survey: Galaxy Sample for the Baryonic Acoustic Oscillation Measurement from the Final Dataset J. Mena-Fernández, M. Rodríguez-Monroy, S. Avila, A. Porredon, K. C. Chan, H. Camacho, N. Weaverdyck, I. Sevilla-Noarbe, E. Sanchez, L. Toribio San Cipriano, J. De Vicente, I. Ferrero, R. Cawthon, A. Carnero Rosell, J. Elvin-Poole, G. Giannini, M. Adamow, K. Bechtol, A. Drlica-Wagner, R. A. Gruendl, W. G. Hartley, A. Pieres, A. J. Ross, E. S. Rykoff, E. Sheldon, B. Yanny, T. M. C. Abbott, M. Aguena, S. Allam, O. Alves, A. Amon, F. Andrade-Oliveira, J. Annis, D. Bacon, J. Blazek, S. Bocquet, D. Brooks, J. Carretero, F. J. Castander, C. Conselice, M. Crocce, L. N. da Costa, M. E. S. Pereira, T. M. Davis, N. Deiosso, S. Desai, H. T. Diehl, S. Dodelson, C. Doux, S. Everett, J. Frieman, J. García-Bellido, E. Gaztanaga, G. Gutierrez, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. Huterer, K. Kuehn, O. Lahav, S. Lee, C. Lidman, H. Lin, J. L. Marshall, F. Menanteau, R. Miquel, J. Myles, R. L. C. Ogando, A. Palmese, W. J. Percival, A. A. Plazas Malagón, A. Roodman, R. Rosenfeld, S. Samuroff, D. Sanchez Cid, B. Santiago, M. Schubnell, M. Smith, E. Suchyta, M. E. C. Swanson, G. Tarle, D. Thomas, C. To, D. L. Tucker, A. R. Walker, J. Weller, P. Wiseman, M. Yamamoto Phys. Rev. D 110, 063514 (2024) Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this paper we present and validate the galaxy sample used for the analysis of the baryon acoustic oscillation (BAO) signal in the Dark Energy Survey (DES) Y6 data. The definition is based on a color and redshift-dependent magnitude cut optimized to select galaxies at redshifts higher than 0.6, while ensuring a high-quality photo-$z$ determination. The optimization is performed using a Fisher forecast algorithm, finding the optimal $i$-magnitude cut to be given by $i$<19.64+2.894$z_{\\rm ph}$. For the optimal sample, we forecast an increase in precision in the BAO measurement of $\\sim$25% with respect to the Y3 analysis. Our BAO sample has a total of 15,937,556 galaxies in the redshift range 0.6<$z_{\\rm ph}$<1.2, and its angular mask covers 4,273.42 deg${}^2$ to a depth of $i$=22.5. We validate its redshift distributions with three different methods: directional neighborhood fitting algorithm (DNF), which is our primary photo-$z$ estimation; direct calibration with spectroscopic redshifts from VIPERS; and clustering redshift using SDSS galaxies. The fiducial redshift distribution is a combination of these three techniques performed by modifying the mean and width of the DNF distributions to match those of VIPERS and clustering redshift. In this paper we also describe the methodology used to mitigate the effect of observational systematics, which is analogous to the one used in the Y3 analysis. This paper is one of the two dedicated to the analysis of the BAO signal in DES Y6. In its companion paper, we present the angular diameter distance constraints obtained through the fitting to the BAO scale.",
      "pdf_url": "https://arxiv.org/pdf/2402.10697.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2402.10881",
      "title": "AbacusPNG: A modest set of simulations of local-type primordial non-Gaussianity in the DESI era",
      "authors": [
        "Boryana Hadzhiyska",
        "Lehman Garrison",
        "Daniel J. Eisenstein",
        "Simone Ferraro"
      ],
      "abstract": "AbacusPNG: A modest set of simulations of local-type primordial non-Gaussianity in the DESI era Boryana Hadzhiyska, Lehman Garrison, Daniel J. Eisenstein, Simone Ferraro Cosmology and Nongalactic Astrophysics (astro-ph.CO) A measurement of a primordial non-Gaussianity (PNG) signal through late- or early-Universe probes has the potential to transform our understanding of the physics of the primordial Universe. $N$-body simulations, such as the public \\textsc{AbacusPNG} set presented in this study, consisting of 9 boxes, each of size $L_{\\rm box} = 2~{\\rm Gpc}/h$ and particle mass of $1.01 \\times 10^{10} \\ M_\\odot/h$, provide a viable path forward. As validation, we find good agreement between the simulations and our expectations from one-loop perturbation theory and the `separate universe' method for the matter bispectrum, matter power spectrum and the halo bias parameter associated with PNG, $b_\\phi$. As a science application, we investigate the link between halo assembly bias and $b_\\phi$ for halo properties known to play a vital role in accurately predicting galaxy clustering: concentration, shear (environment), and accretion rate. We find a strong response for all three parameters, suggesting that the connection between $b_\\phi$ and the assembly history of halos needs to be taken into account by future PNG analyses. We further perform the first study of the $b_\\phi$ parameter from fits to early DESI data of the luminous red galaxy (LRG) and quasi-stellar object (QSO) samples and comment on the effect on $f_{\\rm NL}$ constraints for the allowed galaxy-halo models (note that $\\sigma [f_{\\rm NL}] \\propto \\frac{\\sigma [b_\\phi]}{b_\\phi}$). We find that the error on $f_{\\rm NL}$ is 21, 6, 22 for the LRGs at $z = 0.5$ and $z = 0.8$ and QSOs at $z = 1.4$, respectively, suggesting that a thorough understanding of galaxy assembly bias is warranted so as to perform robust high-precision analysis of local-type PNG with future surveys. Simulations publicly available at this https URL",
      "pdf_url": "https://arxiv.org/pdf/2402.10881.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.01602",
      "title": "The Effect of Foreground Galaxies on the Estimation of the Hubble Constant from Type Ia Supernovae",
      "authors": [
        "Amalia Villarrubia Aguilar",
        "Julian Adamek"
      ],
      "abstract": "The Effect of Foreground Galaxies on the Estimation of the Hubble Constant from Type Ia Supernovae Amalia Villarrubia Aguilar, Julian Adamek Accepted version. Matches published article Cosmology and Nongalactic Astrophysics (astro-ph.CO) Type Ia supernovae are the established `standard candle' in the construction of the Hubble diagram out to high luminosity distances. Since the Hubble constant that best fits observations of these supernovae often turns out to be high compared to fits to other data, they are currently being investigated for possible systematic effects, with many studies focusing on the calibration of the distance ladder in the local Universe. Here we present a simulation-based assessment of another type of systematic effect, related to the chance that the line of sight to a distant supernova passes close to a foreground galaxy. We consider two cases separately: First, the foreground galaxy may block the line of sight so that the supernova is not observed. Since foreground galaxies are correlated with overdensities that typically magnify the flux of background sources, this effect leads to a systematic removal of lensed supernovae from the sample, biasing the high-redshift Hubble diagram towards demagnified (fainter) supernovae. Second, if the supernova can be observed, its proximity to the foreground galaxy can lead to an incorrect host assignment, especially if the true host has a low surface brightness. Since foreground galaxies are typically found at lower redshifts, this effect introduces another systematic bias. The probability of line-of-sight alignments with foreground galaxies increases with redshift and therefore affects distant supernovae more strongly. We find that both effects are small, but the effect of host misidentification should be included in the systematic error budget at current levels of measurement precision.",
      "pdf_url": "https://arxiv.org/pdf/2502.01602.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.18459",
      "title": "X-ray emission in IllustrisTNG circum-cluster environments. II -- Possible origins of the soft X-ray excess emission",
      "authors": [
        "Celine Gouin",
        "Daniela Galárraga-Espinosa",
        "Massimiliano Bonamente",
        "Stephen Walker",
        "Mohammad Mirakhor",
        "Richard Lieu",
        "Clotilde Laigle",
        "Etienne Bonnassieux",
        "Charlotte Welker",
        "Stefano Gallo",
        "Tony Bonnaire",
        "Jade Paste"
      ],
      "abstract": "X-ray emission in IllustrisTNG circum-cluster environments. II -- Possible origins of the soft X-ray excess emission Celine Gouin, Daniela Galárraga-Espinosa, Massimiliano Bonamente, Stephen Walker, Mohammad Mirakhor, Richard Lieu, Clotilde Laigle, Etienne Bonnassieux, Charlotte Welker, Stefano Gallo, Tony Bonnaire, Jade Paste 13 pages, 10 figures, accepted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) An excess of soft X-ray emission (0.2-1 keV) above the contribution from the hot intra-cluster medium (ICM) has been detected in a number of galaxy clusters, including the Coma cluster. The physical origin of this emitting medium above hot ICM has not yet been determined, especially whether it be thermal or non-thermal. We aim to investigate which gas phase and gas structure more accurately reproduce the soft excess radiation from the cluster core to the outskirts, using simulations. By using the simulation TNG300, we predict the radial profile of thermodynamic properties and the Soft-X-ray surface brightness of 138 clusters within 5 $R_{200}$. Their X-ray emission is simulated for the hot ICM gas phase, the entire Warm-Hot medium, the diffuse and low-density Warm-Hot Intergalactic Medium (WHIM). Inside clusters, the soft excess appears to be produced by substructures of the WARM gas phase which host dense warm clumps (i.e, the Warm Circum-Galactic Medium, WCGM), and in fact the inner soft excess is strongly correlated with substructure and WCGM mass fractions. Outside of the virial radius, the fraction of WHIM gas that is mostly inside filaments connected to clusters boosts the soft X-ray excess. The more diffuse the gas is, the higher the soft X-ray excess beyond the virial region. The thermal emission of WARM gas phase, in the form of WCGM clumps and WHIM diffuse filaments, reproduces well the soft excess emission that was observed up to the virial radius in Coma and in the inner regions of other massive clusters. Moreover, our analysis suggests that soft X-ray excess is a proxy of cluster dynamical state, with larger excess being observed in the most unrelaxed clusters.",
      "pdf_url": "https://arxiv.org/pdf/2506.18459.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.17593",
      "title": "Inflationary Fossils Beyond Perturbation Theory",
      "authors": [
        "Riccardo Impavido",
        "Nicola Bartolo"
      ],
      "abstract": "Inflationary Fossils Beyond Perturbation Theory Riccardo Impavido, Nicola Bartolo Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) In this work we provide the missing link between two approaches aimed at characterizing the effect of long perturbation modes in Inflation. We consider the Inflationary Fossils' approach (arXiv:1203.0302 and related works) that characterizes the power-spectrum of the inflaton field in presence of other long and non dynamical fossil fields, and a technique, appeared in arXiv:2103.09244, that computes, beyond perturbation theory, the power-spectrum of a scalar field in presence of a large fluctuation of a second field. We clarify a few points on the applicability of the non-perturbative technique. We prove in six distinct cases, one involving a violation of the consistency conditions, that the non-perturbative approach, once expanded to first order in the coupling, matches the perturbative result following the Fossils' approach. We believe that this non-perturbative technique extends to all orders the Fossils' approach, resumming infinitely many diagrams of standard in-in perturbation theory.",
      "pdf_url": "https://arxiv.org/pdf/2507.17593.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16202",
      "title": "Sound-Horizon-Agnostic Inference of the Hubble Constant and Neutrino Mass from BAO, CMB Lensing, and Galaxy Weak Lensing and Clustering",
      "authors": [
        "Helena García Escudero",
        "Seyed Hamidreza Mirpoorian",
        "Levon Pogosian"
      ],
      "abstract": "Sound-Horizon-Agnostic Inference of the Hubble Constant and Neutrino Mass from BAO, CMB Lensing, and Galaxy Weak Lensing and Clustering Helena García Escudero, Seyed Hamidreza Mirpoorian, Levon Pogosian 14 pages, 5 figures, 3 tables, minor revisions in V2, matches the version published in ApJL Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a sound-horizon-agnostic determination of the Hubble constant, $H_0$, by combining DESI DR2 baryon acoustic oscillation (BAO) data with the latest cosmic microwave background (CMB) lensing measurements from Planck, ACT, and SPT-3G, the angular size of the CMB acoustic scale, Dark Energy Survey Year-3 ($3\\times2$-pt) galaxy weak lensing and clustering correlations, and the Pantheon+ supernova sample. In this analysis, The sound horizon at the drag epoch, $r_d$, is treated as a free parameter. By combining uncalibrated comoving distances from BAO and supernovae with constraints on the matter density $\\Omega_m h^2$ from CMB and galaxy lensing/clustering, we break the $r_d$-$H_0$ degeneracy and obtain $H_0 = 70.0 \\pm 1.7$ km/s/Mpc when the sum of the neutrino masses is fixed at $\\Sigma m_\\nu = 0.06$ eV. With an informative prior on the amplitude of primordial fluctuations, $A_s$, we find $H_0 = 70.03 \\pm 0.97$ km/s/Mpc. Allowing $\\Sigma m_\\nu$ to vary, we find that the neutrino mass is weakly constrained and strongly prior-dependent. Consequently, the inferred $H_0$ is sensitive to the choice of the $\\Sigma m_\\nu$ prior, with a uniform prior biasing results toward larger neutrino masses and higher $H_0$, while a logarithmic prior reduces this bias significantly. Forecasts for the completed DESI BAO program, combined with Simons-Observatory-like CMB lensing, next-generation $3\\times2$-pt data, and expanded supernova samples predict $\\sigma(H_0) \\simeq 0.67$ km/s/Mpc with fixed $\\Sigma m_\\nu$, and $\\sigma(H_0) \\simeq 1.1$ km/s/Mpc with $\\Sigma m_\\nu < 0.133$ ($<0.263$) eV at 68% (95%) CL when $\\Sigma m_\\nu$ is varied.",
      "pdf_url": "https://arxiv.org/pdf/2509.16202.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04681",
      "title": "Dark Energy Survey Year 3 results: Simulation-based $w$CDM inference from weak lensing and galaxy clustering maps with deep learning: Analysis design",
      "authors": [
        "A. Thomsen",
        "J. Bucko",
        "T. Kacprzak",
        "V. Ajani",
        "J. Fluri",
        "A. Refregier",
        "D. Anbajagane",
        "F. J. Castander",
        "A. Ferté",
        "M. Gatti",
        "N. Jeffrey",
        "A. Alarcon",
        "A. Amon",
        "K. Bechtol",
        "M. R. Becker",
        "G. M. Bernstein",
        "A. Campos",
        "A. Carnero Rosell",
        "C. Chang",
        "R. Chen",
        "A. Choi",
        "M. Crocce",
        "C. Davis",
        "J. DeRose",
        "S. Dodelson",
        "C. Doux",
        "K. Eckert",
        "J. Elvin-Poole",
        "S. Everett",
        "P. Fosalba",
        "D. Gruen",
        "I. Harrison",
        "K. Herner",
        "E. M. Huff",
        "M. Jarvis",
        "N. Kuropatkin",
        "P.-F. Leget",
        "N. MacCrann",
        "J. McCullough",
        "J. Myles",
        "A. Navarro-Alsina",
        "S. Pandey",
        "A. Porredon",
        "J. Prat",
        "M. Raveri",
        "M. Rodriguez-Monroy",
        "R. P. Rollins",
        "A. Roodman",
        "E. S. Rykoff",
        "C. Sánchez",
        "L. F. Secco",
        "E. Sheldon",
        "T. Shin",
        "M. A. Troxel",
        "I. Tutusaus",
        "T. N. Varga",
        "N. Weaverdyck",
        "R. H. Wechsler",
        "B. Yanny",
        "B. Yin",
        "Y. Zhang",
        "J. Zuntz",
        "M. Aguena",
        "S. Allam",
        "F. Andrade-Oliveira",
        "D. Bacon",
        "J. Blazek",
        "D. Brooks",
        "R. Camilleri",
        "J. Carretero",
        "R. Cawthon",
        "L. N. da Costa",
        "M. E. da Silva Pereira",
        "T. M. Davis",
        "J. De Vicente",
        "S. Desai",
        "P. Doel",
        "J. García-Bellido",
        "G. Gutierrez",
        "S. R. Hinton",
        "D. L. Hollowood",
        "K. Honscheid",
        "D. J. James",
        "K. Kuehn",
        "O. Lahav",
        "S. Lee",
        "J. L. Marshall",
        "J. Mena-Fernández",
        "F. Menanteau",
        "R. Miquel",
        "J. Muir",
        "R. L. C. Ogando",
        "A. A. Plazas Malagón",
        "E. Sanchez",
        "D. Sanchez Cid",
        "I. Sevilla-Noarbe",
        "M. Smith",
        "E. Suchyta",
        "M. E. C. Swanson",
        "D. Thomas"
      ],
      "abstract": "Dark Energy Survey Year 3 results: Simulation-based $w$CDM inference from weak lensing and galaxy clustering maps with deep learning: Analysis design A. Thomsen, J. Bucko, T. Kacprzak, V. Ajani, J. Fluri, A. Refregier, D. Anbajagane, F. J. Castander, A. Ferté, M. Gatti, N. Jeffrey, A. Alarcon, A. Amon, K. Bechtol, M. R. Becker, G. M. Bernstein, A. Campos, A. Carnero Rosell, C. Chang, R. Chen, A. Choi, M. Crocce, C. Davis, J. DeRose, S. Dodelson, C. Doux, K. Eckert, J. Elvin-Poole, S. Everett, P. Fosalba, D. Gruen, I. Harrison, K. Herner, E. M. Huff, M. Jarvis, N. Kuropatkin, P.-F. Leget, N. MacCrann, J. McCullough, J. Myles, A. Navarro-Alsina, S. Pandey, A. Porredon, J. Prat, M. Raveri, M. Rodriguez-Monroy, R. P. Rollins, A. Roodman, E. S. Rykoff, C. Sánchez, L. F. Secco, E. Sheldon, T. Shin, M. A. Troxel, I. Tutusaus, T. N. Varga, N. Weaverdyck, R. H. Wechsler, B. Yanny, B. Yin, Y. Zhang, J. Zuntz, M. Aguena, S. Allam, F. Andrade-Oliveira, D. Bacon, J. Blazek, D. Brooks, R. Camilleri, J. Carretero, R. Cawthon, L. N. da Costa, M. E. da Silva Pereira, T. M. Davis, J. De Vicente, S. Desai, P. Doel, J. García-Bellido, G. Gutierrez, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. J. James, K. Kuehn, O. Lahav, S. Lee, J. L. Marshall, J. Mena-Fernández, F. Menanteau, R. Miquel, J. Muir, R. L. C. Ogando, A. A. Plazas Malagón, E. Sanchez, D. Sanchez Cid, I. Sevilla-Noarbe, M. Smith, E. Suchyta, M. E. C. Swanson, D. Thomas Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG) Data-driven approaches using deep learning are emerging as powerful techniques to extract non-Gaussian information from cosmological large-scale structure. This work presents the first simulation-based inference (SBI) pipeline that combines weak lensing and galaxy clustering maps in a realistic Dark Energy Survey Year 3 (DES Y3) configuration and serves as preparation for a forthcoming analysis of the survey data. We develop a scalable forward model based on the CosmoGridV1 suite of N-body simulations to generate over one million self-consistent mock realizations of DES Y3 at the map level. Leveraging this large dataset, we train deep graph convolutional neural networks on the full survey footprint in spherical geometry to learn low-dimensional features that approximately maximize mutual information with target parameters. These learned compressions enable neural density estimation of the implicit likelihood via normalizing flows in a ten-dimensional parameter space spanning cosmological $w$CDM, intrinsic alignment, and linear galaxy bias parameters, while marginalizing over baryonic, photometric redshift, and shear bias nuisances. To ensure robustness, we extensively validate our inference pipeline using synthetic observations derived from both systematic contaminations in our forward model and independent Buzzard galaxy catalogs. Our forecasts yield significant improvements in cosmological parameter constraints, achieving $2-3\\times$ higher figures of merit in the $\\Omega_m - S_8$ plane relative to our implementation of baseline two-point statistics and effectively breaking parameter degeneracies through probe combination. These results demonstrate the potential of SBI analyses powered by deep learning for upcoming Stage-IV wide-field imaging surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.04681.pdf",
      "categories": [
        "astro-ph.CO",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06092",
      "title": "Exploring Cosmological Tensions with Hubble Parameter Tomography via Linear Cosmography",
      "authors": [
        "Brett Bochner",
        "Aiden Jin"
      ],
      "abstract": "Exploring Cosmological Tensions with Hubble Parameter Tomography via Linear Cosmography Brett Bochner (Hofstra University), Aiden Jin 25 pages, 11 figures, 2 tables. (Version v2: All figures upgraded; data, comments, and references added.) Research presented at the 33rd Texas Symposium on Relativistic Astrophysics, Tempe, Arizona, December 9, 2025 Cosmology and Nongalactic Astrophysics (astro-ph.CO) Given the persistence of various tensions in the \"Cosmic Concordance\" -- such as the \"Hubble Tension\", and possible departures from LambdaCDM time evolution -- seen from combinations of complementary data sets (e.g., Cosmic Microwave Background, Baryon Acoustic Oscillations, Type Ia Supernovae), it remains an ongoing possibility for these to have a real cosmological origin. If one assumes such deviations to be real, a model-independent formalism (cosmography) is useful for locating the source of the problem with concordance cosmology. The extraordinarily good fit of LambdaCDM to CMB data shows that it was a successful model of the universe at high redshift. Yet at lower redshift -- when the dark energy density becomes significant, and its precise physical nature becomes important -- the universe may have gone off the track of simple LambdaCDM. Here we use linear cosmography fits to binned Supernova data to reconstruct the detailed temporal history of the Hubble parameter, probing for interesting time-dependent behaviors of the expansion rate during and after the onset of cosmic acceleration. Using combined Type Ia supernovae from the Dark Energy Survey 5-Year data release and the Union2.1 compilation, we find intriguing hints of oscillations in the Hubble parameter during the acceleration era. While these hints are of limited statistical significance, and not robust under different redshift binnings, we present this work as a proof-of-concept demonstration of this method for reconstructing the Hubble parameter evolution, which may be useful for the voluminous Supernova data sets anticipated to become available during the next few years.",
      "pdf_url": "https://arxiv.org/pdf/2602.06092.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16214",
      "title": "Cosmic Ray Spectra and Metal Budget Regulated by the Galactic Wind",
      "authors": [
        "Yusaku Fukumoto",
        "Katsuaki Asano",
        "Jiro Shimoda"
      ],
      "abstract": "Cosmic Ray Spectra and Metal Budget Regulated by the Galactic Wind Yusaku Fukumoto, Katsuaki Asano, Jiro Shimoda High Energy Astrophysical Phenomena (astro-ph.HE) We study the advection effect of the Galactic wind on the local cosmic ray spectra. The spectral hardening from a few hundred GV and softening from a few TV are reproduced by a velocity profile with a maximum velocity of $\\sim 700~\\mbox{km}~ \\mbox{s}^{-1}$ without introducing a break in the power-law dependence of the diffusion coefficient. Additionally, we find that a hard CR spectrum below $\\sim$ TV with an index of $\\sim 2$ at an altitude $\\sim 3$-$5$ kpc from the Galactic disk. This hard spectrum is favorable for the gamma-ray spectrum of the Fermi bubbles. With the obtained CR fluxes, we discuss the matter circulation in our Galaxy with the wind. While the wind has an essential role in maintaining the metal abundance in the disk, the production rate of Beryllium, which originates from CR spallation, is so low that the ratio Be/O in the halo should be larger than that in the disk gas.",
      "pdf_url": "https://arxiv.org/pdf/2602.16214.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16227",
      "title": "The Enigmatic Type Icn Supernova 2024abvb Located ~22 kpc from Its Host Galaxy",
      "authors": [
        "J. Shi",
        "K. Auchettl",
        "W. B. Hoogendam",
        "D. Farias",
        "N. Sarin",
        "K. W. Davis",
        "N. Morrell",
        "J. T. Hinkle",
        "D. O. Jones",
        "C. Lidman",
        "C. Angus",
        "C. Ashall",
        "C. R. Burns",
        "D. D. Desai",
        "A. Do",
        "L. Galbany",
        "E. Y. Hsiao",
        "M. E. Huber",
        "M. Y. Kong",
        "B. Martin",
        "K. Medler",
        "A. Möller",
        "C. Pfeffer",
        "A. Polin",
        "L. Rauf",
        "S. Romagnoli",
        "B. Schmidt",
        "B. J. Shappee",
        "M. D. Stritzinger",
        "A. Syncatto",
        "B. E. Tucker",
        "M. A. Tucker"
      ],
      "abstract": "The Enigmatic Type Icn Supernova 2024abvb Located ~22 kpc from Its Host Galaxy J. Shi, K. Auchettl, W. B. Hoogendam, D. Farias, N. Sarin, K. W. Davis, N. Morrell, J. T. Hinkle, D. O. Jones, C. Lidman, C. Angus, C. Ashall, C. R. Burns, D. D. Desai, A. Do, L. Galbany, E. Y. Hsiao, M. E. Huber, M. Y. Kong, B. Martin, K. Medler, A. Möller, C. Pfeffer, A. Polin, L. Rauf, S. Romagnoli, B. Schmidt, B. J. Shappee, M. D. Stritzinger, A. Syncatto, B. E. Tucker, M. A. Tucker 25 pages, 18 figures, 4 tables. Submitted to PASA High Energy Astrophysical Phenomena (astro-ph.HE) We report multiwavelength observations of the highly offset (~22.4 kpc) SN 2024abvb, the sixth Type Icn supernova to date. With a peak magnitude of Mr = -19.55 +/- 0.11 mag, it is among the most luminous in the existing sample and shows similar colours and decline rates to other SNe Icn. The early optical spectra show a blue continuum with narrow C II features (vFWHM ~ 2000 km s^-1), consistent with a typical wind velocity of a Wolf-Rayet star. The absence of C III lambda 5696 emission at the time of explosion is consistent with a Type Ibn supernova; however, the lack of narrow He lines in both the optical and near-infrared spectra supports a SNe Icn classification. Unlike the majority of SNe Icn, we do not detect broad features in the late-time (7-21 days relative to o-band peak) spectral phase of SN 2024abvb. Semi-analytical modelling of the light curves shows that it can be reproduced by ~2.6 Msun of SN ejecta interacting with ~0.3 Msun of circumstellar material (CSM), both larger than other SNe Icn but consistent with rapidly evolving SNe Ibn. The metallicity at the SN location is significantly lower than the global metallicity of its host galaxy, suggesting that line-driven mass loss required to strip the progenitor of its H and He envelopes was likely inefficient. We estimate the star-formation-rate history at the location of SN 2024abvb and find that it lies at the bottom ~5th percentile among SESNe hosts, inconsistent with a Wolf-Rayet progenitor. Based on its spectral features, local and host environment properties, and host-galaxy offset, we favour an 8-10 Msun star stripped by a compact companion as the progenitor, with a sufficient runaway velocity to reach the observed offset.",
      "pdf_url": "https://arxiv.org/pdf/2602.16227.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16252",
      "title": "A XRISM View of the Iron Line Complex in NGC 1068: Rethinking the Prototypical Compton-Thick AGN",
      "authors": [
        "S. Bianchi",
        "B. Vander Meulen",
        "E. Bertola",
        "V. Braito",
        "A. Comastri",
        "P. Condò",
        "M. Dadina",
        "R. Della Ceca",
        "A. De Rosa",
        "V. E. Gianolli",
        "M. Guainazzi",
        "K. Iwasawa",
        "E. Kammoun",
        "M. Laurenti",
        "A. Marinucci",
        "G. Matt",
        "R. Middei",
        "G. Miniutti",
        "E. Nardini",
        "F. Nicastro",
        "F. Panessa",
        "P.-O. Petrucci",
        "E. Piconcelli",
        "C. Pinto",
        "G. Ponti",
        "R. Serafinelli",
        "P. Severgnini",
        "D. Tagliacozzo",
        "F. Tombesi",
        "A. Tortosa",
        "F. Ursini",
        "C. Vignali",
        "L. Zappacosta"
      ],
      "abstract": "A XRISM View of the Iron Line Complex in NGC 1068: Rethinking the Prototypical Compton-Thick AGN S. Bianchi, B. Vander Meulen, E. Bertola, V. Braito, A. Comastri, P. Condò, M. Dadina, R. Della Ceca, A. De Rosa, V. E. Gianolli, M. Guainazzi, K. Iwasawa, E. Kammoun, M. Laurenti, A. Marinucci, G. Matt, R. Middei, G. Miniutti, E. Nardini, F. Nicastro, F. Panessa, P.-O. Petrucci, E. Piconcelli, C. Pinto, G. Ponti, R. Serafinelli, P. Severgnini, D. Tagliacozzo, F. Tombesi, A. Tortosa, F. Ursini, C. Vignali, L. Zappacosta High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We analyze an XRISM/Resolve observation of NGC1068, focusing on the Fe K$\\alpha$ and Fe K$\\beta$ fluorescent lines and on the Fe XXV and Fe XXVI emission complexes. Line centroid energies, intrinsic widths, flux ratios, and constraints on the Compton shoulder are derived through local spectral fitting, and compared with atomic calculations and theoretical predictions. The centroid energies of the Fe K$\\alpha$ and Fe K$\\beta$ lines tightly constrain the emitting material to be neutral or near-neutral. The observed Fe K$\\beta$/K$\\alpha$ ratio, together with the stringent upper limit on the Compton shoulder ($\\lesssim$8--11% of the core flux), disfavour reflection dominated by a homogeneous, classical Compton-thick medium, indicating that most of the neutral Fe K$\\alpha$ emission arises in optically thin or moderately Compton-thick gas. The Fe XXV and Fe XXVI emission lines exhibit remarkably large velocity widths, of several thousand km~s$^{-1}$. These broad profiles closely resemble the integrated optical and infrared [O III] and [O IV] lines associated with the large-scale biconical outflow, and are naturally interpreted as the X-ray signature of a more highly ionized, faster, and more spatially confined phase of the same outflow. The iron-K emission of NGC1068 reveals a stratified circumnuclear environment in which neutral and highly ionized components arise in physically distinct regions. The neutral Fe K fluorescence originates predominantly in optically thin or mildly Compton-thick material, despite the persistently Compton-thick line-of-sight obscuration, indicating a geometrically complex cold reprocessor. The highly ionized iron emission lines trace a fast component consistent with a warm bipolar outflow on parsec scales, whose large velocities and inferred energetics suggest that it may represent an efficient channel for feedback in a heavily obscured Seyfert galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2602.16252.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16409",
      "title": "A fast radio burst cyclone in technicolour: evidence of plasma lensing",
      "authors": [
        "Pavan A. Uttarkar",
        "Ryan M. Shannon",
        "Kelly Gourdji",
        "Adam T. Deller",
        "Pravir Kumar",
        "Navin Sridhar",
        "Marcus E. Lower",
        "Artem Tuntsov",
        "Atharva D. Kulkarni",
        "Simon C.-C. Ho",
        "Yuanming Wang",
        "Joscha N. Jahns-Schindler"
      ],
      "abstract": "A fast radio burst cyclone in technicolour: evidence of plasma lensing Pavan A. Uttarkar, Ryan M. Shannon, Kelly Gourdji, Adam T. Deller, Pravir Kumar, Navin Sridhar, Marcus E. Lower, Artem Tuntsov, Atharva D. Kulkarni, Simon C.-C. Ho, Yuanming Wang, Joscha N. Jahns-Schindler High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs) are bright, energetic, radio pulses of extragalactic origin. A dichotomy has emerged in the population: some produce repeat bursts, while the majority do not. Most repeating sources only show rare repetitions, and none have been studied extensively over the wide bandwidths necessary to disentangle the physical processes that produce emission from distortions to bursts caused by intervening ionised gas. Here we present radio observations of the most active repeating source, FRB 20240114A. Using an ultrawideband receiving system, we have detected 5526 repetitions, revealing an extreme spectral and temporal variability in the burst emission. The bursts exhibit longer-term broadband variations in central emission frequency over multiple months, and narrowband bursts that have correlations in central frequencies on time scales of milliseconds to minutes. The spectral and temporal properties are consistent with the source undergoing magnification by foreground plasma lenses, potentially embedded in a turbulent circumsource medium. This extreme example highlights the role of plasma lenses in the observed properties of burst emission and can explain the diversity in activity and energetics of the entire FRB population.",
      "pdf_url": "https://arxiv.org/pdf/2602.16409.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16496",
      "title": "Resolving the Multiple Component Outflows in PG 1211+143: II. The Soft X-ray View of the Ultra Fast Outflow",
      "authors": [
        "James Reeves",
        "Valentina Braito",
        "Misaki Mizumoto",
        "Steven Kraemer",
        "Ehud Behar",
        "Chris Done",
        "Kouichi Hagino",
        "Gabriele Matzeu",
        "Hirofumi Noda",
        "Mariko Nomura",
        "Shoji Ogawa",
        "Ken Ohsuga",
        "Atsushi Tanimoto",
        "Tracey Turner",
        "Yoshihiro Ueda",
        "Satoshi Yamada",
        "Sreeparna Ganguly",
        "Paolo Somenzi",
        "Omer Reich"
      ],
      "abstract": "Resolving the Multiple Component Outflows in PG 1211+143: II. The Soft X-ray View of the Ultra Fast Outflow James Reeves, Valentina Braito, Misaki Mizumoto, Steven Kraemer, Ehud Behar, Chris Done, Kouichi Hagino, Gabriele Matzeu, Hirofumi Noda, Mariko Nomura, Shoji Ogawa, Ken Ohsuga, Atsushi Tanimoto, Tracey Turner, Yoshihiro Ueda, Satoshi Yamada, Sreeparna Ganguly, Paolo Somenzi, Omer Reich 23 pages, 10 figures, accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) The nearby quasar, PG 1211+143, has one of the prototype examples of an ultra fast outflow (UFO), as seen in several past XMM-Newton and Chandra observations. In December 2024, PG 1211+143 was observed simultaneously with XRISM Resolve and XMM-Newton, allowing both the Fe K and soft X-ray outflows to be examined at high resolution simultaneously. The Resolve spectrum revealed a forest of Fe K band absorption lines from the UFO (Mizumoto et al. 2026), comprising of up to six discrete velocity components ranging from $v/c=-0.074$ to $v/c=-0.40$. Here we present the simultaneous XMM-Newton RGS (Reflection Grating Spectrometer) spectrum, where three lower ionization counterparts of the Fe K velocity zones are observed; at $v/c=-0.074, -0.12$ and $-0.33$. The soft X-ray absorbers tend to be somewhat less ionized than their Fe K counterparts, with their opacity mainly arising from Fe L shell lines and highly ionized Oxygen. From comparing the Resolve and RGS absorbers, we show that the outflow can be parameterized with a density profile varying with radius as $r^{-5/3}$, while the lower ionization zones likely originate from denser clumps of gas. Pure electron scattering appears insufficient to provide enough thrust to power the wind, unless sufficient low ionization gas capable of radiative line driving exists outside of the line of sight. Overall, PG 1211+143 provides further evidence for the clumpy nature of accretion disk winds, as was recently revealed in the quasar PDS 456 with XRISM.",
      "pdf_url": "https://arxiv.org/pdf/2602.16496.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16559",
      "title": "GOTO identification and broadband modelling of the counterpart to the SVOM GRB 250818B",
      "authors": [
        "Sergey Belkin",
        "Gavin P. Lamb",
        "Kristian Ackley",
        "Matthew E. Wortley",
        "Stuart McGee",
        "Genevieve Schroeder",
        "Manor Shrestha",
        "Benjamin P. Gompertz",
        "Duncan K. Galloway",
        "Rebecca Starling",
        "Wen-fai Fong",
        "Tanmoy Laskar",
        "Chang Liu",
        "Alexander C. Gordon",
        "Nikolai Pankov",
        "Alexander E. Volvach",
        "Leonid N. Volvach",
        "Alexander Shein",
        "Andrey Pozanenko",
        "Matthew J. Dyer",
        "James Lyman",
        "Krzysztof Ulaczyk",
        "Danny Steeghs",
        "Vik Dhillon",
        "Paul O'Brien",
        "Gavin Ramsay",
        "K. Noysena",
        "Rubina Kotak",
        "Ryan P. Breton",
        "Laura K. Nuttall",
        "Danny Pollacco",
        "Supachai Awiphan",
        "Jorge Casares",
        "Patrick Chote",
        "Adam Chrimes",
        "Richard Eyles-Ferris",
        "Ben Godson",
        "P. Irawati",
        "David Jarvis",
        "Y. Julakanti",
        "Luke Kelsey",
        "Michael R. Kennedy",
        "Thomas Killestein",
        "A. Kumar",
        "Andrew Levan",
        "Sarah Littlefair",
        "Michael Magee",
        "S. Mandhai",
        "David Mata Sánchez",
        "Seppo Mattila",
        "James McCormac",
        "D. Mkrtichian",
        "S. Moran",
        "James Mullaney",
        "David O'Neill",
        "M. Patel",
        "Kevin Pu",
        "Matt Pursiainen",
        "A. Sahu",
        "U. Sawangwit",
        "Emma Stanway",
        "Y. Sun",
        "B. Warwick",
        "Katherine Wiersema"
      ],
      "abstract": "GOTO identification and broadband modelling of the counterpart to the SVOM GRB 250818B Sergey Belkin, Gavin P. Lamb, Kristian Ackley, Matthew E. Wortley, Stuart McGee, Genevieve Schroeder, Manor Shrestha, Benjamin P. Gompertz, Duncan K. Galloway, Rebecca Starling, Wen-fai Fong, Tanmoy Laskar, Chang Liu, Alexander C. Gordon, Nikolai Pankov, Alexander E. Volvach, Leonid N. Volvach, Alexander Shein, Andrey Pozanenko, Matthew J. Dyer, James Lyman, Krzysztof Ulaczyk, Danny Steeghs, Vik Dhillon, Paul O'Brien, Gavin Ramsay, K. Noysena, Rubina Kotak, Ryan P. Breton, Laura K. Nuttall, Danny Pollacco, Supachai Awiphan, Jorge Casares, Patrick Chote, Adam Chrimes, Richard Eyles-Ferris, Ben Godson, P. Irawati, David Jarvis, Y. Julakanti, Luke Kelsey, Michael R. Kennedy, Thomas Killestein, A. Kumar, Andrew Levan, Sarah Littlefair, Michael Magee, S. Mandhai, David Mata Sánchez, Seppo Mattila, James McCormac, D. Mkrtichian, S. Moran, James Mullaney, David O'Neill, M. Patel, Kevin Pu, Matt Pursiainen, A. Sahu, U. Sawangwit, Emma Stanway, Y. Sun, B. Warwick, Katherine Wiersema 24 pages, 20 figures (including Appendix), 9 tables. To be submitted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Rapid localisation and follow-up of gamma-ray bursts (GRBs) increasingly rely on low-latency triggers from new missions coupled to wide-field robotic optical facilities. We present the discovery and multi-wavelength follow-up of GRB 250818B, detected by the Space Variable Objects Monitor (SVOM) and localised optically by the Gravitational-wave Optical Transient Observer (GOTO). We compile and homogenise X-ray, optical/NIR, and radio data to build broadband light curves and spectral energy distributions. The afterglow is unusually luminous for a nominal short GRB, lying on the bright end of the short-GRB population in X-rays and optical and among the most luminous high-redshift short-GRB afterglows in the radio. MeerKAT detects the source at 3.1 GHz, while ALMA provides deep higher-frequency limits. Keck/LRIS spectroscopy shows continuum and metal absorption (Fe II, Mg II, Mg I), giving $z=1.216$. Synchrotron forward-shock modelling favours a constant-density medium and strongly prefers refreshed (energy-injection) emission, well described by a two-component jet with $E_{K,iso} \\sim 4\\times10^{52}$ erg, $n_0 \\sim 3.6$ cm$^{-3}$, $\\theta_j \\simeq 0.10$ rad ($\\sim 5.7$ deg), and $p \\simeq 1.64$. The host association is ambiguous: the nearest LS DR10 galaxy candidate ($r_{AB} \\sim 24.7$) is offset by $\\sim 4$ arcsec ($\\sim 34$ kpc) with chance-alignment probability $P_{cc} \\sim 0.2$, and current imaging does not exclude a fainter, near-coincident host. SED fitting of the candidate host suggests a low-mass galaxy. GRB 250818B highlights the power of rapid wide-field counterpart identification in the SVOM era, while host-association uncertainty can still limit offset-based interpretation.",
      "pdf_url": "https://arxiv.org/pdf/2602.16559.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.15938",
      "title": "Implications of the nanoHertz Gravitational-Wave Background for Galactic Feedback and Massive Black Hole Growth",
      "authors": [
        "Megan Taylor Tillman",
        "Blakesley Burkhart",
        "Chiara M. F. Mingarelli",
        "J. Andrew Casey-Clyde",
        "Lars Hernquist",
        "Sownak Bose",
        "Eniko Regos",
        "César Hernández-Aguayo"
      ],
      "abstract": "Implications of the nanoHertz Gravitational-Wave Background for Galactic Feedback and Massive Black Hole Growth Megan Taylor Tillman, Blakesley Burkhart, Chiara M. F. Mingarelli, J. Andrew Casey-Clyde, Lars Hernquist, Sownak Bose, Eniko Regos, César Hernández-Aguayo 19 pages, 7 figures, 2 tables, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate how pulsar timing array (PTA) measurements of the nanoHertz gravitational-wave background (GWB) can constrain models for the growth history of supermassive black holes (SMBHs) and how active galactic nucleus (AGN) and stellar feedback models can affect GWB predictions. Feedback regulates supermassive black hole (SMBH) growth, altering the black hole mass function (BHMF). Using BHMFs drawn from multiple cosmological simulation suites including IllustrisTNG, MillenniumTNG, Simba, and CAMELS, and combining these with a quasar-based SMBH binary population framework, we predict the resulting GWB amplitude under a range of different stellar and AGN feedback prescriptions. We find that the choice of both stellar and AGN feedback models alters the high-mass end of the BHMF and changes the predicted GWB amplitude by up to a factor of 2 for the fiducial simulations and a factor 10 for extreme feedback variations in CAMELS. Models with inefficient or absent AGN feedback produce abundant SMBHs and yield GWB amplitudes consistent with PTA data, yet fail in producing realistic galaxies. Fiducial models of AGN and stellar feedback suppress SMBH growth too much and under-predict the expected signal, an effect which could possibly be mitigated by more realistic black hole seeding and growth prescriptions. The mismatch between the GWB amplitudes predicted by cosmological simulations and those observed by PTAs suggests that SMBH growth is more efficient or occurs earlier than captured by current models. This demonstrates that PTA measurements provide a powerful new probe of feedback physics and the SMBH population.",
      "pdf_url": "https://arxiv.org/pdf/2602.15938.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.15939",
      "title": "Particle-in-Cell Methods for Simulations of Sheared, Expanding, or Escaping Astrophysical Plasma",
      "authors": [
        "Fabio Bacchini",
        "Evgeny A. Gorbunov",
        "Maximilien Péters de Bonhome",
        "Paul Els",
        "Konstantinos-Xanthos Argyropoulos",
        "Minh Nhat Ly",
        "Daniel Grošelj"
      ],
      "abstract": "Particle-in-Cell Methods for Simulations of Sheared, Expanding, or Escaping Astrophysical Plasma Fabio Bacchini, Evgeny A. Gorbunov, Maximilien Péters de Bonhome, Paul Els, Konstantinos-Xanthos Argyropoulos, Minh Nhat Ly, Daniel Grošelj Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Particle-in-Cell (PIC) methods have achieved widespread recognition as simple and flexible approaches to model collisionless plasma physics in fully kinetic simulations of astrophysical environments. However, in many situations the standard PIC algorithm must be extended to include macroscopic effects in microscale simulations. For plasmas subjected to shearing or expansion, shearing-box and expanding-box methods can be incorporated into PIC to account for these global effects. For plasmas subjected to local acceleration in confined regions of space, a leaky-box method can allow closed-box PIC simulations to account for particle escape from the accelerator region. In this work, we review and improve methods to include shearing, expansion, and escape in PIC simulations. We provide the numerical details of how Maxwell's equations and the particle equations of motion are solved in each case, and introduce generalized Boris-like particle pushers to solve the momentum equation in the presence of extra forces. This work is intended to serve as a comprehensive reference for the implementation of shearing-box, expanding-box, and leaky-box algorithms in PIC.",
      "pdf_url": "https://arxiv.org/pdf/2602.15939.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/astro-ph/9605166",
      "title": "Precessing Gamma Jets in extended and evaporating galactic halo as a source of GRB",
      "authors": [
        "D. Fargion",
        "A. Salis"
      ],
      "abstract": "Precessing Gamma Jets in extended and evaporating galactic halo as a source of GRB D. Fargion (Phys. Dept. University of Rome1-INFN), A. Salis (Phys Dept. University of Rome1) Astrophysics (astro-ph); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Inverse Compton Scattering (ICS) by a relativistic electron beam jet at GeV energies (emitted by a compact object as a NS, BH,...), a NSJ, onto thermal BBR photons (from a nearby stellar companion) may originate a collinear gamma jet (GJ). Due to the binary system interaction the GJ precession would blaze suddenly toward the observer leading to a GRB event. The internal GJ cone structure is ruled by relativistic kinematics into a concentric onion-like sequence of photon rings, the softer in the external boundaries, the harder in the inner cone. The pointing and the crossing of such different GJ photon rings to the detector lead to a GRB hardness spectra evolution nearly corresponding to most observed ones. Moreover expected time integral spectra are also comparable with known GRB spectra. The total energy input of tens of thousands of such NSJ in an extended galactic halo, mainly cosmic rays electrons, should be reflected into the recent observational evidence (COMPTEL) of a diffused relic extended halo. Evidences of such precessing jets are offered by the discover of galactic superluminal sources, recent HH jets, SN1987A outer rings, Hourglass Nebula, planetary Egg Nebula, GROJ1744-28 binary X-rays pulsar.",
      "pdf_url": "https://arxiv.org/pdf/astro-ph/9605166.pdf",
      "categories": [
        "astro-ph",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/astro-ph/9605168",
      "title": "Inverse Compton Scattering onto BBR in High Energy Physics and Gamma (MeV-Tev) Astrophysics",
      "authors": [
        "D. Fargion",
        "A. Salis"
      ],
      "abstract": "Inverse Compton Scattering onto BBR in High Energy Physics and Gamma (MeV-Tev) Astrophysics D. Fargion (University of Rome1-INFN), A. Salis (University of Rome1) Latex file , 10 figures can be found via anonymous ftp in this ftp URL and this http URL - this http URL Phys.Usp.41:823-829,1998; Usp.Fiz.Nauk 168:909-915,1998 Astrophysics (astro-ph); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) We considered the Inverse Compton Scattering (ICS) of charged particles onto photons whose distribution is a Black Body Radiation (BBR) deriving the exact energy and angular differential distribution in the general case and in its most useful expansions. These results can be successfully applied in high energy accelerators experiments to evaluate the ICS contribution from the thermal photons in the cavity as well as in astrophysics where the ICS of cosmic rays plays a relevant role in a variety of phenomena. In particular we show how our formulae reproduce the ICS energy spectrum recently measured at LEP, how it could be considered a key tool in explaining the Gamma Ray Bursts (GRB) , SGRs energy spectrum. Finally we predicted the presence of a low gamma flux, nearly detectable at hundred of TeV from SNRs SN1006 as well as, at lower energy (tens TeV, due to gamma ray cascading in cosmic BBR), from relic extragalactic highest cosmic rays sources born by jets in AGN,as blazars 3C279,Mrk421,Mrk 501.",
      "pdf_url": "https://arxiv.org/pdf/astro-ph/9605168.pdf",
      "categories": [
        "astro-ph",
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "astro-ph",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/astro-ph/9704205",
      "title": "The role of ν_τ ultrahigh energy astrophysics in Km^3 detectors",
      "authors": [
        "D.Fargion"
      ],
      "abstract": "The role of ν_τ ultrahigh energy astrophysics in Km^3 detectors D.Fargion (Physics Dept. Rome University 1, INFN Rome, Italy; Faculty of Electrical Engineering Technion-Israel Institute of Technology, Haifa, Israel) 14 pages LaTex, 1 postscript figure Astrophys.J. 570 (2002) 909-925 Astrophysics (astro-ph); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th) We show that the expected $ \\nu_{\\tau} $ signals, by their secondary tau tracks, in Km^3 detectors at highest cosmic ray energy window $ 1.7\\cdot 10^{21} eV \\gt E_{\\tau} \\gt 1.6 x 10^{17} eV$, must overcome the corresponding $ \\nu_{\\mu} $ (or muonic) ones. Indeed, the Lorentz-boosted tau range length grows (linearly) above muon range, for $ E_{\\tau} \\RAISE 1.6 x 10^8 GeV$ and reaches its maxima extension, $ R_{\\tau_{\\max}} \\simeq 191 km$, at energy $E_{\\tau} \\simeq 3.8 x 10^9 GeV$. At this peak the tau range is nearly 20 times the corresponding muon range (at the same energy) implying a similar ratio in $ \\nu_{\\tau} $ over $ \\nu_{\\mu} $ detectability. This dominance, however may lead (at present most abundant $ \\nu_{\\tau} $ model fluxes) to just a rare spectacular event a year (if flavor mixing occurs). Lower energetic $ \\tau $ and $ \\nu_{\\tau} $ signals $ (\\bar{\\nu}_e e\\to \\bar{\\nu}_{\\tau} \\tau, \\nu_{\\tau} N\\to ...) $ at energy range ($ 10^5 ÷10^7 GeV$) may be more easily observed in km^3 detectors at a rate of a few $ (\\bar{\\nu}_e e\\to \\bar{\\nu}_{\\tau} \\tau) $ to tens event $ (\\nu_{\\tau} N\\to \\tau + $ anything) a year.",
      "pdf_url": "https://arxiv.org/pdf/astro-ph/9704205.pdf",
      "categories": [
        "astro-ph",
        "astro-ph.HE",
        "hep-ph",
        "nucl-ex",
        "nucl-th"
      ],
      "primary_category": "astro-ph",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25762",
      "title": "Radiation-dominated polar emitting region of an accreting X-ray pulsar -- I. Polarization- and spectrum-dependent structure, and the emergent continuum",
      "authors": [
        "M. I. Gornostaev"
      ],
      "abstract": "Radiation-dominated polar emitting region of an accreting X-ray pulsar -- I. Polarization- and spectrum-dependent structure, and the emergent continuum M. I. Gornostaev High Energy Astrophysical Phenomena (astro-ph.HE) The radiation-dominated polar emitting region of an accreting X-ray pulsar is simulated numerically in the framework of a three-dimensional (geometrically two-dimensional) model. The radiative transfer within the emitting region and the structure of the latter are calculated with the use of the self-consistent algorithm developed earlier. The magnetic scattering cross sections dependent on the photon energy and polarization have been incorporated. Second-order bulk Comptonization over entire emitting region, induced Compton scattering, the switching of the polarization modes, free-free processes, the cyclotron emission because of electron-proton collisions, and a realistic shape of the accretion channel have been taken into account. The case of a dipole magnetic field is considered. It is shown that the induced Compton effect can play a notable role in establishing the electron temperature in the post-shock zone. Within the model shock wave, a higher electron temperature is achieved than in the post-shock zone by means of the bulk-heating mechanism. The photons gaining the energy in the shock wave and above it due to bulk motion effects and the thermal Doppler effect are responsible for the formation of high-energy regions in the emergent continuum of the polarization modes.",
      "pdf_url": "https://arxiv.org/pdf/2510.25762.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.14300",
      "title": "Production of Jets before Neutron Star Mergers",
      "authors": [
        "Praveen Sharma",
        "Slava G. Turyshev",
        "Maxim V. Barkov",
        "Maxim Lyutikov"
      ],
      "abstract": "Production of Jets before Neutron Star Mergers Praveen Sharma, Slava G. Turyshev, Maxim V. Barkov, Maxim Lyutikov High Energy Astrophysical Phenomena (astro-ph.HE) We demonstrate that magnetospheric interactions between merging neutron stars (NSs) generate dual-jetted current outflows, analogous to the Alfvén wings observed during planetary interactions in the Solar System. Using 3D relativistic MHD simulations, we model the interaction as a conducting sphere moving through a highly magnetized plasma of the companion's magnetosphere. Unusually, the interaction operates in a regime that is relativistic yet sub-Alfvénic. Electromagnetic draping amplifies magnetic fields in a narrow layer near the stellar surface, leading to the generation of electric currents along the local magnetic field. The generation of beamed outflows enhances the instantaneous power of the pulsar-like radio and high-energy emission, produces spin/orbital modulations, and is likely to lead to observable precursor emission preceding the main gravitational wave event.",
      "pdf_url": "https://arxiv.org/pdf/2602.14300.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.16630",
      "title": "Photon Accelerator in Magnetized Electron-Ion Plasma",
      "authors": [
        "Sergei Bulanov",
        "Stepan Bulanov",
        "Timur Esirkepov",
        "Gianluca Gregori",
        "Gabriele Grittani",
        "Marcel Lamač",
        "Brandon Russell",
        "Alec Thomas",
        "Petr Valenta"
      ],
      "abstract": "Photon Accelerator in Magnetized Electron-Ion Plasma Sergei Bulanov, Stepan Bulanov, Timur Esirkepov, Gianluca Gregori, Gabriele Grittani, Marcel Lamač, Brandon Russell, Alec Thomas, Petr Valenta 21 pages,7 figures, 66 references Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
      "pdf_url": "https://arxiv.org/pdf/2512.16630.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15932",
      "title": "What does it mean to take the mean? The effect of the averaging scale on the characterization of interstellar turbulence",
      "authors": [
        "A. Konstantinou",
        "E. Ntormousi",
        "K. Tassis"
      ],
      "abstract": "What does it mean to take the mean? The effect of the averaging scale on the characterization of interstellar turbulence A. Konstantinou, E. Ntormousi, K. Tassis Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) In interstellar medium studies, separating ordered and random velocity or magnetic fields is essential for interpreting turbulence in both simulations and observations. We investigate how the choice of averaging scale affects the measurement and characterization of magnetic and kinetic turbulence in Milky Way-sized disk galaxies with different initial magnetic morphologies. We analyze two magnetohydrodynamic simulations of isolated disk galaxies, one initialized with a toroidal magnetic field (Model T) and the other with a random field (Model R). Using spherical filtering, we decompose the magnetic and velocity fields into mean and fluctuating components while varying the averaging scale, and examine their energy ratios and power spectra as functions of time and averaging radius. Both models develop ordered and turbulent magnetic structures, whose relative strengths vary strongly with the averaging radius. The power spectra of the velocity and magnetic mean fields steepen with increasing smoothing scale, tracing the transition from coherent to turbulent regimes. The turbulent kinetic energy dominates over the magnetic counterpart, though the latter remains dynamically significant. Very importantly, we find that these ratios depend more strongly on the averaging radius than on the initial conditions of the magnetic field. The characterization of turbulence as strong or weak, meaning whether or not fluctuations dominate over the mean depends sensitively on the chosen averaging scale, rather than being an intrinsic property of the system. The strong dependence of the turbulence fractions on the averaging scale has direct implications for magnetic field estimates obtained from observational methods such as the Davis-Chandrasekhar-Fermi technique emphasizing the need for careful scale selection when interpreting magnetic and kinetic turbulence in galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2602.15932.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15934",
      "title": "CLASH-VLT velocity anisotropy profiles in a stack of massive galaxy clusters",
      "authors": [
        "E. Maraboli",
        "A. Biviano",
        "C. Grillo",
        "A. Mercurio",
        "L. Pizzuti",
        "P. Rosati",
        "M. D'Addona"
      ],
      "abstract": "CLASH-VLT velocity anisotropy profiles in a stack of massive galaxy clusters E. Maraboli, A. Biviano, C. Grillo, A. Mercurio, L. Pizzuti, P. Rosati, M. D'Addona Accepted for publication by A&A, 20 pages, 12 figures Astrophysics of Galaxies (astro-ph.GA) We measure the velocity anisotropy profile $\\beta(r)$ of different galaxy cluster member populations by analysing the stacked projected phase space of nine massive ($M_\\mathrm{200c}>7\\times10^{14}$ M$_\\odot$) galaxy clusters at intermediate redshifts ($0.18 < z < 0.45$). We select our sample of galaxy clusters by choosing the most round and virialised objects among the targets of the CLASH-VLT spectroscopic program, which offers a large spectral database. Complementary MUSE observations on most of these clusters allowed us to identify an unprecedented number of cluster members, strongly enhancing the precision of our measurement with respect to previous studies. Our sample of cluster members is divided in four classes: red and blue by colour, and high- and low-mass by stellar mass. We employ two parallel techniques, namely the MAMPOSSt method (parametric in $\\beta(r)$) and the Jeans equation inversion (non parametric in $\\beta(r)$). The results from both techniques are found in agreement for any given cluster member population, and suggest that the orbital anisotropy in galaxy clusters grows from the centre (where $\\beta\\approx 0.2-0.4$) to the virial radius ($\\beta\\gtrsim 0.8$), and it is similar for the different cluster member populations. We also find an interesting dynamical feature in the Jeans inversion results, that is a drop in $\\beta(r)$ at a distance of $\\sim 250$ kpc from the cluster centre. We provide robust anisotropy estimates by exploring a highly significant number of model combinations: 72 with MAMPOSSt (varying the mass, surface number density, $\\beta(r)$ model, and galaxy population) and 18 (varying total mass model and galaxy population) in the Jeans inversion. Such an extensive investigation of the $\\beta(r)$ profile in galaxy clusters is a wide basis for future studies on cluster dynamical masses and cluster cosmology in the era of large spectroscopic surveys",
      "pdf_url": "https://arxiv.org/pdf/2602.15934.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15937",
      "title": "Exploring the Near Galactic Centre: A Comprehensive Study of Bulge OCs HSC 25, HSC 37, HSC 2878 Utilising Gaia DR3 Data",
      "authors": [
        "Deniz Cennet Çınar",
        "Waleed Elsanhoury",
        "Aly Haroon"
      ],
      "abstract": "Exploring the Near Galactic Centre: A Comprehensive Study of Bulge OCs HSC 25, HSC 37, HSC 2878 Utilising Gaia DR3 Data Deniz Cennet Çınar, Waleed Elsanhoury, Aly Haroon 20 pages, including 11 figures and 6 tables accepted for publication in the New Astronomy Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present a comprehensive photometric and kinematic study of the open clusters HSC 25, HSC 37, and HSC 2878, located in the innermost regions of the Galactic disc. Utilizing data from Gaia DR3 and the UPMASK membership algorithm, we identify 44, 55, and 112 most probable members for HSC 25, HSC 37, and HSC 2878, respectively. The mean proper-motion components are obtained as (-5.901 +/- 0.41, -6.213 +/- 0.40), (-3.231 +/- 0.56, -4.564 +/- 0.47), and (-3.830 +/- 0.51, -5.198 +/- 0.44) mas yr^-1 for HSC 25, HSC 37, and HSC 2878, respectively. The open clusters span a broad range of evolutionary stages, with estimated ages of log(t/yr) = 8.38 +/- 0.08, 7.04 +/- 0.09, and 9.04 +/- 0.09, and corresponding heliocentric distances of 7.36 +/- 0.37, 6.79 +/- 0.18, and 6.17 +/- 0.22 kpc. The obtained metallicities are 0.0388 +/- 0.0039, 0.0259 +/- 0.0028, and 0.0209 +/- 0.0023, respectively. Total mass estimates are 135, 755, and 204 solar masses, respectively, highlighting notable differences in stellar content across the clusters. An analysis of dynamical relaxation times suggests that HSC 25 and HSC 2878 are dynamically evolved, whereas the much younger HSC 37 is still in an early phase of dynamical evolution. The high space velocities and orbital parameters of these clusters reveal significant deviations from typical disc kinematics. HSC 25 and HSC 37 exhibit eccentric orbits and small perigalactic distances, consistent with dynamically heated or accreted origins within the Galactic bulge. In contrast, HSC 2878's relaxed, planar orbit suggests in situ bulge membership despite its age. These findings point toward a heterogeneous dynamical origin for the clusters, with implications for star formation and evolution in the inner Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2602.15937.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15953",
      "title": "Is the overconcentration of pristine populations in Galactic globular clusters real? An N-body approach to the problem",
      "authors": [
        "P. Berczik",
        "O. Sobodar",
        "F. Flammini Dotti",
        "M. Sobolenko",
        "M. Ishchenko",
        "R. Spurzem",
        "M. Giersz",
        "A. Askar"
      ],
      "abstract": "Is the overconcentration of pristine populations in Galactic globular clusters real? An N-body approach to the problem P. Berczik, O. Sobodar, F. Flammini Dotti, M. Sobolenko, M. Ishchenko, R. Spurzem, M. Giersz, A. Askar 6 pages, 5 figures, submitted to the A&A Letter Astrophysics of Galaxies (astro-ph.GA) Recent observations indicate that in some Milky Way globular clusters (GCs) pristine red giant branch (RGB) stars appear more centrally concentrated than enriched ones. This contradicts most multiple stellar population (MSP) formation scenarios, which predict that the enriched (second) population (2P) should initially be more concentrated than the pristine (first) population (1P). Previous MOCCA Monte Carlo simulations suggested that this apparent overconcentration is a transient effect arising in clusters that have lost a large fraction of their initial mass and host an active black hole subsystem (BHS), and is visible only when RGB stars are used as tracers. In this letter, we test this interpretation using tailored NBODY6++GPU models evolved with direct N-body simulations, providing an independent validation that does not rely on a statistical treatment of relaxation. We performed direct N-body simulations with the NBODY6++GPU code, adopting initial conditions designed to reproduce the dynamical regime relevant to the proposed mechanism. The simulations include updated stellar and binary evolution, dynamical interactions, and the Galactic tidal field, enabling a direct comparison with MOCCA results. The simulations confirm that the spatial distributions and kinematics inferred from RGB stars can be strongly affected by stochastic fluctuations and interactions with the BHS. Preferential ejection of 2P RGB and their progenitors from the cluster center leads to a transient apparent overconcentration of 1P RGB stars, in agreement with earlier MOCCA predictions.",
      "pdf_url": "https://arxiv.org/pdf/2602.15953.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15976",
      "title": "Early Results from the Coma Legacy IFU Survey (CLIFS): Ram Pressure Induced Shocks and Ionization in Jellyfish Tails",
      "authors": [
        "Lauren M. Foster",
        "Ian D. Roberts",
        "Laura C. Parker",
        "Timothy A. Davis",
        "Alessandro Ignesti",
        "Sean McGee",
        "Nikki Zabel",
        "Ming Sun",
        "Reinout J. van Weeren"
      ],
      "abstract": "Early Results from the Coma Legacy IFU Survey (CLIFS): Ram Pressure Induced Shocks and Ionization in Jellyfish Tails Lauren M. Foster, Ian D. Roberts, Laura C. Parker, Timothy A. Davis, Alessandro Ignesti, Sean McGee, Nikki Zabel, Ming Sun, Reinout J. van Weeren 17 pages, 11 figures, accepted by ApJ Astrophysics of Galaxies (astro-ph.GA) Jellyfish galaxies, which exhibit tails of gas opposite to their direction of motion, are a galaxy population showcasing the most extreme effects of ram pressure stripping (RPS). We present the emission line properties of a preliminary sample of five jellyfish galaxies in the Coma cluster, observed with the WEAVE Large-IFU as part of the Coma Legacy IFU Survey (CLIFS). When complete, CLIFS will form a sample of 29 jellyfish galaxies in Coma, selected based on the presence of one-sided tails in the radio continuum, enabling a comprehensive picture of the effects of ram pressure on galaxies in the Coma cluster. We extract emission line properties and confirm consistency between disk fluxes measured from WEAVE and MaNGA for galaxies with overlapping disk coverage between surveys. Comparing resolved radio and H$\\alpha$-based star formation rates, we find that, in contrast to the disk, the dominant source of tail emission is not star formation. We find evidence for diffuse ionized gas excited by RPS-driven shocks in the tails, as indicated by: (1) LINER-like tail emission with the [OI]/H$\\alpha$ BPT diagnostic; (2) enhanced [OII]/H$\\alpha$ ratios in the tails relative to the disks; and (3) similarly elevated emission line velocities and velocity dispersions in the tails with respect to the disks. These results demonstrate that ram-pressure-driven shocks dominate the ionized emission in jellyfish galaxy tails.",
      "pdf_url": "https://arxiv.org/pdf/2602.15976.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16262",
      "title": "PDRs4All XXI. JWST-NIRCam Photometric properties of protoplanetary disks in the Orion Nebula Cluster",
      "authors": [
        "P. Amiot",
        "O. Berné",
        "I. Schroetter",
        "M. Robberto",
        "T. J. Haworth",
        "C. Boersma",
        "E. Dartois",
        "A. Fuente",
        "J.R. Goicoechea",
        "E. Habart",
        "M. J. McCaughrean",
        "T. Onaka",
        "E. Peeters"
      ],
      "abstract": "PDRs4All XXI. JWST-NIRCam Photometric properties of protoplanetary disks in the Orion Nebula Cluster P. Amiot, O. Berné, I. Schroetter, M. Robberto, T. J. Haworth, C. Boersma, E. Dartois, A. Fuente, J.R. Goicoechea, E. Habart, M. J. McCaughrean, T. Onaka, E. Peeters Astrophysics of Galaxies (astro-ph.GA) The Orion Nebula Cluster (ONC) provides the closest example of star and planet formation in highly irradiated environments. It is a key region to study how UV radiation from massive stars drive mass-loss in protoplanetary disks through photoevaporation. Far-UV photons (6<E<13.6 eV) heat up the gas of the disk, forming a photodissociation region (PDRs). We use the NIRCam images from the PDRs4All program combined with those of the GTO program 1256 to extract key information on ONC disks. Specifically, the radii of the disks observed in silhouette against the bright background , the presence and positions of the dissociation fronts (DFs), the presence and positions of ionization fronts (IFs), intensities of Pa $\\alpha$ lines, and their near IR SEDs. From those, we construct a typology for ONC disks: Type I show an IF and DF nearly merged at the disk surface; Type II have their DFs at the disk surface and IFs at a distance of several 10s of astronomical units from the disk; and Type III also have their DF at the disk surface, but show no IF. For all disks, we find that PAH emission traces the PDR. We establish that the SEDs of candidate JuMBOs observed as part of the PDRs4All program are similar to the SEDs of Type III ONC disks except for JuMBO24, which is of Type I or II. A detailed look at this SED shows it is compatible with a young low mass binary star with an unresolved ionized disk : a microproplyd binary. We observe that the disk radius of ONC disks increases with increasing projected distance to the ionizing source interpreted as evidence of the truncation of the disks by the photoevaporation. The disk radii measured at IR wavelengths appear larger than at millimeter wavelengths, interpreted as evidence of the dust radial segregation within the disks. The thermal pressure within the PDRs of ONC disk increases with the FUV radiation field, but with a flatter slope.",
      "pdf_url": "https://arxiv.org/pdf/2602.16262.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16620",
      "title": "HOLISMOKES XX. Lens models of binary lens galaxies with five images of Supernova Winny",
      "authors": [
        "L. R. Ecker",
        "A. G. Schweinfurth",
        "R. Saglia",
        "L. Deng",
        "S. H. Suyu",
        "C. Saulder",
        "J. Snigula",
        "R. Bender",
        "R. Cañameras",
        "T.-W. Chen",
        "A. Galan",
        "A. Halkola",
        "E. Mamuzic",
        "A. Melo",
        "S. Schuldt",
        "S. Taubenberger"
      ],
      "abstract": "HOLISMOKES XX. Lens models of binary lens galaxies with five images of Supernova Winny L. R. Ecker, A. G. Schweinfurth, R. Saglia, L. Deng, S. H. Suyu, C. Saulder, J. Snigula, R. Bender, R. Cañameras, T.-W. Chen, A. Galan, A. Halkola, E. Mamuzic, A. Melo, S. Schuldt, S. Taubenberger Astrophysics of Galaxies (astro-ph.GA) Strongly lensed supernovae (SNe) provide a powerful way to study cosmology, SNe and galaxies. Modelling the lens system is key to extracting astrophysical and cosmological information. We present adaptive-optics-assisted high-resolution images of SN Winny (SN 2025wny) in the J and K filters obtained with the Large Binocular Telescope (LBT). The LBT imaging confirms the presence of a fifth point source, whose colour is consistent with that of the other SN images at similar phases, while lens modelling robustly supports its interpretation as an additional image of SN~Winny. We measure the positions of the five SN images with uncertainties varying between 1 and 14 milliarcseconds. We build the first mass models using lenstronomy and GLEE, and explore three classes of mass models for the two lens galaxies G1 and G2. The optimal model class of the three is a singular isothermal ellipsoid for G1, a singular isothermal sphere for G2, and an external shear. We infer the enclosed masses within the Einstein radius as 4.61^{+0.06}_{-0.04} \\times 10^{11}\\,M_\\odot for G1 and 1.01\\pm0.02 \\times 10^{11}\\,M_\\odot for G2. The lensing configuration by the two lens galaxies can produce two additional magnified SN images beyond the five observed ones; the exclusion of such model configurations further constrains the lens model parameters. Our model fits to the observed image positions with an RMS of ~0.0012\" - 0.0025\", within the observed positional uncertainties. The predicted magnifications of the multiple images vary between ~1.6 (for the faintest fifth image E) to ~10 (for the brightest image A). The predicted relative lensing magnifications of the multiple images do not match that of the observed within 2\\sigma uncertainties. The differences in the relative magnifications could be due to millilensing/microlensing. Our mass models form the basis for future analyses of this unique system. (abridged)",
      "pdf_url": "https://arxiv.org/pdf/2602.16620.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16706",
      "title": "How Bursty is Star Formation at z>5?",
      "authors": [
        "Massimo Stiavelli",
        "Massimo Ricotti"
      ],
      "abstract": "How Bursty is Star Formation at z>5? Massimo Stiavelli, Massimo Ricotti 7 pages, 4 figures, one table. Accepted for publication by ApJ Astrophysics of Galaxies (astro-ph.GA) Motivated by observational evidence from JWST and theoretical results from cosmological simulations, we use a simple parametric, phenomenological model to test to what extent bursty star formation with standard Initial Mass Function, no continuous star formation, no mergers, \\mr{and no dust} can account for the observed properties in the $M_{UV}$ vs $M_*$ plane of galaxies at redshifts $z>5$. We find that the simplest model that fits the data has a quiescence period between bursts $\\Delta t \\sim 100$~Myrs and the stellar mass in each galaxy grows linearly as a function of time from $z=12$ to $z=5$ (i.e., repeated bursts in each galaxy produce approximately equal mass in stars). The distribution of burst masses across different galaxies follows a power-law $dN/dM_* \\propto M_*^\\alpha$ with slope $\\alpha \\sim -2$. At $z>9-10$ the observed galaxy population typically had only one or two bursts of stars formation, hence the observed stellar masses at these redshifts (reaching $M_* \\sim 10^{10}$~M$_\\odot$), roughly represent the distribution of masses formed in one burst.",
      "pdf_url": "https://arxiv.org/pdf/2602.16706.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16030",
      "title": "Molecular diagnostics for the mid-infrared emission of planet-forming disks. Carbon and oxygen elemental abundances",
      "authors": [
        "Aditya M. Arabhavi",
        "Inga Kamp",
        "Ewine F. van Dishoeck",
        "Peter Woitke",
        "Christian Rab",
        "Wing-Fai Thi",
        "Till Kaeufer",
        "Jayatee Kanwar",
        "Benoît Tabone",
        "Pacôme Esteve",
        "Marissa Vlasblom"
      ],
      "abstract": "Molecular diagnostics for the mid-infrared emission of planet-forming disks. Carbon and oxygen elemental abundances Aditya M. Arabhavi, Inga Kamp, Ewine F. van Dishoeck, Peter Woitke, Christian Rab, Wing-Fai Thi, Till Kaeufer, Jayatee Kanwar, Benoît Tabone, Pacôme Esteve, Marissa Vlasblom 22 pages, 21 figures, Accepted for publication in Astronomy & Astrophysics Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Mid-infrared observations of planet-forming disks reveal a wide diversity in molecular spectra. Carbon and oxygen abundances play a central role in setting the chemical environment of the inner disk and the spectral appearance. We aim to systematically explore how variations in elemental carbon and oxygen abundances affect the mid-infrared spectra of planet-forming disks, and to identify robust mid-infrared molecular diagnostics of C/H, O/H, and the C/O ratio. Using the thermochemical disk code ProDiMo and the line radiative transfer code FLiTs, we construct a grid of 25 models with varying carbon and oxygen abundances, covering a broad range of C/O ratios. We analyze the resulting mid-infrared molecular emission, including species such as $\\rm H_2O$, $\\rm CO$, $\\rm CO_2$, $\\rm C_2H_2$, $\\rm OH$. We find that the mid-infrared molecular spectra are highly sensitive not only to the C/O ratio, but also to the absolute abundances of carbon and oxygen. Despite the same disk structure and C/O ratios, molecular fluxes (e.g., $\\rm C_2H_2$, $\\rm CO_2$) vary by more than an order of magnitude. This variation stems from the differences in excitation conditions and emitting regions caused by the elemental abundances of oxygen and carbon. We identify diagnostic molecular flux ratios - such as $\\rm CO_2$/$\\rm H_2O$ and $\\rm H_2O$/$\\rm C_2H_2$ - that can serve as tracers of C/H and O/H respectively. By combining these diagnostics, we demonstrate a method to infer the underlying C/O ratio. Our model grid provides a framework for interpreting mid-infrared molecular emission from disks, allowing estimates of elemental abundances if the disk properties and structure are known. Comparisons with recent JWST observations suggest that a variety in C and O abundances is seen in a sample of T Tauri disks, possibly shaped by disk transport processes and the presence of gaps.",
      "pdf_url": "https://arxiv.org/pdf/2602.16030.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16082",
      "title": "Evolution of Low-Mass Population III Stars: Convection, Mass Loss, Nucleosynthesis, and Neutrinos",
      "authors": [
        "Thiago Ferreira",
        "Earl P. Bellinger",
        "Ebraheem Farag",
        "Christopher J. Lindsay"
      ],
      "abstract": "Evolution of Low-Mass Population III Stars: Convection, Mass Loss, Nucleosynthesis, and Neutrinos Thiago Ferreira, Earl P. Bellinger, Ebraheem Farag, Christopher J. Lindsay Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The first stars likely formed from pristine clouds, marking a transformative epoch after the dark ages by initiating reionisation and synthesising the first heavy elements. Among these, low-mass Population III stars are of particular interest, as their long lifespans raise the possibility that some may survive to the present day in the Milky Way's stellar halo or satellite dwarfs. As the first paper in a series, we present hydrodynamic evolutionary models for 0.7 - 1 MSun stars evolved up to the white dwarf phase, utilising the MESA software instrument. We systematically vary mass-loss efficiencies, convective transport, and overshooting prescriptions, thereby mapping how uncertain physics influences nucleosynthetic yields; surface enrichment, including nitrogen-rich post-main sequence stars arising from convective shell mergers; remnant properties, such as low-mass helium or carbon-oxygen white dwarfs (M_WD ~ 0.45-0.55 MSun) and transient UV-bright phases; and potential observational signatures, including neutrino emission during shell mergers and helium flashes. These models establish a predictive framework for identifying surviving Pop III stars and their descendants, providing both evolutionary and observational constraints that were previously unexplored.",
      "pdf_url": "https://arxiv.org/pdf/2602.16082.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16095",
      "title": "Three Saturn-mass Microlensing Planets Identified through Signals from Peripheral-caustic Perturbations",
      "authors": [
        "Cheongho Han",
        "Chung-Uk Lee",
        "Andrzej Udalski",
        "Ian A. Bond",
        "Michael D. Albrow",
        "Sun-Ju Chung",
        "Andrew Gould",
        "Youn Kil Jung",
        "Kyu-Ha Hwang",
        "Yoon-Hyun Ryu",
        "Yossi Shvartzvald",
        "In-Gu Shin",
        "Jennifer C. Yee",
        "Weicheng Zang",
        "Hongjing Yang",
        "Doeon Kim",
        "Dong-Jin Kim",
        "Sang-Mok Cha",
        "Seung-Lee Kim",
        "Dong-Joo Lee",
        "Yongseok Lee",
        "Byeong-Gon Park",
        "Kyeongsoo Hong",
        "Richard W. Pogge",
        "Przemek Mróz",
        "Michał K. Szymański",
        "Jan Skowron",
        "Radosław Poleski",
        "Igor Soszyński",
        "Paweł Pietrukowicz",
        "Szymon Kozłowski",
        "Krzysztof A. Rybicki",
        "Patryk Iwanek",
        "Krzysztof Ulaczyk",
        "Marcin Wrona",
        "Mariusz Gromadzki",
        "Mateusz J. Mróz",
        "Fumio Abe",
        "David P. Bennett",
        "Aparna Bhattacharya",
        "Ryusei Hamada",
        "Yuki Hirao",
        "Asahi Idei",
        "Stela Ishitani Silva",
        "Shuma Makida",
        "Shota Miyazaki",
        "Yasushi Muraki",
        "Tutumi Nagai",
        "Togo Nagano",
        "Seiya Nakayama",
        "Mayu Nishio",
        "Kansuke Nunota",
        "Ryo Ogawa",
        "Ryunosuke Oishi",
        "Yui Okumoto",
        "Greg Olmschenk",
        "Clément Ranc",
        "Nicholas J. Rattenbury",
        "Yuki Satoh",
        "Takahiro Sumi",
        "Daisuke Suzuki",
        "Takuto Tamaoki",
        "Sean K. Terry",
        "Paul J. Tristram",
        "Aikaterini Vandorou",
        "Hibiki Yama"
      ],
      "abstract": "Three Saturn-mass Microlensing Planets Identified through Signals from Peripheral-caustic Perturbations Cheongho Han, Chung-Uk Lee, Andrzej Udalski, Ian A. Bond, Michael D. Albrow, Sun-Ju Chung, Andrew Gould, Youn Kil Jung, Kyu-Ha Hwang, Yoon-Hyun Ryu, Yossi Shvartzvald, In-Gu Shin, Jennifer C. Yee, Weicheng Zang, Hongjing Yang, Doeon Kim, Dong-Jin Kim, Sang-Mok Cha, Seung-Lee Kim, Dong-Joo Lee, Yongseok Lee, Byeong-Gon Park, Kyeongsoo Hong, Richard W. Pogge, Przemek Mróz, Michał K. Szymański, Jan Skowron, Radosław Poleski, Igor Soszyński, Paweł Pietrukowicz, Szymon Kozłowski, Krzysztof A. Rybicki, Patryk Iwanek, Krzysztof Ulaczyk, Marcin Wrona, Mariusz Gromadzki, Mateusz J. Mróz, Fumio Abe, David P. Bennett, Aparna Bhattacharya, Ryusei Hamada, Yuki Hirao, Asahi Idei, Stela Ishitani Silva, Shuma Makida, Shota Miyazaki, Yasushi Muraki, Tutumi Nagai, Togo Nagano, Seiya Nakayama, Mayu Nishio, Kansuke Nunota, Ryo Ogawa, Ryunosuke Oishi, Yui Okumoto, Greg Olmschenk, Clément Ranc, Nicholas J. Rattenbury, Yuki Satoh, Takahiro Sumi, Daisuke Suzuki, Takuto Tamaoki, Sean K. Terry, Paul J. Tristram, Aikaterini Vandorou, Hibiki Yama Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We present the discovery and analysis of three microlensing planets identified through brief positive anomalies on the wings of their light curves. The events, KMT-2021-BLG-0852, KMT-2024-BLG-2005, and KMT-2025-BLG-0481, were detected in high-cadence survey data from the KMTNet, OGLE, MOA, and PRIME collaborations. The anomaly morphologies are consistent with major-image perturbations induced by planetary-mass companions located near the peripheral caustic. A systematic exploration of model degeneracies, including binary-source scenarios, higher mass-ratio binary lenses, and the inner--outer caustic degeneracy, firmly establishes the planetary origin of each signal. Measurements of the angular Einstein radius and event timescale, combined with Bayesian priors from a Galactic model, yield the physical parameters of each system. The hosts are low-mass stars (0.12--0.75~$M_\\odot$), while the companions are Saturn-mass planets (0.16--0.59 $M_{\\rm J}$) projected at separations of 1.1--7.8 au, placing them beyond the snowline of their hosts. These results demonstrate the capability of microlensing to detect and characterize cold giant planets around low-mass stars at kpc distances, populating the critical transition region between ice giants and gas giants.",
      "pdf_url": "https://arxiv.org/pdf/2602.16095.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16394",
      "title": "Localized $^{18}$O production in white dwarf mergers",
      "authors": [
        "Alexander Holas",
        "Veronica Agaeva",
        "Friedrich K. Roepke",
        "Samuel W. Jones",
        "Javier Moran-Fraile",
        "Marco Vetter",
        "Rüdiger Pakmor",
        "Philipp Podsiadlowski"
      ],
      "abstract": "Localized $^{18}$O production in white dwarf mergers Alexander Holas, Veronica Agaeva, Friedrich K. Roepke, Samuel W. Jones, Javier Moran-Fraile, Marco Vetter, Rüdiger Pakmor, Philipp Podsiadlowski 16 pages, 4 figures, accepted for publication in EPJA Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The merger of a He white dwarf (WD) and a CO WD is the favored formation channel for R Coronae Borealis (RCB) stars. These stars exhibit ${^{16}}\\mathrm{O}/{^{18}}\\mathrm{O}$ ratios that are orders of magnitude lower than the solar value. However, it is not fully understood whether such low ${^{16}}\\mathrm{O}/{^{18}}\\mathrm{O}$ ratios can be achieved in WD merger remnants for the predicted lifetime of RCB stars of around $10^4\\,\\mathrm{years}$. In this work, we perform detailed nucleosynthesis calculations of a 3D magnetohydrodynamical simulation of a merger of a $0.3\\,M_\\odot$ He WD and a $0.6\\,M_\\odot$ CO WD for $4000\\,\\mathrm{s}$ at which point a steady state in temperature and density is reached. From this point, we follow several radial zones to study the long-term production of ${^{18}}\\mathrm{O}$ and its variability throughout the burning region. We find that the asymmetric merger process leaves an imprint on the distribution of the abundances at the end of our hydrodynamic simulation. During the long-term evolution up to $100\\,\\mathrm{years}$, we observe ${^{16}}\\mathrm{O}/{^{18}}\\mathrm{O}$ ratios of order of unity, although the timescale on which ${^{18}}\\mathrm{O}$ is destroyed again is highly location dependent. Importantly, our calculations suggest that in the outer layers of the burning shell, the dominant production channel is $^{14}\\mathrm{C}(\\alpha,\\gamma)^{18}\\mathrm{O}$ instead of the commonly considered $^{14}\\mathrm{N}(\\alpha,\\gamma)^{18}\\mathrm{F}(\\beta^+)^{18}\\mathrm{O}$ reaction, whereby the former can be sustained for longer periods of time. Furthermore, these outer regions do not reach the conditions necessary for fast $\\alpha$-captures in ${^{18}}\\mathrm{O}$ to ${^{22}}\\mathrm{Ne}$, thus being favorable to maintaining a low ${^{16}}\\mathrm{O}/{^{18}}\\mathrm{O}$ ratio.",
      "pdf_url": "https://arxiv.org/pdf/2602.16394.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16550",
      "title": "Searching for White Dwarf Candidates Formed Through Binary evolution in Star Clusters",
      "authors": [
        "Huahui Yan",
        "Li Wang",
        "David R. Miller",
        "Chenyu He",
        "Jiamao Lin",
        "Xiaoying Pang",
        "Jingkun Zhao",
        "Jincheng Guo",
        "Richard de Grijs",
        "Hongwei Ge",
        "Zhen Guo",
        "Bo Ma",
        "Dichang Chen",
        "Chengyuan Li"
      ],
      "abstract": "Searching for White Dwarf Candidates Formed Through Binary evolution in Star Clusters Huahui Yan, Li Wang, David R. Miller, Chenyu He, Jiamao Lin, Xiaoying Pang, Jingkun Zhao, Jincheng Guo, Richard de Grijs, Hongwei Ge, Zhen Guo, Bo Ma, Dichang Chen, Chengyuan Li Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) White dwarfs (WDs), the evolutionary endpoints of most stars, can form through both single-star and binary channels. While single-star evolutionary models enable reliable WD age estimates, binary evolution introduces interactions that can accelerate WD formation and result in a variety of exotic WDs, which may exhibit strong magnetic fields, rapid rotation, or even serve as potential gravitational wave sources. Such systems offer valuable insights into magnetic field generation, angular momentum evolution, and compact object physics. Star clusters, with their approximately coeval populations, allow precise age determination of member WDs. If a WD's total age derived from single-star evolution exceeds that of its host cluster, it likely indicates a binary origin. In this study, we use \\textit{Gaia} 5D astrometry to identify 439 WD candidates in 117 open clusters, with 244 likely formed via binary evolution. We discuss the possibility of dynamical ejection for WDs meeting only 2D (proper motion space) membership criteria. Spectroscopic observations further reveal a subset with strong magnetic fields and rapid rotation, supporting their binary evolutionary origin.",
      "pdf_url": "https://arxiv.org/pdf/2602.16550.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.00103",
      "title": "The warm outer layer of a Little Red Dot as the source of [Fe II] and collisional Balmer lines with scattering wings",
      "authors": [
        "Alberto Torralba",
        "Jorryt Matthee",
        "Gabriele Pezzulli",
        "Rohan P. Naidu",
        "Yuzo Ishikawa",
        "Gabriel B. Brammer",
        "Seok-Jun Chang",
        "John Chisholm",
        "Anna de Graaff",
        "Francesco D'Eugenio",
        "Claudia Di Cesare",
        "Anna-Christina Eilers",
        "Jenny E. Greene",
        "Max Gronke",
        "Edoardo Iani",
        "Vasily Kokorev",
        "Gauri Kotiwale",
        "Ivan Kramarenko",
        "Yilun Ma",
        "Sara Mascia",
        "Benjamín Navarrete",
        "Erica Nelson",
        "Pascal Oesch",
        "Robert A. Simcoe",
        "Stijn Wuyts"
      ],
      "abstract": "The warm outer layer of a Little Red Dot as the source of [Fe II] and collisional Balmer lines with scattering wings Alberto Torralba, Jorryt Matthee, Gabriele Pezzulli, Rohan P. Naidu, Yuzo Ishikawa, Gabriel B. Brammer, Seok-Jun Chang, John Chisholm, Anna de Graaff, Francesco D'Eugenio, Claudia Di Cesare, Anna-Christina Eilers, Jenny E. Greene, Max Gronke, Edoardo Iani, Vasily Kokorev, Gauri Kotiwale, Ivan Kramarenko, Yilun Ma, Sara Mascia, Benjamín Navarrete, Erica Nelson, Pascal Oesch, Robert A. Simcoe, Stijn Wuyts 18 pages incl. references. Main figure: 4 ([Fe II] model). Accepted vesion A&A Astrophysics of Galaxies (astro-ph.GA) The population of the Little Red Dots (LRDs) may represent a key phase of supermassive black hole (SMBH) growth. A cocoon of dense excited gas is emerging as key component to explain the most striking properties of LRDs, such as strong Balmer breaks and Balmer absorption, as well as the weak IR emission. To dissect the structure of LRDs, we analyze new deep JWST/NIRSpec PRISM and G395H spectra of FRESCO-GN-9771, one of the most luminous known LRDs at $z=5.5$. These reveal a strong Balmer break, broad Balmer lines and very narrow [O III] emission. We unveil a forest of optical [Fe II] lines, which we argue is emerging from a dense ($n_{\\rm H}=10^{9-10}$ cm$^{-3}$) warm layer with electron temperature $T_{\\rm e}\\approx7000$ K. The broad wings of H$\\alpha$ and H$\\beta$ have an exponential profile due to electron scattering in this same layer. The high $\\rm H\\alpha:H\\beta:H\\gamma$ flux ratio of $\\approx10.4:1:0.14$ is an indicator of collisional excitation and resonant scattering dominating the Balmer line emission. A narrow H$\\gamma$ component, unseen in the other two Balmer lines due to outshining by the broad components, could trace the ISM of a normal host galaxy with a star formation rate $\\sim5$ M$_{\\odot}$ yr$^{-1}$. The warm layer is mostly opaque to Balmer transitions, producing a characteristic P-Cygni profile in the line centers suggesting outflowing motions. This same layer is responsible for shaping the Balmer break. The broad-band spectrum can be reasonably matched by a simple photoionized slab model that dominates the $\\lambda>1500$ Å continuum and a low mass ($\\sim10^8$ M$_{\\odot}$) galaxy that could explain the narrow [O III], with only subdominant contribution to the UV continuum. Our findings indicate that Balmer lines are not directly tracing gas kinematics near the SMBH and that the BH mass scale is likely much lower than virial indicators suggest.",
      "pdf_url": "https://arxiv.org/pdf/2510.00103.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05046",
      "title": "Dust destruction by the supernova remnant forward shock in a turbulent interstellar medium",
      "authors": [
        "Tassilo Scheffler",
        "Nina S. Sartorio",
        "Florian Kirchschlager",
        "Ilse De Looze",
        "Michael J. Barlow",
        "Franziska D. Schmidt"
      ],
      "abstract": "Dust destruction by the supernova remnant forward shock in a turbulent interstellar medium Tassilo Scheffler, Nina S. Sartorio, Florian Kirchschlager, Ilse De Looze, Michael J. Barlow, Franziska D. Schmidt 22 pages, 14 figures, published in Astronomy & Astrophysics (A&A) Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Context. While supernova remnants (SNRs) are observed to produce up to 1 M$_\\odot$ of dust, the amount of dust destroyed by the forward shock (FS) is poorly constrained, raising the question whether they are net dust producers or destroyers. Aims. We aim to estimate the dust destruction efficiency of SNR FSs in a realistically turbulent interstellar medium (ISM) during their most destructive phase, and assess dust shielding by high density filaments during this period. Methods. We run 3D turbulence simulations for different turbulent Mach numbers (0-3) and average ISM densities (1-100 cm$^{-3}$) to resemble observations of the turbulent ISM. We then set off a supernova to trace its 3D magnetohydrodynamical evolution for 10 kyr. Finally, we run post-processing simulations to study the dust transport and destruction by the SNR FS, considering gas and plasma drag, kinetic and thermal sputtering, and grain-grain collisions, and either silicate or carbonaceous dust. Results. The dust destruction rate of the FS strongly depends on the average ISM density and turbulence strength, varying between 27-92% (0.85-11.0 M$_\\odot$) in the studied 10 kyr. Overall, dust is less efficiently destroyed in a low density medium (1 cm$^{-3}$, 27-57%) than in intermediate (10 cm$^{-3}$, 46-92%) and high densities (100 cm$^{-3}$, 73-87%). The FS destroys 8-34% less dust in high Mach turbulence compared to a homogeneous medium. Furthermore, carbonaceous grains are more robust (up to 21% more) than silicates. Conclusions. Filaments can partly shield dust from destruction in the first 10 kyr, however, always more than 0.85 M$_\\odot$ of dust is destroyed, making most SNRs dust sinks under the conditions explored in this work. The destruction efficiency of the SNRs with less than 1 M$_\\odot$ of destroyed dust has not yet plateaued so that they are most likely also net dust destroyers by the end of their lifetime.",
      "pdf_url": "https://arxiv.org/pdf/2512.05046.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03672",
      "title": "JWST imaging of the Pleiades: anisotropy of turbulence in the cold neutral medium",
      "authors": [
        "G. Vigoureux",
        "N. Flagey",
        "F. Boulanger",
        "A. Noriega-Crespo",
        "V. Guillet",
        "A. J. Alvarez-Castro",
        "N. deJesus-Rivera",
        "E. Allys",
        "J. M. Delouis",
        "E. Falgarone",
        "B. Godard",
        "P. Guillard",
        "F. Levrier",
        "P. Lesaffre",
        "A. Marcowith",
        "M. A. Miville-Deschênes",
        "G. Pineau des Forêts"
      ],
      "abstract": "JWST imaging of the Pleiades: anisotropy of turbulence in the cold neutral medium G. Vigoureux, N. Flagey, F. Boulanger, A. Noriega-Crespo, V. Guillet, A. J. Alvarez-Castro, N. deJesus-Rivera, E. Allys, J. M. Delouis, E. Falgarone, B. Godard, P. Guillard, F. Levrier, P. Lesaffre, A. Marcowith, M. A. Miville-Deschênes, G. Pineau des Forêts Astrophysics of Galaxies (astro-ph.GA) Interstellar medium studies rely on magnetohydrodynamic (MHD) turbulence as a framework for interpretation. In this context, the statistical characterization of interstellar observations is of prime importance. We open a new perspective on diffuse interstellar matter by analyzing James Webb Space Telescope (JWST) observations of the Pleiades nebula with NIRCam. These observations are remarkable in that they provide a microscope view at the cold neutral medium (CNM) with a spatial resolution of 0.2 mpc (40 au). A two-dimensional Fourier analysis is used to characterize the structure of PAH emission in regions near and far from the Pleiades star Merope. To produce maps of the interstellar emission, stars and galaxies are filtered out. The final step in the data cleaning involves subtracting a component, in Fourier space, which we infer to be a residual of the near-infrared cosmic background. The PAH emission power spectra are highly anisotropic. They are well fitted with a break-free power-law, suggesting that we do not observe a specific scale for energy dissipation. Power-law indices are -3.5 near Merope and -3 in the more distant field. The magnetic field orientation, as derived from the Planck dust polarization data, aligns with the PAH anisotropy. The power anisotropy is constant across scales. These findings are discussed in relation to interstellar turbulence that may be driven by the Pleiades stars. The JWST observations of the Pleiades offer a new viewpoint for comparing observations and theoretical models, as they examine physical scales at which turbulence in the CNM is subsonic and decoupled from the thermal instability. The observations may indicate that the turbulent energy cascade in the CNM is anisotropic.",
      "pdf_url": "https://arxiv.org/pdf/2602.03672.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.18261",
      "title": "A novel algorithm for GPU-accelerated particle-mesh interactions implemented in the QUOKKA code",
      "authors": [
        "Chong-Chong He",
        "Benjamin D. Wibking",
        "Aditi Vijayan",
        "Mark R. Krumholz",
        "Pak Shing Li"
      ],
      "abstract": "A novel algorithm for GPU-accelerated particle-mesh interactions implemented in the QUOKKA code Chong-Chong He (ANU), Benjamin D. Wibking (MSU), Aditi Vijayan (ANU), Mark R. Krumholz (ANU), Pak Shing Li (SAO) 16 pages, 8 figures, submitted to The Open Journal of Astrophysics. The QUOKKA code described in this article is fully open-source and can be accessed at: this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) We present a novel, GPU-optimized algorithm for particle-mesh interactions in grid-based hydrodynamics simulations, designed for massively parallel architectures. This approach overcomes the inefficiency of particle neighbour searches or sorts across multiple GPU nodes by using a new \"particle-mesh-particle\" interaction scheme, which extends the particle-mesh method for self-gravity. The algorithm proceeds in two main stages: first, quantities exchanged between particles and the mesh -- such as mass, energy, and momentum added by stellar feedback or removed by accretion onto a sink -- are deposited into a buffer mesh equipped with ghost zones, where multiple contributions per cell are accumulated using atomic additions and then communicated across distributed memory ranks. In the second stage, the buffer states are applied to real mesh states, incorporating cell-wise limiters to enforce physical constraints such as positive density. We implement this scheme in the GPU-native radiation-magnetohydrodynamics code QUOKKA and validate it through a comprehensive suite of tests, including Bondi and Bondi-Hoyle accretion, and single and multiple supernova remnant evolution at varying spatial resolutions. We show that the algorithm achieves $\\approx 50\\%$ weak-scaling efficiency running on up to 8192 GPUs on the Frontier supercomputer. This scheme enables efficient, scalable particle-mesh coupling for GPU-optimized simulations of star formation and feedback in galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2509.18261.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.17820",
      "title": "JOYS: JWST MIRI/MRS spectra of the inner 500 au region of the L1527 IRS bipolar outflow",
      "authors": [
        "R. Devaraj",
        "E. F. van Dishoeck",
        "T. P. Ray",
        "Ł. Tychoniec",
        "A. Caratti o Garatti",
        "L. Francis",
        "C. Gieser",
        "M. L. van Gelder",
        "J. J. Tobin",
        "H. Beuther",
        "P. J. Kavanagh",
        "K. Justtanont",
        "W. B. Drechsler",
        "M. G. Navarro",
        "G. Perotti"
      ],
      "abstract": "JOYS: JWST MIRI/MRS spectra of the inner 500 au region of the L1527 IRS bipolar outflow R. Devaraj, E. F. van Dishoeck, T. P. Ray, Ł. Tychoniec, A. Caratti o Garatti, L. Francis, C. Gieser, M. L. van Gelder, J. J. Tobin, H. Beuther, P. J. Kavanagh, K. Justtanont, W. B. Drechsler, M. G. Navarro, G. Perotti Astronomy and Astrophysics 2026 Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) This study characterized the physical and kinematic properties within the innermost 500 au region of the L1527 bipolar outflow, a class 0/I low-mass protostar using JWST MIRI/MRS spectroscopy across 5-28 micron at 0.2-1.0 arcsec resolution. We identified emission lines from molecular and ionized species and analyzed their spatial morphology using line-integrated intensity maps. We derived gas temperatures and column densities through excitation diagram analysis of H2 rotational lines and compared results with shock models. The observations reveal extended molecular hydrogen emission tracing the bipolar outflow, with the H2 gas temperatures distributed into warm (~550 K) and hot (~2500 K) components, likely originating from moderate-velocity J-type shocks and some UV irradiation. We detect forbidden atomic and ionized emission lines of [Ni ii], [Ar ii], [Ne ii], [Ne iii], [S i], and [Fe ii] showing spatially extended morphology. Double-peaked emission profiles were seen in [Ar ii], [Ne iii], and [Fe ii], in the eastern region, suggesting that the high velocity component traces a fast, highly ionized jet. A radial velocity map derived from [Ne ii] emission shows the eastern region to be redshifted and the western region blueshifted, contrary to earlier interpretations. The analysis of the MIRI/MRS observations reveals molecular, atomic, and ionized emission lines in this low-mass protostar connected with active outflow signatures. The most striking feature discovered is the presence of a poorly collimated high-velocity ionized jet, embedded within a broader wide-angle molecular outflow likely driven by a disk wind. The coexistence of these components supports a stratified outflow structure and suggests that L1527 exhibits unique jet-launching characteristics atypical of its early evolutionary stage.",
      "pdf_url": "https://arxiv.org/pdf/2601.17820.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15979",
      "title": "Multiwavelength Campaign Observations of a Young Solar-type Star, EK Draconis. III. Comparison between Starspot Mapping, Zeeman Doppler Imaging, and Multiwavelength Variability",
      "authors": [
        "Kai Ikuta",
        "Kosuke Namekata",
        "Pascal Petit",
        "Vladimir S. Airapetian",
        "Hiroyuki Maehara",
        "Yuta Notsu",
        "Aline A. Vidotto",
        "Keith Gendreau",
        "Sandra V. Jeffers",
        "Stephen Marsden",
        "Julien Morin",
        "Coralie Neiner",
        "Rishi R. Paudel",
        "Daisaku Nogami",
        "Kazunari Shibata"
      ],
      "abstract": "Multiwavelength Campaign Observations of a Young Solar-type Star, EK Draconis. III. Comparison between Starspot Mapping, Zeeman Doppler Imaging, and Multiwavelength Variability Kai Ikuta, Kosuke Namekata, Pascal Petit, Vladimir S. Airapetian, Hiroyuki Maehara, Yuta Notsu, Aline A. Vidotto, Keith Gendreau, Sandra V. Jeffers, Stephen Marsden, Julien Morin, Coralie Neiner, Rishi R. Paudel, Daisaku Nogami, Kazunari Shibata 26 pages, 9 figures, 7 tables, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Recent simultaneous multiwavelength observations of a nearby young solar-type star EK Dra in the optical, H$\\alpha$ spectrum, and X-ray, have provided evidence for stellar prominence eruptions associated with superflares. The large prominence eruption is suggested to have been caused by a large mid-latitude spot on the polarity inversion lines near the stellar limb from the concurrent Zeeman Doppler Imaging (ZDI) and optical photometry by the TESS. In this study, we perform starspot mapping for the TESS data of EK Dra to investigate the relation of starspots and magnetic fields from the photometry and ZDI. We also explore the multiwavelength rotational variability ascribed to starspots and active regions for the TESS, B-band, H$\\alpha$, and X-ray light curves. As a result, we find that (i) spot locations deduced from the TESS light curve are mostly consistent with the intensity map from the ZDI except for a polar spot, and (ii) the H$\\alpha$ light curve exhibits clear periodicity with respect to the TESS light curve because the H$\\alpha$ line is radiated around spots in the chromosphere. The X-ray light curve does not show such association probably because of multiple spots on high activity level and extended spatial structure of coronal active regions. The results provide clues to explore their association with stellar flares at different heights of active regions in chromospheric and coronal lines. Our study also enables us to quantify the stellar XUV radiation from the magnetic fields of active stars toward understanding atmospheric evolution of exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2602.15979.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16139",
      "title": "Investigating Ionospheric TEC Variations in Solar and Geomagnetic Influences Across Solar Activity Phases",
      "authors": [
        "Ziyadat Hassan",
        "Zamri Zainal Abidin",
        "Affan Adly Nazri",
        "Nursyazela Badrina Baharin"
      ],
      "abstract": "Investigating Ionospheric TEC Variations in Solar and Geomagnetic Influences Across Solar Activity Phases Ziyadat Hassan, Zamri Zainal Abidin, Affan Adly Nazri, Nursyazela Badrina Baharin 17 pages, 4 figures; Accepted for publication in Advances in Space Research Solar and Stellar Astrophysics (astro-ph.SR) This study examines the variability of ionospheric total electron content (VTEC) in response to solar and geomagnetic drivers across solar cycles 23 to 25. While the dominant effect of solar radiation on VTEC is well-known, a comprehensive understanding of how these relationships and their time-lags vary across distinct solar cycle phases and across cycles of differing intensity has been lacking. Using global VTEC data from the Chinese Academy of Sciences Global Ionospheric Maps (CASG) and solar-geophysical indices from NASA's OMNI dataset spanning from 1998 to 2025, this study bridges that gap by quantifying correlation strengths and time-lag relationships between VTEC and parameters such as $F_{10.7}$ solar flux, R sunspot number, Kp, Ap, and Dst indices, and solar wind properties. Results show that solar proxies, particularly $F_{10.7}$ and R sunspot number, exhibit the strongest, most consistent correlations with VTEC, especially during the ascending and descending phases of the solar cycle, with a characteristic $\\sim2$-day lag attributed to thermospheric oxygen dynamics and ionospheric recombination processes. In contrast, geomagnetic indices exhibit weaker and phase-dependent correlations, while direct correlations between solar wind parameters and global VTEC are weak, as their influence is primarily mediated by geomagnetic activity and exhibits strong regional and temporal heterogeneity. Phase-resolved analyses further reveal that geomagnetic activity plays a more prominent role during transitional phases, while maximum and minimum periods are dominated by EUV variability and non-solar drivers, respectively. These findings highlight the necessity of incorporating solar phase and time-lag dependencies in ionospheric modelling and forecasting efforts.",
      "pdf_url": "https://arxiv.org/pdf/2602.16139.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16221",
      "title": "Reinterpreting the sunward electron deficit: Implications for solar wind acceleration and core population formation",
      "authors": [
        "Zoltan Nemeth"
      ],
      "abstract": "Reinterpreting the sunward electron deficit: Implications for solar wind acceleration and core population formation Zoltan Nemeth Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) This paper re-evaluates the relationship between the observed sunward electron cutoff energy and the depth of the Sun's global electrostatic potential. It investigates whether taking into account the effects of local traps formed by magnetic fluctuations provides an alternative explanation for the observed electron deficit. The fluctuations of the highly variable interplanetary magnetic field form a series of shallow magnetic mirror traps that move at approximately the speed of the solar wind. The study investigates the dynamics of electrons as they move outward against an attractive solar electrostatic potential and interact with these traps. By following the motion of the electrons using first-principles calculations, we assess the effect of the traps on the velocity distribution of the particles. Electrons that escape the local trap continue to lose energy as they move outward until they are eventually captured by subsequent traps, preventing them from returning to the observer as sunward-moving particles. We derive a mathematical expression for the cutoff velocity, defined as the limit beyond which particles can no longer overtake the outer endpoint of a local trap. It turns out that the observed cutoff energy characterizes only the local potential drop within a trap, rather than the total depth of the Sun's potential well. The true potential well can be significantly deeper, scaled by the ratio of the radial distance from the Sun to the trap size. Furthermore, electrons captured by these moving traps contribute to the formation of the solar wind core population. The Sun's electrostatic potential is a more significant factor in solar wind acceleration than previously interpreted from cutoff data. The interaction between electrostatic deceleration and moving magnetic traps provides a new framework for understanding the origin and behavior of the solar wind core electrons.",
      "pdf_url": "https://arxiv.org/pdf/2602.16221.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16239",
      "title": "Propagation Characteristics of the April 21, 2023 CME",
      "authors": [
        "Sandeep Kumar",
        "Nandita Srivastava",
        "Parthib Banerjee",
        "Nat Gopalswamy"
      ],
      "abstract": "Propagation Characteristics of the April 21, 2023 CME Sandeep Kumar, Nandita Srivastava, Parthib Banerjee, Nat Gopalswamy Accepted for publication in The Journal of Astrophysics and Astronomy Solar and Stellar Astrophysics (astro-ph.SR) Accurate estimation of propagation characteristics of coronal mass ejections (CMEs) is crucial for predicting their geoeffectiveness. Stereoscopic techniques to study the kinematics of CMEs generally have been carried out using remote sensing observations from three viewpoints, i.e. STEREO-A, STEREO-B, and SOHO. Since the loss of STEREO-B in 2014, stereoscopic reconstruction of CMEs has been restricted to the observations from only two viewpoints, i.e., STEREO-A and SOHO. When the angle of separation between STEREO-A and SOHO is small, it leads to larger uncertainties in the CME kinematics derived using stereoscopic techniques. In this paper, we demonstrate how this limitation can be addressed and how uncertainties in the estimation of CME kinematics and propagation direction can be reduced. For this purpose, we selected the CME of April 21, 2023, which was observed by two spacecraft, i.e. STEREO-A and SOHO, separated by a small 10 degree angle. Using the Graduated Cylindrical Shell (GCS) model on the remote-sensing observations near the Sun and the Advanced Drag-Based Model (ADBM) in the heliosphere, we estimated the arrival time of the CME at different locations in the heliosphere and compared it with the actual arrival time obtained from the in-situ measurements taken by three spacecraft, BepiColombo, STEREO-A and Wind. Our analysis reveals a directional uncertainty of approx 20 degree from observations from two viewpoints. These uncertainties significantly affect the arrival-time prediction of the CME. We consider the actual chronology of CME arrival times at STEREO-A and Wind as critical parameters to constrain the direction of propagation, which serves as a key input in the ADBM. The chronology of arrival of the CME ejecta at STEREO-A, which is 4.5 hrs earlier than at Wind, proved essential for resolving directional ambiguities in the GCS reconstruction model",
      "pdf_url": "https://arxiv.org/pdf/2602.16239.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16395",
      "title": "Accretion Disk Magnetic Braking",
      "authors": [
        "Kurt Liffman"
      ],
      "abstract": "Accretion Disk Magnetic Braking Kurt Liffman Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) A protostellar disk is threaded by a static magnetic field that is perpendicular to the disk-surface. The magnetic field acts to brake the protostellar disk and cause the disk material to move towards the protostar. General analytic equations are derived for the accretion speed, and mass accretion rate. Simplified analytic equations are also obtained for the disk energy dissipation, accretion timescale and the disk radial position plus disk surface density, as a function of time. In addition to providing physical insight, such equations might be useful as a check on computational models for protostar and protostellar disk formation.",
      "pdf_url": "https://arxiv.org/pdf/2602.16395.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16519",
      "title": "The role of radiative torques in the molecular cloud core L43",
      "authors": [
        "Marco Leon Scheiter",
        "Sebastian Wolf"
      ],
      "abstract": "The role of radiative torques in the molecular cloud core L43 Marco Leon Scheiter, Sebastian Wolf Astronomy & Astrophysics, 705, A207 (2026) Solar and Stellar Astrophysics (astro-ph.SR) Polarized emission from interstellar dust grains is commonly used to infer information about the underlying magnetic field from the diffuse interstellar medium to molecular cloud cores. Therefore, the ability to accurately determine properties of the magnetic field requires a thorough understanding of the dust alignment mechanism. We investigate the influence of anisotropic radiation fields on the alignment of dust particles by magnetic fields, known as radiative torque (RAT) alignment. Specifically, we take advantage of the unique spatial configuration of the molecular cloud core L43, which contains an embedded yet optically visible star acting as a local source of anisotropic illumination. Based on polarization maps obtained at wavelengths of $154 \\mu\\mathrm{m}$ (SOFIA/HAWC+), as well as $450 \\mu\\mathrm{m}$ and $850 \\mu\\mathrm{m}$ (JCMT/SCUBA-2), which show variations in the degree and angle of polarized emission across all wavelengths, we applied the differential measure analysis method to infer magnetic field strengths and analyze the global polarization spectrum of this source. We derived plane-of-sky magnetic field strengths ranging from approximately 13 to 60 $\\mu\\mathrm{G}$, varying with wavelength, and find a negative slope of the polarization spectrum. Compared to 3D radiative transfer simulations, this finding can be attributed, at least partially, to variations in dust properties and temperatures along the line of sight. However, the additional influence of variations in the magnetic field orientation along the line of sight cannot be ruled out. Our results favor radiative torques as the primary alignment mechanism, as they indicate that the degree of polarization is dependent on temperature and hence the strength of the local radiation field.",
      "pdf_url": "https://arxiv.org/pdf/2602.16519.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16526",
      "title": "New self-consistent theoretical descriptions for mass-loss rates of O-type stars",
      "authors": [
        "F. Figueroa-Tapia",
        "J. A. Panei",
        "M. Curé",
        "I. Araya",
        "S. Ekström",
        "A. C. Gormaz-Matamala",
        "R. O. J. Venero",
        "L. S. Cidale"
      ],
      "abstract": "New self-consistent theoretical descriptions for mass-loss rates of O-type stars F. Figueroa-Tapia, J. A. Panei, M. Curé, I. Araya, S. Ekström, A. C. Gormaz-Matamala, R. O. J. Venero, L. S. Cidale Accepted for publication at A&A journal Solar and Stellar Astrophysics (astro-ph.SR) Massive O-type stars lose a significant fraction of their mass through radiation-driven winds, a process that critically shapes their evolution and feedback into the interstellar medium. Accurate predictions of mass-loss rates are essential for models of stellar structure and population synthesis. We computed wind parameters for O-type stars using a self-consistent approach that couples the hydrodynamics of the wind with detailed calculations of the line acceleration. This approach follows the theory of radiation-driven stellar winds and allows us to derive mass-loss rate distributions for different atomic configurations of the stellar flux. We used the TLUSTY code for stellar atmosphere models to compute non-local thermodynamic equilibrium models; these models served as input radiation fields for the calculation of the line-force parameters, for which we used the LOCUS code. These line-force parameters were then iteratively coupled with the HYDWIND code to solve the wind hydrodynamics. The procedure was applied across a grid of stellar parameters for three chemical configurations. We obtain self-consistent wind parameters for a broad set of O-type stellar models. The results show a systematic decrease in mass-loss rates with the inclusion of more elements in the radiation field, which is attributed to a strong effect on the UV region of the spectral energy distribution. As more elements are included, resulting in a larger number of spectral lines, the contribution from the UV diminishes, leading to lower mass-loss rates. We fitted three theoretical prescriptions for $\\dot{M}$ using a Bayesian approach; this yielded Pearson correlation values greater than 0.92 for all three model grids. It also allowed for the estimation of the wind momentum-luminosity relationships for each of the grids, yielding results similar to those based on observations of O-type stars.",
      "pdf_url": "https://arxiv.org/pdf/2602.16526.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16656",
      "title": "Investigating Nonlinear Quenching Effects on Polar Field Buildup in the Sun Using Physics-Informed Neural Networks",
      "authors": [
        "Jithu J. Athalathil",
        "Mohammed H. Talafha",
        "Bhargav Vaidya"
      ],
      "abstract": "Investigating Nonlinear Quenching Effects on Polar Field Buildup in the Sun Using Physics-Informed Neural Networks Jithu J. Athalathil, Mohammed H. Talafha, Bhargav Vaidya Accepted for publication in The Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR); Machine Learning (cs.LG) The solar dynamo relies on the regeneration of the poloidal magnetic field through processes strongly modulated by nonlinear feedbacks such as tilt quenching (TQ) and latitude quenching (LQ). These mechanisms play a decisive role in regulating the buildup of the Sun's polar field and, in turn, the amplitude of future solar cycles. In this work, we employ Physics-Informed Neural Networks (PINN) to solve the surface flux transport (SFT) equation, embedding physical constraints directly into the neural network framework. By systematically varying transport parameters, we isolate the relative contributions of TQ and LQ to polar dipole buildup. We use the residual dipole moment as a diagnostic for cycle-to-cycle amplification and show that TQ suppression strengthens with increasing diffusivity, while LQ dominates in advection-dominated regimes. The ratio $\\Delta D_{\\mathrm{LQ}}/\\Delta D_{\\mathrm{TQ}}$ exhibits a smooth inverse-square dependence on the dynamo effectivity range, refining previous empirical fits with improved accuracy and reduced scatter. The results further reveal that the need for a decay term is not essential for PINN set-up due to the training process. Compared with the traditional 1D SFT model, the PINN framework achieves significantly lower error metrics and more robust recovery of nonlinear trends. Our results suggest that the nonlinear interplay between LQ and TQ can naturally produce alternations between weak and strong cycles, providing a physical explanation for the observed even-odd cycle modulation. These findings demonstrate the potential of PINN as an accurate, efficient, and physically consistent tool for solar cycle prediction.",
      "pdf_url": "https://arxiv.org/pdf/2602.16656.pdf",
      "categories": [
        "astro-ph.SR",
        "cs.LG"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16676",
      "title": "Orbital Motions of Binaries in Orion South",
      "authors": [
        "Luis A. Zapata",
        "Luis F. Rodríguez"
      ],
      "abstract": "Orbital Motions of Binaries in Orion South Luis A. Zapata, Luis F. Rodríguez (Instituto de Radioastronomía y Astrofísica, UNAM) Solar and Stellar Astrophysics (astro-ph.SR) We present high-angular resolution ($\\simeq 0\\rlap.{''}06$) VLA and ALMA observations of Orion South separated by 15.52 years. The purpose of this study was to search for orbital motions in three close ($\\simeq 0\\rlap.{''}1$) binary systems in the region. We do not detect changes in the position angle of the binaries but in two of the cases we detect significant changes in their separation in the plane of the sky. We use these changes to estimate that the total mass of the binaries is in the $\\simeq$1-2 $M_\\odot$ range. We also estimate the disk masses from the mm emission. The dust-to-stellar mass ratio is in the range of 0.04 to 0.18, values consistent with those expected for very early stellar evolution (Class 0) protostars.",
      "pdf_url": "https://arxiv.org/pdf/2602.16676.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16009",
      "title": "CHARA Array Delay Lines: Upgrades, Performance and Future Directions",
      "authors": [
        "Narsireddy Anugu , Nils H. Turner , Theo A. ten Brummelaar , Gail H. Schaefer , Philippe Bério , Christopher D. Farrington , Becky Flores , Douglas R. Gies , Stefan Kraus , Edgar R. Ligon III , Olli Majoinen , John D. Monnier , Denis Mourard , Nicholas J. Scott , Norman L. Vargas The CHARA Array of Georgia State University, Mount Wilson Observatory, Mount Wilson, CA, USA, Universite Cote d Azur, Observatoire de la Cote d Azur, CNRS, France, Astrophysics Group, University of Exeter, Exeter, UK, Astronomy Department, University of Michigan, Ann Arbor, MI, USA)"
      ],
      "abstract": "CHARA Array Delay Lines: Upgrades, Performance and Future Directions Narsireddy Anugu (1), Nils H. Turner (1), Theo A. ten Brummelaar (1), Gail H. Schaefer (1), Philippe Bério (2), Christopher D. Farrington (1), Becky Flores (1), Douglas R. Gies (1), Stefan Kraus (3), Edgar R. Ligon III (1), Olli Majoinen (1), John D. Monnier (4), Denis Mourard (2), Nicholas J. Scott (1), Norman L. Vargas (1) ((1) The CHARA Array of Georgia State University, Mount Wilson Observatory, Mount Wilson, CA, USA, (2) Universite Cote d Azur, Observatoire de la Cote d Azur, CNRS, France, (3) Astrophysics Group, University of Exeter, Exeter, UK, (4) Astronomy Department, University of Michigan, Ann Arbor, MI, USA) Accepted for publication in SPIE Journal of Astronomical Telescopes, Instruments, and Systems (JATIS). 33 pages, 17 figures Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Long baseline optical and infrared interferometric arrays achieve high angular resolution and enable detailed astrophysical measurements. Interferometers have enabled observations of stars at various stages of evolution, as well as studies of binary stars, circumstellar disks, and active galactic nuclei. The CHARA Array is a long-baseline interferometric array at the Mount Wilson Observatory, USA. At the core of CHARA operations are the delay lines, which equalize the optical path length for all telescopes as the Earth rotates and compensate for optical path variations induced by atmospheric turbulence. We report recent upgrades and performance of the CHARA Array optical delay lines for high-precision interferometric observations. The legacy system had been operational for over two decades, and it was increasingly difficult to acquire replacement parts. Beginning in mid-2021, the control system underwent a major upgrade, replacing the aging VME-based architecture with a modern hybrid FPGA and Linux-based system; this modernization continued through the end of 2024. We describe hardware/software changes, the servo architecture, and lab/on-sky performance. The upgraded system achieves residual delay line cart tracking errors of $\\sim12$~nm, the same level as the legacy system, and a control bandwidth of 100-130~Hz, allowing fringe tracking across the R, H, and K bands. Initial commissioning revealed key issues such as metrology time-tick jitter and vibration-induced visibility loss, which were diagnosed and resolved. We note ongoing and future efforts to extend baselines up to 1~km and support advanced observing modes such as dual-field interferometry and nulling. This paper is a reference for current and future use of the CHARA Array and for next-generation instrument design.",
      "pdf_url": "https://arxiv.org/pdf/2602.16009.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06200",
      "title": "StarEmbed: Benchmarking Time Series Foundation Models on Astronomical Observations of Variable Stars",
      "authors": [
        "Weijian Li",
        "Hong-Yu Chen",
        "Nabeel Rehemtulla",
        "Ved G. Shah",
        "Dennis Wu",
        "Dongho Kim",
        "Qinjie Lin",
        "Adam A. Miller",
        "Han Liu"
      ],
      "abstract": "StarEmbed: Benchmarking Time Series Foundation Models on Astronomical Observations of Variable Stars Weijian Li, Hong-Yu Chen, Nabeel Rehemtulla, Ved G. Shah, Dennis Wu, Dongho Kim, Qinjie Lin, Adam A. Miller, Han Liu Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI) Time series foundation models (TSFMs) are increasingly being adopted as highly-capable general-purpose time series representation learners. Although their training corpora are vast, they exclude astronomical time series data. Observations of stars produce peta-scale time series with unique challenges including irregular sampling and heteroskedasticity. We introduce StarEmbed, the first public benchmark for rigorous and standardized evaluation of state-of-the-art TSFMs on stellar time series observations (``light curves''). We benchmark on three scientifically-motivated downstream tasks: unsupervised clustering, supervised classification, and out-of-distribution source detection. StarEmbed integrates a catalog of expert-vetted labels with multi-variate light curves from the Zwicky Transient Facility, yielding ~40k hand-labeled light curves spread across seven astrophysical classes. We evaluate the zero-shot representation capabilities of three TSFMs (MOIRAI, Chronos, Chronos-Bolt) and a domain-specific transformer (Astromer) against handcrafted feature extraction, the long-standing baseline in the astrophysics literature. Our results demonstrate that these TSFMs, especially the Chronos models, which are trained on data completely unlike the astronomical observations, can outperform established astrophysics-specific baselines in some tasks and effectively generalize to entirely new data. In particular, TSFMs deliver state-of-the-art performance on our out-of-distribution source detection benchmark. With the first benchmark of TSFMs on astronomical time series data, we test the limits of their generalization and motivate a paradigm shift in time-domain astronomy from using task-specific, fully supervised pipelines toward adopting generic foundation model representations for the analysis of peta-scale datasets from forthcoming observatories.",
      "pdf_url": "https://arxiv.org/pdf/2510.06200.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13949",
      "title": "An Explicit M1 Radiation-hydrodynamics Scheme for 3D Protostellar Evolution",
      "authors": [
        "Kazutaka Kimura",
        "Kazuyuki Sugimura",
        "Takashi Hosokawa",
        "Hajime Fukushima",
        "Kazuyuki Omukai"
      ],
      "abstract": "An Explicit M1 Radiation-hydrodynamics Scheme for 3D Protostellar Evolution Kazutaka Kimura, Kazuyuki Sugimura, Takashi Hosokawa, Hajime Fukushima, Kazuyuki Omukai 33 pages, 9 figures, 6 table, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) We present a radiation-hydrodynamics (RHD) scheme that enables 3D simulations resolving both protostellar interiors and their surrounding accretion flows within a single framework, to clarify how a protostar evolves while interacting with the accretion flow. The method builds on an explicit two-moment M1 closure scheme with a reduced speed of light approximation (RSLA) for massively parallel computation. Our scheme introduces a complementary non-RSLA radiation component that dominates in optically thick regions. This hybrid treatment restores physical energy conservation inside protostars, which would otherwise be violated under the RSLA, while retaining the advantage of large time steps. To overcome the limitation of the conventional M1 closure in solving radiative transfer in extremely optically thick regions inside protostars and across steep optical-depth gradients near their surfaces, we incorporate the optical-depth information of neighboring cells into the radiative transfer calculation. We further evolve photon-number densities in addition to radiation energy densities to reconstruct an effective local spectrum on the fly without resorting to costly multi-frequency transport. We implement this scheme in the adaptive mesh refinement code SFUMATO and verify its validity through a series of test calculations. As an application, we follow the early evolution of a massive protostar formed at high redshift, within a full cosmological context. The results reveal a continuous structure connecting the swollen protostar and its surrounding disk, which cannot be captured in conventional 1D models. This RHD scheme opens a path to studies of protostellar evolution and its interaction with the accretion flow in realistic 3D environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.13949.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.01201",
      "title": "Data-driven Radiative Magnetohydrodynamics Simulations with the MURaM Code: the Emergence of Active Region 11158 and the X2.2 Flare",
      "authors": [
        "Feng Chen"
      ],
      "abstract": "Data-driven Radiative Magnetohydrodynamics Simulations with the MURaM Code: the Emergence of Active Region 11158 and the X2.2 Flare Feng Chen 17 Pages, 8 figures, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) We present the application of the data-driven branch of the MURaM code to the extensively studied flare-productive active region 11158. We refine the hybrid model strategy, which was described in the earlier paper of this series, to model the emergence of the active region during 4 solar days starting shortly before 2011 February 11 and the eruption of an X2.2 flare on February 15. After 4 days of evolution, a major eruption of a magnetic flux rope occurs in the simulation at approximately 3 hours (3\\% difference) before the real flare. The eruption leads to magnetic reconnection that contributes to bulk heating in the chromosphere and corona. The deposition of flare energy in the chromosphere causes strong condensations and evaporations, which fill hot post-flare loops and bright flare ribbons that exhibit separation and extension similar to the observed ribbon evolution. The synthesized soft X-ray flux corresponds to X class, which is close to the real event. The upward eruption of the flux rope leads to a piston-driven shock and horizontal expansion that exerts a strong downward impact on the lower atmosphere and generate an apparently fast-propagating chromospheric Moreton wave. We conclude that the data-driven radiative simulation of this active region can reproduce the key observational results of the real flare and demonstrate the great potential of this method for studying solar eruptions in a realistic corona environment.",
      "pdf_url": "https://arxiv.org/pdf/2512.01201.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.05188",
      "title": "Novel Physics of Escaping Secondary Atmospheres May Shape the Cosmic Shoreline",
      "authors": [
        "Richard D. Chatterjee",
        "Raymond T. Pierrehumbert"
      ],
      "abstract": "Novel Physics of Escaping Secondary Atmospheres May Shape the Cosmic Shoreline Richard D. Chatterjee, Raymond T. Pierrehumbert Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Recent James Webb Space Telescope observations of cool, rocky exoplanets reveal a probable lack of thick atmospheres, suggesting prevalent escape of the secondary atmospheres formed after losing primordial hydrogen. Yet, simulations indicate that hydrodynamic escape of secondary atmospheres, composed of nitrogen and carbon dioxide, requires intense fluxes of ionizing radiation (XUV) to overcome the effects of high molecular weight and efficient line cooling. This transonic outflow of hot, ionized metals (not hydrogen) presents a novel astrophysical regime ripe for exploration. We introduce an analytic framework to determine which planets retain or lose their atmospheres, positioning them on either side of the cosmic shoreline. We model the radial structure of escaping atmospheres as polytropic expansions - power-law relationships between density and temperature driven by local XUV heating. Our approach diagnoses line cooling with a three-level atom model and incorporates how ion-electron interactions reduce mean molecular weight. Crucially, hydrodynamic escape onsets for a threshold XUV flux dependent upon the atmosphere's gravitational binding. Ensuing escape rates either scale linearly with XUV flux when weakly ionized (energy-limited) or are controlled by a collisional-radiative thermostat when strongly ionized. Thus, airlessness is determined by whether the XUV flux surpasses the critical threshold during the star's active periods, accounting for expendable primordial hydrogen and revival by volcanism. We explore atmospheric escape from Young-Sun Mars and Earth, LHS 1140 b and c, and TRAPPIST-1 b. Our modeling characterizes the bottleneck of atmospheric loss on the occurrence of observable Earth-like habitats and offers analytic tools for future studies.",
      "pdf_url": "https://arxiv.org/pdf/2412.05188.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15930",
      "title": "A targeted machine learning approach for detecting diffuse radio emission with Astronomaly: Protege",
      "authors": [
        "Verlon Etsebeth",
        "Michelle Lochner",
        "Konstantinos Kolokythas",
        "Kenda Knowles",
        "Emma Tolley"
      ],
      "abstract": "A targeted machine learning approach for detecting diffuse radio emission with Astronomaly: Protege Verlon Etsebeth, Michelle Lochner, Konstantinos Kolokythas, Kenda Knowles, Emma Tolley Instrumentation and Methods for Astrophysics (astro-ph.IM) Diffuse radio emission in galaxy clusters, such as radio halos, relics, and mini halos, is a key tracer of non-thermal processes, turbulence, and magnetic fields within the intra-cluster medium. However, their low surface brightness, as well as contamination from compact sources and imaging artefacts, makes their detection challenging. The sheer volume of data from instruments such as the Square Kilometre Array will render traditional manual-inspection based detection methods infeasible. This paper introduces a novel machine learning approach that uses active learning to rapidly identify diffuse emission candidates from a small, optimally-selected subset of data. We apply the self-supervised deep learning algorithm Bootstrap Your Own Latent to extract features from source cutouts in the MeerKAT Galaxy Cluster Legacy Survey (MGCLS). We then pass these features through the Astronomaly: Protege anomaly detection framework to identify the final candidates. Using a human-labelled set, we evaluate our pipeline on high-resolution (~7''), convolved (15''), and combined-feature MGCLS datasets. Interestingly, the high-resolution features identify diffuse sources more efficiently than the convolved resolution, which are in turn outperformed by the combined features. Of the top 100 sources ranked by Protege, 99% exhibit diffuse characteristics, with 55% confirmed as cluster-related emission. Our work shows that Protege can identify diffuse emission with minimal human labelling effort, offering a powerful, scalable tool capable of detecting both known and novel diffuse radio sources.",
      "pdf_url": "https://arxiv.org/pdf/2602.15930.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16128",
      "title": "Graph--Based Event Fingerprints for Classifying Geomagnetic Storm--Driven Forbush Decreases",
      "authors": [
        "Juan D. Perez-Navarro",
        "D. Sierra-Porta"
      ],
      "abstract": "Graph--Based Event Fingerprints for Classifying Geomagnetic Storm--Driven Forbush Decreases Juan D. Perez-Navarro, D. Sierra-Porta Instrumentation and Methods for Astrophysics (astro-ph.IM) Forbush decreases (FDs) are transient depressions in the galactic cosmic-ray flux observed by global neutron-monitor networks and are commonly associated with interplanetary disturbances driven by coronal mass ejections and related shocks. Despite extensive observational work, quantitatively comparing FD morphology across events and linking it to storm severity remains challenging due to heterogeneous station responses, coverage gaps, and the multivariate nature of the network. This work introduces a graph-based event representation in which each FD is mapped to an event network constructed from pairwise dissimilarities between station response time series. A controlled sparse backbone is obtained via the minimum spanning tree, enabling comparable event graphs across cases. From each graph, a compact set of geometric/topological fingerprints is computed, including global integration measures, spectral summaries, mesoscopic structure, centrality aggregates, and complexity descriptors. Predictive skill is assessed using strict leave-one-event-out validation over a pre-defined grid of distance metrics and distance-domain transformations, with selection criteria fixed \\emph{a priori}. The proposed fingerprints exhibit measurable signal for three tasks: (i) multi-class classification of geomagnetic storm intensity (G3/G4/G5) with moderate but consistent performance and errors dominated by adjacent categories; (ii) stronger binary severity screening ($\\ge$G4 vs.\\ G3) with high sensitivity to severe events; and (iii) drop regression with partial least squares achieving positive explained variance relative to a fold-wise mean baseline.",
      "pdf_url": "https://arxiv.org/pdf/2602.16128.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16415",
      "title": "The Astronomical Telescope of the University of Stuttgart (ATUS): Development, Optimization, and Lessons Learned",
      "authors": [
        "Karsten Schindler",
        "Jürgen Wolf",
        "Alfred Krabbe"
      ],
      "abstract": "The Astronomical Telescope of the University of Stuttgart (ATUS): Development, Optimization, and Lessons Learned Karsten Schindler, Jürgen Wolf, Alfred Krabbe 44 pages, 30 figures, 8 tables. This is the Accepted Manuscript version of an article accepted for publication in the Publications of the Astronomical Society of the Pacific. IOP Publishing Ltd is not responsible for any errors or omissions in this version of the manuscript or any version derived from it Instrumentation and Methods for Astrophysics (astro-ph.IM) ATUS, the Astronomical Telescope of the University of Stuttgart, is a fully remote-controlled 0.6 m f/8.17 Ritchey-Chrétien telescope optimized for high-cadence, high-fidelity photometry of transient sources. Observations are time-referenced with very high accuracy and precision, making it an ideal platform for time-domain astronomy and space situational awareness. Initially conceived to support instrument developments and operations of SOFIA, the Stratospheric Observatory for Infrared Astronomy, it evolved into a scientific instrument for various use cases in instrument development, astronomical research, and teaching. This paper presents an overview of its development and optimization to achieve diffraction-limited images and highly accurate pointing and tracking, even at high speeds. The findings and lessons learned are universally applicable to other telescopes that are currently at the planning stage, or where similar issues might be encountered.",
      "pdf_url": "https://arxiv.org/pdf/2602.16415.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16297",
      "title": "Characterization of an MPPC-Based Scintillator Telescope and Measurement of Cosmic Muon Angular Distribution",
      "authors": [
        "Sahla Manithottathil",
        "Anuj Gupta",
        "Mudit Kumar",
        "Navaneeth Poonthottathil"
      ],
      "abstract": "Characterization of an MPPC-Based Scintillator Telescope and Measurement of Cosmic Muon Angular Distribution Sahla Manithottathil, Anuj Gupta, Mudit Kumar, Navaneeth Poonthottathil Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Experiment (hep-ex) This report presents the design, characterization, and application of a high-sensitivity optical detection system based on plastic scintillators coupled to Multi-Pixel Photon Counters (MPPCs). The primary objective was to evaluate the performance of MPPCs (Silicon Photomultipliers) as robust, low-voltage alternatives to traditional photomultiplier tubes for detecting faint scintillation light. The optoelectronic properties of the sensors were analyzed, including single-photoelectron gain calibration and dark count rate measurements, to optimize the signal-to-noise ratio. By embedding wavelength-shifting fibers to enhance light collection efficiency, the system was configured into a three-fold coincidence telescope. The angular distribution of the cosmic ray muon flux was measured to validate the detector's stability and geometric acceptance. Fitting the experimental data to a $\\bm{\\cos^n(\\theta)}$ distribution yielded an angular exponent of $\\bm{n = 1.44 \\pm 0.06}$, consistent with literature values. These results demonstrate the efficacy of the MPPC-scintillator coupling for precise photon counting and timing applications in high-energy physics instrumentation.",
      "pdf_url": "https://arxiv.org/pdf/2602.16297.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02971",
      "title": "Millimeter-Wavelength Lens-Absorber-Coupled Ti/Al Kinetic Inductance Detectors",
      "authors": [
        "Alejandro Pascual Laguna",
        "Victor Rollano",
        "Aimar Najarro-Fiandra",
        "David Rodriguez",
        "Maria T. Magaz",
        "Daniel Granados",
        "Alicia Gomez"
      ],
      "abstract": "Millimeter-Wavelength Lens-Absorber-Coupled Ti/Al Kinetic Inductance Detectors Alejandro Pascual Laguna, Victor Rollano, Aimar Najarro-Fiandra, David Rodriguez, Maria T. Magaz, Daniel Granados, Alicia Gomez This work has been accepted for publication in the IEEE Transactions on Applied Superconductivity Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det); Optics (physics.optics) This work presents Ti/Al bi-layer Microwave Kinetic Inductance Detectors (MKIDs) based on lens-coupled spiral absorbers as the quasi-optical coupling mechanism for millimeter-wavelength radiation detection. From simulations, the lens-coupled absorbers provide a 70% lens aperture efficiency in both polarizations over an octave band with a spiral array absorber and over 10% relative bandwidth with a single spiral. We have fabricated and measured two devices with bare Ti/Al MKIDs: a 3x3 cm chip with 9 pixels to characterize the optical response at 85 GHz of the two variations of the absorber; and a large format demonstrator with 253 spiral-array pixels showing potential towards a large format millimeter-wavelength camera. We estimate a sensitivity of 1 $\\mathrm{mK}\\cdot\\mathrm{Hz}^{-0.5}$ and a 95% detector yield.",
      "pdf_url": "https://arxiv.org/pdf/2510.02971.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.13918",
      "title": "The James Webb Space Telescope Absolute Flux Calibration. V. Near-Infrared Camera Wide Field Slitless Spectroscopy",
      "authors": [
        "Nor Pirzkal",
        "Martha Boyer",
        "Russel E. Ryan Jr"
      ],
      "abstract": "The James Webb Space Telescope Absolute Flux Calibration. V. Near-Infrared Camera Wide Field Slitless Spectroscopy Nor Pirzkal, Martha Boyer, Russel E. Ryan Jr 24 pages, 31 Figures. Accepted to AJ Instrumentation and Methods for Astrophysics (astro-ph.IM) We present the absolute flux and wavelength calibration of the James Webb Space Telescope (JWST) Near-Infrared Camera (NIRCam) Wide Field Slitless Spectroscopy (WFSS) mode. Each of NIRCam's two modules (A and B) provides independent long wavelength (LW) grism spectroscopy over the 2.4-5.0 micron range, with orthogonally oriented R and C grisms. Using commissioning and calibration data from programs 01076, 01536, 01537, 01538, 01479, 01480, 04449, 04498, 06606, and 06628, we have measured the field-dependent geometry and wavelength dispersion of both first and second order spectra across the full detector area. The trace geometry was modeled using two-dimensional third-order polynomials that reproduce the observed spectral positions with an RMS accuracy better than 0.1 pixel. Wavelength calibration, derived from observations of the planetary nebula SMP LMC 58, achieves a precision of 0.65-0.91A for the +1 orders and 0.5A for the +2 orders. Absolute flux calibration, established from observations of the G-type star standard P330E, provides a consistent sensitivity function across all grisms and modules with an absolute flux accuracy of 3\\%. The resulting calibration framework defines the geometric, wavelength, and photometric reference for all NIRCam WFSS observations and ensures cross-consistency between modules and grism orientations. These calibrations form the basis for accurate slitless spectroscopy with NIRCam and will support ongoing improvements to the JWST calibration pipeline and data products.",
      "pdf_url": "https://arxiv.org/pdf/2602.13918.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.15978",
      "title": "Planet-Disk Interactions and the Convective Overstability. I. Low Mass Planets",
      "authors": [
        "M. Lehmann",
        "M.K. Lin"
      ],
      "abstract": "Planet-Disk Interactions and the Convective Overstability. I. Low Mass Planets M. Lehmann (ISU), M.K. Lin (ASIAA, NCTS) 30 pages, 12 figures. Accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP) Rapid inward migration driven by Type I torques threatens the survival of low-mass planets in their nascent protoplanetary disks (PPDs). Positive co-rotation torques offer a potential solution, but require viscous diffusion to remain unsaturated. However, it is unclear if (magneto)-hydrodynamic turbulence provides the necessary diffusion, and disk profiles supporting such torques are often also susceptible to the Convective Overstability (COS) for suitable gas cooling timescales. To this end, we investigate torques on low-mass planets through radially global 2D (razor-thin) and vertically unstratified 3D hydrodynamic simulations of PPDs with thermal diffusion and optically thin cooling. Our 3D models with thermal diffusion, which allows COS development, show systematically different torque behavior compared to 2D models, wherein COS is absent. In 3D, the COS saturates into large-scale, long-lived vortices that migrate radially and interact gravitationally with the embedded planet. When these vortices encounter the planet, they typically provide positive torque \"kicks\" counteracting inward migration, as the less-massive vortices are scattered onto horseshoe orbits by the more-massive planet. We validate our simulation methods against the theoretical framework of Paardekooper et al. (2011) and demonstrate that COS-induced torque modifications can extend migration timescales by factors of approximately 10. For plausible disk models, our results suggest that COS activity can lengthen migration timescales sufficiently to overlap with, or even exceed Super-Earth formation windows (0.1-5 Myr). In contrast, simulations with optically thin cooling do not show significant torque modifications, as COS saturates in near-axisymmetric structures without producing large-scale vortices for the disk models considered here.",
      "pdf_url": "https://arxiv.org/pdf/2602.15978.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16043",
      "title": "Diffusive Instabilities in Dusty Disks: Linear Growth and Nonlinear Breakdown",
      "authors": [
        "Konstantin Gerbig",
        "Min-Kai Lin"
      ],
      "abstract": "Diffusive Instabilities in Dusty Disks: Linear Growth and Nonlinear Breakdown Konstantin Gerbig, Min-Kai Lin 12 pages, 7 figures, accepted in ApJ Earth and Planetary Astrophysics (astro-ph.EP) We revisit the diffusive instability in dusty disks that arises when the dust mass diffusivity and/or viscosity decreases sufficiently steeply with increasing dust density. Our updated model includes an incompressible, viscous gas that responds azimuthally and couples to the dust through drag. We show that the basic criterion for diffusion-slope-driven instability remains approximately $\\beta_\\mathrm{diff}\\lesssim -2$ for small dust stopping times, with gas feedback providing only modest quantitative changes for parameters motivated by streaming-instability turbulence. We perform nonlinear numerical calculations and confirm linear growth and mode selection toward the fastest-growing wavenumber. However, for power-law closures $D\\propto\\Sigma^{\\beta_\\mathrm{diff}}$ with $\\beta_\\mathrm{diff}<0$, the nonlinear evolution does not saturate. Instead, steepening gradients amplify the nonlinear dust-pressure term and drive finite-time collapse into increasingly sharp spikes. Motivated by the absence of multidimensional saturation channels in our 1D framework, we test a simple piecewise closure in which the negative diffusion slope operates only over a finite density interval. This modification eliminates blowup and produces peak densities controlled by the imposed saturation scale. Our results support diffusive instabilities as a linear organizing mechanism in dusty turbulence, while highlighting that realistic nonlinear saturation requires additional physics beyond the present closure.",
      "pdf_url": "https://arxiv.org/pdf/2602.16043.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16056",
      "title": "Direct contact binary planetesimal formation from gravitational collapse",
      "authors": [
        "Jackson T. Barnes",
        "Stephen R. Schwartz",
        "Seth A. Jacobson"
      ],
      "abstract": "Direct contact binary planetesimal formation from gravitational collapse Jackson T. Barnes, Stephen R. Schwartz, Seth A. Jacobson Earth and Planetary Astrophysics (astro-ph.EP) Bilobate contact binaries comprise a significant fraction of the relict Kuiper Belt, which includes the exemplary contact binary (486958) Arrokoth. The surfaces of its lobes contain similar amounts of highly volatile chemical species and few craters, indicating formation in a homogeneous and gentle environment. Arrokoth's bilobate shape was initially hypothesized to have formed via the direct gravitational collapse of a pebble cloud in the solar system's protoplanetary disk. However, alternative hypotheses have proposed that Arrokoth may be the result of binary planetesimal formation and the subsequent dynamical evolution of the binary components into contact through external perturbations over long timescales. Here, we show that contact binary planetesimals like Arrokoth can form directly from the gravitational collapse of pebble clouds. We used a soft-sphere discrete element method (SSDEM) to discover that planetesimals form a wide variety of shapes, including bilobate contact binaries. This method creates planetesimals as particle-aggregates with particles resting upon each other's surfaces via mutual surface penetration. The formation of contact binaries in our simulations strengthens the hypothesis that Arrokoth, and perhaps many other contact binaries in the Kuiper Belt, formed directly as bilobate objects from gravitational collapse, and so their shapes and surfaces record the era of planet formation.",
      "pdf_url": "https://arxiv.org/pdf/2602.16056.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16359",
      "title": "Numerical analysis of Lyapunov Times for Trans-Neptunian Objects and Main-Belt Asteroids: stability, accuracy, and methodological comparisons",
      "authors": [
        "Paweł Wajer",
        "Małgorzata Królikowska",
        "Jakub Suchecki"
      ],
      "abstract": "Numerical analysis of Lyapunov Times for Trans-Neptunian Objects and Main-Belt Asteroids: stability, accuracy, and methodological comparisons Paweł Wajer, Małgorzata Królikowska, Jakub Suchecki Earth and Planetary Astrophysics (astro-ph.EP) We computed Lyapunov times ($T_L$) for a sample of trans-Neptunian objects (TNOs) and outer main-belt asteroids (MBAs) using three numerical approaches: the variational method and two implementations of the renormalization technique. For each object, $T_L$ was derived both from the nominal orbit and from ensembles of 1001 orbital clones, enabling direct comparison between single-orbit and ensemble-based estimates. Across the sample, the methods generally produced consistent results, though larger discrepancies were observed for some MBAs. TNOs, in contrast, displayed greater consistency across methods, likely due to fewer overlapping resonances. Importantly, clone ensembles provided more robust and reliable stability indicators than nominal-orbit computations. Median values from clone populations reduced method-dependent biases and revealed dynamical behaviors that would remain hidden in single-orbit analyses, especially for objects with poorly constrained orbits or evolving in resonant regions. While our study focused on a limited but diverse set of objects, the methodology can be directly extended to larger populations, offering a systematic framework for exploring the long-term stability and dynamical evolution of main-belt asteroids, trans-Neptunian objects or other classes of objects in the Solar System.",
      "pdf_url": "https://arxiv.org/pdf/2602.16359.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16396",
      "title": "Deepest ever photographed Geminid with small but not negligible terminal mass",
      "authors": [
        "Pavel Spurný",
        "Jiří Borovička"
      ],
      "abstract": "Deepest ever photographed Geminid with small but not negligible terminal mass Pavel Spurný, Jiří Borovička Earth and Planetary Astrophysics (astro-ph.EP) We report an instrumental observation of the very exceptional Geminid fireball which was observed in scope of the Czech part of the European Fireball Network (EN) on 13 December 2012 at 4h12m59.4s UT. The uniqueness of this Geminid fireball consists of the record depth of its penetration in the atmosphere (to the height of 32.5 km) and in the fact that most likely a very small fraction of its initial mass survived severe deceleration in the atmosphere and landed on the ground. Such deeply penetrating Geminid with so precise and reliable data has not yet been observed. From a comparison with a large number of Geminids observed by the European Fireball Network and all brightest Geminids from the Prairie Fireball Network in USA and the Canadian MORP Network, we have shown that for Geminids with an entry mass greater than approximately 10 grams, the terminal altitude limit does not decrease further as it does for smaller Geminids, but remains constant at around 38 km. In this comparison, we have shown that there is only one exception, and that is the Geminid presented here. This one penetrated nearly 6 km deeper with very low terminal speed for Geminids. During the atmospheric flight this Geminid meteoroid slowed down from its original speed of 35.75 km/s to 6.8 km/s. This small meteoroid with initial mass of only 0.25 kg is probably the fastest candidate for a meteorite dropping event ever observed. This solid meteoroid belonging to the meteor shower survived a significant dynamic pressure of almost 2 MPa and thus ranks among the interplanetary bodies of asteroidal origin that caused the observed meteorite fall. Although a similar Geminid event has been previously presented in the literature, we demonstrate here that this claim was flawed.",
      "pdf_url": "https://arxiv.org/pdf/2602.16396.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16453",
      "title": "Benchmarking Photolysis Rates with Socrates (24.11): Species for Earth and Exoplanets",
      "authors": [
        "Sophia M. Adams",
        "James Manners",
        "Nathan Mayne",
        "Mei Ting Mak",
        "Éric Hébrard"
      ],
      "abstract": "Benchmarking Photolysis Rates with Socrates (24.11): Species for Earth and Exoplanets Sophia M. Adams, James Manners, Nathan Mayne, Mei Ting Mak, Éric Hébrard Accepted for Publication in Geoscientific Model Development: this https URL (55 pages, 26 figures) Earth and Planetary Astrophysics (astro-ph.EP) Using the Socrates photolysis scheme, we present newly calculated photolysis rates under modern Earth atmospheric conditions for species directly relevant to Earth and species relevant to different atmospheric compositions. We compare to a previous photolysis comparison exercise, namely PhotoComp 2011. Overall, we find good agreement between our results and previous work, with discrepancies usually caused by the implementation of temperature or pressure dependent quantum yields and updated cross-section data. We provide a new set of benchmark photolysis rates for additional species both for Solar irradiance and when irradiated by an M dwarf host star. In general, the higher actinic flux at far-UV and shorter wavelengths of the M dwarf compared to the Sun drives increased photolysis rates for reactions with high threshold energies. This work provides an updated set of benchmark results for further studies of photolysis in the Earth's atmosphere and that of other planets.",
      "pdf_url": "https://arxiv.org/pdf/2602.16453.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16614",
      "title": "Meteor statistics I: The distribution of instrumental magnitudes",
      "authors": [
        "Althea V. Moorhead",
        "Peter G. Brown",
        "Margaret D. Campbell-Brown",
        "Michael J. Mazur",
        "Denis Vida"
      ],
      "abstract": "Meteor statistics I: The distribution of instrumental magnitudes Althea V. Moorhead, Peter G. Brown, Margaret D. Campbell-Brown, Michael J. Mazur, Denis Vida Accepted for publication in the Astronomical Journal Earth and Planetary Astrophysics (astro-ph.EP) The distribution of meteor magnitudes is known to follow an exponential distribution, where the base of this distribution is called the population index. The distribution of observed magnitudes preserves this behavior, but is truncated by the detection threshold. If both the population index and detection threshold can be determined, observed meteor rates can be converted to fluxes and extrapolated to any desired brightness or size. We argue that the distribution of observed or instrumental meteor magnitudes is best modeled as an exponentially modified Gaussian (exGaussian) distribution. This is for three reasons: first, an exGaussian distribution is the natural result of random variations in detection threshold and/or post-detection measurement errors in magnitude. Second, an exGaussian distribution provides a better fit to the magnitude distribution than all other competing distributions in the literature; we demonstrate this using both a set of faint optical meteor magnitudes and a set of radar meteor echo amplitudes. Finally, the population index, mean detection threshold, and random variation/error terms are easily extracted from the best-fit parameters of an exGaussian distribution.",
      "pdf_url": "https://arxiv.org/pdf/2602.16614.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16646",
      "title": "Two warm sub-Saturn mass planets identified from the TESS Full Frame Images",
      "authors": [
        "Felipe I. Rojas",
        "Rafael Brahm",
        "Andrés Jordán",
        "Néstor Espinoza",
        "Thomas Henning",
        "Jan Eberhardt",
        "Melissa J. Hobson",
        "Martin Schlecker",
        "Marcelo Tala Pinto",
        "Trifon Trifonov",
        "Lyu Abe",
        "Gaspar Bakos",
        "Mauro Barbieri",
        "Khalid Barkaoui",
        "Christopher J. Burke",
        "R. Paul Butler",
        "Ilaria Carleo",
        "Karen A. Collins",
        "Jeffrey D. Crane",
        "Zoltan Csubry",
        "Phil Evans",
        "Tristan Guillot",
        "Chelsea X. Huang",
        "Jon M. Jenkins",
        "Matias I. Jones",
        "Diana Kossakowski",
        "David W. Latham",
        "Andrew W. Mann",
        "Djamel Mékarnia",
        "Maximiliano Moyano",
        "Sangeetha Nandakumar",
        "Hugh P. Osborn",
        "George Ricker",
        "David Rodriguez",
        "Paula Sarkis",
        "Richard P. Schwarz",
        "Sara Seager",
        "Ramotholo Sefako",
        "Stephen Shectman",
        "Gregor Srdoc",
        "Stephanie Striegel",
        "Vincent Suc",
        "Johanna Teske",
        "Ian Thompson",
        "Pascal Torres-Miranda",
        "Roland Vanderspek",
        "José Vines",
        "Sharon X. Wang",
        "Joshua N. Winn",
        "Carl Ziegler"
      ],
      "abstract": "Two warm sub-Saturn mass planets identified from the TESS Full Frame Images Felipe I. Rojas, Rafael Brahm, Andrés Jordán, Néstor Espinoza, Thomas Henning, Jan Eberhardt, Melissa J. Hobson, Martin Schlecker, Marcelo Tala Pinto, Trifon Trifonov, Lyu Abe, Gaspar Bakos, Mauro Barbieri, Khalid Barkaoui, Christopher J. Burke, R. Paul Butler, Ilaria Carleo, Karen A. Collins, Jeffrey D. Crane, Zoltan Csubry, Phil Evans, Tristan Guillot, Chelsea X. Huang, Jon M. Jenkins, Matias I. Jones, Diana Kossakowski, David W. Latham, Andrew W. Mann, Djamel Mékarnia, Maximiliano Moyano, Sangeetha Nandakumar, Hugh P. Osborn, George Ricker, David Rodriguez, Paula Sarkis, Richard P. Schwarz, Sara Seager, Ramotholo Sefako, Stephen Shectman, Gregor Srdoc, Stephanie Striegel, Vincent Suc, Johanna Teske, Ian Thompson, Pascal Torres-Miranda, Roland Vanderspek, José Vines, Sharon X. Wang, Joshua N. Winn, Carl Ziegler 18 pages, 15 figures. Submitted to A&A Earth and Planetary Astrophysics (astro-ph.EP) Context. Characterization of warm giants is crucial to constrain giant planet formation and evolution. Measuring the mass and radius of these planets, combined with their moderated irradiation, allows us to estimate their planetary bulk composition, which is a key quantity to comprehend giant planet formation and structure. Aims. We present the discovery of two transiting warm giant planets orbiting solar-type stars from the Transiting Exoplanet Survey Satellite (TESS), which were characterized by further spectroscopic and photometric ground-based observations. Methods. We performed a joint analysis of photometric data with radial velocities to confirm and characterize TOI-883 b and TOI-899 b, two sub-Saturns orbiting solar-like stars. Results. TOI-883 b and TOI-899 b have masses of $0.123 \\pm 0.012$ $M_J$ and $0.213 \\pm 0.024$ $M_J$, radius of $0.604 \\pm 0.028$ $R_J$ and $0.991 \\pm 0.044$ $R_J$, periods of $10.06$ d and $12.85$ d and equilibrium temperature of $1086 \\pm 19$ K and $1040 \\pm 19$ K, respectively. Conclusions. While having similar masses, orbital periods and stellar host properties, these planets seem to have different internal compositions, which could point to distinct formation histories. Both planets are suitable targets for atmospheric studies to further constrain formation scenarios of planets in the Neptune-Saturn mass range",
      "pdf_url": "https://arxiv.org/pdf/2602.16646.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.12977",
      "title": "TIC-65910228 b / NGTS-38 b, a 180 day transiting warm super-Jupiter",
      "authors": [
        "Toby Rodel",
        "Solène Ulmer-Moll",
        "Samuel Gill",
        "Christopher. A. Watson",
        "Yoshi Nike Emilia Eschen",
        "Alix V. Freckelton",
        "Annelies Mortier",
        "Karen A. Collins",
        "Diana Dragomir",
        "Zahra Essack",
        "Brett Skinner",
        "Niamh Mallaghan",
        "Peter J. Wheatley",
        "David R. Anderson",
        "Ioannis Apergis",
        "Khalid Barkaoui",
        "Matthew P. Battley",
        "Daniel Bayliss",
        "François Bouchy",
        "Edward M. Bryant",
        "Matthew R. Burleigh",
        "Benjamin M. J. Cadell",
        "Samuel J. Carlier",
        "Yann Carteret",
        "Sarah L. Casewell",
        "Alastair B. Claringbold",
        "Jean C. Costes",
        "Benjamin D. R. Davies",
        "Lauren Doyle",
        "Phil Evans",
        "Jorge Fernández Fernández",
        "Emile Fontanet",
        "Edward Gillen",
        "Michael R. Goad",
        "George Harvey",
        "Faith Hawthorn",
        "Katlyn L. Hobbs",
        "Melissa Hobson",
        "Giovanni Isopi",
        "James S. Jenkins",
        "Alicia Kendall",
        "David Kipping",
        "Monika Lendl",
        "Franco Mallia",
        "Christopher Mann",
        "James McCormac",
        "Ernst J.W. de Mooij",
        "Maximiliano Moyano",
        "Arianna Nigioni",
        "Mohammad Odeh",
        "Vera Maria Passegger",
        "Suman Saha",
        "Richard P. Schwarz",
        "Amber Sedgley",
        "Avi Shporer",
        "Abderahmane Soubkiou",
        "Stéphane Udry",
        "Dimitri Veras",
        "Jean. P. Vignes",
        "Steven Villanueva Jr.",
        "José I. Vinés",
        "Richard West",
        "Thomas G. Wilson",
        "Hannah L. Worters",
        "Mitchell E. Young",
        "Aldo Zapparata"
      ],
      "abstract": "TIC-65910228 b / NGTS-38 b, a 180 day transiting warm super-Jupiter Toby Rodel, Solène Ulmer-Moll, Samuel Gill, Christopher. A. Watson, Yoshi Nike Emilia Eschen, Alix V. Freckelton, Annelies Mortier, Karen A. Collins, Diana Dragomir, Zahra Essack, Brett Skinner, Niamh Mallaghan, Peter J. Wheatley, David R. Anderson, Ioannis Apergis, Khalid Barkaoui, Matthew P. Battley, Daniel Bayliss, François Bouchy, Edward M. Bryant, Matthew R. Burleigh, Benjamin M. J. Cadell, Samuel J. Carlier, Yann Carteret, Sarah L. Casewell, Alastair B. Claringbold, Jean C. Costes, Benjamin D. R. Davies, Lauren Doyle, Phil Evans, Jorge Fernández Fernández, Emile Fontanet, Edward Gillen, Michael R. Goad, George Harvey, Faith Hawthorn, Katlyn L. Hobbs, Melissa Hobson, Giovanni Isopi, James S. Jenkins, Alicia Kendall, David Kipping, Monika Lendl, Franco Mallia, Christopher Mann, James McCormac, Ernst J.W. de Mooij, Maximiliano Moyano, Arianna Nigioni, Mohammad Odeh, Vera Maria Passegger, Suman Saha, Richard P. Schwarz, Amber Sedgley, Avi Shporer, Abderahmane Soubkiou, Stéphane Udry, Dimitri Veras, Jean. P. Vignes, Steven Villanueva Jr., José I. Vinés, Richard West, Thomas G. Wilson, Hannah L. Worters, Mitchell E. Young, Aldo Zapparata 23 pages, 13 figures, 8 tables. Submitted to Monthly Notices of the Royal Astronomical Society. Coordinated simultaneous submission with independent paper by Rojas et al Earth and Planetary Astrophysics (astro-ph.EP) We present the discovery of TIC-65910228 b / NGTS-38 b, a giant exoplanet with a radius of $1.081\\pm0.047$ R$_\\text{J}$ and a mass of $4.78_{-0.37}^{+0.40}$ M$_\\text{J}$ on a long-period ($180.52791\\pm0.00038$ day), moderately eccentric ($e=0.308\\pm0.011$) orbit transiting a bright (V=$10.230\\pm0.020$ mag) metal rich ([Fe/H]=$0.33\\pm0.09$, 'dex') F6V-F7V type host star. The planet was initially detected from a single transit in TESS Sector 33. A photometric monitoring campaign of 228 nights with NGTS detected a transit egress of the planet, which together with spectroscopic radial velocity monitoring with CORALIE and HARPS identified an orbital period of ~180.5,d. These radial velocity measurements also showed the mass of the companion to be planetary. Additional transit observations coordinated by the TESS follow-up observing program allowed further confirmation and refinement of this period. With its relatively cool equilibrium temperature of $458\\pm11$ K, NGTS-38 b joins a small but growing population of well characterised transiting warm-Jupiters and has one of the longest periods of any discovered to date. The target is situated in the LOPS2 field of the upcoming PLATO mission which will allow for greater refinement of the system parameters and potential for the discovery of additional companions too small and/or too long-period to be seen by TESS or NGTS. NGTS-38 b's bright host star and wide orbital separation make it an attractive target for further study, including potential measurement of its spin-orbit alignment or targeted exomoon/ring searches.",
      "pdf_url": "https://arxiv.org/pdf/2602.12977.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}