{
  "date": "2025-10-30",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.EP",
    "astro-ph.IM",
    "astro-ph.SR"
  ],
  "total_papers": 113,
  "gw_related_papers": 8,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.23750",
      "title": "Study of Neutron Star Properties under the Two-Flavor Quark NJL Model",
      "authors": [
        "Chunran Zhu",
        "Bolin Li"
      ],
      "abstract": "Study of Neutron Star Properties under the Two-Flavor Quark NJL Model Chunran Zhu, Bolin Li High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); Nuclear Theory (nucl-th) The Equation of State (EOS) of matter within neutron stars is a central topic in nuclear physics and astrophysics. A precise understanding of the composition and phase behavior of matter under such extreme conditions is crucial for uncovering the fundamental laws of the strong interaction. This study investigates hadron-quark hybrid stars using a two-flavor Nambu-Jona-Lasinio (NJL) model. As an effective theory, this model can describe the generation of dynamical quark masses and chiral symmetry restoration characteristic of dense quark matter. We construct the hybrid EOS by joining the BSR6 relativistic mean-field model for hadronic matter with the NJL model for quark matter. A quintic polynomial interpolation ensures a smooth ($C^2$ continuity) and thermodynamically consistent crossover between the phases. Based on this hybrid EOS, we solve the Tolman-Oppenheimer-Volkoff (TOV) equations to calculate macroscopic properties of neutron stars, such as the mass-radius ($M-R$) relationship and the tidal deformability parameter ($\\Lambda$). By exploring key model parameters, we identify a region satisfying a wide range of multi-messenger constraints. Our resulting EOS supports a maximum mass consistent with PSR J0740+6620, while simultaneously predicting radii and tidal deformabilities for a $1.4M_{\\odot}$ star that agree with NICER observations and limits from GW170817. This work thus presents a self-consistent model that resolves the tension between high-mass pulsars and small tidal deformabilities, deepening our understanding of the hadron-quark crossover.",
      "pdf_url": "https://arxiv.org/pdf/2510.23750.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "hep-ph",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24696",
      "title": "How Flat is a Plateau? Evolution of Late-Time TDE Disks",
      "authors": [
        "Yael Alush",
        "Nicholas C. Stone",
        "Sjoert van Velzen"
      ],
      "abstract": "How Flat is a Plateau? Evolution of Late-Time TDE Disks Yael Alush, Nicholas C. Stone, Sjoert van Velzen 12 pages, 8 figures, 9 tables. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Late-time light curve plateaus in tidal disruption events (TDEs) are often approximated as flat and time-independent. This simplification is motivated by theoretical modeling of spreading late time TDE disks, which often predicts slow light curve evolution. However, if time evolution can be detected, late-time light curves will yield more information than has been previously accessible. In this work, we re-examine late-time TDE data to test how well the flat plateau assumption holds. We use Markov Chain Monte Carlo to estimate the maximum likelihood for a family of theory-agnostic models and apply the Akaike information criterion to find that that roughly one third of our sample favors evolving plateaus, one third favors truly flat plateaus, and one third shows no statistically significant evidence for any plateau. Next, we refit the TDEs that exhibit statistically significant plateaus using a magnetically elevated $\\alpha$-disk model, motivated by the lack of clear thermal instability in late time TDE light curves. From these model-dependent fits, we obtain estimates for the supermassive black hole (SMBH) mass, the mass of the disrupted star, and the $\\alpha$ parameter itself. Fitted $\\alpha$ values range from $10^{-3}$ to 0.4 (the mean fitted $\\alpha=10^{-1.8}$, with scatter of 0.6 dex), broadly consistent with results from magnetohydrodynamic simulations. Finally, we estimate the timescales of disk precession in magnetically elevated TDE models. Theoretically, we find that disk precession times may be orders of magnitude shorter than in unmagnetized Shakura-Sunyaev disks, and grow in time as $T_{\\rm prec}\\propto t^{35/36}$; empirically, by using fitted $\\alpha$ parameters, we estimate that late time disks may experience $\\sim$few-10 precession cycles.",
      "pdf_url": "https://arxiv.org/pdf/2510.24696.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.11585",
      "title": "Gravitational Redshift from Galaxy Clusters -- a Relativistic Approach",
      "authors": [
        "Enea Di Dio",
        "Sveva Castello",
        "Camille Bonvin"
      ],
      "abstract": "Gravitational Redshift from Galaxy Clusters -- a Relativistic Approach Enea Di Dio, Sveva Castello, Camille Bonvin 40 pages, 12 figures, v2: minor modifications to match published version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The light that we receive from clusters of galaxies is redshifted by the presence of the clusters' gravitational potential. This effect, known as gravitational redshift, was first detected from a sample of stacked clusters in 2011, by taking redshift differences between the centre of each cluster and the respective member galaxies. However, the interpretation of this result was later challenged by several studies, which emphasised the possible influence of additional kinematic effects on the observed signal, like the transverse Doppler effect. In this work, we present the first derivation of all such effects within a relativistic framework, accurate to third order in the weak-field approximation. This framework allows us to correctly capture the hierarchy of terms on the scale of clusters and at the same time account for all relativistic effects. We compare our result with previous literature and show that some terms of the same order of the transverse Doppler effect were not properly included, leading to an overestimation of the kinematic contamination. In particular, we do not find any contribution arising from the so-called light-cone effect and obtain a larger correction due the motion of the central galaxy. Our derivation is independent of the Euler equation, providing a straightforward framework to test the weak equivalence principle.",
      "pdf_url": "https://arxiv.org/pdf/2503.11585.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.16415",
      "title": "Apparent $w<-1$ and a Lower $S_8$ from Dark Axion and Dark Baryons Interactions",
      "authors": [
        "Justin Khoury",
        "Meng-Xiang Lin",
        "Mark Trodden"
      ],
      "abstract": "Apparent $w<-1$ and a Lower $S_8$ from Dark Axion and Dark Baryons Interactions Justin Khoury, Meng-Xiang Lin, Mark Trodden Match the published version in PRL. Add references and discussions. 10 pages, 6 figures Phys.Rev.Lett. 135 (2025) 18, 181001 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We show that a simple coupling between dark energy and dark matter can simultaneously address two distinct hints at new physics coming from cosmological observations. The first is the recent evidence from the DESI project and supernovae observations that the dark energy equation of state~$w$ is evolving over cosmic time from an earlier value that is~$<-1$ to a present-day value~$>-1$. The second observation is the so-called~$S_8$ tension, describing the suppression of the growth of matter overdensities compared to that expected in the~$\\Lambda$CDM model. We propose a stable, technically natural particle physics implementation of this idea, in which dark matter consists of dark baryons in a strongly-coupled hidden sector, and the dark energy field is the associated dark axion. The time-variation of the dark matter mass results in an effective dark energy equation of state that exhibits a phantom crossing behavior consistent with recent results. It also results in a slight delay in matter-radiation equality, which suppresses the overall growth of density perturbations.",
      "pdf_url": "https://arxiv.org/pdf/2503.16415.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.14077",
      "title": "A Hubble constant estimation with dark standard sirens and galaxy cluster catalogues",
      "authors": [
        "Freija Beirnaert",
        "Archisman Ghosh",
        "Gergely Dálya"
      ],
      "abstract": "A Hubble constant estimation with dark standard sirens and galaxy cluster catalogues Freija Beirnaert, Archisman Ghosh, Gergely Dálya Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) In this paper, we explore the possibility of using galaxy cluster catalogues to provide redshift support for a gravitational-wave dark standard siren measurement of the Hubble constant $H_0$. We adapt the cosmology inference pipeline gwcosmo to handle galaxy cluster catalogues. Together with binary black holes from the GWTC-3, we use galaxy cluster data from the PSZ2 and the eRASS catalogues. With these catalogues, we obtain $H_0 = 77^{+10}_{-10}$ and $81^{+8}_{-8}\\, \\text{km}\\, \\text{s}^{-1}\\, \\text{Mpc}^{-1}$ respectively, which demonstrates improvements on precision by factors of 10% and 38% respectively over the traditional galaxy catalogue result. This exploratory work paves the way towards precise and accurate cosmography making use of distant compact binary mergers from upcoming observing runs of the LIGO-Virgo-KAGRA detector network and future gravitational-wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2505.14077.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.18264",
      "title": "Addressing $H_0$ and $S_8$ tensions within $f(Q)$ cosmology",
      "authors": [
        "Carlos G. Boiza",
        "Maria Petronikolou",
        "Mariam Bouhmadi-López",
        "Emmanuel N. Saridakis"
      ],
      "abstract": "Addressing $H_0$ and $S_8$ tensions within $f(Q)$ cosmology Carlos G. Boiza, Maria Petronikolou, Mariam Bouhmadi-López, Emmanuel N. Saridakis 20 pages, 5 figures, 3 tables, REVTeX 4.2. Version accepted for publication in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate the viability of $f(Q)$ gravity as an alternative framework to address the $H_0$ and $S_8$ tensions in cosmology. Focusing on three representative $f(Q)$ models, we perform a comprehensive Bayesian analysis using a combination of cosmological observations, including cosmic chronometers, Type Ia supernovae, gamma-ray bursts, baryon acoustic oscillations, and CMB distance priors. Our results demonstrate that most of these models can yield higher values of $H_0$ than those predicted by $\\Lambda$CDM, offering a partial alleviation of the tension. In addition, one model satisfies the condition $G_{\\mathrm{eff}} < G$, making it a promising candidate for addressing the $S_8$ tension. However, these improvements are accompanied by mild internal inconsistencies between different subsets of data, which limit the overall statistical preference relative to $\\Lambda$CDM. Despite this, $f(Q)$ gravity remains a promising and flexible framework for late-time cosmology, and our results motivate further exploration of extended or hybrid models that may reconcile all observational constraints.",
      "pdf_url": "https://arxiv.org/pdf/2505.18264.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07193",
      "title": "Braneworld Dark Energy in light of DESI DR2",
      "authors": [
        "Swagat S. Mishra",
        "William L. Matthewson",
        "Varun Sahni",
        "Arman Shafieloo",
        "Yuri Shtanov"
      ],
      "abstract": "Braneworld Dark Energy in light of DESI DR2 Swagat S. Mishra, William L. Matthewson, Varun Sahni, Arman Shafieloo, Yuri Shtanov Main text - 23 pages and 18 figures (details in appendices). Results extended to include MCMC for GR, additional comments and references, matches the accepted version in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Recent observational results from the DESI collaboration reveal tensions with the standard $\\Lambda$CDM model and favour a scenario in which dark energy (DE) decays over time. The DESI DR2 data also suggest that the DE equation of state (EoS) may have been phantom-like ($w < - 1$) in the past, evolving to $w > - 1$ at present, implying a recent crossing of the phantom divide at $w = - 1$. Scalar field models of DE naturally emerge in ultraviolet-complete theories such as string theory, which is typically formulated in higher dimensions. In this work, we investigate a broad class of $thawing~scalar~field~models$, including the simple quadratic, quartic, exponential, symmetry-breaking and axion potentials, propagating on a (4+1)-dimensional ghost-free phantom braneworld, and demonstrate that their effective EoS exhibits a phantom-divide crossing. Alongside the Hubble parameter and EoS of DE, we also analyse the evolution of the $Om$ diagnostic, and demonstrate that the time dependence of these quantities is in excellent agreement with the DESI DR2 observations. Furthermore, we perform a comprehensive parameter estimation using Markov Chain Monte Carlo sampling, and find that the $\\chi^2$ values for all our models are remarkably close to that of the widely used CPL parametrisation, indicating that our models fit the data very well.",
      "pdf_url": "https://arxiv.org/pdf/2507.07193.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.17315",
      "title": "Prospects for searching for sterile neutrinos in dynamical dark energy cosmologies using joint observations of gravitational waves and $γ$-ray bursts",
      "authors": [
        "Lu Feng",
        "Tao Han",
        "Jing-Fei Zhang",
        "Xin Zhang"
      ],
      "abstract": "Prospects for searching for sterile neutrinos in dynamical dark energy cosmologies using joint observations of gravitational waves and $γ$-ray bursts Lu Feng, Tao Han, Jing-Fei Zhang, Xin Zhang Chinese Physics C 50 (2026) 015105 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) In the era of third-generation (3G) gravitational-wave (GW) detectors, GW standard siren observations from binary neutron star mergers provide a powerful tool for probing the expansion history of the universe. Since sterile neutrinos can influence cosmic evolution by modifying the radiation content and suppressing structure formation, GW standard sirens offer promising prospects for constraining sterile neutrino properties within a cosmological framework. Building on this, we investigate the prospects for detecting sterile neutrinos in dynamical dark energy (DE) models using joint observations from 3G GW detectors and a future short gamma-ray burst detector, such as a THESEUS-like telescope. We consider three DE models: the $w$CDM, holographic DE (HDE), and Chevallier-Polarski-Linder (CPL) models. Our results show that the properties of DE can influence the constraints on sterile neutrino parameters. Moreover, the inclusion of GW data significantly improves constraints on both sterile neutrino parameters and other cosmological parameters across all three models, compared to the current limits derived from CMB+BAO+SN (CBS) observations. When GW data are included into the CBS dataset, a preference for $\\Delta N_{\\rm eff} > 0$ emerges at approximately the $1\\sigma$ level in the $w$CDM and CPL models, and reaches about $3\\sigma$ in the HDE model. Moreover, the upper limits on $m_{\\nu,{\\rm sterile}}^{\\rm eff}$ are reduced by approximately 13%, 75%, and 3% in the $w$CDM, HDE, and CPL models, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2507.17315.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.18867",
      "title": "Reexamining Evidence of a Pair-Instability Mass Gap in the Binary Black Hole Population",
      "authors": [
        "Anarya Ray",
        "Vicky Kalogera"
      ],
      "abstract": "Reexamining Evidence of a Pair-Instability Mass Gap in the Binary Black Hole Population Anarya Ray, Vicky Kalogera High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The fourth gravitational wave transient catalog~(GWTC-4) has enabled empirical probes of the theorized pair-instability gap in the higher end of the binary black hole~(BBH) mass-spectrum. In this letter, using flexibly parametrized models, we show that at present there is no evidence of a sharp drop-off in the spectrum of black hole masses near $~40-50M_{\\odot}$. We simultaneously characterize the transition in the distribution of BBH mass-ratios, effective aligned and effective precessing spins using our flexible models. From the transitions in our inferred spin and mass-ratio distributions, we find that the high-mass broad-spin sub-population has a significant fraction~($52^{+18}_{-23}\\%$) of systems with mass ratios in the range $0.6-1$. This suggests that alternatives to the hypothesis of 2G+1G hierarchical systems dominating BBH formation above $\\sim 40-50 M_{\\odot}$ are more consistent with the GWTC-4 detection sample. By comparing with the predictions of star cluster simulations, we further show that contributions from (2G+2G) systems are not abundant enough to alleviate this discrepancy. We also demonstrate the effects of strong model assumptions on this inference, which can lead to biased astrophysical interpretation from restricted priors. We note that our results do not exclude that a high-mass gap may be identified as our sample size increases. We constrain the lower bound on the location of a possible PISN cutoff still allowed within measurement uncertainties to be $(57^{+17}_{-10}M_{\\odot})$ and discuss its implications on the S factor of $^{12}\\mathrm{C}(\\alpha, \\gamma)^{16}O$ at 300 kev.",
      "pdf_url": "https://arxiv.org/pdf/2510.18867.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.23705",
      "title": "Gravothermal collapse of self-interacting dark-matter halos with anisotropic velocity distributions",
      "authors": [
        "Marc Kamionkowski",
        "Kris Sigurdson"
      ],
      "abstract": "Gravothermal collapse of self-interacting dark-matter halos with anisotropic velocity distributions Marc Kamionkowski, Kris Sigurdson 6 pages, 4 figures, NSphere-SIDM code available on GitHub at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Self-gravitating galactic halos composed of self-interacting dark matter exhibit the formation of a highly dense core at the galactic center--a gravothermal collapse. Analytic models to describe this evolution have been developed and calibrated to numerical simulations initialized with isotropic particle velocity distributions, an assumption not necessarily warranted by the theory of halo formation. Here we study the dependence of the timescale for gravothermal collapse on the velocity distribution. To do so, we consider self-consistent initial conditions for halos with the same density distribution but with different velocity distributions. We consider models with constant anisotropy and with an anisotropy that increases with radius. The velocity distributions that we explore have collapse times that differ from that assuming isotropic distributions by more than a factor of two. We argue that these variations may depend on the global changes in velocity-dispersion profiles in these anisotropic models and not just on the degree of anisotropy.",
      "pdf_url": "https://arxiv.org/pdf/2510.23705.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23769",
      "title": "Clustering properties of the CatWISE2020 quasar catalogue and their impact on the cosmic dipole anomaly",
      "authors": [
        "Sebastian von Hausegger",
        "Nathan Secrest",
        "Harry Desmond",
        "Mohamed Rameez",
        "Roya Mohayaee",
        "Subir Sarkar"
      ],
      "abstract": "Clustering properties of the CatWISE2020 quasar catalogue and their impact on the cosmic dipole anomaly Sebastian von Hausegger, Nathan Secrest, Harry Desmond, Mohamed Rameez, Roya Mohayaee, Subir Sarkar Cosmology and Nongalactic Astrophysics (astro-ph.CO) The cosmic dipole anomaly -- the observation of a significant mismatch between the dipole observed in the matter distribution and that expected given the kinematic interpretation of the cosmic microwave background dipole -- poses a serious challenge to the Cosmological Principle upon which the standard model of cosmology rests. Measurements of the dipole ($\\ell=1$) in a given sample crucially depend on having control over other large-scale power ($\\ell > 1$) so as to avoid biases, in particular those potentially caused by correlations among multipoles during fitting, and those by local source clustering. Currently, the most powerful catalogue that exhibits the cosmic dipole anomaly is the sample of 1.6~million mid-infrared quasars derived from CatWISE2020. We therefore analyse clustering properties of this catalogue by performing an inference analysis of large-scale multipoles in real space, and by computing its angular power spectrum on small scales to test for convergence with $\\Lambda$CDM. After accounting for the known trend of the quasar number counts with ecliptic latitude, we find that any other large-scale power is consistent with noise, find no evidence for the presence of an octupole ($\\ell=3$) in the data, and quantify the clustering dipole's proportion to be marginal. Our results therefore reaffirm the anomalously high dipole in the distribution of quasars.",
      "pdf_url": "https://arxiv.org/pdf/2510.23769.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23823",
      "title": "The Local Distance Network: a community consensus report on the measurement of the Hubble constant at 1% precision",
      "authors": [
        "H0DN Collaboration: Stefano Casertano , Gagandeep Anand , Richard I. Anderson , Rachael Beaton , Anupam Bhardwaj , John P. Blakeslee , Paula Boubel , Louise Breuval , Dillon Brout , Michele Cantiello , Mauricio Cruz Reyes , Geza Csörnyei , Thomas de Jaeger , Suhail Dhawan , Eleonora Di Valentino , Lluís Galbany , Héctor Gil-Marín , Dariusz Graczyk , Caroline Huang , Joseph B. Jensen , Pierre Kervella , Bruno Leibundgut , Bastian Lengen , Siyang Li , Lucas Macri , Emre Özülker , Dominic W. Pesce , Adam Riess , Martino Romaniello , Khaled Said , Nils Schöneberg , Dan Scolnic , Teresa Sicignano , Dorota M. Skowron , Syed A. Uddin , Licia Verde , Antonella Nota Space Telescope Science Institute, Institute of Physics, École Polytechnique Fédérale de Lausanne , Observatoire de Sauverny, Inter-University Centre for Astronomy and Astrophysics , NSF NOIRLab, Research School of Astronomy \\&amp; Astrophysics, Australian National University, European Space Agency , ESA Office, Space Telescope Science Institute, Boston University Departments of Astronomy and Physics, INAF -- Astronomical Observatory of Abruzzo, Max-Planck-Institute for Astrophysics, Garching, Sorbonne Université, CNRS, Laboratoire de Physique Nucléaire et de Hautes Energies, School of Physics and Astronomy, University of Birmingham, School of Mathematical and Physical Sciences, University of Sheffield, Institute of Space Sciences , Institut d'Estudis Espacials de Catalunya , Institut de Ciències del Cosmos , Universitat de Barcelona , Departament de Física Quàntica i Astrofísica, Universitat de Barcelona, Polish Academy of Sciences, Nicolaus Copernicus Astronomical Center, Department of Astrophysics, Center for Astrophysics | Harvard \\&amp; Smithsonian, Department of Physics, Utah Valley University, LIRA, Observatoire de Paris, Université PSL, Sorbonne Université, Université Paris Cité, French-Chilean Laboratory for Astronomy, IRL 3386, CNRS and U. de Chile, European Southern Observatory, Department of Physics \\&amp; Astronomy, Johns Hopkins University, Department of Astronomy, University of California, Berkeley, Department of Physics \\&amp; Astronomy, College of Sciences, University of Texas Rio Grande Valley, School of Mathematics and Physics, University of Queensland, University Observatory, Faculty of Physics, Ludwig-Maximilians-Universität, Excellence Cluster ORIGINS, Department of Physics, Duke University, Scuola Superiore Meridionale, INAF-Osservatorio Astronomico di Capodimonte, Astronomical Observatory, University of Warsaw, American Public University System, Center for Astronomy, Space Science and Astrophysics, Independent University, Bangladesh, Institució Catalana de Recerca i Estudis Avançats, International Space Science Institute)"
      ],
      "abstract": "The Local Distance Network: a community consensus report on the measurement of the Hubble constant at 1% precision H0DN Collaboration: Stefano Casertano (1), Gagandeep Anand (1), Richard I. Anderson (2), Rachael Beaton (1), Anupam Bhardwaj (3), John P. Blakeslee (4), Paula Boubel (5), Louise Breuval (1, 6), Dillon Brout (7), Michele Cantiello (8), Mauricio Cruz Reyes (2), Geza Csörnyei (9), Thomas de Jaeger (10), Suhail Dhawan (11), Eleonora Di Valentino (12), Lluís Galbany (13, 14), Héctor Gil-Marín (15, 16, 14), Dariusz Graczyk (17), Caroline Huang (18), Joseph B. Jensen (19), Pierre Kervella (20, 21), Bruno Leibundgut (22), Bastian Lengen (2), Siyang Li (23, 24), Lucas Macri (25), Emre Özülker (12), Dominic W. Pesce (18), Adam Riess (1, 23), Martino Romaniello (22), Khaled Said (26), Nils Schöneberg (27, 28), Dan Scolnic (29), Teresa Sicignano (22, 30, 31), Dorota M. Skowron (32), Syed A. Uddin (33), Licia Verde (35, 15), Antonella Nota (36) ((1) Space Telescope Science Institute, (2) Institute of Physics, École Polytechnique Fédérale de Lausanne (EPFL), Observatoire de Sauverny, (3) Inter-University Centre for Astronomy and Astrophysics (IUCAA), (4) NSF NOIRLab, (5) Research School of Astronomy \\&amp; Astrophysics, Australian National University, (6) European Space Agency (ESA), ESA Office, Space Telescope Science Institute, (7) Boston University Departments of Astronomy and Physics, (8) INAF -- Astronomical Observatory of Abruzzo, (9) Max-Planck-Institute for Astrophysics, Garching, (10) Sorbonne Université, CNRS, Laboratoire de Physique Nucléaire et de Hautes Energies, (11) School of Physics and Astronomy, University of Birmingham, (12) School of Mathematical and Physical Sciences, University of Sheffield, (13) Institute of Space Sciences (ICE-CSIC), (14) Institut d'Estudis Espacials de Catalunya (IEEC), (15) Institut de Ciències del Cosmos (ICCUB), Universitat de Barcelona (UB), (16) Departament de Física Quàntica i Astrofísica, Universitat de Barcelona, (17) Polish Academy of Sciences, Nicolaus Copernicus Astronomical Center, Department of Astrophysics, (18) Center for Astrophysics | Harvard \\&amp; Smithsonian, (19) Department of Physics, Utah Valley University, (20) LIRA, Observatoire de Paris, Université PSL, Sorbonne Université, Université Paris Cité, (21) French-Chilean Laboratory for Astronomy, IRL 3386, CNRS and U. de Chile, (22) European Southern Observatory, (23) Department of Physics \\&amp; Astronomy, Johns Hopkins University, (24) Department of Astronomy, University of California, Berkeley, (25) Department of Physics \\&amp; Astronomy, College of Sciences, University of Texas Rio Grande Valley, (26) School of Mathematics and Physics, University of Queensland, (27) University Observatory, Faculty of Physics, Ludwig-Maximilians-Universität, (28) Excellence Cluster ORIGINS, (29) Department of Physics, Duke University, (30) Scuola Superiore Meridionale, (31) INAF-Osservatorio Astronomico di Capodimonte, (32) Astronomical Observatory, University of Warsaw, (33) American Public University System, (34) Center for Astronomy, Space Science and Astrophysics, Independent University, Bangladesh, (35) Institució Catalana de Recerca i Estudis Avançats, (36) International Space Science Institute) Cosmology and Nongalactic Astrophysics (astro-ph.CO) The direct, empirical determination of the local value of the Hubble constant (H0) has markedly advanced thanks to improved instrumentation, measurement techniques, and distance estimators. However, combining determinations from different estimators is non-trivial, due to correlated calibrations and different analysis methodologies. Using covariance weighting and leveraging the broad and comprehensive community of experts, we constructed a rigorous and transparent Distance Network (DN) to find a consensus value and uncertainty for the local H0. All critically reviewed the available data sets, spanning parallaxes, detached eclipsing binaries, masers, Cepheids, the TRGB, Miras, JAGB stars, SN Ia, Surface Brightness Fluctuations, SN II, the Fundamental Plane, and Tully-Fisher relations and voted for indicators to define a `baseline' DN and others to assess robustness and sensitivity of the results. We provide open-source software and data products to support full transparency and future extensions of this effort. Our conclusions: 1) Local H0 is robustly determined, with first-rank indicators internally consistent within their uncertainties; 2) A covariance-weighted combination yields an uncertainty of 1.1% (baseline) or 0.9% (all estimators); 3) The contribution from SNe Ia is consistent across four current compilations of optical magnitudes or using NIR-only magnitudes; 4) Removing either Cepheids or TRGB has minimal effect; 5) Replacing SNe Ia with galaxy-based indicators changes H0 by less than 0.1 km/s/Mpc, while doubling its uncertainty; 6) The baseline result is H0=73.50+/-0.81 km/s/Mpc. Compared to early Universe results, our result differs by 7.1sigma from flat {\\Lambda}CDM with Planck+SPT+ACT and 5.0 sigma with BBN+BAO (DESI2). A networked approach is invaluable for enabling further progress in accuracy and precision without overreliance on any single method, sample or group.",
      "pdf_url": "https://arxiv.org/pdf/2510.23823.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24089",
      "title": "No Evidence for a Dynamically Evolving Dark Energy Scenario: Tomographic Alcock-Paczyński Test with Redshift-Space Correlation Function II",
      "authors": [
        "Fuyu Dong",
        "Changbom Park"
      ],
      "abstract": "No Evidence for a Dynamically Evolving Dark Energy Scenario: Tomographic Alcock-Paczyński Test with Redshift-Space Correlation Function II Fuyu Dong, Changbom Park Cosmology and Nongalactic Astrophysics (astro-ph.CO) We apply an extended Alcock-Paczyński (AP) test to the Sloan Digital Sky Survey data to constrain the dark energy models with the Chevallier-Polarski-Linder (CPL) parametrization of the dark energy equation of state. The extended AP test method uses the full shape of redshift-space two-point correlation funcion(CF) as the standard shape in order to measure the expansion history of the universe. We calibrate the standard shape by using the cosmology-dependent nonlinear evolution of the CF shape in the Multiverse simulations. Further validation of the method and calibration of possible systematics are performed based on mock samples from the Horizon Run 4 simulation. Using the AP test alone, we constrain the flat CDM plus CPL-type dark energy model (flat $w^{\\rm CPL}$CDM) to have $\\Omega_m=0.289_{-0.029}^{+0.031}$, $w_0=-0.798_{-0.102}^{+0.192}$ and $w_a=-0.165_{-0.945}^{+0.610}$. The result does not show evidence for a dynamically evolving dark energy model. When combined with other results from the low-redshift universe, such as the PantheonPlus supernova compilation and DESI BAO data, the constraint on $w_a$ becomes $w_a=-0.124_{-0.368}^{+0.334}$, which is still consistent with zero.",
      "pdf_url": "https://arxiv.org/pdf/2510.24089.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24631",
      "title": "Bridging Simulators with Conditional Optimal Transport",
      "authors": [
        "Justine Zeghal",
        "Benjamin Remy",
        "Yashar Hezaveh",
        "Francois Lanusse",
        "Laurence Perreault Levasseur"
      ],
      "abstract": "Bridging Simulators with Conditional Optimal Transport Justine Zeghal, Benjamin Remy, Yashar Hezaveh, Francois Lanusse, Laurence Perreault Levasseur Accepted at the 2025 Workshop on Machine Learning for Astrophysics, 10 pages, 6 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (stat.ML) We propose a new field-level emulator that bridges two simulators using unpaired simulation datasets. Our method leverages a flow-based approach to learn the likelihood transport from one simulator to the other. Since multiple transport maps exist, we employ Conditional Optimal Transport Flow Matching (COT-FM) to ensure that the transformation minimally distorts the underlying structure of the data. We demonstrate the effectiveness of this approach by bridging weak lensing simulators: a Lagrangian Perturbation Theory (LPT) to a N-body Particle-Mesh (PM). We demonstrate that our emulator captures the full correction between the simulators by showing that it enables full-field inference to accurately recover the true posterior, validating its accuracy beyond traditional summary statistics.",
      "pdf_url": "https://arxiv.org/pdf/2510.24631.pdf",
      "categories": [
        "astro-ph.CO",
        "stat.ML"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24669",
      "title": "Towards constraining cosmological parameters with SPT-3G observations of 25% of the sky",
      "authors": [
        "A. Vitrier",
        "K. Fichman",
        "L. Balkenhol",
        "E. Camphuis",
        "F. Guidi",
        "A. R. Khalife",
        "A. J. Anderson",
        "B. Ansarinejad",
        "M. Archipley",
        "K. Benabed",
        "A. N. Bender",
        "B. A. Benson",
        "F. Bianchini",
        "L. E. Bleem",
        "F. R. Bouchet",
        "L. Bryant",
        "M. G. Campitiello",
        "J. E. Carlstrom",
        "C. L. Chang",
        "P. Chaubal",
        "P. M. Chichura",
        "A. Chokshi",
        "T.-L. Chou",
        "A. Coerver",
        "T. M. Crawford",
        "C. Daley",
        "T. de Haan",
        "K. R. Dibert",
        "M. A. Dobbs",
        "M. Doohan",
        "A. Doussot",
        "D. Dutcher",
        "W. Everett",
        "C. Feng",
        "K. R. Ferguson",
        "N. C. Ferree",
        "A. Foster",
        "S. Galli",
        "A. E. Gambrel",
        "R. W. Gardner",
        "F. Ge",
        "N. Goeckner-Wald",
        "R. Gualtieri",
        "S. Guns",
        "N. W. Halverson",
        "E. Hivon",
        "G. P. Holder",
        "W. L. Holzapfel",
        "J. C. Hood",
        "A. Hryciuk",
        "N. Huang",
        "F. Kéruzoré",
        "L. Knox",
        "M. Korman",
        "K. Kornoelje",
        "C.-L. Kuo",
        "K. Levy",
        "Y. Li",
        "A. E. Lowitz",
        "C. Lu",
        "G. P. Lynch",
        "A. Maniyar",
        "E. S. Martsen",
        "F. Menanteau",
        "M. Millea",
        "J. Montgomery",
        "Y. Nakato",
        "T. Natoli",
        "G. I. Noble",
        "Y. Omori",
        "A. Ouellette",
        "Z. Pan",
        "P. Paschos",
        "K. A. Phadke",
        "A. W. Pollak",
        "K. Prabhu",
        "W. Quan",
        "M. Rahimi",
        "A. Rahlin",
        "C. L. Reichardt",
        "M. Rouble",
        "J. E. Ruhl",
        "E. Schiappucci",
        "A. C. Silva Oliveira",
        "A. Simpson",
        "J. A. Sobrin",
        "A. A. Stark",
        "J. Stephen",
        "C. Tandoi",
        "B. Thorne",
        "C. Trendafilova",
        "C. Umilta",
        "J. D. Vieira",
        "Y. Wan",
        "N. Whitehorn",
        "W. L. K. Wu",
        "M. R. Young",
        "J. A. Zebrowski"
      ],
      "abstract": "Towards constraining cosmological parameters with SPT-3G observations of 25% of the sky A. Vitrier, K. Fichman, L. Balkenhol, E. Camphuis, F. Guidi, A. R. Khalife, A. J. Anderson, B. Ansarinejad, M. Archipley, K. Benabed, A. N. Bender, B. A. Benson, F. Bianchini, L. E. Bleem, F. R. Bouchet, L. Bryant, M. G. Campitiello, J. E. Carlstrom, C. L. Chang, P. Chaubal, P. M. Chichura, A. Chokshi, T.-L. Chou, A. Coerver, T. M. Crawford, C. Daley, T. de Haan, K. R. Dibert, M. A. Dobbs, M. Doohan, A. Doussot, D. Dutcher, W. Everett, C. Feng, K. R. Ferguson, N. C. Ferree, A. Foster, S. Galli, A. E. Gambrel, R. W. Gardner, F. Ge, N. Goeckner-Wald, R. Gualtieri, S. Guns, N. W. Halverson, E. Hivon, G. P. Holder, W. L. Holzapfel, J. C. Hood, A. Hryciuk, N. Huang, F. Kéruzoré, L. Knox, M. Korman, K. Kornoelje, C.-L. Kuo, K. Levy, Y. Li, A. E. Lowitz, C. Lu, G. P. Lynch, A. Maniyar, E. S. Martsen, F. Menanteau, M. Millea, J. Montgomery, Y. Nakato, T. Natoli, G. I. Noble, Y. Omori, A. Ouellette, Z. Pan, P. Paschos, K. A. Phadke, A. W. Pollak, K. Prabhu, W. Quan, M. Rahimi, A. Rahlin, C. L. Reichardt, M. Rouble, J. E. Ruhl, E. Schiappucci, A. C. Silva Oliveira, A. Simpson, J. A. Sobrin, A. A. Stark, J. Stephen, C. Tandoi, B. Thorne, C. Trendafilova, C. Umilta, J. D. Vieira, Y. Wan, N. Whitehorn, W. L. K. Wu, M. R. Young, J. A. Zebrowski (SPT-3G Collaboration) The manuscript contains 21 pages, 10 figures, and 4 tables Cosmology and Nongalactic Astrophysics (astro-ph.CO) The South Pole Telescope (SPT), using its third-generation camera, SPT-3G, is conducting observations of the cosmic microwave background (CMB) in temperature and polarization across approximately 10 000 deg$^2$ of the sky at 95, 150, and 220 GHz. This comprehensive dataset should yield stringent constraints on cosmological parameters. In this work, we explore its potential to address the Hubble tension by forecasting constraints from temperature, polarization, and CMB lensing on Early Dark Energy (EDE) and the variation in electron mass in spatially flat and curved universes. For this purpose, we investigate first whether analyzing the distinct SPT-3G observation fields independently, as opposed to as a single, unified region, results in a loss of information relevant to cosmological parameter estimation. We develop a realistic temperature and polarization likelihood pipeline capable of analyzing these fields in these two ways, and subsequently forecast constraints on cosmological parameters. Our findings indicate that any loss of constraining power from analyzing the fields separately is primarily concentrated at low multipoles ($\\ell$ < 50) and the overall impact on the relative uncertainty on standard $\\Lambda$CDM parameters is minimal (< 3%). Our forecasts suggest that SPT-3G data should improve by more than a factor of 200 and 3000 the Figure of Merit (FoM) of the EDE and the varying electron mass models, respectively, when combined with Planck data. The likelihood pipeline developed and used in this work is made publicly available online.",
      "pdf_url": "https://arxiv.org/pdf/2510.24669.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24682",
      "title": "The Harrison-Zeldovich attractor: From Planck to ACT",
      "authors": [
        "Chengjie Fu",
        "Di Lu",
        "Shao-Jiang Wang"
      ],
      "abstract": "The Harrison-Zeldovich attractor: From Planck to ACT Chengjie Fu, Di Lu, Shao-Jiang Wang Cosmology and Nongalactic Astrophysics (astro-ph.CO) In the era of Planck cosmology, the inflationary paradigm is best fitted towards the cosmological attractor scenarios, including the induced inflation, universal attractors, conformal attractors, and special attractors that are cataloged as $\\xi$-models and $\\alpha$-models. The recent hint from the ACT results pushes the scalar spectral index closer to the scale-invariant Harrison-Zeldovich spectrum, calling for a theoretical paradigm shift towards a Harrison-Zeldovich attractor, which is difficult to realize in the standard single-field slow-roll inflationary scenario. In this Letter, we achieve the Harrison-Zeldovich attractor scenario via nonminimal derivative coupling, attracting the monomial inflation, hilltop inflation, and $\\alpha$-attractor E-model towards the Harrison-Zeldovich spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2510.24682.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23741",
      "title": "Galaxy Spin Alignment with Tidal Fields in the SDSS-IV MaNGA Survey",
      "authors": [
        "Jun-Sung Moon",
        "Teppei Okumura"
      ],
      "abstract": "Galaxy Spin Alignment with Tidal Fields in the SDSS-IV MaNGA Survey Jun-Sung Moon, Teppei Okumura 14 pages, 6 figures, submitted to ApJL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The tidal torque theory (TTT) predicts that galaxy spins are correlated with the surrounding tidal field, reflecting how angular momentum is acquired during structure formation. We present a new observational test of this prediction using the final data release of the SDSS-IV MaNGA integral field spectroscopy survey, which enables direct spin measurements from stellar and ionized gas kinematics for nearly 10,000 galaxies. Unlike previous studies that relied on filament orientations, we directly utilize the three-dimensional tidal field reconstructed from the galaxy distribution, providing a physically defined reference frame for the analysis. We find that massive galaxies tend to align their spins parallel to the intermediate axis of the tidal field, consistent with the prediction of the TTT. They also tend to orient perpendicular to the major axis, hinting at the possible influence of baryonic processes. In contrast, low-mass galaxies exhibit the opposite trend, with a transition mass of $M_*\\sim10^{10}-10^{10.5}\\,M_\\odot$. No significant alignment is detected with respect to the minor axis across all stellar masses. We further examine the dependence on morphology and environment, finding that S0 and early-type spiral galaxies exhibit stronger alignment signals than late-type spirals. The alignment trend becomes particularly pronounced in regions of high tidal anisotropy and high overdensity. A mutual information analysis identifies these environmental factors as the dominant drivers of the observed trends. Our results provide the most direct empirical evidence to date for the connection between galaxy spins and the cosmic tidal field.",
      "pdf_url": "https://arxiv.org/pdf/2510.23741.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24283",
      "title": "The luminosity function and clustering of bright quasars in the FLAMINGO cosmological simulations",
      "authors": [
        "Boyi Ding",
        "Elia Pizzati",
        "Joop Schaye",
        "Joseph F. Hennawi",
        "William McDonald",
        "Matthieu Schaller"
      ],
      "abstract": "The luminosity function and clustering of bright quasars in the FLAMINGO cosmological simulations Boyi Ding, Elia Pizzati, Joop Schaye, Joseph F. Hennawi, William McDonald, Matthieu Schaller 21 pages, 13 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmological hydrodynamical simulations are essential tools for studying the formation and evolution of galaxies and their central supermassive black holes. While they reproduce many key observed properties of galaxies, their limited volumes have hindered comprehensive studies of the AGN and quasar populations. In this work, we leverage the FLAMINGO simulation suite, focusing on its large $(2.8$ $\\mathrm{Gpc})^3$ volume, to investigate two key observables of quasar activity: the quasar luminosity function (QLF) and quasar clustering. FLAMINGO reproduces the observed QLF at low redshift ($z \\lesssim 1$) and for faint quasars ($L_\\mathrm{bol} \\lesssim 10^{45}$ $\\mathrm{erg s^{-1}}$), but significantly underpredicts the abundance of bright quasars at $z \\approx 1$-$3$. Introducing a 0.75 dex log-normal luminosity scatter to represent unresolved small-scale variability boosts the number of bright quasars by upscattering lower-luminosity systems, thereby improving agreement with observations at the bright end. A decomposition of the QLF by black hole mass reveals that this boost is primarily driven by low-mass black holes radiating above the Eddington limit. Nevertheless, limitations remain in fully reproducing the rise and decline of the bright quasar population over cosmic time and in matching the black hole masses inferred from quasar spectra. Thanks to FLAMINGO's large volume, we can robustly sample rare, luminous quasars and measure their spatial clustering for $\\log_{10} L_\\mathrm{bol}/\\mathrm{erg s^{-1}} \\gtrsim 45.5$. The simulation reproduces the observed clustering across $0 \\lesssim z \\lesssim 3$, and the reduced luminosity dependence introduced by scatter aligns with observational trends. However, it underpredicts the clustering strength at $z \\approx 4$, consistent with other models and possibly reflecting high-redshift observational uncertainties.",
      "pdf_url": "https://arxiv.org/pdf/2510.24283.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.01956",
      "title": "Lost in the FoG: Pitfalls of Models for Large-Scale Hydrogen Distributions",
      "authors": [
        "Calvin Osinga",
        "Benedikt Diemer",
        "Francisco Villaescusa-Navarro"
      ],
      "abstract": "Lost in the FoG: Pitfalls of Models for Large-Scale Hydrogen Distributions Calvin Osinga, Benedikt Diemer, Francisco Villaescusa-Navarro Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Large-scale HI surveys and their cross-correlations with galaxy distributions have immense potential as cosmological probes. Interpreting these measurements requires theoretical models that must incorporate redshift-space distortions (RSDs), such as the Kaiser and fingers-of-God (FoG) effect, and differences in the tracer and matter distributions via the tracer bias. These effects are commonly approximated with assumptions that should be tested on simulated distributions. In this work, we use the hydrodynamical simulation suite IllustrisTNG to assess the performance of models of $z \\leq 1$ HI auto and HI-galaxy cross-power spectra, finding that the models employed by recent observations introduce errors comparable to or exceeding their measurement uncertainties. In particular, neglecting FoG causes $\\gtrsim 10\\%$ deviations between the modeled and simulated power spectra at $k \\gtrsim 0.1$ $h$ / Mpc, larger than assuming a constant bias which reaches the same error threshold at slightly smaller scales. However, even without these assumptions, models can still err by $\\sim 10\\%$ on relevant scales. These remaining errors arise from multiple RSD damping sources on HI clustering, which are not sufficiently described with a single FoG term. Overall, our results highlight the need for an improved understanding of RSDs to harness the capabilities of future measurements of HI distributions.",
      "pdf_url": "https://arxiv.org/pdf/2503.01956.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.07244",
      "title": "The Topology of Rayleigh-Levy Flights in Two Dimensions",
      "authors": [
        "Reginald Christian Bernardo",
        "Stephen Appleby",
        "Francis Bernardeau",
        "Christophe Pichon"
      ],
      "abstract": "The Topology of Rayleigh-Levy Flights in Two Dimensions Reginald Christian Bernardo, Stephen Appleby, Francis Bernardeau, Christophe Pichon 9 pages + appendix, 7 figures, to appear in A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO); Statistical Mechanics (cond-mat.stat-mech) Rayleigh-Lévy flights are simplified cosmological tools which capture certain essential statistical properties of the cosmic density field, including hierarchical structures in higher-order correlations, making them a valuable reference for studying the highly non-linear regime of structure formation. Unlike standard Markovian processes, they exhibit long-range correlations at all orders. Following on recent work on one dimensional flights, this study explores the one-point statistics and Minkowski functionals (density PDF, perimeter, Euler characteristic) of Rayleigh-Lévy flights in two dimensions. We derive the Euler characteristic in the mean field approximation and the density PDF and iso-field perimeter $W_{1}$ in beyond mean field calculations, and validate the results against simulations. The match is excellent throughout, even for fields with large variances, in particular when finite volume effects in the simulations are taken into account and when the calculation is extended beyond the mean field.",
      "pdf_url": "https://arxiv.org/pdf/2503.07244.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.09369",
      "title": "Efficient Modelling of Lyman-α opacity fluctuations during late reionization epoch",
      "authors": [
        "Barun Maity",
        "Frederick Davies",
        "Prakash Gaikwad"
      ],
      "abstract": "Efficient Modelling of Lyman-α opacity fluctuations during late reionization epoch Barun Maity, Frederick Davies, Prakash Gaikwad 14 figures, 1 table, Accepted for publication in A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Lyman-$\\alpha$ forest opacity fluctuations observed from high-redshift quasar spectra have been proven to be extremely successful in order to probe the late phase of the reionization epoch. For ideal modeling of these opacity fluctuations, one of the main challenges is to satisfy the extremely high dynamic range requirements of the simulation box, resolving the Lyman-$\\alpha$ forest while probing the large cosmological scales. In this study, we adopt an efficient approach to model Lyman-$\\alpha$ opacity fluctuations in a coarse simulation volume, utilizing the semi-numerical reionization model SCRIPT (including inhomogeneous recombination and radiative feedback) integrated with a realistic photoionization background fluctuation generating model. Our model crucially incorporates ionization and temperature fluctuations, which are consistent with the reionization model. After calibrating our method with respect to high-resolution full hydrodynamic simulation, Nyx, we compared the models with available observational data at the redshift range, $z=5.0-6.1$. With a fiducial reionization model (reionization end at $z=5.8$), we demonstrated that the observed scatter in the effective optical depth can be matched reasonably well by tuning the free parameters of our model, i.e., the effective ionizing photon mean free path and mean photoionization rate. We further pursued an MCMC-based parameter space exploration, utilizing the available data to put constraints on the above free parameters. Our estimation prefers a slightly higher photoionization rate and slightly lower mean free path than the previous studies, which is also a consequence of temperature fluctuations. This study holds significant promise for efficiently extracting important physical information about the Epoch of Reionization, utilizing the wealth of available and upcoming observational data.",
      "pdf_url": "https://arxiv.org/pdf/2505.09369.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.15922",
      "title": "oLIMpus: An Effective Model for Line Intensity Mapping Auto- and Cross- Power Spectra in Cosmic Dawn and Reionization",
      "authors": [
        "Sarah Libanore",
        "Julian B. Munoz",
        "Ely D. Kovetz"
      ],
      "abstract": "oLIMpus: An Effective Model for Line Intensity Mapping Auto- and Cross- Power Spectra in Cosmic Dawn and Reionization Sarah Libanore, Julian B. Munoz, Ely D. Kovetz Version accepted for publication on PRD Phys. Rev. D 112, 083552 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Line-intensity mapping (LIM) is emerging as a powerful probe of the high-redshift Universe, with a growing number of LIM experiments targeting various spectral lines deep into the epochs of reionization and cosmic dawn. A key remaining challenge is the consistent and efficient modeling of the diverse emission lines and of the observables of different surveys. Here, we present oLIMpus, a fully analytical effective model to study LIM auto- and cross- power spectra. Our work builds on the 21-cm effective model presented in Zeus21, applying it to star-forming lines and improving it in different aspects. Our code accounts for shot noise and linear redshift-space distortions and it includes by default prescriptions for OII, OIII, H$\\alpha$, H$\\beta$, CII, CO line luminosities, together with the 21-cm model inherited from Zeus21. Beyond auto- and cross-power spectra, oLIMpus can produce mock coeval boxes and lightcones, and with a computational time of $\\sim s$ it is ideal for parameter-space exploration and inference. Its modular implementation makes it easy to customize and extend, enabling various applications, such as MCMC analyses and consistent multi-line cross-correlations.",
      "pdf_url": "https://arxiv.org/pdf/2507.15922.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2407.16339",
      "title": "A smooth filament origin for distant prolate galaxies seen by JWST and HST",
      "authors": [
        "Alvaro Pozo",
        "Tom Broadhurst",
        "Razieh Emami",
        "Philip Mocz",
        "Mark Vogelsberger",
        "Lars Hernquist",
        "Christopher J. Conselice",
        "Hoang Nhan Luu",
        "George F. Smoot",
        "Rogier Windhorst"
      ],
      "abstract": "A smooth filament origin for distant prolate galaxies seen by JWST and HST Alvaro Pozo, Tom Broadhurst, Razieh Emami, Philip Mocz, Mark Vogelsberger, Lars Hernquist, Christopher J. Conselice, Hoang Nhan Luu, George F. Smoot, Rogier Windhorst Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The initial gravitational collapse of Dark Matter and gas forms a universal filamentary network where the first galaxies form, with shapes and sizes that depend on the choice of Dark Matter. Claims from deep space imaging surveys that elongated galaxies predominate at $z > 3$ are examined here by comparison with detailed hydrodynamical simulations of Cold Dark Matter (CDM), Warm Dark Matter (WDM), and Wave/Fuzzy Dark Matter, $\\psi$DM. For CDM and WDM we have sufficient volume, $10^{3}\\,\\mathrm{Mpc/h}^{3}$, to generate galaxies with stellar masses $> 10^{9}\\,M_{\\odot}$ at $z > 2$, allowing comparison with the CEERS and CANDELS surveys. We find the observed tendency towards elongated, prolate-shaped young galaxies is well matched by WDM, from material accreted along smooth filaments during the first $\\simeq 500\\,\\mathrm{Myr}$, with little dependence on stellar mass. This contrasts with CDM, where the stellar morphology is mainly spheroidal, formed from merging of fragmented filaments. For CDM, several subhalos are predicted to be visible, whereas for WDM and $\\psi$DM, early merging is rare. Our findings show how the shapes and sizes of early galaxies are sensitive to the smoothness of the underlying filament network, providing a new constraint on the nature of dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2407.16339.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.10429",
      "title": "Environmental dependence of galaxy properties in the southern GAMA regions",
      "authors": [
        "Koti Joy",
        "Unnikrishnan Sureshkumar",
        "Anand Narayanan",
        "Sabine Bellstedt",
        "Anna Durkalec",
        "Agnieszka Pollo",
        "Matt Hilton"
      ],
      "abstract": "Environmental dependence of galaxy properties in the southern GAMA regions Koti Joy, Unnikrishnan Sureshkumar, Anand Narayanan, Sabine Bellstedt, Anna Durkalec, Agnieszka Pollo, Matt Hilton 16 pages, 8 figures, submitted to The Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Using data from the Galaxy and Mass Assembly (GAMA) survey, we investigate how galaxy properties correlate with the local environment, focusing on the two southern regions of the survey (G02 and G23) that have not previously been examined in this context. We employ two-point and marked correlation functions to quantify the environmental dependence of galaxy color, stellar mass, luminosity across the $u$, $g$, $r$, $J$, and $K$ bands, as well as star formation rate (SFR) and specific star formation rate (sSFR). We also assess the impact of redshift incompleteness and cosmic variance on these clustering measurements. Our results show that $u-r$ and $g-r$ colors are most strongly correlated with local overdensity, followed by stellar mass. The sSFR exhibits a clear inverse relationship with density of the environment, consistent with the trend observed for $u$-band luminosity, which traces young stellar populations. In contrast, galaxies brighter in the $g$, $J$, and $K$ bands preferentially inhabit denser regions. By comparing our measurements from the southern regions with those from the equatorial regions of GAMA, we find that cosmic variance does not significantly influence our conclusions. However, redshift incompleteness affects the clustering measurements, as revealed through comparisons of subsets within the G02 region. The measured correlations provide key constraints for models of galaxy assembly across mass and environment, while the environmental trends in color and near-infrared luminosity offer a means to trace stellar mass growth and quenching with redshift.",
      "pdf_url": "https://arxiv.org/pdf/2505.10429.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.02104",
      "title": "Collisionless relaxation to equilibrium distributions in cold dark matter halos: origin of the NFW profile",
      "authors": [
        "Uddipan Banik",
        "Amitava Bhattacharjee"
      ],
      "abstract": "Collisionless relaxation to equilibrium distributions in cold dark matter halos: origin of the NFW profile Uddipan Banik, Amitava Bhattacharjee 17 pages, 3 figures; submitted to Physical Review D Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Plasma Physics (physics.plasm-ph) Collisionless self-gravitating systems such as cold dark matter halos are known to harbor universal density profiles despite the intricate non-linear physics of hierarchical structure formation in the $\\Lambda$CDM paradigm. The origin of such states has been a persistent mystery, particularly because the physics of collisionless relaxation has remained poorly understood. To solve this long-standing problem, we develop a self-consistent quasilinear theory in action-angle space for the collisionless relaxation of inhomogeneous, self-gravitating systems by perturbing the governing Vlasov-Poisson equations. We obtain a quasilinear diffusion equation that describes the secular evolution of the mean coarse-grained distribution function $f_0$ of accreted matter in the fluctuating force field of a spherical isotropic halo. The diffusion coefficient not only depends on the fluctuation power spectrum but also on the evolving potential of the system, which reflects the self-consistency of the problem. Diffusive heating in the pre-assembled halo develops an $r^{-\\gamma}$ inner density cusp, accretion and relaxation in which develops an $r^{-\\beta}$ outer fall-off with $\\beta \\approx 5 - 2\\gamma$ in the quasi-steady state. Spherical collapse theory dictates that a quasi-steady outer halo must settle to $\\beta \\approx 3$, for which the mass enclosed within a shell barely changes with time. This implies that $\\gamma\\approx 1$, which is possible in the quasilinear framework only if (i) the pre-assembled halo harbors an $r^{-\\gamma_{\\mathrm{P}}}$ profile with $\\gamma_{\\mathrm{P}} \\gtrsim 0.5$, (ii) its fluctuations are correlated in time (red noise), and (iii) the initial value of $\\gamma$ is smaller than $1$, implying that the $r^{-1}$ cusp is a neutral equilibrium. We demonstrate for the first time how the Navarro-Frenk-White (NFW) profile emerges as a quasi-steady state of collisionless relaxation.",
      "pdf_url": "https://arxiv.org/pdf/2506.02104.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.00770",
      "title": "Microlensing of dark matter models in the Milky Way",
      "authors": [
        "Bichu Li",
        "Chan-Yu Tang",
        "Zhuo-Ran Huang",
        "Lei-Hua Liu"
      ],
      "abstract": "Microlensing of dark matter models in the Milky Way Bichu Li, Chan-Yu Tang, Zhuo-Ran Huang, Lei-Hua Liu Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate constraints on the abundance of primordial black holes (PBHs) as dark matter (DM) candidates using five years of microlensing data from the OGLE survey. While the majority of OGLE's $\\sim\\!2000$ microlensing events are well-explained by stellar populations such as brown dwarfs, main-sequence stars, and compact remnants, a subset of six ultrashort-timescale events ($t_E \\sim 0.1\\text{--}0.3~\\mathrm{days}$) may signal the presence of PBHs. Building upon prior work that adopted the Navarro-Frenk-White (NFW) DM profile, we examine how alternative DM halo models -- specifically the Einasto and Burkert profiles, affect microlensing predictions and the constraints on PBH abundance. In light of kinematic data of Milky Way, we could obtain the range of ($r_s, \\rho_s$) for both profiles. We computed differential microlensing event rates for both profiles, using the main-sequence star rate as an observational benchmark. Our results show that neither the Einasto nor Burkert profiles reproduce the distribution of main-sequence star events, yet both allow for viable explanations of the ultrashort-timescale events with PBH masses $M_{\\mathrm{PBH}} \\sim 10^{-5} M_\\odot$. Using a Poisson likelihood analysis under the null hypothesis that no PBH is observed in OGLE dataset, we derive $95\\%~\\text{C.L.}$ upper and lower bounds on $f_{\\mathrm{PBH}}$ for both profiles, finding that the constraints are significantly relaxed under Burkert profiles compared to the NFW case. These results show the sensitivity of PBH constraints to the assumed DM halo structure and highlight the importance of accurately modeling the inner Galactic density profile to robustly assess PBH dark matter scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2507.00770.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23700",
      "title": "Shock Acceleration in the Intracluster Medium: Implications of Micromirror Confinement",
      "authors": [
        "Rebecca Diesing",
        "Ludwig Böss",
        "Damiano Caprioli"
      ],
      "abstract": "Shock Acceleration in the Intracluster Medium: Implications of Micromirror Confinement Rebecca Diesing, Ludwig Böss, Damiano Caprioli 10 pages, 5 figures, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Merging galaxy clusters exhibit strong observational evidence for efficient particle acceleration in the intracluster medium (ICM), particularly in the form of synchrotron-emitting radio relics and halos. Cosmic ray (CR) electrons are likely accelerated (or re-accelerated) at merger and accretion shocks via diffusive shock acceleration (DSA). However, in the presence of the large diffusion coefficients one would naively expect in the rarefied, relatively unmagnetized ICM, this acceleration--in particular, the maximum proton energy ($E_{\\rm max}$)--is limited by long acceleration times. On the other hand, recent work on CR transport suggests that the diffusion coefficient can be suppressed in ICM-like environments. In this picture, deviations from local thermodynamic equilibrium can trigger the mirror instability, creating plasma-scale magnetic structures, or \"micromirrors,\" that efficiently scatter CRs. In this paper, we investigate the implications of micromirror confinement for shock acceleration in the ICM. We demonstrate that micromirrors enforce a minimum value of $E_{\\rm max} \\gtrsim 100$ GeV that does not rely on CR-driven magnetic field amplification. We also discuss micromirror confinement in the context of cosmological simulations and $\\gamma$-ray observations, and present a simulation of a Coma-like merging cluster that self-consistently includes CR acceleration at shocks, with an effective diffusion coefficient set by micromirrors. We show that the introduction of micromirrors yields simulated galaxy clusters that remain consistent with $\\gamma$-ray observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.23700.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23723",
      "title": "AT2025ulz and S250818k: Leveraging DESI spectroscopy in the hunt for a kilonova associated with a sub-solar mass gravitational wave candidate",
      "authors": [
        "Xander J. Hall",
        "Antonella Palmese",
        "Brendan O'Connor",
        "Daniel Gruen",
        "Malte Busmann",
        "Julius Gassert",
        "Lei Hu",
        "Ignacio Magana Hernandez",
        "Jessica Nicole Aguilar",
        "Ariel Amsellem",
        "Steven Ahlen",
        "John Banovetz",
        "Segev BenZvi",
        "Davide Bianchi",
        "David Brooks",
        "Francisco Javier Castander",
        "Todd Claybaugh",
        "Andrei Cuceu",
        "Arjun Dey",
        "Peter Doel",
        "Jennifer Faba-Moreno",
        "Simone Ferraro",
        "Andreu Font-Ribera",
        "Jaime E. Forero-Romero",
        "Gaston Gutierrez",
        "Laurent Le Guillou",
        "Dick Joyce",
        "Theodore Kisner",
        "Anthony Kremin",
        "Ofer Lahav",
        "Claire Lamman",
        "Martin Landriau",
        "Michael Levi",
        "Axel de la Macorra",
        "Marc Manera",
        "Aaron Meisner",
        "Ramon Miquel",
        "John Moustakas",
        "Seshadri Nadathur",
        "Francisco Prada",
        "Ignasi Perez-Rafols",
        "Graziano Rossi",
        "Eusebio Sanchez",
        "David Schlegel",
        "Michael Schubnell",
        "David Sprayberry",
        "Gregory Tarle",
        "Benjamin Alan Weaver",
        "Rongpu Zhou",
        "Hu Zou"
      ],
      "abstract": "AT2025ulz and S250818k: Leveraging DESI spectroscopy in the hunt for a kilonova associated with a sub-solar mass gravitational wave candidate Xander J. Hall, Antonella Palmese, Brendan O'Connor, Daniel Gruen, Malte Busmann, Julius Gassert, Lei Hu, Ignacio Magana Hernandez, Jessica Nicole Aguilar, Ariel Amsellem, Steven Ahlen, John Banovetz, Segev BenZvi, Davide Bianchi, David Brooks, Francisco Javier Castander, Todd Claybaugh, Andrei Cuceu, Arjun Dey, Peter Doel, Jennifer Faba-Moreno, Simone Ferraro, Andreu Font-Ribera, Jaime E. Forero-Romero, Gaston Gutierrez, Laurent Le Guillou, Dick Joyce, Theodore Kisner, Anthony Kremin, Ofer Lahav, Claire Lamman, Martin Landriau, Michael Levi, Axel de la Macorra, Marc Manera, Aaron Meisner, Ramon Miquel, John Moustakas, Seshadri Nadathur, Francisco Prada, Ignasi Perez-Rafols, Graziano Rossi, Eusebio Sanchez, David Schlegel, Michael Schubnell, David Sprayberry, Gregory Tarle, Benjamin Alan Weaver, Rongpu Zhou, Hu Zou High Energy Astrophysical Phenomena (astro-ph.HE) On August 18th, 2025, the LIGO--Virgo--KAGRA collaboration reported a sub-threshold gravitational wave candidate detection consistent with a sub-solar-mass neutron star merger, denoted S250818k. An optical transient, AT2025ulz, was discovered within the localization region. AT2025ulz initially appeared to meet the expected behavior of kilonova (KN) emission, the telltale signature of a binary neutron star merger. The transient subsequently rebrightened after $\\sim$\\,$5$ days and developed spectral features characteristic of a Type IIb supernova. In this work, we analyze the observations of the host galaxy of AT2025ulz obtained by the Dark Energy Spectroscopic Instrument (DESI). From the DESI spectrum, we obtain a secure redshift of $z = 0.084840 \\pm 0.000006$, which places the transient within $2\\sigma$ of the gravitational wave distance and results in an integral overlap between the gravitational wave alert and the transient location of $\\log_{10}\\mathcal{I} \\approx 3.9-4.2$. Our analysis of the host galaxy's spectral energy distribution reveals a star-forming, dusty galaxy with stellar mass ${\\sim} 10^{10}~M_\\odot$, broadly consistent with the population of both short gamma-ray bursts and core-collapse supernova host galaxies. We also present our follow-up of DESI-selected candidate host galaxies using the Fraunhofer Telescope at the Wendelstein Observatory, and show the promise of DESI for associating or rejecting candidate electromagnetic counterparts to gravitational wave alerts. These results emphasize the value of DESI's extensive spectroscopic dataset in rapidly characterizing host galaxies, enabling spectroscopic host subtraction, and guiding targeted follow-up.",
      "pdf_url": "https://arxiv.org/pdf/2510.23723.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.23724",
      "title": "Continuous gravitational waves from magnetized white dwarfs: Quantifying the detection plausibility by LISA",
      "authors": [
        "Mayusree Das",
        "Banibrata Mukhopadhyay",
        "Tomasz Bulik"
      ],
      "abstract": "Continuous gravitational waves from magnetized white dwarfs: Quantifying the detection plausibility by LISA Mayusree Das (IISc), Banibrata Mukhopadhyay (IISc), Tomasz Bulik (U. Warsaw) 16 pages including 14 figures and 1 table; accepted for publication in The Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) White dwarfs (WDs) are frequently observed to have strong magnetic fields up to $10^9$ G and expected to have a possible internal field as high as $\\sim 10^{14}$ G. High internal fields can significantly deform a WD's equilibrium structure, generating a quadrupole moment. If the rotation axis is misaligned with the magnetic axis, the deformation can lead to the emission of continuous gravitational waves (CGWs). We examine the potential for detecting CGWs from magnetized WDs with future space-based detectors such as LISA, ALIA, DECIGO, Deci-Hz, BBO and TianQin. We model the field-induced deformation and compute the resulting GW strain, incorporating amplitude decay due to angular momentum loss from electromagnetic and gravitational radiation. This sets a timescale for detection -`active timescale' of $10^{5-6}$ yr, requiring observation while the object remains sufficiently young. Our results suggest that LISA could detect a few dozens of highly magnetized WDs across the Galaxy during its mission. As a specific case, we investigate ZTF J1901+1458- a compact, massive, fast-rotating, and strongly magnetized WD with spin period $\\sim416$ s and inferred surface field $\\sim10^{9}$ G. We find that this object would be detectable by LISA with four years of continuous data. This highlights the potential of CGW observations to probe magnetic field structure in WDs and their role in type Ia supernova progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2510.23724.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.23728",
      "title": "AT2025ulz and S250818k: Deep X-ray and radio limits on off-axis afterglow emission and prospects for future discovery",
      "authors": [
        "Brendan O'Connor",
        "Roberto Ricci",
        "Eleonora Troja",
        "Antonella Palmese",
        "Yu-Han Yang",
        "Geoffrey Ryan",
        "Hendrik van Eerten",
        "Muskan Yadav",
        "Xander J. Hall",
        "Ariel Amsellem",
        "Rosa L. Becerra",
        "Malte Busmann",
        "Tomas Cabrera",
        "Simone Dichiara",
        "Lei Hu",
        "Ravjit Kaur",
        "Keerthi Kunnumkai",
        "Ignacio Magana Hernandez"
      ],
      "abstract": "AT2025ulz and S250818k: Deep X-ray and radio limits on off-axis afterglow emission and prospects for future discovery Brendan O'Connor, Roberto Ricci, Eleonora Troja, Antonella Palmese, Yu-Han Yang, Geoffrey Ryan, Hendrik van Eerten, Muskan Yadav, Xander J. Hall, Ariel Amsellem, Rosa L. Becerra, Malte Busmann, Tomas Cabrera, Simone Dichiara, Lei Hu, Ravjit Kaur, Keerthi Kunnumkai, Ignacio Magana Hernandez Accepted for publication in ApJL on 10/22/2025 High Energy Astrophysical Phenomena (astro-ph.HE) The first joint electromagentic (EM) and gravitational wave (GW) detection, known as GW170817, marked a critical juncture in our collective understanding of compact object mergers. However, it has now been 8 years since this discovery, and the search for a second EM-GW detection has yielded no robust discoveries. Recently, on August 18, 2025, the LIGO-Virgo-KAGRA collaboration reported a low-significance (high false alarm rate) binary neutron star merger candidate S250818k. Rapid optical follow-up revealed a single optical candidate AT2025ulz ($z=0.08484$) that initially appeared consistent with kilonova emission. We quickly initiated a set of observations with \\textit{Swift}, \\textit{XMM-Newton}, \\textit{Chandra}, and the Very Large Array to search for non-thermal afterglow emission. Our deep X-ray and radio search rules out that the optical rebrightening of AT2025ulz is related to the afterglow onset, reinforcing its classification as a stripped-envelope supernova (SN 2025ulz). We derive constraints on the afterglow parameters for a hypothetical binary neutron star merger at the distance of AT2025ulz ($\\approx 400$ Mpc) based on our X-ray and radio limits. We conclude that our observational campaign could exclude a GW170817-like afterglow out to viewing angles of $\\theta_\\textrm{v}\\approx 12.5$ degrees. We briefly discuss the prospects for the future discovery of off-axis afterglows.",
      "pdf_url": "https://arxiv.org/pdf/2510.23728.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.23729",
      "title": "Hydrodynamic Simulations of Tidal Disruption Encores",
      "authors": [
        "Ian P.A. Johnson",
        "Taeho Ryu",
        "Rosalba Perna"
      ],
      "abstract": "Hydrodynamic Simulations of Tidal Disruption Encores Ian P.A. Johnson, Taeho Ryu, Rosalba Perna High Energy Astrophysical Phenomena (astro-ph.HE); Computational Physics (physics.comp-ph) We present hydrodynamic simulations with the moving-mesh code AREPO of Tidal Disruption Encores (TDEEs) in nuclear star clusters (NSCs). TDEEs arise when a stellar-mass black hole (sBH) disrupts a star within the NSC, producing debris that is unbound from the sBH but remains gravitationally bound to the central massive black hole (MBH), leading to a delayed secondary flare. We find that the morphology and thermodynamics of the fallback material depend sensitively on the disruption geometry, MBH mass, and sBH-MBH separation. We identify two distinct morphological outcomes: ring encores, where debris circularize into a torus, and direct encores, where streams plunge toward the MBH, with encore luminosities peaking at times corresponding to the freefall timescale and one orbital period, respectively. Across all simulated cases, we find these events exhibit luminosities of $10^{40}-10^{42}$ erg/s with lightcurves characteristic of their morphology. Our work greatly improves the predictions of TDEE lightcurves and empowers observations to probe into NSC dynamics and sBH population while providing possible explanations for anomalous TDE-like flares.",
      "pdf_url": "https://arxiv.org/pdf/2510.23729.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23732",
      "title": "ZTF25abjmnps (AT2025ulz) and S250818k: A Candidate Superkilonova from a Sub-threshold Sub-Solar Gravitational Wave Trigger",
      "authors": [
        "Mansi M. Kasliwal",
        "Tomas Ahumada",
        "Robert Stein",
        "Viraj Karambelkar",
        "Xander J. Hall",
        "Avinash Singh",
        "Christoffer Fremling",
        "Brian D. Metzger",
        "Mattia Bulla",
        "Vishwajeet Swain",
        "Sarah Antier",
        "Marion Pillas",
        "Malte Busmann",
        "James Freeburn",
        "Sergey Karpov",
        "Aleksandra Bochenek",
        "Brendan O'Connor",
        "Daniel A. Perley",
        "Dalya Akl",
        "Shreya Anand",
        "Andrew Toivonen",
        "Sam Rose",
        "Theophile Jegou du Laz",
        "Chang Liu",
        "Kaustav Das",
        "Sushant Sharma Chaudhary",
        "Tyler Barna",
        "Aditya Pawan Saikia",
        "Igor Andreoni",
        "Eric C. Bellm",
        "Varun Bhalerao",
        "S. Bradley Cenko",
        "Michael W. Coughlin",
        "Daniel Gruen",
        "Daniel Kasen",
        "Adam A. Miller",
        "Samaya Nissanke",
        "Antonella Palmese",
        "Jesper Sollerman",
        "Niharika Sravan",
        "G.C. Anupama",
        "Smaranika Banerjee",
        "Sudhanshu Barway",
        "Joshua S. Bloom",
        "Tomas Cabrera",
        "Tracy Chen",
        "Chris Copperwheat",
        "Alessandra Corsi",
        "Richard Dekany",
        "Nicholas Earley",
        "Matthew Graham",
        "Patrice Hello",
        "George Helou",
        "Lei Hu",
        "Yves Kini",
        "Ashish Mahabal",
        "Frank Masci",
        "Tanishk Mohan",
        "Natalya Pletskova",
        "Josiah Purdum",
        "Yu-Jing Qin",
        "Nabeel Rehemtulla",
        "Anirudh Salgundi",
        "Yuankun Wang"
      ],
      "abstract": "ZTF25abjmnps (AT2025ulz) and S250818k: A Candidate Superkilonova from a Sub-threshold Sub-Solar Gravitational Wave Trigger Mansi M. Kasliwal, Tomas Ahumada, Robert Stein, Viraj Karambelkar, Xander J. Hall, Avinash Singh, Christoffer Fremling, Brian D. Metzger, Mattia Bulla, Vishwajeet Swain, Sarah Antier, Marion Pillas, Malte Busmann, James Freeburn, Sergey Karpov, Aleksandra Bochenek, Brendan O'Connor, Daniel A. Perley, Dalya Akl, Shreya Anand, Andrew Toivonen, Sam Rose, Theophile Jegou du Laz, Chang Liu, Kaustav Das, Sushant Sharma Chaudhary, Tyler Barna, Aditya Pawan Saikia, Igor Andreoni, Eric C. Bellm, Varun Bhalerao, S. Bradley Cenko, Michael W. Coughlin, Daniel Gruen, Daniel Kasen, Adam A. Miller, Samaya Nissanke, Antonella Palmese, Jesper Sollerman, Niharika Sravan, G.C. Anupama, Smaranika Banerjee, Sudhanshu Barway, Joshua S. Bloom, Tomas Cabrera, Tracy Chen, Chris Copperwheat, Alessandra Corsi, Richard Dekany, Nicholas Earley, Matthew Graham, Patrice Hello, George Helou, Lei Hu, Yves Kini, Ashish Mahabal, Frank Masci, Tanishk Mohan, Natalya Pletskova, Josiah Purdum, Yu-Jing Qin, Nabeel Rehemtulla, Anirudh Salgundi, Yuankun Wang Revised for ApJL (submitted on 10/2/25) High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) On August 18, 2025, the LIGO-Virgo-KAGRA collaboration reported gravitational waves from a sub-threshold binary neutron star merger. If astrophysical, this event would have a surprisingly low chirp mass, suggesting that at least one neutron star was below a solar mass. The Zwicky Transient Facility mapped the coarse localization and discovered a transient, ZTF25abjmnps (AT2025ulz), that was spatially and temporally coincident with the gravitational wave trigger. The first week of follow-up suggested properties reminiscent of a GW170817-like kilonova. Subsequent follow-up suggests properties most similar to a young, stripped-envelope, Type IIb supernova. Although we cannot statistically rule out chance coincidence, we undertake due diligence analysis to explore the possible association between ZTF25abjmnps and S250818k. Theoretical models have been proposed wherein sub-solar neutron star(s) may form (and subsequently merge) via accretion disk fragmentation or core fission inside a core-collapse supernova i.e. a ``superkilonova\". Here, we qualitatively discuss our multi-wavelength dataset in the context of the superkilonova picture. Future higher significance gravitational wave detections of sub-solar neutron star mergers with extensive electromagnetic follow-up would conclusively resolve this tantalizing multi-messenger association.",
      "pdf_url": "https://arxiv.org/pdf/2510.23732.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.23747",
      "title": "Unlocking the radio-gamma spectrum of the pulsar wind nebula around PSR J1124-5916 in SNR G292.0+1.8",
      "authors": [
        "A. Lemière",
        "G. Castelletti",
        "N. L. Maza"
      ],
      "abstract": "Unlocking the radio-gamma spectrum of the pulsar wind nebula around PSR J1124-5916 in SNR G292.0+1.8 A. Lemière, G. Castelletti, N. L. Maza High Energy Astrophysical Phenomena (astro-ph.HE) We present the first detection of GeV $\\gamma$-ray emission potentially associated with the pulsar wind nebula (PWN) hosted by the young core-collapse supernova remnant G292.0+1.8, based on a detailed time-resolved analysis of \\textit{Fermi}-LAT data. By isolating the unpulsed component from the dominant magnetospheric radiation of PSR~J1124$-$5916, we successfully disentangle a candidate nebular emission in the GeV range, characterise its morphology and extract its spectrum. This identification places G292.0+1.8 among the few systems in which the pulsar and PWN contributions have been spectrally resolved at high energies, offering new insight into their respective emission mechanisms. We characterise the $\\gamma$-ray spectrum of the pulsar and model the broadband spectral energy distribution (SED) of the PWN using radio, X-ray, and GeV data. The emission is well described by a single electron population with two spectral breaks: one intrinsic to the injection spectrum and another produced by synchrotron cooling in a magnetic field of $\\sim$15~$\\mu$G. Notably, the inferred magnetic field and the low TeV flux of the nebula resemble those of 3C~58, suggesting that similar low-field environments can arise in young PWNe. The high-energy portion of the SED is now tightly constrained by our GeV detection and existing TeV upper limits. Compared to our model, earlier predictions tend to underpredict the $\\gamma$-ray flux, while others that succeed in reproducing the GeV component often overpredict the TeV emission. This mismatch underscores the challenges in modelling particle acceleration and radiation processes in young PWNe and establishes G292.0+1.8 as a valuable benchmark for testing and refining such models.",
      "pdf_url": "https://arxiv.org/pdf/2510.23747.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23814",
      "title": "Unveiling the soft X-ray source population towards the inner Galactic disk with XMM-Newton",
      "authors": [
        "Tong Bao",
        "Gabriele Ponti",
        "Frank Haberl",
        "Samaresh Mondal",
        "Mark R. Morris",
        "Kaya Mori",
        "Shifra Mandel",
        "Xiao-jie Xu"
      ],
      "abstract": "Unveiling the soft X-ray source population towards the inner Galactic disk with XMM-Newton Tong Bao, Gabriele Ponti, Frank Haberl, Samaresh Mondal, Mark R. Morris, Kaya Mori, Shifra Mandel, Xiao-jie Xu 19 pages, 12 figures, accepted for publication on Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Across the Galactic disk lies a diverse population of X-ray sources, with the fainter end remaining poorly understood due to past survey sensitivity limits. We aim to classify and characterize faint X-ray sources detected in the eROSITA All-Sky Survey (eRASS1) towards the inner Galactic disk ($350^\\circ < l < 360^\\circ$, $-1^\\circ < b < 1^\\circ$) using deeper XMM-Newton observations (typical exposure of $\\sim 20\\,\\text{ks}$). We analyzed 189 eRASS1 sources, combining X-ray spectral fitting ($0.2$--$10\\,\\text{keV}$) with Gaia astrometric and photometric data for robust classification. Our results show that the eRASS1 catalog towards the Galactic disk is overwhelmingly dominated by coronal sources ($\\sim 74\\%$), primarily active stars and binaries, with $\\sim 8\\%$ being wind-powered massive stars and $\\sim 18\\%$ being accreting compact objects. We propose an empirical hardness-ratio cut ($\\text{HR} > -0.2$) to efficiently isolate these non-coronal sources. By stacking the classified population and comparing with the Galactic Ridge X-ray Emission (GRXE), we estimate that $\\sim 6\\%$ of the GRXE flux in the $0.5$--$2.0\\,\\text{keV}$ band is resolved into point sources above the eRASS1 flux limit ($\\sim 5\\times 10^{-14}\\,\\text{erg}\\,\\text{cm}^{-2}\\,\\text{s}^{-1}$). This resolved soft-band emission is dominated by active stars, while hard-band flux originates primarily from X-ray binaries. We conclude that the eRASS1 catalog retains a non-negligible population of compact objects that can be effectively distinguished using X-ray color selection.",
      "pdf_url": "https://arxiv.org/pdf/2510.23814.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23917",
      "title": "Testing common approximations of neutrino fast flavor conversion",
      "authors": [
        "Erick Urquilla",
        "Luke Johns"
      ],
      "abstract": "Testing common approximations of neutrino fast flavor conversion Erick Urquilla, Luke Johns High Energy Astrophysical Phenomena (astro-ph.HE) A new chapter is opening in the theory of core-collapse supernovae and neutron star mergers as simulations of these events begin to incorporate fast flavor conversion (FFC) and other forms of neutrino flavor mixing. Using numerical experiments, we show that the approximations of FFC that have been implemented so far are limited by at least two of three factors: (1) approximating continuous evolution as a discrete sequence of instabilities, (2) using spatially homogeneous asymptotic states, and (3) assuming that FFC must be accompanied by instability. The factors we identify in this work will be important considerations as the research area progresses from initial exploratory studies to more quantitatively precise assessments.",
      "pdf_url": "https://arxiv.org/pdf/2510.23917.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23945",
      "title": "Cosmological Evolution of Gamma Ray Bursts",
      "authors": [
        "Sujay Champati",
        "Vahé Petrosian",
        "Maria G. Dainotti"
      ],
      "abstract": "Cosmological Evolution of Gamma Ray Bursts Sujay Champati, Vahé Petrosian, Maria G. Dainotti High Energy Astrophysical Phenomena (astro-ph.HE) Gamma Ray Bursts (GRBs) are classified as long (LGRBs) and short (SGRBs) with collapsars and compact object mergers (neutron star (NS)-NS or NS-Black hole) as progenitors, respectively. The former are expected to follow the cosmic star formation rate (SFR), while the latter follows a delayed version of the SFR. However, this division has come under question in several ways, the most prominent being the observational evidence of a significant excess of LGRBs at low redhifts by several independent investigations, summarized in arXiv:2305.15081. This could indicate that the progenitors of low-redshift LGRBs, whose formation rates are delayed, (similar to that of SGRBs) are compact mergers rather than collapsars. Two recent observations of low-redshift LGRBs show associations with kilonovae, a clear feature of compact mergers. Most results showing this separation are based on analyses of small (less than 200) samples of LGRBs with measured redshifts. The aim of this paper is to use a larger sample of LGRBs. The number of LGRBs with measured redshifts has increased by more than a factor of 2 over the last decade. To this data set we add a sample of LGRBs whose redshifts are estimated using a machine learning (ML) method (arXiv:2410.13985). This, in addition to increasing the sample size, reduces the observational selection bias arising from the process of redshift measurement. To account for this bias, we use the non-parametric, non-binning Efron-Petrosian method to establish the degree of correlation between luminosity and redshift, the luminosity evolution, which then allows us to use the Lynden-Bell $C^-$ method to obtain a complete description of the luminosity function. We find similar low redshift excess for the larger sample with measured redshifts. Adding the sources with ML-estimated redshifts, which tend to have more sources in mid-range redshifts, the excess is reduced.",
      "pdf_url": "https://arxiv.org/pdf/2510.23945.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23979",
      "title": "Rest-frame Optical Spectroscopy of $z \\sim 2$ Quasars with Steep Hard X-ray Spectral Shapes: X-ray Selection of Super-Eddington Accretion and Verification",
      "authors": [
        "Ying Chen",
        "Bin Luo",
        "Jian Huang"
      ],
      "abstract": "Rest-frame Optical Spectroscopy of $z \\sim 2$ Quasars with Steep Hard X-ray Spectral Shapes: X-ray Selection of Super-Eddington Accretion and Verification Ying Chen, Bin Luo, Jian Huang 23 pages, 18 figure, accept for publication in the Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Super-Eddington accretion is a crucial phase in the growth of supermassive black holes. However, identifying super-Eddington accreting quasars observationally is challenging due to uncertain black-hole mass estimates and other complications. The Eddington ratio parameter does not represent accurately the accretion rate in the super-Eddington regime. On the other hand, super-Eddington accreting quasars appear to show large hard X-ray (rest-frame > 2 keV) power-law photon indices, and they also exhibit distinct optical spectral features including weak [O III] $\\lambda 5007$ emission and strong Fe II emission. We test steep X-ray photon-index selection of super-Eddington accreting quasars by obtaining Palomar 200-inch Hale Telescope near-infrared spectra for a pilot sample of nine $\\Gamma=2.0-2.6$ quasars at $z\\approx1.4-2.5$. We derive H$\\beta$-based single-epoch virial black-hole masses (median value $\\rm 4.3 \\times 10^{8}~M_{\\odot}$) and Eddington ratios (median value 0.6). The Eddington ratio distribution is consistent with that of the comparison sample, which is a flux-limited sample of quasars at $z\\approx1.5-3.5$ with near-infrared spectroscopy. But our super-Eddington candidates do show statistically weaker [O III] emission ($P_{\\rm null}=0.0075$) and marginally stronger Fe II emission ($P_{\\rm null}=0.06$). We also find one candidate with broad (width of 1960 km/s) and blueshifted (690 km/s) [O III] $\\lambda 4959$ and [O III] $\\lambda 5007$ lines, which probably originate from a strong [O III] outflow driven by super-Eddington accretion. Overall, the steep X-ray photon-index selection of super-Eddington accreting quasars appears promising. But a larger sample is needed to assess further the reliability of the selection.",
      "pdf_url": "https://arxiv.org/pdf/2510.23979.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24071",
      "title": "Diverse Emission Patterns from Precessing Super-Eddington Disks Formed in Tidal Disruption Events",
      "authors": [
        "Jin-Hong Chen",
        "Lixin Dai",
        "Kan Cheuk Kwan",
        "Tom Man Kwan",
        "Zijian Zhang"
      ],
      "abstract": "Diverse Emission Patterns from Precessing Super-Eddington Disks Formed in Tidal Disruption Events Jin-Hong Chen, Lixin Dai, Kan Cheuk Kwan, Tom Man Kwan, Zijian Zhang 18 pages, 9 figures, 1 table. Submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) A tidal disruption event (TDE) occurs when a star passes within the tidal radius of a supermassive black hole (SMBH). In TDEs it is expected that the orbital angular momentum of the disrupted star is generally misaligned with the SMBH spin axis, which should result in a misaligned super-Eddington disk precessing around the SMBH spin axis due to the Lense-Thirring effect. In this paper, we investigate the distinct observational signatures produced from such TDE disks, by performing radiative transfer calculations upon previous super-Eddington disk simulations. We demonstrate that the precession of the disk and wind drive time-dependent obscuration and reprocessing of X-ray radiation. Depending on the orientation of the viewing angle of the observer and the tilt angle of the disk, four main types of variability are induced: 1) The smooth-TDEs: The emissions from these TDEs show no fluctuations; 2) The dimmer: The main emission type (X-ray or optical) stays the same, with small to moderate modulations of brightness; 3) The blinker: X-ray and optical emissions take turns to dominate in one cycle of precession, with dramatic changes in the X-ray fluxes. 4) The siren: X-ray and optical emissions take over each other twice per cycle, possibly with two different peak X-ray fluxes within one cycle. In all three scenarios, we observe an inverse correlation between X-ray and optical emissions. Our model provides a unified physical framework for interpreting TDE multi-wavelength variability through disk precession dynamics and gives an alternative interpretation to the interesting case of J045650.3-203750 which was suggested to be a repeated partial TDE previously.",
      "pdf_url": "https://arxiv.org/pdf/2510.24071.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24075",
      "title": "Eclipsed X-ray Bursts from Magnetar SGR J1935+2154 and the Fireball Measurements",
      "authors": [
        "Sheng-Lun Xie",
        "A-Ming Chen",
        "Yun-Wei Yu",
        "Shao-Lin Xiong",
        "Hua Feng",
        "Shuang-Nan Zhang",
        "Zi-Gao Dai",
        "Wang-Chen Xue",
        "Ming-Yu Ge",
        "Xiao-Bo Li",
        "Liang-Duan Liu",
        "Jia-Cong Liu",
        "Wen-Jun Tan",
        "Chen-Wei Wang",
        "Shu-Xu Yi",
        "Peng Zhang",
        "Yan-Qiu Zhang",
        "Zhen Zhang",
        "Chao Zheng",
        "Xiao-Ping Zheng"
      ],
      "abstract": "Eclipsed X-ray Bursts from Magnetar SGR J1935+2154 and the Fireball Measurements Sheng-Lun Xie, A-Ming Chen, Yun-Wei Yu, Shao-Lin Xiong, Hua Feng, Shuang-Nan Zhang, Zi-Gao Dai, Wang-Chen Xue, Ming-Yu Ge, Xiao-Bo Li, Liang-Duan Liu, Jia-Cong Liu, Wen-Jun Tan, Chen-Wei Wang, Shu-Xu Yi, Peng Zhang, Yan-Qiu Zhang, Zhen Zhang, Chao Zheng, Xiao-Ping Zheng High Energy Astrophysical Phenomena (astro-ph.HE) X-ray bursts from the magnetar can lead to the formation of fireballs trapped by the magnetic field and co-rotating with the star. The fireball emission could occasionally be eclipsed by the magnetar, especially when the burst duration is comparable to the magnetar's spin period. In this work, we discover a peculiar type of burst whose light curve has a plateau-like feature among the long bursts of the magnetar SGR J1935+2154. Based on these bursts, we identified four burst candidates with eclipse-like characteristics. By fitting their light curves with the eclipse fireball model, the viewing angle of the magnetar relative to its spin axis is estimated to be $17^\\circ \\pm 10^\\circ$. The distances from the fireballs to the magnetar are found to be more than five times the magnetar's radius, indicating that the fireballs are suspended in the magnetosphere rather than adhering to the magnetar surface. We also find this configuration is well consistent with the implication of the cyclotron resonance scattering feature in their spectra. Our results suggest that some intermediate X-ray bursts of SGR 1935+2154 may originate from magnetic reconnection within the magnetosphere rather than the starquake.",
      "pdf_url": "https://arxiv.org/pdf/2510.24075.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24123",
      "title": "Decadal brightening in the northeastern non-thermal filament of Cassiopeia A",
      "authors": [
        "Nao Kominato",
        "Toshiki Sato",
        "Yusuke Sakai",
        "Ryota Hayakawa",
        "Shinya Yamada"
      ],
      "abstract": "Decadal brightening in the northeastern non-thermal filament of Cassiopeia A Nao Kominato, Toshiki Sato, Yusuke Sakai, Ryota Hayakawa, Shinya Yamada Publications of the Astronomical Society of Japan, 2025, 77(4), 802-810 High Energy Astrophysical Phenomena (astro-ph.HE) We present the decadal brightening of non-thermal emission flux in the northeastern filament of the young supernova remnant Cassiopeia A (Cas A), which highlights dynamic processes in the forward shock. This filament, characterized by the highest particle acceleration rate among Cas A's outer shells, offers an exceptional opportunity to investigate underlying astrophysical mechanisms. Since 2000, the non-thermal flux has increased by several tens of percent before plateauing, while the spectral shape has remained largely unchanged. Over the past two decades, the filament's morphology has evolved significantly, splitting into two distinct sections. Detailed analysis reveals contrasting behaviors: one section shows a flux increase followed by saturation, while the other maintains a steady flux. These differences likely arise from nonlinear effects, including magnetohydrodynamic interactions influenced by magnetic field orientation, interactions with surrounding material, and complex fluid dynamics associated with young supernova remnants. The localized evolution of this filament, captured with high spatial resolution, provides critical insights into the temporal dynamics of non-thermal particles and the generation of cosmic rays from asymmetric supernova explosions.",
      "pdf_url": "https://arxiv.org/pdf/2510.24123.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24167",
      "title": "Vortex Creep Heating in Neutron Star Cooling: New Insights into Thermal Evolution of Heavy Neutron Stars",
      "authors": [
        "Yoonhak Nam",
        "Kazuyuki Sekizawa"
      ],
      "abstract": "Vortex Creep Heating in Neutron Star Cooling: New Insights into Thermal Evolution of Heavy Neutron Stars Yoonhak Nam, Kazuyuki Sekizawa 4 pages, 2 figures, Proceedings of the 29th International Nuclear Physics Conference (INPC2025), Daejeon, Korea, May 25-30, 2025 High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) Neutron stars provide unique laboratories for probing physics of dense nuclear matter under extreme conditions. Their thermal and luminosity evolution reflects key internal properties such as the equation of state (EoS), nucleon superfluidity and superconductivity, envelope composition, and magnetic field, and so on. Recent observations [\\textit{e.g.}, V. Abramkin \\textit{et al.,} ApJ \\textbf{924}, 128 (2022)] have revealed unexpectedly warm old neutron stars, which cannot be explained by standard neutrino-photon cooling models. The failure of the standard cooling models implies the presence of additional internal heating mechanism. Building on the previous study [M. Fujiwara \\textit{et al}., JCAP \\textbf{03}, 051 (2024)], which proposed vortex creep heating (VCH) from the frictional motion of superfluid vortices as a viable mechanism, we extend the cooling framework to include both VCH and direct Urca (DUrca) processes. These are implemented in our code to explore their combined impact, particularly for massive neutron stars where DUrca operates. By varying rotational parameters ($P$, $\\dot{P}$, $P_0$), EoS models (APR, BSk24), pairing gaps, and envelope compositions, we examine how heating-cooling interplay shapes the temperature evolution. Our results show that VCH can substantially mitigate the rapid cooling driven by DUrca, offering new evolutionary pathways for massive neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2510.24167.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24341",
      "title": "XRISM High-resolution Spectroscopy of SS 433: Evidence of Decreasing Line-of-Sight Velocity Dispersion along the Jet",
      "authors": [
        "Megumi Shidatsu",
        "Shogo Kobayashi",
        "Yusuke Sakai",
        "Toshihiro Takagi",
        "Yuta Okada",
        "Shinya Yamada",
        "Yoshihiro Ueda",
        "Hideki Uchiyama",
        "Robert Petre"
      ],
      "abstract": "XRISM High-resolution Spectroscopy of SS 433: Evidence of Decreasing Line-of-Sight Velocity Dispersion along the Jet Megumi Shidatsu, Shogo Kobayashi, Yusuke Sakai, Toshihiro Takagi, Yuta Okada, Shinya Yamada, Yoshihiro Ueda, Hideki Uchiyama, Robert Petre 10 pages, 6 figures, 2 tables, accepted for publication in PASJ High Energy Astrophysical Phenomena (astro-ph.HE) We report on the jet structure in SS 433 based on X-ray high resolution spectroscopy with the XRISM/Resolve. The source was observed over 5 days covering both inside and outside an eclipse of the compact object by the companion star. Doppler-shifted, ionized Fe and Ni K emission lines were resolved, as well as lower-energy lines including Si and S K lines. Time-resolved spectral analysis showed that Fe and Ni K line widths were $1020 \\pm 40$ km s$^{-1}$ (corresponding the 1$\\sigma$ width) in the eclipse phase, gradually increased during the egress, and reached $1740 \\pm 30$ km s$^{-1}$ outside the eclipse. A time-averaged spectrum outside the eclipse confirmed that the Fe and Ni K lines in 5.5-9 keV are significantly broader than the Si and S K$\\alpha$ emission lines in 2--4 keV. Specifically, the width in 5.5-9 keV was measured to be $1900 \\pm 80$ km s$^{-1}$, whereas the width in 2-4 keV is $1300^{+300}_{-400}$ km s$^{-1}$ for the approaching (blueshifted) jet component. These results indicate that radial velocity dispersion of the jet plasma in SS 433 decreases as it moves outward. We interpret this variation as progressive jet collimation along its axis, as suggested by Namiki et al. (2003), or a decrease in turbulence in the jet plasma flow within the X-ray emitting region. We also detected a clear difference in velocity dispersion between the approaching and receding (redshifted) jet components in the 5.5-9 keV band outside eclipse. The receding jet exhibited a smaller velocity dispersion ($1400 \\pm 200$ km s$^{-1}$) than the approaching jet. Since the observation was conducted when the approaching jet was tilted toward the observer, this may suggest that the receding jet was more extensively occulted by the accretion disk.",
      "pdf_url": "https://arxiv.org/pdf/2510.24341.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24516",
      "title": "Multi-messenger constraints on transient accelerators of ultra-high energy cosmic rays",
      "authors": [
        "Antonio Condorelli",
        "Jonathan Biteau",
        "Olivier Deligny",
        "Remi Adam"
      ],
      "abstract": "Multi-messenger constraints on transient accelerators of ultra-high energy cosmic rays Antonio Condorelli, Jonathan Biteau, Olivier Deligny, Remi Adam 8 pages, 5 figures, Proceedings for the 39th International Cosmic Ray Conference (ICRC2025) High Energy Astrophysical Phenomena (astro-ph.HE) The origin of ultra-high-energy cosmic rays (UHECRs) remains an open questions in astrophysics. We explore two primary scenarios for the distribution of UHECR sources, assuming that their production rate follows either the cosmic star-formation-rate or stellar-mass density. By jointly fitting the UHECR energy spectrum and mass composition measured by the Pierre Auger Observatory above the ankle (10^{18.7} eV), we derive constraints on the acceleration mechanisms, source energetics, and elemental abundances at escape. Using these constraints, we generate sky maps above 40 EeV based on a catalog of over 400,000 galaxies out to 350 Mpc, providing a near-infrared flux-limited sample that maps the two stellar-activity tracers across the full sky. A crucial factor in understanding UHECR propagation is the influence of large-scale cosmic structures, particularly galaxy clusters, the largest gravitationally bound systems in the Universe, which are filled with magnetized diffuse plasma. Intermittent sources hosted in galaxies within such structures, coupled with cosmic magnetic fields, shape the observed UHECR arrival directions and provide insights into the burst rate of the sources. We show that these environments can significantly impact UHECR transport, making them particularly opaque to heavy nuclei. Additionally, we compute the expected secondary neutrino and photon fluxes from UHECR interactions in these environments and compare them with current experimental limits, constraining the maximum energy that particles can achieve. Finally, we assess the compatibility of these constraints with astrophysical candidates, identifying long gamma-ray bursts as the most promising sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.24516.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24549",
      "title": "Gamma-Ray Burst Polarimetry with the COMCUBE-S CubeSat Swarm",
      "authors": [
        "Nathan Franel",
        "Vincent Tatischeff",
        "David Murphy",
        "Alexey Ulianov",
        "Caimin McKenna",
        "Lorraine Hanlon",
        "Prerna Baranwal",
        "Christophe Beigbeder",
        "Arnaud Claret",
        "Ion Cojocari",
        "Nicolas de Séréville",
        "Nicolas Dosme",
        "Eric Doumayrou",
        "Mariya Georgieva",
        "Clarisse Hamadache",
        "Sally Hankache",
        "Jimmy Jeglot",
        "Mózsi Kiss",
        "Beng-Yun Ky",
        "Vincent Lafage",
        "Philippe Laurent",
        "Christine Le Galliard",
        "Joseph Mangan",
        "Aline Meuris",
        "Mark Pearce",
        "Jean Peyré",
        "Arjun Poitaya",
        "Diana Renaud",
        "Arnaud Saussac",
        "Varun Varun",
        "Matias Vecchio",
        "Colin Wade"
      ],
      "abstract": "Gamma-Ray Burst Polarimetry with the COMCUBE-S CubeSat Swarm Nathan Franel, Vincent Tatischeff, David Murphy, Alexey Ulianov, Caimin McKenna, Lorraine Hanlon, Prerna Baranwal, Christophe Beigbeder, Arnaud Claret, Ion Cojocari, Nicolas de Séréville, Nicolas Dosme, Eric Doumayrou, Mariya Georgieva, Clarisse Hamadache, Sally Hankache, Jimmy Jeglot, Mózsi Kiss, Beng-Yun Ky, Vincent Lafage, Philippe Laurent, Christine Le Galliard, Joseph Mangan, Aline Meuris, Mark Pearce, Jean Peyré, Arjun Poitaya, Diana Renaud, Arnaud Saussac, Varun Varun, Matias Vecchio, Colin Wade 13 pages, 6 figures, proceedings of the conference Advances in Space AstroParticle Physics (2025), submitted to (MDPI) Particles for publication in the Special Issue \"Advances in Space AstroParticle Physics: Frontier Technologies for Particle Measurements in Space, 2025 Edition\", Editors: Matteo Duranti and Valerio Vagelli High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) COMCUBE-S (Compton Telescope CubeSat Swarm) is a proposed mission aimed at understanding the radiation mechanisms of ultra-relativistic jets from Gamma-Ray Bursts (GRBs). It consists of a swarm of 16U CubeSats carrying a state-of-the-art Compton polarimeter and a BGO spectrometer to perform timing, spectroscopic and polarimetric measurements of the prompt emission from GRBs. The mission is currently in a feasibility study phase (Phase A) with the European Space Agency to prepare an in-orbit demonstration. Here, we present the simulation work used to optimise the design and operational concept of the microsatellite constellation, as well as estimate the mission performance in terms of GRB detection rate and polarimetry. We used the MEGAlib software to simulate the response function of the gamma-ray instruments, together with a detailed model for the background particle and radiation fluxes in low-Earth orbit. We also developed a synthetic GRB population model to best estimate the detection rate. These simulations show that COMCUBE-S will detect about 2 GRBs per day, which is significantly higher than that of all past and current GRB missions. Furthermore, simulated performance for linear polarisation measurements shows that COMCUBE-S will be able to uniquely distinguish between competing models of the GRB prompt emission, thereby shedding new light on some of the most fundamental aspects of GRB physics.",
      "pdf_url": "https://arxiv.org/pdf/2510.24549.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24560",
      "title": "XRISM constraints on unidentified X-ray emission lines, including the 3.5 keV line, in the stacked spectrum of ten galaxy clusters",
      "authors": [
        "XRISM Collaboration",
        "Marc Audard",
        "Hisamitsu Awaki",
        "Ralf Ballhausen",
        "Aya Bamba",
        "Ehud Behar",
        "Rozenn Boissay-Malaquin",
        "Laura Brenneman",
        "Gregory V. Brown",
        "Lia Corrales",
        "Elisa Costantini",
        "Renata Cumbee",
        "Maria Diaz Trigo",
        "Chris Done",
        "Tadayasu Dotani",
        "Ken Ebisawa",
        "Megan E. Eckart",
        "Dominique Eckert",
        "Satoshi Eguchi",
        "Teruaki Enoto",
        "Yuichiro Ezoe",
        "Adam Foster",
        "Ryuichi Fujimoto",
        "Yutaka Fujita",
        "Yasushi Fukazawa",
        "Kotaro Fukushima",
        "Akihiro Furuzawa",
        "Luigi Gallo",
        "Javier A. García",
        "Liyi Gu",
        "Matteo Guainazzi",
        "Kouichi Hagino",
        "Kenji Hamaguchi",
        "Isamu Hatsukade",
        "Katsuhiro Hayashi",
        "Takayuki Hayashi",
        "Natalie Hell",
        "Edmund Hodges-Kluck",
        "Ann Hornschemeier",
        "Yuto Ichinohe",
        "Daiki Ishi",
        "Manabu Ishida",
        "Kumi Ishikawa",
        "Yoshitaka Ishisaki",
        "Jelle Kaastra",
        "Timothy Kallman",
        "Erin Kara",
        "Satoru Katsuda",
        "Yoshiaki Kanemaru",
        "Richard Kelley",
        "Caroline Kilbourne",
        "Shunji Kitamoto",
        "Shogo Kobayashi",
        "Takayoshi Kohmura",
        "Aya Kubota",
        "Maurice Leutenegger",
        "Michael Loewenstein",
        "Yoshitomo Maeda",
        "Maxim Markevitch",
        "Hironori Matsumoto",
        "Kyoko Matsushita",
        "Dan McCammon",
        "Brian McNamara",
        "François Mernier",
        "Eric D. Miller",
        "Jon M. Miller",
        "Ikuyuki Mitsuishi",
        "Misaki Mizumoto",
        "Tsunefumi Mizuno",
        "Koji Mori",
        "Koji Mukai",
        "Hiroshi Murakami",
        "Richard Mushotzky",
        "Hiroshi Nakajima",
        "Kazuhiro Nakazawa",
        "Jan-Uwe Ness",
        "Kumiko Nobukawa",
        "Masayoshi Nobukawa",
        "Hirofumi Noda",
        "Hirokazu Odaka",
        "Shoji Ogawa",
        "Anna Ogorzałek",
        "Takashi Okajima",
        "Naomi Ota",
        "Stephane Paltani",
        "Robert Petre",
        "Paul Plucinsky",
        "Frederick S. Porter",
        "Katja Pottschmidt",
        "Kosuke Sato",
        "Toshiki Sato",
        "Makoto Sawada",
        "Hiromi Seta",
        "Megumi Shidatsu",
        "Aurora Simionescu",
        "Randall Smith",
        "Hiromasa Suzuki",
        "Andrew Szymkowiak",
        "Hiromitsu Takahashi",
        "Mai Takeo"
      ],
      "abstract": "XRISM constraints on unidentified X-ray emission lines, including the 3.5 keV line, in the stacked spectrum of ten galaxy clusters XRISM Collaboration, Marc Audard, Hisamitsu Awaki, Ralf Ballhausen, Aya Bamba, Ehud Behar, Rozenn Boissay-Malaquin, Laura Brenneman, Gregory V. Brown, Lia Corrales, Elisa Costantini, Renata Cumbee, Maria Diaz Trigo, Chris Done, Tadayasu Dotani, Ken Ebisawa, Megan E. Eckart, Dominique Eckert, Satoshi Eguchi, Teruaki Enoto, Yuichiro Ezoe, Adam Foster, Ryuichi Fujimoto, Yutaka Fujita, Yasushi Fukazawa, Kotaro Fukushima, Akihiro Furuzawa, Luigi Gallo, Javier A. García, Liyi Gu, Matteo Guainazzi, Kouichi Hagino, Kenji Hamaguchi, Isamu Hatsukade, Katsuhiro Hayashi, Takayuki Hayashi, Natalie Hell, Edmund Hodges-Kluck, Ann Hornschemeier, Yuto Ichinohe, Daiki Ishi, Manabu Ishida, Kumi Ishikawa, Yoshitaka Ishisaki, Jelle Kaastra, Timothy Kallman, Erin Kara, Satoru Katsuda, Yoshiaki Kanemaru, Richard Kelley, Caroline Kilbourne, Shunji Kitamoto, Shogo Kobayashi, Takayoshi Kohmura, Aya Kubota, Maurice Leutenegger, Michael Loewenstein, Yoshitomo Maeda, Maxim Markevitch, Hironori Matsumoto, Kyoko Matsushita, Dan McCammon, Brian McNamara, François Mernier, Eric D. Miller, Jon M. Miller, Ikuyuki Mitsuishi, Misaki Mizumoto, Tsunefumi Mizuno, Koji Mori, Koji Mukai, Hiroshi Murakami, Richard Mushotzky, Hiroshi Nakajima, Kazuhiro Nakazawa, Jan-Uwe Ness, Kumiko Nobukawa, Masayoshi Nobukawa, Hirofumi Noda, Hirokazu Odaka, Shoji Ogawa, Anna Ogorzałek, Takashi Okajima, Naomi Ota, Stephane Paltani, Robert Petre, Paul Plucinsky, Frederick S. Porter, Katja Pottschmidt, Kosuke Sato, Toshiki Sato, Makoto Sawada, Hiromi Seta, Megumi Shidatsu, Aurora Simionescu, Randall Smith, Hiromasa Suzuki, Andrew Szymkowiak, Hiromitsu Takahashi, Mai Takeo 16 pages, 4 figures, 2 tables, accepted for publication in ApJ Letters High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex) We stack 3.75 Megaseconds of early XRISM Resolve observations of ten galaxy clusters to search for unidentified spectral lines in the $E=$ 2.5-15 keV band (rest frame), including the $E=3.5$ keV line reported in earlier, low spectral resolution studies of cluster samples. Such an emission line may originate from the decay of the sterile neutrino, a warm dark matter (DM) candidate. No unidentified lines are detected in our stacked cluster spectrum, with the $3\\sigma$ upper limit on the $m_{\\rm s}\\sim$ 7.1 keV DM particle decay rate (which corresponds to a $E=3.55$ keV emission line) of $\\Gamma \\sim 1.0 \\times 10^{-27}$ s$^{-1}$. This upper limit is 3-4 times lower than the one derived by Hitomi Collaboration et al. (2017) from the Perseus observation, but still 5 times higher than the XMM-Newton detection reported by Bulbul et al. (2014) in the stacked cluster sample. XRISM Resolve, with its high spectral resolution but a small field of view, may reach the sensitivity needed to test the XMM-Newton cluster sample detection by combining several years worth of future cluster observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.24560.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ex"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24620",
      "title": "AT2025ulz and S250818k: Investigating early time observations of a subsolar mass gravitational-wave binary neutron star merger candidate",
      "authors": [
        "Xander J. Hall",
        "Malte Busmann",
        "Hauke Koehn",
        "Keerthi Kunnumkai",
        "Antonella Palmese",
        "Brendan O'Connor",
        "James Freeburn",
        "Lei Hu",
        "Daniel Gruen",
        "Tim Dietrich",
        "Mattia Bulla",
        "Michael W. Coughlin",
        "Sarah Antier",
        "Marion Pillas",
        "Paul A. Price",
        "Tomás Ahumada",
        "Ariel Amsellem",
        "Igor Andreoni",
        "Jule Augustin",
        "Tom'as Cabrera",
        "Rasika Deshpande",
        "Jennifer Fabà-Moreno",
        "Julius Gassert",
        "Sergey Karpov",
        "Mansi Kasliwal",
        "Ignacio Magaña Hernandez",
        "Rachel Mandelbaum",
        "Felipe Fontinele Nunes",
        "Peter T. H. Pang",
        "Julian Sommer",
        "Robert Stein",
        "Constantin Tabor",
        "Pablo Vega",
        "Thibeau Wouters",
        "Xiaoxiong Zuo"
      ],
      "abstract": "AT2025ulz and S250818k: Investigating early time observations of a subsolar mass gravitational-wave binary neutron star merger candidate Xander J. Hall, Malte Busmann, Hauke Koehn, Keerthi Kunnumkai, Antonella Palmese, Brendan O'Connor, James Freeburn, Lei Hu, Daniel Gruen, Tim Dietrich, Mattia Bulla, Michael W. Coughlin, Sarah Antier, Marion Pillas, Paul A. Price, Tomás Ahumada, Ariel Amsellem, Igor Andreoni, Jule Augustin, Tom'as Cabrera, Rasika Deshpande, Jennifer Fabà-Moreno, Julius Gassert, Sergey Karpov, Mansi Kasliwal, Ignacio Magaña Hernandez, Rachel Mandelbaum, Felipe Fontinele Nunes, Peter T. H. Pang, Julian Sommer, Robert Stein, Constantin Tabor, Pablo Vega, Thibeau Wouters, Xiaoxiong Zuo High Energy Astrophysical Phenomena (astro-ph.HE) Over the past LIGO--Virgo--KAGRA (LVK) observing runs, it has become increasingly clear that identifying the next electromagnetic counterparts to gravitational-wave (GW) neutron star mergers will likely be more challenging compared to the case of GW170817. The rarity of these GW events, and their electromagnetic counterparts, motivates rapid searches of any candidate binary neutron star (BNS) merger detected by the LVK. We present our extensive photometric and spectroscopic campaign of the candidate counterpart AT2025ulz to the low-significance GW event S250818k, which had a ${\\sim} 29\\%$ probability of being a BNS merger. We demonstrate that during the first five days, the luminosity and color evolution of AT2025ulz are consistent with both kilonova and shock cooling models, although a Bayesian model comparison shows preference for the shock cooling model, underscoring the ambiguity inherent to early data obtained over only a few days. Continued monitoring beyond this window reveals a rise and color evolution incompatible with kilonova models and instead consistent with a supernova. This event emphasizes the difficulty in identifying the electromagnetic counterparts to BNS mergers and the significant allotment of observing time necessary to robustly differentiate kilonovae from impostors.",
      "pdf_url": "https://arxiv.org/pdf/2510.24620.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.24127",
      "title": "Radiatively-Cooled Mass Transfer: Disk Properties and L2 outflows across Mass Transfer Rates",
      "authors": [
        "Peter Scherbak",
        "Wenbin Lu",
        "Jim Fuller"
      ],
      "abstract": "Radiatively-Cooled Mass Transfer: Disk Properties and L2 outflows across Mass Transfer Rates Peter Scherbak, Wenbin Lu, Jim Fuller Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) High rates of stable mass transfer (MT) occur for some binary star systems, resulting in luminous transients and circumbinary outflows. We perform hydrodynamical simulations of a $10 \\ M_\\odot$ donor star and a $5\\ M_\\odot$ point mass secondary, incorporating approximate effects of radiative cooling. By varying the orbital separation of the system, we probe MT rates between $10^{-5}$ and $10^{-1} M_\\odot$/yr. Mass flows from the donor into an accretion disk, with significant equatorially-concentrated outflows through the outer Lagrange point L2 occurring for MT rates $\\gtrsim 10^{-3} M_\\odot$/yr, while the MT remaining mostly conservative for lower MT rates. In all cases, any outflowing gas approximately carries the specific angular momentum of L2. The gas cooling luminosity $L$ and temperature increases with MT rate, with $L \\sim 10^{5} L_\\odot$ and $T \\sim 10^4 \\, {\\rm K}$ for simulations featuring the strongest outflows, with contributions from both the accretion disk and circumbinary outflow. The most luminous transients associated with mass outflows will be rare due to the high MT rate requirement, but generate significant optical emission from both the accretor's disk and the circumbinary outflow.",
      "pdf_url": "https://arxiv.org/pdf/2510.24127.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24622",
      "title": "The Impact of Cosmic Ray Transport on the $γ$-Ray Luminosity of Diffuse Gas",
      "authors": [
        "Roark Habegger",
        "Mateusz Ruszkowski",
        "Ellen G. Zweibel"
      ],
      "abstract": "The Impact of Cosmic Ray Transport on the $γ$-Ray Luminosity of Diffuse Gas Roark Habegger, Mateusz Ruszkowski, Ellen G. Zweibel 22 pages, 13 Figures. Submitted to ApJ. Comments welcome! Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Observations of $\\gamma$-rays from diffuse gas provide the opportunity to study the distribution of high energy particles in different astrophysical environments. In the circumgalactic medium (CGM) and the intracluster medium (ICM), it is expected that relativistic cosmic rays collide with thermal particles and produce $\\gamma$-rays through pion decay. The $\\gamma$-ray luminosity of a plasma depends on where cosmic rays are: if they are in denser gas, they produce more $\\gamma$-rays. In this work, we study how different cosmic-ray transport mechanisms impact the $\\gamma$-ray luminosity of a turbulent, multiphase medium formed from an initially diffuse medium. Two quantities set the luminosity: the average cosmic-ray energy density and the correlation of cosmic-ray energy and gas density. Overall, cosmic rays must escape cold dense regions in order to produce less $\\gamma$-ray emission and be consistent with observations. Our simulations with fast transport mechanisms (either diffusion or streaming) are degenerate: they each produce a lower $\\gamma$-ray luminosity than slow transport simulations by two orders of magnitude. This result means that fast transport (particularly in dense clumps) is necessary for simulations to agree with the dearth of observations of $\\gamma$-ray emission from diffuse gas like the CGM and ICM. We also show the significant difference in luminosity is the result of cosmic-ray reacceleration. This reacceleration is different from the turbulent reacceleration described by Ptuskin (1988). Instead, condensing, cold clouds drive a significant increase in the average cosmic-ray energy and, as a result, the $\\gamma$-ray luminosity.",
      "pdf_url": "https://arxiv.org/pdf/2510.24622.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.16562",
      "title": "Hunting Hidden Axion Signals in Pulsar Dispersion Measurements with Machine Learning",
      "authors": [
        "Haihao Shi",
        "Zhenyang Huang",
        "Qiyu Yan",
        "Jun Li",
        "Guoliang Lü",
        "Xuefei Chen"
      ],
      "abstract": "Hunting Hidden Axion Signals in Pulsar Dispersion Measurements with Machine Learning Haihao Shi, Zhenyang Huang, Qiyu Yan, Jun Li, Guoliang Lü, Xuefei Chen 15 pages, 7 figures, This is the version accepted by APJ High Energy Astrophysical Phenomena (astro-ph.HE) In axion models, interactions between axions and electromagnetic waves induce frequency-dependent time delays determined by the axion mass and decay constant. These small delays are difficult to detect, limiting the effectiveness of traditional methods. We compute such delays under realistic radio telescope conditions and identify a prominent dispersive feature near half the axion mass, which appears non-divergent within the limits of observational resolution. Based on this, we develop a machine learning method that achieves 90\\% classification accuracy and demonstrates well performance in low signal-to-noise regimes. The method's robustness is confirmed against false positives using both simulated noisy data and real-world, known-null observations. Future improvements in optical clock precision and telescope bandwidth, particularly with instruments such as the Qitai Radio Telescope, may enhance constraints on the axion decay constant by up to four orders of magnitude in the $10^{-6} \\sim 10^{-4}$ eV mass range.",
      "pdf_url": "https://arxiv.org/pdf/2505.16562.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.14529",
      "title": "The variability of active galaxies: I. Broad-band noise X-ray power spectra from XMM-Newton and Swift",
      "authors": [
        "Mehdy Lefkir",
        "Simon Vaughan",
        "Mike Goad",
        "Daniela Huppenkothen",
        "Phil Uttley"
      ],
      "abstract": "The variability of active galaxies: I. Broad-band noise X-ray power spectra from XMM-Newton and Swift Mehdy Lefkir, Simon Vaughan, Mike Goad, Daniela Huppenkothen, Phil Uttley 22 pages, 10 figures, accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Accreting supermassive black holes at the centres of galaxies are the engine of active galactic nuclei (AGN). X-ray light curves of unabsorbed AGN show dramatic random variability on timescales ranging from seconds to years. The power spectrum of the fluctuations is usually well-modelled with a power law that decays as $1/f$ at low frequencies, and which bends to $1/f^{2-3}$ at high frequencies. The timescale associated with the bend correlates well with the mass of the black hole and may also correlate with bolometric luminosity in the `X-ray variability plane'. Because AGN light curves are usually irregularly sampled, the estimation of AGN power spectra is challenging. In a previous paper, we introduced a new method to estimate the parameters of bending power law power spectra from AGN light curves. We apply this method to a sample of 56 variable and unabsorbed AGN, observed with XMM-Newton and Swift in the $0.3-1.5$ keV band over the past two decades. We obtain estimates of the bends in 50 sources, which is the largest sample of X-ray bends in the soft band. We also find that the high-frequency power spectrum is often steeper than 2. We update the X-ray variability plane with new bend timescale measurements spanning from 7 min to 62 days. We report the detections of low-frequency bends in the power spectra of five AGN, three of which are previously unpublished: 1H 1934-063, Mkn 766 and Mkn 279.",
      "pdf_url": "https://arxiv.org/pdf/2510.14529.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19132",
      "title": "Evidence of Energy Injection in the Short and Distant GRB 250221A",
      "authors": [
        "Camila Angulo-Valdez",
        "Rosa L. Becerra",
        "Ramandeep Gill",
        "Noémie Globus",
        "William H. Lee",
        "Diego López-Cámara",
        "Cassidy Mihalenko",
        "Enrique Moreno-Méndez",
        "Roberto Ricci",
        "Karelle Siellez",
        "Alan M. Watson",
        "Muskan Yadav",
        "Yu-han Yang",
        "Dalya Akl",
        "Sarah Antier",
        "Jean-Luc Atteia",
        "Stéphane Basa",
        "Nathaniel R. Butler",
        "Simone Dichiara",
        "Damien Dornic",
        "Jean-Grégoire Ducoin",
        "Francis Fortin",
        "Leonardo García-García",
        "Kin Ocelotl López",
        "Francesco Magnani",
        "Brendan O'Connor",
        "Margarita Pereyra",
        "Ny Avo Rakotondrainibe",
        "Fredd Sánchez-Álvarez",
        "Benjamin Schneider",
        "Eleonora Troja",
        "Antonio de Ugarte Postigo"
      ],
      "abstract": "Evidence of Energy Injection in the Short and Distant GRB 250221A Camila Angulo-Valdez, Rosa L. Becerra, Ramandeep Gill, Noémie Globus, William H. Lee, Diego López-Cámara, Cassidy Mihalenko, Enrique Moreno-Méndez, Roberto Ricci, Karelle Siellez, Alan M. Watson, Muskan Yadav, Yu-han Yang, Dalya Akl, Sarah Antier, Jean-Luc Atteia, Stéphane Basa, Nathaniel R. Butler, Simone Dichiara, Damien Dornic, Jean-Grégoire Ducoin, Francis Fortin, Leonardo García-García, Kin Ocelotl López, Francesco Magnani, Brendan O'Connor, Margarita Pereyra, Ny Avo Rakotondrainibe, Fredd Sánchez-Álvarez, Benjamin Schneider, Eleonora Troja, Antonio de Ugarte Postigo High Energy Astrophysical Phenomena (astro-ph.HE) We present the photometric and spectroscopic analysis of the short-duration GRB 250221A ($T_{90}=1.80\\pm0.32$ s), using a data set from the optical facilities COLIBRÍ, the Harlingten 50 cm Telescope, and the Very Large Telescope. We complement these observations with data from the \\textit{Neil Gehrels Swift Observatory} and the \\textit{Einstein Probe}, as well as radio observations from the Very Large Array. GRB 250221A is among the few short GRBs with direct afterglow spectroscopy, which gives a secure redshift determination of $z=0.768$ and allows the unambiguous identification of the host as a galaxy with a star-formation rate of $\\sim3\\,M_\\odot\\,{\\rm yr}^{-1}$. The X-ray and optical light curves up to $T_0+10$ ks (where $T_0$ refers to the GRB trigger time) are well described by forward-shock synchrotron emission in the slow-cooling regime within the standard fireball framework. However, at $T_0+0.6$ days, both the X-ray and optical bands exhibit an excess over the same interval, which we interpret as evidence of energy injection into a jet with a half-opening angle of $\\theta_j=11.5^{\\circ}$ through a refreshed shock powered by late central engine activity or a radially stratified ejecta. The burst properties (duration, spectral hardness, peak energy, and location in the Amati plane) all favour a compact binary merger origin. However, our modelling of the afterglow suggests a dense circumburst medium ($n\\sim80$ cm$^{-3}$), which is more typical of a Collapsar environment. This tension over the classification of this burst (short-hard vs. long-soft) as inferred from the prompt and afterglow emissions makes GRB~250221A an unusual event and underscores the limitations of duration-based classifications and the importance of multi-wavelength, time-resolved follow-up observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.19132.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25483",
      "title": "Shocked, Heated, and Now Resolved: H$_2$ excitation in the low-luminosity AGN at M58 core with JWST",
      "authors": [
        "I. E. López",
        "E. Bertola",
        "V. Reynaldi",
        "P. Ogle",
        "R. D. Baldi",
        "M. Brusa",
        "S. García-Burillo",
        "B. Sebastian",
        "M. V. Zanchettin",
        "G. Cresci",
        "J. A. Fernández-Ontiveros",
        "A. Marconi",
        "R. M. Rich",
        "T. M. Rodriguez"
      ],
      "abstract": "Shocked, Heated, and Now Resolved: H$_2$ excitation in the low-luminosity AGN at M58 core with JWST I. E. López, E. Bertola, V. Reynaldi, P. Ogle, R. D. Baldi, M. Brusa, S. García-Burillo, B. Sebastian, M. V. Zanchettin, G. Cresci, J. A. Fernández-Ontiveros, A. Marconi, R. M. Rich, T. M. Rodriguez Accepted for publication in Astronomy & Astrophysics (A&A) Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We present JWST NIRSpec and MIRI MRS observations of the central kiloparsec of M58 (NGC 4579), a nearby LINER galaxy hosting a low-luminosity AGN (LLAGN; $L_\\mathrm{bol} \\sim 10^{42}$ erg s$^{-1}$) with a low-power jet. These data provide an unprecedented view of the warm molecular gas phase and reveal clear signatures of feedback. We detect 44 H$_2$ lines, including bright pure rotational lines (S(1)-S(18)) and rovibrational lines up to $\\nu=2$, probing a wide range of excitation conditions. Excitation diagrams show that rotational lines follow a power-law temperature distribution with an exponential cutoff, consistent with heating by low-velocity shocks. H$_2$ rovibrational lines deviate from thermal models primarily because of sub-thermal excitation at low density. Additionally, there may be a 10% contribution powered by AGN X-ray photons in the nucleus. The dust lanes associated with the spiral inflow appear dynamically undisturbed but show signs of shock heating, while the inner $\\sim$200 pc exhibits turbulent kinematics produced by outflowing molecular gas. These results reveal the subtle yet measurable impact of LLAGN feedback on the interstellar medium, demonstrating that even weak, vertically oriented jets and low radiative accretion rates can perturb molecular gas and regulate nuclear reservoirs. This study highlights JWST's transformative ability to uncover hidden modes of AGN feedback.",
      "pdf_url": "https://arxiv.org/pdf/2509.25483.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.15816",
      "title": "BREAKFAST: A Framework for general joint BA duty and follow-up guidance of multiple $γ$-ray monitors",
      "authors": [
        "Chen-Wei Wang",
        "Peng Zhang",
        "Shao-Lin Xiong",
        "Yue Huang",
        "Wen-Jun Tan",
        "Zheng-Hang Yu",
        "Yue Wang",
        "Wang-Chen Xue",
        "Chao Zheng",
        "Hao-Xuan Guo",
        "Ce Cai",
        "Yong-Wei Dong",
        "Jiang He",
        "Cheng-Kui Li",
        "Xiao-Bo Li",
        "Jia-Cong Liu",
        "Xing-Hao Luo",
        "Xiang Ma",
        "Rahim Moradi",
        "Yang-Zhao Ren",
        "Li-Ming Song",
        "Ping Wang",
        "Jin Wang",
        "Bo-Bing Wu",
        "Shuo Xiao",
        "Sheng-Lun Xie",
        "Shu-Xu Yi",
        "Xue-Yuan Zao",
        "Xiao-Yun Zhao",
        "Li Zhang",
        "Shuang-Nan Zhang",
        "Yan-Qiu Zhang",
        "Shi-Jie Zheng"
      ],
      "abstract": "BREAKFAST: A Framework for general joint BA duty and follow-up guidance of multiple $γ$-ray monitors Chen-Wei Wang, Peng Zhang, Shao-Lin Xiong, Yue Huang, Wen-Jun Tan, Zheng-Hang Yu, Yue Wang, Wang-Chen Xue, Chao Zheng, Hao-Xuan Guo, Ce Cai, Yong-Wei Dong, Jiang He, Cheng-Kui Li, Xiao-Bo Li, Jia-Cong Liu, Xing-Hao Luo, Xiang Ma, Rahim Moradi, Yang-Zhao Ren, Li-Ming Song, Ping Wang, Jin Wang, Bo-Bing Wu, Shuo Xiao, Sheng-Lun Xie, Shu-Xu Yi, Xue-Yuan Zao, Xiao-Yun Zhao, Li Zhang, Shuang-Nan Zhang, Yan-Qiu Zhang, Shi-Jie Zheng Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) With the growing number of gamma-ray monitors in operation, several research teams have adopted a strategy of joint operation and scientific duty to improve efficiency. A successful example is the GECAM-HXMT-SVOM (GHS) constellation collaboration, which sets a precedent for other gamma-ray monitor constellations. However, joint duty also presents challenges to Burst Advocates (BAs), including the increased number of triggers and, more importantly, the frequent switching between various systems due to incompatibilities among different missions, which complicates the situation. To address the current requirements of multi-wavelength and multi-messenger astronomy, we developed a customized framework for unified trigger processing within the GHS joint duty, named \"BA's Rapid Evaluation and Analysis Kit for Formulating Alerts and Summary Tools\" (BREAKFAST). This framework incorporates a series of automated, semi-automated, and manual pipelines designed to rapidly process triggers of prompt emissions in the gamma-ray band from different instruments, while maintaining flexible compatibility for future missions. The pursuit of BREAKFAST goes beyond merely providing trigger processing for BAs. BREAKFAST also aims to filtering high-value targets and guiding follow-up telescopes through rapid analysis and reporting, thus serving as an important bridge between prompt emission observations and afterglow observations. To this end, a suite of comprehensive analysis modules is included in BREAKFAST, particularly the specially designed module that predicts X-ray afterglow brightness based on prompt emission properties. The framework's effectiveness has already been demonstrated in recent observational campaigns, and it is expected to play a significant role in the discovery and observation of peculiar transients in the future.",
      "pdf_url": "https://arxiv.org/pdf/2510.15816.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23707",
      "title": "The SARAO MeerKAT Galactic Plane Survey compact source catalogue",
      "authors": [
        "Mubela Mutale",
        "Mark A. Thompson",
        "Gwenllian M. Williams",
        "Andrew J. Rigby",
        "Melvin G. Hoare",
        "James S. Urquhart",
        "Michael Bietenholz",
        "Cristobal Bordiu",
        "Fernando Camilo",
        "William D. Cotton",
        "Sharmila Goedhart",
        "Willice O. Obonyo",
        "Simone Riggi",
        "Aiyuan Yang"
      ],
      "abstract": "The SARAO MeerKAT Galactic Plane Survey compact source catalogue Mubela Mutale, Mark A. Thompson, Gwenllian M. Williams, Andrew J. Rigby, Melvin G. Hoare, James S. Urquhart, Michael Bietenholz, Cristobal Bordiu, Fernando Camilo, William D. Cotton, Sharmila Goedhart, Willice O. Obonyo, Simone Riggi, Aiyuan Yang Accepted for publication in MNRAS, 17 pages, 22 figures, 5 tables Astrophysics of Galaxies (astro-ph.GA) We present a catalogue of compact sources detected in the SARAO MeerKAT 1.3 GHz Galactic Plane Survey (SMGPS). We extract 510599 compact sources, with areas less than five 8\" beams, from the survey maps covering the regions $252°< l < 358^°$ and $2°< l < 61°$ at $|b| \\leq 1.5^°$, which have an angular resolution of 8\" and a sensitivity of $\\sim$ 10-30 $\\mu$Jy beam$^{-1}$. In this paper, we describe the source identification and characterisation methods, present the quality assurance of the catalogue, explore the nature of the catalogue sources, and present initial science highlights. We limit our catalogue to sources with a signal-to-noise ratio $\\geq 5$, as the catalogue is $\\sim$90 per cent complete, and has a false positive rate of less than 1 per cent at this threshold. The bulk of the catalogue sources are previously unknown to the literature, with the majority of unknown sources at sub-mJy levels. Initial science highlights from the catalogue include the detection of 213 radio quiet WISE HII region candidates, previously undetected in radio continuum studies. We show images that compare the SMGPS compact sources to CORNISH ultracompact HII regions, thus highlighting the sensitivity and unprecedented uv-coverage of the SMGPS, and the potential synergy of the SMGPS with other surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.23707.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23742",
      "title": "Molecular Gas in Major Mergers Hosting Dual and Single AGN at <10 kpc Nuclear Separations",
      "authors": [
        "Makoto A. Johnstone",
        "Ezequiel Treister",
        "Franz E. Bauer",
        "Chin-Shin Chang",
        "Claudia Cicone",
        "Michael J. Koss",
        "Ignacio del Moral-Castro",
        "Francisco Muller-Sanchez",
        "George C. Privon",
        "Claudio Ricci",
        "Nick Scoville",
        "Giacomo Venturi",
        "Loreto Barcos-Muñoz",
        "Lee Armus",
        "Laura Blecha",
        "Caitlin Casey",
        "Julia Comerford",
        "Aaron Evans",
        "Taiki Kawamuro",
        "Anne M. Medling",
        "Hugo Messias",
        "Neil Nagar",
        "Alejandra Rojas",
        "David Sanders",
        "Benny Trakhtenbrot",
        "Vivian U",
        "Meg Urry"
      ],
      "abstract": "Molecular Gas in Major Mergers Hosting Dual and Single AGN at <10 kpc Nuclear Separations Makoto A. Johnstone, Ezequiel Treister, Franz E. Bauer, Chin-Shin Chang, Claudia Cicone, Michael J. Koss, Ignacio del Moral-Castro, Francisco Muller-Sanchez, George C. Privon, Claudio Ricci, Nick Scoville, Giacomo Venturi, Loreto Barcos-Muñoz, Lee Armus, Laura Blecha, Caitlin Casey, Julia Comerford, Aaron Evans, Taiki Kawamuro, Anne M. Medling, Hugo Messias, Neil Nagar, Alejandra Rojas, David Sanders, Benny Trakhtenbrot, Vivian U, Meg Urry 38 pages, 13 figures, accepted by APJ Astrophysics of Galaxies (astro-ph.GA) We present high-resolution ($\\sim$50$-$100 pc) Atacama Large Millimeter Array (ALMA) observations of $^{12}$CO(2-1) or $^{12}$CO(1-0) emission in seven local ($z$ $\\lesssim$ 0.05) major mergers -- five of which are dual active galactic nuclei (AGN) systems, and two of which are single AGN systems. We model the molecular gas kinematics through rotating disk profiles using a Bayesian Markov chain Monte Carlo approach. The residuals were then used to isolate non-rotating components of the molecular gas-- the most likely contributor to future SMBH growth. We find that more massive SMBHs have higher surface densities of non-rotating molecular gas within their sphere of influence. This potential molecular gas supply, however, does not correlate with the current accretion efficiency of the SMBHs, suggesting that only a fraction of the observed non-rotating gas is currently reaching the SMBH. Finally, we tentatively find no significant differences in the nuclear molecular gas masses of single AGN and dual AGN hosts, both within the SMBH sphere of influence and within the central kiloparsec. Our results indicate that the probability of occurrence of the dual AGN phenomenon is likely dependent on AGN variability and/or obscuration rather than the availability of molecular gas in the nuclear regions.",
      "pdf_url": "https://arxiv.org/pdf/2510.23742.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23768",
      "title": "Galactic Alchemy: Deep Learning Map-to-Map Translation in Hydrodynamical Simulations",
      "authors": [
        "Philipp Denzel",
        "Yann Billeter",
        "Frank-Peter Schilling",
        "Elena Gavagnin"
      ],
      "abstract": "Galactic Alchemy: Deep Learning Map-to-Map Translation in Hydrodynamical Simulations Philipp Denzel, Yann Billeter, Frank-Peter Schilling, Elena Gavagnin Submitted to MNRAS, 21 pages, 5 figures, 9 tables Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present the first systematic study of multi-domain map-to-map translation in galaxy formation simulations, leveraging deep generative models to predict diverse galactic properties. Using high-resolution magneto-hydrodynamical simulation data, we compare conditional generative adversarial networks and diffusion models under unified preprocessing and evaluation, optimizing architectures and attention mechanisms for physical fidelity on galactic scales. Our approach jointly addresses seven astrophysical domains - including dark matter, gas, neutral hydrogen, stellar mass, temperature, and magnetic field strength - while introducing physics-aware evaluation metrics that quantify structural realism beyond standard computer vision measures. We demonstrate that translation difficulty correlates with physical coupling, achieving near-perfect fidelity for mappings from gas to dark matter and mappings involving astro-chemical components such as total gas to HI content, while identifying fundamental challenges in weakly constrained tasks such as gas to stellar mass mappings. Our results establish GAN-based models as competitive counterparts to state-of-the-art diffusion approaches at a fraction of the computational cost (in training and inference), paving the way for scalable, physics-aware generative frameworks for forward modelling and observational reconstruction in the SKA era.",
      "pdf_url": "https://arxiv.org/pdf/2510.23768.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23782",
      "title": "Does Machine Learning Work? A Comparative Analysis of Strong Gravitational Lens Searches in the Dark Energy Survey",
      "authors": [
        "J. Gonzalez",
        "T. Collett",
        "K. Rojas",
        "K. Bechtol",
        "J. A. Acevedo Barroso",
        "A. Melo",
        "A. More",
        "D. Sluse",
        "C. Tortora",
        "P. Holloway",
        "N. E. P. Lines",
        "A. Verma"
      ],
      "abstract": "Does Machine Learning Work? A Comparative Analysis of Strong Gravitational Lens Searches in the Dark Energy Survey J. Gonzalez, T. Collett, K. Rojas, K. Bechtol, J. A. Acevedo Barroso, A. Melo, A. More, D. Sluse, C. Tortora, P. Holloway, N. E. P. Lines, A. Verma Astrophysics of Galaxies (astro-ph.GA) We present a systematic comparison of three independent machine learning (ML)-based searches for strong gravitational lenses applied to the Dark Energy Survey (Jacobs et al. 2019a,b; Rojas et al. 2022; Gonzalez et al. 2025). Each search employs a distinct ML architecture and training strategy, allowing us to evaluate their relative performance, completeness, and complementarity. Using a visually inspected sample of 1651 systems previously reported as lens candidates, we assess how each model scores these systems and quantify their agreement with expert classifications. The three models show progressive improvement in performance, with F1-scores of 0.31, 0.35, and 0.54 for Jacobs, Rojas, and Gonzalez, respectively. Their completeness for moderate- to high-confidence lens candidates follows a similar trend (31%, 52%, and 70%). When combined, the models recover 82% of all such systems, highlighting their strong complementarity. Additionally, we explore ensemble strategies: average, median, linear regression, decision trees, random forests, and an Independent Bayesian method. We find that all but averaging achieve higher maximum F1 scores than the best individual model, with some ensemble methods improving precision by up to a factor of six. These results demonstrate that combining multiple, diverse ML classifiers can substantially improve the completeness of lens samples while drastically reducing false positives, offering practical guidance for optimizing future ML-based strong lens searches in wide-field surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.23782.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23803",
      "title": "Spatial-Kinematic Absorption Models of the Circumgalactic Medium. II. Ionized Gas Phases and Absorption Lines",
      "authors": [
        "Christopher W. Churchill"
      ],
      "abstract": "Spatial-Kinematic Absorption Models of the Circumgalactic Medium. II. Ionized Gas Phases and Absorption Lines Christopher W. Churchill (New Mexico state University) 26 pages, 10 figures, submitted to the Open Journal of Astrophysics (OJA) Astrophysics of Galaxies (astro-ph.GA) In this two-paper series, we present a straightforward mathematical model for synthesizing quasar absorption line profiles from sight lines through idealized, spatial-kinematic models of the circumgalactic medium (CGM) and their host galaxies. In Paper I, we developed the spatial components of the galaxy/CGM structures (disk, halo, wind, accretion) and their 3D velocity fields. We derived the formalism for arbitrary observed orientation of the galaxy/CGM model and quasar line of sight positioning. In this paper, following a brief review of Paper I, we present the formalism for populating the galaxy/CGM structures with multiphase photoionized and collisionally ionized gas and for generating HI and metal-line absorption profiles. Example absorption line systems through a fiducial galaxy/CGM model are presented. These flexible spatial-kinematic absorption models (SKAMs) can be directly applied to and/or easily modified/expanded for studying individual or ensembles of observed absorption line systems, for exploring various competing theoretical scenarios of the baryon cycle as studied through quasar absorption line systems, and/or serving as pedagogical tools for developing physical intuition. We briefly describe a SKAM GUI that is in early stages of development.",
      "pdf_url": "https://arxiv.org/pdf/2510.23803.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23863",
      "title": "MAGNUS I: A MUSE-DEEP sample of early-type galaxies at intermediate redshift",
      "authors": [
        "Pritom Mozumdar",
        "Michele Cappellari",
        "Christopher D. Fassnacht",
        "Tommaso Treu"
      ],
      "abstract": "MAGNUS I: A MUSE-DEEP sample of early-type galaxies at intermediate redshift Pritom Mozumdar, Michele Cappellari, Christopher D. Fassnacht, Tommaso Treu Astrophysics of Galaxies (astro-ph.GA) We present a sample of 212 early-type galaxies (ETGs) at redshifts $0.25 < z < 0.75$. We combine deep integral-field spectroscopy from the MUSE-DEEP survey with high-resolution HST imaging to study the structure, kinematics, and stellar populations of these galaxies. We measure spatially resolved stellar kinematics and use the specific angular momentum proxy, $\\lambda_R$, to classify galaxies into fast and slow rotators. We find a slow rotator fraction consistent with local Universe samples, suggesting little evolution in the massive ETG population since $z \\sim 1$. The kinematic and photometric axes of fast rotators are generally well-aligned, similar to their local counterparts. We find that global stellar population properties, such as age, metallicity, and mass-to-light ratio ($M_*/L$), correlate strongly with the central velocity dispersion ($\\sigma_\\mathrm{e}$), following trends established for local ETGs. Slow rotators are typically more massive, have higher $\\sigma_\\mathrm{e}$, and are more metal-rich than fast rotators. Our findings indicate that the fundamental structural, kinematic, and stellar population scaling relations of massive ETGs were already in place by $z \\sim 0.75$, suggesting their evolutionary pathways have remained stable over the last $\\sim 7$ Gyr.",
      "pdf_url": "https://arxiv.org/pdf/2510.23863.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23888",
      "title": "MAGNUS II: Rotational support of massive early-type galaxies decreased over the past 7 billion years",
      "authors": [
        "Pritom Mozumdar",
        "Michele Cappellari",
        "Christopher D. Fassnacht",
        "Tommaso Treu"
      ],
      "abstract": "MAGNUS II: Rotational support of massive early-type galaxies decreased over the past 7 billion years Pritom Mozumdar, Michele Cappellari, Christopher D. Fassnacht, Tommaso Treu Astrophysics of Galaxies (astro-ph.GA) Understanding how the internal kinematics of massive galaxies evolve is key to constraining the physical processes that drive their assembly. We investigate the evolution of rotational support in massive ($\\log M_{\\ast}/M_{\\odot} \\geq 10.6$) early-type galaxies (ETGs) over the past $\\sim$7 Gyr. We use MUSE integral-field spectroscopic (IFS) data for 212 ETGs at intermediate redshift ($0.25 < z < 0.75$) from the MAGNUS sample. We compare their kinematics to a carefully matched local sample of 787 ETGs ($z \\leq 0.05$) from the MaNGA survey. Using the specific stellar angular momentum proxy, $\\lambda_R$, we quantify the balance between ordered rotation and random motions. We derive intrinsic $\\lambda_R$ values by applying a uniform correction for seeing and point-spread function (PSF) effects to both samples. We find a significant evolutionary trend: the intermediate-redshift ETGs are systematically more rotationally supported than their local counterparts. The median PSF-corrected $\\lambda_R$ for the MAGNUS sample is $0.48 \\pm 0.05$, substantially higher than the median of $0.34 \\pm 0.03$ for the matched MaNGA sample. This corresponds to a positive slope in the $\\lambda_R-z$ relation of $\\mathrm{d} \\lambda_R / \\mathrm{d} z = 0.3 \\pm 0.04$ for the combined sample. The decline in rotational support is most pronounced for the most massive galaxies ($\\log M_{\\ast}/M_{\\odot} > 11.3$). Our results provide robust evidence that massive ETGs have undergone significant kinematic evolution, losing angular momentum as they evolve towards the present day, consistent with theoretical models where processes such as dry mergers play a crucial role in shaping the dynamical state of galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.23888.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24015",
      "title": "Tracing Cloud Formation and Evolution Through 3D Magnetic Field Mapping",
      "authors": [
        "Mehrnoosh Tahani",
        "Laura Fissel",
        "Enrique Lopez Rodriguez",
        "Kate Pattle"
      ],
      "abstract": "Tracing Cloud Formation and Evolution Through 3D Magnetic Field Mapping Mehrnoosh Tahani, Laura Fissel, Enrique Lopez Rodriguez, Kate Pattle 6 pages, 2 Figures, GO PRIMA Submission Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We propose to use the unprecedented polarization sensitivity of PRIMA's PRIMAger Polarization Imager and its high resolution in Band 1 (92 $\\mu$m) to map magnetic fields across two contrasting molecular cloud environments: the well-studied Perseus cloud and the isolated Musca filament. This comparative study will leverage the existing VLA radio observations that provide line-of-sight magnetic field component of the Perseus cloud, along with upcoming POSSUM survey results for Musca, to construct the first detailed 3D magnetic field vector maps at sub-parsec resolution. Perseus, with its known formation history through interstellar structure (e.g., bubble) interactions, will reveal how magnetic fields evolve during active star formation phases, while Musca, an isolated filament with lower star-formation activity, will show magnetic field morphology in early evolutionary stages. With PRIMA's resolution of 0.01 pc for Perseus and $<0.01$ pc for Musca, we will resolve magnetic field structures at scales necessary for understanding cloud fragmentation and star formation efficiency, and the roles that magnetic fields play in these processes. Our survey will require approximately 1438 hours to cover 42 deg$^2$ of Perseus and 12 deg$^2$ of Musca. With this, we aim to provide the first comprehensive view of how environment and evolutionary state may influence magnetic field evolution in molecular clouds and how magnetic fields influence cloud formation, fragmentation, and star formation.",
      "pdf_url": "https://arxiv.org/pdf/2510.24015.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24065",
      "title": "How External Medium outside Prestellar Cores Affects Protostellar Growth: Variations in Accretion Rate and Evolution of Disks and Outflows",
      "authors": [
        "Shingo Nozaki",
        "Masahiro N. Machida"
      ],
      "abstract": "How External Medium outside Prestellar Cores Affects Protostellar Growth: Variations in Accretion Rate and Evolution of Disks and Outflows Shingo Nozaki, Masahiro N. Machida Accepted for publication in ApJ. 18 pages, 10 figures Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We investigate how the external medium surrounding prestellar cores affects the star formation process by conducting three-dimensional resistive magnetohydrodynamic simulations. The initial cores follow critical Bonnor-Ebert profiles and are embedded in environments with different ambient densities. The simulations follow the evolution at least until the envelope mass within a radius equal to twice the critical Bonnor-Ebert radius drops to 35% of the initial cloud mass. We reveal that in environments with higher external density, enhanced mass inflow from the envelope leads to Bondi-like accretion as the protostellar mass increases. The continued inflow substantially increases the final stellar mass, resulting in star formation efficiencies that appear to exceed unity in dense environments. The external medium also influences the evolution of circumstellar disks and protostellar outflows: with the high-density external medium, disks grow rapidly but their mass becomes smaller relative to the protostellar mass, and the outflow is sustained over a long duration. However, the ratio of angular momentum removed by outflows and magnetic braking to that introduced by inflowing gas decreases with increasing external density. These results suggest that the density of the external medium regulates not only protostellar mass growth but also the inflow-outflow balance and angular momentum transport in magnetized, rotating star-forming cores.",
      "pdf_url": "https://arxiv.org/pdf/2510.24065.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24159",
      "title": "Self-supervised Synthetic Pretraining for Inference of Stellar Mass Embedded in Dense Gas",
      "authors": [
        "Keiya Hirashima",
        "Shingo Nozaki",
        "Naoto Harada"
      ],
      "abstract": "Self-supervised Synthetic Pretraining for Inference of Stellar Mass Embedded in Dense Gas Keiya Hirashima, Shingo Nozaki, Naoto Harada 6 pages, 3 figures, 1 table, accepted for NeurIPS 2025 ML4PS workshop Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI); Machine Learning (cs.LG) Stellar mass is a fundamental quantity that determines the properties and evolution of stars. However, estimating stellar masses in star-forming regions is challenging because young stars are obscured by dense gas and the regions are highly inhomogeneous, making spherical dynamical estimates unreliable. Supervised machine learning could link such complex structures to stellar mass, but it requires large, high-quality labeled datasets from high-resolution magneto-hydrodynamical (MHD) simulations, which are computationally expensive. We address this by pretraining a vision transformer on one million synthetic fractal images using the self-supervised framework DINOv2, and then applying the frozen model to limited high-resolution MHD simulations. Our results demonstrate that synthetic pretraining improves frozen-feature regression stellar mass predictions, with the pretrained model performing slightly better than a supervised model trained on the same limited simulations. Principal component analysis of the extracted features further reveals semantically meaningful structures, suggesting that the model enables unsupervised segmentation of star-forming regions without the need for labeled data or fine-tuning.",
      "pdf_url": "https://arxiv.org/pdf/2510.24159.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24340",
      "title": "On the Dusty Proximate Damped Lyman-$α$ System towards Q2310-3358 at $z=2.40$",
      "authors": [
        "S. Han , J.-K. Krogager , C. Ledoux , G. Ma , K. E. Heintz , S. J. Geier , L. Christensen , P. Møller , J. P. U. Fynbo Cosmic DAWN Center, Niels Bohr Institute, University of Copenhagen, French-Chilean Laboratory for Astronomy, Centre de Recherche Astrophysique de Lyon, Université de Lyon 1, European Southern Observatory, Instituto de Astrofísica de Canarias, Gran Telescopio Canaias )"
      ],
      "abstract": "On the Dusty Proximate Damped Lyman-$α$ System towards Q2310-3358 at $z=2.40$ S. Han (1 and 2), J.-K. Krogager (3 and 4), C. Ledoux (5), G. Ma (1 and 2), K. E. Heintz (1 and 2), S. J. Geier (6 and 7), L. Christensen (1 and 2), P. Møller (1), J. P. U. Fynbo (1 and 2) ((1) Cosmic DAWN Center, (2) Niels Bohr Institute, University of Copenhagen, (3) French-Chilean Laboratory for Astronomy, (4) Centre de Recherche Astrophysique de Lyon, Université de Lyon 1, (5) European Southern Observatory, (6) Instituto de Astrofísica de Canarias, (7) Gran Telescopio Canaias (GRANTECAN)) 8 pages, 8 figures, 2 this http URL version corresponds to the manuscript submitted to A&A on Oct 28, 2025 Astrophysics of Galaxies (astro-ph.GA) Quasar absorption systems not only affect the way quasars are selected, but also serve as key probes of galaxies, providing insight into their chemical evolution and interstellar medium (ISM). Recently, a method based on Gaia astrometric measurements has aided the selection of quasars reddened by dust hitherto overlooked. We conducted a spectroscopic study using VLT/X-Shooter on one such dust-reddened quasar, Q2310-3358. This quasar, at $z = 2.3908\\pm0.0003$, is associated with a Damped Lyman-alpha absorber (DLA) at nearly the same redshift $2.4007\\pm0.0003$, with a neutral hydrogen column density of $\\log N(\\mathrm{H\\,I}) = 21.214 \\pm 0.003$. The DLA is very metal-rich (close to the Solar metallicity after correction for depletion on dust grains). Its properties align with the metal-to-dust ratio and the mass-metallicity relation established in previous large samples of DLAs. Surprisingly, given its proximity to the quasar in redshift, the absorber has strong cold gas characteristics, including CI and H$_2$. Based on the derived kinetic temperature of $71^{+28}_{-15}$~K, we infer the presence of a strong UV radiation field, which in turn suggests that the quasar and the DLA are in close proximity, i.e. part of the same galaxy and not just different objects in the same overdensity of galaxies. We use the line ratios of the CI fine-structure lines to constrain the density of the cold gas, yielding $n_{\\rm H} \\sim 10^{3}~\\mathrm{cm}^{-3}$. Our analysis extends the understanding of $z_{abs} \\approx z_{em}$ absorption line systems and provides valuable constraints on the interplay between dust, metals, and neutral gas in the ISM of early galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.24340.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24346",
      "title": "Detailed Abundance Determination of Metal-Poor Stars with X-Shooter I. Unusual Chemistry in Halo Stars",
      "authors": [
        "B. D. C. Lowe",
        "T. Nordlander",
        "L. Casagrande",
        "G. Da Costa",
        "N. Christlieb",
        "S. E. Aquilina",
        "T. Rozanski",
        "G. Cordoni"
      ],
      "abstract": "Detailed Abundance Determination of Metal-Poor Stars with X-Shooter I. Unusual Chemistry in Halo Stars B. D. C. Lowe, T. Nordlander, L. Casagrande, G. Da Costa, N. Christlieb, S. E. Aquilina, T. Rozanski, G. Cordoni 21 pages, 15 figures, 8 tables, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present a detailed chemical analysis study of 16 candidate metal-poor stars, previously identified with 2dF+AAOmega, using X-Shooter spectra and the Korg 1D LTE spectral synthesis code. We generally confirm the earlier metallicity estimates and reveal four EMP ([Fe/H] $< -3$) stars in the current sample. Two of these stars, including the most metal-poor at [Fe/H] = $-3.83 \\pm 0.07$, are kinematically associated with the GSE accretion event, increasing the number of known GSE stars with [Fe/H] $< -3.5$ to eight. From the X-Shooter spectra we also determine abundances for 16 elements, with the element-to-iron abundance ratios generally consistent with high-resolution studies of Galactic halo stars. Within the sample, we identify three peculiar stars: the first is a GSE nitrogen enhanced metal poor (NEMP; [N/Fe] $= 1.62 \\pm 0.10$ and [C/Fe] $= 0.27 \\pm 0.08$) star with unusually high Na ([Na/Fe] $= 2.28 \\pm 0.07$) and Li (A(Li)$_{\\rm 3DNLTE} = 1.90 \\pm 0.08$) abundances, but which lacks any enhancement in [Al/Fe] or [Mg/Fe]. The second is a halo r-II star significantly enhanced in Sr ([Sr/Ba] $= 0.37 \\pm 0.08$), suggesting mixture of r-process and s-process enrichment, uncommon for r-II stars. Whilst the third is a halo star very depleted in N ([N/Fe] $< -1.13$), with low C ([C/Fe] $= -0.36 \\pm 0.08$) and otherwise 'normal' [X/Fe] abundances, suggesting enrichment with Type II supernova that proceeds enrichment from massive AGB stars. This study reveals the substantial degree of chemical diversity in the stellar populations which assembled the early Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2510.24346.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24355",
      "title": "A possible trigger of the multiple population phenomenon in star clusters",
      "authors": [
        "Andrés E. Piatti"
      ],
      "abstract": "A possible trigger of the multiple population phenomenon in star clusters Andrés E. Piatti 7 pages, 2 figures. Accepted for publication in MNRAS Letters Astrophysics of Galaxies (astro-ph.GA) Multiple populations (MPs) is a intra-star cluster phenomenon consisting in star-to- star variation of the abundance of some light chemical elements. They have been observed in many star clusters, most of them old globular clusters, populating the Milky Way and other satellite galaxies. Since the study of MPs became more system- atic, different astrophysical parameters have been claimed to be the main responsible for its occurrence. However, at the present time, no attempt would seem to have solved this conundrum. This work deals with a potential trigger of the MPs phenomenon, based on the gathered observational evidence of the existence of MPs in some star clusters and the absence of its in others. We found that star clusters with MPs mostly formed during time intervals of intense star formation activity in a galaxy, for instance during the galaxy formation epoch, a close galaxy encounter, etc. At those time inter- vals where relative peaks in the galaxy star formation rate occur, star clusters with masses above a lower mass limit harbour MPs. This lower star cluster mass limit would marginally depend on the star cluster age.",
      "pdf_url": "https://arxiv.org/pdf/2510.24355.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24357",
      "title": "Spatial-Kinematic Absorption Models of the Circumgalactic Medium. I. Structures, Orientations, and Kinematics",
      "authors": [
        "Christopher W. Churchill"
      ],
      "abstract": "Spatial-Kinematic Absorption Models of the Circumgalactic Medium. I. Structures, Orientations, and Kinematics Christopher W. Churchill (New Mexico State University) 29 pages, 22 figures, submitted to the Open Journal of Astrophysics (OJA) Astrophysics of Galaxies (astro-ph.GA) In this two-paper series, we present a straightforward mathematical model for synthesizing quasar absorption line profiles from sight lines through idealized, spatial-kinematic models of the circumgalactic medium (CGM) and their host galaxies. Here, in Paper I, we develop the spatial geometries of multiple galaxy/CGM structures and populate these structures with 3D velocity fields. For arbitrary viewing angles and galaxy-quasar impact parameters, we derive observer coordinate-based expressions for the perceived azimuthal angle and galaxy inclination and a generalized scalar expression for the line-of-sight velocity as a function of position along the line of sight. We motivate and develop four idealized galaxy/CGM spatial-kinematic structures based on empirical data and theoretical predictions: (1) a rotating galactic disk/extra-planar gas, (2) a static or dynamic spherical halo, (3) an outflowing bi-polar galactic wind, and (4) an inward spiraling flared planar accretion. Using a small set of free parameters, the spatial geometries and velocity fields can be adjusted and explored, including velocity gradients, wind stalling, and accretion trajectories. These spatial-kinematic models are designed to be flexible and easily modified and can be tailored for studying individual galaxy-absorber pairs or galaxy group environments; they can be applied to real-world observations or hydrodynamic simulations of the baryon cycle as studied through quasar absorption line systems. These models also serve as tools for developing physical intuition. In Paper II, we will present the formalism for populating the galaxy/CGM structures with multiphase photoionized and collisionally ionized gas and for generating absorption profiles for ions of interest.",
      "pdf_url": "https://arxiv.org/pdf/2510.24357.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24377",
      "title": "Half-Light Radius Measurements of Andromeda Dwarf Satellites from the Isaac Newton Telescope Survey Using Exponential, Plummer, and Sérsic Fits",
      "authors": [
        "Hedieh Abdollahi"
      ],
      "abstract": "Half-Light Radius Measurements of Andromeda Dwarf Satellites from the Isaac Newton Telescope Survey Using Exponential, Plummer, and Sérsic Fits Hedieh Abdollahi Astrophysics of Galaxies (astro-ph.GA) We present half-light radius measurements for the dwarf satellites of Andromeda, based on multi-epoch imaging from the Isaac Newton Telescope (INT) Monitoring Survey of Local Group dwarf galaxies. This analysis is conducted within a larger study to identify long-period variable (LPV) stars in these galaxies. The survey was performed with the Wide Field Camera on the 2.5-m INT and covers multiple epochs obtained between 2015 and 2018 in the i (Sloan) and V (Harris) bands. To determine the half-light radii, we derived surface brightness and number density profiles for each system and fitted them with Exponential, Plummer, and Sérsic models. The resulting half-light radii are in good agreement with literature values but reveal subtle variations linked to differences in stellar distribution and morphology. Distances were independently estimated using the Tip of the Red Giant Branch (TRGB) method, yielding values consistent with previous determinations. The complete photometric and variability catalogs will be made publicly available through CDS/VizieR, providing a valuable resource and foundation for future studies of the structure, stellar populations, and evolution of Andromeda's dwarf companions.",
      "pdf_url": "https://arxiv.org/pdf/2510.24377.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24382",
      "title": "Kinematic, Elemental and Structural Dependences on Metallicity in the Galactic Bulge",
      "authors": [
        "Haoyang Liu",
        "Cuihua Du",
        "Zhongcheng Li",
        "Jian Zhang",
        "Mingji Deng"
      ],
      "abstract": "Kinematic, Elemental and Structural Dependences on Metallicity in the Galactic Bulge Haoyang Liu, Cuihua Du, Zhongcheng Li, Jian Zhang, Mingji Deng 12 pages, 10 figures, accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) We selected Bulge stars from APOGEE DR17 cross-matched with astrometric data from \\textit{Gaia} DR3. Bulge stars were divided into sub-samples with line-of-sight velocity dispersion analyzed and the peaks of MDF were detected by both Gaussian Mixture Models (GMM) and \\texttt{this http URL\\_peaks}. GMM is also conducted to kinematically distinguish the metal-poor and metal-rich populations. Analyses were put on the Bulge stars (including retrograde stars), their elemental abundances, and the [Mg/Mn]-[Al/Fe] plane to investigate potential accreted components. Finally, the shapes (X-shaped/boxy) of Bulge stars with different metallicities were analyzed through least-squares fitting based on the analytical Bulge models. By studying the kinematic, elemental and structural dependences on metallicity for Bulge stars, our findings are concluded as follows: 1. Six peaks are detected in the Bulge MDF, encompassing values reported in previous studies, suggesting a complex composition of Bulge populations. 2. An inversion relationship is well-observed in metal-rich sub-samples, while absent in metal-poor sub-samples. 3. Metal-poor populations exhibit larger dispersions than metal-rich stars (which is also revealed by GMM decomposition), suggesting that metal-rich stars are kinematically coherent. 4. Retrograde stars are confined to $\\sim1$ kpc of the Galactic center, with their relative fraction decreasing at higher [Fe/H] -- a trend potentially linked to the ``spin-up'' process of Galactic disks. 5. Metal-rich Bulge stars with [Al/Fe] $<-0.15$ are likely associated with from disk accreted substructure, while all elemental planes exhibit bimodality but Na abundances rise monotonically with metallicity. 6. In general, stars with all metallicities support a boxy profile.",
      "pdf_url": "https://arxiv.org/pdf/2510.24382.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24477",
      "title": "Planetary nebulae as tracers of accreted stellar populations in massive galaxies in groups and clusters",
      "authors": [
        "Johanna Hartke"
      ],
      "abstract": "Planetary nebulae as tracers of accreted stellar populations in massive galaxies in groups and clusters Johanna Hartke 12 pages, accepted for publication in Frontiers in Astronomy and Space Sciences (Research Topic collection 'Connecting Planetary Nebulae with Their Host Galaxy Stellar Population Properties') Astrophysics of Galaxies (astro-ph.GA) Planetary nebulae (PNe) are valuable spatial and kinematic tracers of nearby galaxies. In this mini-review, I focus on their role in tracing the halo and intra-cluster/intra-group light assembly in groups and clusters of galaxies within 100~Mpc and, in particular, the link between characteristic PN metrics such as the $\\alpha$-parameter and the PN luminosity function and changes from the underlying in-situ to ex-situ stellar populations. These results from nearby groups and clusters are placed into context with integral-field spectroscopic surveys of galaxies, which allow the co-spatial measurement of PN and stellar population properties. I provide an outlook on upcoming instrumentation that will provide new opportunities for the study of extragalactic PN populations. I address the challenges of reconciling observations of extragalactic PN populations with predictions from stellar evolution models and how revised late-stellar-evolution models have alleviated some of the tensions between observations and theory.",
      "pdf_url": "https://arxiv.org/pdf/2510.24477.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24573",
      "title": "JWST observations of photodissociation regions III. Dust modelling at the illuminated edge of the Horsehead PDR",
      "authors": [
        "M. Elyajouri",
        "A. Abergel",
        "N. Ysard",
        "E. Habart",
        "T. Schirmer",
        "A. Jones",
        "M. Juvela",
        "B. Tabone",
        "L. Verstraete",
        "K. Misselt",
        "K. D. Gordon",
        "A. Noriega-Crespo",
        "P. Guillard",
        "A. N. Witt",
        "M. Baes",
        "P. Bouchet",
        "B. R. Brandl",
        "O. Kannavou",
        "P. Dellova",
        "P. Klassen",
        "B. Trahin",
        "D. Van De Putte"
      ],
      "abstract": "JWST observations of photodissociation regions III. Dust modelling at the illuminated edge of the Horsehead PDR M. Elyajouri, A. Abergel, N. Ysard, E. Habart, T. Schirmer, A. Jones, M. Juvela, B. Tabone, L. Verstraete, K. Misselt, K. D. Gordon, A. Noriega-Crespo, P. Guillard, A. N. Witt, M. Baes, P. Bouchet, B. R. Brandl, O. Kannavou, P. Dellova, P. Klassen, B. Trahin, D. Van De Putte Astrophysics of Galaxies (astro-ph.GA) Carbonaceous nano-grains are a significant component of interstellar dust and dominate the mid-infrared emission of photodissociation regions (PDRs). We study the evolution of nano-grains across the illuminated edge of the Horsehead PDR, especially their abundance and size properties. This work is part of the Physics and Chemistry of PDR Fronts program studying dust and gas in PDRs with JWST. We use NIRCam+MIRI photometric bands and NIRSpec+MRS spectroscopy to map the illuminated edge. We model dust emission using the THEMIS dust model with the SOC radiative transfer code. Detailed modeling of high angular resolution JWST data allows us to obtain constraints on nano-grain properties. We find that diffuse ISM dust cannot account for the observed data, requiring evolved grains. A sharp density increase is observed at the illuminated edge, consistent with ALMA observations revealing a sharp transition between molecular and ionized gas. Although the PDR length could not be directly determined, we estimate an upper limit of approximately 0.015 pc. This implies a lower limit on small grain abundance (greater than 0.003), showing small grains are not depleted at the Horsehead edge, unlike in the Orion Bar. Our findings indicate a high-density environment and less steep size distribution for nano-grains at the illuminated edge versus the diffuse ISM. This implies nano-grain destruction mechanisms might be less efficient in the Horsehead's moderate-UV field than in more intense PDRs. These results support a model where nano-grain population recovery is slower in moderate-UV environments, leading to a unique dust size distribution at the edge of the Horsehead Nebula.",
      "pdf_url": "https://arxiv.org/pdf/2510.24573.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23653",
      "title": "Implications for the formation of Oort cloud-like structures and interstellar comets in dense environments",
      "authors": [
        "Santiago Torres"
      ],
      "abstract": "Implications for the formation of Oort cloud-like structures and interstellar comets in dense environments Santiago Torres 19 pages, 15 figures. Under review at A&A Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Most stars form in dense stellar environments, where frequent close encounters can strongly perturb and reshape the early architecture of planetary systems. The solar system, with its rich population of distant comets, provides a natural laboratory to study these processes. We perform detailed numerical simulations using the LonelyPlanets framework that combines NBODY6++GPU and REBOUND, to explore the evolution of debris disks around solar system analogues embedded in stellar clusters. Two initial configurations are considered, an $Extended$ and a $Compact$ model, each containing four giant planets and either an extended or compact debris disk. We find that compact disks primarily form Kuiper belt and scattered disk-like populations through planet-disk interactions, while extended disks are more strongly shaped by stellar encounters, producing Oort cloud-like structures and interstellar comets with ejection velocities of 1-3 km/s. Stellar perturbations are most effective for encounter inclinations between $0^{\\circ}$ and $30^{\\circ}$, giving rise to distinct dynamical populations, like Sednoids, and inner Oort cloud analogues, and a characteristic tail in semi-major axis-eccentricity space. In coplanar encounters, the disk remains largely flattened, whereas polar flybys redistribute angular momentum vertically, producing nearly isotropic outer populations that resemble an emerging Oort cloud. Our results suggest that cometary reservoirs and interstellar objects are natural byproducts of planet-disk interactions and stellar flybys in dense clusters, linking the architecture of outer planetary systems to their birth environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.23653.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23708",
      "title": "Twinkle Twinkle Little Star, Roman Sees Where You Are: Predicting Exoplanet Transit Yields in the Rosette Nebula with the Nancy Grace Roman Space Telescope",
      "authors": [
        "Ritvik Sai Narayan",
        "Melinda Soares-Furtado",
        "Mary Anne Limbach",
        "Nishanth Ramanujam",
        "Andrew Vanderburg",
        "Johanna M. Vos"
      ],
      "abstract": "Twinkle Twinkle Little Star, Roman Sees Where You Are: Predicting Exoplanet Transit Yields in the Rosette Nebula with the Nancy Grace Roman Space Telescope Ritvik Sai Narayan, Melinda Soares-Furtado, Mary Anne Limbach, Nishanth Ramanujam, Andrew Vanderburg, Johanna M. Vos 24 pages, 8 figures, 4 tables, submitted to the Astronomical Journal Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Young stars host only a small fraction of the known exoplanet population because their photometric variability, magnetic activity, and frequent placement in dense, poorly-resolved regions hamper exoplanet detections. Yet, measuring planets at these ages is crucial since these phases are when dynamical processes that drive planetary migration are most active. We assess the expected yield of a hypothetical Nancy Grace Roman Space Telescope transit survey of the Rosette Nebula, a $\\sim10\\,\\mathrm{Myr}$ star-forming region with a dense and diverse stellar population. Using the Roman Exposure Time Calculator to quantify sensitivity to Rosette members, we establish detection thresholds for companions and evaluate yields via Monte Carlo injection-recovery simulations. We predict the detection of $33 \\pm 9$ young transiting exoplanets orbiting stellar hosts in a month-long survey, and $29 \\pm 8$ in a two-week survey. The extended baseline primarily improves sensitivity to longer-period planets orbiting FGK stars, while most M dwarf detections are well-sampled within two weeks. Irrespective of the temporal baseline, transit detections are dominated by of 1-2\\,$R_\\oplus$ super-Earths and sub-Neptunes with $P\\lesssim8$\\,days. Such a sample would substantially expand the census of only three detected planets younger than $20\\,\\mathrm{Myr}$, probing an age regime in which planetary radii remain inflated, the stability of close-in orbits is uncertain, and planetary migration may still be ongoing. This survey offers a path to constrain early planetary evolution and establish prime follow-up targets for the James Webb Space Telescope, Vera Rubin Observatory, and the Habitable Worlds Observatory.",
      "pdf_url": "https://arxiv.org/pdf/2510.23708.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24087",
      "title": "CSST Slitless Spectra: Target Detection and Classification with YOLO",
      "authors": [
        "Yingying Zhou",
        "Chao Liu",
        "Hao Tian",
        "Xin Zhang",
        "Nan Li"
      ],
      "abstract": "CSST Slitless Spectra: Target Detection and Classification with YOLO Yingying Zhou, Chao Liu, Hao Tian, Xin Zhang, Nan Li 30 pages, 12+6 figures. For high-resolution figures, please see the published version The Astronomical Journal, 170(5):256 (2025) Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) Addressing the spatial uncertainty and spectral blending challenges in CSST slitless spectroscopy, we present a deep learning-driven, end-to-end framework based on the You Only Look Once (YOLO) models. This approach directly detects, classifies, and analyzes spectral traces from raw 2D images, bypassing traditional, error-accumulating pipelines. YOLOv5 effectively detects both compact zero-order and extended first-order traces even in highly crowded fields. Building on this, YOLO11 integrates source classification (star/galaxy) and discrete astrophysical parameter estimation (e.g., redshift bins), showcasing complete spectral trace analysis without other manual preprocessing. Our framework processes large images rapidly, learning spectral-spatial features holistically to minimize errors. We achieve high trace detection precision (YOLOv5) and demonstrate successful quasar identification and binned redshift estimation (YOLO11). This study establishes machine learning as a paradigm shift in slitless spectroscopy, unifying detection, classification, and preliminary parameter estimation in a scalable system. Future research will concentrate on direct, continuous prediction of astrophysical parameters from raw spectral traces.",
      "pdf_url": "https://arxiv.org/pdf/2510.24087.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24269",
      "title": "What is the nature of late infall streamers?",
      "authors": [
        "L.-A. Hühn",
        "C. P. Dullemond"
      ],
      "abstract": "What is the nature of late infall streamers? L.-A. Hühn, C. P. Dullemond 12 pages, 11 figures. Submitted to Astronomy & Astrophysics (referee stage: minor revisions) Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) Growing observational evidence suggests that Class II protoplanetary disks may undergo substantial interactions with their environment in the form of late infall. This mass inflow predominantly manifests itself in the form of so-called streamers: filaments and arcs of gas connecting large-scale, extended gas structures to disk scales. Prevalent late infall has far-reaching consequences for planet formation theory, challenging the long-standing treatment of evolved disks in isolation. In this work, we investigate the emergence of late-infall streamers in different formation scenarios, their morphology and multiplicity, as well as their dependence on environmental conditions. We conduct this investigation by performing 3D hydrodynamical simulation using the grid-based code FARGO3D, which we post-process to obtain synthetic observations using the Monte Carlo radiative transfer code RADMC3D. We find that, while a late infall event in the form of a single encounter with a \"cloudlet\" of gas can produce a streamer via an interplay between the fall-back of bound material and shocks, such features dissipate quickly, on a timescale of ~10 kyr. Furthermore, we find that streamers can also form naturally in a turbulent, dense environment without the need for such encounters, which could act to reconcile short-lived streamers with ubiquitous detection of these structures. Here, we find multiple co-existing streamers for a disk velocity relative to the interstellar medium of $v_\\mathrm{sys}=0.5~\\mathrm{km}~\\mathrm{s}^{-1}$ and a turbulent velocity dispersion of $\\sigma_\\mathrm{turb}=0.5~\\mathrm{km}~\\mathrm{s}^{-1}$. We find considerable dependence of the streamer morphology on the environment, which may act as a utility to constrain the physical conditions of the gas surrounding planet-forming disk, and therefore the conditions under which planets form.",
      "pdf_url": "https://arxiv.org/pdf/2510.24269.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.13082",
      "title": "BlackTHUNDER -- A non-stellar Balmer break in a black hole-dominated little red dot at $z=7.04$",
      "authors": [
        "Xihan Ji",
        "Roberto Maiolino",
        "Hannah Übler",
        "Jan Scholtz",
        "Francesco D'Eugenio",
        "Fengwu Sun",
        "Michele Perna",
        "Hannah Turner",
        "Stefano Carniani",
        "Santiago Arribas",
        "Jake S. Bennett",
        "Andrew Bunker",
        "Stéphane Charlot",
        "Giovanni Cresci",
        "Mirko Curti",
        "Eiichi Egami",
        "Andy Fabian",
        "Kohei Inayoshi",
        "Yuki Isobe",
        "Gareth Jones",
        "Ignas Juodžbalis",
        "Nimisha Kumari",
        "Jianwei Lyu",
        "Giovanni Mazzolari",
        "Eleonora Parlanti",
        "Brant Robertson",
        "Bruno Rodríguez Del Pino",
        "Raffaella Schneider",
        "Debora Sijacki",
        "Sandro Tacchella",
        "Alessandro Trinca",
        "Rosa Valiante",
        "Giacomo Venturi",
        "Marta Volonteri",
        "Chris Willott",
        "Callum Witten",
        "Joris Witstok"
      ],
      "abstract": "BlackTHUNDER -- A non-stellar Balmer break in a black hole-dominated little red dot at $z=7.04$ Xihan Ji, Roberto Maiolino, Hannah Übler, Jan Scholtz, Francesco D'Eugenio, Fengwu Sun, Michele Perna, Hannah Turner, Stefano Carniani, Santiago Arribas, Jake S. Bennett, Andrew Bunker, Stéphane Charlot, Giovanni Cresci, Mirko Curti, Eiichi Egami, Andy Fabian, Kohei Inayoshi, Yuki Isobe, Gareth Jones, Ignas Juodžbalis, Nimisha Kumari, Jianwei Lyu, Giovanni Mazzolari, Eleonora Parlanti, Brant Robertson, Bruno Rodríguez Del Pino, Raffaella Schneider, Debora Sijacki, Sandro Tacchella, Alessandro Trinca, Rosa Valiante, Giacomo Venturi, Marta Volonteri, Chris Willott, Callum Witten, Joris Witstok 36 pages, 24 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Recent observations from JWST have revealed an abundant population of active galactic nuclei (AGN) and so-called ``Little Red Dots'' (LRDs) at $2\\lesssim z \\lesssim 11$, many of which are characterized by V-shaped UV-to-optical continua with turnovers around the Balmer limit. The physical nature of these LRDs is unclear, and it remains debated whether the peculiar spectral shape originates from AGN, compact galaxies, or both. We present the analysis of new NIRSpec-IFU data from the BlackTHUNDER JWST Large Programme and archival NIRSpec-MSA data of a lensed LRD at $z=7.04$. The spectra confirm the presence of a smooth Balmer break and a broad H$\\beta$ tracing the Broad Line Region (BLR) of an AGN. The small velocity dispersion of the H$\\beta$ narrow component indicates a small dynamical mass of the host galaxy of $M_{\\rm dyn}<4 \\times 10^8~M_{\\odot}$, which implies that the stellar population cannot contribute more than 10% to the optical continuum. We show that the Balmer break can be well described by an AGN continuum absorbed by very dense ($n_{\\rm H}\\sim 10^{10}~{\\rm cm^{-3}}$) and nearly dust-free gas along our line-of-sight (possibly gas in the BLR or its surrounding). The same gas is expected to produce H$\\beta$ absorption, at a level consistent with a tentative detection ($3\\sigma$) in the high-resolution spectrum. Such a non-stellar origin of the Balmer break may apply to other LRDs, and would alleviate the issue of extremely high stellar mass surface densities inferred in the case of a stellar interpretation of the Balmer break. We note that this is a rare case of a black hole that is overmassive relative to both the host galaxy stellar and dynamical masses. We finally report indications of variability and the first attempt of AGN reverberation mapping at such an early epoch.",
      "pdf_url": "https://arxiv.org/pdf/2501.13082.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07190",
      "title": "The Balmer Break and Optical Continuum of Little Red Dots from Super-Eddington Accretion",
      "authors": [
        "Hanpu Liu",
        "Yan-Fei Jiang",
        "Eliot Quataert",
        "Jenny E. Greene",
        "Yilun Ma"
      ],
      "abstract": "The Balmer Break and Optical Continuum of Little Red Dots from Super-Eddington Accretion Hanpu Liu, Yan-Fei Jiang, Eliot Quataert, Jenny E. Greene, Yilun Ma 23 pages, 12 figures, accepted for publication in ApJ. Comments welcome! Astrophysics of Galaxies (astro-ph.GA) The physical origin of Little Red Dots (LRDs)--compact extragalactic sources with red rest-optical continua and broad Balmer lines--remains elusive. The redness of LRDs is likely intrinsic, suggesting optically thick gas emitting at a characteristic effective temperature of $\\sim5000{\\rm~K}$. Meanwhile, many LRD spectra exhibit a Balmer break, often attributed to absorption by a dense gas shell surrounding an AGN. Using semi-analytical atmosphere models and radiation transport calculations, we show that a super-Eddington accretion system can give rise to a Balmer break and a red optical color simultaneously, without invoking external gas absorption for the break or dust reddening. The break originates from a discontinuity in opacity across the Balmer limit, similar to that of early-type stars, but the lower photosphere density of super-Eddington systems, $\\rho<10^{-9}{\\rm~g~cm^{-3}}$, implies a significant opacity contrast even at a cool photosphere temperature of $\\sim5000{\\rm~K}$. Furthermore, while accretion in the form of a standard thin disk requires fine tuning to match the optical color of LRDs, an alternative scenario of a geometrically thick, roughly spherical accretion flow implies an effective temperature $4000{\\rm~K}\\lesssim T_{\\rm eff}\\lesssim6000{\\rm~K}$ that is very insensitive to the accretion rate (analogous to the Hayashi line in stellar models). The continuum spectra from the latter scenario align with the Balmer break and optical color of currently known LRDs. We discuss predictions of our model and the prospects for more realistic spectra based on super-Eddington accretion simulations.",
      "pdf_url": "https://arxiv.org/pdf/2507.07190.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13719",
      "title": "The Stellar Morphology & Size of X-ray-selected Active Galactic Nuclei Host Galaxies Revealed by JWST",
      "authors": [
        "Bovornpratch Vijarnwannaluk",
        "Zhen-Kai Gao",
        "Wei-Hao Wang",
        "Chian-Chou Chen",
        "Abdurrahman Naufal",
        "Adarsh Ranjan",
        "Bau-Ching Hsieh",
        "Chayan Mondal",
        "Chayan Mondal",
        "Chih-Yuan Chang",
        "Hiddo S.B. Algera",
        "Li-Wen Liao",
        "Masayuki Akiyama",
        "Seong Jin Kim",
        "Shoichiro Mizukoshi",
        "Tomotsugo Goto",
        "Yu-Yen Chang",
        "Caitlin Casey",
        "Jeyhan S. Kartaltepe",
        "Hollis B. Akins",
        "Marko Shuntov",
        "Maximilien Franco",
        "Santosh Harish"
      ],
      "abstract": "The Stellar Morphology & Size of X-ray-selected Active Galactic Nuclei Host Galaxies Revealed by JWST Bovornpratch Vijarnwannaluk, Zhen-Kai Gao, Wei-Hao Wang, Chian-Chou Chen, Abdurrahman Naufal, Adarsh Ranjan, Bau-Ching Hsieh, Chayan Mondal, Chayan Mondal, Chih-Yuan Chang, Hiddo S.B. Algera, Li-Wen Liao, Masayuki Akiyama, Seong Jin Kim, Shoichiro Mizukoshi, Tomotsugo Goto, Yu-Yen Chang, Caitlin Casey, Jeyhan S. Kartaltepe, Hollis B. Akins, Marko Shuntov, Maximilien Franco, Santosh Harish Accepted to ApJ and in production stage. v2 contains corrections to references, grammar, and spelling. Scientific content is the same Astrophysics of Galaxies (astro-ph.GA) We investigate the stellar shape and size-mass relationship of X-ray selected Active Galactic Nuclei (AGN) host galaxies using the high-angular resolution and deep sensitivity in the near-infrared of the COSMOS-Web JWST survey field. We present the rest-frame 1-$\\mu m$ size, stellar mass, Sersic index, axis-ratio, Gini-$M_{20}$ parameters of 690 moderate luminosity AGNs between redshift 0-3 and with stellar mass $\\log M_s\\sim 10.75$. We find that AGN host galaxies have an effective radius of 1-5 kpc, which is between star-forming (SFG) and quiescent galaxies (QGs) of the same stellar mass. AGN hosts have similar size-mass trends as SFG and QGs, being smaller at higher redshift for the same stellar mass. The slope of the size-mass relationship of AGN host galaxies is steeper than that of star-forming galaxies. Their rest-frame 1$\\mu m$ stellar morphology indicates a significant spheroidal component. We observed a low merger fraction (6%) in our sample as well as substructures similar to disks, bars, and spiral arms in the residual images, which are in tension with evolutionary pathways that require major mergers. However, it may also be due to the different timescales between mergers and AGN activity.",
      "pdf_url": "https://arxiv.org/pdf/2510.13719.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19500",
      "title": "XRISM mock observations of simulated AGN jets in the core of a galaxy cluster",
      "authors": [
        "Mahiro Shirotori",
        "Yutaka Fujita"
      ],
      "abstract": "XRISM mock observations of simulated AGN jets in the core of a galaxy cluster Mahiro Shirotori, Yutaka Fujita Submitted to PASJ, 8 pages, 4 figures, 3 tables Astrophysics of Galaxies (astro-ph.GA) Jets from active galactic nuclei (AGNs) are expected to heat the surrounding intracluster medium (ICM). We investigate how the interaction between jets and the ICM appears in high-resolution X-ray observations using mock X-ray observations based on two-dimensional hydrodynamic simulations. We constructed a model of an active galactic nucleus (AGN) similar to Cygnus A (Cyg A), a powerful FR II radio galaxy. Our simulations model bipolar jets propagating into a stratified ICM, forming forward shocks and low-density cocoons. Based on these results, we generate synthetic spectra that incorporate both shocked and unshocked ICM components. Then, we perform mock observations using the XRISM/Resolve X-ray spectrometer. We focus particularly on viewing angle effects. Our mock observations revealed that the smallest line broadening, observed as velocity dispersion, associated with the cocoon's bulk expansion occurs when observing along the jet direction, where the expansion velocity is highest. Although this may appear counterintuitive, it occurs because the rapidly expanding jet head contributes little to X-ray emission due to its high temperature and low density. Our results highlight the importance of considering the temperature and density structure of AGN-driven shocks and cocoons when interpreting XRISM data. These findings lay the groundwork for XRISM's observations of AGN jets and will improve our understanding of AGN feedback processes in galaxy clusters.",
      "pdf_url": "https://arxiv.org/pdf/2510.19500.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20697",
      "title": "Observationally derived change in the star formation rate as mergers progress",
      "authors": [
        "W. J. Pearson",
        "L. Wang",
        "V. Rodriguez-Gomez",
        "B. Margalef-Bentabol",
        "L. E. Suelves"
      ],
      "abstract": "Observationally derived change in the star formation rate as mergers progress W. J. Pearson, L. Wang, V. Rodriguez-Gomez, B. Margalef-Bentabol, L. E. Suelves 18 pages, 14 figures, 2 tables, accepted for publication in A&A. Updated after language editor Astrophysics of Galaxies (astro-ph.GA) Galaxy mergers can change the rate at which stars are formed. We can trace when these changes occur in simulations of galaxy mergers. However, for observed galaxies we do not know how the star formation rate (SFR) evolves along the merger sequence as it is difficult to probe the time before or after coalescence. We aim to derive how SFR changes in observed mergers throughout the merger sequence, from a statistical perspective. Merger times were estimated for observed galaxy mergers in the Kilo Degree Survey (KiDS) using a convolutional neural network (CNN). The CNN was trained on mock KiDS images created using IllustrisTNG data. The SFRs were derived from spectral energy density fitting to KiDS and VIKINGs data. To determine the change in SFR for the merging galaxies, each merging galaxy was matched and compared to ten comparable non-merging galaxies; matching each galaxy in redshift, stellar mass, and local density. Mergers see an increase in the SFR for galaxies from 300~Myr before the merger until coalescence, continuing until at least 200~Myr after the merger event. After this, there is a possibility that SFR activity in the mergers begins to decrease, but we need more data to better constrain our merger times and SFRs to confirm this. We find that more galaxies with higher stellar mass (M$_{\\star}$) have greater SFR enhancement as they merge compared to lower-M$_{\\star}$ galaxies. There is no clear trend of changing SFR enhancement as local density changes, but the least dense environments have the least SFR enhancement. The increasing SFR enhancement is likely due to the closer proximity of galaxies and the presence of more close passes as the time before the merger approaches 0~Myr, with the SFR slowing 200~Myr after the merger event.",
      "pdf_url": "https://arxiv.org/pdf/2510.20697.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23776",
      "title": "Unsupervised learning for variability detection with Gaia DR3 photometry. The main sequence-white dwarf valley",
      "authors": [
        "P. Ranaivomanana",
        "C. Johnston",
        "G. Iorio",
        "P.J. Groot",
        "M. Uzundag",
        "T. Kupfer",
        "C. Aerts"
      ],
      "abstract": "Unsupervised learning for variability detection with Gaia DR3 photometry. The main sequence-white dwarf valley P. Ranaivomanana, C. Johnston, G. Iorio, P.J. Groot, M. Uzundag, T. Kupfer, C. Aerts Accepted for publication in Astronomy & Astrophysics (A&A); 10 pages, 9 figures, 1 appendix (7 additional figures, 2 tables) Solar and Stellar Astrophysics (astro-ph.SR) The unprecedented volume and quality of data from space- and ground-based telescopes present an opportunity for machine learning to identify new classes of variable stars and peculiar systems that may have been overlooked by traditional methods. Extending prior methodological work, this study investigates the potential of an unsupervised learning approach to scale effectively to larger stellar populations, including objects in crowded fields, and without the need for pre-selected catalogues, specifically focusing on 13 405 sources selected from Gaia DR3 and lying in the selected region of the CMD. Our methodology incorporates unsupervised clustering techniques based primarily on statistical features extracted from Gaia DR3 epoch photometry. We used the t-distributed stochastic neighbour embedding (t-SNE) algorithm to identify variability classes, their subtypes, and spurious variability induced by instrumental effects. The clustering results revealed distinct groups, including hot subdwarfs, cataclysmic variables (CVs), eclipsing binaries, and objects in crowded fields, such as those in the Andromeda (M31) field. Several potential stellar subtypes also emerged within these clusters. Notably, objects previously labelled as RR Lyrae were found in an unexpected region of the CMD, potentially due to either unreliable astrometric measurements (e.g., due to binarity) or alternative evolutionary pathways. This study emphasises the robustness of the proposed method in finding variable objects in a large region of the Gaia CMD, including variable hot subdwarfs and CVs, while demonstrating its efficiency in detecting variability in extended stellar populations. The proposed unsupervised learning framework demonstrates scalability to large datasets and yields promising results in identifying stellar subclasses.",
      "pdf_url": "https://arxiv.org/pdf/2510.23776.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23825",
      "title": "New Trends in Astrophysical Self-Organized Criticality",
      "authors": [
        "Markus J. Aschwanden"
      ],
      "abstract": "New Trends in Astrophysical Self-Organized Criticality Markus J. Aschwanden Solar and Stellar Astrophysics (astro-ph.SR) This review is focused on recent {\\sl Self-Organized Criticality (SOC)} literature of astrophysical phenomena, covering the last decade of (2015-2025), while previous SOC literature (1987-2014) is reviewed elsewhere. The selection of literature is mostly based on searches with the NASA-supported {\\sl Astrophysics Data System (ADS)}. The discussed astrophysical SOC phenomena are subdivided into solar flares, solar atmosphere (photosphere, chromosphere, corona), heliospheric systems (coronal mass ejections, solar wind, solar energetic particles), planetary systems (asteroids and small bodies, lunar cratering, Saturnian ring systems, magnetospheric systems), stellar flares, and galactic systems (pulsar glitches, gamma ray bursts, soft gamma-ray repeaters, supergiant fast X-ray transients, fast transient radio bursts, magnetars, blazars, black holes).",
      "pdf_url": "https://arxiv.org/pdf/2510.23825.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23933",
      "title": "Six binary brown dwarf candidates identified by microlensing",
      "authors": [
        "Cheongho Han",
        "Chung-Uk Lee",
        "Ian A. Bond",
        "Andrzej Udalski",
        "Michael D. Albrow",
        "Sun-Ju Chung",
        "Andrew Gould",
        "Youn Kil Jung",
        "Kyu-Ha Hwang",
        "Yoon-Hyun Ryu",
        "Yossi Shvartzvald",
        "In-Gu Shin",
        "Jennifer C. Yee",
        "Weicheng Zang",
        "Hongjing Yang",
        "Sang-Mok Cha",
        "Doeon Kim",
        "Dong-Jin Kim",
        "Seung-Lee Kim",
        "Dong-Joo Lee",
        "Yongseok Lee",
        "Byeong-Gon Park",
        "Richard W. Pogge",
        "Przemek Mróz",
        "Michał K. Szymański",
        "Jan Skowron",
        "Radosław Poleski",
        "Igor Soszyński",
        "Paweł Pietrukowicz",
        "Szymon Kozłowski",
        "Krzysztof A. Rybicki",
        "Patryk Iwanek",
        "Krzysztof Ulaczyk",
        "Marcin Wrona",
        "Mariusz Gromadzki",
        "Mateusz J. Mróz Michał Jaroszyński",
        "Marcin Kiraga",
        "Fumio Abe",
        "David P. Bennett",
        "Aparna Bhattacharya",
        "Akihiko Fukui",
        "Ryusei Hamada",
        "Stela Ishitani Silva",
        "Yuki Hirao",
        "Asahi Idei",
        "Shota Miyazaki",
        "Yasushi Muraki",
        "Tutumi Nagai",
        "Kansuke Nunota",
        "Greg Olmschenk",
        "Clément Ranc",
        "Nicholas J. Rattenbury",
        "Yuki Satoh",
        "Takahiro Sumi",
        "Daisuke Suzuki",
        "Takuto Tamaoki",
        "Sean K. Terry",
        "Paul J. Tristram",
        "Aikaterini Vandorou",
        "Hibiki Yama"
      ],
      "abstract": "Six binary brown dwarf candidates identified by microlensing Cheongho Han, Chung-Uk Lee, Ian A. Bond, Andrzej Udalski, Michael D. Albrow, Sun-Ju Chung, Andrew Gould, Youn Kil Jung, Kyu-Ha Hwang, Yoon-Hyun Ryu, Yossi Shvartzvald, In-Gu Shin, Jennifer C. Yee, Weicheng Zang, Hongjing Yang, Sang-Mok Cha, Doeon Kim, Dong-Jin Kim, Seung-Lee Kim, Dong-Joo Lee, Yongseok Lee, Byeong-Gon Park, Richard W. Pogge, Przemek Mróz, Michał K. Szymański, Jan Skowron, Radosław Poleski, Igor Soszyński, Paweł Pietrukowicz, Szymon Kozłowski, Krzysztof A. Rybicki, Patryk Iwanek, Krzysztof Ulaczyk, Marcin Wrona, Mariusz Gromadzki, Mateusz J. Mróz Michał Jaroszyński, Marcin Kiraga, Fumio Abe, David P. Bennett, Aparna Bhattacharya, Akihiko Fukui, Ryusei Hamada, Stela Ishitani Silva, Yuki Hirao, Asahi Idei, Shota Miyazaki, Yasushi Muraki, Tutumi Nagai, Kansuke Nunota, Greg Olmschenk, Clément Ranc, Nicholas J. Rattenbury, Yuki Satoh, Takahiro Sumi, Daisuke Suzuki, Takuto Tamaoki, Sean K. Terry, Paul J. Tristram, Aikaterini Vandorou, Hibiki Yama Solar and Stellar Astrophysics (astro-ph.SR) In this study, we analyze microlensing events from the 2023 and 2024 observing seasons to identify cases likely caused by binary systems composed of BDs. By applying criteria that the binary-lens events exhibit well-resolved caustics, short time scales ($t_{\\rm E} \\lesssim 9$ days), and have small angular Einstein radii ($\\theta_{\\rm E} \\lesssim 0.17$~mas), we identify six candidate binary BD events: MOA-2023-BLG-331, KMT-2023-BLG-2019, KMT-2024-BLG-1005, KMT-2024-BLG-1518, MOA-2024-BLG-181, and KMT-2024-BLG-2486. Analysis of these events leads to models that provide precise estimates for both lensing observables, $t_{\\rm E}$ and $\\theta_{\\rm E}$. We estimate the masses of the binary components through Bayesian analysis, utilizing the constraints from $t_{\\rm E}$ and $\\theta_{\\rm E}$. The results show that for the events KMT-2024-BLG-1005, KMT-2024-BLG-1518, MOA-2024-BLG-181, and KMT-2024-BLG-2486, the probability that both binary components lie within the BD mass range exceeds 50\\%, indicating a high likelihood that the lenses of these events are binary BDs. In contrast, for MOA-2023-BLG-331L and KMT-2023-BLG-2019L, the probabilities that the lower-mass components of the binary lenses lie within the BD mass range exceed 50\\%, while the probabilities for the heavier components are below 50\\%, suggesting that these systems are more likely to consist of a low-mass M dwarf and a BD. The brown-dwarf nature of the binary candidates can ultimately be confirmed by combining the measured lens-source relative proper motions with high-resolution imaging taken at a later time.",
      "pdf_url": "https://arxiv.org/pdf/2510.23933.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24274",
      "title": "Alpha Core-Beam Origin in Low-$β$ Solar Wind Plasma: Insights from Fully Kinetic Simulation",
      "authors": [
        "Luca Pezzini",
        "Fabio Bacchini",
        "Andrei N. Zhukov",
        "Giuseppe Arrò",
        "Rodrigo A. Lopez"
      ],
      "abstract": "Alpha Core-Beam Origin in Low-$β$ Solar Wind Plasma: Insights from Fully Kinetic Simulation Luca Pezzini, Fabio Bacchini, Andrei N. Zhukov, Giuseppe Arrò, Rodrigo A. Lopez Pages: 18; Figures: 13; Table:1 Solar and Stellar Astrophysics (astro-ph.SR) In-situ observations of the fast solar wind in the inner-heliosphere show that minor ions and ion sub-populations often exhibit distinct drift velocities. Both alpha particles and proton beams stream at speeds that rarely exceed the local Alfvén speed relative to the core protons, suggesting the presence of instabilities that constrain their maximum drift. We aim to propose a mechanism that generates an alpha-particle beam through non-linear Landau damping, primarily driven by the relative super-Alfvénic drift between protons and alpha particles. To investigate this process, we perform one-dimensional, fully kinetic particle-in-cell simulations of a non-equilibrium multi-species plasma, complemented by its linear theory to validate the model during the linear phase. Our results provide clear evidence that the system evolves by producing an alpha-particle beam, thereby suggesting a local mechanism for alpha-beam generation via non-linear Landau damping.",
      "pdf_url": "https://arxiv.org/pdf/2510.24274.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24281",
      "title": "Eppur si eclissa: Eccentric low-mass companions and time-in-dust selection explain long secondary periods",
      "authors": [
        "Leen Decin",
        "Owen Vermeulen",
        "Mats Esseldeurs",
        "Florian Driessen",
        "Camille Landri",
        "Davide Dionese",
        "Lionel Siess",
        "Dorota M. Skowron"
      ],
      "abstract": "Eppur si eclissa: Eccentric low-mass companions and time-in-dust selection explain long secondary periods Leen Decin, Owen Vermeulen, Mats Esseldeurs, Florian Driessen, Camille Landri, Davide Dionese, Lionel Siess, Dorota M. Skowron Accepted for publication in Astronomy & Astrophysics Letters -- 4 pages main journal, 2 pages Appendix, 1 video online material Solar and Stellar Astrophysics (astro-ph.SR) [abbreviated] Long Secondary Periods (LSPs) are observed in about one third of pulsating red giants yet remain unexplained. Four key observational constraints anchor the discussion: (i) a roughly 30 percent occurrence rate in semi-regular variable AGB stars (SRVs), with a much lower rate or absence in regularly pulsating Mira-type AGB stars (Miras), (ii) about 50 percent of LSP stars show a secondary mid-infrared minimum, (iii) Keplerian fits to radial-velocity curves favor argument of periastron greater than 180 degrees, and (iv) the radial-velocity to light-curve phase lag clusters around minus 90 degrees. We test whether a close-in, eccentric, low-mass companion that spends only part of its orbit within the giant's dust-formation zone can match all four empirical constraints. Guided by observed radial-velocity amplitudes and periods of about 500 to 1500 days, we adopt companion masses of 0.08 to 0.25 solar masses, orbital separations of 1.5 to 3 AU, eccentricities up to 0.6, and dust condensation radii of about 2.5 to 3 AU for SRVs (larger for Miras via scaling with luminosity). We compute the fraction of the orbit spent outside the condensation radius and apply line-of-sight criteria for detectability. We test the first three empirical constraints analytically, then model the phase offset using three-dimensional hydrodynamical simulations. Our scenario explains the observed excess of systems with argument of periastron greater than 180 degrees and yields LSP detectability of about 27 percent for SRVs and about 2.5 percent for Miras, with a conditional secondary mid-infrared eclipse fraction of about 44 percent. The hydrodynamical models place the optical-depth maximum downstream of the companion near apastron and then shift it forward by roughly 90 to 225 degrees later in the orbit, consistent with the observed radial-velocity to light-curve offsets.",
      "pdf_url": "https://arxiv.org/pdf/2510.24281.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24444",
      "title": "Pulsation Mode Identification and Classification of 46 High-Amplitude $δ$ Scuti Stars from 50 Candidates with TESS observations",
      "authors": [
        "Taozhi Yang",
        "Zhaoyu Zuo"
      ],
      "abstract": "Pulsation Mode Identification and Classification of 46 High-Amplitude $δ$ Scuti Stars from 50 Candidates with TESS observations Taozhi Yang, Zhaoyu Zuo Solar and Stellar Astrophysics (astro-ph.SR) Asteroseismic modelling of high-amplitude $\\delta$ Scuti (HADS) variables critically depends on their accurate classification, which provides robust constraints on stellar physical parameters. As a foundational step in this direction, we present a detailed analysis of the pulsational behavior of 50 HADS star candidates using high-precision photometric data from the Transiting Exoplanet Survey Satellite (TESS). We confirm 46 as genuine HADS variables, with 40 stars having their dominant frequencies identified for the first time. Among them, 7 pulsate solely in the fundamental mode; 21 exhibit the fundamental mode alongside at least one low-amplitude nonradial mode; 5 are pure double-mode pulsators (the fundamental and first-overtone modes), 13 show double-mode pulsations accompanied by additional low-amplitude nonradial modes. The remaining four stars are classified as other types of variables: two (TIC 69546708 and TIC 110937533) are confirmed hot subdwarfs, one (TIC 8765832) is a cataclysmic variable, and one (TIC 32302937) is a likely hot subluminous star, but it requires further spectroscopic confirmation. We investigate the period-luminosity (PL) relation, also known as the Leavitt law, for these 46 confirmed HADS stars, deriving a revised relation: $M_{V}= (-3.31 \\pm0.39)~\\mathrm{log}~P+(-1.68 \\pm 0.39)$. This result is consistent with previous studies. Their distribution in the Hertzsprung-Russell diagram indicates that HADS stars are not strictly confined to be within a narrow instability strip previously found, but can extend beyond it, with a distribution toward lower temperatures. The refined classifications presented here establish a high-quality sample for precise asteroseismic modelling and enhance the potential for future machine-learning-assisted searches and classifications of HADS stars in large-scale photometric surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.24444.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24585",
      "title": "Modeling Decadal and Centennial Solar UV Irradiance Changes",
      "authors": [
        "Raffaele Reda",
        "Valentina Penza",
        "Serena Criscuoli",
        "Luca Bertello",
        "Matteo Cantoresi",
        "Lorenza Lucaferri",
        "Simone Ulzega",
        "Francesco Berrilli"
      ],
      "abstract": "Modeling Decadal and Centennial Solar UV Irradiance Changes Raffaele Reda, Valentina Penza, Serena Criscuoli, Luca Bertello, Matteo Cantoresi, Lorenza Lucaferri, Simone Ulzega, Francesco Berrilli Solar and Stellar Astrophysics (astro-ph.SR) Reconstructions of solar spectral irradiance - especially in the ultraviolet (UV) range - are crucial for understanding Earth's climate system. Although total solar irradiance (TSI) has been thoroughly investigated, the spectral composition of solar radiation offers a deeper insight into its interactions with the atmosphere, biosphere, and climate. UV radiation, in particular, plays a key role in stratospheric chemistry and the dynamics of stratospheric ozone. Reconstructing solar irradiance over the past centuries requires accounting for both the cyclic modulation of active-region coverage associated with the 11-year solar cycle and the longer-term secular trends, including their centennial variability. This study utilizes an empirical framework, based on a 1000-year record of Open Solar Flux, to characterize the various temporal components of solar irradiance variability. We then combine these components to reconstruct Solar UV irradiance variations in spectral bands crucial for Earth's atmospheric studies.",
      "pdf_url": "https://arxiv.org/pdf/2510.24585.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24655",
      "title": "The largest ground-based catalogue of M-dwarf flares",
      "authors": [
        "A.D. Lavrukhina",
        "B. Demkov",
        "K. Malanchev",
        "M.V. Pruzhinskaya",
        "E.E.O. Ishida"
      ],
      "abstract": "The largest ground-based catalogue of M-dwarf flares A.D. Lavrukhina, B. Demkov, K. Malanchev, M.V. Pruzhinskaya, E.E.O. Ishida 13 pages, 12 figures, 3 tables, 1 appendix Solar and Stellar Astrophysics (astro-ph.SR) We present the largest ground-based catalogue of M-dwarf flares to date, comprising 1,229 time-resolved events identified in Zwicky Transient Facility Data Release 17. Using high-cadence ZTF observations collected between April 2018 and September 2020, we analyzed over 93 million variable light curves containing 4.1 billion photometric measurements. Flare candidates were identified through a machine-learning pipeline trained on simulated light curves generated by injecting TESS-based flare templates into ZTF data and then refined through an extensive post-filtering stage combining an additional classifier, metadata checks, and human inspection. For 655 flares with reliable Gaia-based distances and well-sampled light curves, we derived bolometric energies ranging from 10^31 to 10^35 erg. A clear correlation is observed between flare frequency and spectral subtype, with a sharp increase toward later M dwarfs, particularly near M4-M5, coinciding with the transition to full convection. Using 680 flaring stars with known vertical distances from the Galactic plane, we find that the fraction of flaring stars decreases with increasing Galactic height. The resulting catalogue provides the most comprehensive ground-based sample of M-dwarf flares and establishes a framework for flare detection and classification in upcoming wide-field surveys such as the Vera C. Rubin Observatory Legacy Survey of Space and Time.",
      "pdf_url": "https://arxiv.org/pdf/2510.24655.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23678",
      "title": "Giant Planet Evolution with MESA",
      "authors": [
        "Ravit Helled",
        "Simon Müller",
        "Henrik Knierim"
      ],
      "abstract": "Giant Planet Evolution with MESA Ravit Helled, Simon Müller, Henrik Knierim accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) The evolution of gaseous planets is a complex process influenced by various physical parameters and processes. In this study, we present critical modifications to the Modules for Experiments in Stellar Astrophysics (MESA) code to enhance its applicability to giant planet modelling. We introduce an equation of state specifically tailored for materials at planetary conditions. The equation of state considers the thermodynamic properties of hydrogen-helium mixtures and heavy elements, improving the accuracy of internal structure calculations. We also present modifications to the radiative opacity to allow the modelling of grains, clouds and opacity windows. Furthermore, we refine the treatment of convective mixing processes in MESA to better replicate convective mixing with the presence of composition gradients. Finally, we add a treatment for helium rain and settling. These modifications aim to enhance the predictive capabilities of MESA for giant planet evolution and are publicly available. We hope that these improvements will lead to a deeper understanding of giant planet evolution in the solar system and beyond.",
      "pdf_url": "https://arxiv.org/pdf/2510.23678.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23709",
      "title": "Sensitivity to Sub-Io-sized Exosatellite Transits in the MIRI LRS Lightcurve of the Nearest Substellar Worlds",
      "authors": [
        "Andrew Householder",
        "Mary Anne Limbach",
        "Beth Biller",
        "Brooke Kotten",
        "Mikayla J. Wilson",
        "Johanna M. Vos",
        "Andrew Skemer",
        "Andrew Vanderburg",
        "Ben J. Sutlieff",
        "Xueqing Chen",
        "Ian J. M. Crossfield",
        "Nicolas Crouzet",
        "Trent Dupuy",
        "Jacqueline Faherty",
        "Pengyu Liu",
        "Elena Manjavacas",
        "Allison McCarthy",
        "Caroline V. Morley",
        "Philip S. Muirhead",
        "Natalia Oliveros-Gomez",
        "Genaro Suárez",
        "Xianyu Tan",
        "Yifan Zhou"
      ],
      "abstract": "Sensitivity to Sub-Io-sized Exosatellite Transits in the MIRI LRS Lightcurve of the Nearest Substellar Worlds Andrew Householder, Mary Anne Limbach, Beth Biller, Brooke Kotten, Mikayla J. Wilson, Johanna M. Vos, Andrew Skemer, Andrew Vanderburg, Ben J. Sutlieff, Xueqing Chen, Ian J. M. Crossfield, Nicolas Crouzet, Trent Dupuy, Jacqueline Faherty, Pengyu Liu, Elena Manjavacas, Allison McCarthy, Caroline V. Morley, Philip S. Muirhead, Natalia Oliveros-Gomez, Genaro Suárez, Xianyu Tan, Yifan Zhou Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) JWST's unprecedented sensitivity enables precise spectrophotometric monitoring of substellar worlds, revealing atmospheric variability driven by mechanisms operating across different pressure levels. This same precision now permits exceptionally sensitive searches for transiting exosatellites, small terrestrial companions to these worlds. Using a novel simultaneous dual-band search method to address host variability, we present a search for transiting exosatellites in an 8-hour JWST/MIRI LRS lightcurve of the nearby ($2.0\\,pc$) substellar binary WISE J1049-5319AB, composed of two $\\sim30 M_{\\rm Jup}$ brown dwarfs separated by $3.5\\,au$ and viewed near edge-on. Although we detect no statistically significant transits, our injection-recovery tests demonstrate sensitivity to satellites as small as $0.275\\,R_{\\oplus}$ ($0.96\\,R_{\\rm Io}$ or $\\sim$1 lunar radius), corresponding to 300ppm transit depths, and satellite-to-host mass ratios $>$$10^{-6}$. This approach paves the way for detecting Galilean-moon analogs around directly imaged brown dwarfs, free-floating planets, and wide-orbit exoplanets, dozens of which are already scheduled for JWST lightcurve monitoring. In our Solar System, each giant planet hosts on average 3.5 moons above this threshold, suggesting that JWST now probes a regime where such companions are expected to be abundant. The technique and sensitivities demonstrated here mark a critical step toward detecting exosatellites and ultimately enabling constraints on the occurrence rates of small terrestrial worlds orbiting $1\\text{-}70$$M_{\\rm Jup}$ hosts.",
      "pdf_url": "https://arxiv.org/pdf/2510.23709.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24401",
      "title": "Comprehensive Inclusion of Higher-order Ca$^+$ Isotope Shifts in the King's Plot Yields an Order Improvement on the $e^- - n$ Coupling Limit",
      "authors": [
        "Vaibhav Katyal",
        "A. Chakraborty",
        "B. K. Sahoo"
      ],
      "abstract": "Comprehensive Inclusion of Higher-order Ca$^+$ Isotope Shifts in the King's Plot Yields an Order Improvement on the $e^- - n$ Coupling Limit Vaibhav Katyal, A. Chakraborty, B. K. Sahoo v1: 5 pages, 3 tables, 2 figures Atomic Physics (physics.atom-ph); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph); Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th) By critically evaluating higher-order nonlinear effects to the isotope shifts (ISs) in the low-lying transition frequencies of the singly charged calcium ion, stringent constraint on the electron-neutron coupling due to a hypothetical boson describing physics beyond the Standard Model is inferred. It shows an order magnitude difference compared to the previously reported limit demonstrating importance of higher-order effects in the analysis of nonlinearity in the King's plot. The first-order IS parameters and enhancement factor ($D$) were evaluated using two complementary approaches in the relativistic coupled-cluster theory framework: namely finite-field (FF) and analytical response (AR) approaches. Extraction of the second-order IS parameters in the FF approach show numerical instabilities, so they are determined in the AR approach. Comparison of these factors with previous calculation shows substantial differences in the magnitudes. However, $D$ values from both the FF and AR approaches display excellent agreement. We also show explicitly roles of electron correlation effects in the evaluation of $D$ values accurately.",
      "pdf_url": "https://arxiv.org/pdf/2510.24401.pdf",
      "categories": [
        "astro-ph.SR",
        "hep-ph",
        "nucl-ex",
        "nucl-th"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24575",
      "title": "A Deep Search for Exomoons Around WISE 0855 With JWST",
      "authors": [
        "Mikayla J. Wilson",
        "Mary Anne Limbach",
        "Andrew J. Skemer",
        "Johanna M. Vos",
        "Brittany E. Miles",
        "Melanie J. Rowland",
        "Andrew Vanderburg",
        "Adam C. Schneider",
        "Caroline Morley",
        "Brooke Kotten",
        "Andrew Householder",
        "Roxana Lupu",
        "James Mang",
        "Richard Freedman"
      ],
      "abstract": "A Deep Search for Exomoons Around WISE 0855 With JWST Mikayla J. Wilson, Mary Anne Limbach, Andrew J. Skemer, Johanna M. Vos, Brittany E. Miles, Melanie J. Rowland, Andrew Vanderburg, Adam C. Schneider, Caroline Morley, Brooke Kotten, Andrew Householder, Roxana Lupu, James Mang, Richard Freedman 19 pages, 18 figures, accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) JWST is collecting time-series observations of many free-floating planets (FFPs) to study their weather, but these light curves are the ideal datasets to search for exomoons that transit the FFP during observations. In this paper, we present observations of the planetary-mass Y dwarf ($T=250-285K$, $M = 6.5\\pm3.5 M_{Jup}$, d = 2.3$\\,$pc) WISE J085510.83-071442.5 (WISE 0855), whose proximity and brightness make it ideal for a transiting exomoon search. We examine 11 hours of time-series spectra from the JWST Near-Infrared Spectrograph (NIRSpec) whose sensitivity, in combination with Gaussian process (GP) modeling, allows for the disentanglement of exomoon transits from WISE 0855's variability. We do not find statistically significant evidence of an exomoon transit in this dataset. Using injection and recovery tests of artificial transits for depths ranging between 0.1-1% (0.35-1.12 $R_{\\oplus}$) we explore the exomoon parameter space where we could successfully detect transits. For transit depths $\\geq 0.5\\%$ (1.96$\\,R_{\\text{Titan}}$), our detection rate is 96%, which, for WISE 0855, corresponds to a moon with a companion-to-host mass ratio similar to that of Titan and Saturn. Given our sensitivity, transit probabilities, and our observational duration, we determine a $\\sim$91% probability of detecting a Titan mass analog exomoon after 18 such observations if every observed system hosts a Titan mass analog exomoon in a Galilean-like system. This suggests that JWST observations of dozens of FFPs could yield meaningful constraints on the occurrence rate of exomoons. This paper is the first demonstration that JWST is sensitive to Galilean moon mass analogs around FFPs.",
      "pdf_url": "https://arxiv.org/pdf/2510.24575.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23694",
      "title": "The case for an Astrometric Mission Extension of Euclid. Extending Gaia by 6 magnitudes with Euclid covering one-third of the sky",
      "authors": [
        "Luigi \"Rolly'' BEDIN , Osservatorio Astronomico di Padova)"
      ],
      "abstract": "The case for an Astrometric Mission Extension of Euclid. Extending Gaia by 6 magnitudes with Euclid covering one-third of the sky Luigi \"Rolly'' BEDIN (Istituto Nazionale di Astrofisica (INAF), Osservatorio Astronomico di Padova) 10(+App.2) pages, 3(+App.1) low-res. figures. Accepted for publication on Astronomy & Astrophysics (A&A) on 27th October 2025. Manuscript ID: AA57407-25. Comments are welcome Instrumentation and Methods for Astrophysics (astro-ph.IM) The nominal duration of Euclid's main mission is six years, but current best estimates indicate that the observatory has sufficient propellant to operate for up to ~14 years in total. In this work, we advocate dedicating six of these ~8 additional years to repeating the main survey, covering approximately one-third of the sky. This repetition would not only improve the sampling, signal-to-noise, quality, and depth of the survey, but -- most importantly -- would provide a six-year time baseline between two epochs if executed in the same sequence. The availability of multiple epochs would enable the derivation of proper motions for stars as faint as V~27, i.e., more than five magnitudes fainter than those measured by the Gaia mission. Although it may seem early to propose such a mission extension, in this work we quantitatively illustrate its immense scientific potential. We therefore intend to initiate the technical and scientific discussions early to ensure optimal planning. The here proposed extension would employ only the VIS channel -- owing to its superior astrometric capability and depth -- while simultaneously using NISP in slitless-spectroscopy mode to enhance the signal-to-noise ratio of first-epoch spectra that would also benefit of proper motions to identify and reject objects within the local Universe.",
      "pdf_url": "https://arxiv.org/pdf/2510.23694.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23702",
      "title": "In Search of the Unknown Unknowns: A Multi-Metric Distance Ensemble for Out of Distribution Anomaly Detection in Astronomical Surveys",
      "authors": [
        "Siddharth Chaini",
        "Federica B. Bianco",
        "Ashish Mahabal"
      ],
      "abstract": "In Search of the Unknown Unknowns: A Multi-Metric Distance Ensemble for Out of Distribution Anomaly Detection in Astronomical Surveys Siddharth Chaini, Federica B. Bianco, Ashish Mahabal 9 pages, 5 figures, Accepted at the 2025 Machine Learning and the Physical Sciences (ML4PS) workshop at NeurIPS Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Distance-based methods involve the computation of distance values between features and are a well-established paradigm in machine learning. In anomaly detection, anomalies are identified by their large distance from normal data points. However, the performance of these methods often hinges on a single, user-selected distance metric (e.g., Euclidean), which may not be optimal for the complex, high-dimensional feature spaces common in astronomy. Here, we introduce a novel anomaly detection method, Distance Multi-Metric Anomaly Detection (DiMMAD), which uses an ensemble of distance metrics to find novelties. Using multiple distance metrics is effectively equivalent to using different geometries in the feature space. By using a robust ensemble of diverse distance metrics, we overcome the metric-selection problem, creating an anomaly score that is not reliant on any single definition of distance. We demonstrate this multi-metric approach as a tool for simple, interpretable scientific discovery on astronomical time series -- (1) with simulated data for the upcoming Vera C. Rubin Observatory Legacy Survey of Space and Time, and (2) real data from the Zwicky Transient Facility. We find that DiMMAD excels at out-of-distribution anomaly detection -- anomalies in the data that might be new classes -- and beats other state-of-the-art methods in the goal of maximizing the diversity of new classes discovered. For rare in-distribution anomaly detection, DiMMAD performs similarly to other methods, but may allow for improved interpretability. All our code is open source: DiMMAD is implemented within DistClassiPy: this https URL, while all code to reproduce the results of this paper is available here: this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2510.23702.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23733",
      "title": "Magrathea v2: A planetary interior modeling platform in C++",
      "authors": [
        "David R. Rice",
        "Chenliang Huang",
        "Robert Royer",
        "Mangesh Daspute",
        "Krishang Mittal",
        "Baptiste Journaux",
        "Jason H. Steffen",
        "Allona Vazan"
      ],
      "abstract": "Magrathea v2: A planetary interior modeling platform in C++ David R. Rice, Chenliang Huang, Robert Royer, Mangesh Daspute, Krishang Mittal, Baptiste Journaux, Jason H. Steffen, Allona Vazan 5 pages, 1 figure, Submitted to The Journal of Open Source Software (JOSS) Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) Magrathea is an open-source C++ code for modeling the internal structure of differentiated planets. The initial release, Huang et al. (2022), introduced the base solver, a modular framework for defining equations of state (EOSs) used within phase diagrams for each differentiated layer, and outlined a series of planned extensions. Many of those updates are now implemented. Magrathea v2 is a more versatile platform that supports a winder range of compositions, adds new tools for composition retrieval, and makes it easier for users to adapt the code to their own models.",
      "pdf_url": "https://arxiv.org/pdf/2510.23733.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23749",
      "title": "Re-envisioning Euclid Galaxy Morphology: Identifying and Interpreting Features with Sparse Autoencoders",
      "authors": [
        "John F. Wu",
        "Michael Walmsley"
      ],
      "abstract": "Re-envisioning Euclid Galaxy Morphology: Identifying and Interpreting Features with Sparse Autoencoders John F. Wu, Michael Walmsley Accepted to NeurIPS Machine Learning and the Physical Sciences Workshop Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Sparse Autoencoders (SAEs) can efficiently identify candidate monosemantic features from pretrained neural networks for galaxy morphology. We demonstrate this on Euclid Q1 images using both supervised (Zoobot) and new self-supervised (MAE) models. Our publicly released MAE achieves superhuman image reconstruction performance. While a Principal Component Analysis (PCA) on the supervised model primarily identifies features already aligned with the Galaxy Zoo decision tree, SAEs can identify interpretable features outside of this framework. SAE features also show stronger alignment than PCA with Galaxy Zoo labels. Although challenges in interpretability remain, SAEs provide a powerful engine for discovering astrophysical phenomena beyond the confines of human-defined classification.",
      "pdf_url": "https://arxiv.org/pdf/2510.23749.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24040",
      "title": "LBT Italia: Current Achievements and Future Directions",
      "authors": [
        "Silvia Tosi",
        "Ester Marini",
        "Felice Cusano",
        "Andrea Rossi",
        "Roberto Speziali",
        "Roberta Carini"
      ],
      "abstract": "LBT Italia: Current Achievements and Future Directions Silvia Tosi, Ester Marini, Felice Cusano, Andrea Rossi, Roberto Speziali, Roberta Carini Instrumentation and Methods for Astrophysics (astro-ph.IM) The Large Binocular Telescope (LBT) is a world-leading astronomical observatory, where the italian partnership has played an important role in increasing the telescope's productivity, both through an optimized observing strategy and through peer-reviewed publications that are well recognized by the international astronomical community. This manuscript provides an updated overview of the active and past instruments at LBT, together with the key usage statistics. In particular, we analyze the operational performance recorded in the LBT Italia night logs during INAF's observing time and assess the scientific impact of each instrument. Between 2014 and 2025 LBT Italia produced an average of 14 referred publication per year, based on an annual average of 311 hours of on-sky time. This corresponds to approximately 2.2 nights of telescope time per publication. The results of this analysis are placed in an international context to evaluate the competitiveness of LBT, and we outline future perspective for scientific exploitation.",
      "pdf_url": "https://arxiv.org/pdf/2510.24040.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24395",
      "title": "Optimising Underwater Neutrino Telescopes for All-Flavour Point Source Sensitivity",
      "authors": [
        "Iwan Morton-Blake",
        "Fuyudi Zhang",
        "Qichao Chang",
        "Shuhua Hao",
        "Weilun Huang",
        "Hualin Mei",
        "Wei Tian",
        "Yingwei Wang",
        "Xin Xiang",
        "Donglian Xu"
      ],
      "abstract": "Optimising Underwater Neutrino Telescopes for All-Flavour Point Source Sensitivity Iwan Morton-Blake, Fuyudi Zhang, Qichao Chang, Shuhua Hao, Weilun Huang, Hualin Mei, Wei Tian, Yingwei Wang, Xin Xiang, Donglian Xu Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Experiment (hep-ex) High-energy neutrino astronomy has advanced rapidly in recent years, with IceCube, KM3NeT, and Baikal-GVD establishing a diffuse astrophysical flux and pointing to promising source candidates. These achievements mark the transition from first detections to detailed source studies, motivating next-generation detectors with larger volumes, improved angular resolution, and full neutrino-flavour sensitivity. We present a performance study of large underwater neutrino telescopes, taking the proposed TRIDENT array in the South China Sea as a case study, with a focus on comparing the performance of various detector configurations against the TRIDENT baseline design. Both track-like events primarily from muon neutrinos, which provide precise directional information, and cascade events from all flavours, which offer superior energy resolution, diffuse-source sensitivity, and all-sky flavour coverage, are included to achieve a balanced performance across source types. The time to discover potential astrophysical sources with both track- and cascade-like events is used as the figure of merit to compare a variety of detector design choices. Our results show that, for a fixed number of optical modules, simply enlarging the instrumented volume does not inherently lead to improved performance, while taller strings can provide modest gains across all detector channels, within engineering constraints. Distributing dense clusters of strings over a large volume is found to generally worsen discovery potential compared to the baseline layout. Finally, the optical properties of the sea-water emerge as the key factor dictating the optimisation of detector layout, highlighting the need for in-situ measurements and early deployment of optical modules to guide the final array configuration.",
      "pdf_url": "https://arxiv.org/pdf/2510.24395.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24545",
      "title": "Exascale In-situ visualization for Astronomy & Cosmology",
      "authors": [
        "Nicola Tuccari",
        "Eva Sciacca",
        "Yolanda Becerra",
        "Enric Sosa Cintero",
        "Emiliano Tramontana"
      ],
      "abstract": "Exascale In-situ visualization for Astronomy & Cosmology Nicola Tuccari, Eva Sciacca, Yolanda Becerra, Enric Sosa Cintero, Emiliano Tramontana 8 pages, 3 figures, Conference: ITADATA2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Distributed, Parallel, and Cluster Computing (cs.DC) Modern simulations and observations in Astronomy & Cosmology (A&C) produce massively large data volumes, posing significant challenges for storage, access and data analysis. A long-standing bottleneck in high-performance computing, especially now in the exascale era, has been the requirement to write these large datasets to disks, which limits the performance. A promising solution to this challenge is in-situ processing, where analysis and visualization are performed concurrently with the simulation itself, bypassing the storage of the simulation data. In this work, we present new results from an approach for in-situ processing based on Hecuba, a framework that provides a highly distributed database for streaming A&C simulation data directly into the visualization pipeline to make possible on-line visualization. By integrating Hecuba with the high-performance cosmological simulator ChaNGa, we enable real-time, in-situ visualization of N-body simulation results using tools such as ParaView and VisIVO.",
      "pdf_url": "https://arxiv.org/pdf/2510.24545.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.DC"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24547",
      "title": "In-Situ High Performance Visualization for Astronomy & Cosmology",
      "authors": [
        "Nicola Tuccari",
        "Eva Sciacca",
        "Yolanda Becerra",
        "Enric Sosa Cintero",
        "Robert Wissing",
        "Sijing Shen",
        "Emiliano Tramontana"
      ],
      "abstract": "In-Situ High Performance Visualization for Astronomy & Cosmology Nicola Tuccari, Eva Sciacca, Yolanda Becerra, Enric Sosa Cintero, Robert Wissing, Sijing Shen, Emiliano Tramontana 4 pages, 1 figure, Conference: Astronomical Data Analysis Software & Systems 2024, Malta Instrumentation and Methods for Astrophysics (astro-ph.IM); Distributed, Parallel, and Cluster Computing (cs.DC) The Astronomy & Cosmology (A&C) community is presently witnessing an unprecedented growth in the quality and quantity of data coming from simulations and observations. Writing results of numerical simulations to disk files has long been a bottleneck in high-performance computing. To access effectively and extract the scientific content of such large-scale data sets appropriate tools and techniques are needed. This is especially true for visualization tools, where petascale data size problems cannot be visualized without some data filtering, which reduces either the resolution or the amount of data volume managed by the visualization tool. A solution to this problem is to run the analysis and visualization concurrently (in-situ) with the simulation and bypass the storage of the full results. In particular we use Hecuba, a framework offering a highly distributed database to stream A\\&C simulation data for on-line visualization. We will demonstrate the Hecuba platform integration with the Changa high performant cosmological simulator and the in-situ visualization of its N-body results with the ParaView and VisIVO tools.",
      "pdf_url": "https://arxiv.org/pdf/2510.24547.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.DC"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23857",
      "title": "Wind-AE: A Fast, Open-source 1D Photoevaporation Code with Metal and Multi-frequency X-ray Capabilities",
      "authors": [
        "Madelyn Broome",
        "Ruth Murray-Clay",
        "John McCann",
        "James E Owen"
      ],
      "abstract": "Wind-AE: A Fast, Open-source 1D Photoevaporation Code with Metal and Multi-frequency X-ray Capabilities Madelyn Broome, Ruth Murray-Clay, John McCann, James E Owen Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Throughout their lives, short period exoplanets (<100 days) experience X-ray and extreme-UV (XUV) stellar irradiation that can heat and photoionize planets' upper atmospheres, driving transonic outflows. This photoevaporative mass loss plays a role in both evolution and observed demographics; however, mass loss rates are not currently directly observable and can only be inferred from models. To that end, we present an open-source fast 1D, XUV multi-frequency, multispecies, steady-state, hydrodynamic Parker Wind photoevaporation relaxation model based on Murray-Clay et al. (2009,arXiv:0811.0006). The model can move smoothly between high and low flux regimes and accepts custom multi-frequency stellar spectra. While the inclusion of high-energy X-rays increases mass loss rates ($\\dot{M}$), metals decrease $\\dot{M}$, and the net result for a typical hot Jupiter is a similar $\\dot{M}$, but a hotter, faster, and more gradually ionized wind. We find that mulitfrequency photons (e.g., 13.6-2000eV) are absorbed over a broader range of heights in the atmosphere resulting in a wind-launch radius, $R_{XUV}$, that is of order 10 nanobars for all but the highest surface gravity planets. Grids of H/He solar metallicity atmospheres reveal that, for typical hot Jupiters like HD 209458b, $R_{XUV}$~1.1-1.8$R_P$ for low-fluxes, meaning that the energy-limited mass loss rate, $\\dot{M}_{Elim}(R)$, computed at $R=R_P$ is a good approximation. However, for planets with low escape velocities, like many sub-Neptunes and super-Earths, $R_{XUV}$ can be >>$R_P$, making it necessary to use $\\dot{M}_{Elim}(R=R_{XUV})$ to avoid significantly underestimating mass loss rates. For both high escape velocities and large incident fluxes, radiative cooling is significant and energy-limited mass loss overestimates $\\dot{M}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.23857.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24084",
      "title": "Lunar Navigation System Optimization for Targeted Coverage with Semi-Analytical Station Keeping Model and Earth-GPS Integration",
      "authors": [
        "Rameez A. Malik",
        "Yang Yang"
      ],
      "abstract": "Lunar Navigation System Optimization for Targeted Coverage with Semi-Analytical Station Keeping Model and Earth-GPS Integration Rameez A. Malik, Yang Yang Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The design of an indigenous Lunar Navigation Satellite System (LNSS) is receiving growing attention due to the surge in planned lunar missions and the limited accessibility of Earth-based Global Navigation Satellite Systems (GNSS) in the cislunar environment. Several studies have explored LNSS architecture using geometric analysis in both near and distant lunar orbits. The existing LNSS optimization efforts have primarily focused on global lunar coverage using analytical station-keeping models with low accuracy. Furthermore, current south pole-focused research is restricted to Elliptical Lunar Frozen Orbits (ELFOs) and lacks comprehensive optimization approach. Additionally, integration with Earth GNSS systems for ephemeris computation and time synchronization has not been adequately addressed in prior studies. In this work, we present a comprehensive LNSS mission design framework based on evolutionary multi-objective optimization integrated with a high-fidelity numerical lunar orbit propagation model. The optimization simultaneously considers navigation performance in the lunar south pole region, semi-analytical continuous station-keeping maneuver model for realistic dV estimate, and GPS-LNSS integration analysis parameters. The resulting Pareto front offers a diverse set of LNSS configurations that balance coverage, accuracy, and dV requirements. Notably, the optimization identifies diverse non-frozen elliptical orbit solutions that achieve over 90% south pole coverage with acceptable navigation accuracy using as few as six satellites and dV of less than 0.4 km/s per satellite per year. This represents a significant reduction in constellation size compared to previous studies, offering a cost-effective yet operationally efficient solution for future LNSS missions.",
      "pdf_url": "https://arxiv.org/pdf/2510.24084.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24524",
      "title": "LEVITAS: Levitodynamics for Accurate Individual Particle Sensing in Space",
      "authors": [
        "Rafal Gajewski",
        "Ravindra T Desai",
        "James Bateman",
        "Bengt Eliasson",
        "Daniel K L Oi",
        "Animesh Datta"
      ],
      "abstract": "LEVITAS: Levitodynamics for Accurate Individual Particle Sensing in Space Rafal Gajewski, Ravindra T Desai, James Bateman, Bengt Eliasson, Daniel K L Oi, Animesh Datta Space Physics (physics.space-ph); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Geophysics (physics.geo-ph); Quantum Physics (quant-ph) Accurately observing the rarefied media of the upper atmosphere, exosphere, and planetary and solar system environments and beyond requires highly sensitive metrological techniques. We present the operating concept and architecture of an in-situ sensing solution based on the dynamics of a levitated nanoparticle (levitodynamics). It can detect and measure impacts of individual particles in rarefied media. Dubbed `LEVITAS', our sensor consists of a dispenser of dielectric nanoparticles and optical trapping of a single nanoparticle in the focus of a laser beam. The trapped nanoparticle constitutes a harmonic oscillator at frequencies in the kilohertz range whose position can be tracked at the standard quantum limit by interferometric detection of the laser photons it scatters. Here, we simulate microcanonical impacts on the nanoparticle and show that the density, velocity, temperature, and composition of the surrounding medium can be estimated accurately. We illustrate the performance of LEVITAS in circumstances ranging from low Earth orbit out to exospheric distances, across which individual impacts can be detected at favourable rates. Furthermore, LEVITAS may be employed to accurately measure highly rarefied neutral distributions within vastly different areas of momentum space. This we demonstrate by simulating the measurement of high-velocity neutral gas particles from the interstellar medium penetrating the heliosphere and flowing through our solar system.",
      "pdf_url": "https://arxiv.org/pdf/2510.24524.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "quant-ph"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.11698",
      "title": "AstroPix: A Pixelated HVCMOS Sensor for Space-Based Gamma-Ray Measurement",
      "authors": [
        "Amanda L. Steinhebel",
        "Regina Caputo",
        "Daniel P. Violette",
        "Anthony Affolder",
        "Autumn Bauman",
        "Carolyn Chinatti",
        "Aware Deshmukh",
        "Vitaliy Fadayev",
        "Yasushi Fukazawa",
        "Manoj Jadhav",
        "Carolyn Kierans",
        "Bobae Kim",
        "Jihee Kim",
        "Henry Klest",
        "Olivia Kroger",
        "Kavic Kumar",
        "Shin Kushima",
        "Jean-Marie Lauenstein",
        "Richard Leys",
        "Forest Martinez-Mckinney",
        "Jessica Metcalfe",
        "Zachary Metzler",
        "John W. Mitchell",
        "Norito Nakano",
        "Jennifer Ott",
        "Ivan Peric",
        "Jeremy S. Perkins",
        "Max R. Rudin",
        "Taylor Shin",
        "Grant Sommer",
        "Nicolas Striebig",
        "Yusuke Suda",
        "Hiroyasu Tajima",
        "Janeth Valverde",
        "Maria Zurek"
      ],
      "abstract": "AstroPix: A Pixelated HVCMOS Sensor for Space-Based Gamma-Ray Measurement Amanda L. Steinhebel, Regina Caputo, Daniel P. Violette, Anthony Affolder, Autumn Bauman, Carolyn Chinatti, Aware Deshmukh, Vitaliy Fadayev, Yasushi Fukazawa, Manoj Jadhav, Carolyn Kierans, Bobae Kim, Jihee Kim, Henry Klest, Olivia Kroger, Kavic Kumar, Shin Kushima, Jean-Marie Lauenstein, Richard Leys, Forest Martinez-Mckinney, Jessica Metcalfe, Zachary Metzler, John W. Mitchell, Norito Nakano, Jennifer Ott, Ivan Peric, Jeremy S. Perkins, Max R. Rudin, Taylor (K.W.)Shin, Grant Sommer, Nicolas Striebig, Yusuke Suda, Hiroyasu Tajima, Janeth Valverde, Maria Zurek Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) A next-generation medium-energy gamma-ray telescope targeting the MeV range would address open questions in astrophysics regarding how extreme conditions accelerate cosmic-ray particles, produce relativistic jet outflows, and more. One concept, AMEGO-X, relies upon the mission-enabling CMOS Monolithic Active Pixel Sensor silicon chip AstroPix. AstroPix is designed for space-based use, featuring low noise, low power consumption, and high scalability. Desired performance of the device include an energy resolution of 5 keV (or 10% FWHM) at 122 keV and a dynamic range per-pixel of 25-700 keV, enabled by the addition of a high-voltage bias to each pixel which supports a depletion depth of 500 um. This work reports on the status of the AstroPix development process with emphasis on the current version under test, version three (v3), and highlights of version two (v2). Version 3 achieves energy resolution of 10.4 +/- 3.2% at 59.5 keV and 94 +/- 6 um depletion in a low-resistivity test silicon substrate.",
      "pdf_url": "https://arxiv.org/pdf/2501.11698.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.21328",
      "title": "robostrategy: Field and Target Assignment Optimization in the Sloan Digital Sky Survey V",
      "authors": [
        "Michael R. Blanton",
        "Joleen K. Carlberg",
        "Tom Dwelly",
        "Ilija Medan",
        "S. Drew Chojnowski",
        "Kevin Covey",
        "Megan C. Davis",
        "John Donor",
        "Pramod Gupta",
        "Alexander Ji",
        "Jennifer A. Johnson",
        "Juna A. Kollmeier",
        "Jose Sanchez-Gallego",
        "Conor Sayres",
        "Eleonora Zari"
      ],
      "abstract": "robostrategy: Field and Target Assignment Optimization in the Sloan Digital Sky Survey V Michael R. Blanton, Joleen K. Carlberg, Tom Dwelly, Ilija Medan, S. Drew Chojnowski, Kevin Covey, Megan C. Davis, John Donor, Pramod Gupta, Alexander Ji, Jennifer A. Johnson, Juna A. Kollmeier, Jose Sanchez-Gallego, Conor Sayres, Eleonora Zari 45 pages, 14 figures, accepted by the Astronomical Journal Instrumentation and Methods for Astrophysics (astro-ph.IM) We present an algorithmic method for efficiently planning a long-term, large-scale multi-object spectroscopy program. The Sloan Digital Sky Survey V (SDSS-V) Focal Plane System performs multi-object spectroscopy using 500 robotic positioners to place fibers feeding optical and infrared spectrographs across a wide field. SDSS-V uses this system to observe targets throughout the year at two observatories in support of the science goals of its Milky Way Mapper and Black Hole Mapper programs. These science goals require observations of objects over time with preferred temporal spacinges (referred to as \"cadences\"), which can differ from object to object even in the same area of sky. robostrategy is the software we use to construct our planned observations so that they can best achieve the desired goals given the time available as a function of sky brightness and local sidereal time, and to assign fibers to targets during specific observations. We use linear programming techniques to seek optimal allocations of time under the constraints given. We present the methods and example results obtained with this software.",
      "pdf_url": "https://arxiv.org/pdf/2505.21328.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23680",
      "title": "Rheological Lunar Regolith Simulants",
      "authors": [
        "Léonie Gasteiner",
        "Alyona Glazyrina",
        "Naomi Murdoch",
        "Olfa D'Angelo"
      ],
      "abstract": "Rheological Lunar Regolith Simulants Léonie Gasteiner, Alyona Glazyrina, Naomi Murdoch, Olfa D'Angelo 5 pages, 2 figures, 1 table, Conference: IAC 2025 Earth and Planetary Astrophysics (astro-ph.EP); Soft Condensed Matter (cond-mat.soft) Regolith simulants are essential for space research and technology development. Yet, their physical properties often differ from those of true planetary soil, particularly when compared to regolith properties in-situ, that experience notably reduced gravity. We focus on lunar regolith simulants and explore various techniques to modify existing simulants to replicate the mechanical/rheological behavior of Moon regolith in true lunar conditions. Our results are validated against data from in-situ tests conducted during the Luna and Apollo missions, enabling a direct comparison of physical properties of our enhanced simulants to true Lunar regolith, on the Moon. Analyzed in the Mohr-Coulomb model framework, the friction angle of most simulants is generally close to that of true regolith, but the measured cohesion is often higher on the Moon, notably due to the reduced gravity environment. We propose a method to increase the cohesion of an existing simulant and assess the mechanical behavior of our rheological regolith simulant using a standardized geotechnical, shear test. The experimental results are then directly compared to in-situ data, providing a quantitative basis for evaluating the fidelity of the enhanced simulants.",
      "pdf_url": "https://arxiv.org/pdf/2510.23680.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23792",
      "title": "The Dynamical Environment within the Habitable Zone of the Gaia-4 and Gaia-5 Planetary Systems",
      "authors": [
        "Stephen R. Kane"
      ],
      "abstract": "The Dynamical Environment within the Habitable Zone of the Gaia-4 and Gaia-5 Planetary Systems Stephen R. Kane 9 pages, 5 figures, 1 table, accepted for publication in the Astronomical Journal Earth and Planetary Astrophysics (astro-ph.EP) Exoplanetary systems exhibit a broad range of architectures which, in turn, enable a variety of dynamical environments. Many of the known planetary systems do not transit the host star, and so we measure the minimum masses of their planets, making it difficult to fully assess the dynamical environment within the system. Astrometry can resolve the mass ambiguity and thus allow a more complete dynamical analysis of systems to be conducted. Gaia-4 and Gaia-5 are two such systems, whose study with radial velocities and data from the Gaia mission revealed that each star harbors a massive planet on a highly eccentric orbit. In this work, we provide the results of a dynamical analysis of each system, including calculations of the Habitable Zone (HZ), from which we show that the presence of the known companions largely exclude the presence of planets within the HZ. We discuss the diagnostics of potential past planet-planet scattering events, and the occurrence of similar systems whereby a giant planet on an eccentric orbit can substantially disrupt orbital integrity of terrestrial planets. These \"wrecking ball\" systems have an impact on the target selection for planned direct imaging missions that seek to identify potentially habitable environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.23792.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24224",
      "title": "Bistability, Oscillations, and Multistability on Hycean Planets",
      "authors": [
        "Yichen Gao",
        "Daniel D. B. Koll",
        "Feng Ding"
      ],
      "abstract": "Bistability, Oscillations, and Multistability on Hycean Planets Yichen Gao, Daniel D. B. Koll, Feng Ding 20 pages, 9 figures, 1 table, accepted for publication in PSJ Earth and Planetary Astrophysics (astro-ph.EP) Hycean planets are hypothetical exoplanets characterized by $H_2O$ oceans and $H_2$-rich atmospheres. These planets are high-priority targets for biosignature searches, as they combine abundant surface liquid water with easy-to-characterize $H_2$-rich atmospheres. Perhaps their most unusual climate feature is convective inhibition, which can dramatically alter a planet's temperature structure. However, so far hycean planets have mostly been investigated using 1D models that do not account for convective inhibition, and its effects are still poorly understood. This work develops pen-and-paper theory to analyze the effects of moist convective inhibition on hycean planets. The theory is tested and verified against a 1D radiative-convective model. We show that hycean planets near the onset of convective inhibition can exhibit either bistability or oscillations, due to the inhibition layer's trapping of heat and moisture. Meanwhile, hot hycean planets exhibit multistability, in which the inhibition layer and surface climate show multiple stable equilibria due to the lack of constraints on the water cycle inside the inhibition layer. The water cycle inside the inhibition layer is influenced by numerous processes that are challenging to resolve in 1D, including turbulent diffusion, convective overshoot and large-scale circulations. Our results demonstrate that hycean planets have unexpectedly rich climate dynamics. Meanwhile, previous claims about hycean planets should be treated with caution until confirmed with more self-consistent 1D and 3D models; this includes the claim that K2-18b might be habitable, and the proposal to infer $H_2O$ oceans on sub-Neptunes from JWST measurements of chemical species in their upper atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2510.24224.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24644",
      "title": "On The Applicability of Ring-Moon Cycles to Exoplanets",
      "authors": [
        "Isabella E. Ward",
        "Matija Ćuk"
      ],
      "abstract": "On The Applicability of Ring-Moon Cycles to Exoplanets Isabella E. Ward, Matija Ćuk Earth and Planetary Astrophysics (astro-ph.EP) The presence of rings and moons around exoplanets is likely to be one of the next great discoveries in exoplanet research. Using theories developed for the Solar System, we explore the possibility of coupled ring-moon cycles around exoplanets and what these processes mean for the observability of these features. Around Neptune- and Earth-like planets, we find that ring-moon cycles are capable of producing long-lived rings of comparable and greater relative transit depths than Saturn's. In multi-planet systems, secular spin-orbit resonances can provide the necessary planetary obliquity for these rings to contribute noticeably to transit lightcurves. We model the geometry of a ring's cross-section at various angles in comparison to the cross-section of a transiting planet to determine whether the ring may be detectable during the planet's transit. Ringed planets have also been proposed as an alternative to inflated planetary radii seen in transit, leading to abnormally low observed densities. Ring-moon cycles can produce late-forming and sometimes long-lived rings that can have the potential of explaining at least some of these observations. We also discuss some inconsistencies in the calculation of exoplanet oblateness due to rotation that we have come across in the course of this work.",
      "pdf_url": "https://arxiv.org/pdf/2510.24644.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24708",
      "title": "Horizontal and vertical exoplanet thermal structure from a JWST spectroscopic eclipse map",
      "authors": [
        "Ryan C. Challener",
        "Megan Weiner Mansfield",
        "Patricio E. Cubillos",
        "Anjali A. A. Piette",
        "Louis-Philippe Coulombe",
        "Hayley Beltz",
        "Jasmina Blecic",
        "Emily Rauscher",
        "Jacob L. Bean",
        "Björn Benneke",
        "Eliza M.-R. Kempton",
        "Joseph Harrington",
        "Thaddeus D. Komacek",
        "Vivien Parmentier",
        "S. L. Casewell",
        "Nicolas Iro",
        "Luigi Mancini",
        "Matthew C. Nixon",
        "Michael Radica",
        "Maria E. Steinrueck",
        "Luis Welbanks",
        "Natalie M. Batalha",
        "Claudio Caceres",
        "Ian J.M. Crossfield",
        "Nicolas Crouzet",
        "Jean-Michel Désert",
        "Karan Molaverdikhani",
        "Nikolay K. Nikolov",
        "Enric Palle",
        "Benjamin V. Rackham",
        "Everett Schlawin",
        "David K. Sing",
        "Kevin B. Stevenson",
        "Xianyu Tan",
        "Jake D. Turner",
        "Xi Zhang"
      ],
      "abstract": "Horizontal and vertical exoplanet thermal structure from a JWST spectroscopic eclipse map Ryan C. Challener, Megan Weiner Mansfield, Patricio E. Cubillos, Anjali A. A. Piette, Louis-Philippe Coulombe, Hayley Beltz, Jasmina Blecic, Emily Rauscher, Jacob L. Bean, Björn Benneke, Eliza M.-R. Kempton, Joseph Harrington, Thaddeus D. Komacek, Vivien Parmentier, S. L. Casewell, Nicolas Iro, Luigi Mancini, Matthew C. Nixon, Michael Radica, Maria E. Steinrueck, Luis Welbanks, Natalie M. Batalha, Claudio Caceres, Ian J.M. Crossfield, Nicolas Crouzet, Jean-Michel Désert, Karan Molaverdikhani, Nikolay K. Nikolov, Enric Palle, Benjamin V. Rackham, Everett Schlawin, David K. Sing, Kevin B. Stevenson, Xianyu Tan, Jake D. Turner, Xi Zhang Published in Nature Astronomy. First two authors contributed equally Earth and Planetary Astrophysics (astro-ph.EP) Highly-irradiated giant exoplanets known as \"ultra-hot Jupiters\" are anticipated to exhibit large variations of atmospheric temperature and chemistry as a function of longitude, latitude, and altitude. Previous observations have hinted at these variations, but the existing data have been fundamentally restricted to probing hemisphere-integrated spectra, thereby providing only coarse information on atmospheric gradients. Here we present a spectroscopic eclipse map of an extrasolar planet, resolving the atmosphere in multiple dimensions simultaneously. We analyze a secondary eclipse of the ultra-hot Jupiter WASP-18b observed with the NIRISS instrument on JWST. The mapping reveals weaker longitudinal temperature gradients than were predicted by theoretical models, indicating the importance of hydrogen dissociation and/or nightside clouds in shaping global thermal emission. Additionally, we identify two thermally distinct regions of the planet's atmosphere: a \"hotspot\" surrounding the substellar point and a \"ring\" near the dayside limbs. The hotspot region shows a strongly inverted thermal structure due to the presence of optical absorbers and a water abundance marginally lower than the hemispheric average, in accordance with theoretical predictions. The ring region shows colder temperatures and poorly constrained chemical abundances. Similar future analyses will reveal three-dimensional thermal, chemical, and dynamical properties of a broad range of exoplanet atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2510.24708.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23686",
      "title": "Surface Binding Energies for Amorphous Plagioclase Feldspar Calculated using Molecular Dynamics",
      "authors": [
        "Amanda Ricketts",
        "Benjamin A. Clouter-Gergen",
        "Anastasis Georgiou",
        "Deborah Berhanu",
        "Liam S. Morrissey"
      ],
      "abstract": "Surface Binding Energies for Amorphous Plagioclase Feldspar Calculated using Molecular Dynamics Amanda Ricketts, Benjamin A. Clouter-Gergen, Anastasis Georgiou, Deborah Berhanu, Liam S. Morrissey Materials Science (cond-mat.mtrl-sci); Earth and Planetary Astrophysics (astro-ph.EP) Despite the well-established presence of amorphous compounds on planetary bodies such as the Moon and Mercury due to space weathering, the direct effect of atomic arrangement on the surface binding energies (SBEs) of elements on these bodies remains largely unexplored. Accurate SBE values are essential for reliably predicting sputtering yields and the energy distribution of ejecta. Here, we use molecular dynamics simulations to quantify SBEs for the different elements sputtered from amorphous atomic arrangements of the plagioclase feldspar end members, albite and anorthite, and compare to their crystalline counterparts. Results show that while the mean elemental SBEs from amorphous surfaces are not significantly different from their crystalline counterparts, the random orientation in amorphous structures gives rise to a spectrum of bonding configurations, resulting in a distribution of SBEs with a wider range. This contrasts with the clearly discretized set of SBE values associated with the ordered atomic structure of crystalline surfaces. We then consider sputtering by H, He, and a solar wind combination of 96% H and 4% He. For each of these cases, we demonstrate that there is minimal difference (<10% for albite and <20% for anorthite) between the sputtering yields of amorphous and crystalline surfaces. We attribute these results to the presence of the same elemental bonds across different atomic arrangements, which leads to similar mean SBEs and, consequently, comparable sputtering yields.",
      "pdf_url": "https://arxiv.org/pdf/2510.23686.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24976",
      "title": "JWST/MIRI Imaging of the Warm Dust Component of the Epsilon Eridani Debris Disk",
      "authors": [
        "Schuyler G. Wolff",
        "András Gáspár",
        "George Rieke",
        "Jarron M. Leisenring",
        "Antranik A. Sefilian",
        "Marie Ygouf",
        "Jorge Llop-Sayson"
      ],
      "abstract": "JWST/MIRI Imaging of the Warm Dust Component of the Epsilon Eridani Debris Disk Schuyler G. Wolff, András Gáspár, George Rieke, Jarron M. Leisenring, Antranik A. Sefilian, Marie Ygouf, Jorge Llop-Sayson Earth and Planetary Astrophysics (astro-ph.EP) We present JWST/MIRI observations of the debris disk surrounding the nearby, solar analog Epsilon Eridani obtained as part of the Archetypal Debris Disk GTO program. Multi-wavelength images from 15, 18, 21, and 25.5 $\\mu m$ show a smooth dust distribution with no evidence of sculpting by massive planets outside of 5 au. Maps of the color temperature and opacity constrain the dust properties while radiative transfer modeling of a warm dust component traces the interaction between the debris disk and Epsilon Eri b ($\\sim$3.5 au). Dynamical and collisional modeling further shows that the disk morphology is dominated by dust produced in the outer planetesimal belt ($\\sim 70 \\, au$) moving inward via stellar wind drag. We confirm the presence of a disk interior to the Epsilon Eri b orbit first detected from mid-IR interferometry. Drag dominated inner disk regions have also been observed around Vega and Fomalhaut hinting at the diversity of asteroid belt analogs.",
      "pdf_url": "https://arxiv.org/pdf/2509.24976.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.00175",
      "title": "Icy or rocky? Convective or stable? New interior models of Uranus and Neptune",
      "authors": [
        "Luca Morf",
        "Ravit Helled"
      ],
      "abstract": "Icy or rocky? Convective or stable? New interior models of Uranus and Neptune Luca Morf, Ravit Helled Accepted for publication in A&A; v2: Language compliance update with A&A guidelines; v3: Unit corrections for the entropies depicted in Figures A.1 and A.3 Earth and Planetary Astrophysics (astro-ph.EP) We present a new framework for constructing agnostic and yet physical models for planetary interiors and apply it to Uranus and Neptune. Unlike previous research that either impose rigid assumptions or rely on simplified empirical profiles, our approach bridges both paradigms. Starting from randomly generated density profiles, we applied an iterative algorithm that converges towards models that simultaneously satisfy hydrostatic equilibrium, match the observed gravitational moments, and remain thermodynamically and compositionally consistent. The inferred interior models for Uranus and Neptune span a wide range of possible interior structures, in particular encompassing both water-dominated and rock-dominated configurations (rock-to-water mass ratios between 0.04-3.92 for Uranus and 0.20-1.78 for Neptune). All models contain convective regions with ionic water and have temperature-pressure profiles that remain above the demixing curves for hydrogen-helium-water mixtures. This offers both a plausible explanation for the observed non-dipolar magnetic fields and indicates that no hydrogen-helium-water demixing occurs. We find a higher H-He mass fraction in the outermost convection zones for Uranus (0.62-0.73) compared to Neptune (0.25-0.49) and that Uranus' magnetic field is likely generated deeper in the interior compared to Neptune. We infer upper limits of 0.69-0.74 (Uranus) versus 0.78-0.92 (Neptune) for the outer edges of the dynamo regions in units of normalised radii. Overall, our findings challenge the conventional classification of Uranus and Neptune as 'ice giants' and underscore the need for improved observational data or formation constraints to break compositional degeneracy.",
      "pdf_url": "https://arxiv.org/pdf/2510.00175.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}