{
  "date": "2026-01-09",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.SR",
    "astro-ph.HE",
    "astro-ph.CO",
    "astro-ph.IM",
    "astro-ph.GA"
  ],
  "total_papers": 108,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.03122",
      "title": "Late-time Background Constraints on Linear and Non-linear Interacting Dark Energy after DESI DR2",
      "authors": [
        "David Figueruelo",
        "Marcel van der Westhuizen",
        "Amare Abebe",
        "Eleonora Di Valentino"
      ],
      "abstract": "Late-time Background Constraints on Linear and Non-linear Interacting Dark Energy after DESI DR2 David Figueruelo, Marcel van der Westhuizen, Amare Abebe, Eleonora Di Valentino Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) In this study, we present observational constraints on a class of phenomenological interacting dark energy (IDE) models that admit analytical solutions for the Hubble parameter $H(z)$. We consider a set of five linear and three non-linear IDE scenarios, encompassing both interactions proportional to the dark matter and/or dark energy densities, as well as non-linear combinations of the two. For all eight IDE models, we find a better fit than $\\Lambda$CDM from a $\\Delta\\chi^2$ analysis for both combinations of datasets considered. When using the Akaike Information Criterion ($\\Delta$AIC), we find a similarly improved fit in all cases, except for one dataset combination in $Q=3H\\delta\\rho_{\\rm de}$. Our analysis also shows a preference for sign-switching interactions, with energy transfer from dark energy to dark matter at low redshift, reversing direction at higher redshift. These results should be interpreted with caution, as the latter direction of energy transfer is accompanied by negative dark energy densities in the past, which may be unphysical. Models that do not allow sign-changing behaviour instead show a preference for energy flow from dark matter to dark energy, and hence negative dark energy densities. The only exceptions are $Q=3H\\delta\\rho_{\\rm de}$ and $Q=3H\\delta\\left(\\tfrac{\\rho_{\\rm de}^2}{\\rho_{\\rm dm}+\\rho_{\\rm de}}\\right)$, which exhibit energy flow in the opposite direction. Furthermore, for all interactions considered, we find a phantom-divide crossing in the effective dark energy equation of state $w^{\\rm eff}_{\\rm de}$, with the dark energy density decreasing ($w^{\\rm eff}_{\\rm de}>-1$) at present and at low redshift, while increasing ($w^{\\rm eff}_{\\rm de}<-1$) in the past at high redshift. These results highlight the promising, but problematic, nature of dark sector interactions, as well as the need to extend the analysis using early-time physics and datasets.",
      "pdf_url": "https://arxiv.org/pdf/2601.03122.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03347",
      "title": "Mind the peak: improving cosmological constraints from GWTC-4.0 spectral sirens using semiparametric mass models",
      "authors": [
        "Matteo Tagliazucchi",
        "Michele Moresco",
        "Nicola Borghi",
        "Chiara Ciapetti"
      ],
      "abstract": "Mind the peak: improving cosmological constraints from GWTC-4.0 spectral sirens using semiparametric mass models Matteo Tagliazucchi, Michele Moresco, Nicola Borghi, Chiara Ciapetti Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational wave spectral sirens can provide cosmological constraints by using the shape of the binary black hole (BBH) mass distribution (MD). However, the precision and accuracy of these constraints depends critically on the capturing all the MD features. In this work, we analyze 137 BBH events from the latest GWTC-4.0 with a novel data-driven semiparametric approach based on \\textsc{Bspline} that adaptively places knots around the most informative structures in the MD, while keeping the dimensionality of the parameter space moderate. Our flexible models resolve three distinct peaks at $\\sim10$, $18$, and $33\\,\\mathrm{M}_\\odot$ and are statistically preferred over standard parametric models, with Bayes factors up to 226. Because these features are correlated with $H_0$, the semiparametric model yields, under different prior assumptions, 12%-21% improvement in the precision of $H_0$ relative to parametric models, providing $H_0 = 57.8^{+21.9}_{-20.6}\\,\\mathrm{km/s/Mpc}$ in the best case. Our results demonstrate that capturing the full complexity of the BBH mass distribution is essential for realizing the cosmological potential of spectral sirens as gravitational wave catalogs continue to grow.",
      "pdf_url": "https://arxiv.org/pdf/2601.03347.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.03456",
      "title": "The steep redshift evolution of the hierarchical merger rate may cause the $z$-$χ_{\\rm eff}$ correlation",
      "authors": [
        "Amanda M. Farah",
        "Aditya Vijaykumar",
        "Maya Fishbach"
      ],
      "abstract": "The steep redshift evolution of the hierarchical merger rate may cause the $z$-$χ_{\\rm eff}$ correlation Amanda M. Farah, Aditya Vijaykumar, Maya Fishbach 9 pages, 4 figures (with appendices: 18 pages, 12 figures). Also see Vijaykumar et al., posted simultaneously High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) There is growing evidence from gravitational-wave observations that some merging black holes are created from previous mergers. Using the prediction that these hierarchically-merged black holes have dimensionless spin magnitudes of $\\chi \\approx 0.69$, we identify a subpopulation in the gravitational-wave data consistent with a hierarchical-merger origin in dense star clusters. This subpopulation's primary mass distribution peaks at $16.7^{+3.1}_{-4.6},\\mathrm{M}_{\\odot}$, which is approximately twice as large as its secondary mass distribution's mode ($8.0^{+29.7}_{-2.3},\\mathrm{M}_{\\odot}$), and its spin tilt distribution is consistent with isotropy. Our inferred secondary mass distributions imply that isolated binary evolution may still be needed to explain the entirety of the $9\\,\\mathrm{M}_{\\odot}$ peak. Surprisingly, we find that the rate of hierarchical mergers may evolve more steeply with redshift than the rest of the population ($98.5\\%$ credibility): the fraction of all binary black holes that are hierarchically formed at $z=0.1$ is $0.05^{+0.05}_{-0.04}$, compared to $0.17^{+0.13}_{-0.12}$ at $z=1$. This provides an explanation for the previously-discovered broadening of the effective spin distribution with redshift. Our results have implications for star cluster formation histories, as they suggest the potential existence of a high-redshift population of massive, compact clusters.",
      "pdf_url": "https://arxiv.org/pdf/2601.03456.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.03457",
      "title": "The maximum mass ratio of hierarchical mergers may cause the $q$-$χ_{\\rm eff}$ correlation",
      "authors": [
        "Aditya Vijaykumar",
        "Amanda M. Farah",
        "Maya Fishbach"
      ],
      "abstract": "The maximum mass ratio of hierarchical mergers may cause the $q$-$χ_{\\rm eff}$ correlation Aditya Vijaykumar, Amanda M. Farah, Maya Fishbach 12 pages, 8 figures (4 in main text + 4 in appendices). Also see Farah et al. posted simultaneously to arXiv High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) Regardless of their initial spins, the merger of two roughly equal mass black holes (BHs) produces a remnant BH of dimensionless spin $0.69$. Such remnants can merge with other black holes in dense stellar environments and produce hierarchical mergers. Analyzing the latest catalog binary black hole (BBH) mergers from the LIGO-Virgo-KAGRA detectors, we identify a subpopulation with primary spins consistent with such hierarchical mergers. Consistent with astrophysical expectations for mergers of second generation BHs with first generation BHs, we find that this subpopulation has mass ratios below $0.59^{+0.18}_{-0.23}$. We also infer that $19$-$88\\%$ of the BBH population below this mass ratio is consistent with belonging to the hierarchically-merged population. Our results offer a natural explanation for the narrowing of the effective inspiral spin distribution with mass ratio observed in other studies.",
      "pdf_url": "https://arxiv.org/pdf/2601.03457.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2309.00057",
      "title": "Machian Gravity: Modeling Rotation Curves and Radial Acceleration in the SPARC Galaxy Sample",
      "authors": [
        "Santanu Das"
      ],
      "abstract": "Machian Gravity: Modeling Rotation Curves and Radial Acceleration in the SPARC Galaxy Sample Santanu Das Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) This paper investigates the potential of Machian Gravity (MG), a five-dimensional theory of gravity, to explain the acceleration law governing rotationally bound systems, in particular spiral galaxies. MG was proposed as a framework capable of accounting for a range of astrophysical and cosmological phenomena -- including galactic rotation curves, mass distributions in galaxy clusters, and cosmic expansion -- without invoking additional dark components. In this study, we apply the MG acceleration law to a large sample of galaxies drawn from the SPARC database. Through a detailed analysis, we determine the optimal MG parameters for each individual galaxy, successfully fitting their observed rotation curves. Similar to Modified Newtonian Dynamics (MOND), our results indicate the existence of a characteristic acceleration scale associated with galactic dynamics, which regulates rotational behavior in the outer regions. Notably, this acceleration scale varies from galaxy to galaxy, but typically remains of order $10^{-8} {\\rm cm/s^2}$.",
      "pdf_url": "https://arxiv.org/pdf/2309.00057.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.23798",
      "title": "Scalar-induced gravitational waves from coherent initial states",
      "authors": [
        "Dipayan Mukherjee",
        "H. V. Ragavendra",
        "Shiv K. Sethi"
      ],
      "abstract": "Scalar-induced gravitational waves from coherent initial states Dipayan Mukherjee, H. V. Ragavendra, Shiv K. Sethi 14 pages, 3 figures, accepted for publication in Physical Review D Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate the impact of statistical inhomogeneity and anisotropy in primordial scalar perturbations on the scalar-induced gravitational waves (SIGW). Assuming inflationary quantum fluctuations originate from a coherent state, the resulting primordial scalar perturbations acquire a non-zero space-dependent mean, violating statistical homogeneity, statistical isotropy, and parity. As a consequence of statistical inhomogeneities, SIGW acquires distinct scale-dependent features in its correlation function. Statistical anisotropies further lead to possible parity violation and correlation between different polarization modes in the tensor perturbations. Therefore, detection of these signatures in the stochastic gravitational wave background would offer probes to the statistical nature of primordial scalar perturbations beyond the scales accessible to CMB observations.",
      "pdf_url": "https://arxiv.org/pdf/2506.23798.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.13648",
      "title": "The impact of non-Gaussianity when searching for Primordial Black Holes with LISA",
      "authors": [
        "Antonio Junior Iovino",
        "Gabriele Perna",
        "Hardi Veermäe"
      ],
      "abstract": "The impact of non-Gaussianity when searching for Primordial Black Holes with LISA Antonio Junior Iovino, Gabriele Perna, Hardi Veermäe Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) LISA can observe cosmological millihertz (mHz) gravitational wave (GW) backgrounds that may offer a decisive test for asteroid-mass primordial black hole (PBH) dark matter (DM). In standard scenarios, failing to detect a scalar-induced gravitational wave (SIGW) background would exclude the last viable window for PBH DM formed through critical collapse. We show that this conclusion becomes much weaker in the presence of astrophysical foregrounds and strongly non-Gaussian primordial density perturbations, by studying how these phenomena affect the link between SIGWs and PBHs, and reevaluate LISA's sensitivity to asteroid-mass PBHs. In addition, we analyse the interplay between PBHs and SIGWs to gain further insights into the nature of primordial non-Gaussianity. We find that uncertainties in $f_{\\rm NL}$ can induce substantial uncertainties in the PBH abundance, which ultimately limits LISA's capacity to fully probe the asteroid-mass PBH DM window.",
      "pdf_url": "https://arxiv.org/pdf/2512.13648.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.03883",
      "title": "Filtering interlopers with photometry and diagnostic features: A machine learning framework validated with CSST slitless spectroscopy",
      "authors": [
        "Hui Peng",
        "Yu Yu",
        "Yiyang Guo",
        "Yizhou Gu",
        "Run Wen",
        "Yunkun Han",
        "Jipeng Sui",
        "Hu Zou",
        "Xiaohu Yang",
        "Pengjie Zhang",
        "Xian Zhong Zheng",
        "Hong Guo",
        "Yipeng Jing",
        "Cheng Li",
        "Hu Zhan",
        "Gongbo Zhao"
      ],
      "abstract": "Filtering interlopers with photometry and diagnostic features: A machine learning framework validated with CSST slitless spectroscopy Hui Peng, Yu Yu, Yiyang Guo, Yizhou Gu, Run Wen, Yunkun Han, Jipeng Sui, Hu Zou, Xiaohu Yang, Pengjie Zhang, Xian Zhong Zheng, Hong Guo, Yipeng Jing, Cheng Li, Hu Zhan, Gongbo Zhao 17 pages, 6 figures, to be submitted to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) The slitless spectroscopic method employed by missions such as Euclid and the Chinese Space Station Survey Telescope (CSST) faces a fundamental challenge: spectroscopic redshifts derived from their data are susceptible to emission line misidentification due to the limited spectral resolution and signal-to-noise ratio. This effect systematically introduces interloper galaxies into the sample. Conventional strict selection not only struggles to secure high redshift purity but also drastically reduces completeness by discarding valuable data. To overcome this limitation, we develop an XGBoost classifier that leverages photometric properties and spectroscopic diagnostics to construct a high-purity redshift catalog while maximizing completeness. We validate this method on a simulated sample with spectra generated by the CSST emulator for slitless spectroscopy. Of the $\\sim$62 million galaxies that obtain valid redshifts (parent sample), approximately 43% achieve accurate measurements, defined as $|\\Delta z| \\leq 0.002(1+z)$. From this parent sample, the XGBoost classifier selects galaxies with a selection efficiency of 42.3% on the test set and 42.2% when deployed on the entire parent sample. Crucially, among the retained galaxies, 96.6% (parent sample: 96.5%) achieve accurate measurements, while the outlier fraction ($|\\Delta z|>0.01(1+z)$) is constrained to 0.13% (0.11%). We verified that simplified configurations which exclude either spectroscopic diagnostics (except the measured redshift) or photometric data yield significantly higher outlier fractions, increasing by factors of approximately 3.5 and 6.3 respectively, with the latter case also introducing notable catastrophic interloper contamination. This framework effectively resolves the purity-completeness trade-off, enabling robust large-scale cosmological studies with CSST and similar surveys.",
      "pdf_url": "https://arxiv.org/pdf/2601.03883.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03894",
      "title": "Towards an optimal extraction of cosmological parameters from galaxy cluster surveys using convolutional neural networks",
      "authors": [
        "Iñigo Sáez-Casares",
        "Matteo Calabrese",
        "Davide Bianchi",
        "Marina S. Cagliari",
        "Marco Chiarenza",
        "Jean-Marc Christille",
        "Luigi Guzzo"
      ],
      "abstract": "Towards an optimal extraction of cosmological parameters from galaxy cluster surveys using convolutional neural networks Iñigo Sáez-Casares, Matteo Calabrese, Davide Bianchi, Marina S. Cagliari, Marco Chiarenza, Jean-Marc Christille, Luigi Guzzo 21 pages, 18 figures. Submitted to Astronomy & Computing, comments welcomed Cosmology and Nongalactic Astrophysics (astro-ph.CO) The possibility to constrain cosmological parameters from galaxy surveys using field-level machine learning methods that bypass traditional summary statistics analyses, depends crucially on our ability to generate simulated training sets. The latter need to be both realistic, as to reproduce the key features of the real data, and produced in large numbers, as to allow us to refine the precision of the training process. The analysis presented in this paper is an attempt to respond to these needs by (a) using clusters of galaxies as tracers of large-scale structure, together with (b) adopting a 3LPT code (Pinocchio) to generate a large training set of $32\\,768$ mock X-ray cluster catalogues. X-ray luminosities are stochastically assigned to dark matter haloes using an empirical $M-L_X$ scaling relation. Using this training set, we test the ability and performances of a 3D convolutional neural network (CNN) to predict the cosmological parameters, based on an input overdensity field derived from the cluster distribution. We perform a comparison with a neural network trained on traditional summary statistics, that is, the abundance of clusters and their power spectrum. Our results show that the field-level analysis combined with the cluster abundance yields a mean absolute relative error on the predicted values of $\\Omega_{\\rm m}$ and $\\sigma_8$ that is a factor of $\\sim 10 \\%$ and $\\sim 20\\%$ better than that obtained from the summary statistics. Furthermore, when information about the individual luminosity of each cluster is passed to the CNN, the gain in precision exceeds $50\\%$.",
      "pdf_url": "https://arxiv.org/pdf/2601.03894.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04048",
      "title": "Cosmological constraints on viable $f(R)$ models using weak lensing",
      "authors": [
        "Leandro Pardo",
        "Leonardo Castañeda"
      ],
      "abstract": "Cosmological constraints on viable $f(R)$ models using weak lensing Leandro Pardo, Leonardo Castañeda Cosmology and Nongalactic Astrophysics (astro-ph.CO) The accelerated expansion of the Universe remains one of the central open problems in modern cosmology. While the $\\Lambda$CDM model successfully describes a wide range of observations, the physical nature of dark energy is still unknown, motivating the study of alternative theories of gravity. Among these, $f(R)$ models provide a well-established extension of General Relativity, capable of reproducing a $\\Lambda$CDM-like background evolution without introducing an explicit dark energy component. However, they can induce deviations in the growth of cosmic structures, making them testable through observables sensitive to cosmological perturbations. In this work, we use weak gravitational lensing to constrain several viable $f(R)$ gravity models. We analyze their impact on the matter power spectrum, as well as on the convergence and cosmic shear power spectra. Our analysis is carried out within a Bayesian framework using the \\textit{Cobaya} code and its modified gravity extension, \\textit{MGCobaya}, which enables consistent theoretical predictions and their comparison with current weak lensing and CMB lensing data. We find that standard cosmological parameters remain consistent with the $\\Lambda$CDM scenario for all models considered, as expected from their background degeneracy. Nevertheless, we obtain non-trivial and model-dependent constraints on the characteristic parameters of several $f(R)$ theories.",
      "pdf_url": "https://arxiv.org/pdf/2601.04048.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03338",
      "title": "Fast rotations in galaxies at cosmic noon indicate central concentration of stars, dark matter or massive black holes",
      "authors": [
        "Fernanda Roman-Oliveira",
        "Francesca Rizzo",
        "Filippo Fraternali"
      ],
      "abstract": "Fast rotations in galaxies at cosmic noon indicate central concentration of stars, dark matter or massive black holes Fernanda Roman-Oliveira, Francesca Rizzo, Filippo Fraternali 18 pages, 9 figures. Submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The rotation curves of regularly rotating disc galaxies are a unique probe of the gravitational potential and dark matter distribution. Until recently, matter decomposition of rotation curves at $z>0.5$ was challenging, not only due to the lack of high resolution kinematic data but also of both suitable photometry to accurately trace the stellar surface density and spatially-resolved sub-mm observations to trace the cold gas distribution. In this paper, we analyse three galaxies from the Archival Large Program to Advance Kinematic Analysis (ALPAKA) sample, combining highly resolved cold gas observations from ALMA with rest-frame near-infrared imaging from JWST to investigate their dynamical properties and constrain their dark matter halos. The galaxies, initially classified as regularly rotating discs based on ALMA observations alone, appear in JWST as extended and symmetric stellar discs with spiral arms. Our dynamical models reproduce the rotation of the discs in the outer parts well, but they systematically underpredict the inner rotation velocities, revealing a deficit of central mass relative to the data. This discrepancy indicates either an underestimation of the bulge masses due to variations in the stellar mass-to-light ratio or dust attenuation or the presence of overmassive black holes. Alternatively, it may suggest departures from standard dark-matter halo profiles, including enhanced central concentrations.",
      "pdf_url": "https://arxiv.org/pdf/2601.03338.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03422",
      "title": "Simulation-Based Inference for Probabilistic Galaxy Detection and Deblending",
      "authors": [
        "Ismael Mendoza",
        "Derek Hansen",
        "Runjing Liu",
        "Zhe Zhao",
        "Ziteng Pang",
        "Axel Guinot",
        "Camille Avestruz",
        "Jeffrey Regier",
        "the LSST Dark Energy Science Collaboration"
      ],
      "abstract": "Simulation-Based Inference for Probabilistic Galaxy Detection and Deblending Ismael Mendoza, Derek Hansen, Runjing Liu, Zhe Zhao, Ziteng Pang, Axel Guinot, Camille Avestruz, Jeffrey Regier, the LSST Dark Energy Science Collaboration 23 pages, 11 figures, 2 tables, to be submitted to the Open Journal of Astrophysics Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Stage-IV dark energy wide-field surveys, such as the Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST), will observe an unprecedented number density of galaxies. As a result, the majority of imaged galaxies will visually overlap, a phenomenon known as blending. Blending is expected to be a leading source of systematic error in astronomical measurements. To mitigate this systematic, we propose a new probabilistic method for detecting, deblending, and measuring the properties of galaxies, called the Bayesian Light Source Separator (BLISS). Given an astronomical survey image, BLISS uses convolutional neural networks to produce a probabilistic astronomical catalog by approximating the posterior distribution over the number of light sources, their centroids' locations, and their types (galaxy vs. star). BLISS additionally includes a denoising autoencoder to reconstruct unblended galaxy profiles. As a first step towards demonstrating the feasibility of BLISS for cosmological applications, we apply our method to simulated single-band images whose properties are representative of year-10 LSST coadds. First, we study each BLISS component independently and examine its probabilistic output as a function of SNR and degree of blending. Then, by propagating the probabilistic detections from BLISS to its deblender, we produce per-object flux posteriors. Using these posteriors yields a substantial improvement in aperture flux residuals relative to deterministic detections alone, particularly for highly blended and faint objects. These results highlight the potential of BLISS as a scalable, uncertainty-aware tool for mitigating blending-induced systematics in next-generation cosmological surveys.",
      "pdf_url": "https://arxiv.org/pdf/2601.03422.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03925",
      "title": "Polarization rotation through differential transmission in refractive CMB telescopes identified using a hybrid physical optics method",
      "authors": [
        "Xiaodong Ren",
        "Rustam Balafendiev",
        "Jon E. Gudmundsson"
      ],
      "abstract": "Polarization rotation through differential transmission in refractive CMB telescopes identified using a hybrid physical optics method Xiaodong Ren, Rustam Balafendiev, Jon E. Gudmundsson Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Optics (physics.optics) We identify a polarization rotation systematic in the far field beams of refractive cosmic microwave background (CMB) telescopes caused by differential transmission in anti-reflection (AR) coatings of optical elements. This systematic was identified following the development of a hybrid physical optics method that incorporates full-wave electromagnetic simulations of AR coatings to model the full polarization response of refractive systems. Applying this method to a two-lens CMB telescope with non-ideal AR coating, we show that polarization-dependent transmission can produce a rotation of the far-field polarization angle that varies across the focal plane with a typical amplitude of 0.05-0.5 degrees. If ignored in analysis, this effect can produce temperature to polarization leakage and Stokes Q/U mixing.",
      "pdf_url": "https://arxiv.org/pdf/2601.03925.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.20501",
      "title": "PySCo: A fast Particle-Mesh $N$-body code for modified gravity simulations in Python",
      "authors": [
        "Michel-Andrès Breton"
      ],
      "abstract": "PySCo: A fast Particle-Mesh $N$-body code for modified gravity simulations in Python Michel-Andrès Breton Accepted in A&A. 21 pages, 17 figures. The code can be found at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present PySCo, a fast and user-friendly Python library designed to run cosmological $N$-body simulations across various cosmological models, such as $\\Lambda$CDM and $w_0w_a$CDM, and alternative theories of gravity, including $f(R)$, MOND and time-dependent gravitational constant parameterisations. PySCo employs Particle-Mesh solvers, using multigrid or Fast Fourier Transform (FFT) methods in their different variations. Additionally, PySCo can be easily integrated as an external library, providing utilities for particle and mesh computations. The library offers key features, including an initial condition generator based on up to third-order Lagrangian Perturbation Theory (LPT), power spectrum estimation, and computes the background and growth of density perturbations. In this paper, we detail PySCo's architecture and algorithms and conduct extensive comparisons with other codes and numerical methods. Our analysis shows that, with sufficient small-scale resolution, the power spectrum at redshift $z = 0$ remains independent of the initial redshift at the 0.1\\% level for $z_{\\rm ini} \\geq$ 125, 30, and 10 when using first, second, and third-order LPT, respectively. Although the seven-point Laplacian method used in multigrid also leads to power suppression on small scales, this effect can largely be mitigated when computing ratios. In terms of performance, PySCo only requires approximately one CPU hour to complete a Newtonian simulation with $512^3$ particles (and an equal number of cells) on a laptop. Due to its speed and ease of use, PySCo is ideal for rapidly generating vast ensemble of simulations and exploring parameter spaces, allowing variations in gravity theories, dark energy models, and numerical approaches. This versatility makes PySCo a valuable tool for producing emulators, covariance matrices, or training datasets for machine learning.",
      "pdf_url": "https://arxiv.org/pdf/2410.20501.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.08876",
      "title": "DESI Dark Secrets",
      "authors": [
        "Matilde L. Abreu",
        "Michael S. Turner"
      ],
      "abstract": "Matilde L. Abreu, Michael S. Turner Submitted to JCAP and revised according to referee's comments Cosmology and Nongalactic Astrophysics (astro-ph.CO) The first year results of DESI (DR1) provide evidence that dark energy may not be quantum vacuum energy ($\\Lambda$). If true, this would be an extraordinary development in the 25-year quest to understand cosmic acceleration. The best-fit DESI $w_0w_a$ models for dark energy, which underpin the claim, have strange behavior. They achieve a maximum energy density around $z\\simeq 0.5 $ and rapidly decrease before and after. We explore physics-based models where the dark energy is a rolling scalar-field. Our four scalar-field models are characterized by one dimensionless parameter $\\beta$, which in the limit of $\\beta \\rightarrow 0$ reduces to $\\Lambda$CDM. While none of our models fit the DESI data significantly better than $\\Lambda$CDM, for values of $\\beta$ of order unity, they fit about as well as $\\Lambda$CDM. We also consider the second data release from DESI (DR2), CMB data and supernovae data. The DR2 results are consistent with the DR1, and the combination of DESI, CMB and SNe favor $\\beta = 0.23 - 0.95$, providing some evidence for a scalar-field explanation for dark energy. While the DESI data prefer $w_0w_a$ to a scalar field, the SNe data prefer a scalar field to $w_0w_a$, and together they favor a $w_0w_a$ model. We study the limits of $w_0w_a$ in describing dark energy, especially scalar field models, and also point out that the strange behavior of the best-fit DESI models could arise due to the matter density not varying as expected or an unaccounted for component of energy density in the Universe.",
      "pdf_url": "https://arxiv.org/pdf/2502.08876.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.06593",
      "title": "The dynamical and thermodynamic effects of turbulence on the cosmic baryonic fluid",
      "authors": [
        "Yun Wang",
        "Minxing Li",
        "Ping He"
      ],
      "abstract": "The dynamical and thermodynamic effects of turbulence on the cosmic baryonic fluid Yun Wang, Minxing Li, Ping He 13 pages, 13 figures, accepted for publication in A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) Both simulations and observations indicate that the so-called missing baryons reside in the intergalactic medium known as the warm-hot intergalactic medium (WHIM). In this study we employed the IllustrisTNG50-1 simulation to demonstrate that knowledge of the turbulence in the cosmic baryonic fluid is crucial for correctly understanding both the spatial distribution and the physical origins of the missing baryons in the Universe. First, we find that dynamical effects cause the gas to be detained in low-density and intermediate-density regions, resulting in high baryon fractions, and prevent the convergence of the gas in high-density regions, leading to low baryon fractions. Second, turbulent energy is converted into thermal energy, and the injection and dissipation of turbulent energy have essentially reached a balance from $z=1$ to $0$. This indicates that the cosmic fluid is in a steady state within this redshift range. Due to turbulent heating, as the redshift decreases, an increasing amount of warm gas is heated and converted into the WHIM, and some even into hot gas. We find that, compared with turbulence in the cosmic fluid, shocks are unimportant in intermediate-density regions and even negligible in high-density regions, both dynamically and thermodynamically. This finding accounts for the origin of the WHIM in terms of both dynamics and thermodynamics, calls into question the traditional view of shock-heating, and highlights the importance of turbulence in shaping the large-scale structure of the Universe, particularly in the evolution of galaxies and galaxy clusters. In addition to TNG50-1, we validated our key findings with TNG50-2, TNG100-1, WIGEON, and EAGLE simulations, demonstrating that the spatial resolution, box size, and sub-grid-physics variations do not affect our main conclusions.",
      "pdf_url": "https://arxiv.org/pdf/2503.06593.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.21207",
      "title": "AliCPT Sensitivity to Cosmic Reheating",
      "authors": [
        "Yang Liu",
        "Lei Ming",
        "Marco Drewes",
        "Hong Li"
      ],
      "abstract": "AliCPT Sensitivity to Cosmic Reheating Yang Liu, Lei Ming, Marco Drewes, Hong Li 14 pages, 9 figures. Revised version with a more realistic AliCPT-1 sensitivity forecast, extended to three inflationary models, and an expanded discussion of knowledge gain and model testability Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We present the first assessment of the Ali Cosmic Microwave Background Polarization Telescope's (AliCPT) sensitivity to the reheating epoch after cosmic inflation, based on its ability to detect primordial gravitational waves. We consider three models of inflation, an $\\alpha$-attractor T-model, RGI inflation and QCD-driven warm inflation. Assuming a fiducial value of $r=0.01$, we find that AliCPT-1, in its fully loaded focal plane detector configuration and combined with Planck, can provide measurements of the order of magnitude of the reheating temperature with an accuracy around $10\\%$. For QCD-driven warm inflation this can be translated into a constraint on the inflaton coupling to gluons, which can be probed independently in axion search experiments. Our results constitute the first demonstration of AliCPT's ability to probe the initial temperature of the hot big bang and the microphysical parameter connecting cosmic inflation and particle physics.",
      "pdf_url": "https://arxiv.org/pdf/2503.21207.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.20413",
      "title": "Disentangling the Halo: Joint Model for Measurements of the Kinetic Sunyaev-Zeldovich Effect and Galaxy-Galaxy Lensing",
      "authors": [
        "James Sunseri",
        "Alexandra Amon",
        "Jo Dunkley",
        "Nicholas Battaglia",
        "Simone Ferraro",
        "Boryana Hadzhiyska",
        "Bernardita Ried Guachalla",
        "Emmanuel Schaan"
      ],
      "abstract": "Disentangling the Halo: Joint Model for Measurements of the Kinetic Sunyaev-Zeldovich Effect and Galaxy-Galaxy Lensing James Sunseri, Alexandra Amon, Jo Dunkley, Nicholas Battaglia, Simone Ferraro, Boryana Hadzhiyska, Bernardita Ried Guachalla, Emmanuel Schaan Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present the first joint analysis of the kinetic Sunyaev-Zeldovich (kSZ) effect with galaxy-galaxy lensing (GGL) for CMASS galaxies in the Baryon Oscillation Spectroscopic Survey (BOSS). We show these complementary probes can disentangle baryons from dark matter in the outskirts of galactic halos by alleviating model degeneracies that are present when fitting to kSZ or GGL measurements alone. In our joint kSZ+GGL analysis we show that the baryon density profile is well constrained on scales from 0.3 to 50 Mpc/$h$. With our well constrained profile of the baryon density, we provide direct comparisons to simulations. For our model we find an outer slope of the baryon distribution that is shallower than predicted by some hydrodynamical simulations, consistent with enhanced baryonic feedback. We also show that not including baryons in a model for GGL can bias halo mass estimates low by $\\sim 20\\%$ compared to a model that includes baryons and is jointly fit to kSZ+GGL measurements. Our modelling code galaxy-galaxy lensing and kSZ (\\texttt{glasz}) is publicly available at this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2505.20413.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.14275",
      "title": "The dynamics of background evolution and structure formation in phase space: a semi-cosmographic reconstruction",
      "authors": [
        "Pankaj Chavan",
        "Tapomoy Guha Sarkar",
        "Anjan A Sen"
      ],
      "abstract": "The dynamics of background evolution and structure formation in phase space: a semi-cosmographic reconstruction Pankaj Chavan, Tapomoy Guha Sarkar, Anjan A Sen Physics of the Dark Universe, Volume 50, December 2025, 102173 Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Baryon Acoustic Oscillation (BAO) feature, imprinted in the transverse and radial clustering of dark matter tracers, enables the simultaneous measurement of the angular diameter distance $D_A(z)$ and the Hubble parameter $H(z)$ at a given redshift. Further, measuring the redshift space anisotropy (RSD) allows us to measure the combination $f_8(z)\\equiv f\\sigma_8(z)$. Motivated by this, we simultaneously study the dynamics of background evolution and structure formation in an abstract phase space of dynamical quantities: $ x = H_0 D_A/c$, $p = dx/dz$, and $f_8$. We adopt a semi-cosmographic approach, whereby we do not pre-assume any specific dark energy model to integrate the dynamical system. The Luminosity distance is expanded as a Padé rational approximation in the variable $(1+z)^{1/2}$. The dynamical system is solved by using a semi-cosmographic equation of state, which incorporates the dark matter density parameter along with the parameters of the Padé expansion. The semi-cosmographic $D_A(z), H(z)$ and $f\\sigma_8(z)$, thus obtained, are fitted with BAO and RSD data from the SDSS IV. The reconstructed phase trajectories in the $3D$ $(x,p,f_8)$ space are used to reconstruct some diagnostics of background cosmology and structure formation. At low redshifts, a discernible departure from the $\\Lambda$CDM model is observed. The geometry of the phase trajectories in the projected spaces allows us to identify three key redshifts where future observations may be directed for a better understanding of cosmic tensions and anomalies.",
      "pdf_url": "https://arxiv.org/pdf/2506.14275.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.16291",
      "title": "XRISM-Subaru views of Abell 754: an off-axis, near-line-of-sight merging cluster",
      "authors": [
        "Nobuhiro Okabe",
        "Yuki Omiya",
        "Kazuhiro Nakazawa",
        "Naomi Ota",
        "Nhan T. Nguyen-Dang",
        "Yuto Ichinohe",
        "Shutaro Ueda"
      ],
      "abstract": "XRISM-Subaru views of Abell 754: an off-axis, near-line-of-sight merging cluster Nobuhiro Okabe, Yuki Omiya, Kazuhiro Nakazawa, Naomi Ota, Nhan T. Nguyen-Dang, Yuto Ichinohe, Shutaro Ueda accepted for publication in PASJ, 12 pages, 8 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO) We report a weak-lensing (WL) mass measurement for the merging cluster Abell 754 and impose constraints on the merger trajectory. The trajectory analysis adopts a two-body model with a point-mass approximation and dynamical friction, refined using numerical simulations of major mergers and characterized by Euler angles. We first conduct WL analysis using the two-dimensional shear pattern from the Subaru HSC in combination with Suprime-Cam images to assist in color selection. The WL mass map shows a distinct double-peak structure located around the western and eastern brightest cluster galaxies as reported in the literature. The two-halo component analysis, which utilizes the 2D shear pattern over the cluster entire region and considers the lensing covariance matrix from uncorrelated large-scale structures, indicates mass values of $M_{200}^W=3.13_{-1.00}^{+1.53}\\times10^{14}h_{70}^{-1}M_\\odot$ and $M_{200}^E=6.41_{-1.97}^{+2.92}\\times10^{14}h_{70}^{-1}M_\\odot$. Thus, the eastern mass component associated with the X-ray tadpole-shaped gas is the main cluster. No substantial structural components are detected in the line-of-sight velocities of the member galaxies. Utilizing WL parameters, line-of-sight velocities, and X-ray information on morphology and kinematics, we determine an impact parameter of approximately 0.77 Mpc at an initial separation of 2 Mpc from the main cluster. The merger plane is inclined at about 20 degrees relative to the line-of-sight. Interestingly, this system is an off-axis, near-line-of-sight merger. This characteristic arises because the trajectory within the merger plane is altered during the pericenter passage, causing the apparent motion to transition from predominantly along the line-of-sight before the core passage to mainly within the plane of the sky afterward. This study will assist in conducting numerical simulations to understand the XRISM observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.16291.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.21381",
      "title": "Unveiling the nature of SN 2022jli: The first double-peaked stripped-envelope supernova showing periodic undulations and dust emission at late times",
      "authors": [
        "Régis Cartier",
        "Carlos Contreras",
        "Maximilian Stritzinger",
        "Mario Hamuy",
        "Pilar Ruiz-Lapuente",
        "Jose L. Prieto",
        "Joseph P. Anderson",
        "Aleksandar Cikota",
        "Matthias Gerlach"
      ],
      "abstract": "Unveiling the nature of SN 2022jli: The first double-peaked stripped-envelope supernova showing periodic undulations and dust emission at late times Régis Cartier, Carlos Contreras, Maximilian Stritzinger, Mario Hamuy, Pilar Ruiz-Lapuente, Jose L. Prieto, Joseph P. Anderson, Aleksandar Cikota, Matthias Gerlach Accepted for publication in Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present optical and infrared observations from maximum light until around +800 days of supernova (SN) 2022jli, a peculiar stripped-envelope (SE) SN showing two maxima, each one with a peak luminosity of about $3 \\times 10^{42}$ erg s$^{-1}$, separated by 50 days. The second maximum is followed by unprecedented periodic undulations with a period of $P \\sim 12.5$ days. The spectra and the photometric evolution of the first maximum are consistent with the behaviour of a standard SE SN with an ejecta mass of $\\sim 1.5$ $M_{\\odot}$ and a radioactive $^{56}$Ni mass of $\\sim 0.12$ $M_{\\odot}$. The optical spectra after +400 days relative to the first maximum correspond to a standard SN Ic event, and at late times SN 2022jli exhibits a significant drop in the optical luminosity, implying that the physical phenomena that produced the secondary maximum have ceased to power the SN light curve. Among other potential scenarios, we discuss how the second maximum could be powered by a magnetar, while the light curve periodic undulations could be produced by accretion of material from a companion star onto the neutron star in a binary system. The near-infrared spectra shows clear first CO overtone emission from about +190 days after the first maximum, and it becomes undetected at +400 days. A significant near-infrared excess from hot dust emission is detected at +238 days, having been produced by either newly formed dust in the SN ejecta or a strong near-infrared dust echo. Depending on the assumptions of the dust composition, the estimated dust mass is $2-16 \\times 10^{-4}$ $M_{\\odot}$. The potential magnetar power of the second maximum can fit into a more general picture in which magnetars are the power source of SE super-luminous SNe, and could explain bumps, undulations, and late-time excess emission in SE SNe.",
      "pdf_url": "https://arxiv.org/pdf/2410.21381.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.02229",
      "title": "Pulsar Polarization Array Limits on Ultralight Axion-like Dark Matter",
      "authors": [
        "Xiao Xue",
        "Shi Dai",
        "Hoang Nhan Luu",
        "Tao Liu",
        "Jing Ren",
        "Jing Shu",
        "Yue Zhao",
        "Andrew Zic",
        "N. D. Ramesh Bhat",
        "Zu-Cheng Chen",
        "Yi Feng",
        "George Hobbs",
        "Agastya Kapur",
        "Richard N. Manchester",
        "Rami Mandow",
        "Saurav Mishra",
        "Daniel J. Reardon",
        "Christopher J. Russell",
        "Ryan M. Shannon",
        "Shuangqiang Wang",
        "Lei Zhang",
        "Songbo Zhang",
        "Xingjiang Zhu"
      ],
      "abstract": "Pulsar Polarization Array Limits on Ultralight Axion-like Dark Matter Xiao Xue, Shi Dai, Hoang Nhan Luu, Tao Liu, Jing Ren, Jing Shu, Yue Zhao, Andrew Zic, N. D. Ramesh Bhat, Zu-Cheng Chen, Yi Feng, George Hobbs, Agastya Kapur, Richard N. Manchester, Rami Mandow, Saurav Mishra, Daniel J. Reardon, Christopher J. Russell, Ryan M. Shannon, Shuangqiang Wang, Lei Zhang, Songbo Zhang, Xingjiang Zhu 6+20 pages, 14 figures, 2 tables; matches version published in Physical Review Letters Phys. Rev. Lett. 136 (2026) 1, 011001 High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) We conduct the first-ever Pulsar Polarization Array (PPA) analysis to detect the ultralight Axion-Like Dark Matter (ALDM) using the polarization data of 22 millisecond pulsars from the third data release of Parkes Pulsar Timing Array. As one of the major dark matter candidates, the ultralight ALDM exhibits a pronounced wave nature on astronomical scales and offers a promising solution to small-scale structure issues within local galaxies. While the linearly polarized pulsar light travels through the ALDM galactic halo, its position angle (PA) can be subject to an oscillation induced by the ALDM Chern-Simons coupling with electromagnetic field. The PPA is thus especially suited for detecting the ultralight ALDM by correlating polarization data across the arrayed pulsars. To accomplish this task, we develop an advanced Bayesian analysis framework that allows us to construct pulsar PA residual time series, model noise contributions properly and search for pulsar cross-correlations. We find that for an ALDM density of $\\rho_0=0.4\\,\\textrm{GeV}/\\textrm{cm}^3$, the Parkes PPA offers the best global limits on the ALDM Chern-Simons coupling, namely $\\lesssim 10^{-13.5}-10^{-12.2}~{\\rm GeV}^{-1}$, for the mass range of $10^{-22} - 10^{-21}~{\\rm eV}$. The crucial role of pulsar cross-correlation in recognizing the nature of the derived limits is also highlighted.",
      "pdf_url": "https://arxiv.org/pdf/2412.02229.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27644",
      "title": "Probing cosmic isotropy with Gamma-ray bursts: A dipole and quadrupole analysis of BATSE and Fermi GBM data",
      "authors": [
        "Debosi Mondal",
        "Biswajit Pandey",
        "Amit Mondal"
      ],
      "abstract": "Probing cosmic isotropy with Gamma-ray bursts: A dipole and quadrupole analysis of BATSE and Fermi GBM data Debosi Mondal, Biswajit Pandey, Amit Mondal 32 pages, 25 figures, 2 tables, Accepted for publication in Journal of High Energy Astrophysics (JHEAP) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The cosmological principle, asserting large-scale homogeneity and isotropy, underpins the standard model of cosmology. Testing its validity using independent astronomical probes remains crucial for understanding the global structure of the Universe. We investigate the angular distribution of Gamma-Ray Bursts (GRBs) using two of the most comprehensive all-sky datasets available, the BATSE (CGRO) and Fermi GBM catalogs, to test the isotropy of the GRB sky at large angular scales. We perform spherical harmonic decomposition of the GRB sky maps and estimate the dipole and quadrupole amplitudes. Statistical significance is evaluated by comparing the observed multipole amplitudes against distributions derived from 500 Monte Carlo realizations of isotropic skies. Our results show that the observed dipole amplitudes for both BATSE and Fermi GBM datasets lie within the $1\\sigma$ region of their respective null distributions. However, the quadrupole amplitude in the raw, uncorrected BATSE and Fermi GBM skies appears elevated at $3.7\\sigma$ and $3.0\\sigma$, respectively. After incorporating the BATSE sky exposure function, this apparent quadrupole anisotropy vanishes, indicating that instrumental non-uniformities fully account for the signal in that case. Owing to the absence of a publicly available full-sky exposure model for Fermi GBM, the Fermi analysis is restricted to the raw sky distribution. Our method's reliability is validated through controlled simulations, which show it can detect the injected dipoles in BATSE-sized isotropic skies. These findings reinforce the statistical isotropy of the GRB sky and underscore the importance of accurate exposure corrections in cosmological anisotropy analyses.",
      "pdf_url": "https://arxiv.org/pdf/2510.27644.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03337",
      "title": "AT2024wpp: An Extremely Luminous Fast Ultraviolet Transient Powered by Accretion onto a Black Hole",
      "authors": [
        "Daniel A. Perley",
        "Anna Y. Q. Ho",
        "Zoë McGrath",
        "Michael Camilo",
        "Cassie Sevilla",
        "Ping Chen",
        "Genevieve Schroeder",
        "Taya Govreen-Segal",
        "Aleksandra Bochenek",
        "Yu-Jing Qin",
        "James H. Gillanders",
        "Benjamin Amend",
        "Joseph P. Anderson",
        "Igor Andreoni",
        "Amar Aryan",
        "Eric C. Bellm",
        "Joshua S. Bloom",
        "Thomas de Boer",
        "Jonathan Carney",
        "Ilaria Caiazzo",
        "Ken C. Chambers",
        "Panos Charalampopoulos",
        "Ting-Wan Chen",
        "Tracy X. Chen",
        "Eric R. Coughlin",
        "Michael Coughlin",
        "Michel Dennefeld",
        "Georgios Dimitriadis",
        "Christoffer Fremling",
        "Danielle Frostig",
        "Avishay Gal-Yam",
        "Lluís Galbany",
        "Anjashay Gangopadhyay",
        "Melzie Ghendrih",
        "Matthew J. Graham",
        "Mariusz Gromadzki",
        "Steven L. Groom",
        "Claudia P. Gutiérrez",
        "K.-Ryan Hinds",
        "Mark E. Huber",
        "Cosimo Inserra",
        "Benjamin C. Kaiser",
        "Mansi M. Kasliwal",
        "Niilo E. Koivisto",
        "Chien-Cheng Lin",
        "Chang Liu",
        "Thomas B. Lowe",
        "Eugene Magnier",
        "Ashish A. Mahabal",
        "Andrew Milligan",
        "Paloma Minguez",
        "Geoffrey Mo",
        "Tomás E. Müller-Bravo",
        "Matt Nicholl",
        "Priscila J. Pessi",
        "Giuliano Pignata",
        "Josiah Purdum",
        "Nabeel Rehemtulla",
        "R. Michael Rich",
        "Anwesha Sahu",
        "Avinash Singh",
        "Stephen J. Smartt",
        "Jesper Sollerman",
        "Gokul Srinivasaragavan",
        "Shubham Srivastav",
        "Robert D. Stein",
        "Steve Schulze",
        "Jack W. Tweddle",
        "Richard Wainscoat",
        "Jacob L. Wise",
        "Lin Yan",
        "David R. Young"
      ],
      "abstract": "AT2024wpp: An Extremely Luminous Fast Ultraviolet Transient Powered by Accretion onto a Black Hole Daniel A. Perley, Anna Y. Q. Ho, Zoë McGrath, Michael Camilo, Cassie Sevilla, Ping Chen, Genevieve Schroeder, Taya Govreen-Segal, Aleksandra Bochenek, Yu-Jing Qin, James H. Gillanders, Benjamin Amend, Joseph P. Anderson, Igor Andreoni, Amar Aryan, Eric C. Bellm, Joshua S. Bloom, Thomas de Boer, Jonathan Carney, Ilaria Caiazzo, Ken C. Chambers, Panos Charalampopoulos, Ting-Wan Chen, Tracy X. Chen, Eric R. Coughlin, Michael Coughlin, Michel Dennefeld, Georgios Dimitriadis, Christoffer Fremling, Danielle Frostig, Avishay Gal-Yam, Lluís Galbany, Anjashay Gangopadhyay, Melzie Ghendrih, Matthew J. Graham, Mariusz Gromadzki, Steven L. Groom, Claudia P. Gutiérrez, K.-Ryan Hinds, Mark E. Huber, Cosimo Inserra, Benjamin C. Kaiser, Mansi M. Kasliwal, Niilo E. Koivisto, Chien-Cheng Lin, Chang Liu, Thomas B. Lowe, Eugene Magnier, Ashish A. Mahabal, Andrew Milligan, Paloma Minguez, Geoffrey Mo, Tomás E. Müller-Bravo, Matt Nicholl, Priscila J. Pessi, Giuliano Pignata, Josiah Purdum, Nabeel Rehemtulla, R. Michael Rich, Anwesha Sahu, Avinash Singh, Stephen J. Smartt, Jesper Sollerman, Gokul Srinivasaragavan, Shubham Srivastav, Robert D. Stein, Steve Schulze, Jack W. Tweddle, Richard Wainscoat, Jacob L. Wise, Lin Yan, David R. Young High Energy Astrophysical Phenomena (astro-ph.HE) We present the discovery of AT 2024wpp (\"Whippet\"), a fast and luminous 18cow-like transient. At a redshift of z=0.0868, revealed by Keck Cosmic Web Imager spectroscopy of its faint and diffuse star-forming host, it is the fourth-nearest example of its class to date. Rapid identification of the source in the Zwicky Transient Facility data stream permitted ultraviolet-through-optical observations to be obtained prior to peak, allowing the first determination of the peak bolometric luminosity (2x10^45 erg/s), maximum photospheric radius (10^15 cm), and total radiated energy (10^51 erg) of an 18cow-like object. We present results from a comprehensive multiwavelength observing campaign, including a far-UV spectrum from the Cosmic Origins Spectrograph on the Hubble Space Telescope and deep imaging extending >100 days post-explosion from the Very Large Telescope, Hubble Space Telescope, Very Large Array, and Atacama Large Millimetre Array. We interpret the observations under a model in which a powerful rapidly-accreting central engine blows a fast (~0.15c) wind into the surrounding medium and irradiates it with X-rays. The high Doppler velocities and intense ionization within this wind prevent any identifiable features from appearing in the ejecta or in the surrounding circumstellar material, even in the far-ultraviolet. Weak H and He signatures do emerge in the spectra after 35 days in the form of double-peaked narrow lines. Each peak is individually narrow (full width ~3000 km/s) but the two components are separated by ~6600 km/s, indicating stable structures of denser material, possibly representing streams of tidal ejecta or an ablated companion star.",
      "pdf_url": "https://arxiv.org/pdf/2601.03337.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03349",
      "title": "Simulation-Based Prediction of Black Hole Spectra: From $10M_\\odot$ to $10^8 M_\\odot$",
      "authors": [
        "Chris Nagele",
        "Julian H. Krolik",
        "Rongrong Liu",
        "Brooks E. Kinch",
        "Jeremy D. Schnittman"
      ],
      "abstract": "Simulation-Based Prediction of Black Hole Spectra: From $10M_\\odot$ to $10^8 M_\\odot$ Chris Nagele, Julian H. Krolik, Rongrong Liu, Brooks E. Kinch, Jeremy D. Schnittman Submitted to ApJ, comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) It has long been thought that black hole accretion flows are driven by magnetohydrodynamic (MHD) turbulence, and there are now many general relativistic global simulations illustrating the dynamics of this process. However, many challenges must be overcome in order to predict observed spectra from luminous systems. Ensuring energy conservation, local thermal balance, and local ionization equilibrium, our post-processing method incorporates all the most relevant radiation mechanisms: relativistic Compton scattering, bremsstrahlung, and lines and edges for 30 elements and all their ions. Previous work with this method was restricted to black holes of $10 M_\\odot$; here, for the first time, we extend it to $10^8 M_\\odot$ and present results for two sub-Eddington accretion rates and black hole spin parameter 0.9. The spectral shape predicted for stellar-mass black holes matches the low-hard state for the lower accretion rate and the steep power law state for the higher accretion rate. For high black hole mass, both accretion rates yield power-law continua from $\\sim 0.5 - 50$~keV whose X-ray slopes agree well with observations. For intermediate mass black holes, we find a soft X-ray excess created by inverse Compton scattering of low-energy photons produced in the thermal part of the disk; this mechanism may be relevant to the soft X-ray excess commonly seen in massive black holes. Thus, our results show that standard radiation physics applied to GRMHD simulation data can yield spectra reproducing a number of the observed properties of accreting black holes across the mass spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2601.03349.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03372",
      "title": "Multiwavelength Modeling of the Luminous Fast Blue Optical Transient AT2024wpp",
      "authors": [
        "Conor M. B. Omand",
        "Nikhil Sarin",
        "Gavin P. Lamb",
        "Daniel A. Perley",
        "Andrew Mummery",
        "Hamid Hamidani",
        "Steve Schulze",
        "Emma R. Beasor",
        "Aleksandra Bochenek",
        "Helena-Margaret S. Grabham",
        "Sorcha R. Kennelly",
        "Nguyen M. Khang",
        "Shiho Kobayashi",
        "Genevieve Schroeder",
        "William N. Stone",
        "Cairns Turnbull",
        "Jacob Wise"
      ],
      "abstract": "Multiwavelength Modeling of the Luminous Fast Blue Optical Transient AT2024wpp Conor M. B. Omand, Nikhil Sarin, Gavin P. Lamb, Daniel A. Perley, Andrew Mummery, Hamid Hamidani, Steve Schulze, Emma R. Beasor, Aleksandra Bochenek, Helena-Margaret S. Grabham, Sorcha R. Kennelly, Nguyen M. Khang, Shiho Kobayashi, Genevieve Schroeder, William N. Stone, Cairns Turnbull, Jacob Wise Submitted to MNRAS. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) Luminous fast blue optical transients (LFBOTs) are a growing class of enigmatic energetic transients. They show fast rises and declines, high temperatures throughout their evolution, and non-thermal emission in radio and X-rays. Their power source is currently unknown, but proposed models include engine-driven supernovae, interaction-powered supernovae, shock cooling emission, intermediate mass black hole tidal disruption events (IMBH TDEs), and Wolf-Rayet/black hole mergers, among others. AT2024wpp is the most optically luminous LFBOT to date and has been observed extensively at multiple wavelengths, including radio, optical, UV, and X-rays. We take models from multiple scenarios and fit them to the AT2024wpp optical, radio, and X-ray light curves to determine if which of these scenarios can best describe all aspects of the data. We show that none of the multiwavelength light curve models can reasonably explain the data, although other physical arguments favour a stellar mass/IMBH TDE of a low mass star and a synchrotron blast wave. We discuss how this scenario can be tested with late-time observations, and what other scenarios could possibly explain the broadband data.",
      "pdf_url": "https://arxiv.org/pdf/2601.03372.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03373",
      "title": "Late-Time Infrared Cooling in Magnetar-Driven Supernovae",
      "authors": [
        "Conor M. B. Omand"
      ],
      "abstract": "Late-Time Infrared Cooling in Magnetar-Driven Supernovae Conor M. B. Omand Submitted to MNRAS. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) A central magnetar engine is commonly invoked to explain energetic supernovae, which should have multiple signals in multiwavelength emission. Photoionization from the pulsar wind nebula (PWN) can create distinct spectroscopic signals in the nebular phase. Recent models suggest infrared emission, particularly from Ne II, can be prominent at late times. This work examines the cooling power of optical and infrared transitions to determine which lines contribute strongly to cooling and on what timescale. The models show infrared cooling becomes strong at $\\sim$ 3 years post-explosion and dominates by 6 years, with [Ne II] 12.8$\\mu$m being the strongest coolant. The fraction of total cooling in the infrared increases sharply once the PWN luminosity decreases below 10$^{40}$ erg s$^{-1}$, and this fraction also increases with increasing ejecta mass and decreasing average PWN photon energy. However, the emission from [Ne II] 12.8$\\mu$m increases with increasing PWN luminosity and increasing ejecta mass. Cooling at 1 year is dominated by optical O and S lines, with infrared Ar, Ni, and Ne lines becoming strong at 3 years. Optical cooling is almost negligible at 6 years, with the supernova cooling almost entirely through mid- and far-infrared transitions. JWST spectroscopy with MIRI should be able to detect these lines out to $z \\sim 0.1$. Supernovae with higher magnetic fields transition to infrared cooling on earlier timescales, while infrared-dominated supernovae should have strong emission from neutral atoms and emit strongly in radio at sub-decade timescales.",
      "pdf_url": "https://arxiv.org/pdf/2601.03373.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03696",
      "title": "Characteristics of the High-frequency Humps in the Black hole X-ray Binary Swift J1727.8--1613",
      "authors": [
        "Ze-Xi Li",
        "Liang Zhang",
        "Lian Tao",
        "Zi-Han Yang",
        "Qing-Chang Zhao",
        "Shu-Jie Zhao",
        "Rui-Can Ma",
        "Zi-Xu Yang",
        "Pan-Ping Li",
        "Xiang Ma",
        "Yue Huang",
        "Shu-Mei Jia",
        "Shuang-Nan Zhang",
        "Hua Feng",
        "Jin-Lu Qu",
        "Shu Zhang"
      ],
      "abstract": "Characteristics of the High-frequency Humps in the Black hole X-ray Binary Swift J1727.8--1613 Ze-Xi Li, Liang Zhang, Lian Tao, Zi-Han Yang, Qing-Chang Zhao, Shu-Jie Zhao, Rui-Can Ma, Zi-Xu Yang, Pan-Ping Li, Xiang Ma, Yue Huang, Shu-Mei Jia, Shuang-Nan Zhang, Hua Feng, Jin-Lu Qu, Shu Zhang High Energy Astrophysical Phenomena (astro-ph.HE) We present a detailed timing analysis of the two high-frequency humps observed in the power density spectrum of Swift J1727.8--1613 up to 100 keV, using data from the Hard X-ray Modulation Telescope (Insight-HXMT). Our analysis reveals that the characteristic frequencies of the humps increase with energy up to $\\sim30$ keV, followed by a plateau at higher energies. The fractional rms amplitudes of the humps increase with energy, reaching approximately 15\\% in the 50-100 keV band. The lag spectrum of the hump is characterized primarily by a soft lag that varies with energy. Our results suggest that the high-frequency humps originate from a corona close to the black hole. Additionally, by applying the relativistic precession model, we constrain the mass of Swift J1727.8--1613 to $2.84 < M / M_{\\odot} < 120.01$ and the spin to $0.14 < a < 0.43$ from the full-energy band dataset, using triplets composed of a type-C quasi-periodic oscillation and two high-frequency humps. When considering only the high-energy bands with stable characteristic frequencies, we derive additional constraints of $2.84 < M/M_{\\odot} < 13.98$ and $0.14 < a < 0.40$.",
      "pdf_url": "https://arxiv.org/pdf/2601.03696.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03861",
      "title": "Short gamma-ray burst progenitors have short delay times",
      "authors": [
        "Matteo Pracchia",
        "Om Sharan Salafia"
      ],
      "abstract": "Short gamma-ray burst progenitors have short delay times Matteo Pracchia, Om Sharan Salafia High Energy Astrophysical Phenomena (astro-ph.HE) Short gamma-ray bursts (SGRBs) are thought to be primarily associated with binary neutron star (BNS) mergers. The SGRB population can therefore be scrutinized to look for signatures of the delay time between the formation of the progenitor massive star binary and the eventual merger, which could produce an evolution of the cosmic rate density of such events whose shape departs from that of the cosmic star formation history (CSFH). To that purpose, we study a large sample of SGRBs within a hierarchical Bayesian framework, with a particular focus on the delay time distribution (DTD) of the population. Following previous studies, we model the DTD either as a power-law with a minimum time delay or as a log-normal function. We consider two models for the intrinsic SGRB luminosity distribution: an empirical luminosity function (ELF) with a doubly broken power-law shape, and one based on a quasi-universal structured jet (QUSJ) model. Regardless of the chosen parametrization, we find average time delays $10\\lesssim \\langle \\tau_\\mathrm{d}\\mathrm\\rangle/\\mathrm{Myr}\\lesssim 800$ and a minimum delay time $\\tau_\\mathrm{d,min}\\lesssim 350\\,\\mathrm{Myr}$, in contrast with previous studies that found long delay times of few Gyr. We demonstrate that the cause of the longer inferred time delays in past studies most likely resides in an incorrect treatment of selection effects.",
      "pdf_url": "https://arxiv.org/pdf/2601.03861.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03873",
      "title": "First detection of VHE gamma-ray signal from the FSRQ TON 0599",
      "authors": [
        "MAGIC Collaboration: K. Abe",
        "S. Abe",
        "J. Abhir",
        "A. Abhishek",
        "V. A. Acciari",
        "A. Aguasca-Cabot",
        "I. Agudo",
        "T. Aniello",
        "S. Ansoldi",
        "L. A. Antonelli",
        "A. Arbet Engels",
        "C. Arcaro",
        "K. Asano",
        "A. Babić",
        "U. Barres de Almeida",
        "J. A. Barrio",
        "L. Barrios-Jiménez",
        "I. Batković",
        "J. Baxter",
        "J. Becerra González",
        "W. Bednarek",
        "E. Bernardini",
        "J. Bernete",
        "A. Berti",
        "J. Besenrieder",
        "C. Bigongiari",
        "A. Biland",
        "O. Blanch",
        "G. Bonnoli",
        "Ž. Bošnjak",
        "E. Bronzini",
        "I. Burelli",
        "A. Campoy-Ordaz",
        "A. Carosi",
        "R. Carosi",
        "M. Carretero-Castrillo",
        "A. J. Castro-Tirado",
        "D. Cerasole",
        "G. Ceribella",
        "Y. Chai",
        "A. Cifuentes",
        "J. L. Contreras",
        "J. Cortina",
        "S. Covino",
        "G. D'Amico",
        "P. Da Vela",
        "F. Dazzi",
        "A. De Angelis",
        "B. De Lotto",
        "R. de Menezes",
        "M. Delfino",
        "J. Delgado",
        "C. Delgado Mendez",
        "F. Di Pierro",
        "R. Di Tria",
        "L. Di Venere",
        "A. Dinesh",
        "D. Dominis Prester",
        "A. Donini",
        "D. Dorner",
        "M. Doro",
        "L. Eisenberger",
        "D. Elsaesser",
        "J. Escudero",
        "L. Foffano",
        "L. Font",
        "S. Fröse",
        "S. Fukami",
        "Y. Fukazawa",
        "M. Garczarczyk",
        "S. Gasparyan",
        "M. Gaug",
        "J. G. Giesbrecht Paiva",
        "N. Giglietto",
        "F. Giordano",
        "P. Gliwny",
        "N. Godinović",
        "T. Gradetzke",
        "R. Grau",
        "D. Green",
        "J. G. Green",
        "P. Günther",
        "D. Hadasch",
        "A. Hahn",
        "T. Hassan",
        "L. Heckmann",
        "J. Herrera Llorente",
        "D. Hrupec",
        "R. Imazawa",
        "D. Israyelyan",
        "I. Jiménez Martínez",
        "J. Jiménez Quiles",
        "J. Jormanainen",
        "S. Kankkunen",
        "D. Kerszberg",
        "M. Khachatryan",
        "J. Konrad",
        "P. M. Kouch",
        "H. Kubo"
      ],
      "abstract": "First detection of VHE gamma-ray signal from the FSRQ TON 0599 MAGIC Collaboration: K. Abe (1), S. Abe (2), J. Abhir (3), A. Abhishek (4), V. A. Acciari (5), A. Aguasca-Cabot (6), I. Agudo (7), T. Aniello (8), S. Ansoldi (9, 42), L. A. Antonelli (8), A. Arbet Engels (10), C. Arcaro (11), K. Asano (2), A. Babić (12), U. Barres de Almeida (13), J. A. Barrio (14), L. Barrios-Jiménez (15), I. Batković (11), J. Baxter (2), J. Becerra González (15), W. Bednarek (16), E. Bernardini (11), J. Bernete (17), A. Berti (10), J. Besenrieder (10), C. Bigongiari (8), A. Biland (3), O. Blanch (5), G. Bonnoli (8), Ž. Bošnjak (12), E. Bronzini (8), I. Burelli (5), A. Campoy-Ordaz (18), A. Carosi (8), R. Carosi (19), M. Carretero-Castrillo (6), A. J. Castro-Tirado (7), D. Cerasole (20), G. Ceribella (10), Y. Chai (2), A. Cifuentes (17), J. L. Contreras (14), J. Cortina (17), S. Covino (8, 43), G. D'Amico (21), P. Da Vela (8), F. Dazzi (8), A. De Angelis (11), B. De Lotto (9), R. de Menezes (22), M. Delfino (5, 44), J. Delgado (5, 44), C. Delgado Mendez (17), F. Di Pierro (22), R. Di Tria (20), L. Di Venere (20), A. Dinesh (14), D. Dominis Prester (23), A. Donini (8), D. Dorner (24), M. Doro (11), L. Eisenberger (24), D. Elsaesser (25), J. Escudero (7), L. Foffano (8), L. Font (18), S. Fröse (25), S. Fukami (3), Y. Fukazawa (26), M. Garczarczyk (27), S. Gasparyan (28), M. Gaug (18), J. G. Giesbrecht Paiva (13), N. Giglietto (20), F. Giordano (20), P. Gliwny (16), N. Godinović (29), T. Gradetzke (25), R. Grau (5), D. Green (10), J. G. Green (10), P. Günther (24), D. Hadasch (2), A. Hahn (10), T. Hassan (17), L. Heckmann (10, 45), J. Herrera Llorente (15), D. Hrupec (30), R. Imazawa (26), D. Israyelyan (28), I. Jiménez Martínez (10), J. Jiménez Quiles (5), J. Jormanainen (31), S. Kankkunen (31), D. Kerszberg (5), M. Khachatryan (28), J. Konrad (25), P. M. Kouch (31), H. Kubo 17 pages, 8 figures, 8 tables, accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) TON 0599 (z=0.7247) belongs to the few flat spectrum radio quasars (FSRQs) detected in the very high energy (VHE, $E > 100$ GeV) gamma-ray band. Its redshift makes it currently one of the farthest VHE gamma-ray sources. It was detected for the first time with the MAGIC telescopes on 2017 December 15, and observed until December 29. The flux reached a maximum of about 50 per cent of the Crab Nebula flux above 80 GeV on the second night of observation, after which we witnessed a gradual decrease of the flux. The VHE gamma-ray spectrum connects smoothly to the one in the high energy ($E > 100$ MeV) band obtained from simultaneous observations with Fermi-LAT. It features a cut-off at energies around 50 GeV, indicating the location of the gamma-ray emission zone beyond the broad line region. In addition, we were able to follow the spectral evolution during the fading phase of the flare. Multiwavelength analysis based on observations in optical, near-infrared, and radio bands acquired by the Whole Earth Blazar Telescope (WEBT) Collaboration from November to March, as well as observations in X-ray and optical$-$UV bands with instruments on board the Swift satellite, shows strong correlation between different bands. We model the broadband emission with a simple one-zone leptonic model, where the high-energy peak is predominantly produced by external Compton (EC) scattering of photons from the dusty torus.",
      "pdf_url": "https://arxiv.org/pdf/2601.03873.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03939",
      "title": "Search for gamma-ray variability around Fermi-LAT pulsar glitches",
      "authors": [
        "Giovanni Cozzolongo",
        "Alessio Fiori",
        "Massimiliano Razzano",
        "Pablo M. Saz Parkinson"
      ],
      "abstract": "Search for gamma-ray variability around Fermi-LAT pulsar glitches Giovanni Cozzolongo, Alessio Fiori, Massimiliano Razzano, Pablo M. Saz Parkinson This paper has been accepted by A&A Astron. Astrophys. 702 (2025) A60 High Energy Astrophysical Phenomena (astro-ph.HE) Pulsars are the most numerous class of Galactic gamma-ray sources detected by the Fermi Large Area Telescope (LAT). Young pulsars occasionally experience sudden timing discontinuities called glitches, characterized by rapid changes in rotational parameters, usually followed by a return to regular rotation. PSR J2021+4026 is unique among Fermi-LAT pulsars, exhibiting quasiperiodic switches between two states with varying spin-down rates approximately every 3-4 years, correlated with sudden changes in gamma-ray emission features. This study searched for gamma-ray emission variability in pulsars correlated with glitch occurrence. We introduced a novel approach to analyzing LAT gamma-ray pulsars through systematic examination of variability associated with spin-down rate changes. We tracked rotation and gamma-ray emission changes for seven promising glitches selected based on observed spin-down rate variations. Using 14 years of Fermi-LAT data, we conducted binned likelihood spectral analysis of data windows around selected glitch epochs. We improved best-fit parameter precision by incorporating likelihood weights calculated from diffuse background models, accounting for systematic error contributions. The phase-averaged flux and spectral parameters of analyzed pulsars showed no significant variation across investigated glitches. The 95% upper limits on relative flux change indicate the Vela pulsar flux is unchanging, with a 0.5% upper limit on relative change, making it promising for further searches. The connection between glitch dynamics and gamma-ray emission remains unclear, and PSR J2021+4026 remains unique in its gamma-ray variability properties. We conclude that comprehensive investigation of glitches is warranted to further unravel their underlying mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2601.03939.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03950",
      "title": "Evidence for a Damped Millisecond Quasi-Periodic Structure in a Fast Radio Burst",
      "authors": [
        "Shuo Xiao",
        "Zheng-Huo Jiang",
        "Di Li"
      ],
      "abstract": "Evidence for a Damped Millisecond Quasi-Periodic Structure in a Fast Radio Burst Shuo Xiao, Zheng-Huo Jiang, Di Li High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs) are millisecond-duration transients of unknown origin, likely associated with compact astrophysical objects. We report evidence for a damped millisecond quasi-periodic structure in a non-repeat FRB~20190122C. The burst consists of eight closely spaced radio pulses separated by $\\sim$1 ms, with pulse amplitudes exhibiting an exponential decay starting from the brightest component. Combined Gaussian fitting and time-series analysis reveal a quasi-periodic oscillation (QPO) at $\\sim$1 kHz. The observed QPO is consistent with damped magnetospheric oscillations. Assuming an Alfvén wave origin, we estimate a surface magnetic field of $\\sim 10^{12}$ G and a characteristic spin period of $\\sim$1 s, favoring a low-field magnetar or young neutron star scenario. The absence of frequency drift and the presence of exponential damping disfavor a merger-driven origin. These results suggest the first detection of an exponentially decaying QPO in any FRB, marking a rare detection of coherent oscillatory behavior in FRBs.",
      "pdf_url": "https://arxiv.org/pdf/2601.03950.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03962",
      "title": "Exploring the potential for ultra-relativistic jets in Scorpius X-1 with low angular resolution radio observations",
      "authors": [
        "I. Stephens",
        "L. Rhodes",
        "A.J. Cooper",
        "S.E. Motta",
        "J.S. Bright"
      ],
      "abstract": "Exploring the potential for ultra-relativistic jets in Scorpius X-1 with low angular resolution radio observations I. Stephens, L. Rhodes, A.J. Cooper, S.E. Motta, J.S. Bright 6 pages, 6 Figures, 3 Tables. Accepted in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Scorpius X-1 (Sco X-1) is a neutron star X-ray binary in which the neutron star is accreting rapidly from a low mass stellar companion. At radio frequencies, Sco X-1 is highly luminous and has been observed to have jet ejecta moving at mildly relativistic velocities away from a radio core, which corresponds to the binary position. In this Letter, we present new radio observations of Sco X-1 taken with the Karl G. Jansky Very Large Array. Using a fast imaging method, we find that the 10 and 15GHz data show a number of flares. We interpret these flares as the possible launching of fast jets ($\\beta\\Gamma$>2), previously observed in Sco X-1 and called ultra-relativistic flows, and their interaction with slower moving jet ejecta. Using the period between successive flares, we find that it is possible for the fast jets to remain undetected, as a result of the fast jet velocity being sufficiently high to cause the jet emission to be beamed in the direction of the motion and out of our line of sight. Our findings demonstrate that the ultra-relativistic flows could be explained by the presence of fast jets in the Sco X-1 system.",
      "pdf_url": "https://arxiv.org/pdf/2601.03962.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04129",
      "title": "Satellite-borne γ-ray astrophysics from coherent interactions in oriented crystals",
      "authors": [
        "Pietro Monti-Guarnieri",
        "Gianfranco Paternò",
        "Alexei Sytov",
        "Elisabetta Cavazzuti",
        "Luigi Costamante",
        "Sara Cutini",
        "Matteo Duranti",
        "Pierluigi Fedeli",
        "Richard J. Gaitskell",
        "Vincenzo Guidi",
        "Viktar Haurylavets",
        "Savvas M. Koushiappas",
        "Francesco Longo",
        "Sofia Mangiacavalli",
        "Andrea Mazzolari",
        "Michela Prest",
        "Marco Romagnoni",
        "Alessia Selmi",
        "Victor Tikhomirov",
        "Valerio Vagelli",
        "Erik Vallazza",
        "Laura Bandiera"
      ],
      "abstract": "Satellite-borne γ-ray astrophysics from coherent interactions in oriented crystals Pietro Monti-Guarnieri, Gianfranco Paternò, Alexei Sytov, Elisabetta Cavazzuti, Luigi Costamante, Sara Cutini, Matteo Duranti, Pierluigi Fedeli, Richard J. Gaitskell, Vincenzo Guidi, Viktar Haurylavets, Savvas M. Koushiappas, Francesco Longo, Sofia Mangiacavalli, Andrea Mazzolari, Michela Prest, Marco Romagnoni, Alessia Selmi, Victor Tikhomirov, Valerio Vagelli, Erik Vallazza, Laura Bandiera High Energy Astrophysical Phenomena (astro-ph.HE) High-density and high-Z crystals are a key element of most space-borne $\\gamma$-ray telescopes operating at GeV energies (such as Fermi-LAT). The lattice structure is usually neglected in the development of a crystalline detector, although its effects on the energy deposit development should be taken into account, since the interactions of a high energy ($\\sim$~GeV) photon or e$^\\pm$ impinging along the axis of an oriented crystal are different than the ones observed in a fully isotropic medium. Specifically, if the angle between a photon (e$^\\pm$) trajectory and the crystal axis is smaller than $\\sim$ 0.1$^\\circ$, a large enhancement of the pair production (bremsstrahlung) cross-section is observed. Consequently, a photon-induced shower inside an oriented crystal develops within a much more compact region than in an amorphous medium. Moreover, for photon energies above a few GeV and incidence angles up to several degrees, the pair-production cross-section exhibits a pronounced dependence on the angle between the crystal axis and the photon polarization vector. \\\\ In this work we show that these effects could be exploited to develop a novel class of light-weight pointing space-borne $\\gamma$-ray telescopes, capable of achieving an improved sensitivity and resolution, thanks to a better shower containment in a smaller volume with respect to non-oriented crystalline detectors. We also show that an oriented tracker-converter system could be used to measure the polarization of a $\\gamma$-ray source above few GeV, in a regime that remains unexplorable through any other detection technique. This novel detector concept could open new pathways in the study of the physics of extreme astrophysical environments and potentially improve the detector sensitivity for indirect Dark Matter searches in space.",
      "pdf_url": "https://arxiv.org/pdf/2601.04129.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04141",
      "title": "Implications of Non-equatorial Relativistic Accretion Flows for Ultra-Fast Inflows in AGNs",
      "authors": [
        "Keigo Fukumura",
        "Alessandro Peca",
        "Roberto Serafinelli",
        "Mauro Dadina"
      ],
      "abstract": "Implications of Non-equatorial Relativistic Accretion Flows for Ultra-Fast Inflows in AGNs Keigo Fukumura, Alessandro Peca, Roberto Serafinelli, Mauro Dadina accepted to ApJ (11 pages, 4 figures) High Energy Astrophysical Phenomena (astro-ph.HE) Motivated by a number of X-ray observations of active galactic nuclei (AGNs) that exhibit a potential signature of ultra-fast inflows (UFIs), we consider in this work a scenario that UFIs can be physically identified as weakly-magnetized hydrodynamic accretion flows that is guided and channeled by poloidal magnetic field into low-to-mid latitude above the equatorial disk. In the context of general relativistic hydrodynamics (GRHD) under a weak-field limit in Kerr spacetime, we present a set of preliminary results by numerically calculating the physical property of GRHD flows (e.g. kinematics and density distribution) in an effort to simulate redshifted absorption line spectra. Our model demonstrates that such GRHD accretion off the equatorial plane (i.e. $v \\gsim 0.1c$ where $c$ is the speed of light in the vicinity of AGN closer than $\\sim 100$ \\sw radii) can manifest itself as UFIs in the form of redshifted absorption signature assuming the observed characteristics such as column density of $N_H \\sim 10^{23}$ cm$^{-2}$ and ionization parameter of $\\log (\\xi \\rm{[erg~cm~s^{-1}])} \\sim 3$ as also seen in recent multi-epoch {\\it NuSTAR} observations among other data.",
      "pdf_url": "https://arxiv.org/pdf/2601.04141.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04156",
      "title": "A spectroscopically confirmed, strongly lensed, metal-poor Type II supernova at z = 5.13",
      "authors": [
        "David A. Coulter",
        "Conor Larison",
        "Justin D. R. Pierel",
        "Seiji Fujimoto",
        "Vasily Kokorev",
        "Joseph F. V. Allingham",
        "Takashi J. Moriya",
        "Matthew Siebert",
        "Yoshihisa Asada",
        "Rachel Bezanson",
        "Maruša Bradač",
        "Gabriel Brammer",
        "John Chisholm",
        "Dan Coe",
        "Pratika Dayal",
        "Michael Engesser",
        "Steven L. Finkelstein",
        "Ori D. Fox",
        "Lukas J. Furtak",
        "Anton M. Koekemoer",
        "Thomas Moore",
        "Minami Nakane",
        "Masami Ouchi",
        "Richard Pan",
        "Robert Quimby",
        "Armin Rest",
        "Johan Richard",
        "Luke Robbins",
        "Louis-Gregory Strolger",
        "Fengwu Sun",
        "Tommaso Treu",
        "Hiroto Yanagisawa",
        "Abdurro'uf",
        "Aadya Agrawal",
        "Ricardo Amorín",
        "Joseph P. Anderson",
        "Rodrigo Angulo",
        "Hakim Atek",
        "Franz E. Bauer",
        "Larry D. Bradley",
        "Volker Bromm",
        "Mateusz Bronikowski",
        "Christopher J. Conselice",
        "Christa DeCoursey",
        "James M. DerKacy",
        "Guillaume Desprez",
        "Suhail Dhawan",
        "Jose M. Diego",
        "Eiichi Egami",
        "Andreas Faisst",
        "Brenda Frye",
        "Sebastian Gomez",
        "Mauro González-Otero",
        "Massimo Griggio",
        "Yuichi Harikane",
        "Kohei Inayoshi",
        "Saurabh W. Jha",
        "Yolanda Jiménez-Teja",
        "Jeyhan S. Kartaltepe",
        "Patrick L. Kelly",
        "Lindsey A. Kwok",
        "Zachary G. Lane",
        "Xiaolong Li",
        "Ivo Lobbe",
        "Ray A. Lucas",
        "Georgios E. Magdis",
        "Nicholas S. Martis",
        "Jorryt Matthee",
        "Ashish K. Meena",
        "Rohan P. Naidu",
        "Gaël Noirot",
        "Masamune Oguri",
        "Estefania Padilla Gonzalez",
        "Massimo Pascale",
        "Tanja Petrushevska",
        "Massimo Ricotti",
        "Daniel Schaerer",
        "Stefan Schuldt",
        "Melissa Shahbandeh",
        "William Sheu",
        "Koji Shukawa",
        "Akiyoshi Tsujita",
        "Eros Vanzella",
        "Qinan Wang",
        "John Weaver",
        "Rogier Windhorst",
        "Yi Xu",
        "Yossef Zenati",
        "Adi Zitrin"
      ],
      "abstract": "A spectroscopically confirmed, strongly lensed, metal-poor Type II supernova at z = 5.13 David A. Coulter, Conor Larison, Justin D. R. Pierel, Seiji Fujimoto, Vasily Kokorev, Joseph F. V. Allingham, Takashi J. Moriya, Matthew Siebert, Yoshihisa Asada, Rachel Bezanson, Maruša Bradač, Gabriel Brammer, John Chisholm, Dan Coe, Pratika Dayal, Michael Engesser, Steven L. Finkelstein, Ori D. Fox, Lukas J. Furtak, Anton M. Koekemoer, Thomas Moore, Minami Nakane, Masami Ouchi, Richard Pan, Robert Quimby, Armin Rest, Johan Richard, Luke Robbins, Louis-Gregory Strolger, Fengwu Sun, Tommaso Treu, Hiroto Yanagisawa, Abdurro'uf, Aadya Agrawal, Ricardo Amorín, Joseph P. Anderson, Rodrigo Angulo, Hakim Atek, Franz E. Bauer, Larry D. Bradley, Volker Bromm, Mateusz Bronikowski, Christopher J. Conselice, Christa DeCoursey, James M. DerKacy, Guillaume Desprez, Suhail Dhawan, Jose M. Diego, Eiichi Egami, Andreas Faisst, Brenda Frye, Sebastian Gomez, Mauro González-Otero, Massimo Griggio, Yuichi Harikane, Kohei Inayoshi, Saurabh W. Jha, Yolanda Jiménez-Teja, Jeyhan S. Kartaltepe, Patrick L. Kelly, Lindsey A. Kwok, Zachary G. Lane, Xiaolong Li, Ivo Lobbe, Ray A. Lucas, Georgios E. Magdis, Nicholas S. Martis, Jorryt Matthee, Ashish K. Meena, Rohan P. Naidu, Gaël Noirot, Masamune Oguri, Estefania Padilla Gonzalez, Massimo Pascale, Tanja Petrushevska, Massimo Ricotti, Daniel Schaerer, Stefan Schuldt, Melissa Shahbandeh, William Sheu, Koji Shukawa, Akiyoshi Tsujita, Eros Vanzella, Qinan Wang, John Weaver, Rogier Windhorst, Yi Xu, Yossef Zenati, Adi Zitrin High Energy Astrophysical Phenomena (astro-ph.HE) Observing supernovae (SNe) in the early Universe (z > 3) provides a window into how both galaxies and individual stars have evolved over cosmic time, yet a detailed study of high-redshift stars and SNe has remained difficult due to their extreme distances and cosmological redshifting. To overcome the former, searches for gravitationally lensed sources allow for the discovery of magnified SNe that appear as multiple images - further providing the opportunity for efficient follow-up. Here we present the discovery of \"SN Eos\": a strongly lensed, multiply-imaged, SN II at a spectroscopic redshift of z = 5.133 +/- 0.001. SN Eos exploded in a Lyman-{\\alpha} emitting galaxy when the Universe was only ~1 billion years old, shortly after it reionized and became transparent to ultraviolet radiation. A year prior to our discovery in JWST data, archival HST imaging of SN Eos reveals rest-frame far ultraviolet (~1,300Å) emission, indicative of shock breakout or interaction with circumstellar material in the first few (rest-frame) days after explosion. The JWST spectroscopy of SN Eos, now the farthest spectroscopically confirmed SN ever discovered, shows that SN Eos's progenitor star likely formed in a metal-poor environment (<= 0.1 Z_{\\odot}), providing the first direct evidence of massive star formation in the metal-poor, early Universe. SN Eos would not have been detectable without the extreme lensing magnification of the system, highlighting the potential of such discoveries to eventually place constraints on the faint end of the cosmic star-formation rate density in the very early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2601.04156.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04179",
      "title": "GRB 180728A and SN 2018fip: the nearest high-energy cosmological gamma-ray burst with an associated supernova",
      "authors": [
        "A. Rossi",
        "L. Izzo",
        "K. Maeda",
        "P. Schady",
        "D.B. Malesani",
        "D. A. Kann",
        "S. Klose",
        "L. Amati",
        "P. D'Avanzo",
        "A. de Ugarte Postigo",
        "K. E. Heintz",
        "A. Kumar",
        "V. Lipunov",
        "A. Martin-Carrillo",
        "A. Melandri",
        "A. M. Nicuesa Guelbenzu",
        "S.R. Oates",
        "S. Schulze",
        "J. Selsing",
        "R. L. C. Starling",
        "G. Stratta",
        "D. Vlasenko",
        "P. Balanutsa",
        "R. Brivio",
        "V. D'Elia",
        "B. Milvang-Jensen",
        "E. Palazzi",
        "D. A. Perley",
        "A. Rau",
        "J. Sollerman",
        "N. R. Tanvir",
        "T. Zafar"
      ],
      "abstract": "GRB 180728A and SN 2018fip: the nearest high-energy cosmological gamma-ray burst with an associated supernova A. Rossi, L. Izzo, K. Maeda, P. Schady, D.B. Malesani, D. A. Kann, S. Klose, L. Amati, P. D'Avanzo, A. de Ugarte Postigo, K. E. Heintz, A. Kumar, V. Lipunov, A. Martin-Carrillo, A. Melandri, A. M. Nicuesa Guelbenzu, S.R. Oates, S. Schulze, J. Selsing, R. L. C. Starling, G. Stratta, D. Vlasenko, P. Balanutsa, R. Brivio, V. D'Elia, B. Milvang-Jensen, E. Palazzi, D. A. Perley, A. Rau, J. Sollerman, N. R. Tanvir, T. Zafar 21 pages, 21 figures, 6 tables, submitted to Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) The long GRB 180728A, at a redshift of $z = 0.1171$, stands out due to its high isotropic energy of $E_{\\gamma,iso} \\sim 2.5 \\times 10^{51}$ erg, in contrast with most events at redshift $z<0.2$. We analyze the properties of GRB 180728A's prompt emission, afterglow, and associated supernova SN 2018fip, comparing them with other GRB-SN events. This study employs a dense photometric and spectroscopic follow-up of the afterglow and the SN up to 80 days after the burst, supported by image subtraction to remove the presence of a nearby bright star, and modelling of both the afterglow and the supernova. GRB 180728A lies on the $E_{p,i}-E_{\\gamma,iso}$ plane occupied by classical collapsar events, and the prompt emission is one of the most energetic at $z < 0.2$ after GRB 030329 and GRB 221009A. The afterglow of GRB 180728A is less luminous than that of most long GRBs, showing a shallow early phase that steepens around 5 hours (0.2 days). The GRB exploded in an irregular, low-mass, blue, star-forming galaxy, typical of low-z collapsar events. Because of the relatively faint afterglow, the light curve bump of SN 2018fip dominates the optical emission already after $\\sim$3 days and is one of the best sampled to date. The strong suppression below $\\sim$ 4000 angstrom and a largely featureless continuum in the early 6--9 days spectra favor aspherical two-component ejecta with a high-velocity collimated component ($> 20,000 km s^{-1}$), dominant early-on, and a more massive, low-velocity component, which dominates at much later epochs. Our findings indicate that asymmetries need to be considered in order to better understand GRB-SNe. In any case, SN 2018fip shares many characteristics with typical GRB-SNe. Its kinetic energy is below the common range of $10^{52}-10^{53}$ erg and does not correlate with the high energy of the GRB, highlighting the diversity of the GRB-SN energy budget partition.",
      "pdf_url": "https://arxiv.org/pdf/2601.04179.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03344",
      "title": "Non-thermal particle acceleration in multi-species kinetic plasmas: universal power-law distribution functions and temperature inversion in the solar corona",
      "authors": [
        "Uddipan Banik",
        "Amitava Bhattacharjee"
      ],
      "abstract": "Non-thermal particle acceleration in multi-species kinetic plasmas: universal power-law distribution functions and temperature inversion in the solar corona Uddipan Banik, Amitava Bhattacharjee Submitted to Physics of Plasmas (invited paper for the 67th Annual Meeting of the APS Division of Plasma Physics); 20 pages, 7 figures, 1 table; comments welcome Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) The origin of non-thermal power-law distribution functions ubiquitously observed in astrophysical/space (e.g., the solar wind) and laboratory kinetic plasmas, is not well understood. Another puzzling phenomenon is temperature inversion in the solar corona. These two issues are deeply connected. We develop a self-consistent quasilinear theory (QLT) for electromagnetically driven kinetic plasmas, deriving a Fokker-Planck equation for the simultaneous relaxation of multiple species, with (i) a drive diffusion coefficient for the heating of dressed particles directly by the drive and indirectly by waves, and (ii) Balescu-Lenard diffusion and drag coefficients for internal turbulence and Coulomb collisions. Both electron and ion distributions relax towards a universal attractor with a $v^{-5}$ $(E^{-2})$ tail, akin to a $\\kappa = 1.5$ distribution, under a super-Debye (but sub-Larmor) drive with a steep power-spectrum. This is an outcome of Debye screening: large-scale fields accelerate the unscreened, fast particles but not the screened, slow ones. The universality may be broken by shallow power-spectra and incomplete relaxation. Collisions cannot decelerate suprathermal particles, rendering a high $v$ tail immune to Maxwellianization. Such a tail may be generated in the solar corona by chromospheric convection despite collisional losses. The suprathermal particles escape sun's gravity (velocity filtration), inverting the temperature profile and raising it to $10^6$ K. A proper analysis of velocity filtration with a $\\kappa \\approx 1.5-2$ distribution inspired by QLT provides a reasonable fit to the spectroscopic data of heavy ions and explains the abrupt temperature rise, a consequence of the divergence of pressure in the $\\kappa \\to 1.5$ limit.",
      "pdf_url": "https://arxiv.org/pdf/2601.03344.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03611",
      "title": "Particle Acceleration and Depolarization in the Protostellar jet knots HH 80 and HH 81",
      "authors": [
        "A. G. Cheriyan",
        "S. Vig",
        "Nirupam Roy",
        "Samir Mandal",
        "C. Carrasco-González",
        "A. Rodríguez-Kamenetzky",
        "A. Pasetto"
      ],
      "abstract": "Particle Acceleration and Depolarization in the Protostellar jet knots HH 80 and HH 81 A. G. Cheriyan, S. Vig, Nirupam Roy, Samir Mandal, C. Carrasco-González, A. Rodríguez-Kamenetzky, A. Pasetto 9 pages, 2 figures, Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Linearly polarized emission is a powerful tracer of magnetic field geometry and particle acceleration in protostellar jets. We present a polarimetric study of the HH objects HH 80 and HH 81 from where non-thermal emission has been confirmed through spectral index measurements at low frequencies. We carried out observations of HH 80 and HH 81 with the Karl G. Jansky Very Large Array in 4-6 GHz. Unlike the inner jet knots, no linear polarization is detected towards the knots HH 80 and HH 81. We place a $3\\sigma$ upper limit of $30~\\mu$Jy on the polarization intensity, corresponding to fractional polarization limits of $\\Pi_{\\max}\\approx0.02$ and $0.01$ for HH 80 and HH 81, respectively. To interpret this non-detection, we assess the conditions for synchrotron polarization and the impact of depolarization mechanisms. The shock cooling parameter $\\chi_\\mathrm{s}$ is lower in these outermost HH objects than in the inner knots, indicating that the reverse shocks in HH 80-81 are less efficient at accelerating relativistic electrons compared with the inner knots. Moreover, Faraday depolarization appears severe: the dispersion in the estimated rotation measure $\\sigma_{\\rm RM}\\sim400~\\mathrm{rad~m^{-2}}$ is comparable to or larger than observed RM values themselves. This is consistent with strong fluctuations and turbulence. Together with beam depolarization, these effects can suppress the observable fractional polarization flux densities below the detectable thresholds. We conclude that reduced acceleration efficiency (when compared to inner knots) and strong depolarization account for the absence of polarized emission towards HH 80 and HH 81.",
      "pdf_url": "https://arxiv.org/pdf/2601.03611.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03810",
      "title": "The massive hot subdwarf binary LAMOST J065816.72+094343.1",
      "authors": [
        "F. Mattig",
        "B. N. Barlow",
        "D. Liu",
        "M. Dorsch",
        "S. Geier",
        "M. Pritzkuleit",
        "H. Dawson",
        "B. Wang",
        "V. Schaffenroth",
        "T. Kupfer",
        "C. Derbyshire",
        "S. Barocci-Faul"
      ],
      "abstract": "The massive hot subdwarf binary LAMOST J065816.72+094343.1 F. Mattig, B. N. Barlow, D. Liu, M. Dorsch, S. Geier, M. Pritzkuleit, H. Dawson, B. Wang, V. Schaffenroth, T. Kupfer, C. Derbyshire, S. Barocci-Faul 8 pages, 7 figures. Accepted for publication in Astronomy & Astrophysics on 18 December 2025 Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Massive short-period binaries involving hot subdwarf stars (sdO/Bs) are rare but important to constraining pathways for binary star evolution. Moreover, some of the most promising candidate progenitor systems leading to Type Ia supernovae (SNe Ia) involve sdO/Bs. LAMOST J065816.72+094343.1 has been identified as such a candidate. To explore the nature and evolutionary future of LAMOST J065816.72+094343.1, we complemented archival spectroscopic data with additional time series spectra and high-resolution spectroscopy of the object. After combining these with photometric data, we determined the orbital parameters of the system and the mass of the companion. We solved the orbit of the system by analyzing 68 low- and medium-resolution spectra using state-of-the-art mixed local thermodynamic equilibrium (LTE) and non-LTE model atmospheres. Additionally, we gathered nine high-resolution spectra to determine atmospheric parameters and the projected rotational velocity of the sdOB. The inclination angle of the system was constrained assuming tidal synchronization of the sdOB, which was verified via analysis of the ellipsoidal variations in the TESS light curve. We determine LAMOSTJ065816.72+094343.1 to be a binary consisting of a massive $0.82 \\pm 0.17 \\mathrm{M}_{\\odot}$ sdOB component with a $1.30^{+0.31}_{-0.26} \\mathrm{M}_{\\odot}$ unseen companion. Due to the companion's mass being very close to the Chandrasekhar mass limit and high for a white dwarf, it is unclear whether it is a white dwarf or a neutron star. We find the system to be in a close orbit, with a period of $P=0.31955193 \\mathrm{d}$ and an inclination angle of $i = 49.6^{+5.2}_{-4.2} \\mathrm{deg}$. While the exact nature of the companion remains unknown, we determine the system to either lead to a SN Ia or an intermediate mass binary pulsar, potentially after a phase as an intermediate-mass X-ray binary.",
      "pdf_url": "https://arxiv.org/pdf/2601.03810.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03921",
      "title": "Science with a large field-of-view polarization survey: The Large Array Survey Telescope Polarization Node (LAST-P)",
      "authors": [
        "V. Barbosa Martins",
        "N. Jordana Mitjans",
        "S. Garrappa",
        "A. Franckowiak",
        "E. O. Ofek",
        "S. Ben-Ami",
        "J. Borowska-Naguszewska",
        "V. Fallah Ramazani",
        "R. Konno",
        "D. Kuesters",
        "R.D. Parsons",
        "D. Polishook",
        "I. Sadeh",
        "O. Savushkin",
        "E. Segre",
        "N. Strotjohann",
        "S. Weimann"
      ],
      "abstract": "Science with a large field-of-view polarization survey: The Large Array Survey Telescope Polarization Node (LAST-P) V. Barbosa Martins, N. Jordana Mitjans, S. Garrappa, A. Franckowiak, E. O. Ofek, S. Ben-Ami, J. Borowska-Naguszewska, V. Fallah Ramazani, R. Konno, D. Kuesters, R.D. Parsons, D. Polishook, I. Sadeh, O. Savushkin, E. Segre, N. Strotjohann, S. Weimann Accepted for publication in Publications of the Astronomical Society of the Pacific (PASP) on January 6, 2026. Corresponding authors: V. Barbosa Martins, N. Jordana Mitjans, S. Garrappa, A. Franckowiak, E. O. Ofek Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) Optical polarimetry provides information on the geometry of the emitting region, the magnetic field configuration and the properties of dust in astrophysical sources. Current state-of-the-art instruments typically have a small field of view (FoV), which poses a challenge for conducting wide surveys. We propose the construction of the Large Array Survey Telescope Polarization Node (LAST-P), a wide-field array of optical polarimeters. LAST-P is designed for high-cadence ($\\lesssim 1$ day) polarization monitoring of numerous astrophysical transients, such as the early phases of gamma-ray bursts, supernovae, and novae. Furthermore, LAST-P will facilitate the creation of extensive polarization catalogs for X-ray binaries and white dwarfs, alongside a large FoV study of the interstellar medium. In survey mode, LAST-P will cover a FoV of 88.8 deg$^2$. With a 15 x 1-minute exposure, the instrument will be capable of measuring polarization of sources as faint as Gaia Bp-magnitude $\\sim$20.9. The precision on the linear polarization degree (PD) will reach 0.7\\%, 1.5\\%, and 3.5\\% for sources with magnitudes 17, 18, and 19, respectively, for a seeing of 2.7 arcsec, air mass of about 1 for observations in dark locations. We propose three distinct non-simultaneous survey strategies, among them an active galactic nuclei (AGN) strategy for long-term monitoring of $\\sim$200 AGN with $<$1-day cadence. In this paper, we present the predicted sensitivity of the instrument and outline the various science cases it is designed to explore.",
      "pdf_url": "https://arxiv.org/pdf/2601.03921.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04007",
      "title": "Stellar-mass black holes on the millimetre fundamental plane of black hole accretion",
      "authors": [
        "Jacob S. Elford",
        "Ilaria Ruffa",
        "Timothy A. Davis",
        "Martin Bureau",
        "Rob Fender",
        "Jindra Gensior",
        "Thomas Williams",
        "Hengyue Zhang"
      ],
      "abstract": "Stellar-mass black holes on the millimetre fundamental plane of black hole accretion Jacob S. Elford, Ilaria Ruffa, Timothy A. Davis, Martin Bureau, Rob Fender, Jindra Gensior, Thomas Williams, Hengyue Zhang 8 pages, 4 figures; accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Recent work revealed the existence of a galaxy \"millimetre fundamental plane of black hole accretion\", a tight correlation between nuclear $1$mm luminosity, intrinsic $2$ - $10$keV X-ray luminosity and supermassive black hole mass, originally discovered for nearby low- and high-luminosity active galactic nuclei. Here we use mm and X-ray data of $5$ X-ray binaries (XRBs) to demonstrate that these stellar-mass black holes also lie on the mm fundamental plane, as they do at radio wavelengths. One source for which we have multi-epoch observations shows evidence of deviations from the plane after a state change, suggesting that the plane only applies to XRBs in the hard state, as is true again at radio wavelengths. We show that both advection-dominated accretion flows and compact jet models predict the existence of the plane across the entire range of black hole masses, although these models vary in their ability to accurately predict the XRB black hole masses.",
      "pdf_url": "https://arxiv.org/pdf/2601.04007.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04188",
      "title": "Local simulations of common-envelope dynamical inspiral. Impact of rotation, accretion, and stratification",
      "authors": [
        "D. Gagnier",
        "G. Leidi",
        "M. Vetter",
        "R. Andrassy",
        "F. K. Röpke"
      ],
      "abstract": "Local simulations of common-envelope dynamical inspiral. Impact of rotation, accretion, and stratification D. Gagnier, G. Leidi, M. Vetter, R. Andrassy, F. K. Röpke 18 pages, 17 figures, 2 tables. Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Common envelope evolution (CEE) is a crucial phase in binary stellar evolution. Current global three-dimensional simulations lack the resolution to capture the small-scale dynamics around the embedded companion, while local wind-tunnel simulations always approximate the companion's orbital motion as linear rather than as rotation around the center of mass. We investigate how rotation, accretion, and stratification influence small-scale gas dynamics, gravitational drag and lift forces, and the spin-up rate of the companion. We perform three-dimensional local hydrodynamic simulations of a $0.2\\, M_\\odot$ compact companion plunging into the envelope of a $2\\, M_\\odot$ red giant in a reference frame rotating at the companion's orbital angular velocity, using the Athena++ code. The presence of stratification generates an inward-directed force, partially opposed by a rotation-induced outward lift force. Both the resulting inward directed force and the drag force, strongly influenced by stratification, would affect the evolution of the binary separation. We propose revised semi-analytical prescriptions for both drag and lift forces. Without accretion and for sufficiently small gravitational softening radii, a quasi-hydrostatic bubble forms around the companion, while accretion prevents its formation and converts kinetic energy into heat that could contribute to the envelope ejection. Drag and lift forces are only marginally affected by accretion. The companion spin-up rate varies non-monotonically in time, first increasing and then decreasing as it plunges deeper into the envelope. These results motivate future magnetohydrodynamic simulations to investigate how accretion, rotation, and stratification affect magnetic amplification, and how magnetic fields, in turn, influence mass and angular momentum accretion rates, as well as the drag and lift force exerted on the companion.",
      "pdf_url": "https://arxiv.org/pdf/2601.04188.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2108.01051",
      "title": "Evolution of proto-neutron stars to pulsars, magnetars and central compact objects",
      "authors": [
        "İrem Bakır",
        "Kazım Yavuz Ekşi"
      ],
      "abstract": "Evolution of proto-neutron stars to pulsars, magnetars and central compact objects İrem Bakır, Kazım Yavuz Ekşi MNRAS accepted, 11 pages, 7 figures High Energy Astrophysical Phenomena (astro-ph.HE) Some young neutron stars, the magnetars, have ultra-strong magnetic fields, yet their inferred birth rate is comparable to the core-collapse supernova rate, challenging scenarios that require rare, extreme conditions. We propose that this discrepancy can be reconciled if both pulsars and magnetars pass through a dynamo process during the proto-neutron star (PNS) phase. We employ a shear-driven $\\alpha$--$\\Omega$ dynamo model that includes PNS contraction. The dynamo generically produces toroidal-dominated fields set mainly by the $\\Omega$-effect. The evolution of the poloidal field is first dominated by flux conservation during collapse and then by the $\\alpha$-effect. The saturated toroidal field depends strongly on the initial value of the shear, with a threshold at $q_0 \\simeq 0.23$; below this, the poloidal field remains near the value obtained by the flux-conservation ($\\approx 2.5\\times10^{10}\\,{\\rm G}$). For the shortest initial periods, the model leads to magnetar-like strengths ($B_{\\rm p} \\simeq 10^{15}\\,{\\rm G}$, $B_\\phi \\simeq 10^{16}\\,{\\rm G}$), while for the slower rotators it yields ordinary pulsar fields ($B_{\\rm p} \\simeq 10^{12}\\,{\\rm G}$, $B_\\phi \\simeq 10^{14}\\,{\\rm G}$). We also argue that the central compact objects can acquire toroidal fields amplified solely by the $\\Omega$-effect; lacking the $\\alpha$-effect, their poloidal fields are not shaped by the dynamo effect.",
      "pdf_url": "https://arxiv.org/pdf/2108.01051.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.16021",
      "title": "Measurement of Very-high-energy Diffuse Gamma-ray Emissions from the Galactic Plane with LHAASO-WCDA",
      "authors": [
        "The LHAASO Collaboration",
        "Zhen Cao",
        "F. Aharonian",
        "Y.X. Bai",
        "Y.W. Bao",
        "D. Bastieri",
        "X.J. Bi",
        "Y.J. Bi",
        "W. Bian",
        "A.V. Bukevich",
        "C.M. Cai",
        "W.Y. Cao",
        "Zhe Cao",
        "J. Chang",
        "J.F. Chang",
        "A.M. Chen",
        "E.S. Chen",
        "H.X. Chen",
        "Liang Chen",
        "Long Chen",
        "M.J. Chen",
        "M.L. Chen",
        "Q.H. Chen",
        "S. Chen",
        "S.H. Chen",
        "S.Z. Chen",
        "T.L. Chen",
        "X.B. Chen",
        "X.J. Chen",
        "Y. Chen",
        "N. Cheng",
        "Y.D. Cheng",
        "M.C. Chu",
        "M.Y. Cui",
        "S.W. Cui",
        "X.H. Cui",
        "Y.D. Cui",
        "B.Z. Dai",
        "H.L. Dai",
        "Z.G. Dai",
        "Danzengluobu",
        "Y.X. Diao",
        "X.Q. Dong",
        "K.K. Duan",
        "J.H. Fan",
        "Y.Z. Fan",
        "J. Fang",
        "J.H. Fang",
        "K. Fang",
        "C.F. Feng",
        "H. Feng",
        "L. Feng",
        "S.H. Feng",
        "X.T. Feng",
        "Y. Feng",
        "Y.L. Feng",
        "S. Gabici",
        "B. Gao",
        "C.D. Gao",
        "Q. Gao",
        "W. Gao",
        "W.K. Gao",
        "M.M. Ge",
        "T.T. Ge",
        "L.S. Geng",
        "G. Giacinti",
        "G.H. Gong",
        "Q.B. Gou",
        "M.H. Gu",
        "F.L. Guo",
        "J. Guo",
        "X.L. Guo",
        "Y.Q. Guo",
        "Y.Y. Guo",
        "Y.A. Han",
        "O.A. Hannuksela",
        "M. Hasan",
        "H.H. He",
        "H.N. He",
        "J.Y. He",
        "X.Y. He",
        "Y. He",
        "S. Hernández-Cadena",
        "Y.K. Hor",
        "B.W. Hou",
        "C. Hou",
        "X. Hou",
        "H.B. Hu",
        "S.C. Hu",
        "C. Huang",
        "D.H. Huang",
        "J.J. Huang",
        "T.Q. Huang",
        "W.J. Huang",
        "X.T. Huang",
        "X.Y. Huang",
        "Y. Huang",
        "Y.Y. Huang",
        "X.L. Ji",
        "H.Y. Jia"
      ],
      "abstract": "Measurement of Very-high-energy Diffuse Gamma-ray Emissions from the Galactic Plane with LHAASO-WCDA The LHAASO Collaboration, Zhen Cao, F. Aharonian, Y.X. Bai, Y.W. Bao, D. Bastieri, X.J. Bi, Y.J. Bi, W. Bian, A.V. Bukevich, C.M. Cai, W.Y. Cao, Zhe Cao, J. Chang, J.F. Chang, A.M. Chen, E.S. Chen, H.X. Chen, Liang Chen, Long Chen, M.J. Chen, M.L. Chen, Q.H. Chen, S. Chen, S.H. Chen, S.Z. Chen, T.L. Chen, X.B. Chen, X.J. Chen, Y. Chen, N. Cheng, Y.D. Cheng, M.C. Chu, M.Y. Cui, S.W. Cui, X.H. Cui, Y.D. Cui, B.Z. Dai, H.L. Dai, Z.G. Dai, Danzengluobu, Y.X. Diao, X.Q. Dong, K.K. Duan, J.H. Fan, Y.Z. Fan, J. Fang, J.H. Fang, K. Fang, C.F. Feng, H. Feng, L. Feng, S.H. Feng, X.T. Feng, Y. Feng, Y.L. Feng, S. Gabici, B. Gao, C.D. Gao, Q. Gao, W. Gao, W.K. Gao, M.M. Ge, T.T. Ge, L.S. Geng, G. Giacinti, G.H. Gong, Q.B. Gou, M.H. Gu, F.L. Guo, J. Guo, X.L. Guo, Y.Q. Guo, Y.Y. Guo, Y.A. Han, O.A. Hannuksela, M. Hasan, H.H. He, H.N. He, J.Y. He, X.Y. He, Y. He, S. Hernández-Cadena, Y.K. Hor, B.W. Hou, C. Hou, X. Hou, H.B. Hu, S.C. Hu, C. Huang, D.H. Huang, J.J. Huang, T.Q. Huang, W.J. Huang, X.T. Huang, X.Y. Huang, Y. Huang, Y.Y. Huang, X.L. Ji, H.Y. Jia Physical Review Letters 134, 081002 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) The diffuse Galactic gamma-ray emission is a very important tool used to study the propagation and interaction of cosmic rays in the Milky Way. In this work, we report the measurements of the diffuse emission from the Galactic plane, covering Galactic longitudes from $15^{\\circ}$ to $235^{\\circ}$ and latitudes from $-5^{\\circ}$ to $+5^{\\circ}$, in an energy range of 1 TeV to 25 TeV, with the Water Cherenkov Detector Array (WCDA) of the Large High Altitude Air Shower Observatory (LHAASO). After masking the sky regions of known sources, the diffuse emission is detected with $24.6\\sigma$ and $9.1\\sigma$ significance in the inner Galactic plane and outer Galactic plane, respectively. The WCDA spectra in both regions can be well described by a power-law function, with spectral indices of $-2.67\\pm0.05_{\\rm stat}$ in the inner region and $-2.83\\pm0.19_{\\rm stat}$ in the outer region, respectively. Combined with the Square Kilometer Array (KM2A) measurements at higher energies, a clear softening of the spectrum is found in the inner region, with change of spectral indices by $\\sim0.5$ at a break energy around $30$ TeV. The fluxes of the diffuse emission are higher by a factor of $1.5-2.7$ than the model prediction assuming local CR spectra and the gas column density, which are consistent with those measured by the KM2A. Along Galactic longitude, the spatial distribution of the diffuse emission shows deviation from that of the gas column density. The spectral shape of the diffuse emission are possibly variation in different longitude region. The WCDA measurements bridge the gap between the low-energy measurements by space detectors and the ultra-high-energy observations by LHAASO-KM2A and other experiments. These results suggest that improved modeling of the wide-band diffuse emission is required.",
      "pdf_url": "https://arxiv.org/pdf/2411.16021.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.02558",
      "title": "Measuring the muon content of inclined air showers using AERA and the water-Cherenkov detectors of the Pierre Auger Observatory",
      "authors": [
        "The Pierre Auger Collaboration: A. Abdul Halim",
        "P. Abreu",
        "M. Aglietta",
        "I. Allekotte",
        "K. Almeida Cheminant",
        "A. Almela",
        "R. Aloisio",
        "J. Alvarez-Muñiz",
        "A. Ambrosone",
        "J. Ammerman Yebra",
        "G.A. Anastasi",
        "L. Anchordoqui",
        "B. Andrada",
        "L. Andrade Dourado",
        "S. Andringa",
        "L. Apollonio",
        "C. Aramo",
        "E. Arnone",
        "J.C. Arteaga Velázquez",
        "P. Assis",
        "G. Avila",
        "E. Avocone",
        "A. Bakalova",
        "F. Barbato",
        "A. Bartz Mocellin",
        "J.A. Bellido",
        "C. Berat",
        "M.E. Bertaina",
        "M. Bianciotto",
        "P.L. Biermann",
        "V. Binet",
        "K. Bismark",
        "T. Bister",
        "J. Biteau",
        "J. Blazek",
        "J. Blümer",
        "M. Boháčová",
        "D. Boncioli",
        "C. Bonifazi",
        "L. Bonneau Arbeletche",
        "N. Borodai",
        "J. Brack",
        "P.G. Brichetto Orchera",
        "F.L. Briechle",
        "A. Bueno",
        "S. Buitink",
        "M. Buscemi",
        "M. Büsken",
        "A. Bwembya",
        "K.S. Caballero-Mora",
        "S. Cabana-Freire",
        "L. Caccianiga",
        "F. Campuzano",
        "J. Caraça-Valente",
        "R. Caruso",
        "A. Castellina",
        "F. Catalani",
        "G. Cataldi",
        "L. Cazon",
        "M. Cerda",
        "B. Čermáková",
        "A. Cermenati",
        "J.A. Chinellato",
        "J. Chudoba",
        "L. Chytka",
        "R.W. Clay",
        "A.C. Cobos Cerutti",
        "R. Colalillo",
        "R. Conceição",
        "G. Consolati",
        "M. Conte",
        "F. Convenga",
        "D. Correia dos Santos",
        "P.J. Costa",
        "C.E. Covault",
        "M. Cristinziani",
        "C.S. Cruz Sanchez",
        "S. Dasso",
        "K. Daumiller",
        "B.R. Dawson",
        "R.M. de Almeida",
        "E.-T. de Boone",
        "B. de Errico",
        "J. de Jesús",
        "S.J. de Jong",
        "J.R.T. de Mello Neto",
        "I. De Mitri",
        "J. de Oliveira",
        "D. de Oliveira Franco",
        "F. de Palma",
        "V. de Souza",
        "E. De Vito",
        "A. Del Popolo",
        "O. Deligny",
        "N. Denner",
        "L. Deval",
        "A. di Matteo",
        "C. Dobrigkeit",
        "J.C. D'Olivo"
      ],
      "abstract": "Measuring the muon content of inclined air showers using AERA and the water-Cherenkov detectors of the Pierre Auger Observatory The Pierre Auger Collaboration: A. Abdul Halim, P. Abreu, M. Aglietta, I. Allekotte, K. Almeida Cheminant, A. Almela, R. Aloisio, J. Alvarez-Muñiz, A. Ambrosone, J. Ammerman Yebra, G.A. Anastasi, L. Anchordoqui, B. Andrada, L. Andrade Dourado, S. Andringa, L. Apollonio, C. Aramo, E. Arnone, J.C. Arteaga Velázquez, P. Assis, G. Avila, E. Avocone, A. Bakalova, F. Barbato, A. Bartz Mocellin, J.A. Bellido, C. Berat, M.E. Bertaina, M. Bianciotto, P.L. Biermann, V. Binet, K. Bismark, T. Bister, J. Biteau, J. Blazek, J. Blümer, M. Boháčová, D. Boncioli, C. Bonifazi, L. Bonneau Arbeletche, N. Borodai, J. Brack, P.G. Brichetto Orchera, F.L. Briechle, A. Bueno, S. Buitink, M. Buscemi, M. Büsken, A. Bwembya, K.S. Caballero-Mora, S. Cabana-Freire, L. Caccianiga, F. Campuzano, J. Caraça-Valente, R. Caruso, A. Castellina, F. Catalani, G. Cataldi, L. Cazon, M. Cerda, B. Čermáková, A. Cermenati, J.A. Chinellato, J. Chudoba, L. Chytka, R.W. Clay, A.C. Cobos Cerutti, R. Colalillo, R. Conceição, G. Consolati, M. Conte, F. Convenga, D. Correia dos Santos, P.J. Costa, C.E. Covault, M. Cristinziani, C.S. Cruz Sanchez, S. Dasso, K. Daumiller, B.R. Dawson, R.M. de Almeida, E.-T. de Boone, B. de Errico, J. de Jesús, S.J. de Jong, J.R.T. de Mello Neto, I. De Mitri, J. de Oliveira, D. de Oliveira Franco, F. de Palma, V. de Souza, E. De Vito, A. Del Popolo, O. Deligny, N. Denner, L. Deval, A. di Matteo, C. Dobrigkeit, J.C. D'Olivo Phys. Rev. D 112, 123042 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a novel approach for assessing the muon content of air showers with large zenith angles on a combined analysis of their radio emission and particle footprint. We use the radiation energy reconstructed by the Auger Engineering Radio Array (AERA) as an energy estimator and determine the muon number independently with the water-Cherenkov detector array of the Pierre Auger Observatory, deployed on a 1500 m grid. We focus our analysis on air showers with primary energy above 4 EeV to ensure full detection efficiency. Over approximately ten years of accumulated data, we identify a set of 40 high-quality events that are used in the analysis. The estimated muon contents in data are compatible with those for iron primaries as predicted by current-generation hadronic interaction models. This result can be interpreted as a deficit of muons in simulations as a lighter mass composition has been established from Xmax measurements. This muon deficit was already observed in previous analyses of the Auger Collaboration and is confirmed using hybrid events that include radio measurements for the first time.",
      "pdf_url": "https://arxiv.org/pdf/2507.02558.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.04264",
      "title": "Magnetized Proto-Neutron Stars: Structure and Stability",
      "authors": [
        "Harsh Chandrakar",
        "Adamu Issifu",
        "Prashant Thakur",
        "T. K. Jha",
        "Aravind Taridalu"
      ],
      "abstract": "Magnetized Proto-Neutron Stars: Structure and Stability Harsh Chandrakar, Adamu Issifu, Prashant Thakur, T. K. Jha, Aravind Taridalu High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) We investigate the evolution of magnetized protoneutron stars (PNSs) through four schematic stages: neutrino trapped, deleptonization, neutrino transparent, and the final cold, catalyzed neutron star (NS). Using a quasi static approximation on the Kelvin Helmholtz timescale, we construct strongly magnetized configurations (magnetic field strengths up to 1e17 G) with the axisymmetric XNS 4.0 code, employing equations of state derived from relativistic mean field theory calibrated with the DDME2 parameter set. We analyze the evolution of the gravitational mass, equatorial radius, stellar deformation, magnetic flux, and the ratio of magnetic to gravitational binding energy as functions of thermodynamic and compositional changes. We find that increasing entropy per baryon and decreasing lepton fraction lead to higher core temperatures, which enhance magnetic deformation, flux confinement, and the magnetic to binding energy ratio. Magnetic field dissipation is most efficient during the deleptonization and neutrino transparent stages, and this process largely determines the observable magnetic field strength of the mature neutron star. This work provides the first general relativistic characterization of how the thermal and compositional evolution of protoneutron stars reshapes magnetic field deformation and energetics across poloidal, toroidal, and mixed field configurations at fixed baryonic mass.",
      "pdf_url": "https://arxiv.org/pdf/2508.04264.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.14154",
      "title": "Convection-Driven Multi-Scale Magnetic Fields Determine the Observed Solar-Disk Gamma Rays",
      "authors": [
        "Jung-Tsung Li",
        "Mahboubeh Asgari-Targhi",
        "John F. Beacom",
        "Annika H. G. Peter"
      ],
      "abstract": "Convection-Driven Multi-Scale Magnetic Fields Determine the Observed Solar-Disk Gamma Rays Jung-Tsung Li, Mahboubeh Asgari-Targhi, John F. Beacom, Annika H. G. Peter 30 pages, 16 figures; Accepted for publication in The Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) The solar disk is a continuous source of GeV--TeV gamma rays. The emission is thought to originate from hadronic Galactic cosmic rays (GCRs) interacting with the gas in the photosphere and uppermost convection zone after being reflected by solar magnetic fields. Despite this general understanding, existing theoretical models have yet to match observational data. At the photosphere and the uppermost convection zone, granular convection drives a multi-scale magnetic field, forming a larger-scale filamentary structure while also generating turbulence-scale Alfvén wave turbulence. Here, we demonstrate that the larger-scale filamentary field shapes the overall gamma-ray emission spectrum, and the Alfvén wave turbulence is critical for further suppressing the gamma-ray emission spectrum below $\\sim 100$~GeV. For a standard Alfvén wave turbulence level, our model's predicted spectrum slope from 1~GeV to 1~TeV is in excellent agreement with observations from Fermi-LAT and HAWC, an important achievement. The predicted absolute flux is a factor of 2--5 lower than the observed data; we outline future directions to resolve this discrepancy. The key contribution of our work is providing a new theoretical framework for using solar disk gamma-ray observations to probe hadronic GCR transport in the lower solar atmosphere.",
      "pdf_url": "https://arxiv.org/pdf/2508.14154.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.05405",
      "title": "The Open mulTiwavelength Transient Event Repository (OTTER): Infrastructure Release and Tidal Disruption Event Catalog",
      "authors": [
        "Noah Franz",
        "Kate D Alexander",
        "Sebastian Gomez",
        "Collin T Christy",
        "Tanmoy Laskar",
        "Sjoert van Velzen",
        "Nicholas Earl",
        "Suvi Gezari",
        "Mitchell Karmen",
        "Raffaella Margutti",
        "Jeniveve Pearson",
        "V. Ashley Villar",
        "Ann I Zabludoff"
      ],
      "abstract": "The Open mulTiwavelength Transient Event Repository (OTTER): Infrastructure Release and Tidal Disruption Event Catalog Noah Franz, Kate D Alexander, Sebastian Gomez, Collin T Christy, Tanmoy Laskar, Sjoert van Velzen, Nicholas Earl, Suvi Gezari, Mitchell Karmen, Raffaella Margutti, Jeniveve Pearson, V. Ashley Villar, Ann I Zabludoff Accepted to ApJ. The OTTER web interface is available at this https URL and the API documentation (including example python notebooks demonstrating usage) is available at this https URL. Please submit any feedback as issues on GitHub at this https URL High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Multiwavelength analyses of astrophysical transients are essential for understanding the physics of these events. To make such analyses more efficient and effective, we present the Open mulTiwavelength Transient Event Repository (OTTER), a publicly available catalog of published transient event metadata and photometry. Unlike previous efforts, our data schema is optimized for the storage of multiwavelength photometric datasets spanning the entire electromagnetic spectrum from multiple published sources. Open source software, including an application programming interface (API) and web application, are available for viewing, accessing, and analyzing the dataset. For the initial release of OTTER, we present the largest ever photometric archive of tidal disruption event (TDE) candidates, including $\\gtrsim 118,000$ observations of 240 TDE candidates spanning from radio to X-ray wavelengths. We demonstrate the power of this infrastructure through four example analyses of the TDE population. We plan to maintain this dataset as more TDE candidates are proposed in the future and encourage other users to contribute by uploading newly published data via our web application. The infrastructure was built with the goal of archiving additional transient data (supernovae, gamma-ray bursts, fast blue optical transients, fast radio bursts, etc.) in the future. The web application is available at this https URL and the API documentation is available at this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2509.05405.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12649",
      "title": "Energy calibration of LHAASO-KM2A using the cosmic ray Moon shadow",
      "authors": [
        "Zhen Cao",
        "F. Aharonian",
        "Y.X. Bai",
        "Y.W. Bao",
        "D. Bastieri",
        "X.J. Bi",
        "Y.J. Bi",
        "W. Bian",
        "J. Blunier",
        "A.V. Bukevich",
        "C.M. Cai",
        "Y.Y. Cai",
        "W.Y. Cao",
        "Zhe Cao",
        "J. Chang",
        "J.F. Chang",
        "E.S. Chen",
        "G.H. Chen",
        "H.K. Chen",
        "L.F. Chen",
        "Liang Chen",
        "Long Chen",
        "M.J. Chen",
        "M.L. Chen",
        "Q.H. Chen",
        "S. Chen",
        "S.H. Chen",
        "S.Z. Chen",
        "T.L. Chen",
        "X.B. Chen",
        "X.J. Chen",
        "X.P. Chen",
        "Y. Chen",
        "N. Cheng",
        "Q.Y. Cheng",
        "Y.D. Cheng",
        "M.Y. Cui",
        "S.W. Cui",
        "X.H. Cui",
        "Y.D. Cui",
        "B.Z. Dai",
        "H.L. Dai",
        "Z.G. Dai",
        "Danzengluobu",
        "Y.X. Diao",
        "A.J. Dong",
        "X.Q. Dong",
        "K.K. Duan",
        "J.H. Fan",
        "Y.Z. Fan",
        "J. Fang",
        "J.H. Fang",
        "K. Fang",
        "C.F. Feng",
        "H. Feng",
        "L. Feng",
        "S.H. Feng",
        "X.T. Feng",
        "Y. Feng",
        "Y.L. Feng",
        "S. Gabici",
        "B. Gao",
        "Q. Gao",
        "W. Gao",
        "W.K. Gao",
        "M.M. Ge",
        "T.T. Ge",
        "L.S. Geng",
        "G. Giacinti",
        "G.H. Gong",
        "Q.B. Gou",
        "M.H. Gu",
        "F.L. Guo",
        "J. Guo",
        "K.J. Guo",
        "X.L. Guo",
        "Y.Q. Guo",
        "Y.Y. Guo",
        "R.P. Han",
        "O.A. Hannuksela",
        "M. Hasan",
        "H.H. He",
        "H.N. He",
        "J.Y. He",
        "X.Y. He",
        "Y. He",
        "S. Hernández-Cadena",
        "B.W. Hou",
        "C. Hou",
        "X. Hou",
        "H.B. Hu",
        "S.C. Hu",
        "C. Huang",
        "D.H. Huang",
        "J.J. Huang",
        "X.L. Huang",
        "X.T. Huang",
        "X.Y. Huang",
        "Y. Huang",
        "Y.Y. Huang"
      ],
      "abstract": "Energy calibration of LHAASO-KM2A using the cosmic ray Moon shadow Zhen Cao, F. Aharonian, Y.X. Bai, Y.W. Bao, D. Bastieri, X.J. Bi, Y.J. Bi, W. Bian, J. Blunier, A.V. Bukevich, C.M. Cai, Y.Y. Cai, W.Y. Cao, Zhe Cao, J. Chang, J.F. Chang, E.S. Chen, G.H. Chen, H.K. Chen, L.F. Chen, Liang Chen, Long Chen, M.J. Chen, M.L. Chen, Q.H. Chen, S. Chen, S.H. Chen, S.Z. Chen, T.L. Chen, X.B. Chen, X.J. Chen, X.P. Chen, Y. Chen, N. Cheng, Q.Y. Cheng, Y.D. Cheng, M.Y. Cui, S.W. Cui, X.H. Cui, Y.D. Cui, B.Z. Dai, H.L. Dai, Z.G. Dai, Danzengluobu, Y.X. Diao, A.J. Dong, X.Q. Dong, K.K. Duan, J.H. Fan, Y.Z. Fan, J. Fang, J.H. Fang, K. Fang, C.F. Feng, H. Feng, L. Feng, S.H. Feng, X.T. Feng, Y. Feng, Y.L. Feng, S. Gabici, B. Gao, Q. Gao, W. Gao, W.K. Gao, M.M. Ge, T.T. Ge, L.S. Geng, G. Giacinti, G.H. Gong, Q.B. Gou, M.H. Gu, F.L. Guo, J. Guo, K.J. Guo, X.L. Guo, Y.Q. Guo, Y.Y. Guo, R.P. Han, O.A. Hannuksela, M. Hasan, H.H. He, H.N. He, J.Y. He, X.Y. He, Y. He, S. Hernández-Cadena, B.W. Hou, C. Hou, X. Hou, H.B. Hu, S.C. Hu, C. Huang, D.H. Huang, J.J. Huang, X.L. Huang, X.T. Huang, X.Y. Huang, Y. Huang, Y.Y. Huang Physical Review D 112, 123051 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a precise measurement of the westward, rigidity-dependent shift of the Moon's shadow using three and a half years of cosmic-ray data collected by the Kilometer Square Array (KM2A) of the Large High Altitude Air Shower Observatory (LHAASO). These measurements enable us to calibrate the detector energy response in the range 20-260 TeV, with results showing excellent agreement with the response derived from Monte Carlo (MC) simulations of the KM2A detector. We also measure a best-fit parameter $\\epsilon = 0.015 \\pm 0.08$, corresponding to a 95% confidence interval of [-14%, +17%] for the energy-scale estimation. This result establishes the exceptional accuracy of the KM2A-MC in simulating the detector's response within this energy range.",
      "pdf_url": "https://arxiv.org/pdf/2510.12649.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.19835",
      "title": "VERITAS contributions to the 39th International Cosmic Ray Conference",
      "authors": [
        "A. Archer",
        "P. Bangale",
        "J. T. Bartkoske",
        "W. Benbow",
        "Y. Chen",
        "J. L. Christiansen",
        "A. J. Chromey",
        "A. Duerr",
        "M. Escobar Godoy",
        "J. Escudero Pedrosa",
        "Q. Feng",
        "S. Filbert",
        "L. Fortson",
        "A. Furniss",
        "W. Hanlon",
        "O. Hervet",
        "C. E. Hinrichs",
        "J. Holder",
        "T. B. Humensky",
        "M. Iskakova",
        "W. Jin",
        "M. N. Johnson",
        "E. Joshi",
        "M. Kertzman",
        "M. Kherlakian",
        "D. Kieda",
        "T. K. Kleiner",
        "N. Korzoun",
        "S. Kumar",
        "M. J. Lang",
        "M. Lundy",
        "G. Maier",
        "C. E McGrath",
        "P. Moriarty",
        "R. Mukherjee",
        "W. Ning",
        "R. A. Ong",
        "M. Pohl",
        "E. Pueschel",
        "J. Quinn",
        "P. L. Rabinowitz",
        "K. Ragan",
        "P. T. Reynolds",
        "D. Ribeiro",
        "E. Roache",
        "I. Sadeh",
        "L. Saha",
        "H. Salzmann",
        "G. H. Sembroski",
        "B. Shen",
        "M. Splettstoesser",
        "A. K. Talluri",
        "J. V. Tucci",
        "J. Valverde",
        "V. V. Vassiliev",
        "D. A. Williams",
        "S. L. Wong",
        "T. Yoshikoshi"
      ],
      "abstract": "VERITAS contributions to the 39th International Cosmic Ray Conference A. Archer, P. Bangale, J. T. Bartkoske, W. Benbow, Y. Chen, J. L. Christiansen, A. J. Chromey, A. Duerr, M. Escobar Godoy, J. Escudero Pedrosa, Q. Feng, S. Filbert, L. Fortson, A. Furniss, W. Hanlon, O. Hervet, C. E. Hinrichs, J. Holder, T. B. Humensky, M. Iskakova, W. Jin, M. N. Johnson, E. Joshi, M. Kertzman, M. Kherlakian, D. Kieda, T. K. Kleiner, N. Korzoun, S. Kumar, M. J. Lang, M. Lundy, G. Maier, C. E McGrath, P. Moriarty, R. Mukherjee, W. Ning, R. A. Ong, M. Pohl, E. Pueschel, J. Quinn, P. L. Rabinowitz, K. Ragan, P. T. Reynolds, D. Ribeiro, E. Roache, I. Sadeh, L. Saha, H. Salzmann, G. H. Sembroski, B. Shen, M. Splettstoesser, A. K. Talluri, J. V. Tucci, J. Valverde, V. V. Vassiliev, D. A. Williams, S. L. Wong, T. Yoshikoshi High Energy Astrophysical Phenomena (astro-ph.HE) Compilation of papers presented by the VERITAS Collaboration at the 39th International Cosmic Ray Conference (ICRC), held July 14 through July 24, 2025 in Geneva, Switzerland.",
      "pdf_url": "https://arxiv.org/pdf/2512.19835.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.10616",
      "title": "On the effects of radiation on mass transfer in binary stars",
      "authors": [
        "Jakub Cehula",
        "Ondřej Pejcha"
      ],
      "abstract": "On the effects of radiation on mass transfer in binary stars Jakub Cehula, Ondřej Pejcha 19 pages, 8 figures. Accepted in MNRAS Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Mass transfer (MT) in binary systems is a common evolutionary process that can significantly affect the structure, evolution, and final fate of both stars. In modeling MT hydrodynamics, it is usually assumed that the critical point of the flow, where the velocity exceeds the local sound speed, coincides with the inner Lagrange point (L1). However, in massive donors where radiative pressure dominates over gas pressure and the Eddington factor $\\Gamma_\\text{Edd}$ can approach or exceed unity, radiation-gas coupling can shift the critical point away from L1, altering the MT rate ($\\dot{M}_\\text{d}$). We investigate the effects of radiation on MT using time-steady radiative hydrodynamic equations and the von Zeipel theorem. We derive analytical expressions that closely approximate $\\dot{M}_\\text{d}$, algebraic solutions for simplified cases, and numerical results using a realistic equation of state. Two main differences emerge relative to traditional prescriptions for $\\dot{M}_\\text{d}$. First, for Roche-lobe-underfilling donors with $\\Gamma_\\text{Edd} \\lesssim 1$, radiative momentum exchange leads to an exponential increase of $\\dot{M}_\\text{d}$ as a function of $1-\\Gamma_\\text{Edd}$. We provide a simple modification of existing prescriptions that captures this effect. Second, the photon tiring limit for super-Eddington outflows is much less restrictive near L1 than in spherical stars. We suggest that donors with super-Eddington, convectively inefficient subsurface layers can drive MT with $-\\dot{M}_\\text{d} \\gtrsim 10^{-2}\\,\\text{M}_\\odot\\,\\text{yr}^{-1}$ even before Roche-lobe overflow. We characterize the conditions for this new mode of super-Eddington-boosted MT and discuss its implications for binary evolution, including potential links to nonterminal outbursts of Luminous Blue Variables.",
      "pdf_url": "https://arxiv.org/pdf/2505.10616.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.13865",
      "title": "A simple, flexible method for timing cross-calibration of space missions",
      "authors": [
        "Matteo Bachetti , Yukikatsu Terada , Megumi Shidatsu , Craig B. Markwardt , Yong Chen , Weiwei Cui , Giancarlo Cusumano , Dawei Han , Shumei Jia , Chulsoo Kang , Vinay L. Kashyap , Lucien Kuiper , Xiaobo Li , Yugo Motogami , Naoyuki Ota , Simone Pagliarella , Katja Pottschmidt , Simon R. Rosen , Arnold Rots , Makoto Sawada , Mutsumi Sugizaki , Toshihiro Takagi , Takuya Takahashi , Toru Tamagawa , Youli Tuo , Yi-Jung Yang , Marina Yoshimoto , Juan Zhang INAF-Osservatorio Astronomico di Cagliari, Graduate School of Science and Engineering, Saitama University, Japan Aerospace Exploration Agency, ISAS, Ehime University, Graduate School of Science and Engineering, X-ray Astrophysics Laboratory, NASA Goddard Space Flight Center, Key Laboratory of Particle Astrophysics, Institute of High Energy Physics, CAS, Beijing, INAF - Istituto di Astrofisica Spaziale e Fisica Cosmica di Palermo, Center for Astrophysics | Harvard &amp; Smithsonian, SRON - Space Research Organisation Netherlands, RIKEN Nishina Center, Tokyo University of Science, INAF-IAPS Rome, Tor Vergata University of Rome, Sapienza University of Rome, University of Maryland, Baltimore County, Serco for ESA, European Space Astronomy Centre , Rikkyo University, Kanazawa University, RIKEN Pioneering Research Institute, Institut für Astronomie und Astrophysik, Universität Tübingen, CASS, NYU Abu Dhabi)"
      ],
      "abstract": "A simple, flexible method for timing cross-calibration of space missions Matteo Bachetti (1), Yukikatsu Terada (2 and 3), Megumi Shidatsu (4), Craig B. Markwardt (5), Yong Chen (6), Weiwei Cui (6), Giancarlo Cusumano (7), Dawei Han (6), Shumei Jia (6), Chulsoo Kang (2), Vinay L. Kashyap (8), Lucien Kuiper (9), Xiaobo Li (6), Yugo Motogami (2), Naoyuki Ota (10 and 11), Simone Pagliarella (12 and 13 and 14), Katja Pottschmidt (5 and 15), Simon R. Rosen (16), Arnold Rots (8), Makoto Sawada (17), Mutsumi Sugizaki (18), Toshihiro Takagi (4), Takuya Takahashi (10 and 11), Toru Tamagawa (19 and 10 and 11), Youli Tuo (20), Yi-Jung Yang (21), Marina Yoshimoto (4), Juan Zhang (6) ((1) INAF-Osservatorio Astronomico di Cagliari, (2) Graduate School of Science and Engineering, Saitama University, (3) Japan Aerospace Exploration Agency, ISAS, (4) Ehime University, Graduate School of Science and Engineering, (5) X-ray Astrophysics Laboratory, NASA Goddard Space Flight Center, (6) Key Laboratory of Particle Astrophysics, Institute of High Energy Physics, CAS, Beijing, (7) INAF - Istituto di Astrofisica Spaziale e Fisica Cosmica di Palermo, (8) Center for Astrophysics | Harvard &amp; Smithsonian, (9) SRON - Space Research Organisation Netherlands, (10) RIKEN Nishina Center, (11) Tokyo University of Science, (12) INAF-IAPS Rome, (13) Tor Vergata University of Rome, (14) Sapienza University of Rome, (15) University of Maryland, Baltimore County, (16) Serco for ESA, European Space Astronomy Centre (ESAC), (17) Rikkyo University, (18) Kanazawa University, (19) RIKEN Pioneering Research Institute, (20) Institut für Astronomie und Astrophysik, Universität Tübingen, (21) CASS, NYU Abu Dhabi) 22 pages, 7 figures, 4 tables. Published in PASP Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) The timing (cross-)calibration of astronomical instruments is often done by comparing pulsar times-of-arrival (TOAs) to a reference timing model. In high-energy astronomy, the choice of solar system ephemerides and source positions used to barycenter the photon arrival times has a significant impact on the procedure, requiring a full reprocessing of the data each time a new convention is used. Our method, developed as part of the activities of the International Astronomical Consortium for High Energy Calibration (IACHEC), adapts an existing pulsar solution to arbitrary JPL ephemerides and source positions by simulating geocentric TOAs and refitting timing models (implemented with PINT). We validate the procedure and apply it to thousands of observations of the Crab pulsar from 15 missions spanning 1996--2025, demonstrating inter-ephemeris TOA consistency at the $\\lesssim5 \\mu$s level, using the DE200/FK5-based Jodrell Bank Monthly Ephemeris as a common reference. We release the TOAExtractor open-source tool and a TOA database to support future calibration and scientific studies. Instrument timing performance is broadly consistent with mission specifications; the X-ray-to-radio phase offset varies with energy and time at a level that is marginally consistent with the uncertainties of the radio ephemeris, motivating coordinated multiwavelength follow-up.",
      "pdf_url": "https://arxiv.org/pdf/2509.13865.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.15881",
      "title": "Shedding the envelope: JWST reveals a kiloparsec-scale [OIII]-weak Balmer shell around a z=7.64 quasar",
      "authors": [
        "Julien Wolf",
        "Eduardo Bañados",
        "Xiaohui Fan",
        "Antoine Dumont",
        "James E. Davies",
        "David S. N. Rupke",
        "Jinyi Yang",
        "Weizhe Liu",
        "Silvia Belladitta",
        "Aaron Barth",
        "Sarah Bosman",
        "Tiago Costa",
        "Frederick B. Davies",
        "Roberto Decarli",
        "Dominika Ďurovčíková",
        "Anna-Christina Eilers",
        "Hyunsung D. Jun",
        "Yichen Liu",
        "Federica Loiacono",
        "Alessandro Lupi",
        "Chiara Mazzucchelli",
        "Maria Pudoka",
        "Sofía Rojas-Ruiz",
        "Jan-Torge Schindler",
        "Wei Leong Tee",
        "Benny Trakhtenbrot",
        "Fabian Walter",
        "Huanian Zhang"
      ],
      "abstract": "Shedding the envelope: JWST reveals a kiloparsec-scale [OIII]-weak Balmer shell around a z=7.64 quasar Julien Wolf, Eduardo Bañados, Xiaohui Fan, Antoine Dumont, James E. Davies, David S. N. Rupke, Jinyi Yang, Weizhe Liu, Silvia Belladitta, Aaron Barth, Sarah Bosman, Tiago Costa, Frederick B. Davies, Roberto Decarli, Dominika Ďurovčíková, Anna-Christina Eilers, Hyunsung D. Jun, Yichen Liu, Federica Loiacono, Alessandro Lupi, Chiara Mazzucchelli, Maria Pudoka, Sofía Rojas-Ruiz, Jan-Torge Schindler, Wei Leong Tee, Benny Trakhtenbrot, Fabian Walter, Huanian Zhang Minor revision incorporating reviewer feedback Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Luminous quasars at the redshift frontier z>7 serve as stringent probes of super-massive black hole formation and they are thought to undergo much of their growth obscured by dense gas and dust in their host galaxies. Fully characterizing the symbiotic evolution of SMBHs and hosts requires rest-frame optical observations that span spatial scales from the broad-line region to the ISM and CGM. JWST now provides the necessary spatially resolved spectroscopy to do so. But the physical conditions that regulate the interplay between SMBHs and their hosts at the highest redshifts, especially the nature of early feedback phases, remain unclear. We present JWST/NIRSpec IFU observations of J0313$-$1806 at z=7.64, the most distant luminous quasar known. From the restframe optical spectrum of the unresolved quasar, we derive a black hole mass of $M_\\mathrm{BH}=(1.63 \\pm 0.10)\\times10^9 M_\\odot$ based on H$\\beta$ and an Eddington rate of $\\lambda=L/L_\\mathrm{Edd}=0.80\\pm 0.05$, consistent with previous MgII-based estimates. J0313-1806 exhibits no detectable [O III] emission on nuclear scales. Most remarkably, we detect an ionized gas shell extending out to $\\sim 1.8$ kpc traced by H$\\beta$ emission that also lacks any significant [O III], with a $3\\sigma$ upper limit on the [O III]$ \\lambda$5007 to H$\\beta$ flux ratio of $\\log_{10} \\left( F(\\mathrm{[OIII]})/F(\\mathrm{H}\\beta)\\right)=-1.15$. Through photoionization modelling, we demonstrate that the extended emission is consistent with a thin, clumpy outflowing shell where [OIII] is collisionally de-excited by dense gas. We interpret this structure as a fossil remnant of a recent blowout phase, providing evidence for episodic feedback cycles in one of the earliest quasars. These findings suggest that dense ISM phases may play a crucial role in shaping the spectral properties of quasars accross cosmic time.",
      "pdf_url": "https://arxiv.org/pdf/2512.15881.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16630",
      "title": "Photon Accelerator in Magnetized Plasma",
      "authors": [
        "Sergei Bulanov",
        "Stepan Bulanov",
        "Timur Esirkepov",
        "Gianluca Gregori",
        "Gabriele Grittani",
        "Brandon Russell",
        "Alec Thomas",
        "Petr Valenta"
      ],
      "abstract": "Photon Accelerator in Magnetized Plasma Sergei Bulanov, Stepan Bulanov, Timur Esirkepov, Gianluca Gregori, Gabriele Grittani, Brandon Russell, Alec Thomas, Petr Valenta Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
      "pdf_url": "https://arxiv.org/pdf/2512.16630.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03339",
      "title": "Early thin-disc assembly revealed by JWST edge-on galaxies",
      "authors": [
        "Marloes van Asselt",
        "Francesca Rizzo",
        "Luca Di Mascolo"
      ],
      "abstract": "Early thin-disc assembly revealed by JWST edge-on galaxies Marloes van Asselt, Francesca Rizzo, Luca Di Mascolo 19 pages, 17 figures 2 tables (plus 3 pages and 2 figures as appendix). Submitted to Monthly Notices of the Royal Astronomical Society Astrophysics of Galaxies (astro-ph.GA) The vertical structure of stellar discs provides key constraints on their formation and evolution. Nearby spirals, including the Milky Way, host thin and thick components that may arise either from an early turbulent phase or from the subsequent dynamical heating of an initially thin disc; measuring disc thickness across cosmic time therefore offers a direct test of these scenarios. We present a new methodology to measure the thickness of edge-on galaxies that explicitly accounts for small departures from perfectly edge-on orientations by fitting a full three-dimensional model with forward modelling. This improves on traditional approaches that assume an inclination of $90^\\circ$ and can bias thicknesses high. Applying the method to \\textit{JWST} imaging of galaxies at $1<z<3$ with stellar masses $\\gtrsim 10^9~\\mathrm{M_{\\odot}}$ from four major surveys, we measure a median scale height of $z_0 = 0.25\\pm0.14~\\mathrm{kpc}$ and a median ratio $h_r/z_0 = 8.4\\pm3.7$. These values are consistent with the Milky Way and local thin discs, but imply scale heights $\\sim 1.6$ times smaller than those inferred for local galaxies from single-disc fits. This result implies that thin discs are already present at $z\\sim3$. We further show that a thick disc contributing 10\\% of the thin-disc luminosity would be detectable in the data considered in this work, implying that any thick disc present must be fainter and favouring a scenario in which thick discs build up progressively through dynamical heating.",
      "pdf_url": "https://arxiv.org/pdf/2601.03339.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03421",
      "title": "Integral field spectroscopy and numerical simulations of the NGC 2207/IC 2163 system",
      "authors": [
        "Camille Poitras , René Pierre Martin , Laurent Drissen , Hugo Martel , Carmelle Robert Département de physique, de génie physique et d'optique, Université Laval, Québec, Canada, Department of Physics and Astronomy, University of Hawai'i at Hilo, Hilo, USA)"
      ],
      "abstract": "Integral field spectroscopy and numerical simulations of the NGC 2207/IC 2163 system Camille Poitras (1), René Pierre Martin (2), Laurent Drissen (1), Hugo Martel (1), Carmelle Robert (1) ((1) Département de physique, de génie physique et d'optique, Université Laval, Québec, Canada, (2) Department of Physics and Astronomy, University of Hawai'i at Hilo, Hilo, USA) Astrophysics of Galaxies (astro-ph.GA) We present integral field spectroscopy of the interacting galaxy system NGC 2207/IC 2163 obtained with the imaging Fourier Transform Spectrometer SITELLE. Approximately 1000 HII region complexes are detected in both galaxies and analyzed using their strong optical emission lines. Their properties were studied via BPT diagrams and their luminosity function. We conducted a detailed study of the distribution of oxygen abundance across the system using a series of strong-line O/H indicators and calibrations. Both galaxies exhibit negative galactocentric abundance gradients with a slope -0.015 dex kpc$^{-1}$. There are marginal signs of discontinuities in the O/H gradients with some indicators while no significant azimuthal variations are seen. A shallower slope in the HII region luminosity function between the arm and inter-arm regions in IC 2163 is observed, supporting previous conclusion that the star formation process in this galaxy eyelids has been altered during the interaction. The kinematics of the ionised gas reveal disturbed velocity fields, AGN-like features in the nucleus of NGC 2207, and elevated velocity dispersion in turbulent or feedback-driven regions. To interpret these findings, we modeled the collision using the numerical algorithm GCD+. The simulation reproduces key features of the system and demonstrates how close passages drive enhanced star formation and localized chemical enrichment. Finally, two dwarf galaxies in the field are found to have very similar systemic velocities as their larger counterparts, and could well play a minor role in the global interaction based on their morphology and position.",
      "pdf_url": "https://arxiv.org/pdf/2601.03421.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03441",
      "title": "Time-dependent chemical evolution during cloud formation: H$_2$-regulated chemistry in diffuse molecular cloud",
      "authors": [
        "Yuto Komichi",
        "Yuri Aikawa",
        "Kazunari Iwasaki",
        "Kenji Furuya"
      ],
      "abstract": "Time-dependent chemical evolution during cloud formation: H$_2$-regulated chemistry in diffuse molecular cloud Yuto Komichi, Yuri Aikawa, Kazunari Iwasaki, Kenji Furuya 25 pages, 20 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We investigate the chemical evolution of a forming molecular cloud behind an interstellar shock wave. We conduct three-dimensional magnetohydrodynamics simulations of the converging flow of atomic gas, including a simple chemical network and tracer particles that move along the local velocity field. Then we perform detailed chemical network calculations along the trajectory of each tracer particle. The diffuse part of forming molecular clouds is CO-poor; i.e., H$_2$ and CO abundances do not correlate. In diffuse regions of $n_\\mathrm{H}\\lesssim 10^{3}\\,\\mathrm{cm^{-3}}$, we find that the abundances of hydrocarbons and oxygen-bearing molecules are determined by steady-state chemistry reflecting the local H$_2$ abundance, which is determined by the gas density along the trajectory. In denser regions, the abundances are affected by water ice formation, which changes the elemental abundance of carbon and oxygen (i.e., C/O ratio) in the gas phase. Assuming quasi-steady-state chemistry given the abundances of major molecules (e.g., H$_2$) from the simple network, we derive analytic solutions for molecular abundances, which reproduce the calculation results. We also calculate the molecular column densities based on the spatial distribution of tracer particles and their molecular abundances, and compare them with observations of diffuse molecular clouds. We find that the column densities of CH, CCH, and OH are linearly correlated with those of H$_2$, which supports the empirical relation used in the observations. On the other hand, the column density of HCO$^+$ shows non-linear dependence on the H$_2$ column density, reflecting the difference in HCO$^+$ formation paths in CO-poor and CO-rich regions.",
      "pdf_url": "https://arxiv.org/pdf/2601.03441.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03530",
      "title": "Jet-torus interaction revealed by sub-parsec SO absorption in NGC 1052",
      "authors": [
        "Satoko Sawada-Satoh",
        "Seiji Kameno",
        "Nozomu Kawakatsu",
        "Do-Young Byun",
        "Se-Jin Oh",
        "Sang-Sung Lee",
        "Duk-Gyoo Roh",
        "Chungsik Oh",
        "Jae-Hwan Yeom",
        "Dong-Kyu Jung",
        "Hyo- Ryoung Kim",
        "Young-Sik Kim",
        "Sanghyun Kim"
      ],
      "abstract": "Jet-torus interaction revealed by sub-parsec SO absorption in NGC 1052 Satoko Sawada-Satoh, Seiji Kameno, Nozomu Kawakatsu, Do-Young Byun, Se-Jin Oh, Sang-Sung Lee, Duk-Gyoo Roh, Chungsik Oh, Jae-Hwan Yeom, Dong-Kyu Jung, Hyo- Ryoung Kim, Young-Sik Kim, Sanghyun Kim 8 pages, 5 figures, accepted for publication in PASJ Astrophysics of Galaxies (astro-ph.GA) We report the first {\\lambda}2-mm very long baseline interferometry (VLBI) observations of the radio galaxy NGC 1052, conducted with the Korean VLBI Network (KVN) using a wide-band recording mode. Leveraging the wide bandwidth covering a velocity range at 2300 km/s, we successfully detect broad (> 700 km/s) multi-component SO J_N = 3_3 - 2_2 absorption against the sub-parsec-scale continuum structure. The absorption profile consists of both redshifted and blueshifted components, including a newly identified blueshifted feature at -412 km/s relative to the systemic velocity. Significant SO absorption is confined to the central components, with no substantial detection toward the outer jet components. This constrains the location of SO gas to a compact region smaller than 0.45 pc in the sub-parsec vicinity of the supermassive black hole (SMBH). Our results support the scenario in which SO molecules are evaporated through shock heating caused by jet-torus interaction. The SO gas clumps are likely driven outward by the jet, with some returning toward the SMBH as inflowing material. Comparison with 321 GHz H2O masers reveals partial similarities in spatial distribution and radial velocity, suggesting that the jet-torus interaction may also trigger the excitation of H2O masers.",
      "pdf_url": "https://arxiv.org/pdf/2601.03530.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03642",
      "title": "An Enhanced Sample of Galactic Red Supergiants Reveals Spiral Structures",
      "authors": [
        "Zehao Zhang",
        "Biwei Jiang",
        "Yi Ren"
      ],
      "abstract": "An Enhanced Sample of Galactic Red Supergiants Reveals Spiral Structures Zehao Zhang, Biwei Jiang, Yi Ren Accepted for publication in ApJ. 10 figures and 3 tables. Table 3 is available for download in machine-readable format after publication, or can be obtained from the corresponding author upon request Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Red supergiants (RSGs), representing a kind of massive young stellar population, have rarely been used to probe the structure of the Milky Way, mainly due to the long-standing scarcity of Galactic RSG samples. The Gaia BP/RP spectra (hereafter XP), which cover a broad wavelength range, provide a powerful tool for identifying RSGs. In this work, we develop a feedforward neural network classifier that assigns to each XP spectrum a probability of being an RSG, denoted as $\\mathrm{P(RSG)}$. We perform ten independent runs with randomly divided training and validation sets, and apply each run to all XP spectra of stars with $G < 12$ mag. By selecting sources with $\\mathrm{P(RSG)} \\geq 0.9$, ten high-confidence candidate samples are obtained. A star is considered a ture Galactic RSG only if it appears in at least eight of these samples, yielding a final catalog of 2,436 objects. These RSGs show a clear spatial correlation with OB stars and trace the Galactic spiral arms well, confirming the reliability of our classification, and highlighting their potential to serve as powerful tracers of the Milky Way's structure.",
      "pdf_url": "https://arxiv.org/pdf/2601.03642.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03680",
      "title": "Predicting dust temperature from molecular line data using machine learning",
      "authors": [
        "Tenta Dougome",
        "Yoshito Shimajiri",
        "Kazuya Saigo",
        "Sanemichi Takahashi",
        "Miyu Kido",
        "Shu Ishibashi",
        "Shigehisa Takakuwa"
      ],
      "abstract": "Predicting dust temperature from molecular line data using machine learning Tenta Dougome, Yoshito Shimajiri, Kazuya Saigo, Sanemichi Takahashi, Miyu Kido, Shu Ishibashi, Shigehisa Takakuwa 20 pages, 16 figures, 4 tables, submitted Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We conducted experiments with machine learning techniques to construct dust temperature maps from the CO isotopologue molecular line data in the Orion A molecular cloud. In the classical astrophysical methodology, multi-band continuum data are required to derive the dust temperature. The present study aims to investigate the capability and limitations of machine learning techniques to derive dust temperatures in regions without multi-band dust continuum data. We investigated how the number of pixels used for training influences prediction accuracy, and how the dust temperatures sampled in the training area influence prediction accuracy. We found that $\\sim$5\\% of the total number of pixels in the observational region is sufficient for training to obtain accurate predictions. Furthermore, a dust temperature sample within the training area should cover the whole temperature range and have a similar sample distribution to that of the entire observing region for an accurate prediction. The $^{12}$CO / $^{13}$CO ratio is often found to be the most important feature in predicting the dust temperature. As the $^{12}$CO / $^{13}$CO ratio is a tracer of PDR, the machine learning technique could connect the dust temperatures to the PDRs. We also found that the condition of thermal gas-dust coupling is not required for accurate prediction of the dust temperature from the molecular line data, and that machine learning is capable of capturing information more than classical astrophysical concepts.",
      "pdf_url": "https://arxiv.org/pdf/2601.03680.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03705",
      "title": "Identification of solid N2O in interstellar ices using open JWST data",
      "authors": [
        "V. Karteyeva",
        "R. Nakibov",
        "I. Petrashkevich",
        "M. Medvedev",
        "A. Vasyunin"
      ],
      "abstract": "Identification of solid N2O in interstellar ices using open JWST data V. Karteyeva, R. Nakibov, I. Petrashkevich, M. Medvedev, A. Vasyunin 9 pages, 4 figures, 2 tables, accepted to A&A Letters Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Context. There are only six molecules containing N-O bond that are detected in gaseous phase in interstellar medium. One of those is nitrous oxide (N2O), which was searched for but not found in solid form from as early as Infrared Space Observatory (ISO) mission was launched. The observational capabilities of James Webb Space Telescope (JWST) present a possibility to identify solid interstellar N2O. Aims. We aim to identify nitrous oxide in open JWST spectra of interstellar ices towards a sample of Class 0, 0/I and flat protostars using the relevant laboratory mixtures of N2O-bearing interstellar ice analogues. Methods. A set of laboratory infrared transmission spectra was obtained for the following mixtures: N2O:CO2=1:20, N2O:CO=1:20, N2O:N2=1:20, N2O:CO2:CO=1:15:5, N2O:CO2:N2=1:15:13 at 10-23 K. A search for N2O in JWST NIRSpec spectra towards 50 protostars was performed by fitting the 4.44-4.47 um (2250-2235 cm-1) NN-stretch absorption band with new laboratory mixtures of N2O-bearing ices. Results. We claim the first secure identification of N2O in 16 protostars. The fitting results show that N2O is formed predominantly within the apolar layer of the ice mantles, rich in CO, CO2 and N2. The abundance of solid N2O is estimated as 0.2-2.1% relative to solid CO. We present band strengths for N2O in the mixtures corresponding to the apolar layer. Also, an identification of the C-N stretch band at 4.42 um (2260 cm-1) is reported, which we tentatively assign to HNCO, the simplest C-N bond carrier.",
      "pdf_url": "https://arxiv.org/pdf/2601.03705.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03901",
      "title": "HST+IGRINS synergy to characterise the newly discovered metal-rich bulge globular cluster Patchick 126",
      "authors": [
        "Elisa R. Garro",
        "Davide Massari",
        "José G. Fernández-Trincado",
        "Edoardo Ceccarelli",
        "Chris Sneden",
        "Fernando Aguado-Agelet",
        "Melike Afşar",
        "Michele Bellazzini",
        "Rafael Guerço",
        "Dante Minniti",
        "Mattia Libralato",
        "Beatriz Barbuy",
        "Bruno Dias"
      ],
      "abstract": "HST+IGRINS synergy to characterise the newly discovered metal-rich bulge globular cluster Patchick 126 Elisa R. Garro, Davide Massari, José G. Fernández-Trincado, Edoardo Ceccarelli, Chris Sneden, Fernando Aguado-Agelet, Melike Afşar, Michele Bellazzini, Rafael Guerço, Dante Minniti, Mattia Libralato, Beatriz Barbuy, Bruno Dias 14 pages, 8 figures, 1 Appendix Astrophysics of Galaxies (astro-ph.GA) We present the first comprehensive spectroscopic and deep photometric study of the globular cluster (GC) candidate Patchick~126. The spectroscopic analysis is based on high-resolution near-infrared data obtained with the IGRINS spectrograph, while the photometric analysis relies on HST observations from the Hubble Missing Globular Cluster Survey (MGCS). We derived abundances for $\\alpha$-(O, Mg, Si, Ca, Ti), light-(C, N), odd-Z (Na, Al), iron-peak (Fe, Co, Cr, Ni, Mn, V), and s-process elements (Ce) for four red giant stars observed in the H and K bands. Our results yield a mean metallicity of $\\langle\\mathrm{[Fe/H]}\\rangle = -0.30\\pm0.03$, with no evidence of intrinsic variation, and an $\\alpha$-enhancement of $\\langle\\mathrm{[\\alpha/Fe]}\\rangle =+0.19\\pm0.02$, consistent with the trends of metal-rich Galactic GCs. We detect an intrinsic C-N anti-correlation, but no Na-O or Al-Mg anti-correlations, in agreement with expectations for low-mass, metal-rich clusters. From the HST photometry, we constructed deep CMDs extending $\\sim 2-3$ magnitudes below the MSTO. This depth allowed us to provide the first robust age estimate for the cluster. Applying the methods developed within the CARMA project, we derive an age of $11.9^{+0.3}_{-0.4}$~Gyr. We obtain a photometric metallicity of [Fe/H]$=-0.28$, in agreement with the spectroscopic results. The colour excess we derived, E(B-V) = 1.08, confirms that Patchick~126 is a heavily reddened cluster, located at a heliocentric distance of 7.8 kpc. From the orbital parameters, including energy, vertical angular momentum, circularity, and maximum vertical height, we find that Patchick~126 closely follows a disc-like orbit. Taken together, these results confirm that Patchick 126 is an in situ, low-mass globular cluster of the Milky Way, exhibiting properties that lie at the boundary between old-OCs and GCs.",
      "pdf_url": "https://arxiv.org/pdf/2601.03901.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04024",
      "title": "HI-bearing dark galaxies predictions from constrained Local Group simulations: how many and where to find them",
      "authors": [
        "Guacimara García-Bethencourt",
        "Arianna Di Cintio",
        "Sébastien Comerón",
        "Elena Arjona-Gálvez",
        "Ana Contreras-Santos",
        "Salvador Cardona-Barrero",
        "Chris B. A. Brook",
        "Andrea Negri",
        "Noam I. Libeskind",
        "Alexander Knebe"
      ],
      "abstract": "HI-bearing dark galaxies predictions from constrained Local Group simulations: how many and where to find them Guacimara García-Bethencourt, Arianna Di Cintio, Sébastien Comerón, Elena Arjona-Gálvez, Ana Contreras-Santos, Salvador Cardona-Barrero, Chris B. A. Brook, Andrea Negri, Noam I. Libeskind, Alexander Knebe 14 pages, 14 figures (submitted to A&A) Astrophysics of Galaxies (astro-ph.GA) Dark galaxies are small, DM-dominated halos whose gas remains in hydrostatic and thermal equilibrium and has never formed stars. They are of particular interest because they represent a strong prediction of the LCDM model. As of today, only a handful of candidates have been observed, the most intriguing of which being Cloud-9. Using several state-of-the-art hydrodynamical simulations, we aim to predict the abundance of dark galaxies expected within our Local Group (LG), characterise their properties and provide guidance for their potential detection. We analyse LG simulations with constrained initial conditions, run with different codes, implementing different baryonic physics, feedback prescriptions, and employing two distinct values of SF density threshold, n_th=0.13 and 10 cm^-3, to select samples of dark and bright galaxies harboured in haloes of similar mass. We demonstrate that dark galaxies exist in such simulations, though their number is larger in simulations that use a higher, more realistic n_th. These galaxies, whose gas remains diffuse and never forms stars, predominantly inhabit less-concentrated, higher-spin DM halos than their luminous counterparts. Dark galaxies are typically found in low-density regions at the outskirts of the LG, and their evolution across z indicate that both the DM and gas densities in their surroundings were consistently lower than those found around bright galaxies, making them less susceptible to interactions, mergers, or gas inflows. We estimate that up to 8 dark galaxies should be detectable in HI emission within 2.5 Mpc of the LG, with the FAST telescope, accounting for its sky coverage and minimum M_HI and N_HI. Current hydrodynamical simulations of galaxies, combined with upcoming HI surveys, will offer a direct and powerful test of LCDM through their ability to predict and measure properties of dark galaxies within and beyond the LG.",
      "pdf_url": "https://arxiv.org/pdf/2601.04024.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04059",
      "title": "Spiral galaxies with flat radial abundance gradients at large radii",
      "authors": [
        "L.S. Pilyugin",
        "G. Tautvaisiene"
      ],
      "abstract": "Spiral galaxies with flat radial abundance gradients at large radii L.S. Pilyugin, G. Tautvaisiene Accepted to Astronomy and Astrophysics, 11 pages, 6 figures Astrophysics of Galaxies (astro-ph.GA) We consider the oxygen abundance distributions for a sample of massive spiral galaxies from the MaNGA survey in which the radial abundance gradient flattens to a constant value outside of the outer break radius, Rb,outer. The outer break radius can be considered as a dividing radius between the galaxy and the circumgalactic medium (CGM). The values of the Rb,outer range from 0.8R_{25} to 1.45R_{25}, where R_{25} is the optical radius of the galaxy. The oxygen abundances in the CGM range from 12+log(O/H) ~ 8.0 to ~ 8.5. The O/H distribution in each of our galaxies also shows the inner break in the radial abundance profile at the radius Rb,inner. The metallicity gradient in the outer part of the galaxy is steeper than in the inner part. The behaviour of the radial abundance distributions in these galaxies can be explained by assuming an interaction with (capture of the gas from) a small companion and adopting the model for the chemical evolution of galaxies with a radial gas flow. The interaction with a companion results in the mixing of gas and a flat metallicity gradient in the CGM. The capture of the gas from a companion increases the radial gas inflow rate and changes the slope of the radial abundance gradient in the outer part of the galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2601.04059.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04103",
      "title": "Modeling the Effect of C/O Ratio on Complex Carbon Chemistry in Cold Molecular Clouds",
      "authors": [
        "Alex N. Byrne",
        "Christopher N. Shingledecker",
        "Edwin A. Bergin",
        "Martin S. Holdren",
        "Gabi Wenzel",
        "Ci Xue",
        "Troy Van Voorhis",
        "Brett A. McGuire"
      ],
      "abstract": "Modeling the Effect of C/O Ratio on Complex Carbon Chemistry in Cold Molecular Clouds Alex N. Byrne, Christopher N. Shingledecker, Edwin A. Bergin, Martin S. Holdren, Gabi Wenzel, Ci Xue, Troy Van Voorhis, Brett A. McGuire 17 pages and 10 figures. Accepted for publication in The Astrophysical Journal. MP4 files for Figures 4, 5, and 6 are included as ancillary files Astrophysics of Galaxies (astro-ph.GA) Elemental abundances, which are often depleted with respect to the solar values, are important input parameters for kinetic models of interstellar chemistry. In particular, the amount of carbon relative to oxygen is known to have a strong effect on modeled abundances of many species. While previous studies have focused on comparison of modeled and observed abundances to constrain the C/O ratio, the effects of this parameter on the underlying chemistry have not been well-studied. We investigated the role of the C/O ratio on dark cloud chemistry using the NAUTILUS code and machine learning techniques for molecular representation. We find that modeled abundances are quite sensitive to the C/O ratio, especially for carbon-rich species such as carbon chains and polycyclic aromatic hydrocarbons (PAHs). CO and simple ice-phase species are found to be major carbon reservoirs under both oxygen-poor and oxygen-rich conditions. The appearance of C3H4 isomers as significant carbon reservoirs, even under oxygen-rich conditions, indicates the efficiency of gas-phase C3 formation followed by adsorption and grain-surface hydrogenation. Our model is not able to reproduce the observed, gas-phase C/H ratio of TMC-1 CP at the time of best fit with any C/O ratio between 0.1 and 3, suggesting that the modeled freeze-out of carbon-bearing molecules may be too rapid. Future investigations are needed to understand the reactivity of major carbon reservoirs and their conversion to complex organic molecules.",
      "pdf_url": "https://arxiv.org/pdf/2601.04103.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04133",
      "title": "A census of star-formation and gas mass tracers in two lensed $z \\sim 4$ dusty star-forming galaxies",
      "authors": [
        "David Vizgan",
        "Joaquin D. Vieira",
        "Justin S. Spilker",
        "Simon Birrer",
        "Nan Zhang",
        "Manuel Aravena",
        "Melanie A. Archipley",
        "Jack E. Birkin",
        "Jared Cathey",
        "Scott C. Chapman",
        "Veronica J. Dike",
        "Anthony H. Gonzalez",
        "Thomas R. Greve",
        "Gayathri Gururajan",
        "Ryley Hill",
        "Matthew A. Malkan",
        "Desika Narayanan",
        "Kedar A. Phadke",
        "Vismaya Pillai",
        "Ana C. Posses",
        "Manuel Solimano",
        "Nikolaus Sulzenauer",
        "Dazhi Zhou"
      ],
      "abstract": "A census of star-formation and gas mass tracers in two lensed $z \\sim 4$ dusty star-forming galaxies David Vizgan, Joaquin D. Vieira, Justin S. Spilker, Simon Birrer, Nan Zhang, Manuel Aravena, Melanie A. Archipley, Jack E. Birkin, Jared Cathey, Scott C. Chapman, Veronica J. Dike, Anthony H. Gonzalez, Thomas R. Greve, Gayathri Gururajan, Ryley Hill, Matthew A. Malkan, Desika Narayanan, Kedar A. Phadke, Vismaya Pillai, Ana C. Posses, Manuel Solimano, Nikolaus Sulzenauer, Dazhi Zhou 26 pages, 14 figures, 5 tables. Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We present new and archival Atacama Large Millimeter/submillimeter Array (ALMA) observations of two strongly lensed dusty star-forming galaxies (DSFGs) selected from the South Pole Telescope survey, SPT0418-47 $(z = 4.225)$ and SPT2147-50 $(z = 3.760)$. We study the [C II], CO(7-6), [C I](2-1), and, in SPT0418-47, $p$-H$_2$O emission, which along with the underlying continuum (rest-frame 160 $\\mu$m and 380 $\\mu$m) are routinely used as tracers of gas mass and/or star-formation rate (SFR). We perform a pixel-by-pixel analysis of both sources in the image plane to study the resolved Kennicutt-Schmidt relation, finding generally good agreement between the slopes of the SFR versus gas mass surface density using the different tracers. Using lens modeling methods, we find that the dust emission is more compact than the line emission in both sources, with CO(7-6) and [C I](2-1) similar in extent and [C II] the most extended, reminiscent of recent findings of extended [C II] spatial distributions in galaxies at similar cosmic epochs. We develop the [C I](2-1) / CO(7-6) flux density ratio as an observable proxy for gas depletion timescale ($\\tau_{\\rm dep}$), which can be applied to large samples of DSFGs, in lieu of more detailed inferences of this timescale which require analysis of observations at multiple wavelengths. Furthermore, the extended [C II] emission in both sources, compared to the total continuum and line emission, suggests that [C II], used in recent years as a molecular gas mass and SFR tracer in high-$z$ galaxies, may not always be a suitable tracer of these physical quantities.",
      "pdf_url": "https://arxiv.org/pdf/2601.04133.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03758",
      "title": "A Multiband Photometric Study of RR Lyrae Stars in M53 (NGC 5024)",
      "authors": [
        "Shantanu A. Gaur , Nitesh Kumar , Anupam Bhardwaj , Aasheesh Raturi , Dolphin Institute of Biomedical and Natural Sciences, Dehradun, 248007, Uttarakhand, India Department of Physics, Applied Science Cluster, University of Petroleum and Energy Studies , Dehradun, 248007, Uttarakhand, India, Inter-University Centre for Astronomy and Astrophysics , Post Bag 4, Ganeshkhind, Pune, 411007, Maharashtra, India)"
      ],
      "abstract": "A Multiband Photometric Study of RR Lyrae Stars in M53 (NGC 5024) Shantanu A. Gaur (1), Nitesh Kumar (2), Anupam Bhardwaj (3), Aasheesh Raturi (1),  ((1) Dolphin (PG) Institute of Biomedical and Natural Sciences, Dehradun, 248007, Uttarakhand, India (2) Department of Physics, Applied Science Cluster, University of Petroleum and Energy Studies (UPES), Dehradun, 248007, Uttarakhand, India, (3) Inter-University Centre for Astronomy and Astrophysics (IUCAA), Post Bag 4, Ganeshkhind, Pune, 411007, Maharashtra, India) Accepted for publication in New Astronomy Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We present a multiband (UBVRI) time-series photometric study of RR Lyrae (RRL) stars in the globular cluster Messier 53 (NGC 5024) to refine their pulsation properties and determine a precise cluster distance. The archival photometric data includes images taken over 22 years and 3 months using different optical telescopes, providing an excellent time baseline to investigate light curves of variable stars. Using Lomb-Scargle periodogram, we derived accurate periods for 29 fundamental-mode (RRab) and 35 first-overtone (RRc) RRLs. Template-fitting to phase-folded light curves provided robust mean magnitudes and amplitudes. The refined periods confirm M53 as an Oosterhoff II cluster, with a mean period of 0.649 days for RRab and 0.346 days for RRc, and a high RRc fraction (54.7\\%). Most RRLs align with the horizontal branch in the color-magnitude diagram, while a few outliers result from blending effects. Period-amplitude diagrams show RRab stars following the Oosterhoff II locus. We derived I-band period-luminosity and multi-band period-Wesenheit relations, comparing them with theoretical predictions. A weighted mean distance modulus of 16.242 $\\pm$ 0.05 mag yields a cluster distance of 17.717 $\\pm$ 0.408 kpc, in agreement with recent estimates based on parallaxes from Gaia data.",
      "pdf_url": "https://arxiv.org/pdf/2601.03758.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03820",
      "title": "Disc fragmentation. II. Ejection of low mass Free Floating Planets from growing binary systems",
      "authors": [
        "Sergei Nayakshin",
        "Luyao Zhang",
        "Aleksandra Ćalović",
        "Hans Lee",
        "Clement Baruteau",
        "Farzana Meru",
        "Lucio Mayer"
      ],
      "abstract": "Disc fragmentation. II. Ejection of low mass Free Floating Planets from growing binary systems Sergei Nayakshin, Luyao Zhang, Aleksandra Ćalović, Hans Lee, Clement Baruteau, Farzana Meru, Lucio Mayer Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Observations indicate that disc fragmentation due to Gravitational Instability (GI) is the likely origin of massive companions to stars, such as giant planets orbiting M-dwarf stars, Brown Dwarf (BD) companions to FGK stars, and binary stars with separations smaller than 100 au. Additionally, we have recently showed that disc fragmentation in young rapidly evolving binary systems ejects an abundant population of massive Jupiter-mass Free-Floating Planets (FFPs). In this model, a massive disc around an initially single protostar undergoes GI and hatches a number of fragments; the most massive oligarch grows by runaway accretion into the secondary star. As the system rearranges itself from a single to a binary star configuration, a dramatic \"pincer movement\" by the binary ejects planets through dynamical interactions with the stars. Here we propose that the same scenario applies to an even more abundant population of smaller FFPs discovered by the microlensing surveys. Although disc fragmentation is usually believed to form only massive objects, several pathways for forming small core-dominated planets at separations of tens of au exist. We present results from three complementary simulation approaches, all of which confirm planet ejection efficiency as high as 0.5 for secondaries more massive than $\\sim 10$\\% of the primary star mass. On the other hand, Jovian mass planets migrate through the region of tens of au too rapidly to eject planets from that region. We discuss implications of this scenario, concluding that microlensing FFPs may be the most convincing evidence yet that disc fragmentation forms planets much less massive than Jupiter.",
      "pdf_url": "https://arxiv.org/pdf/2601.03820.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03951",
      "title": "Broadband spectroscopy of astrophysical ice analogues: IV. Optical constants of N$_2$ ice in the terahertz and mid-infrared ranges",
      "authors": [
        "F. Kruczkiewicz",
        "A.A. Gavdush",
        "F. Ribeiro",
        "D. Campisi",
        "A. Vyjidak",
        "B.M. Giuliano",
        "G.A. Komandin",
        "S.V. Garnov",
        "T. Grassi",
        "P. Theulé",
        "K.I. Zaytsev. A.V. Ivlev",
        "Paola Caselli"
      ],
      "abstract": "Broadband spectroscopy of astrophysical ice analogues: IV. Optical constants of N$_2$ ice in the terahertz and mid-infrared ranges F. Kruczkiewicz, A.A. Gavdush, F. Ribeiro, D. Campisi, A. Vyjidak, B.M. Giuliano, G.A. Komandin, S.V. Garnov, T. Grassi, P. Theulé, K.I. Zaytsev. A.V. Ivlev, Paola Caselli Accepted for publication in A&A, 9 pages, 3 figures Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Context. Understanding the optical properties of astrophysical ices is crucial for modeling dust continuum emission and radiative transfer in cold, dense interstellar environments. Molecular nitrogen (N$_2$), a major nitrogen reservoir in protoplanetary disks, plays a key role in nitrogen chemistry, yet the lack of direct terahertz (THz)--infrared (IR) optical constants for N$_2$ ice introduces uncertainties in radiative transfer models, snowline locations, and disk mass estimates. Aims. We present direct measurements of the optical properties of N$_2$ ice over a broad THz--IR spectral range using terahertz pulsed spectroscopy (TPS) and Fourier-transform infrared spectroscopy (FTIR), supported by density functional theory (DFT) calculations and comparison with literature data. Methods. N$_2$ ice was grown at cryogenic temperatures by gas-phase deposition onto a cold silicon window. The THz complex refractive index was directly reconstructed from TPS data, while the IR response was derived from FTIR measurements using Kramers--Kronig relations. The optical response was parameterized with a Lorentz dielectric model and validated by DFT calculations. Results. The complex refractive index of N$_2$ ice is quantified from $\\nu = 0.3$--$16$~THz ($\\lambda = 1$~mm--$18.75~\\mu$m). Resonant absorption peaks at $\\nu_\\mathrm{L} = 1.47$ and $2.13$~THz with damping constants $\\gamma_\\mathrm{L} = 0.03$ and $0.22$~THz are attributed to optically active phonons of the $\\alpha$-N$_2$ crystal. Conclusions. We provide a complete set of the THz--IR optical constants for \\ce{N2} ice by combining TPS and FTIR spectroscopy. Our results have implications for future observational and modeling studies of protoplanetary disk evolution and planet formation.",
      "pdf_url": "https://arxiv.org/pdf/2601.03951.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04091",
      "title": "Dissecting the dust distribution and polarization around two B213 young stellar objects with ALMA",
      "authors": [
        "Asako Sato",
        "Anaëlle Maury",
        "Josep M. Girart",
        "Andrea Bracco",
        "Patrick Hennebelle",
        "Qizhou Zhang",
        "Valeska Valdivia"
      ],
      "abstract": "Dissecting the dust distribution and polarization around two B213 young stellar objects with ALMA Asako Sato, Anaëlle Maury, Josep M. Girart, Andrea Bracco, Patrick Hennebelle, Qizhou Zhang, Valeska Valdivia Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The earliest stages of disk formation and dust evolution during the protostellar phase remain poorly constrained. Millimeter dust emission and its polarization provide key insights into the physical processes and material distribution at the envelope-disk interface. We present ALMA polarimetric observations at 1.4 mm and 3 mm of two young stellar objects in Taurus, IRAS 04166+2706 (K04166) and IRAS 04169+2702 (K04169), probing scales from 25 au to 3000 au. We model the Stokes I emission to separate disk and envelope contributions and analyze the polarization properties to identify the dominant polarization mechanisms. K04166 shows extended Stokes I and polarized emission tracing a tentative hourglass magnetic field morphology in its envelope. In the inner envelope and disk (< 100 au), the properties of the polarized emission change, suggesting either a toroidal magnetic field or the presence of large grains. In contrast, K04169 exhibits compact Stokes I and polarized emission consistent with self-scattering from the disk. Both disks are extremely compact, but only K04166 retains a substantial envelope. Our multiscale ALMA polarimetric observations reveal a transition from magnetically aligned grains in envelopes to self-scattering in disks within the transition region of 20-50 au. These results provide important clues on dust grain growth and magnetic field morphology at the disk-envelope scales. Despite being embedded in the same filament, the two sources display striking differences, indicating that K04166 is a young embedded object with a substantial envelope threaded by relatively organized magnetic fields. Meanwhile, K04169 is more evolved, likely to be a young T-Tauri star. However, in both disks, the presence of large grains already suggests a scenario of early dust evolution in disks of the Class 0 stage.",
      "pdf_url": "https://arxiv.org/pdf/2601.04091.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04108",
      "title": "Characterizing the physical and chemical properties of the Class I protostellar system Oph-IRS 44. Binarity, infalling streamers, and accretion shocks",
      "authors": [
        "E. Artur de la Villarmois",
        "V. V. Guzmán",
        "M. L. van Gelder",
        "E. F. van Dishoeck",
        "E. A. Bergin",
        "D. Harsono",
        "N. Sakai",
        "J. K. Jørgensen"
      ],
      "abstract": "Characterizing the physical and chemical properties of the Class I protostellar system Oph-IRS 44. Binarity, infalling streamers, and accretion shocks E. Artur de la Villarmois, V. V. Guzmán, M. L. van Gelder, E. F. van Dishoeck, E. A. Bergin, D. Harsono, N. Sakai, J. K. Jørgensen Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) (Abridged) In the low-mass star formation process, theoretical models predict that material from the infalling envelope could be shocked as it encounters the outer regions of the disk. Nevertheless, only a few protostars show evidence of these shocks at the disk-envelope interface, and the main formation path of shocked-related species is still unclear. We present new ALMA observations of IRS 44, a Class I source that has previously been associated with accretion shocks, taken at high angular resolution (0.1\"). We target multiple molecular transitions of CO, H2CO, and simple sulfur-bearing species. In continuum emission, the binary nature of IRS 44 is observed for the first time at sub-millimeter wavelengths. Infalling signatures are seen for the CO line and the emission peaks at the edges of the continuum emission around IRS 44 B, the same region where bright SO and SO2 emission is seen. Weak CS and H2CO emission is observed, while OCS, H2S, and H2CS transitions are not detected. IRS 44 B seems to be more embedded than IRS 44 A, indicating a non-coeval formation scenario or the rejuvenation of source B due to late infall. CO emission is tracing the outflow component at large scales, infalling envelope material at intermediate scales, and two infalling streamer candidates are identified at disk scales. Infalling streamers might produce accretion shocks when they encounter the outer regions of the infalling-rotating envelope. These shocks heat the dust and release S-bearing species as well as promoting a lukewarm chemistry in the gas phase. With the majority of carbon locked in CO, there is little free C available to form CS and H2CS in the gas, leaving an oxygen-rich environment. The high column densities of SO and SO2 might be a consequence of two processes: direct thermal desorption from dust grains and gas-phase formation due to the availability of O and S.",
      "pdf_url": "https://arxiv.org/pdf/2601.04108.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.09040",
      "title": "Towards Galactic Archaeology with Inferred Ages of Giant Stars From Gaia Spectra",
      "authors": [
        "Aisha S. Almannaei",
        "Daisuke Kawata",
        "Ioana Ciuca",
        "Connor Fallows",
        "Jason L. Sanders",
        "George Seabroke",
        "Andrea Miglio"
      ],
      "abstract": "Towards Galactic Archaeology with Inferred Ages of Giant Stars From Gaia Spectra Aisha S. Almannaei, Daisuke Kawata, Ioana Ciuca, Connor Fallows, Jason L. Sanders, George Seabroke, Andrea Miglio 15 pages, 9 figures. Accepted by MNRAS Astrophysics of Galaxies (astro-ph.GA) In the era of Gaia, the accurate determination of stellar ages is transforming Galactic archaeology. We demonstrate the feasibility of inferring stellar ages from Gaia's RVS spectra and the BP/RP (XP) spectrophotometric data, specifically for red giant branch and high-mass red clump stars. We successfully train two machine learning models, dubbed SIDRA: Stellar age Inference Derived from Gaia spectRA to predict the age. The SIDRA-RVS model uses the RVS spectra and SIDRA-XP the stellar parameters obtained from the XP spectra. Both models use BINGO, an APOGEE-derived stellar age as the training data. SIDRA-RVS estimates ages of stars whose age is around $\\tau_\\mathrm{BINGO}=10$~Gyr with a standard deviation of residuals of $\\sim$ 0.12 dex in the unseen test dataset, while SIDRA-XP achieves higher precision with residuals $\\sim$ 0.064 dex for stars around $\\tau_\\mathrm{BINGO}=10$~ Gyr. Since SIDRA-XP outperforms SIDRA-RVS, we apply SIDRA-XP to analyse the ages for 2,218,154 stars. This allowed us to map the chronological and chemical properties of Galactic disc stars, reproducing the known distinct features such as the Gaia-Sausage-Enceladus merger and a potential gas-rich interaction event linked to the first infall of the Sagittarius dwarf galaxy. This study demonstrates that machine learning techniques applied to Gaia's spectra can provide valuable individual age information, particularly for giant stars, thereby enhancing our understanding of the Milky Way's formation and evolution.",
      "pdf_url": "https://arxiv.org/pdf/2412.09040.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.20386",
      "title": "Revisiting the Radial Metallicity Gradient-Age Relation in the Milky Way's Thin and Thick Disks",
      "authors": [
        "Ao Chen",
        "Juntai Shen",
        "Chun Wang",
        "Yang Huang"
      ],
      "abstract": "Revisiting the Radial Metallicity Gradient-Age Relation in the Milky Way's Thin and Thick Disks Ao Chen, Juntai Shen, Chun Wang, Yang Huang 10 pages, 9 figures, accepted by MNRAS Astrophysics of Galaxies (astro-ph.GA) Galactic disks typically exhibit a negative radial metallicity gradient, indicating faster enrichment in the inner regions. Recent studies report that this gradient becomes flatter with increasing stellar age in the Milky Way's (MW) thin disk, while the thick disk exhibits a mildly positive gradient across all ages. In this work, we revisit the metallicity gradient-age relation (MGAR) in both the thin and thick disks of the MW, using spectroscopic data from LAMOST DR8 and stellar ages calibrated with asteroseismology. Our results show a steadily flattening MGAR in the thin disk and confirm a positive gradient $\\sim0.013\\,\\mathrm{dex\\,kpc^{-1}}$ in the thick disk. The flattening in the thin disk may be caused by large-scale radial migration induced by transient spiral arms, or by a time-dependent steepening of the interstellar medium (ISM) metallicity gradient as suggested by recent FIRE2 simulations. The positive gradient in the thick disk may reflect early enrichment of the outer regions by strong feedback or starburst-driven outflows in a turbulent, gas-rich proto-disk. These findings suggest distinct chemodynamical evolution paths for the MW's thin and thick disks and provide valuable constraints for future models of Galactic chemical evolution.",
      "pdf_url": "https://arxiv.org/pdf/2508.20386.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.12624",
      "title": "Revisiting thermodynamics at the outskirts of the Perseus cluster with Suzaku: importance of modeling the Hot Galactic gas",
      "authors": [
        "Kyoko Matsushita",
        "Hayato Sugiyama",
        "Masaki Ueda",
        "Nobuhiro Okabe",
        "Kotaro Fukushima",
        "Shogo B. Kobayashi",
        "Noriko Y. Yamasaki",
        "Kosuke Sato"
      ],
      "abstract": "Revisiting thermodynamics at the outskirts of the Perseus cluster with Suzaku: importance of modeling the Hot Galactic gas Kyoko Matsushita, Hayato Sugiyama, Masaki Ueda, Nobuhiro Okabe, Kotaro Fukushima, Shogo B. Kobayashi, Noriko Y. Yamasaki, Kosuke Sato 18 pages, 24 figures, accepted to Publcations of the Astronomical Society of Japan Astrophysics of Galaxies (astro-ph.GA) The thermodynamic properties of the intracluster medium (ICM) at the outskirts of galaxy clusters provide valuable insights into the growth of the dark matter halo and the heating of the ICM. Considering the results of the soft X-ray background study of non-cluster Suzaku fields, we revisit 65 Suzaku pointing observations of the Perseus cluster in eight azimuthal directions beyond 1 Mpc (0.8 $r_{500}$). A possible foreground component, whose spectrum is modeled as a 1 keV collisional ionization equilibrium plasma, significantly affects the temperature and density measurements of the ICM in cluster outskirts. The emission measures in the six arms are similar, showing that the radial slopes of temperature and density follow $r^{-0.67\\pm0.25}$ and $r^{-2.21\\pm 0.06}$, respectively. The radial pressure profile is close to the average profile measured by the Planck satellite. The resulting entropy slope is $\\propto r^{0.81\\pm 0.25}$, consistent with the theoretical slope of 1.1. The integrated gas fraction, the ratio of the integrated gas mass to the hydrostatic mass, is estimated to be 0.13$\\pm$0.01 and 0.18$\\pm$0.02 at $r_{500}$ and $r_{200}$, respectively, consistent with the cosmic baryon fraction. These results suggest that the ICM at the cluster outskirts is quite regular and close to hydrostatic equilibrium. The remaining two arms show that the emission measure is higher by a factor of 1.5-2, possibly due to accretion from filaments from the large-scale structure. A sudden drop in the emission measure also occurs in a direction toward one of the filaments.",
      "pdf_url": "https://arxiv.org/pdf/2509.12624.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05113",
      "title": "Spatially resolved PAH$_{3.3}$ emission and stellar ages in ram pressure stripped clumps at $z\\sim0.3$",
      "authors": [
        "Pietro Benotto",
        "Benedetta Vulcani",
        "Peter J. Watson",
        "Giulia Rodighiero",
        "Bianca M. Poggianti",
        "Marco Gullieuszik",
        "Jacopo Fritz",
        "Thomas S.-Y. Lai",
        "Augusto E. Lassen",
        "Matthew A. Malkan",
        "Alessia Moretti"
      ],
      "abstract": "Spatially resolved PAH$_{3.3}$ emission and stellar ages in ram pressure stripped clumps at $z\\sim0.3$ Pietro Benotto (INAF OAPd - Unipd), Benedetta Vulcani, Peter J. Watson, Giulia Rodighiero, Bianca M. Poggianti, Marco Gullieuszik, Jacopo Fritz, Thomas S.-Y. Lai, Augusto E. Lassen, Matthew A. Malkan, Alessia Moretti Accepted for publication in A&A, 17 pages Astrophysics of Galaxies (astro-ph.GA) Ram pressure stripping (RPS) plays a crucial role in shaping galaxy evolution in dense environments, yet its impact on the molecular and dusty phases of the interstellar medium remains poorly understood. We present JWST/NIRCam $3.3\\mathrm{\\mu m}$ polycyclic aromatic hydrocarbon (PAH) emission maps for the nine most striking RPS galaxies in the Abell 2744 cluster at redshift $z_{cl}=0.306$, tracing the effects of environmental processes on small dust grains. Exploiting multi-band JWST/NIRCam and HST photometry, we performed a spatially resolved ultraviolet (UV) to mid-infrared (MIR) spectral energy distribution (SED) fitting to characterise stellar populations in both galactic disks and clumps detected in the stripped tails. We detected PAH$_{3.3}$ emission in eight of the nine galaxies at $5\\sigma$, with morphologies revealing disk truncation and elongation along the RPS direction. In three galaxies, PAH$_{3.3}$ emission is also found in star-forming clumps embedded in the stripped tails up to a distance of $40\\mathrm{kpc}$. Star formation rates inferred from PAH$_{3.3}$ emission are in agreement with those derived from SED fitting averaged over the past $100\\mathrm{Myr}$ within an intrinsic scatter of $0.4\\mathrm{dex}$, but the relation appears to be age-dependent. The spatial correlation between the PAH strength, stellar age, and star formation rate (SFR) is consistent across disks and tails and demonstrates that PAH-carrying molecules can survive and become stripped by ram pressure. Finally, age gradients revealed by the SED fitting provide observational evidence of the fireball model in star-forming, stripped clumps of galaxies at $z \\sim 0.3$. This work represents the first detailed study of PAH emission in cluster galaxies, offering new insights into the fate of dust and star formation in extreme environments.",
      "pdf_url": "https://arxiv.org/pdf/2511.05113.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.01763",
      "title": "When the Shadow Meets Its Measure: Assessing the Feasibility of Submillimeter Black Hole Shadow Imaging in Megamaser Disk AGN",
      "authors": [
        "Roman N. Burridge",
        "Geoffrey C. Bower"
      ],
      "abstract": "When the Shadow Meets Its Measure: Assessing the Feasibility of Submillimeter Black Hole Shadow Imaging in Megamaser Disk AGN Roman N. Burridge, Geoffrey C. Bower Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Active galactic nuclei (AGN) hosting water megamaser disks enable exceptionally precise geometric determinations of black hole mass, distance, inclination, and dynamical center. In anticipation of upcoming space-based very long baseline interferometry (SVLBI) missions, megamaser disk AGN offer a uniquely valuable probe of strong-gravity regimes through black hole shadow (BHS) imaging beyond SgrA* and M87*. In this work, we (1) map the predicted BHS diameters of twenty-one of the most precisely characterized megamaser disk AGN to submillimeter-millimeter (submm-mm) interferometric baseline requirements, (2) estimate their respective AGN-core flux densities at submm-mm wavelengths, accounting for thermal-dust contamination, extended-jet emission, and intrinsic variability, and (3) determine the astrometric precision required to detect spin-dependent positional offsets between the BHS and the megamaser disk dynamical center. NGC4258 stands out as the only megamaser disk AGN detectable on Earth-L2 baselines in the submm-mm regime, while other megamaser disk AGN in the sample would require baselines approaching Earth-L4/L5 distances; moreover, only a handful exhibit flux densities above $\\sim$10mJy. Our results further indicate a submillimeter excess in NGC4258, suggesting that the accretion disk remains thin down to a transitional radius of $\\lesssim 100$Schwarzschild radii, within which the flow becomes advection dominated. For a maximally spinning supermassive black hole in NGC4258, we show that the astrometric precision of the BHS centroid necessary to detect the BHS-dynamical center offset could, in principle, be achieved with Earth-Moon baselines; however, it would also demand astrometric precision of the water maser dynamical center roughly fifty times better than what is currently attainable.",
      "pdf_url": "https://arxiv.org/pdf/2601.01763.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.02483",
      "title": "CHANG-ES XXXVII. Effects of spectral aging on radio scale heights",
      "authors": [
        "D. C. Smolinski",
        "V. Heesen",
        "M. Brüggen",
        "J.-T. Li",
        "M. Weżgowiec",
        "M. Stein",
        "L.-Y. Lu",
        "T. Wiegert",
        "J. Irwin",
        "R.-J. Dettmar"
      ],
      "abstract": "CHANG-ES XXXVII. Effects of spectral aging on radio scale heights D. C. Smolinski, V. Heesen, M. Brüggen, J.-T. Li, M. Weżgowiec, M. Stein, L.-Y. Lu, T. Wiegert, J. Irwin, R.-J. Dettmar 11 pages, 7 figures, accepted for publication in Astronomy & Astrophysics, section \"4. Extragalactic astronomy\" Astrophysics of Galaxies (astro-ph.GA) Context. Cosmic rays and magnetic fields play an important role for the formation and evolution of galaxies. Radio continuum observations allows us to study them in the haloes of edge-on galaxies. Aims. We explore the frequency dependence of the radio scale height which depends on cosmic ray transport and electron cooling. We test the influence of fundamental galaxy properties, such as star-formation rate (SFR), mass and size. Methods. We used radio continuum data of 16 edge-on galaxies from the Continuum HAloes in Nearby Galaxies -- an EVLA Survey (CHANG-ES). We included maps from the LOw Frequency ARray at 144 MHz and from the Jansky Very Large Array at 3 GHz with 7\" angular resolution. We extracted vertical intensity profiles within the effective radio radius and fitted beam-convolved double-exponential models to separate thin and thick discs. For the thick radio discs, we computed mean spectral indices and scale-height ratios between 144 MHz and 3 GHz. Results. We find a mean scale-height ratio of 1.26 \\pm 0.16. This is much lower than what we would expect for either cosmic ray diffusion or advection if synchrotron and inverse Compton losses dominate for the electrons. There is a moderate positive correlation between the ratio and spectral index of the thick disc: galaxies with high ratios have flat radio spectra. The ratio does not depend on any other galaxy parameter. The radio spectrum of the thick disc, as indicated by the radio spectral index, steepens with total mass (strong correlation) and flattens with SFR-to-mass surface density (moderate correlation). Conclusions. Galaxies with galactic winds have flat radio continuum spectra and large scale heights at low frequencies. This shows effective transport of cosmic rays in such systems.",
      "pdf_url": "https://arxiv.org/pdf/2601.02483.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03350",
      "title": "The SOL $\\textit{(Solar Origin and Life)}$ Project: Detailed characterization of candidates for the ZAMS and Subgiant stages",
      "authors": [
        "C. Eduardo-Oliveira S.",
        "L. Ghezzi",
        "G. F. Porto de Mello",
        "D. Lorenzo-Oliveira",
        "P. V. Souza dos Santos",
        "E. Costa-Almeida"
      ],
      "abstract": "The SOL $\\textit{(Solar Origin and Life)}$ Project: Detailed characterization of candidates for the ZAMS and Subgiant stages C. Eduardo-Oliveira S., L. Ghezzi, G. F. Porto de Mello, D. Lorenzo-Oliveira, P. V. Souza dos Santos, E. Costa-Almeida 26 pages, 9 figures. Accepted for publication in The Astrophysical Journal (ApJ) Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) The context of the Sun in the galactic neighborhood is not well understood, especially when we compare its physical properties to those of nearby stars. Thereby, we still cannot fully comprehend whether or not the Sun is a typical star. This work aims to identify and characterize stars aligned with the solar evolutionary track that could represent it at the ZAMS and subgiant stages. We performed a spectroscopic analysis of 18 photometrically selected candidates using high-resolution and high-SNR spectra as well as the classical spectroscopic method, based on the excitation and ionization equilibria of Fe I and Fe II lines. Additionally, we derived evolutionary parameters using isochrones, and kinematic parameters. We also estimated chromospheric activity levels and performed age estimates through 3 additional independent methods: activity-age relations using the Ca II H $\\&$ K and H$\\alpha$ lines, and rotation periods estimated from TESS light curves. We identified three candidates that provide a good match to the Sun at $\\approx$ 0.5 Gyr (HD 13531 and HD 61033) and subgiant (HD 148577) stages. Moreover, HD 197210 could be of interest when studying the Sun at $\\approx$ 2 Gyr, when the Earth's atmosphere started having a significant amount of oxygen. Our selection method was successful and we were able to identify stars similar to the Sun at different evolutionary stages, which is essential for future research in the search of exoplanets and understand habitability, especially with the advent of the next generation of exoplanet-hunting instruments.",
      "pdf_url": "https://arxiv.org/pdf/2601.03350.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03354",
      "title": "Extreme-ultraviolet synthesis of nanojet-like ejections due to coalescing flux ropes",
      "authors": [
        "Samrat Sen",
        "A. Ramada C. Sukarmadji",
        "D. Nóbrega-Siverio",
        "F. Moreno-Insertis",
        "J. Martínez-Sykora",
        "Patrick Antolin"
      ],
      "abstract": "Extreme-ultraviolet synthesis of nanojet-like ejections due to coalescing flux ropes Samrat Sen, A. Ramada C. Sukarmadji, D. Nóbrega-Siverio, F. Moreno-Insertis, J. Martínez-Sykora, Patrick Antolin Accepted for publication in the ApJ Letter. The animations associated with Figures 1 and 2 are available from the corresponding author upon reasonable request. The code used for the synthetic imaging and spectra is also available from the corresponding author upon reasonable request Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Detection and characterization of small-scale energetic events such as nanoflares and nanojets remain challenging owing to their short lifetimes, small spatial extent, and relatively low energy release, despite their potential role in coronal heating. Recent observations have identified nanojets as small-scale (length $\\lesssim 6.6$~Mm, width $\\lesssim 1$~Mm), fast ($\\sim$~few 100 km s$^{-1}$), and short-lived ($\\lesssim 30$~s) ejections associated with nanoflare-scale energies, providing evidence of magnetic reconnection at small spatial scales. However, the lack of synthetic diagnostics has limited the connection between magnetohydrodynamic (MHD) models and observations. In this Letter, we present synthetic observations of the coalescence of two flux ropes, leading to nanojet-like signatures from a numerical model obtained with the \\texttt{MPI-AMRVAC} code. We report synthetic observables in Extreme-ultraviolet lines compatible with existing instruments such as SDO/AIA, and upcoming MUSE mission, and compare the synthetic observables with an existing observation of nanojets. The synthetic diagnostics of the emissivity maps, Doppler velocity, thermal, and non-thermal line broadening produce key observational properties, suggesting a plausible 3D scenario for nanojet generation where tiny flux ropes reconnect within loops. Our results provide predictions for the detectability of nanojets with current and future spectroscopic facilities, and establish a bridge between MHD modeling and observations.",
      "pdf_url": "https://arxiv.org/pdf/2601.03354.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03539",
      "title": "Perhaps there is no brown dwarf desert? A study of sub-stellar companions with Gaia DR3",
      "authors": [
        "A. L. Wallace",
        "A. R. Casey"
      ],
      "abstract": "Perhaps there is no brown dwarf desert? A study of sub-stellar companions with Gaia DR3 A. L. Wallace, A. R. Casey 11 pages, 14 figures, accepted for publication by PASA Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) The brown dwarf desert describes a range of orbital periods (<5 years) in which fewer brown dwarf-mass companions have been observed around Sun-like stars, when compared to planets and low mass stellar companions. It is therefore theorised that brown dwarf companions are unlikely to form or remain in this period range. The Gaia space telescope is uniquely sensitive to companions in this period range, making it an ideal tool to conduct a survey of the brown dwarf desert. In this study, we use Bayesian inference to analyse data from nearby (<200pc) Sun-like stars in Gaia's DR3 catalogue, assuming single companions. From this, we identify 2673 systems (2.41% of the sample) with possible brown dwarf companions in this period range. Accounting for observational biases, we find that 10.4+0.8-0.6% of nearby Sun-like stars have astrometric errors consistent with a brown dwarf-mass companion with a period less than 5 years, significantly higher than previous studies which reported occurrence rates of <1%. However, we acknowledge the limitations of DR3 and are unable to make a definitive statement without epoch data. By simulating epoch data with multiple companions, we find that, while some of the data can be explained by multiple low-mass brown dwarf companions and high-mass planets (>10MJ), high-mass brown dwarfs (>50MJ) in this period range are comparatively rare. Finally, we used our studies of the brown dwarf distribution to predict the number of companions in the brown dwarf desert we can expect to discover in DR4.",
      "pdf_url": "https://arxiv.org/pdf/2601.03539.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03568",
      "title": "Electron Cyclotron Maser Emission from Ejected Stellar Prominences on V374 Peg",
      "authors": [
        "C. E. Brasseur",
        "M. M. Jardine",
        "S. Daley-Yates",
        "J. F. Donati",
        "J. Morin"
      ],
      "abstract": "Electron Cyclotron Maser Emission from Ejected Stellar Prominences on V374 Peg C. E. Brasseur, M. M. Jardine, S. Daley-Yates, J. F. Donati, J. Morin 12 page, 15 figures, accepted by MNRAS Solar and Stellar Astrophysics (astro-ph.SR) We investigate a possible origin for bursty radio emission observed on the active M dwarf V374 Peg, combining data-driven magnetic field modelling with archival radio light curves. We examine whether stellar prominence ejection can plausibly account for the observed radio bursts that have been attributed to electron cyclotron maser (ECM) emission. Our analysis shows that ejected prominences can produce the required energy range to drive the emission, and that modelled ECM visibility exhibits a rotational phase dependence consistent with the limited observational data (four observed bursts). The results support prominence ejection as a viable mechanism for ECM generation on V374 Peg and motivate further observational campaigns to constrain this process.",
      "pdf_url": "https://arxiv.org/pdf/2601.03568.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03650",
      "title": "Investigating the Center-to-Limb Effects in Helioseismic Data Using 3D Radiative Hydrodynamic Simulations",
      "authors": [
        "Irina N. Kitiashvili"
      ],
      "abstract": "Investigating the Center-to-Limb Effects in Helioseismic Data Using 3D Radiative Hydrodynamic Simulations Irina N. Kitiashvili 20 pages, 14 figures, submitted to ApJ Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Full-disk observations from missions such as the SDO and SOHO have enabled comprehensive studies of solar oscillations and dynamics. Interpreting helioseismic and photospheric data is complicated by systematic center-to-limb variations. To explore the physical origin of these variations, we perform local 3D radiative hydrodynamic simulations that include effects of solar rotation to generate 24-hour synthetic time series of continuum intensity and Doppler velocity for nine viewing angles spanning from -75 to 75 degrees. The simulations reveal a systematic decrease in oscillation power toward the limbs and a pronounced East-West asymmetry that increases with frequency, primarily due to rotation-induced flows. With increasing angular distance from the disk center, the amplitudes and widths of the surface gravity (f) and resonant pressure (p) modes decrease. In contrast, the amplitudes of the corresponding pseudo-modes with frequencies above the acoustic cut-off frequency increase in the intensity power spectra but are suppressed in the velocity spectra. The local helioseismology ring-diagram analysis of the simulation data further demonstrates anisotropic broadening of the modes and distinct differences in background noise and pseudo-mode structure between the intensity and velocity data. These results indicate that the center-to-limb effects arise from both geometric projection and physical factors such as line-formation height and potential effects of the radial differential rotation. The findings provide a framework for correcting helioseismic observations and demonstrate that realistic 3D radiative hydrodynamic simulations are a powerful tool for disentangling geometric and physical biases in solar data.",
      "pdf_url": "https://arxiv.org/pdf/2601.03650.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03978",
      "title": "The Gaia All-Sky Stellar Parameters Service (GASPS)",
      "authors": [
        "I. McDonald",
        "A.A. Zijlstra",
        "N.J. Cox",
        "J. Bernard-Salas"
      ],
      "abstract": "The Gaia All-Sky Stellar Parameters Service (GASPS) I. McDonald, A.A. Zijlstra, N.J. Cox, J. Bernard-Salas 10 pages, 3 figures, proceedings from Astronomical Surveys and Big Data 3, Yerevan. this https URL Solar and Stellar Astrophysics (astro-ph.SR) Temperature and luminosity are the two key diagnostics of a star, yet these cannot come directly from survey data, but must be imputed by comparing those data to models. SED fitting offers a high-precision method to obtain both parameters for stars where both their distance and extinction are well known. The recent publication of many all-sky or large-area surveys coincides the publication of parallaxes and 3D extinction cubes from the Gaia satellite, making it possible to perform SED fitting of truly large ($>10^8$) numbers of Galactic stars for the first time. The analysis of this data requires a high level of automation. Here, we describe the ongoing Gaia All-Sky Stellar Parameters Service (GASPS): the fitting of 240 million SEDs from Gaia DR3 and the extraction of temperatures and luminosities for the corresponding stars using the PySSED code. We demonstrate the quality of the initial results, and the promise that these data show, from wavelength-specific information such as the ultraviolet and infrared excess of each star, to stellar classification, to expansion of the project beyond our own Galaxy, and mineralogical mapping of the Milky Way's interstellar medium.",
      "pdf_url": "https://arxiv.org/pdf/2601.03978.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04158",
      "title": "Radio Activity from the Rapidly Rotating T dwarf 2MASS 2228-4310",
      "authors": [
        "Kelvin Wandia",
        "Michael A. Garrett",
        "Aaron Golden",
        "Gregg Hallinan",
        "David Williams-Baldwin",
        "Geferson Lucatelli",
        "Robert J. Beswick",
        "Jack F. Radcliffe",
        "Andrew Siemion",
        "Talon Myburgh"
      ],
      "abstract": "Radio Activity from the Rapidly Rotating T dwarf 2MASS 2228-4310 Kelvin Wandia, Michael A. Garrett, Aaron Golden, Gregg Hallinan, David Williams-Baldwin, Geferson Lucatelli, Robert J. Beswick, Jack F. Radcliffe, Andrew Siemion, Talon Myburgh Solar and Stellar Astrophysics (astro-ph.SR) We present the detection of 2MASS J22282889-4310262 (2M2228), a T6/T6.5 brown dwarf, using the Karl G. Jansky Very Large Array (VLA) archival data observed at C band (4-8 GHz) over two observing epochs ($2\\times96$ minutes). 2M2228 is detected at time and frequency averaged Stokes I and V peak flux densities of $67.3\\pm4.9\\ \\mu\\ \\rm{Jy beam}^{-1}$ and $14.4\\pm3.0\\ \\mu\\text{Jy beam}^{-1}$ in the first epoch and $107.2\\pm5.2\\ \\mu\\rm{Jy\\ beam}^{-1}$ and $-20.7\\pm1.2\\ \\mu\\text{Jy beam}^{-1}$ in the second epoch. This discovery constitutes the eighth and, notably, the most rapidly rotating T dwarf detected to date at radio wavelengths. Our observations reveal highly polarised bursts at fractional polarisation ratios $f_\\text{c}>50$%. Using Stokes I light curves, we measure occurrence intervals of $\\sim47$ and $\\sim58$ minutes in the two observing epochs respectively with the first burst aligning within a half period timescale of the the previously measured mid infrared photometric period of $85.8\\pm0.32$ minutes. We attribute the emission to the electron cyclotron maser emission (ECME) and constrain the magnetic field strength to $B\\gtrsim1.4$ kG. We emphasise that the periods inferred are provisional considering the short observing durations. The combination of previously demonstrated atmospheric stability and newly detected radio emission in 2M2228 makes it a promising laboratory for testing magnetospheric currents-driven auroral models and for guiding future coordinated James Webb Space Telescope (JWST) and radio observations to probe the link between auroral activity and atmospheric dynamics in T-type brown dwarfs.",
      "pdf_url": "https://arxiv.org/pdf/2601.04158.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03620",
      "title": "On flying through the base of a pseudo-streamer",
      "authors": [
        "Forrest Mozer",
        "Oleksiy Agapitov",
        "Kyungeun Choi",
        "Andrii Voshchepynets"
      ],
      "abstract": "On flying through the base of a pseudo-streamer Forrest Mozer, Oleksiy Agapitov, Kyungeun Choi, Andrii Voshchepynets Space Physics (physics.space-ph); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Near the 10 solar radius perihelion of Parker Solar Probe orbit 24, a confined region containing an enhanced plasma density of 25,000 particles per cubic centimeter and broadband electrostatic waves was encountered. The solar wind velocity of 200 kilometers per second and ion temperature of 25 eV were significantly reduced as compared to their values in the ambient solar wind. These anomalous plasma conditions were observed on closed magnetic field lines, as determined from observations of the suprathermal electron strahl. Because the polarity of the radial magnetic field did not change sign on the two sides of the crossing and the crossed region contained a double-peaked plasma structure, the spacecraft must have passed through the base of a pseudo-streamer whose structure extended out to 10 solar radii. In the plasma frame, an electric field as large as 400 millivolts per meter was detected during the crossing. The current associated with this electric field was less than one milliampere per square meter, corresponding to a drift velocity less than 2.5 kilometers per second. It also contained a turbulent plasma with density fluctuations divided by density as large as 0.3, suggesting that the resistive term in the generalized ohm's law was significant. Also, the density as a function of time had a non-zero slope when the electric field was non-zero, suggesting that the pressure gradient term also mattered. As compared to earlier remote sensing and theoretical results, it is surprising that the plasma in this pseudo-streamer had a remarkably low flow velocity and that the pseudo-streamer base extended out to 10 solar radii.",
      "pdf_url": "https://arxiv.org/pdf/2601.03620.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04165",
      "title": "Properties of Magnetic Switchbacks in the Near-Sun Solar Wind",
      "authors": [
        "Samuel T. Badman",
        "Naïs Fargette",
        "Lorenzo Matteini",
        "Oleksiy V. Agapitov",
        "Mojtaba Akhavan-Tafti",
        "Stuart D. Bale",
        "Srijan Bharati Das",
        "Nina Bizien",
        "Trevor A. Bowen",
        "Thierry Dudok de Wit",
        "Clara Froment",
        "Timothy Horbury",
        "Jia Huang",
        "Vamsee Krishna Jagarlamudi",
        "Andrea Larosa",
        "Maria S. Madjarska",
        "Olga Panasenco",
        "Etienne Pariat",
        "Nour E. Raouafi",
        "Alexis P. Rouillard",
        "David Ruffolo",
        "Nikos Sioulas",
        "Shirsh Lata Soni",
        "Luca Sorriso-Valvo",
        "Gabriel Ho Hin Suen",
        "Marco Velli",
        "Jaye Verniero"
      ],
      "abstract": "Properties of Magnetic Switchbacks in the Near-Sun Solar Wind Samuel T. Badman, Naïs Fargette, Lorenzo Matteini, Oleksiy V. Agapitov, Mojtaba Akhavan-Tafti, Stuart D. Bale, Srijan Bharati Das, Nina Bizien, Trevor A. Bowen, Thierry Dudok de Wit, Clara Froment, Timothy Horbury, Jia Huang, Vamsee Krishna Jagarlamudi, Andrea Larosa, Maria S. Madjarska, Olga Panasenco, Etienne Pariat, Nour E. Raouafi, Alexis P. Rouillard, David Ruffolo, Nikos Sioulas, Shirsh Lata Soni, Luca Sorriso-Valvo, Gabriel Ho Hin Suen, Marco Velli, Jaye Verniero 44 pages, 20 figures, accepted in Space Science Reviews Space Physics (physics.space-ph); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Magnetic switchbacks are fluctuations in the solar wind in which the interplanetary magnetic field sharply deflects away from its background direction so as to create folds in magnetic field lines while remaining of roughly constant magnitude. The magnetic field and velocity fluctuations are extremely well correlated in a way corresponding to Alfvénic fluctuations propagating away from the Sun. For a background field which is nearly radial this causes an outwardly propagating jet to form. Switchbacks and their characteristic velocity jets have recently been observed to be nearly ubiquitous by Parker Solar Probe with in situ measurements in the inner heliosphere within 0.3 AU. Their prevalence, substantial energy content, and potentially fundamental role in the dynamics of the outer corona and solar wind motivate the significant research efforts into their understanding. Here we review the in situ measurements of these structures (primarily by Parker Solar Probe). We discuss how they are identified and measured, and present an overview of the primary observational properties of these structures, both in terms of individual switchbacks and their collective arrangement into ``patches''. We identify both properties for which there is a strong consensus and those that have limited or qualified support and require further investigation. We identify and collate several open questions and recommendations for future studies.",
      "pdf_url": "https://arxiv.org/pdf/2601.04165.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.16832",
      "title": "The first phase of mass transfer in low-mass binaries: neither stable nor a common envelope",
      "authors": [
        "Gijs Nelemans",
        "Holly Preece",
        "Karel Temmink",
        "James Munday",
        "Onno Pols"
      ],
      "abstract": "The first phase of mass transfer in low-mass binaries: neither stable nor a common envelope Gijs Nelemans, Holly Preece, Karel Temmink, James Munday, Onno Pols Accepted for publication, corrected small error in reference list Solar and Stellar Astrophysics (astro-ph.SR) The masses of the white dwarfs in a binary carry information about previous mass-transfer phases. The core mass -- radius relation of low-mass giants gives the size of the progenitor of a helium white dwarf at the moment it last filled its Roche lobe. Previously, we used this information for a few observed systems to propose a new mass-transfer type, based on an angular momentum balance. Our aim is to investigate if stable mass transfer instead of the angular momentum prescription is consistent with the observed double helium white dwarf masses. We reconstruct the progenitor evolution of observed double helium white dwarfs using the core mass -- radius relation and evaluate if the periods at the start of the second phases of mass transfer are consistent with the outcome of stable mass transfer. More generally, we calculate the mass distribution of double helium white dwarfs for three different progenitors scenarios: double common envelope (with parameter $\\alpha \\lambda$), angular momentum prescription (with parameter $\\gamma$) and stable mass transfer. We find that the observed systems are generally not consistent with stable mass transfer. Stable mass transfer leads to a tight correlation between the two white dwarf masses in a binary that is not consistent with the observed mass distribution. Double common envelope evolution is a particularly poor fit to the observations. The angular momentum prescription can populate the observed mass distribution, but not perfectly. We conclude that the first phase of mass transfer initiated on the red giant branch in low-mass systems does not generally proceed as stable mass transfer nor as common envelope, and thus is poorly understood. This may be related to the fact that for many observed binaries that have finished the first phase of mass transfer the orbit is eccentric, which is an unexpected outcome of mass transfer.",
      "pdf_url": "https://arxiv.org/pdf/2506.16832.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20125",
      "title": "The lower mass limit for circumbinary disc fragmentation",
      "authors": [
        "Matthew Teasdale",
        "Dimitris Stamatellos"
      ],
      "abstract": "The lower mass limit for circumbinary disc fragmentation Matthew Teasdale, Dimitris Stamatellos Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) In recent years, many wide orbit circumbinary giant planets have been discovered; some of these may have formed by gravitational fragmentation of circumbinary discs. The aim of this work is to investigate the lower mass limit for circumbinary disc fragmentation. We use the Smoothed Particle Hydrodynamics code SEREN, which employs an approximate method for the radiative transfer, to perform 3 sets of simulations of gravitationally unstable discs. The first set of simulations covers circumstellar discs heated by a single 0.7M$_{\\odot}$ star (circumstellar model), the second set covers binaries with the same total stellar mass as the circumstellar model, attended by circumbinary discs with the same temperature profile (circumbinary fiducial model), and the third set covers circumbinary discs heated by each individual star (circumbinary realistic model). We vary the binary separation, mass ratio and eccentricity to see their effect on disc fragmentation. For the circumstellar disc model, we find a lower disc-to-star mass ratio for fragmentation of $\\sim\\,$0.31. For the circumbinary fiducial disc model we find the same disc-to-star mass ratio for fragmentation (but slightly lower for more eccentric, equal-mass binaries; 0.26). On the other hand, realistic circumbinary discs fragment at a lower mass limit (disc-to-star mass ratio of 0.17-0.26), depending on the binary properties. We conclude that circumbinary discs fragment at a lower disc mass (by $\\sim 45\\%$) than circumstellar discs. Therefore, gas giant planet around binaries may be able to form by gravitational instability easier than around single stars.",
      "pdf_url": "https://arxiv.org/pdf/2509.20125.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27024",
      "title": "When Magnetic Field Lines Stretch, Snap, and Expand: A New Look at Solar Flares with L-maps",
      "authors": [
        "Maria D. Kazachenko",
        "Yuhong Fan",
        "Andrey N. Afanasyev"
      ],
      "abstract": "When Magnetic Field Lines Stretch, Snap, and Expand: A New Look at Solar Flares with L-maps Maria D. Kazachenko, Yuhong Fan, Andrey N. Afanasyev 11 pages, 5 figures, accepted by Astrophysical Journal on January 6, 2026 Solar and Stellar Astrophysics (astro-ph.SR) Understanding the three-dimensional evolution of coronal magnetic fields during solar flares remains challenging due to the lack of direct coronal field measurements. Here we combine data-driven MHD simulations of NOAA AR 11158 (Fan et al., 2024) with flare-ribbon and coronal-dimming observations to investigate realistic coronal magnetic-field evolution during an X-class flare. We introduce L-maps - maps of natural logarithm of magnetic field-line lengths - as a diagnostic tool to track the dynamics of simulated coronal magnetic structures. Variations in L-maps identify flare ribbons through field-line shortening and coronal dimmings through field-line lengthening. Comparison with SDO/AIA observations demonstrates strong morphological and temporal agreement, validating the simulated field evolution. Applying K-means clustering to the L-map temporal profiles, we distinguish three stages of coronal evolution: (1) slow pre-flare rise phase, (2) flare reconnection accompanied by CME rise, and (3) post-reconnection CME expansion. We detect a slow pre-flare rise phase of magnetic field lines rooted in ribbon footpoints and identify reconnection dimming - area of rapid expansion of active-region core magnetic field lines during flare impulsive phase due to reconnection. Our results show that L-maps provide a powerful and physically intuitive framework for bridging simulations and observations and for tracking the full three-dimensional evolution of coronal magnetic fields during flares.",
      "pdf_url": "https://arxiv.org/pdf/2510.27024.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05427",
      "title": "Upper Limits on Radio Emission from the K2-18 System",
      "authors": [
        "Kelvin Wandia",
        "Chenoa Tremblay",
        "Michael A. Garrett",
        "Alex Andersson",
        "Megan G. Li",
        "Vishal Gajjar",
        "Robert J. Beswick",
        "Jack F. Radcliffe",
        "David R. DeBoer",
        "P.B. Demorest",
        "Daniel Czech",
        "Wael Farah",
        "Ian Heywood",
        "Andrew Siemion"
      ],
      "abstract": "Upper Limits on Radio Emission from the K2-18 System Kelvin Wandia, Chenoa Tremblay, Michael A. Garrett, Alex Andersson, Megan G. Li, Vishal Gajjar, Robert J. Beswick, Jack F. Radcliffe, David R. DeBoer, P.B. Demorest, Daniel Czech, Wael Farah, Ian Heywood, Andrew Siemion Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Stellar and planetary magnetic fields play a crucial role in the habitability of a planet and the integrity of its atmosphere. The recently claimed detection of biosignatures, methane, carbon dioxide and dimethyl sulfide/disulfide, in the atmosphere of K2-18 b, a sub-Neptune orbiting an M dwarf star present an intriguing question regarding the stellar magnetic environment and the resistance of the planet's magnetosphere (if it exists) to erosion by magnetic activity from the host. To probe for radio emission from the system, we have conducted observations using the Karl G. Jansky Very Large Array (VLA) at S, C and X-bands (2-4, 4.5-7.5 and 8-10 GHz respectively) to search for coherent and incoherent radio emission. We detect no radio emission associated with incoherent emission mechanisms. We report $3\\sigma$ Stokes I upper limits of $49.8\\ \\mu\\rm{Jybeam}^{-1}$ at S-band, $17.7\\ \\mu\\rm{Jybeam}^{-1}$at C-band and $18.0\\ \\mu\\rm{Jybeam}^{-1}$ at X-band and an upper limit of the ratio of the radio to the total bolometric luminosity of $\\log L_\\text{R}/\\log L_\\text{bol}<-8.8$. We have also searched for short duration bursts associated with coherent emission mechanisms at C and X-bands . No signals above a $3\\sigma$ significance threshold are detected. Although no signals are detected our radio observations offer constraints, albeit limited, on the stellar magnetic environment supporting recent X-ray observations indicating K2-18 is a very faint emitter. Our results also contextualise any planetary transmission spectra by providing constraints on the activity level of the host.",
      "pdf_url": "https://arxiv.org/pdf/2511.05427.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.02680",
      "title": "Peculiar SN Ic 2022esa: An explosion of a massive Wolf-Rayet star in a binary as a precursor to a BH-BH binary?",
      "authors": [
        "Keiichi Maeda",
        "Hanindyo Kuncarayakti",
        "Takashi Nagao",
        "Miho Kawabata",
        "Kenta Taguchi",
        "Kohki Uno",
        "Kishalay De"
      ],
      "abstract": "Peculiar SN Ic 2022esa: An explosion of a massive Wolf-Rayet star in a binary as a precursor to a BH-BH binary? Keiichi Maeda, Hanindyo Kuncarayakti, Takashi Nagao, Miho Kawabata, Kenta Taguchi, Kohki Uno, Kishalay De 7 pages, 5 figures. Accepted for Publications of the Astronomical Society of Japan (PASJ) Letter Solar and Stellar Astrophysics (astro-ph.SR) A class of supernovae (SNe) termed `SN Ic-CSM' are characterized by late-time emergence of narrow emission lines of elements formed in the oxygen core of a massive star. A popular scenario is the interaction of the SN ejecta and O-rich circumstellar medium (CSM), i.e., Circumstellar Interaction (CSI). Uncovering the progenitor system of SNe Ic-CSM plays a critical role in understanding the final evolution of a massive star to a bare C+O star. In this Letter, we present observations of SN 2022esa which we show is an SN Ic-CSM. Surprisingly, a stable periodicity of ~32 days is found in its light-curve evolution with a hint of a slowly increasing period over ~200 days. We argue that the main power source is likely the interaction of the SN ejecta and O-rich CSM, while the energy input by the post-SN eccentric binary interaction within the SN ejecta is another possibility. In either case, we propose a massive Wolf-Rayet (WR) star as the progenitor, in a WR-WR or WR-BH (black hole) binary that will eventually evolve to a BH-BH binary. Specifically, in the CSI scenario, the progenitor system is an eccentric binary system with an orbital period of about a year, leading to the observed periodicity through the modulation in the CSM density structure. We also show that some other objects, superluminous SN I 2018ibb (a pair-instability SN candidate) and peculiar SN Ic 2022jli (the first example showing stable periodic modulation), show observational similarities to SNe Ic-CSM and may be categorized as SN Ic-CSM variants. Complemented with a large diversity in their light-curve evolution, we propose that SNe Ic-CSM (potentially linked to SNe Ibn/Icn) are a mixture of multiple channels that cover a range of properties in the progenitor star, the binary companion, and the binary orbit.",
      "pdf_url": "https://arxiv.org/pdf/2512.02680.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.06439",
      "title": "Water vapor emission at the warm cavity wall of the HD 100546 disk as revealed by ALMA",
      "authors": [
        "Luna Rampinelli",
        "Stefano Facchini",
        "Margot Leemker",
        "Andrea Isella",
        "Pietro Curone",
        "Myriam Benisty",
        "Elizabeth M. Humphreys",
        "Leonardo Testi"
      ],
      "abstract": "Water vapor emission at the warm cavity wall of the HD 100546 disk as revealed by ALMA Luna Rampinelli, Stefano Facchini, Margot Leemker, Andrea Isella, Pietro Curone, Myriam Benisty, Elizabeth M. Humphreys, Leonardo Testi Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We present spatially resolved ALMA observations of the water line at 183 GHz in the disk around the Herbig star HD 100546. The water vapor emission peaks at the inner edge of the warm dust cavity, located ~15 au from the central star. We attribute this to thermal desorption at the water snowline, shifted outward at the dust cavity wall directly heated by the intense radiation. This represents the first spatially resolved image of the water snowline using ALMA observations of the main water isotopologue in a protoplanetary disk. The water emission morphology peaking inside the first dust ring is consistent with previous ALMA detections of oxygen-bearing complex organic molecules in the disk, including thermally desorbed methanol. These findings signal that warm cavities of transition disks provide ideal targets to directly reconstruct the spatial distribution of water vapor and the snowline location with ALMA, and directly connect water vapor emission to ice desorption of complex organic species.",
      "pdf_url": "https://arxiv.org/pdf/2512.06439.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.02621",
      "title": "Where does the simplified Stellar Contamination Model fail in Exoplanet Transmission Spectroscopy?",
      "authors": [
        "Viktor Y. D. Sumida",
        "Raissa Estrela",
        "Mark Swain",
        "Adriana Valio"
      ],
      "abstract": "Where does the simplified Stellar Contamination Model fail in Exoplanet Transmission Spectroscopy? Viktor Y. D. Sumida, Raissa Estrela, Mark Swain, Adriana Valio Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Stellar photospheric heterogeneities (e.g., starspots, faculae) distort the stellar spectrum in transit and imprint wavelength-dependent biases on the planet-to-star radius ratio (Transit Light Source Effect, TLSE). The Rackham-TLSE (R-TLSE) prescription applies a disc-averaged correction based solely on filling factor and spectral contrast, but transmission spectroscopy also depends on limb darkening, active-region distribution, and transit geometry. We include these in a pixel-resolved framework, ECLIPSE-Xlambda, and run idealised noise-free model-model comparisons to R-TLSE. For LHS 1140 b, K2-18 b, and WASP-69 b, disc-averaged corrections differ from the pixel model by up to about 400 ppm in the optical for active hosts and non-equatorial transits, but stay below about 10 ppm in the near-infrared where limb darkening is weak. We then apply both approaches to the JWST/NIRISS SOSS spectrum of LHS 1140 b. With limb darkening set to zero, ECLIPSE-Xlambda recovers stellar-contamination parameters matching the reference R-TLSE solution, confirming consistency in the disc-averaged limit. With wavelength-dependent limb darkening, reproducing the short-wavelength slope via stellar contamination alone requires hot faculae (delta Tfac about 600 K; ffac about 0.35), equivalent to a circular facular region of radius about 0.6 Rstar (about 60% of the stellar radius) on the disc; such an extended unocculted region is physically unlikely even for an active M dwarf. Purely stellar contamination would therefore require extreme faculae, whereas a genuine atmospheric contribution complementing a more modest facular signal is more plausible. These results delineate the validity regime of R-TLSE and underscore the need for geometry-aware stellar-heterogeneity models including limb darkening in high-precision transmission spectroscopy.",
      "pdf_url": "https://arxiv.org/pdf/2601.02621.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03436",
      "title": "MARVEL: A Multi Agent-based Research Validator and Enabler using Large Language Models",
      "authors": [
        "Nikhil Mukund",
        "Yifang Luo",
        "Fan Zhang",
        "Lisa Barsotti",
        "Erik Katsavounidis"
      ],
      "abstract": "MARVEL: A Multi Agent-based Research Validator and Enabler using Large Language Models Nikhil Mukund, Yifang Luo, Fan Zhang, Lisa Barsotti, Erik Katsavounidis Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI) We present MARVEL (this https URL), a locally deployable, open-source framework for domain-aware question answering and assisted scientific research. It is designed to address the increasing demands of a digital assistant for scientific groups that can read highly technical data, cite precisely, and operate within authenticated networks. MARVEL combines a fast path for straightforward queries with a more deliberate DeepSearch mode that integrates retrieval-augmented generation and Monte Carlo Tree Search. It explores complementary subqueries, allocates more compute to promising branches, and maintains a global evidence ledger that preserves sources during drafting. We applied this framework in the context of gravitational-wave research related to the Laser Interferometer Gravitational-wave Observatory. Answers are grounded in a curated semantic index of research literature, doctoral theses, LIGO documents, and long-running detector electronic logbooks, with targeted web searches when appropriate. Because direct benchmarking against commercial LLMs cannot be performed on private data, we evaluated MARVEL on two publicly available surrogate datasets that capture comparable semantic and technical characteristics. On these benchmarks, MARVEL matches a GPT-4o mini baseline on literature-centric queries and substantially outperforms it on detector-operations content, where domain retrieval and guided reasoning are decisive. By making the complete framework and evaluation datasets openly available, we aim to provide a reproducible foundation for developing domain-specific scientific assistants.",
      "pdf_url": "https://arxiv.org/pdf/2601.03436.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.03818",
      "title": "Modelling spacecraft-emitted electrons measured by SWA-EAS experiment on board Solar Orbiter mission",
      "authors": [
        "Š. Štverák",
        "D. Herčík",
        "P. Hellinger",
        "M. Popďakunik",
        "G. R. Lewis",
        "G. Nicolaou",
        "C. J. Owen",
        "Yu. V. Khotyaintsev",
        "M. Maksimovic"
      ],
      "abstract": "Modelling spacecraft-emitted electrons measured by SWA-EAS experiment on board Solar Orbiter mission Š. Štverák, D. Herčík, P. Hellinger, M. Popďakunik, G. R. Lewis, G. Nicolaou, C. J. Owen, Yu. V. Khotyaintsev, M. Maksimovic Submitted to Astronomy & Astrophysics Instrumentation and Methods for Astrophysics (astro-ph.IM); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) Thermal electron measurements in space plasmas typically suffer at low energies from spacecraft emissions of photo- and secondary electrons and from charging of the spacecraft body. We examine these effects by use of numerical simulations in the context of electron measurements acquired by the Electron Analyser System (SWA-EAS) on board the Solar Orbiter mission. We employed the Spacecraft Plasma Interaction Software to model the interaction of the Solar Orbiter spacecraft with solar wind plasma and we implemented a virtual detector to simulate the measured electron energy spectra as observed in situ by the SWA-EAS experiment. Numerical simulations were set according to the measured plasma conditions at 0.3~AU. We derived the simulated electron energy spectra as detected by the virtual SWA-EAS experiment for different electron populations and compared these with both the initial plasma conditions and the corresponding real SWA-EAS data samples. We found qualitative agreement between the simulated and real data observed in situ by the SWA-EAS detector. Contrary to other space missions, the contamination by cold electrons emitted from the spacecraft is seen well above the spacecraft potential energy threshold. A detailed analysis of the simulated electron energy spectra demonstrates that contamination above the threshold is a result of cold electron fluxes emitted from distant spacecraft surfaces. The relative position of the break in the simulated spectrum with respect to the spacecraft potential slightly deviates from that in the real observations. This may indicate that the real potential of the SWA-EAS detector with respect to ambient plasma differs from the spacecraft potential value measured on board. The overall contamination is shown to be composed of emissions from a number of different sources and their relative contribution varies with the ambient plasma conditions.",
      "pdf_url": "https://arxiv.org/pdf/2601.03818.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03966",
      "title": "Can Dynamic Spectrum Sharing Protect Passive Radio Sciences?",
      "authors": [
        "Gregory Hellbourg"
      ],
      "abstract": "Can Dynamic Spectrum Sharing Protect Passive Radio Sciences? Gregory Hellbourg Instrumentation and Methods for Astrophysics (astro-ph.IM) Dynamic Spectrum Sharing (DSS) is increasingly promoted as a key element of modern spectrum policy, driven by the rising demand from commercial wireless systems and advances in spectrum access technologies. Passive radio sciences, including radio astronomy, Earth remote sensing, and meteorology, operate under fundamentally different constraints. They rely on exceptionally low interference spectrum and are highly vulnerable to even brief radio frequency interference. We examine whether DSS can benefit passive services or whether it introduces new failure modes and enforcement challenges. We propose just-in-time quiet zones (JITQZ) as a mechanism for protecting high value observations and assess hybrid frameworks that preserve static protection for core passive bands while allowing constrained dynamic access in adjacent frequencies. We analyze the roles of propagation uncertainty, electromagnetic compatibility constraints, and limited spectrum awareness. Using a game theoretic framework, we show why non-cooperative sharing fails, identify conditions for sustained cooperation, and examine incentive mechanisms including pseudonymetry-enabled attribution that promote compliance. We conclude that DSS can support passive radio sciences only as a high-reliability, safety-critical system. Static allocations remain essential, and dynamic access is viable only with conservative safeguards and enforceable accountability.",
      "pdf_url": "https://arxiv.org/pdf/2601.03966.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04099",
      "title": "A constrained-transport embedded boundary method for compressible resistive magnetohydrodynamics",
      "authors": [
        "Samuel W. Jones",
        "Colin P. McNally",
        "Meritt Reynolds"
      ],
      "abstract": "A constrained-transport embedded boundary method for compressible resistive magnetohydrodynamics Samuel W. Jones, Colin P. McNally, Meritt Reynolds Journal of Computational Physics, Volume 550, 1 April 2026, 114641 Computational Physics (physics.comp-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Plasma Physics (physics.plasm-ph) Motivated by the increased interest in pulsed-power magneto-inertial fusion devices in recent years, we present a method for implementing an arbitrarily shaped embedded boundary on a Cartesian mesh while solving the equations of compressible resistive magnetohydrodynamics. The method is built around a finite volume formulation of the equations in which a Riemann solver is used to compute fluxes on the faces between grid cells, and a face-centered constrained transport formulation of the induction equation. The small time step problem associated with the cut cells is avoided by always computing fluxes on the faces and edges of the Cartesian mesh. We extend the method to model a moving interface between two materials with different properties using a ghost-fluid approach, and show some preliminary results including shock-wave-driven and magnetically-driven dynamical compressions of magnetohydrostatic equilibria. We present a thorough verification of the method and show that it converges at second order in the absence of discontinuities, and at first order with a discontinuity in material properties.",
      "pdf_url": "https://arxiv.org/pdf/2601.04099.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03408",
      "title": "Estimation of the tidal heating in the TRAPPIST-1 planets. Influence of the internal structure",
      "authors": [
        "Emeline Bolmont",
        "Mariana Sastre",
        "Alexandre Revol",
        "Mathilde Kervazo",
        "Gabriel Tobie"
      ],
      "abstract": "Estimation of the tidal heating in the TRAPPIST-1 planets. Influence of the internal structure Emeline Bolmont, Mariana Sastre, Alexandre Revol, Mathilde Kervazo, Gabriel Tobie 14 pages, 6 figures. Accepted in A&A Earth and Planetary Astrophysics (astro-ph.EP) With the arrival of JWST observations of the TRAPPIST-1 planets, it is timely to reassess the contribution of tidal heating to their heat budget. JWST thermal phase curves could reveal endogenic heating through an anomalously high nightside temperature, providing an opportunity to estimate tidal heating. In this study, we revisit the tidal heating of these planets and propose a simple method to compute the tidal heating profile across a broad range of parameters. Our approach leverages a known formulation for synchronously rotating planets on low-eccentricity orbits and the fact that the profile shape depends solely on internal structure. We calculate the tidal heating contributions for all T-1 planets, with a particular focus on the impact of internal structure and eccentricity uncertainties on their total heat budget. Although the masses and radii of these planets are well constrained, degeneracies remain in their internal structure and composition. For volatile-poor planets of silicate-rock compositions, we investigate the role of core iron content by exploring a range of core sizes. For each structure, we compute the degree-two gravitational Love number, $k_2$, and the corresponding tidal heating profiles. We assume sub-solidus temperatures profiles that are decoupled from interior heat production, which means our estimates are conservative and likely represent minimum values. We find that the tidal heat flux for T-1b and c can exceed Io's heat flux, with uncertainties primarily driven by eccentricity. These high fluxes may be detectable with JWST. For T-1f to g, the tidal flux remains below Earth's geothermal flux, suggesting that tidal heating is unlikely to be the dominant energy source. For planets d and e, however, tidal heating likely dominates their heat budget, potentially driving intense volcanic and tectonic activity, which could enhance their habitability prospects.",
      "pdf_url": "https://arxiv.org/pdf/2601.03408.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03659",
      "title": "Protonic thermoelectric effect of Superionic H2O and magnetic field generation in Uranus and Neptune",
      "authors": [
        "Daohong Liu",
        "Wei Zhang",
        "Yu He",
        "Xinzhuan Guo",
        "Chuanyu Zhang",
        "Yang Sun"
      ],
      "abstract": "Protonic thermoelectric effect of Superionic H2O and magnetic field generation in Uranus and Neptune Daohong Liu, Wei Zhang, Yu He, Xinzhuan Guo, Chuanyu Zhang, Yang Sun Earth and Planetary Astrophysics (astro-ph.EP); Materials Science (cond-mat.mtrl-sci) Uranus and Neptune are characterized by anomalously tilted and multi-dipole magnetic fields, which poses substantial challenges for elucidating the internal mechanisms generating magnetic fields. Recent investigations confirmed that superionic H2O is thermodynamically stable and constitutes the dominant H2O phase within their icy mantles. In this study, we demonstrate that the superionic H2O ice exhibits a pronounced protonic thermoelectric effect, in which the maximum Seebeck coefficient within the interior of Uranus can reach approximately 620 uV/K, whereas that of Neptune is lower, within the range of 570-585 uV/K. Consequently, temperature gradients in the icy mantles can induce proton convection, which in turn drives magnetic field generation. Based on this novel mechanism, the disparities in magnetic field strength between Uranus and Neptune can be accounted for exclusively by their differing internal temperature gradients, and the predicted values are in agreement with observations.",
      "pdf_url": "https://arxiv.org/pdf/2601.03659.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03932",
      "title": "The uncertainty in water mass fraction of wet planets",
      "authors": [
        "Michael Lozovsky"
      ],
      "abstract": "The uncertainty in water mass fraction of wet planets Michael Lozovsky Earth and Planetary Astrophysics (astro-ph.EP) Planets with masses between Earth and Neptune often have radii that imply the presence of volatiles, suggesting that water may be abundant in their interiors. However, directly observing the precise water mass fraction and water distribution remains unfeasible. In our study, we employ an internal structure code MAGRATHEA to model planets with high water content and explore potential interior distributions. Departing from traditional assumptions of a layered structure, we determine water and rock distribution based on water-rock miscibility criteria. We model {wet planets} with an iron core and a homogeneous mixture of rock and water above it. At the outer regions of the planet, the pressure and temperature are below the rock-water miscibility point (the second critical point), causing the segregation of water and rock. Consequently, a shell of water is formed in the outermost layers. By considering the water-rock miscibility and the vapor state of water, our approach highlights the uncertainty in estimating the water mass fraction of detected exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2601.03932.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03963",
      "title": "Formation of multi-planetary systems via pebble accretion in externally photoevaporating discs in stellar clusters",
      "authors": [
        "Lin Qiao",
        "Gavin A. L. Coleman",
        "Thomas J. Haworth"
      ],
      "abstract": "Formation of multi-planetary systems via pebble accretion in externally photoevaporating discs in stellar clusters Lin Qiao, Gavin A. L. Coleman, Thomas J. Haworth Earth and Planetary Astrophysics (astro-ph.EP) In this paper, we investigate how external photo-evaporation influences the formation, dynamical evolution and the resultant planetary architecture of multi-planet systems born in stellar clusters. We use a model of N-body simulations of multiple planet formation via pebble accretion coupled with a 1-D viscous disc subject to external photo-evaporation. We found that external photo-evaporation reduces the planet growth by reducing the pebble mass reservoir in discs containing multiple planetary embryos across a wide range of disc masses, and is particularly effective in suppressing planet growth in less initially massive discs (< 0.1 M$_{\\odot}$). However, in more initially massive ($\\geq$ 0.1 M$_{\\oplus}$) discs planets lost due to planet-planet interactions dominate the outcome for final resultant total planet mass, masking the effects of external photo-evaporation in curbing the planet mass growth. In terms of the final resulting planetary architectures, the signature of external photo-evaporation is visible in less massive (< 0.1 M$_{\\odot}$) discs, with fewer numbers and lower masses of planets surviving in discs irradiated with stronger external FUV radiation. External photo-evaporation also leaves a signature for the wide orbit (> 10 au) terrestrial planets (0.1 - 1 M$_{\\oplus}$), with fewer planets populating this region for stronger FUV field. Finally, the 1st-order resonant pairs fraction decreases with stronger FUV radiation, although the resonant pairs occur rarely regardless of the FUV radiation environment, due to the small number of planets that survive gravitational encounters.",
      "pdf_url": "https://arxiv.org/pdf/2601.03963.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03990",
      "title": "Investigation of the dynamics and origin of the NEA pair 2021 PH27 and 2025 GN1",
      "authors": [
        "Albino Carbognani",
        "Marco Fenucci",
        "Toni Santana-Ros",
        "Clara E. Martínez-Vázquez",
        "Marco Micheli"
      ],
      "abstract": "Investigation of the dynamics and origin of the NEA pair 2021 PH27 and 2025 GN1 Albino Carbognani, Marco Fenucci, Toni Santana-Ros, Clara E. Martínez-Vázquez, Marco Micheli 17 pages, 7 figures, accepted on Icarus Earth and Planetary Astrophysics (astro-ph.EP) We analyse the association between the NEAs 2021 PH27 and 2025 GN1, which share similar heliocentric Keplerian elements and the same taxonomic classification. First, we confirm the spectral similarity by getting independent colours measurements of 2025 GN1 and confirming that they are both X-type. From numerical integration of the orbits up to 100 kyr in the past, taking into account relativistic corrections, we found that the two asteroids experienced five similar flybys with Venus, but none of them were closer than the Roche limit. The perihelion distance also reached values between 0.1 and 0.08 au about 17/21 kyr and 45/48 kyr ago, but still well outside the Roche limit with the Sun. So, the origin of the pair by tidal disruption of a progenitor rubble-pile asteroid appears unlikely. On the other hand, we found periods lasting several thousand years where the perihelion was below 0.1 au, and this can lead to thermal fracturing of the surface. We found that the rotation period of the primary and the mass ratio secondary/primary make the pair indistinguishable from the binary systems known among the NEAs, and the YORP effect can double the rotation period of 2021 PH27 in $150 \\pm 50$ kyr. So it is plausible that the pair was formed by the rotational disintegration of a rubble-pile asteroid due to anisotropic gas emission or the YORP effect, which formed a binary system that later dissolved due to the internal dynamics of the pair. We are unable to give a value for the separation age; we can only say that it occurred more than 10.5 kyr ago and may have occurred between 17/21 kyr ago during the last and longer phase of lower perihelion distance. In this scenario, little meteoroids released in space due to the fragmentation event are still near the pair's orbit and can generate a meteor shower in Venus' atmosphere.",
      "pdf_url": "https://arxiv.org/pdf/2601.03990.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04032",
      "title": "Two-source terrestrial planet formation with a sweeping secular resonance",
      "authors": [
        "Max Goldberg",
        "David Nesvorný",
        "Alessandro Morbidelli"
      ],
      "abstract": "Two-source terrestrial planet formation with a sweeping secular resonance Max Goldberg, David Nesvorný, Alessandro Morbidelli Earth and Planetary Astrophysics (astro-ph.EP) The models that most successfully reproduce the orbital architecture of the Solar System terrestrial planets start from a narrow annulus of material that grows into embryos and then planets. However, it is not clear how this ring model can be made consistent with the chemical structure of the inner Solar System, which shows a reduced-to-oxidized gradient from Mercury to Mars and a parallel gradient in the asteroid belt. We propose that there were two primary reservoirs in the early inner Solar System: a narrow, refractory enriched ring inside of 1 au, and a less massive, extended planetesimal disk outside of 1 au with oxidation states ranging from enstatite chondrites to ordinary chondrites. We show through a suite of N-body simulations that an inwardly sweeping secular resonance, caused by aerodynamic drag and perturbations from a mean-motion resonant Jupiter and Saturn, gathers the outer planetesimal disk into a narrow ring that migrates radially, forms Mars, and contributes oxidized material to proto-Earth. Remaining unaccreted planetesimals can be implanted into the asteroid belt as the parent bodies of aubrites and non-carbonaceous iron meteorites, while the most reduced material is not implanted and thus unsampled in the meteorite collection. This model explains the oxidation and isotopic gradients within the inner Solar System within the context of a low-viscosity, magnetic wind-driven disk.",
      "pdf_url": "https://arxiv.org/pdf/2601.04032.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04140",
      "title": "Secular Excitation of Polar Neptune Orbits in Pure Disk-Planet Systems",
      "authors": [
        "Luke B. Handley",
        "Konstantin Batygin"
      ],
      "abstract": "Secular Excitation of Polar Neptune Orbits in Pure Disk-Planet Systems Luke B. Handley, Konstantin Batygin Earth and Planetary Astrophysics (astro-ph.EP) The stellar spin-orbit angles of Neptune-sized planets present a primordial yet puzzling view of the planetary formation epoch. The striking dichotomy of aligned and perpendicular orbital configurations are suggestive of obliquity excitation through secular resonance -- a process where the precession of a hot Neptune becomes locked onto a forcing frequency, and is slowly guided into a perpendicular state. Previous models of resonant capture have involved the presence of companion perturbers to the star-planet-disk system, but in most cases, such companions are not confirmed to be present. In this work, we present a mechanism for exciting Neptunes to polar orbits in systems without giant perturbers, where photo-evaporation is the self-contained mechanism. Photo-evaporation opens a gap in the protoplanetary disk at ~1 au, and the inner disk continues to viscously accrete onto the host star, precessing quickly due to the perturbation of the outer disk. As the inner disk shrinks, it precesses more slowly, and encounters a resonance with the J2 precession of the Neptune, quickly exciting it to a polar configuration. While likely not applicable to more massive planets which trigger back-reactions onto the disk, this mechanism reproduces the obliquities of small planets in multiple respects.",
      "pdf_url": "https://arxiv.org/pdf/2601.04140.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.16056",
      "title": "Analytical Solutions for Planet-Scattering Small Bodies",
      "authors": [
        "Yukun Huang",
        "Brett Gladman",
        "Eiichiro Kokubo"
      ],
      "abstract": "Analytical Solutions for Planet-Scattering Small Bodies Yukun Huang, Brett Gladman, Eiichiro Kokubo Accepted for publication in AJ, 32 pages, 14 figures Earth and Planetary Astrophysics (astro-ph.EP) Gravitational scattering of small bodies (planetesimals) by a planet remains a fundamental problem in celestial mechanics. It is traditionally modeled within the circular restricted three-body problem (CR3BP), where individual particle trajectories are obtained via numerical integrations. Here, we use {Ö}pik's close-encounter framework to study the random walk of the orbital energy $x$ for an ensemble of test particles on planet-crossing orbits. We show that the evolution of each particle's orbital elements $(a, e, i)$ is fully encapsulated by the 3D rotation of the relative velocity vector $\\bm{U}_\\infty$, whose magnitude remains constant. Consequently, the system can be reduced to two degrees of freedom. By averaging over all possible flyby geometries, we derive explicit expressions for the drift and diffusion coefficients of $x$. We then solve the resulting Fokker--Planck equation to obtain a closed-form solution for the time evolution of the particle distribution. A characteristic scattering timescale naturally emerges, scaling as $(P_{p}/M_{p}^{2})/500$, where $P_{p}$ is the planet's orbital period and $M_{p}$ its mass ratio to the central star. The typical ejection speed of small bodies by a planet is estimated to be $3 v_p M_{p}^{1/3}$, where $v_p$ is the planet's orbital speed. Our analytical solution constitutes a universal law applicable to both the Solar System and exoplanetary systems, providing a computationally efficient alternative to costly $N$-body simulations for studying the orbital distributions and ejection of planetesimals and planets (e.g., Kuiper Belt, Oort Cloud, debris disks, interstellar objects, and free-floating planets).",
      "pdf_url": "https://arxiv.org/pdf/2511.16056.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23542",
      "title": "Not Just Gas: How Solid-Driven Torques Shaped the Migration of the Galilean Moons",
      "authors": [
        "Lucas Gonzalez-Rivas",
        "Leonardo Krapp",
        "Ximena Ramos",
        "Pablo Benitez-Llambay"
      ],
      "abstract": "Not Just Gas: How Solid-Driven Torques Shaped the Migration of the Galilean Moons Lucas Gonzalez-Rivas, Leonardo Krapp, Ximena Ramos, Pablo Benitez-Llambay 5 pages, 2 figures, Accepted for publication in A&A Letter to the editor Earth and Planetary Astrophysics (astro-ph.EP) Surviving rapid inward orbital migration is a crucial aspect of formation models for the Jupiter's Galilean moons. The primary aim of this study is to investigate the orbital migration of the Galilean moons by incorporating self-consistent solid dynamics in circumjovian disk models. We perform two-fluid simulations using the FARGO3D code on a 2D polar grid. The simulations model a satellite with the mass of a proto-moon, Europa, or Ganymede interacting with a circumjovian disk. The dust component, coupled to the gas via a drag force, is characterized by the dust-to-gas mass ratio ($\\epsilon$) and the Stokes number ($T_s$). The effect of solids fundamentally alter the satellites' evolution. We identify a vast parameter space where migration is slowed, halted, robustly reversed -leading to outward migration-, or significantly accelerated inward. The migration rate is dependent on satellite mass, providing a natural source of differential migration. Solid dynamics provides a robust and self-consistent mechanism that fundamentally alters the migration of the Galilean moons, potentially addressing the long-standing migration catastrophe. This mechanism critically affects the survival of satellites and could offer a viable physical process to explain the establishment of resonances through differential migration. These findings establish that solid torques are a critical, non-negligible factor in shaping the final architecture of satellite systems.",
      "pdf_url": "https://arxiv.org/pdf/2512.23542.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.02171",
      "title": "Physical Vetting of the Ultra-Short-Period Sub-Earth TOI 864.01",
      "authors": [
        "Biel Escolà-Rodrigo"
      ],
      "abstract": "Physical Vetting of the Ultra-Short-Period Sub-Earth TOI 864.01 Biel Escolà-Rodrigo 4 pages, 3 figures. Data and code available at DOI: https://doi.org/10.5281/zenodo.17881756 Earth and Planetary Astrophysics (astro-ph.EP) We present a comprehensive analysis of TOI 864.01, a transit-like signal associated with the M-dwarf TIC 231728511. Utilizing the full baseline of TESS photometry (54 sectors), we recover a periodic signal with $P = 0.52067$ d and a shallow depth of $\\sim$158 ppm. To assess the planetary nature of the candidate, we performed a rigorous vetting process combining centroid analysis, Bayesian model comparison, and false-positive probability calculations. While the low signal-to-noise ratio of the sub-Earth candidate yielded inconclusive formal statistical validation metrics (FPP) and Bayesian evidence ($\\Delta \\ln Z$), we demonstrate the planetary nature of the system through physical exclusion of false positive scenarios. The TRICERATOPS Nearby False Positive Probability (NFPP) of 0.0000, combined with centroid stability, rules out background contamination. Furthermore, we calculate that a stellar-mass companion at the derived orbital separation ($a \\approx 5 R_\\star$) would induce ellipsoidal variations of order $\\gtrsim 5000$ ppm. The absence of such variations in the TESS photometry ($< 200$ ppm limit) physically precludes stellar binary scenarios. We derive a planetary radius of $R_p \\approx 0.55 R_\\oplus$, confirming TOI 864.01 as a physically vetted ultra-short-period sub-Earth.",
      "pdf_url": "https://arxiv.org/pdf/2601.02171.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}