{
  "date": "2025-09-30",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.SR",
    "astro-ph.IM",
    "astro-ph.EP",
    "astro-ph.HE"
  ],
  "total_papers": 118,
  "gw_related_papers": 7,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2509.21491",
      "title": "Constraining GREA, an alternative theory accounting for the present cosmic acceleration",
      "authors": [
        "R. Calderon",
        "J. Garcia-Bellido",
        "B. Vos-Gines",
        "V. Gonzalez-Perez",
        "A. Shafieloo",
        "J. Aguilar",
        "S. Ahlen",
        "D. Bianchi",
        "D. Brooks",
        "T. Claybaugh",
        "A. de la Macorra",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "S. Gontcho A Gontcho",
        "G. Gutierrez",
        "K. Honscheid",
        "C. Howlett",
        "M. Ishak",
        "R. Joyce",
        "R. Kehoe",
        "T. Kisner",
        "A. Kremin",
        "O. Lahav",
        "A. Lambert",
        "M. Landriau",
        "M. Manera",
        "R. Miquel",
        "F. Prada",
        "I. Perez-Rafols",
        "E. Sanchez",
        "D. Schlegel",
        "M. Schubnell",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarle",
        "B. A. Weaver",
        "H. Zou"
      ],
      "abstract": "Constraining GREA, an alternative theory accounting for the present cosmic acceleration R. Calderon, J. Garcia-Bellido, B. Vos-Gines, V. Gonzalez-Perez, A. Shafieloo, J. Aguilar, S. Ahlen, D. Bianchi, D. Brooks, T. Claybaugh, A. de la Macorra, J. E. Forero-Romero, E. Gaztañaga, S. Gontcho A Gontcho, G. Gutierrez, K. Honscheid, C. Howlett, M. Ishak, R. Joyce, R. Kehoe, T. Kisner, A. Kremin, O. Lahav, A. Lambert, M. Landriau, M. Manera, R. Miquel, F. Prada, I. Perez-Rafols, E. Sanchez, D. Schlegel, M. Schubnell, J. Silber, D. Sprayberry, G. Tarle, B. A. Weaver, H. Zou Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The origin of the Universe's late-time accelerated expansion remains unknown. The General Relativistic Entropic Acceleration (GREA) theory offers a compelling alternative to $\\Lambda$CDM, attributing cosmic acceleration to entropy growth associated with cosmic and black hole horizons, without invoking a cosmological constant. We test GREA against the latest DESI DR2 Baryon Acoustic Oscillations (BAO), multiple Type Ia supernova compilations (Union3, Pantheon$\\texttt{+}$, DES-SN5YR), and cosmic microwave background (CMB) distance measurements. While GREA is not nested within $\\Lambda$CDM, it achieves a comparable goodness-of-fit, highlighting its potential as a theoretically motivated framework that circumvents some of the fine-tuning issues of the standard $\\Lambda$CDM cosmology. We find that the best-fit model features a transient phantom crossing at $z \\lesssim 2$, with $w_a\\equiv \\mathrm{d} w(a=1)/\\mathrm{d}a \\simeq-0.3$, in good agreement with observations. However, its present-day value $w_0\\equiv w(z=0)$ is tightly constrained to be $w_0\\simeq-1$. Upcoming low-redshift (i.e. $z < 1$) cosmological probes, from both background and perturbations, will offer promising avenues for further exploring the viability of the GREA theory.",
      "pdf_url": "https://arxiv.org/pdf/2509.21491.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22106",
      "title": "Probing the Topology of the Early Universe using CMB Temperature and Polarization Anisotropies",
      "authors": [
        "Miguel-Angel Sanchis-Lozano"
      ],
      "abstract": "Probing the Topology of the Early Universe using CMB Temperature and Polarization Anisotropies Miguel-Angel Sanchis-Lozano Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The temperature and polarization of the cosmic microwave background (CMB), as measured today, may offer key insights into the topology of the early universe prior to inflation, for example, by discriminating between flat and warped geometries. In this paper, we focus on a Kaluza-Klein model with an extra spatial dimension that compactifies at the Grand Unified Theory (GUT) epoch, subject to mixed Neumann/Dirichlet boundary conditions at fixed points. As a consequence, a set of infrared cutoffs naturally emerges in both the scalar and tensor spectra, leading to observable consequences in the CMB. We examine in detail the possible signatures of such a topology, particularly in relation to the even-odd parity imbalance already reported by the COBE, WMAP and Planck missions in the temperature angular correlations at large scales. Furthermore, we extend our analysis to the existing Planck E-mode polarization data, and to the high-precision B-mode polarization measurements expected from the forthcoming LiteBIRD mission.",
      "pdf_url": "https://arxiv.org/pdf/2509.22106.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22306",
      "title": "Coupled non-canonical scalar field to neutrinos could alleviate the Hubble tension and cross the phantom barrier",
      "authors": [
        "Muhammad Yarahmadi",
        "Amin Salehi",
        "Ameneh Tohidi"
      ],
      "abstract": "Coupled non-canonical scalar field to neutrinos could alleviate the Hubble tension and cross the phantom barrier Muhammad Yarahmadi, Amin Salehi, Ameneh Tohidi Communications in Theoretical Physics 2025 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) This study presents an analysis of cosmological parameters, focusing on resolving the Hubble tension and constraining neutrino masses within a coupled quintom model. By utilizing datasets from the Cosmic Microwave Background (CMB), Pantheon + Analysis, Cosmic Chronometers (CC), Baryon Acoustic Oscillations (BAO), and CMB Lensing, we explore the interplay between cosmological parameters and observational constraints. The model effectively reduces the Hubble tension, achieving a consistency in $H_0$ measurements of $1.37\\sigma$ and $1.24\\sigma$ for the CMB + ALL dataset For Planck 2018 and R22 respectively. Additionally, the study refines constraints on the total mass of neutrinos ($\\Sigma_{m_{\\nu}}$), with a finding of $0.115\\,\\text{eV}$ for the CMB + ALL dataset. The analysis examines the effective equation of state parameter ($w_{\\text{eff}}$), indicating a transition towards a universe dominated by exotic energy forms. The combined datasets refine $w_{\\text{eff}}$ to $-1.02\\pm0.018$, underscoring the importance of multi-dataset integration in understanding dark energy dynamics. Furthermore, the interaction constant $\\beta$ between the quintom scalar field and neutrinos is constrained to $0.65 \\pm 0.12$ for the CMB + ALL dataset. The potential parameters $\\lambda_{\\sigma} = -2.09 \\pm 0.082$ and $\\lambda_{\\phi} = 2.43 \\pm 0.12$ are also determined, providing insights into the quintom model's implications for cosmological dynamics. This study offers compelling evidence for the coupled quintom model's capability to resolve the Hubble tension and refine constraints on neutrino properties, enhancing our understanding of the universe's evolution.",
      "pdf_url": "https://arxiv.org/pdf/2509.22306.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22639",
      "title": "Black Hole Polarimetry II: The Connection Between Spin and Polarization",
      "authors": [
        "George N. Wong",
        "Andrew Chael",
        "Alexandru Lupsasca",
        "Eliot Quataert"
      ],
      "abstract": "Black Hole Polarimetry II: The Connection Between Spin and Polarization George N. Wong, Andrew Chael, Alexandru Lupsasca, Eliot Quataert High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We study synchrotron polarization in spatially resolved horizon-scale images, such as those produced by the Event Horizon Telescope (EHT). In both general relativistic magnetohydrodynamic (GRMHD) simulations as well as simplified models of the black hole magnetosphere, the polarization angle, quantified by the complex observable arg(beta_2), depends strongly and systematically on the black hole spin. This relationship arises from the coupling between spin and the structure of the magnetic field in the emission region, and it can be computed analytically in the force-free limit. To explore this connection further, we develop a semi-analytic inflow framework that solves the time stationary axisymmetric equations of GRMHD in the black hole's equatorial plane; this model can interpolate between the force-free and inertial regimes by varying the magnetization of the inflow. Our model demonstrates how finite inertia modifies the structure of the electromagnetic field and can be used to quantitatively predict the observed polarization pattern. By comparing reduced models, GRMHD simulations, and analytic limits, we show that the observed synchrotron polarization can serve as a robust diagnostic of spin under assumptions about Faraday rotation and the emission geometry. Applied to EHT data, the model disfavors high-spin configurations for both M87* and Sgr A*, highlighting the potential of polarimetric imaging as a probe of both black hole spin and near-horizon plasma physics.",
      "pdf_url": "https://arxiv.org/pdf/2509.22639.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2406.03513",
      "title": "Gravitational Waves from Magnetars",
      "authors": [
        "Chris Kouvaris"
      ],
      "abstract": "Gravitational Waves from Magnetars Chris Kouvaris High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) We study the emission of gravitational waves produced by the magnetosphere of magnetars. We argue that several features in the spectrum could facilitate the identification of that source. In addition, in cases of extremely large magnetic fields we demonstrate that this emission can make the braking index of such stars to be well over 3, which is the standard prediction of the magnetic dipole radiation and aligned rotator mechanisms. A similar picture arises if one focuses on the second braking index. Moreover the braking index depends on both the rotational frequency and the strength of the magnetic field in striking difference from the other mechanisms. We also show that gravitational waves can be produced by polar gap regions due to their rapid charge-discharge process that takes place in timescales from nanosec to microsec. This can provide an alternative way to probe magnetars and test the polar gap model.",
      "pdf_url": "https://arxiv.org/pdf/2406.03513.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2411.15072",
      "title": "Outer Solar System spacecraft to probe the $μ$Hz gravitational wave frontier",
      "authors": [
        "Matthew McQuinn",
        "Casey McGrath"
      ],
      "abstract": "Outer Solar System spacecraft to probe the $μ$Hz gravitational wave frontier Matthew McQuinn, Casey McGrath Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The microhertz frequency band of gravitational waves probes the merger of supermassive black holes as well as many other gravitational wave phenomena. However, space-interferometry methods that use test masses would require further development of test-mass isolation systems to detect anticipated astrophysical events. We propose an approach that avoids onboard inertial test masses by situating spacecraft in the low-acceleration environment of the outer Solar System. We show that for Earth-spacecraft and inter-spacecraft distances of $\\gtrsim 10$ AU, the accelerations on the spacecraft would be sufficiently small to potentially achieve gravitational wave sensitivities determined by stochastic gravitational wave backgrounds. We further argue, for arm lengths of $10-30$ AU and $\\sim 10$ Watt transmissions, that stable phase locks could be achieved with 20 cm mirrors or 5 m radio dishes. We discuss designs that send both laser beams and radio waves between the spacecraft, finding that, despite the $\\sim10^4\\times$ longer wavelengths, even a design with radio transmissions could reach stochastic background-limited sensitivities at $\\lesssim 0.3\\times 10^{-4}$ Hz. Operating in the radio significantly reduces many spacecraft design tolerances. Our baseline concepts require two arms to do interferometry. However, if one spacecraft carries a clock with Allan deviations at $10^4$ seconds of $10^{-17}$, a comparable sensitivity could be achieved with a single arm. Finally, we discuss the feasibility of achieving similar gravitational wave sensitivities in a `Doppler tracking' configuration where the single arm is anchored to Earth.",
      "pdf_url": "https://arxiv.org/pdf/2411.15072.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.10284",
      "title": "Resolving Individual Signals in the Presence of Stochastic Background in Future Pulsar Timing Arrays",
      "authors": [
        "Kazuya Furusawa",
        "Sachiko Kuroyanagi",
        "Kiyotomo Ichiki"
      ],
      "abstract": "Resolving Individual Signals in the Presence of Stochastic Background in Future Pulsar Timing Arrays Kazuya Furusawa, Sachiko Kuroyanagi, Kiyotomo Ichiki 13 pages, 9 figures, accepted in MNRAS Mon. Not. R. Astron. Soc. 543 (2025) 1010-1022 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Recent pulsar timing array (PTA) observations have reported evidence of a gravitational wave background (GWB). If supermassive black holes (SMBHs) are indeed the primary source of this signal, future PTA observations, such as those from the Square Kilometer Array (SKA), are expected to simultaneously capture multiple continuous gravitational waves (CGWs) emitted by bright individual SMBH binaries alongside a gravitational wave background (GWB). To address this anticipated scenario in the SKA era, we revisit the F-statistic, a detection method for single source signals in PTA datasets, and introduce a new modeling that accounts for unresolved GWs as a stochastic GWB. Here, we applied this improved F-statistic to the mock datasets that include both CGW and GWB and evaluated how accurately F-statistic can identify the parameters of CGW. As a result, we demonstrate that our approach can successfully improve the estimation of the sky position and the amplitude of CGW, particularly when the GWB is dominant over white noise. This work serves as an initial step toward developing an efficient and robust algorithm based on the F-statistic for future PTA observations.",
      "pdf_url": "https://arxiv.org/pdf/2505.10284.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.16853",
      "title": "Power law $α$-Starobinsky inflation",
      "authors": [
        "Saisandri Saini",
        "Akhilesh Nautiyal"
      ],
      "abstract": "Power law $α$-Starobinsky inflation Saisandri Saini, Akhilesh Nautiyal New references added. Updated with ACT data Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) In this work we consider a generalization of Starobinsky inflation obtained by combining power law ($R^\\beta$), and $\\alpha$-Starobinsky inflation ($E$-model). The Einstein frame potential for this model is that of power law Starobinsky inflation modified by a parameter $\\alpha$ in the exponential. After computing power spectra for scalar and tensor perturbations numerically, we perform MCMC analysis to put constraints on the potential parameter $\\alpha$, $\\beta$ and $M$, and the number of e-foldings $N_{pivot}$ during inflation, using Planck-2018, BICEP/Keck (BK18) and other LSS observations. We find $\\log_{10}\\alpha= 0.37^{+0.82}_{-0.85}$, $\\beta = 1.969^{+0.020}_{-0.023}$, $M=\\left(3.54^{+2.62}_{-1.73}\\right)\\times 10^{-5}$ and $N_{pivot} = 47\\pm{10}$. With these mean values of the potential parameters $\\alpha$ and $\\beta$, and varying $N_{pivot}$ between $40$ to $55$, we also find that the $r-n_s$ predictions of our model lie well within the $1\\sigma$ bounds of joint constraints from combined analysis of ACT, Planck-2018, BICEP and BAO observations. We compute the Bayesian evidences for our proposed model, power law Starobinsky inflation, $\\alpha$-Starobinsky inflation and Starobinsky inflation. Considering the Starobinsky model as the base model, we calculate the Bayes factor and find that our proposed model is preferred by the CMB and LSS observations.",
      "pdf_url": "https://arxiv.org/pdf/2505.16853.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.10505",
      "title": "CWT-LSTM Autoencoder: A Novel Approach for Gravitational Wave Detection in LIGO Data",
      "authors": [
        "Jericho Cain"
      ],
      "abstract": "CWT-LSTM Autoencoder: A Novel Approach for Gravitational Wave Detection in LIGO Data Jericho Cain This paper is the replacement for a previously accepted submission. This paper extends the work of the first, testing the model on real LIGO data rather than synthetic data Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Gravitational wave detection requires sophisticated signal processing to identify weak astrophysical signals buried in instrumental noise. Traditional matched filtering approaches face computational challenges with diverse signal morphologies and non-stationary noise. This work presents a deep learning approach combining Continuous Wavelet Transform (CWT) preprocessing with Long Short-Term Memory (LSTM) autoencoder architecture for gravitational wave detection in synthetic data. The CWT provides optimal time-frequency decomposition capturing chirp evolution and transient characteristics essential for compact binary coalescence identification. The LSTM autoencoder learns compressed representations while maintaining sensitivity to subtle signal features distinguishing true astrophysical events from noise artifacts. We generate realistic synthetic datasets incorporating binary black hole merger signals with masses ranging from 10 to 80 solar masses, embedded in colored Gaussian noise representative of Advanced LIGO sensitivity. The trained model demonstrates strong performance metrics: 92.3 percent precision, 67.6 percent recall, and 80.6 percent AUC-ROC, with an average precision score of 0.780. These results exceed LIGO's stringent detection thresholds for confident gravitational wave identification. Compared to traditional approaches, the CWT-LSTM autoencoder shows superior ability to maintain low false alarm rates while preserving sensitivity to weak signals. The method's end-to-end learning eliminates hand-crafted features and template banks, offering a promising pathway toward more robust gravitational wave detection systems. The unsupervised nature enables discovery of signals with unknown morphologies, providing complementary \"blind search\" capability for detecting exotic astrophysical sources and novel physics beyond current theoretical models.",
      "pdf_url": "https://arxiv.org/pdf/2509.10505.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.21648",
      "title": "BICEP/Keck XX: Component-separated maps of polarized CMB and thermal dust emission using Planck and BICEP/Keck Observations through the 2018 Observing Season",
      "authors": [
        "BICEP/Keck Collaboration: P. A. R. Ade",
        "Z. Ahmed",
        "M. Amiri",
        "D. Barkats",
        "R. Basu Thakur",
        "C. A. Bischoff",
        "D. Beck",
        "J. J. Bock",
        "H. Boenish",
        "V. Buza",
        "B. Cantrall",
        "J. R. Cheshire IV",
        "J. Connors",
        "J. Cornelison",
        "M. Crumrine",
        "A. J. Cukierman",
        "E. Denison",
        "L. Duband",
        "M. Echter",
        "M. Eiben",
        "B. D. Elwood",
        "S. Fatigoni",
        "J. P. Filippini",
        "A. Fortes",
        "M. Gao",
        "C. Giannakopoulos",
        "N. Goeckner-Wald",
        "D. C. Goldfinger",
        "S. Gratton",
        "J. A. Grayson",
        "A. Greathouse",
        "P. K. Grimes",
        "G. Hall",
        "G. Halal",
        "M. Halpern",
        "E. Hand",
        "S. A. Harrison",
        "S. Henderson",
        "T. D. Hoang",
        "J. Hubmayr",
        "H. Hui",
        "K. D. Irwin",
        "J. H. Kang",
        "K. S. Karkare",
        "S. Kefeli",
        "J. M. Kovac",
        "C. Kuo",
        "K. Lasko",
        "K. K. Lau",
        "M. Lautzenhiser",
        "A. Lennox",
        "T. Liu",
        "S. Mackey",
        "N. Maher",
        "K. G. Megerian",
        "L. Minutolo",
        "L. Moncelsi",
        "Y. Nakato",
        "H. T. Nguyen",
        "R. OBrient",
        "S. N. Paine",
        "A. Patel",
        "M. A. Petroff",
        "A. R. Polish",
        "T. Prouve",
        "C. Pryke",
        "C. D. Reintsema",
        "S. Richter",
        "T. Romand",
        "M. Salatino",
        "A. Schillaci",
        "B. Schmitt",
        "R. Schwartz",
        "C. D. Sheehy",
        "B. Singari",
        "A. Soliman",
        "T. St. Germaine",
        "A. Steiger",
        "B. Steinbach",
        "R. Sudiwala",
        "G. Teply",
        "K. L. Thompson",
        "C. Tucker",
        "A. D. Turner",
        "C. Vergès",
        "A. G. Vieregg",
        "A. Wandui",
        "A. C. Weber",
        "J. Willmert",
        "C. L. Wong",
        "W. L. K. Wu",
        "H. Yang",
        "C. Yu",
        "L. Zheng",
        "C. Zhang",
        "S. Zhang"
      ],
      "abstract": "BICEP/Keck XX: Component-separated maps of polarized CMB and thermal dust emission using Planck and BICEP/Keck Observations through the 2018 Observing Season BICEP/Keck Collaboration: P. A. R. Ade, Z. Ahmed, M. Amiri, D. Barkats, R. Basu Thakur, C. A. Bischoff, D. Beck, J. J. Bock, H. Boenish, V. Buza, B. Cantrall, J. R. Cheshire IV, J. Connors, J. Cornelison, M. Crumrine, A. J. Cukierman, E. Denison, L. Duband, M. Echter, M. Eiben, B. D. Elwood, S. Fatigoni, J. P. Filippini, A. Fortes, M. Gao, C. Giannakopoulos, N. Goeckner-Wald, D. C. Goldfinger, S. Gratton, J. A. Grayson, A. Greathouse, P. K. Grimes, G. Hall, G. Halal, M. Halpern, E. Hand, S. A. Harrison, S. Henderson, T. D. Hoang, J. Hubmayr, H. Hui, K. D. Irwin, J. H. Kang, K. S. Karkare, S. Kefeli, J. M. Kovac, C. Kuo, K. Lasko, K. K. Lau, M. Lautzenhiser, A. Lennox, T. Liu, S. Mackey, N. Maher, K. G. Megerian, L. Minutolo, L. Moncelsi, Y. Nakato, H. T. Nguyen, R. OBrient, S. N. Paine, A. Patel, M. A. Petroff, A. R. Polish, T. Prouve, C. Pryke, C. D. Reintsema, S. Richter, T. Romand, M. Salatino, A. Schillaci, B. Schmitt, R. Schwartz, C. D. Sheehy, B. Singari, A. Soliman, T. St. Germaine, A. Steiger, B. Steinbach, R. Sudiwala, G. Teply, K. L. Thompson, C. Tucker, A. D. Turner, C. Vergès, A. G. Vieregg, A. Wandui, A. C. Weber, J. Willmert, C. L. Wong, W. L. K. Wu, H. Yang, C. Yu, L. Zheng, C. Zhang, S. Zhang 16 pages, 20 figures, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present component-separated polarization maps of the cosmic microwave background (CMB) and Galactic thermal dust emission, derived using data from the BICEP/Keck experiments through the 2018 observing season and Planck. By employing a maximum-likelihood method that utilizes observing matrices, we produce unbiased maps of the CMB and dust signals. We outline the computational challenges and demonstrate an efficient implementation of the component map estimator. We show methods to compute and characterize power spectra of these maps, opening up an alternative way to infer the tensor-to-scalar ratio from our data. We compare the results of this map-based separation method with the baseline BICEP/Keck analysis. Our analysis demonstrates consistency between the two methods, finding an 84% correlation between the pipelines.",
      "pdf_url": "https://arxiv.org/pdf/2509.21648.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21686",
      "title": "Adaptive Reconstruction of Cluster Halos (ARCH): Integrating Shear and Flexion for Substructure Detection",
      "authors": [
        "Jacob Shpiece",
        "David M. Goldberg"
      ],
      "abstract": "Adaptive Reconstruction of Cluster Halos (ARCH): Integrating Shear and Flexion for Substructure Detection Jacob Shpiece, David M. Goldberg 9 pages, 6 figures, submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present ARCH (Adaptive Reconstruction of Cluster Halos), a new gravitational lensing pipeline for cluster mass reconstruction that applies a joint shear-flexion analysis to JWST imaging. Previous approaches have explored joint shear+flexion reconstructions through forward modeling and Bayesian inference frameworks; in contrast, ARCH adopts a staged optimization strategy that incrementally filters and selects candidate halos rather than requiring a global likelihood model or strong priors. This design makes reconstruction computationally tractable and flexible, enabling systematic tests of multiple signal combinations within a unified framework. ARCH employs staged candidate generation, local optimization, filtering, forward selection, and global strength refinement, with a combined fit metric weighted by per-signal uncertainties. Applies to Abell 2744 and El Gordo, the pipeline recovers convergence maps and subcluster masses consistent with published weak+strong lensing results. In Abell 2744 the central core mass within 300$h^{-1}$ kpc is $2.1\\times 10^{14} M_\\odot h^{-1}$, while in El Gordo the northwestern and southeastern clumps are recovered at $2.6\\times 10^{14} M_\\odot h^{-1}$ and $2.3\\times 10^{14} M_\\odot h^{-1}$. Jackknife resampling indicates typical 1$\\sigma$ uncertainties of $10^{12}-10^{13} M_\\odot h^{-1}$, with the all signal and shear+$\\mathcal{F}$ reconstructions providing the most stable results. These results demonstrate that flexion, when anchored by shear, enhances sensitivity to cluster substructure while maintaining stable cluster-scale mass recovery.",
      "pdf_url": "https://arxiv.org/pdf/2509.21686.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21850",
      "title": "Weakly model-independent determination of total expansion during inflation",
      "authors": [
        "Dayeong Choi",
        "Subin Jeon",
        "Jinn-Ouk Gong"
      ],
      "abstract": "Weakly model-independent determination of total expansion during inflation Dayeong Choi, Subin Jeon, Jinn-Ouk Gong Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We study systematically the total expansion experienced by a certain perturbation mode during single-field inflation, not resorting to explicit models of inflation or reheating. By assuming that during the reheating stage the equation of state w{rh} can be written as a function of e-folds, the unknown dynamics during reheating parametrized by w{rh} is confined within a time integral so that any dependence on the models of inflation and reheating is isolated from model-independent contributions. Especially, the dependence on the reheating dynamics via w{rh} and the reheating temperature T{rh} is dominating. We give two illustrative examples of w{rh} to discuss its impacts on the total expansion, which can be different as much as 10 even for the same reheating temperature, depending on the shape of w{rh}.",
      "pdf_url": "https://arxiv.org/pdf/2509.21850.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21952",
      "title": "Modified Cosmology or Modified Galaxy Astrophysics is Driving the z>6 JWST Results? CMB Experiments can discover the Origin in Near Future",
      "authors": [
        "Harsh Mehta",
        "Suvodip Mukherjee"
      ],
      "abstract": "Modified Cosmology or Modified Galaxy Astrophysics is Driving the z>6 JWST Results? CMB Experiments can discover the Origin in Near Future Harsh Mehta, Suvodip Mukherjee 19 pages, 6 figures, 2 tables. To be submitted to ApJL Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The massive and bright galaxies observed by the James Webb Space Telescope (JWST) at high redshifts ($z > 6$) have challenged our understanding of the Universe. This may require revisiting the physics of galaxy formation and evolution, or modifying the $\\Lambda$CDM cosmological model to explain these observations, or both. We show that high-resolution CMB experiments such as the Simons Observatory (or CMB-S4) can measure smoking-gun signatures jointly in weak lensing and kinematic Sunyaev-Zeldovich (kSZ) power spectra, which can shed light on both these scenarios. An increase in the matter power spectrum at small scales will enhance the number density of dark matter halos at high redshifts, thereby increasing the galaxy formation rate. This will cause enhanced weak lensing signal from these redshifts and also lead to enhanced patchy-kSZ signal from the epoch of reionization. However, if only galaxy astrophysics is modified, without any modification in the matter power spectrum, then the patchy-kSZ signal gets altered, while the weak lensing signal remains nearly unaltered. We show that we can measure the modified astrophysical and cosmological scenarios at a statistical significance of $6.2\\sigma$ (and $17.4\\sigma$) from Simons Observatory (and CMB-S4), which will enable a conclusive understanding on what physical process is driving the high-redshift observations of JWST.",
      "pdf_url": "https://arxiv.org/pdf/2509.21952.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22018",
      "title": "Exploring the Early Universe with Deep Learning",
      "authors": [
        "Emmanuel de Salis",
        "Massimo De Santis",
        "Davide Piras",
        "Sambit K. Giri",
        "Michele Bianco",
        "Nicolas Cerardi",
        "Philipp Denzel",
        "Merve Selcuk-Simsek",
        "Kelley M. Hess",
        "M. Carmen Toribio",
        "Franz Kirsten",
        "Hatem Ghorbel"
      ],
      "abstract": "Exploring the Early Universe with Deep Learning Emmanuel de Salis, Massimo De Santis, Davide Piras, Sambit K. Giri, Michele Bianco, Nicolas Cerardi, Philipp Denzel, Merve Selcuk-Simsek, Kelley M. Hess, M. Carmen Toribio, Franz Kirsten, Hatem Ghorbel EPIA 2025 preprint version, 12 pages, 3 figures Valente de Oliveira, J., Leite, J., Rodrigues, J., Dias, J., Cardoso, P. (eds) Progress in Artificial Intelligence. EPIA 2025. Lecture Notes in Computer Science(), vol 16121. Springer, Cham Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Hydrogen is the most abundant element in our Universe. The first generation of stars and galaxies produced photons that ionized hydrogen gas, driving a cosmological event known as the Epoch of Reionization (EoR). The upcoming Square Kilometre Array Observatory (SKAO) will map the distribution of neutral hydrogen during this era, aiding in the study of the properties of these first-generation objects. Extracting astrophysical information will be challenging, as SKAO will produce a tremendous amount of data where the hydrogen signal will be contaminated with undesired foreground contamination and instrumental systematics. To address this, we develop the latest deep learning techniques to extract information from the 2D power spectra of the hydrogen signal expected from SKAO. We apply a series of neural network models to these measurements and quantify their ability to predict the history of cosmic hydrogen reionization, which is connected to the increasing number and efficiency of early photon sources. We show that the study of the early Universe benefits from modern deep learning technology. In particular, we demonstrate that dedicated machine learning algorithms can achieve more than a $0.95$ $R^2$ score on average in recovering the reionization history. This enables accurate and precise cosmological and astrophysical inference of structure formation in the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2509.22018.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22180",
      "title": "Detection of HI filament: Pair Stacking vs. Filament Stacking",
      "authors": [
        "Yuxi Meng",
        "Jie Wang",
        "Yingjie Jing",
        "Hongxiang Chen",
        "Zerui Liu"
      ],
      "abstract": "Detection of HI filament: Pair Stacking vs. Filament Stacking Yuxi Meng, Jie Wang, Yingjie Jing, Hongxiang Chen, Zerui Liu 10 pages, 7 figures; Submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) It is anticipated that the faint 21 cm signal emitted by neutral hydrogen within cosmic filaments can be detected. However, because of the signal's weakness, stacking techniques are necessary. We assessed two stacking methods--pair stacking and filament stacking--using the EAGLE and IllustrisTNG simulations. Pair stacking leverages the fact that cosmic filaments serve as the connectors between cosmic web nodes, while filament stacking directly aggregates cosmic filaments identified by galaxy distributions. Our analysis indicates that, although pair stacking is convenient, it faces contamination from massive structures, the signal from filament gets very weak after the contamination is removed. Conversely, HI detection via filament stacking appears more viable. The column density exceeds $10^{17} \\,{\\rm cm}^{-2}$ even when all halos are masked, and it is nearly 10 times higher than what is achieved with pair stacking. The effectiveness of filament stacking could further increase with a high number density galaxy catalog and better spatial resolution in radio observation intensity mapping. With the advent of new optical and radio data, the future detection of HI filaments looks promising.",
      "pdf_url": "https://arxiv.org/pdf/2509.22180.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22273",
      "title": "Stairway to Axions: the cross-correlation of birefringence and galaxies from NPIPE and Quaia",
      "authors": [
        "S. Arcari",
        "N. Bartolo",
        "G. Fabbian",
        "A. Greco",
        "A. Gruppuso",
        "M. Lattanzi",
        "P. Natoli",
        "L. Pagano",
        "G. Zagatti"
      ],
      "abstract": "Stairway to Axions: the cross-correlation of birefringence and galaxies from NPIPE and Quaia S. Arcari, N. Bartolo, G. Fabbian, A. Greco, A. Gruppuso, M. Lattanzi, P. Natoli, L. Pagano, G. Zagatti 15 + 3 pages + references, 13 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We present the first measurement of the cross-correlation between anisotropic birefringence and galaxy number counts, utilizing polarization data from Planck NPIPE and the Quaia quasar catalog. By employing a QML/pseudo-$C_\\ell$ combined estimator, we compute the angular power spectrum up to $\\ell=191$ from birefringence and clustering maps at $N_{\\rm side}=64$. Our analysis indicates that the observed spectrum is well consistent with the null-hypothesis, with a probability to exceed of 37% and an estimated scale-invariant amplitude of $A^{\\mathcal{D}_\\ell}=(2.22\\pm2.09)\\times10^{-4}\\,\\text{deg}$, at the 68% confidence level. Finally, we derive constraints on the axion-parameters within an early dark energy model of birefringence. Our findings reveal an unprecedented upper bound on the axion-photon coupling down to $g_{\\phi\\gamma}=10^{-15}\\,\\text{GeV}^{-1}$ for masses around $10^{-32}\\,\\text{eV}$ and high initial misalignment angles. This result opens a previously unexplored window in parameter space, providing the first constraint in this ultra-light mass regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.22273.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22609",
      "title": "Overview of the ESCAPE Dark Matter Test Science Project for Astronomers",
      "authors": [
        "James Pearson",
        "Hugh Dickinson",
        "Sukanya Sinha",
        "Stephen Serjeant"
      ],
      "abstract": "Overview of the ESCAPE Dark Matter Test Science Project for Astronomers James Pearson, Hugh Dickinson, Sukanya Sinha, Stephen Serjeant 10 pages, 0 figures, 0 tables, for submission to OJAp Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The search for dark matter has been ongoing for decades within both astrophysics and particle physics. Both fields have employed different approaches and conceived a variety of methods for constraining the properties of dark matter, but have done so in relative isolation of one another. From an astronomer's perspective, it can be challenging to interpret the results of dark matter particle physics experiments and how these results apply to astrophysical scales. Over the past few years, the ESCAPE Dark Matter Test Science Project has been developing tools to aid the particle physics community in constraining dark matter properties; however, ESCAPE itself also aims to foster collaborations between research disciplines. This is especially important in the search for dark matter, as while particle physics is concerned with detecting the particles themselves, all of the evidence for its existence lies solely within astrophysics and cosmology. Here, we present a short review of the progress made by the Dark Matter Test Science Project and their applications to existing experiments, with a view towards how this project can foster complementary with astrophysical observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.22609.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2209.00204",
      "title": "The alignment between brightest cluster galaxies and host clusters",
      "authors": [
        "Z. S. Yuan",
        "Z. L. Wen"
      ],
      "abstract": "The alignment between brightest cluster galaxies and host clusters Z. S. Yuan, Z. L. Wen 8 pages, 8 figures, 3 tables, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) The alignment between brightest cluster galaxies (BCGs) and host clusters can reveal the mystery of formation and evolution for galaxy clusters. We measure cluster orientations in optical based on the projected distribution of member galaxies and in X-ray by fitting the morphology of intra-cluster medium (ICM). Cluster orientations determined in the two wavelengths are generally consistent. The orientation alignment between BCGs and host clusters is confirmed and more significant than previous works. We find that BCGs are more aligned with cluster orientations measured in X-ray than those from optical data. Clusters with a brighter BCG generally show a stronger alignment. We argue that the detected redshift evolution of the alignment is probably caused by observational bias rather than intrinsic evolution. The alignment is not related to the ellipticity of BCGs, and the richness, ellipticity and dynamical state of host clusters. The strong alignment between BCGs and morphology of ICMs may be the consequence of the co-evolution between the central massive galaxy and host clusters.",
      "pdf_url": "https://arxiv.org/pdf/2209.00204.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22179",
      "title": "The impact of cosmic filaments on the abundance of satellite galaxies",
      "authors": [
        "Yuxi Meng",
        "Haonan Zheng",
        "Shihong Liao",
        "Lizhi Xie",
        "Lan Wang",
        "Hongxiang Chen",
        "Liang Gao",
        "Quan Guo",
        "Yingjie Jing",
        "Jie Wang",
        "Hang Yang",
        "Guangquan Zeng"
      ],
      "abstract": "The impact of cosmic filaments on the abundance of satellite galaxies Yuxi Meng, Haonan Zheng, Shihong Liao, Lizhi Xie, Lan Wang, Hongxiang Chen, Liang Gao, Quan Guo, Yingjie Jing, Jie Wang, Hang Yang, Guangquan Zeng 16 pages, 7 figures; Submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The impact of cosmic web environments on galaxy properties plays a critical role in understanding galaxy formation. Using the state-of-the-art cosmological simulation IllustrisTNG, we investigate how satellite galaxy abundance differs between filaments and the field, with filaments identified using the DisPerSE algorithm. When filaments are identified using galaxies as tracers, we find that, across all magnitude bins, central galaxies in filaments tend to host more satellite galaxies than their counterparts in the field, in qualitative agreement with observational results from the Sloan Digital Sky Survey. The average ratios between satellite luminosity functions in filaments and the field are $3.49$, $2.61$, and $1.90$ in the central galaxy $r$-band magnitude bins of $M_{r, {\\rm cen}} \\sim -22$, $-21$, and $-20$, respectively. We show that much of this excess can be attributed to the higher host halo masses of galaxies in filaments. After resampling central galaxies in both environments to match the halo mass distributions within each magnitude bin, the satellite abundance enhancement in filaments is reduced by up to $79 \\%$. Additionally, the choice of tracers used to identify filaments introduces a significant bias: when filaments are identified using the dark matter density field, the environmental difference in satellite abundance is reduced by more than $70 \\%$; after further resampling in both magnitude and halo mass, the difference is further suppressed by another $\\sim 60$--$95 \\%$. Our results highlight the importance of halo mass differences and tracer choice biases when interpreting and understanding the impact of environment on satellite galaxy properties.",
      "pdf_url": "https://arxiv.org/pdf/2509.22179.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22322",
      "title": "N+2 Mapmaking for Polarized CMB Experiments",
      "authors": [
        "M. Galloway",
        "H. K. Eriksen",
        "R. M. Sullivan",
        "D. J. Watts",
        "I. K. Wehus",
        "L. Zapelli"
      ],
      "abstract": "N+2 Mapmaking for Polarized CMB Experiments M. Galloway, H. K. Eriksen, R. M. Sullivan, D. J. Watts, I. K. Wehus, L. Zapelli Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We introduce N+2 mapmaking as a novel approach to constructing maps in both intensity and polarization for multi-detector CMB data. The motivation behind this method is two-fold: Firstly, it provides individual temperature detector maps from a multi-detector set, which may be useful for component separation purposes, in particular for line emission reconstruction. Secondly, it simultaneously outputs coadded polarization maps with minimal temperature-to-polarization leakage sensitivity. Algorithmically speaking, the N+2 mapmaker is closely related to the `spurious mapmaking' algorithm pioneered by the WMAP team, but rather than solving for a spurious S map together with the three normal Stokes IQU parameters, we solve for N temperature maps and two Stokes (Q and U) parameters per pixel. The result is a statistically coherent set of physically meaningful per-detector temperature maps, each with slightly different bandpasses as defined by each detector, combined with coadded polarization maps. We test this approach on Planck Low Frequency Instrument (LFI) 30 GHz data, and find that the Planck scanning strategy is too poorly cross-linked to allow for a clean separation between temperature and polarization. However, noting that pairs of detectors within a single horn are strongly anti-correlated, we anticipate that solving for horn maps, as opposed to individual detector maps, may provide an optimal compromise between noise and temperature-to-polarization leakage minimization. When applied to simulated data with a rotating half-wave plate, for which the polarization angle coverage is greatly improved, the algorithm performs as expected.",
      "pdf_url": "https://arxiv.org/pdf/2509.22322.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22344",
      "title": "AGN spectral variability across activity states and searches for axion-like particles",
      "authors": [
        "Denys Malyshev",
        "Lidiia Zadorozhna",
        "Yuriy Bidasyuk",
        "Andrea Santangelo",
        "Oleg Ruchayskiy"
      ],
      "abstract": "AGN spectral variability across activity states and searches for axion-like particles Denys Malyshev, Lidiia Zadorozhna, Yuriy Bidasyuk, Andrea Santangelo, Oleg Ruchayskiy Submitted to PoS Multifrequency Behaviour of High Energy Cosmic Sources - XV (MULTIF2025) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Axion-like particles (ALPs) are compelling candidates for dark matter and potential portals to new physics beyond the Standard Model. Photons traversing magnetized regions can convert into ALPs, producing characteristic, energy-dependent absorption features in astrophysical spectra. The probability of such conversions depends sensitively on both the photon energy and the properties of the intervening magnetic fields. Most existing searches have focused on individual astrophysical sources, but uncertainties in the structure and strength of cosmic magnetic fields have limited their reach. Recently, we have demonstrated that active galactic nuclei (AGNs) observed through galaxy clusters provide especially promising targets for ALP searches. By stacking multiple AGN-cluster sightlines, one can average over poorly known magnetic field configurations in galaxy clusters and recover a distinctive ALP-induced spectral suppression, thereby significantly enhancing sensitivity. In this work, we investigate a possible systematic uncertainty in such analyses: the intrinsic time-variability of AGN spectra. We demonstrate that AGN flux variability is correlated with spectral hardness, and that time-averaging over flaring and quiescent states can potentially mimic the suppression features imprinted by ALP-photon mixing. Our findings imply that the recent constraints remain conservative, and that incorporating detailed spectral variability into stacking analyses can further sharpen the search for axion-like particles.",
      "pdf_url": "https://arxiv.org/pdf/2509.22344.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.20741",
      "title": "Probing inflationary gravitational waves with cross-correlations: improved forecasting and validation with simulations",
      "authors": [
        "Toshiya Namikawa",
        "Irene Abril-Cabezas",
        "Blake D. Sherwin"
      ],
      "abstract": "Probing inflationary gravitational waves with cross-correlations: improved forecasting and validation with simulations Toshiya Namikawa, Irene Abril-Cabezas, Blake D. Sherwin 13 pages, 8 figures, accepted for publication in Physical Review D Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a follow-up study to the method recently proposed by Namikawa and Sherwin (2023) to probe gravitational waves using cross-correlations between two cosmic microwave background (CMB) $B$-modes and a large-scale structure tracer. We first improve on the previous forecast by including the impact of CMB component separation and find that, if the tensor-to-scalar ratio is $r=0$, we can achieve $\\sigma_r\\simeq3.6\\times10^{-3}$ by combining upcoming experiments, i.e., LiteBIRD, CMB-S4 and the Advanced Simons Observatory. With a more futuristic experiment, we can achieve even tighter constraints on $r$ if improved delensing can be realized. Using a simulated analysis pipeline, we also explore possible biases from higher-order terms in the lensing potential, which were previously not examined in detail. We find that these bias terms are negligible compared to a detectable signal from inflationary gravitational waves. Our simulated results confirm that this new method is capable of obtaining powerful constraints on $r$. The method is immune to Gaussian Galactic foregrounds and has a different response to non-Gaussian Galactic foregrounds than the $B$-mode power spectrum, offering an independent cross-check of $r$ constraints from the standard power spectrum analysis.",
      "pdf_url": "https://arxiv.org/pdf/2502.20741.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2503.21369",
      "title": "Constraints on AvERA Cosmologies from Cosmic Chronometers and Type Ia Supernovae",
      "authors": [
        "Adrienn Pataki",
        "Péter Raffai",
        "István Csabai",
        "Gábor Rácz",
        "István Szapudi"
      ],
      "abstract": "Constraints on AvERA Cosmologies from Cosmic Chronometers and Type Ia Supernovae Adrienn Pataki, Péter Raffai, István Csabai, Gábor Rácz, István Szapudi Cosmology and Nongalactic Astrophysics (astro-ph.CO) We constrain AvERA cosmologies in comparison with the flat $\\Lambda$CDM model using cosmic chronometer (CC) data and the Pantheon+ sample of type Ia supernovae (SNe Ia). The analysis includes fits to both CC and SN datasets using the \\texttt{dynesty} dynamic nested sampling algorithm. For model comparison, we use the Bayesian model evidences and Anderson-Darling tests applied to the normalized residuals to assess consistency with a standard normal distribution. Best-fit parameters are derived within the redshift ranges $z \\leq 2$ for CCs and $z \\leq 2.3$ for SNe. For the baseline AvERA cosmology, we obtain best-fit values of the Hubble constant of ${H_0=68.32_{-3.27}^{+3.21}~\\mathrm{km~s^{-1}~Mpc^{-1}}}$ from the CC analysis and ${H_0=71.99_{-1.03}^{+1.05}~\\mathrm{km~s^{-1}~Mpc^{-1}}}$ from the SN analysis, each consistent within $1\\sigma$ with the corresponding AvERA simulation value of $H(z=0)$. While both the CC and SN datasets yield higher Bayesian evidence for the flat $\\Lambda$CDM model, they favor the AvERA cosmologies according to the Anderson-Darling test. We have identified signs of overfitting in each model, which suggests the possibility of overestimating the uncertainties in the Pantheon+ covariance matrix.",
      "pdf_url": "https://arxiv.org/pdf/2503.21369.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.14293",
      "title": "The first direct imaging of the silhouette of a damped Lyman $α$ system along the line-of-sight to a background galaxy",
      "authors": [
        "Fuga Komori",
        "Akio K. Inoue",
        "Ken Mawatari",
        "Yuma Sugahara",
        "Hideki Umehata",
        "Rhythm Shimakawa",
        "Satoshi Yamanaka",
        "Takuya Hashimoto",
        "Jorryt Matthee",
        "Toru Misawa"
      ],
      "abstract": "The first direct imaging of the silhouette of a damped Lyman $α$ system along the line-of-sight to a background galaxy Fuga Komori, Akio K. Inoue, Ken Mawatari, Yuma Sugahara, Hideki Umehata, Rhythm Shimakawa, Satoshi Yamanaka, Takuya Hashimoto, Jorryt Matthee, Toru Misawa Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The H~{\\sc i} gas distribution in damped Lyman $\\alpha$ absorbers (DLAs) has remained elusive due to the point-source nature of background quasar emission. Observing DLAs against spatially extended background galaxies provides a new method for constraining their size and structure. Using the Keck Cosmic Web Imager, we present the first ``silhouette'' image of a DLA at $z=3.34$, identified in the spectrum of a background galaxy at $z=3.61$. Although the silhouette remains unresolved due to limited spatial resolution, this represents a successful proof-of-concept for studying DLA morphology using extended background sources. Possible residual emission in the DLA trough suggests an optical depth contrast exceeding $10^7$ in the internal structure, implying a sharp edge or patchy structure. A Lyman $\\alpha$ emitter (LAE) at $z_{\\rm LAE}=3.3433\\pm0.0005$, consistent with the DLA redshift, is detected at an angular separation of $1.''73\\pm0.''28$ ($12.9\\pm2.1$ kpc). The DLA is surrounded by three galaxies within 140 kpc in projected distance and 500 km s$^{-1}$ in line-of-sight velocity, indicating that it resides in the circumgalactic medium of the LAE or within a galaxy group/protocluster environment. An O~{\\sc i} $\\lambda1302$ absorption at $z_{\\rm OI}=3.3288\\pm0.0004$ is also detected along the line of sight. This absorber may trace metal-enriched outflow from the LAE or a gas-rich galaxy exhibiting the highest star formation activity among the surrounding galaxies. Future large spectroscopic surveys of galaxies will expand such a DLA sample, and three-dimensional spectroscopy for it will shed new light on the role of intergalactic dense gas in galaxy formation and evolution.",
      "pdf_url": "https://arxiv.org/pdf/2505.14293.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.21215",
      "title": "Transfer learning for multifidelity simulation-based inference in cosmology",
      "authors": [
        "Alex A. Saoulis",
        "Davide Piras",
        "Niall Jeffrey",
        "Alessio Spurio Mancini",
        "Ana M. G. Ferreira",
        "Benjamin Joachimi"
      ],
      "abstract": "Transfer learning for multifidelity simulation-based inference in cosmology Alex A. Saoulis, Davide Piras, Niall Jeffrey, Alessio Spurio Mancini, Ana M. G. Ferreira, Benjamin Joachimi 9+5 pages, 8+6 figures, accepted MNRAS Mon Not R Astron Soc (2025) 3231-3245 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG) Simulation-based inference (SBI) enables cosmological parameter estimation when closed-form likelihoods or models are unavailable. However, SBI relies on machine learning for neural compression and density estimation. This requires large training datasets which are prohibitively expensive for high-quality simulations. We overcome this limitation with multifidelity transfer learning, combining less expensive, lower-fidelity simulations with a limited number of high-fidelity simulations. We demonstrate our methodology on dark matter density maps from two separate simulation suites in the hydrodynamical CAMELS Multifield Dataset. Pre-training on dark-matter-only $N$-body simulations reduces the required number of high-fidelity hydrodynamical simulations by a factor between $8$ and $15$, depending on the model complexity, posterior dimensionality, and performance metrics used. By leveraging cheaper simulations, our approach enables performant and accurate inference on high-fidelity models while substantially reducing computational costs.",
      "pdf_url": "https://arxiv.org/pdf/2505.21215.pdf",
      "categories": [
        "astro-ph.CO",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.11207",
      "title": "JWST lens model for A370: A very low dark matter fraction for a brightest cluster galaxy and lensing properties for the Dragon arc",
      "authors": [
        "Jose M. Diego",
        "Fengwu Sun",
        "Jose M. Palencia",
        "Xiaojing Lin",
        "Marceau Limousin",
        "Rachel Gledhill",
        "Anna Niemiec",
        "Wenlei Chen",
        "Rogier A. Windhorst",
        "Mitchell F. Struble",
        "Tom Broadhurst"
      ],
      "abstract": "JWST lens model for A370: A very low dark matter fraction for a brightest cluster galaxy and lensing properties for the Dragon arc Jose M. Diego, Fengwu Sun, Jose M. Palencia, Xiaojing Lin, Marceau Limousin, Rachel Gledhill, Anna Niemiec, Wenlei Chen, Rogier A. Windhorst, Mitchell F. Struble, Tom Broadhurst This version : Accepted for publication in Astronomy and Astrophysics Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present a new lens model for the $z=0.375$ galaxy cluster Abell 370 based on previously spectroscopically confirmed lensed galaxies and new lensed systems identified in JWST data, including recent data from the MAGNIF program. Based on the best models able to reproduce two radial arcs near the BCGs, we compare the stellar mass to the total mass from the lens model and find that the fraction of dark matter in the south BCG is consistent with $\\Lambda$CDM while in the north BCG we find a very small amount of dark matter, more consistent with alternative models to $\\Lambda$CDM. We discuss possible causes for this and conclude that additional data is needed to clarify the situation. We study the lensing properties, magnification, time delay and strength of the critical curve, along the Dragon arc, where previous studies have reported tens of alleged microlensing events from supergiant stars at $z=0.7251$. The new lens model is able to reproduce the distribution of microlensing events with great accuracy. Some of the microlensing events may be reinterpreted as long-period Cepheid in future observations. We consider this possibility and study in more detail the challenges for such detection from intervening microlenses.",
      "pdf_url": "https://arxiv.org/pdf/2506.11207.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.12116",
      "title": "Euclid preparation. Simulating thousands of Euclid spectroscopic skies",
      "authors": [
        "Euclid Collaboration: P. Monaco",
        "G. Parimbelli",
        "M. Y. Elkhashab",
        "J. Salvalaggio",
        "T. Castro",
        "M. D. Lepinzan",
        "E. Sarpa",
        "E. Sefusatti",
        "L. Stanco",
        "L. Tornatore",
        "G. E. Addison",
        "S. Bruton",
        "C. Carbone",
        "F. J. Castander",
        "J. Carretero",
        "S. de la Torre",
        "P. Fosalba",
        "G. Lavaux",
        "S. Lee",
        "K. Markovic",
        "K. S. McCarthy",
        "F. Passalacqua",
        "W. J. Percival",
        "I. Risso",
        "C. Scarlata",
        "P. Tallada-Crespí",
        "M. Viel",
        "Y. Wang",
        "B. Altieri",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "P. Battaglia",
        "F. Bernardeau",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "V. F. Cardone",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H. M. Courtois",
        "A. Da Silva",
        "H. Degaudenzi",
        "G. De Lucia",
        "A. M. Di Giorgio",
        "F. Dubath",
        "F. Ducret",
        "C. A. J. Duncan",
        "X. Dupac",
        "S. Dusini",
        "A. Ealet",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "S. Farrens",
        "S. Ferriol",
        "F. Finelli",
        "N. Fourmanoit",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "L. Guzzo",
        "S. V. H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "B. Kubik",
        "M. Kümmel",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori"
      ],
      "abstract": "Euclid preparation. Simulating thousands of Euclid spectroscopic skies Euclid Collaboration: P. Monaco (1 and 2 and 3 and 4), G. Parimbelli (5 and 6 and 7), M. Y. Elkhashab (2 and 3 and 1 and 8), J. Salvalaggio (2 and 8 and 1 and 3), T. Castro (2 and 3 and 8 and 4), M. D. Lepinzan (1 and 2), E. Sarpa (7 and 4 and 3), E. Sefusatti (2 and 8 and 3), L. Stanco (9), L. Tornatore (2), G. E. Addison (10), S. Bruton (11), C. Carbone (12), F. J. Castander (5 and 13), J. Carretero (14 and 15), S. de la Torre (16), P. Fosalba (13 and 5), G. Lavaux (17), S. Lee (18), K. Markovic (18), K. S. McCarthy (18 and 19), F. Passalacqua (20 and 9), W. J. Percival (21 and 22 and 23), I. Risso (24 and 25), C. Scarlata (26), P. Tallada-Crespí (14 and 15), M. Viel (8 and 2 and 7 and 3 and 4), Y. Wang (27), B. Altieri (28), S. Andreon (24), N. Auricchio (29), C. Baccigalupi (8 and 2 and 3 and 7), M. Baldi (30 and 29 and 31), S. Bardelli (29), P. Battaglia (29), F. Bernardeau (32 and 17), A. Biviano (2 and 8), E. Branchini (33 and 25 and 24), M. Brescia (34 and 35), J. Brinchmann (36 and 37 and 38), S. Camera (39 and 40 and 41), G. Cañas-Herrera (42 and 43 and 44), V. Capobianco (41), V. F. Cardone (45 and 46), S. Casas (47), M. Castellano (45), G. Castignani (29), S. Cavuoti (35 and 48), A. Cimatti (49), C. Colodro-Conde (50), G. Congedo (51), C. J. Conselice (52), L. Conversi (53 and 28), Y. Copin (54), F. Courbin (55 and 56), H. M. Courtois (57), A. Da Silva (58 and 59), H. Degaudenzi (60), G. De Lucia (2), A. M. Di Giorgio (61), F. Dubath (60), F. Ducret (16), C. A. J. Duncan (51 and 52), X. Dupac (28), S. Dusini (9), A. Ealet (54), S. Escoffier (62), M. Farina (61), R. Farinelli (29), S. Farrens (63), S. Ferriol (54), F. Finelli (29 and 64), N. Fourmanoit (62), M. Frailis (2), E. Franceschi (29), M. Fumana (12), S. Galeotta (2), K. George (65), B. Gillis (51), C. Giocoli (29 and 31), J. Gracia-Carpio (66), A. Grazian (67), F. Grupp (66 and 68), L. Guzzo (69 and 24 and 70), S. V. H. Haugan (71), W. Holmes (18), F. Hormuth (72), A. Hornstrup (73 and 74), K. Jahnke (75), M. Jhabvala (76), B. Joachimi (77), E. Keihänen (78), S. Kermiche (62), B. Kubik (54), M. Kümmel (68), M. Kunz (79), H. Kurki-Suonio (80 and 81), A. M. C. Le Brun (82), S. Ligori Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present two extensive sets of 3500+1000 simulations of dark matter haloes on the past light cone, and two corresponding sets of simulated (`mock') galaxy catalogues that represent the Euclid spectroscopic sample. The simulations were produced with the latest version of the PINOCCHIO code, and provide the largest, public set of simulated skies. Mock galaxy catalogues were obtained by populating haloes with galaxies using an halo occupation distribution (HOD) model extracted from the Flagship galaxy catalogue provided by Euclid Collaboration. The Geppetto set of 3500 simulated skies was obtained by tiling a 1.2 Gpc/h box to cover a light-cone whose sky footprint is a circle of 30 deg radius, for an area of 2763 deg$^2$ and a minimum halo mass of $1.5\\times10^{11}$ Msun/h. The relatively small box size makes this set unfit for measuring very large scales. The EuclidLargeBox set consists of 1000 simulations of 3.38 Gpc/h, with the same mass resolution and a footprint that covers half of the sky, excluding the Milky Way zone of avoidance. From this we produced a set of 1000 EuclidLargeMocks on the 30 deg radius footprint, whose comoving volume is fully contained in the simulation box. We validated the two sets of catalogues by analysing number densities, power spectra, and 2-point correlation functions, showing that the Flagship spectroscopic catalogue is consistent with being one of the realisations of the simulated sets, although we noticed small deviations limited to the quadrupole at k>0.2 h/Mpc. We show cosmological parameter inference from these catalogues and demonstrate that using one realisation of EuclidLargeMocks in place of the Flagship mock produces the same posteriors, to within the expected shift given by sample variance. These simulated skies will be used for the galaxy clustering analysis of Euclid's Data Release 1 (DR1).",
      "pdf_url": "https://arxiv.org/pdf/2507.12116.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07943",
      "title": "Dark Energy Survey Year 6 Results: improved mitigation of spatially varying observational systematics with masking",
      "authors": [
        "M. Rodríguez-Monroy",
        "N. Weaverdyck",
        "J. Elvin-Poole",
        "I. Sevilla-Noarbe",
        "A. Carnero Rosell",
        "A. Drlica-Wagner",
        "D. Anbajagane",
        "S. Avila",
        "M. R. Becker",
        "K. Bechtol",
        "M. Crocce",
        "A. Ferté",
        "M. Gatti",
        "J. Mena-Fernández",
        "A. Porredon",
        "D. Sanchez Cid",
        "M. Yamamoto",
        "M. Aguena",
        "S. S. Allam",
        "O. Alves",
        "F. Andrade-Oliveira",
        "D. Bacon",
        "J. Blazek",
        "S. Bocquet",
        "D. Brooks",
        "R. Camilleri",
        "J. Carretero",
        "R. Cawthon",
        "C. Chang",
        "L. N. da Costa",
        "M. E. da Silva Pereira",
        "S. Desai",
        "H. T. Diehl",
        "P. Doel",
        "C. Doux",
        "S. Everett",
        "B. Flaugher",
        "P. Fosalba",
        "J. Frieman",
        "J. García-Bellido",
        "R. A. Gruendl",
        "K. Herner",
        "S. R. Hinton",
        "D. L. Hollowood",
        "K. Honscheid",
        "D. Huterer",
        "D. J. James",
        "K. Kuehn",
        "O. Lahav",
        "S. Lee",
        "J. L. Marshall",
        "R. Miquel",
        "J. Muir",
        "J. Myles",
        "R. L. C. Ogando",
        "A. A. Plazas Malagón",
        "J. Prat",
        "E. Sanchez",
        "T. Schutt",
        "M. Smith",
        "E. Suchyta",
        "M. E. C. Swanson",
        "C. To",
        "M. A. Troxel",
        "D. L. Tucker",
        "V. Vikram"
      ],
      "abstract": "Dark Energy Survey Year 6 Results: improved mitigation of spatially varying observational systematics with masking M. Rodríguez-Monroy, N. Weaverdyck, J. Elvin-Poole, I. Sevilla-Noarbe, A. Carnero Rosell, A. Drlica-Wagner, D. Anbajagane, S. Avila, M. R. Becker, K. Bechtol, M. Crocce, A. Ferté, M. Gatti, J. Mena-Fernández, A. Porredon, D. Sanchez Cid, M. Yamamoto, M. Aguena, S. S. Allam, O. Alves, F. Andrade-Oliveira, D. Bacon, J. Blazek, S. Bocquet, D. Brooks, R. Camilleri, J. Carretero, R. Cawthon, C. Chang, L. N. da Costa, M. E. da Silva Pereira, S. Desai, H. T. Diehl, P. Doel, C. Doux, S. Everett, B. Flaugher, P. Fosalba, J. Frieman, J. García-Bellido, R. A. Gruendl, K. Herner, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. Huterer, D. J. James, K. Kuehn, O. Lahav, S. Lee, J. L. Marshall, R. Miquel, J. Muir, J. Myles, R. L. C. Ogando, A. A. Plazas Malagón, J. Prat, E. Sanchez, T. Schutt, M. Smith, E. Suchyta, M. E. C. Swanson, C. To, M. A. Troxel, D. L. Tucker, V. Vikram Cosmology and Nongalactic Astrophysics (astro-ph.CO) As photometric surveys reach unprecedented statistical precision, systematic uncertainties increasingly dominate large-scale structure probes relying on galaxy number density. Defining the final survey footprint is critical, as it excludes regions affected by artefacts or suboptimal observing conditions. For galaxy clustering, spatially varying observational systematics, such as seeing, are a leading source of bias. Template maps of contaminants are used to derive spatially dependent corrections, but extreme values may fall outside the applicability range of mitigation methods, compromising correction reliability. The complexity and accuracy of systematics modelling depend on footprint conservativeness, with aggressive masking enabling simpler, robust mitigation. We present a unified approach to define the DES Year 6 joint footprint, integrating observational systematics templates and artefact indicators that degrade mitigation performance. This removes extreme values from an initial seed footprint, leading to the final joint footprint. By evaluating the DES Year 6 lens sample MagLim++ plus plus on this footprint, we enhance the Iterative Systematics Decontamination (ISD) method, detecting non-linear systematic contamination and improving correction accuracy. While the mask's impact on clustering is less significant than systematics decontamination, it remains non-negligible, comparable to statistical uncertainties in certain w(theta) scales and redshift bins. Supporting coherent analyses of galaxy clustering and cosmic shear, the final footprint spans 4031.04 deg2, setting the basis for DES Year 6 1x2pt, 2x2pt, and 3x2pt analyses. This work highlights how targeted masking strategies optimise the balance between statistical power and systematic control in Stage-III and -IV surveys.",
      "pdf_url": "https://arxiv.org/pdf/2509.07943.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2409.04625",
      "title": "First direct carbon abundance measured at $z>10$ in the lensed galaxy MACS0647$-$JD",
      "authors": [
        "Tiger Yu-Yang Hsiao",
        "Michael W. Topping",
        "Dan Coe",
        "John Chisholm",
        "Danielle A. Berg",
        "Abdurro'uf",
        "Javier Álvarez-Márquez",
        "Roberto Maiolino",
        "Pratika Dayal",
        "Lukas J. Furtak"
      ],
      "abstract": "First direct carbon abundance measured at $z>10$ in the lensed galaxy MACS0647$-$JD Tiger Yu-Yang Hsiao, Michael W. Topping, Dan Coe, John Chisholm, Danielle A. Berg, Abdurro'uf, Javier Álvarez-Márquez, Roberto Maiolino, Pratika Dayal, Lukas J. Furtak 9 pages, 2 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Investigating the metal enrichment in the early universe helps us constrain theories about the first stars and study the ages of galaxies. The lensed galaxy MACS0647$-$JD at $z=10.17$ is the brightest galaxy known at $z > 10$. Previous work analyzing JWST NIRSpec and MIRI data yielded a direct metallicity $\\rm{12+log(O/H)}=7.79\\pm0.09$ ($\\sim$ 0.13 $Z_\\odot$) and electron density $\\rm{log}(n_e / \\rm{cm^{-3}}) = 2.9 \\pm 0.5$, the most distant such measurements to date. Here we estimate the direct C/O abundance for the first time at $z > 10$, finding a sub-solar ${\\rm log(C/O)}=-0.44^{+0.06}_{-0.07}$. This is higher than other $z>6$ galaxies with direct C/O measurements, likely due to higher metallicity. It is also slightly higher than galaxies in the local universe with similar metallicity. This may suggest a very efficient and rapid burst of star formation, a low effective oxygen abundance yield, or the presence of unusual stellar populations including supermassive stars. Alternatively, the strong CIII]${\\rm {\\lambda}{\\lambda}}$1907,1909 emission ($14\\pm 3\\,{Å}$ rest-frame EW) may originate from just one of the two component star clusters JDB ($r \\sim 20$ pc). Future NIRSpec IFU spectroscopic observations of MACS0647$-$JD will be promising for disentangling C/O in the two components to constrain the chemistry of individual star clusters just 460 Myr after the Big Bang.",
      "pdf_url": "https://arxiv.org/pdf/2409.04625.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.03838",
      "title": "High-energy gamma-ray emission from memory-burdened primordial black holes",
      "authors": [
        "Marco Chianese"
      ],
      "abstract": "High-energy gamma-ray emission from memory-burdened primordial black holes Marco Chianese 10 pages, 4 figures. v2: version published in PRD Phys. Rev. D 112, 023043 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Theoretical studies on the memory-burden effect suggest that Primordial Black Holes (PBHs) with masses smaller than $10^{15}$ grams may be viable dark matter candidates and, consequently, be potential sources of high-energy particles in the present Universe. In this paper, we investigate the evaporation of memory-burdened PBHs into high-energy gamma-rays. Differently from previous analyses, we account for the attenuation of gamma-rays caused by their interaction with background radiation at energies above $10^5~{\\rm GeV}$, as well as the secondary emission from the electromagnetic cascades generated during their propagation through extragalactic space. Performing a likelihood analysis with current gamma-ray data, we place new constraints on the parameter space of memory-burdened PBHs. Our results show that ultra-high-energy diffuse gamma-ray observations set more restrictive bounds than high-energy neutrino data, particularly in scenarios with a strong memory-burden suppression of the PBH evaporation.",
      "pdf_url": "https://arxiv.org/pdf/2504.03838.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.21610",
      "title": "GalSBI-SPS: a stellar population synthesis-based galaxy population model for cosmology and galaxy evolution applications",
      "authors": [
        "Luca Tortorelli",
        "Silvan Fischbacher",
        "Daniel Grün",
        "Alexandre Refregier",
        "Sabine Bellstedt",
        "Aaron S. G. Robotham",
        "Tomasz Kacprzak"
      ],
      "abstract": "GalSBI-SPS: a stellar population synthesis-based galaxy population model for cosmology and galaxy evolution applications Luca Tortorelli, Silvan Fischbacher, Daniel Grün, Alexandre Refregier, Sabine Bellstedt, Aaron S. G. Robotham, Tomasz Kacprzak Accepted for publication in Astronomy & Astrophysics, 37 pages, 20 figures Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Next generation photometric and spectroscopic surveys will enable unprecedented tests of the concordance cosmological model and of galaxy formation and evolution. Fully exploiting their potential requires a precise understanding of the selection effects on galaxies and biases on measurements of their properties, required, above all, for accurate estimates of redshift distributions n(z). Forward-modelling offers a powerful framework to simultaneously recover galaxy $n(z)$s and characterise the observed galaxy population. We present GalSBI-SPS, a new SPS-based galaxy population model that generates realistic galaxy catalogues, which we use to forward-model HSC data in the COSMOS field. GalSBI-SPS samples galaxy physical properties, computes magnitudes with ProSpect, and simulates HSC images in the COSMOS field with UFig. We measure photometric properties consistently in real data and simulations. We compare $n(z)$s, photometric and physical properties to observations and to GalSBI. GalSBI-SPS reproduces the observed grizy magnitude, colour, and size distributions down to i<23. Median differences in magnitudes and colours remain below 0.14 mag, with the model covering the full colour space spanned by HSC. Galaxy sizes are overestimated by 0.2 arcsec on average and some tension exists in the g-r colour, but the latter is comparable to that seen in GalSBI. $n(z)$s show a mild positive offset (0.01-0.08) in the mean. GalSBI-SPS qualitatively reproduces the stellar mass-SFR and size-stellar mass relations seen in COSMOS2020. GalSBI-SPS provides a realistic, survey-independent galaxy population description at a Stage-III depth using only literature-based parameters. Its predictive power will improve significantly when constrained against observed data using SBI, thereby providing accurate $n(z)$s satisfying the stringent requirements set by Stage IV surveys.",
      "pdf_url": "https://arxiv.org/pdf/2505.21610.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20452",
      "title": "A GLIMPSE of Intermediate Mass Black holes in the epoch of reionization: Witnessing the Descendants of Direct Collapse?",
      "authors": [
        "Qinyue Fei",
        "Seiji Fujimoto",
        "Rohan P. Naidu",
        "John Chisholm",
        "Hakim Atek",
        "Gabriel Brammer",
        "Yoshihisa Asada",
        "Volker Bromm",
        "Lukas J. Furtak",
        "Jenny E. Greene",
        "Tiger Yu-Yang Hsiao",
        "Junehyoung Jeon",
        "Vasily Kokorev",
        "Jorryt Matthee",
        "Priyamvada Natarajan",
        "Johan Richard",
        "Alberto Saldana-Lopez",
        "Daniel Schaerer",
        "Marta Volonteri",
        "Adi Zitrin"
      ],
      "abstract": "A GLIMPSE of Intermediate Mass Black holes in the epoch of reionization: Witnessing the Descendants of Direct Collapse? Qinyue Fei, Seiji Fujimoto, Rohan P. Naidu, John Chisholm, Hakim Atek, Gabriel Brammer, Yoshihisa Asada, Volker Bromm, Lukas J. Furtak, Jenny E. Greene, Tiger Yu-Yang Hsiao, Junehyoung Jeon, Vasily Kokorev, Jorryt Matthee, Priyamvada Natarajan, Johan Richard, Alberto Saldana-Lopez, Daniel Schaerer, Marta Volonteri, Adi Zitrin Submitted to ApJ. 21 Pages and 7 figures for the main text. 11 figures in the appendix. Comments are welcome! Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) JWST has revealed an abundance of supermassive black holes (BHs) in the early Universe, and yet the lowest mass seed black holes that gave rise to these populations remain elusive. Here we present a systematic search for broad-line Active Galactic Nuclei (AGNs) in some of the faintest high-$z$ galaxies surveyed yet by combining ultra-deep JWST/NIRSpec G395M spectroscopy with the strong lensing aid in Abell S1063. By employing the profile of the [OIII]$\\lambda 5007$ emission lines as a template for narrow-line components and carefully cross-validating with mock observations, we identify a sample of ten broad-line AGNs at $4.5<z<7.0$ (eight secure, two tentative). The inferred BH masses from the broad H$\\alpha$ line explore the intermediate BH mass regime down to $\\sim 10^{5.5}\\,M_\\odot$. The stellar mass ($M_*$) is estimated with a galaxy+AGN composite model, and we find the BH to stellar mass ratio spans down to $M_{\\rm BH}/M_*\\lesssim 0.1\\%$, unveiling populations on the empirical $M_{\\rm BH}-M*$ relation observed in the local universe. We also derive the black hole mass function and investigate its low-mass end at this epoch. While we confirm the agreement of our results with previous studies at $M_{\\rm BH}\\gtrsim10^{6.5}M_{\\odot}$, we find the mass range of $\\sim 10^{5.5}\\,M_\\odot$ features an enhanced abundance with respect to the extrapolated best-fit Schechter function. Comparison with theoretical models suggests that a possible origin for this enhanced abundance is the direct-collapse BH formation, supporting the scenario that the direct collapse of massive gas clouds is a significant pathway for the earliest supermassive BHs.",
      "pdf_url": "https://arxiv.org/pdf/2509.20452.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21461",
      "title": "Stochastic analysis of ultra-high energy cosmic ray interactions",
      "authors": [
        "Leonel Morejon",
        "Karl-Heinz Kampert"
      ],
      "abstract": "Stochastic analysis of ultra-high energy cosmic ray interactions Leonel Morejon, Karl-Heinz Kampert High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th) Photonuclear interactions between ultra-high-energy cosmic ray (UHECR) nuclei and surrounding photon fields are key to understanding the connection between the compositions observed at Earth and those emitted from the sources. These interactions can completely disintegrate a nucleus of iron over trajectory lengths of a few and up to hundreds of megaparsecs, depending on the energy of the UHECR. The stochastic nature of these interactions means that it is not possible to describe them deterministically for a single cosmic ray, and an exact formulation of the probability distributions is not yet available. Current approaches describe these interactions using either Monte Carlo simulations or solving ordinary differential equations that neglect stochasticity. Because of the limitations of these approaches, only partial capture of the process is achieved. This paper presents an analytic probabilistic description of UHECR interactions and the resulting nuclear cascades, establishing their connection to Markov jump processes. The fundamental properties of these cascades are presented, as is the computation of the usual quantities of interest, such as the horizon, spectrum, and composition. The benefits of this description are outlined using astrophysical examples related to extragalactic propagation and UHECR sources.",
      "pdf_url": "https://arxiv.org/pdf/2509.21461.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-ex",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21532",
      "title": "Unveiling Obscured Accretion in the Local Universe",
      "authors": [
        "Indrani Pal",
        "Stefano Marchesi",
        "Ross Silver",
        "Marco Ajello",
        "Vittoria Gianolli",
        "Núria Torres-Albà",
        "Isaiah Cox",
        "Xiurui Zhao",
        "Dhrubojyoti Sengupta",
        "Anuvab Banerjee",
        "Kouser Imam",
        "Andrealuna Pizzetti"
      ],
      "abstract": "Unveiling Obscured Accretion in the Local Universe Indrani Pal, Stefano Marchesi, Ross Silver, Marco Ajello, Vittoria Gianolli, Núria Torres-Albà, Isaiah Cox, Xiurui Zhao, Dhrubojyoti Sengupta, Anuvab Banerjee, Kouser Imam, Andrealuna Pizzetti 16 pages, 13 Figures, submitted to the journal High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Heavily obscured Active Galactic Nuclei (AGN), especially Compton-thick sources with line-of-sight column density ($N_{\\rm H,los}$) $>$ 10$^{24}$ cm$^{-2}$, are critical to understanding supermassive black hole (SMBH) growth and the origin of the Cosmic X-ray Background (CXB). However, their observed fraction remains significantly below model predictions, due to strong absorption bias, even in the hard X-ray (i.e., above 10 keV) band. We analyze a sample of 26 nearby ($z < 0.1$) AGN from the Swift-BAT 150-month catalog, selected via mid-IR to X-ray diagnostics and observed with NuSTAR and soft X-ray telescopes (Xmm-Newton, Chandra, or Swift-xrt). Using self-consistent torus models (MyTorus, Borus02, and UXCLUMPY), we aim to constrain $N_{\\rm H,los}$, the average torus column density, and other geometrical parameters of the obscuring medium. A comparative analysis among the three torus models showed that while estimates of $N_{\\rm{H,los}}$ were generally in agreement, Borus02 tended to classify a slightly larger number of sources as Compton-thick AGN (CT-AGN). Building on this comparison, we benchmark two prediction schemes -- a mid-IR/X-ray relation and a machine-learning model -- against our broadband best-fit $N_{\\rm H,los}$ measurements to assess which approach more effectively bridges the gap between predicted and measured obscuration, finding that while the former works effectively in the heavily obscured region (log$\\rm{N_H} \\gtrsim$ 23.5 $\\rm{cm^{-2}}$), the latter provides improved accuracy, particularly for Compton-thin to moderately thick regimes (log$\\rm{N_H} \\lesssim$ 23.5 $\\rm{cm^{-2}}$).",
      "pdf_url": "https://arxiv.org/pdf/2509.21532.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21692",
      "title": "A Disk-Originated 329-day Quasi-Periodic Oscillation in the Seyfert 1 Galaxy J1626+5120",
      "authors": [
        "Litao Zhu, Zhongxiang Wang, Dong Zheng , Alok C. Gupta , Ju-Jia Zhang Yunnan University, China, ARIES, India, Yunnan Observatories, China)"
      ],
      "abstract": "A Disk-Originated 329-day Quasi-Periodic Oscillation in the Seyfert 1 Galaxy J1626+5120 Litao Zhu, Zhongxiang Wang, Dong Zheng (1), Alok C. Gupta (2), Ju-Jia Zhang (3) ((1) Yunnan University, China, (2) ARIES, India, (3) Yunnan Observatories, China) 10 pages, 1 table, 9 figures, accepted for publication in ApJL High Energy Astrophysical Phenomena (astro-ph.HE) The Seyfert 1 galaxy J1626+5120 is estimated to host a $10^8 M_{\\odot}$ black hole (BH) accreting at Eddington ratio $\\dot{m}_{\\text{Edd}} \\approx 0.043$. Its long-term multi-band light curve data show flicker-like variations, but in a well-sampled $g$-band light curve, we are able to determine a $\\simeq 329$\\,d quasi-periodic oscillation (QPO) at a $\\sim$4.53$\\sigma$ significance. Six optical spectra were obtained for the source, three of which were taken by us. The spectra show that the variations were mainly because of flux changes blueward of 4000\\,Å. We also analyze X-ray and ultraviolet (UV) data obtained with {\\it the Neil Gehrels Swift Observatory (Swift)}, which targeted the source in the past two years. X-ray and UV emissions of the source show variations correlated with optical. Time lags of four UV bands and four optical bands are determined with respect to the X-ray emission, which are consistent with a continuum reprocessing disk model. These properties point out a disk origin for the QPO, likely due to Lense-Thirring (LT) precession of the accretion flow at $\\sim$20 gravitational radii of the BH. This QPO could be a key case linking sub-year long QPOs in jets, which have more cases reported, to LT precession.",
      "pdf_url": "https://arxiv.org/pdf/2509.21692.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21958",
      "title": "Fermi detection of $γ$-rays from the radio-quiet Seyfert galaxy NGC 3281",
      "authors": [
        "Jun-Rong Liu",
        "Hua Feng",
        "Jian-Min Wang"
      ],
      "abstract": "Fermi detection of $γ$-rays from the radio-quiet Seyfert galaxy NGC 3281 Jun-Rong Liu, Hua Feng, Jian-Min Wang Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We report the detection of significant $\\gamma$-ray emission with $\\it Fermi$-LAT from the radio-quiet Seyfert 2 galaxy NGC 3281, with a luminosity of $5.9\\,(\\pm 1.7)\\times10^{41}\\rm\\,erg\\,s^{-1}$ at a significance of $6.22\\,\\sigma$ (TS = $42.81$). The power-law photon index is $2.61~(\\pm 0.24)$, indicative of a soft spectrum. The star formation activity in NGC 3281 is insufficient to explain its $\\gamma$-ray luminosity based on the empirical relation between the infrared and $\\gamma$-ray luminosities observed in other sources. The multiwavelength spectrum can be explained as due to inverse Compton scattering by relativistic electrons in the corona or jet of seed photons from the corona, disk and torus. The source is Compton-thick and attenuation of GeV photons due to pair production in the corona is nonnegligible (with an optical depth of about 10). The intrinsic $\\gamma$-ray luminosity is inferred to be $3.4\\,\\times10^{42}$ and $2.2\\,\\times10^{41}\\rm\\,erg\\,s^{-1}$ for the corona and jet model, respectively. The observed $\\gamma$-ray and radio luminosities is roughly consistent with the known correlation between the two quantities, among the lowest luminosity regime. The jet origin is valid only if the radio emission is dominated by the jet.",
      "pdf_url": "https://arxiv.org/pdf/2509.21958.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21987",
      "title": "Revisiting 3C 279 jet morphology with space VLBI at 26 microarcsecond resolution",
      "authors": [
        "Teresa Toscano",
        "José L. Gómez",
        "Guang-Yao Zhao",
        "Rocco Lico",
        "Antonio Fuentes",
        "Tuomas Savolainen",
        "Jan Röder",
        "Maciek Wielgus",
        "B. Alexander Pushkarev",
        "Efthalia Traianou",
        "Ai-Ling Zeng",
        "I. Leonid Gurvits",
        "Y. Yuri Kovalev",
        "M. Felix Pötzl",
        "Mikhail Lisakov"
      ],
      "abstract": "Revisiting 3C 279 jet morphology with space VLBI at 26 microarcsecond resolution Teresa Toscano, José L. Gómez, Guang-Yao Zhao, Rocco Lico, Antonio Fuentes, Tuomas Savolainen, Jan Röder, Maciek Wielgus, B. Alexander Pushkarev, Efthalia Traianou, Ai-Ling Zeng, I. Leonid Gurvits, Y. Yuri Kovalev, M. Felix Pötzl, Mikhail Lisakov High Energy Astrophysical Phenomena (astro-ph.HE) We present observations of the blazar 3C 279 at 22 GHz using the space VLBI mission RadioAstron on 2018 January 15. Images in both total intensity and fractional polarization are reconstructed using RML method implemented in the eht-imaging library. The electric vector position angles are found to be mostly aligned with the general jet direction, suggesting a predominantly toroidal magnetic field, in agreement with the presence of a helical magnetic field. Ground-space fringes were detected up to a projected baseline length of $\\sim 8$G$\\lambda$, achieving the angular resolution of around 26$\\mu$as. The fine-scale structure of the relativistic jet is found in our study extending to a projected distance of $\\sim 180$ parsec from the radio core. However, the filamentary structure reported by previous RadioAstron observations of 2014 is not detected in our current study. We discuss potential causes for this phenomenon, together with a comparison using public 43 GHz data from the BEAM-ME program, showing a significant drop in the jet's total intensity. The optically thick core is observed with a brightness temperature of $ 1.6 \\times 10^{12}$ K, consistent with equipartition between the energy densities of the relativistic particles and the magnetic field. This yields an estimated magnetic field strength of 0.2 G.",
      "pdf_url": "https://arxiv.org/pdf/2509.21987.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22419",
      "title": "Choked jets in BSG/RSG as possible sources of high-energy neutrinos",
      "authors": [
        "Matteo Pais",
        "Angela Zegarelli",
        "Silvia Celli",
        "Enrico Peretti"
      ],
      "abstract": "Choked jets in BSG/RSG as possible sources of high-energy neutrinos Matteo Pais, Angela Zegarelli, Silvia Celli, Enrico Peretti 8 pages, 2 figures, accepted for publication in Proceedings of Science, PoS(ICRC2025)1138 (Multi-messenger emission from choked jets in collapsars) High Energy Astrophysical Phenomena (astro-ph.HE) The death of massive stars is accompanied by the formation of central and accreting compact objects and the subsequent launch of relativistic jets. However, not all jets successfully drill their way out of the stellar envelope. Unsuccessful jets, also known as choked jets, may still produce radiation at lower frequencies by dissipating the jet energy into a pressurized cocoon. This cocoon expands within the stellar envelope and eventually breaks out as a mildly relativistic outflow. We investigate the plasma physics in the surroundings of massive collapsing stars harboring choked jets via relativistic, non-resistive MHD simulations. As a result, we define the parameter space allowing for jets to remain choked, and we quantify the acceleration rate and efficiency for charged particles in the strong shocks of such astrophysical environments. Preliminary results show that high Mach numbers ($\\sim 100$) after 5-10 seconds of constant energy injection characterize the forward shock, possibly allowing for efficient particle acceleration and high-energy neutrino production. Our results are presented for blue supergiant progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2509.22419.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21366",
      "title": "Advanced stereoscopy applied to CTAO",
      "authors": [
        "Hana Ali Messaoud",
        "Tom François",
        "Thomas Vuillaume"
      ],
      "abstract": "Advanced stereoscopy applied to CTAO Hana Ali Messaoud, Tom François, Thomas Vuillaume Presented at the 39th International Cosmic Ray Conference (ICRC 2025), 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) The Cherenkov Telescope Array Observatory (CTAO) is an international observatory currently under construction, which will consist of two sites (one in the Northern Hemisphere and one in the Southern Hemisphere). It will eventually be the largest and most sensitive ground-based gamma-ray observatory. In the meantime, a small subarray composed of four Large-Sized Telescopes (LSTs) at the Northern site will begin collecting data in the coming year. In preparation, we present a stereoscopic event reconstruction using graph neural networks (GNNs) to combine information from several telescopes of this subarray. In our previous work, we explored the use of GNNs for the stereoscopic reconstruction of gamma-ray events on simulated data from the Prod5 sample and showed that GNNs provide a better stereoscopic reconstruction. We now compare this approach to the currently foreseen method that analytically combines the output of monoscopic random forests, and explore how GNNs can be used in fusion with the Random forest algorithm in order to provide a more sensitive stereoscopic system.",
      "pdf_url": "https://arxiv.org/pdf/2509.21366.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21467",
      "title": "Radio Stars in the Era of New Observatories",
      "authors": [
        "Lynn D. Matthews"
      ],
      "abstract": "Radio Stars in the Era of New Observatories Lynn D. Matthews accepted to PASP; 56 pages; summary of the \"Radio Stars in the Era of New Observatories\" conference held at MIT Haystack Observatory in April 2024 Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) An international conference Radio Stars in the Era of New Observatories was held at the Massachusetts Institute of Technology Haystack Observatory on 2024 April 17-19. The conference brought together more than 60 researchers from around the world, united by an interest in using radio wavelength observations to explore the physical processes that operate in stars (including the Sun), how stars evolve and interact with their environments, and the role of radio stars as probes of our Galaxy. Topics discussed at the meeting included radio emission from cool and ultracool dwarfs, extrasolar space weather, stellar masers, thermal radio emission from evolved stars, circumstellar chemistry, low frequency observations of the Sun, radio emission from hot stars, applications of very long baseline interferometry techniques to stellar astrophysics, stellar explosive events, the detection of radio stars in the latest generation of widefield sky surveys, the importance of radio stars for understanding the structure and evolution of the Milky Way, and the anticipated applications for stellar astrophysics of future radio observatories on the ground and in space. This article summarizes research topics and results featured at the conference, along with some background and contextual information. It also highlights key outstanding questions in stellar astrophysics where new insights are anticipated from the next generation of observational facilities operating at meter through submillimeter wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2509.21467.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22074",
      "title": "Next-day observation processing for the LST-1 and MAGIC",
      "authors": [
        "A. Dinesh",
        "M. Láinez",
        "R.A. Cerviño",
        "D. Morcuende",
        "A. Moralejo",
        "J.L. Contreras",
        "A. Baquero",
        "J. Lozano"
      ],
      "abstract": "Next-day observation processing for the LST-1 and MAGIC A. Dinesh, M. Láinez, R.A. Cerviño, D. Morcuende, A. Moralejo, J.L. Contreras, A. Baquero, J. Lozano (on behalf of the CTAO-LST project and the MAGIC collaboration) Presented at the 39th International Cosmic Ray Conference (ICRC 2025), 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) The MAGIC and LST-1 telescopes, located at the Roque de los Muchachos Observatory on La Palma, operate dedicated On-Site Analysis (OSA) pipelines that provide rapid, automated processing of observational data. These systems produce high-level data products just a few hours after observations are completed, enabling quick-look analyses, next-day data quality assessments, and rapid-response science such as flare detection and Target of Opportunity follow-ups. OSA pipelines have been in continuous operation since 2012 for MAGIC and since 2021 for LST-1, automatically processing nightly data using the standard analysis chain. The experience gained from both systems provides essential lessons for the development of Cherenkov Telescope Array Observatory's (CTAO's) on-site analysis, demonstrating the practical and scientific benefits of fast data processing in Cherenkov telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2509.22074.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.01495",
      "title": "Search for continuous gravitational waves from known pulsars in the first part of the fourth LIGO-Virgo-KAGRA observing run",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration: A. G. Abac",
        "R. Abbott",
        "I. Abouelfettouh",
        "F. Acernese",
        "K. Ackley",
        "S. Adhicary",
        "N. Adhikari",
        "R. X. Adhikari",
        "V. K. Adkins",
        "D. Agarwal",
        "M. Agathos",
        "M. Aghaei Abchouyeh",
        "O. D. Aguiar",
        "I. Aguilar",
        "L. Aiello",
        "A. Ain",
        "P. Ajith",
        "T. Akutsu",
        "S. Albanesi",
        "R. A. Alfaidi",
        "A. Al-Jodah",
        "C. Alléné",
        "A. Allocca",
        "S. Al-Shammari",
        "P. A. Altin",
        "S. Alvarez-Lopez",
        "A. Amato",
        "L. Amez-Droz",
        "A. Amorosi",
        "C. Amra",
        "A. Ananyeva",
        "S. B. Anderson",
        "W. G. Anderson",
        "M. Andia",
        "M. Ando",
        "T. Andrade",
        "N. Andres",
        "M. Andrés-Carcasona",
        "T. Andrić",
        "J. Anglin",
        "S. Ansoldi",
        "J. M. Antelis",
        "S. Antier",
        "M. Aoumi",
        "E. Z. Appavuravther",
        "S. Appert",
        "S. K. Apple",
        "K. Arai",
        "A. Araya",
        "M. C. Araya",
        "J. S. Areeda",
        "L. Argianas",
        "N. Aritomi",
        "F. Armato",
        "N. Arnaud",
        "M. Arogeti",
        "S. M. Aronson",
        "G. Ashton",
        "Y. Aso",
        "M. Assiduo",
        "S. Assis de Souza Melo",
        "S. M. Aston",
        "P. Astone",
        "F. Attadio",
        "F. Aubin",
        "K. AultONeal",
        "G. Avallone",
        "S. Babak",
        "F. Badaracco",
        "C. Badger",
        "S. Bae",
        "S. Bagnasco",
        "E. Bagui",
        "J. G. Baier",
        "L. Baiotti",
        "R. Bajpai",
        "T. Baka",
        "M. Ball",
        "G. Ballardin",
        "S. W. Ballmer",
        "S. Banagiri",
        "B. Banerjee",
        "D. Bankar",
        "P. Baral",
        "J. C. Barayoga",
        "B. C. Barish",
        "D. Barker",
        "P. Barneo",
        "F. Barone",
        "B. Barr",
        "L. Barsotti",
        "M. Barsuglia",
        "D. Barta",
        "A. M. Bartoletti",
        "M. A. Barton",
        "I. Bartos",
        "S. Basak"
      ],
      "abstract": "Search for continuous gravitational waves from known pulsars in the first part of the fourth LIGO-Virgo-KAGRA observing run The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration: A. G. Abac, R. Abbott, I. Abouelfettouh, F. Acernese, K. Ackley, S. Adhicary, N. Adhikari, R. X. Adhikari, V. K. Adkins, D. Agarwal, M. Agathos, M. Aghaei Abchouyeh, O. D. Aguiar, I. Aguilar, L. Aiello, A. Ain, P. Ajith, T. Akutsu, S. Albanesi, R. A. Alfaidi, A. Al-Jodah, C. Alléné, A. Allocca, S. Al-Shammari, P. A. Altin, S. Alvarez-Lopez, A. Amato, L. Amez-Droz, A. Amorosi, C. Amra, A. Ananyeva, S. B. Anderson, W. G. Anderson, M. Andia, M. Ando, T. Andrade, N. Andres, M. Andrés-Carcasona, T. Andrić, J. Anglin, S. Ansoldi, J. M. Antelis, S. Antier, M. Aoumi, E. Z. Appavuravther, S. Appert, S. K. Apple, K. Arai, A. Araya, M. C. Araya, J. S. Areeda, L. Argianas, N. Aritomi, F. Armato, N. Arnaud, M. Arogeti, S. M. Aronson, G. Ashton, Y. Aso, M. Assiduo, S. Assis de Souza Melo, S. M. Aston, P. Astone, F. Attadio, F. Aubin, K. AultONeal, G. Avallone, S. Babak, F. Badaracco, C. Badger, S. Bae, S. Bagnasco, E. Bagui, J. G. Baier, L. Baiotti, R. Bajpai, T. Baka, M. Ball, G. Ballardin, S. W. Ballmer, S. Banagiri, B. Banerjee, D. Bankar, P. Baral, J. C. Barayoga, B. C. Barish, D. Barker, P. Barneo, F. Barone, B. Barr, L. Barsotti, M. Barsuglia, D. Barta, A. M. Bartoletti, M. A. Barton, I. Bartos, S. Basak main paper: 12 pages, 6 figures, 4 tables High Energy Astrophysical Phenomena (astro-ph.HE) Continuous gravitational waves (CWs) emission from neutron stars carries information about their internal structure and equation of state, and it can provide tests of General Relativity. We present a search for CWs from a set of 45 known pulsars in the first part of the fourth LIGO--Virgo--KAGRA observing run, known as O4a. We conducted a targeted search for each pulsar using three independent analysis methods considering the single-harmonic and the dual-harmonic emission models. We find no evidence of a CW signal in O4a data for both models and set upper limits on the signal amplitude and on the ellipticity, which quantifies the asymmetry in the neutron star mass distribution. For the single-harmonic emission model, 29 targets have the upper limit on the amplitude below the theoretical spin-down limit. The lowest upper limit on the amplitude is $6.4\\!\\times\\!10^{-27}$ for the young energetic pulsar J0537-6910, while the lowest constraint on the ellipticity is $8.8\\!\\times\\!10^{-9}$ for the bright nearby millisecond pulsar J0437-4715. Additionally, for a subset of 16 targets we performed a narrowband search that is more robust regarding the emission model, with no evidence of a signal. We also found no evidence of non-standard polarizations as predicted by the Brans-Dicke theory.",
      "pdf_url": "https://arxiv.org/pdf/2501.01495.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.17518",
      "title": "SN 2023gpw: exploring the diversity and power sources of hydrogen-rich superluminous supernovae",
      "authors": [
        "Tuomas Kangas",
        "Panos Charalampopoulos",
        "Takashi Nagao",
        "Lin Yan",
        "Maximilian Stritzinger",
        "Steve Schulze",
        "Kaustav Das",
        "Nancy Elias-Rosa",
        "Christoffer Fremling",
        "Daniel Perley",
        "Jesper Sollerman",
        "Tomás Müller-Bravo",
        "Lluís Galbany",
        "Steven L. Groom",
        "Claudia Gutiérrez",
        "Mansi Kasliwal",
        "Rubina Kotak",
        "Russ Laher",
        "Peter Lundqvist",
        "Seppo Mattila",
        "Roger Smith"
      ],
      "abstract": "SN 2023gpw: exploring the diversity and power sources of hydrogen-rich superluminous supernovae Tuomas Kangas, Panos Charalampopoulos, Takashi Nagao, Lin Yan, Maximilian Stritzinger, Steve Schulze, Kaustav Das, Nancy Elias-Rosa, Christoffer Fremling, Daniel Perley, Jesper Sollerman, Tomás Müller-Bravo, Lluís Galbany, Steven L. Groom, Claudia Gutiérrez, Mansi Kasliwal, Rubina Kotak, Russ Laher, Peter Lundqvist, Seppo Mattila, Roger Smith 18 pages, 15 figures, 9 appendix pages, 5 appendix figures. Astronomy & Astrophysics, in press High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We present our observations and analysis of SN 2023gpw, a hydrogen-rich superluminous supernova (SLSN II) with broad emission lines in its post-peak spectra. Unlike previously observed SLSNe II, its light curve suggests an abrupt drop during a solar conjunction between ~80 and ~180 d after the light-curve peak, possibly analogous to a normal hydrogen-rich supernova (SN). Spectra taken at and before the peak show hydrogen and helium `flash' emission lines attributed to early interaction with a dense confined circumstellar medium (CSM). A well-observed ultraviolet excess appears as these lines disappear, also as a result of CSM interaction. The blackbody photosphere expands roughly at the same velocity throughout the observations, indicating little or no bulk deceleration. This velocity is much higher than what is seen in spectral lines, suggesting asymmetry in the ejecta. The high total radiated energy ($\\gtrsim9\\times10^{50}$ erg) and aforementioned lack of bulk deceleration in SN 2023gpw are difficult to reconcile with a neutrino-driven SN simply combined with efficient conversion from kinetic energy to emission through interaction. This suggests an additional energy source such as a central engine. While magnetar-powered models qualitatively similar to SN 2023gpw exist, more modeling work is required to determine if they can reproduce the observed properties in combination with early interaction. The required energy might alternatively be provided by accretion onto a black hole created in the collapse of a massive progenitor star.",
      "pdf_url": "https://arxiv.org/pdf/2505.17518.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.02234",
      "title": "Gravitational Redshift for Rapidly Rotating Neutron Stars",
      "authors": [
        "Zsombor Jakab",
        "Sharon Morsink"
      ],
      "abstract": "Gravitational Redshift for Rapidly Rotating Neutron Stars Zsombor Jakab, Sharon Morsink Accepted by ApJ. Revision includes changes based on the referee's comments High Energy Astrophysical Phenomena (astro-ph.HE) The Oblate Schwarzschild (OS) approximation is a method often used to compute the flux of X-rays emitted from a rapidly rotating neutron star. In this approximation, the oblate shape of the rotating star is embedded in the Schwarzschild metric, which is used to compute the redshift of photon energies as they propagate from the star to the telescope. In this paper, we demonstrate that there are small errors introduced by the standard treatment of photon redshift in the OS approximation and provide a simple method to correct these errors. These errors are constant in phase, so this results in a constant absolute reduction in the flux. For PSR J0740+6620, the most rapidly spinning of the pulsars observed by NICER, we estimate the flux errors are less than 1\\%, which is an order of magnitude smaller than the uncertainty in the distance, so this does not affect the mass and radius constraints found for this pulsar. The errors for the other pulsars observed by NICER are even smaller. However, this correction should be included when analyzing data for more rapidly rotating X-ray pulsars with spin frequencies near 600 Hz.",
      "pdf_url": "https://arxiv.org/pdf/2507.02234.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.05769",
      "title": "Constraints on the diffuse flux of multi-PeV astrophysical neutrinos obtained with the Baikal Gigaton Volume Detector",
      "authors": [
        "V.A. Allakhverdyan",
        "A.D. Avrorin",
        "A.V. Avrorin",
        "V.M. Aynutdinov",
        "Z. Beňušová",
        "I.A. Belolaptikov",
        "E.A. Bondarev",
        "I.V. Borina",
        "N.M. Budnev",
        "V.A. Chadymov",
        "A.S. Chepurnov",
        "V.Y. Dik",
        "A.N. Dmitrieva",
        "G.V. Domogatsky",
        "A.A. Doroshenko",
        "R. Dvornický",
        "A.N. Dyachok",
        "Zh.-A.M. Dzhilkibaev",
        "E. Eckerová",
        "T.V. Elzhov",
        "V.N. Fomin",
        "A.R. Gafarov",
        "K.V. Golubkov",
        "T.I. Gress",
        "K.G. Kebkal",
        "V.K. Kebkal",
        "I.V. Kharuk",
        "S.S. Khokhlov",
        "E.V. Khramov",
        "M.M. Kolbin",
        "S.O. Koligaev",
        "K.V. Konischev",
        "A.V. Korobchenko",
        "A.P. Koshechkin",
        "V.A. Kozhin",
        "M.V. Kruglov",
        "V.F. Kulepov",
        "A.A. Kulikov",
        "Y.E. Lemeshev",
        "M.V. Lisitsin",
        "S.V. Lovtsov",
        "R.R. Mirgazov",
        "D.V. Naumov",
        "A.S. Nikolaev",
        "I.A. Perevalova",
        "A.A. Petrukhin",
        "D.P. Petukhov",
        "E.N. Pliskovsky",
        "M.I. Rozanov",
        "E.V. Ryabov",
        "G.B. Safronov",
        "B.A. Shaybonov",
        "V.Y. Shishkin",
        "E.V. Shirokov",
        "F. Šimkovic",
        "A.E. Sirenko",
        "A.V. Skurikhin",
        "A.G. Solovjev",
        "M.N. Sorokovikov",
        "I. Štekl",
        "A.P. Stromakov",
        "O.V. Suvorova",
        "V.A. Tabolenko",
        "V.I. Tretjak",
        "B.B. Ulzutuev",
        "Y.V. Yablokova",
        "D.N. Zaborov",
        "S.I. Zavjalov",
        "D.Y. Zvezdov",
        "A.V. Plavin",
        "D.V. Semikoz",
        "S.V. Troitsky"
      ],
      "abstract": "Constraints on the diffuse flux of multi-PeV astrophysical neutrinos obtained with the Baikal Gigaton Volume Detector V.A. Allakhverdyan, A.D. Avrorin, A.V. Avrorin, V.M. Aynutdinov, Z. Beňušová, I.A. Belolaptikov, E.A. Bondarev, I.V. Borina, N.M. Budnev, V.A. Chadymov, A.S. Chepurnov, V.Y. Dik, A.N. Dmitrieva, G.V. Domogatsky, A.A. Doroshenko, R. Dvornický, A.N. Dyachok, Zh.-A.M. Dzhilkibaev, E. Eckerová, T.V. Elzhov, V.N. Fomin, A.R. Gafarov, K.V. Golubkov, T.I. Gress, K.G. Kebkal, V.K. Kebkal, I.V. Kharuk, S.S. Khokhlov, E.V. Khramov, M.M. Kolbin, S.O. Koligaev, K.V. Konischev, A.V. Korobchenko, A.P. Koshechkin, V.A. Kozhin, M.V. Kruglov, V.F. Kulepov, A.A. Kulikov, Y.E. Lemeshev, M.V. Lisitsin, S.V. Lovtsov, R.R. Mirgazov, D.V. Naumov, A.S. Nikolaev, I.A. Perevalova, A.A. Petrukhin, D.P. Petukhov, E.N. Pliskovsky, M.I. Rozanov, E.V. Ryabov, G.B. Safronov, B.A. Shaybonov, V.Y. Shishkin, E.V. Shirokov, F. Šimkovic, A.E. Sirenko, A.V. Skurikhin, A.G. Solovjev, M.N. Sorokovikov, I. Štekl, A.P. Stromakov, O.V. Suvorova, V.A. Tabolenko, V.I. Tretjak, B.B. Ulzutuev, Y.V. Yablokova, D.N. Zaborov, S.I. Zavjalov, D.Y. Zvezdov (Baikal-GVD Collaboration), A.V. Plavin, D.V. Semikoz, S.V. Troitsky 7 pages, 5 figures, revtex. V2: minor changes, version accepted by Phys. Rev. D High Energy Astrophysical Phenomena (astro-ph.HE) Various theoretical models predict cosmic neutrinos with multi-PeV energies. The recent detection of a ~10^17 eV neutrino in the KM3NeT experiment suggests that these energetic particles can be studied with present-day installations. Here, we present upper limits on the flux of astrophysical neutrinos with energies (10^15.5 - 10^20) eV obtained with the largest liquid-water neutrino telescope, Baikal Gigaton Volume Detector (GVD), operation using cascade-like events. We discuss astrophysical implications of these results and constrain several cosmogenic neutrino scenarios using a combination of Baikal-GVD, KM3NeT, IceCube and Auger data.",
      "pdf_url": "https://arxiv.org/pdf/2507.05769.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.06766",
      "title": "Effects of Lorentz invariance violation on charged particles and photon production in astrophysical sources",
      "authors": [
        "Matheus Duarte",
        "Vitor de Souza"
      ],
      "abstract": "Effects of Lorentz invariance violation on charged particles and photon production in astrophysical sources Matheus Duarte, Vitor de Souza High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) We investigate the impact of Lorentz invariance violation (LIV) on radiation processes in astrophysical sources, focusing on synchrotron and inverse Compton interactions. We derive modified expressions for radiated power and photon energy under LIV assumptions and incorporate them into first-order Fermi acceleration models. Our analysis reveals energy thresholds beyond which LIV significantly alters particle dynamics and photon spectra, introducing non-physical divergences that highlight limitations in perturbative approaches. We model synchrotron self-Compton (SSC) emission in the presence of LIV and assess its consequences for photon fluxes from blazars, including Markarian 501 and the BL Lac population. LIV introduces distinct high-energy emission regions that deviate from standard expectations. Comparisons with observational data, particularly upper limits from the Pierre Auger Observatory, suggest that future multi-messenger observations, together with the full analysis of particle's trajectories, could constrain LIV parameters through the non-detection of such excesses.",
      "pdf_url": "https://arxiv.org/pdf/2507.06766.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09860",
      "title": "Propeller effect in action: Unveiling quenched accretion in the transient X-ray pulsar 4U 0115+63",
      "authors": [
        "Hua Xiao",
        "Sergey S. Tsygankov",
        "Valery F. Suleimanov",
        "Alexander A. Mushtukov",
        "Long Ji",
        "Juri Poutanen"
      ],
      "abstract": "Propeller effect in action: Unveiling quenched accretion in the transient X-ray pulsar 4U 0115+63 Hua Xiao, Sergey S. Tsygankov, Valery F. Suleimanov, Alexander A. Mushtukov, Long Ji, Juri Poutanen 8 pages, 6 figures, 2 tables, accepted for publication in Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) The Be/X-ray pulsar 4U 0115+63 underwent a type II outburst in 2023. After the outburst, similar to the outbursts in 2015 and 2017, the source decayed into a quiescent state. Two out of three XMM-Newton observations conducted after the 2023 outburst confirmed the source to be in a low-luminosity state at a level of $L_{\\rm X} \\sim 10^{33}\\,\\rm erg\\,s^{-1}$. X-ray pulsations were detected at $\\approx$0.277 Hz in both observations with a pulsed fraction exceeding 50%. The power density spectra show no significant low-frequency red noise in both observations, suggesting that the radiation is not driven by accretion. The energy spectra in this state can be described by a single blackbody component, with an emitting area smaller than the typical size of the polar caps during the accretion phase. Based on the timing and spectral properties, we suggest that the propeller effect is active during the quiescent state, resulting in a total quenching of accretion. We discuss possible mechanisms for the generation of pulsations in this regime and consider the scenario of neutron star crust cooling.",
      "pdf_url": "https://arxiv.org/pdf/2509.09860.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16544",
      "title": "Light curves of time-dependent accretion disk in tidal disruption events",
      "authors": [
        "Chenlei Guo",
        "Erlin Qiao"
      ],
      "abstract": "Light curves of time-dependent accretion disk in tidal disruption events Chenlei Guo, Erlin Qiao 18 pages, 9 figures. Submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Tidal disruption events (TDEs) are believed to be an ideal laboratory for studying the evolution of accretion flow around a supermassive black hole (BH). In general, the mass feeding rate to the BH is suggested to be super-Eddington initially, and evolves to be sub-Eddington on timescale of years. In this paper, we carry out calculations of the time-dependent evolution of accretion disk in the standard environment of TDE, i.e., injecting matter at the circularization radius of the stellar debris in the form of $\\dot M_{\\rm inject} \\propto t^{-5/3}$. One of the main findings is that when $\\dot M_{\\rm inject}$ evolves to a value around the Eddington accretion rate, the radiation pressure instability occurs. We test the influence of the model parameters on the light curves, such as the BH mass $M_{\\rm BH}$, viscosity parameter $\\alpha$, and mass-injecting radius $R_{\\rm{out}}$, all of which are found to affect the light curves to some extent. In most cases, we find that the light curves oscillate significantly due to the radiation pressure instability. As an exception, when $\\alpha$ is small or $R_{\\rm{out}}$ is large, we find that the oscillations are completely suppressed. In this case, the light curve drops steeply and then becomes flat in the late-time evolution, which is applied to explaining the observed ultraviolet (UV) light curves of ASASSN-15oi and ASASSN-14ae together with the assumption of a photosphere. Finally, we discuss the potential applications of our time-dependent accretion disk model to explaining multi-band light curves of TDEs in the future.",
      "pdf_url": "https://arxiv.org/pdf/2509.16544.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20131",
      "title": "A Search for High-Energy Emission from the Remnant of Supernova 1181",
      "authors": [
        "J. Holder",
        "Qiqi Jiang"
      ],
      "abstract": "A Search for High-Energy Emission from the Remnant of Supernova 1181 J. Holder (for the VERITAS Collaboration), Qiqi Jiang Presented at the 39th International Cosmic Ray Conference, Geneva, 2025 High Energy Astrophysical Phenomena (astro-ph.HE) Over the previous millennium, only five Galactic supernovae were observed and recorded by contemporary astronomers, and their current-day counterparts subsequently identified. The remnants of four of these have all been very deeply studied, and ultimately detected, by TeV instruments after exposures of typically hundreds of hours. The measured TeV fluxes range from 1 Crab (by definition) down to 0.3% Crab. The location of the fifth supernova remnant tied to a historical record of its supernova (SN 1181) has never been studied at TeV energies. The reason for this is simple - the associated remnant was only identified as such in 2021. The remnant, Pa 30, is an unusual object whose properties are best explained as resulting from a Type Iax supernova explosion. These are a rare sub-type of Type Ia supernovae in which the merging white dwarfs are not fully destroyed by the supernova explosion, leading to a double-degenerate merger product colorfully described as a 'zombie star'. We will present the results of a search for TeV gamma-ray emission from Pa 30 with VERITAS.",
      "pdf_url": "https://arxiv.org/pdf/2509.20131.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21299",
      "title": "Outflow-cloud interaction as the possible origin of the peculiar radio emission in the tidal disruption event AT2018cqh",
      "authors": [
        "Lei Yang",
        "Xinwen Shu",
        "Guobin Mou",
        "Yongquan Xue",
        "Luming Sun",
        "Fabao Zhang",
        "Zhumao Zhang",
        "Yibo Wang",
        "Tao Wu",
        "Ning Jiang",
        "Hucheng Ding",
        "Tinggui Wang"
      ],
      "abstract": "Outflow-cloud interaction as the possible origin of the peculiar radio emission in the tidal disruption event AT2018cqh Lei Yang, Xinwen Shu, Guobin Mou, Yongquan Xue, Luming Sun, Fabao Zhang, Zhumao Zhang, Yibo Wang, Tao Wu, Ning Jiang, Hucheng Ding, Tinggui Wang 12 pages, 6 figures, accepted for publication in ApJL; v2: corrected an author's name High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) AT2018cqh is a unique optical tidal disruption event (TDE) discovered in a dwarf galaxy exhibiting delayed X-ray and radio flares. We present the results from high-resolution VLBA and e-MERLIN radio observations of AT2018cqh extending to $\\delta$t $\\sim$ 2250 days post discovery, which reveal a compact radio emission, unresolved at a scale of <~ 0.13 pc at 7.6 GHz, with a high brightness temperature of $T_b$ ~> 4.03 $\\times$ 10$^{9}$ K. The radio spectral energy distribution (SED) is found to gradually shift towards a higher peak flux density and frequency over a period of $\\sim$1000 days. An equipartition analysis suggests that there is a little change in the radio emitting region over this period, while the electron density increases by a factor of 3. The radio light curve at 0.89 GHz continues to rise, with a bump feature lasting for 240 days. These properties are in contrast to the predictions of standard shockwave model from a diffuse circumnuclear medium, but could be explained if dense clouds exist in the circumnuclear environment. The latter scenario is supported by our hydrodynamic simulations of the interaction of TDE outflow with a cloud, which can reproduce the temporal evolution in the radio SED. This work highlights the importance of the outflow-cloud interaction in explaining the delayed, fast-rising radio emission observed in some TDEs, especially those occurring in galaxies with pre-existing AGN activity.",
      "pdf_url": "https://arxiv.org/pdf/2509.21299.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.10583",
      "title": "A $ν$ look at the Sun: Probing the conditions of the solar core using $^8$B neutrinos",
      "authors": [
        "Melanie A. Zaidel",
        "John F. Beacom"
      ],
      "abstract": "A $ν$ look at the Sun: Probing the conditions of the solar core using $^8$B neutrinos Melanie A. Zaidel, John F. Beacom Resubmitting version accepted to Physical Review C Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); Nuclear Theory (nucl-th) In the coming age of precision neutrino physics, neutrinos from the Sun become robust probes of the conditions of the solar core. Here, we focus on $^8$B neutrinos, for which there are already high precision measurements by the Sudbury Neutrino Observatory and Super-Kamiokande. Using only basic physical principles and straightforward statistical tools, we estimate projected constraints on the temperature and density of the $^8$B neutrino production zone compared to a reference solar model. We outline how to better understand the astrophysics of the solar interior using forthcoming neutrino data and solar models. Finally, we note that detailed forward modeling will be needed to develop the full potential of this approach.",
      "pdf_url": "https://arxiv.org/pdf/2504.10583.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE",
        "hep-ph",
        "nucl-th"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21575",
      "title": "BlackTHUNDER: evidence for three massive black holes in a z~5 galaxy",
      "authors": [
        "Hannah Übler",
        "Giovanni Mazzolari",
        "Roberto Maiolino",
        "Francesco D'Eugenio",
        "Nazanin Davari",
        "Ignas Juodžbalis",
        "Raffaella Schneider",
        "Rosa Valiante",
        "Santiago Arribas",
        "Elena Bertola",
        "Andrew J. Bunker",
        "Volker Bromm",
        "Stefano Carniani",
        "Stéphane Charlot",
        "Giovanni Cresci",
        "Mirko Curti",
        "Richard Davies",
        "Frank Eisenhauer",
        "Andrew Fabian",
        "Natascha M. Förster Schreiber",
        "Reinhard Genzel",
        "Kohei Inayoshi",
        "Lucy R. Ivey",
        "Gareth C. Jones",
        "Boyuan Liu",
        "Dieter Lutz",
        "Ruari Mackenzie",
        "Jorryt Matthee",
        "Eleonora Parlanti",
        "Michele Perna",
        "Brant Robertson",
        "Bruno Rodríguez del Pino",
        "T. Taro Shimizu",
        "Debora Sijacki",
        "Eckhard Sturm",
        "Sandro Tacchella",
        "Linda Tacconi",
        "Giulia Tozzi",
        "Alessandro Trinca",
        "Giacomo Venturi",
        "Marta Volonteri",
        "Chris Willot",
        "Saiyang Zhang"
      ],
      "abstract": "BlackTHUNDER: evidence for three massive black holes in a z~5 galaxy Hannah Übler, Giovanni Mazzolari, Roberto Maiolino, Francesco D'Eugenio, Nazanin Davari, Ignas Juodžbalis, Raffaella Schneider, Rosa Valiante, Santiago Arribas, Elena Bertola, Andrew J. Bunker, Volker Bromm, Stefano Carniani, Stéphane Charlot, Giovanni Cresci, Mirko Curti, Richard Davies, Frank Eisenhauer, Andrew Fabian, Natascha M. Förster Schreiber, Reinhard Genzel, Kohei Inayoshi, Lucy R. Ivey, Gareth C. Jones, Boyuan Liu, Dieter Lutz, Ruari Mackenzie, Jorryt Matthee, Eleonora Parlanti, Michele Perna, Brant Robertson, Bruno Rodríguez del Pino, T. Taro Shimizu, Debora Sijacki, Eckhard Sturm, Sandro Tacchella, Linda Tacconi, Giulia Tozzi, Alessandro Trinca, Giacomo Venturi, Marta Volonteri, Chris Willot, Saiyang Zhang 17 pages, 9 figures; submitted to A&A; comments welcome Astrophysics of Galaxies (astro-ph.GA) We present observational evidence for three massive, accreting black holes in the $z=5.0167$ galaxy J0148-4214 from JWST/NIRSpec-IFU spectroscopy. The black holes are revealed through broad H$\\alpha$ emission (FWHM = 430-2920 km/s) without a forbidden-line counterpart in the bright [O III] doublet. Channel maps of the asymmetric central H$\\alpha$ profile isolate two spatially distinct broad line regions (BLRs), separated by $190\\pm40$ pc, while a third BLR is found in the galaxy outskirts with a projected separation of 1.7 kpc. Using single-epoch virial relations, we estimate black hole masses of $\\log(M_\\bullet/M_\\odot)=7.9\\pm0.4$ (primary central), $5.8\\pm0.5$ (secondary central) and $6.3\\pm0.5$ (third off-nuclear). We argue that the two central black holes will likely rapidly merge, with a simple dynamical friction time estimate of the order of 700 Myr. Assuming that also the off-nuclear black hole is in the process of sinking towards the centre, it will likely lead to a second merger, and we investigate the detection probability of such mergers with LISA. Alternatively, the third black hole may be the result of previous three-body interaction or a gravitational recoil, where our observations would provide evidence that such black holes may retain their accretion discs and BLRs even in the aftermath of such extreme dynamical interactions. The discovery of a black hole triplet at high redshift, together with other recent results on distant black hole pairs, indicates that multiple massive black hole systems were common in the early Universe. Our results highlight the importance of IFU observations for the detection of massive black hole multiplets in distant galaxies, the progenitors of massive black hole mergers that may be detected with next-generation gravitational wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2509.21575.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.21701",
      "title": "First results from ALPPS: a sub-Alfvénic streamer in SVS13A",
      "authors": [
        "P. C. Cortes",
        "J. E. Pineda",
        "T.-H. Hsieh",
        "J. J. Tobin",
        "P. Saha",
        "J. M. Girart",
        "V. J. M. Le Gouellec",
        "I. W. Stephens",
        "L. W. Looney",
        "E. Koumpia",
        "M. T. Valdivia-Mena",
        "L. Cacciapuoti",
        "C. Gieser",
        "S. S. R. Offner",
        "P. Caselli",
        "P. Sanhueza",
        "D. Segura-Cox",
        "M. Fernandez-Lopez",
        "K. Morii",
        "B. Huang",
        "F. O. Alves",
        "Q. Zhang",
        "W. Kwon",
        "C. L. H. Hull",
        "Z. Y. Li"
      ],
      "abstract": "First results from ALPPS: a sub-Alfvénic streamer in SVS13A P. C. Cortes, J. E. Pineda, T.-H. Hsieh, J. J. Tobin, P. Saha, J. M. Girart, V. J. M. Le Gouellec, I. W. Stephens, L. W. Looney, E. Koumpia, M. T. Valdivia-Mena, L. Cacciapuoti, C. Gieser, S. S. R. Offner, P. Caselli, P. Sanhueza, D. Segura-Cox, M. Fernandez-Lopez, K. Morii, B. Huang, F. O. Alves, Q. Zhang, W. Kwon, C. L. H. Hull, Z. Y. Li Accepted for publication is Astrophiscal Journal Letters Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present the first results from the ALMA Perseus Polarization Survey (ALPPS), focusing on the magnetic field in the SVS13A circumbinary disk. The dataset includes full-Stokes dust continuum observations at $\\sim0\\farcs3$ and 870 $\\mu$m, as well as molecular line emission from C$^{17}$O$(J=3 \\rightarrow 2)$ at $\\sim0\\farcs3$, C$^{18}$O$(J=2 \\rightarrow 1)$ at $\\sim0\\farcs2$, and DCN$(J=3 \\rightarrow 2)$ at $\\sim0\\farcs1$ angular resolution. Our observations resolve both a previously identified dust spiral and an infalling streamer, capturing their spatial and kinematic structures. The streamer is traced from scales $>300$ au down to the circumbinary disk. Using alignment measure (AM) maps and histograms that compare the orientations of the plane-of-sky magnetic field with local intensity and velocity gradients, we find that the AM distribution peaks at a value of 1. This AM peak strongly suggests alignment between the field and the dust total intensity emission, as well as between the field and the gas velocity, which in turn suggests grain alignment by magnetic fields. From our data, we derive a magnetic field strength, B$_{\\mathrm{pos}} \\sim 1.1 \\pm 0.6$\\, mG, and a kinetic to magnetic energy ratio of $0.5 \\pm 0.4$, suggesting magnetic dominance. We also produced a map of the Alfvénic Mach number, finding $\\mathcal{M}_{\\rm A} < 1$ along the streamer, consistent with sub-Alfvénic infalling motions. Therefore, the field is likely facilitating the inflow of material from the envelope onto the disk by constraining movement across the field lines. This represents the first detection of a magnetically sub-Alfvénic infalling streamer in a protostellar system.",
      "pdf_url": "https://arxiv.org/pdf/2509.21701.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21763",
      "title": "Mapping CO Ice in a Star-Forming Filament in the 3 kpc Arm with JWST",
      "authors": [
        "Savannah Gramze",
        "Adam Ginsburg",
        "Nazar Budaiev",
        "Alyssa Bulatek",
        "Theo Richardson",
        "A. T. Barnes",
        "Miriam G. Santa-Maria",
        "Mattia C. Sormani",
        "Xing Lu",
        "Francisco Nogueras-Lara",
        "Brandt A. L. Gaches",
        "Cara D. Battersby",
        "Jennifer Wallace",
        "Daniel L. Walker",
        "Elisabeth A.C. Mills",
        "Michael Mattern"
      ],
      "abstract": "Mapping CO Ice in a Star-Forming Filament in the 3 kpc Arm with JWST Savannah Gramze, Adam Ginsburg, Nazar Budaiev, Alyssa Bulatek, Theo Richardson, A. T. Barnes, Miriam G. Santa-Maria, Mattia C. Sormani, Xing Lu, Francisco Nogueras-Lara, Brandt A. L. Gaches, Cara D. Battersby, Jennifer Wallace, Daniel L. Walker, Elisabeth A.C. Mills, Michael Mattern Submitting to OJAp, 24 pages, 17 figures Astrophysics of Galaxies (astro-ph.GA) CO gas emission is a fundamental tool for measuring column density, but in cold, dark clouds, much of the CO is locked away in ice. We present JWST results from observations of a star forming filament (G0.342+0.024) that that appears to be associated with the 3 kpc arm. This filament is backlit by the Galactic Center, which has allowed us to construct a high-resolution extinction map (mean separation between stars of ~1\" outside the filament, ~2\" in the filament). ALMA Band 3 data reveals embedded star formation within the cloud. Using the CO ice feature covered by the F466N band, we map the CO ice column density of the filament. By combining the extinction map, CO ice column density map, and archival CO observations, we examine the efficacy of standard CO X-factor measurements of mass in star forming this http URL find that 50-88% of the CO is locked away in ice at large column densities ($N_{\\rm \\rm H_2} \\gtrsim 10^{22} \\rm ~cm^{-2}, 200 \\rm ~M_{\\odot} \\rm ~pc^{-2}$) in the filament. The primary sources of uncertainty in this estimate are due to uncertainty in the ice composition and lab measurements of ice opacities. This shows that systematic corrections are needed for mass measurements in the Milky Way and nearby galaxies at high column densities.",
      "pdf_url": "https://arxiv.org/pdf/2509.21763.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21822",
      "title": "The Draco Dwarf Spheroidal Galaxy in the First Year of DESI Data",
      "authors": [
        "J. Ding",
        "C. Rockosi",
        "Ting S. Li",
        "S. E. Koposov",
        "A. H. Riley",
        "W. Wang",
        "A. P. Cooper",
        "N. Kizhuprakkat",
        "M. Lambert",
        "G. E. Medina",
        "N. Sandford",
        "J. Aguilar",
        "S. Ahlen",
        "D. Bianchi",
        "D. Brooks",
        "T. Claybaugh",
        "A. de la Macorra",
        "P. Doel",
        "J. E. Forero-Romero",
        "E. Gaztanaga",
        "S. Gontcho A Gontcho",
        "G. Gutierrez",
        "J. Guy",
        "M. Ishak",
        "R. Kehoe",
        "T. Kisner",
        "A. Kremin",
        "O. Lahav",
        "M. Landriau",
        "L. Le Guillou",
        "A. Meisner",
        "R. Miquel",
        "J. Moustakas",
        "F. Prada",
        "I. Perez-Rafols",
        "G. Rossi",
        "E. Sanchez",
        "M. Schubnell",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarle",
        "B. A. Weaver",
        "R. Zhou"
      ],
      "abstract": "The Draco Dwarf Spheroidal Galaxy in the First Year of DESI Data J. Ding, C. Rockosi, Ting S. Li, S. E. Koposov, A. H. Riley, W. Wang, A. P. Cooper, N. Kizhuprakkat, M. Lambert, G. E. Medina, N. Sandford, J. Aguilar, S. Ahlen, D. Bianchi, D. Brooks, T. Claybaugh, A. de la Macorra, P. Doel, J. E. Forero-Romero, E. Gaztanaga, S. Gontcho A Gontcho, G. Gutierrez, J. Guy, M. Ishak, R. Kehoe, T. Kisner, A. Kremin, O. Lahav, M. Landriau, L. Le Guillou, A. Meisner, R. Miquel, J. Moustakas, F. Prada, I. Perez-Rafols, G. Rossi, E. Sanchez, M. Schubnell, J. Silber, D. Sprayberry, G. Tarle, B. A. Weaver, R. Zhou Astrophysics of Galaxies (astro-ph.GA) We investigate the spatial distribution, kinematics, and metallicity of stars in the Draco dwarf spheroidal galaxy using data from the Dark Energy Spectroscopic Instrument (DESI). We identify 155 high probability members of Draco using line of sight velocity and metallicity information derived from DESI spectroscopy along with {\\it Gaia} DR3 proper motions. We find a mean line of sight velocity of $ -290.62\\pm0.80$ km s$^{-1}$ with dispersion = $9.57^{+0.66}_{-0.62}$ km s$^{-1}$ and mean metallicity $\\rm{[Fe/H]}$ = $-2.10\\pm0.04$, consistent with previous results. We also find that Draco has a steep metallicity gradient within the half-light radius, and a metallicity gradient that flattens beyond the half-light radius. We identify eight high probability members outside the King tidal radius, four of which we identify for the first time. These extra-tidal stars are not preferentially aligned along the orbit of Draco. We compute an average surface brightness of 34.02 mag $\\rm arcsec^{-2}$ within an elliptical annulus from the King tidal radius of 48.1 arcmin to 81 arcmin.",
      "pdf_url": "https://arxiv.org/pdf/2509.21822.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21852",
      "title": "The EDGE-CALIFA Survey: Influence of Mergers on Radial Profiles of Star-Formation Properties",
      "authors": [
        "Y. Garay-Solis",
        "J. K. Barrera-Ballesteros",
        "L. Carigi",
        "D. Colombo",
        "S. F. Sánchez",
        "A. Z. Lugo-Aranda",
        "V. Villanueva",
        "T. Wong",
        "A. D. Bolatto"
      ],
      "abstract": "The EDGE-CALIFA Survey: Influence of Mergers on Radial Profiles of Star-Formation Properties Y. Garay-Solis, J. K. Barrera-Ballesteros, L. Carigi, D. Colombo, S. F. Sánchez, A. Z. Lugo-Aranda, V. Villanueva, T. Wong, A. D. Bolatto 7 Figures, 12 Pages. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) In this study, we investigate how the merging process influences the radial variations of the specific Star Formation Rate (sSFR), Star Formation Efficiency (SFE), and molecular gas fraction (fmol ) in galaxies. We analyse 33 isolated galaxies and 34 galaxies in four different merger stages from pairs, merging galaxies, post-mergers, and merger remnants. Our sample is included in the EDGE-CALIFA survey, which provides spatially resolved optical integral-field unit and CO spectroscopy data. We show that, in comparison with the isolated sample, the mergers increase the molecular gas fraction non-uniformly across different galactocentric distances. Also, we find that the main driver (efficiency or molecular gas) of both enhanced and suppressed star formation changes independently of galactocentric radius and merger stage. However, efficiency appears to be the primary driver of variations in star formation (except during the merging stage), where we find an enhancement in star formation driven by the available fuel. Our results suggest that in interacting and merging galaxies, the efficiency plays a crucial role in the star formation variations throughout the galaxy, regardless of the available molecular gas content.",
      "pdf_url": "https://arxiv.org/pdf/2509.21852.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21855",
      "title": "Baseline-Aware Dependence fitting for DAmping Timescales (BADDAT): A Nearly Unbiased Approach to Constraining Optical Variability Dependence on Physical Properties of Active Galactic Nuclei",
      "authors": [
        "Ruisong Xia",
        "Zhen-Yi Cai",
        "Yongquan Xue",
        "Xian-Liang Lu",
        "Guowei Ren",
        "Shuying Zhou",
        "Mouyuan Sun",
        "Shifu Zhu",
        "Zhen-Bo Su",
        "Hao Liu"
      ],
      "abstract": "Baseline-Aware Dependence fitting for DAmping Timescales (BADDAT): A Nearly Unbiased Approach to Constraining Optical Variability Dependence on Physical Properties of Active Galactic Nuclei Ruisong Xia, Zhen-Yi Cai, Yongquan Xue, Xian-Liang Lu, Guowei Ren, Shuying Zhou, Mouyuan Sun, Shifu Zhu, Zhen-Bo Su, Hao Liu 6 pages, 4 figures, accepted for publication in Monthly Notices of the Royal Astronomical Society Letters Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Active galactic nuclei (AGNs) exhibit stochastic optical variability, commonly characterized by a damped random walk. The damping timescale is of particular interest because it is related to fundamental properties of the central black hole, such as its mass and accretion rate. However, the systematic underestimation of damping timescales caused by limited observational baselines makes it difficult to exhaustively utilize all available data. Many previous efforts have relied on strict selection criteria to avoid biased measurements, and such criteria inevitably constrain the range of AGN physical parameter space and therefore hinder robust inference of the underlying dependencies of damping timescale on AGN properties. In contrast, we introduce a novel forward modeling approach, Baseline-Aware Dependence fitting for DAmping Timescales (BADDAT), which explicitly accounts for these biases and leverages the information contained in underestimated timescale measurements. Rather than attempting to correct individual timescale measurements, BADDAT robustly constrains the population-level dependence of damping timescale on AGN physical properties. We demonstrate its effectiveness using mock light curves and show that it successfully reconciles previous inconsistent results based on two independent AGN samples. Our BADDAT method will have broad applications in AGN variability studies during the era of time-domain astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2509.21855.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21970",
      "title": "Origin of gas in the Magellanic Bridge: MeerKAT detection of HI 21-cm absorption",
      "authors": [
        "A. P. M. Morelli",
        "J. Kerp",
        "N. Gupta",
        "F. Combes",
        "S. A. Balashev",
        "P. Noterdaeme",
        "H. Chen",
        "K. L. Emig",
        "E. Momjian"
      ],
      "abstract": "Origin of gas in the Magellanic Bridge: MeerKAT detection of HI 21-cm absorption A. P. M. Morelli, J. Kerp, N. Gupta, F. Combes, S. A. Balashev, P. Noterdaeme, H. Chen, K. L. Emig, E. Momjian accepted for publication in Astronomy & Astrophysics Letters Astrophysics of Galaxies (astro-ph.GA) HI 21-cm absorption lines are investigated to determine the origin of the neutral atomic hydrogen (HI) of the Magellanic Bridge (MB). Using the MeerKat Absorption Line Survey (MALS) data we report the detection of an HI absorption line at a peak signal-to-noise ratio of 10 caused by MB gas against the radio source J033242.97-724904.5. In combination with earlier data obtained with the Australia Telescope Compact Array (ATCA) our new detected HI line permits the exploration of the MB atomic hydrogen gas across 4-6 kpc. The radial velocity profiles from the ATCA data and new data from MALS are analysed. Apart from the excitation conditions, the radial velocity structure of the HI gas seen in emission and absorption is investigated. Eventually the gas-to-dust ratio is quantified to identify the origin of the MB gas being either from the SMC (Small Magellanic Cloud) or the LMC (Large Magellanic Cloud). The HI absorption lines towards lines of sight separated by several kpc consistently coincide with the densest and perhaps coolest gas at the lower radial-velocity limit of the corresponding HI emission profiles. The gas-to-dust ratio is found to be consistent with an origin of the MB gas from the LMC. The large scale velocity distribution as seen from the HI absorption features favors the LMC-SMC direct collision scenario over the close fly-by scenario, as also currently found by numerical simulations.",
      "pdf_url": "https://arxiv.org/pdf/2509.21970.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21975",
      "title": "Mass stratification in the globular cluster system revealing the assembly history of the nearest S0 galaxy NGC 3115",
      "authors": [
        "Haoran Dou",
        "Hao Li",
        "Hongxin Zhang",
        "Heng Yu",
        "Huiyuan Wang"
      ],
      "abstract": "Mass stratification in the globular cluster system revealing the assembly history of the nearest S0 galaxy NGC 3115 Haoran Dou, Hao Li, Hongxin Zhang, Heng Yu, Huiyuan Wang 21 pages, 14 figures, accepted by ApJ Astrophysics of Galaxies (astro-ph.GA) Galaxy formation and evolution is hierarchical. The most massive galaxies are thought to form their central regions early through violent dissipational processes, then grow inside-out by accreting smaller satellites. While widely supported, direct observational confirmation of this process in individual galaxies remains lacking, except for the Milky Way. We present a detailed analysis of globular cluster (GC) candidates within a $70^\\prime$ ($\\sim190$ kpc) radius around the nearest S0 galaxy, NGC 3115, using images in \\textit{g,r,z} bands from the DESI Legacy Imaging Surveys and data from Gaia. We report the discovery of mass stratification in the GC system (GCS), evident in two ways: first, the effective radius of the GCS increases monotonically from the bright to faint end, up to the detection limit near the turnover magnitude of the GC luminosity function (GCLF); second, the GCLF shows fainter turnover magnitudes and smaller standard deviations at larger galactocentric radii. This stratification cannot be readily explained by radial migration or tidal dissolution, but most likely reflects the hierarchical assembly of NGC 3115's stellar halo, with later-accreted satellites deposited across broader galactocentric distances. This interpretation is supported by cosmological simulations of subhalos with comparable mass and bulge-to-total mass ratios and is consistent with the negative color gradients observed in the GCS. Additionally, we identify several substructures within the GCS, indicating ongoing assembly of NGC 3115. This work highlights the power of GCS as tracers of galaxy assembly and sets the stage for upcoming space-based wide-field imaging surveys to constrain the assembly of massive galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2509.21975.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22083",
      "title": "High-redshift Merger-induced Bar-like Galaxies in IllustrisTNG",
      "authors": [
        "Ewa L. Lokas"
      ],
      "abstract": "High-redshift Merger-induced Bar-like Galaxies in IllustrisTNG Ewa L. Lokas 8 pages, 4 figures, 1 table, accepted for publication in ApJ Letters Astrophysics of Galaxies (astro-ph.GA) Recent discoveries made with JWST observations include a significant number of barred galaxies at high redshift. Their origin remains unclear and their presence seems difficult to reproduce in cosmological simulations of galaxy formation and evolution. In this Letter I present four examples of high-redshift bars selected from a sample of bar-like galaxies studied previously using IllustrisTNG simulations. All the galaxies formed their bars at redshifts z > 3 via mergers with smaller satellites, although one had its bar formed even earlier, at z > 5. The bars were born long, with lengths on the order of 3 kpc, and grew in time. Three of the four galaxies were later accreted by clusters and underwent multiple interactions with their respective brightest cluster galaxies. Their bar strength was to some extent affected by these interactions but all the galaxies preserved their bar-like shape until the present time. By the end of the evolution, all the galaxies lost their gas and stopped forming stars, they retained essentially no disk component and were no longer rotationally supported. The examples demonstrate that high-z bars do not evolve into present-day barred disk galaxies similar to the Milky Way but rather into S0s or ellipticals typically found in galaxy clusters.",
      "pdf_url": "https://arxiv.org/pdf/2509.22083.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22165",
      "title": "Photometric Redshift Forecast for 7-Dimensional Sky Survey",
      "authors": [
        "Eunhee Ko",
        "Myungshin Im"
      ],
      "abstract": "Photometric Redshift Forecast for 7-Dimensional Sky Survey Eunhee Ko, Myungshin Im 25 pages, 11 figures, Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We investigate the expected accuracy of redshifts that can be obtained using low-resolution spectroscopic (medium-band) data from the 7-Dimensional Sky Survey (7DS). By leveraging 40 densely sampled filters with widths of full width at half maximum (FWHM) = 25 nm, we create 7DS mock catalogs and estimate the redshift accuracy for three 7DS main surveys: Wide-field Time-Domain Survey (WTS), Intensive Monitoring Survey (IMS), and Reference Image Survey (RIS). Using photometric redshifts calculated from EAZY, we find that the five-year WTS provides reliable photometric redshifts with an normalized median absolute deviation (${\\sigma}_{\\text{NMAD}}$) ranging from 0.003 to 0.007 and a catastrophic failure fraction ({\\eta}) from 0.8% to 8.1% at $19 \\leq m_{625}$ < 22$. The spectral resolution R ~ 50 of the medium-band dataset effectively captures the 4000 Å break and various emission lines. We also explore the synergy with data obtained from Pan-STARRS1, VIKING, and SPHEREx surveys. Combining the SPHEREx all-sky data with WTS significantly improves the accuracy of photometric redshift estimates, achieving {\\eta} = 0.4% and ${\\sigma}_{\\text{NMAD}}$ = 0.004 for fainter sources at higher redshifts. The additional near-IR information provided by SPHEREx and VIKING plays an essential role in resolving degeneracies between low and high redshifts. We also observe color excesses by subtracting adjacent broad-band data, which improves the confinement of photometric redshifts and aids in the detection of strong emission line galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2509.22165.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22203",
      "title": "Investigating solid-state CH3OH formation with chemical modelling",
      "authors": [
        "K.-Y. Huang",
        "E. Méndez-Robayo",
        "S. Viti",
        "Mario -A. Higuera -G"
      ],
      "abstract": "Investigating solid-state CH3OH formation with chemical modelling K.-Y. Huang, E. Méndez-Robayo, S. Viti, Mario -A. Higuera -G Astrophysics of Galaxies (astro-ph.GA) Context. Recent Monte Carlo simulations and laboratory studies of interstellar ices have proposed an alternative pathway involving the radical-molecule H-atom abstraction reaction in the overall mechanism of methanol (CH3OH) formation in dark molecular clouds. Aims. A computational study was conducted to investigate the contribution of the radical-molecule H-atom abstraction route in CH3OH formation in interstellar ices, both in non-shocked and shocked environments, and to examine how the physical conditions of the interstellar medium (ISM) affect the overall CH3OH synthesis pathway. Methods. A set of chemical models were ran using the gas-grain chemical code UCLCHEM to systematically explore methanol synthesis in various physical scenarios, including non-shock and low- and high-velocity C-shocks. Results. This work demonstrated for the first time that, under non-shock and shocked-influenced environments, the primary reaction leading to the formation of methanol in the inner layers of interstellar ices is indeed the radical-molecule H-atom abstraction route. However, such route is dependent on the gas kinetic temperature (Tk), gas volume density (nH2 ), velocity of the C-shock wave (vshock), and cosmic ray ionisation rate ({\\zeta}). Furthermore, gaseous formaldehyde may trace C-type shocks and serve to differentiate methanol formation pathways in low-velocity C-shocked environments, as its abundance varies more significantly than that of CH3OH with the inclusion of the H-atom abstraction reaction in UCLCHEM. The H2CO/CH3OH ratio thus represents a potential diagnostic tool for this purpose.",
      "pdf_url": "https://arxiv.org/pdf/2509.22203.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22311",
      "title": "Galaxy Zoo: Cosmic Dawn -- morphological classifications for over 41,000 galaxies in the Euclid Deep Field North from the Hawaii Two-0 Cosmic Dawn survey",
      "authors": [
        "James Pearson",
        "Hugh Dickinson",
        "Stephen Serjeant",
        "Mike Walmsley",
        "Lucy Fortson",
        "Sandor Kruk",
        "Karen L. Masters",
        "Brooke D. Simmons",
        "R. J. Smethurst",
        "Chris Lintott",
        "Lukas Zalesky",
        "Conor McPartland",
        "John R. Weaver",
        "Sune Toft",
        "Dave Sanders",
        "Nima Chartab",
        "Henry Joy McCracken",
        "Bahram Mobasher",
        "Istvan Szapudi",
        "Noah East",
        "Wynne Turner",
        "Matthew Malkan",
        "William J. Pearson",
        "Tomotsugu Goto",
        "Nagisa Oi"
      ],
      "abstract": "Galaxy Zoo: Cosmic Dawn -- morphological classifications for over 41,000 galaxies in the Euclid Deep Field North from the Hawaii Two-0 Cosmic Dawn survey James Pearson, Hugh Dickinson, Stephen Serjeant, Mike Walmsley, Lucy Fortson, Sandor Kruk, Karen L. Masters, Brooke D. Simmons, R. J. Smethurst, Chris Lintott, Lukas Zalesky, Conor McPartland, John R. Weaver, Sune Toft, Dave Sanders, Nima Chartab, Henry Joy McCracken, Bahram Mobasher, Istvan Szapudi, Noah East, Wynne Turner, Matthew Malkan, William J. Pearson, Tomotsugu Goto, Nagisa Oi 23 pages; 21 figures; 3 tables; submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present morphological classifications of over 41,000 galaxies out to $z_{\\rm phot}\\sim2.5$ across six square degrees of the Euclid Deep Field North (EDFN) from the Hawaii Twenty Square Degree (H20) survey, a part of the wider Cosmic Dawn survey. Galaxy Zoo citizen scientists play a crucial role in the examination of large astronomical data sets through crowdsourced data mining of extragalactic imaging. This iteration, Galaxy Zoo: Cosmic Dawn (GZCD), saw tens of thousands of volunteers and the deep learning foundation model Zoobot collectively classify objects in ultra-deep multiband Hyper Suprime-Cam (HSC) imaging down to a depth of $m_{HSC-i} = 21.5$. Here, we present the details and general analysis of this iteration, including the use of Zoobot in an active learning cycle to improve both model performance and volunteer experience, as well as the discovery of 51 new gravitational lenses in the EDFN. We also announce the public data release of the classifications for over 45,000 subjects, including more than 41,000 galaxies (median $z_{\\rm phot}$ of $0.42\\pm0.23$), along with their associated image cutouts. This data set provides a valuable opportunity for follow-up imaging of objects in the EDFN as well as acting as a truth set for training deep learning models for application to ground-based surveys like that of the newly operational Vera C. Rubin Observatory.",
      "pdf_url": "https://arxiv.org/pdf/2509.22311.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22370",
      "title": "Searching for Corannulene with ALMA: Observations of the Red Rectangle Nebula",
      "authors": [
        "Elise Koo",
        "Alessandra Candian",
        "Michiel Hogerheijde",
        "Lizette Guzman-Ramirez",
        "Javier Alcolea",
        "Valentin Bujarrabal",
        "Jan Cami",
        "Pierre Cox",
        "Peter Sarre"
      ],
      "abstract": "Searching for Corannulene with ALMA: Observations of the Red Rectangle Nebula Elise Koo, Alessandra Candian, Michiel Hogerheijde, Lizette Guzman-Ramirez, Javier Alcolea, Valentin Bujarrabal, Jan Cami, Pierre Cox, Peter Sarre 12 pages including appendices, 8 figures. Submitted to MNRAS, 1st revision Astrophysics of Galaxies (astro-ph.GA); Chemical Physics (physics.chem-ph) Polycyclic Aromatic Hydrocarbons (PAHs) are organic molecules responsible for the Aromatic Infrared Bands (AIBs), observed across a multitude of astrophysical environments. Despite their ubiquity, the precise formation mechanisms of PAHs remain unclear. One of the possible way for PAHs to form is in the outflows of evolved stars, such as HD 44179, which produces the Red Rectangle nebula - a known emitter of AIBs. However, no specific PAH molecules have been detected in such environments, complicating the understanding of PAH formation and evolution. This study aimed to detect the PAH molecule corannulene C20H10, a viable candidate for radio detection due to its large dipole moment of 2.07D. We analyzed high-resolution band 4 ALMA observations of the Red Rectangle nebula, collected over almost 9 hrs. Although corannulene emission was not detected, we estimated a firm upper limit on its abundance compared to hydrogen (5x10^-13) and we discuss the lack of detection in the context of our current understanding of PAH formation and destruction mechanisms. Additionally, we report tentative detection of signals at 139.612 GHz, 139.617 GHz, and 139.621 GHz, potentially originating from cyclopropenyledine c-C3H2 and the 140 GHz H2O maser.",
      "pdf_url": "https://arxiv.org/pdf/2509.22370.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22427",
      "title": "The Diamond Ring in Cygnus X: Advanced stage of an expanding bubble of ionised carbon",
      "authors": [
        "Simon M. Dannhauer",
        "Sebastian Vider",
        "Nicola Schneider",
        "Robert Simon",
        "Fernando Comeron",
        "Eduard Keilmann",
        "Stefanie Walch",
        "Lars Bonne",
        "Slawa Kabanovic",
        "Volker Ossenkopf-Okada",
        "Daniel Seifried",
        "Timea Csengeri",
        "Amanda Djupvik",
        "Yan Gong",
        "Andreas Brunthaler",
        "Michael Rugel",
        "Dominik A. Riechers",
        "Sylvain Bontemps",
        "Netty Honingh",
        "Urs U. Graf",
        "A.G.G.M. Tielens"
      ],
      "abstract": "The Diamond Ring in Cygnus X: Advanced stage of an expanding bubble of ionised carbon Simon M. Dannhauer, Sebastian Vider, Nicola Schneider, Robert Simon, Fernando Comeron, Eduard Keilmann, Stefanie Walch, Lars Bonne, Slawa Kabanovic, Volker Ossenkopf-Okada, Daniel Seifried, Timea Csengeri, Amanda Djupvik, Yan Gong, Andreas Brunthaler, Michael Rugel, Dominik A. Riechers, Sylvain Bontemps, Netty Honingh, Urs U. Graf, A.G.G.M. Tielens 14 pages, 12 figures, accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The \"Diamond Ring\" in Cygnus X, southwest of the DR21 ridge, is a nearly circular structure of $\\sim$6 pc in diameter, prominent in FIR emission and enclosed by clumpy molecular clouds traced in CO. It hosts an HII region, visible in cm emission, and resembles a classical expanding HII bubble routinely seen in the 158 $\\mu$m [CII] line. However, SOFIA FEEDBACK observations in the spectrally resolved [CII] line reveal instead a slightly tilted ring of $\\sim$10$^3$ M$_\\odot$ expanding slowly at $\\sim$1.3 km s$^{-1}$, with a bulk line-of-sight (LOS) velocity near $-2$ km s$^{-1}$. The central \"Diamond\" is an unrelated dense clump at $\\sim$7 km s$^{-1}$. The driving source, classified from IR spectroscopy, is a B0.5e star that powers the HII region. Unlike typical 3D shells, this marks the first case where we detect only a slowly expanding CII ring. We suggest the HII region and CII bubble, initially formed by a massive star, expanded outward from a flat slab of molecular gas nearly in the plane of the sky. The ring is now confined by swept-up material of the slab, while shell components moving perpendicular to the LOS have dissipated, leading to a reduction in expansion. Dedicated simulations tracing the evolution of the CII bubble support this geometry, consistent with previous reports of HII region evolution in flat molecular clouds. We propose that the \"Diamond Ring\" represents the terminal phase of an expanding CII bubble driven by stellar winds and thermal pressure.",
      "pdf_url": "https://arxiv.org/pdf/2509.22427.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22523",
      "title": "SDSS-C4 3028: The Nearest Blue Galaxy Cluster Devoid of an Intracluster Medium",
      "authors": [
        "Shweta Jain",
        "Yuanyuan Su",
        "Andra Stroe",
        "Paul Nulsen",
        "Hyejeon Cho",
        "Kim HyeongHan",
        "M. James Jee",
        "Ralph P. Kraft",
        "Scott Randall",
        "Jimmy A. Irwin",
        "Ryan L. Sanders",
        "Christine Jones"
      ],
      "abstract": "SDSS-C4 3028: The Nearest Blue Galaxy Cluster Devoid of an Intracluster Medium Shweta Jain, Yuanyuan Su, Andra Stroe, Paul Nulsen, Hyejeon Cho, Kim HyeongHan, M. James Jee, Ralph P. Kraft, Scott Randall, Jimmy A. Irwin, Ryan L. Sanders, Christine Jones 14 pages, 10 figures, Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) SDSS-C4 3028 is a galaxy cluster at $z=0.061$, notable for its unusually high fraction of star-forming galaxies with 19 star-forming and 11 quiescent spectroscopically-confirmed member galaxies. From Subaru/HSC imaging, we derived a weak lensing mass of $M_{200} = (1.3 \\pm 0.9) \\times 10^{14} \\rm M_\\odot$, indicating a low-mass cluster. This is in excellent agreement with its dynamical mass of $M_{200} = (1.0\\pm0.4)\\times10^{14} \\rm M_\\odot$, derived from SDSS spectroscopic data. XMM-Newton observations reveal that its X-ray emission is uniform and fully consistent with the astrophysical X-ray background, with no evidence for an intracluster medium (ICM). The 3$\\sigma$ upper limit of $L_{\\rm X}(0.1-2.4\\rm keV)=7.7\\times10^{42}$ erg s$^{-1}$ on the cluster's X-ray luminosity falls below the value expected from the $L_{\\rm X}-M_{\\rm halo}$ scaling relation of nearby galaxy clusters. We derived star-formation histories for its member galaxies using the photometric spectral energy distribution from SDSS, 2MASS, and WISE data. Most of its quiescent galaxies reside within the central 300 kpc, while star-forming ones dominate the outer region (300 kpc - 1 Mpc). The core region has formed the bulk of its stellar mass approximately 1.5 Gyr earlier than the outskirts. We infer a long quenching time of $>3$ Gyr for its quiescent galaxies, consistent with slow quenching mechanisms such as galaxy-galaxy interaction or strangulation. These findings suggest that SDSS-C4 3028 may have undergone an \"inside-out\" formation and quenching process. Its ICM may have been expelled by intense AGN feedback after core formation but before full cluster assembly. The high fraction ($\\sim$0.63) of star-forming members likely results from the absence of ram pressure stripping in this blue cluster, supporting the important role of ram pressure stripping in quenching galaxies in clusters.",
      "pdf_url": "https://arxiv.org/pdf/2509.22523.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22555",
      "title": "Tomographic Distance Measurements to the Smith Cloud with SDSS-V Milky Way Mapper3",
      "authors": [
        "Timothy McQuaid",
        "Joseph N. Burchett",
        "Kate H. R. Rubin",
        "Felix J. Lockman",
        "Andrew K. Saydjari",
        "Philipp Richter",
        "Andrew J. Fox",
        "David L. Nidever",
        "Jose G. Fernandez-Trincado",
        "Jon A. Holtzman"
      ],
      "abstract": "Tomographic Distance Measurements to the Smith Cloud with SDSS-V Milky Way Mapper3 Timothy McQuaid, Joseph N. Burchett, Kate H. R. Rubin, Felix J. Lockman, Andrew K. Saydjari, Philipp Richter, Andrew J. Fox, David L. Nidever, Jose G. Fernandez-Trincado, Jon A. Holtzman Astrophysics of Galaxies (astro-ph.GA) High velocity clouds supply the Milky Way with gas that sustains star formation over cosmic timescales. Precise distance measurements are therefore essential to quantify their mass inflow rates and gauge their exact contribution to the Galaxy's gas supply. We use a sample of 1,293 SDSS-V BOSS stellar spectra within 10 degrees of the high-velocity Smith Cloud (SC) to trace Na I absorption and dust extinction as functions of distance. By fitting ISM-corrected MaStar templates to each spectrum, we isolate residual equivalent widths and extinction then compare trends in the SC region to a same-latitude control field. Stars beyond 1 kpc toward the SC exhibit a significant Na I equivalent width excess ($>$0.1 Angstroms, $>$3sigma) relative to the control. Joint fits of Na I equivalent width and Av against both low and high-velocity H I column densities show that the low-velocity component is strongly correlated with both quantities, while the high-velocity term is marginally significant in extinction and consistent with zero in Na I, consistent with a patchy, low dust-to-gas ratio. Given that the excess Na I begins at distances $<2$ kpc uniquely in the direction of the Cloud, and previous estimates of the SC place it at 12.4 $\\pm$ 1.3 kpc, further investigation of its distance is warranted.",
      "pdf_url": "https://arxiv.org/pdf/2509.22555.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21408",
      "title": "Upper Limit on the Non-Gravitational Acceleration and Lower Limits on the Nucleus Mass and Diameter of 3I/ATLAS",
      "authors": [
        "Richard Cloete",
        "Abraham Loeb",
        "Peter Vereš"
      ],
      "abstract": "Upper Limit on the Non-Gravitational Acceleration and Lower Limits on the Nucleus Mass and Diameter of 3I/ATLAS Richard Cloete, Abraham Loeb, Peter Vereš Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We use astrometric data on 3I/ATLAS compiled by the Minor Planet Center from May 15 to September 23, 2025, and derive an upper limit on any statistically significant deviation from the best-fit gravity-based trajectory. The residuals imply that the non-gravitational acceleration is smaller than $\\sim 3 \\times 10^{-10}\\,{\\rm au\\,d^{-2}}$. Based on the total mass-loss rate and outflow speed inferred from JWST data on August 6, 2025, we derive lower limits on the mass and diameter of 3I/ATLAS of $3.3 \\times 10^{16}\\,{\\rm g}$ and $5\\,{\\rm km}$, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2509.21408.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21643",
      "title": "A nearly pristine star from the Large Magellanic Cloud",
      "authors": [
        "Alexander P. Ji",
        "Vedant Chandra",
        "Selenna Mejias-Torres",
        "Zhongyuan Zhang",
        "Philipp Eitner",
        "Kevin C. Schlaufman",
        "Hillary Diane Andales",
        "Ha Do",
        "Natalie M. Orrantia",
        "Rithika Tudmilla",
        "Pierre N. Thibodeaux",
        "Keivan G. Stassun",
        "Madeline Howell",
        "Jamie Tayar",
        "Maria Bergemann",
        "Andrew R. Casey",
        "Jennifer A. Johnson",
        "Joleen K. Carlberg",
        "William Cerny",
        "Jose G. Fernandez-Trincado",
        "Keith Hawkins",
        "Juna A. Kollmeier",
        "Chervin F. P. Laporte",
        "Guilherme Limberg",
        "Tadafumi Matsuno",
        "Szabolcs Meszaros",
        "Sean Morrison",
        "David L. Nidever",
        "Guy S. Stringfellow",
        "Donald P. Schneider",
        "Riley Thai"
      ],
      "abstract": "A nearly pristine star from the Large Magellanic Cloud Alexander P. Ji, Vedant Chandra, Selenna Mejias-Torres, Zhongyuan Zhang, Philipp Eitner, Kevin C. Schlaufman, Hillary Diane Andales, Ha Do, Natalie M. Orrantia, Rithika Tudmilla, Pierre N. Thibodeaux, Keivan G. Stassun, Madeline Howell, Jamie Tayar, Maria Bergemann, Andrew R. Casey, Jennifer A. Johnson, Joleen K. Carlberg, William Cerny, Jose G. Fernandez-Trincado, Keith Hawkins, Juna A. Kollmeier, Chervin F. P. Laporte, Guilherme Limberg, Tadafumi Matsuno, Szabolcs Meszaros, Sean Morrison, David L. Nidever, Guy S. Stringfellow, Donald P. Schneider, Riley Thai 18 pages, 9 figures, 1 table, submitted Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The first stars formed out of pristine gas, causing them to be so massive that none are expected to have survived until today. If their direct descendants were sufficiently low-mass stars, they could exist today and would be recognizable by having the lowest metallicity (abundance of elements heavier than helium). The lowest metallicity star currently known is a star in the thick disk of the Milky Way with total metallicity Z < 1.4 x 10^-6 (log Z/Zsun < -4.0). While other stars with lower iron abundance have been discovered, they have high carbon abundances and thus higher total metallicities (log Z/Zsun > -3). Here we present the discovery and detailed chemical analysis of the most metal-poor star yet found: the red giant star SDSS J0715-7334 with ultra-low abundances of both iron and carbon ([Fe/H]=-4.3, [C/Fe]<-0.2), resulting in total metallicity Z < 7.8 x 10^-7 (log Z/Zsun < -4.3). This star has the most pristine composition of any object known in the universe. The star's orbit indicates that it originates from the halo of the Large Magellanic Cloud. Its detailed chemical composition implies a supernova progenitor with initial mass of 30 solar masses. Current models of low-mass star formation can explain the existence of SDSS J0715-7334 only if dust cooling was already able to operate at the time of its formation. SDSS J0715-7334 is over ten times more metal-poor than the most metal-poor high-redshift galaxies found by the James Webb Space Telescope, some of which have been claimed to be potentially metal-free. Substantially deeper observations of high-redshift galaxies would be needed to prove that they are truly pristine galaxies made of metal-free stars and not metal-enriched galaxies composed of second-generation stars like SDSS J0715-7334.",
      "pdf_url": "https://arxiv.org/pdf/2509.21643.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21784",
      "title": "Helium-burning blue large-amplitude pulsators: A Population Study with BPASS",
      "authors": [
        "Zhengyang Zhang",
        "Conor M. Byrne",
        "Chengyuan Wu",
        "Bo Wang"
      ],
      "abstract": "Helium-burning blue large-amplitude pulsators: A Population Study with BPASS Zhengyang Zhang, Conor M. Byrne, Chengyuan Wu, Bo Wang 18 pages, 10 figures, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Blue Large-Amplitude Pulsators (BLAPs) are a class of radially pulsating stars with effective temperatures ranging from 20,000 to 35,000 K and pulsation periods between 7 and 75 minutes. This study utilizes the Binary Population and Spectral Synthesis (BPASS) code to investigate helium-burning stars as a formation channel for BLAPs in the Milky Way. The progenitor stars have initial masses of 3-6 $M_{\\odot}$, resulting in BLAPs with final masses of 0.5-1.2 $M_{\\odot}$. Based on a constant star formation rate of 3 $ M_{\\odot}\\text{yr}^{-1}$ and solar metallicity (Z = 0.020), population synthesis predicts approximately 14,351 helium-burning BLAPs in the Milky Way: 12,799 with Main Sequence (MS) companions and 1,551 with evolved/compact-object companions. Helium-burning BLAPs show prolonged lifetimes in the pulsation region and a narrow stellar age range for entering this regime (log(t/yr) = 8.0-8.6), unlike pre-white dwarf models. BLAPs with MS companions typically form via Roche lobe overflow, leading to longer orbital periods ($\\sim$100 days). Those with evolved/compact-object companions form through common envelope evolution, resulting in shorter periods. While Galactic extinction makes most BLAPs faint (apparent magnitudes $>$ 25), future surveys like WFST and VRO LSST are expected to detect approximately 500-900. This research establishes helium-burning stars as a significant BLAP contributor and offers testable predictions regarding their binary properties and Galactic distribution.",
      "pdf_url": "https://arxiv.org/pdf/2509.21784.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22164",
      "title": "Vector Resonant Relaxation and Statistical Closure Theory. II. One-loop Closure",
      "authors": [
        "Sofia Flores",
        "Jean-Baptiste Fouvry"
      ],
      "abstract": "Vector Resonant Relaxation and Statistical Closure Theory. II. One-loop Closure Sofia Flores, Jean-Baptiste Fouvry 26 pages, 16 figures, submitted to APS Statistical Mechanics (cond-mat.stat-mech); Astrophysics of Galaxies (astro-ph.GA) We use stellar dynamics as a testbed for statistical closure theory. We focus on the process of \"Vector Resonant Relaxation,\" a long-range, non-linear, and correlated relaxation mechanism that drives the reorientation of stellar orbital planes around a supermassive black hole. This process provides a natural setting to evaluate the predictive power of generic statistical closure schemes for dynamical correlation functions, in the fully non-linear and non-perturbative regime. We develop a numerical scheme that explicitly implements the seminal \"Martin-Siggia-Rose\" formalism at one-loop order via an iterative fixed-point approach, thereby improving upon the bare order from the \"Direct Interaction Approximation.\" Using this framework, we quantitatively validate the ability of the formalism to predict (i) the two-point two-time correlation function; (ii) the renormalised three-point interaction vertex; (iii) the three-point three-time correlation function. These predictions are compared to direct measurements from numerical simulations. We conclude by discussing the limitations of this approach and presenting possible future venues.",
      "pdf_url": "https://arxiv.org/pdf/2509.22164.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22336",
      "title": "First direct detection of an RR Lyrae star conclusively associated with an intermediate-age cluster",
      "authors": [
        "Cecilia Mateu , Bolivia Cuevas-Otahola , Juan José Downes UdelaR, Uruguay BUAP, México)"
      ],
      "abstract": "First direct detection of an RR Lyrae star conclusively associated with an intermediate-age cluster Cecilia Mateu (1), Bolivia Cuevas-Otahola (2), Juan José Downes (3) ((1) UdelaR, Uruguay (2) BUAP, México) Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) RR Lyrae stars have long been considered unequivocal tracers of old (>10 Gyr) and metal-poor ($\\mathrm{[Fe/H]}<-0.5$) stellar populations. First, because these populations are where they are readily found and because, according to canonical stellar evolution models for isolated stars, these are the only populations where RR Lyrae should exist. Recent independent results, however, are challenging this view and pointing at the existence of intermediate-age RR Lyrae, only a few (2--5) Gyrs old. Our goal in this work is to provide direct evidence of the existence of intermediate-age RR Lyrae by searching for these stars in Milky Way open clusters, where the age association will be direct and robust. We searched over 3,000 open clusters with published kinematically associated member stars from the Hunt & Reffert database by crossmatching against a compilation of the largest publicly available RR Lyrae surveys (\\Gaia, ASAS-SN, PanStarrs1, Zwicky Transient Factory and OGLE-IV). We identified a star as a bona fide RR~Lyrae variable and robust member of the 2--4 Gyr old Trumpler 5 cluster, based on its parallax and proper motions and their agreement with confirmed cluster members. We derived an extremely low probability ($0.049\\pm 0.013$%) that the star is a background field RR~Lyrae and provide initial constraints on a possible binary companion based on its position in the colour-absolute magnitude diagram. Currently a source of debate, the Trumpler~5 RR Lyrae provides the most direct evidence to date of the existence of RR Lyrae stars at much younger ages than traditionally expected and adds to the mounting evidence supporting their existence.",
      "pdf_url": "https://arxiv.org/pdf/2509.22336.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22605",
      "title": "High Proper Motion Discoveries from the UKIRT Hemisphere Survey",
      "authors": [
        "Wings Zhang",
        "Adam C. Schneider",
        "Thomas P. Bickle",
        "Adam J. Burgasser",
        "Emma Softich",
        "Federico Marocco",
        "Daniella Bardalez Gagliuffi",
        "Jacqueline K. Faherty",
        "Aaron M. Meisner",
        "J. Davy Kirkpatrick",
        "Marc J. Kuchner",
        "Martin Kabatnik",
        "Frank Kiwy",
        "Arttu Sainio",
        "Jörg Schümann",
        "Karl Selg-Mann",
        "Nikolaj Stevnbak Andersen",
        "Bruce Baller",
        "Paul Beaulieu",
        "John Bell",
        "Dan Caselden",
        "Guillaume Colin",
        "Alexandru Dereveanco",
        "Christoph Frank",
        "Konstantin Glebov",
        "Léopold Gramaize",
        "Leslie K. Hamlet",
        "David W. Martin",
        "William Pendrill",
        "Stéphane Perlin",
        "Andres Stenner",
        "Christopher Tanner",
        "Melina Thévenot",
        "Vinod Thakur",
        "Nikolaj Stevnbak Andersen"
      ],
      "abstract": "High Proper Motion Discoveries from the UKIRT Hemisphere Survey Wings Zhang, Adam C. Schneider, Thomas P. Bickle, Adam J. Burgasser, Emma Softich, Federico Marocco, Daniella Bardalez Gagliuffi, Jacqueline K. Faherty, Aaron M. Meisner, J. Davy Kirkpatrick, Marc J. Kuchner, Martin Kabatnik, Frank Kiwy, Arttu Sainio, Jörg Schümann, Karl Selg-Mann, Nikolaj Stevnbak Andersen, Bruce Baller, Paul Beaulieu, John Bell, Dan Caselden, Guillaume Colin, Alexandru Dereveanco, Christoph Frank, Konstantin Glebov, Léopold Gramaize, Leslie K. Hamlet, David W. Martin, William Pendrill, Stéphane Perlin, Andres Stenner, Christopher Tanner, Melina Thévenot, Vinod Thakur, Nikolaj Stevnbak Andersen Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We used the third data release of the UKIRT Hemisphere Survey to locate previously unrecognized high proper motion objects. We identify a total of 127 new discoveries with total proper motions $\\gtrsim$300 mas yr$^{-1}$. A significant fraction of these sources with counterparts in the Gaia DR3 catalog are found to be distant ($>$100 pc) low-mass stars, where their large tangential velocities and placement on color-magnitude diagrams suggest that they are likely low-metallicity M-type subdwarfs. Optical spectroscopy is used to confirm the low-mass and low-metallicity for two such sources. Using available optical and infrared photometry, we estimate the spectral type for all non-Gaia sources and find 10 likely late-M dwarfs, 15 objects with colors most consistent with L-type dwarfs, and 9 possible T-type dwarfs. Follow-up spectroscopy is needed to confirm spectral types and further characterize these new discoveries.",
      "pdf_url": "https://arxiv.org/pdf/2509.22605.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.14682",
      "title": "Extreme Neutral Outflow in a non-AGN Quiescent Galaxy at z$\\sim$1.3",
      "authors": [
        "Yang Sun",
        "Zhiyuan Ji",
        "George H. Rieke",
        "Francesco D'Eugenio",
        "Yongda Zhu",
        "Fengwu Sun",
        "Xiaojing Lin",
        "Andrew J. Bunker",
        "Jianwei Lyu",
        "Pierluigi Rinaldi",
        "Christopher N. A. Willmer"
      ],
      "abstract": "Extreme Neutral Outflow in a non-AGN Quiescent Galaxy at z$\\sim$1.3 Yang Sun, Zhiyuan Ji, George H. Rieke, Francesco D'Eugenio, Yongda Zhu, Fengwu Sun, Xiaojing Lin, Andrew J. Bunker, Jianwei Lyu, Pierluigi Rinaldi, Christopher N. A. Willmer 24 pages, 12 figure, submitted to ApJ, comments are welcome Astrophysics of Galaxies (astro-ph.GA) We have discovered a substantial sodium doublet (Na D $\\lambda\\lambda$5890, 5896Å)-traced neutral outflow in a quiescent galaxy JADES-GS-206183 at $z=1.317$ in GOODS-S field. Its JWST NIRSpec/MSA spectrum shows a significantly blueshifted and deep Na D absorption, revealing a neutral outflow with a velocity of $v_{\\rm out}=828^{+79}_{-49}\\,\\mathrm{km\\,s^{-1}}$ and a mass outflow rate of $\\log(\\dot{M}_{\\rm out}/\\mathrm{M_{\\odot}\\,yr^{-1}})=2.40^{+0.11}_{-0.16}$. This outflow rate exceeds that of any neutral outflows identified beyond $z\\sim1$ by the same line diagnostic and is comparable with those in local galaxies with intensive star formation or luminous AGN. Nonetheless, the Paschen $\\alpha$ (Pa$\\alpha$) emission in the FRESCO NIRCam grism confirms that its star formation rate is low ($\\mathrm{SFR_{Pa\\alpha}}=10.78\\pm 0.55\\,\\mathrm{M_{\\odot}\\,yr^{-1}}$), corresponding to a low specific SFR of -10.2 $\\mathrm{yr^{-1}}$, 0.5 dex below the main sequence. The best-fit SED modeling based on its multi-band photometry from HST/ACS to JWST/NIRCam and the VLT/MUSE spectrum, suggests this galaxy has experienced a quiescent period lasting about one Gyr or more while seems to rejuvenate within the recent 10 Myr. Surprisingly, rest-frame optical lines indicate that the current AGN activity of JADES-GS-206183, if present, is also weak. Even though we tentatively detect a broad component of the H$\\alpha$ line, it is more likely tracing the ionized outflow than an AGN. The results demonstrate that the Na D outflow in JADES-GS-206183 is highly unlikely to be driven by current star formation or nuclear activity. Instead, we propose that this outflow may be a long-lasting fossil one driven by past AGN activity, potentially co-triggered with the early phase of rejuvenation.",
      "pdf_url": "https://arxiv.org/pdf/2504.14682.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.17639",
      "title": "Hot Diggity Dog: Simultaneous CO and Dust Modeling of the Most Luminous WISE Hot Dust-Obscured Galaxy Unveils Extreme Molecular Gas Excitation",
      "authors": [
        "Kevin C. Harrington",
        "Román Fernández Aranda",
        "Leindert Boogaard",
        "Axel Weiß",
        "Tanio Diaz Santos",
        "Manuel Aravena",
        "Roberto J. Assef",
        "Chao-Wei Tsai",
        "Peter Eisenhardt",
        "Daniel Stern"
      ],
      "abstract": "Hot Diggity Dog: Simultaneous CO and Dust Modeling of the Most Luminous WISE Hot Dust-Obscured Galaxy Unveils Extreme Molecular Gas Excitation Kevin C. Harrington, Román Fernández Aranda, Leindert Boogaard, Axel Weiß, Tanio Diaz Santos, Manuel Aravena, Roberto J. Assef, Chao-Wei Tsai, Peter Eisenhardt, Daniel Stern Accepted by A&A. 7 pages, 4 Appendix pages, 6 figures Astrophysics of Galaxies (astro-ph.GA) Hot dust-obscured galaxies (Hot DOGs), the most infrared (IR) luminous objects selected by the WISE all-sky mid-IR survey, have yielded a sample of intrinsically luminous quasars (QSOs) with obscured nuclear activity and hot dust temperatures. The molecular gas excitation properties have yet to be examined in detail under such extreme conditions. Here we study the most far-IR luminous \\textit{WISE} Hot DOG W2246-0526, focusing on ALMA observations of the central host galaxy. Multi-J CO transition measurements at J=2-1, 5-4, 7-6, 12-11, and 17-16 provide the first self-consistent modeling constraints on the molecular gas and dust properties of any WISE Hot DOG to date, providing a benchmark for future studies of dust-obscured QSOs. We implement a state-of-the-art TUrbulent Non-Equilibrium Radiative transfer model (TUNER) that simultaneously models both the line and dust continuum measurements. The extreme CO spectral line energy distribution seems to turnover around the CO(12-11) transition, likely making this among the most highly excited galaxies ever reported. The model infers a molecular gas mass $\\sim 8\\times10^{10}$\\,\\Msun, and we conclude that J$\\ge$3 CO line luminosities trace the bulk of the molecular gas mass for this extreme system unlike low-excitation conditions calibrated locally. W2246-0526 is a rapidly evolving system, with a high mean value of the molecular gas kinetic temperature versus dust temperature $T_\\mathrm{k}$ / $T_\\mathrm{d} \\sim 4.3$. This may be due to the shocks and outflows injecting kinetic energy within the central kpc of this host that have previously been reported. These signs of highly excited molecular gas in W2246-0526 motivates obtaining well-sampled CO ladders in larger samples to better understand the conditions within these short-lived episodes associated with the most obscured supermassive black hole activity.",
      "pdf_url": "https://arxiv.org/pdf/2504.17639.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.03132",
      "title": "A Fuzzy Situation Eased: Cold Dark Matter with Multipoles Can Explain The Double Radio Quad Lens HS 0810+2554",
      "authors": [
        "John H. Miller Jr",
        "Liliya L. R. Williams"
      ],
      "abstract": "A Fuzzy Situation Eased: Cold Dark Matter with Multipoles Can Explain The Double Radio Quad Lens HS 0810+2554 John H. Miller Jr, Liliya L. R. Williams Astrophysics of Galaxies (astro-ph.GA) Originally observed in isophotal density contours of elliptical galaxies, higher order perturbations in the form of Fourier modes, or multipoles, are becoming increasingly recognized as necessary to account for angular mass complexity in strong lensing analyses. When smooth, elliptical CDM mass models fail, multipoles often emerge as solutions. With the discovery of two radio jets in the source quasar, the strong gravitational lens HS 0810+2554 can no longer be well fit by elliptical mass models, suggesting perturbations on small-scales. In this paper, we investigate the efficacy of multipoles $m=1$ (lopsidedness), $m=3$ (triangleness), and $m=4$ (boxiness and diskiness) in addressing the image positional anomalies of the two radio quads of HS 0810+2554. Due to the exact pairing and arrival sequence of the images being unknown, we consider all feasible image configurations. With 64 unique best-fit models, we achieve a fit of $\\chi=1.59$ ($\\chi^2=2.53$), with $m=1,3,4$ multipole strengths of 0.9%, 0.4%, and 0.6%, respectively, with images in the reverse time ordering. Elliptical+shear models from previous works find $\\chi\\!\\sim\\!7\\!-\\!10$, for comparison. With the morphological (i.e., standard) arrival sequence, we achieve a fit of $\\chi=2.95$ with two images being assigned to opposite sources. Therefore, CDM mass models with mass complexity in the form of multipoles are able to adequately explain the positional anomalies in HS 0810+2554. Alternative dark matter theories, like fuzzy dark matter, need not be invoked.",
      "pdf_url": "https://arxiv.org/pdf/2506.03132.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.04310",
      "title": "Fast Rotators at Cosmic Noon: Stellar Kinematics for 15 Quiescent Galaxies from JWST-SUSPENSE",
      "authors": [
        "Martje Slob",
        "Mariska Kriek",
        "Anna de Graaff",
        "Chloe M. Cheng",
        "Aliza G. Beverage",
        "Rachel Bezanson",
        "Natascha M. Forster Schreiber",
        "Brian Lorenz",
        "Pavel E. Mancera Piña",
        "Danilo Marchesini",
        "Adam Muzzin",
        "Andrew B. Newman",
        "Sedona H. Price",
        "Katherine A. Suess",
        "Jesse van de Sande",
        "Pieter van Dokkum",
        "Daniel R. Weisz"
      ],
      "abstract": "Fast Rotators at Cosmic Noon: Stellar Kinematics for 15 Quiescent Galaxies from JWST-SUSPENSE Martje Slob, Mariska Kriek, Anna de Graaff, Chloe M. Cheng, Aliza G. Beverage, Rachel Bezanson, Natascha M. Forster Schreiber, Brian Lorenz, Pavel E. Mancera Piña, Danilo Marchesini, Adam Muzzin, Andrew B. Newman, Sedona H. Price, Katherine A. Suess, Jesse van de Sande, Pieter van Dokkum, Daniel R. Weisz Accepted in A&A; 15 pages, 10 figures (excluding appendices) Astrophysics of Galaxies (astro-ph.GA) We present spatially-resolved stellar kinematics of 15 massive ($M_*=10^{10.5-11.5}M_{\\odot}$) quiescent galaxies at $z\\sim1.2-2.3$ from the JWST-SUSPENSE program. This is the largest sample of spatially-resolved kinematic measurements of quiescent galaxies at cosmic noon to date. Our measurements are derived from ultra-deep NIRSpec/MSA stellar absorption line spectra, using a forward modelling approach that accounts for optics, source morphology, positioning, and data reduction effects. 10 out of 15 galaxies are orientated such that we can measure rotational support. Remarkably, all 10 galaxies show significant rotation ($V_{r_e}=117-345$km/s, $\\sigma_0 = 180-387$km/s), and are classified as \"fast rotators\" from their spin parameter. The remaining galaxies are too misaligned with respect to the slit to constrain their rotational velocities. The widespread rotational support in our sample indicates that the process responsible for quenching star formation in early massive galaxies did not destroy rotating disc structures. When combined with other quiescent galaxy samples at $z\\sim0.5-2.5$, we find a trend between rotational support and age, with younger quiescent galaxies being more rotationally supported. This age trend has also been found at $z\\sim0$, and likely explains why our high-redshift galaxies show more rotational support compared to massive ETGs at $z\\sim0$, which are, on average, older. Our kinematic modelling also enables us to calculate dynamical masses. These dynamical masses greatly exceed the stellar masses for our sample (median $M_{\\text{dyn}}/M_*=2.7$); they even allow for the bottom-heavy IMF found in the cores of low-$z$ massive ellipticals. Altogether, our results support a scenario in which distant quiescent galaxies evolve into nearby massive ETGs, gradually building up their outskirts and simultaneously losing rotation, due to a series of (mostly minor) mergers.",
      "pdf_url": "https://arxiv.org/pdf/2506.04310.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.21576",
      "title": "Tracing the Origins of Hot Halo Gas in Milky Way-Type Galaxies with SMUGGLE",
      "authors": [
        "Zhijie Zhang",
        "Xiaoxia Zhang",
        "Hui Li",
        "Taotao Fang",
        "Yang Luo",
        "Federico Marinacci",
        "Laura V. Sales",
        "Paul Torrey",
        "Mark Vogelsberger",
        "Qingzheng Yu",
        "Feng Yuan"
      ],
      "abstract": "Tracing the Origins of Hot Halo Gas in Milky Way-Type Galaxies with SMUGGLE Zhijie Zhang, Xiaoxia Zhang, Hui Li, Taotao Fang, Yang Luo, Federico Marinacci, Laura V. Sales, Paul Torrey, Mark Vogelsberger, Qingzheng Yu, Feng Yuan Astrophysics of Galaxies (astro-ph.GA) Current galaxy formation models predict the existence of X-ray-emitting gaseous halos around Milky Way (MW)-type galaxies. To investigate properties of this coronal gas in MW-like galaxies, we analyze a suite of high-resolution simulations based on the SMUGGLE framework and compare the results with X-ray observations of both the MW and external galaxies. We find that for subgrid models incorporating any form of stellar feedback, e.g., early feedback (including stellar winds and radiation) and/or supernova (SN) explosions, the total 0.5-2 keV luminosity is consistent within uncertainties with X-ray observations of the MW and with scaling relations derived for external disk galaxies. However, all models exhibit an X-ray surface brightness profile that declines too steeply beyond $\\sim5$ kpc, underpredicting the extended emission seen in recent eROSITA stacking results. Across all subgrid prescriptions, the simulated surface brightness and emission measure fall below MW observations by at least 1-2 orders of magnitude, with the most severe discrepancy occurring in the no-feedback model. Our results suggest that (i) stellar feedback primarily shapes the innermost hot atmosphere (central $\\sim5$ kpc), with comparable contributions from early feedback and SNe to the resulting X-ray luminosity; (ii) additional mechanisms such as gravitational heating, active galactic nuclei feedback, and/or Compton effects of GeV cosmic ray are necessary to generate the extended, volume-filling hot gaseous halo of MW-mass galaxies; (iii) the origins of hot corona in MW-like galaxies are partially distinct from those of the warm ($\\sim10^5$ K) gas, by combining our previous finding that the SMUGGLE model successfully reproduces the kinematics and spatial distribution of MW O VI absorbers.",
      "pdf_url": "https://arxiv.org/pdf/2508.21576.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07913",
      "title": "Disclosing Submillimeter Galaxy Formation: Mergers or Secular Evolution?",
      "authors": [
        "Siu-Wang Chan",
        "Yiping Ao",
        "Qinghua Tan"
      ],
      "abstract": "Disclosing Submillimeter Galaxy Formation: Mergers or Secular Evolution? Siu-Wang Chan, Yiping Ao, Qinghua Tan Astrophysics of Galaxies (astro-ph.GA) We analyze the morphology of 125 submillimeter galaxies (SMGs) in the PRIMER-COSMOS field using double Sersic modeling on JWST NIRCam images across six bands (F150W, F200W, F277W, F356W, F410M and F444W), with SMGs being classified by bulge Sersic index (n_bulge) and bulge-to-total luminosity ratio (B/T). The Kolmogorov-Smirnov test between the bright (SFR > 175 M_sun yr^{-1}) and the faint group (SFR < 175 M_sun yr^{-1}) reveals no significant statistical differences in morphology across bands. However, we notice that SMGs skew towards higher B/T ratios and lower n_bulge from shorter to longer wavelengths. In F444W, bright SMGs exhibit higher B/T and lower n_bulge, indicating flatter, disturbed bulges, while faint SMGs show lower B/T and higher n_bulge. Notably, SMGs with higher B/T tend to have low Sersic index, challenging the local universe dichotomy of classical bulges (B/T > 0.5, n > 4) versus pseudo-bulges (B/T < 0.35, n < 2). In the F277W band, non-parametric measurements indicate predominantly disk-dominated patterns, with only 24 percent of SMGs demonstrating merger signatures. After the removal of SMGs with disturbed morphology, the bulge classification scheme in F277W shows pseudo-bulges (21 percent) and clump migration bulges (16 percent) from secular evolution, compared to 4 percent merger-built bulges. Surprisingly, 48 percent of SMGs defy the classification scheme, showing high B/T (approximately 0.7) but low Sersic index (n_bulge <= 1). Bars are confirmed in 7 percent of SMGs. This work suggests that secular evolution takes precedence over major mergers, supporting the idea that isolated evolution fueled by filamentary gas inflow plays a non-negligible role in the SMG bulge formation.",
      "pdf_url": "https://arxiv.org/pdf/2509.07913.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.10615",
      "title": "The Discovery of a Large Active Wind from the Milky Way's Central Black Hole",
      "authors": [
        "Mark D. Gorski",
        "Elena Murchikova"
      ],
      "abstract": "The Discovery of a Large Active Wind from the Milky Way's Central Black Hole Mark D. Gorski, Elena Murchikova 21 pages, 3 main figures, 4 supplemental figures Astrophysics of Galaxies (astro-ph.GA) Every large galaxy has a black hole in its center. The interaction between the black hole and their host profoundly shapes galactic evolution and the Universe as a whole. The key feature of this interaction are black hole jets - or more generally winds - which every black hole must have. Despite our Galaxy's central black hole, Sagittarius A* (Sgr A*), proximity and importance, the active wind from it has eluded scientists for over half a century. Here we report the discovery of a large active wind from Sgr A* using unprecedentedly deep observations with the Atacama Large Millimeter/Submillimeter Array (ALMA). We detect a large conical clearing in the cold molecular gas surrounding Sgr A* that is at least 1 parsec in length and has a 45-degree opening angle. The morphology and energetics of this structure are consistent with active clearing by a hot wind from Sgr A*. This finding resolves the long-standing mystery of the missing wind from Sgr A*, and delivers the most detailed look yet of black hole feeding and feedback processes in our Galactic center.",
      "pdf_url": "https://arxiv.org/pdf/2509.10615.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.21034",
      "title": "Innovative SiC ultraviolet instrumentation development with potential applications for the Habitable Worlds Observatory",
      "authors": [
        "Prabal Saxena",
        "Zeynep Dilli",
        "Peter Snapp",
        "Tilak Hewagama",
        "Shahid Aslam",
        "Chullhee Cho",
        "Augustyn Waczynski",
        "Nader Abuhassan",
        "Anh T. La",
        "Bryan K. Place",
        "Allison Youngblood",
        "Thomas F. Hanisco",
        "Ryan Stauffer",
        "Dina Bower",
        "Akin Akturk",
        "Neil Goldsman",
        "Bryce Galey",
        "Ethan Mountfort",
        "Mitchell Gross",
        "Ryan Purcell",
        "Usama Khalid",
        "Yekta Kamali",
        "Chris Darmody",
        "Robert Washington",
        "Tim Livengood",
        "Daniel P. Moriarty",
        "Roser Juanola-Parramon",
        "Carl A. Kotecki",
        "Narasimha S. Prasad",
        "Joseph Wilkins"
      ],
      "abstract": "Innovative SiC ultraviolet instrumentation development with potential applications for the Habitable Worlds Observatory Prabal Saxena, Zeynep Dilli, Peter Snapp, Tilak Hewagama, Shahid Aslam, Chullhee Cho, Augustyn Waczynski, Nader Abuhassan, Anh T. La, Bryan K. Place, Allison Youngblood, Thomas F. Hanisco, Ryan Stauffer, Dina Bower, Akin Akturk, Neil Goldsman, Bryce Galey, Ethan Mountfort, Mitchell Gross, Ryan Purcell, Usama Khalid, Yekta Kamali, Chris Darmody, Robert Washington, Tim Livengood, Daniel P. Moriarty, Roser Juanola-Parramon, Carl A. Kotecki, Narasimha S. Prasad, Joseph Wilkins 10 figures, 1 table Modified version published in JATIS special on HWO J. Astron. Telesc. Instrum. Syst. 11(4) 042225 (24 September 2025) Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) In this paper, we detail recent and current work that is being carried out to fabricate and advance novel SiC UV instrumentation that is aimed at enabling more sensitive measurements across numerous disciplines, with a short discussion of the promise such detectors may hold for the Habitable Worlds Observatory. We discuss SiC instrument development progress that is being carried out under multiple NASA grants, including several PICASSO and SBIR grants, as well as an ECI grant. Testing of pixel design, properties and layout as well as maturation of the integration scheme developed through these efforts provide key technology and engineering advancement for potential HWO detectors. Achieving desired noise characteristics, responsivity, and validating operation of SiC detectors using standard read out techniques offers a compelling platform for operation of denser and higher dimensionality SiC photodiode arrays of interest for use in potential HWO Coronagraph, Spectrograph, and High Resolution Imaging Instruments. We incorporate these SiC detector properties into a simulation of potential NUV exoplanet observations by HWO using SiC detectors and also discuss potential application to HWO.",
      "pdf_url": "https://arxiv.org/pdf/2412.21034.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21452",
      "title": "Dynamical Pathways to the Misalignment of the VHS 1256-1257 System",
      "authors": [
        "Liz Holzknecht",
        "Smadar Naoz",
        "Cheyanne Shariat"
      ],
      "abstract": "Dynamical Pathways to the Misalignment of the VHS 1256-1257 System Liz Holzknecht, Smadar Naoz, Cheyanne Shariat Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Circumbinary planets (CBPs) provide a unique window into planet formation and dynamical evolution in complex gravitational environments. Their orbits are shaped not only by the protoplanetary disk but also by the perturbations from two stellar hosts, making them sensitive probes of both early- and late-stage dynamical processes. In this work, we investigate the unusual architecture of the VHS J125601.92-125723.9 system, where a retrograde, nearly polar tertiary orbits an extremely low-mass substellar binary in a hierarchical triple configuration. We find that triple body dynamics can naturally reproduce the observed high eccentricity of the inner binary and the tertiary's near-polar obliquity. However, this configuration alone cannot account for the observed mutual inclination, which is both near-polar and retrograde. This tension suggests two possible formation pathways: either the planet formed in an aligned, protoplanetary disk-like configuration and was later tilted by an additional, undetected fourth companion (below current Gaia limits), or the system formed close to its current state. Stellar flybys, in contrast, are unlikely due to their long timescales. Our results highlight both the explanatory power and the limitations of triple dynamics, and the potential role of hidden companions in shaping extreme planetary architectures.",
      "pdf_url": "https://arxiv.org/pdf/2509.21452.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21505",
      "title": "Characterizing Temperatures of Flares on the M Dwarf Wolf 359 from Simultaneous Multiband Optical Observations",
      "authors": [
        "Chia-Lung Lin",
        "Li-Ching Huang",
        "Wei-Jie Hou",
        "Hsiang-Yao Hsiao",
        "Wing-Huen Ip"
      ],
      "abstract": "Characterizing Temperatures of Flares on the M Dwarf Wolf 359 from Simultaneous Multiband Optical Observations Chia-Lung Lin, Li-Ching Huang, Wei-Jie Hou, Hsiang-Yao Hsiao, Wing-Huen Ip 30 pages, 9 figures, and 7 tables Solar and Stellar Astrophysics (astro-ph.SR) We present a flare temperature study of the highly active M~dwarf Wolf~359 using simultaneous multiband ($u$, $g$, $r$, $i$, and $z$) photometric observations from the Lulin 1-m and 41-cm telescopes. Twelve flares were detected over five nights, with significant brightness increases in the $u$, $g$, and $r$~bands; only three were seen in $i$, and none in $z$. From broadband SED fitting and $g$/$r$ color ratio, we derive an average flare temperature of $5500 \\pm 1600$~K, significantly cooler than the canonical 10000~K. We obtained a power-law relation between FWHM flare temperature and energy in the solar-class flare regime and extrapolated it to higher energies, superflare regime. This power-law is consistent with the trends reported for M-dwarf superflares in previous studies, suggesting a common temperature-energy scaling across several orders of magnitude. However, the scatter in the superflare regime increases, indicating that such energetic events may involve more complex physical mechanisms and limiting the applicability of simple blackbody models at the high energy flares. Using our FWHM flare temperature--TRIPOL~$g$ energy relation and the reported flare energy frequency distribution of Wolf~359, we evaluated the potential flare contribution to photosynthetically active radiation (PAR) in the habitable zone. We find that typical solar-class giant flares ($E_{\\mathrm{fl,bol}} \\sim 9\\times10^{31}$~erg, $T_{\\mathrm{fl,fwhm}} \\sim 6800$~K) are {not frequent enough} to sustain Earth-like net primary productivity. Even under the extreme superflare condition ($\\sim$$10^{36}$~erg, $\\sim$16500~K), flare activity remains far from meeting the PAR threshold.",
      "pdf_url": "https://arxiv.org/pdf/2509.21505.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21517",
      "title": "The EBLM project XVI. Spin-orbit alignment of the low mass eclipsing binary EBLM J0021-16",
      "authors": [
        "Becca Spejcher",
        "David V. Martin",
        "Jake Pandina",
        "Andy Zhang",
        "Max Ammons",
        "Wata Thubthong",
        "Amaury Triaud",
        "Ritika Sethi",
        "Noah Vowell",
        "Adrian Barker",
        "Pierre Maxted",
        "Alison Duck",
        "Shelby Summers",
        "François Bouchy",
        "Monika Lendl",
        "Maxime Marmier",
        "Malte Tewes",
        "Stéphane Udry"
      ],
      "abstract": "The EBLM project XVI. Spin-orbit alignment of the low mass eclipsing binary EBLM J0021-16 Becca Spejcher, David V. Martin, Jake Pandina, Andy Zhang, Max Ammons, Wata Thubthong, Amaury Triaud, Ritika Sethi, Noah Vowell, Adrian Barker, Pierre Maxted, Alison Duck, Shelby Summers, François Bouchy, Monika Lendl, Maxime Marmier, Malte Tewes, Stéphane Udry Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Thousands of tight ($<1$ AU) main sequence binaries have been discovered, but it is uncertain how they formed. There is likely too much angular momentum in a collapsing, fragmenting protostellar cloud to form such binaries in situ, suggesting some post processing. One probe of a binary's dynamical history is the angle between the stellar spin and orbital axes -- its obliquity. The classical method for determining stellar obliquity is the Rossiter-McLaughlin effect. It has been applied to over 100 hot Jupiters, but to less than a dozen stellar binaries. In this paper, we present the Rossiter-McLaughlin measurement of EBLM J0021-16, a $0.19M_\\odot$ M-dwarf eclipsing a $1.05M_\\odot$ G-dwarf on a 5.97 day, almost-circular orbit. We combine CORALIE spectroscopy with TESS photometry of primary and secondary eclipses and star spot modulation. We show that the orbital axis is well-aligned with the primary star's spin axis, with a true 3D obliquity of $\\psi=4.01\\pm0.54^{\\circ}$. EBLM J0021-16 becomes one of only a handful of eclipsing binaries where a true obliquity has been measured. Finally, we derive the M-dwarf's mass and radius to a fractional precision better than 1\\%. The radius of the M dwarf is inflated by 6\\% ($7.4\\sigma$) with respect to stellar models, consistent with many other M-dwarfs in the literature.",
      "pdf_url": "https://arxiv.org/pdf/2509.21517.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21521",
      "title": "HR6819: a puffed-up stripped star system challenging stable mass transfer theory",
      "authors": [
        "A. Picco",
        "P. Marchant",
        "H. Sana",
        "J. Bodensteiner",
        "T. Shenar",
        "A. J. Frost",
        "K. Deshmukh",
        "J. S. G. Mombarg",
        "D. Pauli",
        "R. Willcox",
        "A. Kemp"
      ],
      "abstract": "HR6819: a puffed-up stripped star system challenging stable mass transfer theory A. Picco, P. Marchant, H. Sana, J. Bodensteiner, T. Shenar, A. J. Frost, K. Deshmukh, J. S. G. Mombarg, D. Pauli, R. Willcox, A. Kemp 9 pages, 7 figures. Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) HR6819 is the first system with a puffed-up low mass stripped star and a classical Be star whose nature has been confirmed by optical interferometry. It shows the most extreme mass ratio (15.7 +/- 1.1), the lowest stripped star mass (0.270 +/- 0.056 Msun), and one of the shortest orbital periods (40.3266 +/- 0.0016 days) among similar post-interaction binaries. These properties make HR6819 a unique test case for binary interaction physics, in particular the efficiency of mass transfer onto the Be progenitor required to reach such an extreme mass ratio. We reconstruct the possible evolutionary history of the system with grids of MESA simulations spanning mass transfer efficiencies from fully to fifty percent conservative. We show that stable Roche lobe overflow cannot simultaneously reproduce the observed orbital period and extreme mass ratio: the maximum ratio achievable is ~11.5 at ~40 days, even in the fully conservative case. Furthermore, the observed luminosities of both components exceed those expected from their model masses; the luminosity of the stripped star would be consistent with a ~0.7 Msun mass, over twice its dynamical mass. Our results demonstrate that the post-interaction properties of HR6819 cannot be explained by stable mass transfer under standard assumptions.",
      "pdf_url": "https://arxiv.org/pdf/2509.21521.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21610",
      "title": "Visualizing the mass transfer flow in direct-impact accretion",
      "authors": [
        "Juhan Frank",
        "Alexander Straub",
        "Sagiv Shiber",
        "Parsa Amini",
        "Dominic C. Marcello",
        "Patrick Diehl",
        "Thomas Ertl",
        "Filip Sadlo",
        "Steffen Frey"
      ],
      "abstract": "Visualizing the mass transfer flow in direct-impact accretion Juhan Frank, Alexander Straub, Sagiv Shiber, Parsa Amini, Dominic C. Marcello, Patrick Diehl, Thomas Ertl, Filip Sadlo, Steffen Frey Solar and Stellar Astrophysics (astro-ph.SR) We use a variety of visualization techniques to display the interior and surface flows in a double white dwarf binary undergoing direct-impact mass transfer and evolving dynamically to a merger. The structure of the flow can be interpreted in terms of standard dynamical, cyclostrophic and geostrophic arguments. We describe and showcase some visualization and analysis techniques of potential interest for astrophysical hydrodynamics. In the context of R Coronae Borealis stars, we find that mixing of accretor material with donor material at the shear layer between the fast accretion belt and the slower rotating accretor body will always result in some dredge-up. We also discuss briefly some potential applications to other types of binaries.",
      "pdf_url": "https://arxiv.org/pdf/2509.21610.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21717",
      "title": "MESA Isochrones and Stellar Tracks (MIST) III. The White Dwarf Cooling Sequence",
      "authors": [
        "Evan B. Bauer",
        "Aaron Dotter",
        "Charlie Conroy",
        "Tim Cunningham",
        "Minjung Park",
        "Pier-Emmanuel Tremblay"
      ],
      "abstract": "MESA Isochrones and Stellar Tracks (MIST) III. The White Dwarf Cooling Sequence Evan B. Bauer, Aaron Dotter, Charlie Conroy, Tim Cunningham, Minjung Park, Pier-Emmanuel Tremblay 13 pages, 10 figures, accepted for publication in ApJS. White dwarf cooling data files available at this https URL Solar and Stellar Astrophysics (astro-ph.SR) We present a substantial update to the MESA Isochrones and Stellar Tracks (MIST) library, extending the MIST model grids and isochrones down the white dwarf (WD) cooling sequence with realistic physics for WD cooling timescales. This work provides a large grid of MESA models for carbon-oxygen core WDs with hydrogen atmospheres (spectral type DA/DC), descended from full prior stellar evolution calculations. The model tracks, isochrones, and WD cooling timescale contours are available on the MIST project website and at this https URL. Our WD models provide a very large, publicly available grid with detailed physics for WD cooling timescales: realistic interior and envelope compositions, with element diffusion and heavy-element sedimentation, nuclear burning at the base of the WD hydrogen envelope, core crystallization, and C/O phase separation. As a large grid of open-source stellar evolution models, these WD models provide both out-of-the-box model tracks for comparison with observations and a framework for building further WD models to investigate variations in WD physics.",
      "pdf_url": "https://arxiv.org/pdf/2509.21717.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22127",
      "title": "Low-mass companions to nine stars",
      "authors": [
        "Andrzej Niedzielski",
        "Robert Jaros",
        "Divyansh Srivastava",
        "Monika Adamów",
        "Aleksander Wolszczan",
        "Eva Villaver",
        "Gracjan Maciejewski",
        "Beata Deka-Szymankiewicz"
      ],
      "abstract": "Low-mass companions to nine stars Andrzej Niedzielski, Robert Jaros, Divyansh Srivastava, Monika Adamów, Aleksander Wolszczan, Eva Villaver, Gracjan Maciejewski, Beata Deka-Szymankiewicz Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) We present an independent spectroscopic and radial velocity analysis for nine stars from the Pennsylvania-Toruń Planet Search. For BD+24 4697, we present an updated true companion's mass (0.16$\\pm$0.02 \\, M$_{\\odot}$), as well as evidence of stellar activity. For BD+54 1640 and BD+65 1241 we present true masses of companions, $m = 0.15 \\pm 0.04\\,M_\\odot$ and $m = 0.091 \\pm 0.005\\,M_\\odot$, respectively. For BD+63 974 and BD+69 935 we find low mass companions with $m \\sin i = 0.046 \\pm 0.001\\,M_\\odot$ and $m \\sin i = 0.090 \\pm 0.005\\,M_\\odot$. For BD+52 1281, BD+54 1382, TYC 2704-2680-1, and TYC 3525-02043-1 we present evidence of low-mass companions with $m \\sin i$ of 0.115 $\\pm 0.006\\,M_\\odot$, 0.083 $\\pm 0.007\\,M_\\odot$, 0.279 $\\pm 0.009\\,M_\\odot$, and $0.064 \\pm 0.006\\,M_\\odot$, respectively. Consequently, BD+54 1382, BD+63 974, BD+65 1241, BD+69 935 and TYC 3525-02043-1 appear to be Brown Dwarf host candidates.",
      "pdf_url": "https://arxiv.org/pdf/2509.22127.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22265",
      "title": "Particle Acceleration and Transport in the Large-scale Current Sheet under an Erupting Magnetic Flux Rope",
      "authors": [
        "Hao Wu",
        "Yang Guo",
        "Rony Keppens",
        "Chun Xia",
        "Yang Su",
        "Xiangliang Kong",
        "Mingde Ding"
      ],
      "abstract": "Particle Acceleration and Transport in the Large-scale Current Sheet under an Erupting Magnetic Flux Rope Hao Wu, Yang Guo, Rony Keppens, Chun Xia, Yang Su, Xiangliang Kong, Mingde Ding Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) We investigate the acceleration and transport of electrons in the highly fine-structured current sheet that develops during magnetic flux rope (MFR) eruptions. Our work combines ultra-resolved MHD simulations of MFR eruption, with test-particle studies performed using the guiding center approximation. Our grid-adaptive, fully three-dimensional, high-resolution magnetohydrodynamic simulations model MFR eruptions that form complex current sheet topologies, serving as background electromagnetic fields for particle acceleration. Within the current sheet, tearing-mode instabilities give rise to mini flux ropes. Electrons become temporarily trapped within these elongated structures, undergoing acceleration and transport processes that significantly differ from those observed in two-dimensional or two-and-a-half-dimensional simulations. Our findings reveal that these fine-scale structures act as efficient particle accelerators, surpassing the acceleration efficiency of single X-line reconnection events, and are capable of energizing electrons to energies exceeding 100 keV. High-energy electrons accelerated in different mini flux ropes follow distinct trajectories due to spatially varying magnetic field connectivity, ultimately precipitating onto opposite sides of flare ribbons. Remarkably, double electron sources at the flare ribbons originate from different small flux rope acceleration regions, rather than from the same reconnecting field line as previously suggested. Distinct small flux ropes possess opposite magnetic helicity to accelerate electrons to source regions with different magnetic polarities, establishing a novel conjugate double source configuration. Furthermore, electrons escaping from the lower regions exhibit a broken power-law energy spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2509.22265.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21348",
      "title": "Asymptotics of spherical dynamos exhibiting a small-scale MAC balance",
      "authors": [
        "Justin A. Nicoski",
        "Andy Esseln",
        "Chris Davies",
        "Michael A. Calkins"
      ],
      "abstract": "Asymptotics of spherical dynamos exhibiting a small-scale MAC balance Justin A. Nicoski, Andy Esseln, Chris Davies, Michael A. Calkins Geophysics (physics.geo-ph); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Understanding the asymptotic behaviour of numerical dynamo models is critical for extrapolating results to the physical conditions that characterise terrestrial planetary cores. Here we investigate the behaviour of convection-driven dynamos reaching a MAC (magnetic-Archimedes-Coriolis) balance on the convective length scale and compare the results with non-magnetic convection cases. In particular, the dependence of physical quantities on the Ekman number, $Ek$, is studied in detail. The scaling of velocity dependent quantities is observed to be independent of the force balance and in agreement with quasi-geostrophic theory. The primary difference between dynamo and non-magnetic cases is that the fluctuating temperature is order unity in the former such that the buoyancy force scales with the Coriolis force. The MAC state yields a scaling for the flow speeds that is identical to the so-called CIA (Coriolis-inertia-Archimedes) scaling. There is an $O(Ek^{1/3})$ length scale present within the velocity field irrespective of the leading order force balance. This length scale is consistent with the asymptotic scaling of the terms of the governing equations and is not an indication that viscosity plays a dominant role. The peak of the kinetic energy spectrum and the ohmic dissipation length scale both exhibit an Ekman number dependence of approximately $Ek^{1/6}$, which is consistent with a scaling of $Rm^{-1/2}$, where $Rm$ is the magnetic Reynolds number. For the dynamos, advection remains comparable to, and scales similarly with, both inertia and viscosity, implying that nonlinear convective Rossby waves play an important role in the dynamics even in a MAC regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.21348.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21407",
      "title": "Debris disks and their properties with the Habitable Worlds Observatory",
      "authors": [
        "Isabel Rebollido",
        "Yasuhiro Hasegawa",
        "Meredith MacGregor",
        "Bin Ren",
        "Mark Booth",
        "Jonathan Marshall",
        "Courtney Dressing",
        "Patricia Luppe"
      ],
      "abstract": "Debris disks and their properties with the Habitable Worlds Observatory Isabel Rebollido, Yasuhiro Hasegawa, Meredith MacGregor, Bin Ren, Mark Booth, Jonathan Marshall, Courtney Dressing, Patricia Luppe Part of the HWO Solar Systems in Context working group Endorsers: Narsireddy Anugu, Nicholas Ballering, Aarynn Carter, Gianni Cataldi, Miguel Chavez Dagostino, Denis Defrère, Vincent Esposito, Ryan Fortenberry, Luca Fossati, Eunjeong Lee, Briley Lewis, Briley Lewis, Meredith MacGregor, Stanimir Metchev, Patricio Reller, Pablo Santos-Sanz, Antranik Sefilian, Sarah Steiger, Schuyler Wolff Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) The study of the last stages of planet formation, also known as debris disks, is fundamental to place constrains on the formation of planetary sized bodies. Debris disks are composed of dust and occasionally small amounts of gas, both released through dynamical interactions of small rocky bodies and dust particles, such as collisions and evaporation. The distribution of the dust can reveal the presence of forming planets and its composition can directly trace that of comets, asteroids and even planets. While we have been observing debris disks for 40 years now, most observations so far have been restricted to the cold outer regions of the system, and therefore information of the terrestrial zone is still missing. The improved spatial resolution, inner working angle and sensitivity that the Habitable Worlds Observatory will provide will enable a much closer look into the structure and composition of debris disks (particularly of its inner region) and enable the search for the forming rocky planets within the disk.",
      "pdf_url": "https://arxiv.org/pdf/2509.21407.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21430",
      "title": "The stability of propagating plane inertial waves in rotating fluids",
      "authors": [
        "Valentin Skoutnev",
        "Aurélie Astoul",
        "Adrian J. Barker"
      ],
      "abstract": "The stability of propagating plane inertial waves in rotating fluids Valentin Skoutnev, Aurélie Astoul, Adrian J. Barker Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR); Fluid Dynamics (physics.flu-dyn) Inertial waves transport energy and momentum in rotating fluids and are a major contributor to mixing and tidal dissipation in Earth's oceans, gaseous planets, and stellar interiors. However, their stability and breakdown mechanisms are not fully understood. We examine the linear stability and nonlinear breakdown of finite-amplitude propagating plane inertial waves using Floquet theory and direct numerical simulations. The Floquet analysis generalizes previous studies as it is valid for arbitrary perturbation wavelengths and primary wave amplitudes. We find that the wavenumber orientation of the most unstable perturbations depends strongly on the wave frequency and weakly on the wave amplitude. The most unstable perturbations have wavelengths that are small relative to the primary wave wavelength for low wave amplitudes, but become comparable for large wave amplitudes. We then use direct numerical simulations to follow the nonlinear breakdown of the wave and examine how the wave energy is either dissipated in a forward cascade or accumulated into long-lived geostrophic modes. Simulations reveal that the conversion efficiency into geostrophic modes increases with increasing wave amplitude, as expected for pumping of geostrophic modes by nearly-resonant triadic interactions. We also find that the conversion efficiency increases with decreasing primary wave frequency, which may be due to the more efficient coupling of quasi-2D waves to geostrophic modes. These results on the stability and breakdown of single plane inertial waves provides additional foundation for understanding the role of inertial waves in rotating turbulence, transport properties of inertial wave beams, and inertial wave propagation in more complex environments such as those with magnetic fields or shear flows.",
      "pdf_url": "https://arxiv.org/pdf/2509.21430.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21506",
      "title": "Electrostatic waves in astrophysical Druyvesteyn plasmas: I. Langmuir waves",
      "authors": [
        "Simon Tischmann",
        "Rudi Gaelzer",
        "Dustin Schröder",
        "Marian Lazar",
        "Horst Fichtner"
      ],
      "abstract": "Electrostatic waves in astrophysical Druyvesteyn plasmas: I. Langmuir waves Simon Tischmann, Rudi Gaelzer, Dustin Schröder, Marian Lazar, Horst Fichtner Plasma Physics (physics.plasm-ph); Solar and Stellar Astrophysics (astro-ph.SR) Plasmas in various astrophysical systems are in non-equilibrium states as evidenced by direct in-situ measurements in the solar wind, solar corona and planetary environments as well as by indirect observations of various sources of waves and emissions. Specific are non-Maxwellian velocity distributions with suprathermal tails, for whose description the most-used are the Kappa (power-law) distributions. With this paper we introduce a modeling alternative for linear waves in plasmas described by another non-equilibrium model, namely the generalized Druyvesteyn distribution. This can reproduce not only the high-energy tails, but also the low-energy flat-tops of velocity distributions, like those of electrons associated with the Earth's bow shock and interplanetary shocks or of electrons in the solar transition region. We derive the corresponding dispersion relation for longitudinal waves in terms of the newly introduced Druyvsteyn dispersion function, numerically compute, for the isotropic case, the dispersion curves as well as damping rates, and provide analytical approximation in the limit of weak damping. Thereby, we provide a new modeling tool that facilitates the quantitative treatment of a variety of non-Maxwellian plasmas.",
      "pdf_url": "https://arxiv.org/pdf/2509.21506.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21627",
      "title": "Extreme Geomagnetic Storm on Early Earth Induced by Corotating Interaction Regions from the Young Sun",
      "authors": [
        "Dibyendu Sur",
        "Vladimir S. Airapetian"
      ],
      "abstract": "Extreme Geomagnetic Storm on Early Earth Induced by Corotating Interaction Regions from the Young Sun Dibyendu Sur, Vladimir S. Airapetian Accepted by Astrophysical Journal, 22 pages, 11 figures Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Recent multiwavelength observations of young solar analogs suggest that the young Sun in the first 600 Myr was a magnetically active star that produced an X-ray and Extreme-UV (EUV) bright corona, fast, massive stellar wind, and energetic eruptive events. These outputs affected magnetospheric environments of early Earth and young rocky exoplanets. The interaction of the fast solar wind with the slow wind produced strong shocks from Corotating Interaction Regions (CIRs) that provided high dynamic pressure on the magnetospheres of early Venus, Earth, and Mars. Here, we apply the Space Weather Modeling Framework (SWMF), coupled with the Rice Convection Model (RCM) to simulate the response of the magnetospheric environments and associated Joule heating deposited in the upper atmosphere of early Earth as it passed through a CIR shock from the young Sun. The model suggests ~ 40% closer dayside magnetopause standoff distance, and higher negative SYMH, Cross Polar Cap Potentials (CPCP), atmospheric Joule heating, Field Aligned Currents (FAC), electron precipitations, and equatorward polar cap expansions, comparable or exceeding those of recent intense and super geomagnetic storms. The magnetic storm produces dawn-dusk asymmetries in the polar cap boundary arising from the stellar magnetic field By. The proton density enhancements during the CIR event are the dominant factor in the overall dynamic pressure for resulting electron precipitation and Joule heating deposited into the Earth's ionosphere. We discuss implications for the magnetospheric states and associated habitability conditions on early Earth and young rocky exoplanets around magnetically active solar-like stars.",
      "pdf_url": "https://arxiv.org/pdf/2509.21627.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22301",
      "title": "Starshades as technosignatures in direct imaging phase curves: Application to the Habitable Worlds Observatory targets",
      "authors": [
        "Claudia I. Skoglund",
        "Alexander J. Mustill"
      ],
      "abstract": "Starshades as technosignatures in direct imaging phase curves: Application to the Habitable Worlds Observatory targets Claudia I. Skoglund, Alexander J. Mustill Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) A star's luminosity increases as it evolves along the Main Sequence (MS), which inevitably results in a higher surface temperature for planets in orbit around the star. Technologically advanced civilizations may tackle this issue by installing artificial structures -- starshades -- which can reduce the radiation received by the planet. Starshades, if they exist, are potentially detectable with current or near-future technology. We have simulated phase curve signatures in direct imaging of hypothetical starshades in systems targeted by the upcoming Habitable Worlds Observatory (HWO), which will be tasked with searching for Earth-like exoplanets orbiting nearby stars. The starshade is assumed to be a circular, reflecting surface placed at the inner Lagrange point between the star and the planet. Our results show that the phase curve of a starshade has a distinct shape compared to that of a typical planet. The phase curve signature lies above the expected $1\\sigma=10^{-11}$ single-visit precision in contrast ratio of the telescope for 70.8% of the target stars for the expected inner working angle (IWA) of around 60 mas. If the IWA can be reduced to 45 mas, the percentage of stars above the $1\\sigma$ limit increases to 96.7%. With a sufficiently small IWA, HWO should be able to detect anomalies in light curves caused by starshades or similar highly-reflective surfaces -- which could serve as key indicators for technologically advanced civilizations.",
      "pdf_url": "https://arxiv.org/pdf/2509.22301.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22348",
      "title": "Engaging and Educating Eclipse Observers Through Workshops, Media, Planetarium shows and Citizen Science",
      "authors": [
        "Patricia H. Reiff",
        "Carolyn T. Sumners",
        "Charles H. Gardner",
        "Amir Caspi",
        "Sarah Kovac"
      ],
      "abstract": "Engaging and Educating Eclipse Observers Through Workshops, Media, Planetarium shows and Citizen Science Patricia H. Reiff, Carolyn T. Sumners, Charles H. Gardner, Amir Caspi, Sarah Kovac The website that contains the eclipse materials is this http URL Space Physics (physics.space-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR); Physics Education (physics.ed-ph) The Heliophysics Big Year was an extended year where major solar events engaged the public. It included two eclipses (annular on October 14, 2023 and total on April 8, 2024), plus solar max and the Parker Solar Probe perihelion December 24, 2024. After the eclipse of 2017, many millions more Americans planned to view the solar corona. We expanded our eclipse website with activities, citizen science projects, resources, training videos, equipment, and external links. We were the Southwest Regional Coordinator for Citizen CATE 2024 project, training the state coordinators and their teams with the equipment and procedures. We trained teachers at local, regional, national, and international workshops, providing eclipse viewing cards, lenses to make solar cup projectors, a safe viewing screen pattern, and access to the training materials. We made presentations to the media and hosted public events to demonstrate safe eclipse viewing techniques. HMNS hosted live viewing for the annular and total plus solstice and equinox events, reaching tens of thousands of people. HMNS also secured a grant to provide 100 eclipse viewing cards for every public school (8,800+) in Texas. We distributed another 57,000 eclipse viewers to teachers and the public. We appeared in media both in advance of the eclipses and as live commentators. The most lasting and impactful product was our planetarium show Totality, which was given away free and shown in various formats (flatscreen, fisheye, or prewarped). Over 180,000 views of the show and its animations have been documented. We continued to improve our space weather forecasting site, which correctly predicted the major solar storms of May 10-11 and October 8-10, 2024. In total, we reached nearly two million learners.",
      "pdf_url": "https://arxiv.org/pdf/2509.22348.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22541",
      "title": "The Origins & Reservoirs of Exocomets",
      "authors": [
        "Michele Bannister",
        "Susanne Pfalzner",
        "Tim Pearce",
        "Alexander J. Mustill",
        "Hubert Klahr",
        "Hideko Nomura",
        "Nagayoshi Ohashi",
        "Rosita Kokotanekova",
        "Sebastian Marino",
        "Dennis Bodewits",
        "Raphael Marschall",
        "Darryl Z. Seligman",
        "Geraint H. Jones",
        "Dimitri Veras"
      ],
      "abstract": "The Origins & Reservoirs of Exocomets Michele Bannister, Susanne Pfalzner, Tim Pearce, Alexander J. Mustill, Hubert Klahr, Hideko Nomura, Nagayoshi Ohashi, Rosita Kokotanekova, Sebastian Marino, Dennis Bodewits, Raphael Marschall, Darryl Z. Seligman, Geraint H. Jones, Dimitri Veras Accepted for publication in Space Science Reviews. Chapter written for the the workshop 'Exocomets: Bridging our Understanding of Minor Bodies in Solar and Exoplanetary Systems' (July 2024), at the International Space Science Insitute (ISSI), Bern Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Small bodies exist in distinct populations within their planetary systems. These reservoir populations hold a range of compositions, which to first order are dependent on formation location relative to their star. We provide a general overview of the nature of the reservoirs that source exocomets, from the influence of the stellar environment through planetesimal formation to comparisons with Solar System populations. Once transitioned from a young protoplanetary disc to a debris disc, a star can expect to be rained with exocomets. While exocomets are predominantly detected to date at A-type stars, planetesimals plausibly exist across a range of stellar masses, based on exoplanet abundance, debris disc occurrence and white dwarf infall.",
      "pdf_url": "https://arxiv.org/pdf/2509.22541.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.18375",
      "title": "Betelgeuse, Betelgeuse, Betelgeuse, Betel-buddy? Constraints on the dynamical companion to $α$ Orionis from HST",
      "authors": [
        "Jared A. Goldberg",
        "Anna J. G. O'Grady",
        "Meridith Joyce",
        "Christian I. Johnson",
        "László Molnár",
        "Andrea K. Dupree",
        "Brendan O'Connor",
        "Maria R. Drout",
        "Maxwell Moe",
        "Katelyn Breivik",
        "Annalisa Calamida",
        "Iman Behbehani",
        "Niall J. Miller"
      ],
      "abstract": "Betelgeuse, Betelgeuse, Betelgeuse, Betel-buddy? Constraints on the dynamical companion to $α$ Orionis from HST Jared A. Goldberg, Anna J. G. O'Grady, Meridith Joyce, Christian I. Johnson, László Molnár, Andrea K. Dupree, Brendan O'Connor, Maria R. Drout, Maxwell Moe, Katelyn Breivik, Annalisa Calamida, Iman Behbehani, Niall J. Miller 15 pages+1 appendix, 9+1 figures, accepted to ApJ. See also companion publication, O'Grady et al. 2025 (ApJ, in press) Solar and Stellar Astrophysics (astro-ph.SR) Recently, two independent analyses have asserted that the cause of the Long Secondary Period (LSP) observed in the variability spectrum of our nearest red supergiant, Betelgeuse ($\\alpha$ Ori), is an as-yet undetected, low-mass binary companion dubbed $\\alpha$ Ori B. In this paper, we present the results of a far-UV observational campaign using the STIS echelle spectrograph on the Hubble Space Telescope aimed at detecting spectral signatures of the companion. The four-quadrant tiling pattern and timing of the observations were optimized to isolate the companion, with observations taking place during a period of maximum angular and velocity separation between Betelgeuse and the putative companion. Spectral differencing between quadrants recovers no spectral features at the companion's velocity in excess of the background or Betelgeuse's chromosphere, i.e. a non-detection. Having determined that $\\alpha$ Ori B is most likely a Young Stellar Object (YSO) thanks to constraints from a complementary X-ray campaign with the Chandra X-ray Observatory in a companion paper, comparison of our data against canonical spectra from YSOs in the ULLYSES database allows us to confidently exclude masses above $\\gtrsim1.5M_\\odot$ and companion continuum or line emission in excess of $\\approx10^{-14}$ erg s$^{-1}$ cm$^{-2}$ angstrom$^{-1}$ in the FUV ($\\approx1200-1700$ angstroms). Future observational campaigns aware of the LSP phase are needed to place deeper constraints on the spectroscopic nature of $\\alpha$ Ori B.",
      "pdf_url": "https://arxiv.org/pdf/2505.18375.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.06748",
      "title": "Eclipse timing variations in 7 post-common envelope binaries: an update on recent circumbinary models",
      "authors": [
        "D. Pulley",
        "I. D. Sharp",
        "J. Mallett",
        "S. von Harrach"
      ],
      "abstract": "Eclipse timing variations in 7 post-common envelope binaries: an update on recent circumbinary models D. Pulley, I. D. Sharp, J. Mallett, S. von Harrach 14 pages, 17 figures and 5 tables. Observational data in separate file Solar and Stellar Astrophysics (astro-ph.SR) Eclipsing, short-period post-common envelope binaries (PCEBs) have been studied for several decades by eclipse timing variations (ETVs) which have been interpreted as being caused by circumbinary bodies. In this paper we report 355 new observations of 7 PECBs (HS0705+6700, NN Ser, NSVS 07826147, NSVS 14256825, NY Vir, QS Vir and RR Cae) and examine how the recent proposed models of these systems compare with our new observations. We find that none of the 18 recent models fit accurately with our data. We review alternative mechanisms of the ETVs, including magnetic effects, but conclude that they do not predict our results. Although we cannot exclude the presence of circumbinary bodies a combination of several mechanisms may be required to explain the observed ETVs.",
      "pdf_url": "https://arxiv.org/pdf/2507.06748.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20264",
      "title": "An Educational Guide for 2D Stellar Structure Calculations of Rapidly Rotating Stars using the ESTER code",
      "authors": [
        "Russel White",
        "Jane Pratt",
        "Michel Rieutord"
      ],
      "abstract": "An Educational Guide for 2D Stellar Structure Calculations of Rapidly Rotating Stars using the ESTER code Russel White, Jane Pratt, Michel Rieutord Lawrence Livermore National Laboratory Technical Report, FY 2025 Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Evolution STEllaire en Rotation (ESTER) code is the first 2D stellar structure code to be made open-source and freely available to the astronomy and astrophysics community. An important and novel advancement of this code is that it can reproduce the distorted shape and observable signatures (e.g., gravity darkening) of rapidly rotating stars. ESTER also calculates the steady-state large-scale flows within the star, namely their differential rotation and associated meridional circulation. In this report, we explore and document the physics implemented within version 1.1.0rc2 of the ESTER code, in a way that complements published descriptions. We illustrate this physics by plotting how stellar structure parameters vary through stellar interiors at a range of latitudes and at different angular velocities. We investigate how the thin convective envelopes of intermediate mass stars vary with latitude when rapidly rotating, becoming deeper and thicker near the equator. Simple comparisons of ESTER model predictions (e.g., central temperature and density, luminosity) with the output from the Modules for Experiments in Stellar Astrophysics (MESA) code [Paxton et al., 2010] shows generally good agreement. Additional comparisons provide important benchmarking and verification for ESTER as a comparatively young code. Finally, we provide a guide for installing and running the code on our local university cluster, aimed at helping students to begin work.",
      "pdf_url": "https://arxiv.org/pdf/2509.20264.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2409.06389",
      "title": "Contemporaneous Appearances of Auroral Spiral and Transpolar Arc: Polar UVI Observations and Global MHD Simulations",
      "authors": [
        "Motoharu Nowada",
        "Yukinaga Miyashita",
        "Aoi Nakamizo",
        "Noora Partamies",
        "Quan-Qi Shi"
      ],
      "abstract": "Contemporaneous Appearances of Auroral Spiral and Transpolar Arc: Polar UVI Observations and Global MHD Simulations Motoharu Nowada, Yukinaga Miyashita, Aoi Nakamizo, Noora Partamies, Quan-Qi Shi Manuscript: 38 pages; Figures: 11 (the main part of the paper) + 6 (Appendix part of the paper) Space Physics (physics.space-ph); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) A local vortex-structured aurora and a large-scale transpolar arc (TPA) were contemporaneously observed by the Polar ultraviolet imager (UVI) when a substorm almost recovered, and the associated interplanetary magnetic field (IMF) BY and BZ polarities were negative and negative-to-positive. The TPA grew along the dawnside auroral oval from the nightside to the dayside, and an auroral spiral and several spots were located azimuthally near the poleward edge of the nightside auroral oval. Both auroras had tailward elongated source regions with scales of ~30 RE (spiral) and more than ~45 RE (TPA). To examine their magnetospheric/ionospheric field-aligned current (FAC) profiles, we performed global magnetohydrodynamic (MHD) simulations, using two different types of code: Block-Adaptive-Tree Solar-wind Roe Upwind Scheme (BATS-R-US) and improved REProduce Plasma Universe (REPPU). Both MHD simulations reproduced the tailward elongated TPA-associated FAC structures. The spiral-associated FAC intensity was, however, approximately three orders of magnitude weaker than the TPA-associated FAC intensity. Only improved REPPU simulation replicated faint but continuous poleward extending streak-like structures without evident FACs, instead of the auroral spiral. Geomagnetic field measurements showed that the spiral had upward (from the ionosphere to the magnetosphere) FACs, and its appearance might be accompanied by ultra-low-frequency Pc5 waves. Our results suggest that 1) a local-scale spiral might be formed with much weaker magnetotail FACs than global-scale TPA-associated FACs, although the spiral source region is elongated tailward, and 2) a solar wind-magnetosphere-ionosphere coupling system with minimal or no significant substorm effects is required to form the spiral with the weak magnetotail FACs.",
      "pdf_url": "https://arxiv.org/pdf/2409.06389.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21431",
      "title": "First Light for the GRAVITY+ Adaptive Optics: Extreme Adaptive Optics for the Very Large Telescope Interferometer",
      "authors": [
        "GRAVITY+ Collaboration"
      ],
      "abstract": "First Light for the GRAVITY+ Adaptive Optics: Extreme Adaptive Optics for the Very Large Telescope Interferometer GRAVITY+ Collaboration Instrumentation and Methods for Astrophysics (astro-ph.IM) GRAVITY+ improves by orders of magnitude the sensitivity, sky-coverage and contrast of the Very Large Telescope Interferometer (VLTI). A central part of this project is the development of Gravity Plus Adaptive Optics (GPAO), a dedicated high-order and laser-guide star Adaptive Optics (AO) system for VLTI. GPAO consists of four state-of-the-art AO systems equipping all 8m-class Unit Telescopes (UTs) for the wavefront correction of the VLTI instruments. It offers both visible and infrared Natural Guide Star (NGS) and Laser Guide Star (LGS) operations. The paper presents the design, operations and performances of GPAO. We illustrate the improvement brought by GPAO with interferometric observations obtained during the commissioning of the NGS mode end-2024. These science results include the first optical interferometry observations of a redshift $z\\sim4$ quasar, the spectroscopy of a cool brown-dwarf with magnitude $K\\sim 21.0$, the first observations of a Class I young star with GRAVITY, and the first sub-micro arcsecond differential astrometry in the optical. Together with the entire GRAVITY+ project, the implementation of GPAO is a true paradigm shift for observing the optical Universe at very high angular resolution.",
      "pdf_url": "https://arxiv.org/pdf/2509.21431.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21546",
      "title": "Performance characterization of a new Structural and Thermal Architecture for a future spaceborne Closed-Cycle Dilution Refrigerator",
      "authors": [
        "Valentin Sauvage",
        "Anaïs Besnard",
        "Clémence de Jabrun",
        "Mehdi Bouzit",
        "Bruno Maffei"
      ],
      "abstract": "Performance characterization of a new Structural and Thermal Architecture for a future spaceborne Closed-Cycle Dilution Refrigerator Valentin Sauvage, Anaïs Besnard, Clémence de Jabrun, Mehdi Bouzit, Bruno Maffei Instrumentation and Methods for Astrophysics (astro-ph.IM) A Structural and Thermal Model (STM) has been developed to support the new spaceborne Closed-Cycle Dilution Refrigerator (CCDR), which aims to provide continuous cooling at 100~mK for long-duration astrophysical missions. The STM is based on a hexapod architecture that ensures both thermal decoupling and mechanical robustness during launch. In this paper, we present the characterization of its thermal and mechanical performances. A dedicated experimental setup was used to investigate the thermal behavior of the STM across a broad temperature range. The study reveals limitations of the collar design, with incomplete power interception from thermal boundary resistances and vibration test failure traced to defective strut gluing. These results guide the next STM iteration with optimized collar and strut assembly for reliable CCDR operation in space.",
      "pdf_url": "https://arxiv.org/pdf/2509.21546.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21754",
      "title": "FITrig: A High-Performance Detection Technique for Efficient Ultra-Long-Period Pulsars",
      "authors": [
        "X. Li",
        "K. Adamek",
        "W. Armour"
      ],
      "abstract": "FITrig: A High-Performance Detection Technique for Efficient Ultra-Long-Period Pulsars X. Li, K. Adamek, W. Armour Instrumentation and Methods for Astrophysics (astro-ph.IM) Ultra-long-period (ULP) pulsars, a newly identified class of celestial transients, offer unique insights into astrophysics, though very few have been detected to date. In radio astronomy, most time-domain detection methods cannot find these pulsars, and current image-based detection approaches still face challenges, including low sensitivity, high false positive rate, and low computational efficiency. In this article, we develop Fast Imaging Trigger (FITrig), a GPU-accelerated, statistics-based method for ULP pulsar detection and localisation. FITrig includes two complementary approaches -- an image domain and an image-frequency domain strategy. FITrig offers advantages by increasing sensitivity to faint pulsars, suppressing false positives (from noise, processing artefacts, or steady sources), and improving search efficiency in large-scale wide-field images. Compared to the state-of-the-art source finder SOFIA 2, FITrig increases the detection speed by 4.3 times for large images (50K x 50K pixels) and reduces false positives by up to 858.8 times (at 6$\\sigma$ significance) for the image domain branch, while the image-frequency domain branch suppresses false positives even further. FITrig maintains the capability to detect pulsars that are 20 times fainter than surrounding steady features, even under critical Nyquist sampling conditions. In this article, the performance of FITrig is demonstrated using both real-world data (MeerKAT observations of PSR J0901-4046) and simulated datasets based on MeerKAT and SKA AA2 telescope configurations. With its real-time processing capabilities and scalability, FITrig is a promising tool for next-generation telescopes, such as the SKA, with the potential to uncover hidden ULP pulsars.",
      "pdf_url": "https://arxiv.org/pdf/2509.21754.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22071",
      "title": "Optimization procedure of the baffle of the GroundBIRD Telescope to mitigate stray light",
      "authors": [
        "Miku Tsujii",
        "Tomonaga Tanaka",
        "Alessandro Fasano",
        "Ricardo Génova-Santos",
        "Shunsuke Honda",
        "Yonggil Jo",
        "Keisuke Kataoka",
        "Chiko Otani",
        "Mike Peel",
        "Junya Suzuki",
        "Osamu Tajima",
        "Eunil Won",
        "Makoto Hattori"
      ],
      "abstract": "Optimization procedure of the baffle of the GroundBIRD Telescope to mitigate stray light Miku Tsujii, Tomonaga Tanaka, Alessandro Fasano, Ricardo Génova-Santos, Shunsuke Honda, Yonggil Jo, Keisuke Kataoka, Chiko Otani, Mike Peel, Junya Suzuki, Osamu Tajima, Eunil Won, Makoto Hattori Instrumentation and Methods for Astrophysics (astro-ph.IM) We presented the optimization procedures of the baffle mounted on the GroundBIRD telescope for measuring the polarization of the Cosmic Microwave Background~(CMB). The telescope employs dual mirror reflective telescopes installed in a cryostat. The primary objectives were to minimize stray light contamination, maintain the integrity of the main beam, and ensure that thermal loading from the baffle remains significantly below that from the atmosphere. Using quasi-optical simulations, we have optimized the baffle's aperture angle to suppress stray light without degrading the main beam quality. We confirmed through Moon observations that the optimized baffle design works to eliminate the contamination of the stray light as expected. Furthermore, no measurable degradation in the noise equivalent temperature~(NET) was detected, indicating minimal thermal impact. These results show that our baffle optimization strategy effectively reduces systematic errors while maintaining observational sensitivity, providing valuable insights for future CMB experiments with similar optical architectures.",
      "pdf_url": "https://arxiv.org/pdf/2509.22071.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22382",
      "title": "The Simons Observatory: Characterization of the 220/280 GHz TES Detector Modules",
      "authors": [
        "Daniel Dutcher",
        "Peter Dow",
        "Shannon M. Duff",
        "Shawn W. Henderson",
        "Johannes Hubmayr",
        "Bradley R. Johnson",
        "Michael J. Link",
        "Tammy J. Lucas",
        "Michael D. Niemack",
        "Yudai Seino",
        "Rita F. Sonka",
        "Suzanne Staggs",
        "Yuhan Wang",
        "Kaiwen Zheng"
      ],
      "abstract": "The Simons Observatory: Characterization of the 220/280 GHz TES Detector Modules Daniel Dutcher, Peter Dow, Shannon M. Duff, Shawn W. Henderson, Johannes Hubmayr, Bradley R. Johnson, Michael J. Link, Tammy J. Lucas, Michael D. Niemack, Yudai Seino, Rita F. Sonka, Suzanne Staggs, Yuhan Wang, Kaiwen Zheng 6 pages, 7 figures. Proceedings of the 21st International Conference on Low Temperature Detectors (LTD2025) Instrumentation and Methods for Astrophysics (astro-ph.IM) The Simons Observatory (SO) is a new suite of cosmic microwave background telescopes in the Chilean Atacama Desert with an extensive science program spanning cosmology, Galactic and extragalactic astrophysics, and particle physics. SO will survey the millimeter-wave sky over a wide range of angular scales using six spectral bands across three types of dichroic, polarization-sensitive transition-edge sensor (TES) detector modules: Low-Frequency (LF) modules with bandpasses centered near 30 and 40 GHz, Mid-Frequency (MF) modules near 90 and 150 GHz, and Ultra-High-Frequency (UHF) modules near 220 and 280 GHz. Twenty-five UHF detector modules, each containing 1720 optically-coupled TESs connected to microwave SQUID multiplexing readout, have now been produced. This work summarizes the pre-deployment characterization of these detector modules in laboratory cryostats. Across all UHF modules, we find an average operable TES yield of 83%, equating to over 36,000 devices tested. The distributions of (220, 280) GHz saturation powers have medians of (24, 26) pW, near the centers of their target ranges. For both bands, the median optical efficiency is 0.6, the median effective time constant is 0.4 ms, and the median dark noise-equivalent power (NEP) is ~40 aW/rtHz. The expected photon NEPs at (220, 280) GHz are (64, 99) aW/rtHz, indicating these detectors will achieve background-limited performance on the sky. Thirty-nine UHF and MF detector modules are currently operating in fielded SO instruments, which are transitioning from the commissioning stage to full science observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.22382.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22453",
      "title": "Hyper-py: HYbrid Photometry and Extraction Routine in PYthon",
      "authors": [
        "Alessio Traficante",
        "Fabrizio De Angelis",
        "Alice Nucara",
        "Milena Benedettini"
      ],
      "abstract": "Hyper-py: HYbrid Photometry and Extraction Routine in PYthon Alessio Traficante, Fabrizio De Angelis, Alice Nucara, Milena Benedettini Submitted to Journal of Open Source Software (JOSS). The code is freely available for download via its GitHub repository: this https URL. It can also be installed using pip, as described in the accompanying README file (also available in the repository) Instrumentation and Methods for Astrophysics (astro-ph.IM) We present Hyper-Py, a fully restructured and extended Python implementation of HYPER (HYbrid Photometry and Extraction Routine, Traficante et al. 2015). HYPER was originally implemented in IDL, aiming to deliver robust and reproducible photometry of compact sources in FIR/sub-mm/mm maps. HYPER combines source detection via high-pass filtering, background estimation through local polynomial fitting, and source modeling with 2D elliptical Gaussians, simultaneously fitting multiple Gaussians to deblend overlapping sources. Hyper-Py preserves the original logic while offering improvements in performance, configurability, and background modeling capabilities, making it a flexible modern tool for source extraction and photometry across diverse datasets. Notably, Hyper-Py enables background estimation and subtraction across individual slices of 3D datacubes, allowing consistent background modeling along the spectral axis for line or continuum studies in spectrally resolved observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.22453.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22478",
      "title": "halox: Dark matter halo properties and large-scale structure calculations using JAX",
      "authors": [
        "Florian Kéruzoré"
      ],
      "abstract": "halox: Dark matter halo properties and large-scale structure calculations using JAX Florian Kéruzoré 6 pages, submitted to the Journal of Open Source Software. halox is available at this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM) Dark matter halos are fundamental structures in cosmology, forming the gravitational potential wells hosting galaxies and clusters of galaxies. Their properties and statistical distribution (including the halo mass function) are invaluable tools to infer the fundamental properties of the Universe. The \\texttt{halox} package is a JAX-powered Python library enabling differentiable and accelerated computations of key properties of dark matter halos, and of the halo mass function. The automatic differentiation capabilities of \\texttt{halox} enable its usage in gradient-based workflows, e.g. in efficient Hamiltonian Monte Carlo sampling or machine learning applications.",
      "pdf_url": "https://arxiv.org/pdf/2509.22478.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21661",
      "title": "Automating Sensor Characterization with Bayesian Optimization",
      "authors": [
        "J. Cuevas-Zepeda",
        "C. Chavez",
        "J. Estrada",
        "J. Noonan",
        "B. D. Nord",
        "N. Saffold",
        "M. Sofo-Haro",
        "R. Spinola e Castro",
        "S. Trivedi"
      ],
      "abstract": "Automating Sensor Characterization with Bayesian Optimization J. Cuevas-Zepeda, C. Chavez, J. Estrada, J. Noonan, B. D. Nord, N. Saffold, M. Sofo-Haro, R. Spinola e Castro, S. Trivedi Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) The development of novel instrumentation requires an iterative cycle with three stages: design, prototyping, and testing. Recent advancements in simulation and nanofabrication techniques have significantly accelerated the design and prototyping phases. Nonetheless, detector characterization continues to be a major bottleneck in device development. During the testing phase, a significant time investment is required to characterize the device in different operating conditions and find optimal operating parameters. The total effort spent on characterization and parameter optimization can occupy a year or more of an expert's time. In this work, we present a novel technique for automated sensor calibration that aims to accelerate the testing stage of the development cycle. This technique leverages closed-loop Bayesian optimization (BO), using real-time measurements to guide parameter selection and identify optimal operating states. We demonstrate the method with a novel low-noise CCD, showing that the machine learning-driven tool can efficiently characterize and optimize operation of the sensor in a couple of days without supervision of a device expert.",
      "pdf_url": "https://arxiv.org/pdf/2509.21661.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22021",
      "title": "Background stability and annual modulation test using PICOLON ultra-pure NaI(Tl) detector",
      "authors": [
        "K. Kotera",
        "D. Chernyak",
        "H. Ejiri",
        ".K. Fushimi",
        "K. Hata",
        "R. Hazama",
        "T. Iida",
        "H. Ikeda",
        "K. Imagawa",
        "K. Inoue",
        "H. Ito",
        "T. Kishimoto",
        "M. Koga",
        "A. Kozlov",
        "K. Nakamura",
        "R. Orito",
        "T. Shima",
        "Y. Takemoto",
        "S. Umehara",
        "Y. Urano",
        "K. Yasuda",
        "S. Yoshida"
      ],
      "abstract": "Background stability and annual modulation test using PICOLON ultra-pure NaI(Tl) detector K. Kotera, D. Chernyak, H. Ejiri, .K. Fushimi, K. Hata, R. Hazama, T. Iida, H. Ikeda, K. Imagawa, K. Inoue, H. Ito, T. Kishimoto, M. Koga, A. Kozlov, K. Nakamura, R. Orito, T. Shima, Y. Takemoto, S. Umehara, Y. Urano, K. Yasuda, S. Yoshida (The PICOLON Collaboration) Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) The dark matter observation claimed by the DAMA/LIBRA experiment has been a long-standing puzzle within the particle physics community. NaI(Tl) crystals with radiopurity comparable to DAMA/LIBRA's are essential for adequate verification. Existing experiments using NaI(Tl) target have been hampered by the high radioactivity concentration of NaI(Tl) crystals. PICOLON experiment conducts an independent search for Weakly Interacting Massive Particles using highest purity NaI(Tl) crystals. In 2020, the NaI(Tl) crystal (Ingot#85) reached the same purity level as DAMA/LIBRA crystals. The DAMA/LIBRA group has stressed that verifying their signal requires high-purity NaI(Tl) crystals with long-term stability. Based on a six-month measurement, we have confirmed the long-term stability of its radiopurity. This stability provides a significant advantage for future efforts to adequately verify the DAMA/LIBRA result using NaI(Tl) crystal. In this paper, we present the background stability of purity in the Ingot#94 NaI(Tl) detector, which was produced using the Ingot#85 purification method, along with the first annual modulation search conducted by the PICOLON experiment.",
      "pdf_url": "https://arxiv.org/pdf/2509.22021.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21437",
      "title": "Formation of multiple dynamical classes in the Kuiper belt via disk dissipation",
      "authors": [
        "Tommy Chi Ho Lau",
        "Til Birnstiel",
        "Sebastian Markus Stammler",
        "Joanna Drążkowska"
      ],
      "abstract": "Formation of multiple dynamical classes in the Kuiper belt via disk dissipation Tommy Chi Ho Lau, Til Birnstiel, Sebastian Markus Stammler, Joanna Drążkowska 20 pages, 5 figures. Accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP) Planetesimal formation likely lasted for millions of years in the Solar nebula, and the cold classicals in the Kuiper belt are suggested to be the direct products of streaming instability. The presence of minor planetary bodies in the outer Solar System and the exo-Kuiper belts provide key constraints to planet formation models. In this work, we connected dust drift and coagulation, planetesimal formation, N-body gravity, pebble accretion, planet migration, planetary core accretion, gap opening, and internal photoevaporation in one modeling framework. We demonstrate that multiple classes of minor planets, or planetesimals, can form during disk dissipation and remain afterwards, including a scattered group, a resonant group and a dynamically cold group. Significant growth by pebble accretion was prevented by both dynamical heating due to the giant planet in the system and rapid dispersal of the disk towards the end of its lifetime. We also conducted a parameter study which showed that this is not a universal case, where the outcome is determined by the competition for dust between planetesimal formation and pebble accretion. Combining this scenario with sequential planet formation, this model provides a promising pathway towards an outer Solar System formation model.",
      "pdf_url": "https://arxiv.org/pdf/2509.21437.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21551",
      "title": "A Combined TESS and Ground-based Study of Transit Timing Variations in HAT-P-16, TOI-1516 and TOI-2046 Systems",
      "authors": [
        "E. Sonbas",
        "K. Kaplan",
        "M. Tanriver",
        "A. Keskin",
        "K. S. Dhuga",
        "A. Bulut",
        "E. Gogus",
        "W. Ogloza"
      ],
      "abstract": "A Combined TESS and Ground-based Study of Transit Timing Variations in HAT-P-16, TOI-1516 and TOI-2046 Systems E. Sonbas, K. Kaplan, M. Tanriver, A. Keskin, K. S. Dhuga, A. Bulut, E. Gogus, W. Ogloza Earth and Planetary Astrophysics (astro-ph.EP) We present new results for the hot Jupiters HAT-P-16b, TOI-1516b, and TOI-2046b, based on photometric observations collected using both space- and ground-based facilities. Ground-based data were collected in the 2020-2024 time span with the 0.6 m telescope (ADYU60) located at the Adiyaman University Application and Research Center (Adiyaman, Türkiye) and the 1.0 m telescope at the Türkiye National Observatory (TUG, Türkiye). Through a combination of fits to our ground-based data, the mid-transit times data from TESS and additional data taken from the literature, we present an updated linear ephemeris for each system. Transit timing variations (TTVs) were analyzed using linear, orbital decay, and apsidal precession models. The resulting BIC($\\Delta$BIC) values indicate that the orbital decay model is statistically favored for HAT-P-16b and TOI-1516b, while the constant period model is preferred for TOI-2046b. False alarm probabilities (FAPs) were computed to assess the significance of any periodic signals. TOI-1516b displays a strong TTV signal with a FAP (of 0.0001) well below the 0.01 threshold, suggesting a likely dynamical origin that warrants further investigation. The higher FAP value (0.0055) for HAT-P-16b suggests that the case of a possible presence of an additional body in the system is less convincing. In contrast, the much higher FAP value (0.0196) for TOI-2046b implies that there are no statistically significant TTVs.",
      "pdf_url": "https://arxiv.org/pdf/2509.21551.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21588",
      "title": "Limb Asymmetries on WASP-39b: A Multi-GCM Comparison of Chemistry, Clouds, and Hazes",
      "authors": [
        "Maria E. Steinrueck",
        "Arjun B. Savel",
        "Duncan A. Christie",
        "Ludmila Carone",
        "Shang-Min Tsai",
        "Can Akın",
        "Thomas D. Kennedy",
        "Sven Kiefer",
        "David A. Lewis",
        "Emily Rauscher",
        "Dominic Samra",
        "Maria Zamyatina",
        "Kenneth Arnold",
        "Robin Baeyens",
        "Leonardos Gkouvelis",
        "David Haegele",
        "Christiane Helling",
        "Nathan J. Mayne",
        "Diana Powell",
        "Michael T. Roman",
        "Hayley Beltz",
        "Néstor Espinoza",
        "Kevin Heng",
        "Nicolas Iro",
        "Eliza M.-R. Kempton",
        "Laura Kreidberg",
        "James Kirk",
        "Matthew M. Murphy",
        "Benjamin V. Rackham",
        "Xianyu Tan"
      ],
      "abstract": "Limb Asymmetries on WASP-39b: A Multi-GCM Comparison of Chemistry, Clouds, and Hazes Maria E. Steinrueck, Arjun B. Savel, Duncan A. Christie, Ludmila Carone, Shang-Min Tsai, Can Akın, Thomas D. Kennedy, Sven Kiefer, David A. Lewis, Emily Rauscher, Dominic Samra, Maria Zamyatina, Kenneth Arnold, Robin Baeyens, Leonardos Gkouvelis, David Haegele, Christiane Helling, Nathan J. Mayne, Diana Powell, Michael T. Roman, Hayley Beltz, Néstor Espinoza, Kevin Heng, Nicolas Iro, Eliza M.-R. Kempton, Laura Kreidberg, James Kirk, Matthew M. Murphy, Benjamin V. Rackham, Xianyu Tan submitted to AAS Journals. Supplementary Data available on Zenodo Earth and Planetary Astrophysics (astro-ph.EP) With JWST, observing separate spectra of the morning and evening limbs of hot Jupiters has finally become a reality. The first such observation was reported for WASP-39b, where the evening terminator was observed to have a larger transit radius by about 400 ppm and a stronger 4.3 $\\mu$m CO$_2$ feature than the morning terminator. Multiple factors, including temperature differences, photo/thermochemistry, clouds and hazes, could cause such limb asymmetries. To interpret these new limb asymmetry observations, a detailed understanding of how the relevant processes affect morning and evening spectra grounded in forward models is needed. Focusing on WASP-39b, we compare simulations from five different general circulation models (GCMs), including one simulating disequilibrium thermochemistry and one with cloud radiative feedback, to the recent WASP-39b limb asymmetry observations. We also post-process the temperature structures of all simulations with a 2D photochemical model and one simulation with a cloud microphysics model. Although the temperatures predicted by the different models vary considerably, the models are remarkably consistent in their predicted morning--evening temperature differences. Several equilibrium-chemistry simulations predict strong methane features in the morning spectrum, not seen in the observations. When including disequilibrium processes, horizontal transport homogenizes methane, and these methane features disappear. However, even after including photochemistry and clouds, our models still cannot reproduce the observed ${\\sim}2000$ ppm asymmetry in the CO$_2$ feature. A combination of factors, such as varying metallicity and unexplored parameters in cloud models, may explain the discrepancy, emphasizing the need for future models integrating cloud microphysics and feedback across a broader parameter space.",
      "pdf_url": "https://arxiv.org/pdf/2509.21588.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21755",
      "title": "Multidisciplinary analysis of pit craters at Hale Crater, Mars",
      "authors": [
        "Mara Mantegazza",
        "Mauro G. Spagnuolo",
        "Angelo P. Rossi"
      ],
      "abstract": "Multidisciplinary analysis of pit craters at Hale Crater, Mars Mara Mantegazza, Mauro G. Spagnuolo, Angelo P. Rossi Earth and Planetary Astrophysics (astro-ph.EP) Pit craters are circular to subcircular depressions that lack a rim and ejecta layer and typically have a conical shape. There are several mechanisms that can explain the formation of such depressions and they are associated with collapse due to the removal of subsurface material. Possible origins of pit craters include: volcanic processes (collapse of lava tubes, magmatic chambers, intrusion of dikes), karstic dissolution, extensional faulting or volatile processes. Here, we propose that pit craters are stratigraphically on top of the ice-related landforms and present complex relationships with the gullies. The spatial relationship between the pits and these structures, along with the absence of evidence of present or past volcanic activity and the lack of evidence of any extensional faulting allows us to propose that the origin of the pit craters in the study area might be related to some volatile process. We propose here that these particular pit craters at Hale crater, are morphologically similar to Icelandic depressions located in a glacial environment. We conclude that the landforms found in the area are in close relation with glacial or periglacial conditions and pit craters might be formed by sublimation/melting of ground ice.",
      "pdf_url": "https://arxiv.org/pdf/2509.21755.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22316",
      "title": "Ion-neutral chemistry at icy moons: the case of Ganymede",
      "authors": [
        "A. Beth",
        "M. Galand",
        "X. Jia",
        "F. Leblanc"
      ],
      "abstract": "Ion-neutral chemistry at icy moons: the case of Ganymede A. Beth, M. Galand, X. Jia, F. Leblanc accepted for publication in MNRAS Earth and Planetary Astrophysics (astro-ph.EP); Space Physics (physics.space-ph) Icy moons orbiting giant planets are often described as airless bodies though they host an exosphere where collisions between neutral species are scarce. In the case of Ganymede, the neutral composition is dominated by $\\mathrm{H_2O}$, $\\mathrm{H_2}$, and $\\mathrm{O_2}$. Past observations by Galileo showed that Ganymede hosts an ionosphere and those by Juno revealed the presence of $\\mathrm{H_3^+}$, an ion species only stemming from ion-neutral collisions. $\\mathrm{H_3^+}$ detection suggests that ions and neutrals might still collide and be the source of new ion species on icy moons. We examine Ganymede's ability to host a more diverse ionosphere in terms of ion composition than previously thought and predict its variety. We upgraded our test-particle code of Ganymede's ionosphere, formerly collisionless, to include ion-neutral collisions in a probabilistic manner. The updated code is applied to three Galileo flybys of Ganymede that were investigated in the absence of chemistry. Both sets of simulations have been compared and the effect of ion-neutral chemistry has been assessed. We show that in the case of an exosphere predominantly composed of $\\mathrm{H_2O}$, $\\mathrm{H_2}$, and $\\mathrm{O_2}$, the ionosphere is made not only of their associated cations but also of $\\mathrm{H_3^+}$, $\\mathrm{H_3O^+}$, and $\\mathrm{O_2H^+}$. Simulations reveal that, depending on the location, the contribution of $\\mathrm{H_3^+}$ and $\\mathrm{H_3O^+}$ to the ion composition may be significant. Strong dayside/nightside and Jovian/anti-Jovian asymmetries in the ion composition are identified. Our findings are key to interpreting Juno and future JUICE ion mass spectrometer datasets.",
      "pdf_url": "https://arxiv.org/pdf/2509.22316.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22602",
      "title": "Small Near-Earth Objects in the Taurid Resonant Swarm",
      "authors": [
        "Quanzhi Ye",
        "Jasmine Li",
        "Denis Vida",
        "David L. Clark",
        "Eric C. Bellm"
      ],
      "abstract": "Small Near-Earth Objects in the Taurid Resonant Swarm Quanzhi Ye, Jasmine Li, Denis Vida, David L. Clark, Eric C. Bellm Accepted for publication on Acta Astronautica, PDC 2025 Special Issue Earth and Planetary Astrophysics (astro-ph.EP) The Taurid Resonant Swarm (TRS) within the Taurid Complex hosts dynamically-concentrated debris in a 7:2 mean-motion resonance with Jupiter. Fireball observations have confirmed that the TRS is rich in sub-meter-sized particles, but whether this enhancement extends to larger, asteroid-sized objects remains unclear. Here we reanalyze the data obtained by a Zwicky Transient Facility (ZTF) campaign during the 2022 TRS encounter, and find that the TRS may host up to $\\sim10^2$ Tunguska-sized objects and up to $\\sim10^3$ Chelyabinsk-sized objects, the latter of which agrees the estimate derived from bolide records. This translates to an impact frequency of less than once every 4 million years. However, we caution that these numbers are based on the unverified assumption that the orbital distribution of the TRS asteroids follows that of fireball-sized meteoroids. Future wide-field facilities, such as the Vera C. Rubin Observatory, could take advantage of TRS's close approaches in the 2020-30s and validate the constraints of the asteroid-sized objects in the TRS.",
      "pdf_url": "https://arxiv.org/pdf/2509.22602.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.20654",
      "title": "Comparing the Architectures of Multiplanet Systems from Kepler, K2, and TESS Data",
      "authors": [
        "Robert Royer III",
        "Jason H. Steffen"
      ],
      "abstract": "Comparing the Architectures of Multiplanet Systems from Kepler, K2, and TESS Data Robert Royer III, Jason H. Steffen Published in the Open Journal of Astrophysics Earth and Planetary Astrophysics (astro-ph.EP) Exoplanet surveys like Kepler, TESS, and K2 have shown that planetary systems are common in our galaxy. These surveys, along with several others, have identified thousands of planetary candidates, with more than five thousand having already been confirmed. Many of these planetary systems host multiple planets. As we discover more multiplanet systems, notable trends begin to appear in the data. We use kernel density estimation (KDE) to analyze the period ratios of adjacent planet pairs in multiplanet systems in the most recent Kepler, TESS and K2 data, paying particular attention to pairs in first order mean motion resonance (MMR). We compare a recent Kepler catalog with the DR25 data release. We also compare TESS and K2 against this recently released Kepler data. To verify the significance of our findings against selection bias, we perform Monte Carlo simulations of multiplanet systems in the TESS catalog, finding an excess of planet pairs near the 2 (2:1), and 1.5 (3:2) period ratios, both exceeding the 99\\% confidence interval. We also find a significant peak at the 2.19 period ratio, which exceeds the 90\\% confidence interval. Using a lower limit for period ratios determined by the period of the inner planet proposed in Steffen & Farr (2013), we identify two planet pairs orbiting M dwarf stars in a very tight ratio. We also note a likely misidentified planet pair orbiting an FGK type star, which if further study proves to be true, would indicate that only planets orbiting M dwarf stars may violate this limit.",
      "pdf_url": "https://arxiv.org/pdf/2506.20654.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.06009",
      "title": "GPI+SPHERE detection of a 6.1 $M_{\\text{Jup}}$ circumbinary planet around HD 143811",
      "authors": [
        "Vito Squicciarini",
        "Johan Mazoyer",
        "Christian Wilkinson",
        "Anne-Marie Lagrange",
        "Philippe Delorme",
        "Alice Radcliffe",
        "Olivier Flasseur",
        "Flavien Kiefer",
        "Evelyne Alecian"
      ],
      "abstract": "GPI+SPHERE detection of a 6.1 $M_{\\text{Jup}}$ circumbinary planet around HD 143811 Vito Squicciarini, Johan Mazoyer, Christian Wilkinson, Anne-Marie Lagrange, Philippe Delorme, Alice Radcliffe, Olivier Flasseur, Flavien Kiefer, Evelyne Alecian 8 pages, 8 figures, 5 tables. Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) Owing to its sensitivity to wide-orbit giant exoplanets, direct imaging is uniquely positioned to shed light on the interplay between protoplanetary disks and stellar hosts. In addition to constraining formation models, new detections are natural benchmarks for an atmospheric characterization. The COBREX project performed an extensive reanalysis of archival observations from SPHERE and GPI using advanced post-processing techniques, that enhanced the detection sensitivity at close separation. Newly found companion candidates are being followed up to confirm new planets. Following the detection of a companion candidate around the young ($\\sim 15$ Myr) binary star HD 143811, we collected a new observation with SPHERE@VLT (0.95-1.67 $\\mu$m) to confirm the presence of the source and to assess its physical bond to the target. We report the discovery of a new exoplanet orbiting HD 143811 at a projected separation of 0.43\" $\\sim 60$ au. Based on a 9-year-long baseline, we derive a mostly face-on and low-eccentricity orbit with a period of $320 ^{+250}_{-90}$ years. The luminosity of the planet, constrained through the H-band spectrum from GPI, H-band photometry from SPHERE/IRDIS and YJ upper limits from SPHERE/IFS, allows us to place strong constraints on the intrinsic temperature of the planet (T$_{\\text{int}} = 1000 \\pm 30$K), which corresponds to a mass of $6.1^{+0.7}_{-0.9} ~M_{\\text{Jup}}$. HD 143811(AB)b is the second planet ever discovered by GPI. It joins the small cohort of circumbinary planets discovered through imaging and becomes a prime target for follow-up formation, dynamical, and characterization studies.",
      "pdf_url": "https://arxiv.org/pdf/2509.06009.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}