{
  "date": "2026-01-29",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.IM",
    "astro-ph.EP",
    "astro-ph.CO",
    "astro-ph.SR",
    "astro-ph.HE",
    "astro-ph.GA"
  ],
  "total_papers": 104,
  "gw_related_papers": 5,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.18835",
      "title": "Beyond FINDCHIRP: Breaking the memory wall and optimal FFTs for Gravitational-Wave Matched-Filter Searches with Ratio-Filter Dechirping",
      "authors": [
        "Alexander H. Nitz",
        "Keisi Kacanja",
        "Kanchan Soni"
      ],
      "abstract": "Beyond FINDCHIRP: Breaking the memory wall and optimal FFTs for Gravitational-Wave Matched-Filter Searches with Ratio-Filter Dechirping Alexander H. Nitz, Keisi Kacanja, Kanchan Soni Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) A primary bottleneck in modern FFT-based matched-filter searches for gravitational waves from compact binary coalescences is not raw processor throughput, but available memory bandwidth. Standard frequency-domain implementations, such as the FINDCHIRP algorithm, rely on streaming long template waveforms and data from main memory, which leads to significant processor stalling when template durations exceed cache capacities. In this work, we introduce \\textit{Ratio-Filter Dechirping} as a solution, an algorithmic restructuring of the matched filter that transforms the operation from a memory-bound Fast Fourier Transform (FFT) into a cache-efficient, compute-bound Finite Impulse Response (FIR) convolution. By utilizing a reference template to remove common orbital phase evolution, we produce slowly changing frequency-domain ratios that can be accurately implemented as short FIR filters. This method delivers a measured speedup of $8\\times$ for the core filtering loop used in offline searches and should enable $>10\\times$ for low-latency analysis. We find that this approach generalizes to a variety of searches that include physical features such as finite size effects, eccentricity, and precession. By dramatically reducing the computational cost of matched filtering, this approach enables the expansion of searches into dense or high-dimensional parameter spaces, such as those for eccentric or subsolar-mass signals, that are already limited by available computing budgets. Furthermore, this framework provides a natural path for hardware acceleration on GPU architectures.",
      "pdf_url": "https://arxiv.org/pdf/2601.18835.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.18859",
      "title": "Energetic Ceilings of Astrophysical Gravitational-Wave Backgrounds",
      "authors": [
        "Chiara M. F. Mingarelli"
      ],
      "abstract": "Energetic Ceilings of Astrophysical Gravitational-Wave Backgrounds Chiara M. F. Mingarelli This is \"Paper 1\". Paper 2 was uploaded simultaneously. Online plotter here, this https URL. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Every astrophysical stochastic gravitational wave (GWB) is limited by the amount of rest mass available to be converted into gravitational radiation. Here we derive a population-agnostic scaling law that places an absolute energetic ceiling on stochastic backgrounds across the entire GW frequency spectrum, from nanoHertz to kilohertz. We apply this framework to bound the backgrounds from supermassive black hole binaries, intermediate-mass black hole captures by supermassive black holes in AGN disks, extreme mass-ratio inspirals, binary neutron stars, Population III remnants, and stellar-mass binary black holes. We find that the energetic ceiling for supermassive black hole binaries is $A \\leq 1.6^{+0.3}_{-0.3} \\times 10^{-15}$ at a reference frequency of $1\\,{\\rm yr}^{-1}$. This astrophysical GWB ceiling is within $1\\sigma$ with the GWB amplitude reported by NANOGrav, EPTA, and PPTA, implying that the current observed signal is consistent with being powered by a population of ultramassive black holes ($M_\\bullet \\gtrsim 10^{10}\\,M_\\odot$). Finally, we demonstrate that the total astrophysical background from all channels combined cannot exceed $\\Omega_{\\rm gw} \\sim 10^{-7}$.",
      "pdf_url": "https://arxiv.org/pdf/2601.18859.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.18986",
      "title": "Progenitor of the recoiling super-massive black hole RBH-1 identified using HST/JWST imaging",
      "authors": [
        "Tousif Islam",
        "Tejaswi Venumadhav",
        "Digvijay Wadekar"
      ],
      "abstract": "Progenitor of the recoiling super-massive black hole RBH-1 identified using HST/JWST imaging Tousif Islam, Tejaswi Venumadhav, Digvijay Wadekar High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Using a combination of \\textit{Hubble Space Telescope} and \\textit{James Webb Space Telescope} imaging, a runaway supermassive black hole (RBH-1) was recently identified with an inferred velocity of $954^{+110}_{-126}\\,\\mathrm{km\\,s^{-1}}$, likely ejected from a compact star-forming galaxy (denoted as GX) at $z \\approx 0.96$. Assuming the runaway black hole was the outcome of the gravitational-wave-driven merger of two black holes, we use its measured runaway velocity together with gravitational-wave recoil predictions from numerical relativity and black hole perturbation theory to constrain the mass ratio and spin configuration of the progenitor SMBHs that overcame the final-parsec problem and merged $\\sim 70$~Myr ago. We find that the progenitor binary must have been precessing, with a mass ratio $m_1/m_2\\lesssim 6$, and that the more massive SMBH must have possessed a high spin (dimensionless spin magnitude $\\sim 0.75$) in order to generate a recoil of this magnitude. This has important astrophysical implications as similar SMBH mergers can be an interesting source population for the upcoming LISA mission with signal-to-noise ratios $\\gtrsim$ 1000. Furthermore, the progenitor SMBH properties imply that GX was likely formed through a major, gas-rich (``wet'') merger between two galaxies of comparable mass, with a mass ratio $\\lesssim 4$.",
      "pdf_url": "https://arxiv.org/pdf/2601.18986.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.19405",
      "title": "Numerical simulations of black hole-neutron star mergers with equal and near-equal mass ratios",
      "authors": [
        "Ivan Markin",
        "Mattia Bulla",
        "Tim Dietrich"
      ],
      "abstract": "Numerical simulations of black hole-neutron star mergers with equal and near-equal mass ratios Ivan Markin, Mattia Bulla, Tim Dietrich 19 pages, 9 figures, to be submitted to PRD High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The detection of GW230529_181500 suggested the existence of more symmetric black hole-neutron star mergers where the black hole mass can be as low as 2.6 times that of the neutron star. Black hole-neutron star binaries with even more symmetric mass ratios are expected to leave behind massive disks capable of driving bright electromagnetic transients like kilonovae. Currently, there is only a limited number of numerical-relativity simulations of black hole-neutron star mergers in this regime, which are vital for accurate gravitational waveform models and analytical fitting formulas for the remnant properties. Insufficient accuracy of these may lead to misclassification of real events and potentially missed opportunities to locate their electromagnetic counterparts. To fill this gap in the parameter space coverage, we perform simulations of black hole-neutron star mergers with mass ratios $q \\in \\{1, 1/2, 1/3\\}$. We find the gravitational waveform models do not show good agreement with the numerical waveforms, with dephasing at the level of around 1 rad at the merger. We find that the masses of the dynamical ejecta and disk are in good agreement with the available fitting formulas. The analytical formulas for the remnant black hole are in excellent agreement for the black hole mass, but are less accurate with the predictions for its spin. Moreover, we analyze the remnant disk structure and dynamics, deriving the rotation law and identifying global trapped $g$-mode density oscillations. We distinguish three types of accretion in the postmerger and find modulation of the accretion rate by the global oscillations of the disk. Finally, we model the kilonova emission these systems would produce and find that most of them are potentially detectable by Vera C. Rubin Observatory within four days after merger, and by DECam within two days after merger if located at a distance of 200 Mpc.",
      "pdf_url": "https://arxiv.org/pdf/2601.19405.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.19616",
      "title": "On the rarity of rocket-driven Penrose extraction in Kerr spacetime",
      "authors": [
        "An T. Le"
      ],
      "abstract": "On the rarity of rocket-driven Penrose extraction in Kerr spacetime An T. Le 17 pages, 6 figures, 8 tables, submitted to Physical Review D High Energy Astrophysical Phenomena (astro-ph.HE); Systems and Control (eess.SY); General Relativity and Quantum Cosmology (gr-qc); Computational Physics (physics.comp-ph) We present a Monte Carlo study of energy extraction from rotating (Kerr) black holes via the Penrose process using rocket propulsion. Through over 250,000 trajectory simulations, we establish sharp constraints on when Penrose extraction with escape to infinity succeeds. The mechanism requires that exhaust ejected inside the ergosphere carries negative Killing energy, which is kinematically accessible only via ultra-relativistic ejection deep within the ergosphere. We find that successful extraction with escape is statistically rare ($\\sim$1% in broad parameter scans) and is governed by strict thresholds: it requires high black hole spin (empirically $a/M \\gtrsim 0.89$) and ultra-relativistic exhaust velocity (onset at $v_e \\approx 0.91c$). When conditions are highly tuned to a specific \"sweet spot,\" success rates can reach 88.5%, representing a narrow extraction window rather than generic behavior. Furthermore, single-impulse thrust at periapsis achieves significantly higher cumulative efficiency ($\\eta_{\\rm cum} \\approx 19\\%$) compared to continuous thrust ($\\sim$2--4%) due to path-averaging penalties. These constraints quantify the extreme fine-tuning required for material-based Penrose extraction, consistent with the astrophysical dominance of electromagnetic mechanisms. Simulation code is available at this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2601.19616.pdf",
      "categories": [
        "astro-ph.HE",
        "eess.SY",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19812",
      "title": "An essential building block for cosmological zoom-in perturbation theory",
      "authors": [
        "Obinna Umeh"
      ],
      "abstract": "An essential building block for cosmological zoom-in perturbation theory Obinna Umeh Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The evolution of large-scale structure within the standard model of cosmology is well posed only up to the onset of shell crossing, where particle trajectories appear to intersect. Beyond this point, the evolution equations become non-predictive and perturbative approaches break down. We show that in General Relativity, a matter horizon forms before caustics develop for a well-defined initial over-density on an expanding FLRW spacetime. The matter horizon was first identified by Ellis and Stoeger in 2010 as a dynamical causal boundary that encloses a sub-region of spacetime where structure formation actually takes place. We construct a multi-scale hierarchical framework for the propagation of geodesic congruences that avoids the shell-crossing singularity by cutting the spacetime at the matter horizon and glueing to another spacetime with opposite orientation. We identify a relationship between the multi-scale hierarchical framework and the cosmological zoom-in N-body simulation approach, and relate the local sub-region that decouples from the Hubble flow to the region of interest in cosmological zoom-in N-body simulations. Most importantly, the multi-scale hierarchical framework provides a more robust way of implementing boundary conditions, which could benefit cosmological zoom-in N-body simulation approaches.",
      "pdf_url": "https://arxiv.org/pdf/2601.19812.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19861",
      "title": "Testing the Equivalence Principle in Galaxy Clusters",
      "authors": [
        "Enea Di Dio",
        "Sveva Castello",
        "Camille Bonvin"
      ],
      "abstract": "Testing the Equivalence Principle in Galaxy Clusters Enea Di Dio, Sveva Castello, Camille Bonvin 24 pages, 4 figures in main text, 3 figures in appendices. Comments welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Clusters of galaxies have been used to measure a subtle effect predicted by Einstein: gravitational redshift. This signal encodes pristine information about our Universe, since it is sensitive to the depth of the clusters' gravitational potential wells. In this work, we show how gravitational redshift can be used to test a fundamental physical principle: the weak equivalence principle. This principle stipulates that all matter falls in the same way in a gravitational potential, regardless of its nature. By comparing the amplitude of the gravitational redshift signal with the velocity dispersion in galaxy clusters, we build a novel test of this principle targeted to the unknown dark matter. Our test is sensitive to any additional interaction that would alter the way dark matter falls in gravitational potentials, hence leading to a violation of the equivalence principle. We show that currently available data can constrain the presence of a fifth force in clusters at the level of 7-14%, while the newest surveys will reach a precision of a few percents. This demonstrates the crucial role played by galaxy clusters in testing fundamental properties of dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2601.19861.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2409.02175",
      "title": "Primordial black holes from an interrupted phase transition",
      "authors": [
        "Wen-Yuan Ai",
        "Lucien Heurtier",
        "Tae Hyun Jung"
      ],
      "abstract": "Primordial black holes from an interrupted phase transition Wen-Yuan Ai, Lucien Heurtier, Tae Hyun Jung 13 pages, 7 figures; v2: title changed, added a new section in the appendix + other minor changes, refs updated; v3: matches the published version Phys. Rev. D 113, 023542 (2026) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We propose a new mechanism of primordial black hole formation via an interrupted phase transition during the early matter-dominated stage of reheating after inflation. In reheating, induced by the decay of a pressureless fluid dominating the Universe at the end of inflation, dubbed as reheaton, the temperature of the radiation bath typically increases, reaching a maximum temperature $T_{\\rm max}$, and then decreases. We consider a first-order phase transition induced by the increase of the temperature that is aborted as $T_{\\rm max}$ is higher than the critical temperature but not sufficiently high for the bubble nucleation rate to overcome the expansion of the Universe. Although bubbles never fully occupy the space, some may be nucleated and expand until the temperature once again decreases to the critical temperature. We argue that these bubbles shrink and disappear as the temperature drops further, leaving behind macroscopic spherical regions with positive density perturbations. These perturbed regions accrete the surrounding matter (reheatons) and eventually collapse into primordial black holes whose mass continues to grow until the onset of radiation domination. We estimate the abundance of these primordial black holes in terms of the bubble nucleation rate at $T_{\\rm max}$, and demonstrate that the abundance can be significantly large from a phenomenological perspective.",
      "pdf_url": "https://arxiv.org/pdf/2409.02175.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.00994",
      "title": "Interacting dark energy after DESI DR2: a challenge for $Λ$CDM paradigm?",
      "authors": [
        "Supriya Pan",
        "Sivasish Paul",
        "Emmanuel N. Saridakis",
        "Weiqiang Yang"
      ],
      "abstract": "Interacting dark energy after DESI DR2: a challenge for $Λ$CDM paradigm? Supriya Pan, Sivasish Paul, Emmanuel N. Saridakis, Weiqiang Yang 12 pages including references; 4 tables, 6 captioned figures; published version in Phys. Rev. D Phys.Rev.D \\textbf{113} (2026) 2, 023515 Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate the scenario of interacting dark energy through a detailed confrontation with various observational datasets. We quantify the interaction in a general way, through the deviation from the standard scaling of the dark matter energy density. We use the cosmic microwave background (CMB) data from Planck 2018, data from Baryon Acoustic Oscillations (BAO) from the recently released DESI DR2, observational Hubble Data from Cosmic Chronometers (CC), and finally various Supernova Type Ia (SNIa) datasets (PantheonPlus, Union3 and DESY5). For the basic and simplest interacting model we find a mild preference of the interaction at slightly more than $1\\sigma$ however still within $2\\sigma$, and thus no strong evidence of interaction is found. However, comparison with $\\Lambda$ cold dark matter ($\\Lambda$CDM) scenario through $\\Delta \\chi^2_{\\rm min}$, Akaike Information Criterion and Bayesian analysis, reveals a mixed picture, namely according to $\\Delta \\chi^2_{\\rm min}$ the interaction is mildly favored by most of the datasets, while the remaining statistical measures are inclined toward $\\Lambda$CDM.",
      "pdf_url": "https://arxiv.org/pdf/2504.00994.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.16544",
      "title": "Black holes as telescopes: Discovering supermassive binaries through quasi-periodic lensed starlight",
      "authors": [
        "Hanxi Wang",
        "Miguel Zumalacárregui",
        "Bence Kocsis"
      ],
      "abstract": "Black holes as telescopes: Discovering supermassive binaries through quasi-periodic lensed starlight Hanxi Wang, Miguel Zumalacárregui, Bence Kocsis 26 pages, 10 figures, accepted for publication in PRL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Supermassive black hole (SMBH) binary systems are unavoidable outcomes of galaxy mergers. Their dynamics encode information about their formation and growth, the composition of their host galactic nuclei, the evolution of galaxies, and the nature of gravity. Many SMBH binaries with separations pc-kpc have been found, but closer (sub-parsec) binaries remain to be confirmed. Identifying these systems may elucidate how binaries evolve past the ``final parsec'' until gravitational radiation drives them to coalescence. Here we show that SMBH binaries in non-active galactic nuclei can be identified and characterized by the gravitational lensing of individual bright stars, located behind them in the host galaxy. The rotation of `caustics' -- regions where sources are hugely magnified due to the SMBH binary's orbit and inspiral -- leads to Quasi-Periodic Lensing of Starlight (QPLS). The extreme lensing magnification of individual bright stars produces a significant variation in the host galaxies' luminosity; their lightcurve traces the orbit of the SMBH binary and its evolution. QPLS probes the population of sources observable by pulsar timing arrays and space detectors (LISA, TianQin), offering advance warning triggers for merging SMBHs for coincident or follow-up GW detections. SMBH population models predict $1-50\\; [190-5,000] \\left({n_\\star}/{\\rm pc}^{-3}\\right)$ QPLS binaries with period less than $10\\; [40]$ yr with comparable masses and $z<0.3$, where $n_\\star$ is the stellar number density. Additionally, stellar and orbital motion will lead to frequent instances of single/double flares caused by SMBHBs with longer periods. This novel signature can be searched for in a wealth of existing and upcoming time-domain photometric data: identifying quasi-periodic variability in galactic lightcurves will reveal an ensemble of binary systems and illuminate outstanding questions around them.",
      "pdf_url": "https://arxiv.org/pdf/2506.16544.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.16903",
      "title": "Convection signatures in early-time gravitational waves from core-collapse supernovae",
      "authors": [
        "Marco Cusinato",
        "Martin Obergaulinger",
        "Miguel-Ángel Aloy"
      ],
      "abstract": "Convection signatures in early-time gravitational waves from core-collapse supernovae Marco Cusinato, Martin Obergaulinger, Miguel-Ángel Aloy High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Gravitational waves emitted from core-collapse supernova explosions are critical observables for extracting information about the dynamics and properties of both the progenitor and the post-bounce~evolution of the system. They are prime targets for current interferometric searches and represent a key milestone for the capabilities of next-generation interferometers. This study aims to characterize how the gravitational waveform associated with prompt stellar convection depends on the rotational rate and magnetic field topology of the progenitor star. We carry out a series of axisymmetric simulations of a $16.5\\,\\mathrm{M}_\\odot$ red supergiant with five configurations of initial magnetic fields and varying degrees of initial rotation. We then analyze the contribution of early-time convection and the proto-neutron star core to the waveform using ensemble empirical mode decomposition, alongside spectral and Fourier analyses, to facilitate comparison and interpretation of the results. Our simulations reveal that early post-bounce gravitational waves signals are dominated by the first six intrinsic mode functions, with variations due to rotation and magnetic fields influencing the signal strength. Strong magnetic fields decelerate core rotation, affecting mode excitation. Regardless of the initial rotation, convection consistently drives a low-frequency mode that lasts throughout the evolution. Additionally, our results show that the bounce signal is not consistently the strongest component of the waveform. Instead, we find that prompt convection generates a post-bounce signal of comparable or even greater amplitude.",
      "pdf_url": "https://arxiv.org/pdf/2507.16903.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.18862",
      "title": "Redshift-space 21-cm bispectrum multipoles as an SKA-era gravity test in the post-reionization Universe",
      "authors": [
        "Sourav Pal",
        "Debanjan Sarkar"
      ],
      "abstract": "Redshift-space 21-cm bispectrum multipoles as an SKA-era gravity test in the post-reionization Universe Sourav Pal, Debanjan Sarkar 18 pages, 9 figures. Comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) The redshifted 21-cm line from neutral hydrogen ($\\textrm{H}\\textsc{i}$) enables volumetric intensity mapping of large-scale structure in the post-reionization Universe. In anticipation of \\texttt{SKA-MID}'s wide redshift coverage and high signal-to-noise clustering measurements, we study the redshift-space 21-cm bispectrum and its spherical-harmonic multipoles as probes of anisotropic non-linear structure formation and departures from General Relativity. Using a tree-level perturbative description for the 21-cm brightness-temperature field in redshift space, and adopting the Hu--Sawicki $f(R)$ model as a representative modified-gravity scenario, we forecast the detectability of configuration-dependent signatures with an \\texttt{SKA-MID}--like survey. We derive the bispectrum-multipole covariance including sample variance and thermal noise and evaluate the expected signal-to-noise of deviations relative to $\\Lambda$CDM. We find that the observable information is dominated by the lowest multipoles, while higher-order modes are strongly suppressed. This concentration in the lowest multipoles is well matched to \\texttt{SKA-MID} sensitivity and to the quasi-linear modes that are expected to remain accessible in practice. The strongest modified-gravity sensitivity arises from squeezed and stretched triangle configurations on quasi-linear scales, where scale-dependent growth enhances the bispectrum relative to the total variance. Our results position 21-cm bispectrum multipoles as a practical, SKA-ready observable for testing gravity beyond $\\Lambda$CDM in the post-reionization epoch.",
      "pdf_url": "https://arxiv.org/pdf/2601.18862.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19108",
      "title": "Non-linear evolution in $f(R)$ gravity: iterative modelling of the Chameleon mechanism",
      "authors": [
        "Sharvari Nadkarni-Ghosh",
        "Tanush Reddy Vaka"
      ],
      "abstract": "Non-linear evolution in $f(R)$ gravity: iterative modelling of the Chameleon mechanism Sharvari Nadkarni-Ghosh, Tanush Reddy Vaka Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the non-linear evolution of matter perturbations in $f(R)$ models with the Chameleon screening mechanism. The novel feature of our investigation is an iterative solution for the non-linear equation for the scalar field $\\chi = \\Phi - \\Psi$, where $\\Phi$ and $\\Psi$ are the potentials that characterise scalar perturbations of the metric. We demonstrate the scheme on spherical perturbations - smooth, compensated top-hats of varying length scales. We find that the effect of the Chameleon mechanism is seen most prominently on scales where the size of the top-hat is comparable to the Compton scale of the background. There is a density enhancement near the outer edge of the top-hat and the top-hat does not retain its shape. We explain this well-known observation in the context of the spatio-temporal evolution of the Compton scale. Additionally, we find a slight enhancement of the density near the origin, a feature not reported previously in the literature. On scales much smaller or much larger than the background Compton length, including the Chameleon screening has no appreciable effect on the perturbations. In the former, the growth is enhanced as compared to GR and is almost the same as GR in the latter. Finally, we examine the non-linear density velocity divergence (DVDR) relation and find that for evolution affected by Chameleon screening, the DVDR is no longer one-to-one even for a single profile. The relation between density and velocity depends on the location within the perturbation.",
      "pdf_url": "https://arxiv.org/pdf/2601.19108.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19150",
      "title": "Q-balls from thermal balls during a first-order phase transition: a numerical study",
      "authors": [
        "Yuan-Jie Li",
        "Jing Liu",
        "Zong-Kuan Guo"
      ],
      "abstract": "Q-balls from thermal balls during a first-order phase transition: a numerical study Yuan-Jie Li, Jing Liu, Zong-Kuan Guo Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We numerically study the Q-ball formation triggered by a cosmological first-order phase transition within the Friedberg-Lee-Sirlin model. By performing lattice simulations, we track the nonequilibrium dynamics throughout the transition, providing a precise description of the Q-ball formation mechanism and the resulting mass spectrum. Collapsing false-vacuum regions first form thermal balls, which subsequently cool via dissipative interactions and stabilize into long-lived Q-balls with nonzero spin. We observe a large population of low-mass Q-balls, as well as rare, massive Q-balls that are several times larger than the analytical prediction. The final Q-ball population exhibits a broad mass spectrum spanning over two orders of magnitude, characterized by an exponential tail of number density at large masses. The simulations suggest that the Q-ball abundance is approximately $50\\%$ higher than predicted by analytical estimates, adjusting the result in the context of Q-balls as dark matter candidates.",
      "pdf_url": "https://arxiv.org/pdf/2601.19150.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19268",
      "title": "Local environmental dependence on weak-lensing shear statistics",
      "authors": [
        "Sonia Akter Ema",
        "Md Rasel Hossen",
        "Krzysztof Bolejko",
        "Geraint F. Lewis"
      ],
      "abstract": "Local environmental dependence on weak-lensing shear statistics Sonia Akter Ema, Md Rasel Hossen, Krzysztof Bolejko, Geraint F. Lewis 16 pages, 14 figures, Accepted for publication in Physical Review D Cosmology and Nongalactic Astrophysics (astro-ph.CO) Despite the assumption that an ideal FLRW observer is not dependent on the local environment, observations are biased by the positions of the observers due to the matter correlations in the large-scale structure (LSS) of the universe. The variation of the mass distribution of the LSS of the universe implies that observers residing in different locations may suffer bias in their measurements when they look at the images of distant galaxies. Here, we assess the influence of the local environment on weak gravitational lensing (WL) shear statistics in the context of relativistic $N$-body code, \\texttt{gevolution}. We derive numerical constraints on the cosmological parameters from the WL shear angular power spectrum and comment on the local environment's influence on WL shear. We find tighter constraints on the parameter $\\Omega_\\mathrm{m}$ above redshift $z$ = 0.2, which implies over this redshift the local environment's impact is minor. We also investigate the bispectrum and conclude that on average the impact of the local environment on $f_{\\rm NL}$ (a measure of non-Gaussianities) is minimal and consistent with zero effect. However, we find that within the assembly of all possible observers/locations, there will also be a few that could infer the parameter $f_{\\rm NL}$ of the order 10. These results could thus be used to estimate the uncertainty in the inference of cosmological parameters such as $f_{\\rm NL}$ based on WL shear bispectrum and thus may have implications for future surveys requiring precision at the percent level.",
      "pdf_url": "https://arxiv.org/pdf/2601.19268.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19390",
      "title": "Almanac: HMC sampling with bounded velocity",
      "authors": [
        "Javier Silva Lafaurie",
        "Lorne Whiteway",
        "Elena Sellentin",
        "Kutay Nazli",
        "Andrew H. Jaffe",
        "Alan F. Heavens",
        "Arthur Loureiro"
      ],
      "abstract": "Almanac: HMC sampling with bounded velocity Javier Silva Lafaurie, Lorne Whiteway, Elena Sellentin, Kutay Nazli, Andrew H. Jaffe, Alan F. Heavens, Arthur Loureiro Cosmology and Nongalactic Astrophysics (astro-ph.CO); Applications (stat.AP) In Hamiltonian Monte Carlo sampling, the shape of the potential and the choice of the momentum distribution jointly give rise to the Hamiltonian dynamics of the sampler. An efficient sampler propagates quickly in all regions of the parameter space, so that the chain has a low autocorrelation length and the sampler has a high acceptance rate, with the goal of optimising the number of near-independent samples for given computational cost. Standard Gaussian momentum distributions allow arbitrarily large velocities, which can lead to inefficient exploration in posteriors with ridges or funnel-like geometries. We investigate alternative momentum distributions based on relativistic and Student's t kinetic energies, which naturally limit particle velocities and may improve robustness. Using Almanac, a sampler for cosmological posterior distributions of sky maps and power spectra on the sphere, we test these alternatives in both low- and high-dimensional settings. We find that the choice of parameterization and momentum distribution can improve convergence and effective sample rate, though the achievable gains are generally modest and strongly problem-dependent, reaching up to an order of magnitude in favorable cases. Among the momentum distributions that we tested, those with moderately heavy tails achieved the best balance between efficiency and stability. These results highlight the importance of sampler design and encourage future work on adaptive and self-tuning strategies for kinetic energy parameter optimization in high-dimensional settings.",
      "pdf_url": "https://arxiv.org/pdf/2601.19390.pdf",
      "categories": [
        "astro-ph.CO",
        "stat.AP"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19412",
      "title": "A thin disk and a nearly universal accretion rate in luminous quasars",
      "authors": [
        "G. Risaliti",
        "B. Trefoloni",
        "M. Salvati"
      ],
      "abstract": "A thin disk and a nearly universal accretion rate in luminous quasars G. Risaliti, B. Trefoloni, M. Salvati 9 Pages, 8 Figures. Submitted to Astronomy & Astrophysics. Comments are very welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) Quasars accretion models predict a broad range of optical and ultraviolet properties that depend primarily on black hole mass and accretion rate. Yet, most optically selected luminous quasars display strikingly similar continuum spectra. We show that this uniformity can be explained by a nearly constant luminosity to mass (Eddington) ratio, L_EDD and by thermal emission from a standard, optically thick, geometrically thin accretion disc. A standard disk with an Eddington ratio L_EDD=0.1 reproduces both the black hole mass/luminosity distribution of Sloan Digital Sky Survey (SDSS) quasars and their principal continuum properties. In this framework, the spectral energy distribution peaks beyond the observable ultraviolet range for nearly all sources. We show that the few quasars, expected to be cold enough to shift the peak into the observable region, indeed show this behaviour. This scenario is further supported by an analysis of the relation between the luminosity of the main broad emission lines and the continuum luminosity (i.e. the Baldwin effect). We find that 1) the observed slopes of the line to continuum relations match the expectations from the standard disk model, if we assume that the line emission is a good proxy of the ionizing luminosity; 2) the dispersions of the line-continuum luminosity relations are very small (as small as 0.13 dex), suggesting that the physics of the disk-broad line region system is dominated by only one parameter (the black hole mass) with a nearly constant Eddington ratio. Finally, we notice that our hypothesis of constant L_EDD=0.1 provides a black hole mass estimate (based on the observed luminosity) with a smaller error than the virial estimate.",
      "pdf_url": "https://arxiv.org/pdf/2601.19412.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19424",
      "title": "Union3.1: Self-consistent Measurements of Host Galaxy Properties for 2000 Type Ia Supernovae",
      "authors": [
        "Taylor J. Hoyt",
        "David Rubin",
        "Greg Aldering",
        "Saul Perlmutter",
        "Andrei Cuceu",
        "Ravi Gupta"
      ],
      "abstract": "Union3.1: Self-consistent Measurements of Host Galaxy Properties for 2000 Type Ia Supernovae Taylor J. Hoyt, David Rubin, Greg Aldering, Saul Perlmutter, Andrei Cuceu, Ravi Gupta 22 pages and 10 figures (main body); 39 pages and 25 figures (total including Appendices) Cosmology and Nongalactic Astrophysics (astro-ph.CO) The determination of distances using time-series photometry of Type Ia supernovae (SNe Ia) relies on a ~5% empirical correction related to the properties of their host galaxies, e.g., global stellar mass. It is therefore crucial for unbiased cosmology inference that host galaxy properties be self-consistently determined across the full range of redshifts probed, which we undertake in this study for approximately 2000 SNe in the Union3 compilation (now Union3.1). We use aperture-matched, homogeneously-reduced, optical-infrared photometry from the DESI Legacy Imaging Surveys to derive global galaxy properties using the stellar population synthesis and SED-fitting code Prospector. We find that the host masses of $z<0.10$ SNe in Union3 were, on average, overestimated relative to the rest of the sample, while the opposite was true for $z<0.15$ SNe in Pantheon+. After correction, the two studies' average distance modulus estimated for low-redshift SNe, previously $>0.03$ mag discrepant, come into 0.01 mag agreement. We then update the UNITY SN analysis and find that the uncertainties on all standardization parameters shrink to 0.6-0.9x their previous sizes. For flat-$\\Lambda$CDM, we find $\\Omega_m=0.344^{+0.026}_{-0.025}$, a -0.3$\\sigma$ shift from Union3. We then combine with measurements of Baryon Acoustic Oscillations (BAO) and the Cosmic Microwave Background (CMB) exactly as done by DESI DR2 and find $w_0=-0.719\\pm0.084$, $w_a=-0.95^{+0.29}_{-0.26}$, corresponding to 3.4$\\sigma$ evidence against a cosmological constant (down from 3.8$\\sigma$). We also update the DESI combined probe analysis using our correction to Pantheon+ and the recent DES-SN5YR Dovekie recalibration, finding $3.2\\sigma$ (up from 2.8$\\sigma$) and 3.4$\\sigma$ (down from 4.2$\\sigma$) evidence against a cosmological constant in the $w_0w_a$ plane, altogether marking a significantly improved consistency across SN analyses.",
      "pdf_url": "https://arxiv.org/pdf/2601.19424.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19438",
      "title": "Large-scale Modeling of the Observed Power Spectrum Multipoles",
      "authors": [
        "Robin Y. Wen",
        "Henry S. Grasshorn Gebhardt",
        "Chen Heinrich",
        "Olivier Doré"
      ],
      "abstract": "Large-scale Modeling of the Observed Power Spectrum Multipoles Robin Y. Wen, Henry S. Grasshorn Gebhardt, Chen Heinrich, Olivier Doré Cosmology and Nongalactic Astrophysics (astro-ph.CO) Current and upcoming large-scale structure surveys are pushing toward increasingly wide angular coverage, where wide-angle effects (arising from the varying line of sight across the curved sky) become critical for accurate modeling of the three-dimensional galaxy power spectrum. At the same time, these survey's broader redshift reach makes the effects of redshift evolution (beyond the effective-redshift approximation) non-negligible on large radial scales. Additional observational effects such as the survey window function and integral constraints also become significant on these large scales, necessitating a careful theoretical treatment to robustly constrain local primordial non-Gaussianities and relativistic effects. In this work, we present a consistent and accurate theoretical framework for modeling the commonly used power spectrum multipoles (PSM) on large scales using the discrete spherical Fourier-Bessel (dSFB) basis. This basis ensures numerical stability and allows an exact separation between angular and radial modes. Using the dSFB basis, we study the impact of wide-angle effects and redshift evolution on the PSM, and incorporate the effects of window function convolution and integral constraints. We validate our PSM modeling using lognormal mocks under radial integral constraints with realistic survey geometries, demonstrating the readiness of our framework for application to all-sky galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2601.19438.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19450",
      "title": "Minkowski Functionals of the 21 cm Signal as a Probe of Primordial Features",
      "authors": [
        "Kanan Virkar , Suvedha Suresh Naik , Pravabati Chingangbam Indian Institute of Astrophysics, Korea Institute for Advanced Study )"
      ],
      "abstract": "Minkowski Functionals of the 21 cm Signal as a Probe of Primordial Features Kanan Virkar (1), Suvedha Suresh Naik (2), Pravabati Chingangbam (1) ((1) Indian Institute of Astrophysics, (2) Korea Institute for Advanced Study (KIAS)) 31 pages, 14 figures, Prepared for submission to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) The redshifted 21 cm signal from the cosmic dawn and Epoch of Reionization (EoR) encodes important information about both astrophysical processes and primordial physics, such as inflation. In this work, we use morphological statistics to explore the sensitivity of the 21 cm signal to inflationary features and EoR dynamics simultaneously. Focusing on primordial features from particle production during inflation we generate semi-numerical simulations of the 21 cm signal across redshifts 5 < z < 35, incorporating these features. Using Minkowski Functionals (MFs), we analyze the morphology of 21 cm fields: density, neutral hydrogen fraction, spin temperature, and brightness temperature. We demonstrate that MFs are highly sensitive to both the amplitude and scale of primordial features, capturing rich morphological information. In particular, we show that MFs can robustly identify inflationary features and distinguish them from the standard model. We further explore various EoR scenarios, and demonstrate that combining MFs across redshifts can disentangle the signatures of primordial features from EoR effects. This approach opens new avenues for probing inflation with upcoming 21 cm surveys.",
      "pdf_url": "https://arxiv.org/pdf/2601.19450.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19662",
      "title": "A study of dark matter-dark energy interaction under the DESI DR2 data constraint",
      "authors": [
        "Amin Aboubrahim",
        "Pran Nath"
      ],
      "abstract": "A study of dark matter-dark energy interaction under the DESI DR2 data constraint Amin Aboubrahim, Pran Nath Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) While $\\Lambda$CDM provides a good fit to cosmological data, it fails to address many of the outstanding questions in contemporary cosmology. Chief among these are the Hubble tension and the apparent dynamical nature of dark energy as inferred from the recent DESI DR2 analysis. In this work, we analyze a field-theoretic description of cosmology where both dark energy and dark matter are interacting spin zero fields. We give a thorough study of a wide range of the interaction strength and demonstrate the effect on the dark energy equation of state and the Hubble tension. Using the recent cosmological data, we extract constraints on cosmological parameters including the free parameters of the model.",
      "pdf_url": "https://arxiv.org/pdf/2601.19662.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19696",
      "title": "Lensing without mixing: Probing Baryonic Acoustic Oscillations and other scale-dependent features in cosmic shear surveys",
      "authors": [
        "David Touzeau",
        "Alexandre Barthélémy",
        "Francis Bernardeau"
      ],
      "abstract": "Lensing without mixing: Probing Baryonic Acoustic Oscillations and other scale-dependent features in cosmic shear surveys David Touzeau, Alexandre Barthélémy, Francis Bernardeau 15 pages, 15 figures, submitted to PRD Cosmology and Nongalactic Astrophysics (astro-ph.CO) Weak-gravitational lensing tends to wash out scale and time-dependent features of the clustering of matter, such as the Baryonic Acoustic Oscillations (BAO) which appear in the form of wiggles in the matter power spectrum but that disappear in the analogous lensing $C_\\ell$. This is a direct consequence of lensing being a projected effect. In this paper, we demonstrate how the noise complexity -- often deemed \"erasing the signal\" -- induced by a particular de-projection technique, the Bernardeau-Nishimichi-Taruya (BNT) transform arXiv:1312.0430, can be used to extract the BAO signal and non-gaussian aperture-mass-like properties at chosen physical scales. We take into account parts of the data vectors that should effectively be without cosmological signature and also introduce an additional re-weighting designed to specifically highlight clustering features -- both at the probe (summary statistics) or map (amplitude of the field) level. We thus demonstrate why weak-gravitational lensing by the large-scale structure of the Universe, though only in a tomographic setting, does not erase scale and time-dependent features of the dynamics of matter, while providing a tool to effectively extract them from actual galaxy-shapes measurements.",
      "pdf_url": "https://arxiv.org/pdf/2601.19696.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19854",
      "title": "Banana Split: Improved Cosmological Constraints with Two Light-Curve-Shape and Color Populations Using Union3.1+UNITY1.8",
      "authors": [
        "David Rubin",
        "Taylor Hoyt",
        "Greg Aldering",
        "Saul Perlmutter"
      ],
      "abstract": "Banana Split: Improved Cosmological Constraints with Two Light-Curve-Shape and Color Populations Using Union3.1+UNITY1.8 David Rubin, Taylor Hoyt, Greg Aldering, Saul Perlmutter Cosmology and Nongalactic Astrophysics (astro-ph.CO) SNe Ia have been used to provide key constraints on the equation-of-state parameter of dark energy. They are generally standardized under the assumption that they belong to a single population, with luminosities standardized in a continuous (roughly linear) fashion using the observed light-curve timescale. We update the Union3+UNITY1.5 SN cosmology analysis in light of increasing evidence for at least two core populations of SNe Ia and apply this \"UNITY1.8\" model to the updated \"Union3.1\" compilation (Hoyt et al. 2026). In addition to finding evidence for two different light-curve-shape (x1) distributions, we also find that the color distributions are different, that the light-curve-shape/magnitude standardization relations are different, and that these populations have different distributions across host-galaxy stellar mass and redshift. Importantly, we find that the residual host-mass luminosity step found in prior SN Ia cosmology analyses is now consistent with zero for unreddened SNe. We report a significantly tightened constraint on the split in the red-color standardization between SNe in low- and high-mass galaxies. We find that the estimated uncertainties shrink on cosmological parameters when fitting the same SNe assuming two modes versus one mode. We confirm similar trends in simulated data when running both versions of UNITY on the same (two-mode) simulations. For a flat LambdaCDM cosmology, we find Om = 0.334+0.025-0.024 from SNe alone; for a flat w0-wa cosmology, we find w0 = -0.760+0.084-0.082 and wa = -0.79+0.28-0.30 when including SNe, BAO, and CMB. In the 2D w0-wa plane, adding SNe to BAO and compressed CMB increases the tension with flat LambdaCDM from 2.1 sigma to 2.6 sigma.",
      "pdf_url": "https://arxiv.org/pdf/2601.19854.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18890",
      "title": "Testing the inference of kinematics from mock JWST NIRSpec/MSA observations of TNG50 galaxies at $z\\sim2-6$",
      "authors": [
        "Ravishankar Anirudh",
        "Anna de Graaff",
        "Florian Lacroix",
        "Sedona H. Price",
        "Annalisa Pillepich"
      ],
      "abstract": "Testing the inference of kinematics from mock JWST NIRSpec/MSA observations of TNG50 galaxies at $z\\sim2-6$ Ravishankar Anirudh, Anna de Graaff, Florian Lacroix, Sedona H. Price, Annalisa Pillepich Submitted to MNRAS. Key figures: 5, 8, 10, and 13. Comments welcome Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We use the TNG50 galaxy formation simulation to generate mock JWST NIRCam and NIRSpec microshutter array (MSA) observations of H$\\alpha$-emitting gas in $M_*=10^8-10^{11.5}\\,M_\\odot$ star-forming galaxies at $z=2-6$. We measure morphological properties from the mock imaging through Sersic profile fitting, and gas rotational velocities ($v$) and velocity dispersions ($\\sigma$) by fitting the mock spectra as thin, rotating discs. To test the efficacy of such simple parametric models in describing complex ionised gas kinematics, we compare the best-fit quantities to intrinsic simulation measurements. At $z=3$, we find that $v$ and $\\sigma$ for aligned and resolved sources generally agree well with intrinsic measurements, within a factor of $\\sim$2 and $\\sim$1.5, respectively. The recovery of kinematics is robust for smooth, disc-like systems, but $v$ and $\\sigma$ can be over- or underestimated by more than a factor of 2, respectively, for intrinsically elongated systems. The scatter in the recovery accuracy is larger at higher redshift, as TNG50 galaxies at $z>3$ deviate more strongly from the thin rotating disc assumption. Despite uncertain measurements for individual galaxies, we find that key population trends, such as the weak redshift evolution of $\\sigma$ and $v/\\sigma$ as well as the dependence of $\\sigma$ on the global star formation rate, are broadly recovered by our kinematic modelling. Our work provides the end-to-end framework needed to compare NIRSpec MSA observations to cosmological simulations and to quantify observational biases in measuring ionised gas kinematics, highlighting the need for the development of dedicated models for high-redshift galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2601.18890.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19863",
      "title": "Prompt cusps in hierarchical dark matter halos: Implications for annihilation boost",
      "authors": [
        "Shin'ichiro Ando",
        "Martin Moro",
        "Youyou Li"
      ],
      "abstract": "Prompt cusps in hierarchical dark matter halos: Implications for annihilation boost Shin'ichiro Ando, Martin Moro, Youyou Li Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Recent simulations have identified long-lived ``prompt cusps'' -- compact remnants of early density peaks with inner profiles $\\rho\\propto r^{-3/2}$. They can survive hierarchical assembly and potentially enhance signals of dark matter annihilation. In this work, we incorporate prompt cusps into the semi-analytic substructure framework \\textsc{SASHIMI}, enabling a fully hierarchical, environment-dependent calculation of the annihilation luminosity that consistently tracks subhalos, sub-subhalos, and tidal stripping. We assign prompt cusps to first-generation microhalos and propagate their survival through the merger history, including an explicit treatment of cusps associated with stripped substructure. We find that the substructure hierarchy converges rapidly once a few levels are included, and that prompt cusps can raise the total annihilation boost of Milky-Way--size hosts at $z=0$ to $B\\sim O(10)$ for fiducial cusp-occupation assumptions, compared to a subhalo-only baseline of $B_{\\rm sh}\\sim\\mathrm{few}$. Across a wide range of host masses and redshifts, prompt cusps increase the normalization of $B(M_{\\rm host},z)$ while largely preserving its mass and redshift trends. Compared to universal-average, peak-based estimates, our fiducial boosts are lower by about an order of magnitude, primarily reflecting a correspondingly smaller inferred cusp abundance in host halos, highlighting the importance of unifying peak-based cusp formation with merger-tree evolution and environmental dependence.",
      "pdf_url": "https://arxiv.org/pdf/2601.19863.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.15329",
      "title": "Euclid Quick Data Release (Q1). LEMON -- Lens Modelling with Neural networks. Automated and fast modelling of Euclid gravitational lenses with a singular isothermal ellipsoid mass profile",
      "authors": [
        "Euclid Collaboration: V. Busillo",
        "C. Tortora",
        "R. B. Metcalf",
        "J. W. Nightingale",
        "M. Meneghetti",
        "F. Gentile",
        "R. Gavazzi",
        "F. Zhong",
        "R. Li",
        "B. Clément",
        "G. Covone",
        "N. R. Napolitano",
        "F. Courbin",
        "M. Walmsley",
        "E. Jullo",
        "J. Pearson",
        "D. Scott",
        "A. M. C. Le Brun",
        "L. Leuzzi",
        "N. Aghanim",
        "B. Altieri",
        "A. Amara",
        "S. Andreon",
        "H. Aussel",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "P. Battaglia",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "V. F. Cardone",
        "J. Carretero",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "H. M. Courtois",
        "M. Cropper",
        "A. Da Silva",
        "H. Degaudenzi",
        "S. de la Torre",
        "G. De Lucia",
        "A. M. Di Giorgio",
        "J. Dinis",
        "H. Dole",
        "F. Dubath",
        "X. Dupac",
        "S. Dusini",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "S. Fotopoulou",
        "M. Frailis",
        "E. Franceschi",
        "S. Galeotta",
        "K. George",
        "W. Gillard",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "B. R. Granett",
        "A. Grazian",
        "F. Grupp",
        "S. V. H. Haugan",
        "W. Holmes",
        "I. Hook",
        "F. Hormuth",
        "A. Hornstrup",
        "P. Hudelot",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "B. Kubik",
        "M. Kümmel",
        "M. Kunz",
        "H. Kurki-Suonio",
        "Q. Le Boulc'h",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm"
      ],
      "abstract": "Euclid Quick Data Release (Q1). LEMON -- Lens Modelling with Neural networks. Automated and fast modelling of Euclid gravitational lenses with a singular isothermal ellipsoid mass profile Euclid Collaboration: V. Busillo, C. Tortora, R. B. Metcalf, J. W. Nightingale, M. Meneghetti, F. Gentile, R. Gavazzi, F. Zhong, R. Li, B. Clément, G. Covone, N. R. Napolitano, F. Courbin, M. Walmsley, E. Jullo, J. Pearson, D. Scott, A. M. C. Le Brun, L. Leuzzi, N. Aghanim, B. Altieri, A. Amara, S. Andreon, H. Aussel, C. Baccigalupi, M. Baldi, S. Bardelli, P. Battaglia, A. Biviano, E. Branchini, M. Brescia, J. Brinchmann, S. Camera, G. Cañas-Herrera, V. Capobianco, C. Carbone, V. F. Cardone, J. Carretero, S. Casas, M. Castellano, G. Castignani, S. Cavuoti, K. C. Chambers, A. Cimatti, C. Colodro-Conde, G. Congedo, C. J. Conselice, L. Conversi, Y. Copin, H. M. Courtois, M. Cropper, A. Da Silva, H. Degaudenzi, S. de la Torre, G. De Lucia, A. M. Di Giorgio, J. Dinis, H. Dole, F. Dubath, X. Dupac, S. Dusini, S. Escoffier, M. Farina, R. Farinelli, F. Faustini, S. Ferriol, F. Finelli, S. Fotopoulou, M. Frailis, E. Franceschi, S. Galeotta, K. George, W. Gillard, B. Gillis, C. Giocoli, J. Gracia-Carpio, B. R. Granett, A. Grazian, F. Grupp, S. V. H. Haugan, W. Holmes, I. Hook, F. Hormuth, A. Hornstrup, P. Hudelot, K. Jahnke, M. Jhabvala, B. Joachimi, E. Keihänen, S. Kermiche, A. Kiessling, B. Kubik, M. Kümmel, M. Kunz, H. Kurki-Suonio, Q. Le Boulc'h, S. Ligori, P. B. Lilje, V. Lindholm Paper submitted as part of the A&A Special Issue `Euclid Quick Data Release (Q1)', 23 pages, 17 figures, accepted for publication on A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Euclid mission aims to survey around 14000 deg^{2} of extragalactic sky, providing around 10^{5} gravitational lens images. Modelling of gravitational lenses is fundamental to estimate the total mass of the lens galaxy, along with its dark matter content. Traditional modelling of gravitational lenses is computationally intensive and requires manual input. In this paper, we use a Bayesian neural network, LEns MOdelling with Neural networks (LEMON), to model Euclid gravitational lenses with a singular isothermal ellipsoid mass profile. Our method estimates key lens mass profile parameters, such as the Einstein radius, while also predicting the light parameters of foreground galaxies and their uncertainties. We validate LEMON's performance on both mock Euclid datasets, real lenses observed with Hubble Space Telescope (HST), and real Euclid lenses, demonstrating the ability of LEMON to predict parameters of both simulated and real lenses. Results show promising accuracy and reliability in predicting the Einstein radius, mass and light ellipticities, effective radius, Sérsic index, lens magnitude, and unlensed source position for simulated lens galaxies. The application to real data, including the latest Quick Release 1 strong lens candidates, provides encouraging results in the recovery of the parameters for real lenses. We also verified that LEMON has the potential to accelerate traditional modelling methods, by giving to the classical optimiser the LEMON predictions as starting points, resulting in a speed-up of up to 26 times the original time needed to model a sample of gravitational lenses, a result that would be impossible with randomly initialised guesses. This work represents a significant step towards efficient, automated gravitational lens modelling, which is crucial for handling the large data volumes expected from Euclid.",
      "pdf_url": "https://arxiv.org/pdf/2503.15329.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.23140",
      "title": "Correlation between H$α$ emitters and their cosmic web environment at $z \\sim 1$",
      "authors": [
        "Ivan Rapoport",
        "Vincent Desjacques",
        "Ehud Behar",
        "Ravi K. Sheth"
      ],
      "abstract": "Correlation between H$α$ emitters and their cosmic web environment at $z \\sim 1$ Ivan Rapoport, Vincent Desjacques, Ehud Behar, Ravi K. Sheth Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Future near-infrared spectroscopic galaxy surveys will target high-redshift emission-line galaxies (ELGs) to test cosmological models. Deriving optimal constraints from emission-line galaxy clustering hinges on a robust understanding of their environmental dependence. Using the TNG300-1 simulation, we explore the correlation between properties of H$\\alpha$ emitters and their environment anisotropy rather than traditional density-based measures. Our galactic H$\\alpha$ emission model includes contributions from the warm interstellar medium. The environment anisotropy and type are assigned using a halo mass-dependent smoothing scale. We find that most luminous ELGs ($L_{\\rm{H}\\alpha}>10^{42}\\ \\rm{erg\\ s^{-1}}$) reside in filaments and knots. More generally, ELGs are more biased in strongly anisotropic environments. While correlations with galactic properties are found to be weak, they are statistically significant for host halo masses $M\\lesssim 10^{12}\\ M_\\odot/h$. Our analysis motivates further investigation into how environmental anisotropy influences galaxy evolution, and highlights the potential for leveraging these effects in the analyses of upcoming cosmological surveys.",
      "pdf_url": "https://arxiv.org/pdf/2506.23140.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.13450",
      "title": "Lensing the darkness: The matter density profile in cosmic voids from UNIONS",
      "authors": [
        "Hunter L. Martin",
        "Michael J. Hudson",
        "Alex Woodfinden",
        "Lucie Baumont",
        "Thomas de Boer",
        "Pierre A. Burger",
        "Jack Elvin-Poole",
        "Sébastien Fabbro",
        "Samuel Farrens",
        "Sacha Guerrini",
        "Axel Guinot",
        "Fabian Hervas-Peters",
        "Hendrik Hildebrandt",
        "Martin Kilbinger",
        "Magdy Morshed",
        "Ludovic van Waerbeke",
        "Anna Wittje"
      ],
      "abstract": "Lensing the darkness: The matter density profile in cosmic voids from UNIONS Hunter L. Martin, Michael J. Hudson, Alex Woodfinden, Lucie Baumont, Thomas de Boer, Pierre A. Burger, Jack Elvin-Poole, Sébastien Fabbro, Samuel Farrens, Sacha Guerrini, Axel Guinot, Fabian Hervas-Peters, Hendrik Hildebrandt, Martin Kilbinger, Magdy Morshed, Ludovic van Waerbeke, Anna Wittje 21 pages, 13 figures, accepted version for publication in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO) We measure the distribution of matter contained within the emptiest regions of the Universe: cosmic voids. We use the large overlap between the Ultraviolet Near-Infrared Optical Northern Survey (UNIONS) and voids identified in the LOWZ and CMASS catalogues of the Baryon Oscillation Spectroscopic Survey (BOSS) to constrain the excess surface mass density of voids using weak lensing. We present and validate a novel method for computing the Gaussian component of the conventional weak lensing covariance, adapted for use with void studies. We detect the stacked weak lensing void density profile at the $6.2\\sigma$ level, the most significant detection of void lensing from spectroscopically-identified voids to date. We find that large and small voids have different matter density profiles, as expected from numerical studies of void profiles. This difference is significant at the $2.3\\sigma$ level. Comparing the void profile to a measurement of the void-galaxy cross-correlation to test the linearity of the relationship between mass and light, we find good visual agreement between the two, and a galaxy bias factor of $2.45\\pm0.36$, consistent with other works. This work represents a promising detection of the lensing effect from underdensities, with the goal of promoting its development into a competitive cosmological probe.",
      "pdf_url": "https://arxiv.org/pdf/2507.13450.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.08251",
      "title": "Sensitivity toward dark matter annihilation imprints on 21-cm signal with SKA-Low: A convolutional neural network approach",
      "authors": [
        "Pravin Kumar Natwariya",
        "Kenji Kadota",
        "Atsushi J. Nishizawa"
      ],
      "abstract": "Sensitivity toward dark matter annihilation imprints on 21-cm signal with SKA-Low: A convolutional neural network approach Pravin Kumar Natwariya, Kenji Kadota, Atsushi J. Nishizawa 19 pages, 7 figures. Updated to match the published version Phys. Rev. D 113, 023038 (2026) Cosmology and Nongalactic Astrophysics (astro-ph.CO) This study investigates the sensitivity of the radio interferometers to identify imprints of spatially inhomogeneous dark matter annihilation signatures in the 21-cm signal during the pre-reionization era. We focus on the upcoming low-mode survey of the Square Kilometre Array (SKA-Low) telescope. Using CNNs, we analyze simulated 3D 21-cm differential brightness temperature maps generated via the DM21cm code, which is based on 21cmFAST and DarkHistory, to distinguish between spatially homogeneous and inhomogeneous energy injection/deposition scenarios arising from dark matter annihilation. The inhomogeneous case accounts for local dark matter density contrasts and gas properties, such as thermal and ionization states, while the homogeneous model assumes uniform energy deposition. Our study focuses on two primary annihilation channels to electron-positron pairs ($e^+e^-$) and photons ($\\gamma \\gamma$), exploring dark matter masses from 1 MeV to 100 MeV and a range of annihilation cross-sections. For $\\gamma \\gamma$ channel, the distinction across dark matter models is less pronounced due to the larger mean free path of the emitted photons, resulting in a more uniform energy deposition. For $e^+e^-$ channel, the results indicate that the CNNs can effectively differentiate between the inhomogeneous and homogeneous cases. Despite observational challenges, the results demonstrate that these effects remain detectable even after incorporating noise from next-generation radio interferometers, such as the SKA. We find that the inhomogeneous dark matter annihilation models can leave measurable imprints on the 21-cm signal maps distinguishable from the homogeneous scenarios for the dark matter masses $m_{\\rm DM}=1$ MeV and the annihilation cross-sections of $\\geq 5 \\times 10^{-30}~{\\rm cm^3/sec}$ ($\\geq 5 \\times 10^{-29}~{\\rm cm^3/sec}$ for $m_{\\rm DM}=100$ MeV) for moderate SKA-Low noise.",
      "pdf_url": "https://arxiv.org/pdf/2508.08251.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.22319",
      "title": "The life of central radio galaxies in clusters: AGN-ICM studies of eRASS1 clusters in the ASKAP fields",
      "authors": [
        "Angie Veronica",
        "Thomas H. Reiprich",
        "Florian Pacaud",
        "Marcus Brüggen",
        "Bärbel Koribalski",
        "Thomas Pasini",
        "Tessa Vernstrom",
        "Stefan W. Duchesne",
        "Kathrin Böckmann",
        "Jeremy S. Sanders",
        "Y. Emre Bahar",
        "Fabian Balzer",
        "Lachlan J. Barnes",
        "Esra Bulbul",
        "Nicolas Clerc",
        "Jessica E. M. Craig",
        "Johan Comparat",
        "Simon Dannhauer",
        "Jakob Dietl",
        "Klaus Dolag",
        "Vittorio Ghirardini",
        "Sebastian Grandis",
        "Duy Hoang",
        "Andrew M. Hopkins",
        "Zsofi Igo",
        "Matthias Kluge",
        "Ang Liu",
        "Konstantinos Migkas",
        "Vanessa A. Moss",
        "Miriam E. Ramos-Ceja",
        "Chris Riseley",
        "Lawrence Rudnick",
        "Mara Salvato",
        "Stanislav Shabala",
        "Riccardo Seppi",
        "Jacco van Loon",
        "Tayyaba Zafar",
        "Xiaoyuan Zhang"
      ],
      "abstract": "The life of central radio galaxies in clusters: AGN-ICM studies of eRASS1 clusters in the ASKAP fields Angie Veronica, Thomas H. Reiprich, Florian Pacaud, Marcus Brüggen, Bärbel Koribalski, Thomas Pasini, Tessa Vernstrom, Stefan W. Duchesne, Kathrin Böckmann, Jeremy S. Sanders, Y. Emre Bahar, Fabian Balzer, Lachlan J. Barnes, Esra Bulbul, Nicolas Clerc, Jessica E. M. Craig, Johan Comparat, Simon Dannhauer, Jakob Dietl, Klaus Dolag, Vittorio Ghirardini, Sebastian Grandis, Duy Hoang, Andrew M. Hopkins, Zsofi Igo, Matthias Kluge, Ang Liu, Konstantinos Migkas, Vanessa A. Moss, Miriam E. Ramos-Ceja, Chris Riseley, Lawrence Rudnick, Mara Salvato, Stanislav Shabala, Riccardo Seppi, Jacco van Loon, Tayyaba Zafar, Xiaoyuan Zhang Accepted for publication in PASA on 25-Nov-2025: 22 pages, 7 figures (main text), 6 figures (appendix) Publ. Astron. Soc. Aust. 43 (2026) e001 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The mechanical feedback from the central AGNs can be crucial for balancing the radiative cooling of the intracluster medium at the cluster centre. We aim to understand the relationship between the power of AGN feedback and the cooling of gas in the centres of galaxy clusters by correlating the radio properties of the brightest cluster galaxies (BCGs) with the X-ray properties of their host clusters. We used catalogues from the first SRG/eROSITA All-Sky Survey (eRASS1) along with ASKAP radio data. In total, we identified 134 radio sources associated with BCGs of the 151 eRASS1 clusters located in the PS1, PS2, and SWAG-X ASKAP fields. Non-detections were treated as upper limits. We correlated BCG radio luminosity, largest linear size (LLS), and BCG offset with the integrated X-ray luminosity of their host clusters. To characterise cool cores (CCs) and non-cool cores (NCCs), we used the concentration parameter $c_{R_{500}}$ and combined it with the BCG offset to assess cluster dynamical state. We analysed the correlation between radio mechanical power and X-ray luminosity within the CC subsample. We observe a potential positive trend between LLS and BCG offset, suggesting an environmental effect on radio-source morphology. We find a weak trend where more luminous central radio galaxies are found in clusters with higher X-ray luminosity. Within the CC subsample, there is a positive but highly scattered relationship between the mechanical luminosity of AGN jets and the X-ray cooling luminosity. This finding is supported by bootstrap resampling and flux-flux analyses. The correlation indicates that AGN feedback is ineffective in high-luminosity (high-mass) clusters. At a cooling luminosity of $L_{\\mathrm{X},~r<R_\\mathrm{cool}}\\approx 5.50\\times10^{43}$ erg/s, on average, AGN feedback appears to contribute only about 13%-22% of the energy needed to offset the radiative losses in the ICM.",
      "pdf_url": "https://arxiv.org/pdf/2511.22319.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.14926",
      "title": "Tomographic constraints on the high-energy cosmic neutrino emission rate",
      "authors": [
        "Alberto Gálvez Ureña",
        "Federico Urban",
        "David Alonso"
      ],
      "abstract": "Tomographic constraints on the high-energy cosmic neutrino emission rate Alberto Gálvez Ureña, Federico Urban, David Alonso High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Despite growing efforts to find the sources of high energy neutrinos measured by IceCube, the bulk of the neutrinos remain with unknown origins. We aim to constrain the emissivity of cosmic high-energy neutrinos from extragalactic sources through their correlation with the large-scale structure. We use cross-correlations between the IceCube 10-year dataset and tomographic maps of the galaxy overdensity to place constraints on the bias-weighted high-energy neutrino emissivity out to redshift $z\\sim3$. We test two different models to describe the evolution of neutrino emissivity with redshift, a power law model $\\propto (1+z)^a$, and a model tracking the star formation history, assuming a simple power law model for the energy injection spectrum. We also consider a non-parametric reconstruction of the astrophysical neutrino emissivity as a function of redshift. We do not find any significant correlation, with our strongest results corresponding to a $1.9 \\sigma$ deviation with respect to a model with zero signal. We use our measurements to place upper bounds on the bias-weighted astrophysical high-energy neutrino emission rate as a function of redshift for different source models. This analysis provides a new probe to test extragalactic neutrino source models. With future neutrino and galaxy datasets we expect the constraining and detection power of this type of analysis analysis to increase.",
      "pdf_url": "https://arxiv.org/pdf/2507.14926.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12263",
      "title": "Is Milky Way gravitationally stable? A TNG50 view from cosmic noon to the present day",
      "authors": [
        "K. Aditya",
        "Sandeep Kataria"
      ],
      "abstract": "Is Milky Way gravitationally stable? A TNG50 view from cosmic noon to the present day K. Aditya, Sandeep Kataria Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the stability of Milky Way analogs (MWAs) in the \\texttt{TNG50} simulation against the growth of local axisymmetric instabilities, tracing their evolution from cosmic noon ($z=2.5$) to the present day ($z=0$). Using a two-component stability criterion that accounts for stars, gas, and the force field of the dark matter halo, we compute the net stability parameter ($Q_{T}$), the critical gas surface density ($\\Sigma_{c}$), and the instability timescale ($\\tau$) for 10 barred and 10 unbarred MWAs. We find that these galaxies remain stable to axisymmetric instabilities at all epochs, with $Q_{T}^{\\min}>2$. The stability levels increase toward higher redshift, where enhanced gas velocity dispersion counterbalances the destabilizing effect of larger gas fractions. Further, the barred MWAs consistently show lower $Q_{T}^{\\min}$ than unbarred ones. The gas density remains subcritical ($\\Sigma_{g}<\\Sigma_{c}$) across radii and epochs, implying that local axisymmetric instabilities are not the primary channel for star formation. Growth timescales are short (a few Myr) in central regions but increase exponentially to several Gyr in the outer disc, naturally explaining the concentration of star formation toward galactic centers. We study the effect of gas dissipation and turbulence in ISM and find that while MWAs are stable against axisymmetric instabilities $(Q_{T}>1)$, a combination of gas dissipation and turbulence in ISM can destabilize the disc at small scales even when $Q_{T}>1$.",
      "pdf_url": "https://arxiv.org/pdf/2510.12263.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06815",
      "title": "Joint Optical-HI mock catalogs and prospects for upcoming HI surveys",
      "authors": [
        "Sauraj Bharti",
        "J. S. Bagla"
      ],
      "abstract": "Joint Optical-HI mock catalogs and prospects for upcoming HI surveys Sauraj Bharti, J. S. Bagla 15 pages, 11 figures, 4 tables. Comments welcome! Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Atomic hydrogen (HI) regulates star formation as cold gas fuels star formation. It represents a key phase of matter in the baryon cycle involving accretion, feedback, outflows, and gas recycling. Redshifted $21$ cm line emission originating from galaxies serves as a key tracer for investigating HI gas and its dynamics in the interstellar medium (ISM) and circumgalactic medium (CGM), and enables the study of galaxy evolution. Nonetheless, direct detections of HI are currently limited to $z \\leq 0.4$ due to the inherently weak $21$ cm emission line. Ongoing and upcoming large radio surveys aim to detect $21$ cm emission from galaxies up to $z \\gtrsim 1$ with unprecedented sensitivity. In current work, we present a novel approach for creating optical-HI joint mock catalogs for upcoming SKA precursor surveys: MIGHTEE-HI and LADUMA with MeerKAT and WALLABY with ASKAP. Incorporation of optical properties along with HI in our mock catalogs makes these a powerful tool for making predictions for upcoming surveys and provides a benchmark for exploring the HI science (e.g., conditional HIMF and optical-to-HI scaling relations) expected from these surveys. As a case study, we show the use of the joint catalogs for predicting the expected outcome of stacking detection for average HI mass in galaxies that are below the threshold for direct detection. We show that combining stacking observations with the number of direct detections puts a strong constraint on the HI mass function, especially in the regime where the number of direct detections is small, as often happens near the farther edge of HI surveys. This intermediate step may be used to set priors for the full determination of the HI mass function.",
      "pdf_url": "https://arxiv.org/pdf/2601.06815.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18865",
      "title": "Induced Scattering of Fast Radio Bursts in Magnetar Magnetospheres",
      "authors": [
        "Rei Nishiura",
        "Shoma F. Kamijima",
        "Kunihito Ioka"
      ],
      "abstract": "Induced Scattering of Fast Radio Bursts in Magnetar Magnetospheres Rei Nishiura, Shoma F. Kamijima, Kunihito Ioka 8 pages, 4 figures. Comments welcome! High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) We investigate induced Compton/Brillouin scattering of electromagnetic waves in magnetized electron and positron pair plasma by verifying kinetic theory with Particle-in-Cell simulations. Applying this to fast radio bursts (FRBs) in magnetar magnetospheres, we find that the scattering--although suppressed by the magnetic field--inevitably enters the linear growth stage. The subsequent evolution bifurcates: full scattering occurs when the density exceeds a critical value, whereas below it the scattering saturates and the FRB can escape. This eases the tension with observations of compact emission regions and may explain the observed diversity, including the presence or absence of FRBs associated with X-ray bursts.",
      "pdf_url": "https://arxiv.org/pdf/2601.18865.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18887",
      "title": "AT2018cow Powered by a Shock in Aspherical Circumstellar Media",
      "authors": [
        "Taya Govreen-Segal",
        "Ehud Nakar",
        "Kenta Hotokezaka",
        "Christopher M Irwin",
        "Eliot Quataert"
      ],
      "abstract": "AT2018cow Powered by a Shock in Aspherical Circumstellar Media Taya Govreen-Segal, Ehud Nakar, Kenta Hotokezaka, Christopher M Irwin, Eliot Quataert 20 pages, 4 figures, 5 tables. Comments welcome :) High Energy Astrophysical Phenomena (astro-ph.HE) We present a quantitative model for the luminous fast blue optical transient AT2018cow in which a shock propagating through an aspherical circumstellar medium (CSM) produces the X-ray and UV/optical/NIR emission. X-rays are emitted from hot post-shock electrons, and soft X-ray photons are reprocessed into optical/UV emission in the cool downstream. This naturally explains two previously puzzling features: (i) the coordinated evolution of the optical and soft X-ray after day 20, (ii) the hard X-ray hump above 10 keV that disappears around day 15 as the Thomson optical depth transitions from $\\tau_T \\gg1$ to $\\tau_T \\sim 1$. Our model is over-constrained, and it quantitatively reproduces the bolometric luminosity evolution, soft X-ray spectrum, and time-dependent soft/hard X-ray and soft X-ray/optical luminosity ratios. It also explains additional puzzles: X-ray fluctuations with $\\sim4-10$ day timescales arise from a global radiative shock instability, while the NIR excess and the apparent receding blackbody radius result from reprocessed X-rays in matter far from thermodynamic equilibrium. The radio is naturally explained as originating from a shock driven by the same ejecta in the more dilute CSM. The light curve steepening after $\\sim 40$ days likely indicates the shock reaches the edge of the dense CSM at $\\sim {\\rm few} \\times 10^{15}$ cm. We infer explosion energy $\\sim 1-5 \\times 10^{50}$ erg, carried by an ejecta at $\\sim 0.1c$ and a mass of $0.01-0.05 M_\\odot$, in a dense asymmetric CSM with $\\sim 0.3 M_\\odot$, embedded in a more dilute CSM.",
      "pdf_url": "https://arxiv.org/pdf/2601.18887.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18926",
      "title": "Multiwavelength Analysis of Six Luminous, Fast Blue Optical Transients",
      "authors": [
        "Cassie Sevilla",
        "Anna Y. Q. Ho",
        "Nayana A.J.",
        "Steve Schulze",
        "Daniel A. Perley",
        "Michael Bremer",
        "Igor Andreoni",
        "Ivan Altunin",
        "Thomas G. Brink",
        "Poonam Chandra",
        "Ping Chen",
        "Ashley A. Chrimes",
        "Michael W. Coughlin",
        "Kaustav K. Das",
        "Andrew Drake",
        "Alexei V. Filippenko",
        "Christoffer Fremling",
        "James Freeburn",
        "Avishay Gal Yam",
        "Mary Gerhart",
        "Matthew J. Graham",
        "George Helou",
        "K-Ryan Hinds",
        "Natalya Johnson",
        "Mansi M. Kasliwal",
        "Harsh Kumar",
        "Russ R. Laher",
        "Natalie LeBaron",
        "Maggie L. Li",
        "Chang Liu",
        "Ben Margalit",
        "Yu-Jing Qin",
        "Nabeel Rehemtulla",
        "Sophia Risin",
        "Sam Rose",
        "Rupak Roy",
        "Ben Rusholme",
        "Genevieve Schroeder",
        "Jesper Sollerman",
        "Kailai Wang",
        "Jacob L. Wise",
        "Yi Yang",
        "Yuhan Yao",
        "WeiKang Zheng"
      ],
      "abstract": "Multiwavelength Analysis of Six Luminous, Fast Blue Optical Transients Cassie Sevilla, Anna Y. Q. Ho, Nayana A.J., Steve Schulze, Daniel A. Perley, Michael Bremer, Igor Andreoni, Ivan Altunin, Thomas G. Brink, Poonam Chandra, Ping Chen, Ashley A. Chrimes, Michael W. Coughlin, Kaustav K. Das, Andrew Drake, Alexei V. Filippenko, Christoffer Fremling, James Freeburn, Avishay Gal Yam, Mary Gerhart, Matthew J. Graham, George Helou, K-Ryan Hinds, Natalya Johnson, Mansi M. Kasliwal, Harsh Kumar, Russ R. Laher, Natalie LeBaron, Maggie L. Li, Chang Liu, Ben Margalit, Yu-Jing Qin, Nabeel Rehemtulla, Sophia Risin, Sam Rose, Rupak Roy, Ben Rusholme, Genevieve Schroeder, Jesper Sollerman, Kailai Wang, Jacob L. Wise, Yi Yang, Yuhan Yao, WeiKang Zheng High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We present multiwavelength observations and analysis of six luminous fast blue optical transients (LFBOTs) discovered in Zwicky Transient Facility (ZTF) survey data. We identified these LFBOTs from their fast light-curve evolution ($t_{1/2}\\leq 12 $d), blue colors at peak brightness ($g-r\\leq-0.5 $mag), a visible host galaxy, high optical luminosity ($M_g<-20$), and an X-ray or radio detection. With the exception of AT2024aehp (ZTF24abygbss), these transients exhibit peaks in their $10\\,$GHz radio light curves at $t_{\\text{rest}} \\approx 50-100$ d, with peak radio luminosities ranging from $10^{38}-10^{40}$ erg s$^{-1}$. Modeling the radio emission as synchrotron radiation indicates a fast ($v=0.1-0.3c$) shock in a dense ($n_e\\approx10^{3}-10^{4}$ cm$^{-3}$) medium. The X-ray emission varies by $\\approx2$ orders of magnitude in luminosity ($10^{42}-10^{44}$ erg s$^{-1}$) at $t_{\\text{rest}}\\sim20 $d. Analysis of the host-galaxy photometry and spectroscopy for each transient shows that they are predominantly nonnuclear (a few kpc offset) with star-forming host galaxies of stellar masses $10^{9}-10^{11} ,M_\\odot$. Unlike all other LFBOTs to date, AT2024aehp exhibited a luminous ($M<-19 $mag) plateau in the optical light curve; spectra during this plateau phase showed a featureless blue continuum. The $6-15$ GHz radio emission of AT2024aehp brightened by over an order of magnitude from $t_{\\text{rest}} \\approx70 $d to $t_{\\mathrm{rest}} \\approx130 $d. The mostly consistent radio behavior between optically selected LFBOTs implies a similar circumburst medium, leading us to prefer a progenitor scenario in which mass is lost in a consistent way shortly prior to the terminal event, such as a massive star merging with a compact object.",
      "pdf_url": "https://arxiv.org/pdf/2601.18926.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19018",
      "title": "A multiwavelength view of the nearby Calcium-Strong Transient SN 2025coe in the X-Ray, Near-Infrared, and Radio Wavebands",
      "authors": [
        "Sahana Kumar",
        "Raphael Baer-Way",
        "Aravind P. Ravi",
        "Maryam Modjaz",
        "Poonam Chandra",
        "Stefano Valenti",
        "Lindsey A. Kwok",
        "Samaporn Tinyanont",
        "Ryan J. Foley",
        "D. Andrew Howell",
        "Daichi Hiramatsu",
        "Jennifer E. Andrews",
        "K. Azalee Bostroem",
        "Collin Christy",
        "Noah Franz",
        "Brian Hsu",
        "Jeniveve Pearson",
        "David J. Sand",
        "Manisha Shrestha",
        "Nathan Smith",
        "Bhagya Subrayan"
      ],
      "abstract": "A multiwavelength view of the nearby Calcium-Strong Transient SN 2025coe in the X-Ray, Near-Infrared, and Radio Wavebands Sahana Kumar, Raphael Baer-Way, Aravind P. Ravi, Maryam Modjaz, Poonam Chandra, Stefano Valenti, Lindsey A. Kwok, Samaporn Tinyanont, Ryan J. Foley, D. Andrew Howell, Daichi Hiramatsu, Jennifer E. Andrews, K. Azalee Bostroem, Collin Christy, Noah Franz, Brian Hsu, Jeniveve Pearson, David J. Sand, Manisha Shrestha, Nathan Smith, Bhagya Subrayan submitted to ApJ on Jan 26, 2026 High Energy Astrophysical Phenomena (astro-ph.HE) Calcium-strong transients (CaSTs) are a subclass of faint and rapidly evolving supernovae (SNe) that exhibit strong calcium features and notably weak oxygen features. The small but growing population of CaSTs exhibits some aspects similar to thermonuclear supernovae and others that are similar to massive star core-collapse events, leading to intriguing questions on the physical origins of CaSTs. SN 2025coe is one of the most nearby CaSTs discovered to date, and our coordinated multi-wavelength observations obtained days to weeks post-explosion reveal new insights on these enigmatic transients. With the most robust NIR spectroscopic time-series of a CaST collected to date, SN 2025coe shows spectral signatures characteristic of Type Ib SNe (SNe Ib, i.e. He-rich stripped-envelope SNe). SN~2025coe is the third X-ray detected CaST and our analysis of the \\textit{Swift} X-ray data suggest interaction with 0.12 $\\pm\\,0.11\\ M_{\\odot}$ of circumstellar material (CSM) extending to at least $2 \\times 10^{15} $cm ($\\sim 30,000\\ R_{\\odot}$), while our analysis of the 1-240 GHz radio non-detections gives an outer radius of that CSM of at most $\\sim 4\\times 10^{15}$ cm. This inferred nearby high-density CSM extending out to $3\\pm 1 \\times10^{15}$ cm is similar to that seen in the other two X-ray detected CaSTs, and its presence suggests that either intensive mass-loss or some polluting mechanism may be a common feature of this subclass. Our work also expands upon recent studies on the optical properties of SN 2025coe and explores our current understanding of different progenitor systems that could possibly produce CaSTs.",
      "pdf_url": "https://arxiv.org/pdf/2601.19018.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19135",
      "title": "Maximum Energy of Particles Accelerated in GRB Afterglow Shocks",
      "authors": [
        "Zhao-Feng Wu",
        "Sofía Guevara-Montoya",
        "Paz Beniamini",
        "Dimitrios Giannios",
        "Daniel Grošelj",
        "Lorenzo Sironi"
      ],
      "abstract": "Maximum Energy of Particles Accelerated in GRB Afterglow Shocks Zhao-Feng Wu, Sofía Guevara-Montoya, Paz Beniamini, Dimitrios Giannios, Daniel Grošelj, Lorenzo Sironi 10 pages, 4 figures, submitted to ApJL High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) Particle acceleration in relativistic collisionless shocks remains an open problem in high-energy astrophysics. Particle-in-cell (PIC) simulations predict that electron acceleration in weakly magnetized shocks proceeds via small-angle scattering, leading to a maximum electron energy significantly below the Bohm limit. This upper bound manifests observationally as a characteristic synchrotron cutoff, providing a direct probe of the underlying acceleration physics. Gamma-ray burst (GRB) afterglows offer an exceptional laboratory for testing these predictions. Here, we model the spectral evolution of GRB afterglows during the relativistic deceleration phase, incorporating PIC-motivated acceleration prescriptions and self-consistently computing synchrotron and synchrotron self-Compton emission. We find that low-energy bursts in low-density environments, typical of short GRBs, exhibit a pronounced synchrotron cutoff in the GeV band within minutes to hours after the trigger. Applying our framework to GRB 190114C and GRB 130427A, we find that current observations are insufficient to discriminate between PIC-motivated acceleration and the Bohm limit, primarily due to large uncertainties in the Fermi-LAT band. Nevertheless, future MeV-TeV afterglow observations can break model degeneracies and place substantially tighter constraints on particle acceleration in relativistic shocks.",
      "pdf_url": "https://arxiv.org/pdf/2601.19135.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19140",
      "title": "Latent characterisation of the complete BATSE gamma ray bursts catalogue using Gaussian mixture of factor analysers and model-estimated overlap-based syncytial clustering",
      "authors": [
        "Fan Dai",
        "Ranjan Maitra"
      ],
      "abstract": "Latent characterisation of the complete BATSE gamma ray bursts catalogue using Gaussian mixture of factor analysers and model-estimated overlap-based syncytial clustering Fan Dai, Ranjan Maitra Monthly Notices of the Royal Astronomical Society 535 (2024) 3396-3409 High Energy Astrophysical Phenomena (astro-ph.HE); Applications (stat.AP); Computation (stat.CO); Methodology (stat.ME) Characterising and distinguishing gamma-ray bursts (GRBs) has interested astronomers for many decades. While some authors have found two or three groups of GRBs by analyzing only a few parameters, recent work identified five ellipsoidally-shaped groups upon considering nine parameters $T_{50}, T_{90}, F_1, F_2, F_3, F_4, P_{64}, P_{256}, P_{1024}$. Yet others suggest sub-classes within the two or three groups found earlier. Using a mixture model of Gaussian factor analysers, we analysed 1150 GRBs, that had nine parameters observed, from the current Burst and Transient Source Experiment (BATSE) catalogue, and again established five ellipsoidal-shaped groups to describe the GRBs. These five groups are characterised in terms of their average duration, fluence and spectrum as shorter-faint-hard, long-intermediate-soft, long-intermediate-intermediate, long-bright-intermediate and short-faint-hard. The use of factor analysers in describing individual group densities allows for a more thorough group-wise characterisation of the parameters in terms of a few latent features. However, given the discrepancy with many other existing studies that advocated for two or three groups, we also performed model-estimated overlap-based syncytial clustering (MOBSynC) that successively merges poorer-separated groups. The five ellipsoidal groups merge into three and then into two groups, one with GRBs of low durations and the other having longer duration GRBs. These groups are also characterised in terms of a few latent factors made up of the nine parameters. Our analysis provides context for all three sets of results, and in doing so, details a multi-layered characterisation of the BATSE GRBs, while also explaining the structure in their variability.",
      "pdf_url": "https://arxiv.org/pdf/2601.19140.pdf",
      "categories": [
        "astro-ph.HE",
        "stat.AP",
        "stat.CO",
        "stat.ME"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19254",
      "title": "Constraining FRB Microstructure with Polarised Shot Noise",
      "authors": [
        "J. C. F. Balzan",
        "A. Bera",
        "C. W. James",
        "B. Meyers"
      ],
      "abstract": "Constraining FRB Microstructure with Polarised Shot Noise J. C. F. Balzan, A. Bera, C. W. James, B. Meyers 10 pages, 4 figures, 1 table. Submitted to PASA High Energy Astrophysical Phenomena (astro-ph.HE) We present FIRES, a polarised shot-noise framework that models fast radio burst (FRB) dynamic spectra as the incoherent superposition of Gaussian microshots. Applied to the CRAFT bursts FRB 20191001A and FRB 20240318A, FIRES reproduces key spectro-polarimetric behaviours: scattering suppresses position-angle (PA) variability on the trailing edge, while the leading edge preferentially retains intrinsic structure when sufficient signal-to-noise is present. We quantify this behaviour using the PA variance ratio $\\mathcal{R}_\\psi$ and explore the joint plane of measured linear polarisation fraction $\\Pi_L$ versus PA variance to constrain the allowed parameter space of microshot number $N$, intrinsic PA dispersion $\\sigma_\\psi$, and intrinsic linear fraction $\\Pi_{L,0}$ at fixed signal-to-noise. For FRB~20191001A, the data are consistent with an extended region spanning $\\sigma_\\psi \\sim 10^\\circ$--$30^\\circ$ and $N \\sim 5$--$1000$, reflecting degeneracies between intrinsic PA structure, microshot superposition, scattering, finite sampling, and noise. FRB~20240318A occupies a more restricted region, favouring fewer microshots ($N \\lesssim 20$) and larger intrinsic PA dispersion ($\\sigma_\\psi \\sim 15$--$23^\\circ$), depending on $\\Pi_{L,0}$, consistent with its observed PA variability. By combining an emission-mechanism-independent framework with minimal assumptions and observational constraints, FIRES provides direct, quantitative constraints on the space of viable FRB microphysical models and demonstrates that microshot superposition offers a natural explanation for the diverse polarimetric behaviours observed in FRBs.",
      "pdf_url": "https://arxiv.org/pdf/2601.19254.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19328",
      "title": "STONKS first results: Long-term transients in the XMM-Newton Galactic plane survey",
      "authors": [
        "Robbie Webbe",
        "E. Quintin",
        "N.A. Webb",
        "Gabriele Ponti",
        "Tong Bao",
        "Chandreyee Maitra",
        "Shifra Mandel",
        "Samaresh Mondal"
      ],
      "abstract": "STONKS first results: Long-term transients in the XMM-Newton Galactic plane survey Robbie Webbe, E. Quintin, N.A. Webb, Gabriele Ponti, Tong Bao, Chandreyee Maitra, Shifra Mandel, Samaresh Mondal 15 pages, 10 figures, Accepted by A&A High Energy Astrophysical Phenomena (astro-ph.HE) The study of astronomical transients at high energies provides insights into some of the most extreme physical events in the universe; however, carrying out their detection and fast follow-up studies are limited by instrumental constraints. Search for Transient Object in New observations using Known Sources (STONKS) is a near-real-time transient detection system for XMM-Newton offering the capability to detect transients in XMM-Newton observations at fainter fluxes than can be achieved with wide survey instruments. We present the transients detected with the STONKS pipeline found in an XMM-Newton multi-year heritage survey of the Galactic plane to identify and classify highly variable X-ray sources that have recently been reported in this region. We examined the alerts created by the STONKS pipeline from over 200 XMM observations of the Galactic plane, screening for instrumental effects. The 78 alerts associated with 70 real astrophysical sources were then subjected to further temporal and spectral analysis. From the 70 sources we identified, we were able to classify 32 with a high degree of confidence, including 7 X-ray binaries, 1 $\\gamma$-Cas analogue, and 1 magnetar candidate. Of the 70 sources, 23 were detected for the first time in X-rays. This systematic analysis of publicly available data has shown the value and potential of STONKS in the application to XMM-Newton observations. It will enable the community to detect transient and highly variable sources at fainter fluxes than with any other X-ray transient detection systems.",
      "pdf_url": "https://arxiv.org/pdf/2601.19328.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19480",
      "title": "A highly ionised outflow in the X-ray binary 4U 1624-49 detected with XRISM",
      "authors": [
        "M. Díaz Trigo , E. Caruso , E. Costantini , T. Dotani , T. Kohmura , M. Shidatsu , M. Tsujimoto , T. Yoneyama , J. Neilsen , T. Yaqoob , J. M. Miller ESO, SRON, JAXA, Tokyo University, Ehime University, Villanova University, NASA/GSFC, CRESST II, University of Maryland, University of Michigan)"
      ],
      "abstract": "A highly ionised outflow in the X-ray binary 4U 1624-49 detected with XRISM M. Díaz Trigo (1), E. Caruso (2), E. Costantini (2), T. Dotani (3), T. Kohmura (4), M. Shidatsu (5), M. Tsujimoto (3), T. Yoneyama (3), J. Neilsen (6), T. Yaqoob (7,8,9), J. M. Miller (10) ((1) ESO, (2) SRON, (3) JAXA, (4) Tokyo University, (5) Ehime University, (6) Villanova University, (7) NASA/GSFC, (8) CRESST II, (9) University of Maryland, (10) University of Michigan) 13 pages, 6 figures. Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE) The origin of accretion disc winds remains disputed to date. High inclination, dipping, neutron star Low Mass X-Ray Binaries (LMXBs) provide an excellent testbed to study the launching mechanism of such winds due to being persistently accreting and showing a nearly ubiquitous presence of highly-ionised plasmas. We aim to establish or rule out the presence of a wind in the high inclination LMXB 4U 1624-49, for which a highly ionised plasma has been repeatedly observed in X-ray spectra by Chandra and XMM-Newton, and a thermal-radiative pressure wind is expected. We leverage the exquisite spectral resolution of XRISM to perform phase-resolved spectroscopy of the full binary orbit to characterise the highly ionised plasma at all phases except during absorption dips. An outflow is clearly detected via phase-resolved spectroscopy of the source with XRISM/Resolve. Based on analysis of the radial velocity curve we determine an average velocity of ~200-320 km/s and a column density above 10$^{23}$ cm$^{-2}$. The line profiles are generally narrow, spanning from ~50 to ~100 km/s, depending on the orbital phase, pointing to a low velocity sheer or turbulence of the highly ionised outflow and a potential increase of turbulence as the absorption dip is approached, likely due to turbulent mixing. The line profiles, together with the derived launching radius and wind velocity are consistent with a wind being launched from the outskirts of the disc and without stratification, pointing to a thermal-radiative pressure origin.",
      "pdf_url": "https://arxiv.org/pdf/2601.19480.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19891",
      "title": "Fading Echoes of Interaction: Probing Centuries of Mass-Loss in Four Old Type IIn Supernovae",
      "authors": [
        "Elizabeth Hillenkamp , Raphael Baer-Way , Poonam Chandra , Arkaprabha Sarangi , Roger Chevalier , Nayana A.J. , Annika Deutsch , Keiichi Maeda , Nathan Smith Department of Astronomy &amp; Astrophysics, University of California, San Diego, National Radio Astronomy Observatory, Department of Astronomy, University of Virginia, Indian Institute of Astrophysics, Department of Astronomy, University of California, Berkeley, Department of Astronomy, Kyoto University, Steward Observatory, University of Arizona)"
      ],
      "abstract": "Fading Echoes of Interaction: Probing Centuries of Mass-Loss in Four Old Type IIn Supernovae Elizabeth Hillenkamp (1 and 2), Raphael Baer-Way (2 and 3), Poonam Chandra (2), Arkaprabha Sarangi (4), Roger Chevalier (3), Nayana A.J. (5), Annika Deutsch (3), Keiichi Maeda (6), Nathan Smith (7) ((1) Department of Astronomy &amp; Astrophysics, University of California, San Diego, (2) National Radio Astronomy Observatory, (3) Department of Astronomy, University of Virginia, (4) Indian Institute of Astrophysics, (5) Department of Astronomy, University of California, Berkeley, (6) Department of Astronomy, Kyoto University, (7) Steward Observatory, University of Arizona) 17 pages, 10 figures, 5 tables. Submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Supernovae characterized by enduring narrow optical hydrogen emission lines (SNe IIn) are believed to result primarily from the core-collapse of massive stars undergoing sustained interaction with a dense circumstellar medium (CSM). While the properties of SN IIn progenitors have relatively few direct constraints, the ongoing ejecta-CSM interaction provides unique information about late-stage stellar mass-loss preceding core-collapse. We present late-time X-ray and radio observations of four $\\geq$3000 day-old SNe IIn: SN 2013L, SN 2014ab, SN 2015da, and KISS15s. The radio and X-ray emission from KISS15s indicate a mass-loss rate of $\\rm{\\dot M\\sim4\\times 10^{-3}~{M_{\\odot}\\,yr^{-1}}}$ at $\\sim$450 years pre-supernova -- 2 orders of magnitude below earlier optical estimates (which probed the mass-loss immediately preceding the supernova). We find hints of a spectral inversion in the radio SED of KISS15s; a possible signature of a secondary shock due to a binary system or the emergence of a pulsar wind. For SN 2013L, we obtain a mass-loss rate of $\\rm{\\dot M\\sim2 \\times 10^{-3}~\\rm{M_{\\odot}\\,yr^{-1}}}$ at $\\sim$400 years pre-explosion based on the X-ray detection. For SN 2014ab and SN 2015da, we find a upper limits on the mass-loss rates of $\\rm{\\dot M<2\\times10^{-3}~M_{\\odot}\\,yr^{-1}}$ explosion at $\\sim$ 250 and 300 years pre-explosion, respectively. All four objects display mass-loss rates lower than estimates from earlier optical analyses by at least 1-3 orders of magnitude, necessitating a rapidly evolving progenitor process over the last centuries pre-explosion. Our analysis reveals how X-ray and radio observations can elucidate progenitor evolution when these objects have faded at optical wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2601.19891.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18864",
      "title": "Inside the cocoon: a comprehensive explanation of the spectra of Little Red Dots",
      "authors": [
        "A. Sneppen",
        "D. Watson",
        "J. H. Matthews",
        "G. Nikopoulos",
        "N. Allen",
        "G. Brammer",
        "R. Damgaard",
        "K. E. Heintz",
        "C. Knigge",
        "K. S. Long",
        "V. Rusakov",
        "S. A. Sim",
        "J. Witstok"
      ],
      "abstract": "Inside the cocoon: a comprehensive explanation of the spectra of Little Red Dots A. Sneppen, D. Watson, J. H. Matthews, G. Nikopoulos, N. Allen, G. Brammer, R. Damgaard, K. E. Heintz, C. Knigge, K. S. Long, V. Rusakov, S. A. Sim, J. Witstok Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) JWST has revealed a population of compact galaxies in the early Universe with broad emission lines and strong Balmer breaks; among them the so-called ''little red dots'' (LRDs). Their nature remains uncertain with hypotheses including exotic phenomena. We assemble a sample of LRD-like objects at $z>3$ and use self-consistent radiative-transfer calculations to show that a supermassive black hole accreting from a dense gas cocoon accurately reproduces the detailed spectra. We show that the cocoons must be non-spherical, with comparable amounts of inflowing and outflowing material. And we predict correlations between Balmer break strength, Balmer line-absorption and scattering line width, which we confirm in our observed sample. We reproduce all LRD-like properties without requiring star-like atmospheres and we determine the typical black hole in our sample to be of order a million solar masses, with ionized cocoon masses of tens of solar masses potentially supplied from a much larger cold-gas reservoir.",
      "pdf_url": "https://arxiv.org/pdf/2601.18864.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18988",
      "title": "Energy partition in collisionless counterstreaming plasmas",
      "authors": [
        "Alexis Marret",
        "Frederico Fiuza"
      ],
      "abstract": "Energy partition in collisionless counterstreaming plasmas Alexis Marret, Frederico Fiuza Energy Partition in Collisionless Counterstreaming Plasmas, ApJL 997, L23 (2026) Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Fast, counter-streaming plasma outflows drive magnetic field amplification, plasma heating, and particle acceleration in numerous astrophysical environments, from supernova remnant shocks to active galactic nuclei jets. Understanding how, in the absence of Coulomb collisions, energy is redistributed between the different plasma species remains a fundamental open question. We use 3D fully-kinetic simulations to investigate energy partition in weakly magnetized counter-propagating plasmas. Our results reveal a complex interplay between different processes, where at early times the Weibel instability drives a first stage of magnetic field amplification and at late times the kinking of current filaments drives a second amplification stage via a dynamo-type mechanism. Electrons are heated primarily during the latter phase through magnetic pumping. By the time the flows thermalize, we observe that the final temperature ratio $T_e/T_i$ and energy partition depend on the ion-to-electron mass ratio. For electron-proton flows, the electron thermal energy only reaches up to a few percent of the initial ion kinetic energy.",
      "pdf_url": "https://arxiv.org/pdf/2601.18988.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.04727",
      "title": "A sudden dramatic change and recovery of magneto-environment of a repeating fast radio burst",
      "authors": [
        "Y. Li",
        "S. B. Zhang",
        "Y. P. Yang",
        "C. W. Tsai",
        "X. Yang",
        "C. J. Law",
        "R. Anna-Thomas",
        "X. L. Chen",
        "K. J. Lee",
        "Z. F. Tang",
        "D. Xiao",
        "H. Xu",
        "X. L. Yang",
        "G. Chen",
        "Y. Feng",
        "D. Z. Li",
        "R. Mckinven",
        "J. R. Niu",
        "K. Shin",
        "B. J. Wang",
        "C. F. Zhang",
        "Y. K. Zhang",
        "D. J. Zhou",
        "Y. H. Zhu",
        "Z. G. Dai",
        "C. M. Chang",
        "J. J. Geng",
        "J. L. Han",
        "L. Hu",
        "D. Li",
        "R. Luo",
        "C. H. Niu",
        "D. D. Shi",
        "T. R. Sun",
        "X. F. Wu",
        "W. W. Zhu",
        "P. Jiang",
        "B. Zhang"
      ],
      "abstract": "A sudden dramatic change and recovery of magneto-environment of a repeating fast radio burst Y. Li, S. B. Zhang, Y. P. Yang, C. W. Tsai, X. Yang, C. J. Law, R. Anna-Thomas, X. L. Chen, K. J. Lee, Z. F. Tang, D. Xiao, H. Xu, X. L. Yang, G. Chen, Y. Feng, D. Z. Li, R. Mckinven, J. R. Niu, K. Shin, B. J. Wang, C. F. Zhang, Y. K. Zhang, D. J. Zhou, Y. H. Zhu, Z. G. Dai, C. M. Chang, J. J. Geng, J. L. Han, L. Hu, D. Li, R. Luo, C. H. Niu, D. D. Shi, T. R. Sun, X. F. Wu, W. W. Zhu, P. Jiang, B. Zhang 95 pages, 14 figures. Published in Science, 15 January 2026. Authors' version High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Fast radio bursts (FRBs) are millisecond-duration radio bursts with unidentified extra-galactic origin. Some FRBs exhibit mild magneto-ionic environmental variations, possibly attributed to plasma turbulence or binary configuration. We report an abrupt magneto-ionic variation of FRB 20220529, a repeating FRB from a disk galaxy at redshift $0.1839 \\pm 0.0001$. Initially, the Faraday rotation measure (RM) had a median of $17~{\\rm rad~m^{-2}}$ and a scatter of $101~{\\rm rad~m^{-2}}$ over 17 months. In December 2023, it jumped to $1977 \\pm 84~{\\rm rad~m^{-2}}$, and returned to typical values within two weeks. This drastic RM variation suggests that a dense magnetized clump enters and exits the line of sight in week timescales. One plausible scenario invokes a coronal mass ejection from a companion star, while other scenarios invoking extreme turbulence or binary orbital motion are also possible.",
      "pdf_url": "https://arxiv.org/pdf/2503.04727.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.04625",
      "title": "First Observations of Solar Halo Gamma Rays Over a Full Solar Cycle",
      "authors": [
        "Tim Linden",
        "Jung-Tsung Li",
        "Bei Zhou",
        "Isabelle John",
        "Milena Crnogorčević",
        "Annika H. G. Peter",
        "John F. Beacom"
      ],
      "abstract": "First Observations of Solar Halo Gamma Rays Over a Full Solar Cycle Tim Linden, Jung-Tsung Li, Bei Zhou, Isabelle John, Milena Crnogorčević, Annika H. G. Peter, John F. Beacom 17 pages, 11 figures. Appendix adds 3 pages and 3 figures. Matches journal version High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) We analyze 15 years of Fermi-LAT data and produce a detailed model of the Sun's inverse-Compton scattering emission (solar halo), which is powered by interactions between ambient cosmic-ray electrons and positrons with sunlight. By developing a novel analysis method to analyze moving sources, we robustly detect the solar halo at energies between 31.6 MeV and 100 GeV, and angular extensions up to 45$^\\circ$ from the Sun, providing new insight into spatial regions where there are no direct measurements of the galactic cosmic-ray flux. The large statistical significance of our signal allows us to sub-divide the data and provide the first $\\gamma$-ray probes into the time-variation and azimuthal asymmetry of the solar modulation potential, finding time-dependent changes in solar modulation both parallel and perpendicular to the ecliptic plane. Our results are consistent with (but with independent uncertainties from) local cosmic-ray measurements, unlocking new probes into both astrophysical and beyond-standard-model processes near the solar surface.",
      "pdf_url": "https://arxiv.org/pdf/2505.04625.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.10372",
      "title": "Stellar properties indicating the presence of hyperons in neutron stars",
      "authors": [
        "Andreas Bauswein",
        "Aristeidis Nikolaidis",
        "Georgios Lioutas",
        "Hristijan Kochankovski",
        "Prasanta Char",
        "Chiranjib Mondal",
        "Micaela Oertel",
        "Laura Tolos",
        "Nicolas Chamel",
        "Stephane Goriely"
      ],
      "abstract": "Stellar properties indicating the presence of hyperons in neutron stars Andreas Bauswein, Aristeidis Nikolaidis, Georgios Lioutas, Hristijan Kochankovski, Prasanta Char, Chiranjib Mondal, Micaela Oertel, Laura Tolos, Nicolas Chamel, Stephane Goriely 19 pages, 8 figures, accepted for publication in PRR High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) We describe distinctive stellar features indicating the presence of hyperons in neutron stars as compared to purely nucleonic systems. A strongly negative curvature of the mass-radius relation $R(M)$ is characteristic of hyperons, which can be determined from measurements of neutron stars with three different masses. Similarly, a reduced second derivative of the tidal deformability as function of mass \\lambda(M) points to hyperonic degrees of freedom in NS matter. The slopes of such curves R(M) and \\lambda(M) can distinguish a hyperonic equation of state from purely nucleonic models if they appear increased (decreased for \\lambda(M)) relative to the maximum mass of neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2507.10372.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.19987",
      "title": "Perseus cluster in its X-ray entirety with SRG/eROSITA. Merger and Radio-Uroboroses",
      "authors": [
        "Eugene Churazov",
        "Ildar Khabibullin",
        "Natalya Lyskova",
        "Rashid Sunyaev",
        "Klaus Dolag"
      ],
      "abstract": "Perseus cluster in its X-ray entirety with SRG/eROSITA. Merger and Radio-Uroboroses Eugene Churazov, Ildar Khabibullin, Natalya Lyskova, Rashid Sunyaev, Klaus Dolag High Energy Astrophysical Phenomena (astro-ph.HE) The Perseus cluster (Abell 426) is a nearby massive galaxy cluster that spans several degrees. We combined SRG/eROSITA, XMM-Newton, and Chandra data to get a complete coverage of this cluster in X-rays up to $R_{\\rm 200c}$ and beyond, although at the largest radii, spatial non-uniformities of the X-ray sky background and foreground dominate. While the Perseus central part represents a canonical cool-core structure with clear signs of AGN Feedback, the outskirts, in turn, serve as a convincing example of a merger-perturbed system. X-ray data suggest that IC310 is the main galaxy of a subcluster that merges with Perseus over the past $\\sim 4\\,{\\rm Gyr}$. Overall, this configuration resembles the merger between the Coma cluster and the NGC4839 group. It is statistically more likely to find a merging group near the apocenter of its orbit. Therefore, it is not surprising that IC310 in Perseus has a relatively small velocity relative to the main cluster, similarly to NGC4839 in Coma. Perseus also hosts a high-velocity radio galaxy, NGC1265 (line-of-sight velocity is almost twice the virial velocity of the main cluster), which is known for its spectacular radio tail. Unless this galaxy has been accelerated by a time-variable potential associated with the merger, it has to move almost along the line of sight through the entire cluster, which would be a rare, but not a truly exceptional configuration. Both galaxies, IC310 and NGC1265, have remarkable radio tails with sharp bends that are reminiscent of a \"snake biting its tail\". We speculate that these curious shapes are natural consequences of their (different) orbits in Perseus. For IC310, the proximity to the apocenter and the reversal of its radial velocity might play a role. For NGC1265, the nearly line-of-sight motion coupled with the gas motions in the merging system might be important.",
      "pdf_url": "https://arxiv.org/pdf/2507.19987.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.11631",
      "title": "Hurst index of gamma-ray burst light curves and its statistical study",
      "authors": [
        "Ruo-Yu Guan",
        "Fei-Fei Wang",
        "Yuan-Chuan Zou"
      ],
      "abstract": "Hurst index of gamma-ray burst light curves and its statistical study Ruo-Yu Guan, Fei-Fei Wang, Yuan-Chuan Zou 34 pages, 14 figures, accepted by Journal of High Energy Astrophysics (JHEAP) Journal of High Energy Astrophysics, Volume 51, March 2026, 100559 High Energy Astrophysical Phenomena (astro-ph.HE) Gamma-ray bursts (GRBs) rank among the most powerful astrophysical phenomena, characterized by complex and highly variable prompt emission light curves that reflect the dynamics of their central engines. In this work, we analyze a sample of 163 long-duration GRBs detected by the Burst and Transient Source Experiment (BATSE), applying detrended fluctuation analysis (DFA) to derive the Hurst index as a quantitative descriptor of temporal correlations in the light curves. We further explore statistical correlations between the Hurst index and 12 other observational parameters through regression and correlation analyses. Our results reveal anti-correlations between the Hurst index and the burst durations ($T_{50}$, $T_{90}$), and moderate positive correlations with peak photon flux proxies ($P_{pk1}$--$P_{pk3}$). By contrast, the standard spectral parameters (including the low-energy index $\\alpha$) show no evidence for a linear dependence on the Hurst index in our sample. We do not find a clear monotonic weakening of the correlation strength from 64 ms to 1024 ms peak-flux measures; rather, the correlation coefficients for $P_{pk1}$--$P_{pk3}$ are comparable within uncertainties. The results offer new perspectives on the temporal structure of the GRB emission and its potential link to the underlying physical mechanisms driving these bursts.",
      "pdf_url": "https://arxiv.org/pdf/2509.11631.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17214",
      "title": "Pulsed radio emission from a Central Compact Object",
      "authors": [
        "Lei Zhang",
        "Alessandro Ridolfi",
        "Di Li",
        "Erbil Gugercinoglu",
        "Fernando Camilo",
        "Wynn C. G. Ho",
        "Matthew Bailes",
        "Ping Zhou",
        "Craig O. Heinke",
        "Marcus E. Lower"
      ],
      "abstract": "Pulsed radio emission from a Central Compact Object Lei Zhang, Alessandro Ridolfi, Di Li, Erbil Gugercinoglu, Fernando Camilo, Wynn C. G. Ho, Matthew Bailes, Ping Zhou, Craig O. Heinke, Marcus E. Lower High Energy Astrophysical Phenomena (astro-ph.HE) The high magnetic fields and rapid spins of young pulsars associated with supernova remnants, such as the Crab and the Vela, established the standard pulsar model in which massive stellar explosions produce rapidly rotating, radio-luminous neutron stars. Central Compact Objects (CCOs), identified in X-rays at the centers of other remnants, challenged this view, as decades of searches yielded no radio detections. Here we show that the prototypical young CCO 1E 1207.4-5209 is in fact a faint radio pulsar rotating at the 0.4s X-ray period. Analysis of its polarization indicates that the radio beam intersects our line of sight near the magnetic pole, affirming its radio faintness' being intrinsic. Once its supernova remnant dissipates, this source would be misidentified as an apparently gigayear-old pulsar. The CCO's low radio flux density may explain why many supernova remnants lack detectable radio pulsars and suggests a hidden population of young, slowly rotating neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2512.17214.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17539",
      "title": "Constraining black hole spin in PG 1535+547 amidst complex multi-layered absorption",
      "authors": [
        "A. Madathil-Pottayil",
        "D.J. Walton",
        "Jiachen Jiang",
        "T. Dauser",
        "Andrew Fabian",
        "D. Stern",
        "Luigi C. Gallo",
        "Mark T. Reynolds",
        "Emanuele Nardini",
        "Javier A. Garcia"
      ],
      "abstract": "Constraining black hole spin in PG 1535+547 amidst complex multi-layered absorption A. Madathil-Pottayil, D.J. Walton, Jiachen Jiang, T. Dauser, Andrew Fabian, D. Stern, Luigi C. Gallo, Mark T. Reynolds, Emanuele Nardini, Javier A. Garcia 14 pages, 9 figures, accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) We present a spectroscopic analysis of XMM-Newton and NuSTAR observations of the 'complex' NLS1 PG 1535+547 at redshift $z=0.038$. These observations span three epochs: 2002 and 2006 with XMM-Newton alone, covering the $0.3-10$ keV energy range, and a coordinated XMM-Newton and NuSTAR observation in 2016, covering the $0.3-60$ keV energy range. The X-ray spectra across all epochs exhibit both neutral and ionized absorption, along with reflection features from the accretion disc, including a prominent Compton hump in the broadband data. Notably, the spectral shape varies across epochs. Our analysis suggests this variability is attributed to changes in both line-of-sight absorption and the intrinsic emission from PG 1535+547. The source is obscured by multiple layers of partially and/or fully covering neutral and ionized absorbers, with neutral column densities ranging from undetectable levels in the least obscured phase to $\\sim0.3-5\\times10^{23}\\mathrm{cm^{-2}}$ in the most obscured phase. A clear warm absorber is revealed during the least obscured phase. The continuum remains fairly consistent ($\\Gamma\\approx 2.2\\pm0.1$) during the first two observations, followed by a substantial flux decrease (by a factor of $\\sim7$ in the $2-10$ keV band) in 2016 compared to 2006. The 2016 data indicates the source is in a reflection-dominated state during this epoch, with a reflection fraction of $R>7$ and an X-ray source located at a height $\\leq 1.72r_g$. Simultaneous fitting of the multi-epoch data suggests a rapidly rotating black hole with a spin parameter, $a>0.99$. These findings imply that strong light-bending effects may account for the observed continuum flux reduction.",
      "pdf_url": "https://arxiv.org/pdf/2512.17539.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18040",
      "title": "Gas Kinematics and Cosmic-Ray Acceleration in the Gamma-ray SNRs W41 and G22.7-0.2",
      "authors": [
        "Takeru Murase",
        "Hidetoshi Sano",
        "Kohei Matsubara",
        "Yasuo Fukui",
        "Junya Nishi",
        "Sabrina Einecke",
        "Miroslav Filipović",
        "Rina Kasai",
        "Ren Matsusaka",
        "Gavin Rowell",
        "Hiroshi Sodoh",
        "Hiromasa Suzuki",
        "Yosuke Shibata",
        "Kisetsu Tsuge",
        "Hiroshi Takaba",
        "Toshihiro Handa"
      ],
      "abstract": "Gas Kinematics and Cosmic-Ray Acceleration in the Gamma-ray SNRs W41 and G22.7-0.2 Takeru Murase, Hidetoshi Sano, Kohei Matsubara, Yasuo Fukui, Junya Nishi, Sabrina Einecke, Miroslav Filipović, Rina Kasai, Ren Matsusaka, Gavin Rowell, Hiroshi Sodoh, Hiromasa Suzuki, Yosuke Shibata, Kisetsu Tsuge, Hiroshi Takaba, Toshihiro Handa 16 pages, 8 figures, accepted for publication in The Astrophysical Journal (ApJ) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We present a study of the interstellar medium associated with the two middle-aged supernova remnants (SNRs) W41 and G22.7-0.2, both detected in TeV gamma-rays. Using high-angular-resolution $^{12}$CO($J$ = 1-0) data from the Nobeyama 45-m telescope and HI data from the VLA, we investigated the spatial and kinematic properties of molecular and atomic gas that interact with the SNRs. We identified associated clouds in the velocity ranges of +50-+80 km s$^{-1}$ for W41 and +76-+110 km s$^{-1}$ for G22.7-0.2. Column density analysis indicates that target protons are dominated by molecular hydrogen, while atomic hydrogen contributes less than $\\sim$10-15% even after correction for self-absorption. The mean proton densities are $\\sim$1.2$\\times$10$^{3}$ cm$^{-3}$ for W41 and $\\sim$5.3$\\times$10$^{2}$ cm$^{-3}$ for G22.7-0.2. From the gamma-ray luminosities, we estimate the total energy of accelerated cosmic-ray protons as $W_\\mathrm{p}$ $\\sim$3$\\times$10$^{47}$~erg for W41 and $\\sim$1$\\times$10$^{48}$ erg for G22.7-0.2, corresponding to 0.03-0.1% of the canonical supernova explosion energy. hese $W_\\mathrm{p}$ values agree with the decreasing trend in $W_\\mathrm{p}$ observed in the middle-aged SNRs within the previously reported SNR age-$W_\\mathrm{p}$ relation.",
      "pdf_url": "https://arxiv.org/pdf/2601.18040.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.10601",
      "title": "Active galactic nuclei do not exhibit strictly sinusoidal brightness variations",
      "authors": [
        "Kareem El-Badry",
        "David W. Hogg",
        "Hans-Walter Rix"
      ],
      "abstract": "Active galactic nuclei do not exhibit strictly sinusoidal brightness variations Kareem El-Badry, David W. Hogg, Hans-Walter Rix 18 pages, 3 figures, accepted to PASP Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Periodic variability in active galactic nuclei (AGN) light curves has been proposed as a signature of close supermassive black hole (SMBH) binaries. Recently, 181 candidate SMBH binaries were identified in Gaia DR3 based on apparently stable sinusoidal variability in their $\\sim$1000-day light curves. By supplementing Gaia photometry with longer-baseline light curves from the Zwicky Transient Facility (ZTF) and the Catalina Real Time Transient Survey (CRTS), we test whether the reported periodic signals persist beyond the Gaia DR3 time window. We find that in all 116 cases with available ZTF data, the Gaia-inferred periodic model fails to predict subsequent variability, which appears stochastic rather than periodic. The periodic candidates thus overwhelmingly appear to be false positives; red noise contamination appears to be the primary source of false detections. We conclude that truly periodic and sinusoidal AGN variability is exceedingly rare, with at most a few in $10^6$ AGN exhibiting it on 100 to 1000 day timescales. Models predict that the Gaia AGN light curve sample should contain dozens of true SMBH binaries with periods within the observational baseline, so the lack of strictly periodic light curves in the sample suggests that most short-period binary AGN do not have light curves dominated by simple sinusoidal periodicity.",
      "pdf_url": "https://arxiv.org/pdf/2509.10601.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18871",
      "title": "A nuclear disc at Cosmic Noon: evidence of early bar-driven galaxy evolution",
      "authors": [
        "Zoe A. Le Conte",
        "Dimitri A. Gadotti",
        "Thomas Harvey",
        "Leonardo Ferreira",
        "Christopher J. Conselice",
        "Taehyun Kim",
        "Camila de Sá-Freitas",
        "Francesca Fragkoudi",
        "Justus Neumann",
        "E. Athanassoula"
      ],
      "abstract": "A nuclear disc at Cosmic Noon: evidence of early bar-driven galaxy evolution Zoe A. Le Conte, Dimitri A. Gadotti, Thomas Harvey, Leonardo Ferreira, Christopher J. Conselice, Taehyun Kim, Camila de Sá-Freitas, Francesca Fragkoudi, Justus Neumann, E. Athanassoula 6 pages, 3 figures, submitted to MNRAS Letters Astrophysics of Galaxies (astro-ph.GA) Recent studies have revealed that bars can form as early as a few billion years after the Big Bang, already displaying similar characteristics of evolved bars in the Local Universe. Bars redistribute angular momentum across the galaxy, regulating star formation, AGN activity, and building new stellar structures such as nuclear discs. However, the effects of bar-driven evolution on young galaxies are not yet known, as no evidence of bar-built stellar structures has ever been found beyond $z = 1$, until now. In this work, we show evidence of a bar-built, star-forming nuclear disc, already present at redshift $z = 1.5$. This is the first evidence of a bar-built stellar structure at Cosmic Noon. We find that this nuclear disc is actively forming stars and has the same size as some nuclear discs in nearby galaxies. This evidence solidifies the now emerging picture in which bars are fundamental not only in the late evolution of galaxies, but also in their early evolutionary stages. It changes the current paradigm by urging a revision of our picture of galaxy evolution beyond redshift one, to include new considerations on the role played by bars as early as a few billion years after the Big Bang.",
      "pdf_url": "https://arxiv.org/pdf/2601.18871.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18876",
      "title": "The Milky Way's circular velocity curve measured using element abundance gradients",
      "authors": [
        "Danny Horta",
        "Adrian M. Price-Whelan",
        "Sergey E. Koposov",
        "Jason A. S. Hunt",
        "David W. Hogg",
        "Carrie Filion",
        "Kathryn J. Daniel"
      ],
      "abstract": "The Milky Way's circular velocity curve measured using element abundance gradients Danny Horta, Adrian M. Price-Whelan, Sergey E. Koposov, Jason A. S. Hunt, David W. Hogg, Carrie Filion, Kathryn J. Daniel Under review in ApJ. 24 pages, 14 figures, 1 table Astrophysics of Galaxies (astro-ph.GA) Spectroscopic surveys now supply precise stellar label measurements such as element abundances for large samples of stars throughout the Milky Way. These element abundances are known to correlate with orbital actions or other dynamical invariants. We present a new data-driven method for empirically measuring the circular velocity curve of the Galaxy that uses element abundance gradients in the plane of radial kinematics. We use stellar surface abundances from the $\\textit{APOGEE}$ survey combined with kinematic data from the $\\textit{Gaia}$ mission. Our results confirm the ordered structure of the Milky Way disk in terms of average [Fe/H] and [Mg/Fe] abundance ratios, and suggest that $\\langle$[Fe/H]$\\rangle$ traces the radial position of stars in the disk, while $\\langle$[Mg/Fe]$\\rangle$ traces the orbital excursions around this radius. Our method uses the radial orbit structure in the Galaxy to enable an empirical measurement of the circular velocity curve, epicyclic and azimuthal frequencies, and kinematic gradients across the Milky Way disk. From these measurements, we infer a value of the circular velocity curve at the Solar radius of $v_{c,\\odot} = 235.3^{+2.8}_{-3.7}$ km s$^{-1}$ using the most constraining abundance ratio, [Mg/Fe]. We also measure the radial and azimuthal frequencies for a circular orbit at the solar radius, $\\kappa_{0,R_\\odot}=36.9^{+0.8}_{-1.0}$ km s$^{-1}$ kpc$^{-1}$ and $\\Omega_{0,R_\\odot}=28.5_{-0.1}^{+0.4}$ km s$^{-1}$ kpc$^{-1}$, respectively. These values lead to an estimate of the Oort constants of $A = 16.5^{+0.1}_{-0.1}$ km s$^{-1}$ kpc$^{-1}$ and $B=-11.9^{+0.1}_{-0.3}$ km s$^{-1}$ kpc$^{-1}$. We measure the radial acceleration at the Solar radius to be $(\\frac{\\partial \\Phi}{\\partial R})_{\\odot} = a_{R_\\odot}=7.0^{+0.2}_{-0.1}$ pc Myr$^{-2}$.",
      "pdf_url": "https://arxiv.org/pdf/2601.18876.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18893",
      "title": "Hubble Study of the Proper Motion of HST-1 in the Jet of M87",
      "authors": [
        "Rameshan Thimmappa",
        "Joey Neilsen",
        "Daryl Haggard",
        "Michael A. Nowak",
        "Łukasz Stawarz"
      ],
      "abstract": "Hubble Study of the Proper Motion of HST-1 in the Jet of M87 Rameshan Thimmappa, Joey Neilsen, Daryl Haggard, Michael A. Nowak, Łukasz Stawarz Accepted for publication in ApJ. 13 pages, 8 figures, 1 table Astrophysics of Galaxies (astro-ph.GA) The radio galaxy M87 is well known for its jet, which features a series of bright knots observable from radio to X-ray wavelengths. The most famous of these, HST-1, exhibits superluminal motion, and our analysis of {\\it Chandra} data \\citep{Thimmappa24} reveals a correlation between the X-ray flux of HST-1 and its separation from the core. This correlation likely arises from moving shocks in the jet, allowing measurement of the internal structure of HST-1 in the X-ray band. To follow up on these results, we use observations from the {\\it Hubble} Space Telescope Advanced Camera for Surveys HRC/WFC/SBC channel and the Wide Field Camera 3 (WFC3)'s UVIS to analyze the image and flux variability of HST-1. Our analysis includes 245 ACS and 120 WFC3 observations from 2002-2022, with a total exposure time of $\\sim345$ ks. We study the brightness profile of the optical jet and measure the relative separation between the core and HST-1 for comparison to the X-ray. We find that the X-ray and the UV/optical emission could arise from physically distinct regions. The measured proper motion of the knot HST-1 is 1.04$\\pm$0.04 c from 2002-2005 and around 2.1$\\pm$0.05 c from 2005-2022. We discuss the acceleration of the jet and the flaring synchrotron emission from HST-1 from optical to X-rays.",
      "pdf_url": "https://arxiv.org/pdf/2601.18893.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18896",
      "title": "Proof that the Milky Way experienced a significant merger only 1.5 billion years after the Big Bang",
      "authors": [
        "Davide Massari",
        "Chiara Zerbinati",
        "Cristiano Fanelli",
        "Amina Helmi",
        "Edoardo Ceccarelli",
        "Fernando Aguado-Agelet",
        "Santi Cassisi",
        "Ewoud Wempe",
        "Matteo Monelli",
        "Andrea Bellini",
        "Thomas Callingham",
        "Hanneke C. Woudenberg",
        "Roger Cohen",
        "Carme Gallart",
        "Elena Pancino",
        "Sara Saracino",
        "Maurizio Salaris",
        "Alessio Mucciarelli"
      ],
      "abstract": "Proof that the Milky Way experienced a significant merger only 1.5 billion years after the Big Bang Davide Massari, Chiara Zerbinati, Cristiano Fanelli, Amina Helmi, Edoardo Ceccarelli, Fernando Aguado-Agelet, Santi Cassisi, Ewoud Wempe, Matteo Monelli, Andrea Bellini, Thomas Callingham, Hanneke C. Woudenberg, Roger Cohen, Carme Gallart, Elena Pancino, Sara Saracino, Maurizio Salaris, Alessio Mucciarelli Revised version of a paper under review, 26 pages, 8 figures, 2 tables Astrophysics of Galaxies (astro-ph.GA) The merger history of the Galaxy has been traced back firmly to redshift 2 (10 Billion years ago). While there have been claims of the existence of at least one more significant merger before this time, supporting evidence has been indirect and contentious. Here we show that the population of globular clusters around the Galaxy depicts three distinct age-metallicity sequences, one associated with the merger with Gaia-Enceladus 10 billion years ago, one to the progenitor of the Milky Way and a third intermediate sequence associated to at least one merger which we estimate took place merely 1.5 billion years after the Big Bang. This discovery has been possible thanks to exquisite Hubble Space Telescope data and sophisticated analysis that enables very precise relative age determination of globular clusters. The newly identified sequence reveals that this merger took place with an object of stellar mass similar to that of Gaia-Enceladus (~5x10$^8$ M$_{\\odot}$), and which deposited most of its mass in the inner 6 kpc of the Milky Way. The unambiguous identification of a third merger event in the inner Galaxy puts to rest earlier debates, and honoring previous work we name the progenitor system Low-energy-Kraken-Heracles, or LKH for short.",
      "pdf_url": "https://arxiv.org/pdf/2601.18896.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18954",
      "title": "Statistical Predictions of the Accreted Stellar Halos around Milky Way-Like Galaxies",
      "authors": [
        "J. Sebastian Monzon",
        "Frank C. van den Bosch",
        "Martin P. Rey"
      ],
      "abstract": "Statistical Predictions of the Accreted Stellar Halos around Milky Way-Like Galaxies J. Sebastian Monzon, Frank C. van den Bosch, Martin P. Rey Astrophysics of Galaxies (astro-ph.GA) In the $\\Lambda$CDM paradigm, stellar halos form through the accretion and disruption of satellite galaxies. We introduce new semi-analytic modeling within the SatGen framework to track the ex-situ stellar components of Milky Way--like galaxies across large ensembles of merger trees, enabling a statistical study of the stochastic nature of galaxy assembly. We find that accreted stellar halos are typically built by only a few progenitors and are highly sensitive to the fate of the most massive satellite, producing order-of-magnitude variations in accreted stellar halo mass even at fixed host halo mass. Different stellar components trace distinct phases of host halo growth: central and accreted stellar mass correlate most strongly with early assembly, while surviving satellites trace more recent accretion. Finally, using Random Forest Regression, we quantify how well observable galaxy properties can recover halo assembly histories, providing a framework for interpreting upcoming low-surface-brightness observations of stellar halos.",
      "pdf_url": "https://arxiv.org/pdf/2601.18954.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19011",
      "title": "High resolution observations of 'dark' neutral hydrogen clouds in the Virgo cluster with the Very Large Array",
      "authors": [
        "Robert Minchin",
        "Rhys Taylor",
        "Emmanuel Momjian",
        "Boris Deshev",
        "Vojtěch Partík"
      ],
      "abstract": "High resolution observations of 'dark' neutral hydrogen clouds in the Virgo cluster with the Very Large Array Robert Minchin, Rhys Taylor, Emmanuel Momjian, Boris Deshev, Vojtěch Partík 16 pages, 16 figures, accepted for publication in the Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) We have observed six `dark' neutral hydrogen (HI) clouds discovered in the Virgo cluster by the Arecibo Galaxy Environment Survey (AGES) with the Karl G. Jansky Very Large Array (VLA), giving higher angular and velocity resolution than the original AGES observations. We detected compact HI emission in two of the sources, AGESVC1 231 and AGESVC1 274, allowing us to firmly associate them with faint ($m_g > 18.5$), blue ($g-i < 0.1$) optical counterparts with high $M_{HI}/L_g$ ratios. In a further two sources, we detected low column-density extended HI emission, consistent with these being dispersing clouds from ram-pressure stripping or tidal interactions. The final two sources were not detected with the VLA, allowing us to set low column-density limits on the HI detected by AGES that are consistent with these clouds also being formed from HI that is dispersing into the intra-cluster medium. The four HI sources not associated with optical counterparts thus appear likely to be relatively short-lived objects. No evidence was found for either pressure-supported turbulent spheres or stable dark galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2601.19011.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19148",
      "title": "ERGO-ML: The assembly histories of HSC galaxy images via invertible neural networks, contrastive learning, and cosmological simulations",
      "authors": [
        "Lukas Eisert",
        "Connor Bottrell",
        "Annalisa Pillepich",
        "Dylan Nelson",
        "Rhythm Shimakawa",
        "Marc Huertas-Company",
        "Ralf S. Klessen"
      ],
      "abstract": "ERGO-ML: The assembly histories of HSC galaxy images via invertible neural networks, contrastive learning, and cosmological simulations Lukas Eisert, Connor Bottrell, Annalisa Pillepich, Dylan Nelson, Rhythm Shimakawa, Marc Huertas-Company, Ralf S. Klessen Submitted to MNRAS, 25 pages, 10 figures Astrophysics of Galaxies (astro-ph.GA) In this paper of ERGO-ML (Extracting Reality from Galaxy Observables with Machine Learning), we develop a model that infers the merger/assembly histories of galaxies directly from optical images. We apply the self-supervised contrastive learning framework NNCLR (Nearest-Neighbor Contrastive Learning of visual Representations) on realistic HSC mock images (g,r,i - bands) produced from galaxies simulated within the TNG50 and TNG100 flagship runs of the IllustrisTNG project. The resulting representation is then used as conditional input for a cINN (conditional Invertible Neural Network) to gain posteriors for merger/assembly statistics, particularly the lookback time and stellar mass of the last major merger and the fraction of ex-situ stars. Through validation against the ground truth available for simulated galaxies, we assess the performance of our model, achieving good accuracy in inferring the stellar ex-situ fraction ($\\le \\pm 10$ per cent for 80 per cent of the test sample) and the mass of the last major merger (within $\\pm 0.5 \\log \\MSUN$ for stellar masses $>10^{9.5} \\MSUN$ ). We successfully apply the TNG-trained model to simulated mocks from the EAGLE simulation, demonstrating that our model is applicable outside of the TNG domain. We use our simulation-based model to infer aspects of the history of observed galaxies, in particular for HSC images that are close to the domain of TNG ones. We recover the trend of increasing ex-situ stellar fraction with stellar mass and more spherical morphology, but we also identify a discrepancy between TNG and HSC: on average, observed galaxies generally exhibit lower ex-situ fractions. Despite challenges such as information loss (e.g. projection effects and surface brightness limits) and domain shifts (from simulations to observations), our results demonstrate the feasibility of extracting the merger past of galaxies from their optical images.",
      "pdf_url": "https://arxiv.org/pdf/2601.19148.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19344",
      "title": "CH3CCH as a thermometer in warm molecular gas",
      "authors": [
        "Yuqiang Li",
        "Junzhi Wang",
        "Juan Li",
        "Xing Lu",
        "Siqi Zheng",
        "Chao Ou",
        "Qian Huang",
        "Miguel Santander-García",
        "José Jairo Díaz Luis",
        "Seokho Lee",
        "Tie Liu",
        "Zhiqiang Shen"
      ],
      "abstract": "CH3CCH as a thermometer in warm molecular gas Yuqiang Li, Junzhi Wang, Juan Li, Xing Lu, Siqi Zheng, Chao Ou, Qian Huang, Miguel Santander-García, José Jairo Díaz Luis, Seokho Lee, Tie Liu, Zhiqiang Shen Accepted for publication in ApJ, 27 pages, 15 figures Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Kinetic temperature is a fundamental parameter in molecular clouds. Symmetric top molecules, such as NH$_3$ and CH$_3$CCH, are often used as thermometers. However, at high temperatures, NH$_3$(2,2) can be collisionally excited to NH$_3$(2,1) and rapidly decay to NH$_3$(1,1), which can lead to an underestimation of the kinetic temperature when using rotation temperatures derived from NH$_3$(1,1) and NH$_3$(2,2). In contrast, CH$_3$CCH is a symmetric top molecule with lower critical densities of its rotational levels than those of NH$_3$, which can be thermalized close to the kinetic temperature at relatively low densities of about 10$^{4}$ cm$^{-3}$. To compare the rotation temperatures derived from NH$_3$(1,1)$\\&$(2,2) and CH$_3$CCH rotational levels in warm molecular gas, we used observational data toward 55 massive star-forming regions obtained with Yebes 40m and TMRT 65m. Our results show that rotation temperatures derived from NH$_3$(1,1)$\\&$(2,2) are systematically lower than those from CH$_3$CCH 5-4. This suggests that CH$_3$CCH rotational lines with the same $J$+1$\\rightarrow$$J$ quantum number may be a more reliable thermometer than NH$_3$(1,1)$\\&$(2,2) in warm molecular gas located in the surroundings of massive young stellar objects or, more generally, in massive star-forming regions.",
      "pdf_url": "https://arxiv.org/pdf/2601.19344.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19522",
      "title": "Variations in the Milky Way's Stellar Mass Function at [Fe/H] < -1",
      "authors": [
        "Jiadong Li",
        "Hans-Walter Rix",
        "Yuan-Sen Ting",
        "Yu-Ting Wang",
        "Szabolcs Mészáros",
        "Ilija Medan",
        "Chao Liu",
        "Zhiqiang Yan",
        "Peter J. Smith",
        "Dan Qiu",
        "Alexandre Roman-Lopes",
        "Gregory M. Green",
        "Danny Horta",
        "Zachary Way",
        "Tadafumi Matsuno",
        "Stefano Souza",
        "José G. Fernández-Trincado"
      ],
      "abstract": "Variations in the Milky Way's Stellar Mass Function at [Fe/H] < -1 Jiadong Li, Hans-Walter Rix, Yuan-Sen Ting, Yu-Ting Wang, Szabolcs Mészáros, Ilija Medan, Chao Liu, Zhiqiang Yan, Peter J. Smith, Dan Qiu, Alexandre Roman-Lopes, Gregory M. Green, Danny Horta, Zachary Way, Tadafumi Matsuno, Stefano Souza, José G. Fernández-Trincado 15 pages, 9 figures, 5 tables, Accepted for publication in ApJL Astrophysics of Galaxies (astro-ph.GA) We present the first determination of the Galactic stellar mass function (MF) for low-mass stars (0.2-0.5 M_sun) at metallicities [Fe/H] < -1. A sample of ~53,000 stars was selected as metal-poor on the basis of both their halo-like orbits and their spectroscopic [Fe/H] from Gaia DR3 BP/RP (XP) spectra. These metallicity estimates for low-mass stars were enabled by calibrating Gaia XP spectra with stellar parameters from SDSS-V. For -1.5 < [Fe/H] < -1, we find that the MF below 0.5 M_sun exhibits a \"bottom-heavy\" power-law slope of alpha ~ -1.6. We tentatively find that at even lower metallicities, the MF becomes very bottom-light, with a near-flat power-law slope of alpha ~ 0 that implies a severe deficit of low-mass stars. This metallicity-dependent variation is insensitive to the adopted stellar evolution model. These results show that the Galactic low-mass MF is not universal, with variations in the metal-poor regime. A further calibration of XP metallicities in the regime of M < 0.5 M_sun and [Fe/H] < -1.5 will be essential to verify these tentative low-metallicity trends.",
      "pdf_url": "https://arxiv.org/pdf/2601.19522.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19524",
      "title": "A complete survey of filaments in Cygnus X",
      "authors": [
        "Yingxi Li",
        "Keping Qiu"
      ],
      "abstract": "A complete survey of filaments in Cygnus X Yingxi Li, Keping Qiu Astrophysics of Galaxies (astro-ph.GA) Filamentary structures are widely observed in molecular clouds, yet most filament observations are biased toward case studies and small samples; a uniform census within a single giant molecular cloud is still missing. We do a complete census of filaments in Cygnus X and quantify their links to dense cores, the magnetic field (B field), and HII regions. Using the updated getsf algorithm on the Cygnus X column-density map, we extracted 2633 filaments and 6551 cores. We built CMFs for cores on and off filaments, compared filament orientations with the Planck B field, measured radial column-density profiles near HII-region boundaries, and computed distances between young stellar objects and filament spines. Filaments have a typical width of 0.5 pc in Cygnus X at a resolution of 0.12 pc and host > 93% of high-mass cores (>= 20 Msun). The on-filament CMF shows a high-mass (> 10 Msun) slope of -2.30, while the off-filament CMF is steeper (-2.83). The onCMF peak mass is well below the Bonnor-Ebert mass, whereas the outCMF peak is comparable to it. At 5' resolution, filaments are mostly perpendicular to the B field except at the lowest column densities; the transition occurs near Av = 10 mag. Prominent filaments and high-mass cores preferred to be located around HII-region boundaries or at intersections of multiple HII regions; filament profiles are steeper on the side facing the HII region. Massive-core formation depends strongly on filaments, which may provide reservoirs that feed cores via accretion. The B field likely regulates filament formation, consistent with the type-O mode (converging flows along an oblique MHD shock) and an HII-driven bubble-filament paradigm for Cygnus X.",
      "pdf_url": "https://arxiv.org/pdf/2601.19524.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19525",
      "title": "Low-frequency-selected Fast Radio Burst Host Galaxy Candidates",
      "authors": [
        "Yu-Zhu Sun",
        "Rhaana L. C. Starling",
        "Rob A. J. Eyles-Ferris",
        "Antonia Rowlinson",
        "Ralph A. M. J. Wijers",
        "Nial R. Tanvir"
      ],
      "abstract": "Low-frequency-selected Fast Radio Burst Host Galaxy Candidates Yu-Zhu Sun, Rhaana L. C. Starling, Rob A. J. Eyles-Ferris, Antonia Rowlinson, Ralph A. M. J. Wijers, Nial R. Tanvir 16 pages, 9 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We present a pilot study on the host galaxy environments of CHIME/FRBs by cross-matching baseband-localised events with the LOFAR Two-metre Sky Survey Data Release 2 (LoTSS DR2) at 144 MHz. Unlike traditional methods reliant on optical imaging, our radio-based selection allows for the identification of dust-obscured or optically faint star-forming galaxies. Of the 140 CHIME FRBs considered, 33 lie within the LoTSS DR2 footprint, and 16 show potential radio counterparts. Through multi-wavelength analysis, spectral energy distribution (SED) fitting, and redshift constraints from the Macquart relation, we identify two secure and one tentative host candidates, all consistent with active star formation. However, their H$\\alpha$-derived star formation rates appear underestimated, likely due to significant dust attenuation, as suggested by infrared colours and compact optical morphologies. Our results highlight the value of low-frequency radio data in complementing optical host searches and demonstrate the feasibility of host identification even in the absence of optical confirmation. With forthcoming data from LoTSS DR3 and the full CHIME/FRB baseband release, this method offers a promising path toward statistically robust studies of FRB host galaxies and their environments.",
      "pdf_url": "https://arxiv.org/pdf/2601.19525.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19594",
      "title": "An analysis of the J-method from the perspective of the AGB evolution",
      "authors": [
        "C. Gavetti",
        "P. Ventura",
        "F. Dell'Agli",
        "M. Correnti",
        "F. La Franca"
      ],
      "abstract": "An analysis of the J-method from the perspective of the AGB evolution C. Gavetti, P. Ventura, F. Dell'Agli, M. Correnti, F. La Franca Accepted for publication in Astronomy & Astrophysics, 12 pages, 8 figures Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The JAGB method has been proposed as a distance indicator for Local Group galaxies. We investigate the populations of the J region in the (J-K,J) colour-magnitude plane of the Large and Small Magellanic Clouds (LMC and SMC), aiming to distinguish general features of the J luminosity function (JLF) from those sensitive to the stellar population of each galaxy. Using a population synthesis approach based on stellar evolution and dust formation modelling, we predict the distribution of stars within the J region and compare it with observations. Stars in this region are identified as recently formed C-stars that have not yet accumulated large amounts of carbon. Typically, 2--3 $M_\\odot$ stars remain longer in the J region, while lower-mass stars evolve faster. The JLF of the LMC, peaked at the expected magnitudes for these stars, confirms this picture. In the SMC, the J flux distribution is shifted to higher magnitudes, indicating an older population with lower-mass progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2601.19594.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19609",
      "title": "A Catalog of 971 FR-I Radio Galaxies from the FIRST Survey via Hybrid Deep Learning and Ridgeline Flux Density Distribution Analysis",
      "authors": [
        "Baoqiang Lao",
        "Xiaolong Yang",
        "Wenjun Xiao",
        "Tapan K. Sasmal",
        "Yanli Zou",
        "Didi Liu",
        "Zhixian Liao",
        "Ye Lu",
        "Rushuang Zhao"
      ],
      "abstract": "A Catalog of 971 FR-I Radio Galaxies from the FIRST Survey via Hybrid Deep Learning and Ridgeline Flux Density Distribution Analysis Baoqiang Lao, Xiaolong Yang, Wenjun Xiao, Tapan K. Sasmal, Yanli Zou, Didi Liu, Zhixian Liao, Ye Lu, Rushuang Zhao 18 pages, 10 figures, 2 tables; accepted for publication in ApJS Astrophysics of Galaxies (astro-ph.GA) We present a catalog of 971 FR-I radio galaxies (FR-Is) identified from the Very Large Array Faint Images of the Radio Sky at Twenty-Centimeters (FIRST) survey. The identifications were made using a hybrid method that combines deep learning with ridgeline flux density distribution analysis. Among these sources, 845 are new discoveries. The catalog comprises sources characterized by edge-darkened double jets, an absence of significant bent morphology, and angular sizes ranging from 23 to 159 arcseconds. Optical and/or infrared counterparts have been identified for 813 FR-Is. Among these, the host galaxies are predominantly (88.1\\%) red galaxies, with the remainder (11.9\\%) being blue galaxies; notably, most blue galaxies exhibit high radio power. The FR-I sample spans a radio power range of $1.20 \\times 10^{21} \\leq P_{\\rm 1400} \\leq 3.55 \\times 10^{27} \\, {\\rm W\\,Hz}^{-1}$ at 1400 MHz and reaches redshifts up to $z = 2.307$. The host galaxies have $r$-band absolute magnitudes in the range $-24 \\lesssim M_r \\lesssim -20$ mag. For the 512 FR-Is with estimates, the black hole masses fall within $10^7 \\lesssim M_{\\rm BH} \\lesssim 7.94 \\times 10^9 \\, M_{\\odot}$. Based on optical emission-line ratios and mid-infrared colors, spectroscopic classification shows that 571 hosts are low-excitation radio galaxies (LERGs) and 59 are high-excitation radio galaxies (HERGs).",
      "pdf_url": "https://arxiv.org/pdf/2601.19609.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19708",
      "title": "A near-infrared stellar atlas of the Galactic plane from the VVVX survey",
      "authors": [
        "Javier Alonso-García",
        "Maren Hempel",
        "Roberto K. Saito",
        "Dante Minniti",
        "Nicholas J. G. Cros",
        "Jorge Anais",
        "Jura Borissova",
        "Márcio Catelan",
        "José G. Fernández-Trincado",
        "Elisa R. Garro",
        "Zhen Guo",
        "Philip W. Lucas",
        "María G. Navarro",
        "Casmir O. Obasi",
        "Leigh C. Smith"
      ],
      "abstract": "A near-infrared stellar atlas of the Galactic plane from the VVVX survey Javier Alonso-García, Maren Hempel, Roberto K. Saito, Dante Minniti, Nicholas J. G. Cros, Jorge Anais, Jura Borissova, Márcio Catelan, José G. Fernández-Trincado, Elisa R. Garro, Zhen Guo, Philip W. Lucas, María G. Navarro, Casmir O. Obasi, Leigh C. Smith Accepted for publication in A&A, 8 pages, 9 Figures Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The VISTA Variables in the Via Lactea eXtended (VVVX) ESO public survey observed the Galactic plane and the outer Galactic bulge in the near-infrared to mitigate the effects of extinction that severely limit optical observations of these regions. By significantly expanding the area covered by the original VVV survey, VVVX enables a deeper and broader exploration of the most obscured and crowded regions of the Milky Way. We aim to extend and complete our photometric catalogs of the entire Galactic plane region accessible from the southern hemisphere, focusing on the areas newly covered by the VVVX survey. Building on previous work, we applied point-spread function fitting techniques to detect point sources and extract their deep J, H, and Ks photometry across the VVVX footprint. The resulting catalogs were calibrated using astrometric and photometric reference data. Cross-matching between filters and epochs was used to ensure a high level of reliability and completeness. We produce a deep, highly complete near-infrared catalog of more than 700 million sources in the Galactic plane and outer Galactic bulge. When combined with our previous VVV atlas, the full catalog includes over 1.5 billion sources. The derived density maps and color-magnitude diagrams enable detailed studies of Galactic structure, extinction, and stellar populations, and highlight features such as the Carina arm tangency, the Sagittarius stream, and numerous star clusters. This extended atlas provides an unprecedented view of the innermost regions of the Milky Way. It is now publicly available through the VISTA Science Archive, offering a valuable resource for the astronomical community to investigate the structure and evolution of the Galactic disk and bulge.",
      "pdf_url": "https://arxiv.org/pdf/2601.19708.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19725",
      "title": "Exploring the effects of diffuse ionised gas in two local analogues of high-redshift star-forming galaxies",
      "authors": [
        "P. Lagos",
        "A. Nigoche-Netro",
        "T. C. Scott",
        "C. Sengupta",
        "R. Demarco"
      ],
      "abstract": "Exploring the effects of diffuse ionised gas in two local analogues of high-redshift star-forming galaxies P. Lagos, A. Nigoche-Netro, T. C. Scott, C. Sengupta, R. Demarco Accepted for publication in A&A. The abstract has been modified to comply with the astro-ph length requirement Astrophysics of Galaxies (astro-ph.GA) Aims. We investigate the impact of diffuse ionised gas (DIG) on the determination of emission line ratios and gas-phase metallicities in two local analogues of high-redshift star-forming galaxies: UM 462 and IIZw 40. Understanding how DIG affects these quantities is essential for interpreting unresolved observations of distant galaxies, where integrated spectra are often used to trace their chemical evolution. Methods. Using archival Very Large Telescope, Multi-Unit Spectroscopic Explorer (MUSE) data, we spatially resolved the warm ionised medium of both galaxies. We derived oxygen abundances through the direct method and several HII-based strong-line calibrators, and we used the H$\\alpha$ surface brightness ($\\Sigma$(H$\\alpha$)) to distinguish regions dominated by HII or DIG emission. Results. Oxygen abundances derived from the N2 and O3N2 indices show an inverse correlation with $\\Sigma$(H$\\alpha$), ionisation parameter, and EW(H$\\alpha$), with DIG-dominated regions exhibiting higher 12+log(O/H) than the galaxy mean by $\\sim$0.2 dex in UM 462 and $\\sim$0.1 dex in IIZw 40. The metallicity differences between HII-dominated and DIG-dominated $\\Sigma$(H$\\alpha$) bins reach $\\sim$0.4 dex and $\\sim$0.3 dex in UM 462 and IIZw 40, respectively. The observed trends with $\\Sigma$(H$\\alpha$), metallicity, EW(H$\\alpha$), and ionisation parameter indicate smoothly varying ionisation conditions rather than true abundance variations. These effects reflect different ionisation sources and levels, and can produce spurious metallicity gradients in galaxies with extended DIG structures, potentially mimicking signatures of metal-poor gas infall. In our sample, DIG ionisation is most likely dominated by photon leakage from H II regions, with additional contributions from feedback-driven shocks.",
      "pdf_url": "https://arxiv.org/pdf/2601.19725.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19842",
      "title": "Dynamical Evidence for a Billion Solar Mass Black Hole in Galaxy NGC 4061 from ALMA $^{12}$CO(2-1) Kinematics",
      "authors": [
        "Dieu D. Nguyen",
        "Long Q. T. Nguyen",
        "Elena Gallo",
        "Hai N. Ngo",
        "Que T. Le",
        "Fabio Pacucci",
        "Tinh Q. T. Le",
        "Tuan N. Le",
        "Tien H. T. Ho"
      ],
      "abstract": "Dynamical Evidence for a Billion Solar Mass Black Hole in Galaxy NGC 4061 from ALMA $^{12}$CO(2-1) Kinematics Dieu D. Nguyen, Long Q. T. Nguyen, Elena Gallo, Hai N. Ngo, Que T. Le, Fabio Pacucci, Tinh Q. T. Le, Tuan N. Le, Tien H. T. Ho 26 pages, 16 figures, 10 tables. Submitted to The Astrophysical Journal (ApJ) Astrophysics of Galaxies (astro-ph.GA) We present the first robust dynamical measurement of the supermassive black hole (SMBH) mass in the massive early-type galaxy NGC 4061 using high-spatial-resolution ALMA observations of the $^{12}$CO(2-1) emission. By combining archival Cycle 6 data with new Cycle 7 observations, we achieve a synthesized beam of $0''.16 \\times 0''.13$, comparable to the expected sphere of influence of the central black hole. The molecular gas forms a regularly rotating circumnuclear disk aligned with the prominent dust lane seen in HST imaging. We model the full three-dimensional ALMA data cube using the KinMS forward-modeling framework, exploring both data-driven and analytic prescriptions for the gas surface brightness distribution. Our Bayesian analysis yields a best-fitting SMBH mass of $M_{\\rm BH} = (1.17^{+0.08}_{-0.10}\\,[{\\rm stat.}] \\pm 0.43\\,[{\\rm syst.}]) \\times 10^{9}$ M$_\\odot$ and an $I$-band stellar mass-to-light ratio of $M/L_{\\rm F814W} = 3.46^{+0.07}_{-0.06}\\,[{\\rm stat.}] \\pm 0.10\\,[{\\rm syst.}]$ M$_\\odot$/L$_\\odot$. The inferred black hole mass is fully consistent across different modeling assumptions and remains insensitive to plausible radial variations in the $M/L_{\\rm F814W}$ profile. Our results resolve the long-standing discrepancy between previous indirect mass estimates based on conflicting stellar velocity dispersion measurements and demonstrate that the exceptionally large dispersion reported in the literature is likely spurious. This study highlights the power of high-resolution ALMA molecular gas kinematics for precision SMBH mass measurements at the high-mass end of the local black hole mass function.",
      "pdf_url": "https://arxiv.org/pdf/2601.19842.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19866",
      "title": "Discovery of Galactic center ejected star in DESI DR1",
      "authors": [
        "Manuel Cavieres",
        "Sergey E. Koposov",
        "Elena Maria Rossi",
        "Zephyr Penoyre",
        "Sill Verberne"
      ],
      "abstract": "Discovery of Galactic center ejected star in DESI DR1 Manuel Cavieres, Sergey E. Koposov, Elena Maria Rossi, Zephyr Penoyre, Sill Verberne 12 pages, 5 figures, submitted to A&A, comments are welcome! Astrophysics of Galaxies (astro-ph.GA) Hypervelocity stars (HVSs) are stars ejected from the Galactic Centre (GC) through tidal interactions with the central supermassive black hole. Formed in the immediate vicinity of Sgr~A$^\\ast$, these stars are accelerated to velocities high enough to escape the GC and be observable in the Galactic halo. Using spectroscopy from the Dark Energy Spectroscopic Instrument (DESI) and astrometry from Gaia, we conducted a six-dimensional search for HVSs and identified a compelling candidate, hereafter DESI-312, whose bound trajectory can be confidently traced back to the GC. The star resides in the inner halo and exhibits supersolar metallicity ([Fe/H] $= 0.27\\pm 0.09$), distinct from other known stellar populations with radial orbits. Its inferred GC ejection velocity of $698^{+35}_{-27}$ is consistent with a Hills mechanism ejection, supporting an origin in the innermost regions of the Milky Way. We considered alternative origins for the star, including disk ejections from young clusters and globular clusters, but these scenarios fail to explain both its orbit and metallicity. Unlike previously identified A- and B-type HVSs, DESI-312 is a $\\sim 1\\,M_{\\odot}$ star on the main sequence or early subgiant branch, thus enabling a detailed chemical analysis of its atmosphere and offering a rare window - unobscured by dust and crowding - into the composition of the central regions of the Galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2601.19866.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18878",
      "title": "Homogenous abundances of Mg, Si, Ca, and Ti for about 1500 red giants in 16 globular clusters from FLAMES spectra",
      "authors": [
        "Eugenio Carretta"
      ],
      "abstract": "Homogenous abundances of Mg, Si, Ca, and Ti for about 1500 red giants in 16 globular clusters from FLAMES spectra Eugenio Carretta (INAF - Osservatorio di Astrofisica e Scienza dello Spazio di Bologna) 12 pages, 12 figures, 2 tables and 1 on line table, plus 5 pages with 4 figures and 3 tables of Appendix; accepted for publication on Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The FLAMES survey ``Na-O anti-correlation and HB\" uncovered the modern standard for globular clusters (GCs), that is their ubiquitous multiple stellar populations (MPs) distinct by the abundance of proton-capture elements. That survey can still be mined to extract a wealth of data. We derive new abundances of Mg, Si, Ca, and Ti for 948, 954, 1542, and 1350 red giant branch stars in 16 GCs, both formed in situ or accreted in the Milky Way. The program GCs cover the metallicity range from [Fe/H]=-2.35 dex to [Fe/H]=-0.74 dex. Both the halo and disc GCs show a clear overabundance of alpha-elements with the modulation in Mg and Si due to the MPs phenomenon in different clusters. We found star to star variations in Si abundance correlated to changes in Na in more than half of our sample, implying that temperatures in excess of about 65 MK were achieved in the polluters responsible for the enrichment. We confirm with an enlarged sample the previous result that significant variations in Mg are observed in GCs that are metal-poor, massive or both. Evidence of excess of Ca with respect to reference unpolluted field stars are found in NGC 6752 and NGC 7078, indicating the action of proton-capture reactions at very high temperature regime in these GCs. These excesses fit very well in a previously found relation as a function of a combination of cluster mass and metallicity shown by other typical signatures of MPs. At odds with previous results based on the Si abundance from APOGEE, we found that the average abundance of alpha-elements is not an efficient discriminating factor between in situ and accreted GCs.",
      "pdf_url": "https://arxiv.org/pdf/2601.18878.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18884",
      "title": "Physical and Chemical Characterization of GY 91's Multi-ringed Protostellar Disk with ALMA",
      "authors": [
        "Sally D. Jiang",
        "Jane Huang",
        "Ian Czekala",
        "Leon Trapman",
        "Yuri Aikawa",
        "Sean M. Andrews",
        "Jaehan Bae",
        "Edwin A. Bergin",
        "Charles J. Law",
        "Romane Le Gal",
        "Feng Long",
        "François Ménard",
        "Karin I. Öberg",
        "Chunhua Qi",
        "Richard Teague",
        "David Wilner",
        "Ke Zhang"
      ],
      "abstract": "Physical and Chemical Characterization of GY 91's Multi-ringed Protostellar Disk with ALMA Sally D. Jiang, Jane Huang, Ian Czekala, Leon Trapman, Yuri Aikawa, Sean M. Andrews, Jaehan Bae, Edwin A. Bergin, Charles J. Law, Romane Le Gal, Feng Long, François Ménard, Karin I. Öberg, Chunhua Qi, Richard Teague, David Wilner, Ke Zhang Accepted for Publication in ApJ, 28 pages, 10 Figures (in text), 9 tables Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) GY 91, commonly categorized as a Class I young stellar object, is notable for disk dust substructures that have been hypothesized to trace early planet formation. Using the ALMA 12-m and ACA arrays, we present new Band 7 dust continuum and molecular line observations of GY 91 at an angular resolution of (~40 au). We report detections of CS $J=6-5$, N$_2$H$^+$ $J=3-2$, C$^{18}$O $J=3-2$, H$_2$CS $J_{K_a, K_c} = 8_{1,7}-7_{1,6}$, H$_2$CO $J_{K_a, K_c} = 4_{0,4}-3_{0,3}$, and H$_2$CO $J_{K_a, K_c} = 4_{2,3}-3_{2,2}$, as well as a tentative detection of $^{13}$C$^{18}$O $J=3-2$. We observe azimuthal asymmetry in CS and H$_2$CS emission, as well as radially structured H$_2$CO $4_{0,4}-3_{0,3}$ emission outside the dust continuum. C$^{18}$O and H$_2$CO 4$_{0,4}-3_{0,3}$ show significant cloud contamination, while CS and N$_2$H$^+$ are good tracers of Keplerian rotation originating from the disk. Envelope emission does not appear to contribute significantly either to the continuum or molecular line observations. GY 91's chemical properties appear in large part to resemble those of Class II disks, although observations of additional molecular probes should be obtained for a fuller comparison. With CS, we estimated a dynamical stellar mass of 0.58 $M_\\odot$, which is higher than previous estimates from stellar evolutionary models (0.25 $M_\\odot$). Using both radiative transfer modeling of the dust continuum and comparison of the C$^{18}$O and N$_2$H$^+$ fluxes to literature thermochemical models, we estimate a disk mass of $\\sim0.01$ $M_\\odot$.",
      "pdf_url": "https://arxiv.org/pdf/2601.18884.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18885",
      "title": "Homogeneous abundance ratios of hydrostatic and explosive alpha-elements in globular clusters from high resolution optical spectroscopy",
      "authors": [
        "Eugenio Carretta"
      ],
      "abstract": "Homogeneous abundance ratios of hydrostatic and explosive alpha-elements in globular clusters from high resolution optical spectroscopy Eugenio Carretta (INAF - Osservatorio di Astrofisica e Scienza dello Spazio di Bologna) 8 pages, 7 figures, 1 table plus 1 page with 1 table in Appendix; accepted for publication on Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Galactic globular clusters (GCs) were born shortly after the Big Bang. For such old stellar systems the initial mass function (IMF) at the high mass regime can never be observed directly, because stars more massive than about 1 Mo have evolved since longtime. However, the hydrostatic to explosive alpha-element ratio (HEx ratio) offers a way to bypass the lack of observable high mass stars through the yields that massive stars released when exploding as supernovae, incorporated in the stars we presently observe in GCs. The HEx ratio measures the percentage of high mass stars over the total number of stars exploding as supernovae and it is an efficient probe of the ephemeral first phases of the GC evolution. We exploited a recently completed survey to assemble a dataset of very homogeneous abundances of alpha-elements in 27 GCs from [Fe/H]~ -2.4 to ~ -0.3 dex. In agreement with previous results from APOGEE, we confirm that the HEx ratio is indistinguishable for GCs formed in situ and accreted in the Galaxy, and that this ratio decreases with increasing metallicity. However, we posit that this trend is better explained by a metallicity-dependent IMF deficient in the highest mass stars at high metallicity, as corroborated by the declining [O/Mg] ratio as a function of the [Mg/H] ratio. At odds with the previous analysis based on APOGEE data, we detect an anti-correlation of HEx ratio with both present day and initial GC masses. Finally, we hypothesise that in that analysis, the stars of the GC M 54 were probably confused with stars in the core of the Sagittarius dwarf galaxy, where the cluster is presently immersed.",
      "pdf_url": "https://arxiv.org/pdf/2601.18885.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.11269",
      "title": "Discovery of a 21 cm absorption system at z=2.327 with CHIME",
      "authors": [
        "CHIME Collaboration",
        "Mandana Amiri",
        "Arnab Chakraborty",
        "Simon Foreman",
        "Mark Halpern",
        "Alex S. Hill",
        "Gary Hinshaw",
        "Carolin Hofer",
        "Albin Joseph",
        "Joshua MacEachern",
        "Kiyoshi W. Masui",
        "Juan Mena-Parra",
        "Arash Mirhosseini",
        "Ue-Li Pen",
        "Tristan Pinsonneault-Marotte",
        "Alex Reda",
        "J. Richard Shaw",
        "Seth R. Siegel",
        "Yukari Uchibori",
        "Rik van Lieshout",
        "Haochen Wang",
        "Dallas Wulf"
      ],
      "abstract": "Discovery of a 21 cm absorption system at z=2.327 with CHIME CHIME Collaboration, Mandana Amiri, Arnab Chakraborty, Simon Foreman, Mark Halpern, Alex S. Hill, Gary Hinshaw, Carolin Hofer, Albin Joseph, Joshua MacEachern, Kiyoshi W. Masui, Juan Mena-Parra, Arash Mirhosseini, Ue-Li Pen, Tristan Pinsonneault-Marotte, Alex Reda, J. Richard Shaw, Seth R. Siegel, Yukari Uchibori, Rik van Lieshout, Haochen Wang, Dallas Wulf 11 pages, 5 figures, Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We report the detection of a new 21 cm absorption system associated with the radio source NVSS J164725+375218 at a redshift of z=2.327, identified through a pilot survey conducted by the Canadian Hydrogen Intensity Mapping Experiment (CHIME). This is the fifth detection of an associated system at z > 2. By analyzing a subset of available data, we conduct a spectrally blind survey for 21 cm absorption systems within the redshift range of 0.78 to 2.55 along 202 lines of sight toward known sources in the declination range of 35 to 60 degrees. We detect three 21 cm absorbers: two previously known intervening systems and one newly discovered associated system. By fitting the absorption profiles with models containing one to three Gaussian components and selecting the best model using the Bayesian information criterion, we estimate the optical depth, velocity-integrated optical depth, and the ratio between the HI column density and the spin temperature of the absorption systems. These results demonstrate CHIME's ability to discover new absorbers, even in a small subset of its full dataset.",
      "pdf_url": "https://arxiv.org/pdf/2506.11269.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16977",
      "title": "ReveaLLAGN 1: JWST Emission-Line Spectra Reveal Low-Luminosity AGN with UV-Deficient SEDs and Warm Molecular Gas",
      "authors": [
        "Kameron Goold",
        "Anil Seth",
        "Mallory Molina",
        "David Ohlson",
        "Nischal Acharya",
        "Torsten Böker",
        "Antoine Dumont",
        "Michael Eracleous",
        "Anja Feldmeier-Krause",
        "Juan Antonio Fernández-Ontiveros",
        "Elena Gallo",
        "Andy D. Goulding",
        "Kayhan Gültekin",
        "Luis C. Ho",
        "Nadine Neumayer",
        "Richard M. Plotkin",
        "Almudena Prieto",
        "Jessie C. Runnoe",
        "Shobita Satyapal",
        "Glenn van de Ven",
        "Jonelle L. Walsh",
        "Feng Yuan",
        "Nora Lützgendorf"
      ],
      "abstract": "ReveaLLAGN 1: JWST Emission-Line Spectra Reveal Low-Luminosity AGN with UV-Deficient SEDs and Warm Molecular Gas Kameron Goold, Anil Seth, Mallory Molina, David Ohlson, Nischal Acharya, Torsten Böker, Antoine Dumont, Michael Eracleous, Anja Feldmeier-Krause, Juan Antonio Fernández-Ontiveros, Elena Gallo, Andy D. Goulding, Kayhan Gültekin, Luis C. Ho, Nadine Neumayer, Richard M. Plotkin, Almudena Prieto, Jessie C. Runnoe, Shobita Satyapal, Glenn van de Ven, Jonelle L. Walsh, Feng Yuan, Nora Lützgendorf Submitted to The Astrophysical Journal; under review after addressing referee comments. 25 pages, 10 figures Astrophysics of Galaxies (astro-ph.GA) We present near- and mid-infrared spectra of eight Low-Luminosity Active Galactic Nuclei (LLAGN), spanning nearly four orders of magnitude in black hole mass and Eddington ratio, obtained with JWST/NIRSpec and MIRI as part of the ReveaLLAGN program along with identical archival data of Cen A. The high spatial resolution of JWST cleanly separates AGN emission from host-galaxy contamination, enabling detections of high-ionization potential lines more than an order of magnitude fainter than previously measured. Emission-line diagnostics reveal a transition at log($L_{bol}/L_{Edd}$) ~ -3.5, where the spectral energy distribution becomes increasingly deficient in ultraviolet photons. We find that rotational H$_2$ excitation temperatures are elevated (~500 K higher) compared to both higher-luminosity AGN and star-forming galaxies, while the H$_2$(0-0)S(3)/PAH$_{11.3 \\mu m}$ ratios are consistent with those observed in the AGN population. We discuss the possible roles of outflows, jets, and X-ray dominated regions in shaping the interstellar medium surrounding LLAGN. Silicate emission at ~10 $\\mu$m, localized to the nuclear region, is detected in most ReveaLLAGN targets. This dataset offers the first comprehensive JWST-based characterization of infrared emission lines in the nuclear regions of LLAGN.",
      "pdf_url": "https://arxiv.org/pdf/2601.16977.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18905",
      "title": "The Solar Neighborhood LIV: 54 Orbits of M Dwarf Multiples within 30 Parsecs with Speckle Interferometry at SOAR",
      "authors": [
        "Eliot Halley Vrijmoet , Andrei Tokovinin , Todd J. Henry , Jennifer G. Winters , Wei-Chun Jao , Elliott Horch Five College Astronomy Department of Smith College, RECONS Institute, Cerro Tololo Inter-American Observatory -- NSF's NOIRLab, Bridgewater State University, Georgia State University, Southern Connecticut State University)"
      ],
      "abstract": "The Solar Neighborhood LIV: 54 Orbits of M Dwarf Multiples within 30 Parsecs with Speckle Interferometry at SOAR Eliot Halley Vrijmoet (1 and 2), Andrei Tokovinin (3), Todd J. Henry (2), Jennifer G. Winters (2 and 4), Wei-Chun Jao (2 and 5), Elliott Horch (2 and 6) ((1) Five College Astronomy Department of Smith College, (2) RECONS Institute, (3) Cerro Tololo Inter-American Observatory -- NSF's NOIRLab, (4) Bridgewater State University, (5) Georgia State University, (6) Southern Connecticut State University) 28 pages, 9 figures, 6 tables. Accepted for publication in AJ Solar and Stellar Astrophysics (astro-ph.SR) We present 1066 speckle measurements of M dwarf multiples observed over 2021-2024, all taken with HRCam on the Southern Astrophysical Research 4.1 m telescope. Among these, 900 observations resolve companions in 212 pairs, with separations spanning 17 milliarcseconds to 3.4 arcsec and brightness differences ranging from 0 to 4.9 magnitudes in the I filter. We have characterized the orbits of 54 of these companions, spanning periods of 0.67-30 yr, by combining our data with literature astrometry, radial velocities, and, in four cases, Hipparcos-Gaia accelerations. Among the orbits presented here are 28 that are the first-ever such characterizations for their systems, and 26 that revise previously-published orbits, thus providing a significant update to the observed dynamics of M dwarfs in the solar neighborhood. From these orbits, we provide new and updated dynamical total masses for these systems, precise to 0.7-7% in nearly all cases. Future mass derivations for components in these systems will contribute to efforts in refining the mass-luminosity relation for the smallest stars, and will enhance investigations of age, magnetism, and metallicity effects on luminosities at a given mass.",
      "pdf_url": "https://arxiv.org/pdf/2601.18905.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18965",
      "title": "The MIRI Excess around Degenerates (MEAD) Survey II: A Probable Planet detected via IR Excess around WD 0644+025",
      "authors": [
        "Sabrina Poulsen",
        "John Debes",
        "Ashley Messier",
        "Erika Le Bourdais",
        "Carl Melis",
        "Misty Cracraft",
        "Samuel Boucher",
        "Mukremin Kilic",
        "Scott Kenyon",
        "Mark C. Wyatt",
        "Seth Redfield",
        "Patrick Dufour",
        "Loic Albert",
        "Susan E. Mullally",
        "William T. Reach",
        "Fergal Mullally",
        "David A. Golimowski"
      ],
      "abstract": "The MIRI Excess around Degenerates (MEAD) Survey II: A Probable Planet detected via IR Excess around WD 0644+025 Sabrina Poulsen, John Debes, Ashley Messier, Erika Le Bourdais, Carl Melis, Misty Cracraft, Samuel Boucher, Mukremin Kilic, Scott Kenyon, Mark C. Wyatt, Seth Redfield, Patrick Dufour, Loic Albert, Susan E. Mullally, William T. Reach, Fergal Mullally, David A. Golimowski Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) The MIRI Excess Around Degenerates (MEAD) Survey is a cycle 2 JWST program designed to image nearby white dwarfs with MIRI at 10 and 15 microns. This survey targeted 56 white dwarfs within 25 pc to search for mid-infrared excesses, flux deficits from collision-induced absorption, and resolved substellar companions. In this paper we present our analysis of WD 0644+025, an unusually massive white dwarf (0.95 Msun) and the MEAD target exhibiting the most significant mid-infrared excess. The observed JWST MIRI photometry shows a 7.3 sigma excess at 15 microns and a 3.6 sigma excess at 10 microns, which may be associated with either a planetary companion or a circumstellar dust disk. This excess corresponds to a companion mass of 6.8 Mjup (Teff=261 +/- 9 K) with orbital distance <11.8 au, although substantially lower masses are possible if we consider a closely orbiting insolated companion. No spatially resolved sources are detected within 200 au, with contrast curve analysis excluding planets more massive than 2 Mjup beyond ~12 au. Metal pollution is confirmed in both archival Keck HIRES spectra from 1999 and new observations from 2025, with no evidence suggesting the accretion rate has substantially changed over the decades. We explore possible dust disk morphologies to describe the observed IR excess, and find that traditional debris disks struggle to fit our data. WD 0644+025 thus represents a compelling case study in the growing population of white dwarfs with cold infrared excesses, and highlights JWST's ability to probe planetary system remnants inaccessible to prior infrared observatories.",
      "pdf_url": "https://arxiv.org/pdf/2601.18965.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19363",
      "title": "How to interpret near-infrared polarisation spectra of active M dwarfs?",
      "authors": [
        "Oleg Kochukhov"
      ],
      "abstract": "How to interpret near-infrared polarisation spectra of active M dwarfs? Oleg Kochukhov 14 pages, 7 figures; accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) Analyses of global magnetic fields in M dwarfs rely on many approximations regarding the derivation of average line profiles from spectropolarimetric data, interpreting them with analytical functions and modelling them using Zeeman Doppler imaging (ZDI). These assumptions have not been systematically tested. We assessed the accuracy of standard treatments of average polarisation profiles in M dwarfs and their interpretation with ZDI. We focused on the filling-factor approach, which attempts to represent coexisting global and small-scale fields. We performed polarised radiative transfer calculations across the near-infrared spectrum of a typical M dwarf. From these theoretical spectra, we derived mean Stokes profiles and approximated them with different line-synthesis methods. To test the recovery of global fields, we performed ZDI inversions using simulated Stokes V observations for low- and high-activity cases. The analytical approximation of mean polarisation profiles reproduces Stokes I and V only for fields up to ~1 kG and fails for linear polarisation. ZDI with single-line analytical Stokes V profiles is adequate for weakly magnetic M dwarfs with fields below a few hundred gauss. However, combined with the filling-factor formalism, this traditional modelling approach produces unphysical local fields and distorted global geometries for active M dwarfs with multi-kilogauss fields. These issues are mitigated using a new mapping technique based on theoretical Stokes profiles that account for both global and randomly distributed small-scale fields. Our study reveals fundamental limitations of current ZDI analyses of active M dwarfs and questions the reliability of some published maps. (abridged)",
      "pdf_url": "https://arxiv.org/pdf/2601.19363.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19382",
      "title": "Appraising the Necklace: A post-common-envelope carbon dwarf inside an apparently carbon-poor planetary nebula",
      "authors": [
        "David Jones",
        "Romano L.M. Corradi",
        "Gustavo A. García Pérez",
        "Christophe Morisset",
        "Jorge García-Rojas",
        "Laurence Sabin",
        "Bruce Balick",
        "Jacob Wise",
        "Antonio Mampaso",
        "James Munday",
        "Pablo Rodríguez-Gil",
        "María del Mar Rubio-Díez",
        "Miguel Santander-García",
        "Paulina Sowicka",
        "Alexander Csukai",
        "Todd C. Hillwig",
        "Andrea Henderson de la Fuente",
        "Jacco H. Terwel"
      ],
      "abstract": "Appraising the Necklace: A post-common-envelope carbon dwarf inside an apparently carbon-poor planetary nebula David Jones, Romano L.M. Corradi, Gustavo A. García Pérez, Christophe Morisset, Jorge García-Rojas, Laurence Sabin, Bruce Balick, Jacob Wise, Antonio Mampaso, James Munday, Pablo Rodríguez-Gil, María del Mar Rubio-Díez, Miguel Santander-García, Paulina Sowicka, Alexander Csukai, Todd C. Hillwig, Andrea Henderson de la Fuente, Jacco H. Terwel 12 pages, 6 figures, accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) Context: The Necklace nebula is a bipolar, post-common-envelope planetary nebula, the central star of which has been shown to have a dwarf carbon star companion. Aims: We aim to understand the origins of the Necklace and its dwarf carbon central star. Methods: We study the carbon abundance of the nebula through far ultraviolet spectroscopy obtained with the Hubble Space Telescope. Furthermore, through simultaneous modelling of multiband light and velocity curves, we attempt to constrain the parameters of the central star system. Results: Puzzlingly, we find that the region of the inner nebula observed with the Hubble Space Telescope is seemingly not carbon-rich, at odds with the dwarf carbon star nature of the companion of the central star. The initial mass of the nebular progenitor was likely very close to the limit to become carbon-rich, perhaps experiencing a very late thermal pulse. The dwarf carbon star companion is found to be significantly inflated with respect to that expected for an isolated main sequence star of the same mass. Conclusions: The properties of the central binary are consistent with the progenitor having become carbon-rich and its companion having accreted a significant amount of that carbon-enriched material. However, it is unclear how this evolutionary hypothesis can be reconciled with the inner nebula potentially being carbon poor.",
      "pdf_url": "https://arxiv.org/pdf/2601.19382.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19687",
      "title": "Signatures of Large-Scale Magnetic Field Disturbances and Switchbacks in Interplanetary Type III Radio Bursts",
      "authors": [
        "Daniel L. Clarkson",
        "Eduard P. Kontar"
      ],
      "abstract": "Signatures of Large-Scale Magnetic Field Disturbances and Switchbacks in Interplanetary Type III Radio Bursts Daniel L. Clarkson, Eduard P. Kontar Accepted for publication in The Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR) Type III solar radio bursts are driven by non-thermal electron beams travelling along heliospheric magnetic fields, with the radio emission frequency drift-rate determined by the beam speed and the plasma density profile. Analysing beam kinematics inferred from the drift-rate reveals behaviour inconsistent with the emitter moving radially through smooth, monotonically decreasing density. We examine whether these features are driven by disturbances in the guiding magnetic field direction, such as switchbacks, rather than plasma inhomogeneities along the beam path. Using simulations and remote observations of 24 interplanetary type III bursts observed by Parker Solar Probe, we relate measured drift-rate variations to local field deflections. In 50% of events, we identify disturbances above a $2\\sigma$ noise level that can be attributed to perpendicular deflections of the field between (0.7-1.7) R$_\\odot$, over scales (1.8-6.4) R$_\\odot$ at heliocentric distances (9-30) R$_\\odot$. The features correspond to either density changes of (10-30)%, or deflections of the field direction by (23-88)$^\\circ$. Further, beam transport simulations show field direction perturbations produce additional observational signatures in type III bursts: delayed emission, intensity breaks, and enhanced emission resembling stria fine structures. In addition, we identified four bursts where the observed variations are more plausibly explained by field deflections, possibly in the form of magnetic switchbacks, than by unrealistically large density changes along the field line. The results show that variations in type III burst profiles can arise from magnetic as well as density fluctuations, and demonstrate the value of type III bursts as remote probes of inner-heliospheric structure at kilometric wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2601.19687.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19782",
      "title": "Chemically peculiar stars investigated by the BRITE Mission",
      "authors": [
        "Teja Begari",
        "Klaus Bernhard",
        "Ernst Paunzen",
        "Prapti Mondal"
      ],
      "abstract": "Chemically peculiar stars investigated by the BRITE Mission Teja Begari, Klaus Bernhard, Ernst Paunzen, Prapti Mondal 13 pages, 5 figures, accepted by Monthly Notices of the Royal Astronomical Society Solar and Stellar Astrophysics (astro-ph.SR) We present a comprehensive analysis of BRITE photometry for 85 chemically peculiar stars, aimed at refining or determining their rotational periods. Utilizing a uniform Lomb-Scargle-based pipeline, we derived significant periods for 47 targets. A comparison with existing literature periods reveals generally good agreement, although several stars exhibit discrepant or previously unrecognized behavior. Notably, six targets display clear multiperiodicity, which, when combined with archival TESS data, suggests that these six candidates are likely misclassified, for example, as a magnetic CP2 or a CP4 star and instead exhibit characteristics consistent with a Be/shell star. Furthermore, eleven stars show no detectable periodic variations within the precision limits of BRITE. Our analysis demonstrates the effectiveness of long-term nanosatellite photometry, particularly when complemented by TESS data, in verifying catalogue periods, identifying multiperiodic behavior, and detecting potential misclassifications among bright CP stars.",
      "pdf_url": "https://arxiv.org/pdf/2601.19782.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18866",
      "title": "Uniform Forward-Modeling Analysis of Ultracool Dwarfs. IV. Benchmarking the Sonora Diamondback and Saumon & Marley (2008) Atmospheric Models Across Late-M, L, and T types with Low-Resolution 0.8-2.5 $μ$m Spectroscopy",
      "authors": [
        "Emily Mader",
        "Zhoujian Zhang",
        "Jonathan J. Fortney",
        "Caroline V. Morley",
        "Malik Bossett",
        "Mark S. Marley",
        "Sagnick Mukherjee",
        "Brendan P. Bowler",
        "Michael C. Liu"
      ],
      "abstract": "Uniform Forward-Modeling Analysis of Ultracool Dwarfs. IV. Benchmarking the Sonora Diamondback and Saumon & Marley (2008) Atmospheric Models Across Late-M, L, and T types with Low-Resolution 0.8-2.5 $μ$m Spectroscopy Emily Mader, Zhoujian Zhang, Jonathan J. Fortney, Caroline V. Morley, Malik Bossett, Mark S. Marley, Sagnick Mukherjee, Brendan P. Bowler, Michael C. Liu AJ, in press. A CSV table and figures summarizing the full analysis results for the benchmark targets are available at this https URL Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) (Abridged) We present a systematic assessment of two major cloudy atmospheric model grids -- SM08 (Saumon & Marley 2008) and Sonora Diamondback -- when applied to low-resolution near-infrared (0.8-2.5 $\\mu$m) spectroscopy. Our analysis focuses on a uniform sample of 142 age-benchmark brown dwarfs and planetary-mass objects spanning late-M, L, and T spectral types, with independently determined ages from 10 Myr to 10 Gyr. We perform forward-model spectral fitting for all benchmarks' IRTF/SpeX spectra ($R\\sim$80-250) using both SM08 and Sonora Diamondback atmospheric models to infer effective temperatures, surface gravities, metallicities, radii, and cloud sedimentation efficiencies. The two model grids yield broadly consistent results. Among L4-L9 dwarfs, we identify a statistically significant, population-level age dependence of the cloud parameter $f_{\\rm sed}$, with young benchmarks ($<300$ Myr) exhibiting systematically lower $f_{\\rm sed}$ values than older counterparts. This trend is absent across L0-T5 and T0-T5, demonstrating that cloud properties vary with age and surface gravity and offering explanations for the observed gravity-dependent photometric properties at the late-L end of the L/T transition. By comparing spectroscopically inferred parameters with predictions from evolution models, we quantify systematic errors in the fitted atmospheric parameters and establish empirical calibrations to anchor future studies using these atmospheric models. Stacked residuals of the sample reveal wavelength-dependent data-model mismatches associated with key atomic and molecular absorption bands, highlighting the need for improved opacities and rainout chemistry. Finally, we show that including an interstellar-medium-like extinction term significantly improves the spectral fits, confirming and broadening previous findings and suggesting missing opacity sources in current cloudy models.",
      "pdf_url": "https://arxiv.org/pdf/2601.18866.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19188",
      "title": "Development of Electroformed X-ray Optics Bridging Synchrotron Technology and Space Astronomy",
      "authors": [
        "Ryuto Fujii",
        "Koki Sakuta",
        "Kazuki Ampuku",
        "Yusuke Yoshida",
        "Makoto Yoshihara",
        "Ayumu Takigawa",
        "Keitoku Yoshihira",
        "Tetsuo Kano",
        "Naoki Ishida",
        "Noriyuki Narukage",
        "Keisuke Tamura",
        "Kikuko Miyata",
        "Gota Yamaguchi",
        "Hidekazu Takano",
        "Yoshiki Kohmura",
        "Shutaro Mohri",
        "Takehiro Kume",
        "Yusuke Matsuzawa",
        "Yoichi Imamura",
        "Takahiro Saito",
        "Kentaro Hiraguri",
        "Hirokazu Hashizume",
        "Hidekazu Mimura",
        "Ikuyuki Mitsuishi"
      ],
      "abstract": "Development of Electroformed X-ray Optics Bridging Synchrotron Technology and Space Astronomy Ryuto Fujii, Koki Sakuta, Kazuki Ampuku, Yusuke Yoshida, Makoto Yoshihara, Ayumu Takigawa, Keitoku Yoshihira, Tetsuo Kano, Naoki Ishida, Noriyuki Narukage, Keisuke Tamura, Kikuko Miyata, Gota Yamaguchi, Hidekazu Takano, Yoshiki Kohmura, Shutaro Mohri, Takehiro Kume, Yusuke Matsuzawa, Yoichi Imamura, Takahiro Saito, Kentaro Hiraguri, Hirokazu Hashizume, Hidekazu Mimura, Ikuyuki Mitsuishi 13 paegs, 9 figures, accepted for publication in Publications of the Astronomical Society of the Pacific (PASP) Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Detectors (physics.ins-det); Optics (physics.optics); Space Physics (physics.space-ph) We have developed X-ray telescope mirrors using an original electroforming replication technique established through the fabrication of millimeter-aperture, ultra-short-focal-length nanofocusing mirrors for synchrotron X-ray microscopy. This paper presents detailed results of X-ray illumination tests of a 60-mm-diameter, full-circumference, double-reflection monolithic electroformed nickel mirror and its Mirror Module Assembly (MMA). The experiments were conducted at the 1-km beamline BL29XUL at SPring-8. To simulate a parallel X-ray beam from celestial sources, we constructed a dedicated evaluation system, the High-Brilliance X-ray Kilometer-long Large-Area Expanded-beam Evaluation System (HBX-KLAEES). Owing to the high photon flux and the quasi-point-like source with a small divergence provided by HBX-KLAEES, the imaging performance was evaluated with high fidelity, resolving both the sharp core and large-angle components of the Point Spread Function (PSF). The results show an extremely sharp core with a Full Width at Half Maximum (FWHM) of 0.7 arcsec and a Half Power Diameter (HPD) of 14 arcsec, even after integration into the MMA. In addition, a positive correlation was found between angular resolution and axial figure error in both the primary and secondary mirror sections, indicating that axial figure errors contribute to image degradation. Based on these results, the MMA was selected as one of the hard X-ray optics for the FOXSI-4 sounding rocket experiment, which performs high-resolution soft and hard X-ray imaging spectroscopy of solar flares and was successfully launched. These results demonstrate the potential for further improvements in angular resolution and the development of high-resolution, ultra-short focal length X-ray optics for small satellites, including CubeSats.",
      "pdf_url": "https://arxiv.org/pdf/2601.19188.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19289",
      "title": "Continued activity of the 25th cycle: largest in 20 years. Ground-level enhancement and Forbush decrease",
      "authors": [
        "B.Sargsyan",
        "A.Chilingarian"
      ],
      "abstract": "Continued activity of the 25th cycle: largest in 20 years. Ground-level enhancement and Forbush decrease B.Sargsyan, A.Chilingarian Atmospheric and Oceanic Physics (physics.ao-ph); Solar and Stellar Astrophysics (astro-ph.SR) After a very calm 24th solar activity cycle, the 25th cycle has already seen several interesting events. A Ground Level Enhancement GLE77 was observed on 11 November 2025 following an X5.1 class solar flare. A strong Forbush decrease occurred on 19 and 20 January 2026 during one of the most intense geomagnetic storms of Solar Cycle 25. Events were recorded coherently by the global neutron monitor network and by SEVAN detectors at multiple altitudes. Using spectrometric capabilities, we reconstruct energy spectra of missing neutrons and muons during the FD and compare them with corresponding spectra measured during GLE77. The analysis demonstrates that FD and GLE signatures are intrinsically asymmetric. FDs selectively suppress the preexisting galactic cosmic ray population, whereas GLEs introduce an additional, harder particle component. Neutron and muon channels exhibit markedly different spectral behavior, particularly at higher deposited energies, reflecting their sensitivity to different primary energy ranges. These results show that combined NM and SEVAN observations provide robust, complementary diagnostics of rigidity dependent cosmic ray modulation during extreme heliospheric disturbances.",
      "pdf_url": "https://arxiv.org/pdf/2601.19289.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19531",
      "title": "Predicted incidence of Jupiter-like planets around white dwarfs",
      "authors": [
        "Alex Mauch-Soriano",
        "Matthias R. Schreiber",
        "Diego Correa",
        "Julio Pinilla",
        "Catalina Riveros-Jara",
        "Javiera Vivanco",
        "Maria Paula Ronco",
        "Diogo Belloni",
        "Felipe Lagos-Vilches",
        "Wolfgang Brandner"
      ],
      "abstract": "Predicted incidence of Jupiter-like planets around white dwarfs Alex Mauch-Soriano, Matthias R. Schreiber, Diego Correa, Julio Pinilla, Catalina Riveros-Jara, Javiera Vivanco, Maria Paula Ronco, Diogo Belloni, Felipe Lagos-Vilches, Wolfgang Brandner Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Only a handful of gas giant planets orbiting white dwarfs are known. It remains unclear whether this paucity reflects observational challenges or the consequences of stellar evolution. We aim to carry out population synthesis of substellar objects around white dwarfs to predict the fraction and properties of white dwarfs hosting substellar companions. We generated a representative population of white-dwarf progenitors with substellar companion and used the stellar-evolution codes MESA and SSE with standard prescriptions for mass loss and stellar tides to predict the resulting population of white dwarfs and their companions. We find that the predicted fraction of white dwarfs hosting substellar companions in the Milky Way is, independent of uncertainties related to initial distributions, stellar tides, or stellar mass loss during the asymptotic giant branch, below ~3%. The occurrence rate peaks at relatively low-mass (~0.53 Msun to ~0.66 Msun) white dwarfs and relatively young (~1-6 Gyr) systems, where it exceeds 3%. The semimajor axes of the surviving companions range from 3-24 au. We estimate that ~95% of the predicted companions are gas-giant planets. Owing to the strong dependence of companion occurrence on the metallicity of the white dwarf progenitor, the assumed age-metallicity relation strongly affects the predictions. Based on recent estimates of the local age-metallicity relation, we estimate that the fraction of white dwarfs with companions close to the Sun might reach ~8%. If the planetary and brown dwarf companion distributions derived from intermediate-mass giant stars through radial velocity surveys reflect the characteristics of the true population, less than 3% of white dwarfs host substellar companions. This most likely represents an upper limit on possible detections because a significant number of companions might not be detectable with current facilities.",
      "pdf_url": "https://arxiv.org/pdf/2601.19531.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2407.18188",
      "title": "Evolution of reconnection flux during eruption of magnetic flux ropes",
      "authors": [
        "Samriddhi Sankar Maity",
        "Piyali Chatterjee",
        "Ranadeep Sarkar",
        "Ijas S. Mytheen"
      ],
      "abstract": "Evolution of reconnection flux during eruption of magnetic flux ropes Samriddhi Sankar Maity, Piyali Chatterjee, Ranadeep Sarkar, Ijas S. Mytheen 12 pages, 10 figures, 1 animation, Accepted in The Astrophysical Journal (ApJ) Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Coronal mass ejections (CMEs) are powerful drivers of space weather, with magnetic flux ropes (MFRs) widely regarded as their primary precursors. However, the variation in reconnection flux during the evolution of MFR during CME eruptions remains poorly understood. In this paper, we develop a realistic 3D magneto-hydrodynamic model using which we explore the temporal evolution of reconnection flux during the MFR evolution using both numerical simulations and observational data. Our initial coronal configuration features an isothermal atmosphere and a potential arcade magnetic field beneath which an MFR emerges at the lower boundary. As the MFR rises, we observe significant stretching and compression of the overlying magnetic field beneath it. Magnetic reconnection begins with the gradual formation of a current sheet, eventually culminating with the impulsive expulsion of the flux rope. We analyze the temporal evolution of reconnection fluxes during two successive MFR eruptions while continuously emerging the twisted flux rope through the lower boundary. We also conduct a similar analysis using observational data from the Helioseismic and Magnetic Imager (HMI) and the Atmospheric Imaging Assembly (AIA) for an eruptive event. Comparing our MHD simulation with observational data, we find that reconnection flux play a crucial role in determination of CME speeds. From the onset to the eruption, the reconnection flux shows a strong linear correlation with the velocity. This nearly realistic simulation of a solar eruption provides important insights into the complex dynamics of CME initiation and progression.",
      "pdf_url": "https://arxiv.org/pdf/2407.18188.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11043",
      "title": "Seeking Spectroscopic Binaries with Data-Driven Models",
      "authors": [
        "Isabel Angelo",
        "Erik Petigura",
        "Megan Bedell"
      ],
      "abstract": "Seeking Spectroscopic Binaries with Data-Driven Models Isabel Angelo, Erik Petigura, Megan Bedell Published ApJ; 19 pages, 11 figures; The Astrophysical Journal, Volume 997, Number 2 (2026); doi:https://doi.org/10.3847/1538-4357/ae2aca Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) Data-driven stellar classification has a long and important history in astronomy, dating as far back as Annie Jump Cannon's \"by eye\" classifications of stars into spectral types still used today. In recent years, data-driven spectroscopy has proven to be an effective means of deriving stellar properties for large samples of stars, sidestepping issues with computational efficiency, incomplete line lists, and radiative transfer calculations associated with physical stellar models. A logical application of these algorithms is the detection of unresolved stellar binaries, which requires accurate spectroscopic models to resolve flux contributions from a fainter secondary star in the spectrum. Here we use The Cannon to train a data-driven model on spectra from the Keck High Resolution Echelle Spectrometer. We show that our model is competitive with existing data-driven models in its ability to predict stellar properties Teff, stellar radius, [Fe/H], vsin(i), and instrumental PSF, particularly when we apply a novel wavelet-based processing step to spectra before training. We find that even with accurate estimates of star properties, our model's ability to detect unresolved binaries is limited by its approx. 3% accuracy in per-pixel flux predictions, illuminating possible limitations of data-driven model applications.",
      "pdf_url": "https://arxiv.org/pdf/2512.11043.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18841",
      "title": "Towards a Comprehensive Understanding of Planetary Systems through Population-Level, Large-Scale Surveys",
      "authors": [
        "Francisco J. Pozuelos",
        "Pedro J. Amado",
        "Jesús Aceituno",
        "Marina Centenera-Merino",
        "Stefan Cikota",
        "Javier Flores",
        "Julius Göhring",
        "Sergio León-Saval",
        "Kalaga Madhav",
        "Giuseppe Morello",
        "Abani Nayak",
        "Jose L. Ortiz",
        "David Pérez-Medialdea",
        "María Isabel Ruiz-López",
        "Miguel A. Sánchez-Carrasco",
        "Alejandro Sánchez-López"
      ],
      "abstract": "Towards a Comprehensive Understanding of Planetary Systems through Population-Level, Large-Scale Surveys Francisco J. Pozuelos, Pedro J. Amado, Jesús Aceituno, Marina Centenera-Merino, Stefan Cikota, Javier Flores, Julius Göhring, Sergio León-Saval, Kalaga Madhav, Giuseppe Morello, Abani Nayak, Jose L. Ortiz, David Pérez-Medialdea, María Isabel Ruiz-López, Miguel A. Sánchez-Carrasco, Alejandro Sánchez-López White paper submitted to the ESO Call for White Papers on Future Science Questions (2040s) Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) Over the past three decades, exoplanet research has delivered an extensive census of planets spanning a wide range of masses, sizes, and orbital configurations. Despite this progress, the physical interpretation of these populations remains severely limited, as precise constraints on planetary masses, interior structures, and atmospheres are available only for a small, highly selected subset of targets. As a result, most known exoplanets remain physically ambiguous, preventing the construction of robust population-level trends and limiting our understanding of planet formation, evolution, and habitability. In the coming decades, missions such as PLATO, Earth 2.0, and the Nancy Grace Roman Space Telescope will dramatically expand the number of exoplanets detected. However, without a corresponding capability to characterise planetary masses and atmospheres at scale, these discoveries will remain largely detection-driven. Current and planned facilities, including JWST and ELT-class instruments, excel at detailed studies of individual systems but are intrinsically unsuited for large, homogeneous surveys. This white paper identifies population-level physical characterisation as a fundamental science challenge for the 2040s and motivates the need for a new observational paradigm. We outline how photonics-enabled, modular telescope architectures can deliver the survey speed, stability, and scalability required to jointly probe planetary interiors and atmospheres across statistically meaningful samples, thereby enabling a comprehensive and physically grounded understanding of planetary systems.",
      "pdf_url": "https://arxiv.org/pdf/2601.18841.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18910",
      "title": "Uncertainties in Low-Count STIS Spectra",
      "authors": [
        "Joshua D. Lothringer",
        "Leonardo dos Santos",
        "Joleen Carlberg",
        "Sean Lockwood",
        "Jacqueline Brown"
      ],
      "abstract": "Uncertainties in Low-Count STIS Spectra Joshua D. Lothringer, Leonardo dos Santos, Joleen Carlberg, Sean Lockwood, Jacqueline Brown Instrumentation and Methods for Astrophysics (astro-ph.IM) We evaluate uncertainty calculations in the calstis pipeline for data in the low-count regime. Due to the low dark rate and read-noise free nature of MAMA detectors, observations of UV-dim sources can result in exposures with 0 or 1 counts in some pixels. In this regime, the \"root-N\" approximation widely used to calculate uncertainties breaks down, and one must compute Poisson confidence intervals for more accurate uncertainty calculations. The CalCOS pipeline was updated in 2020 to account for these low-count uncertainties. Here, we assess how STIS observations are currently affected by this phenomenon, describe a new Jupyter notebook exploring the issue, and introduce a new utility, stistools.poisson_err, to manually calculate Poisson confidence intervals for 1D STIS spectra. Additionally, we describe a related software bug in the stistools$.$inttag utility, which splits TIME-TAG data into sub-exposures. This newly fixed bug serves as a useful case-study for the proper use of Poisson confidence intervals.",
      "pdf_url": "https://arxiv.org/pdf/2601.18910.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19353",
      "title": "Gaia serial CTI modelling and radiation damage study",
      "authors": [
        "C. Pagani",
        "N. C. Hambly",
        "M. Davidson",
        "N. Rowell",
        "C. Crowley",
        "R. Collins",
        "F. van Leeuwen",
        "G. M. Seabroke",
        "A. Holland",
        "M. A. Barstow",
        "D. W. Evans"
      ],
      "abstract": "Gaia serial CTI modelling and radiation damage study C. Pagani, N. C. Hambly, M. Davidson, N. Rowell, C. Crowley, R. Collins, F. van Leeuwen, G. M. Seabroke, A. Holland, M. A. Barstow, D. W. Evans 17 pages, 16 figures, to be published in Astronomy & Astrophysics Instrumentation and Methods for Astrophysics (astro-ph.IM) During the course of its mission, ESA's Gaia spacecraft has generated a map of the stars of the Galaxy of exquisite detail. While in its L2 orbit, the satellite has been exposed to high energy cosmic rays and solar particles, that caused permanent damage to its CCDs. The main effect of radiation damage on Gaia data is the distortion of its images and spectra, caused by the CCDs charge transfer inefficiency (CTI) during the readout process, that, if not taken into account, can result in inaccurate measurements of a star's location and flux. In this work, the impact of CTI in the serial readout direction, larger than in the parallel due to the presence of CCDs manufacturing defects, has been analysed and modelled. A pixel-based, physically motivated CTI model, CtiPixel, has been developed to characterise the damage in Gaia CCDs. The model has been calibrated using dedicated serial CTI diagnostic data, taken every 3-4 months over the course of the mission. The model is shown to be a good representation of the observed signatures of CTI in the calibration datasets, and its parameters reveal significant insights into the nature of the CCD defects generated by space irradiation. The evolution of the damage in the serial direction shows a general small linear increase over time, with sudden step changes after strong solar flares and coronal mass ejections directed towards Earth. The serial CTI showed a further step increase as a consequence of the engineering CCD annealing experiment carried out after the completion of Gaia science observations.",
      "pdf_url": "https://arxiv.org/pdf/2601.19353.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19627",
      "title": "Silicon-based vacuum window for millimeter and submillimeter-wave astrophysics",
      "authors": [
        "Ryota Takaku",
        "Scott Cray",
        "Kosuke Aizawa",
        "Akira Endo",
        "Shaul Hanany",
        "Kenichi Karatsu",
        "Jürgen Koch",
        "Kuniaki Konishi",
        "Tomotake Matsumura",
        "Haruyuki Sakurai"
      ],
      "abstract": "Silicon-based vacuum window for millimeter and submillimeter-wave astrophysics Ryota Takaku, Scott Cray, Kosuke Aizawa, Akira Endo, Shaul Hanany, Kenichi Karatsu, Jürgen Koch, Kuniaki Konishi, Tomotake Matsumura, Haruyuki Sakurai Instrumentation and Methods for Astrophysics (astro-ph.IM) We designed, fabricated, and characterized the properties of a silicon-based vacuum window suitable for millimeter-wave astrophysical applications. The window, which has a diameter of 124 mm, optically active diameter of 68 mm, and thickness of about 4 mm, gives an average transmittance and reflectance of 99% and 1%, respectively, a fractional bandwidth of 67%. Absorptive loss is below the detection limit of our measurement. The anti-reflection coating is made with laser ablated sub-wavelength structures (SWS), and the measured transmittance and reflectance values agree with modeling based on the measured SWS shapes. The window has been integrated into DESHIMA v2.0, an astrophysics instrument that took year-long observations with the Atacama Submillimeter Telescope Experiment.",
      "pdf_url": "https://arxiv.org/pdf/2601.19627.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19714",
      "title": "Accelerating radio astronomy imaging with RICK: a step towards SKA-Mid and SKA-Low",
      "authors": [
        "Giovanni Lacopo",
        "Emanuele De Rubeis",
        "Claudio Gheller",
        "Giuliano Taffoni",
        "Luca Tornatore"
      ],
      "abstract": "Accelerating radio astronomy imaging with RICK: a step towards SKA-Mid and SKA-Low Giovanni Lacopo, Emanuele De Rubeis, Claudio Gheller, Giuliano Taffoni, Luca Tornatore 29 pages, 8 figures, Accepted for publication on Astronomy and Computing Journal Instrumentation and Methods for Astrophysics (astro-ph.IM); Distributed, Parallel, and Cluster Computing (cs.DC) The data volumes generated by modern radio interferometers, such as the SKA precursors, present significant computational challenges for imaging pipelines. Addressing the need for high-performance, portable, and scalable software, we present RICK 2.0 (Radio Imaging Code Kernels). This work introduces a novel implementation that leverages the HeFFTe library for distributed Fast Fourier Transforms, ensuring portability across diverse HPC architectures, including multi-core CPUs and accelerators. We validate RICK's correctness and performance against real observational data from both MeerKAT and LOFAR. Our results demonstrate that the HeFFTe-based implementation offers substantial performance advantages, particularly when running on GPUs, and scales effectively with large pixel resolutions and a high number of frequency planes. This new architecture overcomes the critical scaling limitations identified in previous work (Paper II, Paper III), where communication overheads consumed up to 96% of the runtime due to the necessity of communicating the entire grid. This new RICK version drastically reduces this communication impact, representing a scalable and efficient imaging solution ready for the SKA era.",
      "pdf_url": "https://arxiv.org/pdf/2601.19714.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.DC"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19565",
      "title": "Development of Low-Noise Two-stage dc-SQUID for TES Detector Readout",
      "authors": [
        "Nan Li",
        "Mengjie Song",
        "Sixiao Hu",
        "Wentao Wu",
        "Songqing Liu",
        "Tangchong Kuang",
        "Yudong Gu",
        "Xiangxiang Ren",
        "Xufang Li",
        "He Gao",
        "Zhengwei Li",
        "Congzhan Liu"
      ],
      "abstract": "Development of Low-Noise Two-stage dc-SQUID for TES Detector Readout Nan Li, Mengjie Song, Sixiao Hu, Wentao Wu, Songqing Liu, Tangchong Kuang, Yudong Gu, Xiangxiang Ren, Xufang Li, He Gao, Zhengwei Li, Congzhan Liu Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) Direct-current superconducting quantum interference devices (dc-SQUIDs) are one of the most sensitive magnetic detectors. These sensors are extensively used in the readout of superconducting transition edge sensors (TESs), which are used for the detection of weak signals. A cosmic microwave background (CMB) polarization telescope operating in 22-48 GHz is currently under developing. The TESs calorimeter of the telescope will be readout by a time-division multiplexer (TDM) SQUID readout system. We develop a two-stage dc-SQUID amplifier circuit, comprising an input-stage SQUID with 4 SQUID cells and a series SQUID array (SSA) with 100 SQUID cells. This configuration has been shown to achieve extremely high signal gain while effectively controlling system noise. We assess the system noise at $300$ $mK$ in an adiabatic demagnetisation refrigerator (ADR). The the measured magnetic flux noise of the two-stage SQUID circuit system is approximately $0.3$ ${\\mu}\\Phi_{0}/\\sqrt{Hz}$ at $10$ $kHz$. The current noise equivalent to the input coil of input SQUID is about $2.4$ $pA/\\sqrt{Hz}$. This result meets the low-noise readout requirements of the CMB TES and other applications with TES detectors.",
      "pdf_url": "https://arxiv.org/pdf/2601.19565.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19654",
      "title": "Mercury-Opal: the GPU-accelerated version of the n-body code for planet formation Mercury-Arxes",
      "authors": [
        "Paolo Simonetti",
        "Diego Turrini",
        "Romolo Politi",
        "Scigé J. Liu",
        "Sergio Fonte",
        "Danae Polychroni",
        "Stavro Lambrov Ivanovski"
      ],
      "abstract": "Mercury-Opal: the GPU-accelerated version of the n-body code for planet formation Mercury-Arxes Paolo Simonetti, Diego Turrini, Romolo Politi, Scigé J. Liu, Sergio Fonte, Danae Polychroni, Stavro Lambrov Ivanovski Accepted for publication in Astronomy & Astrophysics Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Large n-body simulations with fully interacting objects represent the next frontier in computational planetary formation studies. In this paper, we present Mercury-Opal, the GPU-accelerated version of the n-body planet formation code this http URL porting to GPU computing has been performed through OpenACC to ensure cross-platform support and minimize the code restructuring efforts while retaining most of the performance increase expected from GPU computing. We tested Mercury-Opal against its parent code Mercury-Arxes under conditions that put GPU computing at disadvantage and nevertheless show how the GPU-based execution provides advantages with respect to CPU-serial execution even for limited computational loads.",
      "pdf_url": "https://arxiv.org/pdf/2601.19654.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.11803",
      "title": "Habitable Worlds Observatory's Concept and Technology Maturation: Initial Feasibility and Trade Space Exploration",
      "authors": [
        "Lee D. Feinberg",
        "Breann N. Sitarski",
        "Michael W. McElwain",
        "Giada Arney",
        "Caleb Baker",
        "Matthew R. Bolcar",
        "Marie Levine",
        "Alice Liu",
        "Bertrand Mennesson",
        "Aki Roberge",
        "J. Scott Smith",
        "Feng Zhao",
        "John Ziemer"
      ],
      "abstract": "Habitable Worlds Observatory's Concept and Technology Maturation: Initial Feasibility and Trade Space Exploration Lee D. Feinberg, Breann N. Sitarski, Michael W. McElwain, Giada Arney, Caleb Baker, Matthew R. Bolcar, Marie Levine, Alice Liu, Bertrand Mennesson, Aki Roberge, J. Scott Smith, Feng Zhao, John Ziemer Instrumentation and Methods for Astrophysics (astro-ph.IM) The Habitable Worlds Observatory is the first telescope ever designed to search for life and will be a powerhouse of discovery across topics in astrophysics. The observatory was the top recommendation of the Astro2020 Decadal Survey for large missions and a new HWO Technology Maturation Project Office was formed in August 2024 to mature the architecture, science and technology. In this paper we review the overall approach taken to mature the mission concept. We show progress on architecture development, integrated modeling, science cases, and technology roadmaps consistent with pre-formulation studies. We discuss plans for instrument studies and international engagement and science engagement including a Community Science and Instrument Team. Finally, we describe the plan forward to the Mission Concept Review.",
      "pdf_url": "https://arxiv.org/pdf/2601.11803.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.18877",
      "title": "Evidence for a Peak at $\\sim$0.3 in the Eccentricity Distribution of Typical Super-Jovian Exoplanets",
      "authors": [
        "Sarah Blunt",
        "Jason Wang",
        "Ruth Murray-Clay",
        "Bruce Macintosh",
        "Ryan A. Rubenzahl",
        "B.J. Fulton"
      ],
      "abstract": "Evidence for a Peak at $\\sim$0.3 in the Eccentricity Distribution of Typical Super-Jovian Exoplanets Sarah Blunt, Jason Wang, Ruth Murray-Clay, Bruce Macintosh, Ryan A. Rubenzahl, B.J. Fulton 20 pages, 8 figures, accepted to ApJL Earth and Planetary Astrophysics (astro-ph.EP) In this study, we compute completeness-corrected occurrence rates of giant exoplanets as a function of mass, semimajor axis, and eccentricity, using the approximately uniform California Legacy Survey sample of RV-discovered planets published in Rosenthal et al. 2021. We recover the previously-detected rise in occurrence with semimajor axis for both lower- and higher-mass subsets of the population out to $\\sim$5 au. When restricting to planets with semimajor axes between 0.1 and 4.5 au (roughly speaking, the \"peak\" of giant planet occurrence), we find evidence for distinct eccentricity distributions for each of two mass sub-populations. Most strikingly, we observe a peak in the eccentricity distribution of super-Jovian planets (3-20~M$_{\\rm J}$) at 0.3, which is apparent using two different parameterizations of the eccentricity distribution model. A hierarchical histogram model reveals that $\\sim$92% of posterior samples indicate an elevated occurrence rate of super-Jupiters with modest eccentricities (0.2-0.4) compared to lower or higher eccentricities (i.e. evidence for a moderate eccentricity \"peak\"), and 99% of samples indicate super-Jupiters with modest eccentricities are more common than those with lower eccentricities (i.e. evidence that moderate eccentricities are more common than low eccentricities). We use a truncated Gaussian model fit to pinpoint the location of the super-Jupiter eccentricity peak with more precision, finding a maximum a posterior (MAP) peak location of $e=0.3$. This low but elevated characteristic eccentricity could be the result of dynamically hot histories, perhaps involving a giant impacts phase. All analysis code for this project is publicly available on Zenodo (this https URL) and GitHub (this http URL).",
      "pdf_url": "https://arxiv.org/pdf/2601.18877.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19584",
      "title": "Beyond solar metallicity: How enhanced solid content in disks re-shape low-mass planet torques",
      "authors": [
        "Zs. Regaly",
        "A. Nemeth"
      ],
      "abstract": "Beyond solar metallicity: How enhanced solid content in disks re-shape low-mass planet torques Zs. Regaly, A. Nemeth 9 pages, 7 figures, Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP); Fluid Dynamics (physics.flu-dyn) The migration of low-mass planets is tightly controlled by the torques exerted by both gas and solids in their natal disks. While canonical models assume a solar solid-to-gas mass ratio (epsilon=0.01) and neglect the back-reaction of solid component of the disk, recent work suggests that enhanced metallicity can radically alter these torques. We quantify how elevated metallicities (epsilon=0.03 and epsilon=0.1) modify the gas and solid torques, test widely used linear scaling prescriptions, and identify the regimes where solid back-reaction becomes decisive. We performed global, 2D hydrodynamic simulations that treat solid material as a pressureless fluid fully coupled to the gas through drag and include the reciprocal back-reaction force. The planet was maintained on a fixed circular orbit, thus we computed static torques. The Stokes number was varied from 0.01 to 10, three surface-density slopes (p=0.5, 1.0, and 1.5) and three accretion efficiencies (eta=0, 10, and 100%) were explored. Torques, obtained by rescaling canonical epsilon=0.01 results, were compared with direct simulations. Solid torques scale linearly with epsilon, but gas torques deviate by 50-100% and can even reverse sign for St<=1 in epsilon=0.1 disks. These are due to strong, feedback-driven, asymmetric gas perturbations in the co-orbital region, amplified by rapid planetary accretion. Solid back-reaction in high-metallicity environments can dominate the migration torque budget of low-mass planets. Simple metallicity rescalings are therefore unreliable for St<=2, implying that precise migration tracks - particularly in metal-rich disks -- require simulations that fully couple solid and gas dynamics. These results highlight metallicity as a key parameter in shaping the early orbital architecture of planetary systems.",
      "pdf_url": "https://arxiv.org/pdf/2601.19584.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19770",
      "title": "Polarimetry and albedo of the Near-Earth Asteroid 2025 FA22",
      "authors": [
        "J.-P. Rivet",
        "S. Bagnulo",
        "P. Bendjoya",
        "G. Borisov",
        "A. Cellino",
        "M. Devogèle",
        "Z. Gray",
        "S. Ieva",
        "L. Kolokolova",
        "Y. G. Kwon",
        "A. Berdyugin",
        "S. V. Berdyugina",
        "L. Boulanger",
        "P. Fatka",
        "E. Frank",
        "M. Lazzarin",
        "V. Piirola",
        "P. Pravec",
        "the NEOPOPs team"
      ],
      "abstract": "Polarimetry and albedo of the Near-Earth Asteroid 2025 FA22 J.-P. Rivet, S. Bagnulo, P. Bendjoya, G. Borisov, A. Cellino, M. Devogèle, Z. Gray, S. Ieva, L. Kolokolova, Y. G. Kwon, A. Berdyugin, S. V. Berdyugina, L. Boulanger, P. Fatka, E. Frank, M. Lazzarin, V. Piirola, P. Pravec, the NEOPOPs team Earth and Planetary Astrophysics (astro-ph.EP) We report spectropolarimetric and broadband polarimetric observations of the near-Earth asteroid 2025 FA22 during its close approach of 18 September 2025 (about two Moon distances). The diameter of 2025 FA22 is estimated between 130 and 290 meters. It is among the largest NEAs observable at such proximity, prompting an International Asteroid Warning Network (IAWN) rapidresponse campaign. Although early orbital solutions indicated a possible impact in 2089, further follow-up astrometric observations ruled out collision hazard. The favourable geometry of this close encounter enabled a dense coverage of the positive part of the phasepolarisation curve, from the high polarisation domain (high phase angles), nearly to the inversion angle where the linear polarisation rate vanishes. The spectropolarimetric observations provided the wavelength dependence of the polarisation rate. Using empirical relationships, an estimate of the geometric albedo could be drawn from the slope of the phase-polarisation curve at inversion angle. Moreover, the spectropolarimetric trends yielded constraints on the taxonomic class. These results demonstrate the interest of polarimetry and spectropolarimetry for rapid characterisation of newly discovered NEAs in planetary defence campaigns.",
      "pdf_url": "https://arxiv.org/pdf/2601.19770.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.19870",
      "title": "A Cool Earth-sized Planet Candidate Transiting a Tenth Magnitude K-dwarf From K2",
      "authors": [
        "Alexander Venner",
        "Andrew Vanderburg",
        "Chelsea X. Huang",
        "Shishir Dholakia",
        "Hans Martin Schwengeler",
        "Steve B. Howell",
        "Robert A. Wittenmyer",
        "Martti H. Kristiansen",
        "Mark Omohundro",
        "Ivan A. Terentev"
      ],
      "abstract": "A Cool Earth-sized Planet Candidate Transiting a Tenth Magnitude K-dwarf From K2 Alexander Venner, Andrew Vanderburg, Chelsea X. Huang, Shishir Dholakia, Hans Martin Schwengeler, Steve B. Howell, Robert A. Wittenmyer, Martti H. Kristiansen, Mark Omohundro, Ivan A. Terentev 22 pages, 7 figures, 6 tables. Published in ApJL Earth and Planetary Astrophysics (astro-ph.EP) The transit method is currently one of our best means for the detection of potentially habitable \"Earth-like\" exoplanets. In principle, given sufficiently high photometric precision, cool Earth-sized exoplanets orbiting Sun-like stars could be discovered via single transit detections; however, this has not previously been achieved. In this work, we report a 10-hour long single transit event which occurred on the $V=10.1$ K-dwarf HD 137010 during K2 Campaign 15 in 2017. The transit is comparatively shallow ($225\\pm10$ ppm), but is detected at high signal-to-noise thanks to the exceptionally high photometric precision achieved for the target. Our analysis of the K2 photometry, historical and new imaging observations, and archival radial velocities and astrometry strongly indicate that the event was astrophysical, occurred on-target, and can be best explained by a transiting planet candidate, which we designate HD 137010 b. The single observed transit implies a radius of $1.06^{+0.06}_{-0.05}$ $R_\\oplus$, and assuming negligible orbital eccentricity we estimate an orbital period of $355^{+200}_{-59}$ days ($a=0.88^{+0.32}_{-0.10}$ AU), properties comparable to Earth. We project an incident flux of $0.29^{+0.11}_{-0.13}$ $I_\\oplus$, which would place HD 137010 b near the outer edge of the habitable zone. This is the first planet candidate with Earth-like radius and orbital properties that transits a Sun-like star bright enough for substantial follow-up observations.",
      "pdf_url": "https://arxiv.org/pdf/2601.19870.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.03900",
      "title": "The Effect of Massive Trans-Neptunian Objects in the Long-term Evolution and Leaking Rates of Neptune's 3:2 and 2:1 Mean Motion Resonances",
      "authors": [
        "Marco A. Muñoz-Gutiérrez",
        "Sebastián Ramírez",
        "Antonio Peimbert",
        "Angeles Pérez-Villegas",
        "Cristobal Petrovich"
      ],
      "abstract": "The Effect of Massive Trans-Neptunian Objects in the Long-term Evolution and Leaking Rates of Neptune's 3:2 and 2:1 Mean Motion Resonances Marco A. Muñoz-Gutiérrez, Sebastián Ramírez, Antonio Peimbert, Angeles Pérez-Villegas, Cristobal Petrovich Accepted for publication in AJ. 9 figures, 19 pages Earth and Planetary Astrophysics (astro-ph.EP) The current populations trapped in Neptune's main mean motion resonances in the Kuiper belt, Plutinos in the 3:2 and Twotinos in the 2:1, contain some of the best-characterized minor objects in the Solar System, given their dynamical importance. In particular, Twotinos may hide evidence of Neptune's early migration. However, these populations vary in time, declining at a rate that has not been previously clearly established. In this work, we use numerical simulations to study the long-term evolution of the Plutino and Twotino populations. We use two data sources: the most up-to-date observations and the theoretical debiased model of the Kuiper belt known as L7. In addition to studying the giant planets' effect on these populations over 4 Gyr, we analyze the additional impact produced by the ten most massive trans-Neptunian objects (TNOs) trapped in these resonances, as well as the effect of Pluto on the 2:1 population. We find that the decay rate in each resonance can be modeled as a stochastic process well described by an exponential decay with an offset determined by an underlying long-term stable population. The most massive TNOs, particularly Pluto, influence this decay rate significantly, as expected for the 3:2 resonance. Remarkably, Pluto also strongly influences the 2:1 resonance's evolution.",
      "pdf_url": "https://arxiv.org/pdf/2503.03900.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.17311",
      "title": "Early solar wind and dynamo magnetic field topology predictions for (16) Psyche and other asteroids",
      "authors": [
        "Atma Anand",
        "Jonathan Carroll-Nellenback",
        "Eric G. Blackman",
        "John A. Tarduno"
      ],
      "abstract": "Early solar wind and dynamo magnetic field topology predictions for (16) Psyche and other asteroids Atma Anand, Jonathan Carroll-Nellenback, Eric G. Blackman, John A. Tarduno 20 pages, 3 figures (excluding Supplementary Information); Under Review at JGR: Planets Earth and Planetary Astrophysics (astro-ph.EP); Geophysics (physics.geo-ph); Space Physics (physics.space-ph) Asteroid (16) Psyche is a metal-rich body that might record an ancient coherent magnetization if some relict crust or mantle is preserved. Herein, we use magnetohydrodynamic simulations to predict (16) Psyche's field topology for several distinct pathways, (i) an early solar wind-induced magnetization imparted after a larger body was impacted, forming the present-day asteroid, (ii) a core dynamo magnetization imparted in an asteroid that is either presently largely intact or was a rubble pile, and (iii) magnetization in the turbulent solar nebula disk. For pathway (i) we find the field to be predominantly dipolar and spin axis-aligned. For pathway (ii) we find the field to be either dipolar and spin axis-misaligned, or highly multipolar. We also find that (iii) a field produced earlier before the solar nebula cleared, would be highly multipolar. In cases (i) and (ii) we also place constraints on the field strength. Simple detection of a magnetic field without constraining its topology and temporal variability would be insufficient to confirm a remanent source, due to the influence of the present-day solar wind, electromagnetic induction, and (16) Psyche's high obliquity. For sufficiently strong fields however, the field topology and orientation may reveal key observable consequences of the nature and history of (16) Psyche. Our framework is also broadly applicable to the study of magnetic fields from other asteroids.",
      "pdf_url": "https://arxiv.org/pdf/2503.17311.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08309",
      "title": "The MATISSE view of the inner region of the RY Tau protoplanetary disk",
      "authors": [
        "J. S. Martin",
        "J. Kobus",
        "J. Varga",
        "A. Matter",
        "S. Wolf",
        "M. Abello",
        "F. Allouche",
        "J.-C. Augereau",
        "P. Berio",
        "F. Bettonvil",
        "R. van Boekel",
        "P. A. Boley",
        "P. Cruzalèbes",
        "W. C. Danchi",
        "J. Drevon",
        "C. Dominik",
        "V. Fleury",
        "V. Gámez Rosas",
        "A. Glindemann",
        "L. N. A. van Haastere",
        "M. Heininger",
        "Th. Henning",
        "K.-H. Hofmann",
        "M. Hogerheijde",
        "M. Houllé",
        "J. W. Isbell",
        "W. Jaffe",
        "L. Labadie",
        "S. Lagarde",
        "J. H. Leftley",
        "M. Lehmitz",
        "M. Letessier",
        "B. Lopez",
        "F. Lykou",
        "J. Ma",
        "A. Meilland",
        "F. Millour",
        "C. Paladini",
        "E. Pantin",
        "R. G. Petrov",
        "P. Priolet",
        "S. Robbe-Dubois",
        "D. Schertl",
        "M. Scheuck",
        "J. Scigliuto",
        "G. Weigelt",
        "J. Woillez"
      ],
      "abstract": "The MATISSE view of the inner region of the RY Tau protoplanetary disk J. S. Martin, J. Kobus, J. Varga, A. Matter, S. Wolf, M. Abello, F. Allouche, J.-C. Augereau, P. Berio, F. Bettonvil, R. van Boekel, P. A. Boley, P. Cruzalèbes, W. C. Danchi, J. Drevon, C. Dominik, V. Fleury, V. Gámez Rosas, A. Glindemann, L. N. A. van Haastere, M. Heininger, Th. Henning, K.-H. Hofmann, M. Hogerheijde, M. Houllé, J. W. Isbell, W. Jaffe, L. Labadie, S. Lagarde, J. H. Leftley, M. Lehmitz, M. Letessier, B. Lopez, F. Lykou, J. Ma, A. Meilland, F. Millour, C. Paladini, E. Pantin, R. G. Petrov, P. Priolet, S. Robbe-Dubois, D. Schertl, M. Scheuck, J. Scigliuto, G. Weigelt, J. Woillez (the MATISSE Collaboration) Earth and Planetary Astrophysics (astro-ph.EP) The T-Tauri type young stellar object RY Tau exhibits a dust depleted inner cavity characteristic of a transition disk. We constrain the spatial distribution and mineralogy of dust in the RY Tau protoplanetary disk in the inner few astronomical units using spectrally resolved interferometric observations in the L, M, and N bands obtained with VLTI/MATISSE. Employing a 2D temperature gradient model we estimate the orientation of the inner disk finding no evidence of significant misalignment between the inner and outer disk of RY Tau. Successively, we analyze the chemical composition of silicates depending on spatial region in the disk and identify several silicate species commonly found in protoplanetary disks. Additionally, a depletion of amorphous dust grains toward the central protostar is observed. Monte Carlo radiative transfer simulations show that hot dust close to the protostar and in the line of sight to the observer, either in the uppermost disk layers of a strongly flared disk or in a dusty envelope, is necessary to model the observations. The shadow cast by a dense innermost disk midplane on the dust further out explains the observed closure phases in the L band and to some extent in the M band. However, the closure phases in the N band are underestimated by our model, hinting at an additional asymmetry in the flux density distribution not visible at shorter wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2511.08309.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09481",
      "title": "Adsorption of volatiles on dust grains in protoplanetary disks",
      "authors": [
        "Lile Wang",
        "Feng Long",
        "Haifeng Yang",
        "Ruobing Dong",
        "Shenzhen Xu"
      ],
      "abstract": "Adsorption of volatiles on dust grains in protoplanetary disks Lile Wang, Feng Long, Haifeng Yang, Ruobing Dong, Shenzhen Xu 16 pages, 5 figures, submitted to ApJ Earth and Planetary Astrophysics (astro-ph.EP) The adsorption of volatile molecules onto dust grain surfaces fundamentally influences dust-related processes, including condensation of gas-phase molecules, dust coagulation, and planet formation in protoplanetary disks. Using advanced ab-initio density functional theory with r$^2$SCAN+rVV10 van der Waals functionals, we calculate adsorption energies of H$_2$, H$_2$O, and CO on carbonaceous (graphene, amorphous carbon) and silicate (MgSiO$_3$) surfaces. Results reveal fundamentally different adsorption mechanisms: weak physisorption on carbonaceous surfaces ($|\\Delta\\epsilon_{\\rm ad}|\\sim 0.1-0.2~{\\rm eV}$) versus strong chemisorption on silicates ($|\\Delta\\epsilon_{\\rm ad}|\\sim 0.5-1.5~{\\rm eV}$) via coordination bonds. Kinetic Monte Carlo simulations incorporating these energies demonstrate divergent surface evolution: carbonaceous grains exhibit distinct condensation radius compared to silicates, while the cocrystal of H$_2$O and CO significantly increases the desorption temperature of CO. The actual radii of gas-phase molecule depletion could thus be a comprehensive result of temperatures, chemical compositions, and even evolution tracks. Meanwhile, silicates maintain chemisorbed molecular coatings throughout most disk regions. Such dichotomy in surface coverage could also provide a natural mechanism for carbon depletion in inner planetary systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.09481.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}