{
  "date": "2026-02-13",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.GA",
    "astro-ph.IM",
    "astro-ph.HE",
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.CO"
  ],
  "total_papers": 106,
  "gw_related_papers": 9,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.10178",
      "title": "Statistical isotropy of the universe and the look-elsewhere effect",
      "authors": [
        "Alan H. Guth",
        "Mohammad Hossein Namjoo"
      ],
      "abstract": "Statistical isotropy of the universe and the look-elsewhere effect Alan H. Guth, Mohammad Hossein Namjoo Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Recently, Jones et al. [arXiv:2310.12859] claimed strong evidence for the statistical anisotropy of the universe. The claim is based on a joint analysis of four different anomaly tests of the cosmic microwave background data, each of which is known to be anomalous, with a lower level of significance. They reported a combined $p$-value of about $3\\times 10^{-8}$, which is more than a $5\\sigma$ level of significance. We observe that statistical anisotropy is not even relevant for two of the four considered tests, which seems sufficient to invalidate the authors' claim. Furthermore, even if one reinterprets the claim as evidence against $\\Lambda$CDM rather than statistical anisotropy, we argue that this result significantly suffers from the look-elsewhere effect. Assuming a set of independent (i.e., uncorrelated) tests, we show that if the four tests with the smallest $p$-values are cherry-picked from 10 independent tests, the $p$-value reported by Jones et al. corresponds to only $3\\sigma$ significance. If there are 27 independent tests, the significance falls to $2\\sigma$. These numbers, however, overstate our argument, since the four tests used by Jones et al. are slightly correlated. Determining the correlation of Jones et al.'s tests by comparing their joint $p$-value with the product of the four separate $p$-values, we find that about 16 or 50 tests are sufficient to reduce the significance of Jones et al.'s results to 3$\\sigma$ or 2$\\sigma$ significance, respectively. We also provide a list of anomaly tests discussed in the literature (and propose a few generalizations), suggesting that very plausibly 16 (or even 50) independent tests have been published, and possibly many more have been considered but not published. We conclude that the current data is consistent with the $\\Lambda$CDM model and, in particular, with statistical isotropy.",
      "pdf_url": "https://arxiv.org/pdf/2602.10178.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ex",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10928",
      "title": "An Enhanced Formation Channel for Galactic Dual-Line Gravitational-Wave Sources: von Zeipel-Lidov-Kozai effect in Triples Involving Sgr A*",
      "authors": [
        "Wen-Fan Feng",
        "Tan Liu",
        "Yun Fang",
        "Yacheng Kang",
        "Bin Liu",
        "Lijing Shao"
      ],
      "abstract": "An Enhanced Formation Channel for Galactic Dual-Line Gravitational-Wave Sources: von Zeipel-Lidov-Kozai effect in Triples Involving Sgr A* Wen-Fan Feng, Tan Liu, Yun Fang, Yacheng Kang, Bin Liu, Lijing Shao High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) The dense Galactic Center environment is expected to host compact binary inspirals detectable by future space-borne gravitational wave (GW) observatories (e.g., LISA, TianQin, Taiji) in the millihertz band. Aided by information from these facilities, next-generation ground-based GW detectors (e.g., Cosmic Explorer, Einstein Telescope) can potentially capture gravitational radiation in the hectohertz band from rapidly spinning neutron star (NS) components in such binaries. These Galactic Center systems are thus anticipated to act as dual-line (i.e., low-frequency inspiral and high-frequency spin) GW sources. However, the formation channels of these systems remain largely unexplored. In this \\textit{Letter}, we propose that the von Zeipel-Lidov-Kozai (ZLK) effect can enhance the formation of dual-line GW sources in hierarchical triples involving the Galactic supermassive black hole, Sgr A*. We show that ZLK-driven oscillations in the eccentricity and inclination of the inner binary can modulate the GW emission from both the binary inspiral and the individual NS spins. This effect boosts the expected dual-line source count by a factor of $\\sim 3$, from rare to $\\mathcal{O}(1)$ in 4 years, making dual-line observations substantially more probable. Our results demonstrate that the ZLK effect provides an important formation channel for Galactic dual-line GW sources.",
      "pdf_url": "https://arxiv.org/pdf/2602.10928.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2407.00162",
      "title": "Crustal lattice pressure as a source of neutron star mountains",
      "authors": [
        "D. I. Jones",
        "T. J. Hutchins"
      ],
      "abstract": "Crustal lattice pressure as a source of neutron star mountains D. I. Jones, T. J. Hutchins 10 pages, 5 figures. Updated to match version accepted by MNRAS (mainly additional discussion) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The spin frequencies of neutron stars in low-mass X-ray binaries may be limited by the emission of gravitational waves. A candidate for producing such steady emission is a mass asymmetry, or \"mountain\", sourced by temperature asymmetries in the star's crust. A number of studies have examined temperature-induced shifts in the crustal capture layers between one nuclear species and another to produce this asymmetry, with the presence of capture layers in the deep crust being needed to produce the required mass asymmetries. However, modern equation of state calculations cast doubt on the existence of such deep capture layers. Motivated by this, we investigated an alternative source of temperature dependence in the equation of state, coming from the pressure supplied by the solid crustal lattice itself. We show that temperature-induced perturbations in this pressure, while small, may be significant. We therefore advocate for more detailed calculations, self-consistently calculating both the temperature asymmetries, the perturbations in crustal lattice pressure, and the consequent mass asymmetries, to establish if this is a viable mechanism for explaining the observed distribution of low-mass X-ray binary spin frequencies. Furthermore, the crustal lattice pressure mechanism does not require accretion, extending the possibility for such thermoelastic mountains to include both accreting and isolated neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2407.00162.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.23931",
      "title": "Sagittarius A* near-infrared flares polarization as a probe of space-time I: Non-rotating exotic compact objects",
      "authors": [
        "Nicolas Aimar",
        "João Luís Rosa",
        "Hanna Liis Tamm",
        "Paulo Garcia"
      ],
      "abstract": "Sagittarius A* near-infrared flares polarization as a probe of space-time I: Non-rotating exotic compact objects Nicolas Aimar, João Luís Rosa, Hanna Liis Tamm, Paulo Garcia 16 pages, 11 figures, 10 tables; final revision for A&A; major changes High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) The center of our galaxy hosts Sagittarius~A*, a supermassive compact object of $\\sim 4.3\\times 10^6$ solar masses, usually associated with a black hole. Nevertheless, black holes possess a central singularity, considered unphysical, and an event horizon, which leads to loss of unitarity in a quantum description of the system. To address these theoretical inconsistencies, alternative models, collectively known as exotic compact objects, have been proposed. In this paper, we investigate the potential detectability of signatures associated with non-rotating exotic compact objects within the Sgr~A* polarized flares dataset, as observed through GRAVITY and future instruments. We examine a total of eight distinct metrics, originating from four different categories of static and spherically symmetric compact objects: Black Holes, Boson stars, Fluid spheres, and Gravastars. Our approach involves utilizing a toy model that orbits the compact object in the equatorial plane. Using simulated astrometric and polarimetric data with present GRAVITY and future GRAVITY+ uncertainties, we fit the datasets across all metrics examined. We evaluated the detectability of the metric for each dataset based on the resulting $\\chi^2_\\mathrm{red}$ and BIC-based Bayes factors. Plunge-through images of ECOs affect polarization and astrometry. With GRAVITY's present uncertainties, none of the metric model is discernible. GRAVITY+'s improved sensitivity allows detection of some exotic compact object models. However, enhancing the astrophysical complexity of the hot spot model diminishes these outcomes. Presently, GRAVITY's uncertainties do not allow us to detect exotic compact object metric. With GRAVITY+'s enhanced sensitivity, we can expect to uncover additional exotic compact object models and use Sgr~A* as a laboratory for fundamental physics.",
      "pdf_url": "https://arxiv.org/pdf/2506.23931.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10909",
      "title": "Massive stars as gravitationally lensed transients -- Insights on the high-mass initial mass function",
      "authors": [
        "Sung Kei Li"
      ],
      "abstract": "Massive stars as gravitationally lensed transients -- Insights on the high-mass initial mass function Sung Kei Li 5 pages, 2 figures, Accepted for publication as conference proceedings of IAUS402 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) A robust stellar initial mass function (IMF) is crucial in any studies related to star formation. However, the direct measurement of the stellar IMF is confined to the local universe, limited by the resolving power of telescopes. Recently, a new method for accessing the stellar IMF beyond the local universe has been developed. The observed detection rate of transient lensed stars -- individual, massive, thus luminous stars in strongly lensed galaxies that are temporarily detectable upon stellar microlensing -- can serve as a probe to break the IMF-star formation history degeneracy in studies utilizing spectral energy distribution fitting, hence providing a window to look at the IMF at a subsample of gravitationally lensed galaxies. In this proceeding, I summarize the contributed talk given at IAUS402 entitled the same as this contribution and highlight some key results, which currently show no evidence for a top-heavy IMF in $z \\approx 1$ galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2602.10909.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10987",
      "title": "Beyond $Λ$CDM: fundamental constants as cosmological observables",
      "authors": [
        "Dinko Milaković",
        "John K. Webb"
      ],
      "abstract": "Beyond $Λ$CDM: fundamental constants as cosmological observables Dinko Milaković, John K. Webb White Paper submitted to ESO's Expanding Horizons initiative Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recent cosmological tensions pose difficulties for $\\Lambda$CDM. Forthcoming facilities will be able to check whether these tensions result from systematic effects or indeed with the $\\Lambda$CDM model itself. However, these new data will primarily probe gravitational interactions and provide only limited information about non-gravitational interactions. Distinguishing between competing models that make similar predictions yet rely on fundamentally different principles, therefore requires suitably diverse physical tests. Observational constraints on spacetime variations of fundamental constants fill this need. The fine-structure constant, $\\alpha = e^2/\\hbar c$, can be measured using absorption systems towards bright quasars using the Many Multiplet method, and using atomic doublets from line emitting gas in galaxies. A spectroscopic facility such as the WST could produce more than 100,000 new measurements of $\\alpha$ from quasars together with a million measurements from galaxies. When combined with other probes, such a large and homogeneous dataset of $\\alpha$ measurements would provide unprecedented constraints on physics beyond $\\Lambda$CDM.",
      "pdf_url": "https://arxiv.org/pdf/2602.10987.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11093",
      "title": "New constraints on cosmic anisotropy from galaxy clusters using an improved dipole fitting method",
      "authors": [
        "Jianping Hu",
        "Chao Geng",
        "Xuandong Jia",
        "Zhaoyu Zuo",
        "Taozhi Yang",
        "Fayin Wang"
      ],
      "abstract": "New constraints on cosmic anisotropy from galaxy clusters using an improved dipole fitting method Jianping Hu, Chao Geng, Xuandong Jia, Zhaoyu Zuo, Taozhi Yang, Fayin Wang 29 pages, 12 figures, 3 tables, the abstract appearing here is slightly shorter than that in the PDF file Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) In this work, we attempted to apply the dipole fitting (DF) method to galaxy clusters to search for cosmic anisotropic signals, and to construct a statistical isotropic analysis scheme for them. Compared to Type Ia supernova (SNe Ia), the galaxy clusters offer a significant advantage in terms of spatial distribution. This advantage makes the anisotropic signals obtained from them more reliable. From 313 galaxy clusters (Chandra + XMM-Newton), we find two preferred directions (l, b) = (${257.82^{\\circ}}_{-52.88}^{+58.01}$, $-31.30{^{\\circ}}_{-39.46}^{+35.92}$) and ($80.89{^{\\circ}}_{-52.46}^{+60.97}$, $31.75{^{\\circ}}_{-40.16}^{+35.19}$). The former to a direction where the universe is expanding at a faster rate than the surrounding area, while the latter to a slower rate of expansion. The corresponding magnitude of anisotropy is $|A|$ = 5.2 $\\sim$ 5.4 $\\times$ 10$^{-4}$. The results of statistical isotropy analyses give $\\sim$1.0$\\sigma$ confidence level. From the reanalyses based on the subsamples including Chandra, XMM-Newton, low reshift (LR, $z < 0.10$), high redshift (HR, $z > 0.10$) datasets, we find that the observation equipment and sample redshift can affect the preferred direction, anisotropic magnitude, and statistical significance of anisotropy. The XMM-Newton dataset gives a statistical significance of 2.26$\\sigma$ (Mock) and 2.86$\\sigma$ (Iso) which are much higher than that from Chandra and the total datasets. The magnitude of anisotropy $|A|$ from HR dataset is larger than that from LR dataset. Overall, our results indicate the presence of anisotropic signals in galaxy clusters, which must be taken seriously. Further test is still needed to better understand these signals.",
      "pdf_url": "https://arxiv.org/pdf/2602.11093.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11100",
      "title": "Beyond thermal approximations: Precise cosmological bounds on Axion-Like Particles",
      "authors": [
        "Nicola Barbieri",
        "Luca Caloni",
        "Martina Gerbino",
        "Massimiliano Lattanzi",
        "Luca Visinelli"
      ],
      "abstract": "Beyond thermal approximations: Precise cosmological bounds on Axion-Like Particles Nicola Barbieri, Luca Caloni, Martina Gerbino, Massimiliano Lattanzi, Luca Visinelli Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We derive updated cosmological bounds on light axion-like particles (ALPs) coupled to leptons or photons, using a full phase-space treatment of their production from the primordial thermal plasma. The ALP phase-space distribution, obtained by solving the momentum-dependent Boltzmann equation for the relevant production processes, is consistently propagated into the computation of cosmological observables, allowing us to assess the impact of non-thermal spectral distortions on the effective number of relativistic species, $\\Delta N_{\\rm eff}$. Using state-of-the-art measurements of the cosmic microwave background from Planck, the Atacama Cosmology Telescope, and the South Pole Telescope, complemented with Big Bang Nucleosynthesis determinations of primordial deuterium and helium abundances, we obtain the following 95\\% credible limits on the ALP decay constant: $f_a > 1.63 \\times 10^6 \\, {\\rm GeV}$, $9.41 \\times 10^6 \\, {\\rm GeV}$ and $8.06 \\times 10^4 \\, {\\rm GeV}$ for ALPs coupled to electrons, muons and taus, respectively. For the ALP-photon coupling we find $g_{a\\gamma} < 1.98 \\times 10^{-8} \\, {\\rm GeV}^{-1}$. Including baryon acoustic oscillation data from the Dark Energy Spectroscopic Instrument mildly relaxes the constraints, in line with previous analyses of extra relativistic degrees of freedom. Finally, we present forecasts for the LiteBIRD$+$Simons Observatory and LiteBIRD$+$CMB-HD configurations, discussing the importance of an exact phase-space treatment for robust cosmological bounds on ALP interactions.",
      "pdf_url": "https://arxiv.org/pdf/2602.11100.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2203.11045",
      "title": "First measurement of the correlation between cosmic voids and the Lyman-$α$ forest",
      "authors": [
        "Corentin Ravoux",
        "Eric Armengaud",
        "Julian Bautista",
        "James Rich",
        "Jean-Marc Le Goff",
        "Nathalie Palanque-Delabrouille",
        "Michael Walther",
        "Christophe Yèche"
      ],
      "abstract": "First measurement of the correlation between cosmic voids and the Lyman-$α$ forest Corentin Ravoux, Eric Armengaud, Julian Bautista, James Rich, Jean-Marc Le Goff, Nathalie Palanque-Delabrouille, Michael Walther, Christophe Yèche Cosmology and Nongalactic Astrophysics (astro-ph.CO) We report the first detection at a median redshift $z = 2.49$ of large-scale matter flows around cosmic voids. Voids are identified within a tomographic map of large-scale Lyman-$\\alpha$ (Ly$\\alpha$) transmissions, built from the eBOSS Ly$\\alpha$ forest sample in the SDSS Stripe 82 field. We measure the imprint of flows around voids, known as redshift-space distortions (RSD), with a statistical significance of $8\\,\\sigma$. The observed quadrupole of the void-forest cross-correlation is described by a linear RSD model. The derived RSD parameter of the Ly$\\alpha$ forest around voids is $\\beta = 1.21 \\pm 0.18$. Our model accounts for the tomographic effect induced by the Ly$\\alpha$ data being located along parallel quasar lines of sight. This work presents a novel approach to observing the growth of cosmic structures at redshifts currently inaccessible to galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2203.11045.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07177",
      "title": "Ten-dimensional neural network emulator for the nonlinear matter power spectrum",
      "authors": [
        "Yanhui Yang",
        "Simeon Bird",
        "Ming-Feng Ho",
        "Mahdi Qezlou"
      ],
      "abstract": "Ten-dimensional neural network emulator for the nonlinear matter power spectrum Yanhui Yang, Simeon Bird, Ming-Feng Ho, Mahdi Qezlou 9 pages, 5 figures, 1 table. Updated to match the version published in Phys. Rev. Lett Phys. Rev. Lett. 136, 061001 (2026) Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present GokuNEmu, a ten-dimensional neural network emulator for the nonlinear matter power spectrum, designed to support next-generation cosmological analyses. Built on the Goku $N$-body simulation suite and the T2N-MusE emulation framework, GokuNEmu predicts the matter power spectrum with $\\sim 0.5 \\%$ average accuracy for redshifts $0 \\leq z \\leq 3$ and scales $0.006 \\leq k/(h\\,\\mathrm{Mpc}^{-1}) \\leq 10$. The emulator models a 10D parameter space that extends beyond $\\Lambda$CDM to include dynamical dark energy (characterized by $w_0$ and $w_a$), massive neutrinos ($\\sum m_\\nu$), the effective number of neutrinos ($N_\\text{eff}$), and running of the spectral index ($\\alpha_\\text{s}$). Its broad parameter coverage, particularly for the extensions, makes it the only matter power spectrum emulator capable of testing recent dynamical dark energy constraints from DESI. In addition, it requires only $\\sim $2 milliseconds to predict a single cosmology on a laptop, orders of magnitude faster than existing emulators. These features make GokuNEmu a uniquely powerful tool for interpreting observational data from upcoming surveys such as LSST, Euclid, the Roman Space Telescope, and CSST.",
      "pdf_url": "https://arxiv.org/pdf/2507.07177.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07184",
      "title": "Design and optimization of neural networks for multifidelity cosmological emulation",
      "authors": [
        "Yanhui Yang",
        "Simeon Bird",
        "Ming-Feng Ho",
        "Mahdi Qezlou"
      ],
      "abstract": "Design and optimization of neural networks for multifidelity cosmological emulation Yanhui Yang, Simeon Bird, Ming-Feng Ho, Mahdi Qezlou 16 pages, 13 figures, 5 tables. Updated to match the version published in Phys. Rev. D Phys. Rev. D 113, 043508 (2026) Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Accurate and efficient simulation-based emulators are essential for interpreting cosmological survey data down to nonlinear scales. Multifidelity emulation techniques reduce simulation costs by combining high- and low-fidelity data, but traditional regression methods such as Gaussian processes struggle with scalability in sample size and dimensionality. In this work, we present T2N-MusE, a neural network framework characterized by (i) a novel 2-step multifidelity architecture, (ii) a 2-stage Bayesian hyperparameter optimization, (iii) a 2-phase $k$-fold training strategy, and (iv) a per-$z$ principal component analysis strategy. We apply T2N-MusE to selected data from the Goku simulation suite, covering a 10-dimensional cosmological parameter space, and build emulators for the matter power spectrum over a range of redshifts with different configurations. We find the emulators outperform our earlier Gaussian process models significantly and demonstrate that each of these techniques is efficient in training neural networks or/and effective in improving generalization accuracy. We observe a reduction in the mean error by more than a factor of five and in the worst-case error by approximately a factor of eight in leave-one-out cross-validation, relative to previous work. This framework has been used to build the most powerful emulator for the matter power spectrum, GokuNEmu, and will also be used to construct emulators for other statistics in future.",
      "pdf_url": "https://arxiv.org/pdf/2507.07184.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23343",
      "title": "Cosmological Prediction from the joint observation of MeerKAT and CSST at $z$ = 0.4 $\\sim$ 1.2",
      "authors": [
        "Yu-Er Jiang",
        "Yan Gong",
        "Qi Xiong",
        "Wenxiang Pei",
        "Yun Liu",
        "Furen Deng",
        "Zi-yan Yuwen",
        "Meng Zhang",
        "Xingchen Zhou",
        "Xuelei Chen",
        "Yin-Zhe Ma",
        "Qi Guo",
        "Bin Yue"
      ],
      "abstract": "Cosmological Prediction from the joint observation of MeerKAT and CSST at $z$ = 0.4 $\\sim$ 1.2 Yu-Er Jiang, Yan Gong, Qi Xiong, Wenxiang Pei, Yun Liu, Furen Deng, Zi-yan Yuwen, Meng Zhang, Xingchen Zhou, Xuelei Chen, Yin-Zhe Ma, Qi Guo, Bin Yue 20 pages, 13 figures, and 1 table. Accepted for publication in ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cross-correlating neutral hydrogen (HI) 21cm intensity mapping with galaxy surveys provides an effective probe of astrophysical and cosmological information. This work presents a cross-correlation analysis between MeerKAT single-dish HI intensity mapping and Chinese Space Station Survey Telescope (CSST) spectroscopic galaxy surveys in $z=0.4\\sim1.2$, which will share a survey area of several thousand square degrees. Utilizing Jiutian-1G cosmological simulation, we simulate the observational data of MeerKAT and CSST with survey areas from $\\sim1600$ to $600$ deg$^2$ at $z=0.5$, 0.7, and 1. The effects of beam pattern, polarization leakage, and different foregrounds in the MeerKAT HI intensity mapping are considered in the simulation. After employing foreground removal with the principal component analysis (PCA) method and performing signal compensation, we derive the cross-power spectra of MeerKAT and CSST. We perform the joint constraint using the CSST galaxy auto-power spectra and MeerKAT-CSST cross-power spectra with the least-squares fitting method. The constraint results show that, in the simulated survey area, the relative accuracy can achieve $6\\%\\sim 8\\%$ for the parameter products $\\Omega_{\\rm HI}b_{\\rm HI}b_{g}r_{\\mathrm{HI},g}$ and $\\Omega_{\\rm HI}b_{\\rm HI}r_{\\mathrm{HI},g}$ at the three redshifts, which is $3\\sim4$ times smaller than the current result. These findings indicate that the full MeerKAT-CSST joint observation with thousands of square degrees overlapping survey area can be a powerful probe of large-scale structure, and has the ability to provide information of cosmic evolution of HI and galaxies in a wide redshift range.",
      "pdf_url": "https://arxiv.org/pdf/2509.23343.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.01607",
      "title": "Accurate cosmological emulator for the probability distribution function of gravitational lensing of point sources",
      "authors": [
        "Tunç Türker",
        "Valerio Marra",
        "Tiago Castro",
        "Miguel Quartin",
        "Stefano Borgani"
      ],
      "abstract": "Accurate cosmological emulator for the probability distribution function of gravitational lensing of point sources Tunç Türker, Valerio Marra, Tiago Castro, Miguel Quartin, Stefano Borgani 11 pages, 15 figures. Accepted for publication in A&A. Code is available on GitHub, see this http URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) We develop an accurate and computationally efficient emulator to model the gravitational lensing magnification probability distribution function (PDF), enabling robust cosmological inference of point sources such as supernovae and gravitational-wave observations. We construct a pipeline utilizing cosmological $N$-body simulations, creating past light cones to compute convergence and shear maps. Principal Component Analysis (PCA) is employed for dimensionality reduction, followed by an eXtreme Gradient Boosting (XGBoost) machine learning model to interpolate magnification PDFs across a broad cosmological parameter space ($\\Omega_m$, $\\sigma_8$, $w$, $h$) and redshift range ($0.2 \\le z \\le 6$). We identify the optimal number of PCA components to balance accuracy and stability. Our emulator, publicly released as ace_lensing, accurately reproduces lensing PDFs with a median Kullback-Leibler divergence of $0.007$. Validation on the test set confirmed that the model reliably reproduces the detailed shapes and statistical properties of the PDFs across the explored parameter range, showing no significant degradation for specific parameter combinations or redshifts. Future work will focus on incorporating baryonic physics through hydrodynamical simulations and expanding the training set to further enhance model accuracy and generalizability.",
      "pdf_url": "https://arxiv.org/pdf/2512.01607.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.02316",
      "title": "Supermassive black hole growth from stellar binary encounters",
      "authors": [
        "Aubrey L. Jones",
        "Benjamin C. Bromley"
      ],
      "abstract": "Supermassive black hole growth from stellar binary encounters Aubrey L. Jones, Benjamin C. Bromley Published in the Open Journal of Astrophysics (9 pages, 5 figures) Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The growth of supermassive black holes (SMBHs) remains a central problem in astrophysics, with current observations providing only limited constraints on the underlying mechanisms. One possible growth channel is stellar accretion via the Hills mechanism, wherein a SMBH tidally breaks up a passing binary star, capturing and eventually accreting a member of the binary. We adopt a framework based on kinematics to predict capture rates from parameters that include the central number density of stars, the stellar velocity dispersion, the binary fraction, and black hole mass. We then estimate the growth of SMBHs across a range of galactic environments. In a data set of 91 galaxies of various types and masses, we identify two candidates with SMBHs for which stellar accretion may be a driver of growth. Closer to home, a recent analysis of observed hypervelocity stars from the Large Magellanic Cloud (LMC) implicates binary star interactions with a massive black hole. Every hypervelocity star produced in this way leaves a bound partner that may be accreted, providing an active growth channel for the LMC's black hole.",
      "pdf_url": "https://arxiv.org/pdf/2509.02316.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02130",
      "title": "In-situ globular clusters in alternative dark matter Milky Way galaxies: a first approach to fuzzy and core-like dark matter theories",
      "authors": [
        "Pierre Boldrini",
        "Paola Di Matteo"
      ],
      "abstract": "In-situ globular clusters in alternative dark matter Milky Way galaxies: a first approach to fuzzy and core-like dark matter theories Pierre Boldrini, Paola Di Matteo 14 pages, 9 figures. Accepted by A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a first analysis of the dynamics of in-situ globular clusters (GCs) in Milky Way (MW)-like galaxies embedded in fuzzy dark matter (FDM) halos, combining cosmological assembly histories from the TNG50 simulation with dedicated orbital integrations and analytical models. GC populations are initialized with identical distributions in normalized $E$-$L_{z}$ in matched CDM and FDM halos. In a universe dominated by FDM, we identify three distinct regimes for the in-situ GC population depending on the particle mass $m_{22} \\equiv m_{\\chi}/ 10^{-22}~\\mathrm{eV}$. For $m_{22} < 7$, baryons dominate the inner potential, which remains steep and centrally concentrated, confining GC orbits to a narrow region and producing less massive, more compact systems than in CDM. For $m_{22} \\sim 7$, GC properties resemble those in CDM, with similar mass and spatial distributions. For $m_{22} > 7$, the dark matter becomes both compact and globally dominant, generating a deeper and more extended gravitational potential that supports a wider range of stable GC orbits, resulting in more massive and spatially extended GC systems. Finally, we extend our framework to make predictions for GC populations in alternative DM models, including warm dark matter and self-interacting dark matter, in both MW-like and dwarf galaxies. Our findings demonstrate that in-situ GC systems offer a sensitive and independent probe of the underlying DM physics, opening new avenues for observational constraints with upcoming Euclid.",
      "pdf_url": "https://arxiv.org/pdf/2510.02130.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09096",
      "title": "A Faint Progenitor System for the Faint Supernova 2024vjm",
      "authors": [
        "Erez A. Zimmerman , Avishay Gal-Yam , Paul J. Groot , Eran O. Ofek , Jan van Roestel , Andrea Pastorello , Stefano Valenti , Aravind P. Ravi , Ping Chen , Steve Schulze , Nadejda Blagorodnova , Maxime Wavasseur , Marco A. Gomez-Munoz , Hugo Tranin , Simon de Wet , Giorgos Leloudas , Paul M. Vreeswijk , Lindsey A. Kwok , Michaela Schwab , Saurabh W. Jha , Kate Maguire , David J. Sand , Eric Stringer , Thomas Kupfer , Tamar Faran , Joseph P. Anderson , Jennifer Andrews , Moira Andrews , Avshalom Badash , Steven Bloemen , K. Azalee Bostroem , Ting-Wan Chen , Massimo Della Valle , Georgios Dimitriadis , Yize Dong , Joseph R. Farah , James H. Gillanders , Benjamin Godson , Mariusz Gromadzki , Daichi Hiramatsu , Emily Hoang , D. Andrew Howell , Daryl Janzen , Hanindyo Kuncarayakti , Jiaxuan Li , Joseph D. Lyman , Keiichi Maeda , Mark R. Magee , Curtis McCully , Darshana Mehta , Andrew Milligan , Shane Moran , Yuan Qi Ni , David O'Neill , Jeniveve Pearson , Danielle L. A. Pieterse , Giuliano Pignata , Andrea Reguitti , Daniel E. Reichart , Nicolas Meza Retamal , Rita P. Santos , Simone Scaringi , Manisha Shrestha , Shubham Srivastav , Fiorenzo Stoppa , Bhagya Subrayan , Giorgio Valerin , Xiaofeng Wang , Kathryn Wynn , Ofer Yaron , Weicheng Zang Weizmann Institute of Science, Department of Mathematics/IMAPP, Radboud University, University of Cape Town, South African Astronomical Observatory, Institute of Science and Technology Austria, University of Amsterdam, INAF - Osservatorio Astronomico di Padova, University of California, Davis, Institute for Advanced Study in Physics, Zhejiang University, Institute for Astronomy, School of Physics, Zhejiang University, Center for Interdisciplinary Exploration and Research in Astrophysics , Institut de Ci`encies del Cosmos , University of Florida, Institut dEstudis Espacials de Catalunya , Departament de Fisica Quantica i Astrofisica , Technical University of Denmark, Radboud University, The State University of New Jersey, University of Virginia, Trinity College Dublin, Steward Observatory, University of Arizona, University of Hamburg, European Southern Observatory, Gemini Observatory, Las Cumbres Observatory, University of California, Santa Barbara, LSSTC Catalyst Fellow, National Central University, INAF - Osservatorio Astronomico di Capodimonte, Lancaster University, Center for Astrophysics | Harvard &amp; Smithsonian, University of California, Santa Barbara, University of Oxford, University of Warwick, University of Warsaw, University of Saskatchewan, Tuorla Observatory, University of Turku, Finnish Centre for Astronomy with ESO , University of Turku, Princeton University, Kyoto University, University of Leicester, University of California, Santa Barbara, University of Birmingham, Instituto de Alta Investigacion, INAF - Osservatorio Astronomico di Brera, University of North Carolina, CENTRA, Durham University, Monash University, OzGrav: The ARC Center of Excellence for Gravitational Wave Discovery, Tsinghua University, Westlake University)"
      ],
      "abstract": "A Faint Progenitor System for the Faint Supernova 2024vjm Erez A. Zimmerman (1), Avishay Gal-Yam (1), Paul J. Groot (2,3,4), Eran O. Ofek (1), Jan van Roestel (5,6), Andrea Pastorello (7), Stefano Valenti (8), Aravind P. Ravi (8), Ping Chen (9,10), Steve Schulze (1,11), Nadejda Blagorodnova (12,13,14), Maxime Wavasseur (12,15), Marco A. Gomez-Munoz (12,15), Hugo Tranin (12,14,15), Simon de Wet (16), Giorgos Leloudas (16), Paul M. Vreeswijk (17), Lindsey A. Kwok (11), Michaela Schwab (18,19), Saurabh W. Jha (18), Kate Maguire (20), David J. Sand (21), Eric Stringer (22), Thomas Kupfer (22), Tamar Faran (1), Joseph P. Anderson (23), Jennifer Andrews (24), Moira Andrews (25,26), Avshalom Badash (1), Steven Bloemen (2), K. Azalee Bostroem (21,27), Ting-Wan Chen (28), Massimo Della Valle (29), Georgios Dimitriadis (30), Yize Dong (31), Joseph R. Farah (25,32), James H. Gillanders (33), Benjamin Godson (34), Mariusz Gromadzki (35), Daichi Hiramatsu (13), Emily Hoang (8), D. Andrew Howell (25,26), Daryl Janzen (36), Hanindyo Kuncarayakti (37,38), Jiaxuan Li (39), Joseph D. Lyman (34), Keiichi Maeda (40), Mark R. Magee (34), Curtis McCully (25), Darshana Mehta (8), Andrew Milligan (30), Shane Moran (41), Yuan Qi Ni (25,42), David O'Neill (43), Jeniveve Pearson (21), Danielle L. A. Pieterse (2), Giuliano Pignata (44), Andrea Reguitti (7,45), Daniel E. Reichart (46), Nicolas Meza Retamal (8), Rita P. Santos (23,47), Simone Scaringi (48,29), Manisha Shrestha (49,50), Shubham Srivastav (33), Fiorenzo Stoppa (33), Bhagya Subrayan (21), Giorgio Valerin (7), Xiaofeng Wang (51), Kathryn Wynn (25,32), Ofer Yaron (1), Weicheng Zang (52) ((1) Weizmann Institute of Science, (2) Department of Mathematics/IMAPP, Radboud University, (3) University of Cape Town, (4) South African Astronomical Observatory, (5) Institute of Science and Technology Austria, (6) University of Amsterdam, (7) INAF - Osservatorio Astronomico di Padova, (8) University of California, Davis, (9) Institute for Advanced Study in Physics, Zhejiang University, (10) Institute for Astronomy, School of Physics, Zhejiang University, (11) Center for Interdisciplinary Exploration and Research in Astrophysics (CIERA), (12) Institut de Ci`encies del Cosmos (ICCUB), (13) University of Florida, (14) Institut dEstudis Espacials de Catalunya (IEEC), (15) Departament de Fisica Quantica i Astrofisica (FQA), (16) Technical University of Denmark, (17) Radboud University, (18) The State University of New Jersey, (19) University of Virginia, (20) Trinity College Dublin, (21) Steward Observatory, University of Arizona, (22) University of Hamburg, (23) European Southern Observatory, (24) Gemini Observatory, (25) Las Cumbres Observatory, (26) University of California, Santa Barbara, (27) LSSTC Catalyst Fellow, (28) National Central University, (29) INAF - Osservatorio Astronomico di Capodimonte, (30) Lancaster University, (31) Center for Astrophysics | Harvard &amp; Smithsonian, (32) University of California, Santa Barbara, (33) University of Oxford, (34) University of Warwick, (35) University of Warsaw, (36) University of Saskatchewan, (37) Tuorla Observatory, University of Turku, (38) Finnish Centre for Astronomy with ESO (FINCA), University of Turku, (39) Princeton University, (40) Kyoto University, (41) University of Leicester, (42) University of California, Santa Barbara, (43) University of Birmingham, (44) Instituto de Alta Investigacion, (45) INAF - Osservatorio Astronomico di Brera, (46) University of North Carolina, (47) CENTRA, (48) Durham University, (49) Monash University, (50) OzGrav: The ARC Center of Excellence for Gravitational Wave Discovery, (51) Tsinghua University, (52) Westlake University) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Type Ia Supernovae (SNe Ia) are well known for their role as standardizable cosmological candles. Their uniformity is credited to their single origin as thermonuclear explosions of White dwarf (WD) stars. Nevertheless, some SNe Ia break this regularity. Prominently, the Iax subclass are less energetic and remarkably diverse, raising questions about their progenitor systems. While no progenitor system of a normal SN Ia has ever been detected, a luminous blue star was identified in pre-explosion images of the site of the bright SN Iax SN 2012Z, suggested to be a helium giant companion star acting as a mass donor to a WD SN progenitor. This is in line with models of weak mass accretion of a WD from a binary companion, producing an explosion that does not fully disrupt the star. However, these models fail to explain the properties of the faintest Type Iax explosions, suggesting either they originate from other WD binary systems, or even from massive progenitor stars. Here, we present the faint SN Iax SN 2024vjm - possibly the faintest supernova observed to date. Using a deep pre-explosion image taken by the recently launched Euclid space mission, we show that its progenitor system must be fainter than the helium giant SN Iax progenitor candidate of SN 2012Z, as well as that of the luminous red companion or remnant of the faint SN 2008ha, and may require a subdwarf helium star as a mass donor. The deep image also provides strong arguments against a massive star origin for this faint supernova. Our observations argue that SN 2024vjm is a WD explosion, but we find that remarkably faint SNe Iax fade more slowly than bright ones, i.e., they evolve in an opposite manner from the famous Phillips relation that makes regular SNe Ia cosmological candles.",
      "pdf_url": "https://arxiv.org/pdf/2602.09096.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.10180",
      "title": "TDE 2025abcr: A Tidal Disruption Event in the Outskirts of a Massive Galaxy",
      "authors": [
        "Robert Stein",
        "Jonathan Carney",
        "Charlotte Ward",
        "Raffaella Margutti",
        "Xander J. Hall",
        "Itai Sfaradi",
        "Igor Andreoni",
        "Ryan Chornock",
        "Suvi Gezari",
        "Geoffrey Mo",
        "Yuhan Yao",
        "Eric C. Bellm",
        "Joshua S. Bloom",
        "Malte Busmann",
        "Ilaria Caiazzo",
        "S. Bradley Cenko",
        "Matthew J. Graham",
        "Steven L. Groom",
        "Daniel Gruen",
        "Erica Hammerstein",
        "Mansi M. Kasliwal",
        "Brendan O'Connor",
        "Antonella Palmese",
        "Josiah Purdum",
        "Jillian C. Rastinejad",
        "Reed Riddle",
        "Ben Rusholme",
        "Jesper Sollerman",
        "Jean J. Somalwar",
        "Sylvain Veilleux"
      ],
      "abstract": "TDE 2025abcr: A Tidal Disruption Event in the Outskirts of a Massive Galaxy Robert Stein, Jonathan Carney, Charlotte Ward, Raffaella Margutti, Xander J. Hall, Itai Sfaradi, Igor Andreoni, Ryan Chornock, Suvi Gezari, Geoffrey Mo, Yuhan Yao, Eric C. Bellm, Joshua S. Bloom, Malte Busmann, Ilaria Caiazzo, S. Bradley Cenko, Matthew J. Graham, Steven L. Groom, Daniel Gruen, Erica Hammerstein, Mansi M. Kasliwal, Brendan O'Connor, Antonella Palmese, Josiah Purdum, Jillian C. Rastinejad, Reed Riddle, Ben Rusholme, Jesper Sollerman, Jean J. Somalwar, Sylvain Veilleux submitted, 27 pages, 11 figures High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Tidal disruption events (TDEs) have traditionally been discovered in optical sky surveys through targeted searches of nuclear transients. However, it is expected that some TDEs will occur outside the galaxy nucleus, arising from wandering black holes originating in galaxy mergers. Here we present observations of TDE 2025abcr, the first optical TDE discovered in the outskirts of a host galaxy. The TDE was identified by a custom 'off-nuclear' implementation of the ML classifier $\\texttt{tdescore}$, which classifies new ZTF transients based on their lightcurves. Follow-up observations confirm that TDE 2025abcr is a TDE-H+He, occurring 9.5$\"$ (10.3 kpc projected distance) from the nucleus of a massive galaxy ($\\mathrm{M}_{\\star}$ = $10^{11.18 \\pm 0.03}\\mathrm{M}_{\\odot}$) with a central black hole mass of $10^{8.82 \\pm 0.65}\\mathrm{M}_{\\odot}$. TDE 2025abcr itself was likely disrupted by a much lighter black hole ($10^{6.09\\pm0.53}\\mathrm{M}_{\\odot}$, as estimated with peak luminosity scaling relations). The black hole was either dynamically ejected from the nucleus or lies at the center of a very faint tidally-stripped dwarf galaxy undergoing a minor merger. Late-time observations of TDE 2025abcr could confirm the origin of this apparent 'orphan' black hole. The rate of highly offset ($\\gtrsim$3 kpc) TDEs can be constrained to $<$10% of the nuclear TDE rate, but our discovery implies that many dozens of similar sources will be detected by the Vera C. Rubin each year with resolvable offsets.",
      "pdf_url": "https://arxiv.org/pdf/2602.10180.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10191",
      "title": "Machine Learning Methods for Stellar Collisions. I. Predicting Outcomes of SPH Simulations",
      "authors": [
        "Elena González Prieto",
        "James C. Lombardi Jr.",
        "Sanaea C. Rose",
        "Charles F.A. Gibson",
        "Christopher E. O'Connor",
        "Tjitske Starkenburg",
        "Fulya Kıroğlu",
        "Kyle Kremer",
        "Tristan C. Parmerlee",
        "Frederic A. Rasio"
      ],
      "abstract": "Machine Learning Methods for Stellar Collisions. I. Predicting Outcomes of SPH Simulations Elena González Prieto, James C. Lombardi Jr., Sanaea C. Rose, Charles F.A. Gibson, Christopher E. O'Connor, Tjitske Starkenburg, Fulya Kıroğlu, Kyle Kremer, Tristan C. Parmerlee, Frederic A. Rasio 21 pages and 10 figures (Appendix included). Submitted to ApJ. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Stellar collisions can occur frequently in dense cluster environments, and play a crucial role in producing exotic phenomena from blue stragglers in globular clusters to high-energy transients in galactic nuclei. Successive collisions and mergers of massive stars could also lead to the formation of massive black holes, serving as seeds for supermassive black hole in the early universe. While analytic fitting formulae exist for predicting collision outcomes, they do not generalize across different energy scales or stellar evolutionary phases. Smoothed particle hydrodynamics (SPH) simulations are often used to compute the outcomes of stellar collisions, but, even at low resolution, their computational cost makes running on-the-fly calculations during an $N$-body simulation quite challenging. Here we present a new grid of $27,720$ SPH calculations of main-sequence star collisions, spanning a wide range of masses, ages, relative velocities, and impact parameters. Using this grid, we train machine learning models to predict both collision outcomes (merger vs disruption, or flyby) and final remnant masses. We compare the performance of nearest neighbors, support vector machines, and neural networks, achieving classification balanced accuracy of $98.4\\%$, and regression relative errors as low as $0.11\\%$ and $0.15\\%$ for the final stars $1$ and $2$, respectively. We make our trained models publicly available as part of the package collAIder, enabling rapid predictions of stellar collision outcomes in $N$-body models of dense star cluster dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2602.10191.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10199",
      "title": "New Deep Radio Continuum Imaging Still Indicates a Large Reservoir of Undiscovered Millisecond Pulsars in Terzan 5",
      "authors": [
        "Ryan Urquhart",
        "Jay Strader",
        "Laura Chomiuk",
        "Scott M. Ransom",
        "Craig O. Heinke",
        "Arash Bahramian",
        "Thomas J. Maccarone"
      ],
      "abstract": "New Deep Radio Continuum Imaging Still Indicates a Large Reservoir of Undiscovered Millisecond Pulsars in Terzan 5 Ryan Urquhart, Jay Strader, Laura Chomiuk, Scott M. Ransom, Craig O. Heinke, Arash Bahramian, Thomas J. Maccarone 22 pages, 11 figures, 4 tables. Accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) We present the deepest and highest-resolution radio continuum imaging of the Galactic globular cluster Terzan 5, one of the most crowded locations in the radio sky. In these new 2$-$4 GHz Karl G. Jansky Very Large Array images, we detect 38 of the 49 confirmed pulsars, including extensive multi-frequency eclipse mapping of the luminous redback Ter5A. Nonetheless, there is still a large amount of diffuse residual flux from pulsars that are fainter than our 2.5 GHz continuum detection limit of $\\sim 11\\,\\mu$Jy. Using a range of approaches including image-based simulations, we model the fluxes of the detected pulsars together with the residual flux. We find a minimum total population of $N\\sim250$ detectable pulsars in Terzan 5 and perhaps substantially more, though the luminosity function remains very uncertain. Consideration of the $\\gamma$-ray properties of the cluster, though also not unambiguous to interpret, leads to consistent conclusions. These pulsar population estimates are larger than inferred from previous work and highlight Terzan 5 as a keystone target for next-generation radio facilities.",
      "pdf_url": "https://arxiv.org/pdf/2602.10199.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10208",
      "title": "Evidence for neutrino emission from X-ray Bright Seyfert Galaxies in the Southern Hemisphere using Enhanced Starting Track Events with IceCube",
      "authors": [
        "The IceCube Collaboration"
      ],
      "abstract": "Evidence for neutrino emission from X-ray Bright Seyfert Galaxies in the Southern Hemisphere using Enhanced Starting Track Events with IceCube The IceCube Collaboration 4 figures and 4 tables, submitted to APJ-Letters High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) IceCube recently reported the observation of TeV neutrinos from the nearby Seyfert galaxy NGC~1068, and the corresponding neutrino flux is significantly higher than the upper limit implied by observations of GeV-TeV gamma rays. This suggests that neutrinos are produced near the supermassive black hole, where the radiation density is high enough to obscure gamma rays. We use a set of muon neutrinos with interaction vertices inside the detector, which have good sensitivity to sources in the Southern sky, from IceCube data recorded between 2011 and 2021. We then search for individual and collective neutrino signals from 14 Seyfert galaxies in the Southern Sky selected from the Swift Burst Alert Telescope (BAT) AGN Spectroscopic Survey. Using the correlations between keV X-rays and TeV neutrinos predicted by disk-corona models, and assuming production characteristics similar to NGC~1068, a collective neutrino signal search reveals an excess of $6.7_{-3.2}^{+4.0}$ events, which is inconsistent with background expectations at the 3$\\sigma$ level of significance. In this paper, we present new independent evidence that Seyfert galaxies contribute to the extragalactic flux of high-energy neutrinos.",
      "pdf_url": "https://arxiv.org/pdf/2602.10208.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10213",
      "title": "On the Expected Orbitally-modulated TeV Signatures of Spider Binaries: The Effect of Intrabinary Shock Geometry",
      "authors": [
        "Christo Venter",
        "Andreas Kopp",
        "Zorawar Wadiasingh",
        "Alice K Harding",
        "M Baring"
      ],
      "abstract": "On the Expected Orbitally-modulated TeV Signatures of Spider Binaries: The Effect of Intrabinary Shock Geometry Christo Venter, Andreas Kopp, Zorawar Wadiasingh, Alice K Harding, M Baring 5 pages, 2 figures, submitted to Proc. 8th Heidelberg International Symposium on High-energy Gamma-ray Astronomy (Gamma2024) High Energy Astrophysical Phenomena (astro-ph.HE) 'Spider' binary systems - black widow and redback compact binaries differentiated by their companion's mass and nature - are an important type of pulsar system exhibiting a rich empirical phenomenology, including radio eclipses, optical light curves from a heated companion, as well as non-thermal X-ray and GeV orbital light curves and spectra. Multi-wavelength observations have now resulted in the detection of >~50 of these systems in which a millisecond pulsar heats and ablates its low-mass companion via its intense pulsar wind. Broadband observations have established the presence of relativistic leptons that have been accelerated in the pulsar magnetosphere and near the intrabinary shock, as well as a hot companion, presenting an ideal environment for the creation of orbitally-modulated inverse Compton fluxes that should be within reach of current and future Cherenkov telescopes. We have included an updated synchrotron kernel, different parametric injection spectral shapes, and several intrabinary shock geometries in our emission code to improve our predictions of the expected TeV signatures from spider binaries. Our updated phase-dependent spectral and energy-dependent light curve outputs may aid in constraining particle energetics, wind properties, shock geometry, and system inclination of several spider binaries.",
      "pdf_url": "https://arxiv.org/pdf/2602.10213.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10328",
      "title": "Constraining the Evolution of the HI Spin Temperature with Fast Radio Bursts",
      "authors": [
        "Hugh Roxburgh",
        "Marcin Glowacki",
        "Apurba Bera",
        "Clancy James"
      ],
      "abstract": "Constraining the Evolution of the HI Spin Temperature with Fast Radio Bursts Hugh Roxburgh, Marcin Glowacki, Apurba Bera, Clancy James 9 pages, 4 figs, submitted to PASA High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Fast radio bursts (FRBs) emit broad band radio wave radiation that may, in rare cases, encode atomic hydrogen (HI) absorption signals produced as they traverse the interstellar medium of their host galaxies. Combining such signals with high resolution HI emission maps offers a unique opportunity to probe the dynamics of neutral gas at cosmological distances through constraints of the HI excitation temperature $T_{spin}$, which characterises the balance of neutral gas phases and the underlying thermal processes within these galactic environments. While no absorption signal has been recorded in an FRB to date, we demonstrate a proof of concept with the bright (F = 35 Jy ms) and narrow (0.2 ms) FRB 20211127I detected by ASKAP. We find a 3${\\sigma}$ upper limit on the integrated optical depth in the pulse-averaged spectrum of 33 km s$^{-1}$, and, based on the HI emission observed in a 3 hr MeerKAT L-band observation, subsequently find a lower limit on $T_{spin}$ of 26 K. While this test case provides little constraining power, we find that narrow, non-repeating FRBs with fluences greater than 20/70/150 Jy ms observed with all dishes with the current MeerKAT/ASKAP/DSA telescopes can probe integrated optical depths below 5 km s$^{-1}$. Furthermore, we highlight that utilising FAST's incredible sensitivity to stack thousands of bursts from hyperactive repeaters also provides a plausible avenue through which HI absorption, and hence $T_{spin}$, can be measured. Finally, we discuss how HI absorption can address several modern challenges in FRB science, providing a physical anchor for locating bursts within their host galaxies and helping to disentangle the host contribution to dispersion and scattering.",
      "pdf_url": "https://arxiv.org/pdf/2602.10328.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10511",
      "title": "A 682-second X-ray Periodicity in CH Cygni: Evidence for a Magnetic White Dwarf",
      "authors": [
        "Manuel Pichardo Marcano",
        "Thomas J. Maccarone",
        "Liliana E. Rivera Sandoval"
      ],
      "abstract": "A 682-second X-ray Periodicity in CH Cygni: Evidence for a Magnetic White Dwarf Manuel Pichardo Marcano, Thomas J. Maccarone, Liliana E. Rivera Sandoval Accepted for publication in MNRAS. 6 pages, 4 figures, 1 table High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Symbiotic stars are interacting binaries consisting of a red giant and typically a white dwarf, important as potential Type Ia supernova progenitors. Despite theoretical predictions that white dwarfs in symbiotic systems should often be magnetic, direct evidence has been elusive. We report the discovery of a $682.5 \\pm 7$ s periodicity in the XMM-Newton X-ray light curve that we interpret as the spin period of the WD in CH Cygni. This detection provides strong evidence for a magnetic white dwarf in CH Cygni, making it only the second WD symbiotic star with confirmed X-ray pulsations after R Aquarii. Our discovery supports the magnetic propeller model previously proposed for CH Cygni's jet activity and state transitions.",
      "pdf_url": "https://arxiv.org/pdf/2602.10511.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10572",
      "title": "First Detection of $γ$-Ray Emission from the Compact Symmetric Object JVAS J1311+1658",
      "authors": [
        "Xiong Jiang",
        "Yang-Ji Li",
        "Hai Lei",
        "Da-Ming Wei"
      ],
      "abstract": "First Detection of $γ$-Ray Emission from the Compact Symmetric Object JVAS J1311+1658 Xiong Jiang, Yang-Ji Li, Hai Lei, Da-Ming Wei High Energy Astrophysical Phenomena (astro-ph.HE) We report the first detection of $\\gamma$-ray emission from the young radio galaxy JVAS~J1311+1658, classified as a compact symmetric object (CSO). This detection is characterized by a recent GeV $\\gamma$-ray flare identified in Fermi-LAT data during MJD~60032.6--60132.6, with a $\\gamma$-ray source detected at a significance level of $\\sim6.2\\sigma$. The average 0.1--300~GeV flux is measured to be $(1.6 \\pm 0.6)\\times10^{-8}\\,\\mathrm{ph\\,cm^{-2}\\,s^{-1}}$, with a photon spectral index of $\\Gamma = 2.15 \\pm 0.185$. We find that a radiative model of the radio lobes significantly underestimates the observed $\\gamma$-ray emission. The strong flux and short-term variability over $\\sim$100 days suggest that the emission likely originates from newly launched sub-kiloparsec-scale jets at the core. This detection provides a unique window into the extreme environments and early-stage jet activity of young radio galaxies, offering insights into their initial evolution and the formation of relativistic jets in the earliest phases of galaxy growth.",
      "pdf_url": "https://arxiv.org/pdf/2602.10572.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10653",
      "title": "Linking {\\it Fermi} blazars and radio galaxies through accretion and jet radiation mechanisms",
      "authors": [
        "Xu-Hong Ye",
        "Ranieri D. Baldi",
        "Wen-Xin Yang",
        "Jing-Tian Zhu",
        "Denis Bastieri",
        "Rumen S. Bachev",
        "Anton A. Strigachev",
        "Jun-Hui Fan"
      ],
      "abstract": "Linking {\\it Fermi} blazars and radio galaxies through accretion and jet radiation mechanisms Xu-Hong Ye, Ranieri D. Baldi, Wen-Xin Yang, Jing-Tian Zhu, Denis Bastieri, Rumen S. Bachev, Anton A. Strigachev, Jun-Hui Fan 11 pages, 7 figures, 4 tables, accepted by A&A High Energy Astrophysical Phenomena (astro-ph.HE) Based on the classical unification, blazars, namely BL Lacertae objects (BL Lacs) and flat-spectrum radio quasars (FSRQs), are believed to correspond with radio galaxies when observed at small jet viewing angles. In this paper, we aim to compile a sample of Fermi blazars and radio galaxies to provide new insights towards a unified accretion and ejection scenario between aligned and misaligned radio-loud active galactic nuclei (AGNs), by considering their optical emission-line classifications (low- and high-excitation radio galaxies, LERGs, HERGs), which are more representative of their accretion states. We adopted statistical analyses of accretion properties and high-energy beaming patterns for both Fermi blazars and radio galaxies to investigate a unified accretion-ejection scenario. In the gamma-ray luminosity-photon index plane, HERGs populate the region of higher luminosities and softer photon indices, akin to FSRQs, whereas LERGs fill lower luminosities with harder photon indices, analogous to BL Lacs. This parallel segregation indicates that LERGs and HERGs represent the misaligned counterparts of BL Lacs and FSRQs, respectively. The unified picture is further supported by the Compton dominance-photon index diagram, where FSRQs and HERGs dominated by external Compton (EC) emissions are distinctly separated from BL Lacs and LERGs governed by synchrotron self-Compton (SSC) emissions. Similarly, the diagram of accretion rate versus gamma-ray photon index reveals two distinct accretion-ejection states: a low-accretion-rate branch (BL Lacs and LERGs) is associated with the SSC model, and a high-accretion-rate branch (FSRQs and HERGs) is linked to the EC model. These results strongly strengthen the idea of a unified accretion and ejection paradigm between blazars and radio galaxies into two distinct states.",
      "pdf_url": "https://arxiv.org/pdf/2602.10653.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10664",
      "title": "Distance Estimation and Sky Localization of Eccentric Double White Dwarf Binaries from Gravitational Wave Observations inside Globular Clusters",
      "authors": [
        "Yuetong Zhao",
        "L. Hellström",
        "Siqi Zhang",
        "M. Giersz",
        "A. Askar",
        "Youjun Lu",
        "Zhoujian Cao",
        "D. Belloni",
        "G. Wiktorowicz",
        "M. Górski"
      ],
      "abstract": "Distance Estimation and Sky Localization of Eccentric Double White Dwarf Binaries from Gravitational Wave Observations inside Globular Clusters Yuetong Zhao, L. Hellström, Siqi Zhang, M. Giersz, A. Askar, Youjun Lu, Zhoujian Cao, D. Belloni, G. Wiktorowicz, M. Górski 14 pages, 5 figures, submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE) The cosmic distance scale is built on multiple different techniques for estimating distances in space that are often connected and dependent on multiple measurements and assumptions. Double white dwarf binaries (DWDs) are common objects and are expected to produce gravitational wave (GW) signals that can be observed with space-based detectors such as LISA. By analyzing these signals we should be able to estimate the distance and sky location of the source. Previous studies have done this for circular binaries which, while they are abundant, have, in general, weaker signals than eccentric binaries and it is not possible to differentiate whether a circular binary is in the field or in a dense environment such as a globular cluster (GC). In this paper we used eccentric binaries from MOCCA GC simulations, simulated the GW signal from each binary at locations related to GCs in the Milky Way and estimated the precision on the distance and the sky location of the source. We find that distances can be estimated with higher precision than current day methods even with low eccentricity binaries and higher eccentricity further increases this precision. Although the probability of finding a tight and eccentric DWD is far lower than a circular one, we can expect to find at least a few in the dense environments of the Milky Way, such as GCs. These estimations would be independent measurements with high precision to objects inside dense environments, such as GCs inside the Milky Way and the Magellanic Clouds.",
      "pdf_url": "https://arxiv.org/pdf/2602.10664.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.10895",
      "title": "GECAM discovery of the second FRB-associated Magnetar X-ray Burst from SGR J1935+2154",
      "authors": [
        "Chen-Wei Wang",
        "Shao-Lin Xiong",
        "Yue Wang",
        "Wen-Jun Tan",
        "Xiao-Bo Li",
        "Dong-Zi Li",
        "Yan-Qiu Zhang",
        "Shu-Xu Yi",
        "Ming-Yu Ge",
        "Sheng-Lun Xie",
        "Wang-Chen Xue",
        "Bing Li",
        "Cheng-Kui Li",
        "Zheng-Hua An",
        "Ce Cai",
        "Pei-Yi Feng",
        "Min Gao",
        "Ke Gong",
        "Dong-Ya Guo",
        "Hao-Xuan Guo",
        "Yue Huang",
        "Jia-Cong Liu",
        "Xin-Qiao Li",
        "Ya-Qing Liu",
        "Xiao-Jing Liu",
        "Xiang Ma",
        "Wen-Xi Peng",
        "Rui Qiao",
        "Yang-Zhao Ren",
        "Li-Ming Song",
        "Xi-Lei Sun",
        "Jin Wang",
        "Jin-Zhou Wang",
        "Ping Wang",
        "Xiang-Yang Wen",
        "Shuo Xiao",
        "Sheng Yang",
        "Qi-Bin Yi",
        "Zheng-Hang Yu",
        "Da-Li Zhang",
        "Fan Zhang",
        "Wen-Long Zhang",
        "Jin-Peng Zhang",
        "Peng Zhang",
        "Shuan-Nan Zhang",
        "Zhen Zhang",
        "Xiao-Yun Zhao",
        "Yi Zhao",
        "Chao Zheng",
        "Shi-Jie Zheng"
      ],
      "abstract": "GECAM discovery of the second FRB-associated Magnetar X-ray Burst from SGR J1935+2154 Chen-Wei Wang, Shao-Lin Xiong, Yue Wang, Wen-Jun Tan, Xiao-Bo Li, Dong-Zi Li, Yan-Qiu Zhang, Shu-Xu Yi, Ming-Yu Ge, Sheng-Lun Xie, Wang-Chen Xue, Bing Li, Cheng-Kui Li, Zheng-Hua An, Ce Cai, Pei-Yi Feng, Min Gao, Ke Gong, Dong-Ya Guo, Hao-Xuan Guo, Yue Huang, Jia-Cong Liu, Xin-Qiao Li, Ya-Qing Liu, Xiao-Jing Liu, Xiang Ma, Wen-Xi Peng, Rui Qiao, Yang-Zhao Ren, Li-Ming Song, Xi-Lei Sun, Jin Wang, Jin-Zhou Wang, Ping Wang, Xiang-Yang Wen, Shuo Xiao, Sheng Yang, Qi-Bin Yi, Zheng-Hang Yu, Da-Li Zhang, Fan Zhang, Wen-Long Zhang, Jin-Peng Zhang, Peng Zhang, Shuan-Nan Zhang, Zhen Zhang, Xiao-Yun Zhao, Yi Zhao, Chao Zheng, Shi-Jie Zheng High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio burst (FRB) is mysterious phenomenon with millisecond-duration radio pulses observed mostly from cosmological distance. The association between FRB 200428 and a magnetar X-ray burst (MXB) from SGR J1935+2154 has significantly advanced the understanding of FRB and magnetar bursts. However, it is uncertain whether this association between MXB and FRB (i.e. MXB/FRB 200428) is genuine or just coincidental only based on this single event. Here we report the discovery of a bright ($\\rm\\sim7.6\\times10^{-7}\\,erg \\cdot cm^{-2}$ in 1-250 keV) magnetar X-ray burst detected by GECAM on October 14th, 2022 (dubbed as MXB 221014) from SGR J1935+2154, which is associated with a FRB detected by CHIME and GBT. We conducted a detailed temporal and spectral analysis of MXB 221014 with GECAM data and find that it is a bright and typical ($T_{90}\\sim$250 ms) X-ray burst from this magnetar. Interestingly, we find two narrow X-ray pulses in the MXB, one of which temporally aligns with the main pulse of the FRB 221014 $\\sim5.70$ ms latter than the peak time of FRB 221014), resembling the feature found in MXB/FRB 200428. Furthermore, we did comprehensive comparison between MXB/FRB 221014 and MXB/FRB 200428, and find that while the two events share several common features, they also exhibit distinct differences, highlighting the variety of the MXB-FRB association morphology. This finding not only confirms the association between MXB and FRB but also provides new insights into the mechanism of and the relationship between FRB and MXB.",
      "pdf_url": "https://arxiv.org/pdf/2602.10895.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10979",
      "title": "X-ray stellar feedback in low-metallicity starbursts: Insights from the template starburst galaxy ESO 338-IG04 and its halo",
      "authors": [
        "M. Chatzis , L. M. Oskinova , S. Reyero Serantes , B.D. Lehmer , G. Östlin , A. Bik , M. Hayes , J. M. Mas-Hesse , J. S. Gallagher , F. Fürst Institute for Physics and Astronomy, University of Potsdam, Germany, Department of Physics, University of Arkansas, USA, Arkansas Center for Space and Planetary Sciences, University of Arkansas, USA, Department of Astronomy, The Oskar Klein Centre, Stockholm University, Sweden, Centro de Astrobiología , INTA--CSIC, Spain, Department of Astronomy, U. Wisconsin-Madison, USA, ESA, ESAC, Spain)"
      ],
      "abstract": "X-ray stellar feedback in low-metallicity starbursts: Insights from the template starburst galaxy ESO 338-IG04 and its halo M. Chatzis (1), L. M. Oskinova (1), S. Reyero Serantes (1), B.D. Lehmer (2 and 3), G. Östlin (4), A. Bik (4), M. Hayes (4), J. M. Mas-Hesse (5), J. S. Gallagher (6), F. Fürst (7) ((1) Institute for Physics and Astronomy, University of Potsdam, Germany, (2) Department of Physics, University of Arkansas, USA, (3) Arkansas Center for Space and Planetary Sciences, University of Arkansas, USA, (4) Department of Astronomy, The Oskar Klein Centre, Stockholm University, Sweden, (5) Centro de Astrobiología (CAB), INTA--CSIC, Spain, (6) Department of Astronomy, U. Wisconsin-Madison, USA, (7) ESA, ESAC, Spain) Accepted for publication in A&A. Abstract abridged for arXiv High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) The X-ray output of low-metallicity starburst galaxies is a key component of stellar feedback, tracing the processes responsible for gas ionization and chemical enrichment. The integrated X-ray luminosity ($L_X$) from high-mass X-ray binaries in star-forming galaxies scales with both the star formation rate (SFR) and host-galaxy metallicity $Z$. Due to the inverse correlation between $L_X/\\mathrm{SFR}$ and $Z$, the contribution of X-ray binaries to the ionizing photon budget is enhanced in metal-poor systems and may ionize He II in the surrounding interstellar medium, powering nebular He II $\\lambda4686$ emission. The blue compact dwarf galaxy ESO 338-IG04 (ESO 338-4) provides a nearby laboratory for studying stellar feedback in a low-metallicity starburst, combining vigorous recent star formation, low metallicity ($12+\\log(\\mathrm{O/H})\\approx7.9$), and a rich population of massive stellar clusters. We characterize the X-ray emission of ESO 338-4 and its halo using new deep Chandra and XMM-Newton observations. We analyze X-ray spectra, light curves, and images to constrain the nature of its X-ray sources. We identify five ultra-luminous X-ray sources (ULXs) and diffuse hot gas surrounding the galaxy. Two ULXs are spatially associated with stellar clusters. The total X-ray luminosity exceeds $10^{41}\\,\\mathrm{erg\\,s^{-1}}$. The brightest source, ULX1, shows variability on day timescales and lacks a stellar-cluster counterpart. Photoionization modeling shows that X-ray sources significantly impact the ionizing photon budget; models with ULX1 as the ionizing source predict nebular He II $\\lambda4686$ luminosities of $\\sim10^{39}\\,\\mathrm{erg\\,s^{-1}}$.",
      "pdf_url": "https://arxiv.org/pdf/2602.10979.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11030",
      "title": "Population Properties of Binary Black Holes with Eccentricity",
      "authors": [
        "Muhammad Zeeshan",
        "Richard O'Shaughnessy",
        "Natalie Malagon"
      ],
      "abstract": "Population Properties of Binary Black Holes with Eccentricity Muhammad Zeeshan, Richard O'Shaughnessy, Natalie Malagon High Energy Astrophysical Phenomena (astro-ph.HE) The improved sensitivity of Gravitational-Wave detectors and the development of eccentric waveform models enable us to explore the growing catalog of gravitational-wave events with measurable eccentricity. This opens new opportunities to gain insight into the formation channels and evolutionary pathways of compact binary systems using eccentricity. However, most recent population analyses have been limited to quasi-circular binaries, primarily due to constraints in waveform modeling and sensitivity estimates. We are now entering an era where both of these limitations are being addressed, allowing for a more comprehensive investigation of eccentric binary populations. In this work, we perform the first population inference analysis that simultaneously fits the mass, spin, redshift, and eccentricity distribution. Specifically, we use source-parameter estimation provided by the Rapid Iterative FiTting (RIFT) framework using the SEOBNRv5EHM waveform model, and a default O4a population model extended to include eccentricity. We find population properties broadly consistent with conclusions obtained in previous analyses assuming quasi-circular binaries. Consistent with our conclusions about each event, we bound the branching ratio for eccentric events to be below $0.0239$ at $90\\%$ confidence with our fiducial eccentricity mixture models. Using four different parametric population models for eccentricity, we point out that the rate of eccentric events is weakly constrained by observations and highly model-dependent.",
      "pdf_url": "https://arxiv.org/pdf/2602.11030.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.11094",
      "title": "Future Perspectives on Black Hole Jet Mechanisms: Insights from Next-Generation Observatories and Theoretical Developments",
      "authors": [
        "Andre L. B. Ribeiro",
        "Nathalia M. N. da Rocha"
      ],
      "abstract": "Future Perspectives on Black Hole Jet Mechanisms: Insights from Next-Generation Observatories and Theoretical Developments Andre L. B. Ribeiro, Nathalia M. N. da Rocha 45 pages; 12 figures; This is the published version High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Black hole jets represent one of the most extreme manifestations of astrophysical processes, linking accretion physics, relativistic magnetohydrodynamics, and large-scale feedback in galaxies and clusters. Despite decades of observational and theoretical work, the mechanisms governing jet launching, collimation, and energy dissipation remain open questions. In this article, we discuss how upcoming facilities such as the Event Horizon Telescope (EHT), the Cherenkov Telescope Array (CTA), the Vera C. Rubin Observatory (LSST), and the Whole Earth Blazar Telescope (WEBT) will provide unprecedented constraints on jet dynamics, variability, and multi-wavelength signatures. Furthermore, we highlight theoretical challenges, including the role of magnetically arrested disks (MADs), plasma microphysics, and general relativistic magnetohydrodynamic (GRMHD) simulations in shaping our understanding of jet formation. By combining high-resolution imaging, time-domain surveys, and advanced simulations, the next decade promises transformative progress in unveiling the physics of black hole jets.",
      "pdf_url": "https://arxiv.org/pdf/2602.11094.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11112",
      "title": "Non-thermal X-ray Emission from Merging Massive Black Hole Binaries",
      "authors": [
        "Luke Krauth",
        "Jordy Davelaar"
      ],
      "abstract": "Non-thermal X-ray Emission from Merging Massive Black Hole Binaries Luke Krauth, Jordy Davelaar 7 pages, 2 figures, submitted to journal High Energy Astrophysical Phenomena (astro-ph.HE) Recent hydrodynamical simulations have identified a disappearing thermal X-ray signature in massive black hole binaries (MBHBs) embedded in circumbinary disks, arising from the tidal truncation and depletion of minidiscs shortly before merger. This feature has been proposed as a promising electromagnetic counterpart to MBHB mergers detectable by LISA. In this work, we examine whether non-thermal X-ray emission powered by magnetic reconnection could obscure or modify this thermal X-ray drop. We construct semi-analytic models for both the thermal X-ray emission from minidiscs and the non-thermal synchrotron emission produced by reconnection in magnetically dominated black hole magnetospheres. Evaluating these models across the MBHB mass range relevant for LISA, we find that for physically motivated magnetic field strengths and accretion rates, the non-thermal X-ray luminosity remains several orders of magnitude below the thermal component throughout the inspiral. Even under optimistic assumptions that enhance the non-thermal emission, it remains significantly subdominant. We further incorporate the magnetospheric balding framework to model the decay of non-thermal emission near merger, finding that reconnection-powered X-ray emission fades on short, mass-scaled timescales once the external magnetic flux supply is disrupted. Taken together, our results indicate that non-thermal emission is unlikely to mask the disappearing thermal X-ray signature, reinforcing its robustness as an electromagnetic counterpart to MBHB mergers and its potential utility for multi-messenger studies with LISA.",
      "pdf_url": "https://arxiv.org/pdf/2602.11112.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11148",
      "title": "Unmasking LHAASO J2108+5157: Near Infrared Insights into a Mysterious TeV Source",
      "authors": [
        "Josep Martí",
        "Pedro L. Luque-Escamilla",
        "Josep M. Paredes",
        "José Martínez Aroza"
      ],
      "abstract": "Unmasking LHAASO J2108+5157: Near Infrared Insights into a Mysterious TeV Source Josep Martí, Pedro L. Luque-Escamilla, Josep M. Paredes, José Martínez Aroza 5 pages, 3 figures. Accepted for publication in Monthly Notices of the Royal Astronomical Society (MNRAS) High Energy Astrophysical Phenomena (astro-ph.HE) LHAASO J2108+5157 is one of the few ultra-high energy gamma-ray sources in the LHAASO catalogue without secure counterpart at longer wavelengths. Several Galactic scenarios have been proposed, including an evolved supernova remnant and a pulsar wind nebula. Yet, no shocked gas, shell-like structure, or compact pulsar candidate has been identified. Follow-up observations with VERITAS and the LST-1 prototype have not firmly clarified its nature. A recent microquasar candidate from GMRT radio data remains uncertain. Here we present the first dedicated near-infrared study of the field, combining deep JHKs imaging with narrow band observations targeting the H2 v=1-0 S(1) line. Our observations were initially planned to encompass the full source region, but now only partially cover the latest updated position and size of LHAASO J2108+5157. We find no evidence of shocked emission, extended nebular structures, or an accreting compact object signature in the covered field. The GMRT radio source, despite its jet-like morphology, exhibits near-infrared properties incompatible with both a Galactic microquasar and a nearby radio galaxy, discouraging an association with the gamma-ray emission. Our analysis reveals no convincing counterpart consistent within the positional uncertainty, leaving LHAASO J2108+5157 as an enigmatic ultra-high energy emitter that requires deeper observations.",
      "pdf_url": "https://arxiv.org/pdf/2602.11148.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10187",
      "title": "Modern tidal interaction models for rapid binary population synthesis: I. Methods",
      "authors": [
        "Veome Kapil",
        "Ilya Mandel",
        "Evgeni Grishin",
        "Jim Fuller",
        "Jeff Riley",
        "Emanuele Berti"
      ],
      "abstract": "Modern tidal interaction models for rapid binary population synthesis: I. Methods Veome Kapil, Ilya Mandel, Evgeni Grishin, Jim Fuller, Jeff Riley, Emanuele Berti Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) In this work, we present an updated prescription of contemporary tidal dissipation theory adapted for rapid binary population synthesis. Our simplified expressions encode the dependence of tidal dissipation on stellar structure, stratification, and tidal forcing frequency, while remaining computationally efficient. We implement these prescriptions in the rapid population synthesis code COMPAS, and demonstrate the self-consistent coupling of tides with stellar evolution and binary properties such as orbital periods, spins, and eccentricities for several representative binary systems. When compared with commonly used tidal prescriptions, our equilibrium tidal dissipation efficiencies can be stronger by 1-2 orders of magnitude for low mass main sequence and giant type stars, and dynamical tides can be stronger by 1-7 orders of magnitude due to the explicit dependence on internal stellar structure and the presence of inertial wave dissipation. Despite our simplistic approach, our models agree with detailed stellar simulations to within an order of magnitude across tidal dissipation mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2602.10187.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10193",
      "title": "The stellar-to-halo mass relation of central galaxies across three orders of halo mass",
      "authors": [
        "Victoria Toptun",
        "Paola Popesso",
        "Ilaria Marini",
        "Stephan Vladutescu-Zopp",
        "Klaus Dolag",
        "Peter Behroozi",
        "Lorenzo Lovisari",
        "Stefano Ettori",
        "Veronica Biffi",
        "Xiaohu Yang",
        "Natanael de Isídio",
        "Daudi T. Mazengo"
      ],
      "abstract": "The stellar-to-halo mass relation of central galaxies across three orders of halo mass Victoria Toptun, Paola Popesso, Ilaria Marini, Stephan Vladutescu-Zopp, Klaus Dolag, Peter Behroozi, Lorenzo Lovisari, Stefano Ettori, Veronica Biffi, Xiaohu Yang, Natanael de Isídio, Daudi T. Mazengo Submitted to A&A; 12 pages, 9 figures Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The stellar content of galaxies is tightly connected to the mass and growth of their host dark matter halos. Observational constraints on this relation remain limited, particularly for low-mass groups, leaving uncertainties in how galaxies assemble their stars across halo mass scales. Accurately measuring the brightest central galaxy (BCG) stellar-to-halo mass relation (SHMR) over a wide mass range is therefore crucial for understanding galaxy formation and the role of feedback processes. Here we present the SHMR spanning $M_{\\rm halo} \\sim 10^{12}$-$10^{15}\\,M_\\odot$, using halo masses derived from eROSITA eRASS1 X-ray data and BCG stellar masses based on SDSS photometry. By stacking X-ray spectra of optically selected groups, we recover robust average halo gas temperatures for each bin, which are then converted to halo masses via the $M$-$T_X$ relation. We find that the SHMR peaks near $M_{\\rm halo} \\sim 10^{12}\\,M_\\odot$, with a declining stellar fraction at higher masses. This trend reflects a combination of processes that reduce the efficiency of stellar mass growth in massive halos, such as AGN feedback, reduced cooling efficiency, and the increasing dominance of ex-situ assembly, while halos continue to grow through mergers and accretion. Our measurements are consistent over the full mass range with previous observational studies, including weak lensing, X-ray analyses of individual clusters, and kinematical and dynamical methods. Comparisons with hydrodynamical simulations show good agreement at low masses but reveal significant discrepancies in the normalization at cluster scales, highlighting the sensitivity of BCG stellar growth to feedback prescriptions and halo assembly history. These results provide the first X-ray-based observational SHMR covering three orders of magnitude in halo mass, establish a robust benchmark for testing galaxy formation models.",
      "pdf_url": "https://arxiv.org/pdf/2602.10193.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10211",
      "title": "The Landscape of Unstable Mass Transfer in Interacting Binaries and Its Imprint on the Population of Luminous Red Novae",
      "authors": [
        "Angela A. G. Twum",
        "Alejandro Vigna-Gómez",
        "Morgan MacLeod",
        "Rosa Wallace Everson",
        "Ricardo Yarza",
        "V. Ashley Villar",
        "Enrico Ramirez-Ruiz"
      ],
      "abstract": "The Landscape of Unstable Mass Transfer in Interacting Binaries and Its Imprint on the Population of Luminous Red Novae Angela A. G. Twum, Alejandro Vigna-Gómez, Morgan MacLeod, Rosa Wallace Everson, Ricardo Yarza, V. Ashley Villar, Enrico Ramirez-Ruiz Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) A common-envelope (CE) phase occurs when a star engulfs its companion and is widely considered the primary channel for producing Luminous Red Novae (LRNe). In this study, we combine binary-population synthesis with stellar-evolution calculations to systematically estimate the mass, velocity, and launching radius of ejecta produced during coalescence across a range of binary configurations. Our aim is to quantify how unstable mass-transfer dynamics in binaries at various evolutionary stages shape CE outcomes, enabling a predictive framework for modeling the LRN luminosity function. We find a bimodal distribution of plateau luminosities with significant implications for binary mass stability criteria that can be tested with forthcoming LSST observations. This bimodality emerges from differing mass-ejection outcomes during common-envelope interactions, which can lead either to stellar mergers, often accompanied by tidal disruption of the companion, or to successful envelope ejection. Although our predicted plateau luminosities and timescales broadly match existing observations, the models underpredict the number of LRNe with long-duration plateaus ($t_p \\gtrsim 100\\, \\text{d}$) by about a third. We propose that these long-duration events arise from highly extended progenitors whose envelopes are ejected over multiple orbits (i.e., non-impulsively), producing relatively faint, long-lived transients. By constraining ejecta properties and incorporating pre-outburst progenitor imaging, we show how our models can clarify the physical processes that drive unstable mass transfer in these events. Finally, we argue that common-envelope interactions involving white-dwarf accretors can yield exotic outcomes, including red giants containing embedded white dwarfs that resemble Thorne-Żytków objects (TŻOs), along with calcium-rich supernovae that preserve hydrogen envelopes.",
      "pdf_url": "https://arxiv.org/pdf/2602.10211.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10284",
      "title": "Evidence that SOL2012-06-03 Late Phase $γ$ Rays are Produced by $>$300 MeV Protons from CME-Shock Acceleration of Suprathermals from the Flare",
      "authors": [
        "Gerald H. Share",
        "Ronald J. Murphy"
      ],
      "abstract": "Evidence that SOL2012-06-03 Late Phase $γ$ Rays are Produced by $>$300 MeV Protons from CME-Shock Acceleration of Suprathermals from the Flare Gerald H. Share, Ronald J. Murphy 3 pages, 1 figure, Accepted for publication in Research Notes of the AAS Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) A recent paper on SOL2012-06-03 reported the detection for the first time of two distinct phases of $>$100 MeV $\\gamma$-radiation indicating separate acceleration processes. But such two-phase emission has been seen before and was first observed in SOL1982-06-03. The second phase is known as Late Phase Gamma-Ray Emission (LPGRE) and was cataloged for $>$40 solar eruptions, including SOL2012-06-03. Here we provide evidence that the second SOL2012-06-03 $\\pi$-decay peak is the onset of LPGRE that lasted for $>$8 min. Its delay from the impulsive X-ray peak is consistent with the time it would take flare-produced suprathermal protons to overtake the expanding CME and be accelerated by its shock. The high accelerated ion-to-electron ratio in SOL2012-06-03 and other LPGRE events is consistent with the ratio observed in gradual SEP events produced by shocks and is inconsistent with ratios typically found in impulsive flares and solar energetic particle events produced by reconnection.",
      "pdf_url": "https://arxiv.org/pdf/2602.10284.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11053",
      "title": "Collisionless relaxation as the origin of the anisotropic, non-thermal, and multi-temperature momentum distributions observed in space plasmas",
      "authors": [
        "Torsten Enßlin",
        "Christoph Pfrommer"
      ],
      "abstract": "Collisionless relaxation as the origin of the anisotropic, non-thermal, and multi-temperature momentum distributions observed in space plasmas Torsten Enßlin, Christoph Pfrommer Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Anisotropic, non-thermal, and multi-temperature distributed particle momenta are commonly observed in collisionless space plasmas, such as the solar wind. Using Liouville's theorem, we argue that anisotropic compression or expansion of the plasma, followed by a relaxation of the resulting anisotropic stress must lead to non-equilibrium states that are either anisotropic, non-thermal distribution functions, different electron and ion temperatures, or a combination of these effects. We present arguments showing that a plasma in thermal equilibrium undergoing anisotropic compression or expansion cannot return to thermal equilibrium in the absence of particle collisions. Since most astrophysical plasmas are practically collisionless and experience significant anisotropic compression or expansion, we expect anisotropic, non-thermal, and multi-temperature particle distributions to be ubiquitous, in agreement with solar wind measurements.",
      "pdf_url": "https://arxiv.org/pdf/2602.11053.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.12013",
      "title": "A second-scale periodicity in an active repeating fast radio burst source",
      "authors": [
        "Chen Du",
        "Yong-Feng Huang",
        "Jin-Jun Geng",
        "Hao-Xuan Gao",
        "Li Zhang",
        "Chen Deng",
        "Lang Cui",
        "Jie Liao",
        "Peng-Fei Jiang",
        "Liang Zhang",
        "Pei Wang",
        "Chen-Ran Hu",
        "Xiao-Fei Dong",
        "Fan Xu",
        "Liang Li",
        "Ze-Cheng Zou",
        "Abdusattar Kurban"
      ],
      "abstract": "A second-scale periodicity in an active repeating fast radio burst source Chen Du, Yong-Feng Huang, Jin-Jun Geng, Hao-Xuan Gao, Li Zhang, Chen Deng, Lang Cui, Jie Liao, Peng-Fei Jiang, Liang Zhang, Pei Wang, Chen-Ran Hu, Xiao-Fei Dong, Fan Xu, Liang Li, Ze-Cheng Zou, Abdusattar Kurban High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs) are fierce radio flashes from the deep sky. Abundant observations have indicated that highly magnetized neutron stars might be involved in these energetic bursts, but the underlying trigger mechanism is still enigmatic. Especially, the widely expected periodicity connected to the spin of the central engine has never been discovered, which leads to further debates on the nature of FRBs. Here we report the first discovery of a $\\sim 1.7\\,\\mathrm{s}$ period in the repeating source of FRB 20201124A. This is an active repeater, from which more than 2800 FRBs have been observed on a total of 49 days. The phase-folding method is adopted to analyze the bursts on each day separately. While no significant periodic signal is found in all other datasets, a clear periodicity does appear on two specific days, i.e. a period of $1.706024(13)\\,\\mathrm{s}$ on MJD 59310, and a slightly larger period of $1.707968(9)\\,\\mathrm{s}$ on MJD 59347. A period derivative of $6.11(5)\\times 10^{-10}\\,\\mathrm{s\\,s^{-1}}$ can be derived from these two periods, which further implies a surface magnetic field strength of $1.03\\times 10^{15}\\,\\mathrm{G}$ and a spin-down age of 44 years for the central engine. A joint analysis on these two days yields a significance of $7.3\\sigma$ for the periodicity. It is concluded that FRB 20201124A should be associated with a young magnetar.",
      "pdf_url": "https://arxiv.org/pdf/2503.12013.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.13278",
      "title": "The pulsar wind nebula around B1853+01 in X-rays",
      "authors": [
        "Xiying Zhang",
        "Pol Bordas",
        "Samar Safi-Harb",
        "Kazushi Iwasawa"
      ],
      "abstract": "The pulsar wind nebula around B1853+01 in X-rays Xiying Zhang, Pol Bordas, Samar Safi-Harb, Kazushi Iwasawa High Energy Astrophysical Phenomena (astro-ph.HE) We report on the results of a comprehensive analysis of X-ray observations with \\textit{Chandra}, \\textit{XMM-Newton} and \\textit{NuSTAR} of the pulsar wind nebula (PWN) associated with PSR B1853+01, located inside the W44 supernova remnant (SNR). Previous X-ray observations unveiled the presence of a fast-moving pulsar, PSR B1853+01, at the southern edge of the W44 thermal X-ray emission region, as well as an elongated tail structure trailing the pulsar. Our analysis reveals, in addition, an ``outflow'' feature ahead of the pulsar extending for about 1\\arcmin~($\\sim$1.0 pc at a distance of 3.2 kpc). At larger scales, the entire PWN seems to be surrounded by a faint, diffuse X-ray emission structure. The southern part of this structure displays the same unusual morphology as the ``outflow'' feature and extends along $\\sim$6\\arcmin~($\\sim$5 pc) in the direction of the pulsar proper motion. In this report, a spatially-resolved spectral analysis for different extended regions around PSR B1853+01 is carried out. For an updated value of the column density of $0.65_{-0.42}^{+0.46} \\times 10^{22} ~\\textrm{cm}^{-2}$, a power-law fit to the ``outflow'' region yields a spectral index $\\Gamma \\approx 1.24_{-0.24}^{+0.23}$, which is significantly harder than that of the pulsar ($\\Gamma \\approx 1.87_{-0.43}^{+0.48}$) and the pulsar tail ($\\Gamma \\approx 2.01_{-0.38}^{+0.39}$). We argue that both the ``outflow'' structure and the surrounding halo-like X-ray emission might be produced by high-energy particles escaping the PWN around PSR B1853+01, a scenario recently suggested also for other bow-shock PWNe with jet-like structures and/or TeV halos.",
      "pdf_url": "https://arxiv.org/pdf/2507.13278.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.04873",
      "title": "A semi-coherent search for optical pulsations from Scorpius X-1",
      "authors": [
        "Riccardo La Placa , Alessandro Papitto , Giulia Illiano , Filippo Ambrosino , Christian Malacaria , Luigi Stella , Paola Leaci , Pia Astone , Cristiano Palomba , Sara Motta , Adriano Ghedina , Massimo Cecconi , Francesco Leone , Manuel González , Héctor Pérez Ventura , Marcos Hernandez Diaz , José San Juan INAF - Osservatorio Astronomico di Roma, Monte Porzio Catone, Italy, INAF - Osservatorio Astronomico di Brera, Merate, Italy, INFN, Sezione di Roma, Roma, Italy, Università di Roma 'La Sapienza', Roma, Italy, University of Oxford, Department of Physics, Astrophysics, Oxford, United Kingdom, Fundación Galileo Galilei - INAF, <a href=\"http://B.Baja\" rel=\"external noopener nofollow\" class=\"link-external link-http\">this http URL</a> , Spain, Dipartimento di Fisica e Astronomia, Sezione Astrofisica, Università di Catania, Catania, Italy, INAF - Osservatorio Astrofisico di Catania, Catania, Italy)"
      ],
      "abstract": "A semi-coherent search for optical pulsations from Scorpius X-1 Riccardo La Placa (1), Alessandro Papitto (1), Giulia Illiano (2 and 1), Filippo Ambrosino (1), Christian Malacaria (1), Luigi Stella (1), Paola Leaci (3 and 4), Pia Astone (3), Cristiano Palomba (3), Sara Motta (2 and 5), Adriano Ghedina (6), Massimo Cecconi (6), Francesco Leone (7 and 8), Manuel González (6), Héctor Pérez Ventura (6), Marcos Hernandez Diaz (6), José San Juan (6) ((1) INAF - Osservatorio Astronomico di Roma, Monte Porzio Catone, Italy, (2) INAF - Osservatorio Astronomico di Brera, Merate, Italy, (3) INFN, Sezione di Roma, Roma, Italy, (4) Università di Roma 'La Sapienza', Roma, Italy, (5) University of Oxford, Department of Physics, Astrophysics, Oxford, United Kingdom, (6) Fundación Galileo Galilei - INAF, <a href=\"http://B.Baja\" rel=\"external noopener nofollow\" class=\"link-external link-http\">this http URL</a> (<a href=\"http://S.C.Tenerife\" rel=\"external noopener nofollow\" class=\"link-external link-http\">this http URL</a>), Spain, (7) Dipartimento di Fisica e Astronomia, Sezione Astrofisica, Università di Catania, Catania, Italy, (8) INAF - Osservatorio Astrofisico di Catania, Catania, Italy) 13 pages, 4 figures, accepted for publication by Astronomy & Astrophysics; this version includes modifications made during the reviewing and language editing processes High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) The emission of continuous gravitational waves (CWs) possibly explains why pulsars spinning with a period shorter than a millisecond have not been observed so far. Neutron stars accreting mass at the highest rates are the most promising targets for a search for CWs, because a strong emission of gravitational waves is required to balance the torque exerted by mass accretion onto the neutron star. Detecting coherent pulsations in the electromagnetic emission maximizes the search sensitivity, but has so far not been successful for most of the brightest accreting neutron stars. Here, we present the first search for pulsations in the optical band from the brightest accreting neutron star known, Sco X-1. To this end, we tailored semi-coherent search strategies to data obtained over four years, for a total of $\\sim$$56$ ks, by the SiFAP2 fast photometer mounted at the Telescopio Nazionale Galileo (TNG). These searches are especially suited to analysing long observations of systems for which only limited knowledge on the orbital parameters is available, and involve joining coherent analyses on shorter segments without connecting the spin phase between them. The large count rates afforded by an optical telescope and the efficiency of the search strategy employed allowed us to set an upper limit of $9 \\times 10^{-5}$ to the pulsed amplitude, which is lower by a factor of four with respect to previous searches in the X-ray band. We also show that the application of semi-coherent searches to SiFAP2 observations of the first detected optical millisecond pulsar, PSR J1023+0038, could have preceded its detection in the radio band. These results highlight the role played by high-time-resolution optical observations in performing deep searches of quickly rotating pulsars.",
      "pdf_url": "https://arxiv.org/pdf/2508.04873.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.23126",
      "title": "A volcanic chronosequence as a time-resolved paleo-detector array to study the cosmic-ray flux in the Late Pleistocene and Holocene",
      "authors": [
        "Claudio Galelli",
        "Lorenzo Caccianiga",
        "Lorenzo Apollonio",
        "Paolo Magnani",
        "Vincent Breton"
      ],
      "abstract": "A volcanic chronosequence as a time-resolved paleo-detector array to study the cosmic-ray flux in the Late Pleistocene and Holocene Claudio Galelli, Lorenzo Caccianiga, Lorenzo Apollonio, Paolo Magnani, Vincent Breton High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) We present a phenomenological study demonstrating the feasibility of using olivine xenoliths from the Chaîne des Puys as a time-resolved paleo-detector array to probe the cosmic-ray flux over the last 40,000 years. This volcanic region provides a unique chronosequence of samples brought to the surface by well-dated eruptions. By modeling the expected density of nuclear recoil tracks induced by cosmic-ray muons in olivine, we show that the signal is detectable and above backgrounds from natural radioactivity. We demonstrate that by analyzing samples with different exposure ages, it is possible to construct a time-differential measurement of the cosmic-ray flux. This method shows sensitivity to historical variations, such as the enhanced flux expected during the Laschamp geomagnetic excursion ($\\sim$41~kyr) and the potential contribution from nearby supernovae, for which we use the Antlia supernova remnant precursor as a benchmark. This work establishes a new application of the paleo-detector technique for long-scale time-domain high-energy astrophysics and provides the direct scientific motivation for experimental efforts to measure these track records.",
      "pdf_url": "https://arxiv.org/pdf/2510.23126.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.04342",
      "title": "Asymptotic constraints for 1D planar grey photon diffusion from linear transport with special-relativistic effects",
      "authors": [
        "Ryan T. Wollaeger",
        "Jim E. Morel",
        "Kendra P. Long",
        "Mathew A. Cleveland",
        "Robert B. Lowrie"
      ],
      "abstract": "Asymptotic constraints for 1D planar grey photon diffusion from linear transport with special-relativistic effects Ryan T. Wollaeger, Jim E. Morel, Kendra P. Long, Mathew A. Cleveland, Robert B. Lowrie 31 pages, 5 figures, 1 table. Accepted to the Journal of Quantitative Spectroscopy and Radiative Transfer (JQSRT) on 2/10/2026 High Energy Astrophysical Phenomena (astro-ph.HE) We derive a grey linear diffusion equation for photons with respect to inertial (or lab-frame) space and time, using asymptotic analysis in 1D planar geometry. The solution of the equation is the comoving radiation energy density. Our analysis does not make use of assumptions about the magnitude of velocity; instead we derive an asymptotic scaling in the lab frame such that we avoid apparent non-physical pathologies that are encountered with the standard static-matter scaling. We permit the photon direction to be continuous (as opposed to constraining the analysis to discrete ordinates). The result is a drift-diffusion equation in the lab frame for comoving radiation energy density, with an adiabatic term that matches the standard semi-relativistic diffusion equation. Following a recent study for discrete directions, this equation reduces to a pure advection equation as the velocity approaches the speed of light. We perform preliminary numerical experiments comparing solutions to relativistic lab-frame Monte Carlo transport and to the well-known semi-relativistic diffusion equation.",
      "pdf_url": "https://arxiv.org/pdf/2512.04342.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.19403",
      "title": "Diagnosing the AGN population origin of TeV neutrinos with their spatial correlation",
      "authors": [
        "Xiao-Bin Chen",
        "Ruo-Yu Liu",
        "Xiang-Yu Wang"
      ],
      "abstract": "Diagnosing the AGN population origin of TeV neutrinos with their spatial correlation Xiao-Bin Chen, Ruo-Yu Liu, Xiang-Yu Wang This version corresponds to the manuscript currently under journal review High Energy Astrophysical Phenomena (astro-ph.HE) The recent detection of TeV neutrinos from some nearby Seyfert galaxy (e.g., NGC1068) by IceCube suggests that active galactic nuclei (AGNs) could make a significant contribution to diffuse astrophysical neutrinos. The absence of TeV gamma-rays from NGC1068 indicates neutrino production in a compact opaque region of gamma-rays. The vicinity of the supermassive black hole, such as the disk-corona, is an ideal region, where the high radiation density leads to efficient neutrino production and gamma-ray attenuation. Disk-corona models predict that the neutrino emission from AGNs correlates with X-ray emission, which traces the coronal activity. In this paper, we assess whether diffuse TeV neutrinos can originate from X-ray-emitting AGNs with Monte Carlo simulations, considering the predicted performance of future neutrino telescopes. We test this hypothesis by searching for spatial correlations between the X-ray AGN population and high-energy neutrinos, assuming that the neutrino flux scales with the AGN X-ray flux. Based on detailed Monte Carlo simulations, we find that an AGN origin of diffuse neutrinos can be tested at a significance of about $3\\sigma$ with five years of IceCube-Gen2 observations. With improved angular resolution and sensitivity, a 30km$^{3}$-scale underwater neutrino telescope (such as the High-energy Underwater Neutrino Telescope) is expected to reach a significance of about $8\\sigma$ with one year of exposure. The detection significance decreases if AGNs contribute partially to the total astrophysical neutrino flux. Our results highlight the critical role of angular resolution in diagnosing the AGN origin of diffuse TeV neutrinos.",
      "pdf_url": "https://arxiv.org/pdf/2512.19403.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.05435",
      "title": "The Cosmic-ray Knee as a Local Signature of Nearby PeVatrons",
      "authors": [
        "Ke Fang",
        "Francis Halzen"
      ],
      "abstract": "The Cosmic-ray Knee as a Local Signature of Nearby PeVatrons Ke Fang, Francis Halzen 12 pages, 7 figures, to appear in ApJL High Energy Astrophysical Phenomena (astro-ph.HE) A \"knee\" in the cosmic-ray spectrum, characterized by a sudden steepening of the spectral shape at $\\sim 4$ PeV, may be interpreted either as a global feature of Galactic cosmic rays or as a local signature. In the former scenario, cosmic-ray spectra throughout the Galaxy would be similar to that observed in the solar neighborhood, and the knee would be a common feature of the cosmic-ray sea. In the latter scenario, the PeV cosmic-ray flux varies across the Galactic disk, and the knee is dominantly contributed by a small number of nearby sources. By simulating cosmic-ray propagation in the Galactic magnetic field and interstellar medium, we show that the two scenarios correspond to different regimes of the birth rate of PeV proton accelerators and depend on the presence of powerful nearby sources. By comparison with both cosmic-ray and gamma-ray observations, we find that a local knee would be best explained by sources located at distances of order $\\sim1$ kpc and with ages in the range 0.1-1 Myr, with the Cygnus Cocoon being a particularly promising candidate.",
      "pdf_url": "https://arxiv.org/pdf/2601.05435.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.06407",
      "title": "Primordial Black Hole signatures from femtolensing and spectral fringe of Gamma Ray Bursts",
      "authors": [
        "Chang-Yu Dai",
        "Po-Yan Tseng"
      ],
      "abstract": "Primordial Black Hole signatures from femtolensing and spectral fringe of Gamma Ray Bursts Chang-Yu Dai, Po-Yan Tseng High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Femtolensing of gamma ray bursts (GRBs) are vastly studied to constrain the primordial black hole (PBHs) lighter than $10^{-13}$ solar mass and may close the window for PBH dark matter. In this case, wave optics formalism is required and carefully implemented in our analysis. Incorporating the GRB observational data from Swift XRT, we perform the statistic analysis of PBH lensing, comparing with null hypothesis where BAND model is used to parametrize the GRB spectrum. We found few GRB data manifest the spectral fringe which characterize the feature of femtolensing by PBHs, and the analysis shows moderate statistical preference in terms of goodness of fit. Conversely, since most of the fitting to GRB spectral data do not improved with PBH lensing, we utilize to obtain upper bound on the PBH fractional abundance with respect to dark matter. However, the robust constraint cannot be achieved, unless the size of GRBs are smaller than $5\\times10^{7}$ m for PBH mass around $5\\times10^{-15}$ solar mass.",
      "pdf_url": "https://arxiv.org/pdf/2602.06407.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09124",
      "title": "Continuous Gravitational Waves from Supersoft X-ray Sources: Promising Targets for deci-Hz Detectors",
      "authors": [
        "Mayusree Das",
        "Tomasz Bulik",
        "Sreeta Roy",
        "Banibrata Mukhopadhyay"
      ],
      "abstract": "Continuous Gravitational Waves from Supersoft X-ray Sources: Promising Targets for deci-Hz Detectors Mayusree Das, Tomasz Bulik, Sreeta Roy, Banibrata Mukhopadhyay 14 pages, 9 figures, 1 table, comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) Supersoft X-ray sources (SSSs) host white dwarfs (WDs) accreting at rates that sustain steady nuclear burning, driving rapid mass growth, radial contraction, and magnetic field amplification. Angular-momentum transfer from the accretion disk naturally spins up the WD, while the amplified internal magnetic field induces a non-axisymmetric deformation in presence of a misaligned rotation. Such WDs emits continuous gravitational waves (CGWs). We model the coupled evolutions of stellar mass, spin, and magnetic structure in accreting WDs in SSSs with MESA, and compute the resulting quadrupolar deformation with the Einstein-Maxwell solver XNS. We show that WDs in SSSs, particularly near the end of thermal timescale mass transfer and close to the Chandrasekhar mass limit, produce CGWs predominantly in the deci-Hz band accessible to planned detectors such as DECIGO, BBO, Deci-Hz, ALIA, and LGWA, and are distinguishable from other Galactic CGW sources such as AM CVn systems, detached double WDs, and isolated WDs. Well studied SSSs such as CAL 83 and RX J0019+2156 can be detectable, enabling targeted CGW measurements that directly probe WD's internal magnetic fields and rotation, while blind searches can reveal hundreds of obscured SSSs otherwise missed in soft X-rays and map the hidden population of accreting, rapidly rotating, magnetized WDs in nearby galaxies. A CGW detection from WDs in SSSs could also identify potential pre-explosion Type Ia progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2602.09124.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.10192",
      "title": "Forged by Feedback: Stellar Properties of Brightest Group Galaxies in Cosmological Simulations",
      "authors": [
        "Ruxin Barré , Arif Babul , Ghassem Gozaliasl , Alexis Finoguenov , Romeel Davé , Aviv Padawer-Blatt , Douglas Rennehan , Vida Saeedzadeh , Renier T. Hough , Thomas R. Quinn University of Victoria, Canada, University of Edinburgh, United Kingdom, Indian Institute of Science, India, Aalto University, Finland, University of Helsinki, Finland, University of the Western Cape, South Africa, Flatiron Institute, USA, Johns Hopkins University, USA, North-West University, South Africa, National Institute for Theoretical and Computational Sciences, South Africa, University of Washington, USA)"
      ],
      "abstract": "Forged by Feedback: Stellar Properties of Brightest Group Galaxies in Cosmological Simulations Ruxin Barré (1), Arif Babul (1, 2, and 3), Ghassem Gozaliasl (4 and 5), Alexis Finoguenov (5), Romeel Davé (2 and 6), Aviv Padawer-Blatt (1), Douglas Rennehan (7), Vida Saeedzadeh (8), Renier T. Hough (9 and 10), Thomas R. Quinn (11) ((1) University of Victoria, Canada, (2) University of Edinburgh, United Kingdom, (3) Indian Institute of Science, India, (4) Aalto University, Finland, (5) University of Helsinki, Finland, (6) University of the Western Cape, South Africa, (7) Flatiron Institute, USA, (8) Johns Hopkins University, USA, (9) North-West University, South Africa, (10) National Institute for Theoretical and Computational Sciences, South Africa, (11) University of Washington, USA) Astrophysics of Galaxies (astro-ph.GA) We investigate how different galaxy formation models impact the stellar properties of brightest group galaxies (BGGs) in four cosmological simulations: ROMULUS, SIMBA, SIMBA-C, and OBSIDIAN. The stellar masses, specific star formation rates, and mass-weighted stellar ages of the simulated BGGs are analysed alongside those of observed BGGs from X-ray-selected galaxy groups in the COSMOS field. We find that the global properties and underlying evolutionary pathways of simulated BGG populations are strongly impacted by the strength and mechanism of their respective active galactic nucleus (AGN) feedback models, which play a critical role in regulating the growth of massive galaxies. OBSIDIAN's sophisticated three-regime AGN feedback model achieves the highest overall agreement with COSMOS observations, matching stellar property distributions, quenched fractions, and the evolution of star formation in increasingly massive systems. We find evidence suggesting that BGG populations of OBSIDIAN and COSMOS undergo a gradual decline in star formation with stellar mass, in contrast to SIMBA and SIMBA-C, which display rapid quenching linked to the onset of powerful AGN jet feedback. By comparison, ROMULUS produces highly star-forming, under-quenched BGGs due to the inefficiency of its thermal AGN feedback in preventing cooling flows from fuelling BGG growth. The success of the OBSIDIAN simulation demonstrates the importance of physically motivated subgrid prescriptions for realistically capturing the processes that shape BGGs and their dynamic group environments.",
      "pdf_url": "https://arxiv.org/pdf/2602.10192.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10200",
      "title": "The Keck/DEIMOS Stellar Archive: I. Uniform Velocities and Metallicities for 78 Milky Way Dwarf Galaxies and Globular Clusters",
      "authors": [
        "Marla Geha",
        "Debora Pelliccia",
        "J.Xavier Prochaska",
        "William Cerny",
        "Frederick B. Davies",
        "Joseph Hennawi",
        "Brad Holden Dusty Reichwein",
        "Kyle B. Westfall"
      ],
      "abstract": "The Keck/DEIMOS Stellar Archive: I. Uniform Velocities and Metallicities for 78 Milky Way Dwarf Galaxies and Globular Clusters Marla Geha, Debora Pelliccia, J.Xavier Prochaska, William Cerny, Frederick B. Davies, Joseph Hennawi, Brad Holden Dusty Reichwein, Kyle B. Westfall 37 pages, 18 figures, 5 tables. Accepted by ApJ. For access to all data tables see this http URL Astrophysics of Galaxies (astro-ph.GA) We present a homogeneous spectroscopic dataset of 22,339 stars in 78 Milky Way dwarf galaxy satellites and globular clusters. All data were taken with the Keck II telescope and Deep Extragalactic Imaging Multiobject Spectrograph (DEIMOS) spectrograph using the 1200G grating (spectral resolution R~6000). Based on a uniform data reduction of 411 DEIMOS masks, we present a catalog of individual stellar radial velocities, equivalent width-based [Fe/H] metallicities, and membership estimates. The Milky Way satellites range from M_V = 2 to -14 (M* = 10^1.5 to 10^7.5 Msun); the majority of individual stars presented in these systems have magnitudes 17 > r > 22. The data were reduced to 1D spectra using PypeIt, which provides near Poisson statistics-level sky subtraction. Radial velocities were determined via dmost, a forward modeling method first presented here, which combines both synthetic telluric and stellar templates to determine stellar radial velocities. We assess the accuracy and precision our method via comparison to thousands of repeat measurements and literature values. We determine a velocity error floor of 1.1 km/s and a CaII triplet-based metallicity error floor of 0.1 dex. We calculate internal velocity dispersions and compare to literature values, demonstrating 20-50% improved precision over the literature in most cases. In a companion paper, we use our homogeneous catalogs to explore properties of these Milky Way satellites, including previously unpublished measurements in several systems including Bootes II and Draco II. We provide full access to the data catalogs to enable further studies.",
      "pdf_url": "https://arxiv.org/pdf/2602.10200.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10202",
      "title": "The Keck/DEIMOS Stellar Archive: II. Dynamical Masses and Metallicities for a Uniform Sample of Milky Way Satellites",
      "authors": [
        "Marla Geha"
      ],
      "abstract": "The Keck/DEIMOS Stellar Archive: II. Dynamical Masses and Metallicities for a Uniform Sample of Milky Way Satellites Marla Geha (Yale University) 19 pages, 9 figures, 1 table. Submitted to ApJ. For access to all data tables see this https URL Astrophysics of Galaxies (astro-ph.GA) Population-level studies of Milky Way satellites used to constrain dark matter or the threshold of galaxy formation often rely on velocity dispersions and metallicities derived from heterogeneous spectroscopic analyses. Systematic differences between data reduction pipelines and membership criteria can masquerade as astrophysical signals, or obscure real trends. Here, we present the largest self-consistent sample of spectroscopically-derived quantities for Milky Way satellite galaxies and globular clusters based on a homogeneous re-analysis of individual stars observed with the Keck/DEIMOS spectrograph. We determine enclosed dynamical masses, mean [Fe/H] metallicities, and metallicity dispersions for 67 systems with 10 or more member stars. At a given stellar mass, systems classified as satellite galaxies are well separated from globular clusters in their dynamical mass and mass-to-light ratios. The average enclosed mass densities of satellite galaxies agree with semi-analytic CDM model predictions. For satellite galaxies, we observe a break in the stellar mass-metallicity relation near log M*/Msun = 4 (M_V ~ -4.5). Above this stellar mass, satellite galaxies show the well-known tight trend (0.16 dex scatter in [Fe/H]) of decreasing metallicity with stellar mass; below log M*/Msun = 4, the mass-metallicity relation flattens and/or increases in scatter. Satellite galaxies have internal metallicity scatter between 0.3-0.4 dex across our stellar mass range. These uniform measurements will enable tighter constraints on the stellar mass-halo mass relation, improved J-factor estimates for dark matter searches, and lay a foundation for interpreting the flood of new Milky Way satellites expected in the LSST/Roman/Euclid era.",
      "pdf_url": "https://arxiv.org/pdf/2602.10202.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10244",
      "title": "The S-PLUS Fornax Project (S+FP): An extragalactic catalog covering $\\sim$ 5 virial radii around NGC 1399 with galaxy properties",
      "authors": [
        "R. F. Haack",
        "A. V. Smith Castelli",
        "L. Sodré Jr.",
        "C. Mendes de Oliveira",
        "A. R. Lopes",
        "L. A. Gutiérrez-Soto",
        "R. Demarco",
        "D. E. Olave-Rojas",
        "E. R. Carrasco",
        "P. K. Humire",
        "J. P. Calderón",
        "F. de Almeida Fernandes",
        "L. Lomelí-Núñez",
        "G. Sepúlveda",
        "C. Lima-Dias",
        "S. Torres Flores",
        "E. Telles",
        "N. M. Cardoso",
        "D. Palma",
        "L. Doubrawa",
        "D. Pallero",
        "M. Marinello",
        "W. Schoenell",
        "T. Ribeiro",
        "A. Kanaan"
      ],
      "abstract": "The S-PLUS Fornax Project (S+FP): An extragalactic catalog covering $\\sim$ 5 virial radii around NGC 1399 with galaxy properties R. F. Haack, A. V. Smith Castelli, L. Sodré Jr., C. Mendes de Oliveira, A. R. Lopes, L. A. Gutiérrez-Soto, R. Demarco, D. E. Olave-Rojas, E. R. Carrasco, P. K. Humire, J. P. Calderón, F. de Almeida Fernandes, L. Lomelí-Núñez, G. Sepúlveda, C. Lima-Dias, S. Torres Flores, E. Telles, N. M. Cardoso, D. Palma, L. Doubrawa, D. Pallero, M. Marinello, W. Schoenell, T. Ribeiro, A. Kanaan 19 pages, 18 figures. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Observational extragalactic catalogs over wide sky areas are essential for uncovering the large-scale structure of the Universe. They allow, among others, cosmological studies and density analyses that impose strong constraints on models of galaxy formation and evolution. By taking advantage of the wide field images and the 12 optical bands of the Southern Photometric Local Universe Survey (S-PLUS), we aim at providing a catalog of galaxies located, in projection, towards the Fornax galaxy cluster, within $\\sim$ 5 virial radii in right ascension (R.A.) and $\\sim$ 3 virial radius in declination (Dec) around NGC,1399, the dominant galaxy of the cluster. Such a catalog will allow unprecedented large-scale structure studies in that sky region. Supervised deep learning algorithms have been developed, utilizing neural networks complemented with dimensionality reduction techniques, to classify and separate spurious objects, stars and galaxies in a photometric catalog previously built for the S-PLUS Fornax Project (S+FP). That catalog was built using a combination of SExtractor configurations optimized for galaxy detection and characterization. A catalog of 119,580 galaxies was obtained in the direction of the Fornax cluster containing photometric information in the 12 optical bands of S-PLUS complemented with GALEX (UV), VHS-VISTA (NIR) and AllWISE (MIR) data. We estimate photometric redshifts ({\\sigma}_ NMAD $\\sim$ 0.0219) with a lower limit of z_ lim $\\sim$ 0.03. Stellar masses, star formation rates (SFRs) and D4000_N index estimates were obtained through a machine learning approach, by matching S-PLUS photometric data to SDSS spectroscopic data. The completeness of the catalog (72%) was calculated by comparing with mock catalogs ...",
      "pdf_url": "https://arxiv.org/pdf/2602.10244.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10325",
      "title": "Carbon-Enhanced Metal-Poor Star Candidates in the Milky Way from J-PLUS and S-PLUS",
      "authors": [
        "Jihye Hong",
        "Timothy C. Beers",
        "Yang Huang",
        "Jonathan Cabrera Garcia",
        "Young Sun Lee",
        "Vinicius M. Placco",
        "Evan N. Kirby"
      ],
      "abstract": "Carbon-Enhanced Metal-Poor Star Candidates in the Milky Way from J-PLUS and S-PLUS Jihye Hong, Timothy C. Beers, Yang Huang, Jonathan Cabrera Garcia, Young Sun Lee, Vinicius M. Placco, Evan N. Kirby 23 pages, 11 figures, 6 tables; submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Recent large-scale multi-band photometric surveys now enable elemental-abundance estimates for millions of stars with accuracies approaching those of low- to medium-resolution spectroscopy. Using [Fe/H] and [C/Fe] estimates derived from the Javalambre Photometric Local Universe Survey (J-PLUS) DR3 and the Southern Photometric Local Universe Survey (S-PLUS) DR4, which together cover $\\sim$6,200 deg$^2$ of the sky, we identify large numbers of carbon-enhanced metal-poor (CEMP) stars in the Milky Way. After applying data-quality cuts and evolutionary corrections to the carbon-abundance estimates, we construct a combined J/S-PLUS sample of $\\sim$6.40 million stars and identify $\\sim$104,900 CEMP candidates, roughly twice the number of CEMP candidates identified from Gaia XP spectra by Lucey et al. We photometrically confirm that the absolute carbon abundance $A$(C) separates CEMP stars into two primary groups, CEMP-no and CEMP-$s$ stars, consistent with previous spectroscopic studies. We also recover CEMP morphological Groups I-III in the Yoon-Beers diagram, as well as the recently proposed Group IV, and show that it is statistically distinct even in photometric data. A cumulative frequency analysis confirms that the CEMP fraction increases toward lower metallicity and that CEMP-no stars dominate in the most metal-poor regime. By comparing frequencies with and without Group IV stars, we assess their relation to CEMP-no and CEMP-$s$ stars, and examine CEMP distributions across different Galactic components. The resulting catalog provides a substantial sample for future spectroscopic follow-up, in particular to constrain the likely origin(s) of the Group IV stars.",
      "pdf_url": "https://arxiv.org/pdf/2602.10325.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10347",
      "title": "MAGNUS III: Mild evolution of the total density slope in massive early-type galaxies since z$\\sim$1 from dynamical modeling of MUSE integral-field stellar kinematics",
      "authors": [
        "Pritom Mozumdar",
        "Michele Cappellari",
        "Christopher D. Fassnacht",
        "Tommaso Treu"
      ],
      "abstract": "MAGNUS III: Mild evolution of the total density slope in massive early-type galaxies since z$\\sim$1 from dynamical modeling of MUSE integral-field stellar kinematics Pritom Mozumdar, Michele Cappellari, Christopher D. Fassnacht, Tommaso Treu Astrophysics of Galaxies (astro-ph.GA) We investigate the total mass density slope evolution in massive early-type galaxies (ETGs) over the last 6.5 billion years ($0 < z < 0.75$). We perform a detailed dynamical analysis of approximately 200 ETGs spanning the redshift range $0.24 < z < 0.75$, utilizing spatially resolved stellar kinematics derived from high signal-to-noise ratio (S/N) MUSE-DEEP spectroscopy and surface brightness models from high-resolution HST imaging. We constrain mass distributions using the Jeans Anisotropic Modeling (JAM) technique coupled with Multi-Gaussian Expansion (MGE) method. To rigorously constrain evolutionary trends, we combine this intermediate-redshift dataset with a local ETG sample ($z \\sim 0.05$) from the MaNGA survey. We adopt dynamical constraints for the local sample derived using an identical homogeneous methodology, ensuring a strictly consistent comparison. We found that the total density profiles of the intermediate-redshift ETG sample are approximately isothermal and exhibit a median mass-weighted total density slope, $<\\gamma_{\\rm T}>=2.19 \\pm 0.01$ at $<z>=0.44$, which is shallower than the local baseline of $<\\gamma_{\\rm T}> = 2.26 \\pm 0.01$ at $<z>=0.04$. This structural shift corresponds to a redshift gradient of $\\mathrm{d} \\gamma_{\\rm T}/\\mathrm{d} z \\approx -0.20 \\pm 0.03$, detected at $\\sim$5-$\\sigma$ significance. We demonstrate that this trend is robust against model assumptions and persists even when restricting the analysis to high-velocity dispersion systems ($\\sigma_e > 150$ km/s). Our findings are consistent with previous lensing-based studies and in tension with cosmological simulations. The observed steepening suggests that dissipative processes, such as gas-rich accretion and mergers, must play a non-negligible role in the late-stage assembly of massive ETGs.",
      "pdf_url": "https://arxiv.org/pdf/2602.10347.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10574",
      "title": "Cosmic-ray electron propagation in NGC 3044 from radio continuum observations",
      "authors": [
        "Shengtao Wang",
        "Xiaohui Sun",
        "George Heald",
        "Jiang-Tao Li",
        "Chao-Wei Tsai",
        "Judith Irwin",
        "Theresa Wiegert",
        "Jun Xu"
      ],
      "abstract": "Cosmic-ray electron propagation in NGC 3044 from radio continuum observations Shengtao Wang, Xiaohui Sun, George Heald, Jiang-Tao Li, Chao-Wei Tsai, Judith Irwin, Theresa Wiegert, Jun Xu Astrophysics of Galaxies (astro-ph.GA) Star-forming edge-on galaxies often exhibit extended halo radiation in multiple bands, providing ideal laboratories for studying the transfer of matter from the disk to the halo. We investigate the transport of cosmic-ray electrons (CREs) and the associated galactic wind, and assess their impact on the surrounding medium in NGC 3044. We obtained the NGC 3044 total intensity image at 943 MHz from the Australian SKA Pathfinder (ASKAP) observations with a resolution of 16 arcsec and an rms noise of 20 $\\mu$Jy beam$^{-1}$. The sensitivity is higher than the previous observations at similar frequencies. We find that the ASKAP intensity profiles perpendicular to the disk can be fit with two exponential components. The scale heights of the thin and thick disks are $0.43 \\pm 0.13$ kpc and $1.91 \\pm 0.26$ kpc, respectively. By jointly fitting total intensity and spectral index profiles with one-dimensional advection and diffusion models, we find that CREs are advected outward from the disk with the velocity increasing with height in a power law. Beyond $\\sim3$ kpc, the velocity exceeds the escape speed of $\\sim400$ km s$^{-1}$, indicating a strong wind. We further identify a possible superbubble of radius $\\sim3$ kpc filled with soft X-ray emitting hot gas and surrounded by an HI shell and a bright H$\\alpha$ rim. These results demonstrate that radio continuum observations provide a powerful probe of cosmic-ray-driven winds in normal star-forming spiral galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2602.10574.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10682",
      "title": "JWST spectra are consistent with the edge-on star-forming galaxy scenario for the \"runaway supermassive black hole\"",
      "authors": [
        "Jorge Sanchez Almeida , Ignacio Trujillo , Sebastian F. Sanchez , Mireia Montes Instituto de Astrofisica de Canarias, La Laguna, Tenerife, Spain, Departamento de Astrofisica, Universidad de La Laguna, Instituto de Astronomia, Universidad Nacional Autonoma de Mexico, Ensenada, Mexico, Institute of Space Sciences , Campus UAB, Barcelona, Spain)"
      ],
      "abstract": "JWST spectra are consistent with the edge-on star-forming galaxy scenario for the \"runaway supermassive black hole\" Jorge Sanchez Almeida (1 and 2), Ignacio Trujillo (1 and 2), Sebastian F. Sanchez (3, 1 and 2), Mireia Montes (4) ((1) Instituto de Astrofisica de Canarias, La Laguna, Tenerife, Spain, (2) Departamento de Astrofisica, Universidad de La Laguna, (3) Instituto de Astronomia, Universidad Nacional Autonoma de Mexico, Ensenada, Mexico, (4) Institute of Space Sciences (ICE, CSIC), Campus UAB, Barcelona, Spain) To appear as a Research Note of the American Astronomical Society (RNAAS). All authors contribute equally Astrophysics of Galaxies (astro-ph.GA) The linear structure reported by van Dokkum et al. (2023) has been proposed as either a massive stellar wake produced by a runaway supermassive black hole (SMBH) or a bulgeless edge-on galaxy. New JWST/NIRSpec IFU observations target the tip of the structure, where a SMBH would produce a bow shock, whereas a normal galaxy would host an HII region. Using standard BPT diagrams ([OIII]5007/Hb vs [NII]6583/Ha and [OIII]5007/Hb vs [OII]6716,6731/Ha), we find that the line ratios at the tip fall on the locus of low-metallicity low-extinction HII regions. This region does not overlap with loci typical of shocks in merging galaxies. Thus, these results are consistent with the interpretation that the linear structure is a star-forming galaxy, with the bright knot representing one of its HII regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.10682.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10859",
      "title": "The metal-poor tail of the APOGEE survey I. Uncovering [Fe/H] < -2.5 stars from the inner Galaxy to the Magellanic Clouds",
      "authors": [
        "M. Montelius",
        "E. Starkenburg",
        "H. Woudenberg",
        "A. Angrilli Muglia",
        "A. Ardern-Arentsen",
        "A. Viswanathan",
        "A. Byström",
        "A. Helmi",
        "N. Martin",
        "T. Matsuno",
        "C. Navarrete",
        "J. Navarro"
      ],
      "abstract": "The metal-poor tail of the APOGEE survey I. Uncovering [Fe/H] < -2.5 stars from the inner Galaxy to the Magellanic Clouds M. Montelius, E. Starkenburg, H. Woudenberg, A. Angrilli Muglia, A. Ardern-Arentsen, A. Viswanathan, A. Byström, A. Helmi, N. Martin, T. Matsuno, C. Navarrete, J. Navarro Astronomy & Astrophysics (2025), Volume 704, id.A44, 16 pp Astrophysics of Galaxies (astro-ph.GA) In the search for metal-poor stars, large spectroscopic surveys are an invaluable tool. However, the spectra of metal-poor stars can be difficult to analyse because of the relative lack of available lines, which can also lead to misclassification. We aim to identify the stars observed by the APOGEE survey that are below the metallicity limit of APOGEE's analysis. For the highest confidence candidates, we classify the orbital properties of the stars to investigate whether their orbital distribution matches what we would expect for stars that are this metal poor and to select especially interesting targets for spectroscopic follow-up purposes. We examined the properties derived by APOGEE for metal-poor stars from the literature to find signatures of stars with a metallicity below the range of the grid used for spectral analysis. The calibrated APOGEE stellar parameters provide a clear signature of the most metal-poor stars in the survey, indicated by null values for their metallicities while having effective temperatures and surface gravities determined by the pipeline. From comparison with the literature, we find that, within a temperature range of 3700 - 6700 K and above a threshold of S/N > 30, the vast majority of APOGEE stars without calibrated metallicities are very metal poor. The radial velocities provided by APOGEE, Gaia DR3 positions and astrometry along with spectrophotometric distances derived in this work allowed for the computation of their orbits. In this work, we select 289 very metal-poor red giant stars (likely below = -2.5) from the APOGEE results. Our sample contains 16 very metal-poor member candidates of the Magellanic Clouds, 14 very metal-poor stars with orbits confined to the inner Galaxy, and 13 inner Galaxy halo interlopers.",
      "pdf_url": "https://arxiv.org/pdf/2602.10859.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10883",
      "title": "The metal-poor tail of the APOGEE survey II. Spectral analysis of Mg and Si in very metal-poor APOGEE spectra",
      "authors": [
        "M. Montelius",
        "A. Angrilli Muglia",
        "E. Starkenburg",
        "C. Kobayashi",
        "A. Ardern-Arentsen",
        "F. Gran",
        "P. Jablonka",
        "N. Martin",
        "J. Navarro",
        "F. Sestito",
        "K. A. Venn",
        "S. Vitali"
      ],
      "abstract": "The metal-poor tail of the APOGEE survey II. Spectral analysis of Mg and Si in very metal-poor APOGEE spectra M. Montelius, A. Angrilli Muglia, E. Starkenburg, C. Kobayashi, A. Ardern-Arentsen, F. Gran, P. Jablonka, N. Martin, J. Navarro, F. Sestito, K. A. Venn, S. Vitali Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) H-band spectra contain very limited spectral information for stars at the most metal-poor tail ( Fe/H < -2.5) because the available Fe lines in FGK stars in this wavelength range are weak. The first paper in this series successfully identified a sample of 327 very metal-poor stars (with [Fe/H] < -2) from the APOGEE database, 289 of which are on the red giant branch. The spectra of these stars were not properly analysed by the APOGEE main pipeline because they are very metal poor. In this work, we measure metallicities for these stars using the abundances of the elements Mg and Si. We demonstrate that the absorption lines of the elements Mg and Si are of good quality despite the challenging combination of (low) metallicity, wavelength regime, spectral resolution, and signal-to-noise ratios available for these spectra. A specialised pipeline was designed to measure the abundance of Mg and Si in APOGEE spectra and yielded a robust estimate of the overall metallicity. In order to provide reliable measurements, we tested three different sets of assumptions for Mg and Si enhancement. We present Mg and Si abundances as well as overall metallicities for 327 stars, all of which had previously gotten null values from the main APOGEE pipeline for either the calibrated M/H or [Fe/H] . The typical uncertainties for our measurements are 0.2 dex. We found five stars in our sample with unusual [Si/Mg] abundances higher than 0.5, and we connect this signature to globular cluster stars, and this might be related to specific supernova events. Our data suggest a concentration of high [Si/Mg] stars in the Sextans dwarf galaxy. Other dwarf galaxies are found to agree well with results in the literature. Our derived metallicities range between -3.1 $\\leq$ [M/H] $\\leq$ -2.25, thereby pushing the metal-poor tail of APOGEE results down by 0.6 dex.",
      "pdf_url": "https://arxiv.org/pdf/2602.10883.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10893",
      "title": "Deep and Sparse Denoising Benchmarks for Spectral Data Cubes of High-z Galaxies: From Simulations to ALMA observations",
      "authors": [
        "Arnab Lahiry",
        "Tanio Díaz-Santos",
        "Jean-Luc Starck",
        "Niranjan Chandra Roy",
        "Daniel Anglés-Alcázar",
        "Grigorios Tsagkatakis",
        "Panagiotis Tsakalides"
      ],
      "abstract": "Deep and Sparse Denoising Benchmarks for Spectral Data Cubes of High-z Galaxies: From Simulations to ALMA observations Arnab Lahiry, Tanio Díaz-Santos, Jean-Luc Starck, Niranjan Chandra Roy, Daniel Anglés-Alcázar, Grigorios Tsagkatakis, Panagiotis Tsakalides 14 pages, 17 figures [Appendix: 4 pages, 3 figures] Submitted to Astronomy & Astrophysics (2025) Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Beyond cosmic noon, galaxies appear as faint whispers amid noise, yet this epoch is key to understanding massive galaxy assembly. ALMA's sensitivity to cold dust and [C II] emission allows us to probe their interstellar medium, but faint signals make robust denoising essential. We evaluate and benchmark denoising strategies including Principal Component Analysis, Independent Component Analysis, sparse unsupervised representations: iterative soft thresholding with 2D-1D wavelets, and supervised deep learning with a 3D U-Net, to identify techniques that suppress noise while preserving flux and morphology across peak SNRs of 2.5-8, applied to (i) synthetic spectral cubes of rotating toy disk galaxies, (ii) synthetic [C II] IFU cubes from FIRE simulations, and (iii) ALMA [C II] observations of CRISTAL galaxies and W2246-0526. Performance is assessed via RMSE, conservation of flux and spectra, noise reduction, and SNR improvement of the central galaxy. For synthetic cubes: PCA and ICA provide marginal improvement; IST reduces noise effectively at moderate SNRs but can suppress emission at low SNRs; and the U-Net outperforms IST, though it can produce quantifiable hallucinations at lower-SNRs. For moderate-SNR observations (ALMA-CRISTAL), U-Net and IST achieve comparable performance, conserving >91% flux and increasing SNR by >6. However, for observations with complex morphologies absent in the training set (W2246), the U-Net underperforms relative to IST, recovering ~80% flux, while IST robustly conserves flux and improves SNR by ~3, highlighting generalisation challenges and the need for physically-motivated training priors. We conclude that IST is a robust unsupervised denoiser for moderate-SNR data, and a synthetically trained U-Net generalises effectively to real data, dependent on training priors. This framework offers a pathway for transferable denoising for ALMA, VLT/MUSE, and JWST.",
      "pdf_url": "https://arxiv.org/pdf/2602.10893.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.11068",
      "title": "Most Strong Lensing Deflectors in the AGEL Survey are in Group and Cluster Environments",
      "authors": [
        "William J. Gottemoller",
        "Nandini Sahu",
        "Rodrigo Cordova-Rosado",
        "Leena Iwamoto",
        "Courtney B. Watson",
        "Kim-Vy H. Tran",
        "A. Makai Baker",
        "Tania M. Barone",
        "Duncan J. Bowden",
        "Karl Glazebrook",
        "Anishya Harshan",
        "Tucker Jones",
        "Glenn G. Kacprzak",
        "Camryn M. Neches"
      ],
      "abstract": "Most Strong Lensing Deflectors in the AGEL Survey are in Group and Cluster Environments William J. Gottemoller, Nandini Sahu, Rodrigo Cordova-Rosado, Leena Iwamoto, Courtney B. Watson, Kim-Vy H. Tran, A. Makai Baker, Tania M. Barone, Duncan J. Bowden, Karl Glazebrook, Anishya Harshan, Tucker Jones, Glenn G. Kacprzak, Camryn M. Neches 23 pages, 12 figures, and 4 tables. Accepted for publication in AJ Astrophysics of Galaxies (astro-ph.GA) The environments of deflectors in strong lensing systems affect our ability to test cosmological models and constrain evolutionary properties of galaxies. Here we measure the deflector scale (Einstein mass) and deflector environment (halo mass) of 89 spectroscopically confirmed strong lenses in the ASTRO3D Galaxy Evolution With Lenses (AGEL) survey. We classify deflector scale by measuring $\\theta_{\\rm{E}}$ to determine the mass enclosed by the Einstein radius, $M(<\\theta_{\\rm{E}})$. We quantify deflector environment by using photometric redshifts to determine the galaxy surface density to the fifth-nearest neighbor $\\Sigma_5(z)$. We find that 47.2% of our deflectors are embedded in cluster environments, whereas only 9.0% have cluster-scale Einstein radii (masses). We measure a weak correlation ($r = 0.38$) between Einstein mass and $\\Sigma_5(z)$, suggesting that the assumption of single galaxy-scale deflectors in lens modeling is overly-simplified. We hypothesize that the weak correlation results from galaxy-scale bias in the original AGEL selection and the observational challenge of detecting faint arcs with large Einstein radii. Comparing number densities, $N_{\\rm{gal}}$, between AGEL and control fields, we find that AGEL deflectors are in systematically denser environments. Our study provides a method to identify strong lenses as a function of deflector environment and approximate the impact of large-scale environment in lens modeling. We provide the measured lensing parameters for our 89 AGEL systems as well as $z_{\\rm{phot}}$ and $r$-mag (AB) maps of the line-of-sight.",
      "pdf_url": "https://arxiv.org/pdf/2602.11068.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10186",
      "title": "A method for constructing the joint mass function of binary stars",
      "authors": [
        "Amery Gration",
        "Robert G. Izzard",
        "Payel Das"
      ],
      "abstract": "A method for constructing the joint mass function of binary stars Amery Gration, Robert G. Izzard, Payel Das Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The initial mass function (IMF) describes the distribution of stellar masses in a population of newly born stars and is amongst the most fundamental concepts in astrophysics. It is not only the direct result of the star formation process but it also explains the evolution of galaxies' luminosities, metal yields, star-formation efficiencies, and supernova production rates. Because most stars exist in binary systems, however, a full statistical account of stellar mass requires not the IMF but rather the joint distribution of a binary population's primary- and secondary-star masses. This joint distribution must respect the IMF of the stars from which the population has been assembled as well as the distribution of mass ratios that results from the assembly mechanism. Despite its importance, this joint distribution is known only in the case of random pairing. Here we present a method for constructing it in the general case. We also illustrate the use of our method by recovering the known result for random pairing and by finding the previously unknown result for uniform pairing.",
      "pdf_url": "https://arxiv.org/pdf/2602.10186.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10207",
      "title": "Optimizing Deep Learning Photometric Redshifts for the Roman Space Telescope with HST/CANDELS",
      "authors": [
        "Ashod Khederlarian",
        "Brett H. Andrews",
        "Jeffrey A. Newman",
        "Tianqing Zhang",
        "Biprateep Dey"
      ],
      "abstract": "Optimizing Deep Learning Photometric Redshifts for the Roman Space Telescope with HST/CANDELS Ashod Khederlarian, Brett H. Andrews, Jeffrey A. Newman, Tianqing Zhang, Biprateep Dey 30 pages, 13 figures, 2 tables. Submitted to AJ Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) Photometric redshifts (photo-$z$'s) will be crucial for studies of galaxy evolution, large-scale structure, and transients with the Nancy Grace Roman Space Telescope. Deep learning methods leverage pixel-level information from ground-based images to achieve the best photo-$z$'s for low-redshift galaxies, but their efficacy at higher redshifts with deep, space-based imaging remains largely untested. We used Hubble Space Telescope CANDELS optical and near-infrared imaging to evaluate fully-supervised, self-supervised, and semi-supervised deep learning photo-$z$ algorithms out to $z\\sim3$. Compared to template-based and classical machine learning photometry methods, the fully-supervised and semi-supervised models achieved better performance. Our new semi-supervised model, PITA (Photo-$z$ Inference with a Triple-loss Algorithm), outperformed all others by learning from unlabeled and labeled data through a three-part loss function that incorporates images and colors for all objects as well as redshifts when available. PITA produces a latent space that varies smoothly in magnitude, color, and redshift, resulting in the best photo-$z$ performance even when the redshift training set was significantly reduced. In contrast, the self-supervised approach produced a latent space with significant color and redshift fluctuations that hindered photo-$z$ inference. Looking forward to Roman, we recommend using semi supervised deep learning to take full advantage of the information contained in the hundreds of millions of high-resolution images and color measurements, together with the limited redshift measurements available, to achieve the most accurate photo-$z$ estimates for both faint and bright sources.",
      "pdf_url": "https://arxiv.org/pdf/2602.10207.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10308",
      "title": "Carbon from Interstellar Clouds to Habitable Worlds",
      "authors": [
        "Edwin A. Bergin",
        "Marc M. Hirschmann",
        "Andre Izidoro"
      ],
      "abstract": "Carbon from Interstellar Clouds to Habitable Worlds Edwin A. Bergin, Marc M. Hirschmann, Andre Izidoro Review to be published in Annual Reviews of Astronomy and Astrophysics Volume 64 (authors version, 52 Pages, 14 figures, 2 tables) Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Carbon is an essential element for a habitable world. Inner (r < 3 au) disk planetary carbon compositions are strongly influenced by supply and survival of carbonaceous solids. Here we trace the journey of carbon from the interstellar medium to the processes leading to planet formation. The review highlights the following central aspects: -Organics forming in evolved star envelopes are supplemented by aromatic molecules forming in the dense ISM to represent the seeds of (hydro)carbon supply through pervasive pebble drift to rocky planets and sub-Neptune cores. -Within the protoplanetary disk the sharp gradient in the C/Si content of Solar System bodies and mineral geochemistry outlines a tale of carbon loss from pebbles to within planetesimals and planets, and from planetary atmospheres. -Within two planet formation paradigms (pebble and planetesimal accretion) a range of planetary carbon content is possible that is strongly influenced by early (< 0.5 Myr) formation of a pressure bump that titrates drift. Overall, it is unlikely that the carbon architecture of our Solar System applies to all systems. In the absence of giant planets, carbon-rich rocky worlds and sub-Neptunes may be common. We outline observations that support their presence and discuss habitability of terrestrial worlds.",
      "pdf_url": "https://arxiv.org/pdf/2602.10308.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10323",
      "title": "Re-visiting the Canis Major star-forming region with Gaia data release 3 data",
      "authors": [
        "S. Nogueira-Silva",
        "P.A.B. Galli",
        "J. Olivares",
        "H. Bouy",
        "B. P. Popowicz",
        "P. M. Merino",
        "T. Santos-Silva",
        "J. Gregorio-Hetem",
        "N. Miret-Roig",
        "J. Alves"
      ],
      "abstract": "Re-visiting the Canis Major star-forming region with Gaia data release 3 data S. Nogueira-Silva, P.A.B. Galli, J. Olivares, H. Bouy, B. P. Popowicz, P. M. Merino, T. Santos-Silva, J. Gregorio-Hetem, N. Miret-Roig, J. Alves 14 pages, 10 figures, A&A (in press) Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Context: The Canis Major (CMa) star-forming region, a remote molecular cloud complex within the recently discovered Radcliffe Wave, remains under-explored in the literature. Aims: We revisit the stellar census in the CMa region, characterizing its stellar population, kinematics, and age using recent astrometric and photometric data from the third data release of the Gaia space mission (Gaia DR3). Methods: We conducted a membership analysis of Gaia DR3 sources across a 16 deg$^2$ field encompassing the youngest subgroups in CMa. This new stellar census, combined with spectroscopic observations, allowed us to investigate the structure, kinematics, and age of this region. Results: We identified 1531 objects as members of the CMa region, confirming 401 previously known members and introducing 1130 new candidate members. These objects have magnitudes ranging from 10 to 18 mag in the G band from Gaia DR3. We identified two subgroups of CMa stars in our sample labelled as Cluster A and Cluster B. They are located at roughly the same distance ($d_{A} = 1150^{+79}_{-88}$ pc and $d_{B} = 1183^{+103}_{-108}$ pc) and exhibit similar space motions that can be derived thanks to the precise radial velocities obtained in this study. The subgroups have a mean isochronal age of about 2-3 Myr. However, based on infrared photometry we show that Cluster A has a higher fraction of disc-bearing stars suggesting that it could be somewhat younger than Cluster B. Conclusions: Our analysis provides new insights into the stellar population of the Canis Major region, by identifying new members, characterizing their kinematics, and assessing their evolutionary stages. Future studies incorporating additional data from upcoming Gaia data releases, multi-wavelength and high-resolution spectroscopic observations will be essential to further advance our understanding of the history of star formation in this region.",
      "pdf_url": "https://arxiv.org/pdf/2602.10323.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10447",
      "title": "Bridging the Kinetic-Fluid Gap: Ion-Driven Magnetogenesis to Prime Cosmic Dynamos",
      "authors": [
        "X. Liu",
        "D. Wu",
        "J. Zhang"
      ],
      "abstract": "Bridging the Kinetic-Fluid Gap: Ion-Driven Magnetogenesis to Prime Cosmic Dynamos X. Liu, D. Wu, J. Zhang Plasma Physics (physics.plasm-ph); Astrophysics of Galaxies (astro-ph.GA) The origin of cosmic magnetic fields is widely attributed to the amplification of weak seed fields by turbulent dynamos. However, a critical understanding gap remains between the microscopic generation of these seeds and the macroscopic onset of the dynamo. Current kinetic models, often constrained to electron scales, predict premature saturation via magnetic trapping, leaving the generated fields potentially too weak and small-scale to effectively prime magnetohydrodynamic (MHD) processes. Here, using high-resolution kinetic simulations with a realistic mass ratio, we reveal the physics of this unexplored ion-kinetic regime. Under generalized continuous shear driving, used to simulate ubiquitous macroscopic flows, we demonstrate that the saturation of electron instabilities is not the endpoint but a precursor to a distinct, ion-dominated evolution. Massive ions, sustaining the velocity shear, trigger a subsequent filamentation instability that accesses the vast ion kinetic energy reservoir. This mechanism amplifies the magnetic energy by orders of magnitude beyond the electron-saturation limit, expanding the field coherence to ion scales. Our results establish ion kinetics as the essential ''missing link'' that bridges the divide between microscopic plasma instabilities and macroscopic cosmic dynamos.",
      "pdf_url": "https://arxiv.org/pdf/2602.10447.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11050",
      "title": "Machine learning exploration of binding energy distributions of H2O at astrochemically relevant dust grain surfaces",
      "authors": [
        "Anant Vaishnav",
        "Niels M. Mikkelsen",
        "Mie Andersen"
      ],
      "abstract": "Machine learning exploration of binding energy distributions of H2O at astrochemically relevant dust grain surfaces Anant Vaishnav, Niels M. Mikkelsen, Mie Andersen Chemical Physics (physics.chem-ph); Astrophysics of Galaxies (astro-ph.GA) Binding energies (BEs) of adsorbates on interstellar dust grains critically control adsorption, desorption, diffusion, and surface reactivity, and therefore strongly influence astrochemical models of star- and planet-forming regions. While recent computational studies increasingly report full distributions of BEs rather than single representative values, these distributions are typically derived for either bare grain surfaces or thick water-ice mantles. In this work, we bridge these regimes by systematically investigating the BE distributions of water on partially and fully ice-covered dust grain surfaces. We employ machine-learning interatomic potentials (MLIPs) based on graph neural networks to model water adsorption on graphene and on the Mg-terminated (010) surface of forsterite, representing carbonaceous and silicate grains, respectively. The models enable extensive sampling of adsorption sites on water clusters, monolayers, and bilayers generated under both crystalline (thermally processed) and amorphous (low-temperature) growth conditions. At submonolayer coverage, the chemical nature of the underlying grain strongly affects both ice morphology and binding energies, with Mg-O interactions on silicate surfaces producing particularly deep binding sites. From monolayer coverage onward, adsorption on both substrates is dominated by hydrogen bonding within the ice, reducing the influence of the grain material. Across all coverages, amorphous ice structures systematically shift the BE distributions toward stronger binding compared to crystalline ice, introducing highly stable defect and pocket sites. These results demonstrate that BE distributions in the submonolayer to few-layer ice regime are broad and highly surface dependent, and they provide physically motivated input for next-generation astrochemical models incorporating surface heterogeneity.",
      "pdf_url": "https://arxiv.org/pdf/2602.11050.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.05403",
      "title": "H-alpha as a Tracer of Star Formation in the SPHINX Cosmological Simulations",
      "authors": [
        "I. G. Kramarenko",
        "J. Rosdahl",
        "J. Blaizot",
        "J. Matthee",
        "H. Katz",
        "C. Di Cesare"
      ],
      "abstract": "H-alpha as a Tracer of Star Formation in the SPHINX Cosmological Simulations I. G. Kramarenko, J. Rosdahl, J. Blaizot, J. Matthee, H. Katz, C. Di Cesare New high-redshift SFR(Ha) calibrations are given in Eqs. 2 & 3. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The H-alpha (Ha) emission line in galaxies is a powerful tracer of their recent star formation activity. With the advent of JWST, we are now able to routinely observe Ha in galaxies at high redshift (z > 3) and thus measure their star formation rates (SFRs). However, using classical SFR(Ha) calibrations to derive the SFRs leads to biased results because high-redshift galaxies are commonly characterized by low metallicities and bursty star formation histories, affecting the conversion factor between the Ha luminosity and the SFR. In this work, we develop a set of new SFR(Ha) calibrations that allow us to predict the SFRs of Ha-emitters at z > 3 with minimal error. We use the SPHINX cosmological simulations to select a sample of star-forming galaxies representative of the Ha-emitter population observed with JWST. We then derive linear corrections to the classical SFR(Ha) calibrations, taking into account variations in the physical properties (e.g., stellar metallicities) among individual galaxies. We obtain two new SFR(Ha) calibrations that, compared to the classical calibrations, reduce the root mean squared error (RMSE) in the predicted SFRs by $\\Delta$RMSE $\\approx$ 0.04 dex dex and $\\Delta$RMSE $\\approx$ 0.06 dex, respectively. Using the recent JWST NIRCam/grism observations of Ha-emitters at z ~ 6, we show that the new calibrations affect the high-redshift galaxy population statistics: (i) the estimated cosmic star formation rate density decreases by $\\Delta\\rho$(SFR) $\\approx$ 12%, and (ii) the observed slope of the star formation main sequence increases by $\\Delta$ $\\partial$log SFR / $\\partial$log M* = 0.08 $\\pm$ 0.02.",
      "pdf_url": "https://arxiv.org/pdf/2509.05403.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01314",
      "title": "JWST Observations of Starbursts: PAHs Closely Trace the Cool Phase of M82's Galactic Wind",
      "authors": [
        "Sebastian Lopez",
        "Colton Ring",
        "Adam K. Leroy",
        "Serena A. Cronin",
        "Alberto D. Bolatto",
        "Laura A. Lopez",
        "Vicente Villanueva",
        "Deanne B. Fisher",
        "Todd A. Thompson",
        "Grant P. Donnelly",
        "Lee Armus",
        "Torsten Boeker",
        "Leindert A. Boogaard",
        "Martha L. Boyer",
        "Ryan Chown",
        "Daniel A. Dale",
        "Keaton Donaghue",
        "Kimberly Emig",
        "Simon C. O. Glover",
        "Rodrigo Herrera-Camus",
        "Ralf S. Klessen",
        "Thomas S.-Y. Lai",
        "Laura Lenkic",
        "Rebecca C. Levy",
        "David S. Meier",
        "Elisabeth Mills",
        "Juergen Ott",
        "Evan D. Skillman",
        "J.D. T. Smith",
        "Elizabeth J. Tarantino",
        "Sylvain Veilleux",
        "Fabian Walter",
        "Paul P. van der Werf"
      ],
      "abstract": "JWST Observations of Starbursts: PAHs Closely Trace the Cool Phase of M82's Galactic Wind Sebastian Lopez, Colton Ring, Adam K. Leroy, Serena A. Cronin, Alberto D. Bolatto, Laura A. Lopez, Vicente Villanueva, Deanne B. Fisher, Todd A. Thompson, Grant P. Donnelly, Lee Armus, Torsten Boeker, Leindert A. Boogaard, Martha L. Boyer, Ryan Chown, Daniel A. Dale, Keaton Donaghue, Kimberly Emig, Simon C. O. Glover, Rodrigo Herrera-Camus, Ralf S. Klessen, Thomas S.-Y. Lai, Laura Lenkic, Rebecca C. Levy, David S. Meier, Elisabeth Mills, Juergen Ott, Evan D. Skillman, J.D. T. Smith, Elizabeth J. Tarantino, Sylvain Veilleux, Fabian Walter, Paul P. van der Werf 15 pages, 7 figures, submitted to ApJ Letters (01 October 2025), accepted for publication ApJ Letters (10 February 2026) Astrophysics of Galaxies (astro-ph.GA) Stellar feedback drives multiphase gas outflows from starburst galaxies, but the interpretation of dust emission in these winds remains uncertain. To investigate this, we analyze new JWST mid-infrared images tracing polycyclic aromatic hydrocarbon (PAH) emission at 7.7 and 11.3~$\\mu$m from the outflow of the prototypical starburst M82 out to $3.2$ kpc. We find that PAH emission shows significant correlations with CO, H$\\alpha$, and X-ray emission within the outflow, though the strengths and behaviors of these correlations vary with gas phase and distance from the starburst. PAH emission correlates strongly with cold molecular gas, with PAH--CO scaling relations in the wind nearly identical to those in galaxy disks despite the very different conditions. The H$\\alpha$--PAH correlation indicates that H$\\alpha$ traces the surfaces of PAH-bearing clouds, consistent with arising from ionized layers produced by shocks. Meanwhile the PAH--X-ray correlation disappears once distance effects are controlled for past 2~kpc, suggesting that PAHs are decoupled from the hot gas and the global correlation merely reflects the large-scale structure of the outflow. The PAH-to-neutral gas ratio remains nearly flat to 2~kpc, with variations following changes in the radiation field. This implies that the product of PAH abundance and dust-to-gas ratio does not change significantly over the inner portion of the outflow. Together, these results demonstrate that PAHs robustly trace the cold phase of M82's wind, surviving well beyond the starburst and providing a powerful, high-resolution proxy for mapping the life cycle of entrained cold material in galactic outflows.",
      "pdf_url": "https://arxiv.org/pdf/2510.01314.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06408",
      "title": "The rise and fall of Little Red Dots could be driven by the environment",
      "authors": [
        "Rosa M. Mérida",
        "Gaia Gaspar",
        "Yoshihisa Asada",
        "Marcin Sawicki",
        "Kiyoaki Christopher Omori",
        "Chris J. Willott",
        "Nicholas S. Martis",
        "Adam Muzzin",
        "Gaël Noirot",
        "Gregor Rihtaršič",
        "Ghassan T. E. Sarrouh",
        "Roberta Tripodi"
      ],
      "abstract": "The rise and fall of Little Red Dots could be driven by the environment Rosa M. Mérida, Gaia Gaspar, Yoshihisa Asada, Marcin Sawicki, Kiyoaki Christopher Omori, Chris J. Willott, Nicholas S. Martis, Adam Muzzin, Gaël Noirot, Gregor Rihtaršič, Ghassan T. E. Sarrouh, Roberta Tripodi 16 pages, 14 figures, 5 tables. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The Little Red Dot (LRD) paradigm comprises three main unknowns that are intrinsically connected: (1) What is the nature of these sources? (2) How do they form? (3) How do they evolve? Larger spectroscopic samples and high-resolution data are needed to delve deeper into the mechanisms ruling these sources. Understanding their formation and evolution requires identifying the rise and fall of the key features that characterize these systems, such as their compactness and ''V''-shaped spectral energy distributions. In this work, we present a galaxy system nicknamed The Stingray that was identified in the Canadian NIRISS Unbiased Cluster Survey (CANUCS). This group contains three sources at $z_{\\mathrm{spec}} = 5.12$, including an active galactic nucleus (AGN), a Balmer break galaxy, and a star-forming satellite. The latter resembles a Building Block System in which interactions boost stellar mass and black hole mass growth beyond what is expected from secular processes alone. The AGN in this system exhibits features indicative of a transitional object, bridging a normal AGN and an LRD phase. These are a blue rest-frame ultraviolet slope, compact size, and a broad H$\\alpha$ line (all of which are characteristic of LRDs), but a flatter rest-frame optical slope compared to that observed in LRDs. The features in this source point to the emergence or fading of an LRD, potentially triggered by environmental effects.",
      "pdf_url": "https://arxiv.org/pdf/2510.06408.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25844",
      "title": "Figuring Out Gas & Galaxies In Enzo (FOGGIE) XI: Circumgalactic O VI Emission Traces Clumpy Inflowing Recycled Gas",
      "authors": [
        "Cassandra Lochhaas",
        "Molly S. Peeples",
        "Brian W. O'Shea",
        "Jason Tumlinson",
        "Lauren Corlies",
        "Vida Saeedzadeh",
        "Nicolas Lehner",
        "Anna C. Wright",
        "Jessica K. Werk",
        "Cameron W. Trapp",
        "Ramona Augustin",
        "Ayan Acharyya",
        "Britton D. Smith",
        "Carlos J. Vargas"
      ],
      "abstract": "Figuring Out Gas & Galaxies In Enzo (FOGGIE) XI: Circumgalactic O VI Emission Traces Clumpy Inflowing Recycled Gas Cassandra Lochhaas, Molly S. Peeples, Brian W. O'Shea, Jason Tumlinson, Lauren Corlies, Vida Saeedzadeh, Nicolas Lehner, Anna C. Wright, Jessica K. Werk, Cameron W. Trapp, Ramona Augustin, Ayan Acharyya, Britton D. Smith, Carlos J. Vargas 28 pages, 15 figures, accepted by ApJ Astrophysics of Galaxies (astro-ph.GA) The circumgalactic medium (CGM) is host to gas flows into and out of galaxies and regulates galaxy growth, but the multiphase, diffuse gas in this region is challenging to observe. We investigate the properties of gas giving rise to O VI emission from the CGM that upcoming missions, such as the Aspera SmallSat, will be able to map in local galaxies. We use the FOGGIE simulations to predict the O VI emission from edge-on galaxies across the redshift range $z=1\\rightarrow0$. O VI emission is brightest surrounding small, clumpy structures near the galaxy where the gas density is high. Most of the O VI surface brightness originates from collisionally ionized, $T\\sim10^{5.5}$ K, inflowing gas and is not preferentially aligned with the major or minor axis of the galaxy disk. Simulated galaxies with higher halo masses, higher median CGM gas density, and higher star formation rates produce brighter and more widespread O VI emission in their CGM. We show that while O VI emission primarily originates in inflowing gas, turning off outflows in a simulation without star formation feedback eliminates most of the O VI emission. Enrichment from feedback is necessary to mix with the inflowing gas and allow it to glow in O VI. Collectively, our findings point towards a picture where O VI emission traces warm, ionized envelopes of cooler clouds that are accreting onto the galaxy in a metal-enriched galactic fountain. Finally, we show that the detection limit of Aspera is sufficient to detect O VI emission tens of kpc from the galaxy center for $\\sim L^\\star$ galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.25844.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10743",
      "title": "REBELS-IFU: Spatially Resolved Ionizing Photon Production Efficiencies of 12 Bright Galaxies in the Epoch of Reionization",
      "authors": [
        "Lena Komarova",
        "Mauro Stefanon",
        "Andres Laza-Ramos",
        "Hiddo S. Algera",
        "Manuel Aravena",
        "Rychard J. Bouwens",
        "Rebecca Bowler",
        "Elisabete da Cunha",
        "Pratika Dayal",
        "Andrea Ferrara",
        "Rebecca Fisher",
        "Themiya Nanayakkara",
        "Lucie E. Rowland",
        "Sander Schouws",
        "Renske Smit",
        "Laura Sommovigo",
        "Daniel P. Stark",
        "Paul van der Werf"
      ],
      "abstract": "REBELS-IFU: Spatially Resolved Ionizing Photon Production Efficiencies of 12 Bright Galaxies in the Epoch of Reionization Lena Komarova, Mauro Stefanon, Andres Laza-Ramos, Hiddo S. Algera, Manuel Aravena, Rychard J. Bouwens, Rebecca Bowler, Elisabete da Cunha, Pratika Dayal, Andrea Ferrara, Rebecca Fisher, Themiya Nanayakkara, Lucie E. Rowland, Sander Schouws, Renske Smit, Laura Sommovigo, Daniel P. Stark, Paul van der Werf 20 pages, 8 figures. Submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Measuring the ionizing photon production efficiency $\\xi_{\\mathrm{ion,0}}$ -- the ratio of ionizing photon output rate $Q_{\\rm H^0}$ to UV continuum luminosity $L_{\\rm UV}$ -- in galaxies at $z > 6$ is crucial for constraining their contribution to cosmic reionization. We present integrated and spatially resolved measurements of $\\xi_{\\mathrm{ion,0}}$ for 12 exceptionally bright ($M_\\mathrm{UV} \\sim -22$ mag) star-forming galaxies at $z \\sim 7$ from the REBELS survey. These measurements are based on JWST NIRSpec/IFU PRISM spectroscopy, probing the rest-frame UV and optical regime. Notably, in 8 of the 12 galaxies, the spectral coverage includes H$\\alpha$, enabling self-consistent dust attenuation estimates in both the ionized gas and stellar continuum via the Balmer decrement and rest-UV slope, respectively. We find global $\\log\\xi_{\\mathrm{ion,0}}$ values ranging from $25.19\\pm0.11$ to $25.61\\pm0.11$, with a weighted mean of $25.44\\pm0.15$, consistent with the canonical value of $\\sim25.3$. Using a sample of 25 star-forming clumps within these galaxies, we explore local variations in LyC production efficiency, finding a broader range, from $24.52\\pm0.21$ to $26.18\\pm0.61$. We identify strong correlations between $\\xi_{\\mathrm{ion,0}}$ and specific star formation rate, star formation surface density, H$\\beta$ equivalent width, and stellar mass. Clumps with the highest $\\xi_{\\mathrm{ion,0}}$ exhibit $\\mathrm{EW}_0(\\mathrm{H}\\beta) \\ge 150$ Angstrom, consistent with young stellar ages. From previous Ly$\\alpha$ measurements in three galaxies, we estimate a typical Ly$\\alpha$ escape fraction of $f_{\\rm esc, Ly\\alpha} \\sim 2\\%$, suggesting similar or lower escape fractions for LyC photons. Combining this with our H$\\alpha$ measurements, we infer ionized bubble sizes $\\sim 1$ pMpc, aligned with expectations from Ly$\\alpha$-detected systems and reionization models.",
      "pdf_url": "https://arxiv.org/pdf/2511.10743.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.02997",
      "title": "MIRI spectrophotometry of GN-z11: Detection and nature of an optical red continuum component",
      "authors": [
        "A. Crespo Gómez",
        "L. Colina",
        "P. G. Pérez-González",
        "J. Álvarez-Márquez",
        "M. García-Marín",
        "A. Alonso-Herrero",
        "M. Annunziatella",
        "A. Bik",
        "S. Bosman",
        "A. J. Bunker",
        "A. Labiano",
        "D. Langeroodi",
        "P. Rinaldi",
        "G. Östlin",
        "L. Boogaard",
        "S. Gillman",
        "G. Barro",
        "S. L. Finkelstein",
        "G. C. K. Leung"
      ],
      "abstract": "MIRI spectrophotometry of GN-z11: Detection and nature of an optical red continuum component A. Crespo Gómez, L. Colina, P. G. Pérez-González, J. Álvarez-Márquez, M. García-Marín, A. Alonso-Herrero, M. Annunziatella, A. Bik, S. Bosman, A. J. Bunker, A. Labiano, D. Langeroodi, P. Rinaldi, G. Östlin, L. Boogaard, S. Gillman, G. Barro, S. L. Finkelstein, G. C. K. Leung Astrophysics of Galaxies (astro-ph.GA) We present new MIRI F560W, F770W and F1000W imaging of GN-z11, extending the previous rest-frame coverage from 0.38 to 0.86$\\mu$m. We report significant detections (14$\\sigma$) in the F560W and F770W images, and a marginal detection (3.2$\\sigma$) in F1000W. Here, we analyse its SED combining new MIRI imaging data with archival NIRSpec/Prism and MRS spectroscopy, and NIRCam imaging. The continuum emission shows a flat energy distribution, in f$_\\nu$, up to 0.5$\\mu$m, compatible with the presence of a mixed stellar population of young (4$\\pm$1 Myr) and mature (63$\\pm$23 Myr) stars that also account for the [O III], H$\\beta$ and H$\\alpha$ emission lines. The continuum at rest-frame 0.66$\\mu$m shows a 36$\\pm$3% flux excess above the predicted flux for a mixed stellar population, pointing to the presence of an additional source contributing at these wavelengths. This excess increases to 91$\\pm$28% at rest-frame 0.86$\\mu$m, although with a large uncertainty due to the marginal detection in the F1000W filter. We consider that hot dust emission in the dusty torus around a type 2 AGN could be responsible for the observed excess. Alternatively, this excess could be due to hot dust emission or to a photoluminiscence dust process (Extended Red Emission, ERE) under the extreme UV radiation field, as observed in some local metal-poor galaxies and in young compact starbursts. The presence of a type 1 AGN is not supported by the observed SED since high-z QSOs contribute at wavelengths above rest-frame 1$\\mu$m, and an additional ad-hoc red source would be required to explain the observed flux excess at 0.66 and 0.86$\\mu$m. Additional deep MIRI imaging covering the rest-frame near-IR are needed to confirm the flux detection at 10$\\mu$m with higher significance, and to discriminate between the different hot dust emission in the extreme starburst and AGN scenarios with MIRI imaging at longer wavelengths.",
      "pdf_url": "https://arxiv.org/pdf/2512.02997.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.06075",
      "title": "A Galactic Transformation -- Understanding the SMC's Structural and Kinematic Disequilibrium",
      "authors": [
        "Himansh Rathore",
        "Gurtina Besla",
        "Roeland P. van der Marel",
        "Nitya Kallivayalil"
      ],
      "abstract": "A Galactic Transformation -- Understanding the SMC's Structural and Kinematic Disequilibrium Himansh Rathore (U. Arizona), Gurtina Besla (U. Arizona), Roeland P. van der Marel (STSci), Nitya Kallivayalil (U. Virginia) 30 pages, 15 figures, accepted to ApJ, updated to the accepted version Astrophysics of Galaxies (astro-ph.GA) The SMC is in disequilibrium. Gas line-of-sight (LoS) velocity maps show a gradient of $60-100$ km s$^{-1}$, generally interpreted as a rotating gas disk consistent with the Tully-Fisher relation. Yet, the stars don't show rotation. Despite a small on-sky extent ($\\sim4$ kpc), the SMC exhibits a large ($\\sim10$ kpc) LoS depth, and the stellar photometric center is offset from the HI kinematic center by $\\sim$1 kpc. With N-body hydrodynamical simulations, we show that a recent ($\\sim$100 Myr ago) SMC-LMC collision (impact parameter $\\sim2$ kpc) explains the observed SMC's internal structure and kinematics. The simulated SMC is initialized with rotating stellar and gaseous disks. Post-collision, the SMC's tidal tail accounts for the large LoS depth. The SMC's stellar kinematics become dispersion dominated ($v/\\sigma\\approx0.2$), with radially outward motions at $R>2$ kpc, and a small ($<10$ km s$^{-1}$) remnant rotation at $R<2$ kpc, consistent with observations. Post-collision gas kinematics are also dominated by radially outward motions, without remnant rotation. Hence, the observed SMC's gas LoS velocity gradient is due to radial motions as opposed to disk rotation. Ram pressure from the LMC's gas disk during the collision imparts $\\approx30$ km s$^{-1}$ kick to the SMC's gas, sufficient to destroy gas rotation and offset the SMC's stellar and gas centers. Our work highlights the critical role of group processing through galaxy collisions in driving dIrr to dE/dSph transformation, including the removal of gas. Consequently, frameworks that treat the SMC as a galaxy in transformation are required to effectively use its observational data to constrain interstellar medium and dark matter physics.",
      "pdf_url": "https://arxiv.org/pdf/2512.06075.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.08693",
      "title": "Stellar masses of optically dark galaxies: uncertainty introduced by the attenuation law and star-formation histories",
      "authors": [
        "Yash Lapasia",
        "Sandro Tacchella",
        "Francesco D'Eugenio",
        "Dávid Puskás",
        "Andrew J. Bunker",
        "A. Lola Danhaive",
        "Benjamin D. Johnson",
        "Roberto Maiolino",
        "Brant Robertson",
        "Charlotte Simmonds",
        "Irene Shivaei",
        "Christina C. Williams",
        "Christopher Willmer",
        "Mengyuan Xiao"
      ],
      "abstract": "Stellar masses of optically dark galaxies: uncertainty introduced by the attenuation law and star-formation histories Yash Lapasia, Sandro Tacchella, Francesco D'Eugenio, Dávid Puskás, Andrew J. Bunker, A. Lola Danhaive, Benjamin D. Johnson, Roberto Maiolino, Brant Robertson, Charlotte Simmonds, Irene Shivaei, Christina C. Williams, Christopher Willmer, Mengyuan Xiao 13 pages, 8 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) JWST observations have suggested that some high-redshift galaxies may be ultra-massive, thereby challenging standard models of early galaxy formation and cosmology. We analyse the stellar masses using different modelling assumptions and with new data of three galaxies (S1, S2 and S3), whose NIRCam/grism redshifts were consistent with $z>5$. These three optically dark galaxies have previously been reported to host exceptionally high stellar masses and star-formation rates, implying extremely high star-formation efficiencies. Recent NIRSpec/IFU observations for S1 indicate a spectroscopic redshift of $z_{\\rm spec}=3.2439\\pm0.0002$, which is lower than previously reported. Using the Bayesian spectral energy distribution (SED) modelling tool \\texttt{Prospector}, we investigate the impact of key model assumptions on stellar mass estimates, such as the choice of star-formation history (SFH) priors (constant versus rising SFH base for the non-parametric prior), the dust attenuation law, and the treatment of emission line fluxes. Our analysis yields revised stellar masses of $\\log(M_{\\star}/M_{\\odot}) \\approx 10.36^{+0.47}_{-0.32}, 10.95^{+0.11}_{-0.10}$ and $10.31^{+0.24}_{-0.19}$ for S1, S2, and S3, respectively. We find that adopting a rising SFH base prior results in lower inferred stellar masses compared to a constant SFH base prior. We identify a significant degeneracy between the dust attenuation curve slope, the amount of dust attenuation, and stellar mass. Our results highlight various systematics in SED modelling due to SFH priors and dust attenuation that can influence stellar mass estimates of heavily dust obscured sources. Nevertheless, even with these revised stellar mass estimates, two of the three galaxies remain among the most massive and actively star-forming systems at their respective redshifts, implying high star-formation efficiencies.",
      "pdf_url": "https://arxiv.org/pdf/2601.08693.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09658",
      "title": "EMU Radio Observations of Barred Spiral Galaxy NGC 5938 (Araish)",
      "authors": [
        "H. Zakir",
        "M.D. Filipović",
        "L. Barnes",
        "R. Z. E. Alsaberi",
        "T. An",
        "K. Dage",
        "S. W. Duchesne",
        "A. M. Hopkins",
        "A. Kapinska",
        "B. Koribalski",
        "S. Lazarević",
        "D. Leahy",
        "Z. Liu",
        "R. P. Norris",
        "A. Rau",
        "Z.J. Smeaton",
        "T. Jarrett"
      ],
      "abstract": "EMU Radio Observations of Barred Spiral Galaxy NGC 5938 (Araish) H. Zakir, M.D. Filipović, L. Barnes, R. Z. E. Alsaberi, T. An, K. Dage, S. W. Duchesne, A. M. Hopkins, A. Kapinska, B. Koribalski, S. Lazarević, D. Leahy, Z. Liu, R. P. Norris, A. Rau, Z.J. Smeaton, T. Jarrett This Paper has been accepted for publication in PASA. It contains 12 Pages, 7 figures, and 2 Tables Astrophysics of Galaxies (astro-ph.GA) We present multi-wavelength observations of the nearby spiral galaxy NGC 5938 (Araish) to investigate the origin of its radio emission, specifically the contribution from active galactic nucleus (AGN) activity and star formation. Using Evolutionary Map of the Universe (EMU) data, we detect extended radio emission extending outwards to the galactic axis, with a steep non-thermal spectral index ($\\alpha = -1.2 \\pm 0.2$) indicative of synchrotron radiation from an AGN jet. The jet has a physical extent of $\\approx 8.2\\,kpc$ (angular length of $64^{\\prime\\prime}$). Multi-wavelength data from The Dark Energy Camera Plane Survey 2 (DECaPS2), Wide-field Infrared Survey Explorer (WISE), and extended Roentgen Survey with an Imaging Telescope Array (eROSITA) provide further support for this interpretation. The colour-colour diagram presenting WISE infrared observations suggests the presence of dust and young stars that trace the galaxy's disk structure. Our analysis reveals a radio jet, alongside star formation traced by infrared emission, demonstrating the complex interplay of AGN activity and star formation in this well-resolved galaxy. Intriguingly, the spatial relationship reveals the brighter X-ray emission to be largely adjacent to and enveloping the extended radio emission. This suggests that the radio jet, while extending at a significant angle to the galactic disk, is confined by the larger X-ray gas halo, similar to other systems (i.e., ESO 295-IG022, Centaurus A) and may indicate jet collimation and channelling effects.",
      "pdf_url": "https://arxiv.org/pdf/2602.09658.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09837",
      "title": "Investigating the Nested Structure of the Outflow from the Low Luminosity Protostar IRAS 16253-2429 using JWST and ALMA",
      "authors": [
        "Mayank Narang",
        "Himanshu Tyagi",
        "Nagayoshi Ohashi",
        "P. Manoj",
        "S. Thomas Megeath",
        "John J. Tobin",
        "Ewine F. van Dishoeck",
        "Neal J. Evans II",
        "Dan M. Watson",
        "Alessio Caratti o Garatti",
        "Jes K. Jørgensen",
        "Robert Gutermuth",
        "Yusuke Aso",
        "Henrik Beuther",
        "Leslie W. Looney",
        "David A. Neufeld",
        "Guillem Anglada",
        "Mayra Osorio",
        "Adam E. Rubinstein",
        "Samuel Federman",
        "Lee W. Hartmann",
        "Pooneh Nazari",
        "Nicole Karnath",
        "Hendrik Linz",
        "Thomas Stanke",
        "Tyler L. Bourke",
        "Yao-Lun Yang",
        "Rolf Kuiper",
        "Joel Green",
        "Pamela Klaassen",
        "Wafa Zakri",
        "Nolan Habel",
        "Nashanty Brunken",
        "James Muzerolle",
        "Katerina Slavicinska",
        "Amelia M. Stutz",
        "Lukasz Tychoniec",
        "Scott Wolk",
        "Will R. M. Rocha",
        "William J. Fischer"
      ],
      "abstract": "Investigating the Nested Structure of the Outflow from the Low Luminosity Protostar IRAS 16253-2429 using JWST and ALMA Mayank Narang, Himanshu Tyagi, Nagayoshi Ohashi, P. Manoj, S. Thomas Megeath, John J. Tobin, Ewine F. van Dishoeck, Neal J. Evans II, Dan M. Watson, Alessio Caratti o Garatti, Jes K. Jørgensen, Robert Gutermuth, Yusuke Aso, Henrik Beuther, Leslie W. Looney, David A. Neufeld, Guillem Anglada, Mayra Osorio, Adam E. Rubinstein, Samuel Federman, Lee W. Hartmann, Pooneh Nazari, Nicole Karnath, Hendrik Linz, Thomas Stanke, Tyler L. Bourke, Yao-Lun Yang, Rolf Kuiper, Joel Green, Pamela Klaassen, Wafa Zakri, Nolan Habel, Nashanty Brunken, James Muzerolle, Katerina Slavicinska, Amelia M. Stutz, Lukasz Tychoniec, Scott Wolk, Will R. M. Rocha, William J. Fischer 22 pages, 14 figures, in press at AAS Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Understanding the earliest stage of star and planet formation requires detailed observations to address the connection and interplay between the accretion, outflow and disk evolution. We present results from the observations of the low luminosity ($L_\\mathrm{bol}\\sim~0.2~L_\\odot$) and mass (M$_*\\sim$\\,0.15~M$_\\odot$) Class~0 protostar IRAS 16253$-$2429, conducted as part of the \\textit{eDisk} ALMA large program and the JWST cycle-1 GO program \\textit{IPA}. Observations reveal a wide hourglass-shaped continuum cavity traced in scattered light (at $\\leq$~5~$\\mu$m), with a brighter, extended northern side. We detect 15 pure rotational H$_2$ transitions (E$_\\mathrm{up}$:~1015--21411~K), revealing a wide-angle molecular outflow. {The outflow width (as traced in H$_2$~0-0~S(11)) at the protostellar location measures $\\leq$35 au, slightly larger than the dust and Keplerian disk diameters ($\\sim$30 au) but wider than the 20--23~au jet width in [Fe II].} {The opening angle narrows from 40--35\\arcdeg{} for the low-J H$_2$ lines (up to S(5)) and the cold gas component (ALMA $^{12}$CO) to $\\sim$28--19\\arcdeg{} for the high-J H$_2$ lines (S(7)--S(11)).} Position-velocity diagrams of H$_2$ reveal higher velocities for higher E$_{up}$, ranging from ~12.5 km~s$^{-1}$ for H$_2$~0-0~S(1) and S(2) to ~28.5 km~s$^{-1}$ for H$_2$~0-0~S(5)~and~S(7) with respect to the mean flow velocity. The nested excitation and velocity structure of the collimated jet and wide angle wind suggest a magnetohydrodynamic wind as a likely launching mechanism, similar to the findings in other protostars and Class II sources. The lower velocity mm CO may be gas from the infalling envelope accelerated outwards by the wide angle wind along the cavity walls.",
      "pdf_url": "https://arxiv.org/pdf/2602.09837.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10243",
      "title": "Linking Solar Magnetism, Extreme Solar Particle Events and Stellar Superflares",
      "authors": [
        "Valeriy Vasilyev",
        "Natalie Krivova",
        "Ilya Usoskin"
      ],
      "abstract": "Linking Solar Magnetism, Extreme Solar Particle Events and Stellar Superflares Valeriy Vasilyev, Natalie Krivova, Ilya Usoskin accepted for publication in Philosophical Transactions A Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) The magnetic field of the Sun drives a wide range of eruptive phenomena, from small-scale nanoflares to large flares and coronal mass ejections (CMEs). While direct observations of solar activity cover only the past few decades, indirect evidence indicates that the Sun can occasionally produce events orders of magnitude stronger than any recorded ones in the modern era. Two complementary lines of evidence exist. First, extreme solar particle events (ESPEs) have been inferred from prominent spikes in cosmogenic isotope concentrations preserved in precisely dated natural archives such as tree rings and ice cores over the past 15 millennia. Second, high-precision space-borne photometry has revealed superflares on thousands of stars similar to the Sun. Whether these solar and stellar extremes are physically related remains an open question. We summarise the present state of understanding and discuss physical mechanisms that may link them. Although superflares and ESPEs are both extremely energetic manifestations of magnetic energy storage and release, their relationship does not appear to be one-to-one. Their occurrence and energetics likely depend on how magnetic flux and topology govern the partitioning of released energy between radiation, mass ejection, and particle acceleration.",
      "pdf_url": "https://arxiv.org/pdf/2602.10243.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10275",
      "title": "Solar Wind Heating Near the Sun: A Radial Evolution Approach",
      "authors": [
        "Yogesh",
        "Leon Ofman",
        "Kristopher Klein",
        "Niranjana Shankarappa",
        "Mihailo M. Martinović",
        "Gregory G. Howes",
        "Parisa Mostafavi",
        "Scott A Boardsen",
        "Viacheslav M Sadykov",
        "Sanchita Pal",
        "Lan K Jian",
        "Aakash Gupta",
        "D. Chakrabarty",
        "B. L. Alterman",
        "Jaye L Verniero",
        "K. W. Paulson",
        "Jia Huang",
        "Roberto Livi",
        "Davin E. Larson",
        "Christian Möstl",
        "Emma E. Davies",
        "Eva Weiler"
      ],
      "abstract": "Solar Wind Heating Near the Sun: A Radial Evolution Approach Yogesh, Leon Ofman, Kristopher Klein, Niranjana Shankarappa, Mihailo M. Martinović, Gregory G. Howes, Parisa Mostafavi, Scott A Boardsen, Viacheslav M Sadykov, Sanchita Pal, Lan K Jian, Aakash Gupta, D. Chakrabarty, B. L. Alterman, Jaye L Verniero, K. W. Paulson, Jia Huang, Roberto Livi, Davin E. Larson, Christian Möstl, Emma E. Davies, Eva Weiler 15 pages, 8 figures, accepted for publication in The Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Characterizing the plasma state in the near-Sun environment is essential to constrain the mechanisms that heat and accelerate the solar wind. In this study, we use Parker Solar Probe (PSP) observations from Encounters 1 through 24 to investigate the radial evolution of solar wind plasma and magnetic field properties in this region. Using intervals with high field-of-view ($>85\\%$) coverage, we derive the radial profiles of magnetic field strength ($|B|$), proton density ($N$), bulk speed ($V$), total proton temperature ($T$), parallel ($T_\\parallel$) and perpendicular ($T_\\perp$) temperatures, temperature anisotropy ($T_\\perp/T_\\parallel$), plasma beta ($\\beta$), Alfvén Mach number ($M_A$), and magnetic field fluctuations ($\\delta B/B$) for sub and super-Alfvénic regions. In super-Alfvénic regions, power-law of $|B|$, $N$, $V$, and $T$ as a function of heliocentric distance are broadly consistent with previous \\textit{Helios} results at $>0.3$ AU. The radial evolution of the components of the temperature tensor reveals distinct behavior: $T_\\perp$ decreases monotonically with distance, whereas $T_\\parallel$ exhibits a non-monotonic trend -- decreasing in the sub-Alfvénic region, increasing just beyond the Alfvén surface. We interpret the increase in $T_\\parallel$ as a proxy for proton beam occurrence. We further examine the evolution of magnetic field fluctuations, finding decreasing radial/parallel fluctuations but enhanced tangential/normal/perpendicular fluctuations in sunward direction. These fluctuations may provide free energy for beam generation and particle heating via wave-particle interactions.",
      "pdf_url": "https://arxiv.org/pdf/2602.10275.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10333",
      "title": "Searching for radio emission from stellar wind-magnetosphere interaction or co-rotation breakdown in brown dwarfs",
      "authors": [
        "Rebeca Pirvu Malanda",
        "Simranpreet Kaur",
        "Daniele Viganò",
        "Òscar Morata",
        "Josep Miquel Girart",
        "Álvaro Sánchez Monge",
        "Devojyoti Kansabanik",
        "Mario Damasso",
        "Mayank Narang",
        "Gemma Busquet",
        "Juan Carlos Morales",
        "Fabio Del Sordo",
        "Kaustubh Hakim",
        "Manoj Purvankara"
      ],
      "abstract": "Searching for radio emission from stellar wind-magnetosphere interaction or co-rotation breakdown in brown dwarfs Rebeca Pirvu Malanda, Simranpreet Kaur, Daniele Viganò, Òscar Morata, Josep Miquel Girart, Álvaro Sánchez Monge, Devojyoti Kansabanik, Mario Damasso, Mayank Narang, Gemma Busquet, Juan Carlos Morales, Fabio Del Sordo, Kaustubh Hakim, Manoj Purvankara Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) With the improvements in radio interferometry sensitivity, the quest for coherent radio emission from exoplanets and ultra-cool dwarfs, which is indicative of their magnetic fields, has gained significant momentum in recent years. We investigated the relatively unexplored possibility of radio emission from wide-orbit brown dwarf companions, which may radiate through rapid rotation, as in isolated ultra-cool dwarfs, or via interactions between their extended magnetospheres and the host star's wind. We analysed $\\sim 60$ hours of Upgraded Giant Metrewave Radio Telescope and Karl G. Jansky Very Large Array data for a set of well-characterized systems previously unobserved at 0.3-2 GHz. The targets include companions orbiting the G-type stars HD 26161 and BD-004475, the K-type HD 153557A and $\\nu$ Oph, and the M dwarfs GJ 3626 and 2MJ01225093-2439505. No detections were obtained with 3$\\sigma$ upper limits down to $\\sim 25\\,\\mu$Jy/beam in Stokes V in the best cases. The light-curve analysis also revealed no evidence of short ($\\gtrsim$ minutes), intense ($\\gtrsim$ mJy) radio bursts. The upper limits provide tentative constraints on model parameters. However, the effects of model uncertainties, limited observational coverage, and intrinsic variability or beaming of the emission must be considered. The improvement in sensitivity of the next-generation radio interferometers will likely allow to go below the expected flux range over a much larger range of free parameters.",
      "pdf_url": "https://arxiv.org/pdf/2602.10333.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10477",
      "title": "Data-driven Magnetohydrodynamic Simulation of the Initiation of a Coronal Mass Ejection with Multiple Stages",
      "authors": [
        "J. H. Guo",
        "S. Poedts",
        "B. Schmieder",
        "Y. Guo",
        "C. Zhou",
        "H. Wu",
        "Z. Zhong",
        "Y. H. Zhou",
        "S. H. Li",
        "P. F. Chen"
      ],
      "abstract": "Data-driven Magnetohydrodynamic Simulation of the Initiation of a Coronal Mass Ejection with Multiple Stages J. H. Guo, S. Poedts, B. Schmieder, Y. Guo, C. Zhou, H. Wu, Z. Zhong, Y. H. Zhou, S. H. Li, P. F. Chen Accepted for publication in A&A Letter Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Coronal mass ejections (CMEs) are the primary drivers of adverse space-weather events, yet their initiation and onset prediction remain insufficiently understood due to the complexity of the magnetic topology and physical processes in real solar source regions. Here, based on fully observational-data-driven magnetohydrodynamic simulation, we successfully reproduce the initiation of a CME originating from the super active region AR 13663, with only a one-minute time lag between the flare peak in observations and the velocity peak of the rising flux rope in the simulation. Moreover, the eruptive structure exhibits a multi-stage kinematic evolution: an initial slow acceleration, a plateau at a nearly stationary height, and a subsequent impulsive acceleration. These stages correspond to torus instability, the downward tension force exerted by the overlying toroidal field, and fast magnetic reconnection, respectively. Our results highlight the inherently multistage nature of CME initiation in real events. In configurations with strong overlying toroidal fields, the downward toroidal-field-induced tension force can suppress the rise of the flux rope and produce a plateau phase at a nearly stable height, even when torus instability occurs. In contrast, the subsequent fast magnetic reconnection beneath the flux rope can drive the impulsive eruption more effectively. The close agreement between the observed and simulated peak times over one minute demonstrates the strong potential of our data-driven model for predicting CME onset.",
      "pdf_url": "https://arxiv.org/pdf/2602.10477.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10846",
      "title": "Chemistry in the High expansion-velocity C-rich evolved star AFGL2233. Isotopic ratios, peculiarities and evolutionary status",
      "authors": [
        "G. Quintana-Lacaci",
        "M. Agúndez",
        "L. Velilla-Prieto",
        "J. Alcolea",
        "A. Castro-Carrizo",
        "J.P. Fonfría",
        "J. Cernicharo"
      ],
      "abstract": "Chemistry in the High expansion-velocity C-rich evolved star AFGL2233. Isotopic ratios, peculiarities and evolutionary status G. Quintana-Lacaci, M. Agúndez, L. Velilla-Prieto, J. Alcolea, A. Castro-Carrizo, J.P. Fonfría, J. Cernicharo 37pgs, 12 images (main text), 3 appendix B, 8 appendix C, 2 appendix D Solar and Stellar Astrophysics (astro-ph.SR) High expansion velocity carbon stars (HVCs) are a rare class of evolved stars whose circumstellar envelopes (CSEs) combine C-rich chemistry with unusually high expansion velocities typical of O-rich massive evolved stars. AFGL2233 has been proposed as a high-mass evolved object that exhausted hot-bottom burning. Studying its chemistry is essential to understand the nature and evolution of these objects. We characterize the chemical composition and isotopic ratios of the CSE of AFGL2233 and investigate chemical peculiarities, including the presence of N- and O-bearing species in a C-rich environment. We carried out a complete line survey at 3 mm and 1 mm using the IRAM 30m telescope, complemented by Herschel/HIFI FIR observations and interferometric maps of SiO, C2H, and HCN. Molecular emission was analyzed using rotational diagrams and radiative transfer modeling under the LVG approximation. Column densities and fractional abundances were derived for more than 30 molecular species, including isotopologues, and compared with other evolved stars. The Gaia DR3 distance of 1.236 kpc implies a luminosity of ~2 Lsun, consistent with an initial mass of 4.5-9 Msun. The molecular inventory confirms C-rich chemistry but reveals unusually high abundances of NH3, H2O, and SiN. The isotopic ratios vary among species, with 12C/13C ranging from 7 to 55. The C2H/C4H ratio is abnormally high compared with C-rich AGB stars. The presence of SiN and high NH3 may indicate N-enrichment or the influence of a companion. AFGL2233 is likely a high-mass AGB or super-AGB star with a complex evolutionary history involving nucleosynthesis, shocks, and possible binary interaction.",
      "pdf_url": "https://arxiv.org/pdf/2602.10846.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10902",
      "title": "Reevaluating thermal instability in a uniform plasma: an extended analysis of instability domains",
      "authors": [
        "Varsha Felsy , Jaume Terradas , Ramon Oliver , Amanda Stricklan , Timothy Waters , James A. Klimchuk Departament de Física, Universitat de les Illes Balears, Institute of Applied Computing &amp; Community Code , Universitat de les Illes Balears, X-Computational Physics Division, Los Alamos National Laboratory, Department of Astronomy, New Mexico State University, Center for Theoretical Astrophysics, Los Alamos National Laboratory, NASA Goddard Space Flight Center, Heliophysics Science Division)"
      ],
      "abstract": "Reevaluating thermal instability in a uniform plasma: an extended analysis of instability domains Varsha Felsy (1 and 2), Jaume Terradas (1 and 2), Ramon Oliver (1 and 2), Amanda Stricklan (3 and 4), Timothy Waters (3 and 5), James A. Klimchuk (6) ((1) Departament de Física, Universitat de les Illes Balears, (2) Institute of Applied Computing &amp; Community Code (IAC3), Universitat de les Illes Balears, (3) X-Computational Physics Division, Los Alamos National Laboratory, (4) Department of Astronomy, New Mexico State University, (5) Center for Theoretical Astrophysics, Los Alamos National Laboratory, (6) NASA Goddard Space Flight Center, Heliophysics Science Division) 17 pages, 11 figures, submitted to A&A on 11/02/2026, movie available on request(this http URL@uib.es) Solar and Stellar Astrophysics (astro-ph.SR) Thermal instability plays a crucial role in the dynamics of astrophysical plasmas. Building upon the foundational work of Field (1965) and the subsequent analysis by Waters and Proga (2019), this study revisits the characteristics of thermal instability in a uniform, non-magnetic medium. Our primary aim is to reevaluate and expand the understanding of instability domains, focusing on the classification and characteristics of thermal and acoustic modes in the presence of heating, radiative cooling, and thermal conduction. Except for Spitzers expression for parallel thermal conductivity, the heating and cooling processes are unspecified. Additionally, we investigate the existence of isobaric and isochoric thermal modes across the extreme limits of very short and very long wavelengths, as well as at intermediate wavelengths. We perform an in-depth analysis of the dispersion relation for an infinite, uniform hydrodynamic medium, as initially derived by Field (1965). This approach enables the generation of growth-rate and dispersion diagrams, providing insight into the behaviour of thermal instability across different wavelength ranges. With the inclusion of thermal conduction, our study refines the classification of the seven instability regions previously outlined by Waters and Proga (2019). Our findings confirm that their classification holds when the Field length is smaller than or comparable to the thermal wavelength. For larger Field lengths, a simplified classification becomes impractical. Furthermore, we discuss the potential implications of the catastrophic cooling instability (Waters and Stricklan 2025) in the context of cool coronal rain formation. Our work not only validates certain classifications, but also proposes new insights into complex instability behaviours, thereby enhancing the theoretical framework established by Field and others.",
      "pdf_url": "https://arxiv.org/pdf/2602.10902.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10945",
      "title": "A search for new symbiotic stars in the Milky Way: Using machine learning techniques applied to photometric databases",
      "authors": [
        "V. Contreras Rojas",
        "M. Jaque Arancibia",
        "C.E. Ferreira Lopes",
        "N. Monsalves",
        "R. Angeloni",
        "G. J. M. Luna",
        "V. Marels",
        "D. Concha",
        "N. E. Nunez",
        "C. Saffe",
        "M. Flores"
      ],
      "abstract": "A search for new symbiotic stars in the Milky Way: Using machine learning techniques applied to photometric databases V. Contreras Rojas, M. Jaque Arancibia, C.E. Ferreira Lopes, N. Monsalves, R. Angeloni, G. J. M. Luna, V. Marels, D. Concha, N. E. Nunez, C. Saffe, M. Flores Solar and Stellar Astrophysics (astro-ph.SR) Symbiotic stars (SySts) are interacting binaries composed of a red giant transferring material to a hot compact star, typically a white dwarf. Although only about 300 systems are confirmed, the Galactic population is estimated at 1.2 x 10^3 - 1.5 x 10^4, indicating that most remain undiscovered. We identify new SySts using a machine-learning approach that combines Gaia DR3, 2MASS, and WISE photometry, parallaxes, and the pseudo-equivalent width of H alpha. A Random Forest model was trained on 166 confirmed S-type SySts and 1600 non-symbiotic stars, applying SMOTE to mitigate class imbalance. The model achieved an F1-score of 89% for the symbiotic class. Applied to 2.5 x 10^6 color-selected sources, it identified 990 candidates with probabilities more than 70%. We further refined the sample using physically motivated cuts on effective temperature, surface gravity, metallicity, and SkyMapper photometry, yielding 12 high-confidence candidates. These objects show cool temperatures, low surface gravities, near-solar metallicity, H alpha emission, moderate-to-high luminosities, and UV excess consistent with S-type SySts. Validation on recently confirmed systems recovered 92.3%, demonstrating the robustness and generalizability of our method.",
      "pdf_url": "https://arxiv.org/pdf/2602.10945.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10170",
      "title": "Observing solar vortices with existing and future instrumentation. Solar Physics International Network for Swirls (SPINS) white paper (Helio)",
      "authors": [
        "Suzana S.A. Silva",
        "Viktor Fedun",
        "Gary Verth",
        "Istvan Ballai",
        "Eamon Scullion",
        "Malcolm Druett",
        "Kostas Tziotziou",
        "Alex Pietrow",
        "Nitin Yadav",
        "Ioannis Dakanalis",
        "Elena Khomenko",
        "Hidetaka Kuniyoshi",
        "Shivdev Turkay",
        "Matias Koll Pistarini",
        "Robertus Erdelyi",
        "Luiz Augusto Camargo Aranha Schiavo"
      ],
      "abstract": "Observing solar vortices with existing and future instrumentation. Solar Physics International Network for Swirls (SPINS) white paper (Helio) Suzana S.A. Silva, Viktor Fedun, Gary Verth, Istvan Ballai, Eamon Scullion, Malcolm Druett, Kostas Tziotziou, Alex Pietrow, Nitin Yadav, Ioannis Dakanalis, Elena Khomenko, Hidetaka Kuniyoshi, Shivdev Turkay, Matias Koll Pistarini, Robertus Erdelyi, Luiz Augusto Camargo Aranha Schiavo White paper submitted to UK Space Frontiers 2035 on 28 November 2025. A full list of signatories is appended at the end Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Solar vortices are fundamental components of solar atmospheric dynamics, serving as natural laboratories for magnetic field twisting, energy concentration and transport, wave guidance, and plasma coupling across atmospheric layers. Numerical and observational studies show that solar vortices are intimately connected to key physical processes including magnetic reconnection, atmospheric heating, turbulence, and wave generation. This white paper, prepared for the UK Space Frontiers 2035 call, outline five high-priority scientific questions addressing vortex generation mechanisms, cross-layer coupling, magnetic restructuring, collective wave-guidance structures, and their role in triggering explosive events and modulating the solar wind. Key observations and capabilities required to make significant advancements over the coming decade are identified. The UK solar physics community has established world-leading expertise in vortex dynamics, combining strengths in high-resolution observations, MHD turbulence theory, numerical modelling, and space instrumentation. UK researchers have made foundational contributions to Solar Orbiter, delivered critical systems for DKIST, and maintain active involvement in MUSE and SOLAR-C EUVST missions. Our technical approach centres on developing next-generation instrumentation: a multi-band, space-qualified system employing four tunable Fabry-Pérot Interferometers providing diffraction-limited, high-cadence spectropolarimetric coverage from the deep photosphere to the low corona. This capability will be validated through a staged mission architecture beginning with balloon-borne demonstrators. Continuing this effort over the coming decade is vital to maintain UK leadership in this field and achieve the goals of roadmap for solar system research.",
      "pdf_url": "https://arxiv.org/pdf/2602.10170.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10198",
      "title": "Keck Observations in the INfrared of Taurus and $ρ$ Oph Exoplanets And Ultracool dwarfs (KOINTREAU) II: Two Young Bound Companions to Ophiuchus Stars",
      "authors": [
        "Samuel Walker",
        "Michael C. Liu",
        "Dimitri Mawet",
        "Mark W. Phillips",
        "Aniket Sanghi",
        "Bin B. Ren",
        "Taichi Uyama"
      ],
      "abstract": "Keck Observations in the INfrared of Taurus and $ρ$ Oph Exoplanets And Ultracool dwarfs (KOINTREAU) II: Two Young Bound Companions to Ophiuchus Stars Samuel Walker, Michael C. Liu, Dimitri Mawet, Mark W. Phillips, Aniket Sanghi, Bin B. Ren, Taichi Uyama Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We present the second set of discoveries from Keck Observations in the INfrared of Taurus and $\\rho$ Oph Exoplanets And Ultracool dwarfs (KOINTREAU), an adaptive optics survey of young stars in the Taurus and $\\rho$ Oph star-forming regions using Keck/NIRC2 in conjunction with the Keck infrared pyramid wavefront sensor. We have discovered two faint comoving companions to young stars ISO-Oph 96 and 2MASS J16262785-2625152. The companion to ISO-Oph 96, KOINTREAU-3b, is at a projected separation of 340 au (2.49\"). Using our NIRC2 photometry and evolutionary models, and assuming that the companion has the same extinction as its host star, we infer that KOINTREAU-3b has a mass of $3.4\\pm0.7$ M$_{\\rm Jup}$. The companion to 2MASS J16262785-2625152, KOINTREAU-4b, has a projected separation of 180 au (1.25\") and could have a mass of either $11.5^{+1.2}_{-1.6}$ M$_{\\rm Jup}$ or $15.3^{+0.7}_{-0.8}$ M$_{\\rm Jup}$, depending on whether the host star is a member of $\\rho$ Oph or Upper Sco.",
      "pdf_url": "https://arxiv.org/pdf/2602.10198.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10446",
      "title": "Shocks, compressible perturbations, and intermittency in the very local interstellar medium: Voyager 1 and 2 observations and numerical modeling",
      "authors": [
        "Federico Fraternale",
        "Nikolai V. Pogorelov",
        "Ratan Bera",
        "Leonard F. Burlaga",
        "Maciej Bzowski"
      ],
      "abstract": "Shocks, compressible perturbations, and intermittency in the very local interstellar medium: Voyager 1 and 2 observations and numerical modeling Federico Fraternale, Nikolai V. Pogorelov, Ratan Bera, Leonard F. Burlaga, Maciej Bzowski 32 pages, 15 figures, submitted to ApJ Space Physics (physics.space-ph); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Voyager spacecraft (V1 and V2) provide unique in situ measurements of perturbations propagating beyond the heliopause through the very local interstellar medium (VLISM), including the shocks and pressure fronts whose origin is debated. In particular, a jump in magnetic field strength, observed by V1 in 2020.4 at 149.3 au from the Sun, was followed by a distinct \"hump\" and persistently strong magnetic field, both requiring theoretical explanation. This paper offers an interpretation of those observations using a self-consistent, MHD model of the solar wind - LISM interaction driven by the OMNI and interplanetary scintillation data combined with a turbulence analysis of Voyager data. Our simulations convincingly demonstrate that global, solar-cycle-driven compressions, on hitting the heliopause, can reproduce those puzzling V1 observations. They appear to be associated with solar cycle 24, whereas similar interstellar magnetic field structures can occur once per cycle. The turbulence analysis reveals time-dependent magnetic compressibility that persists up to 165 au at scales below 10 days. Turbulence intermittency at scales below 1 hour is mostly confined to specific intervals, possibly associated with a broad foreshock region. The apparent disappearance of intermittency since 2022 reflects the turbulence weakening rather than a fundamental change in VLISM properties. We predict that V1 will record relatively strong magnetic field strengths until $\\sim$2030, followed by weaker, infrequent perturbations. At V2, we expect multiple solar-driven compressions before 2026, followed by a major event induced by solar cycle 25 around 2030. New Horizons is expected to cross the termination shock at 80$\\pm$ au in 2031.",
      "pdf_url": "https://arxiv.org/pdf/2602.10446.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.14173",
      "title": "From Common Envelope Evolution to Luminous Red Novae I: A One-dimensional Radiation Hydrodynamic Model",
      "authors": [
        "Zhuo Chen"
      ],
      "abstract": "From Common Envelope Evolution to Luminous Red Novae I: A One-dimensional Radiation Hydrodynamic Model Zhuo Chen Solar and Stellar Astrophysics (astro-ph.SR) The acceleration and unbinding of the common envelope during the plunge-in phase are governed by complex physical processes that often manifest observationally as luminous red novae. We investigate the dynamics of this phase using one-dimensional radiation hydrodynamic simulations evolved with the code {\\tt Guangqi}. We perform a parameter survey to quantify the impact of key physical conditions on the unbound mass fraction, $\\eta$, and the resulting light curves. Our survey spans a range of radiation-to-gas internal energy ratios ($\\mathcal{E}/e_{\\text{g}}\\in[0.2,3.2]$), ratios of total envelope energy to gravitational binding energy ($\\zeta\\in[0.54,2.87]$), and mass injection rates ($\\dot{M}\\in[2.5,10]M_{\\odot}/\\rm{yr}$), while covering both subsonic and supersonic expansion regimes ($v_{\\rm ej}/v_{\\rm esc}\\in[0.3,0.6]$). We demonstrate that: (1) radiation pressure becomes the dominant driver of mass ejection in the high-opacity, high-luminosity region immediately below the recombination front; (2) $\\eta$ exhibits a nonlinear dependence on $\\zeta$, which is modulated by the mass injection rate and gravitational potential; and (3) the recombination of atomic to molecular hydrogen ($\\ce{H}\\to\\ce{H2}$) releases latent heat that sustains a secondary plateau in the late-time light curve. These findings are substantiated by detailed error analysis and convergence testing presented in the Appendices.",
      "pdf_url": "https://arxiv.org/pdf/2510.14173.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.13252",
      "title": "The Spontaneous Genesis of Solar Prominence Structures Driven by Supergranulation in Three-Dimensional Simulations",
      "authors": [
        "Huanxin Chen",
        "Chun Xia",
        "Hechao Chen"
      ],
      "abstract": "The Spontaneous Genesis of Solar Prominence Structures Driven by Supergranulation in Three-Dimensional Simulations Huanxin Chen, Chun Xia, Hechao Chen SCIENCE CHINA Physics, Mechanics & Astronomy April 2026 Vol. 69 No. 4: 249611 Solar and Stellar Astrophysics (astro-ph.SR) Solar prominences usually have a horizontally elongated body with many feet extending to the solar surface, resembling a multi-arch bridge with many bridge piers. The basic mechanism by which solar prominences acquire these common structures during their evolution, however, remains an unresolved question. For the first time, our three-dimensional magneto-frictional simulation, driven by supergranular motions, self-consistently replicates the commonly observed multi-arch bridge morphology and its characteristic structures of solar quiescent prominences in a magnetic flux rope. In comparison with traditional views, our simulations demonstrate that the spine, feet, and voids (bubbles) are inherent prominence structures spontaneously forming as the flux rope evolves to a mature state. The voids mainly consist of legs of sheared magnetic loops caused by unbalanced supergranular flows, and prominence feet settle at the bottom of helical field lines piled up from the photosphere to the spine. Similarities between the simulated prominences and observed real prominences by the Chinese H$\\alpha$ Solar Explorer, the New Vacuum Solar Telescope, and NASA's Solar Dynamics Observatory suggest the high validity of our model. This work corroborates the pivotal role of photospheric supergranulation as a helicity injection source in the formation and shaping of quiescent prominence structures within the solar atmosphere, thereby paving a new avenue for future investigations into their fine dynamics and stability.",
      "pdf_url": "https://arxiv.org/pdf/2511.13252.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09224",
      "title": "Characterisation of starspot structure and differential rotation of Kepler-411",
      "authors": [
        "Mikko Tuomi",
        "András Haris",
        "Thomas Hackman"
      ],
      "abstract": "Characterisation of starspot structure and differential rotation of Kepler-411 Mikko Tuomi, András Haris, Thomas Hackman About 16 pages, including the appendix. Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Starspots and their movements on stellar surfaces enable investigating the mechanisms of stellar magnetic activity. Information on the spot distribution and differential rotation provide important constraints for the behaviour of stellar magnetic dynamos. We analyse the Kepler photometry of Kepler-411, a known exoplanet host, to determine the distribution and properties of star spots on the stellar surface with two independent and complementary methods: modelling the photometric effect of rotation of spots on the stellar surface and mapping of spots by transiting planets. By constructing a spot model accounting for geometry, differential rotation and spot evolution, we model the spots of the stellar surface giving rise to the observed brightness variations. We also search for evidence for occultations of starspots in high-cadence photometry. Our spot models reproduce the observed photometric variations well and we are able to obtain information on the distribution and movement of spots on the stellar surface. We do not obtain evidence for differential rotation -- the rotational profile is consistent with rigid-body rotation with a period of 10.52$\\pm$0.34 days. We detect three occultations of spots by planet c. The positions of these spots coincide well with the positions of larger spot structures identified by our modelling of the rotational modulation of the light curve.",
      "pdf_url": "https://arxiv.org/pdf/2602.09224.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21430",
      "title": "The stability of propagating plane inertial waves in rotating fluids",
      "authors": [
        "Valentin Skoutnev",
        "Aurélie Astoul",
        "Adrian J. Barker"
      ],
      "abstract": "The stability of propagating plane inertial waves in rotating fluids Valentin Skoutnev, Aurélie Astoul, Adrian J. Barker Phys. Rev. Fluids 11, 024802, Published 11 February, 2026 Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR); Fluid Dynamics (physics.flu-dyn) Inertial waves transport energy and momentum in rotating fluids and are a major contributor to mixing and tidal dissipation in Earth's oceans, gaseous planets, and stellar interiors. However, their stability and breakdown mechanisms are not fully understood. We examine the linear stability and nonlinear breakdown of finite-amplitude propagating plane inertial waves using Floquet theory and direct numerical simulations. The Floquet analysis generalizes previous studies as it is valid for arbitrary perturbation wavelengths and primary wave amplitudes. We find that the wavenumber orientation of the most unstable perturbations depends strongly on the wave frequency and weakly on the wave amplitude. The most unstable perturbations have wavelengths that are small relative to the primary wave wavelength for low wave amplitudes, but become comparable for large wave amplitudes. We then use direct numerical simulations to follow the nonlinear breakdown of the wave and examine how the wave energy is either dissipated in a forward cascade or accumulated into long-lived geostrophic modes. Simulations reveal that the conversion efficiency into geostrophic modes increases with increasing wave amplitude, as expected for pumping of geostrophic modes by nearly-resonant triadic interactions. We also find that the conversion efficiency increases with decreasing primary wave frequency, which may be due to the more efficient coupling of quasi-2D waves to geostrophic modes. These results on the stability and breakdown of single plane inertial waves provides additional foundation for understanding the role of inertial waves in rotating turbulence, transport properties of inertial wave beams, and inertial wave propagation in more complex environments such as those with magnetic fields or shear flows.",
      "pdf_url": "https://arxiv.org/pdf/2509.21430.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16253",
      "title": "Accretion Rate Changes Detected in a Polluted White Dwarf",
      "authors": [
        "Jay Farihi",
        "Hiba Tu Noor",
        "Carl Melis",
        "Beth L. Klein",
        "Snehalata Sahu",
        "Boris T. Gänsicke",
        "Mark C. Wyatt",
        "Seth Redfield",
        "Ted M. Johnson"
      ],
      "abstract": "Accretion Rate Changes Detected in a Polluted White Dwarf Jay Farihi, Hiba Tu Noor, Carl Melis, Beth L. Klein, Snehalata Sahu, Boris T. Gänsicke, Mark C. Wyatt, Seth Redfield, Ted M. Johnson 8 pages, 5 figures, and 3 tables, accepted to MNRAS Letters Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) This letter reports statistically significant changes in the equivalent widths of MgII and CaII lines in the dusty and polluted white dwarf WD 0106-328, based on six epochs of spectroscopy using the VLT and Keck spanning 25 yr. Furthermore, the ratio of these two equivalent widths may also vary, with a 7% probability of being constant. Between 2000 and 2025, both Mg and Ca have experienced decreases in accretion rates, of approximately 20 and 60%, respectively, but with individual variation during the interim. These metal abundance decreases are the first empirical corroboration of diffusion theory in white dwarfs, which predict sinking timescales on the order of days for this star. However, the persistent atmospheric metals require a more gradual, circumstellar process, where one possibility is viscous spreading in an ionized disk of metals, consistent with $\\alpha\\approx0.1$ within that formalism. The combination of optical and ultraviolet spectroscopy with the Hubble Space Telescope detects all the major rock-forming elements (O, Mg, Si, Fe), and demonstrates that Fe dominates the accreted material by mass, and that it is delivered mostly as pure metal from within a differentiated parent body. This inference is consistent with the possibility that chemically-segregated accretion may result from a combination of planetary assembly, fragmentation, disk evolution, and be observed on relatively short timescales.",
      "pdf_url": "https://arxiv.org/pdf/2601.16253.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10165",
      "title": "The indiscriminate adoption of AI threatens the foundations of academia",
      "authors": [
        "Roberto Trotta"
      ],
      "abstract": "The indiscriminate adoption of AI threatens the foundations of academia Roberto Trotta Nat. Astron. 9, 1748-1749 (2025) Instrumentation and Methods for Astrophysics (astro-ph.IM) Artificial intelligence offers much promise, but its use in scientific research should be restrained so that the primary aim of academia -- advancing knowledge for humans -- is safeguarded.",
      "pdf_url": "https://arxiv.org/pdf/2602.10165.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10172",
      "title": "Cosmo3DFlow: Wavelet Flow Matching for Spatial-to-Spectral Compression in Reconstructing the Early Universe",
      "authors": [
        "Md. Khairul Islam",
        "Zeyu Xia",
        "Ryan Goudjil",
        "Jialu Wang",
        "Arya Farahi",
        "Judy Fox"
      ],
      "abstract": "Cosmo3DFlow: Wavelet Flow Matching for Spatial-to-Spectral Compression in Reconstructing the Early Universe Md. Khairul Islam, Zeyu Xia, Ryan Goudjil, Jialu Wang, Arya Farahi, Judy Fox Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI) Reconstructing the early Universe from the evolved present-day Universe is a challenging and computationally demanding problem in modern astrophysics. We devise a novel generative framework, Cosmo3DFlow, designed to address dimensionality and sparsity, the critical bottlenecks inherent in current state-of-the-art methods for cosmological inference. By integrating 3D Discrete Wavelet Transform (DWT) with flow matching, we effectively represent high-dimensional cosmological structures. The Wavelet Transform addresses the ``void problem'' by translating spatial emptiness into spectral sparsity. It decouples high-frequency details from low-frequency structures through spatial compression, and wavelet-space velocity fields facilitate stable ordinary differential equation (ODE) solvers with large step sizes. Using large-scale cosmological $N$-body simulations, at $128^3$ resolution, we achieve up to $50\\times$ faster sampling than diffusion models, combining a $10\\times$ reduction in integration steps with lower per-step computational cost from wavelet compression. Our results enable initial conditions to be sampled in seconds, compared to minutes for previous methods.",
      "pdf_url": "https://arxiv.org/pdf/2602.10172.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10181",
      "title": "Why do we do astrophysics?",
      "authors": [
        "David W. Hogg"
      ],
      "abstract": "David W. Hogg (NYU, Flatiron, MPIA) Instrumentation and Methods for Astrophysics (astro-ph.IM); History and Philosophy of Physics (physics.hist-ph) At time of writing, large language models (LLMs) are beginning to obtain the ability to design, execute, write up, and referee scientific projects on the data-science side of astrophysics. What implications does this have for our profession? In this white paper, I list - and argue for - a set of facts or \"points of agreement\" about what astrophysics is, or should be; these include considerations of novelty, people-centrism, trust, and (the lack of) clinical value. I then list and discuss every possible benefit that astrophysics can be seen as bringing to us, and to science, and to universities, and to the world; these include considerations of love, weaponry, and personal (and personnel) development. I conclude with a discussion of two possible (extreme and bad) policy recommendations related to the use of LLMs in astrophysics, dubbed \"let-them-cook\" and \"ban-and-punish.\" I argue strongly against both of these; it is not going to be easy to develop or adopt good moderate policies.",
      "pdf_url": "https://arxiv.org/pdf/2602.10181.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10901",
      "title": "Pollux test bench: from NUV to FUV polarimetric measurements",
      "authors": [
        "Adrien Girardot",
        "Coralie Neiner",
        "Jean-Michel Reess",
        "Olivier Dupuis",
        "Margarita Carret"
      ],
      "abstract": "Pollux test bench: from NUV to FUV polarimetric measurements Adrien Girardot, Coralie Neiner, Jean-Michel Reess, Olivier Dupuis, Margarita Carret Instrumentation and Methods for Astrophysics (astro-ph.IM) Pollux is a high-resolution spectropolarimeter proposed by an European consortium for HWO. The current design of Pollux features four spectropolarimetric channels, three of which are in the UV range. For the near-UV (NUV) [236-472 nm] and mid-UV (MUV) [118-236 nm] channels, the polarimeters consist of waveplates and prisms made of MgF2, a birefringent material. However, no such birefringent material can be used for the far-UV (FUV) channel [100-123 nm]. Therefore, the polarimeter for this FUV channel is composed solely of mirrors in an innovative assembly. In this talk, we aim to detail the architecture of the test bench that will allow us to validate the performance of these different polarimeters, as part of the HWO GOMaP. Given that we are working in the vacuum ultraviolet (VUV) range, the test bench operates in a vacuum chamber in a clean room. We will discuss the adaptable architecture of the bench based on wavelength and the measurement methodology that we will implement to test if the polarimeters achieve the precision of $10^{-3}$ required for the Pollux instrument. With this test bench, we will successfully increase the Technology Readiness Level (TRL) of UV spectropolarimeters and, for the first time, develop a means to test FUV spectropolarimetry.",
      "pdf_url": "https://arxiv.org/pdf/2602.10901.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11046",
      "title": "Early Architecture Concepts for the Habitable Worlds Observatory -- System Design, Modeling, and Analysis",
      "authors": [
        "Alice Liu",
        "Marie Levine",
        "Charley Noecker",
        "Jon Lawrence",
        "Joshua Abel",
        "Michael Akkerman",
        "Eric Aanstaat",
        "Ruslan Belikov",
        "Pin Chen",
        "Kenneth Dziak",
        "Jordan Effron",
        "Lee Feinberg",
        "Alan Gostin",
        "James Govern",
        "Cameron Haag",
        "Joseph Howard",
        "Brian Kern",
        "Gary Kuan",
        "Milan Mandic",
        "Carson McDonald",
        "Connor Mulrenin",
        "Bijan Nemati",
        "Jon Papa",
        "Fang Shi",
        "Samuel Sirlin",
        "Breann Sitarski",
        "Cory Smiley",
        "J. Scott Smith",
        "Philip Stahl",
        "Christopher Stark",
        "Gregory Walsh",
        "John Ziemer"
      ],
      "abstract": "Early Architecture Concepts for the Habitable Worlds Observatory -- System Design, Modeling, and Analysis Alice (Kuo-Chia)Liu, Marie Levine, Charley Noecker, Jon Lawrence, Joshua Abel, Michael Akkerman, Eric Aanstaat, Ruslan Belikov, Pin Chen, Kenneth Dziak, Jordan Effron, Lee Feinberg, Alan Gostin, James Govern, Cameron Haag, Joseph Howard, Brian Kern, Gary Kuan, Milan Mandic, Carson McDonald, Connor Mulrenin, Bijan Nemati, Jon Papa, Fang Shi, Samuel Sirlin, Breann Sitarski, Cory Smiley, J. Scott Smith, Philip Stahl, Christopher Stark, Gregory Walsh, John Ziemer Instrumentation and Methods for Astrophysics (astro-ph.IM) The Habitable Worlds Observatory (HWO), NASA's next flagship science mission, follows in the tradition of the Nancy Grace Roman Space Telescope and other preceding great observatories. HWO will directly image and characterize Earth-like exoplanet and their atmospheres, with the capability to detect biosignatures and potentially answer the question of whether we are we alone. HWO will also serve as a powerful general astrophysics observatory, enabling breakthroughs in galaxy evolution, stellar astrophysics, and dark matter studies. Currently in pre-formulation, the project has established Exploratory Analytic Cases (EACs), a series of architectural concept designs used to assess the mission's demanding science objectives while exploring challenging engineering parameters. This paper describes the first three EACs, starting with observing strategies and error budget formulation and then progressing to design formulations, trade studies and lessons learned; this paper also discusses the integrated modeling pipeline, a key multidisciplinary system-level analysis capability, and analysis findings as applied to the first EAC. These activities set the stage for the follow on EACs 4 and 5, which will further explore the trade space and prepare for the baseline design that will support the Mission Concept Review (MCR).",
      "pdf_url": "https://arxiv.org/pdf/2602.11046.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10330",
      "title": "Efficient reduction of stellar contamination and noise in planetary transmission spectra using neural networks",
      "authors": [
        "David S. Duque-Castaño",
        "Lauren Flor-Torres",
        "Jorge I. Zuluaga"
      ],
      "abstract": "Efficient reduction of stellar contamination and noise in planetary transmission spectra using neural networks David S. Duque-Castaño, Lauren Flor-Torres, Jorge I. Zuluaga 16 pages, 11 figures. Submitted to Astronomy & Astrophysics Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Context: JWST has enabled transmission spectroscopy at unprecedented precision, but stellar heterogeneities (spots and faculae) remain a dominant contamination source that can bias atmospheric retrievals if uncorrected. Aims: We present a fast, unsupervised methodology to reduce stellar contamination and instrument-specific noise in exoplanet transmission spectra using denoising autoencoders, improving the reliability of retrieved atmospheric parameters. Methods: We design and train denoising autoencoder architectures on large synthetic datasets of terrestrial (TRAPPIST-1e analogues) and sub-Neptune (K2-18b analogues) planets. Reconstruction quality is evaluated with the $\\chi^2$ statistic over a wide range of signal-to-noise ratios, and atmospheric retrieval experiments on contaminated spectra are used to compare against standard correction approaches in accuracy and computational cost. Results: The autoencoders reconstruct uncontaminated spectra while preserving key molecular features, even at low S/N. In retrieval tests, pre-processing with denoising autoencoders reduces bias in inferred abundances relative to uncorrected baselines and matches the accuracy of simultaneous stellar-contamination fitting while reducing computational time by a factor of three to six. Conclusions: Denoising autoencoders provide an efficient alternative to conventional correction strategies and are promising components of future atmospheric characterization pipelines for both rocky and gaseous exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2602.10330.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.15198",
      "title": "HyperAIRI: a plug-and-play algorithm for precise hyperspectral image reconstruction in radio interferometry",
      "authors": [
        "Chao Tang",
        "Arwa Dabbech",
        "Adrian Jackson",
        "Yves Wiaux"
      ],
      "abstract": "HyperAIRI: a plug-and-play algorithm for precise hyperspectral image reconstruction in radio interferometry Chao Tang, Arwa Dabbech, Adrian Jackson, Yves Wiaux 24 pages, 10 figures, accepted by ApJS Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG); Image and Video Processing (eess.IV) The next-generation radio-interferometric (RI) telescopes require imaging algorithms capable of forming high-resolution high-dynamic-range images from large data volumes spanning wide frequency bands. Recently, AIRI, a plug-and-play (PnP) approach taking the forward-backward algorithmic structure (FB), has demonstrated state-of-the-art performance in monochromatic RI imaging by alternating a data-fidelity step with a regularization step via learned denoisers. In this work, we introduce HyperAIRI, its hyperspectral extension, underpinned by learned hyperspectral denoisers enforcing a power-law spectral model. For each spectral channel, the HyperAIRI denoiser takes as input its current image estimate, alongside estimates of its two immediate neighboring channels and the spectral index map, and provides as output its associated denoised image. To ensure convergence of HyperAIRI, the denoisers are trained with a Jacobian regularization enforcing non-expansiveness. To accommodate varying dynamic ranges, we assemble a shelf of pre-trained denoisers, each tailored to a specific dynamic range. At each HyperAIRI iteration, the spectral channels of the target image cube are updated in parallel using dynamic-range-matched denoisers from the pre-trained shelf. The denoisers are also endowed with a spatial image faceting functionality, enabling scalability to varied image sizes. Additionally, we formally introduce Hyper-uSARA, a variant of the optimization-based algorithm HyperSARA, promoting joint sparsity across spectral channels via the $\\ell_{2,1}$-norm, also adopting FB. We evaluate HyperAIRI's performance on simulated and real observations. We showcase its superior performance compared to its optimization-based counterpart Hyper-uSARA, CLEAN's hyperspectral variant in WSClean, and the monochromatic imaging algorithms AIRI and uSARA.",
      "pdf_url": "https://arxiv.org/pdf/2510.15198.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG",
        "eess.IV"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16709",
      "title": "Simulation-based inference with neural posterior estimation applied to X-ray spectral fitting -- III Deriving exact posteriors with dimension reduction and importance sampling",
      "authors": [
        "Didier Barret",
        "Simon Dupourqué"
      ],
      "abstract": "Simulation-based inference with neural posterior estimation applied to X-ray spectral fitting -- III Deriving exact posteriors with dimension reduction and importance sampling Didier Barret, Simon Dupourqué Accepted for publication in A&A, abstract abridged for ArXiv Instrumentation and Methods for Astrophysics (astro-ph.IM) Simulation-based inference (SBI) with neural posterior estimation (NPE) provides rapid X-ray spectral fitting in both Gaussian and Poisson regimes by learning approximate parameter posteriors from simulations. We investigate auto-encoders for compressing high-resolution X-ray spectra, motivated by newAthena X-ray Integral Field Unit (X-IFU), and use likelihood-based importance sampling to refine NPE outputs. Our auto-encoder maps spectra to a low-dimensional latent space and is trained with a custom loss equal to the Cash statistic (C-stat) between simulated and reconstructed spectra. A neural density estimator is then trained on the latent representations. Both models are trained in multiple rounds: at each round, new simulations are drawn from a truncated proposal concentrated around the observation, improving efficiency as the proposal contracts. After NPE convergence, we apply likelihood-based importance sampling to correct the learned posterior. To assess information retention, we train a diagnostic network that predicts the original spectral parameters from the latent space, and we also train a network to learn the likelihood directly to accelerate importance sampling. On X-IFU-like simulations, the auto-encoder and multi-round NPE outperforms PCA and hand-crafted spectral summaries in accuracy and robustness. After importance sampling, the resulting posteriors are statistically indistinguishable from those obtained with nested sampling. On a standard laptop, the full pipeline (simulation, compression, inference, correction) delivers 10x speedups. We further demonstrate the approach on XRISM/Resolve and on lower-resolution NICER and XMM-Newton EPIC-pn data, confirming applicability across instruments and resolutions. Overall, NPE on compressed spectra paired with likelihood-based importance sampling offers an exact yet efficient alternative for Bayesian X-ray spectral fitting.",
      "pdf_url": "https://arxiv.org/pdf/2512.16709.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06081",
      "title": "First Multi-Constellation Observations of Navigation Satellite Signals in the Lunar Domain by Post-Processing L1/L5 IQ Snapshots",
      "authors": [
        "Lorenzo Sciacca",
        "Alex Minetto",
        "Andrea Nardin",
        "Fabio Dovis",
        "Luca Canzian",
        "Mario Musmeci",
        "Claudia Facchinetti",
        "Giancarlo Varacalli"
      ],
      "abstract": "First Multi-Constellation Observations of Navigation Satellite Signals in the Lunar Domain by Post-Processing L1/L5 IQ Snapshots Lorenzo Sciacca, Alex Minetto, Andrea Nardin, Fabio Dovis, Luca Canzian, Mario Musmeci, Claudia Facchinetti, Giancarlo Varacalli 13 pages, 9 figures, IEEE Transactions on Aerospace and Electronic Systems Space Physics (physics.space-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Robotics (cs.RO); Signal Processing (eess.SP) The use of Global Navigation Satellite Systems (GNSS) to increase spacecraft autonomy for orbit determination has gained renewed momentum following the Lunar GNSS Receiver Experiment (LuGRE), which demonstrated feasible onboard GPS and Galileo signal reception and tracking at lunar distances. This work processes in-phase and quadrature (IQ) snapshots collected by the LuGRE receiver in cis-lunar space and on the lunar surface to assess multi-frequency, multi-constellation signal availability. Signals from additional systems beyond GPS and Galileo, including RNSS and SBAS constellations, are observable and successfully acquired exclusively in the recorded IQ snapshots. These observations provide the first experimental evidence that signals from multiple constellations, including systems not supported by LuGRE realtime operations, are detectable at unprecedented distances from Earth. Useful observables can be extracted from the IQ snapshots, despite minimal sampling rates, 4-bit quantization, and short durations (200 ms-2 s), through a hybrid coherent/non-coherent acquisition stage compensating for code Doppler. These observations are exploited to tune simulation tools and to perform extended simulation campaigns, showing that the inclusion of additional constellations significantly improves availability; for a 26 dB-Hz acquisition threshold, the fraction of epochs with at least four visible satellites increases from 11% to 46% of the total epoch count. These findings indicate that BeiDou, RNSS, and SBAS signals can substantially enhance GNSS-based autonomy for lunar and cislunar missions.",
      "pdf_url": "https://arxiv.org/pdf/2601.06081.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.RO",
        "eess.SP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10245",
      "title": "Long-Term Evolution of Close-in Sub-Neptunes and Outer Planetary Embryos: Atmospheric Mass Loss and Origin of Planets Inside and Outside the Radius Gap",
      "authors": [
        "Yaxing He",
        "Masahiro Ogihara",
        "Kangrou Guo"
      ],
      "abstract": "Long-Term Evolution of Close-in Sub-Neptunes and Outer Planetary Embryos: Atmospheric Mass Loss and Origin of Planets Inside and Outside the Radius Gap Yaxing He, Masahiro Ogihara, Kangrou Guo 20 pages, 8 figures, 1 table. Accepted for publication in The Astrophysical Journal Earth and Planetary Astrophysics (astro-ph.EP) As a byproduct of sub-Neptune formation, planetary embryos with high eccentricity can remain in outer orbits, near 1 au from the star. In this work, we investigate the long-term evolution of systems consisting of close-in sub-Neptunes (SNs) and outer high-eccentricity embryos. Our analysis focuses on collisions between SNs and embryos, particularly their atmospheric mass loss. We performed N-body simulations for various initial eccentricities and numbers of embryos. We analyzed the impact-induced atmospheric loss using post-processing methods, finding that the embryos and SNs collide at high speeds on timescales of several million years, leading to the loss of the SNs' atmospheres. Depending on the embryos' eccentricity and the orbital radius of the SNs, the impact velocity can be quite high, ranging from 2 to 5 times the escape velocity. On average, about 15%-30% of the atmosphere is dissipated per collision, so after 3-6 collisions, the atmospheric mass of an SN is reduced to about 1/3 of its initial value. Collisions between SNs and embryos can thus explain the presence of planets within the radius gap. Depending upon the initial eccentricity and the number of remaining embryos, additional collisions can occur, potentially accounting for the formation of the radius gap. This study also indicates that collisions between remaining embryos and SNs may help to explain the observed rarity of SNs with atmospheric mass fractions greater than 10%, commonly termed the \"radius cliff.\"",
      "pdf_url": "https://arxiv.org/pdf/2602.10245.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10260",
      "title": "Cold and eccentric: a high-spectral resolution view of 51 Eri b with VLT/HiRISE",
      "authors": [
        "A. Denis",
        "A. Vigan",
        "G. Chauvin",
        "A. Lacquement",
        "H. Beust",
        "M. Ravet",
        "J. Costes",
        "A. Radcliffe",
        "S. Martos",
        "W. Balmer",
        "T. Stolkern",
        "P. Palma Bifani",
        "B. Rajpoot",
        "A. Simonnin",
        "S. Petrus",
        "T. Forveille",
        "M. Janson",
        "A. Reiners",
        "N. Godoy",
        "D. Cont",
        "L. Nortmann",
        "K. Hoy",
        "A. Zurlo",
        "H. Anwand-Heerwart",
        "Y. Charles",
        "A. Costille",
        "M. El Morsy",
        "J. Garcia",
        "M. Houllé",
        "M. Lopez",
        "G. Murray",
        "E. Muslimov",
        "G.P.P.L. Otten",
        "J. Paufique",
        "M. Phillips",
        "U. Seemann",
        "A. Viret",
        "G. Zins"
      ],
      "abstract": "Cold and eccentric: a high-spectral resolution view of 51 Eri b with VLT/HiRISE A. Denis, A. Vigan, G. Chauvin, A. Lacquement, H. Beust, M. Ravet, J. Costes, A. Radcliffe, S. Martos, W. Balmer, T. Stolkern, P. Palma Bifani, B. Rajpoot, A. Simonnin, S. Petrus, T. Forveille, M. Janson, A. Reiners, N. Godoy, D. Cont, L. Nortmann, K. Hoy, A. Zurlo, H. Anwand-Heerwart, Y. Charles, A. Costille, M. El Morsy, J. Garcia, M. Houllé, M. Lopez, G. Murray, E. Muslimov, G.P.P.L. Otten, J. Paufique, M. Phillips, U. Seemann, A. Viret, G. Zins 9 pages, 8 figures, Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) Discovered almost 10 years ago, the giant planet 51 Eridani b is one of the least separated (0.2 arcsec) and faintest (J = 19.74 mag) directly imaged exoplanets known to date. Its atmospheric properties have been thoroughly investigated through low- and medium-resolution spectroscopic observations, enabling robust characterization of the planet's bulk parameters. However, the planet's intrinsically high contrast renders high-resolution spectroscopic observations difficult, despite their potential to yield key measurements essential for a more comprehensive characterization. This study seeks to constrain the planet's radial velocity, enabling a full 3D orbital solution when integrated with previous measurements. We have obtained 4 high-contrast high-resolution (R = 140000) spectroscopic datasets of the planet, collected over a two-year interval with the HiRISE visitor instrument at the VLT to derive the planet's radial velocity. Using self-consistent models of atmosphere, we were able to derive the radial velocity of the planet at each of the 4 epochs. These radial velocity measurements were then used in combination with all existing relative astrometry in order to constrain the orbit of the planet. Our radial velocity measurements allow us to break the degeneracy along the line of sight, making it now possible the unambiguous interpretation of the phase curve of the companion. We further constrain the orbital parameters, particularly the eccentricity, for which we derive e = 0.55 (-0.07, +0.03). The relatively high eccentricity indicates that the system has experienced dynamical interactions induced by an external perturber. We place constraints on the mass and semi-major axis of a hypothetical, unseen outer planet capable of producing the observed high eccentricities.",
      "pdf_url": "https://arxiv.org/pdf/2602.10260.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10369",
      "title": "Not Earth-like Yet Temperate? More Generic Climate Feedback Configurations Still Allow Temperate Climates in Habitable Zone Exo-Earth Candidates",
      "authors": [
        "Chaucer Langbert",
        "Dániel Apai"
      ],
      "abstract": "Not Earth-like Yet Temperate? More Generic Climate Feedback Configurations Still Allow Temperate Climates in Habitable Zone Exo-Earth Candidates Chaucer Langbert, Dániel Apai 29 pages, 16 figures, accepted for publication in the Planetary Science Journal Earth and Planetary Astrophysics (astro-ph.EP) Earth's climate is influenced by over a dozen feedbacks, but only three dominate its long-term climate behavior. Models of the exoplanet habitable zone (HZ) assume that this is similar for other Earth-like planets. We used dynamical simulations to study Earth-like planets with a fourth, (potentially strong) generalized climate feedback. Across over 20,000 climate simulations, we find that the addition of the fourth feedback produces novel behaviors, including runaway and chaotic climate trajectories, that are more diverse than one would expect based on Earth's climate configuration. Non-negligible fourth feedbacks -- if negative -- would not lessen the probability of planets with temperate climates. However, positive fourth feedbacks decrease the fraction of exo-Earth candidates that are long-term habitable. Therefore, strong fourth feedbacks will alter (and mostly shrink) the boundaries of the classical habitable zone. When combined with occurrence rates of Earth-sized planets around sun-like stars, our results imply that the fraction of stars hosting rocky planets with temperate climates may be substantially lower than classical estimates under Earth-like climate assumptions. Our results are subject to the validity of the model assumptions and not intended to represent conclusive predictions about exoplanet populations but rather to demonstrate the potential climate diversity that emerges from non-Earth-like model configurations. Our conclusions provide context on sample sizes and science questions for next-generation exoplanet surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.10369.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10674",
      "title": "The role of detailed gas and dust opacities in shaping the evolution of the inner disc edge subject to episodic accretion",
      "authors": [
        "Michael Cecil",
        "Mario Flock",
        "Mykola G. Malygin",
        "Rolf Kuiper",
        "Prakruti Sudarshan",
        "Alexandros Ziampras",
        "Vardan G. Elbakyan"
      ],
      "abstract": "The role of detailed gas and dust opacities in shaping the evolution of the inner disc edge subject to episodic accretion Michael Cecil, Mario Flock, Mykola G. Malygin, Rolf Kuiper, Prakruti Sudarshan, Alexandros Ziampras, Vardan G. Elbakyan 22 pages, 15 figures, accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) We investigate the effects of different dust and gas opacity descriptions on the structure and evolution of the inner regions of protoplanetary discs. The influence on the episodic instability of the inner rim is hereby of central interest. 2D axisymmetric radiation hydrodynamic models are employed to simulate the evolution of the inner disc over several thousand years. Our simulations greatly expand on previous models by implementing detailed opacity descriptions in terms of their mean and frequency-dependent values, allowing us to also consider binned frequency-dependent irradiation. The adaptive opacity description significantly affects the structure of the inner disc rim, with gas opacities exerting the greatest influence. The resulting effects include shifts in the position of both the dust sublimation front and the dead zone inner edge, a significantly altered temperature in the dust-free region and the manifestation of an equilibrium temperature degeneracy as a sharp temperature transition. The episodic instability due to MRI activation in the dead zone still occurs, but at lower inner disc densities. While the gas opacities set the initial conditions for the instability, the evolution of the outburst itself is mainly governed by the dust opacities. The analysis of criteria for non-axisymmetric instabilities reveals possible breaking of the density peaks produced by the burst. However, due to the periodicity of the instability, the inner edge itself may remain stable throughout quiescent phases according to linear criteria. Although the thermal structure of the inner disc is crucially affected by different opacity descriptions, the mechanism of the periodic instability of the DZIE remains active and is only marginally influenced by gas opacities. The observational consequences of the severely altered temperatures may be significant and require further investigation.",
      "pdf_url": "https://arxiv.org/pdf/2602.10674.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10919",
      "title": "HD 164604 c: a second giant planet on a 15-yr orbit and the constraint of the planet-planet mutual inclination",
      "authors": [
        "Guang-Yao Xiao",
        "Fabo Feng",
        "R. Paul Butler",
        "Johanna K. Teske",
        "Stephen A. Shectman",
        "Jeffrey D. Crane",
        "Sharon X. Wang"
      ],
      "abstract": "HD 164604 c: a second giant planet on a 15-yr orbit and the constraint of the planet-planet mutual inclination Guang-Yao Xiao, Fabo Feng, R. Paul Butler, Johanna K. Teske, Stephen A. Shectman, Jeffrey D. Crane, Sharon X. Wang 21 pages, 17 figures, accepted for publication in The Astronomical Journal. Data and code are available on this https URL Earth and Planetary Astrophysics (astro-ph.EP) We report the discovery of a new massive giant planet, HD 164604 c ($a_c = 5.556_{-0.10}^{+0.093}$ au, $e_c = 0.196_{-0.078}^{+0.078}$ and $m_c = 9.5_{-1.25}^{+1.2}$ or $7.6_{-1.0}^{+1.0}\\,M_{\\rm Jup}$), orbiting a K3.5 dwarf, The result is based on the combined analysis of high-precision radial-velocity data, Hipparcos, and Gaia DR2 and DR3 astrometry. We refine the orbital parameters of the inner planet HD 164604 b to $a_b = 1.362_{-0.012}^{+0.012}$ au, $e_b = 0.479_{-0.021}^{+0.027}$, and $m_b = 13.2_{-1.5}^{+1.8}\\,M_{\\rm Jup}$ (or $8.8_{-1.5}^{+1.9}\\,M_{\\rm Jup}$). Depending on the two possible orbital orientations of HD 164604 c, the true mutual inclination between the two planets is $\\psi_{bc}=5.0^{+3.7}_{-2.2}$$^\\circ$ (prograde) or $162.1^{+7.1}_{-4.7}$$^\\circ$ (retrograde). Long-term N-body integrations show that most orbits with the retrograde configuration remain dynamically stable for at least 10 Myr, while orbits with the prograde motion might rapidly evolve into chaos or lead to ejection. The retrograde architecture points to a violent dynamical history, possibly involving von Zeipel-Lidov-Kozai cycles or three-body scattering, while the prograde scenario might be consistent with coplanar and mild disk migration. Future Gaia DR4 astrometry will break the inclination degeneracy and distinguish between prograde and retrograde orbits for HD 164604 c.",
      "pdf_url": "https://arxiv.org/pdf/2602.10919.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.11017",
      "title": "TESS planets in known radial velocity cold Jupiter systems: Hot super Earth occurrence is enhanced by cold Jupiters",
      "authors": [
        "Quanyi Liu",
        "Wei Zhu",
        "Tianjun Gan",
        "Fei Dai"
      ],
      "abstract": "TESS planets in known radial velocity cold Jupiter systems: Hot super Earth occurrence is enhanced by cold Jupiters Quanyi Liu, Wei Zhu, Tianjun Gan, Fei Dai 15 pages, 8 figures, 4 tables; Submitted to AJ Earth and Planetary Astrophysics (astro-ph.EP) The correlation between inner super-Earths (SEs) and outer cold Jupiters (CJs) provides an important constraint on the formation and dynamical evolution of planetary systems. Previous studies have suggested a positive connection between these two populations, particularly around metal-rich stars, and proposed that nearly all CJ-hosting stars may also harbor inner SEs. In this work, we use TESS transits to investigate the occurrence of hot SEs in systems with known CJs detected by radial velocity (RV). Out of a statistical sample of 132 CJ systems, we identify five transiting hot super-Earths ($1$-$4R_\\oplus$, $P<10\\mathrm{d}$) around four stars, including one new candidate (TOI-6965.01) around HD 50554. To enable statistical analysis, we first validate the two candidates around HD 50554 using TESS photometry, archival RV measurements, and Gaia astrometry. After accounting for detection sensitivity and geometric transit probability, we find that the presence of CJs enhances the occurrence rate of hot super-Earths by a factor of $8.1^{+4.3}_{-3.2}$ relative to field stars, with the case of no enhancement ruled out at the 99.9% confidence level. Taking into account the average multiplicity of hot SEs, we find that about 87% of CJ systems host at least one hot SE. Our results provide strong supporting evidence for a positive SE-CJ correlation. We also briefly explore the correlation around metal-poor hosts and for specific sub-populations (e.g., warm super-Earths or cold super-Jupiters).",
      "pdf_url": "https://arxiv.org/pdf/2602.11017.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.10980",
      "title": "The Interpolation Constraint in the RV Analysis of M-Dwarfs Using Empirical Templates",
      "authors": [
        "Dhvani Doshi",
        "Nicolas B. Cowan",
        "Étienne Artigau",
        "René Doyon",
        "André M. Silva",
        "Khaled Al Moulla",
        "Yashar Hezaveh"
      ],
      "abstract": "The Interpolation Constraint in the RV Analysis of M-Dwarfs Using Empirical Templates Dhvani Doshi, Nicolas B. Cowan, Étienne Artigau, René Doyon, André M. Silva, Khaled Al Moulla, Yashar Hezaveh 13 pages, 7 figures, published in AJ Earth and Planetary Astrophysics (astro-ph.EP) Precise radial velocity (pRV) measurements of M dwarfs in the near-infrared (NIR) rely on empirical templates due to the lack of accurate stellar spectral models in this regime. Templates are assumed to approximate the true spectrum when constructed from many observations or in the high signal-to-noise limit. We develop a numerical simulation that generates SPIRou-like pRV observations from PHOENIX spectra, constructs empirical templates, and estimates radial velocities. This simulation solely considers photon noise and evaluates when empirical templates remain reliable for pRV analysis. Our results reveal a previously unrecognized noise source in templates created from stacking registered observations, establishing a noise floor for such template-based pRV measurements. We find that these templates inherently include distortions in stellar line shapes due to imperfect interpolation at the detector's sampling resolution. The magnitude of this interpolation error depends on sampling resolution and RV content. Consequently, for stars with higher RV content, such as cooler M-dwarfs, interpolation noise has a larger relative impact, making their performance comparable to hotter M-dwarfs when using detectors with low sampling. For a typical M4V star, SPIRou's spectral and sampling resolution imposes an RV uncertainty floor of 0.5-0.8 m/s, independent of the star's magnitude or the telescope's aperture. These findings reveal a limitation of template-based pRV methods, underscoring the need for improved spectral modeling and better-than-Nyquist detector sampling to reach the next level of RV precision.",
      "pdf_url": "https://arxiv.org/pdf/2508.10980.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10585",
      "title": "Canceling Effects of Conjunctions Render Higher Order Mean Motion Resonances Weak",
      "authors": [
        "Elizabeth K Jones",
        "Samuel Hadden",
        "Supakrai Teekamongkol",
        "Daniel Tamayo"
      ],
      "abstract": "Canceling Effects of Conjunctions Render Higher Order Mean Motion Resonances Weak Elizabeth K Jones, Samuel Hadden, Supakrai Teekamongkol, Daniel Tamayo Accepted in ApJ. 10 pages, 5 figures Earth and Planetary Astrophysics (astro-ph.EP) Mean motion resonances (MMRs) are a key phenomenon in orbital dynamics. The traditional disturbing function expansion in celestial mechanics shows that, at low eccentricities, $p$:$p-q$ MMRs exhibit a clear hierarchy of strengths, scaling as $e^q$, where $q$ is the order of the resonance. This explains why first-order MMRs (e.g., 3:2 and 4:3) are important, while the infinite number of higher order integer ratios are not. However, this relationship derived from a technical perturbation series expansion provides little physical intuition. In this paper, we provide a simple physical explanation of this result for closely spaced orbits. In this limit, interplanetary interactions are negligible except during close encounters at conjunction, where the planets impart a gravitational \"kick\" to each other's mean motion. We show that while first-order MMRs involve a single conjunction before the configuration repeats, higher order MMRs involve multiple conjunctions per cycle, whose effects cancel out more precisely the higher the order of the resonance. Starting from the effects of a single conjunction, we provide an alternate, physically motivated derivation of MMRs' $e^q$ strength scaling.",
      "pdf_url": "https://arxiv.org/pdf/2601.10585.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}