{
  "date": "2025-10-28",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.HE",
    "astro-ph.CO",
    "astro-ph.IM",
    "astro-ph.GA"
  ],
  "total_papers": 91,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.20876",
      "title": "Swampland Conjectures through ACT Observations: Observational Signatures of Radiative-Corrected Inflation",
      "authors": [
        "Mohammad Ali S Afshar",
        "Saeed Noori Gashti",
        "Mohammad Reza Alipour",
        "Behnam Pourhassan",
        "Izzet Sakalli",
        "Jafar Sadeghi"
      ],
      "abstract": "Swampland Conjectures through ACT Observations: Observational Signatures of Radiative-Corrected Inflation Mohammad Ali S Afshar, Saeed Noori Gashti, Mohammad Reza Alipour, Behnam Pourhassan, Izzet Sakalli, Jafar Sadeghi Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate the consistency of radiatively corrected inflationary models with both the latest observational data from the Atacama Cosmology Telescope (ACT) combined with Planck 2018 and Baryon Acoustic Oscillation (BAO) measurements, and the theoretical constraints imposed by the swampland program. We systematically test two distinct models against three key swampland conjectures: the further refined de Sitter swampland conjecture (FRDSSC), the scalar weak gravity conjecture (SWGC), and the strong scalar weak gravity conjecture (SSWGC). Model I, based on radiatively corrected Higgs inflation, satisfies the FRDSSC and remains consistent with current observational constraints ($n_s = 0.9743 \\pm 0.0034$, $r < 0.038$), but fails to meet the SWGC and SSWGC requirements, indicating limited theoretical compatibility with quantum gravity principles. In contrast, Model II, incorporating radiative corrections with scalar sectors, demonstrates full consistency by satisfying all three swampland conjectures simultaneously while maintaining observational viability. The compatibility of Model II is highly sensitive to the non-minimal coupling $\\xi$ and renormalization scales $\\mu_b$, with larger values extending the range of swampland-consistent solutions. Our results highlight the critical role of radiative corrections in achieving simultaneous theoretical and observational consistency, and identify Model II as a promising candidate for a fully viable inflationary scenario within the swampland framework. This work provides a methodology for classifying inflationary models based on their swampland compatibility, demonstrating that satisfaction of the FRDSSC alone is insufficient for full theoretical consistency.",
      "pdf_url": "https://arxiv.org/pdf/2510.20876.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20898",
      "title": "Illuminating gravitational wave sources with Sgr A* flares",
      "authors": [
        "Pau Amaro Seoane"
      ],
      "abstract": "Illuminating gravitational wave sources with Sgr A* flares Pau Amaro Seoane High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) Sagittarius A* (Sgr A*), the supermassive black hole at the center of the Milky Way, exhibits daily energetic flares characterized by non-thermal emission in the infrared and X-ray bands. While the underlying accretion flow is a Radiatively Inefficient Accretion Flow (RIAF) peaking at radio frequencies, the mechanism powering these non-thermal transients remains debated. Stellar dynamics predict a population of faint brown dwarfs orbiting Sgr A*. These objects are progenitors of Extremely Large Mass Ratio Inspirals (XMRIs), crucial sources of low-frequency gravitational waves for the future Laser Interferometer Space Antenna (LISA) mission. We investigate whether the tidal stripping of brown dwarfs provides a viable fueling mechanism for the observed flares. Here we present high-resolution hydrodynamic simulations of grazing tidal interactions coupled with a parameterized non-thermal radiation model. We demonstrate that the dynamics of the tidal fallback and subsequent viscous evolution naturally reproduce the fundamental temporal characteristics of observed flares: the peak luminosity and the characteristic 1-hour duration. We show that this fueling mechanism is dynamically viable and energetically consistent, placing strong constraints on the required efficiency of the non-thermal emission process, suggesting extreme radiative inefficiency. These findings provide compelling evidence for a hidden population of brown dwarfs in the Galactic Center. Crucially, the observed high flare frequency implies tight orbits characteristic of advanced inspirals. This establishes a direct link between electromagnetic transients and active gravitational wave sources, alerting the LISA consortium years in advance to the presence of specific XMRI systems promising exceptionally high signal-to-noise ratios for precision tests of general relativity.",
      "pdf_url": "https://arxiv.org/pdf/2510.20898.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.20964",
      "title": "Background solutions to the Hubble tension in $f(Q)$ gravity and consistency with BAO measurements",
      "authors": [
        "José Antonio Nájera",
        "Indranil Banik",
        "Harry Desmond",
        "Vasileios Kalaitzidis"
      ],
      "abstract": "Background solutions to the Hubble tension in $f(Q)$ gravity and consistency with BAO measurements José Antonio Nájera, Indranil Banik, Harry Desmond, Vasileios Kalaitzidis Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We test whether $f(Q)$ symmetric teleparallel theories of gravity are capable of solving the Hubble tension while producing consistency with DESI DR2 BAO. We consider three different forms for the $f(Q)$ function: logarithmic, exponential, and hyperbolic tangent. We also consider extensions of these models by adding the Cosmological constant, and compare to phenomenological models with a flexible double exponential addition to the standard $\\Lambda$CDM $H(z)$. We test these models against DESI DR2 BAO, Planck 2018, Local $H_0$, and Cosmic Chronometers data. The logarithmic and hyperbolic tangent models do not provide an adequate solution, while the exponential model gives a reasonable solution, though it faces mild tension with the BAO data. The models assisted by the cosmological constant perform slightly better than the exponential, at the cost of reduced theoretical motivation. This highlights the difficulties of finding a theoretically motivated solution to the Hubble tension while producing BAO consistency. The phenomenological models are able to achieve a good fit to all data, giving guidelines for what a background solution to the Hubble tension would look like in general.",
      "pdf_url": "https://arxiv.org/pdf/2510.20964.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21502",
      "title": "Multi-Messenger Search for Neutrino and Gravitational-Wave Emissions from Binary Black Holes Near Active Galactic Nuclei",
      "authors": [
        "Leonardo Ricca",
        "Matthias Vereecken",
        "Christoph Raab",
        "Mathieu Lamoureux",
        "Giacomo Bruno",
        "Gwenhaël De Wasseige"
      ],
      "abstract": "Multi-Messenger Search for Neutrino and Gravitational-Wave Emissions from Binary Black Holes Near Active Galactic Nuclei Leonardo Ricca, Matthias Vereecken, Christoph Raab, Mathieu Lamoureux, Giacomo Bruno, Gwenhaël De Wasseige 8 pages, 1 figure. Presented at the 39th International Cosmic Ray Conference (ICRC2025). Published in Proceedings of Science L.Ricca et al. Proceedings of Science ICRC2025 (2025),958 High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Binary black holes (BBHs) in the vicinity of Active Galactic Nuclei (AGNs) are particularly interesting systems from both a cosmological and astrophysical point of view. Matter and radiation fields within the dense AGN environment could produce electromagnetic and neutrino emission in addition to gravitational waves (GWs). Moreover, interactions between BBHs and AGN accretion disks are expected to influence BBH formation channels and merger rates. Understanding these sources could help explain the unexpectedly high BBH masses observed through GWs by the LIGO-Virgo-KAGRA collaborations. We present a search for coincident gravitational-wave and neutrino emission from AGNs. Our innovative approach combines information from gravitational-wave data, neutrino observations, and AGN optical catalogs to increase the chances of identifying potential sources and studying their properties. We assess the sensitivity of the search using subthreshold gravitational-wave candidates from LIGO-Virgo-KAGRA data, neutrino event candidates from public IceCube Neutrino Observatory data and AGN candidates from the Quaia catalog. A confident detection of such an event would mark a breakthrough in multi-messenger astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2510.21502.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.21521",
      "title": "Synergy between CSST and third-generation gravitational-wave detectors: Inferring cosmological parameters using cross-correlation of dark sirens and galaxies",
      "authors": [
        "Ya-Nan Du",
        "Ji-Yu Song",
        "Yichao Li",
        "Shang-Jie Jin",
        "Ling-Feng Wang",
        "Jing-Fei Zhang",
        "Xin Zhang"
      ],
      "abstract": "Synergy between CSST and third-generation gravitational-wave detectors: Inferring cosmological parameters using cross-correlation of dark sirens and galaxies Ya-Nan Du, Ji-Yu Song, Yichao Li, Shang-Jie Jin, Ling-Feng Wang, Jing-Fei Zhang, Xin Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Gravitational-wave (GW) events are generally believed to originate in galaxies and can thus serve, like galaxies, as tracers of the universe's large-scale structure. In GW observations, waveform analysis provides direct measurements of luminosity distances; however, the redshifts of GW sources cannot be determined due to the mass-redshift degeneracy. By cross-correlating GW events with galaxies, one can establish a correspondence between luminosity distance and redshift shells, enabling cosmological inference. In this work, we explore the scientific potential of cross-correlating GW sources detected by third-generation (3G) ground-based GW detectors with the photometric redshift survey of the China Space Station Survey Telescope (CSST). We find that the constraint precisions of the Hubble constant and the matter density parameter can reach $1.04\\%$ and $2.04\\%$, respectively. The GW clustering bias parameters $A_{\\rm GW}$ and $\\gamma$ can be constrained to $1.52\\%$ and $4.67\\%$, respectively. These results highlight the significant potential of the synergy between CSST and 3G ground-based GW detectors in constraining cosmological models and probing GW source formation channels using cross-correlation of dark sirens and galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.21521.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.21529",
      "title": "Sco X-1 as a continuous gravitational waves source: modelling the secular evolution using MESA",
      "authors": [
        "Gianluca Pagliaro",
        "Maria Alessandra Papa",
        "Jing Ming",
        "Devina Misra"
      ],
      "abstract": "Sco X-1 as a continuous gravitational waves source: modelling the secular evolution using MESA Gianluca Pagliaro, Maria Alessandra Papa, Jing Ming, Devina Misra High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We study the prospects for detecting continuous gravitational waves (GWs) from Sco X-1 and evaluate the most likely waveform- and progenitor- parameters. We study the evolution of different Sco X-1 progenitors, identifying those that give rise to detectable signals. We model the spin evolution of the neutron star (NS) by the accretion torque and the GW torque. We consider two mechanisms for generating the non-axisymmetry responsible for the GW torque: i) magnetic mountains and ii) deformation after crustal breakage. Both torques are intertwined with the binary evolution, which we trace from the formation of the NS in a binary system with a main-sequence companion. We do this with MESA, starting from a set of initial binary configurations. At current sensitivity, a magnetic ellipticity of $\\varepsilon\\gtrsim 10^{-6}$ is necessary for detection. The highest frequency at which we have detectable signals increases with the accretion efficiency $\\eta$, and it can be as high as 360Hz. At 3G (Cosmic Explorer/Einstein telescope) sensitivity, less deformed Sco X-1 NSs, with ellipticities as small as $6\\cdot 10^{-9}$, are detectable, but the waveform highly depends on the binary system: the highest frequency of detectable signals spans the very broad range 600-1700Hz, strongly depending on $\\eta$ and mass of the progenitor donor star $M^d$. If $\\eta\\leq$30%, the crust does not break. When $\\eta\\in$[40%,60%] only progenitors with $M^d\\geq[1.1,1.5]M_{\\odot}$ present crustal breakage, while if $\\eta\\geq$70% all crusts break. In some systems the crust breaks during their Sco X-1 phase. If Sco X-1 were one of those systems, it would be emitting a very loud GW signal sweeping from O(1000)Hz down to torque-balance frequencies. We estimate current detection probability for this signal to be under 1%; this probability increases substantially -- to around 41% -- with third-generation detectors.",
      "pdf_url": "https://arxiv.org/pdf/2510.21529.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.21627",
      "title": "DESI constraints on two-field quintessence with exponential potentials",
      "authors": [
        "George Alestas",
        "Marienza Caldarola",
        "Indira Ocampo",
        "Savvas Nesseris",
        "Shinji Tsujikawa"
      ],
      "abstract": "DESI constraints on two-field quintessence with exponential potentials George Alestas, Marienza Caldarola, Indira Ocampo, Savvas Nesseris, Shinji Tsujikawa 9 pages, 4 figures, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate a quintessence model involving two scalar fields with double-exponential potentials. This configuration allows the system as a whole to emulate the dynamics of a single field with a shallower potential, enabling scalar fields that individually cannot drive cosmic acceleration to collectively achieve and sustain it. We assess the viability of this model by performing a fully Bayesian analysis and confronting its predictions with observational data, including the Planck 2018 Cosmic Microwave Background (CMB) shift parameters, the newly released Dark Energy Spectroscopic Instrument (DESI) DR2 Baryon Acoustic Oscillation (BAO) measurements, and the Dark Energy Survey Year 5 (DESY5) Type Ia supernova (SnIa) sample. Our analysis shows that the two-field quintessence model yields a log Bayes factor relative to the flat $\\Lambda$CDM model of $\\Delta \\ln B \\sim 4$, indicating moderate evidence against the latter. We also find that the central values of the two slopes of the exponential potentials are both close to 1, whereas the slope of an effective single-field system is constrained to be less than order unity. This property is theoretically desirable from the perspective of higher-dimensional theories. Thus, the two-field quintessence model with exponential potentials provides a physically motivated and compelling mechanism that is consistent with both observational and theoretical requirements.",
      "pdf_url": "https://arxiv.org/pdf/2510.21627.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21709",
      "title": "From nuclear star clusters to Little Red Dots: black hole growth, mergers, and tidal disruptions",
      "authors": [
        "Konstantinos Kritos",
        "Joseph Silk"
      ],
      "abstract": "From nuclear star clusters to Little Red Dots: black hole growth, mergers, and tidal disruptions Konstantinos Kritos, Joseph Silk High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) Little Red Dots, discovered by the James Webb Space Telescope, are hypothesized to be active galactic nuclei containing a supermassive black hole, possibly surrounded by a dense stellar cluster, large amounts of gas, and likely by a population of stellar-mass black holes. We develop a simple nuclear star cluster model to evolve the rapid mass growth of black hole seeds into the supermassive regime. The combined processes of tidal disruption events, black hole captures, and gas accretion are accounted for self-consistently in our model. Given the observed number density of Little Red Dots, and under reasonable assumptions, we predict at least a few tens of tidal disruption events and at least a few black hole captures at $z=4$-$6$, with a tidal disruption event rate an order of magnitude larger than the black hole capture rate. We also estimate the uncertainties in these estimates. Finally, we comment on the low x-ray luminosity of Little Red Dots.",
      "pdf_url": "https://arxiv.org/pdf/2510.21709.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.15768",
      "title": "Current constraints on the minimally extended varying speed of light model through the cosmic distance duality relation",
      "authors": [
        "Jaiane Santos",
        "Carlos Bengaly",
        "Rodrigo S. Gonçalves"
      ],
      "abstract": "Current constraints on the minimally extended varying speed of light model through the cosmic distance duality relation Jaiane Santos, Carlos Bengaly, Rodrigo S. Gonçalves 20 pages, 4 figures. Accepted for publication in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) One of the most crucial tests of the standard cosmological model consists on testing possible variations on fundamental physical constants. In frameworks such as the minimally extended varying speed of light model (meVSL), the relationship between the luminosity distance ($D_{\\text{L}}$) and the angular diameter distance ($D_{\\text{A}}$), namely the cosmic distance duality relation (CDDR), is expected to deviate from $\\eta(z) \\equiv D_{\\text{L}}/D_{\\text{A}}(z)(1+z)^{-2} = 1$, making it a powerful probe to check a potential variation of fundamental constants. Hence, we test the viability of the meVSL model through the CDDR by comparing $D_{\\text{A}}$ measurements, provided by the transverse (2D) and anisotropic (3D) baryon acoustic oscillations (BAO) observations from different surveys, like SDSS, DES and DESI, in combination with $D_{\\text{L}}$ measurements from Pantheon+ type Ia Supernova (SNe) compilation. The Gaussian Process reconstruction is employed on the SN data to match $D_{\\text{A}}$ with $D_{\\text{L}}$ at the same redshift. We find no deviation of the standard CDDR relation within 1-2.6$\\sigma$ confidence level when considering SNe with 2D and 3D BAO samples combined together. However, when SNe and 2D BAO only are considered, the standard CDDR is only recovered at $\\sim 4\\sigma$ confidence level. However, such a result might be due to some recently discussed tensions between SN and BAO datasets, especially at low redshifts, in addition to possible inconsistencies between the BAO datasets individually. Therefore, our results show no significant evidence in favour of the meVSL model, once these potential systematics are taken into account.",
      "pdf_url": "https://arxiv.org/pdf/2505.15768.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21221",
      "title": "Forecasts of constraining isotropic cosmic birefringence on AliCPT-1",
      "authors": [
        "Jiazheng Dou",
        "Wen Zhao"
      ],
      "abstract": "Forecasts of constraining isotropic cosmic birefringence on AliCPT-1 Jiazheng Dou, Wen Zhao Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmic birefringence (CB) is a promising probe of parity-violating physics beyond the Standard Model, characterized by the rotation of the linear polarization plane of cosmic microwave background (CMB) photons. This effect, quantified by the birefringence angle $\\beta$, generates non-zero $EB$ and $TB$ correlations that are otherwise absent in standard cosmology. However, instrumental miscalibration angles $\\alpha$ can mimic this signal, necessitating a joint estimation approach. In this work, we forecast the sensitivity of the AliCPT experiment, combined with Planck HFI data, on constraining the isotropic CB angle using a semi-analytical maximum-likelihood method. We simulate observations under various foreground complexities, rotation angles, and scanning strategies, and demonstrate that AliCPT can achieve an uncertainty of $\\sigma(\\beta)=0.09^\\circ$ with one-year data, which will improve to $0.026^\\circ$ after four years' observations. We also find that neglecting or mismodeling the foreground $EB$ correlation will introduce significant biases, which can be alleviated under a clean but small sky patch.",
      "pdf_url": "https://arxiv.org/pdf/2510.21221.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21377",
      "title": "Luminosity-Dependent Assembly Bias of Central Galaxies from Weak Lensing and Clustering",
      "authors": [
        "Zhenjie Liu",
        "Hironao Miyatake",
        "Joop Schaye",
        "Matthieu Schaller",
        "Keitaro Ishikawa",
        "Tomomi Sunayama"
      ],
      "abstract": "Luminosity-Dependent Assembly Bias of Central Galaxies from Weak Lensing and Clustering Zhenjie Liu, Hironao Miyatake, Joop Schaye, Matthieu Schaller, Keitaro Ishikawa, Tomomi Sunayama 6 figures, 4 tables, 14 pages. Comments and suggestions are welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Assembly bias, which is the variation in halo clustering at fixed mass driven by formation history, has long been predicted by numerical simulations but remains difficult to confirm observationally. In this work, we present one of the first direct observational tests of luminosity-dependent assembly bias using a large sample of galaxy clusters with spectroscopically confirmed brightest cluster galaxies (BCGs). Combining galaxy-galaxy lensing and clustering measurements, we find evidence for assembly bias: brighter BCGs reside in more concentrated halos yet are less strongly clustered on large scales, yielding a relative bias ratio deviating from the unity at about the $3\\sigma$ level. Our findings are further supported by the FLAMINGO and MillenniumTNG hydrodynamical simulations, in which we directly detect assembly bias signals consistent with the observations, thereby confirming the connection between galaxy luminosity and halo formation history.",
      "pdf_url": "https://arxiv.org/pdf/2510.21377.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21633",
      "title": "Exploring the Co-SIMP dark matter model using the 21-cm signal from dark ages",
      "authors": [
        "Debarun Paul",
        "Sourav Pal",
        "Deepthi Moorkanat",
        "Antara Dey",
        "Amit Dutta Banik",
        "Rajesh Mondal"
      ],
      "abstract": "Exploring the Co-SIMP dark matter model using the 21-cm signal from dark ages Debarun Paul, Sourav Pal, Deepthi Moorkanat, Antara Dey, Amit Dutta Banik, Rajesh Mondal 11 pages, 10 figures, 3 tables. Comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The redshifted 21-cm signal from the dark ages offers a powerful probe of cosmological models and the underlying dark matter microphysics. We investigate deviations from the standard $\\Lambda$CDM prediction, an absorption trough of approximately $-40.6\\,\\mathrm{mK}$ at redshift $z \\simeq 85.6$, in the context of co-SIMP dark matter. The strength of co-SIMP interactions, quantified by the parameter $C_{\\rm int}$, enhances the absorption depth and shifts the trough to higher redshifts. For example, a model with $C_{\\rm int}=1.0$ produces a minimum brightness temperature of $-50.6\\,\\mathrm{mK}$ at $z \\simeq 86.2$. The 21-cm power spectrum increases with $C_{\\rm int}$ in addition to the global signal. We assess the detectability of these signatures using signal-to-noise ratio (SNR) and Fisher matrix forecasts. The maximum SNR reaches $\\sim 15.7$ for $C_{\\rm int}=1.0$ for the global signal. Fisher forecast for $1,000$ hours of integration time shows that this model can be distinguished from a null-signal at $4.3\\sigma$ and from the $\\Lambda$CDM model case at $1.6 \\sigma$, with order-of-magnitude improvements for 100,000 hours of integration. For the 21-cm power spectrum, our forecasts reveal complementary trends; with a modest setup (collecting area of $5\\,\\mathrm{km}^2$ and 1,000 hours of integration time), the $C_{\\rm int}=1.0$ model can be detected at $4.63\\sigma$ and differentiated from the standard scenario at $1.78 \\sigma$. These findings highlight the potential of the 21-cm cosmology to probe the properties of dark matter and demonstrate that upcoming dark ages experiments, particularly space-based and lunar observations, can offer a promising avenue to test co-SIMP models.",
      "pdf_url": "https://arxiv.org/pdf/2510.21633.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21694",
      "title": "HOLISMOKES XIX: SN 2025wny at $z=2$, the first strongly lensed superluminous supernova",
      "authors": [
        "Stefan Taubenberger",
        "Ana Acebron",
        "Raoul Cañameras",
        "Ting-Wan Chen",
        "Aymeric Galan",
        "Claudio Grillo",
        "Alejandra Melo",
        "Stefan Schuldt",
        "Allan G. Schweinfurth",
        "Sherry H. Suyu",
        "Greg Aldering",
        "Amar Aryan",
        "Yu-Hsing Lee",
        "Elias Mamuzic",
        "Martin Millon",
        "Thomas M. Reynolds",
        "Alexey V. Sergeyev",
        "Ildar M. Asfandiyarov",
        "Stéphane Basa",
        "Stéphane Blondin",
        "Otabek A. Burkhonov",
        "Lise Christensen",
        "Frederic Courbin",
        "Shuhrat A. Ehgamberdiev",
        "Tom L. Killestein",
        "Seppo Mattila",
        "Asadulla M. Shaymanov",
        "Yiping Shu",
        "Dong Xu",
        "Sheng Yang",
        "Daniel Gruen",
        "Justin D. R. Pierel",
        "Christopher J. Storfer",
        "Kim-Vy Tran",
        "Kenneth C. Wong",
        "Rosa L. Becerra",
        "Damien Dornic",
        "Jean-Grégoire Ducoin",
        "Noémie Globus",
        "Claudia P. Gutiérrez",
        "Ji-an Jiang",
        "Hanindyo Kuncarayakti",
        "Diego López-Cámara",
        "Peter Lundqvist",
        "Francesco Magnani",
        "Enrique Moreno Méndez",
        "Benjamin Schneider",
        "Christian Vogl"
      ],
      "abstract": "HOLISMOKES XIX: SN 2025wny at $z=2$, the first strongly lensed superluminous supernova Stefan Taubenberger, Ana Acebron, Raoul Cañameras, Ting-Wan Chen, Aymeric Galan, Claudio Grillo, Alejandra Melo, Stefan Schuldt, Allan G. Schweinfurth, Sherry H. Suyu, Greg Aldering, Amar Aryan, Yu-Hsing Lee, Elias Mamuzic, Martin Millon, Thomas M. Reynolds, Alexey V. Sergeyev, Ildar M. Asfandiyarov, Stéphane Basa, Stéphane Blondin, Otabek A. Burkhonov, Lise Christensen, Frederic Courbin, Shuhrat A. Ehgamberdiev, Tom L. Killestein, Seppo Mattila, Asadulla M. Shaymanov, Yiping Shu, Dong Xu, Sheng Yang, Daniel Gruen, Justin D. R. Pierel, Christopher J. Storfer, Kim-Vy Tran, Kenneth C. Wong, Rosa L. Becerra, Damien Dornic, Jean-Grégoire Ducoin, Noémie Globus, Claudia P. Gutiérrez, Ji-an Jiang, Hanindyo Kuncarayakti, Diego López-Cámara, Peter Lundqvist, Francesco Magnani, Enrique Moreno Méndez, Benjamin Schneider, Christian Vogl 9 pages, 6 figures, submitted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We present imaging and spectroscopic observations of supernova SN 2025wny, associated with the lens candidate PS1 J0716+3821. Photometric monitoring from the Lulin and Maidanak observatories confirms multiple point-like images, consistent with SN 2025wny being strongly lensed by two foreground galaxies. Optical spectroscopy of the brightest image with the Nordic Optical Telescope and the University of Hawaii 88-inch Telescope allows us to determine the redshift to be z_s = 2.008 +- 0.001, based on narrow absorption lines originating in the interstellar medium of the supernova host galaxy. At this redshift, the spectra of SN 2025wny are consistent with those of superluminous supernovae of Type I. We find a high ejecta temperature and depressed spectral lines compared to other similar objects. We also measure, for the first time, the redshift of the fainter of the two lens galaxies (the \"perturber\") to be z_p = 0.375 +- 0.001, fully consistent with the DESI spectroscopic redshift of the main deflector at z_d = 0.3754. SN 2025wny thus represents the first confirmed galaxy-scale strongly lensed supernova with time delays likely in the range of days to weeks, as judged from the image separations. This makes SN 2025wny suitable for cosmography, offering a promising new system for independent measurements of the Hubble constant. Following a tradition in the field of strongly-lensed SNe, we give SN 2025wny the nickname SN Winny.",
      "pdf_url": "https://arxiv.org/pdf/2510.21694.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20896",
      "title": "Direct Measurement of Galaxy Assembly Bias using DESI DR1 Data",
      "authors": [
        "Zhiwei Shao",
        "Ying Zu",
        "Andrés N. Salcedo",
        "Jiaqi Wang",
        "Xiaohu Yang",
        "David H. Weinberg",
        "Xiaoju Xu",
        "Zhongxu Zhai",
        "Zhuowen Zhang",
        "J. Aguilar",
        "S. Ahlen",
        "D. Bianchi",
        "D. Brooks",
        "R. Canning",
        "F. J. Castander",
        "T. Claybaugh",
        "S. Cole",
        "A. Cuceu",
        "A. de la Macorra",
        "Arjun Dey",
        "P. Doel",
        "S. Ferraro",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "S. Gontcho A Gontcho",
        "G. Gutierrez",
        "K. Honscheid",
        "C. Howlett",
        "D. Huterer",
        "M. Ishak",
        "R. Joyce",
        "T. Kisner",
        "A. Kremin",
        "O. Lahav",
        "C. Lamman",
        "M. Landriau",
        "L. Le Guillou",
        "M. E. Levi",
        "M. Manera",
        "A. Meisner",
        "R. Miquel",
        "J. Moustakas",
        "S. Nadathur",
        "N. Palanque-Delabrouille",
        "W. J. Percival",
        "F. Prada",
        "I. Pérez-Ràfols",
        "G. Rossi",
        "L. Samushia",
        "E. Sanchez",
        "D. Schlegel",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarlé",
        "B. A. Weaver",
        "R. Zhou",
        "H. Zou"
      ],
      "abstract": "Direct Measurement of Galaxy Assembly Bias using DESI DR1 Data Zhiwei Shao, Ying Zu, Andrés N. Salcedo, Jiaqi Wang, Xiaohu Yang, David H. Weinberg, Xiaoju Xu, Zhongxu Zhai, Zhuowen Zhang, J. Aguilar, S. Ahlen, D. Bianchi, D. Brooks, R. Canning, F. J. Castander, T. Claybaugh, S. Cole, A. Cuceu, A. de la Macorra, Arjun Dey, P. Doel, S. Ferraro, J. E. Forero-Romero, E. Gaztañaga, S. Gontcho A Gontcho, G. Gutierrez, K. Honscheid, C. Howlett, D. Huterer, M. Ishak, R. Joyce, T. Kisner, A. Kremin, O. Lahav, C. Lamman, M. Landriau, L. Le Guillou, M. E. Levi, M. Manera, A. Meisner, R. Miquel, J. Moustakas, S. Nadathur, N. Palanque-Delabrouille, W. J. Percival, F. Prada, I. Pérez-Ràfols, G. Rossi, L. Samushia, E. Sanchez, D. Schlegel, J. Silber, D. Sprayberry, G. Tarlé, B. A. Weaver, R. Zhou, H. Zou Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We report the first direct measurement of galaxy assembly bias, a critical systematic in cosmology, from the Dark Energy Spectroscopic Instrument (DESI) Bright Galaxy Survey. We introduce a novel, cosmology-independent method to measure the halo occupation distribution (HOD) by combining a state-of-the-art group catalog with weak gravitational lensing. For groups binned by total luminosity, we determine the galaxy occupation number $N_{\\rm gal}$ from group-galaxy cross-correlations, while weak lensing constrains the average halo mass $M_h$. Applying this to a volume-limited sample at $z{\\in}[0.05,0.2]$, we measure the dependence of HOD, $N_{\\rm gal}(M_h)$, on large-scale overdensity $\\delta_{g}$. Focusing on the satellite galaxies, we find an assembly bias parameter of $Q_{\\rm sat}{=}0.05{\\pm}0.14$, a result consistent with zero and in tension with many empirical galaxy formation models. Our method provides a robust approach for characterizing galaxy assembly bias to achieve precision cosmology with DESI and future Stage-V surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.20896.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21097",
      "title": "Detecting Population III Gamma-Ray Bursts in the Era of EP and SVOM",
      "authors": [
        "Jun-Jie Wei",
        "Qing-Bo Ma",
        "Xue-Feng Wu"
      ],
      "abstract": "Detecting Population III Gamma-Ray Bursts in the Era of EP and SVOM Jun-Jie Wei, Qing-Bo Ma, Xue-Feng Wu High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) High-redshift gamma-ray bursts (GRBs), putative counterparts of massive, low-metallicity Population III (Pop III) stars, are a promising probe of the first stars. We assess the detectability of these Pop III GRBs using a metallicity-based progenitor criterion and cosmological $N$-body/hydrodynamical simulations with three distinct Pop III initial mass functions (IMFs), focusing on the capabilities of the Wide-field X-ray Telescope (WXT) aboard the Einstein Probe (\\emph{EP}) and the coded-mask gamma-ray imager (ECLAIRs) aboard the Space-based multi-band astronomical Variable Objects Monitor (\\emph{SVOM}). Our population synthesis model, calibrated to \\emph{Swift} data, predicts the following Population II/I (Pop II/I) GRB detection rates at $z>6$: $\\sim2.4\\,\\mathrm{events\\,yr^{-1}}$ for \\emph{EP}/WXT and $\\sim0.9\\,\\mathrm{events\\,yr^{-1}}$ for \\emph{SVOM}/ECLAIRs. For the IMF with very massive first stars ($\\mathrm{100\\textrm{--}500\\,M_\\odot}$), we derive upper limits on the Pop III GRB rate at $z>6$ of $<0.06\\,\\mathrm{events\\,yr^{-1}}$ (\\emph{EP}/WXT) and $<0.13\\,\\mathrm{events\\,yr^{-1}}$ (\\emph{SVOM}/ECLAIRs), based on the absence of confirmed Pop III progenitors in \\emph{Swift} bursts at $z>5.5$. Our results indicate that while Pop III GRBs are subdominant to Pop II/I GRBs at $z<10$, their fractional contribution rises significantly with redshift, reaching $\\sim8\\%$ ($\\sim34\\%$) at $z>10$ and $\\sim28\\%$ ($\\sim68\\%$) at $z>16$ for \\emph{EP}/WXT (\\emph{SVOM}/ECLAIRs). This trend is systematically enhanced in the other two IMF models, which adopt a lower stellar mass range of $\\mathrm{[0.1,\\,100]\\,M_\\odot}$. We conclude that detecting Pop III GRBs at high redshifts is a realistic prospect, and any GRB detected at $z>16$ is most likely of Pop III origin.",
      "pdf_url": "https://arxiv.org/pdf/2510.21097.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21510",
      "title": "LEO Satellite Track Correction for CSST Multi-Band Imaging Data",
      "authors": [
        "Huai-Jin Tang",
        "Xiao-Lei Meng",
        "Hu Zhan",
        "Guo-Liang Li",
        "Cheng-Liang Wei",
        "Xian-Min Meng",
        "Xi-Yang Fu",
        "You-Hua Xu"
      ],
      "abstract": "LEO Satellite Track Correction for CSST Multi-Band Imaging Data Huai-Jin Tang, Xiao-Lei Meng, Hu Zhan, Guo-Liang Li, Cheng-Liang Wei, Xian-Min Meng, Xi-Yang Fu, You-Hua Xu Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Low Earth Orbit satellite (LEOsat) mega-constellations are considered to be an unavoidable source of contamination for survey observations to be carried out by the China Space Station Telescope (CSST) over the next decade. This study reconstructs satellite trail profiles based on simulated parameters, including brightness levels and orbital altitudes, in combination with multi-band simulated images. Compared to our previous work, the simulated images in this study more accurately replicate the realistic observational conditions of CSST and extend beyond single-band analysis. Variations in LEOsat trail brightness, source brightness, background noise, and source density across different bands result in differing levels of accuracy in trail reconstruction and subsequently affect the reliability of photometric measurements. The reconstructed trail profiles are subsequently applied to correct the contaminated regions. Simulation results reveal varying levels of contamination effects across different bands following LEOsat trail correction, including both reconstruction and subtraction. To evaluate the effectiveness of the correction, we quantified the fraction of affected sources using two metrics: (1) magnitude errors greater than 0.01 mag attributable to LEOsats, and (2) LEOsat-induced noise exceeding 10% of other noise contributions. Following trail repair, the analysis reveals a reduction of over 50% in the fraction of affected sources in the NUV band for both 550 km and 1200 km altitudes, assuming a maximum brightness of 7 in the V band. In the i band, the reduction exceeds 30%. The degree of improvement varies across spectral bands, and depends on both satellite altitude and the adopted brightness model.",
      "pdf_url": "https://arxiv.org/pdf/2510.21510.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.07713",
      "title": "Geometric Interpretations of the $k$-Nearest Neighbour Distributions",
      "authors": [
        "Kwanit Gangopadhyay",
        "Arka Banerjee",
        "Tom Abel"
      ],
      "abstract": "Geometric Interpretations of the $k$-Nearest Neighbour Distributions Kwanit Gangopadhyay, Arka Banerjee, Tom Abel 21 pages, 15 figures. Published in MNRAS Mon Not R Astron Soc (2025) 3409-3427 Cosmology and Nongalactic Astrophysics (astro-ph.CO) The $k$-Nearest Neighbour Cumulative Distribution Functions are measures of clustering for discrete datasets that are fast and efficient to compute. They are significantly more informative than the 2-point correlation function. Their connection to $N$-point correlation functions, void probability functions and Counts-in-Cells is known. However, the connections between the CDFs and other geometric and topological spatial summary statistics are yet to be fully explored in the literature. This understanding will be crucial to find optimally informative summary statistics to analyse data from stage 4 cosmological surveys. We explore quantitatively the geometric interpretations of the $k$NN CDF summary statistics. We establish an equivalence between the 1NN CDF at radius $r$ and the volume of spheres with the same radius around the data points. We show that higher $k$NN CDFs are equivalent to the volumes of intersections of $\\ge k$ spheres around the data points. We present similar geometric interpretations for the $k$NN cross-correlation joint CDFs. We further show that the volume, or the CDFs, have information about the angles and arc lengths created at the intersections of spheres around the data points, which can be accessed through the derivatives of the CDF. We show this information is very similar to that captured by Germ Grain Minkowski Functionals. Using a Fisher analysis we compare the information content and constraining power of various data vectors constructed from the $k$NN CDFs and Minkowski Functionals. We find that the CDFs and their derivatives and the Minkowski Functionals have nearly identical information content. However, $k$NN CDFs are computationally orders of magnitude faster to evaluate. Finally, we find that there is information in the full shape of the CDFs, and therefore caution against using the values of the CDF only at sparsely sampled radii.",
      "pdf_url": "https://arxiv.org/pdf/2502.07713.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.06269",
      "title": "Accurately simulating core-collapse self-interacting dark matter halos",
      "authors": [
        "Moritz S. Fischer",
        "Hai-Bo Yu",
        "Klaus Dolag"
      ],
      "abstract": "Accurately simulating core-collapse self-interacting dark matter halos Moritz S. Fischer, Hai-Bo Yu, Klaus Dolag 14 pages, 16 figures + appendices, accepted for publication in A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph) The properties of satellite halos provide a promising probe for dark matter (DM) physics. Observations have motivated current efforts to explain surprisingly compact DM halos. If DM is not collisionless, but has strong self-interactions, halos can undergo gravothermal collapse, leading to higher densities in the central region of the halo. However, it is challenging to model this collapse phase from first principles. To improve on this, we sought to better understand the numerical challenges and convergence properties of self-interacting dark matter (SIDM) N-body simulations in the collapse phase. Especially, our aim was to better understand the evolution of satellite halos. To do so, we ran SIDM N-body simulations of a low-mass halo in isolation and within an external gravitational potential. The simulation set-up was motivated by the perturber of the stellar stream GD-1. We find that the halo evolution is very sensitive to energy conservation errors, and a SIDM kernel size that is too large can artificially speed up the collapse. Moreover, we demonstrate that the King model can describe the density profile at small radii for the late stages that we have simulated. Furthermore, for our most highly resolved simulation (N = 5x10^7) we have made the data public. It can serve as a benchmark. Overall, we find that the current numerical methods do not suffer from convergence problems in the late collapse phase and provide guidance on how to choose numerical parameters, for example that the energy conservation error is better kept well below 1%. This allows simulations to be run of halos that become concentrated enough to explain observations of GD-1-like stellar streams or strong gravitational lensing systems.",
      "pdf_url": "https://arxiv.org/pdf/2506.06269.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.22109",
      "title": "Field-level constraints on cosmic birefringence from hybrid ILC maps combining $E$- and $B$-mode channels",
      "authors": [
        "Mathieu Remazeilles"
      ],
      "abstract": "Field-level constraints on cosmic birefringence from hybrid ILC maps combining $E$- and $B$-mode channels Mathieu Remazeilles 41 pages, 14 figures, 3 tables. Updated to match version accepted by JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmic birefringence, arising from a potential parity-violating interaction between cosmic microwave background (CMB) photons and evolving pseudo-scalar fields such as axion-like particles, can rotate the CMB polarization plane and induce an effective correlation between the CMB $E$- and $B$-mode polarization. In this work, we introduce a hybrid internal linear combination (ILC) method that combines both $E$- and $B$-mode frequency maps into the component separation pipeline, enabling the disentanglement of correlated and uncorrelated components of CMB polarization in the presence of cosmic birefringence and instrumental polarization angle miscalibration. We derive an analytic linear relation connecting the birefringence-induced correlated component of the CMB $E$- (or $B$-) mode field to the full CMB $B$- (or $E$-) mode field convolved with a modulating field. By performing linear regression between these fields across multiple sky patches, we directly estimate the birefringence angle at the field level. This allows us to distinguish cosmic birefringence from polarization angle miscalibration and foreground contamination, as the ILC responds differently to achromatic cosmic birefringence and chromatic systematic effects, with its weights projecting spatial or harmonic dependence only onto the latter. This non-parametric, field-level approach provides a novel way to probe cosmic birefringence directly in real space. When applied to realistic simulations of the forthcoming LiteBIRD satellite mission, our method yields constraints that are competitive with, and complementary to, existing power spectrum-based analyses. When applied to Planck Release 4 (PR4) data, we find a birefringence angle of $\\beta = 0.32^\\circ \\pm 0.12^\\circ$, a $2.7\\sigma$ detection that remains robust against varying sky fractions.",
      "pdf_url": "https://arxiv.org/pdf/2507.22109.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13805",
      "title": "$\\texttt{SBi3PCF:}$ Simulation-based inference with the integrated 3PCF",
      "authors": [
        "David Gebauer",
        "Anik Halder",
        "Stella Seitz",
        "Dhayaa Anbajagane"
      ],
      "abstract": "$\\texttt{SBi3PCF:}$ Simulation-based inference with the integrated 3PCF David Gebauer, Anik Halder, Stella Seitz, Dhayaa Anbajagane 28 pages + appendix. 21 figures. Comments are welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present $\\texttt{SBi3PCF}$, a simulation-based inference (SBI) framework for analysing a higher-order weak lensing statistic, the integrated 3-point correlation function (i3PCF). Our approach forward-models the cosmic shear field using the $\\texttt{CosmoGridV1}$ suite of N-body simulations, including a comprehensive set of systematic effects such as intrinsic alignment, baryonic feedback, photometric redshift uncertainty, shear calibration bias, and shape noise. Using this, we have produced a set of DES Y3-like synthetic measurements for 2-point shear correlation functions $\\xi_{\\pm}$ (2PCFs) and i3PCFs $\\zeta_{\\pm}$ across 6 cosmological and 11 systematic parameters. Having validated these measurements against theoretical predictions and thoroughly examined for potential systematic biases, we have found that the impact of source galaxy clustering and reduced shear on the i3PCF is negligible for Stage-III surveys. Furthermore, we have tested the Gaussianity assumption for the likelihood of our data vector and found that while the sampling distribution of the 2PCF can be well approximated by a Gaussian function, the likelihood of the combined 2PCF + i3PCF data vector including filter sizes of $90'$ and larger can deviate from this assumption. Our SBI pipeline employs masked autoregressive flows to perform neural likelihood estimation and is validated to give statistically accurate posterior estimates. On mock data, we find that including the i3PCF yields a substantial $63.8\\%$ median improvement in the figure of merit for $\\Omega_m - \\sigma_8 - w_0$. These findings are consistent with previous works on the i3PCF and demonstrate that our SBI framework can achieve the accuracy and realism needed to analyse the i3PCF in wide-area weak lensing surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.13805.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.15835",
      "title": "Constraints on neutrino mass and dark energy agnostic to the sound horizon",
      "authors": [
        "Ravi Kumar Sharma",
        "Julien Lesgourgues"
      ],
      "abstract": "Constraints on neutrino mass and dark energy agnostic to the sound horizon Ravi Kumar Sharma, Julien Lesgourgues 18 pages, 6 figures; v2: several additional references; expanded discussion; inclusion of KATRIN prior Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recent BAO observations from DESI DR2 either hint at a possible dynamical dark energy component, which would worsen the Hubble tension, or at a 95\\% credible interval for the summed neutrino mass hardly compatible with neutrino oscillation experiments. In this context, it is interesting to investigate constraints on neutrino masses, dark energy and the Hubble parameter that are agnostic to some aspects of the cosmological model. Here we choose to be agnostic to the value of the sound horizon at recombination, while sticking to standard assumptions regarding the time of recombination and the growth of structures. To be consistent, we also disregard information on the full shape of the CMB temperature and polarization spectrum on sub-degree scale. With such agnostic and conservative assumptions, using data mainly on uncalibrated distances, the growth of structures, and laboratory bounds on tritium $\\beta$-decay, we find that: (i) the dark energy evolution is well constrained by uncalibrated data on angular and luminosity distances, with a mild preference for dynamical dark energy, independently of the value of the sound horizon; (ii) large values of the Hubble rate are favored, $H_0=74.7^{+3.4}_{-4.4}$ km/s/Mpc (68\\%CL), together with low values of the sound horizon, $r_{\\rm s}=131.1^{+6.8}_{-6.9}$ Mpc (68\\%CL); the SH0ES value of $H_0$ is thus marginally preferred over the low value returned by the standard inverse distance ladder analysis; (iii) the cosmological neutrino mass bound relaxes to $\\sum m_\\nu = 0.69^{+0.33}_{-0.47}$ eV (68\\%CL) and becomes well compatible with the normal and inverted neutrino mass schemes.",
      "pdf_url": "https://arxiv.org/pdf/2510.15835.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.15315",
      "title": "Euclid Quick Data Release (Q1). A probabilistic classification of quenched galaxies",
      "authors": [
        "Euclid Collaboration: P. Corcho-Caballero",
        "Y. Ascasibar",
        "G. Verdoes Kleijn",
        "C. C. Lovell",
        "G. De Lucia",
        "C. Cleland",
        "F. Fontanot",
        "C. Tortora",
        "L. V. E. Koopmans",
        "S. Eales",
        "T. Moutard",
        "C. Laigle",
        "A. Nersesian",
        "F. Shankar",
        "M. Dunn",
        "N. Aghanim",
        "B. Altieri",
        "A. Amara",
        "S. Andreon",
        "H. Aussel",
        "C. Baccigalupi",
        "M. Baldi",
        "A. Balestra",
        "S. Bardelli",
        "P. Battaglia",
        "A. Biviano",
        "A. Bonchi",
        "D. Bonino",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "S. Casas",
        "F. J. Castander",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "A. Costille",
        "F. Courbin",
        "H. M. Courtois",
        "M. Cropper",
        "A. Da Silva",
        "H. Degaudenzi",
        "A. M. Di Giorgio",
        "C. Dolding",
        "H. Dole",
        "F. Dubath",
        "X. Dupac",
        "A. Ealet",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "S. Fotopoulou",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "B. R. Granett",
        "A. Grazian",
        "F. Grupp",
        "L. Guzzo",
        "S. Gwyn",
        "S. V. H. Haugan",
        "W. Holmes",
        "I. M. Hook",
        "F. Hormuth",
        "A. Hornstrup",
        "P. Hudelot",
        "K. Jahnke",
        "M. Jhabvala",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "B. Kubik",
        "K. Kuijken",
        "M. Kümmel",
        "M. Kunz",
        "H. Kurki-Suonio",
        "Q. Le Boulc'h",
        "A. M. C. Le Brun",
        "D. Le Mignant",
        "S. Ligori"
      ],
      "abstract": "Euclid Quick Data Release (Q1). A probabilistic classification of quenched galaxies Euclid Collaboration: P. Corcho-Caballero (1), Y. Ascasibar (2 and 3), G. Verdoes Kleijn (1), C. C. Lovell (4), G. De Lucia (5), C. Cleland (6), F. Fontanot (5 and 7), C. Tortora (8), L. V. E. Koopmans (1), S. Eales (9), T. Moutard (10), C. Laigle (11), A. Nersesian (12 and 13), F. Shankar (14), M. Dunn (15 and 16 and 17), N. Aghanim (18), B. Altieri (10), A. Amara (19), S. Andreon (20), H. Aussel (21), C. Baccigalupi (7 and 5 and 22 and 23), M. Baldi (24 and 25 and 26), A. Balestra (27), S. Bardelli (25), P. Battaglia (25), A. Biviano (5 and 7), A. Bonchi (28), D. Bonino (29), E. Branchini (30 and 31 and 20), M. Brescia (32 and 8), J. Brinchmann (33 and 34), G. Cañas-Herrera (35 and 36 and 37), V. Capobianco (29), C. Carbone (38), J. Carretero (39 and 40), S. Casas (41), F. J. Castander (42 and 43), M. Castellano (44), G. Castignani (25), S. Cavuoti (8 and 45), K. C. Chambers (46), A. Cimatti (47), C. Colodro-Conde (15), G. Congedo (48), C. J. Conselice (49), L. Conversi (50 and 10), Y. Copin (51), A. Costille (52), F. Courbin (53 and 54), H. M. Courtois (55), M. Cropper (56), A. Da Silva (57 and 58), H. Degaudenzi (59), A. M. Di Giorgio (60), C. Dolding (56), H. Dole (18), F. Dubath (59), X. Dupac (10), A. Ealet (51), S. Escoffier (61), M. Farina (60), R. Farinelli (25), F. Faustini (28 and 44), S. Ferriol (51), F. Finelli (25 and 62), S. Fotopoulou (63), M. Frailis (5), E. Franceschi (25), M. Fumana (38), S. Galeotta (5), K. George (64), B. Gillis (48), C. Giocoli (25 and 26), J. Gracia-Carpio (65), B. R. Granett (20), A. Grazian (27), F. Grupp (65 and 64), L. Guzzo (66 and 20 and 67), S. Gwyn (68), S. V. H. Haugan (69), W. Holmes (70), I. M. Hook (71), F. Hormuth (72), A. Hornstrup (73 and 74), P. Hudelot (11), K. Jahnke (75), M. Jhabvala (76), E. Keihänen (77), S. Kermiche (61), A. Kiessling (70), B. Kubik (51), K. Kuijken (37), M. Kümmel (64), M. Kunz (78), H. Kurki-Suonio (79 and 80), Q. Le Boulc'h (81), A. M. C. Le Brun (82), D. Le Mignant (52), S. Ligori Paper accepted for publication as part of the A&A Special Issue `Euclid Quick Data Release (Q1)', 28 pages, 11 figures (+ 3 appendices) Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Investigating what drives the quenching of star formation in galaxies is key to understanding their evolution. The Euclid mission will provide rich data from optical to infrared wavelengths for millions of galaxies, and enable precise measurements of their star formation histories. Using the first Euclid Quick Data Release (Q1), we developed a probabilistic classification framework that combines the average specific star-formation rate inferred over two timescales ($10^8,10^9$ yr) to categorise galaxies as `ageing' (secularly evolving), `quenched' (recently halted star formation), or `retired' (dominated by old stars). Two classification methods were employed: a probabilistic approach, which integrates posterior distributions, and a model-driven method, which optimises sample purity and completeness using IllustrisTNG. At $z<0.1$ and $M_\\ast \\gtrsim 3\\times10^{8}\\,M_\\odot$, we obtain Euclid class fractions of 68-72\\%, 8-17\\%, and 14-19\\% for ageing, quenched, and retired populations, respectively. Ageing and retired galaxies dominate at the low- and high-mass end, respectively, while quenched galaxies surpass the retired fraction for $M_\\ast \\lesssim 10^{10}\\,\\rm M_\\odot$. The evolution with redshift shows increasing and decreasing fractions of ageing and retired galaxies, respectively. More massive galaxies usually undergo quenching episodes at earlier times than to their low-mass counterparts. In terms of the mass-size-metallicity relation, ageing galaxies generally exhibit disc morphologies and low metallicities. Retired galaxies show compact structures and enhanced chemical enrichment, while quenched galaxies form an intermediate population that is more compact and chemically evolved than ageing systems. This work demonstrates Euclid's great potential for elucidating the physical nature of the quenching mechanisms that govern galaxy evolution.",
      "pdf_url": "https://arxiv.org/pdf/2503.15315.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.17820",
      "title": "A Metal-Free Galaxy at $z = 3.19$? Evidence of Late Population III Star Formation at Cosmic Noon",
      "authors": [
        "Sijia Cai",
        "Mingyu Li",
        "Zheng Cai",
        "Yunjing Wu",
        "Fujiang Yu",
        "Mark Dickinson",
        "Fengwu Sun",
        "Xiaohui Fan",
        "Ben Wang",
        "Fergus Cullen",
        "Fuyan Bian",
        "Xiaojing Lin",
        "Jiaqi Zou"
      ],
      "abstract": "A Metal-Free Galaxy at $z = 3.19$? Evidence of Late Population III Star Formation at Cosmic Noon Sijia Cai, Mingyu Li, Zheng Cai, Yunjing Wu, Fujiang Yu, Mark Dickinson, Fengwu Sun, Xiaohui Fan, Ben Wang, Fergus Cullen, Fuyan Bian, Xiaojing Lin, Jiaqi Zou 12 pages, 4 figures, 2 tables. Accepted version for ApJL. Comments welcome! Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Star formation from metal-free gas, the hallmark of the first generation of Population III stars, was long assumed to occur only in the very early Universe. We report the discovery of MPG-CR3 (Metal-Pristine Galaxy COSMOS Redshift 3; hereafter CR3), an extremely metal-poor galaxy at redshift $z= 3.193\\pm0.016$. From JWST, VLT, and Subaru observations, CR3 exhibits exceptionally strong Ly$\\alpha$, H$\\alpha$, and He I $\\lambda$10830 emission. We measure rest-frame equivalent widths of EW$_0$(Ly$\\alpha$) $=822\\pm101$ Angstrom and EW$_0$(H$\\alpha$) $=2814\\pm327$ Angstrom, among the highest seen in star-forming systems. No metal lines, e.g. [O III] $\\lambda\\lambda4959,5007$, C IV $\\lambda\\lambda1548,1550$, have statistically significant detections, placing a 2-$\\sigma$ upper limit on the gas-phase metallicity of 12+log(O/H) < 6.52 ($Z < 7\\times10^{-3}\\ Z_\\odot$) with strong-line calibration established by JWST, making it the most metal-poor galaxy known at cosmic noon. Considering systematic uncertainties of $\\gtrsim 0.3$ dex in the calibrations, the most conservative 2-$\\sigma$ upper limit is set to 12+log(O/H) < 6.95. The observed Ly$\\alpha$/H$\\alpha$ flux ratio is $13.9\\pm2.5$, indicating negligible dust attenuation. Spectral energy distribution modeling with Pop III stellar templates indicates a very young ($\\sim2$ Myr), low-mass ($M_* \\approx 6.1\\times 10^5 M_\\odot$) stellar population. Further, the photometric redshifts reveal that CR3 could reside in a slightly underdense environment ($\\delta \\approx -0.12$). CR3 provides evidence that first-generation star formation could persist well after the epoch of reionization, challenging the conventional view that pristine star formation ended by $z\\gtrsim6$.",
      "pdf_url": "https://arxiv.org/pdf/2507.17820.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20833",
      "title": "Embedding Reliability for Unsupervised Classification of Gamma Ray Burst progenitors from Prompt Gamma-ray Emission",
      "authors": [
        "Nicoló Cibrario",
        "Michela Negro"
      ],
      "abstract": "Embedding Reliability for Unsupervised Classification of Gamma Ray Burst progenitors from Prompt Gamma-ray Emission Nicoló Cibrario, Michela Negro High Energy Astrophysical Phenomena (astro-ph.HE) We present a statistical method based on scDEED to assess the reliability of a 2D embedding showing a low-dimensional representation of the distribution of Gamma-Ray Bursts (GRBs) detected by the Fermi Gamma-ray Burst Monitor (GBM). The original dataset consists of 12 waterfall plots for each event, which contain key information about the prompt emission of each GRB. The dataset's dimensionality is first reduced to a 30-dimensional latent space using an autoencoder, and subsequently to 2D using UMAP. While the methodology and results are discussed in a previous work (arXiv:2406.03643), here we introduce a statistical approach to evaluate the reliability of the final 2D distribution based on the scDEED algorithm. Our analysis shows that the 2D embedding demonstrates overall good reliability, with more than 90\\% of the events classified as trustworthy.",
      "pdf_url": "https://arxiv.org/pdf/2510.20833.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20904",
      "title": "It's always the quiet ones: Single Degenerate Double Detonation Type Ia Supernova from Quiescent Helium Accretion",
      "authors": [
        "Amir Michaelis",
        "Yael Hillman",
        "Hagai B. Perets"
      ],
      "abstract": "It's always the quiet ones: Single Degenerate Double Detonation Type Ia Supernova from Quiescent Helium Accretion Amir Michaelis, Yael Hillman, Hagai B. Perets High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We investigate a sub-Chandrasekhar mass double detonation pathway for Type Ia supernovae arising from single degenerate helium accreting carbon-oxygen white dwarfs. Building on our previous one dimensional study of recurrent helium novae (Hillman et al. 2025), we evolve a 0.7 solar mass white dwarf through steady accretion at 10^-8 Msun yr^-1 until it reaches 1.1 solar mass, yielding realistic, time evolved helium rich profiles. These profiles are mapped into FLASH simulations, incorporating nuclear burning for helium and carbon-oxygen detonation, in multi-dimensional hydrodynamic runs. A localized, modest temperature perturbation near the base of the helium shell robustly triggers an outward helium-shell detonation. The ensuing inward propagating shock converges in the carbon-oxygen core, igniting a secondary detonation that unbinds the star. We obtain a Ni56 yield of ~0.64 solar mass, an intermediate-mass element (Si-Ca) mass of ~0.41 solar mass, and maximum ejecta velocities approaching 22,000 km/s, values consistent with normal Type Ia supernovae. Our results demonstrate that recurrent helium accretors, typically quiescent over long timescales, can evolve under subtle, \"quiet\" conditions to trigger robust double detonations, supporting their role as viable progenitors of sub-Chandrasekhar mass Type Ia supernovae.",
      "pdf_url": "https://arxiv.org/pdf/2510.20904.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20911",
      "title": "Auger@TA: In-situ Cross-Calibration of the World's Largest Cosmic Ray Observatories",
      "authors": [
        "Adriel G B Mocellin",
        "J. Caraça-Valente",
        "C. Covault",
        "E. Dalcan",
        "T. Fujii",
        "S. Im",
        "R. James",
        "J. Johnsen",
        "K.H. Kampert",
        "H. Kern",
        "J.N. Matthews",
        "E. Mayotte",
        "S. Mayotte",
        "X. Moskala",
        "H. Que",
        "J. Rautenberg",
        "M. Roth",
        "H. Sagawa",
        "T. Sako",
        "F. Sarazin",
        "R. Sato",
        "D. Schmidt",
        "S.B. Thomas",
        "G. Wörner"
      ],
      "abstract": "Auger@TA: In-situ Cross-Calibration of the World's Largest Cosmic Ray Observatories Adriel G B Mocellin, J. Caraça-Valente, C. Covault, E. Dalcan, T. Fujii, S. Im, R. James, J. Johnsen, K.H. Kampert, H. Kern, J.N. Matthews, E. Mayotte, S. Mayotte, X. Moskala, H. Que, J. Rautenberg, M. Roth, H. Sagawa, T. Sako, F. Sarazin, R. Sato, D. Schmidt, S.B. Thomas, G. Wörner (for the Pierre Auger and Telescope Array Collaborations) Presented at the 39th International Cosmic Ray Conference (ICRC 2025). 15 pages. 5 figures High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) The Pierre Auger Observatory (Auger) and the Telescope Array (TA) are the world's two largest ultra-high-energy cosmic ray (UHECR) observatories. They operate in the Southern and Northern hemispheres, respectively, at similar latitudes but with distinct surface detector (SD) designs. A significant challenge in studying UHECR physics across the full sky is the apparent discrepancy in flux measurements between the two experiments. This discrepancy could arise from astrophysical differences and/or systematic effects related to their detector designs and sensitivities to extensive air shower components. To address this, the Auger@TA working group aims to cross-calibrate the two observatories with a self-triggering micro-Auger array within the TA array. This micro-array consists of eight Auger Surface Detector (SD) stations equipped with Water Cherenkov Detectors (WCDs) and AugerPrime Surface Scintillator Detectors. Seven SD stations, configured with a centered-1-PMT design, are arranged in a hexagonal pattern with one station in the center, with 1.5 km spacing, mirroring the Auger layout. The eighth station, which features a standard 3-PMT Auger station, is located in conjunction with a TA detector at the center of the hexagon, forming a triplet for high-statistics and low-uncertainty cross-calibration. A custom communication system that uses readily available components enables seamless communication between stations and remote access to each station through a central computer. The micro-array is now fully deployed, and initial data-taking is about to start. This presentation will detail the instrumentation, communication systems, central data acquisition system, expected performance of the micro-array, and preliminary results as appropriate.",
      "pdf_url": "https://arxiv.org/pdf/2510.20911.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20913",
      "title": "Multiwavelength view of circumstellar interaction in supernovae",
      "authors": [
        "Poonam Chandra"
      ],
      "abstract": "Multiwavelength view of circumstellar interaction in supernovae Poonam Chandra (National Radio Astronomy Observatory) 47 Pages, 11 Figures, 7 Tables. Figure 1 has an elaborated supernova classification scheme. Review paper, to appear in the journal \"Universe\", in the special issue \"A Multiwavelength View of Supernovae\" High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The interaction of post-explosion supernova ejecta with the surrounding circumstellar medium creates emission across the electromagnetic spectrum. Since the circumstellar medium is created by the mass lost from the progenitor star, it carries tell-tale signatures of the progenitor. Consequently, observations and modeling of radiation produced by the interaction in various types of supernovae have provided valuable insights into their progenitors. Detailed studies have shown that the interaction in supernovae begins and sustains over various timescales and lengthscales, with differing mass-loss rates in distinct sub-classes. This reveals diverse progenitor histories for these stellar explosions. This review paper summarizes various supernova subtypes, linking them to stellar death pathways, and presents an updated supernova classification diagram. We then present a multi-wavelength study of circumstellar interaction in different supernova classes. We also present unpublished Chandra X-ray as well as radio observations of a type IIn supernova, SN 2010jl, which allow us to extend its circumstellar interaction studies to about 7 years post-explosion. The new data indicates that the extreme mass-loss rate 0.1 Msun/yr in SN 2010jl, reported by Chandra et al. (2015), commenced within the last 300 years before the explosion. We summarize the current status of the field and argue that via detailed studies of the circumstellar interaction, a.k.a. Time Machine technique, one of the big mysteries of stellar evolution, i.e., mapping supernovae progenitors to their explosive outcomes can be solved.",
      "pdf_url": "https://arxiv.org/pdf/2510.20913.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20989",
      "title": "Spectroscopic Classification of Extragalactic Transients from CRTS",
      "authors": [
        "A.J. Drake",
        "S.G. Djorgovski",
        "M.J. Graham",
        "D. Stern",
        "A.A. Mahabal",
        "M. Catelan",
        "J.L. Prieto",
        "S. Larson"
      ],
      "abstract": "Spectroscopic Classification of Extragalactic Transients from CRTS A.J. Drake, S.G. Djorgovski, M.J. Graham, D. Stern, A.A. Mahabal, M. Catelan, J.L. Prieto, S. Larson High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) The Catalina Real-time Transient Survey (CRTS) carried out a public survey for optical transients between 2007 and 2019, discovering more than 16,000 transient candidates. Here we present the spectra and highlight the results of the spectroscopic follow-up of CRTS extragalactic transients. As expected, we find that the bulk of these transients are normal supernovae. However, as we prioritised transients exhibiting unusual features or environments during our spectroscopic follow-up, we focus on the rarer types of transients. These objects include more than a dozen type-I superluminous supernovae and dozens of type-I and II supernovae that underwent circumstellar medium interactions. We highlight several specific supernovae, including a new analysis of SN 2008iy, a type-IIn which exhibited a bright pre-supernova outburst event similar to SN 2009ip and lasted more than 1800 days; CSS111225:140122+161705, a type-I supernova that showed an extreme 2.5 magnitude rebrightening event more than 200 days after its initial outburst; and SN 2009ny, a type-Ibn supernova that exhibited strong helium emission lines similar to SN 2002ao. We confirm our previous finding that numerous CRTS transients are associated with galaxies of extremely low luminosity. We discuss the difficulty in determining the origin of transients associated with outbursts in active galactic nuclei (AGN), tidal disruption events, and type-IIn supernovae. As an example, we present CSS150120:110008+385352, a CRTS transient similar to CSS100217:102913+404220 that occurred within a quiescent AGN and peaked at Mv = -23.6.",
      "pdf_url": "https://arxiv.org/pdf/2510.20989.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21104",
      "title": "Observation of In-ice Askaryan Radiation from High-Energy Cosmic Rays",
      "authors": [
        "ARA Collaboration: N. Alden",
        "S. Ali",
        "P. Allison",
        "S. Archambault",
        "J.J. Beatty",
        "D.Z. Besson",
        "A. Bishop",
        "P. Chen",
        "Y.C. Chen",
        "Y.-C. Chen",
        "S. Chiche",
        "B.A. Clark",
        "A. Connolly",
        "K. Couberly",
        "L. Cremonesi",
        "A. Cummings",
        "P. Dasgupta",
        "R. Debolt",
        "S. de Kockere",
        "K.D. de Vries",
        "C. Deaconu",
        "M.A. DuVernois",
        "J. Flaherty",
        "E. Friedman",
        "R. Gaior",
        "P. Giri",
        "J. Hanson",
        "N. Harty",
        "K.D. Hoffman",
        "M.-H. Huang",
        "K. Hughes",
        "A. Ishihara",
        "A. Karle",
        "J.L. Kelley",
        "K.-C. Kim",
        "M.-C. Kim",
        "I. Kravchenko",
        "R. Krebs",
        "C.Y. Kuo",
        "K. Kurusu",
        "U.A. Latif",
        "C.H. Liu",
        "T.C. Liu",
        "W. Luszczak",
        "A. Machtay",
        "K. Mase",
        "M.S. Muzio",
        "J. Nam",
        "R.J. Nichol",
        "A. Novikov",
        "A. Nozdrina",
        "E. Oberla",
        "C.W. Pai",
        "Y. Pan",
        "C. Pfendner",
        "N. Punsuebsay",
        "J. Roth",
        "A. Salcedo-Gomez",
        "D. Seckel",
        "M.F.H. Seikh",
        "Y.-S. Shiao",
        "J. Stethem",
        "S.C. Su",
        "S. Toscano",
        "J. Torres",
        "J. Touart",
        "N. van Eijndhoven",
        "A. Vieregg",
        "M. Vilarino Fostier",
        "M.-Z. Wang",
        "S.-H. Wang",
        "P. Windischhofer",
        "S.A. Wissel",
        "C. Xie",
        "S. Yoshida",
        "R. Young"
      ],
      "abstract": "Observation of In-ice Askaryan Radiation from High-Energy Cosmic Rays ARA Collaboration: N. Alden, S. Ali, P. Allison, S. Archambault, J.J. Beatty, D.Z. Besson, A. Bishop, P. Chen, Y.C. Chen, Y.-C. Chen, S. Chiche, B.A. Clark, A. Connolly, K. Couberly, L. Cremonesi, A. Cummings, P. Dasgupta, R. Debolt, S. de Kockere, K.D. de Vries, C. Deaconu, M.A. DuVernois, J. Flaherty, E. Friedman, R. Gaior, P. Giri, J. Hanson, N. Harty, K.D. Hoffman, M.-H. Huang, K. Hughes, A. Ishihara, A. Karle, J.L. Kelley, K.-C. Kim, M.-C. Kim, I. Kravchenko, R. Krebs, C.Y. Kuo, K. Kurusu, U.A. Latif, C.H. Liu, T.C. Liu, W. Luszczak, A. Machtay, K. Mase, M.S. Muzio, J. Nam, R.J. Nichol, A. Novikov, A. Nozdrina, E. Oberla, C.W. Pai, Y. Pan, C. Pfendner, N. Punsuebsay, J. Roth, A. Salcedo-Gomez, D. Seckel, M.F.H. Seikh, Y.-S. Shiao, J. Stethem, S.C. Su, S. Toscano, J. Torres, J. Touart, N. van Eijndhoven, A. Vieregg, M. Vilarino Fostier, M.-Z. Wang, S.-H. Wang, P. Windischhofer, S.A. Wissel, C. Xie, S. Yoshida, R. Young High Energy Astrophysical Phenomena (astro-ph.HE) We present the first experimental evidence for in-ice Askaryan radiation -- coherent charge-excess radio emission -- from high-energy particle cascades developing in the Antarctic ice sheet. In 208 days of data recorded with the phased-array instrument of the Askaryan Radio Array, a previous analysis has incidentally identified 13 events with impulsive radiofrequency signals originating from below the ice surface. We here present a detailed reanalysis of these events. The observed event rate, radiation arrival directions, signal shape, spectral content, and electric field polarization are consistent with in-ice Askaryan radiation from cosmic ray air shower cores impacting the ice sheet. For the brightest events, the angular radiation pattern favors an extended cascade-like emitter over a pointlike source. An origin from the geomagnetic separation of charges in cosmic ray air showers is disfavored by the arrival directions and polarization. Considering the arrival angles, timing properties, and the impulsive nature of the passing events, the event rate is inconsistent with the estimation of the combined background from thermal noise events and on-surface events at the level of $5.1\\,\\sigma$.",
      "pdf_url": "https://arxiv.org/pdf/2510.21104.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21187",
      "title": "Dissipation and particle acceleration at intermittent structures with velocity and magnetic shear: Interaction of Kelvin-Helmholtz and Drift-Kink instabilities",
      "authors": [
        "Tsun Hin Navin Tsung",
        "Gregory R. Werner",
        "Dmitri A. Uzdensky",
        "Mitchell C. Begelman"
      ],
      "abstract": "Dissipation and particle acceleration at intermittent structures with velocity and magnetic shear: Interaction of Kelvin-Helmholtz and Drift-Kink instabilities Tsun Hin Navin Tsung, Gregory R. Werner, Dmitri A. Uzdensky, Mitchell C. Begelman 26 pages, 15 figures, submitted to JPP High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) We present two-dimensional (2D) particle-in-cell simulations of a magnetized, collisionless, relativistic pair plasma subjected to combined velocity and magnetic-field shear, a scenario typical at intermittent structures in plasma turbulence. We create conditions where only the Kelvin-Helmholtz (KH) and Drift-Kink (DK) instabilities can develop, while tearing modes are forbidden. The interaction of DKI and KHI generates qualitatively new structures, marked by a thickened shear layer with very weak electromagnetic field, modulated by KH vortices. Over a range of moderately strong velocity shears explored, the interaction of DKI and KHI results in a significant enhancement of dissipation over cases with only velocity shear or only magnetic shear. Moreover, we observe a new and efficient way of particle acceleration where particles are stochastically accelerated by the motional electric field exterior to the shear layer as they meander in an S-shaped pattern in and out of it. This process takes advantage of the bent geometry of the shear layer caused by the DK-KHI interaction and is responsible for most of the highest-energy particles produced in our simulations. These results further our understanding of dissipation and particle acceleration at intermittent structures, which are present in plasma turbulence across a wide range of astrophysical contexts such as in AGN jet sheaths, potentially relevant to limb-brightened emission, etc., and highlight the sensitivity of dissipation to multiple interacting instabilities, thus providing a strong motivation for further studies of their nonlinear interaction at the kinetic level.",
      "pdf_url": "https://arxiv.org/pdf/2510.21187.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21205",
      "title": "Detection of Quasi-periodic Oscillations in the $γ$-Ray Light Curve of 4FGL J0309.9-6058",
      "authors": [
        "Jingyu Wu",
        "Zhihao Ouyang",
        "Hubing Xiao",
        "Elisa Prandini",
        "Shangchun Xie",
        "Sheng Yang",
        "Jianzhen Chen",
        "Shaohua Zhang",
        "Haoyang Zhang",
        "Junhui Fan"
      ],
      "abstract": "Detection of Quasi-periodic Oscillations in the $γ$-Ray Light Curve of 4FGL J0309.9-6058 Jingyu Wu, Zhihao Ouyang, Hubing Xiao, Elisa Prandini, Shangchun Xie, Sheng Yang, Jianzhen Chen, Shaohua Zhang, Haoyang Zhang, Junhui Fan 12 pages, 8 figures, accept for MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) In this work, we report, for the first time, a quasi-periodic oscillation (QPO) in the $\\gamma$-ray band of 4FGL J0309.9-6058, also known as PKS 0308-611. We employed three analytical methods (the Lomb-Scargle periodogram, REDFIT, and the weighted wavelet Z-transform) to analyze the QPO signal using \\textit{Fermi} $\\gamma$-ray light curve data. The analysis reveals a potential QPO during MJD 57983$-$60503, with a period of approximately 550 days and a maximum local significance of 3.72$\\sigma$ and global significance of 2.72$\\sigma$ derived from the WWZ analysis. To validate this result, we applied Gaussian Process (GP) to the same light curve, which independently confirms the presence of QPO signal consistent with our Fourier-based results. We further extended the analysis to the full duration of the \\textit{Fermi} observations, and the results consistently support and strengthen the presence of this QPO signal. Additionally, a time lag between the optical and $\\gamma$-ray bands indicates separate emission regions for these two bands. Given the year-like timescale of the QPO signal and the fact that a QPO signal with local significance over 3$\\sigma$ for full \\textit{Fermi}-LAT observed time, we suggest that the QPO is most likely caused by a precessing jet.",
      "pdf_url": "https://arxiv.org/pdf/2510.21205.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.21263",
      "title": "The relation between the optical variability timescale, magnetic field of jets and black hole spin in active galactic nuclei",
      "authors": [
        "Yongyun Chen",
        "Qiusheng Gu",
        "Junhui Fan",
        "Dingrong Xiong",
        "Xiaoling Yu",
        "Xiaotong Guo",
        "Nan Ding",
        "Ting-Feng Yi"
      ],
      "abstract": "The relation between the optical variability timescale, magnetic field of jets and black hole spin in active galactic nuclei Yongyun Chen, Qiusheng Gu, Junhui Fan, Dingrong Xiong, Xiaoling Yu, Xiaotong Guo, Nan Ding, Ting-Feng Yi 10 pages, 4 figures, accept for publication in the Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We investigate the relationship among the jet magnetic field, black hole spin, black hole mass, Eddington ratio, and optical variability timescales in jetted active galactic nuclei (AGNs). By fitting a damped random walk (DRW) model to the g-band light curves, we obtain the characteristic variability timescale ($\\tau_{\\rm DRW}$) for 41 jetted AGNs with precise supermassive black hole (SMBH) mass measurements. Our main results are as follows: (i) Our analysis reveals a significant correlation between the jet magnetic field ($B_{\\rm 1pc}$), black hole spin ($j$) and the characteristic variability timescale within our sample. These findings suggest that the optical variability of jetted AGNs is influenced by the jet magnetic field and black hole spin. Furthermore, the characteristic variability timescale aligns with the electron escape timescale, as evidenced by the relationship between the characteristic variability timescale and jet magnetic field ($\\tau_{\\rm DRW}\\propto B_{\\rm 1pc}^{0.76\\pm0.22}$). (ii) We confirm a significant correlation between the characteristic variability timescale and SMBH mass, expressed as: $\\log \\rm \\tau_{\\rm DRW} = 0.52(\\pm0.21)\\log M _{\\rm BH}/M_{\\rm \\odot}-3.12(\\pm1.90)$, with an intrinsic scatter of 0.08 dex. The slope of this relationship is consistent with that between the thermal timescale and black hole mass. Our results support the hypothesis that magnetorotational instability (MRI) fluctuations drive the intrinsic variability observed in the light curves emitted by the AGNs accretion disk.",
      "pdf_url": "https://arxiv.org/pdf/2510.21263.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21331",
      "title": "A simple toy model for the electromagnetic variability of lump-dominated circumbinary disks around binary black holes",
      "authors": [
        "R. Mignon-Risse",
        "P. Varniere",
        "F. Casse"
      ],
      "abstract": "A simple toy model for the electromagnetic variability of lump-dominated circumbinary disks around binary black holes R. Mignon-Risse, P. Varniere, F. Casse Accepted for publication in A&A. 13 pages, 12 figures High Energy Astrophysical Phenomena (astro-ph.HE) The electromagnetic detection of circumbinary disks around pre-merger binary black holes (BBHs) relies on theoretical predictions. These are generally obtained through expensive numerical simulations, but simple or fast toy models are lacking to unleash the potential of these theoretical advances for observational purposes. We aim to present a simple toy model to compute the electromagnetic variability of circumbinary disks around circular-orbit BBHs at relativistic separations, focusing on the impact of disk non-axisymmetries. We assume that the disk is threaded by spiral arms and hosts a hotspot linked to an overdense structure (the {\\lq}lump{\\rq}) preferably reported in binaries close to equal mass. We build a simple temperature distribution, and estimate its thermal emission, perceived by a distant observer, via a ray-tracing code in a BBH approximate metric. We propose a toy model reproducing the main lightcurve features and show it is consistent with 2D general-hydrodynamical simulations under the assumption of compressional heating and expansional cooling except for purely dynamical effects such as the binary-lump beat. The lightcurve exhibits a main modulation at the lump's period (i.e. a few times the orbital period), due to relativistic Doppler effect, and a shorter one at the orbital-like period, due to spiral arms or the beat. These are more prominent in the optical/UV band for a total binary mass $M\\, {=} \\, 10^{4-10}\\mathrm{M_\\odot}$, where the disk energy spectrum peaks. For $M=10^{9}\\mathrm{M_\\odot}$, a $4\\%$-amplitude lump modulation is detectable with the Vera Rubin Observatory after six months of observation, up to $z\\, {=}\\, 0.5$. We proposed a new, simple toy model that can be used, for instance, to test the compatibility of the periodicity of BBH candidate sources with a circumbinary disk origin.",
      "pdf_url": "https://arxiv.org/pdf/2510.21331.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21480",
      "title": "The population of Galactic young massive star clusters in the TeV range",
      "authors": [
        "Rowan Batzofin",
        "Pierre Cristofari",
        "Kathrin Egberts"
      ],
      "abstract": "The population of Galactic young massive star clusters in the TeV range Rowan Batzofin, Pierre Cristofari, Kathrin Egberts 8 pages, 3 figures, Proceedings for the 39th International Cosmic Ray Conference (ICRC2025) High Energy Astrophysical Phenomena (astro-ph.HE) Young massive star clusters (YMSCs) can produce gamma rays in the very-high-energy (VHE, E>100 GeV) range and have been proposed as sources that can accelerate cosmic rays up to PeV energies. Observations with current instruments have lead to the detection of only a few YMSCs but future instruments should significantly increase this number. However, the details of the production of the VHE emission are not well understood: What is the spectrum of accelerated particles? What is the efficiency of cosmic-ray production? What fraction of the wind luminosity is converted into the turbulent magnetic field? To address these questions, we simulate the population of YMSCs in the gamma-ray domain, by means of Monte Carlo methods, and apply the constraints based on the subsample of YMSCs currently detected at TeV energies. We confront our simulated populations with the catalogue of the H.E.S.S. Galactic Plane Survey and the First LHAASO Catalogue of Gamma-Ray Sources, allowing us to investigate crucial aspects of particle acceleration at YMSCs.",
      "pdf_url": "https://arxiv.org/pdf/2510.21480.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20980",
      "title": "Grain Boundary Diffusion in Yukawa Crystals",
      "authors": [
        "Matthew E. Caplan",
        "Nevin T. Smith",
        "Dany Yaacoub",
        "Roberto F. Serrano",
        "Elias Taira",
        "Ashley Bransgrove"
      ],
      "abstract": "Grain Boundary Diffusion in Yukawa Crystals Matthew E. Caplan, Nevin T. Smith, Dany Yaacoub, Roberto F. Serrano, Elias Taira, Ashley Bransgrove Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE); Materials Science (cond-mat.mtrl-sci) We present calculations of diffusion coefficients in grain boundaries in Yukawa crystals for astrophysics. Our methods follow from our recent work calculating diffusion coefficients in perfect body-centered cubic crystals. These diffusion coefficients show only a weak dependence on the crystal orientations at the grain boundary and are consistent with those expected for a supercooled liquid scaled down by one to two orders of magnitude. We argue that the local disorder at the grain boundary produces a landscape of potential barriers similar to that of an amorphous liquid thin film, significantly reducing activation barriers to diffusive hops relative to the bulk solid. This also introduces a screening dependence, such that boundary diffusion does not exhibit the same universality as the bulk crystal. These diffusion coefficients suggest that grain boundaries may be a dominant source of viscous dissipation in neutron star crusts.",
      "pdf_url": "https://arxiv.org/pdf/2510.20980.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21577",
      "title": "An observational study of rotation and binarity of Galactic O-type runaway stars",
      "authors": [
        "M. Carretero-Castrillo",
        "M. Ribó",
        "J. M. Paredes",
        "G. Holgado",
        "C. Martínez-Sebastián",
        "S. Simón-Díaz"
      ],
      "abstract": "An observational study of rotation and binarity of Galactic O-type runaway stars M. Carretero-Castrillo, M. Ribó, J. M. Paredes, G. Holgado, C. Martínez-Sebastián, S. Simón-Díaz 13 pages 5 figures (+ appendices). Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Gaia DR3 data have revealed new massive runaway stars, while spectroscopic surveys enable detailed characterization. The relative contributions of binary supernova (BSS) and dynamical ejection (DES) scenarios to explain their runaway origin remain poorly constrained, particularly in the Milky Way. We aim to characterize the largest sample of Galactic O-type runaway stars ever investigated through their kinematics, rotation, and binarity to shed light into their origins. We use the GOSC-Gaia DR3 catalog, and IACOB spectroscopic information to build a sample with 214 O-type stars with projected rotational velocities ($v \\sin{i}$), and a subsample of 168 O-type stars with additional information about their likely single (LS) or single-lined (SB1) spectroscopic binary nature. We also consider an additional sample of 65 double-lined (SB2) spectroscopic binaries. We find that among our sample of Galactic O-type runaways, most (74%) have $v \\sin{i}<200$ km/s, whereas for normal stars this fraction is slightly higher (82%). There are no fast-moving runaways being fast rotators, except for HD 124 979. Runaways show lower SB1 fractions than normal stars, with no runaway SB1 fast-rotating systems; on average, runaways rotate faster than normal stars; and their runaway fraction is higher among fast rotators (44%) vs. the slow rotators (34%). This is consistent with BSS dominance for fast rotators. We also found that SB2 systems hardly reach runaway velocities with a low runaway fraction (10%). Runaways with 2D velocities > 60 km/s are mostly single and interpreted as DES products, while runaways with 2D velocities > 85 km/s are also interpreted as two-step products. Three of 12 runaway SB1 systems are HMXBs. Our study reveals that most Galactic O-type runaways are slow rotators, suggests a dominance of BSS among fast-rotating runaways, and of DES and two-step among the high-velocity ones. (Abridged)",
      "pdf_url": "https://arxiv.org/pdf/2510.21577.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21611",
      "title": "3D Synthetic Convective Velocity Fields to Initialise Core-Collapse Supernova Simulations from 1D Progenitors",
      "authors": [
        "Vishnu Varma",
        "Bernhard Mueller",
        "Raphael Hirschi"
      ],
      "abstract": "3D Synthetic Convective Velocity Fields to Initialise Core-Collapse Supernova Simulations from 1D Progenitors Vishnu Varma, Bernhard Mueller, Raphael Hirschi 10 pages, 8 figures, Accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Core-collapse supernovae (CCSNe) are among the most energetic and complex astrophysical phenomena, requiring threedimensional (3D) simulations to capture their intricate explosion mechanisms. One of the key ingredients for such simulations is the 3D pre-collapse structure, which can impact the development and geometry of the subsequent explosion. While stellar convection simulations can provide such 3D initial conditions, these remain too expensive and demanding for widespread use. In this work, we present a method to generate synthetic 3D velocity fields for convective zones from 1D initial conditions, creating initial conditions for CCSN simulations using a vector spherical harmonics expansion without the need for expensive hydrodynamic progenitor simulations. The synthetic velocity field is designed to capture the typical scales and velocities of the convective flow as the most relevant parameters for the subsequent explosions. In addition, it respects relevant physical constraints such as the near-anelasticity of flow, vanishing radial vorticity, and zero net angular momentum in the convective zones. A Python implementation of this method is publicly available, offering the CCSN community a practical tool for generating synthetic velocity fields for multi-dimensional simulations to study the impact of 3D progenitor asymmetries on the CCSN mechanism.",
      "pdf_url": "https://arxiv.org/pdf/2510.21611.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2207.09632",
      "title": "Neutrinos from Diffuse Supernova Background",
      "authors": [
        "Anna M. Suliga"
      ],
      "abstract": "Neutrinos from Diffuse Supernova Background Anna M. Suliga Updated short DSNB review to appear in Encyclopedia of Particle Physics, 12 pages, 4 figures Handbook of Nuclear Physics, Springer, Singapore 2023 High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Neutrinos are the second most abundant particles in the universe according to the Standard Model, yet they are the least likely to interact. This feature implies that detecting a neutrino can reveal valuable insights into its source. Among the known sources of neutrinos, core-collapse supernovae are one of the most efficient factories. On average, a single collapse occurs every second in the observable universe, emitting approximately $10^{58}$ neutrinos. The total flux of neutrinos reaching Earth from all core-collapse supernovae across the universe is the diffuse supernova neutrino background (DSNB). Detection of the DSNB is just around the corner. This guaranteed flux of astrophysical neutrinos encodes information about the whole supernova population, including an answer to a currently unsolved question about the rate at which black holes form from massive stars. This chapter discusses the ingredients entering the DSNB calculation as well as current experimental limits and hints.",
      "pdf_url": "https://arxiv.org/pdf/2207.09632.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.14550",
      "title": "A new air shower array in the Southern Hemisphere looking for the origins of Cosmic rays: the ALPACA experiment",
      "authors": [
        "M. Anzorena",
        "E. de la Fuente",
        "K. Fujita",
        "R. Garcia",
        "K. Goto",
        "Y. Hayashi",
        "K. Hibino",
        "N. Hotta",
        "G. Imaizumi",
        "A. Jimenez-Meza",
        "Y. Katayose",
        "C. Kato",
        "S. Kato",
        "T. Kawashima",
        "K. Kawata",
        "T. Koi",
        "H. Kojima",
        "T. Makishima",
        "Y. Masuda",
        "S. Matsuhashi",
        "M. Matsumoto",
        "R. Mayta",
        "P. Miranda",
        "A. Mizuno",
        "K. Munakata",
        "Y. Nakamura",
        "M. Nishizawa",
        "Y. Noguchi",
        "S. Ogio",
        "M. Ohnishi",
        "S. Okukawa",
        "A. Oshima",
        "M. Raljevich",
        "H. Rivera",
        "T. Saito",
        "T. Sako",
        "T. K. Sako",
        "T. Shibasaki",
        "S. Shibata",
        "A. Shiomi",
        "M. A. Subieta Vasquez",
        "F. Sugimoto",
        "N. Tajima",
        "W. Takano",
        "M. Takita",
        "Y. Tameda",
        "K. Tanaka",
        "R. Ticona",
        "I. Toledano-Juarez",
        "H. Tsuchiya",
        "Y. Tsunesada",
        "S. Udo",
        "R. Usui",
        "G. Yamagashi",
        "K. Yamazaki",
        "Y. Yokoe"
      ],
      "abstract": "A new air shower array in the Southern Hemisphere looking for the origins of Cosmic rays: the ALPACA experiment M. Anzorena, E. de la Fuente, K. Fujita, R. Garcia, K. Goto, Y. Hayashi, K. Hibino, N. Hotta, G. Imaizumi, A. Jimenez-Meza, Y. Katayose, C. Kato, S. Kato, T. Kawashima, K. Kawata, T. Koi, H. Kojima, T. Makishima, Y. Masuda, S. Matsuhashi, M. Matsumoto, R. Mayta, P. Miranda, A. Mizuno, K. Munakata, Y. Nakamura, M. Nishizawa, Y. Noguchi, S. Ogio, M. Ohnishi, S. Okukawa, A. Oshima, M. Raljevich, H. Rivera, T. Saito, T. Sako, T. K. Sako, T. Shibasaki, S. Shibata, A. Shiomi, M. A. Subieta Vasquez, F. Sugimoto, N. Tajima, W. Takano, M. Takita, Y. Tameda, K. Tanaka, R. Ticona, I. Toledano-Juarez, H. Tsuchiya, Y. Tsunesada, S. Udo, R. Usui, G. Yamagashi, K. Yamazaki, Y. Yokoe High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Tibet AS$\\gamma$ experiment successfully detected sub-PeV $\\gamma$-rays from the Crab nebula using a Surface Array and underground muon detector. Considering this, we are building in Bolivia a new experiment to explore the Southern Hemisphere, looking for the origins of cosmic rays in our Galaxy. The name of this project is Andes Large area PArticle detector for Cosmic ray physics and Astronomy (ALPACA). A prototype array called ALPAQUITA, with $1/4$ the total area of the full ALPACA, started observations in September $2022$. In this paper we introduce the status of ALPAQUITA and the plans to extend the array. We also report the results of the observation of the moon shadow in cosmic rays.",
      "pdf_url": "https://arxiv.org/pdf/2412.14550.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.08610",
      "title": "Probabilistic mapping between multiparticle production variables and the depth of maximum in proton-induced extensive air showers",
      "authors": [
        "Lorenzo Cazon",
        "Ruben Conceição",
        "Miguel Alexandre Martins",
        "Felix Riehn"
      ],
      "abstract": "Probabilistic mapping between multiparticle production variables and the depth of maximum in proton-induced extensive air showers Lorenzo Cazon, Ruben Conceição, Miguel Alexandre Martins, Felix Riehn High Energy Astrophysical Phenomena (astro-ph.HE) The interaction of ultra-high-energy cosmic rays with air nuclei triggers extensive air showers that reach their maximal energy deposition at the atmospheric depth $X_{\\max}$. The distribution of this shower observable encodes information about the proton-air cross-section via fluctuations of the primary interaction point, $X_1$, and hadron production through $\\Delta X_{\\max} \\equiv X_{\\max} - X_1$. We introduce new multiparticle production variables, $\\alpha_{\\textrm{had}}$, $\\zeta_{\\textrm{had}}$, and $\\zeta_{\\mathrm{EM}}$, built from the energy spectra of secondaries in the primary interaction. Their linear combination, $\\xi$, predicts over $50 \\%$ of the fluctuations in $\\Delta X_{\\max}$. Moreover, we build a probabilistic mapping based on the causal connection between $\\xi$ and $\\Delta X_{\\max}$ that enables model-independent predictions of $X_{\\max}$ moments with biases below $3\\,\\mathrm{g\\,cm^{-2}}$. Therefore, measurements of the distribution of $X_{\\max}$ allow a data-driven probing of secondary hadron spectra from the cosmic-ray-air interaction, in proton-induced showers. The distributions of the new multiparticle production variables can be measured in rapidity regions accessible to current accelerators and are strongly dependent on the hadronic interaction model in the kinematic regions exclusive to ultra-high-energy cosmic rays.",
      "pdf_url": "https://arxiv.org/pdf/2504.08610.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.21640",
      "title": "Compact stellar systems hosting an intermediate mass black hole: magnetohydrodynamic study of inflow-outflow dynamics",
      "authors": [
        "Matúš Labaj",
        "Sean M. Ressler",
        "Michal Zajaček",
        "Tomáš Plšek",
        "Bart Ripperda",
        "Florian Peißker"
      ],
      "abstract": "Compact stellar systems hosting an intermediate mass black hole: magnetohydrodynamic study of inflow-outflow dynamics Matúš Labaj, Sean M. Ressler, Michal Zajaček, Tomáš Plšek, Bart Ripperda, Florian Peißker Astronomy & Astrophysics 702 A233, 24 October 2025 High Energy Astrophysical Phenomena (astro-ph.HE) Intermediate-mass black holes (IMBHs) are a missing link in black hole demographics, with only tentative observational evidence to date. Dense stellar clusters such as IRS 13E near the Galactic Center are promising IMBH hosts, where accretion is likely driven by winds from nearby Wolf-Rayet (WR) stars. Yet, the dynamics of such wind-fed systems remain largely unexplored. We investigate how high-velocity stellar winds, magnetic fields, and metallicity-dependent radiative cooling influence gas dynamics and black hole accretion in compact WR clusters. Using three-dimensional (magneto)hydrodynamic simulations, we model each WR star as a source of mass, momentum, energy, and magnetic flux, and include a cooling function that depends on chemical abundance. We compare isotropic versus disk-like stellar distributions to explore the impact of cluster geometry. Across all models, we find that the accretion rate onto the IMBH is suppressed by up to five orders of magnitude relative to the total stellar mass-loss rate. Turbulent, shock-heated outflows driven by wind-wind collisions dominate the flow, expelling most injected gas. While enhanced cooling in high-metallicity runs promotes the formation of dense clumps, these structures are typically unable to reach the black hole. The system's integrated X-ray luminosity is dominated by colliding WR winds, masking the IMBH's radiative signature. Accretion occurs in short-lived, quasi-periodic episodes triggered by close stellar passages, but even these flares remain difficult to detect against the luminous wind background. Our results naturally explain the low detectability of IMBHs in compact WR clusters and provide theoretical predictions to guide future X-ray and infrared observational strategies.",
      "pdf_url": "https://arxiv.org/pdf/2504.21640.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.06420",
      "title": "Searching for Historical Extragalactic Optical Transients Associated with Fast Radio Bursts",
      "authors": [
        "Y. Dong",
        "C. D. Kilpatrick",
        "W. Fong",
        "A. P. Curtin",
        "S. Opoku",
        "B. C. Andersen",
        "A. M. Cook",
        "T. Eftekhari",
        "E. Fonseca",
        "B. M. Gaensler",
        "R. C. Joseph",
        "J. F. Kaczmarek",
        "L. A. Kahinga",
        "V. Kaspi",
        "A. E. Lanman",
        "M. Lazda",
        "C. Leung",
        "K. W. Masui",
        "D. Michilli",
        "K. Nimmo",
        "A. Pandhi",
        "A. B. Pearlman",
        "M. Sammons",
        "P. Scholz",
        "V. Shah",
        "K. Shin",
        "K. Smith"
      ],
      "abstract": "Searching for Historical Extragalactic Optical Transients Associated with Fast Radio Bursts Y. Dong (Northwestern/CIERA), C. D. Kilpatrick, W. Fong, A. P. Curtin, S. Opoku, B. C. Andersen, A. M. Cook, T. Eftekhari, E. Fonseca, B. M. Gaensler, R. C. Joseph, J. F. Kaczmarek, L. A. Kahinga, V. Kaspi, A. E. Lanman, M. Lazda, C. Leung, K. W. Masui, D. Michilli, K. Nimmo, A. Pandhi, A. B. Pearlman, M. Sammons, P. Scholz, V. Shah, K. Shin, K. Smith 19 pages, 8 figures, 1 table, published in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present a systematic search for past supernovae (SNe) and other historical optical transients at the positions of fast radio burst (FRB) sources to test FRB progenitor systems. Our sample comprises 83 FRBs detected by the Canadian Hydrogen Intensity Mapping Experiment (CHIME) and its KKO Outrigger, along with 93 literature FRBs representing all known well-localized FRBs. We search for optical transients coincident in position and redshift with FRBs and find no significant associations within the 5-sigma FRB localization uncertainties except for a previously identified potential optical counterpart to FRB 20180916B. By constraining the timescale for SN ejecta to become transparent to FRB emission, we predict that it takes at least 6-10 years before the FRB emission can escape. From this, we infer that approximately 7% of matched optical transients, up to 30% of currently known SNe, and up to 40% of core-collapse SNe could have an observable FRB based on timescales alone. We derive the number of new, well-localized FRBs required to produce one FRB-SN match by chance, and find it will take ~ 22,700 FRBs to yield one chance association at the projected CHIME/FRB Outrigger detection rate. Looking forward, we demonstrate redshift overlap between SNe detected by the upcoming Vera C. Rubin Observatory and CHIME/FRB Outrigger FRBs, indicating the prospect of an increase in potential associations at redshift z < 1. Our framework is publicly available, flexible to a wide range of transient timescales and FRB localization sizes, and can be applied to any optical transient populations in future searches.",
      "pdf_url": "https://arxiv.org/pdf/2506.06420.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.13771",
      "title": "The Pierre Auger Observatory: Contributions to the 39th International Cosmic Ray Conference (ICRC 2025)",
      "authors": [
        "The Pierre Auger Collaboration: A. Abdul Halim",
        "P. Abreu",
        "M. Aglietta",
        "I. Allekotte",
        "K. Almeida Cheminant",
        "A. Almela",
        "R. Aloisio",
        "J. Alvarez-Muñiz",
        "A. Ambrosone",
        "J. Ammerman Yebra",
        "L. Anchordoqui",
        "B. Andrada",
        "L. Andrade Dourado",
        "L. Apollonio",
        "C. Aramo",
        "E. Arnone",
        "J.C. Arteaga Velázquez",
        "P. Assis",
        "G. Avila",
        "E. Avocone",
        "A. Bakalova",
        "A. Baluta",
        "F. Barbato",
        "A. Bartz Mocellin",
        "J.A. Bellido",
        "C. Berat",
        "M.E. Bertaina",
        "M. Bianciotto",
        "P.L. Biermann",
        "V. Binet",
        "K. Bismark",
        "T. Bister",
        "J. Biteau",
        "J. Blazek",
        "J. Blümer",
        "M. Boháčová",
        "D. Boncioli",
        "C. Bonifazi",
        "N. Borodai",
        "J. Brack",
        "P.G. Brichetto Orchera",
        "F.L. Briechle",
        "A. Bueno",
        "S. Buitink",
        "M. Büsken",
        "A. Bwembya",
        "K.S. Caballero-Mora",
        "S. Cabana-Freire",
        "L. Caccianiga",
        "F. Campuzano",
        "J. Caraça-Valente",
        "R. Caruso",
        "A. Castellina",
        "F. Catalani",
        "G. Cataldi",
        "L. Cazon",
        "M. Cerda",
        "B. Čermáková",
        "A. Cermenati",
        "J.A. Chinellato",
        "J. Chudoba",
        "L. Chytka",
        "R.W. Clay",
        "A.C. Cobos Cerutti",
        "R. Colalillo",
        "R. Conceição",
        "G. Consolati",
        "M. Conte",
        "F. Convenga",
        "D. Correia dos Santos",
        "P.J. Costa",
        "C.E. Covault",
        "M. Cristinziani",
        "C.S. Cruz Sanchez",
        "S. Dasso",
        "K. Daumiller",
        "B.R. Dawson",
        "R.M. de Almeida",
        "E.-T. de Boone",
        "B. de Errico",
        "J. de Jesús",
        "S.J. de Jong",
        "J.R.T. de Mello Neto",
        "I. De Mitri",
        "D. de Oliveira Franco",
        "F. de Palma",
        "V. de Souza",
        "E. De Vito",
        "A. Del Popolo",
        "O. Deligny",
        "N. Denner",
        "L. Deval",
        "A. di Matteo",
        "C. Dobrigkeit",
        "J.C. D'Olivo",
        "L.M. Domingues Mendes",
        "Q. Dorosti",
        "J.C. dos Anjos",
        "R.C. dos Anjos"
      ],
      "abstract": "The Pierre Auger Observatory: Contributions to the 39th International Cosmic Ray Conference (ICRC 2025) The Pierre Auger Collaboration: A. Abdul Halim, P. Abreu, M. Aglietta, I. Allekotte, K. Almeida Cheminant, A. Almela, R. Aloisio, J. Alvarez-Muñiz, A. Ambrosone, J. Ammerman Yebra, L. Anchordoqui, B. Andrada, L. Andrade Dourado, L. Apollonio, C. Aramo, E. Arnone, J.C. Arteaga Velázquez, P. Assis, G. Avila, E. Avocone, A. Bakalova, A. Baluta, F. Barbato, A. Bartz Mocellin, J.A. Bellido, C. Berat, M.E. Bertaina, M. Bianciotto, P.L. Biermann, V. Binet, K. Bismark, T. Bister, J. Biteau, J. Blazek, J. Blümer, M. Boháčová, D. Boncioli, C. Bonifazi, N. Borodai, J. Brack, P.G. Brichetto Orchera, F.L. Briechle, A. Bueno, S. Buitink, M. Büsken, A. Bwembya, K.S. Caballero-Mora, S. Cabana-Freire, L. Caccianiga, F. Campuzano, J. Caraça-Valente, R. Caruso, A. Castellina, F. Catalani, G. Cataldi, L. Cazon, M. Cerda, B. Čermáková, A. Cermenati, J.A. Chinellato, J. Chudoba, L. Chytka, R.W. Clay, A.C. Cobos Cerutti, R. Colalillo, R. Conceição, G. Consolati, M. Conte, F. Convenga, D. Correia dos Santos, P.J. Costa, C.E. Covault, M. Cristinziani, C.S. Cruz Sanchez, S. Dasso, K. Daumiller, B.R. Dawson, R.M. de Almeida, E.-T. de Boone, B. de Errico, J. de Jesús, S.J. de Jong, J.R.T. de Mello Neto, I. De Mitri, D. de Oliveira Franco, F. de Palma, V. de Souza, E. De Vito, A. Del Popolo, O. Deligny, N. Denner, L. Deval, A. di Matteo, C. Dobrigkeit, J.C. D'Olivo, L.M. Domingues Mendes, Q. Dorosti, J.C. dos Anjos, R.C. dos Anjos High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Pierre Auger Observatory, located in La Pampa Amarilla, Argentina, has been continuously acquiring data since 2004. It comprises a surface detector array covering 3,000 km$^2$ and 27 fluorescence telescopes, designed to detect extensive air showers initiated by ultra-high-energy cosmic rays. An upgrade to the Observatory was commissioned in 2024, enhancing the existing water-Cherenkov detectors with additional radio antennas, surface scintillator detectors, and a buried scintillator array. This compilation of contributions to the 39th International Cosmic Ray Conference, held in Geneva, Switzerland (July 15-24, 2025), presents recent results from the Pierre Auger Collaboration, addressing a wide range of fundamental questions in astroparticle physics. The included papers cover measurements of the energy spectrum, mass composition, and arrival directions of ultra-high-energy cosmic rays, investigations of hadronic interactions in extensive air showers, and searches for ultra-high-energy photons and neutrinos. Additional topics include radio detection techniques, solar-related phenomena, and atmospheric events such as ELVES and TGFs. The list also contains first results and performance evaluations of the upgraded detectors, AugerPrime, along with reports on outreach and social engagement initiatives conducted by the Collaboration.",
      "pdf_url": "https://arxiv.org/pdf/2507.13771.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20823",
      "title": "Rotating Proto-Neutron Stars Admixed with Mirror Dark Matter: A two fluid approach",
      "authors": [
        "Adamu Issifu",
        "Andreas Konstantinou",
        "Prashant Thakur",
        "Tobias Frederico"
      ],
      "abstract": "Rotating Proto-Neutron Stars Admixed with Mirror Dark Matter: A two fluid approach Adamu Issifu, Andreas Konstantinou, Prashant Thakur, Tobias Frederico 13 pages, 6 figures and 3 tables (Accepted for publication in Physical Review D.) High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) This work investigates the impact of mirror dark matter (DM) on the global properties of rotating neutron stars (NSs) across evolutionary stages, from hot, lepton-rich protoneutron stars (PNSs) to cold, catalyzed NSs along the Kelvin-Helmholtz timescale. The baryonic matter (BM) is modeled using a relativistic mean-field (RMF) approach with density-dependent couplings, while the dark sector mirrors the visible sector with analogous thermodynamic conditions. Using a two-fluid formalism with purely gravitational DM-BM interaction, we find that rotation enlarges the star, whereas DM admixture increases compactness and enhances gravitational stability. However, increased compactness due to DM lowers the threshold for rotational instabilities, making DM-admixed stars more susceptible. Rotation decreases {central temperature behavior} by redistributing thermal energy over a larger volume and reducing central density, while DM raises temperatures by deepening the gravitational potential and increasing thermal energy. Stars become more prone to collapse and rotational instabilities as frequency ($\\nu$) rises and the polar-to-equatorial radius ratio ($r_p/r_e$) decreases, especially near the Keplerian limit ($\\nu_K$). DM-admixed stars also show higher surface gravitational redshifts due to their compactness. Our results qualitatively agree with universal relations primarily derived for rotating cold stars. These findings highlight competing effects of rotation and DM on NS thermal evolution, structure, and observables, potentially offering indirect probes of DM within NSs.",
      "pdf_url": "https://arxiv.org/pdf/2507.20823.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.22156",
      "title": "Enabling Early Transient Discovery in LSST via Difference Imaging with DECam",
      "authors": [
        "Yize Dong",
        "Kaylee de Soto",
        "V. Ashley Villar",
        "Anya Nugent",
        "Alex Gagliano",
        "K. Azalee Bostroem",
        "Anastasia Alexov",
        "Éric Aubourg",
        "Farrukh Azfar",
        "Alexandre Boucaud",
        "Andrew Bradshaw",
        "Johann Cohen-Tanugi",
        "Sylvie Dagoret-Campagne",
        "Phil N. Daly",
        "Felipe Daruich",
        "Peter E. Doherty",
        "Holger Drass",
        "Orion Eiger",
        "Leanne P. Guy",
        "Patrick A. Hascall",
        "Željko Ivezić",
        "Fabrice Jammes",
        "M. James Jee",
        "Tim Jenness",
        "Steven M. Kahn",
        "Yijung Kang",
        "Lee S. Kelvin",
        "Ivan V. Kotov",
        "Gábor Kovács",
        "Laurent Le Guillou",
        "Shuang Liang",
        "Mostafa Lutfi",
        "Morgan May",
        "Guillem Megias Homar",
        "Marc Moniez",
        "Freddy Muñoz Arancibia",
        "Erfan Nourbakhsh",
        "Hye Yun Park",
        "John R. Peterson",
        "Andrés A. Plazas Malagón",
        "Daniel Polin",
        "Bruno C. Quint",
        "Tiago Ribeiro",
        "Vincent J. Riot",
        "Cécile Roucelle",
        "Bruno O. Sánchez",
        "David Sanmartim",
        "Jacques Sebag",
        "Nima Sedaghat",
        "Richard A. Shaw",
        "Alysha Shugart",
        "Ioana Sotuela Elorriaga",
        "Krzysztof Suberlak",
        "John D. Swinbank",
        "Sandrine Thomas",
        "J. Anthony Tyson",
        "Wouter van Reeven",
        "Charlotte Ward",
        "Christopher Z. Waters",
        "Oliver Wiecha",
        "W. M. Wood-Vasey"
      ],
      "abstract": "Enabling Early Transient Discovery in LSST via Difference Imaging with DECam Yize Dong, Kaylee de Soto, V. Ashley Villar, Anya Nugent, Alex Gagliano, K. Azalee Bostroem, Anastasia Alexov, Éric Aubourg, Farrukh Azfar, Alexandre Boucaud, Andrew Bradshaw, Johann Cohen-Tanugi, Sylvie Dagoret-Campagne, Phil N. Daly, Felipe Daruich, Peter E. Doherty, Holger Drass, Orion Eiger, Leanne P. Guy, Patrick A. Hascall, Željko Ivezić, Fabrice Jammes, M. James Jee, Tim Jenness, Steven M. Kahn, Yijung Kang, Lee S. Kelvin, Ivan V. Kotov, Gábor Kovács, Laurent Le Guillou, Shuang Liang, Mostafa Lutfi, Morgan May, Guillem Megias Homar, Marc Moniez, Freddy Muñoz Arancibia, Erfan Nourbakhsh, Hye Yun Park, John R. Peterson, Andrés A. Plazas Malagón, Daniel Polin, Bruno C. Quint, Tiago Ribeiro, Vincent J. Riot, Cécile Roucelle, Bruno O. Sánchez, David Sanmartim, Jacques Sebag, Nima Sedaghat, Richard A. Shaw, Alysha Shugart, Ioana Sotuela Elorriaga, Krzysztof Suberlak, John D. Swinbank, Sandrine Thomas, J. Anthony Tyson, Wouter van Reeven, Charlotte Ward, Christopher Z. Waters, Oliver Wiecha, W. M. Wood-Vasey accepted for publication in ApJL; SLIDE is available on GitHub: this https URL High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present SLIDE, a pipeline that enables transient discovery in data from the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST), using archival images from the Dark Energy Camera (DECam) as templates for difference imaging. We apply this pipeline to the recently released Data Preview 1 (DP1; the first public release of Rubin commissioning data) and search for transients in the resulting difference images. The image subtraction, photometry extraction, and transient detection are all performed on the Rubin Science Platform. We demonstrate that SLIDE effectively extracts clean photometry by circumventing poor or missing LSST templates. We identified 29 previously unreported transients, 12 of which would not have been detected based on the DP1 DiaObject catalog. SLIDE will be especially useful for transient analysis in the early years of LSST, when template coverage will be largely incomplete or when templates may be contaminated by transients present at the time of acquisition. We present multiband light curves for a sample of known transients, along with new transient candidates identified through our search. Finally, we discuss the prospects of applying this pipeline during the main LSST survey. Our pipeline is broadly applicable and will support studies of all transients with slowly evolving phases.",
      "pdf_url": "https://arxiv.org/pdf/2507.22156.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22787",
      "title": "Comprehensive X-ray Observations of the Exceptional Ultra-long X-ray and Gamma-ray Transient GRB 250702B with Swift, NuSTAR, and Chandra: Insights from the X-ray Afterglow Properties",
      "authors": [
        "Brendan O'Connor",
        "Ramandeep Gill",
        "James DeLaunay",
        "Jeremy Hare",
        "Dheeraj Pasham",
        "Eric R. Coughlin",
        "Ananya Bandopadhyay",
        "Akash Anumarlapudi",
        "Paz Beniamini",
        "Jonathan Granot",
        "Igor Andreoni",
        "Jonathan Carney",
        "Michael J. Moss",
        "Ersin Göğüş",
        "Jamie A. Kennea",
        "Malte Busmann",
        "Simone Dichiara",
        "James Freeburn",
        "Daniel Gruen",
        "Xander J. Hall",
        "Antonella Palmese",
        "Tyler Parsotan",
        "Samuele Ronchini",
        "Aaron Tohuvavohu",
        "Maia A. Williams"
      ],
      "abstract": "Comprehensive X-ray Observations of the Exceptional Ultra-long X-ray and Gamma-ray Transient GRB 250702B with Swift, NuSTAR, and Chandra: Insights from the X-ray Afterglow Properties Brendan O'Connor, Ramandeep Gill, James DeLaunay, Jeremy Hare, Dheeraj Pasham, Eric R. Coughlin, Ananya Bandopadhyay, Akash Anumarlapudi, Paz Beniamini, Jonathan Granot, Igor Andreoni, Jonathan Carney, Michael J. Moss, Ersin Göğüş, Jamie A. Kennea, Malte Busmann, Simone Dichiara, James Freeburn, Daniel Gruen, Xander J. Hall, Antonella Palmese, Tyler Parsotan, Samuele Ronchini, Aaron Tohuvavohu, Maia A. Williams High Energy Astrophysical Phenomena (astro-ph.HE) GRB 250702B is an exceptional transient that produced multiple episodes of luminous gamma-ray radiation lasting for $>25$ ks, placing it among the class of ultra-long gamma-ray bursts (GRBs). However, unlike any known GRB, the \\textit{Einstein Probe} detected soft X-ray emission up to 24 hours before the gamma-ray triggers. We present comprehensive X-ray observations of the transient's afterglow obtained with the Neil Gehrels Swift Observatory, the Nuclear Spectroscopic Telescope Array, and the Chandra X-ray Observatory between 0.5 to 65 days (observer frame) after the initial high-energy trigger. The X-ray emission decays steeply as $\\sim t^{-1.9}$, and shows short timescale X-ray variability ($\\Delta T/T < 0.03$) in both Swift and NuSTAR, consistent with flares superposed on an external shock continuum. Serendipitous detections by the Swift Burst Alert Telescope (BAT) out to $\\sim$0.3 days and continued NuSTAR variability to $\\sim$2 days imply sustained central engine activity; including the precursor, the required engine duration is $\\gtrsim 3$ days. Afterglow modeling favors the combination of forward and reverse shock emission in a wind-like ($k \\approx 2$) environment. These properties, especially the long-lived engine and early soft X-ray emission, are difficult to reconcile with a collapsar origin, and GRB 250702B does not fit neatly with canonical ultra-long GRBs or relativistic tidal disruption events (TDEs). A hybrid scenario in which a star is disrupted by a stellar-mass black hole (a micro-TDE) provides a plausible explanation, although a relativistic TDE from an intermediate-mass black hole remains viable.",
      "pdf_url": "https://arxiv.org/pdf/2509.22787.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20897",
      "title": "Positive AGN Feedback Enhances Star Formation in Starburst Dwarf Galaxies",
      "authors": [
        "Tingfang Su",
        "Suoqing Ji",
        "Feng Yuan",
        "Haojie Xia",
        "Yuxuan Zou"
      ],
      "abstract": "Positive AGN Feedback Enhances Star Formation in Starburst Dwarf Galaxies Tingfang Su, Suoqing Ji, Feng Yuan, Haojie Xia, Yuxuan Zou 14 pages, 9 figures, Submitted to APJ Astrophysics of Galaxies (astro-ph.GA) The role of active galactic nuclei (AGN) feedback in dwarf galaxies remains poorly understood, with conventional wisdom suggesting it primarily suppresses star formation. Using high-resolution MACER3D simulations that directly resolve the Bondi radius, we demonstrate that AGN feedback can significantly enhance rather than suppress star formation in starburst dwarf galaxies. Our simulations reveal that AGN feedback increases global star formation rates by approximately 25% when comparing our models with both AGN and supernova feedback to those with only supernova feedback. This enhancement occurs through AGN-driven outflows creating compressed gas regions where efficient cooling preserves the high density while quickly radiating away thermal energy, creating ideal conditions for star formation. This positive feedback mechanism operates in gas-rich starburst environments with efficient cooling and moderate AGN energy input that compresses gas without expelling it from the galaxy. Critically, it requires both AGN and supernova feedback working in concert: without SN feedback to regulate black hole activity, AGN outflows become too powerful and expel gas rather than compress it. Our results closely match observations of the starburst dwarf galaxy Henize 2-10, where similar shock-compressed regions of enhanced star formation have been observed. These findings challenge conventional understanding of AGN feedback and suggest that AGN may play a previously unrecognized role in accelerating star formation during active phases of dwarf galaxy evolution.",
      "pdf_url": "https://arxiv.org/pdf/2510.20897.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20899",
      "title": "Magnetic clumping of charged dust in the dense interstellar medium",
      "authors": [
        "V. Vallucci-Goy",
        "P. Hennebelle",
        "U. Lebreuilly",
        "G. Verrier"
      ],
      "abstract": "Magnetic clumping of charged dust in the dense interstellar medium V. Vallucci-Goy, P. Hennebelle, U. Lebreuilly, G. Verrier Accepted in A&A. 19 pages, 19 figures Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Context: Dust grains undergo significant growth in star-forming environments, especially in dense regions prone to gravitational collapse. Although dust is generally assumed to represent $1 \\%$ of the gas mass, dust density variations are expected on small scales due to differential dynamics with the gas, leading to enhanced coagulation rates in regions of dust enrichment. Aims: We aim to investigate the clumping of charged dust in the turbulent magnetized dense regions of the interstellar medium. Methods: We develop a dusty model that goes beyond the standard non-ideal MHD and use the code {\\ttfamily shark} to perform multifluid 1D simulations of a single size charged dust species and neutral gas with large scale driven turbulence and including ion-neutral friction. Results: We identify a mechanism similar to the parametric instability that efficiently forms dust clumps even in presence of dissipative processes. Such strong clumping survives and is sustained when driving turbulence, and thus high levels of dust concentration are produced due to compressive magnetic effects in regions of shocks. Dust density enhancements are favored by a high transverse-to-longitudinal magnetic ratio which is controlled by: transverse Mach number and plasma parameter. We find that a substantial fraction of dust experiences a density increase of more than a factor of 10 under reasonable conditions, thus promoting dust growth. Conclusion: Our novel dusty non-ideal MHD model shows that dust grains (main charge carriers) are subject to small-scale compressive magnetic effects driven by a parametric instability - like mechanism in regions of shocks, and consequently experience high density enhancements in turbulent environments that go beyond those permitted by pure hydrodynamical processes, making in-situ formation of large grains (sub-mm) in protostellar envelopes a plausible scenario.",
      "pdf_url": "https://arxiv.org/pdf/2510.20899.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20912",
      "title": "Chemical modeling of aminoketene, ethanolamine, and glycine production in interstellar ices",
      "authors": [
        "Sydney A. Willis , Serge A. Krasnokutski , Nathaniel J. Morin , Robin T. Garrod Department of Chemistry, University of Virginia, Charlottesville, VA, USA, Laboratory Astrophysics Group of the Max Planck Institute for Astronomy, Friedrich Schiller University Jena, Germany, Department of Astronomy, University of Virginia, Charlottesville, VA, USA)"
      ],
      "abstract": "Chemical modeling of aminoketene, ethanolamine, and glycine production in interstellar ices Sydney A. Willis (1), Serge A. Krasnokutski (2), Nathaniel J. Morin (1), Robin T. Garrod (1 and 3) ((1) Department of Chemistry, University of Virginia, Charlottesville, VA, USA, (2) Laboratory Astrophysics Group of the Max Planck Institute for Astronomy, Friedrich Schiller University Jena, Germany, (3) Department of Astronomy, University of Virginia, Charlottesville, VA, USA) To be published in Astronomy & Astrophysics; 16 pages, 8 figures, 6 tables Astrophysics of Galaxies (astro-ph.GA) Icy interstellar dust grains are a source of complex organic molecule (COM) production, although their formation mechanisms are debated. Laboratory experiments show that atomic C deposited onto interstellar ice analogs can react with solid-phase NH3 to form a CHNH2 radical, a possible precursor to COMs, including aminoketene (NH2CHCO). We used astrochemical kinetics models to explore the role of the reaction of atomic C with NH3 and subsequent reaction with CO in the formation of NH2CHCO and other COMs. We applied the three-phase chemical model MAGICKAL to hot molecular core conditions from the cold-collapse through to the hot-core stage. The chemical network was extended to include NH2CHCO and a range of associated gas-phase, grain-surface, and bulk-ice products and reactions. We also approximated conditions in a shocked cloud, including sputtering of ice mantles. NH2CHCO is formed on grains at low temperatures (~10 K) with a peak solid-phase abundance of ~2x10^-10 nH. Its formation is driven by nondiffusive reactions, in particular the Eley-Rideal reaction of C with surface NH3, followed by immediate reaction with CO. Surface hydrogenation of NH2CHCO produces ethanolamine with a significant abundance of ~8x10^-8 nH. In the gas-phase, although ethanolamine reaches a modest abundance peak immediately following its desorption from grains under hot-core conditions, it is destroyed more rapidly due to its high proton affinity. Molecular survival is much higher in the shocked regions, where these species seem most likely to be detected. NH2CHCO is produced efficiently on simulated interstellar grain surfaces, acting subsequently as an important precursor to more complex organics, including ethanolamine and glycine. Ion-molecule gas-phase destruction of NH3-bearing COMs is less efficient in shocked lower-density regions, in contrast to hot cores, enhancing their abundances and lifetimes.",
      "pdf_url": "https://arxiv.org/pdf/2510.20912.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20919",
      "title": "SPHEREx: Aromatics, Aliphatics and PAH Size across the Iris Nebula",
      "authors": [
        "Christiaan Boersma",
        "Alexandros Maragkoudakis",
        "Louis J. Allamandola",
        "Jesse D. Bregman",
        "Pasquale Temi",
        "Vincent J. Esposito",
        "Ryan C. Fortenberry"
      ],
      "abstract": "SPHEREx: Aromatics, Aliphatics and PAH Size across the Iris Nebula Christiaan Boersma, Alexandros Maragkoudakis, Louis J. Allamandola, Jesse D. Bregman, Pasquale Temi, Vincent J. Esposito, Ryan C. Fortenberry Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Observations by the SpectroPhotometer for the History of the Universe, Epoch of Reionization, and Ices Explorer (SPHEREx) are combined with Spitzer spectral map data to study the aromatic, aliphatic, and PAH size evolution across the northwest photo-dissociation region (PDR) of the Iris Nebula (NGC7023). The 3.3-3.4 $\\mu$m complex (I$_{3.3}$) and 11.2 $\\mu$m (I$_{11.2}$) PAH band strength are determined through direct integration. In addition, the former is decomposed into a 3.3 (I'$_{3.3}$) and 3.4 $\\mu$m (I'$_{3.4}$) sub-feature by fitting SPHEREx bandpass-integrated photometry using a modeled, highly sampled, multi-component spectrum. I$_{3.3}$, I$_{11.2}$, I'$_{3.3}$, and I'$_{3.4}$ all peak at the PDR. The NASA Ames PAH IR Spectroscopic Database is used to obtain the average number of carbon atoms ($\\overline{\\rm N_{C}}$) and small PAH fraction ($f_{\\rm small}$) by fitting the isolated PAH component of the Spitzer segment; $70\\lesssim\\overline{N_{C}}\\lesssim76$ and $0.24\\lesssim\\text{f}_{\\rm small}\\lesssim0.36$. I'$_{3.4}$/I'$_{3.4}$, I$_{11.2}$/I$_{3.3}$, $\\overline{\\rm N_{C}}$, and $f_{\\rm small}$ all show a demarcation that matches the large-scale morphology of the region. For I'$_{3.3}$ and I'$_{3.4}$ this is reflected by two distinct trends when plotted against each other, one associated with the dense, the other with the diffuse medium; $[N_{\\rm H,ali}/N_{\\rm H,aro}]_{\\rm dense}$ = 0.49$\\pm$0.01 and $[N_{\\rm H,ali}/N_{\\rm H,aro}]_{\\rm diffuse}$ = 0.090$\\pm$0.005. $\\overline{\\rm N_{C}}$ and $f_{\\rm small}$ are tentatively correlated with I$_{11.2}$/I$_{3.3}$ (R=0.53$\\pm$0.04 and -0.45$\\pm$0.04, respectively). A wider variety of large(r) extended interstellar medium objects is required to tighten the correlations, turn them into quantitative calibrators for PAH size, and pin down the discrepancy of correlations with I'$_{3.3}$ involved.",
      "pdf_url": "https://arxiv.org/pdf/2510.20919.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20944",
      "title": "The Next Generation Virgo Cluster Survey (NGVS). XL. The Morphological Classification of Virgo Cluster Galaxies",
      "authors": [
        "Max M. Kurzner",
        "Patrick Côté",
        "Laura Ferrarese",
        "Kaixiang Wang",
        "Eric W. Peng",
        "Scott Wilkinson",
        "Joel C. Roediger",
        "Chelsea Spengler",
        "Toby Brown",
        "Chengze Liu",
        "Sungsoon Lim",
        "Rubén Sánchez-Janssen",
        "Elisa Toloba",
        "Puragra Guhathakutra",
        "John P. Blakeslee",
        "Patrick R. Durrell",
        "Ariane Lançon",
        "J. Christopher Mihos",
        "Matthew A. Taylor",
        "Tyrone E. Woods",
        "Solveig Thompson",
        "Lauren A. MacArthur"
      ],
      "abstract": "The Next Generation Virgo Cluster Survey (NGVS). XL. The Morphological Classification of Virgo Cluster Galaxies Max M. Kurzner, Patrick Côté, Laura Ferrarese, Kaixiang Wang, Eric W. Peng, Scott Wilkinson, Joel C. Roediger, Chelsea Spengler, Toby Brown, Chengze Liu, Sungsoon Lim, Rubén Sánchez-Janssen, Elisa Toloba, Puragra Guhathakutra, John P. Blakeslee, Patrick R. Durrell, Ariane Lançon, J. Christopher Mihos, Matthew A. Taylor, Tyrone E. Woods, Solveig Thompson, Lauren A. MacArthur 58 pages, 17 figures, 7 tables, Accepted to AJ Astrophysics of Galaxies (astro-ph.GA) We present a study of morphologies, based on deep $u^{*}g^{\\prime}i^{\\prime}z^{\\prime}$ imaging of the Virgo Cluster from the Next Generation Virgo Cluster Survey (NGVS), for 3689 Virgo cluster members spanning a mass range of $\\sim$$10^{11}M_{\\odot}$ to $\\sim$$10^5~M_{\\odot}$. Our analysis introduces a new, two-component visual classification scheme developed to capture the morphological diversity of galaxies over more than six orders of magnitude in stellar mass. Our morphological classifications use two parameters to describe the global structure and star formation activity of each galaxy. Structural sub-codes denote features such as spiral arms, bars, disks, shells, streams, while star formation sub-codes indicate the form and location of the current star formation activity (e.g., in cores, clumps, filaments, etc). These visual classifications rely on deep $g^\\prime$-band images, supplemented by $u^{*}g^{\\prime}i^{\\prime}$ color images, as well as unsharp-masked images for a subset of objects. We compare our classifications to previous results for bright member galaxies that used more established schemes, finding good agreement. We also measure quantitative classification statistics (e.g., CASGM$_{20}$) for a subset of the brighter galaxies, and present catalogs for some galaxy types of special interest, including structurally compact galaxies, ultra-diffuse galaxies, candidate ultra-compact dwarf transition objects, as well as candidate post-merger systems. These morphological classifications may be useful as a training set in the application of machine learning tools to the next generation of wide-field imaging surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.20944.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21197",
      "title": "Supernovae Driven Winds Impede Lyman Continuum Escape from Dwarf Galaxies in First 10 Myr",
      "authors": [
        "Cody Carr",
        "Renyue Cen",
        "Stephan McCandliss",
        "Jack Ford",
        "Alberto Saldana-Lopez",
        "Claudia Scarlata",
        "Mason Huberty",
        "Anne Jaskot",
        "Sophia Flury",
        "M. S. Oey",
        "Ricardo O. Amorín",
        "Sanchayeeta Borthakur",
        "Matthew Hayes",
        "Timothy Heckman",
        "Zhiyuan Ji",
        "Lena Komarova",
        "Alexandra Le Reste",
        "Floriane Leclercq",
        "Rui Marques-Chaves",
        "Leo Michel-Dansac",
        "Göran Östlin",
        "Swara Ravindranath",
        "Michael J. Rutkowski",
        "Daniel Schaerer",
        "Trinh Thuan",
        "Eros Vanzella",
        "Bingjie Wang",
        "Xinfeng Xu"
      ],
      "abstract": "Supernovae Driven Winds Impede Lyman Continuum Escape from Dwarf Galaxies in First 10 Myr Cody Carr, Renyue Cen, Stephan McCandliss, Jack Ford, Alberto Saldana-Lopez, Claudia Scarlata, Mason Huberty, Anne Jaskot, Sophia Flury, M. S. Oey, Ricardo O. Amorín, Sanchayeeta Borthakur, Matthew Hayes, Timothy Heckman, Zhiyuan Ji, Lena Komarova, Alexandra Le Reste, Floriane Leclercq, Rui Marques-Chaves, Leo Michel-Dansac, Göran Östlin, Swara Ravindranath, Michael J. Rutkowski, Daniel Schaerer, Trinh Thuan, Eros Vanzella, Bingjie Wang, Xinfeng Xu Astrophysics of Galaxies (astro-ph.GA) Observations suggest that UV-bright, compact star-forming galaxies produce enough ionizing (Lyman continuum; LyC) photons to reionize the Universe. Yet, the efficiency of LyC escape and the roles of radiation, stellar winds, and supernovae remain uncertain. Using medium-resolution spectra of six nearly identical local star-forming galaxies, we directly trace, for the first time, the evolution of a multiphase wind through individual spectral lines alongside measurements of the LyC escape fraction. We find that LyC escape peaks early, during a period dominated by intense radiation and stellar winds but lacking a fast galactic wind. As the starbursts age, supernovae drive and accelerate the wind, progressively suppressing LyC escape. These results highlight the need for cosmological simulations to incorporate early feedback as a key driver of reionization.",
      "pdf_url": "https://arxiv.org/pdf/2510.21197.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21212",
      "title": "Modelling the scattering by porous aggregate dust grains in the Far-Ultraviolet halos of Spica and Achernar",
      "authors": [
        "Nilanjana Dey Choudhury",
        "P. Shalima",
        "Keerthana U.",
        "J. Murthy"
      ],
      "abstract": "Modelling the scattering by porous aggregate dust grains in the Far-Ultraviolet halos of Spica and Achernar Nilanjana Dey Choudhury, P. Shalima, Keerthana U., J. Murthy 11 pages, 17 figures, 9 tables, New Astronomy (accepted) Astrophysics of Galaxies (astro-ph.GA) Far-Ultraviolet (FUV) halos have been detected around six bright stars by Murthy and Henry (2011) using GALEX observations. These halos are thought to be caused by forward scattering of the starlight by dust grains present in thin foreground clouds. The optical constants of grains producing such halos have been constrained earlier by using a single scattering model, that considered the Henyey-Greenstein empirical phase function instead of theoretical phase functions for the scattering grains. In this work, we have modelled the FUV halos for two stars, Spica and Achernar, by considering the realistic porous aggregates of different sizes and compositions. As the Henyey-Greenstein phase function is known to deviate from theoretical predictions, we have utilized theoretical scattering phase functions for modelling. The dust is placed in a double-layered plane-parallel sheet with its distance and optical depth varied to get the best fit. We find that the halo intensities are dominated by scattering due to 0.05 {\\mu}m sized porous dust aggregates made of amorphous silicate and carbonaceous aggregates for Spica and Achernar, respectively. We find that the medium in front of Achernar has a lower optical depth ({\\tau}) of 0.032 compared to Spica which has a value of {\\tau} = 0.1. This low value is close to the optical depth of the local ISM (0.01) within 40 pc of the Sun. This study demonstrates an effective method to constrain the dust grain properties in the local interstellar medium.",
      "pdf_url": "https://arxiv.org/pdf/2510.21212.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21395",
      "title": "AGN STORM 2. XI. Spectroscopic reverberation mapping of the hot dust in Mrk 817",
      "authors": [
        "Hermine Landt",
        "Benjamin D. Boizelle",
        "Michael S. Brotherton",
        "Laura Ferrarese",
        "Travis Fischer",
        "Varoujan Gorjian",
        "Michael D. Joner",
        "Daniel Kynoch",
        "Jacob N. McLane",
        "Jake A. J. Mitchell",
        "John W. Montano",
        "Rogemar A. Riffel",
        "David Sanmartim",
        "Thaisa Storchi-Bergmann",
        "Martin J. Ward",
        "Aaron J. Barth",
        "Edward M. Cackett",
        "Gisella De Rosa",
        "Rick Edelson",
        "Jonathan Gelbord",
        "Yasaman Homayouni",
        "Keith Horne",
        "Erin A. Kara",
        "Gerard A. Kriss",
        "Nahum Arav",
        "Elena Dalla Bontà",
        "Maryam Dehghanian",
        "Gary J. Ferland",
        "Carina Fian",
        "Diego H. González Buitrago",
        "Dragana Ilić",
        "Shai Kaspi",
        "Christopher S. Kochanek",
        "Andjelka B. Kovačević",
        "Collin Lewin",
        "Yan-Rong Li",
        "Missagh Mehdipour",
        "Hagai Netzer",
        "Rachel Plesha",
        "Luka Č. Popović",
        "Daniel Proga",
        "Jian-Min Wang",
        "Fatima Zaidouni",
        "Ying Zu"
      ],
      "abstract": "AGN STORM 2. XI. Spectroscopic reverberation mapping of the hot dust in Mrk 817 Hermine Landt, Benjamin D. Boizelle, Michael S. Brotherton, Laura Ferrarese, Travis Fischer, Varoujan Gorjian, Michael D. Joner, Daniel Kynoch, Jacob N. McLane, Jake A. J. Mitchell, John W. Montano, Rogemar A. Riffel, David Sanmartim, Thaisa Storchi-Bergmann, Martin J. Ward, Aaron J. Barth, Edward M. Cackett, Gisella De Rosa, Rick Edelson, Jonathan Gelbord, Yasaman Homayouni, Keith Horne, Erin A. Kara, Gerard A. Kriss, Nahum Arav, Elena Dalla Bontà, Maryam Dehghanian, Gary J. Ferland, Carina Fian, Diego H. González Buitrago, Dragana Ilić, Shai Kaspi, Christopher S. Kochanek, Andjelka B. Kovačević, Collin Lewin, Yan-Rong Li, Missagh Mehdipour, Hagai Netzer, Rachel Plesha, Luka Č. Popović, Daniel Proga, Jian-Min Wang, Fatima Zaidouni, Ying Zu Astrophysics of Galaxies (astro-ph.GA); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) The AGN Space Telescope and Optical Reverberation Mapping 2 (STORM 2) campaign targeted Mrk 817 with intensive multi-wavelength monitoring and found its soft X-ray emission to be strongly absorbed. We present results from 157 near-IR spectra with an average cadence of a few days. Whereas the hot dust reverberation signal as tracked by the continuum flux does not have a clear response, we recover a dust reverberation radius of $\\sim 90$ light-days from the blackbody dust temperature light-curve. This radius is consistent with previous photometric reverberation mapping results when Mrk 817 was in an unobscured state. The heating/cooling process we observe indicates that the inner limit of the dusty torus is set by a process other than sublimation, rendering it a luminosity-invariant `dusty wall' of a carbonaceous composition. Assuming thermal equilibrium for dust optically thick to the incident radiation, we derive a luminosity of $\\sim 6 \\times 10^{44}$ erg s$^{-1}$ for the source heating it. This luminosity is similar to that of the obscured spectral energy distribution, assuming a disk with an Eddington accretion rate of $\\dot{m} \\sim 0.2$. Alternatively, the dust is illuminated by an unobscured lower luminosity disk with $\\dot{m} \\sim 0.1$, which permits the UV/optical continuum lags in the high-obscuration state to be dominated by diffuse emission from the broad-line region. Finally, we find hot dust extended on scales $> 140-350$ pc, associated with the rotating disk of ionised gas we observe in spatially-resolved [SIII] $\\lambda 9531$ images. Its likely origin is in the compact bulge of the barred spiral host galaxy, where it is heated by a nuclear starburst.",
      "pdf_url": "https://arxiv.org/pdf/2510.21395.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21500",
      "title": "Discovery of a giant radio outburst of the narrow-line Seyfert 1 galaxy SDSS J110546.07+145202.4",
      "authors": [
        "K. É. Gabányi",
        "S. Komossa",
        "A. Kraus",
        "A. Mezősi",
        "S. Frey"
      ],
      "abstract": "Discovery of a giant radio outburst of the narrow-line Seyfert 1 galaxy SDSS J110546.07+145202.4 K. É. Gabányi, S. Komossa, A. Kraus, A. Mezősi, S. Frey published in A&A, 2 figures, 1 table Astrophysics of Galaxies (astro-ph.GA) We have identified a high-amplitude radio outburst in the course of a large-sample study of the radio properties of narrow-line Seyfert 1 (NLS1) galaxies. We have analysed previous radio data and obtained new radio observations with the Effelsberg 100 m telescope, in order to measure the properties and understand the nature of the high-amplitude radio variability. We have also searched for signs of variability in the infrared and optical bands using archival data. We report the discovery of a rare high-amplitude radio outburst of a NLS1 galaxy, SDSS J110546.07+145202.4, with an amplitude of a factor of >20 at centimetre wavelengths within 18 yr, and remaining at high-state for at least 7.6 yr. Thus, the object transitioned to a radio-loud state with a radio-loudness parameter exceeding 150. The radio spectrum measured at gigahertz frequencies during the 2020s is flat. We did not find indications of a similar increase in brightness in optical surveys or in the infrared measurements of the Wide-field Infrared Survey Explorer. The variability characteristics are inconsistent with tidal disruption events, and hard to reconcile with blazar variability.",
      "pdf_url": "https://arxiv.org/pdf/2510.21500.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21632",
      "title": "Exploring the statistical properties of double radio relics in the TNG-Cluster and TNG300 simulations",
      "authors": [
        "Wonki Lee",
        "Annalisa Pillepich",
        "Dylan Nelson",
        "Myungkook James Jee",
        "Daisuke Nagai",
        "Kyle Finner",
        "John ZuHone"
      ],
      "abstract": "Exploring the statistical properties of double radio relics in the TNG-Cluster and TNG300 simulations Wonki Lee, Annalisa Pillepich, Dylan Nelson, Myungkook James Jee, Daisuke Nagai, Kyle Finner, John ZuHone Astrophysics of Galaxies (astro-ph.GA) Double radio relics, pairs of diffuse radio features located on opposite sides of merging galaxy clusters, are a rare subclass of radio relics that are believed to trace merger shocks and provide valuable constraints on plasma acceleration models and merger history. With the number of known double relics growing in recent and upcoming radio surveys, statistical analyses of their properties are becoming feasible. In this study, we utilize the cosmological magnetohydrodynamics zoom-in simulations TNG-Cluster, in combination with TNG300-1, to examine the statistical properties of double radio relics. The simulated double relic pairs exhibit a wide range of luminosity ratios, broadly consistent with the observations. We find that the two relics in a given double system often differ significantly in their shock properties and magnetic field strengths. This diversity implies that the observed brightness asymmetry in the pair cannot be explained by a single factor alone, but instead reflects an interplay of multiple physical parameters. Nevertheless, double radio relics tend to align with the collision axis within $\\sim30^{\\circ}$ and their separation ($d_{\\rm drr}$) correlates tightly with the time since collision (TSC) as ${\\rm TSC~[Gyr]} = 0.52 d_{\\rm drr}/R_{500\\rm c} - 0.24$, allowing it to be inferred with an accuracy of $\\sim0.2~\\rm Gyr$. With the statistical samples of simulated radio relics, we predict that low-mass clusters will constitute the dominant population of double radio relic systems detected with upcoming surveys such as SKA. These results demonstrate that double radio relics can serve as robust probes of merger dynamics and plasma acceleration, and that simulations provide critical guidance for interpreting the large samples expected from next-generation radio surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.21632.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21699",
      "title": "To Survive or to Shatter: The Impact of Cosmic Rays on the Fate of Stripped Cold Clouds",
      "authors": [
        "Manami Roy",
        "Kung-Yi Su",
        "Stephanie Tonnesen",
        "Yue Samuel Lu",
        "Cameron Hummels",
        "Sam B. Ponnada"
      ],
      "abstract": "To Survive or to Shatter: The Impact of Cosmic Rays on the Fate of Stripped Cold Clouds Manami Roy, Kung-Yi Su, Stephanie Tonnesen, Yue Samuel Lu, Cameron Hummels, Sam B. Ponnada 20 pages, 9 figures, 1 table, Submitted to The Astrophysical Journal (ApJ) Astrophysics of Galaxies (astro-ph.GA) Does cosmic ray (CR) pressure matter for the circumgalactic medium (CGM)? Despite growing interest, this remains a debated question, complicated by limited observational constraints and differing implementations of CR physics in simulations. While prior studies suggest that CRs influence the thermal and dynamical state of the CGM, their role in shaping cold gas structures remains underexplored. This paper investigates how CRs affect ram-pressure stripped cold gas clouds originating from satellite galaxies in a Milky Way-like halo. Using high-resolution simulations with varying CR energy densities, we find that CRs can significantly modify the size and survival of stripped clouds. Specifically, CR pressure puffs up the cold clouds, increasing their surface area and enabling more efficient mixing-layer cooling, allowing them to grow in mass. This enhanced growth results in higher cold gas inflow rates into the central galaxy, leading to an increase in the star formation rate compared to the no-CR case at a later time. Moreover, CRs can boost the total cold gas mass in the CGM by up to a factor of four. These effects are most pronounced in simulations where the CR energy density is in equipartition with the thermal gas. Our results demonstrate that CRs can play a critical role in regulating the cold phase of the CGM contributed by satellites and therefore their ability to feed galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.21699.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21707",
      "title": "Connecting Chemical Enrichment with Resolved Star Formation Histories",
      "authors": [
        "Christopher T. Garling",
        "Alex M. Garcia",
        "Niusha Ahvazi",
        "Nitya Kallivayalil",
        "Kristen B. W. McQuinn",
        "Robert Feldmann",
        "Roger E. Cohen"
      ],
      "abstract": "Connecting Chemical Enrichment with Resolved Star Formation Histories Christopher T. Garling, Alex M. Garcia, Niusha Ahvazi, Nitya Kallivayalil, Kristen B. W. McQuinn, Robert Feldmann, Roger E. Cohen Astrophysics of Galaxies (astro-ph.GA) We present a new framework for modeling the chemical enrichment histories of galaxies by integrating the chemical evolution with resolved star formation histories (SFHs) derived from color-magnitude diagrams. This novel approach links the time evolution of the metallicity of the star-forming ISM to the cumulative stellar mass formed in the galaxy, enabling a physically motivated, self-consistent description of chemical evolution. We apply this methodology to four isolated, gas-rich Local Group dwarf galaxies -- WLM, Aquarius, Leo A, and Leo P -- using deep HST and JWST imaging. For WLM, Aquarius, and Leo A, we independently validate our metallicity evolution results using ages and metallicities of individual red giant stars with spectroscopic measurements, finding good agreement. We quantify systematic uncertainties by repeating our analysis with multiple stellar evolution and bolometric correction libraries. We then compare the observed chemical enrichment histories to predictions from the TNG50 and FIREbox cosmological hydrodynamic simulations and the Galacticus semi-analytic model. We find that the enrichment history of WLM is best reproduced by the FIREbox simulation, while TNG50 and Galacticus predict higher metallicities at early times. Our results suggest that differences in stellar feedback and metal recycling prescriptions drive significant variation in the predicted chemical enrichment of dwarf galaxies, particularly at early times. This work demonstrates the power of combining resolved SFHs with physically motivated chemical evolution models to constrain galaxy formation physics and highlights the need for further observational and theoretical studies of metal retention and recycling in low-mass dwarf galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.21707.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2405.19401",
      "title": "Net-zero gas inflow: Measurement of the gas consumption history of a massive quiescent galaxy",
      "authors": [
        "Jan Scholtz",
        "Francesco D'Eugenio",
        "Roberto Maiolino",
        "Pablo G. Pérez-González",
        "Chiara Circosta",
        "Sandro Tacchella",
        "Christina C. Williams",
        "Stacey Alberts",
        "Santiago Arribas",
        "William M. Baker",
        "Elena Bertola",
        "Andrew J. Bunker",
        "Stefano Carniani",
        "Stephane Charlot",
        "Giovanni Cresci",
        "Gareth C. Jones",
        "Nimisha Kumari",
        "Isabella Lamperti",
        "Tobias J. Looser",
        "Bruno Rodríguez Del Pino",
        "Brant Robertson",
        "Eleonora Parlanti",
        "Michele Perna",
        "Hannah Übler",
        "Giacomo Venturi",
        "Joris Witstok"
      ],
      "abstract": "Net-zero gas inflow: Measurement of the gas consumption history of a massive quiescent galaxy Jan Scholtz, Francesco D'Eugenio, Roberto Maiolino, Pablo G. Pérez-González, Chiara Circosta, Sandro Tacchella, Christina C. Williams, Stacey Alberts, Santiago Arribas, William M. Baker, Elena Bertola, Andrew J. Bunker, Stefano Carniani, Stephane Charlot, Giovanni Cresci, Gareth C. Jones, Nimisha Kumari, Isabella Lamperti, Tobias J. Looser, Bruno Rodríguez Del Pino, Brant Robertson, Eleonora Parlanti, Michele Perna, Hannah Übler, Giacomo Venturi, Joris Witstok 14 pages, 4 figures. Accepted to Nature Astronomy Astrophysics of Galaxies (astro-ph.GA) JWST is discovering increasing numbers of quiescent galaxies 1--2 billion years after the Big Bang, whose redshift, high mass, and old stellar ages indicate that their formation and quenching were surprisingly rapid. This fast-paced evolution seems to require that feedback from AGN (active galactic nuclei) be faster and/or more efficient than previously expected \\citep{Xie24}. We present deep ALMA observations of cold molecular gas (the fuel for star formation) in a massive, fast-rotating, post-starburst galaxy at $z=3.064$. This galaxy hosts an AGN, driving neutral-gas outflows with a mass-outflow rate of $60\\pm20$ M$_{\\odot}$ yr$^{-1}$, and has a star-formation rate of $<5.6$ M$_{\\odot}$ yr$^{-1}$. Our data reveal this system to be the most distant gas-poor galaxy confirmed with direct CO observations (molecular-gas mass $< 10^{9.1}$ M$_{\\odot}$; <0.8 % of its stellar mass). Combining ALMA and JWST observations, we estimate the gas-consumption history of this galaxy, showing that it evolved with net zero gas inflow, i.e., gas consumption by star formation matches the amount of gas this galaxy is missing relative to star-forming galaxies. This could arise both from preventive feedback stopping further gas inflow, which would otherwise refuel star formation or, alternatively, from fine-tuned ejective feedback matching precisely gas inflows. Our methods, applied to a larger sample, promise to disentangle ejective vs preventive feedback.",
      "pdf_url": "https://arxiv.org/pdf/2405.19401.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.16139",
      "title": "Measuring the Stellar-to-Halo Mass Relation at $\\sim10^{10}$ Solar masses, using forthcoming space-based imaging of galaxy-galaxy strong lenses",
      "authors": [
        "Kaihao Wang",
        "Xiaoyue Cao",
        "Ran Li",
        "James W. Nightingale",
        "Qiuhan He",
        "Aristeidis Amvrosiadis",
        "Richard Massey",
        "Maximilian von Wietersheim-Kramsta",
        "Leo W.H. Fung",
        "Carlos S. Frenk",
        "Shaun Cole",
        "Andrew Robertson",
        "Samuel C. Lange",
        "Xianghao Ma"
      ],
      "abstract": "Measuring the Stellar-to-Halo Mass Relation at $\\sim10^{10}$ Solar masses, using forthcoming space-based imaging of galaxy-galaxy strong lenses Kaihao Wang, Xiaoyue Cao, Ran Li, James W. Nightingale, Qiuhan He, Aristeidis Amvrosiadis, Richard Massey, Maximilian von Wietersheim-Kramsta, Leo W.H. Fung, Carlos S. Frenk, Shaun Cole, Andrew Robertson, Samuel C. Lange, Xianghao Ma 11 pages, 9 figures, submitted to MNRAS. Revised following referee comments. Major updates: added new tests, updated results and conclusions, expanded the discussion section Astrophysics of Galaxies (astro-ph.GA) The stellar-to-halo mass relation (SHMR) is central to understanding the co-evolution of galaxies and their host dark matter haloes, yet it remains weakly constrained for dwarf galaxies owing to their faintness, especially beyond the Local Group. Strong gravitational lensing offers a unique probe of the SHMR at sub-galactic scales and cosmological distances, as the masses of subhalos within the main lens can be inferred from the perturbations they imprint on lensed images. Anticipating the discovery of $\\sim10^5$ galaxy--galaxy strong lenses by forthcoming facilities such as \\textit{Euclid}, we perform an end-to-end simulation to forecast \\textit{Euclid}'s constraints on the SHMR at the halo mass scale of $\\sim10^{10}\\,\\mathrm{M}_\\odot$. We generate mock \\textit{Euclid} VIS images of lens systems hosting a fiducial $3\\times10^{10}\\,\\mathrm{M}_\\odot$ subhalo and vary its properties to assess the robustness of mass inference. We find that \\textit{Euclid}'s angular resolution cannot break the intrinsic mass--concentration degeneracy of subhaloes, nor deblend the light of satellite galaxies (when present) associated with them, leading to biased inferred halo masses. These limitations are overcome with high-resolution follow-up imaging from facilities such as the \\textit{Hubble Space Telescope}, enabling accurate halo-mass measurements. We forecast that a statistical sample of $\\sim100$ such systems, combining lensing-derived halo masses with stellar masses from photometric SED fitting, can constrain the SHMR at dwarf-galaxy scales with a precision of $\\sim0.05$~dex in halo mass and $\\sim0.03$~dex in stellar mass, enabling powerful tests of galaxy formation theories.",
      "pdf_url": "https://arxiv.org/pdf/2501.16139.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.10751",
      "title": "Tentative rotation in a galaxy at z$\\sim$14 with ALMA",
      "authors": [
        "J. Scholtz",
        "E. Parlanti",
        "S. Carniani",
        "M. Kohandel",
        "F. Sun",
        "A. L. Danhaive",
        "R. Maiolino",
        "S. Arribas",
        "R. Bhatawdekar",
        "A. J. Bunker",
        "S. Charlot",
        "F. D'Eugenio",
        "A. Ferrara",
        "Z. Ji",
        "Gareth C. Jones",
        "P. Rinaldi",
        "B. Robertson",
        "A. Pallottini",
        "I. Shivaei",
        "Y. Sun",
        "S. Tacchella",
        "H. Übler",
        "G. Venturi"
      ],
      "abstract": "Tentative rotation in a galaxy at z$\\sim$14 with ALMA J. Scholtz, E. Parlanti, S. Carniani, M. Kohandel, F. Sun, A. L. Danhaive, R. Maiolino, S. Arribas, R. Bhatawdekar, A. J. Bunker, S. Charlot, F. D'Eugenio, A. Ferrara, Z. Ji, Gareth C. Jones, P. Rinaldi, B. Robertson, A. Pallottini, I. Shivaei, Y. Sun, S. Tacchella, H. Übler, G. Venturi accepted in Submitted to MNRAS as a letter Astrophysics of Galaxies (astro-ph.GA) We re-analysed ALMA observations of the [OIII]$\\lambda$88$\\mu$m emission line in JADES-GS-z14.0, so far the most distant spectroscopically confirmed galaxy at z=14.18. Our analysis shows a tentative detection of a velocity gradient of [OIII]$\\lambda$88$\\mu$m using three independent tests: 1) construction of moment maps; 2) extraction of integrated spectra from a grid of apertures; and 3) spectro-astrometry in both the image and uv planes. We performed kinematical fitting using the KinMS code and estimated a dynamical mass of log$_{10}$(M$_{\\rm dyn}$/$\\rm M_\\odot$)= 9.4$^{+0.8}_{-0.4}$, with the bulk of the uncertainties due to the degeneracy between dynamical mass and inclination. We measure an upper limit on the velocity dispersion ($\\sigma_{v}$) of $<40~$ km/s~which results in an estimate of V$_{\\rm rot}/\\sigma>$ 2.5. This result, if confirmed with higher-resolution observations, would imply that kinematically cold discs are already in place at $z\\sim14$. Comparison with mock observations from the SERRA cosmological simulations confirms that even low-resolution observations are capable of detecting a velocity gradient in $z>10$ galaxies as compact as JADES-GS-z14.0. This work shows that deeper ALMA or JWST/NIRSpec IFS observations with high spatial resolution will be able to estimate an accurate dynamical mass for JADES-GS-z14.0, providing an upper limit to the stellar mass of this over-luminous galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2503.10751.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.17809",
      "title": "JADES: Carbon-enhanced, Nitrogen-normal compact galaxy at z=11.2",
      "authors": [
        "J. Scholtz",
        "M. S. Silcock",
        "E. Curtis-Lake",
        "R. Maiolino",
        "S. Carniani",
        "F. D'Eugenio",
        "X. Ji",
        "P. Jakobsen",
        "K. Hainline",
        "S. Arribas",
        "W. M. Baker",
        "R. Bhatawdekar",
        "A. J. Bunker",
        "S. Charlot",
        "J. Chevallard",
        "M. Curti",
        "Daniel J. Eisenstein",
        "Y. Isobe",
        "G. C. Jones",
        "E. Parlanti",
        "P. G. Pérez-González",
        "P. Rinaldi",
        "B. Robertson",
        "S. Tacchella",
        "H. Übler",
        "C. C. Williams",
        "C. Willott",
        "J. Witstok"
      ],
      "abstract": "JADES: Carbon-enhanced, Nitrogen-normal compact galaxy at z=11.2 J. Scholtz, M. S. Silcock, E. Curtis-Lake, R. Maiolino, S. Carniani, F. D'Eugenio, X. Ji, P. Jakobsen, K. Hainline, S. Arribas, W. M. Baker, R. Bhatawdekar, A. J. Bunker, S. Charlot, J. Chevallard, M. Curti, Daniel J. Eisenstein, Y. Isobe, G. C. Jones, E. Parlanti, P. G. Pérez-González, P. Rinaldi, B. Robertson, S. Tacchella, H. Übler, C. C. Williams, C. Willott, J. Witstok Astrophysics of Galaxies (astro-ph.GA) Over the past few years \\textit{JWST} has been a major workhorse in detecting and constraining the metal enrichment of the first galaxies in the early Universe and finding the source of the ionisation of their interstellar medium. In this work, we present new deep JWST/NIRSpec spectroscopy of GS-z11-1, a galaxy at z = 11.28, in which we report the detection of multiple rest-frame UV and optical emission lines: CIII]$\\lambda\\lambda$1907,09, CIV]$\\lambda\\lambda$1548,51, [OII]$\\lambda\\lambda$3726,29, [NeIII]$\\lambda$3869, H$\\gamma$ and tentative evidence for HeII$\\lambda$1640. The ionisation properties of GS-z11-1 are consistent with star formation, with potential contribution from an active galactic nucleus (AGN). We estimate a galaxy stellar mass of log(M$_{*}$/M$_{\\odot}$) = 7.8$\\pm$0.2 and log(SFR/(M$_{\\odot}$ yr$^{-1}$))= 0.32$\\pm$0.11 for the fiducial SF-only models. We measured C/O from the SED modelling of C/O = 1.20$\\pm0.15 \\times$ solar. This is one of the highest C/O abundances at z$>$10, and it is consistent with either PopII and PopIII enrichment paths. Despite this source being extremely compact, with a half-light radius of 73$\\pm$10 pc, we see no increased equivalent width of NIV] and NIII] emission lines as seen in some other compact sources at similar redshifts, a potential signature of second-generation stars in GCs. Overall, this galaxy exhibits low metallicity and high ionisation parameter consistent with intense star-formation or AGN activity in the early Universe, possibly observed before the enrichment by the second generation of stars in proto-globular clusters in the core of the galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2507.17809.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.00729",
      "title": "Kinematic analysis of an Ultra-Strong MgII absorber at z~1.13 linking to Circumgalactic Gas Structures",
      "authors": [
        "Purvi Udhwani",
        "Sameer",
        "Anand Narayanan",
        "Sowgat Muzahid",
        "Jane Charlton",
        "Sebastiano Cantalupo"
      ],
      "abstract": "Kinematic analysis of an Ultra-Strong MgII absorber at z~1.13 linking to Circumgalactic Gas Structures Purvi Udhwani, Sameer, Anand Narayanan, Sowgat Muzahid, Jane Charlton, Sebastiano Cantalupo Accepted for publication in The Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) We present a spectroscopic and imaging analysis of the $z_{gal} \\approx 1.1334$ ultra-strong MgII absorption system identified in the $VLT$/UVES spectrum of a background quasar located at $\\rho \\approx 18$ kpc from a star-forming galaxy. Low ionization metal lines like MgI, FeII, and CaII are also detected for this absorber. The HI lines are outside of the wavelength coverage. The MgII has a rest-frame equivalent width of $W_r(2796) =3.185 +/- 0.032 A^{\\circ} $, with the absorption spread across $\\Delta v \\approx 460$ km~s$^{-1}$ in several components. A component-by-component ionization modeling shows several of these components having solar and higher metallicities. The models also predict a total HI column density of $log[N(HI)/cm^{-2}] \\approx 22.5$, consistent with ultra-strong MgII absorbers being sub-Damped Lyman Alpha and Damped Lyman Alpha systems. The absorber is well within the virial radius of the nearest galaxy which has a stellar mass $M_* = 4.7 \\times 10^{10}$~M$_\\odot$, and a star formation rate of $\\approx 8.3$~M$_\\odot$~yr$^{-1}$. The absorption is along the projected major axis of the galaxy with a velocity spread that is wider than the galaxy's disk rotation. From the kinematic analysis of the absorber and the galaxy, the origin of the absorption can be attributed to a combination of circumgalactic gas structures, some corotating with the disk and the rest at line-of-sight velocities outside of the disk rotation.",
      "pdf_url": "https://arxiv.org/pdf/2510.00729.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18764",
      "title": "Linking Electron Density with Elevated Star Formation Activity from $z=0$ to $z=10$",
      "authors": [
        "Sijia Li",
        "Si-Yue Yu",
        "Luis C. Ho",
        "John D. Silverman",
        "Jing Wang",
        "Amelie Saintonge",
        "Niankun Yu",
        "Qinyue Fei",
        "Daichi Kashino",
        "Hao-ran Yu"
      ],
      "abstract": "Linking Electron Density with Elevated Star Formation Activity from $z=0$ to $z=10$ Sijia Li, Si-Yue Yu, Luis C. Ho, John D. Silverman, Jing Wang, Amelie Saintonge, Niankun Yu, Qinyue Fei, Daichi Kashino, Hao-ran Yu 12 pages, 4 figures, 1 table. ApJL in press. A typo in Eq. (8) has been corrected Astrophysics of Galaxies (astro-ph.GA) The interstellar medium (ISM) in high-redshift galaxies exhibits significantly higher electron densities ($n_{\\rm e}$) than in the local universe. To investigate the origin of this trend, we analyze a sample of 9590 centrally star-forming galaxies with stellar masses greater than $10^9\\,M_\\odot$ at redshifts $0.01 < z < 0.04$, selected from the Dark Energy Spectroscopic Instrument (DESI) Data Release 1. We derive electron densities from the [S II] $\\lambda\\lambda6716,6731$ doublet, measuring values of $n_{\\rm e} = 30$-$400~{\\rm cm^{-3}}$ at $z \\approx 0$. We find a tight correlation between $n_{\\rm e}$ and the star formation rate surface density ($\\Sigma_{\\rm SFR}$), which is well described by a broken power law. Above a threshold of $\\log(\\Sigma_{\\rm SFR} / M_\\odot\\,{\\rm yr^{-1}\\,kpc^{-2}}) \\ge -1.46$, the relation follows $n_{\\rm e} = (233 \\pm 13)\\,\\Sigma_{\\rm SFR}^{0.49 \\pm 0.02}$. Below this threshold, $n_{\\rm e}$ remains approximately constant at $44 \\pm 3~{\\rm cm^{-3}}$. Remarkably, this relation remains consistent with measurements of galaxies at $z = 0.9$-$10.2$. By converting the observed redshift evolution of $\\Sigma_{\\rm SFR}$ into $n_{\\rm e}$ evolution through our $n_{\\rm e}$-$\\Sigma_{\\rm SFR}$ relation, we obtain $n_{\\rm e} = 40(1+z)^{1.4}~{\\rm cm^{-3}}$, consistent with previous direct observations. The $n_{\\rm e}$-$\\Sigma_{\\rm SFR}$ relation likely arises because the high $\\Sigma_{\\rm SFR}$, fueled by dense cold gas or elevated efficiency, enhances radiative and mechanical feedback and produces dense ionized gas whose electron densities are further regulated by ambient pressure. We conclude that the redshift evolution of $n_{\\rm e}$ primarily reflects the evolution of cold gas density and star formation activity over cosmic time.",
      "pdf_url": "https://arxiv.org/pdf/2510.18764.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20466",
      "title": "The effect of triaxiality on the dynamics of triple supermassive black holes in a cosmological context",
      "authors": [
        "Navonil Saha",
        "Peter Berczik",
        "Andreas Just",
        "Margarita Sobolenko"
      ],
      "abstract": "The effect of triaxiality on the dynamics of triple supermassive black holes in a cosmological context Navonil Saha, Peter Berczik, Andreas Just, Margarita Sobolenko 4 pages, 2 figures, accepted for publication in the International Astronomical Union Proceedings Series. Paper presented at the IAU Symposium 398 & MODEST-25 : Compact Objects and Binaries in Dense Stellar Systems Astrophysics of Galaxies (astro-ph.GA) The hierarchical nature of galaxy formation in the $\\Lambda$CDM framework often leads to multiple supermassive black holes (SMBHs) in the galactic nuclei. The timescale over which galaxies merge, plays a crucial role in shaping the dynamical evolution and the merger dynamics of their central SMBHs. While binary SMBH evolution is well studied, the long-term dynamics of triple SMBH systems, particularly in non-spherical potentials, remain less understood. We investigate the role of triaxiality in the evolution and dynamics of triple SMBHs with initial conditions drawn from the ROMULUS25 cosmological simulation, using high-resolution gravitodynamical N-body simulations. We explore different orbital configurations and host shapes, tracking the evolution from galactic inspiral to hard binary formation at sub-parsec scales. In all cases, the two most massive SMBHs form a rapidly hardening binary that coalesces within a fraction of a Hubble time, while the third forms a stable hierarchical triple system with the heavier binary, or remains on a wide orbit.",
      "pdf_url": "https://arxiv.org/pdf/2510.20466.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13974",
      "title": "Predictions of the Nancy Grace Roman Space Telescope Galactic Exoplanet Survey. IV. Lens Mass and Distance Measurements",
      "authors": [
        "Sean K. Terry",
        "Etienne Bachelet",
        "Farzaneh Zohrabi",
        "Himanshu Verma",
        "Alison Crisp",
        "Macy Huston",
        "Carissma McGee",
        "Matthew Penny",
        "Natasha S. Abrams",
        "Michael D. Albrow",
        "Jay Anderson",
        "Fatemeh Bagheri",
        "Jean-Phillipe Beaulieu",
        "Andrea Bellini",
        "David P. Bennett",
        "Galen Bergsten",
        "T. Dex Bhadra",
        "Aparna Bhattacharya",
        "Ian A. Bond",
        "Valerio Bozza",
        "Christopher Brandon",
        "Sebastiano Calchi Novati",
        "Sean Carey",
        "Jessie Christiansen",
        "William DeRocco",
        "B. Scott Gaudi",
        "Jon Hulberg",
        "Stela Ishitani Silva",
        "Sinclaire E. Jones",
        "Eamonn Kerins",
        "Somayeh Khakpash",
        "Katarzyna Kruszynska",
        "Casey Lam",
        "Jessica R. Lu",
        "Amber Malpas",
        "Shota Miyazaki",
        "Przemek Mroz",
        "Arjun Murlidhar",
        "David Nataf",
        "Marz Newman",
        "Greg Olmschenk",
        "Rakek Poleski",
        "Clement Ranc",
        "Nicholas J. Rattenbury",
        "Krzysztof Rybicki",
        "Vito Saggese",
        "Jennifer Sobeck",
        "Keivan G. Stassun",
        "Alexander P. Stephan",
        "Rachel A. Street",
        "Takahiro Sumi",
        "Daisuke Suzuki",
        "Aikaterini Vandorou",
        "Meet Vyas",
        "Jennifer C. Yee",
        "Weicheng Zang",
        "Keming Zhang"
      ],
      "abstract": "Predictions of the Nancy Grace Roman Space Telescope Galactic Exoplanet Survey. IV. Lens Mass and Distance Measurements Sean K. Terry, Etienne Bachelet, Farzaneh Zohrabi, Himanshu Verma, Alison Crisp, Macy Huston, Carissma McGee, Matthew Penny, Natasha S. Abrams, Michael D. Albrow, Jay Anderson, Fatemeh Bagheri, Jean-Phillipe Beaulieu, Andrea Bellini, David P. Bennett, Galen Bergsten, T. Dex Bhadra, Aparna Bhattacharya, Ian A. Bond, Valerio Bozza, Christopher Brandon, Sebastiano Calchi Novati, Sean Carey, Jessie Christiansen, William DeRocco, B. Scott Gaudi, Jon Hulberg, Stela Ishitani Silva, Sinclaire E. Jones, Eamonn Kerins, Somayeh Khakpash, Katarzyna Kruszynska, Casey Lam, Jessica R. Lu, Amber Malpas, Shota Miyazaki, Przemek Mroz, Arjun Murlidhar, David Nataf, Marz Newman, Greg Olmschenk, Rakek Poleski, Clement Ranc, Nicholas J. Rattenbury, Krzysztof Rybicki, Vito Saggese, Jennifer Sobeck, Keivan G. Stassun, Alexander P. Stephan, Rachel A. Street, Takahiro Sumi, Daisuke Suzuki, Aikaterini Vandorou, Meet Vyas, Jennifer C. Yee, Weicheng Zang, Keming Zhang Updated. 29 pages, 8 figures, 6 tables, submitted to AJ Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) As part of the Galactic Bulge Time Domain Survey (GBTDS), the Nancy Grace Roman Galactic Exoplanet Survey (RGES) will use microlensing to discover cold outer planets and free-floating planets unbound to stars. NASA has established several science requirements for the GBTDS to ensure RGES success. A key advantage of RGES is Roman's high angular resolution, which will allow detection of flux from many host stars. One requirement specifies that Roman must measure the masses and distances of 40% of detected planet hosts with 20% precision or better. To test this, we simulated microlensing events toward the GBTDS fields and used Fisher matrix analysis to estimate light curve parameter uncertainties. Combining these with Roman imaging observables (lens flux, relative lens-source proper motion), we estimated the achievable precision of lens mass and distance measurements. Using pyLIMASS, a publicly available code for estimating lens properties, we applied this analysis to 3,000 simulated events. Assuming the Cassan et al. (2012) exoplanet mass function, we find that >40% of host stars meet the required 20% precision threshold, confirming that the GBTDS can satisfy the mission requirement. We validated our approach by comparing our inferred lens masses and distances to empirical measurements from detailed image-constrained light curve modeling of historical microlensing events with Hubble and Keck follow-up imaging. Our results agree within roughly 1 sigma, demonstrating that both approaches yield consistent and reliable mass and distance estimates, and confirming the robustness of our simulations for Roman-era microlensing science.",
      "pdf_url": "https://arxiv.org/pdf/2510.13974.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20946",
      "title": "Bayesian and Deterministic Neural Network approaches to Faraday Cup calibration and plasma parameter estimation",
      "authors": [
        "Lidiya Ahmed",
        "Michael L Stevens",
        "Kristoff Paulson",
        "Anthony W Case",
        "Samuel T. Badman"
      ],
      "abstract": "Bayesian and Deterministic Neural Network approaches to Faraday Cup calibration and plasma parameter estimation Lidiya Ahmed, Michael L Stevens, Kristoff Paulson, Anthony W Case, Samuel T. Badman Solar and Stellar Astrophysics (astro-ph.SR) We describe a novel scheme for analyzing particle detector measurements when a well-calibrated, similarly instrumented spacecraft is present in a similar orbit. To prepare ground truth from measurements provided by a reference spacecraft, the method uses dynamic time warping (DTW)--a technique often used for pattern-matching in time series data. An artificial neural network (ANN) is created and trained to reproduce this ground truth from measurements at the target spacecraft. Unlike previous approaches, this procedure is insensitive to calibration errors in the target data stream, as the neural network may be trained from poorly calibrated particle spectra or even directly from low-level data in engineering units. We demonstrate a proof-of-concept by training an ANN to estimate solar wind proton densities, temperatures, and speeds from the DSCOVR PlasMag Faraday Cup, using the \\textit{Wind} Solar Wind Experiment as a reference. We present both deterministic and Bayesian neural network approaches. Applications for Parker Solar Probe, HelioSwarm, and other missions are discussed.",
      "pdf_url": "https://arxiv.org/pdf/2510.20946.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20988",
      "title": "Relation between sunspots and solar EUV irradiance changes during the Gleissberg cycle",
      "authors": [
        "Kalevi Mursula"
      ],
      "abstract": "Relation between sunspots and solar EUV irradiance changes during the Gleissberg cycle Kalevi Mursula Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Sunspots are the standard measure of solar magnetic activity, which are also used to estimate solar spectral irradiance over centennial time scales. However, because of the lack of homogeneous, century-long spectral measurements, the long-term relation of sunspots and spectral irradiance has not been independently validated. Here we aim to study the relation between sunspots and solar extreme ultra-violet (EUV) irradiance during the last 130 years, over the latest Gleissberg cycle, also called the Modern Maximum, when sunspot cycle heights varied by a factor of 2.5. We calculate the daily variation of the geomagnetic declination at six reliable, long-running stations, whose amplitude (or range) can be used as a centennial proxy of solar EUV irradiance. We also compare this geomagnetic proxy to the solar MgII index of EUV irradiance over the 40-year interval of overlap. We find that sunspot activity dominated over EUV irradiance when cycle heights increased in the early 20th century during the growth and maximum of the Modern Maximum, but EUV irradiance dominated over sunspots during the decay of the MM, when cycle heights decreased in the late 1900s. Our results suggest that the spot-facula ratio varies during Gleissberg cycle -type large oscillations of solar/stellar activity. This modifies the estimated stellar evolution of the relation between brightness and chromospheric activity of the Sun and Sun-like stars.",
      "pdf_url": "https://arxiv.org/pdf/2510.20988.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21013",
      "title": "Parametrisation of the wave-zonal flow interactions taking into account the full Coriolis acceleration. The necessity of going beyond the traditional approximation in the sub-inertial regime and in weakly stratified regions",
      "authors": [
        "Stéphane Mathis"
      ],
      "abstract": "Parametrisation of the wave-zonal flow interactions taking into account the full Coriolis acceleration. The necessity of going beyond the traditional approximation in the sub-inertial regime and in weakly stratified regions Stéphane Mathis 14 pages, 7 figures, recommended for publication in Astronomy & Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Atmospheric and Oceanic Physics (physics.ao-ph) From the Earth's atmosphere and oceans to stellar radiation zones, inertia-gravity waves, which are called gravito-inertial waves (hereafter GIWs) in Astrophysics, are transporting momentum and mixing matter when they are damped through heat and viscous diffusions and when they break. Their short-time scale dynamics is governed by the buoyancy force and the Coriolis acceleration. Because of the transport they trigger, they modify the long-term evolution of the large-scale planetary atmospheric (oceanic) circulation and of the structure and rotation of stars. In many state-of-the-art models, the so-called Traditional Approximation of Rotation (hereafter denoted TAR), where the local projection of the rotation vector along the horizontal direction is neglected, is assumed. We aim to identify the applicability regime of this approximation and to propose a non-traditional parametrisation of wave - zonal flow interactions, in which the full Coriolis acceleration is taken into account. We build a prototype local non-traditional Cartesian model in which we take into account the full Coriolis acceleration, buoyancy, and heat and viscous diffusions. On the one hand, the TAR is strongly underestimating GIWs damping in the sub-inertial regime. In this regime a non-traditional modelling must be adopted to predict the correct altitude where momentum is deposited, which is closer to the excitation region of waves than the one predicted using the TAR. On the other hand, non-traditional modellings of GIWs convective and shear-induced breakings are proposed. Taking into account the full Coriolis acceleration leads to a stronger inhibition of the efficiency of the convective and shear-induced overturnings and to a weaker transport than those predicted when assuming the TAR. Finally, a fully non-traditional parametrisation of GIWs - mean zonal flows interaction is derived.",
      "pdf_url": "https://arxiv.org/pdf/2510.21013.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21042",
      "title": "Uncovering Solar Wind Phenomena with iSAX, HDBSCAN, Human-in-the-loop and PSP Observations",
      "authors": [
        "Valmir P Moraes Filho",
        "Daniela Martin",
        "Jasmine R. Kobayashi",
        "Connor O'Brien",
        "Jinsu Hong",
        "Evangelia Samara",
        "Joseph Gallego"
      ],
      "abstract": "Uncovering Solar Wind Phenomena with iSAX, HDBSCAN, Human-in-the-loop and PSP Observations Valmir P Moraes Filho, Daniela Martin, Jasmine R. Kobayashi, Connor O'Brien, Jinsu Hong, Evangelia Samara, Joseph Gallego Solar and Stellar Astrophysics (astro-ph.SR) The solar wind is a dynamic plasma outflow that shapes heliospheric conditions and drives space weather. Identifying its large-scale phenomena is crucial, yet the increasing volume of high-cadence Parker Solar Probe (PSP) observations poses challenges for scalable, interpretable analysis. We present a pipeline combining symbolic compression, density-based clustering, and human-in-the-loop validation. Applied to 2018-2024 PSP data, it efficiently processes over 150 GB of magnetic and plasma measurements, recovering known structures, detecting uncatalogued CMEs and transient events, and demonstrating robustness across multiple time scales. A key outcome is the systematic use of the magnetic deflection angle ($\\theta_B$) as a unifying metric across solar wind phenomena. This framework provides a scalable, interpretable, expert-validated approach to solar wind analysis, producing expanded event catalogs and supporting improved space weather forecasting. The code and configuration files used in this study are publicly available to support reproducibility.",
      "pdf_url": "https://arxiv.org/pdf/2510.21042.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21070",
      "title": "Photospheric Chemical Depletion in Post-AGB/Post-RGB Binaries with Second-Generation Protoplanetary Discs",
      "authors": [
        "Maksym Mohorian"
      ],
      "abstract": "Photospheric Chemical Depletion in Post-AGB/Post-RGB Binaries with Second-Generation Protoplanetary Discs Maksym Mohorian (School of Mathematical and Physical Sciences, Faculty of Science and Engineering, Macquarie University, Australia) Solar and Stellar Astrophysics (astro-ph.SR) The origin and evolution of chemical elements in the Universe are governed not only by nucleosynthesis processes in stars, but also by mechanisms that alter observed photospheric compositions. Among these, chemical depletion (underabundance of refractory elements in stellar photospheres) presents a key puzzle in understanding the full chemical lifecycle. This PhD thesis explores the role of disc-binary interaction in shaping chemical abundances in evolved low- and intermediate-mass binary stars, focusing on systems that have undergone the red giant branch (RGB) or asymptotic giant branch (AGB) phase. In this thesis, we investigate binary systems containing post-asymptotic giant branch (post-AGB, $L_{\\rm post-AGB}\\,\\gtrsim\\,2\\,500\\,L_\\odot$) and post-red giant branch (post-RGB, $L_{\\rm post-RGB}\\,\\lesssim\\,2\\,500\\,L_\\odot$) binaries as key tracers of AGB/RGB nucleosynthesis. Although the effects of these interactions remain poorly understood, they are known to drive photospheric chemical depletion. This depletion closely resembles that observed in young planet-hosting stars with protoplanetary discs. Combined with other structural and dynamical similarities in disc properties, this suggests a potential link to second-generation planet formation in post-AGB/RGB binaries with circumbinary discs. Although direct imaging of such planets is not feasible, studying signatures such as photospheric depletion provides an indirect means of exploring their possible presence within these systems.",
      "pdf_url": "https://arxiv.org/pdf/2510.21070.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21076",
      "title": "Backmapping of the High- and Low-latitude Solar Wind under Multiple Heliospheric and Coronal Magnetic Field Configurations",
      "authors": [
        "Xinyi Ma",
        "Liping Yang",
        "Xueshang Feng",
        "Hui Tian",
        "Honghong Wu",
        "Fang Shen",
        "Wangning Zhang",
        "Mengxuan Ma",
        "Xiao Zhang",
        "Ziwei Wang"
      ],
      "abstract": "Backmapping of the High- and Low-latitude Solar Wind under Multiple Heliospheric and Coronal Magnetic Field Configurations Xinyi Ma, Liping Yang, Xueshang Feng, Hui Tian, Honghong Wu, Fang Shen, Wangning Zhang, Mengxuan Ma, Xiao Zhang, Ziwei Wang Solar and Stellar Astrophysics (astro-ph.SR) Solar wind backmapping is a critical technique for analyzing the origin of the solar wind and space weather events by correlating in situ measurements with solar remote-sensing observations. This technique typically traces magnetic field lines using a heliospheric magnetic field (HMF) model coupled with a coronal magnetic field (CMF). However, the impact of different HMF and CMF configurations on backmapping uncentainty-particularly regarding high-latitude solar wind-remains inadequately quantified. This study comprehensively evaluates solar wind backmapping by combining two HMF models (Parker spiral, Fisk-type) with three CMF models (Potential Field Source Surface (PFSS), Potential Field Current Sheet (PFCS), Current Sheet Source Surface (CSSS)). Our analysis primarily uses in situ measurements from Ulysses and remote-sensing data from STEREO-A. Key findings are that: (1) while both Fisk and Parker HMF models show comparable consistency with measured magnetic field strength and polarity, they produce certain longitudinal displacements in their back-mapped footpoints on the source surface (2.5$R_{\\odot}$); (2) For CMF models (PFSS, PFCS, CSSS), predicted photospheric footpoints exhibit minor variations for high/mid-latitude solar wind but some divergences for ecliptic/low-latitude wind; (3) All three CMF models link high/mid-latitude wind to active regions or coronal holes, yet associate a fraction of ecliptic/low-latitude wind with quiet-Sun regions; (4) Ecliptic/low-latitude sources show significantly stronger dependence on the PFSS source surface height compared to high-latitude wind. These results demonstrate that simpler models (PFSS + Parker) appear reasonably adequate for polar coronal hole wind studies, while low-latitude/ecliptic solar wind exhibits the heightened sensitivity to model choices.",
      "pdf_url": "https://arxiv.org/pdf/2510.21076.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21385",
      "title": "Gaia and massive stars in 2025",
      "authors": [
        "J. Maíz Apellániz"
      ],
      "abstract": "Invited talk at IAU Symposium 402 Solar and Stellar Astrophysics (astro-ph.SR) I present some of the highlights of the Gaia mission on massive stars and discuss what the fourth data release (DR4) will bring in late 2026. In the first part of the contribution I describe the different types of Gaia products available now and for DR4 and their caveats. In the second part I present the most significant results on massive stars regarding parameter determination, binaries, photometric variability, stellar groups, and the sample and spatial distribution.",
      "pdf_url": "https://arxiv.org/pdf/2510.21385.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21456",
      "title": "Surface activity of a Rossby sequence of cool Hyades stars",
      "authors": [
        "K. G. Strassmeier",
        "I. Ilyin",
        "M. Steffen",
        "S. A. Barnes"
      ],
      "abstract": "Surface activity of a Rossby sequence of cool Hyades stars K. G. Strassmeier, I. Ilyin, M. Steffen, S. A. Barnes 19 pages, 9 figures, to be published in A&A Solar and Stellar Astrophysics (astro-ph.SR) Aims. The Hyades cluster is key for the study of rotational, activity, and chemical evolution of solar-like low-mass stars. Here we present quantitative surface-activity information for a sequence of 21 Hyades dwarf stars. Conclusions. We conclude that the Rossby-number dependencies of the surface activity tracers A(Li), R(IRT), and B on our Hyades dwarf sequence primarily originate from convective motions, expressed by its turnover time, and only to a smaller and sometimes inverse extent from surface rotation and its related extra mixing.",
      "pdf_url": "https://arxiv.org/pdf/2510.21456.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21487",
      "title": "Magnetic Field Configuration of a Quiescent Prominence Revealed by Large-amplitude Longitudinal Oscillations in End-view Observations",
      "authors": [
        "Jun Dai",
        "Ayumi Asai",
        "Dechao Song",
        "Ye Qiu",
        "Zhe Xu"
      ],
      "abstract": "Magnetic Field Configuration of a Quiescent Prominence Revealed by Large-amplitude Longitudinal Oscillations in End-view Observations Jun Dai, Ayumi Asai, Dechao Song, Ye Qiu, Zhe Xu Solar and Stellar Astrophysics (astro-ph.SR) Prominence seismology, applied to the large-amplitude longitudinal oscillation, is used to indirectly diagnose the geometry and strength of the magnetic fields inside the prominence. In this paper, combining imaging and spectroscopic data, the magnetic field configuration of a quiescent prominence is revealed by large-amplitude longitudinal oscillations observed in end view on 2023 December 4. Particularly, the prominence oscillation involved blueshift velocities in Dopplergrams and horizontal motions in extreme-ultraviolet (EUV) images. Originally, the prominence oscillation was triggered by the collision and heating of an adjoining hot structure associated with two coronal jets. The oscillation involved two groups of signals with similar oscillatory parameters, a three-dimensional (3D) initial amplitude of 40 Mm and a 3D velocity amplitude of 48 km/s, both lasting for 4 cycles with a period of 77 minutes, with a phase difference of pi/4. While the angle between 3D velocities and the prominence axis ranges from 10 to 30. Two methods, utilizing time-distance diagrams and velocity fields, are employed to calculate the curvature radius of magnetic dips supporting the prominence materials. Both methods yield similar value ranges and trends from the bottom to the top of magnetic dips, with the curvature radius increasing from 90 Mm to 220 Mm, then decreasing to 10 Mm, with transverse magnetic field strength 25 Gauss. From this, the realistic 3D geometry of the prominence magnetic dips is determined to be sinusoidal. To the best of our knowledge, we present the first accurate calculation of the 3D curvature radius and geometry of the prominence magnetic dips based on longitudinal oscillatory motions.",
      "pdf_url": "https://arxiv.org/pdf/2510.21487.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21626",
      "title": "Peakbagging the K2 KEYSTONE sample with PBjam: characterising the individual mode frequencies in solar-like oscillators",
      "authors": [
        "George T. Hookway",
        "Martin B. Nielsen",
        "Guy R. Davies",
        "Mikkel N. Lund",
        "Rafael A. García",
        "Savita Mathur",
        "Victor See",
        "Amalie Stokholm"
      ],
      "abstract": "Peakbagging the K2 KEYSTONE sample with PBjam: characterising the individual mode frequencies in solar-like oscillators George T. Hookway, Martin B. Nielsen, Guy R. Davies, Mikkel N. Lund, Rafael A. García, Savita Mathur, Victor See, Amalie Stokholm 13 pages, 13 figures, 3 tables. Accepted to MNRAS. Accepted 2025 October 21. Received 2025 September 19; in original form 2025 June 25 Solar and Stellar Astrophysics (astro-ph.SR) The pattern of individual mode frequencies in solar-like oscillators provides valuable insight into their properties and interior structures. The identification and characterisation of these modes requires high signal-to-noise and frequency resolution. The KEYSTONE project unlocks the asteroseismic potential of the K2 mission by providing individually reduced, high-quality time series data, global asteroseismic parameters, and spectroscopic analysis for 173 solar-like oscillators. In this work, we build on the KEYSTONE project and present the first analysis of the pattern of individual modes in the oscillation spectra for the K2 KEYSTONE stars. We perform a robust identification and characterisation of the modes through peakbagging methods in the open-source analysis tool PBjam. We present over 6000 mode frequencies, widths, and heights for 168 stars in the sample, covering the HR diagram from FGK dwarfs to sub-giants and the lower red giant branch, providing a significant increase in the number of individual mode frequency detections for main sequence and sub-giant oscillators. This study also presents sample-wide trends of oscillation patterns as a function of the fundamental stellar properties, and improves the precision of the global asteroseismic parameters. These measurements are part of the legacy of the K2 mission, and can be used to perform detailed modelling to improve the precision of fundamental properties of these stars. The results of this analysis provides evidence for the validity of using PBjam to identify and characterise the modes resulting from the observations of the future PLATO mission.",
      "pdf_url": "https://arxiv.org/pdf/2510.21626.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21640",
      "title": "Predicted observational effects of rapid rotation for Be stars",
      "authors": [
        "Rina G. Rast",
        "Carol E. Jones",
        "Mark W. Suffak",
        "Jonathan Labadie-Bartz",
        "Asif ud Doula",
        "Alex C. Carciofi",
        "Peter Quigley",
        "Coralie Neiner",
        "Jeremy J. Drake"
      ],
      "abstract": "Predicted observational effects of rapid rotation for Be stars Rina G. Rast, Carol E. Jones, Mark W. Suffak, Jonathan Labadie-Bartz, Asif ud Doula, Alex C. Carciofi, Peter Quigley, Coralie Neiner, Jeremy J. Drake 31 pages, 13 figures; accepted for publication in Astrophysics and Space Science Solar and Stellar Astrophysics (astro-ph.SR) We conduct a systematic study on the effects of rapid rotation on predicted Be star observables. We use the three-dimensional Monte Carlo radiative transfer code, \\textsc{hdust}, to model a comprehensive range of Be star subtypes at varying rotation rates. Using these models, we predict $V$ magnitude and photometric color, H$\\alpha$ line profiles, and polarization at UV wavelengths as well as in the $V$-band for Be stars from B0 to B8. For each spectral subtype, we investigate the effects of disk density on the produced observables. We find that reddening and brightening effects of gravity darkening may cause rapidly-rotating stars to appear more evolved than they truly are. Rotational effects on the H$\\alpha$ line profile shape may reduce line intensity for Be stars viewed at low inclinations and increase line intensity for those viewed at high inclinations. Additionally, rapid rotation can significantly impact the measured equivalent width of the line produced by a star with a moderate to high density disk, especially at high inclinations. When the star-disk system is viewed near edge-on, gravity darkening can result in stronger H$\\alpha$ emission than would otherwise be expected for a disk of a given density. We also find that the competing effects of rapid rotation and H\\,\\textsc{i} opacity cause the slope of the polarized continuum (the polarization color) to be very sensitive to changes in the stellar rotation rate. This quantity offers a strong diagnostic for the rotation rate of Be stars.",
      "pdf_url": "https://arxiv.org/pdf/2510.21640.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21465",
      "title": "EBOP MAVEN: A machine learning model to estimate the input parameters for analytic fitting of detached eclipsing binary light curves",
      "authors": [
        "Stephen Overall",
        "John Southworth"
      ],
      "abstract": "EBOP MAVEN: A machine learning model to estimate the input parameters for analytic fitting of detached eclipsing binary light curves Stephen Overall, John Southworth This is a pre-copyedited, author-produced PDF of an article accepted for publication in RAS Techniques & Instruments (RASTI) following peer review. 20 pages, 10 figures Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Detached eclipsing binary stars (dEBs) are a key source of data on fundamental stellar parameters. Within the light curve databases of survey missions such as Kepler and TESS are a wealth of new systems awaiting characterisation. We aim to improve the scalability of efforts to process these data by developing a Convolutional Neural Network (CNN) machine learning model to assist in the automation of their analysis. From a phase-folded and binned dEB light curve the model predicts system parameters relating to stellar fractional radii, orbital inclination and eccentricity, and the stellar brightness ratio, for use as input values in subsequent formal analysis with the established JKTEBOP analytic code. We find the model able to predict these parameters for a previously unseen test dataset of 20000 synthetic dEB systems with a mean error of 14.1% when compared with the label values, improving to 8.6% against a subset representative of real systems. When tested with the TESS light curves of a set of real well-characterised systems, the model's predictions yield a mean error of $8.7\\pm0.7\\%$ when compared with label values derived from existing published analyses. Subsequent fitting of the TESS light curves with the JKTEBOP analytic code while using the model predictions as input values finds 27 of the 28 systems achieving a good fit. On the strength of these results, we plan to build a new characterisation pipeline based on the machine learning model and JKTEBOP code with the intention of producing a target catalogue of dEB systems for potential observation with the forthcoming PLATO mission.",
      "pdf_url": "https://arxiv.org/pdf/2510.21465.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21703",
      "title": "An Hα Transit of HD 189733b to Assess Stellar Activity Across the Transit Chord Close to JWST Observations",
      "authors": [
        "Kingsley E. Ehrich",
        "Jason A. Dittmann",
        "Samuel P. Halverson",
        "Alejandro Camazón-Pinilla"
      ],
      "abstract": "An Hα Transit of HD 189733b to Assess Stellar Activity Across the Transit Chord Close to JWST Observations Kingsley E. Ehrich, Jason A. Dittmann, Samuel P. Halverson, Alejandro Camazón-Pinilla 12 pages, 8 figures, accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Transmission spectroscopy allows us to detect molecules in planetary atmospheres, but is subject to contamination from inhomogeneities on the stellar surface. Quantifying the extent of this contamination is essential for accurate measurements of atmospheric composition, as stellar activity can manifest as false atmospheric signals in planetary transmission spectra. We present a study of hot Jupiter HD 189733b, which has over 50 hours of JWST observations scheduled or taken, to measure the activity level of the host star at the current epoch. We utilize high-resolution spectra of the H${\\alpha}$ line from the MEGARA spectrograph on the 10-m GTC to examine the activity level of HD 189733 during a transit. We measure H${\\alpha}$ becoming shallower mid-transit by an H${\\alpha}$ index of ${\\delta}$ = 0.00156 ${\\pm}$ 0.00026, which suggests that HD 189733b crosses an active region as it transits. We posit this deviation is likely caused by a spot along the transit chord with an approximate radius of $R_{spot}$ = 3.47 ${\\pm}$ 0.30R${\\oplus}$ becoming occulted during transit. Including an approximation for unocculted spots, we estimate that this spot could result in transit depth variations of ${\\sim}$17 ppm at the 4.3 micron CO2 feature. Since this is comparable to JWST NIRCam Grism mode's noise floor of ${\\sim}$20 ppm, it could bias atmospheric studies by altering the inferred depths of the planet's features. Thus, we suggest ground-based high-resolution monitoring of activity indicator species concurrently taken with JWST data when feasible to disentangle stellar activity signals from planetary atmospheric signals during transit.",
      "pdf_url": "https://arxiv.org/pdf/2510.21703.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2403.19478",
      "title": "UVIT/AstroSat observation of TW Hya",
      "authors": [
        "Prasanta K. Nayak",
        "Mayank Narang",
        "P. Manoj",
        "D. K. Ojha",
        "Blesson Mathew",
        "T. Baug",
        "S. Chandra",
        "S. Vig",
        "G. Maheswar",
        "U. S. Kamath"
      ],
      "abstract": "UVIT/AstroSat observation of TW Hya Prasanta K. Nayak, Mayank Narang, P. Manoj, D. K. Ojha, Blesson Mathew, T. Baug, S. Chandra, S. Vig, G. Maheswar, U. S. Kamath The paper has not been published yet and a major revision is required Solar and Stellar Astrophysics (astro-ph.SR) The paper demonstrates the spectroscopic and photometric capabilities of the Ultra-Violet Imaging Telescope (UVIT) to study T-Tauri stars (TTSs). We present the first UVIT/Far-UV spectrum of a TTS, TW Hya. Based on C IV line luminosity, we estimated accretion luminosity (0.1 $L_\\odot$) and mass accretion rate (2.2 $\\times$ $10^{-8} M_\\odot /yr$) of TW Hya, and compared these values with the accretion luminosity (0.03 $L_\\odot$) and mass accretion rate (0.6 $\\times$ $10^{-8} M_\\odot /yr$) derived from spectral energy distribution (SED). From the SED, we derive best-fitted parameters for TW Hya: $T_{eff}$ = 3900$\\pm$50 K, radius = 1.2$\\pm$0.03 $R_\\odot$, $\\mathrm{log}\\, g = 4.0$ and equivalent black-body temperatures corresponding to accretion luminosity as 14100$\\pm$25 K. The parameters of TW Hya derived from UVIT observations were found to be matched well with the literature. Comparison with IUE spectra also suggests that UVIT can be used to study the spectroscopic variability of young stars. This study proposes leveraging the FUV spectroscopic capabilities of UVIT to contribute to the advancement of upcoming UV spectroscopic missions, including the Indian Spectroscopic Imaging Space Telescope (INSIST).",
      "pdf_url": "https://arxiv.org/pdf/2403.19478.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.00936",
      "title": "An on-the-fly line-driven-wind iterative mass-loss estimator (LIME) for hot, massive stars of arbitrary chemical compositions",
      "authors": [
        "J.O. Sundqvist",
        "D. Debnath",
        "F. Backs",
        "O. Verhamme",
        "N. Moens",
        "L. Delbroek",
        "D. Dickson",
        "P. Schillemans",
        "C. Van der Sijpt",
        "M. Dirickx"
      ],
      "abstract": "An on-the-fly line-driven-wind iterative mass-loss estimator (LIME) for hot, massive stars of arbitrary chemical compositions J.O. Sundqvist, D. Debnath, F. Backs, O. Verhamme, N. Moens, L. Delbroek, D. Dickson, P. Schillemans, C. Van der Sijpt, M. Dirickx v2: 6 pages, 7 figures, 1 Appendix, accepted by A&A Solar and Stellar Astrophysics (astro-ph.SR) Mass-loss rates from hot, massive stars are important for a range of astrophysical applications. We present \\href{this https URL}{LIME}, a fast, efficient, and easy-to-use real-time mass-loss calculator for line-driven winds from hot, massive stars with given stellar parameters and arbitrary chemical compositions. The tool is publicly available online. We compute the line force on-the-fly from excitation and ionization balance calculations using a large atomic data base containing more than four million spectral lines. We then derive mass-loss rates from line-driven wind theory, including effects of a finite stellar disk and gas sound speed. For a given set of stellar parameters and chemical composition, we obtain predictions for mass-loss rates and for the three line-force parameters at the wind critical point. A comparison of our predicted mass-loss rates with a large sample of recent, state-of-the-art, homogeneously derived empirical mass-loss rates obtained from the XshootU collaboration project demonstrates that the simple calculator presented here performs on average as well as, or even better than, other available mass-loss recipes based on fits to restricted model grids computed from more sophisticated but less flexible methods. In addition to its speed and simplicity, a strength of our mass-loss calculator is that it avoids uncertainties related to applying fit formulae to underlying model grids calculated for more restricted parameter ranges. In particular, individual chemical abundances can be easily modified, and their effects on predicted mass-loss rates can be readily explored. This enables direct applications also to stars that are significantly chemically modified at the surface.",
      "pdf_url": "https://arxiv.org/pdf/2504.00936.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.01156",
      "title": "Orbital and Pulsation Analysis of 42 Heartbeat Stars Discovered in TESS Data",
      "authors": [
        "Min-Yu Li",
        "Sheng-Bang Qian",
        "Ai-Ying Zhou",
        "Li-Ying Zhu",
        "Wen-Ping Liao",
        "Lin-Feng Chang",
        "Xiang-Dong Shi",
        "Fu-Xing Li",
        "Qi-Bin Sun",
        "Ping Li"
      ],
      "abstract": "Orbital and Pulsation Analysis of 42 Heartbeat Stars Discovered in TESS Data Min-Yu Li, Sheng-Bang Qian, Ai-Ying Zhou, Li-Ying Zhu, Wen-Ping Liao, Lin-Feng Chang, Xiang-Dong Shi, Fu-Xing Li, Qi-Bin Sun, Ping Li The Astrophysical Journal, Volume 993, Number 1, 2025 Solar and Stellar Astrophysics (astro-ph.SR) Heartbeat stars (HBSs) are ideal laboratories for studying the formation and evolution of binary stars in eccentric orbits and their mutual tidal interactions. We present 42 new HBSs discovered based on TESS-SPOC and QLP data. Their physical parameters have been obtained through modeling with appropriate models. Subsequently, Tidally excited oscillations (TEOs) are detected in ten systems, and their pulsation phases and modes are identified. Most pulsation phases can be explained by the dominant being spherical harmonic degree $l=2$ and azimuthal order $m=0$ or $\\pm2$. For TIC 156846634, the harmonic with large deviation ($>3\\sigma$) from the expected adiabatic phase can be expected to be a traveling wave or significantly nonadiabatic. The harmonic numbers $n$ = 16 in TIC 184413651 may not be considered as a TEO candidate due to its large deviation ($>2\\sigma$) from the adiabatic expectation. Moreover, TIC 92828790 shows no TEOs but exhibits a significant $\\gamma$\\,Dor-type pulsation. The eccentricity-period ($e-P$) relation also shows a positive correlation between eccentricity and period, as well as the existence of orbital circularization. The Hertzsprung-Russell diagram shows that TESS HBSs have higher temperatures and greater luminosities than Kepler HBSs, possibly due to selection effects. This significantly enhances the detectability of massive HBSs and those containing TEOs.",
      "pdf_url": "https://arxiv.org/pdf/2508.01156.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.13504",
      "title": "SolarZip: An Efficient and Adaptive Compression Framework for Solar EUV Imaging Data",
      "authors": [
        "Zedong Liu",
        "Song Tan",
        "Alexander Warmuth",
        "Frédéric Schuller",
        "Yun Hong",
        "Wenjing Huang",
        "Yida Gu",
        "Bojing Zhu",
        "Guangming Tan",
        "Dingwen Tao"
      ],
      "abstract": "SolarZip: An Efficient and Adaptive Compression Framework for Solar EUV Imaging Data Zedong Liu, Song Tan, Alexander Warmuth, Frédéric Schuller, Yun Hong, Wenjing Huang, Yida Gu, Bojing Zhu, Guangming Tan, Dingwen Tao Astronomy & Astrophysics, 702, A160 (2025) Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Context: With the advancement of solar physics research, next-generation solar space missions and ground-based telescopes face significant challenges in efficiently transmitting and/or storing large-scale observational data. Aims: We develop an efficient compression and evaluation framework for solar EUV data, specifically optimized for Solar Orbiter Extreme Ultraviolet Imager (EUI) data, significantly reducing data volume while preserving scientific usability. Methods: We systematically evaluated four error-bounded lossy compressors across two EUI datasets. However, the existing methods cannot perfectly handle the EUI datasets (with continuously changing distance and significant resolution differences). Motivated by this, we develop an adaptive hybrid compression strategy with optimized interpolation predictors. Moreover, we designed a two-stage evaluation framework integrating distortion analysis with downstream scientific workflows, ensuring that observational analysis is not affected at high compression ratios. Results: Our framework SolarZip achieved up to 800x reduction for Full Sun Imager (FSI) data and 500x for High Resolution Imager (HRI$_{\\text{EUV}}$) data. It significantly outperformed both traditional and advanced algorithms, achieving 3-50x higher compression ratios than traditional algorithms, surpassing the second-best algorithm by up to 30%. Simulation experiments verified that SolarZip can reduce data transmission time by up to 270x while ensuring the preservation of scientific usability. Conclusions: The SolarZip framework significantly enhances solar observational data compression efficiency while preserving scientific usability by dynamically selecting optimal compression methods based on observational scenarios and user requirements. This provides a promising data management solution for deep space missions like Solar Orbiter.",
      "pdf_url": "https://arxiv.org/pdf/2504.13504.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20870",
      "title": "pyROX: Rapid Opacity X-sections",
      "authors": [
        "Sam de Regt",
        "Siddharth Gandhi",
        "Louis Siebenaler",
        "Darío González Picos"
      ],
      "abstract": "pyROX: Rapid Opacity X-sections Sam de Regt, Siddharth Gandhi, Louis Siebenaler, Darío González Picos 4 pages. Submitted to the Journal of Open Source Software (JOSS) Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) In recent years, significant advances have been made in exoplanet and brown dwarf observations. By using state-of-the-art models, astronomers can determine properties of their atmospheres, such as temperatures, the presence of clouds, or the chemical abundances of molecules and atoms. Accurate and up-to-date opacities are crucial to avoid inconclusive or biased results, but it can be challenging to compute opacity cross-sections from the line lists provided by various online databases. We introduce pyROX, an easy-to-use Python package to calculate molecular and atomic cross-sections. Since pyROX works on CPUs, it can compute a small line list on a regular workstation, but it is also easily parallelised on a cluster for larger line lists. In addition to line opacities, pyROX also supports calculations of collision-induced absorption. Tutorials are provided in the online documentation which explain the configuration parameters and different functionalities of pyROX.",
      "pdf_url": "https://arxiv.org/pdf/2510.20870.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21534",
      "title": "TES Proton Irradiation Result Analysis for Future Space Applications",
      "authors": [
        "A. Besnard , V. Sauvage , S. L. Stever , B. Maffei , P. dal Bo , T. Lari , M. de Lucia , A. Tartari , G. Signorelli , J. Hubmayr , G. Jaehnig IAS, Universite Paris Saclay, CNRS, Institut d Astrophysique Spatiale, Orsay, France, INFN, Pisa University, Istituto Nazionale di Fisica Nucleare, Italia, NIST Boulder Laboratory, National Institute of Standards and Technology, Colorado, United States)"
      ],
      "abstract": "TES Proton Irradiation Result Analysis for Future Space Applications A. Besnard (1), V. Sauvage (1), S. L. Stever (1), B. Maffei (1), P. dal Bo (2), T. Lari (2), M. de Lucia (2), A. Tartari (2), G. Signorelli (2), J. Hubmayr (3), G. Jaehnig (3) (for the LiteBIRD Collaboration, (1) IAS, Universite Paris Saclay, CNRS, Institut d Astrophysique Spatiale, Orsay, France, (2) INFN, Pisa University, Istituto Nazionale di Fisica Nucleare, Italia, (3) NIST Boulder Laboratory, National Institute of Standards and Technology, Colorado, United States) Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) As observed on the signal of the Planck-HFI highly sensitive bolometers, the effect of cosmic rays on detectors is a major concern for future similar space missions. Their instruments will have a larger detection surface, increased sensitivity, and more stringent requirements on the suppression of systematic effects. To study the impact of cosmic rays on detector prototypes in operational conditions, IAS has designed a state-of-the-art cryogenic system to irradiate particles by coupling this facility to particle accelerators. An irradiation campaign has been carried out on LiteBIRD-HFT TES prototypes to study their response to particle hits. In this article, we present the results and the analysis of this first test campaign.",
      "pdf_url": "https://arxiv.org/pdf/2510.21534.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21690",
      "title": "Comparing the data reduction pipelines of FRIPON, DFN, WMPL, and AMOS: Geminids Case Study",
      "authors": [
        "P.M. Shober",
        "J. Vaubaillon",
        "S. Anghel",
        "H.A.R. Devillepoix",
        "F. Hlobik",
        "P. Matlovič",
        "J. Tóth",
        "D. Vida",
        "E.K. Sansom",
        "T. Jansen-Sturgeon",
        "F. Colas",
        "A. Malgoyre",
        "L. Kornoš",
        "F. Ďuriš",
        "V. Pazderová",
        "S. Bouley",
        "B. Zanda",
        "P. Vernazza"
      ],
      "abstract": "Comparing the data reduction pipelines of FRIPON, DFN, WMPL, and AMOS: Geminids Case Study P.M. Shober, J. Vaubaillon, S. Anghel, H.A.R. Devillepoix, F. Hlobik, P. Matlovič, J. Tóth, D. Vida, E.K. Sansom, T. Jansen-Sturgeon, F. Colas, A. Malgoyre, L. Kornoš, F. Ďuriš, V. Pazderová, S. Bouley, B. Zanda, P. Vernazza Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Methods. We processed a dataset of 584 Geminid fireballs observed by FRIPON between 2016 and 2023. The single-station astrometric data is converted into the Global Fireball Exchange (GFE) standard format for uniform processing. We assess variations in trajectory, velocity, radiant, and orbital element calculations across the pipelines and compare them to previously published Geminid measurements. Results. The radiant and velocity solutions provided by the four data reduction pipelines are all within the range of previously published values. However, there are some nuances. Particularly, the radiants estimated by WMPL, DFN, and AMOS are nearly identical. Whereas FRIPON reports a systematic shift in right ascension (-0.3 degrees), caused by improper handling of the precession. Additionally, the FRIPON data reduction pipeline also tends to overestimate the initial velocity (+0.3 km s-1) due to the deceleration model used as the velocity solver. The FRIPON velocity method relies on having a well-constrained deceleration profile; however, for the Geminids, many are low-deceleration events, leading to an overestimation of the initial velocity. On the other end of the spectrum, the DFN tends to predict lower velocities, particularly for poorly observed events. However, this velocity shift vanishes for the DFN when we only consider Geminids with at least three observations or more. The primary difference identified in the analysis concerns the velocity uncertainties. Despite all four pipelines achieving similar residuals between their trajectories and observations, their velocity uncertainties vary systematically, with WMPL outputting the smallest values, followed by AMOS, FRIPON, and DFN.",
      "pdf_url": "https://arxiv.org/pdf/2510.21690.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.22446",
      "title": "Stellar intensity interferometry in the photon-counting regime",
      "authors": [
        "William Guerin",
        "Mathilde Hugbart",
        "Sarah Tolila",
        "Nolan Matthews",
        "Olivier Lai",
        "Jean-Pierre Rivet",
        "G. Labeyrie",
        "Robin Kaiser"
      ],
      "abstract": "Stellar intensity interferometry in the photon-counting regime William Guerin, Mathilde Hugbart, Sarah Tolila, Nolan Matthews, Olivier Lai, Jean-Pierre Rivet, G. Labeyrie, Robin Kaiser Comptes Rendus. Physique 26, 659-679 (2025) Instrumentation and Methods for Astrophysics (astro-ph.IM) Stellar intensity interferometry consists in measuring the correlation of the light intensity fluctuations at two telescopes observing the same star. The amplitude of the correlation is directly related to the luminosity distribution of the star, which would be unresolved by a single telescope. This technique is based on the well-known Hanbury Brown and Twiss effect. After its discovery in the 1950s, it was used in astronomy until the 1970s, and then replaced by direct (``amplitude'') interferometry, which is much more sensitive, but also much more demanding. However, in recent years, intensity interferometry has undergone a revival. In this article, we present a summary of the state-of-the-art, and we discuss in detail the signal-to-noise ratio of intensity interferometry in the framework of photon-counting detection.",
      "pdf_url": "https://arxiv.org/pdf/2503.22446.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21543",
      "title": "Irradiated Atmospheres IV: Effect of Mixing Heat Flux on Chemistry",
      "authors": [
        "Zhen-Tai Zhang",
        "Wei Zhong",
        "Wei Wang",
        "Jianheng Guo",
        "Xianyu Tan",
        "Bo Ma",
        "Ruyi Wei",
        "Cong Yu"
      ],
      "abstract": "Irradiated Atmospheres IV: Effect of Mixing Heat Flux on Chemistry Zhen-Tai Zhang, Wei Zhong, Wei Wang, Jianheng Guo, Xianyu Tan, Bo Ma, Ruyi Wei, Cong Yu 11 pages, 3 figures. APJ accepted Earth and Planetary Astrophysics (astro-ph.EP) Vertical mixing disrupts the thermochemical equilibrium and introduces additional heat flux that alters exoplanetary atmospheric temperatures. We investigate how this mixing-induced heat flux affects atmospheric chemistry. Temperature increase in the lower atmosphere by the mixing-induced heat flux alters species abundances there and modifies those in the upper atmosphere through vertical transport. In the lower atmosphere, most species follow thermodynamic equilibrium with temperature changes. In the upper layers, species mixing ratios depend on the positions of quenching levels relative to the regions exhibiting significant mixing-induced temperature variations. When the quenching level resides within such region (e.g. CO, $\\rm CH_4$, and $\\rm H_2O$ with strong mixing), the mixing ratios in the upper atmosphere are modified due to changes in the quenched ratios affected by the temperature variation in the lower atmosphere. This alters the mixing ratio of other species (e.g. NO and $\\rm CO_2$) through the chemical reaction network, whose quenching occurs in the region without much temperature change. The mixing ratios of $\\rm CH_4$, $\\rm H_2O$, and $\\rm NH_3$ decrease in the lower atmosphere with increasing mixing heat flux, similarly reducing these ratios in the upper atmosphere. Conversely, the mixing ratios of CO, $\\rm CO_2$, and NO rise in the lower atmosphere, with CO and $\\rm CO_2$ also increasing in the upper levels, although NO decreases. Weaker host star irradiation lowers the overall temperature of the planet, allowing a smaller mixing to have a similar effect. We conclude that understanding the vertical mixing heat flux is essential for accurate atmospheric chemistry modeling and retrieval.",
      "pdf_url": "https://arxiv.org/pdf/2510.21543.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21680",
      "title": "Mechanisms of Superrotation in Slowly-Rotating and Tidally-Locked Planets",
      "authors": [
        "Quentin Nicolas",
        "Geoffrey K. Vallis"
      ],
      "abstract": "Mechanisms of Superrotation in Slowly-Rotating and Tidally-Locked Planets Quentin Nicolas, Geoffrey K. Vallis Submitted to the Planetary Science Journal Earth and Planetary Astrophysics (astro-ph.EP); Atmospheric and Oceanic Physics (physics.ao-ph) Superrotation is a common feature of quickly rotating gas giants, slowly rotating planetary bodies, and tidally-locked planets. In this paper we compare and contrast the mechanisms of superrotation in slow rotators and tidally-locked planets. We cover a wide range of planetary properties, varying in particular the thermal Rossby number Ro_T (controlled by planetary size, rotation rate, and instellation) and a radiative relaxation timescale T_rad (which parameterizes atmospheric optical thickness). We use a two-level model that contains the principal mechanisms for superrotation in both regimes yet remains analytically tractable. Linearizations of the model elucidate the behavior of superrotation-inducing eddies. In tidally-locked planets a Matsuno-Gill-like structure organizes the eddy effects but of itself is insufficient to produce superrotation; baroclinicity and low-level drag are additional essential ingredients. Nonlinear integrations further explore the superrotating regimes and exhibit significant time variability even in statistical equilibrium. Not all tidally-locked regimes superrotate: subrotation arises at high T_rad (optically thick atmospheres) and weak low-level drag. On axisymmetrically-forced slow rotators, superrotation is always linked to a previously identified Rossby-Kelvin instability. Perhaps surprisingly, the instability itself is also linked to the spinup of superrotation in some tidally-locked regimes. Finally, we explore the continuous transition in the mechanisms of superrotation from axisymmetrically-forced to tidally-locked planets by applying a progressively stronger asymmetric equatorial forcing. The Matsuno-Gill pattern quickly dominates over traveling planetary Rossby-Kelvin waves in forcing superrotation, although both mechanisms can coexist. These results provide a unified view of superrotation mechanisms across a wide range of planetary bodies.",
      "pdf_url": "https://arxiv.org/pdf/2510.21680.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21328",
      "title": "Space waste: An update of the anthropogenic matter injection into Earth atmosphere",
      "authors": [
        "Leonard Schulz",
        "Karl-Heinz Glassmeier",
        "Moritz Herberhold",
        "Adam Mitchell",
        "Daniel M. Murphy",
        "John M. C. Plane",
        "Ferdinand Plaschke"
      ],
      "abstract": "Space waste: An update of the anthropogenic matter injection into Earth atmosphere Leonard Schulz, Karl-Heinz Glassmeier, Moritz Herberhold, Adam Mitchell, Daniel M. Murphy, John M. C. Plane, Ferdinand Plaschke Preprint submitted to Advances in Space Research Atmospheric and Oceanic Physics (physics.ao-ph); Earth and Planetary Astrophysics (astro-ph.EP); Geophysics (physics.geo-ph) Large satellite constellations are one of the main reasons for an increasing amount of mass being brought into low Earth orbit in recent years. After end of life, the satellites, as well as rocket stages, reenter Earth's atmosphere. This space waste burns up and thus injects a substantial amount of its matter into the mesosphere and lower thermosphere. A first comprehensive analysis of the anthropogenic injection and a comparison to the natural injection by meteoroids was presented by Schulz & Glassmeier (2021). They found significant and even the dominant injection of several metal elements regularly used in spacecraft compared to the natural injection. The first observations of space waste remnants in stratospheric aerosol particles (Murphy et al., 2023) confirmed several of these estimates, but also revealed differences and new insights. The current study presents an update to the space waste injection estimates of Schulz & Glassmeier (2021), assessing the years from 2015 to 2025 but also considering future mass influx scenarios. 43 elements are considered and thus a much more detailed comparison to the meteoric injection is possible. Comparison of estimated elemental fluxes to stratospheric aerosol data shows excellent agreement. From 2020 onward, a strong rise in space waste mass influx to the atmosphere can be seen. Future scenarios discussed by Schulz & Glassmeier (2021) may already be reached by the end of 2025. In 2024, 24 elements were dominating the meteoric injection compared to 18 in 2015. Several of them are transition metals, which are known for their catalytic activity. This indicates a substantial risk of long-term adverse effects on the atmosphere such as ozone depletion, radiative effects and changes in cloud formation, if no action is taken. Research is urgently needed into the atmospheric accumulation, chemistry, and general atmospheric effects of specific elements.",
      "pdf_url": "https://arxiv.org/pdf/2510.21328.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.11940",
      "title": "Near the Runaway: The Climate and Habitability of Teegarden's Star b",
      "authors": [
        "Ryan Boukrouche",
        "Rodrigo Caballero",
        "Neil Lewis"
      ],
      "abstract": "Near the Runaway: The Climate and Habitability of Teegarden's Star b Ryan Boukrouche, Rodrigo Caballero, Neil Lewis Ryan Boukrouche et al 2025 ApJL 993 L19 Earth and Planetary Astrophysics (astro-ph.EP) Teegarden's Star b, a nearby terrestrial world receiving an Earth-like instellation, is a prime candidate for next-generation observatories targeting temperate exoplanets in their habitable zones. We employ a suite of three-dimensional global climate model (GCM) simulations to (1) map the inner boundary of the habitable zone of Teegarden's Star b and (2) characterize its surface climate under the assumption of an Earth-analog atmosphere. Our simulations show that, with its most recently estimated instellation of 1481 Wm^-2, Teegarden's Star b remains below the runaway greenhouse threshold for both low (as=0.07, ocean-dominated) and moderate (as=0.30, land-dominated) surface albedos. However, a different estimate of 1565 Wm^-2 places it beyond the runaway threshold. The result that Teegarden's Star b is habitable under the most recent instellation measurement reinforces its status as one of the most compelling targets for future habitability and biosignature searches. Given the planet's proximity to the runaway threshold, it would benefit from a comparative study done with other models using different parameterizations.",
      "pdf_url": "https://arxiv.org/pdf/2510.11940.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}