{
  "date": "2025-11-01",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.HE",
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.IM"
  ],
  "total_papers": 123,
  "gw_related_papers": 9,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.26042",
      "title": "Gravitational-Wave Constraints on Neutron-Star Pressure Anisotropy via Universal Relations",
      "authors": [
        "Victor Guedes",
        "Siddarth Ajith",
        "Shu Yan Lau",
        "Kent Yagi"
      ],
      "abstract": "Gravitational-Wave Constraints on Neutron-Star Pressure Anisotropy via Universal Relations Victor Guedes, Siddarth Ajith, Shu Yan Lau, Kent Yagi High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Neutron stars may exhibit pressure anisotropy arising from various physical mechanisms, such as elasticity, magnetic fields, viscosity, and superfluidity. We compute the tidal deformability and the $f$-mode oscillation frequency of anisotropic neutron stars using a phenomenological quasi-local model characterized by a single dimensionless anisotropy parameter. We find that while the relation between the tidal deformability and the $f$-mode frequency depends on the degree of anisotropy, it remains largely insensitive to variations in the equation of state (the relation between radial pressure and energy density) for a fixed anisotropy parameter, similar to the isotropic case. Leveraging this anisotropy-dependent universal relation within a statistical framework, we place constraints on the anisotropy parameter using both the gravitational wave observation of GW170817 and simulated data for a GW170817-like event observed by a future network of detectors. We find that the anisotropy parameter can be constrained to order unity with current data, and the bounds remain comparable with future detector sensitivities. Importantly, these constraints are only weakly affected by uncertainties in the neutron-star equation of state.",
      "pdf_url": "https://arxiv.org/pdf/2510.26042.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.26355",
      "title": "Model-independent late-universe measurements of $H_0$ and $Ω_\\mathrm{K}$ with the PAge-improved inverse distance ladder",
      "authors": [
        "Guo-Hong Du",
        "Tian-Nuo Li",
        "Jia-Le Ling",
        "Yan-Hong Yao",
        "Jing-Fei Zhang",
        "Xin Zhang"
      ],
      "abstract": "Model-independent late-universe measurements of $H_0$ and $Ω_\\mathrm{K}$ with the PAge-improved inverse distance ladder Guo-Hong Du, Tian-Nuo Li, Jia-Le Ling, Yan-Hong Yao, Jing-Fei Zhang, Xin Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The standard $\\Lambda{\\rm CDM}$ model has encountered serious challenges and the $H_0$ tension has become more significant with increasingly precise cosmological observation. Meanwhile, inconsistencies in measurements of the curvature parameter $\\Omega_\\mathrm{K}$ between different datasets also have emerged. In this work, we employ two global and cosmic age-based parameterizations, PAge and MAPAge, to perform model-independent measurements of the Hubble constant $H_0$ and $\\Omega_\\mathrm{K}$ by utilizing the inverse distance ladder (IDL). To construct the PAge-improved IDL, we utilize the strong gravitational lensing (SGL), cosmic chronometers (CC), and gamma ray bursts (GRB) data to calibrate the latest DESI DR2 baryon acoustic oscillation data and DESY5 type Ia supernova data. Our analysis indicate that DESI+DESY5+SGL+CC+GRB gives $H_0=71.59\\pm 0.94\\,{\\rm km}~{\\rm s}^{-1}~{\\rm Mpc}^{-1}$ in the MAPAge model, reducing the $H_0$ tension to the $1.0\\sigma$ level. Extending to MAPAge$+\\Omega_{\\rm K}$ model, we obtain $\\Omega_\\mathrm{K}=0.001\\pm 0.038$, which suggests that current late-time data are consistent with a flat universe. Finally, the Bayesian analysis indicates that the present late-universe data provide weak to moderate evidence in favor of PAge and MAPAge relative to $\\Lambda{\\rm CDM}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.26355.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26366",
      "title": "$Λ$vCF: Extending $Λ$CDM into a Unified Model with Particle Creation",
      "authors": [
        "Vishnu A Pai",
        "Titus K Mathew"
      ],
      "abstract": "$Λ$vCF: Extending $Λ$CDM into a Unified Model with Particle Creation Vishnu A Pai, Titus K Mathew Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present a novel extended version of the $\\Lambda$CDM model that provides analytical solution for Hubble parameter uniting all epochs of cosmic evolution starting from inflation to late-acceleration, with intermediate radiation and matter-dominated epochs. This is achieved by relaxing the perfect fluid assumption in the standard model and considering a general viscous cosmic fluid (vCF) with non-zero particle creation rate and evolving adiabatic equation of state. Transition points of the Universe and the finite boundary connecting them is exactly determined. We then propose a novel method to determine the early-time viscous coefficient and inflation energy scale using the Cosmic Mode Index value postulated by Padmanabhan. Considering the data from the Planck 2018 analysis, this yields an inflationary Hubble parameter of $H_{I}\\approx10^{13}$\\,GeV. An equivalent scalar-field description for the inflationary epoch is then constructed and inferences are made regarding the nature of inflation. Notably, we find that the model describes an ultra-slow-roll hilltop inflation scenario with a graceful exit to radiation-dominated epoch. Subsequently, we show that bulk viscosity in this model can be expressed as Israel-Stewart equation in relativistic dissipative hydrodynamics with an appropriate underlying viscous coefficient and relaxation time that satisfy the causality constraint in its extreme limit. Finally, by comparing the evolution of this causal relation and its Navier-Stokes counterpart, we infer that the evolution from inflation to radiation era signifies a fluid transitioning from viscoelastic to pseudoplastic behavior.",
      "pdf_url": "https://arxiv.org/pdf/2510.26366.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2408.13144",
      "title": "Constraining binary mergers in AGN disks using the non-observation of lensed gravitational waves",
      "authors": [
        "Samson H. W. Leong",
        "Justin Janquart",
        "Aditya Kumar Sharma",
        "Paul Martens",
        "Parameswaran Ajith",
        "Otto A. Hannuksela"
      ],
      "abstract": "Constraining binary mergers in AGN disks using the non-observation of lensed gravitational waves Samson H. W. Leong, Justin Janquart, Aditya Kumar Sharma, Paul Martens, Parameswaran Ajith, Otto A. Hannuksela Accepted to ApJL, 8 pages, 4 figures Astrophys.J.Lett. 979 (2025) 2, L27 High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) The dense and dynamic environments within active galactic nuclei (AGN) accretion disks may serve as prolific birthplaces for binary black holes (BBHs) and one possible origin for some of the BBHs detected by gravitational-wave (GW) observatories. We show that a considerable fraction of the BBH in AGN disks will be strongly lensed by the central supermassive black hole (SMBH). Thus, the non-observation of lensed GW signals can be used to constrain the fraction of BBH binaries residing in AGN disks. The non-detection of lensing with current ${\\cal O}(100)$ detections will be sufficient to start placing constraints on the fraction of BBHs living within accretion disks near the SMBH. In the next-generation detectors era, with ${\\cal O}(10^5)$ BBH observations and no lensed events, we will be able to rule out most migration traps as dominant birthplaces of BBH mergers; moreover, we will be able to constrain the minimum size of the accretion disk. On the other hand, should AGNs constitute a major formation channel, lensed events from AGNs will become prominent in the future.",
      "pdf_url": "https://arxiv.org/pdf/2408.13144.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2410.03612",
      "title": "Resurrecting Gravitational Vector Modes and their Magnetogenesis",
      "authors": [
        "Ali Rida Khalife",
        "Cyril Pitrou"
      ],
      "abstract": "Resurrecting Gravitational Vector Modes and their Magnetogenesis Ali Rida Khalife, Cyril Pitrou 30 pages, 10 figures, 1 table. Matches published version in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We revisit the presence of primordial gravitational vector modes (V-modes) and their sourcing of primordial magnetic fields (PMF), i.e. magnetogenesis. As the adiabatic vector mode generically decays with expansion, we consider exotic initial conditions which circumvent this issue and lead to observational imprints. The first initial condition is an isocurvature mode between photons and neutrinos vorticities, and the second one is a non-trivial initial condition on the neutrino octupole. Both types of conditions sustain a constant vector mode on super Hubble scales at early times. We also consider a third scenario in which the adiabatic vector modes are rapidly sourced, at a given early but finite time, by an exotic component which develops an anisotropic stress. We find the best fitting parameters in these three cases to CMB and BAO data. We compare the resulting $B$-mode spectra of the CMB to data from BICEP/Keck and SPTpol. We find that none of the proposed initial conditions can produce large enough PMFs to seed every type of magnetic fields observed. However, V-modes are still consistent with the data and ought to be constrained for a better understanding of the primordial Universe before its hot big-bang phase.",
      "pdf_url": "https://arxiv.org/pdf/2410.03612.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.12828",
      "title": "Detecting stochastic gravitational wave background from cosmic strings with next-generation detector networks: Component separation based on a multi-source astrophysical foreground noise model",
      "authors": [
        "Geng-Chen Wang",
        "Hong-Bo Jin",
        "Xin Zhang"
      ],
      "abstract": "Detecting stochastic gravitational wave background from cosmic strings with next-generation detector networks: Component separation based on a multi-source astrophysical foreground noise model Geng-Chen Wang, Hong-Bo Jin, Xin Zhang 16 pages, 9 figures; accepted for publication in Physical Review D Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Detecting stochastic gravitational wave background (SGWB) from cosmic strings is crucial for unveiling the evolutionary laws of the early universe and validating non-standard cosmological models. This study presents the first systematic evaluation of the detection capabilities of next-generation ground-based gravitational wave detector networks for cosmic strings. By constructing a hybrid signal model incorporating multi-source astrophysical foreground noise, including compact binary coalescences (CBCs) and compact binary hyperbolic encounters (CBHEs), we propose an innovative parameter estimation methodology based on multi-component signal separation. Numerical simulations using one-year observational data reveal three key findings: (1) The CE4020ET network, comprising the Einstein Telescope (ET-10 km) and the Cosmic Explorer (CE-40 km and CE-20 km), achieves nearly one order of magnitude improvement in constraining the cosmic string tension $G\\mu$ compared to individual detectors, reaching a relative uncertainty $\\Delta G\\mu / G\\mu < 0.5$ for $G\\mu > 3.5 \\times 10^{-15}$ under standard cosmological framework; (2) The network demonstrates enhanced parameter resolution in non-standard cosmological scenarios, providing a novel approach to probe pre-Big Bang Nucleosynthesis cosmic evolution; (3) Enhanced detector sensitivity amplifies CBHE foreground interference in parameter estimation, while precise modeling of such signals could further refine $G\\mu$ constraints by $1-2$ orders of magnitude. This research not only quantifies the detection potential of third-generation detector networks for cosmic string models but also elucidates the intrinsic connection between foreground modeling precision and cosmological parameter estimation accuracy, offering theoretical foundations for optimizing scientific objectives of next-generation gravitational wave observatories.",
      "pdf_url": "https://arxiv.org/pdf/2502.12828.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.16589",
      "title": "Cosmological Preference for a Positive Neutrino Mass at 2.7$σ$: A Joint Analysis of DESI DR2, DESY5, and DESY1 Data",
      "authors": [
        "Guo-Hong Du",
        "Tian-Nuo Li",
        "Peng-Ju Wu",
        "Jing-Fei Zhang",
        "Xin Zhang"
      ],
      "abstract": "Cosmological Preference for a Positive Neutrino Mass at 2.7$σ$: A Joint Analysis of DESI DR2, DESY5, and DESY1 Data Guo-Hong Du, Tian-Nuo Li, Peng-Ju Wu, Jing-Fei Zhang, Xin Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Neutrinos and dark energy (DE) have entered a new era of investigation, as the latest DESI baryon acoustic oscillation measurements tighten the constraints on the neutrino mass and suggest that DE may be dynamical rather than a cosmological constant. {In this work, we obtain a high-confidence measurement of the neutrino mass within a dynamical DE framework. A joint analysis of DESI DR2, cosmic microwave background, DESY5 supernova, and DESY1 weak lensing data yields a total neutrino mass of $\\sum m_\\nu = 0.098^{+0.016}_{-0.037}\\,\\mathrm{eV}$, indicating a measurement for a non-zero, positive neutrino mass at the $2.7\\sigma$ level within the $w_0w_a$CDM framework. This high-confidence measurement is driven mainly by these factors: (i) the DESI's preference for a dynamical DE with its equation of state evolving from $w< -1$ at early times to $w> -1$ at late times, thus leading to a larger neutrino mass; (ii) treating $N_{\\mathrm{eff}}$ as a free parameter together with the inclusion of weak lensing data, which likewise allows for an increased neutrino mass.} In future, even higher-confidence measurements of neutrino mass are expected with stronger preferences for dynamical DE in light of more complete DESI data releases.",
      "pdf_url": "https://arxiv.org/pdf/2507.16589.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25821",
      "title": "The kSZ optical depth degeneracy and future constraints on local primordial non-Gaussianity",
      "authors": [
        "Avery J. Tishue",
        "Charuhas Shiveshwarkar",
        "Gilbert Holder"
      ],
      "abstract": "The kSZ optical depth degeneracy and future constraints on local primordial non-Gaussianity Avery J. Tishue, Charuhas Shiveshwarkar, Gilbert Holder 13 pages, 4 figures; comments welcome! Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recent reconstructions of the large-scale cosmological velocity field with kinetic Sunyaev Zeldovich (kSZ) tomography have returned an amplitude that is low with respect to the halo model prediction, captured by the kSZ velocity reconstruction bias $b_v <1$. This suggests that common choices for modeling the galaxy-electron cross correlation have systematically overestimated the true power, at least over scales and redshifts used in the velocity reconstruction measurements. In this paper, we study the implications of this overestimation for constraints on local-type primordial non-Gaussianity in current and near-future cosmological surveys. For concreteness, we focus on kSZ velocity reconstruction from a Vera Rubin Observatory-like survey in tandem with contemporary cosmic microwave background measurements. Assuming standard choices for the fiducial model of the small-scale galaxy-electron cross correlation, we find that upcoming kSZ tomography measurements can significantly improve constraints on local primordial non-Gaussianity via measurement of scale-dependent galaxy bias, in broad concordance with previous studies of the application of kSZ tomography to primordial non-Gaussianity. However, when we instead modify the assumed galaxy-electron cross-spectrum to be consistent with recent measurements of the velocity reconstruction bias, this picture can change appreciably. Specifically, we find that if the inferred suppression of galaxy-electron power persists at higher redshifts $z\\gtrsim 1$, kSZ-driven improvement in local primordial non-Gaussianity constraints may be less significant than previously estimated. We explore how these conclusions depend on various modeling and experimental assumptions and discuss implications for the emerging program of kSZ velocity reconstruction.",
      "pdf_url": "https://arxiv.org/pdf/2510.25821.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25829",
      "title": "Updated dark pixel fraction constraints on reionization's end from the Lyman-series forests of XQR-30",
      "authors": [
        "Frederick B. Davies",
        "Sarah E. I. Bosman",
        "Valentina D'Odorico",
        "Sofia Campo",
        "Andrei Mesinger",
        "Yuxiang Qin",
        "George D. Becker",
        "Eduardo Bañados",
        "Huanqing Chen",
        "Stefano Cristiani",
        "Xiaohui Fan",
        "Simona Gallerani",
        "Martin G. Haehnelt",
        "Laura C. Keating",
        "Samuel Lai",
        "Emma Ryan-Weber",
        "Feige Wang",
        "Jinyi Yang",
        "Yongda Zhu"
      ],
      "abstract": "Updated dark pixel fraction constraints on reionization's end from the Lyman-series forests of XQR-30 Frederick B. Davies, Sarah E. I. Bosman, Valentina D'Odorico, Sofia Campo, Andrei Mesinger, Yuxiang Qin, George D. Becker, Eduardo Bañados, Huanqing Chen, Stefano Cristiani, Xiaohui Fan, Simona Gallerani, Martin G. Haehnelt, Laura C. Keating, Samuel Lai, Emma Ryan-Weber, Feige Wang, Jinyi Yang, Yongda Zhu 14+4 pages, 14+6 figures, accepted for publication in MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO) The fraction of \"dark pixels\" in the Ly$\\alpha$ and other Lyman-series forests at $z\\sim 5-6$ provides a powerful constraint on the end of the reionization process. Any spectral region showing transmission must be highly ionized, while dark regions could be ionized or neutral, thus the dark pixel fraction provides a (nearly) model independent upper limit to the volume-filling fraction of the neutral intergalactic medium, modulo choices in binning scale and dark pixel definition. Here we provide updated measurements of the 3.3 comoving Mpc dark pixel fraction at $z=4.85-6.25$ in the Ly$\\alpha$, Ly$\\beta$, and Ly$\\gamma$ forests of 34 deep $5.8\\lesssim z\\lesssim 6.6$ quasar spectra from the (enlarged) XQR-30 sample. Using the negative pixel method to measure the dark pixel fraction, we derive fiducial $1\\sigma$ upper limits on the volume-average neutral hydrogen fraction of $\\langle x_{\\rm{HI}}\\rangle \\leq \\{0.030 + 0.048, 0.095 + 0.037, 0.191 + 0.056, 0.199 + 0.087\\}$ at $\\bar{z} = \\{5.481, 5.654, 5.831, 6.043\\}$ from the optimally sensitive combination of the Ly$\\beta$ and Ly$\\gamma$ forests. We further demonstrate an alternative method that treats the forest flux as a mixture of dark and transparent regions, where the latter are modeled using a physically-motivated parametric form for the intrinsic opacity distribution. The resulting model-dependent upper limits on $\\langle x_{\\rm{HI}}\\rangle$ are similar to those derived from our fiducial model-independent analysis. We confirm that the bulk of reionization must be finished at $z>6$, while leaving room for an extended \"soft landing\" to the reionization history down to $z\\sim 5.4$ suggested by Ly$\\alpha$ forest opacity fluctuations.",
      "pdf_url": "https://arxiv.org/pdf/2510.25829.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25886",
      "title": "Mitigating gain calibration errors from EoR observations with SKA1-Low AA*",
      "authors": [
        "Eeshan Beohar",
        "Abhirup Datta",
        "Anshuman Tripathi",
        "Samit Kumar Pal",
        "Rashmi Sagar"
      ],
      "abstract": "Mitigating gain calibration errors from EoR observations with SKA1-Low AA* Eeshan Beohar, Abhirup Datta, Anshuman Tripathi, Samit Kumar Pal, Rashmi Sagar 25 + 1 pages, 11 figures, 2 tables; prepared for submission to JCAP. Comments and suggestions are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) The observation of the redshifted 21-cm signal from neutral hydrogen is a promising probe for understanding the phase transition of the early universe and its evolution during the Cosmic Dawn and the Epoch of Reionisation (EoR). One of the primary obstacles to the statistical detection of the target signal is the presence of residual foreground, which arises from gain calibration errors. Previous studies have shown that gain calibration errors as small as 0.01% can lead to a biased interpretation of the observed signal power spectrum estimation, by nearly an order of magnitude. A recent study further highlights that to retrieve astrophysical parameters accurately, the threshold gain calibration error should be lower than 0.01%. In this work, we develop a post-calibration mitigation strategy that combines foreground subtraction techniques with foreground avoidance to address residual contamination arising from gain calibration errors. We use an end-to-end pipeline 21cmE2E to simulate a realistic sky model and telescope configuration within the 138-146 MHz frequency range. To assess the impact of residual antenna-based gain calibration errors, we perform a detailed power spectrum analysis across several threshold levels. Our analysis shows that the extraction of the target signal over the wavenumber range $0.05 \\leq k \\leq 0.5$ Mpc$^{-1}$ is possible with a threshold gain calibration error of 1%, although with a significant SNR tradeoff on larger scales. Moreover, this work also offers a comparative assessment of foreground removal and avoidance techniques in the context of future SKA1-Low AA* observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.25886.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26318",
      "title": "Weak-Lensing Detection of Intercluster Filaments in Three Nearby Cluster Systems",
      "authors": [
        "Rahul Shinde",
        "Ian Dell'Antonio"
      ],
      "abstract": "Weak-Lensing Detection of Intercluster Filaments in Three Nearby Cluster Systems Rahul Shinde, Ian Dell'Antonio Cosmology and Nongalactic Astrophysics (astro-ph.CO) Direct detection of intercluster filaments is challenging due to their low surface density, resulting in a weak deflection field. We present weak-lensing detections of intercluster filaments using wide-field Dark Energy Camera (DECam) observations from the Local Volume Complete Cluster Survey (LoVoCCS). A matched-filter method was applied to identify filamentary structures in three nearby ($z < 0.1$) systems centered on Abell 401, Abell 2029, and Abell 3558. We discover two prominent filaments ($\\geq 4\\sigma$) in each system, with the strongest detections ($6.4\\sigma - 7.3\\sigma$) around Abell 401 and Abell 2029. In particular, we report the first robust weak-lensing detections $(>5 \\sigma)$ of the intercluster bridges connecting the cluster pairs Abell 401/399, Abell 2029/2033, Abell 2029/SIG, and Abell 3558/3556. Adopting a filament convergence model motivated by numerical simulations, we infer the maximum convergence ($\\kappa_0$) and characteristic width ($h_{\\mathrm{c}}$) for all six filaments, yielding $\\kappa_0 \\sim 0.015 - 0.053$ and $h_{\\mathrm{c}} \\sim 0.11 - 0.45 \\ \\mathrm{Mpc}$. The performance of the matched-filter technique is validated using mock shear catalogs and further tested on a null field around Abell 2351. We also explore the potential of using the B-mode lensing signal of filaments to suppress cluster-induced shear contamination. These results demonstrate the feasibility of directly mapping dark matter filaments with current and future wide-field weak-lensing datasets.",
      "pdf_url": "https://arxiv.org/pdf/2510.26318.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26545",
      "title": "A test of invariance of halo surface density for FIRE-2 simulations with cold dark matter and self-interacting dark matter",
      "authors": [
        "Sujit K. Dalui",
        "Shantanu Desai"
      ],
      "abstract": "A test of invariance of halo surface density for FIRE-2 simulations with cold dark matter and self-interacting dark matter Sujit K. Dalui, Shantanu Desai Cosmology and Nongalactic Astrophysics (astro-ph.CO) Numerous observations have shown that the dark matter halo surface density, defined as the product of core radius and halo central density of cored dark matter haloes is nearly constant and independent of galaxy mass over a whole slew of galaxy types. Here we calculate the surface density in cold dark matter(CDM) and self-interacting dark matter (SIDM) models including baryons, as well as SIDM without baryons, for dwarf galaxies of masses $\\approx 10^{10} M_{\\odot}$ using mock catalogs obtained from simulations as part of the Feedback In Realistic Environments project. We find that the dark matter surface density and column density are nearly constant for CDM and SIDM for this mass range. The halo surface density obtained from the Burkert profile fit is consistent with galactic-scale observations within $1\\sigma$. We also computed the empirical scaling relations between the central surface density and maximum velocity using the best-fit dark matter profiles, and found that they agree with observations of Milky Way and M31 dwarfs.",
      "pdf_url": "https://arxiv.org/pdf/2510.26545.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26593",
      "title": "Hybrid Physical-Neural Simulator for Fast Cosmological Hydrodynamics",
      "authors": [
        "Arne Thomsen",
        "Tilman Tröster",
        "François Lanusse"
      ],
      "abstract": "Hybrid Physical-Neural Simulator for Fast Cosmological Hydrodynamics Arne Thomsen, Tilman Tröster, François Lanusse Accepted to the NeurIPS 2025 Workshop on Machine Learning and the Physical Sciences Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG) Cosmological field-level inference requires differentiable forward models that solve the challenging dynamics of gas and dark matter under hydrodynamics and gravity. We propose a hybrid approach where gravitational forces are computed using a differentiable particle-mesh solver, while the hydrodynamics are parametrized by a neural network that maps local quantities to an effective pressure field. We demonstrate that our method improves upon alternative approaches, such as an Enthalpy Gradient Descent baseline, both at the field and summary-statistic level. The approach is furthermore highly data efficient, with a single reference simulation of cosmological structure formation being sufficient to constrain the neural pressure model. This opens the door for future applications where the model is fit directly to observational data, rather than a training set of simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.26593.pdf",
      "categories": [
        "astro-ph.CO",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26691",
      "title": "Flinch: A Differentiable Framework for Field-Level Inference of Cosmological parameters from curved sky data",
      "authors": [
        "Andrea Crespi",
        "Marco Bonici",
        "Arthur Loureiro",
        "Jaime Ruiz-Zapatero",
        "Ivan Sladoljev",
        "Zack Li",
        "Adrian Bayer",
        "Marius Millea",
        "Uroš Seljak"
      ],
      "abstract": "Flinch: A Differentiable Framework for Field-Level Inference of Cosmological parameters from curved sky data Andrea Crespi, Marco Bonici, Arthur Loureiro, Jaime Ruiz-Zapatero, Ivan Sladoljev, Zack Li, Adrian Bayer, Marius Millea, Uroš Seljak 18 pages, 11 figures. Comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present Flinch, a fully differentiable and high-performance framework for field-level inference on angular maps, developed to improve the flexibility and scalability of current methodologies. Flinch is integrated with differentiable cosmology tools, allowing gradients to propagate from individual map pixels directly to the underlying cosmological parameters. This architecture allows cosmological inference to be carried out directly from the map itself, bypassing the need to specify a likelihood for intermediate summary statistics. Using simulated, masked CMB temperature maps, we validate our pipeline by reconstructing both maps and angular power spectra, and we perform cosmological parameter inference with competitive precision. In comparison with the standard pseudo-$C_\\ell$ approach, Flinch delivers substantially tighter constraints, with error bars reduced by up to 40%. Among the gradient-based samplers routinely employed in field-level analyses, we further show that MicroCanonical Langevin Monte Carlo provides orders-of-magnitude improvements in sampling efficiency over currently employed Hamiltonian Monte Carlo samplers, greatly reducing computational expense.",
      "pdf_url": "https://arxiv.org/pdf/2510.26691.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26731",
      "title": "The Weighing Halos Accurately, Locally, and Efficiently with Supernovae (WHALES) Survey Overview and Initial Data Release",
      "authors": [
        "Maria Acevedo",
        "Daniel Scolnic",
        "Bastien Carreres",
        "Erik R. Peterson",
        "Bruno O. Sanchez",
        "Christopher Lidman",
        "Bailey Martin",
        "Christopher A. Onken",
        "Adam G. Riess"
      ],
      "abstract": "The Weighing Halos Accurately, Locally, and Efficiently with Supernovae (WHALES) Survey Overview and Initial Data Release Maria Acevedo, Daniel Scolnic, Bastien Carreres, Erik R. Peterson, Bruno O. Sanchez, Christopher Lidman, Bailey Martin, Christopher A. Onken, Adam G. Riess 12 pages, 6 figures. To be submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present an overview of the Weighing Halos Accurately, Locally, and Efficiently with Supernovae (WHALES) survey, the first to discover and measure Type Ia supernovae (SNe Ia) in and around galaxy superclusters. By building a sample of SNe~Ia around these massive environments, we aim to provide new constraints on bulk-flow models while laying the groundwork for improved estimates of supercluster masses. Here, we present data from the first two seasons targeting the Shapley Supercluster (0.02<z<0.06), which is responsible for a large but unknown fraction of our local group's motion. Until now, no supernovae had been analyzed in the direction of Shapley. Through the WHALES survey, we have identified 12 likely SNe Ia in this region using SkyMapper, including 8 with spectroscopic confirmation. We present the first light curves of these SNe and combine our observations with data from ATLAS. We demonstrate that the low number of discovered SNe Ia per season is consistent with various rate calculations, highlighting the need for future surveys to monitor superclusters over a multi-year timespan. Finally, we present simulations of SN Ia observations in the environments of massive galaxy clusters, demonstrating how the inferred peculiar velocities can constrain cluster masses, and highlighting the added complexity within superclusters. We find that a sample of 100 SNe Ia would enable a 25% precision measurement of the total mass of the Shapley Supercluster.",
      "pdf_url": "https://arxiv.org/pdf/2510.26731.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26767",
      "title": "Unbiased Primordial Gravitational Wave Inference from the CMB with SMICA",
      "authors": [
        "Alexander Steier",
        "Shamik Ghosh",
        "Jacques Delabrouille"
      ],
      "abstract": "Unbiased Primordial Gravitational Wave Inference from the CMB with SMICA Alexander Steier, Shamik Ghosh, Jacques Delabrouille 17 pages, 9 figures, to be published in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) The detection of primordial gravitational waves in Cosmic Microwave Background B-mode polarization observations requires accurate and robust subtraction of astrophysical contamination. We show, using a blind Spectral Matching Independent Component Analysis, that it is possible to infer unbiased estimates of the primordial B-mode signal from ground-based observations of a small patch of sky even for highly complex foreground contamination. This work, originally performed in the context of configuration studies for a future CMB-S4 observatory, is highly relevant for the analysis of observations by the current generation of CMB experiments.",
      "pdf_url": "https://arxiv.org/pdf/2510.26767.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.26791",
      "title": "Boosting the cosmic 21-cm signal with exotic Lyman-$α$ from dark matter",
      "authors": [
        "Dominic Agius",
        "Tracy Robyn Slatyer"
      ],
      "abstract": "Boosting the cosmic 21-cm signal with exotic Lyman-$α$ from dark matter Dominic Agius, Tracy Robyn Slatyer 5 pages, 3 figures, plus appendices. Comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The 21-cm signal from the epoch of cosmic dawn ($z \\sim 10-30$) offers a powerful probe of new physics. One standard mechanism for constraining decaying dark matter from 21-cm observations relies on heating of the intergalactic medium by the decay products, an effect whose observability is entangled with the uncertain Lyman-$\\alpha$ fluxes and X-ray heating from the first stars. In this Letter, we explore a novel mechanism, where the Lyman-$\\alpha$ photons produced from dark matter decay initiate early Wouthuysen-Field coupling of the spin temperature to the gas temperature, thereby boosting the 21-cm signal. This mechanism provides constraints on dark matter that are less dependent on uncertainties associated with star formation than constraints on exotic heating. We study this effect for decaying dark matter with masses $m_{\\chi}\\sim20.4-27.2$ eV, where diphoton decay efficiently produces Lyman-series photons. We present forecasts for the Hydrogen Epoch of Reionization Array and the Square Kilometre Array, showing their potential to probe an unconstrained parameter space for light decaying DM, including axion-like particles.",
      "pdf_url": "https://arxiv.org/pdf/2510.26791.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25847",
      "title": "Cosmological Simulations of Weakly Collisional Plasmas with Braginskii Viscosity in Galaxy Clusters",
      "authors": [
        "Tirso Marin-Gilabert",
        "Ulrich P. Steinwandel",
        "Milena Valentini",
        "John A. ZuHone",
        "Klaus Dolag"
      ],
      "abstract": "Cosmological Simulations of Weakly Collisional Plasmas with Braginskii Viscosity in Galaxy Clusters Tirso Marin-Gilabert, Ulrich P. Steinwandel, Milena Valentini, John A. ZuHone, Klaus Dolag 19 pages, 17 figures, submitted to MNRAS Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Plasma Physics (physics.plasm-ph) We present the implementation of an anisotropic viscosity solver within the magnetohydrodynamics (MHD) framework of the TreeSPH code OpenGadget3. The solver models anisotropic viscous transport along magnetic field lines following the Braginskii formulation and includes physically motivated limiters based on the mirror and firehose instability thresholds, which constrain the viscous stress in weakly collisional plasmas. To validate the implementation, we performed a suite of standard test problems -- including two variants of the sound-wave test, circularly and linearly polarized Alfven waves, fast magnetosonic wave, and the Kelvin-Helmholtz instability -- both with and without the plasma-instability limiters. The results show excellent agreement with the AREPO implementation of a similar anisotropic viscosity model (Berlok et al. 2019), confirming the accuracy and robustness of our method. Our formulation integrates seamlessly within the individual adaptive timestepping framework of OpenGadget3, avoiding the need for subcycling. This provides efficient and stable time integration while maintaining physical consistency. Finally, we applied the new solver to a cosmological zoom-in simulation of a galaxy cluster, demonstrating its capability to model anisotropic transport and plasma microphysics in realistic large-scale environments. Our implementation offers a versatile and computationally efficient tool for studying anisotropic viscosity in magnetized astrophysical systems.",
      "pdf_url": "https://arxiv.org/pdf/2510.25847.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26218",
      "title": "Rotation Measure Analysis of Shocks and Sloshing Fronts in a Galaxy Cluster Merger Simulation",
      "authors": [
        "Jia-Rou Liou",
        "Alvina Y. L. On",
        "H. -Y. Karen Yang",
        "J. A. ZuHone"
      ],
      "abstract": "Rotation Measure Analysis of Shocks and Sloshing Fronts in a Galaxy Cluster Merger Simulation Jia-Rou Liou, Alvina Y. L. On, H. -Y. Karen Yang, J. A. ZuHone High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Recent observations of the Fornax cluster show depolarization signatures on megaparsec scales, which may be associated with shocks and/or sloshing motions during cluster merger and/or in-fall. To investigate the possible reasons behind the depolarization, we carry out analytical and full polarized radiative transfer (PRT) calculations of radio point sources behind a merging galaxy cluster simulated using the FLASH code. With uniform background light, we analyzed the rotation measure (RM) morphology near the shock front and the cluster center, where sloshing cold fronts appear. For the shock scenario, we find a local RM enhancement by $\\sim56\\%$ behind the shock front on megaparsec scales, arising from the compression of hot gas and magnetic field lines. Behind the sloshing cold front, the cluster center shows decrement in RM magnitude by $\\sim23.3\\%$, as a result of the cancellation effect of randomly-oriented magnetic fields induced by sloshing-driven turbulence. We find that beam depolarization increases behind shock fronts and across sloshing cold fronts, indicating enhanced magnetic field fluctuations across the plane of the sky in both scenarios. By fully accounting for all radiative transfer coefficients in the PRT calculations, the uniform background light becomes more depolarized near the cluster center, with the effect growing more pronounced as background intensity decreases. This suggests that synchrotron emission and Faraday rotation of the intracluster medium can significantly influence the polarization of background sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.26218.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2408.11098",
      "title": "Supermassive black holes from inflation constrained by dark matter substructure",
      "authors": [
        "Shin'ichiro Ando",
        "Shyam Balaji",
        "Malcolm Fairbairn",
        "Nagisa Hiroshima",
        "Koji Ishiwata"
      ],
      "abstract": "Supermassive black holes from inflation constrained by dark matter substructure Shin'ichiro Ando, Shyam Balaji, Malcolm Fairbairn, Nagisa Hiroshima, Koji Ishiwata 11 pages, 6 figures, matches journal (Physical Review D) accepted version Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Recent James Webb Space Telescope observations of high-redshift massive galaxy candidates have initiated renewed interest in the important mystery around the formation and evolution of our Universe's largest supermassive black holes (SMBHs). We consider the possibility that some of them were seeded by the direct collapse of primordial density perturbations from inflation into primordial black holes and analyze the consequences of this on current dark matter substructures assuming non-Gaussian primordial curvature perturbation distributions. We derive bounds on the enhanced curvature perturbation amplitude from the number of dwarf spheroidal galaxies in our Galaxy, observations of stellar streams and gravitational lensing. We find this bound region significantly overlaps with that required for SMBH seed formation and enables us to probe Gaussian and non-Gaussian curvature perturbations corresponding to the SMBH seeds in the range ${\\cal O}(10^5$\\text{--}$10^{12}) M_\\odot$.",
      "pdf_url": "https://arxiv.org/pdf/2408.11098.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.12741",
      "title": "Probing the cosmic baryon distribution and the impact of AGN feedback with FRBs in CROCODILE simulation",
      "authors": [
        "Zhao Joseph Zhang",
        "Kentaro Nagamine",
        "Yuri Oku",
        "Khee-Gan Lee",
        "Keita Fukushima",
        "Kazuki Tomaru",
        "Bing Zhang",
        "Isabel Medlock",
        "Daisuke Nagai"
      ],
      "abstract": "Probing the cosmic baryon distribution and the impact of AGN feedback with FRBs in CROCODILE simulation Zhao Joseph Zhang, Kentaro Nagamine, Yuri Oku, Khee-Gan Lee, Keita Fukushima, Kazuki Tomaru, Bing Zhang, Isabel Medlock, Daisuke Nagai Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the Missing Baryon problem using Fast Radio Bursts (FRBs) to trace cosmic baryons. Our CROCODILE simulations, performed with the GADGET3/4-OSAKA smoothed particle hydrodynamics code, include star formation, supernova (SN) and active galactic nuclei (AGN) feedback. We generate light cones from large-scale structure simulations to compute gas density profiles and dispersion measures (DMs) measurable by FRBs. Our results show that AGN feedback reduces central gas densities in halos, reshaping the boundary between the circumgalactic medium (CGM) and intergalactic medium (IGM). Zoom-in simulations reveal that AGN feedback significantly modulates the DM contributions from foreground halos along different sightlines. Using the DM-redshift (DM-z) relation up to z=1, we constrain the diffuse baryon mass fraction at z = 1 to f_diff = 0.865 (+0.101, -0.165) (fiducial) and f_diff = 0.856 (+0.101, -0.162) (NoBH), which include contributions from both IGM (f_IGM) and halos (f_Halos), serving as upper limits. We further separate and quantify the redshift evolution of f_CGM, f_IGM, and f_diff using both phase-based and structure-based definitions. From an observational perspective, we also distinguish the line-of-sight averaged quantity < f_{diff,obs} > from the intrinsic redshift-evolving f_diff(z), reflecting the statistical nature of FRB-based measurements. Our study provides a framework for understanding baryon distribution across cosmic structures, FRB host galaxies, and the role of AGN in shaping foreground DM contributions.",
      "pdf_url": "https://arxiv.org/pdf/2503.12741.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.03384",
      "title": "Capturing Small-Scale Reionization Physics: A Sub-Grid Model for Photon Sinks with SCRIPT",
      "authors": [
        "Tirthankar Roy Choudhury",
        "Anirban Chakraborty"
      ],
      "abstract": "Capturing Small-Scale Reionization Physics: A Sub-Grid Model for Photon Sinks with SCRIPT Tirthankar Roy Choudhury, Anirban Chakraborty Revised version, accepted for publication in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The epoch of reionization represents a major phase transition in cosmic history, during which the first luminous sources ionized the intergalactic medium (IGM). However, the small-scale physics governing ionizing photon sinks - particularly the interplay between recombinations, photon propagation, and self-shielded regions - remains poorly understood. Accurately modeling these processes requires a framework that self-consistently links ionizing emissivity, the clumping factor, mean free path, and photoionization rate. In this work, we extend the photon-conserving semi-numerical framework, SCRIPT, by introducing a self-consistent sub-grid model that dynamically connects these quantities to the underlying density field, enabling a more realistic treatment of inhomogeneous recombinations and photon sinks. We validate our model against a comprehensive set of observational constraints, including the UV luminosity function from HST and JWST, CMB optical depth from Planck, and Lyman-$\\alpha$ forest measurements of the IGM temperature, photoionization rate, and mean free path. Our fiducial model also successfully reproduces Lyman-$\\alpha$ opacity fluctuations, reinforcing its ability to capture large-scale inhomogeneities in the reionization process. Notably, we demonstrate that traditionally independent parameters, such as the clumping factor and mean free path, are strongly correlated, with implications for the timing, morphology, and thermal evolution of reionization. Looking ahead, we will extend this framework to include machine learning-based parameter inference. With upcoming 21cm experiments poised to provide unprecedented insights, SCRIPT offers a powerful computational tool for interpreting high-redshift observations and refining our understanding of the last major phase transition in the universe.",
      "pdf_url": "https://arxiv.org/pdf/2504.03384.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22018",
      "title": "Exploring the Early Universe with Deep Learning",
      "authors": [
        "Emmanuel de Salis",
        "Massimo De Santis",
        "Davide Piras",
        "Sambit K. Giri",
        "Michele Bianco",
        "Nicolas Cerardi",
        "Philipp Denzel",
        "Merve Selcuk-Simsek",
        "Kelley M. Hess",
        "M. Carmen Toribio",
        "Franz Kirsten",
        "Hatem Ghorbel"
      ],
      "abstract": "Exploring the Early Universe with Deep Learning Emmanuel de Salis, Massimo De Santis, Davide Piras, Sambit K. Giri, Michele Bianco, Nicolas Cerardi, Philipp Denzel, Merve Selcuk-Simsek, Kelley M. Hess, M. Carmen Toribio, Franz Kirsten, Hatem Ghorbel EPIA 2025 preprint version, 12 pages, 3 figures Valente de Oliveira, J., Leite, J., Rodrigues, J., Dias, J., Cardoso, P. (eds) Progress in Artificial Intelligence. EPIA 2025. Lecture Notes in Computer Science(), vol 16121. Springer, Cham Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Hydrogen is the most abundant element in our Universe. The first generation of stars and galaxies produced photons that ionized hydrogen gas, driving a cosmological event known as the Epoch of Reionization (EoR). The upcoming Square Kilometre Array Observatory (SKAO) will map the distribution of neutral hydrogen during this era, aiding in the study of the properties of these first-generation objects. Extracting astrophysical information will be challenging, as SKAO will produce a tremendous amount of data where the hydrogen signal will be contaminated with undesired foreground contamination and instrumental systematics. To address this, we develop the latest deep learning techniques to extract information from the 2D power spectra of the hydrogen signal expected from SKAO. We apply a series of neural network models to these measurements and quantify their ability to predict the history of cosmic hydrogen reionization, which is connected to the increasing number and efficiency of early photon sources. We show that the study of the early Universe benefits from modern deep learning technology. In particular, we demonstrate that dedicated machine learning algorithms can achieve more than a $0.95$ $R^2$ score on average in recovering the reionization history. This enables accurate and precise cosmological and astrophysical inference of structure formation in the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2509.22018.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.02759",
      "title": "Timescales of Quasar Accretion Discs from Low to High Black Hole Masses and a Turnover at the High Mass End",
      "authors": [
        "C. Wolf",
        "S. Lai",
        "J.-J. Tang",
        "J. Tonry"
      ],
      "abstract": "Timescales of Quasar Accretion Discs from Low to High Black Hole Masses and a Turnover at the High Mass End C. Wolf, S. Lai, J.-J. Tang, J. Tonry 11 pages, 6 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Characteristic time scales in the stochastic UV-optical variability of quasars may depend on the mass of their black holes, $M_{\\rm BH}$, as much as physical timescales in their accretion discs do. We calculate emission-weighted mean radii, $R_{\\rm mean}$, and orbital timescales, $t_{\\rm mean}$, of standard thin disc models for emission wavelengths $\\lambda$ from 1000 to 10000 AA, $M_{\\rm BH}$ from $10^6$ to $10^{11}$ solar masses, and Eddington ratios from 0.01 to 1. At low $M_{\\rm BH}$, we find the textbook behaviour of $t_{\\rm mean}\\propto M_{\\rm BH}^{-1/2}$ alongside $R_{\\rm mean} \\approx \\mathrm{const}$, but toward higher masses the growing event horizon imposes $R_{\\rm mean} \\propto M_{\\rm BH}$ and thus a turnover into $t_{\\rm mean}\\propto M_{\\rm BH}$. For quasars of $\\log L_{\\rm bol}=47$, the turnover mass, where $t_{\\rm mean}$ starts rising is $M_{\\rm BH}\\approx 9.5$, which means that the turnover in $t_{\\rm mean}$ is well within the range of high-luminosity quasar samples, whose variability time scales might thus show little mass dependence. We fit smoothly broken power laws to the results and provide analytic convenience functions for $R_{\\rm mean}(\\lambda,M_{\\rm BH},L_{3000})$ and $t_{\\rm mean}(\\lambda,M_{\\rm BH},L_{3000})$.",
      "pdf_url": "https://arxiv.org/pdf/2411.02759.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.14150",
      "title": "Hubble constant measurement from QPEs as electromagnetic counterparts to extreme mass ratio inspirals",
      "authors": [
        "Yejing Zhan",
        "Di Wang",
        "Shuang-Xi Yi",
        "Fa-Yin Wang"
      ],
      "abstract": "Hubble constant measurement from QPEs as electromagnetic counterparts to extreme mass ratio inspirals Yejing Zhan, Di Wang, Shuang-Xi Yi, Fa-Yin Wang 19 pages, 3 figures, 5 tables. Submitted to AAS journals High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Gravitational waves (GWs) accompanied by electromagnetic (EM) counterparts provide a novel methodology to measure the Hubble constant ($H_0$), known as bright sirens. However, the rarity of such multi-messenger events limits the precision of the $H_0$ constraint. Recently, the newly-discovered nuclear transient, quasi-periodic eruptions (QPEs) show intriguing evidence of a stellar-mass companion captured by a supermassive black hole (SMBH) in an extreme/intermediate mass-ratio inspiral (EMRI/IMRI), which is the most promising sources of the space-based GW detectors, such as LISA. Here, we study the secular orbital evolution of QPE systems under different theoretical frameworks based on timing observation,including the stripping scenario and the orbiter-disk scenario, and assess their GW detectability by LISA. Here, we model the secular orbital evolution of known QPE systems using two frameworks: a stripping scenario in which periodic mass transfer at periapsis drives the evolution; and an orbiter-disk collision scenario in which the companion interacts with a misaligned accretion disk, modulated by coupled orbiter-disk precession. For each framework, we assess detectability by LISA, together with the resulting constraints on $H_0$. Our principal findings are: (i) in the stripping scenario, no currently known QPE reaches detectability within a four-year LISA mission. (ii) in the orbiter-disk scenario, two sources-eRO-QPE2 and eRO-QPE4-are detectable with signal-to-noise ratios $\\simeq 8.5-28.8$ and constrain $H_0$ with frictional uncertainty of 6.7-14.9\\%. QPE systems remain uncertain on the decade-long secular evolution. Therefore, they motivate continued time-domain monitoring of QPE candidates.",
      "pdf_url": "https://arxiv.org/pdf/2506.14150.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.25842",
      "title": "Demystifying flux eruptions: Magnetic flux transport in magnetically arrested disks",
      "authors": [
        "Jonatan Jacquemin-Ide",
        "Mitchell C. Begelman",
        "Beverly Lowell",
        "Matthew Liska",
        "Jason Dexter",
        "Alexander Tchekhovskoy"
      ],
      "abstract": "Demystifying flux eruptions: Magnetic flux transport in magnetically arrested disks Jonatan Jacquemin-Ide, Mitchell C. Begelman, Beverly Lowell, Matthew Liska, Jason Dexter, Alexander Tchekhovskoy We welcome comments, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Magnetically arrested disks (MADs) are a compelling model for explaining variability in low-luminosity active galactic nuclei (AGN), including horizon-scale outbursts like those observed in Sagittarius A*. MADs experience powerful flux eruptions-episodic ejections of magnetic flux from the black hole horizon-that may drive the observed luminosity variations. In this work, we develop and validate a new formalism describing large-scale magnetic field transport in general relativistic magnetohydrodynamic simulations of MADs with geometrical thicknesses of $h/R=0.1$ and $h/R=0.3$. We introduce a net flux transport velocity, $v_\\Phi$, which accounts for both advective and diffusive processes. We show that MADs maintain a statistical quasi-steady state where advection and diffusion nearly balance. Flux eruptions appear as small deviations from this equilibrium, with $v_\\Phi/V_k\\ll1$, where $V_k$ is the local Keplerian velocity. Using this framework, we analytically derive a recurrence timescale for flux eruptions, $t_{\\rm rec}\\sim1500\\, r_g/c$. This timescale closely matches simulation results. The smallness of $v_\\Phi$ explains the long recurrence times of flux eruptions compared to other system timescales. We also take a closer look at the diffusion of the magnetic field by performing the first measurement of turbulent resistivity in MADs. We then estimate the turbulent magnetic Prandtl number, defined as the ratio of turbulent viscosity to turbulent resistivity. We find $\\mathcal{P}_m\\sim3$, consistent with shearing-box simulations of magneto rotational instability-driven turbulence. While flux eruptions excite large-scale non-axisymmetric modes and locally enhance turbulent resistivity, magnetic field diffusion is dominated by smaller-scale turbulent motions. These results provide new insight into the nature of AGN variability and the fundamental physics of magnetic field transport.",
      "pdf_url": "https://arxiv.org/pdf/2510.25842.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25873",
      "title": "25 Years of Groundbreaking Discoveries with Chandra",
      "authors": [
        "Patrick Slane , Ákos Bogdán , David Pooley Center for Astrophysics | Harvard and Smithsonian, Trinity University, Eureka Scientific, Inc.)"
      ],
      "abstract": "25 Years of Groundbreaking Discoveries with Chandra Patrick Slane (1), Ákos Bogdán (1), David Pooley (2,3) ((1) Center for Astrophysics | Harvard and Smithsonian, (2) Trinity University, (3) Eureka Scientific, Inc.) Nature Astronomy volume 9, pages 1431-1443 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) The Chandra X-ray Observatory is a mainstay of modern observational astrophysics. With the highest angular resolution of any X-ray facility, its imaging and spectral capabilities in the 0.5-10 keV band have led to both unique and complementary breakthroughs in nearly all areas of the field. Now more than a quarter century into its mission, Chandra continues to provide unique information on the contributions of compact objects to the evolution of galaxies, the nature of supernova explosions, the impact of energetic jets from supermassive black holes on their host environments, and the fate of exoplanet atmospheres in systems rich with stellar flares. Here we provide a summary of Chandra results - one that is embarrassingly incomplete, but representative of both the exquisite past and promising future for Chandra's contributions to high energy astrophysics and all of mainstream astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2510.25873.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26111",
      "title": "Accretion rates of stellar-mass compact objects embedded in AGN discs",
      "authors": [
        "Cheng-Liang Jiao",
        "Liying Zhu",
        "Er-gang Zhao",
        "Jia Zhang"
      ],
      "abstract": "Accretion rates of stellar-mass compact objects embedded in AGN discs Cheng-Liang Jiao, Liying Zhu, Er-gang Zhao, Jia Zhang 14 pages, 5 figures, accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Stellar-mass compact objects (COs) embedded in active galactic nucleus (AGN) discs are commonly assumed to accrete via Bondi or Bondi-Hoyle-Lyttleton (BHL) prescriptions, neglecting gas angular momentum. We show that differential rotation in AGN discs can impart non-negligible angular momentum, in which case accretion proceeds through a viscous disc rather than Bondi/BHL flow. Our model provides a new framework estimating the CO accretion rate as $\\dot{M}_\\mathrm{CO} = \\min\\{\\dot{M}_\\mathrm{vis}, \\dot{M}_\\mathrm{BHL}\\}$, where the viscous rate $\\dot{M}_\\mathrm{vis}$ accounts for gas--CO relative motion decomposed into a local gradient term (due to differential rotation) and bulk motion (from differing orbital parameters). This rate can be expressed as $\\dot{M}_\\mathrm{vis} = \\alpha \\xi (r_\\mathrm{H}/r_\\mathrm{BHL})^3\\dot{M}_\\mathrm{BHL}$, where $\\xi$ is a coefficient of order unity. It can also be approximately scaled to the global AGN accretion rate as $\\dot{M}_\\mathrm{vis} \\propto \\dot{M}_1$, with the scaling coefficients in both forms determined by the specific dynamical configuration. The accretion is viscosity-limited when $q > [\\alpha \\xi(1+\\mathcal{M}^2)^{3}/3]^{1/2} h^3$, where $q$ is the mass ratio between the CO and the supermassive black hole, $\\alpha$ the viscosity parameter, $\\mathcal{M}$ the Mach number of the bulk relative motion, and $h$ the aspect ratio of the AGN disc. In thin AGN discs this condition is satisfied for most stellar-mass or more massive COs. Our framework also naturally allows for the inclusion of established outflow corrections, thereby enabling a more realistic treatment of super-Eddington flows. Our formulation thus improves upon Bondi/BHL prescriptions and offers a more physically motivated basis for studying CO evolution in AGN environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.26111.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26112",
      "title": "Evidence of cosmic-ray acceleration up to sub-PeV energies in the supernova remnant IC 443",
      "authors": [
        "Zhen Cao",
        "F. Aharonian",
        "Y.X. Bai",
        "Y.W. Bao",
        "D. Bastieri",
        "X.J. Bi",
        "Y.J. Bi",
        "W. Bian",
        "A.V. Bukevich",
        "C.M. Cai",
        "W.Y. Cao",
        "Zhe Cao",
        "J. Chang",
        "J.F. Chang",
        "A.M. Chen",
        "E.S. Chen",
        "G.H. Chen",
        "H.X. Chen",
        "Liang Chen",
        "Long Chen",
        "M.J. Chen",
        "M.L. Chen",
        "Q.H. Chen",
        "S. Chen",
        "S.H. Chen",
        "S.Z. Chen",
        "T.L. Chen",
        "X.B. Chen",
        "X.J. Chen",
        "Y. Chen",
        "N. Cheng",
        "Y.D. Cheng",
        "M.C. Chu",
        "M.Y. Cui",
        "S.W. Cui",
        "X.H. Cui",
        "Y.D. Cui",
        "B.Z. Dai",
        "H.L. Dai",
        "Z.G. Dai",
        "Danzengluobu",
        "Y.X. Diao",
        "X.Q. Dong",
        "K.K. Duan",
        "J.H. Fan",
        "Y.Z. Fan",
        "J. Fang",
        "J.H. Fang",
        "K. Fang",
        "C.F. Feng",
        "H. Feng",
        "L. Feng",
        "S.H. Feng",
        "X.T. Feng",
        "Y. Feng",
        "Y.L. Feng",
        "S. Gabici",
        "B. Gao",
        "C.D. Gao",
        "Q. Gao",
        "W. Gao",
        "W.K. Gao",
        "M.M. Ge",
        "T.T. Ge",
        "L.S. Geng",
        "G. Giacinti",
        "G.H. Gong",
        "Q.B. Gou",
        "M.H. Gu",
        "F.L. Guo",
        "J. Guo",
        "X.L. Guo",
        "Y.Q. Guo",
        "Y.Y. Guo",
        "Y.A. Han",
        "O.A. Hannuksela",
        "M. Hasan",
        "H.H. He",
        "H.N. He",
        "J.Y. He",
        "X.Y. He",
        "Y. He",
        "S. Hernández-Cadena",
        "B.W. Hou",
        "C. Hou",
        "X. Hou",
        "H.B. Hu",
        "S.C. Hu",
        "C. Huang",
        "D.H. Huang",
        "J.J. Huang",
        "T.Q. Huang",
        "W.J. Huang",
        "X.T. Huang",
        "X.Y. Huang",
        "Y. Huang",
        "Y.Y. Huang",
        "X.L. Ji",
        "H.Y. Jia",
        "K. Jia"
      ],
      "abstract": "Evidence of cosmic-ray acceleration up to sub-PeV energies in the supernova remnant IC 443 Zhen Cao, F. Aharonian, Y.X. Bai, Y.W. Bao, D. Bastieri, X.J. Bi, Y.J. Bi, W. Bian, A.V. Bukevich, C.M. Cai, W.Y. Cao, Zhe Cao, J. Chang, J.F. Chang, A.M. Chen, E.S. Chen, G.H. Chen, H.X. Chen, Liang Chen, Long Chen, M.J. Chen, M.L. Chen, Q.H. Chen, S. Chen, S.H. Chen, S.Z. Chen, T.L. Chen, X.B. Chen, X.J. Chen, Y. Chen, N. Cheng, Y.D. Cheng, M.C. Chu, M.Y. Cui, S.W. Cui, X.H. Cui, Y.D. Cui, B.Z. Dai, H.L. Dai, Z.G. Dai, Danzengluobu, Y.X. Diao, X.Q. Dong, K.K. Duan, J.H. Fan, Y.Z. Fan, J. Fang, J.H. Fang, K. Fang, C.F. Feng, H. Feng, L. Feng, S.H. Feng, X.T. Feng, Y. Feng, Y.L. Feng, S. Gabici, B. Gao, C.D. Gao, Q. Gao, W. Gao, W.K. Gao, M.M. Ge, T.T. Ge, L.S. Geng, G. Giacinti, G.H. Gong, Q.B. Gou, M.H. Gu, F.L. Guo, J. Guo, X.L. Guo, Y.Q. Guo, Y.Y. Guo, Y.A. Han, O.A. Hannuksela, M. Hasan, H.H. He, H.N. He, J.Y. He, X.Y. He, Y. He, S. Hernández-Cadena, B.W. Hou, C. Hou, X. Hou, H.B. Hu, S.C. Hu, C. Huang, D.H. Huang, J.J. Huang, T.Q. Huang, W.J. Huang, X.T. Huang, X.Y. Huang, Y. Huang, Y.Y. Huang, X.L. Ji, H.Y. Jia, K. Jia High Energy Astrophysical Phenomena (astro-ph.HE) Supernova remnants (SNRs) have been considered as the primary contributors to cosmic rays (CRs) in our Galaxy. However, the maximum energy of particles that can be accelerated by shocks of SNRs is uncertain observationally and theoretically, and the role of contribution to CRs around PeV energies by SNRs is unclear. In this study, we present observations of high-energy $\\gamma$-ray emission from the SNR IC 443 using the Large High Altitude Air Shower Observatory (LHAASO). The morphological analysis reveals a pointlike source whose location and spectrum are consistent with those of the Fermi-LAT-detected compact source with $\\pi^0$-decay signature, and a more extended source which is consistent with a newly discovered source, previously unrecognized by Fermi-LAT. The spectrum of the point source can be described by a power-law function with an index of $\\sim3.0$, extending beyond $\\sim 30$ TeV without apparent cutoff. Assuming a hadronic origin of the $\\gamma$-ray emission, the $95\\%$ lower limit of accelerated protons reaches about 300 TeV. The extended source might be coincident with IC 443, SNR G189.6+3.3 or the putative pulsar wind nebula CXOU J061705.3+222127, and can be explained by either a hadronic or leptonic model. The LHAASO results provide compelling evidence that CR protons up to sub-PeV energies can be accelerated by the SNR.",
      "pdf_url": "https://arxiv.org/pdf/2510.26112.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26152",
      "title": "Direct Numerical Simulations of Oxygen-Flame-Driven Deflagration-to-Detonation Transition in Type Ia Supernovae",
      "authors": [
        "Xiaoyu Zhang",
        "Lile Wang",
        "Yang Gao",
        "Yao Zhou"
      ],
      "abstract": "Direct Numerical Simulations of Oxygen-Flame-Driven Deflagration-to-Detonation Transition in Type Ia Supernovae Xiaoyu Zhang, Lile Wang, Yang Gao, Yao Zhou High Energy Astrophysical Phenomena (astro-ph.HE) We present direct numerical simulations demonstrating deflagration-to-detonation transition (DDT) driven by oxygen flames in Type Ia supernova progenitors. Using the Castro hydrodynamics code coupled with the ``aprox13'' 13-isotope nuclear network, we simulate combustion in isolated fuel regions where oxygen flames trail carbon flames. In a fiducial one-dimensional run at $\\rho_{0}=3.5\\times10^{7}\\ \\mathrm{g\\ cm^{-3}}$ we observe spontaneous DDT of the oxygen flame via the Zel'dovich gradient mechanism when the carbon-oxygen separation reaches $\\sim 10\\ \\mathrm{km}$. The oxygen detonation then captures the carbon flame and triggers a stable carbon detonation. Systematic one-dimensional parameter scans show that successful carbon DDT requires upstream densities in the range $(3.1$--$3.6)\\times10^{7}\\ \\mathrm{g\\ cm^{-3}}$ and a minimum carbon-flame thickness of $\\gtrsim 20\\ \\mathrm{m}$. Two-dimensional simulations confirm DDT and demonstrate that the multidimensional cellular structure of the oxygen detonation can promote carbon detonation at somewhat lower densities than in one dimension. These results provide direct numerical evidence that oxygen-flame-driven DDT is physically plausible in turbulent white-dwarf environments and underscore the importance of multidimensional effects for Type Ia supernova explosion modeling.",
      "pdf_url": "https://arxiv.org/pdf/2510.26152.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26209",
      "title": "Multi-Faceted Emission Properties of PSR J2129+4119 Observed with FAST",
      "authors": [
        "Habtamu Menberu Tedila",
        "Di Li",
        "Pei Wang",
        "Rai Yuen",
        "Ziwei Wu",
        "Shijun Dang",
        "Jianping Yuan",
        "Na Wang",
        "Marilyn Cruces",
        "Jun Shuo Zhang",
        "Juntao Bai",
        "De Zhao",
        "FAST Collaboration"
      ],
      "abstract": "Multi-Faceted Emission Properties of PSR J2129+4119 Observed with FAST Habtamu Menberu Tedila, Di Li, Pei Wang, Rai Yuen, Ziwei Wu, Shijun Dang, Jianping Yuan, Na Wang, Marilyn Cruces, Jun Shuo Zhang, Juntao Bai, De Zhao, FAST Collaboration 22 pages, 18 figures, Revised for ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present a detailed single-pulse study of the long-period pulsar PSR J2129+4119 using high-sensitivity FAST observations. Despite locating well below the traditional death line, the pulsar exhibits sustained and multi-modal emission behavior, including nulls, weak pulses, regular emission, and occasional bright pulses. The nulling fraction is measured to be $8.13\\% \\pm 0.51\\%$, with null durations typically under four pulse periods. Fluctuation spectral analysis reveals both phase-modulated subpulse drifting and intermittent beat-like modulation. At the same time, polarization profiles show high linear polarization and stable polarization position angle (PPA) swings consistent with a near-tangential sightline geometry. Quasi-periodic microstructures are detected in 11.54\\% of regular pulses, with a mean periodicity and width of 4.57 ms and 4.30 ms, respectively. A well-defined scintillation arc in the secondary spectrum confirms the presence of a localized scattering screen. These results indicate that PSR J2129+4119 remains magnetospherically active and coherently emitting despite its low energy loss rate, offering key insights into pulsar emission physics near the death line.",
      "pdf_url": "https://arxiv.org/pdf/2510.26209.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26554",
      "title": "The $N_H$ Distribution of Hard X-ray Selected AGN in the NEP Field",
      "authors": [
        "Samantha Creech",
        "Francesca Civano",
        "Daniel R. Wik",
        "Ross Silver",
        "Xiurui Zhao",
        "Rafael Ortiz III",
        "Tonima Ananna",
        "Normal A. Grogin",
        "Rolf Jansen",
        "Anton M. Koekemoer",
        "Christopher N.A. Willmer",
        "Rogier A. Windhorst"
      ],
      "abstract": "The $N_H$ Distribution of Hard X-ray Selected AGN in the NEP Field Samantha Creech, Francesca Civano, Daniel R. Wik, Ross Silver, Xiurui Zhao, Rafael Ortiz III, Tonima Ananna, Normal A. Grogin, Rolf Jansen, Anton M. Koekemoer, Christopher N.A. Willmer, Rogier A. Windhorst High Energy Astrophysical Phenomena (astro-ph.HE) X-ray surveys are one of the most unbiased methods for detecting Compton Thick (CT; $N_{\\mathrm{H}} \\geq 10^{24}$ cm$^{-2}$) AGN, which are thought to comprise up to $60\\%$ of AGN within $z \\lesssim 1.0$. These CT AGN are often difficult to detect with current instruments, but the X-ray data within the JWST-North Ecliptic Pole (NEP) Time Domain Field (TDF) present a unique opportunity to study faint and obscured AGN. The NEP contains the deepest NuSTAR survey to date, and Zhao et al. (2024) detected 60 hard X-ray sources from the combined exposure of NuSTAR's Cycle 5 and 6 observations. In this work, we utilize the NuSTAR Cycle 5+6+8+9 data and simultaneous XMM-Newton observations in order to perform the first spectroscopic analysis of the 60-source catalog. We present this analysis and measure the $N_{\\mathrm{H}}$ distribution of the sample. We measure an observed CT fraction of $0.13_{-0.04}^{+0.15}$ down to an observed $8-24$ keV flux of $6.0 \\times 10^{-14}$ erg/s/cm$^{2}$, and we correct our analysis for absorption bias to estimate an underlying CT fraction of $0.32_{-0.08}^{+0.23}$. The derived obscuration distribution and CT fraction are consistent with population synthesis models and previous surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.26554.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26561",
      "title": "A Star's Death by a Thousand Cuts: The Runaway Periodic Eruptions of AT2023uqm",
      "authors": [
        "Yibo Wang",
        "Tingui Wang",
        "Shifeng Huang",
        "Jiazheng Zhu",
        "Ning Jiang",
        "Wenbin Lu",
        "Rongfeng Shen",
        "Shiyan Zhong",
        "Dong Lai",
        "Yi Yang",
        "Xinwen Shu",
        "Tianyu Xia",
        "Di Luo",
        "Jianwei Lyu",
        "Thomas Brink",
        "Alex Filippenko",
        "Weikang Zheng",
        "Minxuan Cai",
        "Zelin Xu",
        "Mingxin Wu",
        "Xiaer Zhang",
        "Weiyu Wu",
        "Lulu Fan",
        "Ji-an Jiang Xu Kong",
        "Bin Li",
        "Feng Lin",
        "Ming Liang",
        "Wentao Luo",
        "Jinlong Tang",
        "Zhen Wan",
        "Hairen Wang",
        "Jian Wang",
        "Yongquan Xue",
        "Dazhi Yao",
        "Hongfei Zhang",
        "Wen Zhao",
        "Xianzhong Zheng",
        "Qingfeng Zhu",
        "Yingxi Zuo"
      ],
      "abstract": "A Star's Death by a Thousand Cuts: The Runaway Periodic Eruptions of AT2023uqm Yibo Wang, Tingui Wang, Shifeng Huang, Jiazheng Zhu, Ning Jiang, Wenbin Lu, Rongfeng Shen, Shiyan Zhong, Dong Lai, Yi Yang, Xinwen Shu, Tianyu Xia, Di Luo, Jianwei Lyu, Thomas Brink, Alex Filippenko, Weikang Zheng, Minxuan Cai, Zelin Xu, Mingxin Wu, Xiaer Zhang, Weiyu Wu, Lulu Fan, Ji-an Jiang Xu Kong, Bin Li, Feng Lin, Ming Liang, Wentao Luo, Jinlong Tang, Zhen Wan, Hairen Wang, Jian Wang, Yongquan Xue, Dazhi Yao, Hongfei Zhang, Wen Zhao, Xianzhong Zheng, Qingfeng Zhu, Yingxi Zuo Submitted. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) Stars on bound orbits around a supermassive black hole may undergo repeated partial tidal disruption events (rpTDEs), producing periodic flares. While several candidates have been suggested, definitive confirmation of these events remains elusive. We report the discovery of AT2023uqm, a nuclear transient that has exhibited at least five periodic optical flares, making it only the second confirmed case of periodicity after ASASSN-14ko. Uniquely, the flares from AT2023uqm show a nearly exponential increase in energy--a \"runaway\" phenomenon signaling the star's progressive destruction. This behavior is consistent with rpTDEs of low-mass, main-sequence stars or evolved giant stars. Multiwavelength observations and spectroscopic analysis of the two most recent flares reinforce its interpretation as an rpTDE. Intriguingly, each flare displays a similar double-peaked structure, potentially originating from a double-peaked mass fallback rate or two discrete collisions per orbit. The extreme ratio of peak separation to orbital period draws attention to the possibility of a giant star being disrupted, which could be distinguished from a low-mass main-sequence star by its future mass-loss evolution. Our analysis demonstrates the power of rpTDEs to probe the properties of disrupted stars and the physical processes of tidal disruption, though it is currently limited by our knowledge of these events. AT2023uqm emerges as the most compelling rpTDE thus far, serving as a crucial framework for modeling and understanding these phenomena.",
      "pdf_url": "https://arxiv.org/pdf/2510.26561.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26594",
      "title": "The second data release of the Indian Pulsar Timing Array: Investigating the Effect of Coronal Mass Ejection on PSR J1022+1001 and a Possible Mode Change of PSR J2145-0750",
      "authors": [
        "Shaswata Chowdhury",
        "M. A. Krishnakumar",
        "Manjari Bagchi",
        "Bhal Chandra Joshi",
        "Nobleson K.",
        "Jibin Jose",
        "Shantanu Desai",
        "Manpreet Singh",
        "Vaishnavi Vyasraj",
        "Kuldeep Meena",
        "Amarnath",
        "Manoneeta Chakraborty",
        "Shubham Kala",
        "Debabrata Deb",
        "Zenia Zuraiq",
        "Arul Pandian B",
        "Neelam Dhanda Batra",
        "Churchil Dwivedi",
        "Sushovan Mondal",
        "Avinash Kumar Paladi",
        "Kaustubh Rai",
        "Abhimanyu Susobhanan",
        "Adya Shukla",
        "Aman Srivastava",
        "Mayuresh Surnis",
        "Hemanga Tahbildar",
        "Keitaro Takahashi",
        "Pratik Tarafdar",
        "Prabu Thiagaraj",
        "Kunjal Vara"
      ],
      "abstract": "The second data release of the Indian Pulsar Timing Array: Investigating the Effect of Coronal Mass Ejection on PSR J1022+1001 and a Possible Mode Change of PSR J2145-0750 Shaswata Chowdhury, M. A. Krishnakumar, Manjari Bagchi, Bhal Chandra Joshi, Nobleson K., Jibin Jose, Shantanu Desai, Manpreet Singh, Vaishnavi Vyasraj, Kuldeep Meena, Amarnath, Manoneeta Chakraborty, Shubham Kala, Debabrata Deb, Zenia Zuraiq, Arul Pandian B, Neelam Dhanda Batra, Churchil Dwivedi, Sushovan Mondal, Avinash Kumar Paladi, Kaustubh Rai, Abhimanyu Susobhanan, Adya Shukla, Aman Srivastava, Mayuresh Surnis, Hemanga Tahbildar, Keitaro Takahashi, Pratik Tarafdar, Prabu Thiagaraj, Kunjal Vara High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The Indian Pulsar Timing Array (InPTA) has recently published its second data release (DR2), comprising the timing analysis of seven years of data on 27 millisecond pulsars (MSPs), observed simultaneously in the 300-500 MHz (band 3) and 1260-1460 MHz (band 5), using the upgraded Giant Metrewave Radio Telescope (uGMRT). The low-frequency data, particularly in band 3, is highly sensitive to propagation effects such as dispersion measure (DM) fluctuations, which can be imprints of some astrophysical phenomena (scientific outliers). Here, we analyze the two outliers of possible astrophysical origin coming from the band 3 DM time series of two pulsars: PSR J1022+1001, with an ecliptic latitude of -0.06 degree , and PSR J2145-0750, one of the brightest MSPs, with multi-component profile morphology. Our study reveals compelling evidence for a coronal mass ejection (CME) event traced in the data of PSR J1022+1001, and reports evidence for a potential mode-changing event in PSR J2145-0750. Extending the analyses presented here to the full sample of InPTA-DR2 pulsars is expected to reveal additional CME events, and possible mode-changing events. Such detections will not only improve our understanding of solar and pulsar magnetospheric plasma interactions but will also enable more accurate modelling of DM variations, leading to improved pulsar timing solutions, which are crucial for high-precision Pulsar Timing Array (PTA) science.",
      "pdf_url": "https://arxiv.org/pdf/2510.26594.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26663",
      "title": "Tidal disruption events with SPH-EXA: resolving the return of the stream",
      "authors": [
        "Noah Kubli",
        "Alessia Franchini",
        "Eric R. Coughlin",
        "C. J. Nixon",
        "Sebastian Keller",
        "Pedro R. Capelo",
        "Lucio Mayer"
      ],
      "abstract": "Tidal disruption events with SPH-EXA: resolving the return of the stream Noah Kubli, Alessia Franchini, Eric R. Coughlin, C. J. Nixon, Sebastian Keller, Pedro R. Capelo, Lucio Mayer 10 pages, 4 figures, submitted to ApJL High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) In a tidal disruption event (TDE), a star is disrupted by the tidal field of a massive black hole, creating a debris stream that returns to the black hole, forms an accretion flow, and powers a luminous flare. Over the last few decades, several numerical studies have concluded that shock-induced dissipation occurs as the stream returns to pericentre (i.e., pre-self-intersection), resulting in efficient circularisation of the debris. However, the efficacy of these shocks is the subject of intense debate. We present high-resolution simulations (up to 10^10 particles) of the disruption of a solar-like star by a 10^6M_sun black hole with the new, GPU-based, smoothed-particle hydrodynamics code SPH-EXA, including the relativistic apsidal precession of the stellar debris orbits; our simulations run from initial disruption to the moment of stream self-intersection. With 10^8 particles - corresponding to the highest-resolution SPH simulations of TDEs in the pre-existing literature - we find significant, in-plane spreading of the debris as the stream returns through pericenter, in line with previous works that suggested this is a significant source of dissipation and luminous emission. However, with increasing resolution this effect is dramatically diminished, and with 10^10 particles there is effectively no change between the incoming and the outgoing stream widths. Our results demonstrate that the paradigm of significant dissipation of kinetic energy during pericentre passage is incorrect, and instead it is likely that debris circularisation is mediated by the originally proposed, stream-stream collision scenario.",
      "pdf_url": "https://arxiv.org/pdf/2510.26663.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26666",
      "title": "The 2024 July 16 Solar Event: A Challenge To The Coronal Mass Ejection Origin Of Long-Duration Gamma-Ray Flares",
      "authors": [
        "Alessandro Bruno",
        "Melissa Pesce-Rollins",
        "Silvia Dalla",
        "Nicola Omodei",
        "Ian G. Richardson",
        "James M. Ryan"
      ],
      "abstract": "The 2024 July 16 Solar Event: A Challenge To The Coronal Mass Ejection Origin Of Long-Duration Gamma-Ray Flares Alessandro Bruno, Melissa Pesce-Rollins, Silvia Dalla, Nicola Omodei, Ian G. Richardson, James M. Ryan Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We present a multi-spacecraft analysis of the 2024 July 16 Long-Duration Gamma-Ray Flare (LDGRF) detected by the Large Area Telescope on the Fermi satellite. The measured >100 MeV $\\gamma$-ray emission persisted for over seven hours after the flare impulsive phase, and was characterized by photon energies exceeding 1 GeV and a remarkably-hard parent-proton spectrum. In contrast, the phenomena related to the coronal mass ejection (CME)-driven shock linked to this eruption were modest, suggesting an inefficient proton acceleration unlikely to achieve the energies well-above the 300 MeV pion-production threshold to account for the observed $\\gamma$-ray emission. Specifically, the CME was relatively slow (~600 km/s) and the accompanying interplanetary type-II/III radio bursts were faint and short-duration, unlike those typically detected during large events. In particular, the type-II emission did not extend to kHz frequencies and disappeared ~5.5 hours prior to the LDGRF end time. Furthermore, the associated solar energetic particle (SEP) event was very weak, short-duration, and limited to a few tens of MeV, even at magnetically well-connected spacecraft. These findings demonstrate that a very-fast CME resulting in a high-energy SEP event is not a necessary condition for the occurrence of LDGRFs, challenging the idea that the high-energy $\\gamma$-ray emission is produced by the back-precipitation of shock-accelerated ions into the solar surface. The alternative origin scenario based on local particle trapping and acceleration in large-scale coronal loops is instead favored by the observation of giant arch-like structures of hot plasma over the source region persisting for the entire duration of this LDGRF.",
      "pdf_url": "https://arxiv.org/pdf/2510.26666.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26774",
      "title": "Compact Accretion Disks in the Aftermath of Tidal Disruption Events: Parameter Inference from Joint X-ray Spectra and UV/Optical Photometry Fitting",
      "authors": [
        "M. Guolo",
        "A. Mummery",
        "S. van Velzen",
        "S. Gezari",
        "M. Nicholl",
        "Y. Yao",
        "M. Karmen",
        "Y. Ajay",
        "T. Wevers",
        "N. LeBaron",
        "R. Chornock"
      ],
      "abstract": "Compact Accretion Disks in the Aftermath of Tidal Disruption Events: Parameter Inference from Joint X-ray Spectra and UV/Optical Photometry Fitting M. Guolo, A. Mummery, S. van Velzen, S. Gezari, M. Nicholl, Y. Yao, M. Karmen, Y. Ajay, T. Wevers, N. LeBaron, R. Chornock High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We present a multi-wavelength analysis of 14 tidal disruption events (TDEs)-including an off-nuclear event associated with an ultra-compact dwarf galaxy-selected for having available thermal X-ray spectra during their late-time UV/optical plateau phase. We show that at these stages, the full spectral energy distribution - X-ray spectra and UV/optical photometry - is well described by a compact, yet standard accretion disk, the same disk which powers the X-rays at all times. By fitting up to three three epochs per source with a fully relativistic disk model, we show that many system properties can be reliably recovered, including importantly the black hole mass ($M_{\\bullet}$). These accretion-based $M_{\\bullet}$ values, which in this sample span nearly three orders of magnitude, are consistent with galactic scaling relations but are significantly more precise (68\\% credible interval $ < \\pm 0.3$ dex) and physically motivated. Expected accretion scaling relations (e.g., $L_{Bol}^{ disk} / L_{Edd} \\propto T_p^4 \\propto M_{\\bullet}^{-1}$), TDE-specific physics correlations ($L_{plat} \\propto M_{\\bullet}^{2/3}$ and $R_{out}/r_g \\propto M_{\\bullet}^{-2/3}$) and black hole-host galaxy correlations ($M_{\\bullet}$-$M_{\\star}$ and $M_{\\bullet}$-$\\sigma_{\\star}$) naturally emerge from the data and, for the first time, are self-consistently extended into the intermediate-mass (IMBH, $M_{\\bullet} < 10^{5}$) regime. We discuss the implications of these results for TDE physics and modeling. We also review and discuss different methods for $M_{\\bullet}$ inference in TDEs, and find that approaches based on physical models of the early-time UV/optical emission are not able to recover (at a statistically significant level) black hole-host galaxy scalings.",
      "pdf_url": "https://arxiv.org/pdf/2510.26774.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25833",
      "title": "Exploring the quasar disc-wind-jet connection with LoTSS and SDSS",
      "authors": [
        "Charlotte L. Jackson",
        "James H. Matthews",
        "Imogen H. Whittam",
        "Matt J. Jarvis",
        "Matthew J. Temple",
        "Amy L. Rankine",
        "Paul C. Hewett"
      ],
      "abstract": "Exploring the quasar disc-wind-jet connection with LoTSS and SDSS Charlotte L. Jackson, James H. Matthews, Imogen H. Whittam, Matt J. Jarvis, Matthew J. Temple, Amy L. Rankine, Paul C. Hewett 15 pages, 11 figures, plus appendix Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the relationship between disc winds, radio jets, accretion rates and black hole masses of a sample of $\\sim$100k quasars at z $\\approx$ 2. Combining spectra from the 17th data release of the Sloan Digital Sky Survey (SDSS) with radio fluxes from the 2nd data release of the Low Frequency ARray (LOFAR) Two-Meter Sky Survey (LoTSS), we statistically characterise a radio loud and radio quiet population using a two-component Gaussian Mixture model, and perform population matching in black hole mass and Eddington fraction. We determine how the fraction of radio loud sources changes across this parameter space, finding that jets are most efficiently produced in quasars with either a very massive central black hole ($M_{\\textrm{BH}} > 10^9 \\textrm{M}_{\\odot}$) or one that is rapidly accreting ($\\lambda_{\\textrm{Edd}}>0.3$). We also show that there are differences in the blueshift of the CIV $\\lambda$1549Å line and the equivalent width of the HeII $\\lambda$1640Å line in radio loud and radio quiet quasars that persist even after accounting for differences in the mass and accretion rate of the central black hole. Generally, we find an anti-correlation between the inferred presence of disc winds and jets, which we suggest is mediated by differences in the quasars' spectral energy distributions. The latter result is shown through the close coupling between tracers of wind kinematics and the ionising flux -- which holds for both radio loud and radio quiet sources, despite differences between their emission line properties -- and is hinted at by a different Baldwin effect in the two populations.",
      "pdf_url": "https://arxiv.org/pdf/2510.25833.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26316",
      "title": "Generative Artificial Intelligence for Air Shower Simulation",
      "authors": [
        "C. Bozza",
        "A. Calivà",
        "A. De Caro",
        "D. De Gruttola",
        "S. De Pasquale",
        "L.A. Fusco",
        "G. Messuti",
        "C. Poirè",
        "S. Scarpetta",
        "T. Virgili"
      ],
      "abstract": "Generative Artificial Intelligence for Air Shower Simulation C. Bozza, A. Calivà, A. De Caro, D. De Gruttola, S. De Pasquale, L.A. Fusco, G. Messuti, C. Poirè, S. Scarpetta, T. Virgili Computational Physics (physics.comp-ph); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) The detailed simulation of extensive air showers, produced by primary cosmic rays interacting in the atmosphere, is a task that is traditionally undertaken by means of Monte Carlo methods. These processes are computationally intensive, accounting for a major fraction of the computational resources used in the large-scale simulations required by current and future experiments in the field of astroparticle physics. In this work, we present a novel approach based on Generative Adversarial Networks (GANs) to accelerate air shower simulations. We developed and trained a GAN on a dataset of high-energy proton-induced air showers generated with \\texttt{CORSIKA}; our model reproduces key distributions of secondary particles, such as energy spectra and spatial distributions at ground level of muons. Once the model has been trained, which takes approximately 74 hours, the generation real time per shower is reduced by a factor of $10^4$ with respect to the full \\texttt{CORSIKA} simulation, leading to a substantial decrease in both computational time and energy consumption.",
      "pdf_url": "https://arxiv.org/pdf/2510.26316.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26436",
      "title": "Optimizing Long-term Variability of AGN Light Curves. I. A Case Study with ZTF Observations in the EGS Field",
      "authors": [
        "Jiaqi Lin",
        "Zhen-Ya Zheng",
        "Bin Ma",
        "Lin Long",
        "Yangfan Xie",
        "Pu Lin",
        "Ruqiu Lin",
        "Xiang Ji"
      ],
      "abstract": "Optimizing Long-term Variability of AGN Light Curves. I. A Case Study with ZTF Observations in the EGS Field Jiaqi Lin, Zhen-Ya Zheng, Bin Ma, Lin Long, Yangfan Xie, Pu Lin, Ruqiu Lin, Xiang Ji Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Optical variability is a key observational probe for studying the accretion dynamics and central engine physics of Active Galactic Nuclei (AGNs). The quality and completeness of light curves have a direct impact on variability studies, particularly for faint AGNs and high-redshift AGNs. To improve the quality of long-term light curves for AGNs, we bin and stack multi-epoch images balancing the image depths and temporal resolution. As a case study, we apply this method to Zwicky Transient Facility (ZTF) observations in the Extended Groth Strip (EGS) field, where the overlapping region covers an area of about 370 arcmin$^2$ and includes $g$-band and $r$-band data taken from March 2018 to December 2024. The co-added images are approximately 2.0 to 2.5 magnitudes deeper than the ZTF single-epoch images. With co-added images, we construct light curves for 73 AGNs in the EGS field. Compared to the traditional ZTF light curves, our light curves maintain consistent long-term variability trends but with higher photometric precision. Furthermore, this method can help detect AGNs with weak variability which are missed from the traditional ZTF data due to the noisy light curves or below the detection limit in ZTF's single-epoch exposure. Among the 73 AGNs, the majority exhibit a bluer-when-brighter (BWB) trend on long-term timescales, which is consistent with previous studies. This work offers insights for optimizing AGN light curves in both current and upcoming all-sky time-domain surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.26436.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.15502",
      "title": "The role of equation of state on the spin-up of millisecond pulsars",
      "authors": [
        "Xinyi Zhong",
        "Xiaoyu Lai"
      ],
      "abstract": "The role of equation of state on the spin-up of millisecond pulsars Xinyi Zhong, Xiaoyu Lai High Energy Astrophysical Phenomena (astro-ph.HE) Millisecond pulsars (MSPs) are recycled pulsars which have been spun-up due to mass accretion during the phase of mass exchange in binaries. Although the interactions with companion stars play important roles on the spin-up process, the global properties of pulsars determined by the equation of state (EoS), such as mass, radius and the moment of inertia, should also play a role. We investigate the spin-up of MSPs in neutron star (NS) and strangeon star (SS) models, both of which have passed the tests by the existence of high-mass pulsars and the tidal deformability of GW~170817. Combining the spin-up condition and the transferred angular momentum, and taking into account the evolution of magnetic field strength during accretion, we can constrain the spin-period and mass of an MSP. Our results show that the impeding effect of magnetic field on the spin-up of MSPs would be more significant for NSs than for SSs, especially for the ones with low masses. In the low-mass ($M$ below or around about $1.2 M_\\odot$) case, an SS can spin faster than an NS of the same mass by accreting the same amount of mass. Finding more low-mass and fully recycled MSPs, with accurate mass-measurement and better constraints on the amount of accreted mass, could help to put more strict constraints on the EoS of pulsars.",
      "pdf_url": "https://arxiv.org/pdf/2501.15502.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.11915",
      "title": "A Hyperactive FRB Pinpointed in an SMC-Like Satellite Host Galaxy",
      "authors": [
        "M. Bhardwaj",
        "M.P. Snelders",
        "J. W. T. Hessels",
        "A. Gil de Paz",
        "S. Bhandari",
        "B. Marcote",
        "A. Kirichenko",
        "O. S. Ould-Boukattine",
        "F. Kirsten",
        "E. K. Bempong-Manful",
        "V. Bezrukovs",
        "J. D. Bray",
        "S. Buttaccio",
        "A. Corongiu",
        "R. Feiler",
        "M. P. Gawronski",
        "M. Giroletti",
        "D. M. Hewitt",
        "M. Lindqvist",
        "G. Maccaferri",
        "A. Moroianu",
        "K. Nimmo",
        "Z. Paragi",
        "W. Puchalska",
        "N. Wang",
        "D. Williams-Baldwin",
        "J.P. Yuan"
      ],
      "abstract": "A Hyperactive FRB Pinpointed in an SMC-Like Satellite Host Galaxy M. Bhardwaj, M.P. Snelders, J. W. T. Hessels, A. Gil de Paz, S. Bhandari, B. Marcote, A. Kirichenko, O. S. Ould-Boukattine, F. Kirsten, E. K. Bempong-Manful, V. Bezrukovs, J. D. Bray, S. Buttaccio, A. Corongiu, R. Feiler, M. P. Gawronski, M. Giroletti, D. M. Hewitt, M. Lindqvist, G. Maccaferri, A. Moroianu, K. Nimmo, Z. Paragi, W. Puchalska, N. Wang, D. Williams-Baldwin, J.P. Yuan Published by ApJL. Contains extra GTC data compared to V1 High Energy Astrophysical Phenomena (astro-ph.HE) Precise localizations of fast radio bursts (FRBs) are essential for uncovering their host galaxies and immediate environments. We present the milliarcsecond-precision European VLBI Network localization of FRB 20240114A, a hyperactive repeating FRB, achieving <90x30 mas (1-sigma) accuracy. This precision places the burst 0.5 kpc from the nucleus of its low-metallicity star-forming dwarf host at a spectroscopic redshift of z = 0.130287. Our Gran Telescopio CANARIAS spectroscopic follow-up reveals that the dwarf FRB host is gravitationally bound to a more massive, star-forming spiral galaxy. This establishes the first known instance of an FRB residing in a satellite galaxy within a larger galactic system. This configuration, analogous to the Small Magellanic Cloud orbiting the Milky Way (but at a lower overall mass scale), expands the known diversity of FRB host environments and offers important insights for interpreting seemingly \"hostless\" or highly offset FRBs. Furthermore, our detailed dispersion measure (DM) budget analysis indicates that the dominant contribution to FRB 20240114A's DM likely originates from the foreground galaxy halos. This finding addresses the anomalously high DM observed for this FRB and underscores the significant role of intervening foreground structures in shaping observed FRB DMs, which is important for accurate FRB-based cosmological measurements. Our results highlight the importance of deep, high-resolution optical/infrared observations (e.g., with the Hubble or James Webb Space Telescopes) to fully leverage our precise radio localization and probe the immediate astrophysical birthplaces of FRB progenitors within these complex galactic systems.",
      "pdf_url": "https://arxiv.org/pdf/2506.11915.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.19071",
      "title": "A Late-time Radio Survey of Type Ia-CSM Supernovae with the Very Large Array",
      "authors": [
        "Olivia Griffith",
        "Grace Showerman",
        "Sumit K. Sarbadhicary",
        "Chelsea E. Harris",
        "Laura Chomiuk",
        "Jesper Sollerman",
        "Peter Lundqvist",
        "Javier Moldon",
        "Miguel Perez-Torres",
        "Erik C. Kool",
        "Takashi J. Moriya"
      ],
      "abstract": "A Late-time Radio Survey of Type Ia-CSM Supernovae with the Very Large Array Olivia Griffith, Grace Showerman, Sumit K. Sarbadhicary, Chelsea E. Harris, Laura Chomiuk, Jesper Sollerman, Peter Lundqvist, Javier Moldon, Miguel Perez-Torres, Erik C. Kool, Takashi J. Moriya 17 pages, 6 figures, 3 tables, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Type Ia-CSM supernovae (SNe) are a rare and peculiar subclass of thermonuclear SNe characterized by emission lines of hydrogen or helium, indicative of a high-density circumstellar medium (CSM). Their implied mass-loss rates of $\\sim 10^{-4}-10^{-1}$ M$_{\\odot}$ yr$^{-1}$ (assuming $\\mathrm{ \\sim 100 \\ km\\ s^{-1}}$ winds) from optical observations are generally in excess of values observed in realistic SN Ia progenitors. In this paper, we present an independent study of CSM densities around a sample of 29 archival Ia-CSM SNe using radio observations with the Very Large Array at 6 GHz. Motivated by the late ($\\sim$2 yr) radio detection of the Ia-CSM SN 2020eyj, we observed old ($>$1 yr) SNe where we are more likely to see the emergent synchrotron emission that may have been suppressed earlier by free-free absorption by the CSM. We do not detect radio emission down to 3$\\sigma$ limits of $\\sim$35 $\\mu$Jy in our sample. The only radio-detected candidate in our sample, SN 2022esa, was likely mis-classified as a Ia-CSM with early spectra, and appears more consistent with a peculiar Ic based on later-epochs. Assuming a wind-like CSM with temperatures between $2 \\times 10^4$ K and $10^5$ K, and magnetic field-to-shock energy fraction ($\\epsilon_B$) = $0.01-0.1$, the radio upper limits rule out mass-loss rates between $\\sim 10^{-4}-10^{-2}$ M$_{\\odot}$ yr$^{-1}$ (100 km s$^{-1}$)$^{-1}$. This is somewhat in tension with the estimates from optical observations, and may indicate that more complex CSM geometries and/or lower values of $\\epsilon_B$ may be present.",
      "pdf_url": "https://arxiv.org/pdf/2506.19071.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.09632",
      "title": "Application of interpretable data-driven methods for the reconstruction of supernova neutrino energy spectra following fast neutrino flavor conversions",
      "authors": [
        "Haihao Shi",
        "Zhenyang Huang",
        "Qiyu Yan",
        "Junda Zhou",
        "Guoliang Lü",
        "Xuefei Chen"
      ],
      "abstract": "Application of interpretable data-driven methods for the reconstruction of supernova neutrino energy spectra following fast neutrino flavor conversions Haihao Shi, Zhenyang Huang, Qiyu Yan, Junda Zhou, Guoliang Lü, Xuefei Chen High Energy Astrophysical Phenomena (astro-ph.HE) Neutrinos can experience fast flavor conversions (FFCs) in highly dense astrophysical environments, such as core-collapse supernovae and neutron star mergers, potentially affecting energy transport and other processes. The simulation of fast flavor conversions under realistic astrophysical conditions requires substantial computational resources and involves significant analytical challenges. While machine learning methods like Multilayer Perceptrons have been used to accurately predict the asymptotic outcomes of FFCs, their 'black-box' nature limits the extraction of direct physical insight. To address this limitation, we employ two distinct interpretable machine learning frameworks-Kolmogorov-Arnold Networks (KANs) and Sparse Identification of Nonlinear Dynamics (SINDy)-to derive physically insightful models from a FFC simulation dataset. Our analysis reveals a fundamental trade-off between predictive accuracy and model simplicity. The KANs demonstrates high fidelity in reconstructing post-conversion neutrino energy spectra, achieving accuracies of up to $90\\%$. In contrast, SINDy uncovers a remarkably concise, low-rank set of governing equations, offering maximum interpretability but with lower predictive accuracy. Critically, by analyzing the interpretable model, we identify the number density of heavy-lepton neutrinos as the most dominant factor in the system's evolution. Ultimately, this work provides a methodological framework for interpretable machine learning that supports genuine data-driven physical discovery in astronomy and astrophysics, going beyond prediction alone.",
      "pdf_url": "https://arxiv.org/pdf/2507.09632.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.01428",
      "title": "SN 2024gy: Multi-epoch Spectroscopic Features Suggestive of Delayed Detonation in a Type Ia Supernova",
      "authors": [
        "Liping Li",
        "Zhenyu Wang",
        "Jialian Liu",
        "Yu Pan",
        "Alexei V. Filippenko",
        "Jujia Zhang",
        "Xiaofeng Wang",
        "Brajesh Kumar",
        "Yi Yang",
        "Thomas G. Brink",
        "WeiKang Zheng",
        "Xiangcun Meng",
        "Lingzhi Wang",
        "Zeyi Zhao",
        "Qian Zhai",
        "Yongzhi Cai",
        "Giuliano Pignata",
        "Xinlei Chen",
        "Xingzhu Zou",
        "Jiewei Zhao",
        "Xiangkun Liu",
        "Xiaowei Liu",
        "Xinzhong Er",
        "A. Reguitti",
        "R. Michael Rich",
        "Jon M. Rees",
        "Mark A. Croom",
        "Osmin Caceres",
        "K. Itagaki",
        "Bo Wang",
        "Jinming Bai"
      ],
      "abstract": "SN 2024gy: Multi-epoch Spectroscopic Features Suggestive of Delayed Detonation in a Type Ia Supernova Liping Li, Zhenyu Wang, Jialian Liu, Yu Pan, Alexei V. Filippenko, Jujia Zhang, Xiaofeng Wang, Brajesh Kumar, Yi Yang, Thomas G. Brink, WeiKang Zheng, Xiangcun Meng, Lingzhi Wang, Zeyi Zhao, Qian Zhai, Yongzhi Cai, Giuliano Pignata, Xinlei Chen, Xingzhu Zou, Jiewei Zhao, Xiangkun Liu, Xiaowei Liu, Xinzhong Er, A. Reguitti, R. Michael Rich, Jon M. Rees, Mark A. Croom, Osmin Caceres, K. Itagaki, Bo Wang, Jinming Bai 23 pages, 11 figures, accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We present photometric and spectroscopic observations of SN 2024gy, a Type Ia supernova (SN Ia) exhibiting high-velocity features (HVFs) in its early-time spectra. This SN reaches a peak $B$-band magnitude of $-19.25 \\pm 0.29$ mag and subsequently declines by $\\Delta m_{15}(B) \\approx 1.12$ mag, consistent with the luminosity-width relation characteristic of normal SNe Ia. Based on the peak thermal luminosity of $(1.2 \\pm 0.3) \\times 10^{43}$ erg s$^{-1}$, we estimate that $0.57 \\pm 0.14~\\rm M_{\\odot}$ of $^{56}$Ni was synthesized during the explosion. Our dense early spectral monitoring revealed significant velocity disparities within the ejecta. Notably, absorption features from the Ca II near-infrared triplet were observed at velocities exceeding 25,000 km s$^{-1}$, while the Si II $\\lambda$6355 line velocity at the same epoch was significantly lower at $\\sim$ 16,000 km s$^{-1}$. This velocity disparity likely reflects distinct ionization states of intermediate-mass elements in the outermost layers. The prominent Ca II HVFs may originate from ionization suppression within the highest-velocity ejecta, potentially indicative of minimal hydrogen mixing in a delayed-detonation explosion scenario. Additionally, the Ni/Fe ratio derived from the nebular spectrum of SN 2024gy provides further support for this model.",
      "pdf_url": "https://arxiv.org/pdf/2508.01428.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.03637",
      "title": "The role of migration traps in the formation of binary black holes in AGN disks",
      "authors": [
        "Maria Paola Vaccaro",
        "Yannick Seif",
        "Michela Mapelli"
      ],
      "abstract": "The role of migration traps in the formation of binary black holes in AGN disks Maria Paola Vaccaro, Yannick Seif, Michela Mapelli High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Binary black holes (BBHs) forming in the accretion disks of active galactic nuclei (AGNs) represent a promising channel for gravitational-wave production. BBHs are often assumed to form at migration traps, i.e. radial locations where the Type I migration of embedded stellar-mass black holes (BHs) transitions from outwards to inwards. In this work, we test this assumption by explicitly simulating the radial migration of BH pairs in AGN disks under different torque prescriptions, including thermal effects and the switch to Type II migration. We map where and when binaries form as a function of supermassive BH (SMBH) mass, disk viscosity, and migrating BH mass. We find that, for SMBH masses below $10^8 M_\\odot$, the majority of pair-up events occur near migration traps ($\\gtrsim 80\\%$). In contrast, for higher SMBH masses, differential migration dominates and off-trap pair-ups can prevail. Certain disk configurations (e.g., $\\alpha = 0.01$, $M_\\bullet < 10^6 M_\\odot$) present a significant overdensity of pair-ups even in the absence of traps due to traffic-jam accumulations where the gamma profile changes slope sharply. We also investigate hierarchical BBH formation, showing that higher-generation pair-ups cluster more tightly around trap or traffic-jam radii. Our results provide realistic prescriptions for BBH pair-up locations and timescales, highlighting the limitations of assuming fixed BBH formation sites.",
      "pdf_url": "https://arxiv.org/pdf/2508.03637.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.08061",
      "title": "Acceleration of Heavy Ions at Non-Relativistic Collisionless Shocks",
      "authors": [
        "Damiano Caprioli",
        "Luca Orusa",
        "Miha Cernetic",
        "Colby C. Haggerty",
        "Bricker Ostler"
      ],
      "abstract": "Acceleration of Heavy Ions at Non-Relativistic Collisionless Shocks Damiano Caprioli, Luca Orusa, Miha Cernetic, Colby C. Haggerty, Bricker Ostler 6 pages, 3 figures. Few comments and clarifications added, results unchanged. Matches version published by APJL High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) We investigate the process of Diffusive Shock Acceleration (DSA) of particles with mass number to charge number ratios $A/Q > 1$, e.g., partially-ionized heavy ions. To this end, we introduce helium- and carbon-like ions at solar abundances into two-dimensional hybrid (kinetic ions-fluid electrons) simulations of non-relativistic collisionless shocks. This study yields three main results: 1) Heavy ions are preferentially accelerated compared to hydrogen. For typical solar abundances, the energy transferred to accelerated helium ions is comparable to, or even exceeds, that of hydrogen, thereby enhancing the overall shock acceleration efficiency. 2) Accelerated helium ions contribute to magnetic field amplification, which increases the maximum attainable particle energy and steepen the spectra of accelerated particles. 3) The efficient acceleration of helium significantly enhances the production of hadronic gamma rays and neutrinos, likely dominating the one due to hydrogen. These effects should be taken into account, especially when modeling strong space and astrophysical shocks.",
      "pdf_url": "https://arxiv.org/pdf/2509.08061.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25247",
      "title": "Evolution of accretion disc-corona in the TDE Candidate AT 2019avd",
      "authors": [
        "Haichao Xu",
        "Xinwu Cao",
        "Yanan Wang",
        "Andrzej A. Zdziarski"
      ],
      "abstract": "Evolution of accretion disc-corona in the TDE Candidate AT 2019avd Haichao Xu, Xinwu Cao, Yanan Wang, Andrzej A. Zdziarski High Energy Astrophysical Phenomena (astro-ph.HE) X-ray observations of the tidal disruption event (TDE) candidate AT 2019avd show drastic variabilities in flux and spectral shape over hundreds of days, providing clues on the accretion disc-corona evolution. We utilize a disc-corona model, in which a fraction of the gravitational energy released in the disc is transported into the hot corona above/below. Some soft photons emitted from the disc are upscattered to X-ray photons by the hot electrons in the optically thin corona. By fitting the NICER observations of AT 2019avd during epochs when the spectra exhibit significant hardening, we derive the evolution of the mass accretion rate, $\\dot{m}$, and the coronal energy fraction, $f$. Our results show that $f$ decreases with increasing $\\dot{m}$, which is qualitatively consistent with that observed in active galactic nuclei (AGNs), while the slope of this source, $f\\propto \\dot{m}^{-0.30}$, is much shallower than that of AGNs. We also find that the non-thermal X-ray spectrum in this source is significantly softer than those typically seen in AGNs and black-hole X-ray binaries. We argue that these quantitative differences can be a powerful diagnostic of the underlying magnetic turbulence, which may imply a stronger magnetic field within the TDE accretion disc than that in typical AGNs. It is also found that the evolution of the fitted neutral hydrogen column density follows a similar pattern to that of the accretion rate evolution, which may reflect the accumulation of absorbing material originating from the inflowing streams of stellar debris and/or other related sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.25247.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25579",
      "title": "Population of Binary Black Holes Inferred from One Hundred and Fifty Gravitational Wave Signals",
      "authors": [
        "Vaibhav Tiwari"
      ],
      "abstract": "Population of Binary Black Holes Inferred from One Hundred and Fifty Gravitational Wave Signals Vaibhav Tiwari High Energy Astrophysical Phenomena (astro-ph.HE) The LIGO-Virgo-KAGRA collaborations have reported gravitational wave signals from more than 150 binary black holes in the fourth catalog (GWTC-4). Here, we investigate the population properties of these binary black holes using the mixture-model framework Vamana. We present one-dimensional distributions of masses and spins, explore their correlations, and examine their evolution with redshift. These features may reflect astrophysical processes associated with binary black hole formation channels, although most remain poorly constrained. A notable feature is a peak near $10M_\\odot$ in the primary mass and $8M_\\odot$ in the chirp mass. Additionally, the primary and secondary masses correlate uniquely, producing pronounced peaks in the chirp mass around $14M_\\odot$ and $27M_\\odot$. The three peaks are roughly separated by a factor of two. A simple explanation for such well-placed peaks is a hierarchical merger scenario, in which the first peak arises from mergers of black holes of stellar origin, and higher-mass peaks arise from repeated mergers of black holes from lower-mass peaks. Although most binaries do not exhibit the high spins and characteristic mass ratios expected from hierarchical mergers, those that do are associated with the peaks observed in the chirp mass distribution.",
      "pdf_url": "https://arxiv.org/pdf/2510.25579.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.25830",
      "title": "Unveiling Extended Components of 'Little Red Dots' in Rest-Frame Optical",
      "authors": [
        "Yiyang Zhang",
        "Xuheng Ding",
        "Lilan Yang",
        "Erini Lambrides",
        "Hollis Akins",
        "Andrew J. Battisti",
        "Caitlin M. Casey",
        "Chang-hao Chen",
        "Isa Cox",
        "Andreas Faisst",
        "Maximilien Franco",
        "Aryana Haghjoo",
        "Luis C. Ho",
        "Kohei Inayoshi",
        "Shuowen Jin",
        "Mitchell Karmen",
        "Anton M. Koekemoer",
        "Jeyhan S. Kartaltepe",
        "Kai Liao",
        "Ghassem Gozaliasl",
        "Masafusa Onoue",
        "Vasily Kokorev",
        "Namrata Roy",
        "R. Michael Rich",
        "John D. Silverman",
        "Takumi S. Tanaka",
        "Bei You",
        "Hassen M. Yesuf",
        "Jorge A. Zavala"
      ],
      "abstract": "Unveiling Extended Components of 'Little Red Dots' in Rest-Frame Optical Yiyang Zhang, Xuheng Ding, Lilan Yang, Erini Lambrides, Hollis Akins, Andrew J. Battisti, Caitlin M. Casey, Chang-hao Chen, Isa Cox, Andreas Faisst, Maximilien Franco, Aryana Haghjoo, Luis C. Ho, Kohei Inayoshi, Shuowen Jin, Mitchell Karmen, Anton M. Koekemoer, Jeyhan S. Kartaltepe, Kai Liao, Ghassem Gozaliasl, Masafusa Onoue, Vasily Kokorev, Namrata Roy, R. Michael Rich, John D. Silverman, Takumi S. Tanaka, Bei You, Hassen M. Yesuf, Jorge A. Zavala 26 pages, 11 figures, submitted Astrophysics of Galaxies (astro-ph.GA) Recent JWST observations have revealed a population of red, compact, high-redshift objects called 'Little Red Dots'(LRD), whose host components have remained largely unconstrained, possibly due to their extreme compactness. Current morphological studies have been limited by small samples, as well as by insufficient imaging depth, which may not allow reliable separation between point-like and extended components, leaving the existence and properties of extended components in LRD largely unconstrained. Here, we perform the image stacking analysis of 217 LRDs in four NIRCam bands, representing the largest and homogeneous sample observed from COSMOS-Web survey to date. Our results reveal an unambiguous detection of faint extended emission in the F444W band, with a typical size of ~200 parsecs and magnitude of ~27.7 AB at z~6.5. We perform four-band photometric SED fitting based on galaxy templates and derive a stellar mass of 8.91+-~0.1 logM_sun. Given this stellar mass, the host galaxy is compact, i.e., ~2.5 times smaller than star-forming populations at similar mass, and the typical black hole mass of LRDs is elevated by ~1.5 dex above the local MBH-M* relation. This work provides direct observational evidence for the existence of LRD host galaxies and offers crucial insights into the growth of the host galaxy and the co-evolution of galaxies and their black holes within the first billion years after the Big Bang.",
      "pdf_url": "https://arxiv.org/pdf/2510.25830.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25831",
      "title": "Model-Independent Inference of Galaxy Star Formation Histories in the Local Volume",
      "authors": [
        "Robin Eappen",
        "Pavel Kroupa"
      ],
      "abstract": "Model-Independent Inference of Galaxy Star Formation Histories in the Local Volume Robin Eappen, Pavel Kroupa Astrophysics of Galaxies (astro-ph.GA) Understanding the diversity of star formation histories (SFHs) of galaxies is key to reconstructing their evolutionary paths. Traditional models often assume parametric forms such as delayed-tau or exponentially declining models, which may not reflect the actual variety of formation processes. We aim to assess what types of SFHs are consistent with the observed present-day star formation rates (${\\text{SFR}}_0$) and time-averaged star formation rates ($\\langle \\text{SFR} \\rangle$) of galaxies in the Local Volume, without assuming any fixed functional form. We construct a non-parametric framework by generating large ensembles of randomized SFHs for each galaxy in the sample. For each SFH, we compute its predicted stellar mass and present-day SFR and retain only those consistent with the observed values within a 20% tolerance. We then infer the statistical distribution of power-law slopes $\\eta$ (fitted as ${\\text{SFR}}(t) \\propto (t-t_{\\text{start}})^\\eta$) and 50% stellar mass formation times $t_{50}$. Both $\\eta$ and $t_{50}$ correlate strongly with the SFR ratio (Spearman $\\rho > 0.75$, $p \\ll 10^{-16}$), indicating that the shape and timing of star formation are primarily governed by this ratio. The $t_{50}$ distribution shows sharp spikes near 7.74 and 7.86 Gyr, which we attribute to grid discretization combined with filtering, rather than a physical bimodality. Our results confirm that strongly declining SFH templates are disfavored in the Local Volume: most systems are consistent with flat long-term SFHs, with only mild decline or occasional rising. Importantly, this is demonstrated through a fully model-independent, data-driven approach, with per-galaxy uncertainties quantified using the standard error of $\\eta$ and $t_{50}$ from the ensemble of accepted SFHs.",
      "pdf_url": "https://arxiv.org/pdf/2510.25831.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25844",
      "title": "Figuring Out Gas & Galaxies In Enzo (FOGGIE) XI: Circumgalactic O VI Emission Traces Clumpy Inflowing Recycled Gas",
      "authors": [
        "Cassandra Lochhaas",
        "Molly S. Peeples",
        "Brian W. O'Shea",
        "Jason Tumlinson",
        "Lauren Corlies",
        "Vida Saeedzadeh",
        "Nicolas Lehner",
        "Anna C. Wright",
        "Jessica K. Werk",
        "Cameron W. Trapp",
        "Ramona Augustin",
        "Ayan Acharyya",
        "Britton D. Smith"
      ],
      "abstract": "Figuring Out Gas & Galaxies In Enzo (FOGGIE) XI: Circumgalactic O VI Emission Traces Clumpy Inflowing Recycled Gas Cassandra Lochhaas, Molly S. Peeples, Brian W. O'Shea, Jason Tumlinson, Lauren Corlies, Vida Saeedzadeh, Nicolas Lehner, Anna C. Wright, Jessica K. Werk, Cameron W. Trapp, Ramona Augustin, Ayan Acharyya, Britton D. Smith 27 pages, 15 figures, submitted to ApJ. Comments welcome! Astrophysics of Galaxies (astro-ph.GA) The circumgalactic medium (CGM) is host to gas flows into and out of galaxies and regulates galaxy growth, but the multiphase, diffuse gas in this region is challenging to observe. We investigate the properties of gas giving rise to O VI emission from the CGM that upcoming missions, such as the Aspera SmallSat, will be able to map in local galaxies. We use the FOGGIE simulations to predict the O VI emission from edge-on galaxies across the redshift range $z=1\\rightarrow0$. O VI emission is brightest surrounding small, clumpy structures near the galaxy where the gas density is high. Most of the O VI surface brightness originates from collisionally ionized, $T\\sim10^{5.5}$ K, inflowing gas and is not preferentially aligned with the major or minor axis of the galaxy disk. Simulated galaxies with higher halo masses, higher median CGM gas density, and higher star formation rates produce brighter and more widespread O VI emission in their CGM. We show that while O VI emission primarily originates in inflowing gas, turning off outflows in a simulation without star formation feedback eliminates most of the O VI emission. Enrichment from feedback is necessary to mix with the inflowing gas and allow it to glow in O VI. Collectively, our findings point towards a picture where O VI emission traces warm, ionized envelopes of cooler clouds that are accreting onto the galaxy in a metal-enriched galactic fountain. Finally, we show that the detection limit of Aspera is sufficient to detect O VI emission tens of kpc from the galaxy center for $\\sim L^\\star$ galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.25844.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25848",
      "title": "Spiral Structure Diversity in Milky Way Analogs from TNG50: The Role of Gas and Disk Dynamics",
      "authors": [
        "Soumavo Ghosh",
        "Elena D'Onghia"
      ],
      "abstract": "Spiral Structure Diversity in Milky Way Analogs from TNG50: The Role of Gas and Disk Dynamics Soumavo Ghosh, Elena D'Onghia 17 pages, 12 figures (including appendices), comments are welcome Astrophysics of Galaxies (astro-ph.GA) The generation of spiral arms and the mechanisms controlling their properties within a realistic cosmological framework - the complete understanding is still beyond our grasp. Using a statistically significant sample of Milky Way- and Andromeda-like (MW/M31) analogs from the high-resolution TNG50 cosmological simulation, we carry out the first systematic investigation of spiral-arm formation, their observable properties, and the underlying physical drivers. The selected analogs predominantly exhibit two-armed ($m = 2$) spirals in both stars and gas, while the gaseous disks often display stronger, more tightly wound, and multi-armed patterns ($m>2$). Spiral features appear across stellar populations of different ages, confirming their density-wave nature and producing coherent spirals in both metallicity and mean stellar age distributions-consistent with recent Gaia observations of the Milky Way. Our analysis reveals a diverse dynamical scenario for spiral generation: gas content, disk coldness, and shear jointly regulate the growth and morphology of spiral perturbations. We find that the gas content and the dynamical coldness of the disk jointly regulate spiral growth: galaxies with higher gas fractions and colder disks develop more prominent spirals. The measured relation between spiral pitch angle and disk shear shows significant scatter around the analytic prediction, likely due to the combined influence of bars, gas inflows, and feedback. These results demonstrate that spiral density waves can persist in fully cosmological disks, linking internal dynamical processes to galaxy assembly and offering testable predictions for present and future surveys such as JWST and Roman.",
      "pdf_url": "https://arxiv.org/pdf/2510.25848.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25872",
      "title": "Resolved HII regions in NGC 253: Ionized gas structure and suggestions of a universal density-surface brightness relation",
      "authors": [
        "Rebecca L. McClain",
        "Adam K. Leroy",
        "Enrico Congiu",
        "Ashley. T. Barnes",
        "Francesco Belfiore",
        "Oleg Egorov",
        "Eric Emsellem",
        "Erik Rosolowsky",
        "Amirnezam Amiri",
        "Mederic Boquien",
        "Jeremy Chastenet",
        "Ryan Chown",
        "Daniel A. Dale",
        "Sanskriti Das",
        "Simon C. O. Glover",
        "Kathryn Grasha",
        "Remy Indebetouw",
        "Eric W. Koch",
        "Smita Mathur",
        "J. Eduardo Mendez-Delgado",
        "Elias K. Oakes",
        "Hsi-An Pan",
        "Karin Sandstrom",
        "Sumit K. Sarbadhicary",
        "Bradley C. Whitmore",
        "Thomas G. Williams"
      ],
      "abstract": "Resolved HII regions in NGC 253: Ionized gas structure and suggestions of a universal density-surface brightness relation Rebecca L. McClain, Adam K. Leroy, Enrico Congiu, Ashley. T. Barnes, Francesco Belfiore, Oleg Egorov, Eric Emsellem, Erik Rosolowsky, Amirnezam Amiri, Mederic Boquien, Jeremy Chastenet, Ryan Chown, Daniel A. Dale, Sanskriti Das, Simon C. O. Glover, Kathryn Grasha, Remy Indebetouw, Eric W. Koch, Smita Mathur, J. Eduardo Mendez-Delgado, Elias K. Oakes, Hsi-An Pan, Karin Sandstrom, Sumit K. Sarbadhicary, Bradley C. Whitmore, Thomas G. Williams 39 pages, 21 figures, 8 tables, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We use the full-disk VLT-MUSE mosaic of NGC 253 to identify 2492 HII regions and study their resolved structure. With an average physical resolution of 17 pc, this is one of the largest samples of highly resolved spectrally mapped extragalactic HII regions. Regions of all luminosities exhibit a characteristic emission profile described by a double Gaussian with a marginally resolved or unresolved core with radius <10 pc surrounded by a more extended halo of emission with radius 20-30 pc. Approximately 80% of the emission of a region originates from the halo component. As a result of this compact structure, the luminosity-radius relations for core and effective radii of HII regions depend sensitively on the adopted methodology. Only the isophotal radius yields a robust relationship in NGC 253, but this measurement has an ambiguous physical meaning. We invert the measured emission profiles to infer density profiles and find central densities of n_e = 10-100 cm-3. In the brightest regions, these agree well with densities inferred from the [SII]6716,30 doublet. The central density of HII regions correlates well with the surface brightness within the effective radius. We show that this same scaling relation applies to the recent MUSE+HST catalog for 19 nearby galaxies. We also discuss potential limitations, including completeness, impacts of background subtraction and spatial resolution, and the generality of our results when applied to other galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.25872.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25876",
      "title": "Chemical separation of stellar populations: analytic solutions for chemical evolution models with metallicity-dependent yields",
      "authors": [
        "Jason L. Sanders"
      ],
      "abstract": "Chemical separation of stellar populations: analytic solutions for chemical evolution models with metallicity-dependent yields Jason L. Sanders 21 pages, 6 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Stellar abundances of elements with production channels that are metallicity-dependent (most notably aluminium) have provided an empirical route for separating different Galactic components. We present 'single-zone' analytic solutions for the chemical evolution of galaxies when the stellar yields are metallicity-dependent. Our solutions assume a constant star formation efficiency, a constant mass-loading factor and that the yields are linearly dependent on the interstellar medium abundance (with the option of a saturation of the yields at high metallicity). We demonstrate how the metallicity dependence of the yields can be mathematically considered as a system-dependent delay time (approximately equal to the system's depletion time) that, when combined with system-independent delay times arising from stellar evolutionary channels, produces the separation of different systems based on their star formation efficiency and mass-loading factor. The utility of the models is highlighted through comparisons with data from the APOGEE spectroscopic survey. We provide a comprehensive discussion of the chemical evolution models in the [Al/Fe]-[Mg/Fe] plane, a diagnostic plane for the separation of in-situ and accreted Galactic components. Extensions of the models are presented, allowing for the modelling of more complex behaviours largely through the linear combination of the presented simpler solutions.",
      "pdf_url": "https://arxiv.org/pdf/2510.25876.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25879",
      "title": "A three-dimensional reconstruction of the interstellar magnetic field toward a star-forming region",
      "authors": [
        "Katia Ferrière",
        "Ludovic Montier",
        "Jean-Sébastien Carrière"
      ],
      "abstract": "A three-dimensional reconstruction of the interstellar magnetic field toward a star-forming region Katia Ferrière, Ludovic Montier, Jean-Sébastien Carrière 26 pages, 10 figures, 3 tables, 3 appendices Astrophysics of Galaxies (astro-ph.GA) Context. The polarized thermal emission from interstellar dust offers a valuable tool for probing both the dust and the magnetic field in the interstellar medium (ISM). However, existing observations only yield the total amount of dust emission along the line of sight (LoS), with no information on its LoS distribution. Aims. We present a new method designed to give access to the LoS distribution of the dust emission, both in terms of intensity and polarization. Methods. We relied on three kinematic gas tracers (HI, 12CO, and 13CO emission lines) to identify the different clouds present along the LoS. We decomposed the measured intensity of the dust emission, $I_d$, into separate contributions from these clouds. We performed a similar decomposition of the measured Stokes parameters for linear polarization, $Q_d$ and $U_d$, to derive the polarization parameters of the different clouds, and from this we inferred the clouds' magnetic field orientations. Results. We applied our method to a $3~{\\rm deg}^2$ region of the sky, centered on $(l,b) = (139°30',-3°16')$ and exhibiting signs of star formation activity. We found this region to be dominated by an extended and bright cloud with nearly horizontal magnetic field, as expected from the nearly vertical polarization angles measured by Planck. More importantly, we detected the presence of two smaller, depolarizing molecular clouds with very different magnetic field orientations in the plane of the sky ($\\simeq 65°$ and $\\simeq 45°$ from the horizontal). This is a novel and viable result, which cannot be directly read off the Planck polarization maps. Conclusions. The application of our method to the G139 region convincingly demonstrates the need to complement 2D polarization maps with 3D kinematic information when looking for reliable estimates of magnetic field orientations.",
      "pdf_url": "https://arxiv.org/pdf/2510.25879.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25909",
      "title": "On the Universality of the Relation Between Magnetic Fields and Star Formation in Galaxies",
      "authors": [
        "Davide Belfiori",
        "Sergio Martin-Alvarez",
        "Enrique Lopez-Rodriguez",
        "Rosita Paladino"
      ],
      "abstract": "On the Universality of the Relation Between Magnetic Fields and Star Formation in Galaxies Davide Belfiori, Sergio Martin-Alvarez, Enrique Lopez-Rodriguez, Rosita Paladino Astrophysics of Galaxies (astro-ph.GA) The interstellar medium (ISM) is permeated by magnetic fields that affect gas dynamics and star formation. These fields correlate with supernova (SN)-driven turbulence, but whether the scaling is universal across galaxy properties, ISM phases, and energy budgets remains unclear. We quantify the dependence of magnetic fields on star formation activity including both regular and starburst galaxies. We analyse 19 spiral disks from the cosmological RTnsCRiMHD Azahar suite, deriving line-of-sight integrated maps to measure median magnetic-field strength ($B$), specific energies (thermal, turbulent, magnetic, and cosmic-ray), and star formation rate (SFR), star formation surface density ($\\Sigma_{\\mathrm{SFR}}$) and specific SFR (sSFR). We find an almost universal magnetic-field-SFR scaling with slope $\\alpha \\approx 0.2$-$0.3$ across galaxy mass and ISM phases. The $B$-$\\Sigma_{\\mathrm{SFR}}$ slope ($\\alpha \\approx 1/3$) supports an SN-driven, turbulence-regulated origin. Neutral gas is generally turbulence-dominated and in near equipartition with magnetic energy for systems with sSFR $\\gtrsim 0.1$ Gyr$^{-1}$ and SFR $\\gtrsim 1$ $M_\\odot$ yr$^{-1}$. The simulated trends match observations with similar slopes ($\\alpha \\approx 0.25$-$0.35$), indicating that SN-driven turbulence is the main amplification mechanism behind the near-universal $B$-SFR relation.",
      "pdf_url": "https://arxiv.org/pdf/2510.25909.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25911",
      "title": "TRIShUL: Technique for Reconstructing magnetic Interstellar Structure Using starLight polarization",
      "authors": [
        "Namita Uppal",
        "Konstantinos Tassis",
        "Vasiliki Pavlidou",
        "Vincent Pelgrims",
        "Myrto Falalaki"
      ],
      "abstract": "TRIShUL: Technique for Reconstructing magnetic Interstellar Structure Using starLight polarization Namita Uppal, Konstantinos Tassis, Vasiliki Pavlidou, Vincent Pelgrims, Myrto Falalaki 16 pages, 9 figures, 1 table, submitted to A&A; under review Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a novel technique to decompose line-of-sight (LOS) stellar polarization as a function of distance, aimed at reconstructing three dimensional (3D) plane-of-sky (POS) magnetic structures in the interstellar medium (ISM). The method assumes that the observed polarization arises from discrete, thin dust layers located at varying distances along the LOS. Using a simple frequentist framework, it identifies structural changes in the distance-sorted cumulative Mahalanobis distance of Stokes parameters (q and u) to detect the locations of dust layers and estimate their associated physical properties (parallax and Stokes parameters) necessary to construct 3D maps. We benchmark the method using mock datasets representative of high-Galactic-latitude regions, incorporating realistic Gaia parallax uncertainties and polarization expected from the upcoming Pasiphae survey. Tests show that the method reliably recovers dust cloud distances and polarization properties when the polarization exceeds 0.1%, and the effective background-star fraction is greater than 10% in samples of about 345 stars. The dependence on background fraction decreases as the intrinsic polarization amplitude of the dust field increases. We apply our method to existing polarization data from two illustrative sightlines, one at intermediate-high Galactic latitude and one near the Galactic plane, with known tomographic solutions, finding excellent agreement with the literature and demonstrating its accuracy across both regions. Comparing with the BISP-1 approach, both methods effectively recover dust cloud properties, but our approach is prior-free and computationally more efficient in determining the optimal number of clouds along the LOS. These advantages make it flexible and broadly applicable for multi-layer dust cloud reconstruction for the upcoming era of large-scale stellar polarization surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.25911.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25950",
      "title": "Lyman-$α$ radiation pressure regulates star formation efficiency",
      "authors": [
        "D. Manzoni",
        "A. Ferrara"
      ],
      "abstract": "Lyman-$α$ radiation pressure regulates star formation efficiency D. Manzoni, A. Ferrara Accepted for publication on A&A Letters Astrophysics of Galaxies (astro-ph.GA) Order-unity star formation efficiencies (SFE) in early galaxies may explain the overabundance of bright galaxies observed by JWST at high redshift. Here we show that Lyman-$\\alpha$ (Ly$\\alpha$) radiation pressure limits the gas mass converted into stars, particularly in primordial environments. We develop a shell model including Ly$\\alpha$ feedback, and validate it with one-dimensional hydrodynamical simulations. To account for Ly$\\alpha$ resonant scattering, we adopt the most recent force multiplier fits, including the effect of Ly$\\alpha$ photon destruction by dust grains. We find that, independently of their gas surface density $\\Sigma_g$, clouds are disrupted on a timescale shorter than a free-fall time, and even before supernova explosions if $\\Sigma_g \\gtrsim 10^3\\,M_{\\odot}\\ \\rm pc^{-2}$. At $\\log(Z/Z_{\\odot}) = -2$, relevant for high-redshift galaxies, the SFE is $0.01 \\lesssim \\hat{\\epsilon}_{*} \\lesssim 0.66$ for $10^3 \\lesssim\\Sigma_g [M_{\\odot}\\ \\rm pc^{-2}] \\lesssim 10^5$. The SFE is even lower for decreasing metallicity. Near-unity SFEs are possible only for extreme surface densities, $\\Sigma_{g} \\gtrsim 10^5\\;M_{\\odot}\\ \\rm pc^{-2}$, and near-solar metallicities. We conclude that Ly$\\alpha$ radiation pressure severely limits a possible extremely efficient, feedback-free phase of star formation in dense, metal-poor clouds.",
      "pdf_url": "https://arxiv.org/pdf/2510.25950.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26077",
      "title": "Ram pressure shaping HVC droplets -- FAST HI observations of HVC AC-III and theoretical interpretation",
      "authors": [
        "Xunchuan Liu"
      ],
      "abstract": "Ram pressure shaping HVC droplets -- FAST HI observations of HVC AC-III and theoretical interpretation Xunchuan Liu Astrophysics of Galaxies (astro-ph.GA) FAST HI observations reveal unprecedented internal structures of the high-velocity cloud AC-III, which is found to consist of several coherent subclumps (D1--D6) with nearly constant line widths of $\\sim 20~\\mathrm{km~s^{-1}}$, while the global velocity spread ranges from $-220$ to $-180~\\mathrm{km~s^{-1}}$. These subclumps exhibit parabolic morphologies, consistent with ram-pressure--confined droplets, with their heads tending to point toward the Galactic plane. A steady-state model reproduces both the morphology and the observed exponential density profiles. The tip density reaches $\\sim 2~\\mathrm{cm^{-3}}$, implying an ambient medium density of $\\sim 10^{-3}~\\mathrm{cm^{-3}}$, in agreement with the Galactic warm ionized medium at a distance of $\\sim 5$~kpc. Deviations from symmetric droplet shapes, along with internal patterns such as strip-like ridges, rings, and holes, indicate rich internal dynamics. In particular, the observations are consistent with fluid loops forming inside the droplets in response to interactions between neighboring subclumps. These loops can generate ring-like dynamic patterns and drive secondary turbulence, sustaining long-lived internal motions. An intermediate-velocity component ($-150$ to $-100~\\mathrm{km~s^{-1}}$) exhibits a shell-like morphology aligned with the head of AC-III, possibly shaped by pressure interactions mediated by the WIM. Overall, we suggest that HVC AC-III is entering the Galactic WIM layer and being sculpted by ram pressure into a droplet-like morphology, providing a valuable case for studying the structure formation, turbulence origin, and dynamic evolution of HVCs, as well as the physical properties of the ambient medium.",
      "pdf_url": "https://arxiv.org/pdf/2510.26077.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26259",
      "title": "The SOMA MM Survey. I. An Astrochemical Census of Massive Protostars",
      "authors": [
        "D. Gigli",
        "P. Gorai",
        "C.Y. Law",
        "J. C. Tan",
        "M. Bonfand",
        "T. Rahman",
        "Y. Zhang",
        "K. Taniguchi",
        "R. Fedriani",
        "Z. Telkamp",
        "V. Rosero",
        "G. Cosentino"
      ],
      "abstract": "The SOMA MM Survey. I. An Astrochemical Census of Massive Protostars D. Gigli, P. Gorai, C.Y. Law, J. C. Tan, M. Bonfand, T. Rahman, Y. Zhang, K. Taniguchi, R. Fedriani, Z. Telkamp, V. Rosero, G. Cosentino 43 pages, 28 figures; submitted to A&A, comments welcome Astrophysics of Galaxies (astro-ph.GA) During massive star formation, dense gas undergoes chemical evolution, producing both simple and complex organic molecules (COMs) characteristic of hot molecular cores. How this evolution depends on protostellar physical properties remains unclear. We investigate the chemical content of 22 well-studied massive protostars from the SOFIA Massive (SOMA) Star Formation survey, aiming to identify correlations between chemical and physical parameters. We analyzed Atacama Compact Array and Total Power 1.3 mm (Band 6) data, deriving column densities, line widths, and excitation temperatures of multiple molecular species by modeling detected lines under local thermodynamic equilibrium (LTE) using MADCUBA. Spectra show 35 species, from simple molecules (e.g., CO, SO, SiO) to complex organic molecules (COMs), with seven sources exhibiting high chemical complexity (> 100 transitions). Average excitation temperatures vary across the sample: $T_\\text{ex}>100~\\text{K}$ for eight sources, $50-100~\\text{K}$ for four, and $T_\\text{ex} < 50~\\text{K}$ for the remainder. Sources with $T_\\text{ex} < 50~\\text{K}$ trace lukewarm, chemically simple gas, while those with $T_\\text{ex}>100~\\text{K}$ indicate the presence of typical hot cores where thermal desorption is efficient, resulting in line-rich spectra. Comparing these chemical properties with the bolometric luminosity to envelope mass ratio ($L_\\text{bol}/M_\\text{env}$), an evolutionary tracer, we find tentative correlations with line widths, excitation temperature, and column densities. These data provide important constraints for chemodynamical models of massive protostellar cores.",
      "pdf_url": "https://arxiv.org/pdf/2510.26259.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26305",
      "title": "The role of black hole feedback on galaxy star formation and the degeneracy with halo quenching",
      "authors": [
        "Hao Fu",
        "Francesco Shankar",
        "Feng Yuan",
        "Daniel Roberts",
        "Lumen Boco",
        "Andrea Lapi",
        "Pablo Corcho-Caballero",
        "Mohammadreza Ayromlou",
        "Antonis Georgakakis",
        "Brivael Laloux",
        "Iván Muñoz Rodríguez",
        "Yingjie Peng"
      ],
      "abstract": "The role of black hole feedback on galaxy star formation and the degeneracy with halo quenching Hao Fu, Francesco Shankar, Feng Yuan, Daniel Roberts, Lumen Boco, Andrea Lapi, Pablo Corcho-Caballero, Mohammadreza Ayromlou, Antonis Georgakakis, Brivael Laloux, Iván Muñoz Rodríguez, Yingjie Peng 18 pages, 16 figures, accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) The interplay between the accretion of supermassive black holes (SMBHs) and the stellar mass growth of the host galaxies is still a matter of hot debate. The accretion of the SMBHs is expected to release energy under the form of AGNs. This energy is believed to impact the star formation activity and contribute to the quenching of galaxies. Here, we address this key unsolved issue with our cosmological semi-empirical model DECODE. In DECODE, we grow galaxies with their SFR linked to halo accretion rate distributions via abundance matching. SMBHs are evolved following the stellar mass growth of their host galaxies by assigning an accretion rate at each redshift from the empirical Eddington ratio distributions and duty cycles. We test the assumption that galaxies permanently quench when their central SMBHs approach the limit imposed by the observed $M_{\\rm BH} - \\sigma_\\star$ relation, as a proxy of SMBH disruptive feedback. We find that simply imposing the $M_{\\rm BH} - \\sigma_\\star$ condition is sufficient to generate a fraction of quenched galaxies consistent with current data, including the newest ones from Euclid. In addition, our minimal, data-driven model, also predicts SMBH scaling relations consistent in slope and normalisation with those observed, and an $M_{\\rm BH} - M_\\star$ relation weakly evolving with redshift. The model also naturally generates SMBH accretion rates peaking within 1 Gyr of their host SFHs. We note that all the main predictions on galaxy quenched fractions and SMBH growth histories and scaling relations are degenerate with those expected in a halo quenching model. The comprehensive data-driven model presented in this work represents an invaluable tool to investigate SMBH demography across time and environments in an accurate, physically motivated manner, ideally suited to rapidly explore the implications from large surveys, such as Euclid and Rubin-LSST.",
      "pdf_url": "https://arxiv.org/pdf/2510.26305.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26321",
      "title": "Shock-driven heating in the circumnuclear star-forming regions of NGC 7582: Insights from JWST NIRSpec and MIRI/MRS spectroscopy",
      "authors": [
        "Oscar Veenema",
        "Niranjan Thatte",
        "Dimitra Rigopoulou",
        "Ismael García-Bernete",
        "Almudena Alonso-Herrero",
        "Anelise Audibert",
        "Enrica Bellocchi",
        "Andrew J. Bunker",
        "Steph Campbell",
        "Francoise Combes",
        "Ric I. Davies",
        "Daniel Delaney",
        "Fergus Donnan",
        "Federico Esposito",
        "Santiago García-Burillo",
        "Omaira Gonzalez Martin",
        "Laura Hermosa Muñoz",
        "Erin K. S. Hicks",
        "Sebastian F. Hoenig",
        "Nancy A. Levenson",
        "Chris Packham",
        "Miguel Pereira-Santaella",
        "Cristina Ramos Almeida",
        "Claudio Ricci",
        "Rogemar A. Riffel",
        "David Rosario",
        "Lulu Zhang"
      ],
      "abstract": "Shock-driven heating in the circumnuclear star-forming regions of NGC 7582: Insights from JWST NIRSpec and MIRI/MRS spectroscopy Oscar Veenema, Niranjan Thatte, Dimitra Rigopoulou, Ismael García-Bernete, Almudena Alonso-Herrero, Anelise Audibert, Enrica Bellocchi, Andrew J. Bunker, Steph Campbell, Francoise Combes, Ric I. Davies, Daniel Delaney, Fergus Donnan, Federico Esposito, Santiago García-Burillo, Omaira Gonzalez Martin, Laura Hermosa Muñoz, Erin K. S. Hicks, Sebastian F. Hoenig, Nancy A. Levenson, Chris Packham, Miguel Pereira-Santaella, Cristina Ramos Almeida, Claudio Ricci, Rogemar A. Riffel, David Rosario, Lulu Zhang Astrophysics of Galaxies (astro-ph.GA) We present combined JWST NIRSpec and MIRI/MRS integral field spectroscopy data of the nuclear and circumnuclear regions of the highly dust obscured Seyfert 2 galaxy NGC 7582, which is part of the sample of AGN in the Galaxy Activity, Torus and Outflow Survey (GATOS). Spatially resolved analysis of the pure rotational H$_2$ lines (S(1)-S(7)) reveals a characteristic power-law temperature distribution in different apertures, with the two prominent southern star-forming regions exhibiting unexpectedly high molecular gas temperatures, comparable to those in the AGN powered nuclear region. We investigate potential heating mechanisms including direct AGN photoionisation, UV fluorescent excitation from young star clusters, and shock excitation. We find that shock heating gives the most plausible explanation, consistent with multiple near- and mid-IR tracers and diagnostics. Using photoionisation models from the PhotoDissociation Region Toolbox, we quantify the ISM conditions in the different regions, determining that the southern star-forming regions have a high density ($n_H \\sim 10^{5}$ cm$^{-3}$) and are irradiated by a moderate UV radiation field ($G_0 \\sim 10^{3}$ Habing). Fitting a suite of Paris-Durham shock models to the rotational H$_2$ lines, as well as rovibrational 1-0 S(1), 1-0 S(2), and 2-1 S(1) H$_2$ emission lines, we find that a slow ($v_s \\sim 10$ km/s) C-type shock is likely responsible for the elevated temperatures. Our analysis loosely favours local starburst activity as the driver of the shocks and circumnuclear gas dynamics in NGC 7582, though the possibility of an AGN jet contribution cannot be excluded.",
      "pdf_url": "https://arxiv.org/pdf/2510.26321.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26329",
      "title": "Tracing the evolution of brightest galaxies and diffuse light in galaxy groups",
      "authors": [
        "B. Bilata-Woldeyes",
        "J. D. Perea",
        "J. M. Solanes"
      ],
      "abstract": "Tracing the evolution of brightest galaxies and diffuse light in galaxy groups B. Bilata-Woldeyes, J. D. Perea, J. M. Solanes Accepted for publication in Astronomy & Astrophysics; 16 pages (1 Appendix), 13 figures, and 3 tables Astrophysics of Galaxies (astro-ph.GA) We present a suite of 100 cosmologically motivated, controlled N-body simulations designed to advance the understanding of the role of purely gravitational dynamics in the early formation of low-mass galaxy groups (~ 1-5 x 10^13 M_sun). In this work, we investigate the temporal evolution of key indicators of dynamical relaxation, with particular emphasis on the secular growth of the diffuse intragroup light (IGL), the four major group galaxies, and the mass distributions of their progenitors. We also assess the diagnostic power of several magnitude gaps between top-ranked galaxies as proxies for dynamical age. As in our previous study, we compare outcomes from three group classes defined by the number of brightest group galaxies (BGGs) present at the end of the simulations. The early assembly of galaxy groups is consistent with a stochastic Poisson process at an approximately constant merger rate. Various dynamical diagnostics - including galaxy pairwise separations, velocity dispersions, and the offset of the first-ranked galaxy from the group barycentre - indicate that single-BGG groups evolve more rapidly towards virialisation than double- and especially non-BGG systems. We further find that first-ranked group members and the IGL, follow distinct growth histories, with the IGL assembled from a more numerous and systematically lower-mass population than the central object. This distinction is particularly pronounced in non-BGG systems, where about one third of the IGL originates from small galaxies, each contributing less than 5% to this component. Among the tested magnitude gaps, the difference between the first- and fourth-ranked galaxies, $\\Delta M4-1$, proves a more robust indicator of dynamical age for low-mass groups than the conventional $\\Delta M2-1$ gap. The $\\Delta M5-1$ and $\\Delta M6-1$ gaps also perform well and may be preferable in certain contexts.",
      "pdf_url": "https://arxiv.org/pdf/2510.26329.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26341",
      "title": "oMEGACat. VIII. A Subpopulation Census of ω Centauri",
      "authors": [
        "C. Clontz",
        "A. C. Seth",
        "Z. Wang",
        "M. Haeberle",
        "M. S. Nitschai",
        "N. Neumayer",
        "P. J. Smith",
        "M. Latour",
        "A. Feldmeier-Krause",
        "M. Libralato",
        "A. Bellini"
      ],
      "abstract": "oMEGACat. VIII. A Subpopulation Census of ω Centauri C. Clontz, A. C. Seth, Z. Wang, M. Haeberle, M. S. Nitschai, N. Neumayer, P. J. Smith, M. Latour, A. Feldmeier-Krause, M. Libralato, A. Bellini Astrophysics of Galaxies (astro-ph.GA) An understanding of the assembly history of the complex star cluster Omega Centauri has long been sought after, with many studies separating the stars on the color-magnitude diagram into multiple groupings across small magnitude ranges. Utilizing the oMEGACat combined astro-photometric and spectroscopic dataset we parse 14 subpopulations from the upper red-giant branch to below the main-sequence turnoff. We combine our results with previous works to estimate the age and age spread of each population. We find that the chemically enhanced (P2) populations are all ~1 Gyr younger (~11.6 Gyr old) and have significantly higher intrinsic age spreads (0.6 Gyr) than the primordial (P1) populations (~12.6 Gyr old, 0.3 Gyr spread), with the intermediate (Im) populations falling in between the two. Additionally, we connect for the first time the Chromosome Diagram to the two-stream age-metallicity relation, allowing us to link the P1 and P2 stars to the distinct star formation tracks, proposed to be in-situ and ex-situ contributions to the cluster's assembly. Our results are consistent with some suggested formation models and rule out others but no current model can explain all observed features of the subpopulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.26341.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26405",
      "title": "XRISM Observations of The Prototypical Cold Front in Abell 3667",
      "authors": [
        "Yuki Omiya",
        "Yuto Ichinohe",
        "Kazuhiro Nakazawa",
        "Hisamitsu Awaki",
        "Dominique Eckert",
        "Yutaka Fujita",
        "Isamu Hatsukade",
        "Maxim Markevitch",
        "François Mernier",
        "Ikuyuki Mitsuishi",
        "Naomi Ota",
        "Aurora Simionescu",
        "Yuusuke Uchida",
        "Shutaro Ueda",
        "Irina Zhuravleva",
        "John Zuhone"
      ],
      "abstract": "XRISM Observations of The Prototypical Cold Front in Abell 3667 Yuki Omiya, Yuto Ichinohe, Kazuhiro Nakazawa, Hisamitsu Awaki, Dominique Eckert, Yutaka Fujita, Isamu Hatsukade, Maxim Markevitch, François Mernier, Ikuyuki Mitsuishi, Naomi Ota, Aurora Simionescu, Yuusuke Uchida, Shutaro Ueda, Irina Zhuravleva, John Zuhone Astrophysics of Galaxies (astro-ph.GA) We present high-resolution X-ray spectroscopy of the merging galaxy cluster Abell 3667 with \\textit{XRISM}/Resolve. Two observations, targeting the cluster X-ray core and the prototypical cold front, were performed with exposures of 105 ks and 276 ks, respectively. We find that the gas in the core is blueshifted by $v_z\\sim-200$ km s$^{-1}$ relative to the brightest cluster galaxy, while the low-entropy gas inside the cold front is redshifted by $v_z\\sim 200$ km s$^{-1}$. As one moves further off-center across the front, the line-of-sight (LoS) velocity changes significantly, by $\\Delta v_z=535^{+167}_{-154}$ km s$^{-1}$, back to the value similar to that in the core. There are no significant LoS velocity gradients perpendicular to the cluster symmetry axis. These features suggest that the gas forming the cold front is flowing in the plane oriented along the LoS, supporting an offset merger scenario in which the main cluster has passed in front of the subcluster and induced rotation of the core gas in the plane perpendicular to the sky. The region just inside the front exhibits the largest LoS velocity dispersion seen across two pointings, $\\sigma_z\\sim420$ km s$^{-1}$, which can be interpreted as a developing turbulence or a projection of the LoS velocity shear within the front. The large LoS velocity jump across the cold front, combined with the lack of Kelvin-Helmholtz instability on the surface of the front, suggests some mechanism to suppress it. For example, a magnetic field with $B>5\\,\\mu$G is required if the cold front is stabilized by magnetic draping.",
      "pdf_url": "https://arxiv.org/pdf/2510.26405.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26435",
      "title": "Joint Analysis of Optical, Near-Infrared And Mid-Infrared Variability of 4 Quasars at Redshift < 1",
      "authors": [
        "Lin Long",
        "Zhen-ya Zheng",
        "Ning Jiang",
        "Chun Xu",
        "Jiaqi Lin",
        "Fang-Ting Yuan",
        "Chunyan Jiang",
        "Ruqiu Lin",
        "Hai-Cheng Feng",
        "Hengxiao Guo",
        "Xiang Ji"
      ],
      "abstract": "Joint Analysis of Optical, Near-Infrared And Mid-Infrared Variability of 4 Quasars at Redshift < 1 Lin Long, Zhen-ya Zheng, Ning Jiang, Chun Xu, Jiaqi Lin, Fang-Ting Yuan, Chunyan Jiang, Ruqiu Lin, Hai-Cheng Feng, Hengxiao Guo, Xiang Ji Astrophysics of Galaxies (astro-ph.GA) Amid rapid advances in time-domain astronomy, multi-wavelength (e.g., optical and infrared) time-domain studies of quasars remain scarce. Here we present a systematic analysis of four quasars initially selected by their Ks-band variability amplitudes in the VISTA Variables in the V\\'ıa Láctea Survey (VVV/VVVX). For these objects, we obtain complementary optical light curves from Pan-STARRS1 (PS1) and the Zwicky Transient Facility (ZTF), and W1-band light curves from the Wide-field Infrared Survey Explorer (WISE). We perform correlation analysis to study the time lags between different bands, which may be directly related to the size of the dust torus. After correcting for infrared flux contamination from the accretion disk and accounting for the redshift effect, we measure the Ks-optical and W1-optical lags for the targets VVV J1834-2925 and VVV J1845-2426. Using typical sublimation temperatures and reverberation time lags, we obtain a graphite-to-silicate grain size ratio of $\\frac{a_C}{a_S}\\sim$ 0.4. Through SED fitting, we determine the luminosities of these quasars and find that their dust torus sizes follow the established $R_{dust}-L_{AGN}$ relation reported in previous studies.",
      "pdf_url": "https://arxiv.org/pdf/2510.26435.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26445",
      "title": "Neon is an inhibitor of CO hydrogenation in pre-stellar core conditions",
      "authors": [
        "Basile Husquinet",
        "Julie Vitorino",
        "Olli Sipilä",
        "Paola Caselli",
        "François Dulieu"
      ],
      "abstract": "Neon is an inhibitor of CO hydrogenation in pre-stellar core conditions Basile Husquinet, Julie Vitorino, Olli Sipilä, Paola Caselli, François Dulieu 11 pages, 14 figures; abstract abridged for arXiv; accepted to be published in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Neon (Ne) is the fifth most abundant element in the Universe. Because it is chemically inert, it has never been considered in astrochemical models that studied molecular evolution. In the cold dark environments of pre-stellar cores, where the temperatures are below 10 K, Ne can condense onto the surface of interstellar grains. We investigated the effect of Ne on the production of formaldehyde (H$_2$CO) and methanol (CH$_3$OH) through carbon monoxide (CO) hydrogenation on different cold surfaces. We highlight its role in conditions corresponding to pre-stellar cores. In an ultra-high vacuum system, we conducted two types of experiments. The first experiment involved the co-deposition of CO and H atoms with or without Ne. The second experiment involved depositing a monolayer of CO and separately a monolayer of Ne (or vice versa), followed by bombarding the layers with hydrogen atoms. Additionally, we used a gas-grain chemical code to simulate a pre-stellar core and determine where Ne can affect the chemistry. The presence of Ne on the surface significantly inhibits CO hydrogenation at temperatures below 12 K. In the co-deposition experiments, we observed a 38% decrease in the H$_2$CO production at 11 K when the quantity of Ne in the mixture was lower than a monolayer. At 10 K and with one monolayer in the mixture, the production decreased to 77%, and it reached 91% for a few monolayers of Ne in the mixture at 9 K. While the decrease in CH$_3$OH formation is still notable, it is less pronounced: 43% at 11 K, 61% at 10 K, and 77% at 9 K. Experiments with stacked layers revealed that the CO layer decay varies slightly when the Ne layer is positioned above or below it. This observation indicates that Ne and CO create a mixture in which Ne can diffuse and stabilize at the surface, which isolates CO molecules from the accreting H atoms.",
      "pdf_url": "https://arxiv.org/pdf/2510.26445.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26450",
      "title": "The rotation speed of the spiral pattern in the Milky Way galaxy",
      "authors": [
        "Vadim V. Bobylev",
        "Anisa T. Bajkova",
        "Anton A. Smirnov"
      ],
      "abstract": "The rotation speed of the spiral pattern in the Milky Way galaxy Vadim V. Bobylev, Anisa T. Bajkova, Anton A. Smirnov Astronomy Letters, 2025, Vol. 51, No. 5 Astrophysics of Galaxies (astro-ph.GA) For a sample of masers, the basic kinematic equations were solved by including the Galactic rotation parameters and the peculiar velocity of the Sun as the unknown variables. Based on spectral analysis, the following estimates were obtained: $|f|_{R,\\theta}=(7.0,5.1)\\pm(1.2,1.4)$ km s$^{-1}$ and the corresponding wavelengths $\\lambda_{R,\\theta}=(1.9,1.7)\\pm(0.4,0.7)$ kpc, as well as $\\chi_\\odot=-140^\\circ\\pm15^\\circ$. The presence of periodic perturbations in the vertical velocities of masers with an amplitude of $|f|_W=3.1\\pm1.4$ km s$^{-1}$ and a wavelength of $\\lambda=1.9\\pm0.8$ kpc was confirmed. It is shown that the velocities $f_R$ and $f_\\theta$ can have both the same and different signs. Therefore, we obtained a large scatter of estimates. Thus, if $f_R$ and $f_\\theta$ have the same signs, then $\\Omega_p=25.8\\pm2.0$ km s$^{-1}$ kpc$^{-1}$ and $R_{cor}=9.1\\pm0.8$ kpc. And when $f_R$ and $f_\\theta$ have different signs, then $\\Omega_p=35.4\\pm2.0$ km s$^{-1}$ kpc$^{-1}$ and $R_{cor}=6.8\\pm0.8$ kpc.",
      "pdf_url": "https://arxiv.org/pdf/2510.26450.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26513",
      "title": "CROCODILE-DWARF: Assembly and Kinematics of Field Dwarf Galaxies with GADGET4-OSAKA",
      "authors": [
        "Kazuki Tomaru",
        "Yuri Oku",
        "Daisuke Toyouchi",
        "Kentaro Nagamine"
      ],
      "abstract": "CROCODILE-DWARF: Assembly and Kinematics of Field Dwarf Galaxies with GADGET4-OSAKA Kazuki Tomaru, Yuri Oku, Daisuke Toyouchi, Kentaro Nagamine 18 pages, 11 figures, submitted Astrophysics of Galaxies (astro-ph.GA) We present results from CROCODILE-DWARF, a suite of cosmological zoom-in hydrodynamic simulations of isolated field dwarf galaxies with halo masses of $\\sim10^{10}\\,M_\\odot$ at $z=0$, performed with the \\textsc{gadget4-osaka} code. The simulations include detailed modeling of star formation, chemical enrichment, and supernova feedback using the \\textsc{CELib} and \\textsc{grackle} libraries, achieving baryonic resolutions of $\\sim2\\times10^3\\,M_\\odot$. Our study focuses on how assembly history governs the structural and kinematic diversity of dwarf galaxies within the $\\Lambda$CDM framework. The simulated galaxies reproduce the observed stellar-to-halo mass, mass--metallicity, and size--mass relations, yielding stellar masses of $10^6-10^8\\,M_\\odot$ and metallicities consistent with those of Local Group dwarf galaxies. The galaxies display a broad range of rotational support, where gas is generally more rotationally supported than stars. Differences in morphology and kinematics primarily reflect variations in halo assembly timescales and merger activity. Early-assembling, high-concentration halos form stars efficiently and become gas-poor by $z=0$, while late-assembling, low-concentration halos remain gas-rich due to delayed star formation and rejuvenated gas accretion. We identify a clear anti-correlation between rotational support and the cumulative merger mass fraction, demonstrating that dynamical heating by mergers is the dominant factor shaping kinematic diversity. In some cases, late-time mergers induce the formation of extended gas disks by delivering fresh gas and angular momentum. These results demonstrate that assembly history, rather than halo mass alone, critically shapes the present-day kinematic and morphological diversity of dwarf galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.26513.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26570",
      "title": "The magnetic fields of the dusty nuclei and molecular outflows of Arp 220",
      "authors": [
        "Enrique Lopez-Rodriguez",
        "Josep M. Girart",
        "Miguel Pérez-Torres",
        "Mar Mezcua",
        "Gemma Busquet",
        "Rubén Herrero-Illana",
        "Antxon Alberdi",
        "José M. Torrelles"
      ],
      "abstract": "The magnetic fields of the dusty nuclei and molecular outflows of Arp 220 Enrique Lopez-Rodriguez, Josep M. Girart, Miguel Pérez-Torres, Mar Mezcua, Gemma Busquet, Rubén Herrero-Illana, Antxon Alberdi, José M. Torrelles 15 pages, 5 figures, 2 tables. Submitted to ApJL (Comments are welcome) Astrophysics of Galaxies (astro-ph.GA) Galaxy mergers trigger starburst activity and galactic outflows that enrich the circumgalactic medium, profoundly impacting galaxy evolution. These phenomena are intrinsically linked to the physical conditions of the medium, which is permeated by magnetic (B) fields affecting its transport and dynamics. Here, we spatially resolve, $0.24$\" (96 pc), the B-fields in the dusty and molecular outflows of Arp 220, the closest ($78$ Mpc) Ultra-Luminous Infrared Galaxy hosting two interacting nuclei, denoted as East and West. We perform ALMA $870~\\mu$m dust continuum polarization and CO(3-2) emission line polarization, and report the first detection of CO(3-2) emission line polarization through the Goldreich-Kylafis effect in an outflow. Dust polarization shows that Arp 220 E has a spiral-like B-field on the disk with a linear polarization fraction of $0.4\\pm0.1$% that may produce the detected circular polarization passing through foreground aligned dust grains. Arp 220 W reveals a B-field parallel to the red- and blueshifted outflows in both the dust and emission line polarization maps. The outflows show a dust polarization of $0.2$%, while the CO(3-2) emission line polarization is $1-2$% at $4-6\\sigma$ significance across independent velocity channels. A highly polarized ($3-5$%) dusty bridge has a B-field orientation of $\\sim110^{\\circ}$ connecting both nuclei. Mean B-field strengths of $1.6$ mG and $8$ mG for the blue- and redshifted outflows, respectively, are estimated. These strong B-fields are attributed to amplification by compression in nuclear clouds and supernova remnants. This amplified B-field is likely sustained by the turbulent kinetic energy in the outflow and may be critical in directing the transport of metals and cosmic rays into the circumgalactic medium.",
      "pdf_url": "https://arxiv.org/pdf/2510.26570.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26625",
      "title": "The chemical DNA of the Magellanic Clouds IV. Unveiling extreme element production: the Eu abundance in the Small Magellanic Cloud",
      "authors": [
        "Samuele Anoardo",
        "Alessio Mucciarelli",
        "Marco Palla",
        "Lorenzo Santarelli",
        "Carmela Lardo",
        "Donatella Romano"
      ],
      "abstract": "The chemical DNA of the Magellanic Clouds IV. Unveiling extreme element production: the Eu abundance in the Small Magellanic Cloud Samuele Anoardo, Alessio Mucciarelli, Marco Palla, Lorenzo Santarelli, Carmela Lardo, Donatella Romano 9 pages, 7 figures. Re-submitted to Astronomy and Astrophysics after a positive referee report Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) In this study we investigate the chemical enrichment of the rapid neutron-capture process in the Small Magellanic Cloud (SMC). We measure [Eu/Fe] abundance ratios in 209 giant stars that are confirmed members of the SMC, providing the first extensive dataset of Eu abundances in this galaxy across its full metallicity range, spanning more than 1.5 dex. We compare Eu abundances with those of Mg and Ba to evaluate the efficiency of the r-process relative to $\\alpha$-capture and s-process nucleosynthesis. The SMC shows enhanced [Eu/Fe] values at all metallicities (comparable with the values measured in the Milky Way), with a clear decline as [Fe/H] increases (from $\\sim$ -1.75 dex to $\\sim$ -0.5 dex), consistent with the onset of Type Ia supernovae. In contrast, [Eu/Mg] is enhanced by about +0.5 dex at all [Fe/H], significantly above the values observed in Milky Way stars, where [Eu/Mg] remains close to solar, reflecting comparable production of r-process and $\\alpha$-capture elements. Moreover, [Ba/Eu] increases with metallicity, beginning at [Fe/H] $\\approx$ -1.5 dex, namely at a lower metallicity with respect to the Milky Way, where [Ba/Eu] starts to increase around [Fe/H] $\\approx$ -1 dex. Our findings suggest the SMC has a higher production of Eu (with respect to the $\\alpha$-elements) than the Milky Way but in line with what observed in other dwarf systems within the Local Group. We confirm that galaxies with star formation efficiencies lower than the Milky Way have high [Eu/$\\alpha$], probably indicating a stronger efficiency of the delayed sources of r-process at low metallicities.",
      "pdf_url": "https://arxiv.org/pdf/2510.26625.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26716",
      "title": "Active Dwarf Galaxy Database II: Connections between Host Galaxy Properties and Black Hole Accretion Signatures",
      "authors": [
        "Erik J. Wasleske",
        "Vivienne F. Baldassare",
        "Christopher M. Carroll"
      ],
      "abstract": "Active Dwarf Galaxy Database II: Connections between Host Galaxy Properties and Black Hole Accretion Signatures Erik J. Wasleske, Vivienne F. Baldassare, Christopher M. Carroll 25 pages, 20 Figures. Accepted to The Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) We investigate the connection between accretion signatures and host galaxy properties in the context of how active dwarf galaxies are identified. We use the database constructed in Wasleske & Baldassare (2024) which contains dwarf galaxies that were selected as active galaxies by optical spectroscopy, infrared colors, X-ray brightness, and photometric variability. Multi-wavelength archival data was used to consistently apply all of these methods to every galaxy within this compiled set. The cross application of these methods resulted in a diversity of sub-populations identified as active by some set of these techniques. In this paper, we estimate host galaxy properties from spectral energy distribution models. We connect the active galactic nuclei (AGN) signatures to our estimated host galaxies' properties using statistical dimensionality reduction methods. We find that dwarf AGN selected by infrared colors are the most distinct population, with the highest star formation rates and lowest stellar masses. We also find some other key population differences, such as the broad line AGN having significantly higher AGN luminosities. X-ray and variability selected AGN have higher average star formation rates than those selected with optical narrow line spectroscopic diagrams. Our connections to the host galaxy parameters potentially point to the sub-populations representing different epochs of the evolution of accretion.",
      "pdf_url": "https://arxiv.org/pdf/2510.26716.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25945",
      "title": "Potential Thermal Profiles of The Third Interstellar Object 3I/ATLAS",
      "authors": [
        "Atsuhiro Yaginuma",
        "Aster G. Taylor",
        "Darryl Z. Seligman"
      ],
      "abstract": "Potential Thermal Profiles of The Third Interstellar Object 3I/ATLAS Atsuhiro Yaginuma, Aster G. Taylor, Darryl Z. Seligman 8 pages, 6 figures, 1 table, submitted to MNRAS Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We investigate the thermal evolution of 3I/ATLAS, the third macroscopic interstellar object discovered on 2025 July 1. By comparing modeled thermal profiles with observations of volatile activity, it is possible to constrain bulk physical properties of a cometary nucleus. 3I/ATLAS is actively producing a variety of cometary volatiles. In this paper, we calculate one-dimensional thermal profiles of the third interstellar object 3I/ATLAS throughout its trajectory in an attempt to gain insight into its bulk properties based on measurements of its volatiles. Assuming a variety of typical comet and asteroid bulk geophysical properties such as heat capacities, densities, and conductivities, we calculate the radial thermal profile as a function of depth throughout the hyperbolic trajectory. The methods and code to generate the thermal profile are flexible for any hyperbolic or bound orbit. The thermal profiles are benchmarked to the nominal sublimation temperatures of H$_2$O, CO$_2$ and CO, but are still applicable to any volatile. Comparison between the modeled surface temperatures and the observed onset of H$_2$O activity near 3 au indicates that surface temperatures exceeding $\\sim$150 K can only be achieved if the albedo is below 0.2. We therefore set the upper limit on the albedo of 3I/ATLAS to be 0.2.",
      "pdf_url": "https://arxiv.org/pdf/2510.25945.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26308",
      "title": "Interstellar Comet 3I/ATLAS: Evidence for Galactic Cosmic Ray Processing",
      "authors": [
        "R. Maggiolo",
        "F. Dhooghe",
        "G. Gronoff",
        "J. de Keyser",
        "G. Cessateur"
      ],
      "abstract": "Interstellar Comet 3I/ATLAS: Evidence for Galactic Cosmic Ray Processing R. Maggiolo, F. Dhooghe, G. Gronoff, J. de Keyser, G. Cessateur 13 pages, 5 figures, submitted to The Astrophysical Journal Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) Spectral observations of 3I/ATLAS (C/2025 N1) with JWST/NIRSpec and SPHEREx reveal an extreme CO2 enrichment (CO2/H2O = 7.6+-0.3) that is 4.5 sigma above solar system comet trends and among the highest ever recorded. This unprecedented composition, combined with substantial absolute CO levels (CO/H2O = 1.65+-0.09) and red spectral slopes, provides direct evidence for galactic cosmic ray (GCR) processing of the outer layers of the interstellar comet nucleus. Laboratory experiments demonstrate that GCR irradiation efficiently converts CO to CO2 while synthesizing organic-rich crusts, suggesting that the outer layers of 3I/ATLAS consist of irradiated material which properties are consistent with the observed composition of 3I/ATLAS coma and with its observed spectral reddening. Estimates of the erosion rate of 3I/ATLAS indicate that current outgassing samples the GCR-processed zone only (depth ~15-20 m), never reaching pristine interior material. Outgassing of pristine material after perihelion remains possible, though it is considered unlikely. This represents a paradigm shift: long-residence interstellar objects primarily reveal GCR-processed material rather than pristine material representative of their primordial formation environments. With 3I/ATLAS approaching perihelion in October 2025, immediate follow-up observations are critical to confirm this interpretation and establish GCR processing as a fundamental evolutionary pathway for interstellar objects.",
      "pdf_url": "https://arxiv.org/pdf/2510.26308.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26687",
      "title": "The ODYSSEUS Survey. Spatial correlation of magnetospheric inclinations points to parsec-scale star-cloud connection",
      "authors": [
        "Caeley V. Pittman",
        "Catherine C. Espaillat",
        "Thanawuth Thanathibodee",
        "Nuria Calvet",
        "Lee W. Hartmann",
        "Sylvie Cabrit"
      ],
      "abstract": "The ODYSSEUS Survey. Spatial correlation of magnetospheric inclinations points to parsec-scale star-cloud connection Caeley V. Pittman, Catherine C. Espaillat, Thanawuth Thanathibodee, Nuria Calvet, Lee W. Hartmann, Sylvie Cabrit Accepted for publication in ApJL. 26 pages, 10 figures, 3 tables, 1 animated figure. This paper follows Pittman et al. (2025a, 2025b), located on ADS at this https URL and this https URL Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The properties of stars and planets are shaped by the initial conditions of their natal clouds. However, the spatial scales over which the initial conditions can exert a significant influence are not well constrained. We report the first evidence for parsec-scale spatial correlations of stellar magnetospheric inclinations ($i_{\\rm mag}$), observed in the Lupus low-mass star forming region. Applying consensus clustering with a hierarchical density-based clustering algorithm, we demonstrate that the detected spatial dependencies are stable against perturbations by measurement uncertainties. The $i_{\\rm mag}$ correlation scales are on the order of ~3 pc, which aligns with the typical scales of the Lupus molecular cloud filaments. Our results reveal a connection between large-scale forces -- in the form of expanding shells from the Upper Scorpius and Upper-Centaurus-Lupus regions -- and sub-au scale system configurations. We find that Lupus has a non-uniform $i_{\\rm mag}$ distribution and suggest that this results from the preferential elongation of protostellar cores along filamentary axes. Non-uniformity would have significant implications for exoplanet occurrence rate calculations, so future work should explore the longevity of these biases driven by the star-cloud connection.",
      "pdf_url": "https://arxiv.org/pdf/2510.26687.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.10537",
      "title": "EELG1002: A Record-Breaking [OIII]+H$β$ EW $\\sim 3700$Å~Galaxy at $z \\sim 0.8$ -- Analog of Early Galaxies?",
      "authors": [
        "Ali Ahmad Khostovan",
        "Jeyhan S. Kartaltepe",
        "Malte Brinch",
        "Caitlin Casey",
        "Andreas Faisst",
        "Santosh Harish",
        "Ghassem Gozaliasl",
        "Masato Onodera",
        "Kiyoto Yabe"
      ],
      "abstract": "EELG1002: A Record-Breaking [OIII]+H$β$ EW $\\sim 3700$Å~Galaxy at $z \\sim 0.8$ -- Analog of Early Galaxies? Ali Ahmad Khostovan, Jeyhan S. Kartaltepe, Malte Brinch, Caitlin Casey, Andreas Faisst, Santosh Harish, Ghassem Gozaliasl, Masato Onodera, Kiyoto Yabe 27 pages, 9 Figures, 8 Tables. Accepted to ApJ (09/04/2025). Abstract is abridged. All code can be accessed via our github repository (this https URL) Astrophysics of Galaxies (astro-ph.GA) We present a detailed analysis of EELG1002: a $z = 0.8275$ EELG identified within archival Gemini/GMOS spectroscopy as part of the on-going COSMOS Spectroscopic Archive. We find EELG1002 is a low-mass ($\\sim10^{8}$ M$_\\odot$), compact ($\\sim530$ pc), bursty star-forming galaxy with a $\\sim15-35$ Myr mass doubling timescale. EELG1002 has record-breaking rest-frame [O{\\sc iii}]+H$\\beta$~EW $\\sim3100-3700$Å; $\\sim32-36\\times$ higher than typical $z \\sim 0.8$ [O{\\sc iii}]~emitters with similar stellar mass and higher than typical $z > 5$ galaxies. We find no clear evidence of an AGN suggesting the emission lines are star formation driven. EELG1002 is chemically unevolved (direct $T_e$; $12+\\log_{10}(\\textrm{O/H})\\sim7.52$ consistent with $z>5$ galaxies at fixed stellar mass) and may be undergoing a first intense, bursty star formation phase analogous to conditions expected of galaxies in the early Universe. We find evidence for a highly energetic ISM ([O{\\sc iii}]/[O{\\sc ii}]~$\\sim9$) and hard ionizing radiation field (elevated [Ne{\\sc iii}]/[O{\\sc ii}]~at fixed [O{\\sc iii}]/[O{\\sc ii}]). Coupled with its compact, metal-poor, and actively star-forming nature, EELG1002 is found to efficiently produce ionizing photons ($\\xi_\\mathrm{ion}\\sim10^{25.74}~$erg$^{-1}$ Hz) and may have $\\sim10-20\\%~$LyC escape suggesting such sources may be important analogs of galaxies responsible for reionization. We find dynamical mass of $\\sim10^9~$M$_\\odot$~suggesting copious amounts of gas to support intense star formation as also suggested by identified Illustris-TNG analogs. EELG1002 may be an ideal low-$z$ laboratory of galaxies in the early Universe and demonstrates how archival datasets can support high-$z$ science and next-generation surveys planned with \\textit{Euclid} and \\textit{Roman}.",
      "pdf_url": "https://arxiv.org/pdf/2411.10537.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.07598",
      "title": "Radiation-driven dusty outflows from early galaxies",
      "authors": [
        "Yurina Nakazato",
        "Andrea Ferrara"
      ],
      "abstract": "Radiation-driven dusty outflows from early galaxies Yurina Nakazato, Andrea Ferrara 12 pages, 7 figures, resubmitted to MNRAS after second referee report Astrophysics of Galaxies (astro-ph.GA) The James Webb Space Telescope (JWST) has discovered an overabundance of UV-bright ($M_{\\rm UV} \\lesssim -20$), massive galaxies at $z \\gtrsim 10$ in comparison to pre-JWST theoretical predictions. Among the proposed interpretations, such excess has been explained by negligible dust attenuation conditions following radiation-driven outflows launched by young stars when a galaxy goes through a super-Eddington phase. Dust opacity decreases the classical Eddington luminosity by a (boost) factor $A$, thus favoring the driving of outflows by stellar radiation in compact, initially dusty galaxies. Here, we compute $A$ as a function of the galaxy stellar mass, gas fraction, galaxy size, and metallicity (a total of 8 parameters). We find that the main dependence is on metallicity and, for the fiducial model, $A \\sim 1800(Z/Z_\\odot)/(1+N_{\\rm H}/10^{23.5}\\, {\\rm cm^2})$. We apply such results to 20 spectroscopically confirmed galaxies at $z \\gtrsim 10$ and evaluate their modified Eddington ratio. We predict that three galaxies are in the outflow phase. Their outflows have relatively low velocities ($60 -100 \\,{\\rm km\\ s^{-1}}$), implying that they are unlikely to escape from the system. For the remaining 17 galaxies that are not currently in the outflow phase, we calculate the past evolution of the modified Eddington ratio from their star formation history. We find that 15 of them experienced an outflow phase prior to observation during which they effectively displaced their dust to larger radii. Thus, dusty outflows driven by stellar radiation appear to contribute to the observed bright UV galaxies at $z > 10$.",
      "pdf_url": "https://arxiv.org/pdf/2412.07598.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.00120",
      "title": "COSMOS Spectroscopic Redshift Compilation (First Data Release): 488k Redshifts Encompassing Two Decades of Spectroscopy",
      "authors": [
        "Ali Ahmad Khostovan",
        "Jeyhan S. Kartaltepe",
        "Mara Salvato",
        "Olivier Ilbert",
        "Caitlin M. Casey",
        "Hiddo Algera",
        "Jacqueline Antwi-Danso",
        "Andrew Battisti",
        "Malte Brinch",
        "Marcella Brusa",
        "Antonello Calabro",
        "Peter L. Capak",
        "Nima Chartab",
        "Olivia R. Cooper",
        "Isa G. Cox",
        "Behnam Darvish",
        "Nicole E. Drakos",
        "Andreas L. Faisst",
        "Matthew R. George",
        "Ghassem Gozaliasl",
        "Santosh Harish",
        "Gunther Hasinger",
        "Hossein Hatamnia",
        "Angela Iovino",
        "Shuowen Jin",
        "Daichi Kashino",
        "Anton M. Koekemoer",
        "Ronaldo Laishram",
        "Khee-Gan Lee",
        "Jitrapon Lertprasertpong",
        "Simon J. Lilly",
        "Daizhong Liu",
        "Daniel C. Masters",
        "Bahram Mobasher",
        "Tohru Nagao",
        "Masato Onodera",
        "Yingjie Peng",
        "David B. Sanders",
        "Ryan L. Sanders",
        "Zahra Sattari",
        "Nick Scoville",
        "Ekta A. Shah",
        "John D. Silverman",
        "Nao Suzuki",
        "Sina Taamoli",
        "Masayuki Tanaka",
        "Lidia A. M. Tasca",
        "Sune Toft",
        "Greta Toni",
        "Benny Trakhtenbrot",
        "Jonathan R. Trump",
        "Mattia Vaccari",
        "Francesco Valentino",
        "Brittany N. Vanderhoof",
        "John R. Weaver",
        "Min S. Yun",
        "Jorge A. Zavala"
      ],
      "abstract": "COSMOS Spectroscopic Redshift Compilation (First Data Release): 488k Redshifts Encompassing Two Decades of Spectroscopy Ali Ahmad Khostovan, Jeyhan S. Kartaltepe, Mara Salvato, Olivier Ilbert, Caitlin M. Casey, Hiddo Algera, Jacqueline Antwi-Danso, Andrew Battisti, Malte Brinch, Marcella Brusa, Antonello Calabro, Peter L. Capak, Nima Chartab, Olivia R. Cooper, Isa G. Cox, Behnam Darvish, Nicole E. Drakos, Andreas L. Faisst, Matthew R. George, Ghassem Gozaliasl, Santosh Harish, Gunther Hasinger, Hossein Hatamnia, Angela Iovino, Shuowen Jin, Daichi Kashino, Anton M. Koekemoer, Ronaldo Laishram, Khee-Gan Lee, Jitrapon Lertprasertpong, Simon J. Lilly, Daizhong Liu, Daniel C. Masters, Bahram Mobasher, Tohru Nagao, Masato Onodera, Yingjie Peng, David B. Sanders, Ryan L. Sanders, Zahra Sattari, Nick Scoville, Ekta A. Shah, John D. Silverman, Nao Suzuki, Sina Taamoli, Masayuki Tanaka, Lidia A. M. Tasca, Sune Toft, Greta Toni, Benny Trakhtenbrot, Jonathan R. Trump, Mattia Vaccari, Francesco Valentino, Brittany N. Vanderhoof, John R. Weaver, Min S. Yun, Jorge A. Zavala 36 pages, 15 figures, 4 tables. Accepted for publication in ApJS. The compilation is publicly available via our github repository (this https URL) Astrophysics of Galaxies (astro-ph.GA) We present the COSMOS Spectroscopic Redshift Compilation encompassing ~ 20 years of spectroscopic redshifts within a 10 deg$^2$ area centered on the 2 deg$^2$ COSMOS legacy field. This compilation contains 487,666 redshifts of 266,284 unique objects from 138 individual observing programs up to $z \\sim 8$ with median stellar mass $\\sim 10^{8.4}$ to $10^{10}$ M$_\\odot$ (redshift dependent). Rest-frame $NUVrJ$ colors and SFR -- stellar mass correlations show the compilation primarily contains low- to intermediate-mass star-forming and massive, quiescent galaxies at $z < 1.25$ and mostly low-mass bursty star-forming galaxies at $z > 2$. Sources in the compilation cover a diverse range of environments, including protoclusters such as ``Hyperion''. The full compilation is 50\\% spectroscopically complete by $i \\sim 23.4$ and $K_s \\sim 21.6$ mag; however, this is redshift dependent. Spatially, the compilation is $>50$\\% ($>30$\\%) complete within the central (outer) region limited to $i < 24$ mag and $K_s < 22.5$ mag, separately. We demonstrate how the compilation can be used to validate photometric redshifts and investigate calibration metrics. By training self-organizing maps on COSMOS2020/Classic and projecting the compilation onto it, we find key galaxy subpopulations that currently lack spectroscopic coverage including $z < 1$ intermediate-mass quiescent galaxies and low-/intermediate-mass bursty star-forming galaxies, $z \\sim 2$ massive quiescent galaxies, and $z > 3$ massive star-forming galaxies. This highlights how combining self-organizing maps with our compilation can provide guidance for future spectroscopic observations to get a complete spectroscopic view of galaxy populations. Lastly, the compilation will undergo periodic data releases that incorporate new spectroscopic redshift measurements, providing a lasting legacy resource for the community.",
      "pdf_url": "https://arxiv.org/pdf/2503.00120.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.04569",
      "title": "SDSS-V LVM: Detectability of Wolf-Rayet stars and their He II ionizing flux in low-metallicity environments I. The weak-lined, early-type WN3 stars in the SMC",
      "authors": [
        "G. González-Torà",
        "A. A. C. Sander",
        "E. Egorova",
        "R. R. Lefever",
        "V. Ramachandran",
        "O. V. Egorov",
        "J. Josiek",
        "E. C. Schösser",
        "M. Bernini-Peron",
        "K. Kreckel",
        "A. Wofford",
        "O. G. Telford",
        "P. Senchyna",
        "C. Leitherer",
        "F.-H. Liang",
        "G. Blanc",
        "N. Drory",
        "J. G. Fernández-Trincado",
        "E. J. Johnston",
        "A. J. Mejía-Narváez",
        "S. F. Sanchez"
      ],
      "abstract": "SDSS-V LVM: Detectability of Wolf-Rayet stars and their He II ionizing flux in low-metallicity environments I. The weak-lined, early-type WN3 stars in the SMC G. González-Torà, A. A. C. Sander, E. Egorova, R. R. Lefever, V. Ramachandran, O. V. Egorov, J. Josiek, E. C. Schösser, M. Bernini-Peron, K. Kreckel, A. Wofford, O. G. Telford, P. Senchyna, C. Leitherer, F.-H. Liang, G. Blanc, N. Drory, J. G. Fernández-Trincado, E. J. Johnston, A. J. Mejía-Narváez, S. F. Sanchez Astrophysics of Galaxies (astro-ph.GA) The Small Magellanic Cloud (SMC) is the nearest low-metallicity dwarf galaxy. Its proximity and low reddening has enabled us to detect its Wolf-Rayet (WR) star population with 12 known objects. Quantitative spectroscopy of the stars revealed half of these WR stars to be strong sources of He ii ionizing flux, but the average metallicity of the SMC is below where WR bumps are usually detected in integrated galaxy spectra showing nebular He ii emission. Utilizing the Local Volume Mapper (LVM), we investigate regions around the six SMC WN3h stars, whose winds are thin enough to avoid He recombination and allow photons with > 54 eV to escape. Focusing on He ii 4686 Å, we show that the broad stellar wind component, the strongest optical diagnostic of the WN3h stars, is diluted within 24 pc in the integrated light from LVM, making the WR stars hard to detect in low-metallicity integrated regions. In addition, we compare the He ii ionizing flux from LVM with the values inferred from the stellar atmosphere code PoWR and find that the nebular emission around them only in some cases reflects the high amounts emitted by the stars. We conclude that early-type WN stars with comparably weak winds are viable sources to produce the observed He ii ionizing flux in low-metallicity galaxies. The easy dilution of the stellar signatures can explain the rareness of WR bump detections at 12 + log O/H < 8.0, while at the same time providing major candidates for the observed excess of nebular He ii emission. This constitutes a challenge for population synthesis models across all redshifts as the evolutionary path towards this observed WR population at low metallicity remains enigmatic.",
      "pdf_url": "https://arxiv.org/pdf/2509.04569.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07100",
      "title": "AGN-heated dust revealed in \"Little Red Dots\"",
      "authors": [
        "I. Delvecchio",
        "E. Daddi",
        "B. Magnelli",
        "D. Elbaz",
        "M. Giavalisco",
        "A. Traina",
        "G. Lanzuisi",
        "H. B. Akins",
        "S. Belli",
        "C. M. Casey",
        "F. Gentile",
        "C. Gruppioni",
        "F. Pozzi",
        "G. Zamorani"
      ],
      "abstract": "AGN-heated dust revealed in \"Little Red Dots\" I. Delvecchio, E. Daddi, B. Magnelli, D. Elbaz, M. Giavalisco, A. Traina, G. Lanzuisi, H. B. Akins, S. Belli, C. M. Casey, F. Gentile, C. Gruppioni, F. Pozzi, G. Zamorani Accepted for publication in A&A. 8 pages + Appendix Astrophysics of Galaxies (astro-ph.GA) Little Red Dots (LRDs) are a puzzling population of extragalactic sources whose origin is highly debated. In this work, we perform a comprehensive stacking analysis of NIRCam, MIRI and ALMA images of a large and homogeneously-selected sample of LRDs from multiple JWST Legacy fields. We report clear evidence for hot-dust emission in the median stacked spectral energy distribution (SED), featuring a rising near-infrared continuum up to rest-frame $\\lambda_{\\rm rest}$$\\sim$~3$\\mu$m, which is best explained by a standard dusty AGN structure. Although LRDs are likely a heterogeneous population, our findings suggest that most ($\\gtrsim$50\\%) LRDs show AGN-heated dust emission, regardless of whether the Optical/Ultraviolet (UV) continuum is stellar or AGN-dominated. In either case, the best-fit dusty-AGN SED, combined with the lack of X-ray detection in the deep Chandra stacks, suggests that Compton-thick ($N_{\\rm H}$$>$3$\\times$10$^{24}$ cm$^{-2}$) gas obscuration is common, and likely confined within the dust sublimation radius ($R$$_{\\rm sub}$$\\sim$0.1 pc). Therefore, we argue that AGN-heated dust does not directly obscure either the Optical/UV continuum or the broad-line region emission, in order to explain the observed blue UV slopes and prominent Balmer features. While a gas-dust displacement is in line with several models, the formation scenario (in-situ or ex-situ) of this pre-enriched hot dust remains unclear.",
      "pdf_url": "https://arxiv.org/pdf/2509.07100.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25538",
      "title": "Filamentary accretion flows in high-mass star-forming clouds",
      "authors": [
        "J.-E. Schneider",
        "H. Beuther",
        "C. Gieser",
        "S. Jiao",
        "M.R.A. Wells",
        "R. Klessen",
        "S. Feng",
        "P. Klaassen",
        "M. T. Beltran",
        "R. Cesaroni",
        "S. Leurini",
        "J.S. Urquhart",
        "A. Palau",
        "R. Pudritz"
      ],
      "abstract": "Filamentary accretion flows in high-mass star-forming clouds J.-E. Schneider, H. Beuther, C. Gieser, S. Jiao, M.R.A. Wells, R. Klessen, S. Feng, P. Klaassen, M. T. Beltran, R. Cesaroni, S. Leurini, J.S. Urquhart, A. Palau, R. Pudritz Accepted for publication in A&A, 20 pages Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We quantify the gas flows from a scale of up to several parsecs down to the sub-parsec scale along filamentary structures in the three high-mass star-forming regions G75.78, IRAS21078+5211 and NGC7538 with data obtained from the IRAM 30 m telescope. The analysis is carried out using the surface density derived from 1.2 mm continuum emission and velocity differences estimated from HCO$^+$ and H$^{13}$CO$^+$ molecular line data.",
      "pdf_url": "https://arxiv.org/pdf/2510.25538.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.03508",
      "title": "Identifying Astrophysical Anomalies in 99.6 Million Cutouts from the Hubble Legacy Archive Using AnomalyMatch",
      "authors": [
        "David O'Ryan",
        "Pablo Gómez"
      ],
      "abstract": "Identifying Astrophysical Anomalies in 99.6 Million Cutouts from the Hubble Legacy Archive Using AnomalyMatch David O'Ryan, Pablo Gómez 15 pages - 12 figures - Accepted for publication in A&A Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) Astronomical archives contain vast quantities of unexplored data that potentially harbour rare and scientifically valuable cosmic phenomena. We leverage new semi-supervised methods to extract such objects from the Hubble Legacy Archive. We have systematically searched approximately 100 million image cutouts from the entire Hubble Legacy Archive using the recently developed AnomalyMatch method, which combines semi-supervised and active learning techniques for the efficient detection of astrophysical anomalies. This comprehensive search rapidly uncovered a multitude of astrophysical anomalies presented here that significantly expand the inventory of known rare objects. Among our discoveries are 138 new candidate gravitational lenses, 18 jellyfish galaxies, and 417 mergers or interacting galaxies. The efficiency and accuracy of our iterative detection strategy allows us to trawl the complete archive within just 2-3 days, highlighting its potential for large-scale astronomical surveys. We present a detailed overview of these newly identified objects, discuss their astrophysical significance, and demonstrate the considerable potential of AnomalyMatch to efficiently explore extensive astronomical datasets, including, e.g., upcoming Euclid data releases.",
      "pdf_url": "https://arxiv.org/pdf/2505.03508.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16191",
      "title": "Binary-lens Microlensing Degeneracy: Impact on Planetary Sensitivity and Mass-ratio Function",
      "authors": [
        "Yuxin Shang",
        "Hongjing Yang",
        "Jiyuan Zhang",
        "Shude Mao",
        "Andrew Gould",
        "Weicheng Zang",
        "Qiyue Qian",
        "Jennifer C. Yee"
      ],
      "abstract": "Binary-lens Microlensing Degeneracy: Impact on Planetary Sensitivity and Mass-ratio Function Yuxin Shang, Hongjing Yang, Jiyuan Zhang, Shude Mao, Andrew Gould, Weicheng Zang, Qiyue Qian, Jennifer C. Yee 19 pages, 9 figures, accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Gravitational microlensing is a unique method for discovering cold planets across a broad mass range. Reliable statistics of the microlensing planets require accurate sensitivity estimates. However, the impact of the degeneracies in binary-lens single-source (2L1S) models that affect many actual planet detections is often omitted in sensitivity estimates, leading to potential self-inconsistency of the statistics studies. In this work, we evaluate the effect of the 2L1S degeneracies on planetary sensitivity by simulating a series of typical microlensing events and comprehensively replicating a realistic planet detection pipeline, including the anomaly identification, global 2L1S model search, and degenerate model comparison. We find that for a pure-survey statistical sample, the 2L1S degeneracies reduce the overall planetary sensitivity by $5\\sim10\\%$, with the effect increasing at higher planet-host mass ratios. This bias leads to an underestimation of planet occurrence rates and a flattening of the inferred mass-ratio function slope. This effect will be critical for upcoming space-based microlensing surveys like the Roman or Earth 2.0 missions, which are expected to discover $\\mathcal{O}(10^3)$ planets. We also discuss the computational challenges and propose potential approaches for future applications.",
      "pdf_url": "https://arxiv.org/pdf/2509.16191.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25812",
      "title": "Tidally driven inertial waves enhance eccentricity damping and spin evolution in planets and stars",
      "authors": [
        "Janosz W. Dewberry"
      ],
      "abstract": "Tidally driven inertial waves enhance eccentricity damping and spin evolution in planets and stars Janosz W. Dewberry 20 pages, 14 figures, accepted for publication in ApJ (comments welcome) Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Tidal interactions influence the orbital motions of binary star systems and extrasolar planets alike. Tides also affect stellar and planetary rotation rates. We demonstrate that in addition to altering spin synchronization and pseudosynchronization, tidally driven inertial waves in the convective envelopes of low-mass stars and gas giant planets can enhance tidal eccentricity damping. Analytically, we find that eccentricity damping by inertial waves can be orders of magnitude faster than equilibrium tides, independent of any eddy viscosity prescription. We use simplified numerical experiments to demonstrate this enhancement, and to explore the effects of different mixing length treatments of convective turbulence, as well as a spin-down torque from magnetic braking. These calculations demonstrate that tidally driven inertial waves can produce an extended cool core of nearly circular binaries, helping to reconcile a longstanding discrepancy between observed and predicted main-sequence binary circularization. Our calculations additionally suggest that tidally driven inertial waves may leave identifiable signatures in the ratios of orbital to rotation periods for stellar binaries, including synchronous and sub-synchronous rotation periods reminiscent of populations identified in Kepler, TESS, and Gaia data.",
      "pdf_url": "https://arxiv.org/pdf/2510.25812.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25862",
      "title": "WOCS XCIII: NGC 7789: the Evolution of Li, Stellar Rotation, and Extended Main Sequence Turnoffs",
      "authors": [
        "Barbara J. Anthony-Twarog",
        "Samantha W. Brunker",
        "Constantine P. Deliyannis",
        "Evan Rich",
        "Aaron Steinhauer",
        "Qinghui Sun",
        "Bruce A. Twarog"
      ],
      "abstract": "WOCS XCIII: NGC 7789: the Evolution of Li, Stellar Rotation, and Extended Main Sequence Turnoffs Barbara J. Anthony-Twarog, Samantha W. Brunker, Constantine P. Deliyannis, Evan Rich, Aaron Steinhauer, Qinghui Sun, Bruce A. Twarog 37 pages, 5 tables, 13 figures. Accepted for Astronomical Journal Solar and Stellar Astrophysics (astro-ph.SR) Precision UBVRI photometry of NGC 7789 is combined with Gaia data to map reddening variations across the cluster face. HYDRA spectra, Gaia astrometry, and isochrone fitting constrain the absolute reddening, apparent modulus, and age to E(B-V) = 0.30 +/- 0.02, (m-M)=12.51 +/- 0.06, and 1.46 +/- 0.02 Gyr for [Fe/H] between -0.2 and solar; the spectroscopic [Fe/H] = -0.13 +/- 0.068 (MAD) from 156 single-star members. Corrections for variable reddening reduce the scatter in the unevolved main sequence below the turnoff. A(Li) is derived for only single star members from the G-dwarf Li-Plateau to the tip of the red giant branch. Giants separate into two distinct groups, probable first-ascent giants with detectable Li that declines with evolution toward the red giant tip and stars within the clump and the asymptotic giant branch which only exhibit upper limits. A(Li) structure from the turnoff to the unevolved main sequence, including the Li-Dip, and the presence of an extended color spread among the upper main sequence stars are attributed to the V_ROT distribution, indicating the wall of the Li-Dip as the true hot boundary of the Kraft break. Differences in the color-magnitude diagram topology of NGC 7789 and NGC 752 are explored and attributed to differences in the individual cluster V_ROT distributions. Prior indications that main sequence stars more massive than the Li-Dip evolve redward across the Li-Wall, undergoing rotational spindown and Li depletion like stars within the Li-Dip, are confirmed.",
      "pdf_url": "https://arxiv.org/pdf/2510.25862.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25871",
      "title": "New Pipeline for Efficient Analysis of Large Spectroscopic Samples of OB Stars",
      "authors": [
        "PA Crowther",
        "JM Bestenlehner"
      ],
      "abstract": "New Pipeline for Efficient Analysis of Large Spectroscopic Samples of OB Stars PA Crowther, JM Bestenlehner 5 pages, 3 figures, contributed paper for IAU Symposium 402 \"Massive Stars Across Redshifts in the Era of JWST and Large-Scale Surveys\" Solar and Stellar Astrophysics (astro-ph.SR) We present a new spectroscopic pipeline designed to analyse large numbers of hot massive stars homogeneously. The pipeline has been developed to utilise large grids of FASTWIND non-LTE, line blanketed models in which spherical geometry is adopted, and uniquely incorporates model errors. The pipeline has been applied to three contemporary datasets involving Very Large Telescope spectroscopy of OB stars in the Magellanic Clouds, namely the VLT FLAMES Tarantula Survey (VFTS), XShooting-ULLYSES (XShootU) and Binaries at Low Metallicity (BLOeM). We find satisfactory agreement with previous detailed temperatures and surface gravities, although strong nebular contamination, binarity and disk emission from OBe stars are problematic for automatic pipelines, requiring visual inspection of fits. The tool has been incorporated into the pipeline for the VISTA/4MOST pipeline.",
      "pdf_url": "https://arxiv.org/pdf/2510.25871.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26220",
      "title": "A new particle-based code for Lagrangian stochastic models applied to stellar turbulent convection",
      "authors": [
        "J. Philidet",
        "K. Belkacem"
      ],
      "abstract": "A new particle-based code for Lagrangian stochastic models applied to stellar turbulent convection J. Philidet, K. Belkacem Accepted for publication in Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); Fluid Dynamics (physics.flu-dyn) The inclusion of convection in stellar evolution models lacks realism, especially near convective-radiative interfaces. Furthermore, the interaction of convection with oscillations prevent us from accurately predicting seismic frequencies, and therefore from fully exploiting the asteroseismic data of low-mass stars. We aim to develop a new formalism to model the one-point statistics of stellar convection, to implement it in a new numerical code, and to validate this implementation against benchmark cases. This new formalism is based on Lagrangian Probability Density Function (PDF) methods, where a Fokker-Planck equation for the PDF of particle-based turbulent properties is integrated in time. We then develop a Monte-Carlo implementation of this method, where the flow is represented by a large number of notional particles acting as realisations of the PDF. Notional particles interact with each other through the time- and space-dependent mean flow, which is estimated from the particle realisations through a scheme similar to Smoothed Particle Hydrodynamics. We establish a model for the evolution of turbulent properties along Lagrangian trajectories applicable to stellar turbulent convection, with only a minimal number of physical assumptions necessary to close the system. In particular, no closure is needed for the non-linear advection terms, which are included exactly through the Lagrangian nature of formalism. The numerical implementation of this new formalism allows us to extract time-dependent maps of the statistical properties of turbulent convection in a way which is not possible in grid-based large-eddy simulations, in particular the turbulent pressure, Reynolds stress tensor, internal energy variance and convective flux.",
      "pdf_url": "https://arxiv.org/pdf/2510.26220.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26224",
      "title": "Stellar Parameters and Evolutionary Pathways of the Subgiant system HIP 72217",
      "authors": [
        "Naufa Nazar",
        "Mashhoor A. Al-Wardat",
        "Ahmad Abushattal",
        "Hassan B. Haboubi"
      ],
      "abstract": "Stellar Parameters and Evolutionary Pathways of the Subgiant system HIP 72217 Naufa Nazar, Mashhoor A. Al-Wardat, Ahmad Abushattal, Hassan B. Haboubi Solar and Stellar Astrophysics (astro-ph.SR) In this study, we applied Al-Wardat's method to analyze the subgiant system HIP72217 for which we obtained accurate parameters including stellar masses, effective temperatures ($T_{\\text{eff}}$) and system this http URL the primary component we determined a stellar mass of $M_A = 1.14 \\pm 0.15\\,M_{\\odot}$ and effective temperature $T_{\\text{eff,A}} = 6125 \\pm 50$\\,K while for the secondary component we obtained the values of $M_B = 1.12 \\pm 0.14\\,M_{\\odot}$ and $T_{\\text{eff,2}} = 5950 \\pm 50$\\,K. The system's age was estimated to be $3.548 Gyr$, which is consistent with the predicted evolutionary period of a subgiant binary. The evolutionary timeline of HIP\\,72217 becomes clearer through our study, which also demonstrates Al-Wardat's approach as an effective approach for binary star system characterization. These findings contribute to a better understanding of the physical mechanisms that control subgiant binary evolution and their broader role in stellar evolutionary processes.",
      "pdf_url": "https://arxiv.org/pdf/2510.26224.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26250",
      "title": "Theoretical models for the Late Thermal Pulse in post-AGB stars: the case of DY Cen",
      "authors": [
        "Zhongyang Liu",
        "C. Simon Jeffery",
        "Xianfei Zhang",
        "Shaolan Bi",
        "Tanda Li"
      ],
      "abstract": "Theoretical models for the Late Thermal Pulse in post-AGB stars: the case of DY Cen Zhongyang Liu, C. Simon Jeffery, Xianfei Zhang, Shaolan Bi, Tanda Li Solar and Stellar Astrophysics (astro-ph.SR) We present theoretical predictions of the born-again scenario for post-asymptotic giant-branch stars. An extensive model grid for born-again objects has been constructed, particularly including models for the Very Late Thermal Pulse with and without convective overshooting, and also including models for the Late Thermal Pulse. We constructed a large parameter space to analyze the dependencies of the born-again model on core mass, hydrogen-envelope mass, and overshoot parameters, and we analyzed how changes in these parameters affect the models' evolution. We applied our grid of models to interpret observations of DY\\,Cen, a star exhibiting characteristics similar to confirmed born-again stars. We compared DY\\,Cen with models from multiple aspects, including heating rate, evolutionary tracks, and surface abundances. Ultimately, we concluded that none of our born-again models could match all of the observed properties of DY\\,Cen, especially its surface chemistry; DY\\,Cen is therefore an unlikely born-again star.",
      "pdf_url": "https://arxiv.org/pdf/2510.26250.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26306",
      "title": "Apsidal Motion in O-Star Binaries: GENEC rotating binary models put to the k2-test",
      "authors": [
        "Sophie Rosu",
        "Luca Sciarini",
        "Sylvia Ekström",
        "Raphaël Hirschi"
      ],
      "abstract": "Apsidal Motion in O-Star Binaries: GENEC rotating binary models put to the k2-test Sophie Rosu, Luca Sciarini, Sylvia Ekström, Raphaël Hirschi Proceedings of the IAU Symposium 402: Massive Stars Across Redshifts in the Era of JWST and Large-Scale Surveys Solar and Stellar Astrophysics (astro-ph.SR) Unveiling massive stars' internal structure and the physical origin and efficiency of the internal mixing processes? It is now possible using the apsidal motion rate in close eccentric binaries! The apsidal motion rate depends on the tidal interactions occurring between the stars and is proportional to k2, a measure of the star's inner density profile. Confronting standard stellar models with observations reveals the famous k2-discrepancy: models predict too high a k2 for the stars, that is to say, stars with too low a density contrast between their core and envelope. We built bespoke GENEC stellar evolution models including tidal mixing for the twin massive binary HD 152248. The models reveal the instabilities allowing to reproduce the stellar density profiles: advecto-diffusive models better reproduce k2 than magnetic models. A large overshooting is necessary to converge towards the observed k2, yet alone is not sufficient. While a change in metallicity or mass-loss rate has no significant impact on k2, a larger initial helium abundance allows us to better reproduce the k2. Yet, a super-solar helium abundance is not observationally supported. Our analyses highlight the need for a process in the stars that slows down the radial expansion.",
      "pdf_url": "https://arxiv.org/pdf/2510.26306.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26385",
      "title": "The light curve model fitting of LMC Cepheids: MESA-RSP versus Stellingwerf's code predictions",
      "authors": [
        "M. Deka",
        "M. Marconi",
        "R. Molinaro",
        "G. De Somma",
        "A. Bhardwaj",
        "E. Trentin",
        "S. Deb",
        "T. Sicignano",
        "I. Musella",
        "V. Ripepi",
        "E. Luongo",
        "Shashi M. Kanbur"
      ],
      "abstract": "The light curve model fitting of LMC Cepheids: MESA-RSP versus Stellingwerf's code predictions M. Deka, M. Marconi, R. Molinaro, G. De Somma, A. Bhardwaj, E. Trentin, S. Deb, T. Sicignano, I. Musella, V. Ripepi, E. Luongo, Shashi M. Kanbur Accepted for publication in A&A, 11 Figures, 5 Tables Solar and Stellar Astrophysics (astro-ph.SR) A major challenge in modeling classical Cepheids is the treatment of convection, particularly its complex interplay with pulsation. This inherently three-dimensional process is typically approximated in one-dimensional hydrocodes using dimensionless turbulent convection (TC) free parameters. Calibrating these parameters is essential for reproducing key observational features such as light-curve amplitudes, secondary bumps, and the red edge of the instability strip. In this work, we calibrate TC parameters adopted in the publicly available MESA-RSP code through comparison with both observational data of classical Cepheids and stellar parameter constraints from the Stellingwerf code. We compute multi-band (V, I, and Ks) MESA-RSP light curves for 18 observed Large Magellanic Cloud Cepheids, using stellar parameters determined from the Stellingwerf code. By fine-tuning the mixing-length and eddy viscosity parameters, we calibrate the TC treatment in MESA-RSP. We then compare the resulting period-luminosity (PL), period-radius (PR), and period-mass-radius (PMR) relations with predictions from the Stellingwerf models. We successfully reproduce multi-band light curves and obtain PL, PR, and PMR relations consistent with Ragosta et al. (2019). While in broad agreement with previous work, we explicitly identify distinct mass-luminosity (ML) relations for fundamental-mode and first-overtone Cepheids for the first time. This suggests that the macroscopic processes affecting the ML relation depend on stellar mass and/or effective temperature range. Although our study focuses on the calibration of TC parameters, we do not find a single set of parameter values that reproduces all light curves. No statistically significant correlation is found between stellar properties and convection parameters, although subtle trends with period and effective temperature may be present.",
      "pdf_url": "https://arxiv.org/pdf/2510.26385.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26449",
      "title": "The dance of dust: Investigating young stellar object dipper variability",
      "authors": [
        "A. Empey",
        "R. Garcia Lopez",
        "A. Natta",
        "C.F. Manara",
        "M. Benisty",
        "R. Claes",
        "P. McGinnis"
      ],
      "abstract": "The dance of dust: Investigating young stellar object dipper variability A. Empey, R. Garcia Lopez, A. Natta, C.F. Manara, M. Benisty, R. Claes, P. McGinnis Accepted for publication in Astronomy & Astrophysics (A&A) Solar and Stellar Astrophysics (astro-ph.SR) The dipper subclass of YSOs are characterised by frequent dips in their light curves. Irregular dippers do not show periodic signatures and have dips accounting for significant proportions of their photospheric flux. Given the short timescales on which these dips occur, their driving mechanisms are linked to the inner circumstellar disc dynamics. We present the first multi-epoch analysis of 16 irregular dippers observed with X-Shooter. Investigating the properties of their dips, and in particular the analysis of the dust characteristics, we aim to understand the root of their variability, and get a glimpse of the inner disc behaviour. We employed a novel approach to measure the properties of the dips, by combining class III templates with Gaia photometry to construct the intrinsic photospheres. We measured several dip properties including the depth of the dips, near-infrared (NIR) excesses, and their optical depths as a function of wavelength. We record 20 significant dips that range in their dip properties and show no relation to one another. In almost all cases, the low optical depths and small NIR excesses are observed. Comparison of their optical depths with grain opacity models show that the dips can be explained by the presence of dust substructures containing processed grains obscuring their photospheres and/or their discs. These grain distributions can have maximum sizes as large as 20$\\mu m$ and in many cases have almost grey-like extinction, while some require a strong scattering component. The findings highlight the extent of the irregularity of dippers, but also link it to the dust dynamics in the inner regions of circumstellar discs. The dust substructures causing the variability require processed dust grains to be lifted above the disc into the line of sight. Possible lifting mechanisms including disc winds, unstable accretion columns, and disc warps are discussed.",
      "pdf_url": "https://arxiv.org/pdf/2510.26449.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26674",
      "title": "Investigating episodic mass loss in evolved massive stars IV. Comprehensive analysis of dusty red supergiants in NGC 6822, IC 10, and WLM",
      "authors": [
        "E. Christodoulou , S. de Wit , A.Z. Bonanos , G. Muñoz-Sanchez , G. Maravelias , A. Ruiz , K. Antoniadis , D. García-Álvarez , M.M. Rubio Díez IAASARS, National Observatory of Athens, National and Kapodistrian University of Athens, Department of Physics, Institute of Astrophysics FORTH, Instituto de Astrofísica de Canarias, Grantecan S. A., Centro de Astrofísica de La Palma, Centro de Astrobiología, CSIC-INTA)"
      ],
      "abstract": "Investigating episodic mass loss in evolved massive stars IV. Comprehensive analysis of dusty red supergiants in NGC 6822, IC 10, and WLM E. Christodoulou (1 and 2), S. de Wit (1 and 2), A.Z. Bonanos (1), G. Muñoz-Sanchez (1 and 2), G. Maravelias (1 and 3), A. Ruiz (1), K. Antoniadis (1 and 2), D. García-Álvarez (4 and 5), M.M. Rubio Díez (6) ((1) IAASARS, National Observatory of Athens, (2) National and Kapodistrian University of Athens, Department of Physics, (3) Institute of Astrophysics FORTH, (4) Instituto de Astrofísica de Canarias, (5) Grantecan S. A., Centro de Astrofísica de La Palma, (6) Centro de Astrobiología, CSIC-INTA) 21 pages, 9 figures in main text and 15 in the appendix, accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) Mass loss shapes the fate of massive stars; however, the physical mechanism causing it remains uncertain. We present a comprehensive analysis of seven red supergiants, for which we searched evidence of episodic mass loss, in three low-metallicity galaxies: NGC~6822, IC~10, and WLM. Initially, the spectral classification of their optical spectra was refined and compared to previous reported classifications, finding four sources that display spectral variability. We derived the physical properties of five of them using the \\textsc{marcs} atmospheric models corrected for nonlocal thermal equilibrium effects to measure stellar properties from our new near-infrared spectra, such as the effective temperature, surface gravity, metallicity, and microturbulent velocity. Additional empirical and theoretical methods were employed to calculate effective temperatures, finding consistent results. We constructed optical and infrared light curves, discovering two targets in NGC~6822 with photometric variability between 1 and 2.5 mag in amplitude in r and ~ 0.5 mag in the mid-infrared. Furthermore, we discovered a candidate-dimming event in one of these sources. Periods for three red supergiants were determined using epoch photometry, which were consistent with the empirical estimations from literature period-luminosity relations. Our comprehensive analysis of all the available data for each target provides evidence for episodic mass loss in four red supergiants.",
      "pdf_url": "https://arxiv.org/pdf/2510.26674.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26682",
      "title": "An extremely fast fading population II dwarf nova candidate: caught spectroscopically on the rise",
      "authors": [
        "Natasha Van Bemmel",
        "Jielai Zhang",
        "Jeff Cooke",
        "Anais Möller",
        "Igor Andreoni",
        "Katie Auchettl",
        "David Buckley",
        "Jonathan Carney",
        "Dougal Dobie",
        "James Freeburn",
        "Bruce Gendre",
        "Vanshika Kansal",
        "Itumeleng Monageng",
        "Arne Rau",
        "Nikita Rawat",
        "Mark Suhr",
        "Edward Taylor"
      ],
      "abstract": "An extremely fast fading population II dwarf nova candidate: caught spectroscopically on the rise Natasha Van Bemmel, Jielai Zhang, Jeff Cooke, Anais Möller, Igor Andreoni, Katie Auchettl, David Buckley, Jonathan Carney, Dougal Dobie, James Freeburn, Bruce Gendre, Vanshika Kansal, Itumeleng Monageng, Arne Rau, Nikita Rawat, Mark Suhr, Edward Taylor 10 pages, 9 figures, 3 tables, submitted to MNRAS Solar and Stellar Astrophysics (astro-ph.SR) We present AT2022kak, a rapidly evolving optical transient discovered by the KiloNova and Transients Program (KNTraP). This interesting burst exhibited extremely fast evolution, with a large amplitude blue outburst of m > 3.3 in a single night, and a rapid fade back to quiescence in the following two nights. We deployed a multi-wavelength follow-up campaign, monitoring the object for the next two months, but saw no recurrent burst. Three years later, while observing to get spectroscopy of the object in quiescence, there was a new outburst, enabling the collection of time-resolved spectra of the rise and fade of the outburst. The light curve properties of the first burst and spectra of the second burst are consistent with a dwarf nova. Its fast evolving behaviour makes it one of the fastest and faintest dwarf novae observed. The estimated distance of AT2022kak from the Galactic centre is ~6.6 kpc, with a scale height of ~2 kpc. This scale height places it in the Galactic thick disk, where only very few dwarf novae have been found, and is therefore a potential Population II dwarf novae system.",
      "pdf_url": "https://arxiv.org/pdf/2510.26682.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25905",
      "title": "Ensuring Outcome-Based Curriculum Coherence through Systematic CLO-PLO Alignment and Feedback Loops",
      "authors": [
        "Moncef Derouich"
      ],
      "abstract": "Ensuring Outcome-Based Curriculum Coherence through Systematic CLO-PLO Alignment and Feedback Loops Moncef Derouich This manuscript has been peer-reviewed and accepted for publication in Discover Education Journal (Springer Nature) Physics Education (physics.ed-ph); Solar and Stellar Astrophysics (astro-ph.SR); Mathematical Physics (math-ph); Applied Physics (physics.app-ph) This study proposes a quantitative framework to enhance curriculum coherence through the systematic alignment of Course Learning Outcomes (CLOs) and Program Learning Outcomes (PLOs), contributing to continuous improvement in outcome-based education. Grounded in accreditation standards such as ABET and NCAAA, the model introduces mathematical tools that map exercises, assessment questions, teaching units (TUs), and student assessment components (SACs) to CLOs and PLOs. This dual-layer approach-combining micro-level analysis of assessment elements with macro-level curriculum evaluation-enables detailed tracking of learning outcomes and helps identify misalignments between instructional delivery, assessment strategies, and program objectives. The framework incorporates alignment matrices, weighted relationships, and practical indicators to quantify coherence and evaluate course or program performance. Application of this model reveals gaps in outcome coverage and underscores the importance of realignment, especially when specific PLOs are underrepresented or CLOs are not adequately supported by assessments. The proposed model is practical, adaptable, and scalable, making it suitable for academic programs. Its systematic structure supports institutions in implementing evidence-based curriculum improvements and provides a reliable mechanism for aligning teaching practices with desired learning outcomes. Ultimately, this framework offers a valuable tool for closing the feedback loop between instructional design, assessment execution, and learning outcomes, thus promoting greater transparency, accountability, and educational effectiveness. Institutions that adopt this model can expect to strengthen their quality assurance processes and help ensure that students graduate with the competencies required by academic standards and professional expectations.",
      "pdf_url": "https://arxiv.org/pdf/2510.25905.pdf",
      "categories": [
        "astro-ph.SR",
        "math-ph"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26084",
      "title": "Hot Jupiter Origin and Tidal Evolution Constrained by a Broken Age-Frequency Relation",
      "authors": [
        "Di-Chang Chen",
        "Ji-Wei Xie",
        "Ji-Lin Zhou",
        "Fei Dai",
        "Bo Ma",
        "Songhu Wang",
        "Chao Liu"
      ],
      "abstract": "Hot Jupiter Origin and Tidal Evolution Constrained by a Broken Age-Frequency Relation Di-Chang Chen, Ji-Wei Xie, Ji-Lin Zhou, Fei Dai, Bo Ma, Songhu Wang, Chao Liu Accepted for Publication in Nature astronomy; 4 figures in main text, 7 figures and 3 tables in Methods, and 18 Figures in Supplementary information Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) The discovery of hot Jupiters has challenged the classical planet formation theory. Although various formation mechanisms have been proposed, the dominant channel and relative contributions remain unclear. Furthermore, hot Jupiters offer a unique opportunity to test tidal theory and measure the fundamental tidal quality factor, which is yet to be well-constrained. In this work, based on a hot Jupiter sample around single Sun-like stars with kinematic properties, {we find that the declining trend of their frequency is broken with a ridge at about 2 Gyr, providing direct evidence that hot Jupiters are formed with multiple origins of different timescales. By fitting with the theoretical expectations, we provide a constraint of tidal factor for Sun-like stars, which aligns well with the detected number of hot Jupiters with orbital decay. Moreover, we simultaneously constrain the relative importance of different channels: although the majority of hot Jupiters are formed early, within several tenths of Gyr via 'Early' models (e.g., in-situ formation, disk migration, planet-planet scattering and Kozai-Lidov interaction), a significant portion (about 40%) should be formed late on a relatively long timescale extending up to several Gyr mainly via the secular chaos mechanism, further supported by the obliquity distribution of 'late-arrived' hot Jupiters. Our findings provide a unified framework that reconciles hot Jupiter demographics and long-term evolution with multichannel formation.",
      "pdf_url": "https://arxiv.org/pdf/2510.26084.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26333",
      "title": "{\\sc ampere}: A tool to fit heterogeneous observations consistently",
      "authors": [
        "P. Scicluna",
        "S. Zeegers",
        "J. P. Marshall",
        "F. Kemper",
        "S. Srinivasan T.E. Dharmawardena",
        "L. Fanciullo",
        "O. Morata",
        "A. Trejo-Cruz"
      ],
      "abstract": "{\\sc ampere}: A tool to fit heterogeneous observations consistently P. Scicluna, S. Zeegers, J. P. Marshall, F. Kemper, S. Srinivasan T.E. Dharmawardena, L. Fanciullo, O. Morata, A. Trejo-Cruz Submitted to RAS Techniques and Instruments. 11 pages, 9 figures Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) As astronomy advances and data becomes more complex, models and inference also become more expensive and complex. In this paper we present {\\sc ampere}, which aims to solve this problem using modern inference techniques such as flexible likelihood functions and likelihood-free inference. {\\sc ampere}\\ can be used to do Bayesian inference even with very expensive models (hours of CPU time per model) that do not include all the features of the observations (e.g. missing lines, incomplete descriptions of PSFs, etc). We demonstrate the power of \\ampere\\ using a number of simple models, including inferring the posterior mineralogy of circumstellar dust using a Monte Carlo Radiative Transfer model. {\\sc ampere}\\ reproduces the input parameters well in all cases, and shows that some past studies have tended to underestimate the uncertainties that should be attached to the parameters. {\\sc ampere}\\ can be applied to a wide range of problems, and is particularly well-suited to using expensive models to interpret data.",
      "pdf_url": "https://arxiv.org/pdf/2510.26333.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.14049",
      "title": "What Determines the Brightness of the Magnetically Open Solar Corona?: Insights from Three-dimensional Radiative Magnetohydrodynamic Simulations and Observations",
      "authors": [
        "Haruhisa Iijima"
      ],
      "abstract": "What Determines the Brightness of the Magnetically Open Solar Corona?: Insights from Three-dimensional Radiative Magnetohydrodynamic Simulations and Observations Haruhisa Iijima 21 pages, 15 figures. Accepted for publication in the Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) We investigate the relationship between solar coronal holes and open-field regions using three-dimensional radiative magnetohydrodynamic (MHD) simulations combined with remote-sensing observations from the Solar Dynamics Observatory (SDO). Our numerical simulations reveal that magnetically open regions in the corona can exhibit brightness comparable to quiet regions, challenging the conventional view that open-field regions are inherently dark coronal holes. We find that the coronal brightness is primarily determined by the total energy input from photospheric magnetic activities, such as the small-scale dynamo, rather than differences in dissipative processes within the corona. Using synthesized EUV intensity maps, we show that brightness thresholds commonly used to identify coronal holes may overlook open-field regions, especially at lower spatial resolutions. Observational analysis utilizing SDO/HMI and AIA synoptic maps supports our simulation results, demonstrating that magnetic field extrapolation techniques, such as the Potential Field Source Surface (PFSS) model, are sensitive to the chosen parameters, including the source surface height. We suggest that discrepancies in estimates of open magnetic flux (the ``open flux problem'') arise both from the modeling assumptions in coronal magnetic field extrapolation and systematic biases in solar surface magnetic field observations. Our findings indicate the need for reconsidering criteria used to identify coronal holes as indicators of open-field regions to better characterize the solar open magnetic flux.",
      "pdf_url": "https://arxiv.org/pdf/2504.14049.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.19386",
      "title": "Numerical simulations of oscillations for axisymmetric solar backgrounds with differential rotation and gravity",
      "authors": [
        "Ha Pham",
        "Florian Faucher",
        "Damien Fournier",
        "Hélène Barucq",
        "Laurent Gizon"
      ],
      "abstract": "Numerical simulations of oscillations for axisymmetric solar backgrounds with differential rotation and gravity Ha Pham, Florian Faucher, Damien Fournier, Hélène Barucq, Laurent Gizon Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM); Analysis of PDEs (math.AP) Local helioseismology comprises of imaging and inversion techniques employed to reconstruct the dynamic and interior of the Sun from correlations of oscillations observed on the surface, all of which require modeling solar oscillations and computing Green's kernels. In this context, we implement and investigate the robustness of the Hybridizable Discontinuous Galerkin (HDG) method in solving the equation modeling stellar oscillations for realistic solar backgrounds containing gravity and differential rotation. While a common choice for modeling stellar oscillations is the Galbrun's equation, our working equations are derived from an equivalent variant, involving less regularity in its coefficients, working with Lagrangian displacement and pressure perturbation as unknowns. Under differential rotation and axisymmetric assumption, the system is solved in azimuthal decomposition with the HDG method. Compared to no-gravity approximations, the mathematical nature of the wave operator is now linked to the profile of the solar buoyancy frequency N which encodes gravity, and leads to distinction into regions of elliptic or hyperbolic behavior of the wave operator at zero attenuation. While small attenuation is systematically included to guarantee theoretical well-posedness, the above phenomenon affects the numerical solutions in terms of amplitude and oscillation pattern, and requires a judicious choice of stabilization. We investigate the stabilization of the HDG discretization scheme, and demonstrate its importance to ensure the accuracy of numerical results, which is shown to depend on frequencies relative to N, and on the position of the Dirac source. As validations, the numerical power spectra reproduce accurately the observed effects of the solar rotation on acoustic waves.",
      "pdf_url": "https://arxiv.org/pdf/2508.19386.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM",
        "math.AP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21936",
      "title": "SPYGLASS. VII-A. The Demographics and Ages of Small Nearby Young Associations",
      "authors": [
        "Ronan Kerr",
        "Facundo Peŕez Paolino",
        "Jonathan C. Tan",
        "Joshua S. Speagle",
        "Adam L. Kraus",
        "José G. Fernández-Trincado",
        "Keivan G. Stassun",
        "Julio Chanamé"
      ],
      "abstract": "SPYGLASS. VII-A. The Demographics and Ages of Small Nearby Young Associations Ronan Kerr, Facundo Peŕez Paolino, Jonathan C. Tan, Joshua S. Speagle, Adam L. Kraus, José G. Fernández-Trincado, Keivan G. Stassun, Julio Chanamé Solar and Stellar Astrophysics (astro-ph.SR) Recent Gaia-based young stellar association surveys have revealed dozens of low-mass populations that have, until recently, been too small or sparse to detect. These populations represent a largely unstudied demographic with unknown origins, and their relative isolation may minimize gravitational disruptions that impact traceback, making them compelling targets for dynamical studies. In this paper, we survey 15 of these isolated young associations for the first time: Andromeda South (SCYA-97), Aquila East, Aries South (SCYA-104), Cassiopeia East (SCYA-43), Canis Major North, Leo Central (SCYA-2), Leo East (SCYA-3), Theia 72, Ophiuchus Southeast, Scutum North (SCYA-70), Taurus-Orion 1 (TOR1), Theia 78, Vulpecula East (UPK 88), SCYA-54, and SCYA-79. By combining Gaia astrometry and photometry with new ground-based spectroscopic measurements, we assess the membership of each population, search for substructure, analyze their demographics, and compute ages. We find that the smallest populations in our sample contain $<20$ $M_{\\odot}$ of stellar mass, making them the smallest associations ever detected. Four host substantial substructure, including TOR1, where we discover TOR1B, a new 9 $M_{\\odot}$ association with radial velocities inconsistent with an origin in the parent complex. Using PARSEC isochrones, we produce self-consistent ages for all populations supported by dynamical and lithium depletion ages, which range from 6.9 $\\pm$ 0.5 Myr in TOR1 to 42.8 $\\pm$ 2.4 in AndS. Our results provide the first detailed overview of the properties of these populations, characterizing a largely unknown category of young associations that may have an important role in tracing the processes that guide local star formation.",
      "pdf_url": "https://arxiv.org/pdf/2510.21936.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25230",
      "title": "Probing the Physical and Chemical Characteristics of an Extremely Early Class 0 Protostar in G204.4-11.3A2-NE",
      "authors": [
        "Hsuan-I Chou",
        "Naomi Hirano",
        "Masayuki Yamaguchi"
      ],
      "abstract": "Probing the Physical and Chemical Characteristics of an Extremely Early Class 0 Protostar in G204.4-11.3A2-NE Hsuan-I (Ethan)Chou, Naomi Hirano, Masayuki Yamaguchi Solar and Stellar Astrophysics (astro-ph.SR) We have observed the low-mass molecular cloud core G204.4-11.3A2-NE (G204NE) in the direction of Orion B giant molecular cloud with the Atacama Large Millimeter/submillimeter Array in Band 6. The $\\rm 1.3\\ mm$ continuum images and visibilities unveil a compact central structure with a radius of $\\sim$12 au, while showing no signature of binarity down to 18 au. The bolometric temperature and luminosity of this source are derived to be ${\\sim}$33 K and $\\sim$1.15 $~L_{\\odot}$, respectively. Chemical stratification is observed in dense gas tracers, with C$^{18}$O emission peaking at the continuum position surrounded by the spatially extended emission of N$_2$D$^+$ and DCO$^+$. This implies that the core is in a very early evolutionary stage in which $\\rm CO$ depletion occurs in most regions except for a small area heated by the central source. The envelope kinematics indicates a rotating and infalling structure with a central protostar mass of 0.08-0.1 $M_{\\odot}$. The protostar drives a collimated outflow traced by CO, SiO, SO, and H$_2$CO, with misaligned blueshifted and redshifted lobes exhibiting a pair of bow-like patterns. High-velocity jets, extending up to 720 au, are detected in CO, SiO, and SO lines. The jet launching region is likely within twice of the dust sublimation zone. The absence of a binary signature suggests the outflows and jets are driven by a single protostar, although a close binary cannot be ruled out. The observed deflection of the outflows and jet is likely due to turbulent accretion in a moderately magnetized core.",
      "pdf_url": "https://arxiv.org/pdf/2510.25230.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.17843",
      "title": "Planetary Obliquity Excitation Through Pre-Main Sequence Stellar Evolution",
      "authors": [
        "Sidhant Kumar Suar",
        "Sarah C. Millholland"
      ],
      "abstract": "Planetary Obliquity Excitation Through Pre-Main Sequence Stellar Evolution Sidhant Kumar Suar, Sarah C. Millholland Sidhant Kumar Suar and Sarah C. Millholland 2025 ApJ 989 111 Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) A planet's axial tilt (\"obliquity\") substantially affects its atmosphere and habitability. It is thus essential to comprehend the various mechanisms that can excite planetary obliquities, particularly at the primordial stage. Here, we explore planetary obliquity excitation induced by the early evolution of the host star. A young, distended star spins rapidly, resulting in a large gravitational quadrupole moment that induces nodal recession of the planet's orbit. As the star contracts and spins down, the nodal recession frequency decreases and can cross the planet's spin axis precession frequency. An adiabatic encounter results in the planet's capture into a secular spin-orbit resonance and excites the obliquity to large values. We find planets within $a \\lesssim 1 \\ \\mathrm{AU}$ are most affected, but adiabatic capture depends on the initial stellar radius and spin rate. The overall picture is complicated by other sources of perturbation, including the disk, multiple planets, and tidal dissipation. Tides make it such that stellar oblateness-induced obliquity excitation is transient since tidal perturbations cause the resonance to break once high obliquities are reached. However, this early transient excitation is important because it can prime planets for long-term capture in a secular spin-orbit resonance induced by planet-planet interactions. Thus, although stellar oblateness-induced resonances are short-lived, they facilitate the prevalence of long-lived non-zero obliquities in exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2506.17843.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25774",
      "title": "Pulsar Detection with Deep Learning",
      "authors": [
        "Manideep Pendyala"
      ],
      "abstract": "Pulsar Detection with Deep Learning Manideep Pendyala Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Pulsar surveys generate millions of candidates per run, overwhelming manual inspection. This thesis builds a deep learning pipeline for radio pulsar candidate selection that fuses array-derived features with image diagnostics. From approximately 500 GB of Giant Metrewave Radio Telescope (GMRT) data, raw voltages are converted to filterbanks (SIGPROC), then de-dispersed and folded across trial dispersion measures (PRESTO) to produce approximately 32,000 candidates. Each candidate yields four diagnostics--summed profile, time vs. phase, subbands vs. phase, and DM curve--represented as arrays and images. A baseline stacked model (ANNs for arrays + CNNs for images with logistic-regression fusion) reaches 68% accuracy. We then refine the CNN architecture and training (regularization, learning-rate scheduling, max-norm constraints) and mitigate class imbalance via targeted augmentation, including a GAN-based generator for the minority class. The enhanced CNN attains 87% accuracy; the final GAN+CNN system achieves 94% accuracy with balanced precision and recall on a held-out test set, while remaining lightweight enough for near--real-time triage. The results show that combining array and image channels improves separability over image-only approaches, and that modest generative augmentation substantially boosts minority (pulsar) recall. The methods are survey-agnostic and extensible to forthcoming high-throughput facilities.",
      "pdf_url": "https://arxiv.org/pdf/2510.25774.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25824",
      "title": "The Ray Tracing Sampler: Bayesian Sampling of Neural Networks for Everyone",
      "authors": [
        "Peter Behroozi"
      ],
      "abstract": "The Ray Tracing Sampler: Bayesian Sampling of Neural Networks for Everyone Peter Behroozi 28 pages, submitted to OJAp; comments welcome Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (stat.ML) We derive a Markov Chain Monte Carlo sampler based on following ray paths in a medium where the refractive index $n(x)$ is a function of the desired likelihood $\\mathcal{L}(x)$. The sampling method propagates rays at constant speed through parameter space, leading to orders of magnitude higher resilience to heating for stochastic gradients as compared to Hamiltonian Monte Carlo (HMC), as well as the ability to cross any likelihood barrier, including holes in parameter space. Using the ray tracing method, we sample the posterior distributions of neural network outputs for a variety of different architectures, up to the 1.5 billion-parameter GPT-2 (Generative Pre-trained Transformer 2) architecture, all on a single consumer-level GPU. We also show that prior samplers including traditional HMC, microcanonical HMC, Metropolis, Gibbs, and even Monte Carlo integration are special cases within a generalized ray tracing framework, which can sample according to an arbitrary weighting function. Public code and documentation for C, JAX, and PyTorch are available at this https URL",
      "pdf_url": "https://arxiv.org/pdf/2510.25824.pdf",
      "categories": [
        "astro-ph.IM",
        "stat.ML"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25953",
      "title": "A Natural Language Interface for Efficient Data Retrieval in SDSS",
      "authors": [
        "Prathamesh Tamhane"
      ],
      "abstract": "A Natural Language Interface for Efficient Data Retrieval in SDSS Prathamesh Tamhane Submitted to the Proceedings of the International Astronomical Union (IAU Symposium 397, ''UniversAI: Exploring the Universe with Artificial Intelligence,'' 2025). 4 pages Instrumentation and Methods for Astrophysics (astro-ph.IM) Modern astronomical surveys such as the Sloan Digital Sky Survey (SDSS) provide extensive astronomical databases enabling researchers to access vast amount of diverse data. However, retrieving data from archives requires knowledge of query languages and familiarity with their schema, which presents a barrier for non-experts. This work investigates the use of Microsoft Phi-2, a compact yet powerful transformer-based language model, fine-tuned on natural language--SQL pairs constructed from SDSS query examples. We develop an interface that translates user queries in natural language into SQL commands compatible with SDSS SkyServer. Preliminary evaluation shows that the fine-tuned model produces syntactically valid and largely semantically correct queries across a variety of astronomy-related requests. Our results show that even small-scale models, when carefully fine-tuned, can provide effective domain-specific natural language interfaces for large scientific databases.",
      "pdf_url": "https://arxiv.org/pdf/2510.25953.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25987",
      "title": "HS-ANET: Star Spectral Type Enhanced Astrometric Calibration for Hyper Spectral Space Imaging",
      "authors": [
        "Kevin Phan",
        "William Mitchell",
        "David Chaparro",
        "Enrique De Alba",
        "J. Zachary Gazak"
      ],
      "abstract": "HS-ANET: Star Spectral Type Enhanced Astrometric Calibration for Hyper Spectral Space Imaging Kevin Phan, William Mitchell, David Chaparro, Enrique De Alba, J. Zachary Gazak Instrumentation and Methods for Astrophysics (astro-ph.IM) Traditional lost-in-space algorithms, such as those implemented in this http URL, solve for spacecraft orientation by matching observed star fields to celestial catalogs using geometric asterisms alone. In this work, we propose a novel extension to this http URL that incorporates stellar spectral type, which is derived from hyperspectral imagery, into the matching process. By adding this spectral dimension to each star detection, we constrain the search space and improve match specificity, enabling successful astrometric solutions with significantly fewer stars. Our modified pipeline demonstrates improved fit rates and reduced failure cases in cluttered or ambiguous star fields, which is especially critical for autonomous space situational awareness and traffic management. Our results suggest that modest spectral resolution, when incorporated into existing geometric frameworks, can dramatically improve robustness and efficiency in onboard star identification systems.",
      "pdf_url": "https://arxiv.org/pdf/2510.25987.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26239",
      "title": "A Triple-GEM Time Projection Chamber for Wide Field-of-View Hard X-ray Polarimetry: First Results",
      "authors": [
        "Davide Fiorina",
        "Elisabetta Baracchini",
        "Giorgio Dho",
        "Paolo Soffitta",
        "Samuele Torelli",
        "David J. M. Marques",
        "Enrico Costa",
        "Sergio Fabiani",
        "Fabio Muleri",
        "Giovanni Mazzitelli",
        "Atul Prajapati"
      ],
      "abstract": "A Triple-GEM Time Projection Chamber for Wide Field-of-View Hard X-ray Polarimetry: First Results Davide Fiorina, Elisabetta Baracchini, Giorgio Dho, Paolo Soffitta, Samuele Torelli, David J. M. Marques, Enrico Costa, Sergio Fabiani, Fabio Muleri, Giovanni Mazzitelli, Atul Prajapati Instrumentation and Methods for Astrophysics (astro-ph.IM) We report on the development of a large-volume, wide field-of-view time projection chamber (TPC) for X-ray polarimetry, featuring a triple-GEM amplification stage and optical readout. Originally developed within the CYGNO program for directional dark matter searches, the system employs a scientific CMOS (sCMOS) camera and a photomultiplier tube (PMT) to collect secondary scintillation light produced during charge amplification. A prototype with a cylindrical active volume (radius 3.7 cm, height 5 cm) was tested at the INAF--IAPS calibration facility (Rome, Tor Vergata) to assess sensitivity to low-energy electron directionality. We fully reconstruct electrons in the 10-60 keV range, obtain angular resolutions as good as 15°, and infer modulation factors up to 0.9. These first results demonstrate robust photoelectron tracking at tens of keV with strong modulation, indicating that photoelectric-effect polarimetry can be extended to higher energies. This capability is promising for rapid transients (GRBs, solar flares) and would broaden the astrophysical reach of X-ray polarimetry.",
      "pdf_url": "https://arxiv.org/pdf/2510.26239.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26507",
      "title": "A summary of instruments proposed for observing pulsating variables from the Mt. Abu Observatory",
      "authors": [
        "Anwesh Kumar Mishra",
        "Deekshya Roy Sarkar",
        "Prachi Prajapati",
        "Alka Singh",
        "Prashanth K. Kasarla",
        "Shashikiran Ganesh"
      ],
      "abstract": "A summary of instruments proposed for observing pulsating variables from the Mt. Abu Observatory Anwesh Kumar Mishra, Deekshya Roy Sarkar, Prachi Prajapati, Alka Singh, Prashanth K. Kasarla, Shashikiran Ganesh J. Astrophys. Astr. (2024) 45:34 Instrumentation and Methods for Astrophysics (astro-ph.IM) Pulsating variables play a significant role in shaping modern astronomy. Presently it is an exciting era in observational study of variable stars owing to surveys like OGLE and TESS. The vast number of sources being discovered by these surveys is also creating opportunities for 1-2m class telescopes to provide follow-up observations to characterize these. We present some initial observations of type-II cepheids from the Mt. Abu observatory and highlight the need for dedicated observing runs of pulsating variables. We also present optical designs for several suggested instruments for the Mt. Abu observatory that will contribute towards this goal. We present designs that are fairly simple and yet take due benefit of the unique telescopes and facilities present at the observatory.",
      "pdf_url": "https://arxiv.org/pdf/2510.26507.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26689",
      "title": "Stellar Spectroscopy Using Diffraction Grating, CMOS Monochrome Sensor, and Reflecting Telescopes",
      "authors": [
        "Abhinav Roy",
        "Niti Singh"
      ],
      "abstract": "Stellar Spectroscopy Using Diffraction Grating, CMOS Monochrome Sensor, and Reflecting Telescopes Abhinav Roy, Niti Singh Instrumentation and Methods for Astrophysics (astro-ph.IM); Physics Education (physics.ed-ph) We present the design and testing of a compact, low-cost stellar spectrometer developed for undergraduate and outreach applications. The instrument employs a 600 lines/mm diffraction grating, a CMOS monochrome sensor, and a 3D-printed mount integrated with reflecting telescopes. Calibration was performed using helium emission sources in the laboratory and Vega as a spectrophotometric standard, supported by a custom Python-based image-processing pipeline for wavelength calibration and spectral stacking. The spectrometer successfully recorded usable spectra of bright stars including Vega, Sirius, Procyon, Capella, and Betelgeuse, covering spectral types A through M. The results demonstrate that meaningful stellar spectroscopy can be achieved with accessible, low-cost equipment, providing a practical framework for student-led astronomical instrumentation projects.",
      "pdf_url": "https://arxiv.org/pdf/2510.26689.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26739",
      "title": "Wavefront Curvature and Transverse Atomic Motion in Time-Resolved Atom Interferometry: Impact and Mitigation",
      "authors": [
        "Noam Mouelle",
        "Jeremiah Mitchell",
        "Valerie Gibson",
        "Ulrich Schneider"
      ],
      "abstract": "Wavefront Curvature and Transverse Atomic Motion in Time-Resolved Atom Interferometry: Impact and Mitigation Noam Mouelle, Jeremiah Mitchell, Valerie Gibson, Ulrich Schneider Atomic Physics (physics.atom-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Quantum Gases (cond-mat.quant-gas); High Energy Physics - Experiment (hep-ex); Quantum Physics (quant-ph) Time-resolved atom interferometry, as employed in applications such as gravitational wave detection and searches for ultra-light dark matter, requires precise control over systematic effects. In this work, we investigate phase noise arising from shot-to-shot fluctuations in the atoms' transverse motion in the presence of the wavefront curvature of the interferometer beam, and analyse its dependence on the laser-beam geometry in long-baseline, large-momentum-transfer atom interferometers. We use a semi-classical framework to derive analytical expressions for the effective phase perturbation in position-averaged measurements and validate them using Monte Carlo simulations. Applied to 100-m and 1-km atom gradiometers representative of next-generation experiments, the model shows that configurations maximizing pulse efficiency also amplify curvature-induced phase noise, requiring micron-level control of the atom cloud's centre-of-mass position and sub-micron-per-second control of its centre-of-mass velocity to achieve sub-$10^{-5}$ rad phase stability. Alternative beam geometries can suppress this noise by up to two orders of magnitude, but at the cost of reduced pulse efficiency. To address this limitation, we propose a mitigation strategy based on position-resolved phase-shift readout, which empirically learns and corrects the wavefront-induced bias from measurable quantities such as the phase-shift gradient and final cloud position. This approach restores high-sensitivity operation in the maximum-pulse-efficiency configuration without detailed beam characterisation, providing a practical route towards next-generation, time-resolved atom interferometers operating at the $10^{-5}$ rad noise level.",
      "pdf_url": "https://arxiv.org/pdf/2510.26739.pdf",
      "categories": [
        "astro-ph.IM",
        "hep-ex",
        "quant-ph"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.26785",
      "title": "The Library of Exoplanet Atmospheric Composition Measurements: Population Level Trends in Exoplanet Composition with ExoComp",
      "authors": [
        "Joshua D. Lothringer",
        "Nataliea Lowson",
        "Guangwei Fu"
      ],
      "abstract": "The Library of Exoplanet Atmospheric Composition Measurements: Population Level Trends in Exoplanet Composition with ExoComp Joshua D. Lothringer, Nataliea Lowson, Guangwei Fu 27 pages, 10 figures, 6 tables. Table 4 available as MRT in source. ExoComp available at this https URL. Accepted for publication to AJ Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The present-day bulk elemental composition of an exoplanet can provide insight into a planet's formation and evolutionary history. Such information is now being measured for dozens of planets with state-of-the-art facilities using Bayesian atmosphere retrievals. We collect measurements of exoplanet composition of gas giants into a Library of Exoplanet Atmospheric Composition Measurements for comparison on a population level. We develop an open-source toolkit, ExoComp, to standardize between solar abundance, metallicity, and C/O ratio definitions. We find a systematic enhancement in the metallicity of exoplanets compared to T-dwarf and stellar populations, a strict bound in C/O between 0 and 1, and statistically significant differences between measurements from direct, eclipse, and transmission spectroscopy. In particular, the transit spectroscopy population exhibits a systematically lower C/O ratio compared to planets observed with eclipse and direct spectroscopy. While such differences may be astrophysical signals, we discuss many of the challenges and subtleties of such a comparison. We characterize the mass-metallicity trend, finding a slope consistent between planets measured in transit versus eclipse, but offset in metallicity. Compared to the Solar System and constraints from interior modeling, gas giant atmospheres appear to exhibit a steeper mass-metallicity trend. We hope that the tools available in ExoComp and the data in the Library of Exoplanet Atmospheric Composition Measurements can enhance the science return of the wide-array of space- and ground-based exoplanet science being undertaken by the community.",
      "pdf_url": "https://arxiv.org/pdf/2510.26785.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23733",
      "title": "Magrathea v2: A planetary interior modeling platform in C++",
      "authors": [
        "David R. Rice",
        "Chenliang Huang",
        "Robert Royer",
        "Mangesh Daspute",
        "Krishang Mittal",
        "Baptiste Journaux",
        "Jason H. Steffen",
        "Allona Vazan"
      ],
      "abstract": "Magrathea v2: A planetary interior modeling platform in C++ David R. Rice, Chenliang Huang, Robert Royer, Mangesh Daspute, Krishang Mittal, Baptiste Journaux, Jason H. Steffen, Allona Vazan 5 pages, 1 figure, Submitted to The Journal of Open Source Software (JOSS) Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) Magrathea is an open-source C++ code for modeling the internal structure of differentiated planets. The initial release, Huang et al. (2022), introduced the base solver, a modular framework for defining equations of state (EOSs) used within phase diagrams for each differentiated layer, and outlined a series of planned extensions. Many of those updates are now implemented. Magrathea v2 is a more versatile platform that supports a wider range of compositions, adds new tools for composition retrieval, and makes it easier for users to adapt the code to their own models.",
      "pdf_url": "https://arxiv.org/pdf/2510.23733.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.15398",
      "title": "Multi-scale optimal control for Einstein Telescope active seismic isolation",
      "authors": [
        "Pooya Saffarieh",
        "Nathan A. Holland",
        "Michele Valentini",
        "Jesse van Dongen",
        "Alexandra Mitchell",
        "Sander Sijtsma",
        "Armin Numic",
        "Wouter Hakvoort",
        "Conor Mow-Lowry"
      ],
      "abstract": "Multi-scale optimal control for Einstein Telescope active seismic isolation Pooya Saffarieh, Nathan A. Holland, Michele Valentini, Jesse van Dongen, Alexandra Mitchell, Sander Sijtsma, Armin Numic, Wouter Hakvoort, Conor Mow-Lowry Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a multi-scale optimal control framework for active seismic isolation in the Einstein Telescope, a third-generation gravitational-wave observatory. Our approach jointly optimizes feedback and blending filters in a cross-coupled opto-mechanical system using a unified cost function based on the \"acausal optimum,\" which quantifies sensor signal-to-noise ratios across frequencies. This method enables efficient re-optimization under varying sensor configurations and environmental conditions. We apply the framework to two candidate sensing systems using their modeled sensitivity: OmniSens-a six-degree-of-freedom inertial isolation system-and BRS-T360, which combines Beam Rotation Sensor (BRS) as an inertial tilt sensor with T360 as a horizontal seismometer. We demonstrate superior low-frequency isolation with OmniSens, reducing platform motion by up to two orders of magnitude near the microseism. The framework allows for ready optimization and projection of sensor noise to metrics relevant to the performance of the instrument, aiding the design of the Einstein Telescope.",
      "pdf_url": "https://arxiv.org/pdf/2507.15398.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.25330",
      "title": "Illuminating the lantern: coherent, spectro-polarimetric characterisation of a multimode converter",
      "authors": [
        "Adam K. Taras",
        "Barnaby R. M. Norris",
        "Christopher Betters",
        "Andrew Ross-Adams",
        "Peter G. Tuthill",
        "Jin Wei",
        "Sergio Leon-Saval"
      ],
      "abstract": "Illuminating the lantern: coherent, spectro-polarimetric characterisation of a multimode converter Adam K. Taras, Barnaby R. M. Norris, Christopher Betters, Andrew Ross-Adams, Peter G. Tuthill, Jin Wei, Sergio Leon-Saval 14 pages, 6 figures plus supplementary document Optics (physics.optics); Instrumentation and Methods for Astrophysics (astro-ph.IM) While photonic lanterns efficiently and uniquely map a set of input modes to single-mode outputs (or vice versa), the optical mode transfer matrix of any particular fabricated device cannot be constrained at the design stage due to manufacturing imperfections. Accurate knowledge of the mapping enables complex sensing or beam control applications that leverage multimode conversion. In this work, we present a characterisation system to directly measure the electric field from a photonic lantern using digital off-axis holography, following its evolution over a 73 nm range near 1550 nm and in two orthogonal, linear polarisations. We provide the first multi-wavelength, polarisation decomposed characterisation of the principal modes of a photonic lantern. Performance of our testbed is validated on a single-mode fibre then harnessed to characterise a 19-port, multicore fibre fed photonic lantern. We uncover the typical wavelength scale at which the modal mapping evolves and measure the relative dispersion in the device, finding significant differences with idealised simulations. In addition to detailing the system, we also share the empirical mode transfer matrices, enabling future work in astrophotonic design, computational imaging, device fabrication feedback loops and beam shaping.",
      "pdf_url": "https://arxiv.org/pdf/2510.25330.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25896",
      "title": "Atmospheric collapse and re-inflation through impacts for terrestrial planets around M dwarfs",
      "authors": [
        "Prune C. August",
        "Robin Wordsworth",
        "Mikayla Huffman",
        "David Brain",
        "Lars A. Buchhave"
      ],
      "abstract": "Atmospheric collapse and re-inflation through impacts for terrestrial planets around M dwarfs Prune C. August, Robin Wordsworth, Mikayla Huffman, David Brain, Lars A. Buchhave 12 pages, 5 figures, 1 table. Submitted to ApJL Earth and Planetary Astrophysics (astro-ph.EP) Detection of an atmosphere around a terrestrial exoplanet will be a major milestone in the field, but our observational capacities are biased towards to tidally locked, close-in planets orbiting M-dwarf stars. The atmospheres of these planets are vulnerable to atmospheric erosion and collapse due to condensation of volatiles on the nightside. However, these collapsed volatiles accumulated as nightside ice constitute a stable reservoir that could be re-vaporised by meteorite impacts and re-establish the atmospheres. Through a simple energy balance model applied to atmospheric evolution simulations with stochastic impacts, we assess the viability and importance of this mechanism for CO$_2$ atmospheres. We find that moderate-sized impactors ($5-10 \\rm{km}$ diameter) occurring at a frequency of $1-100 \\rm{Gyr}^{-1}$ can regenerate observable transient atmospheres on previously airless planets. We focus on specific targets from the JWST DDT Rocky Worlds programme, and compute the fraction of their evolution spent with a transient CO$_2$ atmosphere generated through this mechanism. We find this fraction can reach $70\\%$ for GJ 3929 b, $50\\%$ for LTT 1445 Ac, $80\\%$ for LTT 1445 Ab, at high impact rates and strong CO$_2$ outgassing over the planet's lifetime. We also show that atmospheric collapse can shield volatiles from escape, particularly in the early, high-XUV phase of M-dwarf evolution. Overall, our work suggests that terrestrial planet atmospheres may not evolve monotonically but instead may be shaped by episodic external forcings.",
      "pdf_url": "https://arxiv.org/pdf/2510.25896.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25923",
      "title": "NEOForCE: Near-Earth Objects' Forecast of Collisional Events",
      "authors": [
        "Dmitrii E. Vavilov",
        "Daniel Hestroffer"
      ],
      "abstract": "NEOForCE: Near-Earth Objects' Forecast of Collisional Events Dmitrii E. Vavilov, Daniel Hestroffer Earth and Planetary Astrophysics (astro-ph.EP) Robust impact monitoring of near-Earth objects is an essential task of planetary defense. Current systems such as NASA's Sentry-II, the University of Pisa's CLOMON2, and ESA's Aegis have been highly successful, but independent approaches are essential to ensure reliability and to cross-validate predictions of possible impacts. We present NEOForCE (Near-Earth Objects' Forecast of Collisional Events), a new independent monitoring system for asteroid impact prediction. By relying on orbital solutions from DynAstVO at Paris Observatory and using an original methodology for uncertainty propagation, NEOForCE provides an alternative line of verification for impact assessments and strengthens the overall robustness of planetary defense. As other monitoring systems, NEOForCE samples several thousand virtual asteroids from the uncertainty region and integrates their orbits up to 100 years into the future. Instead of searching for close approaches of the virtual asteroids with the Earth, our system looks for times when the Earth comes close to the realistic uncertainty regions around them, which are mostly stretched along their osculating orbits. We also estimate the maximal impact probability, and only if this value is large enough do we continue to the next step. In this second step, we compute how the original asteroid orbit should be modified so that the new trajectory leads to an Earth impact, which allows us to confirm the possible collision and estimate the impact probability. We tested NEOForCE against NASA's Sentry-II system on five representative asteroids: 2000 SG344, 2005 QK76, 2008 JL3, 2023 DO and 2025 JU. NEOForCE successfully recovered nearly all possible collisions reported by Sentry-II with impact probabilities above e-7, demonstrating the robustness of our approach. In addition, NEOForCE identified several potential impacts at the e-7 - e-6 level that Sentry-II did not report.",
      "pdf_url": "https://arxiv.org/pdf/2510.25923.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25988",
      "title": "How does ice shell geometry shape ocean dynamics on icy moons?",
      "authors": [
        "Yixiao Zhang",
        "Wanying Kang",
        "John Marshall"
      ],
      "abstract": "How does ice shell geometry shape ocean dynamics on icy moons? Yixiao Zhang, Wanying Kang, John Marshall Earth and Planetary Astrophysics (astro-ph.EP) A poleward-thinning ice shell can drive circulation in the subsurface oceans of icy moons by imposing a meridional temperature gradient--colder at the equator than the pole--through the freezing point suppression due to pressure. This temperature gradient sets a buoyancy gradient, whose sign depends on the thermal expansion coefficient determined by ocean salinity. Together with vertical mixing, this buoyancy forcing shapes key oceanic features, including zonal currents in thermal wind balance, baroclinic instability of those currents, meridional heat transport by eddies, and vertical stratification. We use high-resolution numerical simulations to explore how variations in ice shell thickness affect these processes. Our simulations span a wide range of topographic slopes, pole-to-equator temperature differences, and vertical mixing strengths, for both fresh and salty oceans. We find that baroclinic eddies dominate large-scale circulation and meridional heat transport, consistent with studies assuming a flat ice-ocean interface. However, sloped topography introduces new effects: when lighter water overlies denser water along the slope, circulation weakens as a stratified layer thickens beneath the poles. Conversely, when denser water lies beneath the poles, circulation strengthens as topography increases the available potential energy. We develop a scaling framework that predicts heat transport and stratification across all simulations. Applying this framework to Enceladus, Europa, and Titan, we infer ocean heat fluxes, stratification, and tidal energy dissipation and showing large-scale circulation constrains tidal heating and links future observations of ice thickness and rotation to subsurface ocean dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2510.25988.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26483",
      "title": "In space there will be no need to scream - Limits to the presence of giant planets in the $ζ^2$ Ret system",
      "authors": [
        "A. Suárez Mascareño"
      ],
      "abstract": "In space there will be no need to scream - Limits to the presence of giant planets in the $ζ^2$ Ret system A. Suárez Mascareño Halloween-themed submission. Not peer-reviewed Earth and Planetary Astrophysics (astro-ph.EP) The search for life beyond our Solar system has been a long and difficult endeavour. The majority of current efforts are focused on the potential detection of biosignatures. However, their detection and interpretation are extremely challenging. Technosignatures appear as an attractive alternative, given their expected univocal interpretation. In recent years, the number of publications discussing them have skyrocketted, both in their more rigurous and speculative sides. In this article, we explore the 28.8 years of archival radial velocity data of $\\zeta^2$ Ret with the aim of detecting the proposed giant planet Calpamos, suspected source of a signal of technological origin. We performed a global model fitting the radial velocity data along with activity indicators and modelled the stellar magnetic cycle and rotation. The analysis rules out the presence of the proposed planet, as well as of any other planets more massive than 2-20 $\\mathrm{M}_\\oplus$ $m_{p}$ sin $i$, depending on orbital period. We show that the previously identified long-period RV signal is definitively caused by the magnetic cycle of the star.",
      "pdf_url": "https://arxiv.org/pdf/2510.26483.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26549",
      "title": "Combined Orbital and Thermal Evolution of Oort Cloud Comets",
      "authors": [
        "Adam Parhi",
        "Dina Prialnik"
      ],
      "abstract": "Combined Orbital and Thermal Evolution of Oort Cloud Comets Adam Parhi, Dina Prialnik Earth and Planetary Astrophysics (astro-ph.EP) We present a fully integrated model of comet evolution that couples thermal and compositional processes with dynamical processes continuously, from formation to present-day activity. The combined code takes into account changes in orbital parameters that define the heliocentric distance as a function of time, which is fed into the thermal/compositional evolution code. The latter includes a set of volatile species, gas flow through the porous interior, crystallization of amorphous ice, sublimation and refreezing of volatiles in the pores. We follow the evolution of three models, with radii of 2, 10 and 50 km for 4.6 Gyr, through different dynamical epochs, starting in the vicinity of Neptune, moving to the Oort Cloud and after a long sojourn there, back inward to the planetary region. The initial composition includes a mixture of CO, CO2 ices, amorphous water ice with trapped CO and CO2, and this http URL find that the CO ice is completely depleted in the small object, but preserved in the larger ones from a depth of 500 m to the center, while the CO2 and the amorphous ice are entirely preserved. Of crucial importance is the change in CO abundance profiles during the cooling phase, as the objects migrate to the OC. Upon return from the Oort Cloud, the activity is driven by CO sublimation at large heliocentric distances (up to 50 au), by CO2 inward of 13 au and by gas released from crystallizing amorphous ice at about 7 au. We test the effect of radioactive heating by long-lived isotopes and find that it is negligible. Considering sub-solar temperatures and limited active areas, we show that CO2 production rates can exceed the detection limit as far out as 25 au.",
      "pdf_url": "https://arxiv.org/pdf/2510.26549.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.12928",
      "title": "Beyond monoculture: Polydisperse moment methods for sub-stellar atmosphere cloud microphysics II. A three-moment gamma distribution formulation for GCM applications",
      "authors": [
        "Elspeth K.H. Lee",
        "Kazumasa Ohno"
      ],
      "abstract": "Beyond monoculture: Polydisperse moment methods for sub-stellar atmosphere cloud microphysics II. A three-moment gamma distribution formulation for GCM applications Elspeth K.H. Lee, Kazumasa Ohno Submitted to A&A 16 July 2025 - revised after reviewer comment Earth and Planetary Astrophysics (astro-ph.EP) Context. Understanding how the shape of cloud particle size distributions affects the atmospheric properties of sub-stellar atmospheres is a key area to explore, particularly in the JWST era of broad wavelength coverage, where observations are sensitive to particle size distributions. It is therefore important to elucidate how underlying cloud microphysical processes influence the size distribution, in order to better understand how clouds affect observed atmospheric properties. Aims. In this follow-up paper, we aim to extend our sub-stellar atmosphere microphysical cloud formation framework from Paper I to include effects of assuming a polydisperse gamma particle size distribution, requiring a three-moment solution set of equations. Methods. We develop a three-moment framework for sub-stellar mineral cloud particle microphysical nucleation, condensation, evaporation and collisional growth assuming a gamma distribution. As in the previous paper, we demonstrate the effects of polydispersity using a simple one-dimensional Y-dwarf KCl cloud formation scenario, and compare the results with the monodisperse case. Results. Our three-moment scheme provides a generalised framework applicable to any size distribution with a defined moment generation expression. In our test case, we show that the gamma distribution evolves with altitude, initially broad at the cloud base and narrowing at lower pressures. We find that differences between the gamma and monodisperse cloud structures can be significant, depending on the surface gravity of the atmosphere. Conclusions. We present a self-consistent framework for including the effects of polydispersity for sub-stellar microphysical cloud studies using the moment method.",
      "pdf_url": "https://arxiv.org/pdf/2507.12928.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.04776",
      "title": "In-Situ Formation of the Cold Classical Kuiper Belt",
      "authors": [
        "Rixin Li",
        "Eugene Chiang"
      ],
      "abstract": "In-Situ Formation of the Cold Classical Kuiper Belt Rixin Li, Eugene Chiang Accepted to ApJ. Key updates since v1: Section 3.3 reproducing the retrograde population using higher-res simulations. Videos: this https URL Earth and Planetary Astrophysics (astro-ph.EP) Cold Classical Kuiper belt objects (CCKBOs) are considered first-generation planetesimals that formed 42-47 au from the Sun and remained untouched since. Formation is thought to proceed by clumping of dust particles in protoplanetary disk gas by the streaming instability, followed by gravitational collapse. Previous calculations along these lines are inconsistent with the CCKB's supposedly pristine nature, because they assume orders of magnitude more solid mass than is actually present in the CCKB (a few thousandths of an Earth mass) and do not explain how to expel the >99% extra mass. Here we show from 3D numerical simulations of dust and gas that the total mass in CCKBOs, their characteristic sizes of ~100 km, and the relative proportion of prograde to retrograde binaries can all be reproduced at the tail end of the solar nebula's life, when it contained just 2-5% of its original (minimum-mass) gas. As a solar metallicity's worth of mm-sized solids drains out from 42-47 au from nebular headwinds, about 1% of the dust collapses into planetesimals that remain behind in the CCKB region. Binarity is guaranteed from a simple analytic estimate, confirmed numerically, of the spin angular momentum in clumps seeded by the streaming instability. We show that other formation scenarios, including trapping of dust within a gas pressure bump, fail to reproduce the low-mass CCKB. Outstanding problems are identified.",
      "pdf_url": "https://arxiv.org/pdf/2508.04776.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02201",
      "title": "Understanding the Origins of Super-Puff Planets: A New Mass-Loss Regime Coupled to Planetary Evolution",
      "authors": [
        "Yao Tang",
        "Jonathan J. Fortney",
        "Ruth Murray-Clay",
        "Madelyn Broome"
      ],
      "abstract": "Understanding the Origins of Super-Puff Planets: A New Mass-Loss Regime Coupled to Planetary Evolution Yao Tang, Jonathan J. Fortney, Ruth Murray-Clay, Madelyn Broome 22 pages, 12 figures; in press, ApJ Earth and Planetary Astrophysics (astro-ph.EP) Super-puffs are a class of low-mass, large-radius planets that have challenged planet formation and evolution models. Their high inferred H/He mass fractions, required to explain their physical sizes, would lead to rapid atmospheric escape, raising questions about their long-term retention. Recent modeling work indicates that low-mass planets typically require 50\\% less H/He mass to match their observed radius, due to significant roles of the radiative atmosphere and interior heating from the rock/iron core. Here, through a new quantitative analysis of XUV-driven escape in sub-Neptunes, we find that previous studies overestimated mass loss, as scaling laws in low-gravity regimes deviate greatly from the widely used energy-limited regime. We define a new regime, thermal-energy-mediated photoevaporation (TEMP), in which thermal energy conversion critically sets the mass-loss rate. These effects make super-puffs more resilient to mass loss than previously thought. We develop a coupled evolution model integrating this updated thermal evolution framework with a 1D hydrodynamic photoevaporation model. Applying this novel, joint model to observed super-puffs and young low-density planets, we find that their masses, radii and transit pressures align with predictions assuming either a clear or hazy atmosphere. This indicates that super-puffs have undergone a combination of boil-off and photoevaporative mass loss, with boil-off dominating the process. Our results indicate that low-density planets typically possess both a thick convective envelope and substantial radiative atmosphere, which contribute to their large radii. For this to occur, these planets must have intermediate masses of 5-10$M_\\oplus$ and receive stellar insolation $\\lesssim 30F_\\oplus$, favoring FG-type stars over M-dwarfs.",
      "pdf_url": "https://arxiv.org/pdf/2510.02201.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}