{
  "date": "2026-02-12",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.HE",
    "astro-ph.IM",
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "total_papers": 110,
  "gw_related_papers": 9,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.07452",
      "title": "FPIC: a new Particle-In-Cell code for stationary and axisymmetric black-hole spacetimes",
      "authors": [
        "Claudio Meringolo",
        "Luciano Rezzolla"
      ],
      "abstract": "FPIC: a new Particle-In-Cell code for stationary and axisymmetric black-hole spacetimes Claudio Meringolo, Luciano Rezzolla High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); Plasma Physics (physics.plasm-ph) In this paper we present a newly developed GRPIC code framework called FPIC, providing a detailed description of the Maxwell-equations solver, of the particle ``pushers'', and of the other algorithms that are needed in this approach. We describe in detail the code, which is written in Fortran and exploits parallel architectures using MPI directives both for the fields and particles. FPIC adopts spherical Kerr-Schild coordinates, which encode the overall spherical topology of the problem while remaining regular at the event horizon. The Maxwell equations are evolved using a finite-difference time-domain solver with a leapfrog scheme, while multiple particle ``pushers'' are implemented for the evolution of the particles. In addition to well-known algorithms, we introduce a novel hybrid method that dynamically switches between the most appropriate scheme based on the violation of the Hamiltonian energy. We first present results for neutral particles orbiting around black holes, both in the Schwarzschild and Kerr metrics, monitoring the evolution of the Hamiltonian error across different integration schemes. We apply our hybrid approach, showing that it is capable of achieving improved energy conservation at reduced computational cost. We apply FPIC to investigate the Wald solution, first in electrovacuum and subsequently in plasma-filled configurations. In the latter case, particles with negative energy at infinity are present inside the ergosphere, indicating that the Penrose process is active. Finally, we present the split-monopole solution in a plasma-filled environment and successfully reproduce the Blandford-Znajek luminosity, finding very good agreement with analytical predictions.",
      "pdf_url": "https://arxiv.org/pdf/2602.07452.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09102",
      "title": "Polarization Signatures of Inspiraling Hotspots around Kerr Black Holes",
      "authors": [
        "Pablo Ruales",
        "Delilah E. A. Gates",
        "Alejandro Cárdenas-Avendaño"
      ],
      "abstract": "Polarization Signatures of Inspiraling Hotspots around Kerr Black Holes Pablo Ruales, Delilah E. A. Gates, Alejandro Cárdenas-Avendaño High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Polarimetric interferometry is a powerful tool for probing both black hole accretion physics and the background spacetime. Current models aimed at explaining the observed multiwavelength flares in Sgr A* often assume hotspots moving on geodesic, Keplerian orbits. In many scenarios, though, a hotspot may instead follow an inspiraling trajectory, potentially transitioning into a plunge toward the black hole. In this work, we present a general framework to simulate the polarized emission from generic equatorial inspiraling hotspots in Kerr spacetime using a parametric four-velocity profile. This parametrization defines a continuous family of flows, ranging from Cunningham's disk model (fixed radius orbits outside the innermost stable circular orbit and plunging motion within the innermost stable circular orbit) to purely radial motion, thereby extending the standard assumptions. Within this framework, we show that inspiral motion produces a distinctive observational signature: a precessing, unwinding evolution of the polarimetric Stokes Q-U looping pattern, in sharp contrast with the closed Q-U loops associated with stable orbits at a fixed radius. We then explore how the morphology of these signatures depends on black hole spin, observer inclination, and magnetic-field configuration. The presented model can be applied to current and near-future interferometric observations of linear polarization, offering a new avenue to probe the physics of matter spiraling inward and the relativistic velocities of plunging plasma.",
      "pdf_url": "https://arxiv.org/pdf/2602.09102.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09141",
      "title": "NIAC project report: Solar system-scale VLBI to dramatically improve cosmological distance measurements",
      "authors": [
        "Matthew McQuinn",
        "Miguel Morales",
        "Casey McGrath",
        "Alyssa Alvarez",
        "Katelyn Glasby",
        "T. Joseph W. Lazio",
        "Kiyoshi Masui",
        "Lyujia Pan",
        "Jonathan Pober",
        "Huangyu Xiao"
      ],
      "abstract": "NIAC project report: Solar system-scale VLBI to dramatically improve cosmological distance measurements Matthew McQuinn, Miguel Morales, Casey McGrath, Alyssa Alvarez, Katelyn Glasby, T. Joseph W. Lazio, Kiyoshi Masui, Lyujia Pan, Jonathan Pober, Huangyu Xiao 59 pages in big-ish font; NASA/NIAC Phase I study Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Earth and Planetary Astrophysics (astro-ph.EP); General Relativity and Quantum Cosmology (gr-qc) We investigate the feasibility and scientific potential of the Cosmic Positioning System (CPS), a space mission concept enabling purely geometric distance measurements to sources at hundreds of megaparsecs by directly detecting electromagnetic wavefront curvature. CPS consists of a constellation of radio antennas distributed across the outer Solar System, operating on baselines of tens of astronomical units. By precisely timing the arrival of repeating fast radio bursts (FRBs), CPS infers source distances via trilateration -- analogous to global navigation satellite systems such as GPS but on cosmological scales. We show that CPS distance measurements could result in sub-percent constraints on the Hubble constant with even a handful of detections, whereas we predict that 10-100 FRB sources are likely visible. We evaluate dominant sources of uncertainty -- wavefront timing precision, interstellar refractive delays, spacecraft positional knowledge, and onboard clock stability -- finding these controllable at required levels using near-term technologies. Our nominal design employs five spacecraft with 8 m deployable antennas, 3-6 GHz receivers with sub-30 K system temperatures, and space-qualified atomic clocks similar to those on GPS satellites, supported by a ground network for ranging calibration and FRB alerts. Beyond cosmic expansion, CPS may enable frontier measurements in astrophysics and fundamental physics, including constraints on small-scale dark matter structure, microhertz gravitational waves (bridging pulsar timing arrays and LISA), and the outer Solar System mass distribution. The most significant viability issue concerns FRB properties at several-GHz frequencies; we recommend observational campaigns to characterize repeating FRBs in this band.",
      "pdf_url": "https://arxiv.org/pdf/2602.09141.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.EP",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.09249",
      "title": "Towards a general field equation for galaxies and galaxy clusters",
      "authors": [
        "Albert Raymond Penner"
      ],
      "abstract": "Towards a general field equation for galaxies and galaxy clusters Albert Raymond Penner Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) The MONDian theory of AQUAL (AQUAdratic Lagrangian) and the theory of GRAS (GRavitational Anti-Screening) are alternatives to the theory of dark matter. When these theories are applied to galaxy dynamics they are in excellent agreement with observations including the galactic RAR (Radial Acceleration Relationship). However, when applied to galaxy clusters they do not explain the bulk of the missing mass. This manuscript develops a modified version of the GRAS/AQUAL field equation that can be extended to galaxy clusters. It involves just a single free parameter. The new field equation is then applied to a sample of galaxy clusters and checked against modeled galaxies and solar system constraints. Further to this, the modified field equation leads to an understanding of the difference between the galactic RAR and the RAR recently found for clusters.",
      "pdf_url": "https://arxiv.org/pdf/2602.09249.pdf",
      "categories": [
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09599",
      "title": "Highly suppressed tensor-to-scalar ratio from a modified Lennard-Jones inflationary potential",
      "authors": [
        "Panagiotis G. Stavros",
        "Spyros Basilakos",
        "Emmanuel N. Saridakis"
      ],
      "abstract": "Highly suppressed tensor-to-scalar ratio from a modified Lennard-Jones inflationary potential Panagiotis G. Stavros, Spyros Basilakos, Emmanuel N. Saridakis Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The increasingly stringent observational bounds on primordial gravitational waves strongly constrain inflationary model building, favoring scenarios that predict highly suppressed tensor perturbations. While many viable constructions rely on non-canonical kinetic terms, non-minimal couplings, or modifications of gravity, it remains an open question whether comparably small tensor amplitudes can emerge within a minimal, single-field framework driven solely by potential dynamics. In this work we propose a novel inflationary scenario based on a modified Lennard-Jones potential. Inspired by a well-known interaction potential in molecular physics, the proposed form naturally combines a smooth minimum with an extended flat plateau at large field values. This intrinsic structure supports slow-roll inflation and ensures a graceful exit without introducing additional degrees of freedom. We perform a detailed analysis of the inflationary dynamics and confront the model with current observational constraints. We find that the scalar spectral index is fully consistent with CMB data, while the tensor-to-scalar ratio is predicted to be extremely small, reaching values as low as $r\\sim10^{-7}$. Finally, the running of the scalar spectral index is also found to be small, well withing the 1$\\sigma$ recent observational bounds from Atacama Cosmology Telescope.",
      "pdf_url": "https://arxiv.org/pdf/2602.09599.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.09705",
      "title": "Non-minimally Coupled Running Curvaton: A Unified Approach to Early-Universe Inflation and Phantom Dark Energy",
      "authors": [
        "Bichu Li",
        "Lei-Hua Liu"
      ],
      "abstract": "Non-minimally Coupled Running Curvaton: A Unified Approach to Early-Universe Inflation and Phantom Dark Energy Bichu Li, Lei-Hua Liu 12 figures, 3 figures, any comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Recent observations from the Dark Energy Spectroscopic Instrument (DESI) 2024, combined with CMB and SNIa data, indicate a preference for a dynamical dark energy equation of state that crosses the phantom divide ($w < -1$). This finding challenges the standard $\\Lambda$CDM model and minimally coupled scalar field scenarios, including the original Running Curvaton model, which is typically constrained to the quintessence regime. In this work, we propose a unified cosmological framework by extending the Running Curvaton model via a non-minimal gravitational coupling of the form $\\xi \\chi^2 R$. We demonstrate that this geometric modification allows the effective equation of state to naturally evolve from a quintessence-like to a phantom-like regime in the Jordan frame, thereby providing a superior fit to the DESI observational contours ($w_0 > -1, w_a < 0$). Crucially, we show that the introduction of non-minimal coupling does not compromise the model's success in describing the early universe. Through a parameter re-tuning mechanism involving the coupling constant ($g_0^{obs} = g_0 + 2\\xi$), the predictions for the primordial power spectrum (spectral index $n_s$) and local-type non-Gaussianity ($f_{NL}$) remain strictly preserved and consistent with Planck data. Furthermore, we perform a comprehensive stability analysis within the Horndeski framework, verifying that the model remains free from ghost and gradient instabilities ($c_s^2 = 1$). Our results suggest that the non-minimally coupled Running Curvaton offers a robust, stable, and unified description of inflation and late-time accelerated expansion compatible with the latest precision cosmology data.",
      "pdf_url": "https://arxiv.org/pdf/2602.09705.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2408.14983",
      "title": "Inflation with the Chern-Simons term in the Palatini formulation",
      "authors": [
        "Ali Hassan",
        "Syksy Rasanen"
      ],
      "abstract": "Inflation with the Chern-Simons term in the Palatini formulation Ali Hassan, Syksy Rasanen 15+5 pages, no figures. v2. Corrected typos, added references and clarifications. Published version. v3. Corrected typos and explanations Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We consider the Chern--Simons term coupled to the inflaton in the Palatini formulation of general relativity. In contrast to the metric formulation, here the Chern--Simons term affects also the background evolution. We approximately solve for the connection, insert it back into the action, and reduce the order of the equations to obtain an effective theory in the gradient approximation. We consider three cases: when the connection is unconstrained, and when non-metricity or torsion is put to zero. In the first two cases, the inflaton kinetic term is modified with a term proportional to the square of the potential. For polynomial potentials dominated by the highest power of the field, the Chern--Simons term solves the problem that higher order corrections spoil the flatness of the potential. For Higgs inflation, the tensor-to-scalar ratio can be as large as the current observational bound, and the non-minimal coupling to the Ricci scalar can be as small as in the metric case. The Palatini contribution cures the known instability of the tensor modes due to the Chern--Simons term in the metric formulation.",
      "pdf_url": "https://arxiv.org/pdf/2408.14983.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.07836",
      "title": "Probing small-scale primordial power spectra with induced gravitational waves",
      "authors": [
        "Di Wu",
        "Zhi-Chao Li",
        "Peng-Yu Wu",
        "Fei-Yu Chen",
        "Jing-Zhi Zhou"
      ],
      "abstract": "Probing small-scale primordial power spectra with induced gravitational waves Di Wu, Zhi-Chao Li, Peng-Yu Wu, Fei-Yu Chen, Jing-Zhi Zhou 18 pages, 15 figures. Accepted for publication in PRD Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Large-scale primordial perturbations have been well constrained by current cosmological observations, but the properties of small-scale perturbations remain elusive. This study focuses on second-order induced gravitational waves generated by large-amplitude primordial scalar and tensor perturbations on small scales. In this case, the induced gravitational waves include contributions from three types of source terms: scalar-scalar, tensor-scalar, and tensor-tensor. To distinguish them from second-order scalar induced gravitational waves (SIGWs), we refer to those generated by these three source terms as tensor-scalar induced gravitational waves (TSIGWs). We provide the analytical expressions for the kernel functions and the corresponding energy density spectra of second-order TSIGWs. By combining observations of stochastic gravitational wave background (SGWB) across different scales, TSIGWs can be used to constrain small-scale primordial curvature perturbations and primordial gravitational waves. Furthermore, we discuss the feasibility of TSIGWs dominating the current pulsar timing array (PTA) observations under various primordial power spectra scenarios. Our results indicate that TSIGWs generated by monochromatic primordial power spectra might be more likely to dominate the current PTA observations.",
      "pdf_url": "https://arxiv.org/pdf/2507.07836.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.23219",
      "title": "Witten-O'Raifeartaigh potential revisited in the context of Warm Inflation",
      "authors": [
        "Suratna Das",
        "Umang Kumar",
        "Swagat S. Mishra",
        "Varun Sahni"
      ],
      "abstract": "Witten-O'Raifeartaigh potential revisited in the context of Warm Inflation Suratna Das, Umang Kumar, Swagat S. Mishra, Varun Sahni 12 pages, 11 figures, double column, v2: Accepted for publication in Physical Review D after minor changes Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Warm Inflation is a scenario in which the inflaton field dissipates its energy during inflation to maintain a subdominant constant radiation bath. Two of its remarkable features are (i) inflation can be realized even by very steep potentials and (ii) such a scenario doesn't call for a separate post-inflation reheating phase. We exploit the first feature to show that Warm Inflation can successfully take place on the very steep left wing of the Witten-O'Raifeartaigh potential while remaining in excellent agreement with current cosmological data (joint analysis of Planck, ACT and DESI). The Witten-O'Raifeartaigh potential has a flatter right wing as well, which opens up the possibility of dark energy when the field rolls along this wing. However in order to successfully realize quintessential inflation one needs to (i) normalize the two wings of the Witten-O'Raifeartaigh potential differently in order to bridge between the two extreme energy scales of inflation and dark energy, (ii) allow the quintessence field to be dissipative, which is consistent with the presence of a dissipative term in warm inflation. The dissipative dynamics of the quintessence field is needed in order to sustain slow-roll in the right wing. With these modifications, we demonstrate that the Witten-O'Raifeartaigh potential can give rise to a unified model of warm inflation (on the left wing) and transient dark energy (on the right wing).",
      "pdf_url": "https://arxiv.org/pdf/2511.23219.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.05969",
      "title": "Cosmographic parameters from current and next-generation gravitational wave detectors",
      "authors": [
        "Jonathan Morais",
        "Rodrigo Gonçalves",
        "Jailson Alcaniz"
      ],
      "abstract": "Cosmographic parameters from current and next-generation gravitational wave detectors Jonathan Morais, Rodrigo Gonçalves, Jailson Alcaniz Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We evaluate the capability of current and next-generation gravitational wave detectors, such as Advanced LIGO, Einstein Telescope and DECIGO, to constrain cosmographic parameters using electromagnetically bright standard sirens. By adopting a third-order Taylor expansion, we analyze how signal-to-noise ratios and the number of events impact the estimates of the Hubble constant ($H_0$), the deceleration ($q_0$) and jerk ($j_0$) parameters. Our results show that while Advanced LIGO provides a calibration-free measurement of $H_0$ at the few-percent level, it remains insensitive to higher-order parameters. In contrast, the Einstein Telescope and DECIGO reach sub-percent accuracy for $H_0$. Notably, DECIGO achieves a precision better than 10\\% for the deceleration parameter $q_0$ and a few tens of percent for the jerk parameter $j_0$.",
      "pdf_url": "https://arxiv.org/pdf/2602.05969.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.09230",
      "title": "Modeling Redshift Uncertainties in Roman Weak Lensing Cosmology",
      "authors": [
        "Diogo H. F. de Souza",
        "Boyan Yin",
        "Tim Eifler",
        "Vivian Miranda",
        "Chun-Hao To",
        "Brett H. Andrews",
        "Katarina Markovič",
        "Eric Huff",
        "Michael A. Troxel",
        "Olivier Doré"
      ],
      "abstract": "Modeling Redshift Uncertainties in Roman Weak Lensing Cosmology Diogo H. F. de Souza, Boyan Yin, Tim Eifler, Vivian Miranda, Chun-Hao To, Brett H. Andrews, Katarina Markovič, Eric Huff, Michael A. Troxel, Olivier Doré Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmological constraints using weak gravitational lensing measurements from the Roman Space Telescope will require a powerful method for modelling uncertainties in the galaxy redshift distribution. In this work, we use an optimized version of the principal component analysis (PCA) to model uncertainties in the full shape of the redshift distributions, a method proposed by \\cite{pca_method} and recently used in the Dark Energy Survey Y6 analysis. Here, we implement this new approach within the Roman High Latitude Imaging Survey (HLIS) Cosmology Project Infrastructure Team (PIT) pipeline, namely Cobaya-Cosmolike Joint Architecture (\\texttt{CoCoA}). To validate the PCA in mitigating biases on cosmological parameters, $S_8$ and $\\Omega_m$, we use a set of redshift distributions from \\texttt{Cardinal} generated for a variety of Roman configurations. Overall, when the simulated cosmic shear data vector is not strongly miscalibrated relative to the fiducial one, both the mean-shift and the PCA-based approaches produce consistent cosmological constraints when marginalizing over nuisance parameters. For mild to strong miscalibration, including additional PCs progressively mitigates biases in $S_8$ and $\\Omega_m$, and can achieve comparable performance with fewer parameters than the nine tomographic-bin mean-shift model.",
      "pdf_url": "https://arxiv.org/pdf/2602.09230.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09558",
      "title": "Microlensing events and primordial black holes in the axionlike curvaton model",
      "authors": [
        "Kentaro Kasai",
        "Masahiro Kawasaki",
        "Kai Murai",
        "Shunsuke Neda"
      ],
      "abstract": "Microlensing events and primordial black holes in the axionlike curvaton model Kentaro Kasai, Masahiro Kawasaki, Kai Murai, Shunsuke Neda Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Recently, Subaru Hyper Suprime-Cam (HSC) observations found 12 candidates for microlensing events. These events can be explained by primordial black holes (PBHs) with masses of $10^{-7}$-$10^{-6} M_\\odot$ and a fraction of all dark matter of $f_\\mathrm{PBH} = \\mathcal{O}(10^{-1})$. In this paper, we consider the PBH production in two types of the axionlike curvaton models, which predict an enhancement of the curvature perturbations on small scales. We show that the microlensing events can be explained in the axionlike curvaton model and discuss the cosmological implications such as gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2602.09558.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.10065",
      "title": "Dark Energy Survey Year 6 Results: Cosmological Constraints from Cosmic Shear",
      "authors": [
        "DES Collaboration: T. M. C. Abbott",
        "M. Aguena",
        "A. Alarcon",
        "O. Alves",
        "A. Amon",
        "D. Anbajagane",
        "F. Andrade-Oliveira",
        "W. d'Assignies",
        "S. Avila",
        "D. Bacon",
        "J. Beas-Gonzalez",
        "K. Bechtol",
        "M. R. Becker",
        "G. M. Bernstein",
        "J. Blazek",
        "S. Bocquet",
        "D. Brooks",
        "H. Camacho",
        "G. Camacho-Ciurana",
        "R. Camilleri",
        "G. Campailla",
        "A. Campos",
        "A. Carnero Rosell",
        "M. Carrasco Kind",
        "J. Carretero",
        "F. J. Castander",
        "R. Cawthon",
        "C. Chang",
        "A. Choi",
        "J. M. Coloma-Nadal",
        "C. Conselice",
        "L. N. da Costa",
        "M. Costanzi",
        "M. Crocce",
        "T. M. Davis",
        "J. De Vicente",
        "D.L. DePoy",
        "J. DeRose",
        "S. Desai",
        "H.T. Diehl",
        "P. Doel",
        "C. Doux",
        "A. Drlica-Wagner",
        "T. F. Eifler",
        "S. Everett",
        "A. E. Evrard",
        "A. Ferté",
        "B. Flaugher",
        "P. Fosalba",
        "O. Friedrich",
        "J. Frieman",
        "J. García-Bellido",
        "M. Gatti",
        "G. Giannini",
        "P. Giles",
        "K. Glazebrook",
        "D. Gruen",
        "R. A. Gruendl",
        "G. Gutierrez",
        "I. Harrison",
        "W. G. Hartley",
        "K. Herner",
        "S. R. Hinton",
        "D. L. Hollowood",
        "K. Honscheid",
        "D. Huterer",
        "B. Jain",
        "D. J. James",
        "M. Jarvis",
        "N. Jeffrey",
        "T. Jeltema",
        "T. Kacprzak",
        "S. Kent",
        "E. Krause",
        "O. Lahav",
        "S. Lee",
        "E.Legnani",
        "H. Lin",
        "J. L. Marshall",
        "S. Mau",
        "J. Mena-Fernández",
        "F. Menanteau",
        "R. Miquel",
        "J. J. Mohr",
        "J. Muir",
        "J. Myles",
        "R. C. Nichol",
        "R. L. C. Ogando",
        "A. Palmese",
        "M. Paterno",
        "W. J. Percival",
        "D. Petravick",
        "A. A. Plazas Malagón",
        "A. Porredon",
        "J. Prat",
        "C. Preston",
        "M. Raveri",
        "M. Rodriguez-Monroy",
        "A. K. Romer"
      ],
      "abstract": "Dark Energy Survey Year 6 Results: Cosmological Constraints from Cosmic Shear DES Collaboration: T. M. C. Abbott, M. Aguena, A. Alarcon, O. Alves, A. Amon, D. Anbajagane, F. Andrade-Oliveira, W. d'Assignies, S. Avila, D. Bacon, J. Beas-Gonzalez, K. Bechtol, M. R. Becker, G. M. Bernstein, J. Blazek, S. Bocquet, D. Brooks, H. Camacho, G. Camacho-Ciurana, R. Camilleri, G. Campailla, A. Campos, A. Carnero Rosell, M. Carrasco Kind, J. Carretero, F. J. Castander, R. Cawthon, C. Chang, A. Choi, J. M. Coloma-Nadal, C. Conselice, L. N. da Costa, M. Costanzi, M. Crocce, T. M. Davis, J. De Vicente, D.L. DePoy, J. DeRose, S. Desai, H.T. Diehl, P. Doel, C. Doux, A. Drlica-Wagner, T. F. Eifler, S. Everett, A. E. Evrard, A. Ferté, B. Flaugher, P. Fosalba, O. Friedrich, J. Frieman, J. García-Bellido, M. Gatti, G. Giannini, P. Giles, K. Glazebrook, D. Gruen, R. A. Gruendl, G. Gutierrez, I. Harrison, W. G. Hartley, K. Herner, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. Huterer, B. Jain, D. J. James, M. Jarvis, N. Jeffrey, T. Jeltema, T. Kacprzak, S. Kent, E. Krause, O. Lahav, S. Lee, E.Legnani, H. Lin, J. L. Marshall, S. Mau, J. Mena-Fernández, F. Menanteau, R. Miquel, J. J. Mohr, J. Muir, J. Myles, R. C. Nichol, R. L. C. Ogando, A. Palmese, M. Paterno, W. J. Percival, D. Petravick, A. A. Plazas Malagón, A. Porredon, J. Prat, C. Preston, M. Raveri, M. Rodriguez-Monroy, A. K. Romer See this this https URL for the full DES Y6 3x2pt cosmology release Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present legacy cosmic shear measurements and cosmological constraints using six years of Dark Energy Survey imaging data. From these data, we study ~140 million galaxies (8.29 galaxies/arcmin$^2$) that are 50% complete at i=24.0 and extend beyond z=1.2. We divide the galaxies into four redshift bins, and obtain cosmic shear measurement with a signal-to-noise of 83, a factor of 2 higher than the Year 3 analysis. We model the uncertainties due to shear and redshift calibrations, and discard measurements on small angular scales to mitigate baryon feedback and other small-scale uncertainties. We consider two fiducial models to account for the intrinsic alignment (IA) of the galaxies. We conduct a blind analysis in the context of the $\\Lambda$CDM model and find $S_8 \\equiv \\sigma_8(\\Omega_m/0.3)^{0.5}=0.798^{+0.014}_{-0.015}$ (marginalized mean with 68% CL) when using the non-linear alignment model (NLA) and $S_{8} = 0.783^{+0.019}_{-0.015}$ with the tidal alignment and tidal torque model (TATT), providing 1.8% and 2.5% uncertainty on $S_8$. Compared to constraints from the cosmic microwave background from Planck 2018, ACT DR6 and SPT-3G DR1, we find consistency in the full parameter space at 1.1$\\sigma$ (1.7$\\sigma$) and in $S_8$ at 2.0$\\sigma$ (2.3$\\sigma$) for NLA (TATT). The result using the NLA model is preferred according to the Bayesian evidence. We find that the model choice for IA and baryon feedback can impact the value of our $S_8$ constraint up to $1\\sigma$. For our fiducial model choices, the resultant uncertainties in $S_8$ are primarily degraded by the removal of scales, as well as the marginalization over the IA parameters. We demonstrate that our result is internally consistent and robust to different choices in calibrating the data, owing to methodological improvements in shear and redshift measurement, laying the foundation for next-generation cosmic shear programs.",
      "pdf_url": "https://arxiv.org/pdf/2602.10065.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10078",
      "title": "Constraining long-lived dark sector particles with CMB and Lyman-$α$",
      "authors": [
        "Laura Lopez-Honorez",
        "Sonali Verma"
      ],
      "abstract": "Constraining long-lived dark sector particles with CMB and Lyman-$α$ Laura Lopez-Honorez, Sonali Verma Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We use measurements of the intergalactic medium (IGM) temperature from the Lyman-$\\alpha$ forest to place new limits on models in which long-lived dark sector (DS) particles, with lifetimes longer than $10^{16}$ s, deposit energy into the IGM through their decays. Such DS decays into Standard Model (SM) states can modify the late-time thermal history of the IGM, making Lyman-$\\alpha$ data a sensitive probe of hidden sectors with cosmologically long lifetimes. Our analysis demonstrates that constraints from late-time IGM heating offer a complementary window to those from the Cosmic Microwave Background (CMB), in constraining dark sector parameter space. We further revisit limits on such decaying DS models from Planck's measurements of the optical depth to reionization and provide updates relevant for DS lifetimes longer than $10^{14}$ s. The model-independent constraints on the DS parameter space we derive in this work can be reinterpreted for a wide range of decaying hidden-sector scenarios, including evaporating primordial black holes and SM-coupled dark photons.",
      "pdf_url": "https://arxiv.org/pdf/2602.10078.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10107",
      "title": "Measurement of the Full Shape of the Thermal Sunyaev-Zeldovich Power Spectrum from South Pole Telescope and {\\it Herschel}-SPIRE Observations",
      "authors": [
        "S. Raghunathan",
        "P. A. R. Ade",
        "D. Anbajagane",
        "A. J. Anderson",
        "B. Ansarinejad",
        "M. Archipley",
        "J. E. Austermann",
        "L. Balkenhol",
        "D. R. Barron",
        "P. S. Barry",
        "J. A. Beall",
        "K. Benabed",
        "A. N. Bender",
        "B. A. Benson",
        "F. Bianchini",
        "L. E. Bleem",
        "J. Bock",
        "S. Bocquet",
        "F. R. Bouchet",
        "L. Bryant",
        "E. Camphuis",
        "M. G. Campitiello",
        "J. E. Carlstrom",
        "J. Carron",
        "C. L. Chang",
        "P. Chaubal",
        "H. C. Chiang",
        "P. M. Chichura",
        "A. Chokshi",
        "T.-L. Chou",
        "R. Citron",
        "A. Coerver",
        "C. Corbett Moran",
        "T. M. Crawford",
        "A. T. Crites",
        "C. Daley",
        "T. de Haan",
        "K. R. Dibert",
        "M. A. Dobbs",
        "M. Doohan",
        "A. Doussot",
        "D. Dutcher",
        "W. Everett",
        "C. Feng",
        "K. R. Ferguson",
        "N. C. Ferree",
        "K. Fichman",
        "A. Foster",
        "S. Galli",
        "J. Gallicchio",
        "A. E. Gambrel",
        "A. K. Gao",
        "R. W. Gardner",
        "F. Ge",
        "E. M. George",
        "N. Goeckner-Wald",
        "R. Gualtieri",
        "F. Guidi",
        "S. Guns",
        "N. Gupta",
        "N. W. Halverson",
        "E. Hivon",
        "A. Y. Q. Ho",
        "G. P. Holder",
        "W. L. Holzapfel",
        "J. C. Hood",
        "J. D. Hrubes",
        "A. Hryciuk",
        "N. Huang",
        "J. Hubmayr",
        "K. D. Irwin",
        "T. Jhaveri",
        "F. Kéruzoré",
        "A. R. Khalife",
        "L. Knox",
        "M. Korman",
        "K. Kornoelje",
        "C.-L. Kuo",
        "A. T. Lee",
        "K. Levy",
        "Y. Li",
        "D. Li",
        "A. E. Lowitz",
        "A. Lowitz",
        "C. Lu",
        "G. P. Lynch",
        "T. J. Maccarone",
        "A. S. Maniyar",
        "E. S. Martsen",
        "J. J. McMahon",
        "F. Menanteau",
        "M. Millea",
        "J. Montgomery",
        "Y. Nakato",
        "T. Natoli",
        "J. P. Nibarger",
        "G. I. Noble",
        "V. Novosad",
        "Y. Omori",
        "A. Ouellette"
      ],
      "abstract": "Measurement of the Full Shape of the Thermal Sunyaev-Zeldovich Power Spectrum from South Pole Telescope and {\\it Herschel}-SPIRE Observations S. Raghunathan, P. A. R. Ade, D. Anbajagane, A. J. Anderson, B. Ansarinejad, M. Archipley, J. E. Austermann, L. Balkenhol, D. R. Barron, P. S. Barry, J. A. Beall, K. Benabed, A. N. Bender, B. A. Benson, F. Bianchini, L. E. Bleem, J. Bock, S. Bocquet, F. R. Bouchet, L. Bryant, E. Camphuis, M. G. Campitiello, J. E. Carlstrom, J. Carron, C. L. Chang, P. Chaubal, H. C. Chiang, P. M. Chichura, A. Chokshi, T.-L. Chou, R. Citron, A. Coerver, C. Corbett Moran, T. M. Crawford, A. T. Crites, C. Daley, T. de Haan, K. R. Dibert, M. A. Dobbs, M. Doohan, A. Doussot, D. Dutcher, W. Everett, C. Feng, K. R. Ferguson, N. C. Ferree, K. Fichman, A. Foster, S. Galli, J. Gallicchio, A. E. Gambrel, A. K. Gao, R. W. Gardner, F. Ge, E. M. George, N. Goeckner-Wald, R. Gualtieri, F. Guidi, S. Guns, N. Gupta, N. W. Halverson, E. Hivon, A. Y. Q. Ho, G. P. Holder, W. L. Holzapfel, J. C. Hood, J. D. Hrubes, A. Hryciuk, N. Huang, J. Hubmayr, K. D. Irwin, T. Jhaveri, F. Kéruzoré, A. R. Khalife, L. Knox, M. Korman, K. Kornoelje, C.-L. Kuo, A. T. Lee, K. Levy, Y. Li, D. Li, A. E. Lowitz, A. Lowitz, C. Lu, G. P. Lynch, T. J. Maccarone, A. S. Maniyar, E. S. Martsen, J. J. McMahon, F. Menanteau, M. Millea, J. Montgomery, Y. Nakato, T. Natoli, J. P. Nibarger, G. I. Noble, V. Novosad, Y. Omori, A. Ouellette 22 pages, 10 figures; Comments welcome; Data products and plotting scripts can be downloaded from this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a measurement of the full shape of the power spectrum of the thermal Sunyaev-Zeldovich (tSZ) effect down to arcminute scales using cosmic microwave background (CMB) data from the South Pole Telescope (SPT) over roughly 100 ${\\rm deg}^{2}$ field. The analysis incorporates data from the 2019/20 seasons of the SPT-3G survey in bands centered at 95, 150, and 220 GHz; from the full SPTpol dataset at 150 GHz; and from {\\it Herschel}-SPIRE survey in bands centered at 600 and 857 GHz. We combine data from all the above bands using linear combination (LC) techniques to produce a tSZ or Compton-$y$ map. We modify the LC weights to produce multiple versions of the Compton-$y$ map, including minimum-variance (MV) and foreground-minimized (-min) maps. We measure the auto- and cross-spectra of a subset of these maps in the range $\\ell \\in [500, 5000]$. While this power spectrum includes contributions from signals other than tSZ, we present numerous checks to show that the most challenging foreground signal, the cosmic infrared background (CIB) is much lower than the desired tSZ signal in the scales of interest in this work. The final tSZ power spectrum is measured at $9.3\\sigma$ with both the MV and CIB-min maps. Our results are consistent with those reported in other CMB surveys across the literature. Using the difference in the tSZ power spectrum from MV and CIB-min maps, we reconstruct the scale-dependent tSZ-CIB cross-correlation $\\rho_{\\ell}^{\\rm tSZ \\times CIB}$, finding $3.1\\sigma$ evidence for a nonzero correlation coefficient that is positive on large scales and approaches zero for $\\ell > 2500$. This result represents the deepest tSZ maps ever produced and provides new constraints that can help refine astrophysical feedback mechanisms and models of the intracluster medium.",
      "pdf_url": "https://arxiv.org/pdf/2602.10107.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09091",
      "title": "All the Massive Galaxy Overdensities during Reionization: JWST Rest-Frame Optical Selection Reveals Young, Chemically Evolved Galaxies Embedded in Dense, Neutral Gas at z > 5",
      "authors": [
        "Chamilla Terp",
        "Kasper E. Heintz",
        "Jorryt Matthee",
        "Rohan P. Naidu",
        "Pascal A. Oesch",
        "Callum Witten",
        "Daichi Kashino",
        "Clara L. Pollock",
        "Claudia Di Cesare",
        "Alberto Torralba"
      ],
      "abstract": "All the Massive Galaxy Overdensities during Reionization: JWST Rest-Frame Optical Selection Reveals Young, Chemically Evolved Galaxies Embedded in Dense, Neutral Gas at z > 5 Chamilla Terp, Kasper E. Heintz, Jorryt Matthee, Rohan P. Naidu, Pascal A. Oesch, Callum Witten, Daichi Kashino, Clara L. Pollock, Claudia Di Cesare, Alberto Torralba Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The high-redshift progenitors of present-day galaxy clusters are believed to substantially contribute to the global star-formation rate density and drive the large-scale reionization of the Universe. Here we present a blind and unbiased search for and characterization of galaxy overdensities during the reionization epoch at redshifts $z\\sim 5.5-7$, based on rest-frame optical JWST/NIRCam grism spectroscopy of the Abell\\,2744 lensing field as part of the JWST-ALT survey. Using a physically-motivated, cosmological inference Friends-of-Friends (FoF) algorithm, we identify six galaxy overdensities, including five robust systems at $z=5.66$ to $6.77$. They are all characterized by total halo masses $M_{\\rm halo} \\gtrsim 10^{11}\\,M_{\\odot}$ inferred from a range of proxies. We find that the galaxy members in these overdense environments are on average less massive though equally metal-rich, and generally comprised of younger stellar populations as indicated from their bluer spectral slopes less prominent Balmer breaks, than field galaxies at similar redshifts. Further, we use this novel rest-frame optical selection of galaxy proto-clusters to infer the fraction and 3D distribution of strong Lyman-$\\alpha$ emitters (LAEs) and damped Lyman-$\\alpha$ absorbers (DLAs) in the overdensity environments. We find that two out of six galaxy overdensities have excess \\hi\\ absorption compared to the field-average, while the other four are consistent within their large scatter in density. These results present the first direct observational constraints on the tomography of the dense, neutral gas reservoirs in large-scale galaxy overdensities at $z>5$ and highlight the limitations of pre-JWST searches for reionization-era galaxy overdensities relying on the detection of strong LAEs alone.[Abridged]",
      "pdf_url": "https://arxiv.org/pdf/2602.09091.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09096",
      "title": "A Faint Progenitor System for the Faint Supernova 2024vjm",
      "authors": [
        "Erez A. Zimmerman , Avishay Gal-Yam , Paul J. Groot , Eran O. Ofek , Jan van Roestel , Andrea Pastorello , Stefano Valenti , Aravind P. Ravi , Ping Chen , Steve Schulze , Nadejda Blagorodnova , Maxime Wavasseur , Marco A. Gomez-Munoz , Hugo Tranin , Simon de Wet , Giorgos Leloudas , Paul M. Vreeswijk , Lindsey A. Kwok , Michaela Schwab , Saurabh W. Jha , Kate Maguire , David J. Sand , Eric Stringer , Thomas Kupfer , Tamar Faran , Joseph P. Anderson , Jennifer Andrews , Moira Andrews , Avshalom Badash , Steven Bloemen , K. Azalee Bostroem , Ting-Wan Chen , Massimo Della Valle , Georgios Dimitriadis , Yize Dong , Joseph R. Farah , James H. Gillanders , Benjamin Godson , Mariusz Gromadzki , Daichi Hiramatsu , Emily Hoang , D. Andrew Howell , Daryl Janzen , Hanindyo Kuncarayakti , Jiaxuan Li , Joseph D. Lyman , Keiichi Maeda , Mark R. Magee , Darshana Mehta , Andrew Milligan , Shane Moran , Yuan Qi Ni , David O'Neill , Jeniveve Pearson , Danielle L. A. Pieterse , Giuliano Pignata , Andrea Reguitti , Daniel E. Reichart , Nicolas Meza Retamal , Rita P. Santos , Simone Scaringi , Manisha Shrestha , Shubham Srivastav , Fiorenzo Stoppa , Bhagya Subrayan , Giorgio Valerin , Xiaofeng Wang , Kathryn Wynn , Ofer Yaron , Weicheng Zang Weizmann Institute of Science, Department of Mathematics/IMAPP, Radboud University, University of Cape Town, South African Astronomical Observatory, Institute of Science and Technology Austria, University of Amsterdam, INAF - Osservatorio Astronomico di Padova, University of California, Davis, Institute for Advanced Study in Physics, Zhejiang University, Institute for Astronomy, School of Physics, Zhejiang University, Center for Interdisciplinary Exploration and Research in Astrophysics , Institut de Ci`encies del Cosmos , University of Florida, Institut dEstudis Espacials de Catalunya , Departament de Fisica Quantica i Astrofisica , Technical University of Denmark, Radboud University, The State University of New Jersey, University of Virginia, Trinity College Dublin, Steward Observatory, University of Arizona, University of Hamburg, European Southern Observatory, Gemini Observatory, Las Cumbres Observatory, University of California, Santa Barbara, LSSTC Catalyst Fellow, National Central University, INAF - Osservatorio Astronomico di Capodimonte, Lancaster University, Center for Astrophysics | Harvard &amp; Smithsonian, University of California, Santa Barbara, University of Oxford, University of Warwick, University of Warsaw, University of Saskatchewan, Tuorla Observatory, University of Turku, Finnish Centre for Astronomy with ESO , University of Turku, Princeton University, Kyoto University, University of Leicester, University of California, Santa Barbara, University of Birmingham, Instituto de Alta Investigacion, INAF - Osservatorio Astronomico di Brera, University of North Carolina, CENTRA, Durham University, Monash University, OzGrav: The ARC Center of Excellence for Gravitational Wave Discovery, Tsinghua University, Westlake University)"
      ],
      "abstract": "A Faint Progenitor System for the Faint Supernova 2024vjm Erez A. Zimmerman (1), Avishay Gal-Yam (1), Paul J. Groot (2,3,4), Eran O. Ofek (1), Jan van Roestel (5,6), Andrea Pastorello (7), Stefano Valenti (8), Aravind P. Ravi (8), Ping Chen (9,10), Steve Schulze (1,11), Nadejda Blagorodnova (12,13,14), Maxime Wavasseur (12,15), Marco A. Gomez-Munoz (12,15), Hugo Tranin (12,14,15), Simon de Wet (16), Giorgos Leloudas (16), Paul M. Vreeswijk (17), Lindsey A. Kwok (11), Michaela Schwab (18,19), Saurabh W. Jha (18), Kate Maguire (20), David J. Sand (21), Eric Stringer (22), Thomas Kupfer (22), Tamar Faran (1), Joseph P. Anderson (23), Jennifer Andrews (24), Moira Andrews (25,26), Avshalom Badash (1), Steven Bloemen (2), K. Azalee Bostroem (21,27), Ting-Wan Chen (28), Massimo Della Valle (29), Georgios Dimitriadis (30), Yize Dong (31), Joseph R. Farah (25,32), James H. Gillanders (33), Benjamin Godson (34), Mariusz Gromadzki (35), Daichi Hiramatsu (13), Emily Hoang (8), D. Andrew Howell (25,26), Daryl Janzen (36), Hanindyo Kuncarayakti (37,38), Jiaxuan Li (39), Joseph D. Lyman (34), Keiichi Maeda (40), Mark R. Magee (34), Darshana Mehta (8), Andrew Milligan (30), Shane Moran (41), Yuan Qi Ni (25,42), David O'Neill (43), Jeniveve Pearson (21), Danielle L. A. Pieterse (2), Giuliano Pignata (44), Andrea Reguitti (7,45), Daniel E. Reichart (46), Nicolas Meza Retamal (8), Rita P. Santos (23,47), Simone Scaringi (48,29), Manisha Shrestha (49,50), Shubham Srivastav (33), Fiorenzo Stoppa (33), Bhagya Subrayan (21), Giorgio Valerin (7), Xiaofeng Wang (51), Kathryn Wynn (25,32), Ofer Yaron (1), Weicheng Zang (52) ((1) Weizmann Institute of Science, (2) Department of Mathematics/IMAPP, Radboud University, (3) University of Cape Town, (4) South African Astronomical Observatory, (5) Institute of Science and Technology Austria, (6) University of Amsterdam, (7) INAF - Osservatorio Astronomico di Padova, (8) University of California, Davis, (9) Institute for Advanced Study in Physics, Zhejiang University, (10) Institute for Astronomy, School of Physics, Zhejiang University, (11) Center for Interdisciplinary Exploration and Research in Astrophysics (CIERA), (12) Institut de Ci`encies del Cosmos (ICCUB), (13) University of Florida, (14) Institut dEstudis Espacials de Catalunya (IEEC), (15) Departament de Fisica Quantica i Astrofisica (FQA), (16) Technical University of Denmark, (17) Radboud University, (18) The State University of New Jersey, (19) University of Virginia, (20) Trinity College Dublin, (21) Steward Observatory, University of Arizona, (22) University of Hamburg, (23) European Southern Observatory, (24) Gemini Observatory, (25) Las Cumbres Observatory, (26) University of California, Santa Barbara, (27) LSSTC Catalyst Fellow, (28) National Central University, (29) INAF - Osservatorio Astronomico di Capodimonte, (30) Lancaster University, (31) Center for Astrophysics | Harvard &amp; Smithsonian, (32) University of California, Santa Barbara, (33) University of Oxford, (34) University of Warwick, (35) University of Warsaw, (36) University of Saskatchewan, (37) Tuorla Observatory, University of Turku, (38) Finnish Centre for Astronomy with ESO (FINCA), University of Turku, (39) Princeton University, (40) Kyoto University, (41) University of Leicester, (42) University of California, Santa Barbara, (43) University of Birmingham, (44) Instituto de Alta Investigacion, (45) INAF - Osservatorio Astronomico di Brera, (46) University of North Carolina, (47) CENTRA, (48) Durham University, (49) Monash University, (50) OzGrav: The ARC Center of Excellence for Gravitational Wave Discovery, (51) Tsinghua University, (52) Westlake University) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Type Ia Supernovae (SNe Ia) are well known for their role as standardizable cosmological candles. Their uniformity is credited to their single origin as thermonuclear explosions of White dwarf (WD) stars. Nevertheless, some SNe Ia break this regularity. Prominently, the Iax subclass are less energetic and remarkably diverse, raising questions about their progenitor systems. While no progenitor system of a normal SN Ia has ever been detected, a luminous blue star was identified in pre-explosion images of the site of the bright SN Iax SN 2012Z, suggested to be a helium giant companion star acting as a mass donor to a WD SN progenitor. This is in line with models of weak mass accretion of a WD from a binary companion, producing an explosion that does not fully disrupt the star. However, these models fail to explain the properties of the faintest Type Iax explosions, suggesting either they originate from other WD binary systems, or even from massive progenitor stars. Here, we present the faint SN Iax SN 2024vjm - possibly the faintest supernova observed to date. Using a deep pre-explosion image taken by the recently launched Euclid space mission, we show that its progenitor system must be fainter than the helium giant SN Iax progenitor candidate of SN 2012Z, as well as that of the luminous red companion or remnant of the faint SN 2008ha, and may require a subdwarf helium star as a mass donor. The deep image also provides strong arguments against a massive star origin for this faint supernova. Our observations argue that SN 2024vjm is a WD explosion, but we find that remarkably faint SNe Iax fade more slowly than bright ones, i.e., they evolve in an opposite manner from the famous Phillips relation that makes regular SNe Ia cosmological candles.",
      "pdf_url": "https://arxiv.org/pdf/2602.09096.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.09104",
      "title": "Black Hole Feedback, Galaxy Quenching and Outflows at Cosmic Dawn: Analysis of the SEEDZ Simulations",
      "authors": [
        "Lewis R. Prole",
        "John A. Regan",
        "Daxal Mehta",
        "Rüdiger Pakmor",
        "Sophie Koudmani",
        "Martin A. Bourne",
        "Simon C. O. Glover",
        "John H. Wise",
        "Ralf S. Klessen",
        "Michael Tremmel",
        "Debora Sijacki",
        "Ricarda S. Beckmann",
        "Martin G. Haehnelt",
        "John Brennan",
        "Pelle van de Bor",
        "Paul C. Clark"
      ],
      "abstract": "Black Hole Feedback, Galaxy Quenching and Outflows at Cosmic Dawn: Analysis of the SEEDZ Simulations Lewis R. Prole, John A. Regan, Daxal Mehta, Rüdiger Pakmor, Sophie Koudmani, Martin A. Bourne, Simon C. O. Glover, John H. Wise, Ralf S. Klessen, Michael Tremmel, Debora Sijacki, Ricarda S. Beckmann, Martin G. Haehnelt, John Brennan, Pelle van de Bor, Paul C. Clark submitted to the Open Journal of Astrophysics. arXiv admin note: text overlap with arXiv:2511.09640 Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Here we analyse the growth and feedback effects of massive black holes (MBHs) in the SEEDZ simulations. The most massive black holes grow to masses of $\\sim10^{6}$ M$_\\odot$ by $z=12.5$ during short bursts of super-Eddington accretion, sustained over a period of 5-30 Myr. We find that the determining factor that cuts off this initial growth is feedback from the MBH itself, rather than nearby supernovae or exhausting the available gas reservoir. Our simulations show that for the most actively accreting MBHs, feedback completely evacuates the gas from the host halo and ejects it into the inter-galactic medium. Despite implementing a relatively weak feedback model, the energy injected into the gas surrounding the MBH exceeds the binding energy of the halo. These results either indicate that MBH feedback in the early ($\\Lambda$CDM) Universe is much weaker than previously assumed, or that at least some of the high redshift galaxies we currently observe with JWST formed via a two-step process, whereby a MBH initially quenches its host galaxy and later reconstitutes its baryonic reservoir, either through mergers with gas rich galaxies or from accretion from the cosmic web. Moreover, the maximum black hole masses that emerge in SEEDZ are effectively set by a combination of MBH feedback modelling and the binding potential of the host halo. Unless feedback is extremely ineffective at early times (for example if growth is merger dominated rather than accretion dominated or feedback is contained close to the MBH) then the maximum mass of black holes at redshift before 12.5 should not significantly exceed $10^6$ M$_\\odot$.",
      "pdf_url": "https://arxiv.org/pdf/2602.09104.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.05665",
      "title": "Dark Energy Survey Year 6 Results: Cell-based Coadds and Metadetection Weak Lensing Shape Catalogue",
      "authors": [
        "M. Yamamoto",
        "M. R. Becker",
        "E. Sheldon",
        "M. Jarvis",
        "R. A. Gruendl",
        "F. Menanteau",
        "E. S. Rykoff",
        "S. Mau",
        "T. Schutt",
        "M. Gatti",
        "M. A. Troxel",
        "A. Amon",
        "D. Anbajagane",
        "G. M. Bernstein",
        "D. Gruen",
        "E. M. Huff",
        "M. Tabbutt",
        "A. Tong",
        "B. Yanny",
        "T. M. C. Abbott",
        "M. Aguena",
        "A. Alarcon",
        "F. Andrade-Oliveira",
        "K. Bechtol",
        "J. Blazek",
        "D. Brooks",
        "A. Carnero Rosell",
        "J. Carretero",
        "C. Chang",
        "A. Choi",
        "M. Costanzi",
        "M. Crocce",
        "L. N. da Costa",
        "T. M. Davis",
        "J. De Vicente",
        "S. Desai",
        "H. T. Diehl",
        "S. Dodelson",
        "P. Doel",
        "C. Doux",
        "A. Drlica-Wagner",
        "A. Ferté",
        "B. Flaugher",
        "J. Frieman",
        "J. García-Bellido",
        "E. Gaztanaga",
        "G. Giannini",
        "G. Gutierrez",
        "W. G. Hartley",
        "K. Herner",
        "S. R. Hinton",
        "D. L. Hollowood",
        "K. Honscheid",
        "D. Huterer",
        "E. Krause",
        "K. Kuehn",
        "O. Lahav",
        "M. Lima",
        "J. L. Marshall",
        "J. Mena-Fernández",
        "R. Miquel",
        "J. J. Mohr",
        "J. Muir",
        "J. Myles",
        "R. L. C. Ogando",
        "A. Pieres",
        "A. A. Plazas Malagón",
        "A. Porredon",
        "J. Prat",
        "M. Raveri",
        "M. Rodriguez-Monroy",
        "A. Roodman",
        "S. Samuroff",
        "E. Sanchez",
        "D. Sanchez Cid",
        "V. Scarpine",
        "I. Sevilla-Noarbe",
        "M. Smith",
        "E. Suchyta",
        "G. Tarle",
        "V. Vikram",
        "N. Weaverdyck",
        "P. Wiseman",
        "Y. Zhang"
      ],
      "abstract": "Dark Energy Survey Year 6 Results: Cell-based Coadds and Metadetection Weak Lensing Shape Catalogue M. Yamamoto, M. R. Becker, E. Sheldon, M. Jarvis, R. A. Gruendl, F. Menanteau, E. S. Rykoff, S. Mau, T. Schutt, M. Gatti, M. A. Troxel, A. Amon, D. Anbajagane, G. M. Bernstein, D. Gruen, E. M. Huff, M. Tabbutt, A. Tong, B. Yanny, T. M. C. Abbott, M. Aguena, A. Alarcon, F. Andrade-Oliveira, K. Bechtol, J. Blazek, D. Brooks, A. Carnero Rosell, J. Carretero, C. Chang, A. Choi, M. Costanzi, M. Crocce, L. N. da Costa, T. M. Davis, J. De Vicente, S. Desai, H. T. Diehl, S. Dodelson, P. Doel, C. Doux, A. Drlica-Wagner, A. Ferté, B. Flaugher, J. Frieman, J. García-Bellido, E. Gaztanaga, G. Giannini, G. Gutierrez, W. G. Hartley, K. Herner, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. Huterer, E. Krause, K. Kuehn, O. Lahav, M. Lima, J. L. Marshall, J. Mena-Fernández, R. Miquel, J. J. Mohr, J. Muir, J. Myles, R. L. C. Ogando, A. Pieres, A. A. Plazas Malagón, A. Porredon, J. Prat, M. Raveri, M. Rodriguez-Monroy, A. Roodman, S. Samuroff, E. Sanchez, D. Sanchez Cid, V. Scarpine, I. Sevilla-Noarbe, M. Smith, E. Suchyta, G. Tarle, V. Vikram, N. Weaverdyck, P. Wiseman, Y. Zhang (DES collaboration) Mon Not R Astron Soc (2025) 4156-4186 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present the Metadetection weak lensing galaxy shape catalogue from the six-year Dark Energy Survey (DES Y6) imaging data. This dataset is the final release from DES, spanning 4422 deg$^2$ of the southern sky. We describe how the catalogue was constructed, including the two new major processing steps, cell-based image coaddition and shear measurements with Metadetection. The DES Y6 Metadetection weak lensing shape catalogue consists of 151,922,791 galaxies detected over riz bands, with an effective number density of $n_{\\rm eff}$ =8.22 galaxies per arcmin$^2$ and shape noise of $\\sigma_e$ = 0.29. We carry out a suite of validation tests on the catalogue, including testing for PSF leakage, testing for the impact of PSF modeling errors, and testing the correlation of the shear measurements with galaxy, PSF, and survey properties. In addition to demonstrating that our catalogue is robust for weak lensing science, we use the DES Y6 image simulation suite (Mau, Becker et al. 2025) to estimate the overall multiplicative shear bias of our shear measurement pipeline. We find no detectable multiplicative bias at the roughly half-percent level, with m = (3.4 $\\pm$ 6.1) x $10^{-3}$, at 3$\\sigma$ uncertainty. This is the first time both cell-based coaddition and Metadetection algorithms are applied to observational data, paving the way to the Stage-IV weak lensing surveys.",
      "pdf_url": "https://arxiv.org/pdf/2501.05665.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.03840",
      "title": "Retrieving the hot circumgalactic medium physics from the X-ray radial profile from eROSITA with an IlustrisTNG-based forward model",
      "authors": [
        "Soumya Shreeram",
        "Johan Comparat",
        "Andrea Merloni",
        "Gabriele Ponti",
        "Paola Popesso",
        "Yi Zhang",
        "Kirpal Nandra",
        "Mara Salvato",
        "Ilaria Marini",
        "Johannes Buchner",
        "Nicola Locatelli",
        "Zsofi Igo"
      ],
      "abstract": "Retrieving the hot circumgalactic medium physics from the X-ray radial profile from eROSITA with an IlustrisTNG-based forward model Soumya Shreeram, Johan Comparat, Andrea Merloni, Gabriele Ponti, Paola Popesso, Yi Zhang, Kirpal Nandra, Mara Salvato, Ilaria Marini, Johannes Buchner, Nicola Locatelli, Zsofi Igo Published in A&A, 11 pages, 6 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Recent eROSITA measurements of the radial profiles of the hot CGM in the Milky-Way stellar mass (MW-mass) regime provide us with a new benchmark to constrain the hot gas around MW-mass central and satellite galaxies and their halo mass distributions. Modelling this rich data set with state-of-the-art hydrodynamical simulations is required to further our understanding of the shortcomings in the current paradigm of galaxy formation and evolution models. We develop forward models for the stacked X-ray radial surface brightness profile measured by eROSITA around MW-mass galaxies. Our model contains two emitting components: hot gas (around central galaxies and satellite galaxies hosted by more massive halos) and X-ray point sources (X-ray binaries and Active Galactic Nuclei). We model the hot gas profile using the TNG300-based products. We generate mock observations with our TNG300-based model (matching stellar mass and redshift with observations) with different underlying halo mass distributions. We show that for the same mean stellar mass, a factor 2x increase in the mean value of the underlying halo mass distribution results in a ~4x increase in the stacked X-ray luminosity from the hot CGM. The point sources are described by a simple point-spread-function (PSF) of eROSITA, and we fit their normalization in this work. Using empirical models to derive a permissible range of AGN and XRB luminosities in the MW-mass X-ray galaxy stack, we choose our forward model best describing the hot CGM for the eROSITA observations. We find that at < 40 kpc from the galaxy centre, the hot CGM from central galaxies and the X-ray point sources emission each account for 40-50% of the total X-ray emission budget. In summary, we show that the gas physics driving the shape of the observed hot CGM (in stellar-mass-selected samples) is tightly correlated by the underlying halo-mass distribution (abridged).",
      "pdf_url": "https://arxiv.org/pdf/2504.03840.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.19177",
      "title": "Probing Dark Matter Substructures with Free-Form Modelling: A Case Study of the `Jackpot' Strong Lens",
      "authors": [
        "Xiaoyue Cao",
        "Ran Li",
        "James W. Nightingale",
        "Richard Massey",
        "Qiuhan He",
        "Aristeidis Amvrosiadis",
        "Andrew Robertson",
        "Shaun Cole",
        "Carlos S. Frenk",
        "Xianghao Ma",
        "Leo W.H. Fung",
        "Maximilian von Wietersheim-Kramsta",
        "Samuel C. Lange",
        "Kaihao Wang",
        "Liang Gao"
      ],
      "abstract": "Probing Dark Matter Substructures with Free-Form Modelling: A Case Study of the `Jackpot' Strong Lens Xiaoyue Cao, Ran Li, James W. Nightingale, Richard Massey, Qiuhan He, Aristeidis Amvrosiadis, Andrew Robertson, Shaun Cole, Carlos S. Frenk, Xianghao Ma, Leo W.H. Fung, Maximilian von Wietersheim-Kramsta, Samuel C. Lange, Kaihao Wang, Liang Gao 23 pages, 14 figures, and 4 tables. Minor revisions to align with the version accepted by MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Characterising the population and internal structure of sub-galactic halos is critical for constraining the nature of dark matter. These halos can be detected near galaxies that act as strong gravitational lenses with extended arcs, as they perturb the shapes of the arcs. However, this method is subject to false-positive detections and systematic uncertainties, particularly degeneracies between an individual halo and larger-scale asymmetries in the distribution of lens mass. We present a new free-form lens modelling code, developed within the framework of the open-source software \\texttt{PyAutoLens}, to address these challenges. Our method models mass perturbations that cannot be captured by parametric models as pixelized potential corrections and suppresses unphysical solutions via a Matérn regularisation scheme that is inspired by Gaussian process regression. This approach enables the recovery of diverse mass perturbations, including subhalos, line-of-sight halos, external shear, and multipole components that represent the complex angular mass distribution of the lens galaxy, such as boxiness/diskiness. Additionally, our fully Bayesian framework objectively infers hyperparameters associated with the regularisation of pixelized sources and potential corrections, eliminating the need for manual fine-tuning. By applying our code to the well-known `Jackpot' lens system, SLACS0946+1006, we robustly detect a highly concentrated subhalo that challenges the standard cold dark matter model. This study represents the first attempt to independently reveal the mass distribution of a subhalo using a fully free-form approach.",
      "pdf_url": "https://arxiv.org/pdf/2504.19177.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.21082",
      "title": "Kiloparsec-scale turbulence driven by reionization may grow intergalactic magnetic fields",
      "authors": [
        "Christopher Cain",
        "Matthew McQuinn",
        "Evan Scannapieco",
        "Anson D'Aloisio",
        "Hy Trac"
      ],
      "abstract": "Kiloparsec-scale turbulence driven by reionization may grow intergalactic magnetic fields Christopher Cain, Matthew McQuinn, Evan Scannapieco, Anson D'Aloisio, Hy Trac 6 pages + 2 figures main text, 2 pages + 1 figure appendices, 9 pages + 7 figures supplementary material. Equivalent to the version published in PRD Published in Phys. Rev. D, Vol. 113, Issue 2, pages 23-50, Jan. 2026 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The intergalactic medium (IGM) underwent intense heating that resulted in pressure disequilibrium in the wake of ionization fronts during cosmic reionization. The dynamical relaxation to restore pressure balance may have driven small-scale turbulence and, hence, the amplification of intergalactic magnetic fields. We investigate this possibility for the first time using a suite of $\\approx 100$ pc resolution radiation-hydrodynamics simulations of IGM gas dynamics. We show that as the spatial resolution improves beyond that achieved with most prior studies, much of the IGM becomes turbulent unless it was pre-heated to $\\gg 100~$K before reionization. In our most turbulent simulations, we find that the gas energy spectrum follows the expected $k^{-5/3}$ Kolmogorov scaling to the simulation's resolution, and the eddy turnover time of the turbulence is $< 1$ Gyr at $k \\approx 1 ~$kpc$^{-1}$. Turbulence will grow magnetic fields, and we show that the fields grown by reionization-driven turbulence could explain lower limits on the strength of volume-filling B-fields from observations of TeV blazars. As reionization sweeps over the cosmos, this mechanism could create turbulence throughout the cosmic volume with a character that only depends on the amount of IGM preheating.",
      "pdf_url": "https://arxiv.org/pdf/2504.21082.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.22718",
      "title": "$\\texttt{SwiftC}_\\ell$: fast differentiable angular power spectra beyond Limber",
      "authors": [
        "Laura Reymond",
        "Alexander Reeves",
        "Pierre Zhang",
        "Alexandre Refregier"
      ],
      "abstract": "$\\texttt{SwiftC}_\\ell$: fast differentiable angular power spectra beyond Limber Laura Reymond, Alexander Reeves, Pierre Zhang, Alexandre Refregier 19 pages, 7 figures, accepted to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) The upcoming stage IV wide-field surveys will provide high precision measurements of the large-scale structure (LSS) of the universe. Their interpretation requires fast and accurate theoretical predictions including large scales. For this purpose, we introduce $\\texttt{SwiftC}_\\ell$, a fast, accurate and differentiable $\\texttt{JAX}$-based pipeline for the computation of the angular power spectrum beyond the Limber approximation. It uses a new FFTLog-based method which can reach arbitrary precision and includes interpolation along $k$, allowing for $k$-dependent growth factor and biases. $\\texttt{SwiftC}_\\ell$ includes a wide range of probes and effects such as galaxy clustering, including magnification bias, redshift-space distortions and primordial non-Gaussianity, weak lensing, including intrinsic alignment, cosmic microwave background (CMB) lensing and CMB integrated Sachs-Wolfe effect. We compare our pipeline to the other available beyond-Limber codes within the N5K challenge from the Rubin Observatory Legacy Survey of Space and Time (LSST) Dark Energy Science Collaboration. $\\texttt{SwiftC}_\\ell$ computes the 120 different angular power spectra over 103 $\\ell$-multipoles in 5 ms on one GPU core while the computation of the gradient is approximately 4$\\times$ slower. Using a pre-calculation, $\\texttt{SwiftC}_\\ell$ is thus about 40$\\times$ faster than the winner of the N5K challenge with comparable accuracy. Furthermore, all outputs are auto-differentiable, facilitating gradient-based sampling and robust and accurate Fisher forecasts. We showcase a Markov Chain Monte Carlo, a Hamiltonian Monte Carlo and a Fisher forecast on an LSST-like survey, illustrating $\\texttt{SwiftC}_\\ell$'s differentiability, speed and reliability in measuring cosmological parameters. The code is publicly available at this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2505.22718.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.02692",
      "title": "Cosmic structure from the path integral of classical mechanics and its comparison to standard perturbation theory",
      "authors": [
        "Marvin Sipp",
        "Hannes Heisler",
        "Matthias Bartelmann"
      ],
      "abstract": "Cosmic structure from the path integral of classical mechanics and its comparison to standard perturbation theory Marvin Sipp, Hannes Heisler, Matthias Bartelmann 16 pages, 2 figures; minor improvements, results and conclusions unchanged Phys. Rev. D 113, 043510 (2026) Cosmology and Nongalactic Astrophysics (astro-ph.CO); Statistical Mechanics (cond-mat.stat-mech) We investigate cosmic structure formation in the framework of a path-integral formulation of an $N$-particle ensemble in phase space, dubbed Resummed Kinetic Field Theory (RKFT), up to one-loop perturbative order. In particular, we compute power spectra of the density contrast, the divergence and curl of the momentum density and arbitrary $n$-point cumulants of the stress tensor. In contrast to earlier works, we propose a different method of sampling initial conditions, with a Gaussian initial phase-space density. Doing so, we exactly reproduce the corresponding results from Eulerian standard perturbation theory (SPT) at one-loop order, showing that formerly found deviations can be fully attributed to inconsistencies in the previous sampling method. Since, in contrast to SPT, the full phase-space description does not assume a truncation of the Vlasov hierarchy, our findings suggest that nonperturbative techniques are required to accurately capture the physics of cosmic structure formation.",
      "pdf_url": "https://arxiv.org/pdf/2507.02692.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.11846",
      "title": "Precise Measurement of the Absolute Sky Brightness at 60 to 350 MHz",
      "authors": [
        "Luke McKay",
        "Ravi Subrahmanyan",
        "Aaron Chippendale",
        "Pietro Bolli",
        "Georgios Kyriakou",
        "Alex Dunning",
        "Ronald Ekers"
      ],
      "abstract": "Precise Measurement of the Absolute Sky Brightness at 60 to 350 MHz Luke McKay, Ravi Subrahmanyan, Aaron Chippendale, Pietro Bolli, Georgios Kyriakou, Alex Dunning, Ronald Ekers 6 figures, 8 pages. The article has been submitted, comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a precision measurement of radio sky brightness over 60-350 MHz. Accurate knowledge of the radio sky over these frequencies is essential for modelling foregrounds in experiments targeting cosmic dawn and the epoch of reionization. Measurements below 1 GHz are also needed to understand the Galactic cosmic ray electron spectrum, constrain nanojansky radio source populations and dark matter models, understand origins of the diffuse radio background, and improve calibration of long-wavelength radio telescopes. Here we show that current all-sky maps and the 2016 Global Sky Model (GSM2016) require substantial corrections over 60-350 MHz. GSM2016 has an offset exceeding 100 K below 100 MHz and must be scaled up by a factor increasing from 1.2 below 200 MHz to 1.5 at 350 MHz. This significantly increases previously inferred excess radio background, motivating review of faint source populations and dark-matter decay models. Our measurement used a new receiver architecture that self-calibrates its noise contribution and bandpass in situ while connected to an antenna. We used a single, accurately modelled, log-periodic SKALA4.1 antenna on a 40 m diameter SKA-Low station ground mesh. Sky models scaled to our measurements can set the absolute flux-density scale for SKA-Low and other low-frequency radio telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2509.11846.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.00753",
      "title": "Impact of projection-induced optical selection bias on the weak lensing mass calibration of galaxy clusters",
      "authors": [
        "Titus Nyarko Nde",
        "Hao-Yi Wu",
        "Shulei Cao",
        "Gladys Muthoni Kamau",
        "Andrius Tamosiunas",
        "Chun-Hao To",
        "Conghao Zhou"
      ],
      "abstract": "Impact of projection-induced optical selection bias on the weak lensing mass calibration of galaxy clusters Titus Nyarko Nde, Hao-Yi Wu, Shulei Cao, Gladys Muthoni Kamau, Andrius Tamosiunas, Chun-Hao To, Conghao Zhou Cosmology and Nongalactic Astrophysics (astro-ph.CO) Weak gravitational lensing signals of optically identified clusters are impacted by a selection bias -- halo triaxiality and large-scale structure along the line of sight simultaneously boost the lensing signal and richness (the inferred number of galaxies associated with a cluster). As a result, a cluster sample selected by richness has a mean lensing signal higher than expected from its mean mass, and the inferred mass will be biased high. This selection bias is currently limiting the accuracy of cosmological parameters derived from optical clusters. In this paper, we quantify the bias in mass calibration due to this selection bias. Using two simulations, MiniUchuu and Cardinal, with different galaxy models and cluster finders, we find that the selection bias leads to an overestimation of lensing mass at the 20-50% level, with a larger bias (20-80%) for large-scale lensing (>3 Mpc). Even with a moderate projection model, this selection bias significantly outweighs other currently known cluster lensing systematics. This work confirms the need to account for this bias in future optical cluster cosmology analyses, and we discuss strategies for mitigating this bias.",
      "pdf_url": "https://arxiv.org/pdf/2510.00753.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19798",
      "title": "Detecting gravitational lensing by matter currents",
      "authors": [
        "C. Murray",
        "R. Kou",
        "J. G. Bartlett"
      ],
      "abstract": "Detecting gravitational lensing by matter currents C. Murray, R. Kou, J. G. Bartlett Cosmology and Nongalactic Astrophysics (astro-ph.CO) We explore the observational prospects for detecting gravitational lensing induced by cosmological matter currents, a relativistic correction to the standard density lensing effect arising from the motion of matter. We propose to isolate this contribution by cross-correlating the weak-lensing convergence field with a reconstructed cosmic momentum field inferred from galaxy redshift surveys. Using numerical simulations, we demonstrate that this reconstructed momentum field is uncorrelated with the density lensing signal, enabling a clean separation of the gravitomagnetic component. We then forecast the detectability of this signal for upcoming wide-field galaxy and weak-lensing surveys, showing that a statistically significant detection may be achievable under realistic observational conditions. Such a measurement would provide the first direct probe of the large-scale cosmic momentum field, offering a novel test of general relativity and Lorentz invariance on cosmological scales.",
      "pdf_url": "https://arxiv.org/pdf/2510.19798.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03894",
      "title": "Towards an optimal extraction of cosmological parameters from galaxy cluster surveys using convolutional neural networks",
      "authors": [
        "Iñigo Sáez-Casares",
        "Matteo Calabrese",
        "Davide Bianchi",
        "Marina S. Cagliari",
        "Marco Chiarenza",
        "Jean-Marc Christille",
        "Luigi Guzzo"
      ],
      "abstract": "Towards an optimal extraction of cosmological parameters from galaxy cluster surveys using convolutional neural networks Iñigo Sáez-Casares, Matteo Calabrese, Davide Bianchi, Marina S. Cagliari, Marco Chiarenza, Jean-Marc Christille, Luigi Guzzo 23 pages, 14 figures. Minor update to match published version by Astronomy & Computing Cosmology and Nongalactic Astrophysics (astro-ph.CO) The possibility to constrain cosmological parameters from galaxy surveys using field-level machine learning methods that bypass traditional summary statistics analyses, depends crucially on our ability to generate simulated training sets. The latter need to be both realistic, as to reproduce the key features of the real data, and produced in large numbers, as to allow us to refine the precision of the training process. The analysis presented in this paper is an attempt to respond to these needs by (a) using clusters of galaxies as tracers of large-scale structure, together with (b) adopting a 3LPT code (Pinocchio) to generate a large training set of $32\\,768$ mock X-ray cluster catalogues. X-ray luminosities are stochastically assigned to dark matter haloes using an empirical $M-L_X$ scaling relation. Using this training set, we test the ability and performances of a 3D convolutional neural network (CNN) to predict the cosmological parameters, based on an input overdensity field derived from the cluster distribution. We perform a comparison with a neural network trained on traditional summary statistics, that is, the abundance of clusters and their power spectrum. Our results show that the field-level analysis combined with the cluster abundance yields a mean absolute relative error on the predicted values of $\\Omega_{\\rm m}$ and $\\sigma_8$ that is a factor of $\\sim 10 \\%$ and $\\sim 20\\%$ better than that obtained from the summary statistics. Furthermore, when information about the individual luminosity of each cluster is passed to the CNN, the gain in precision exceeds $50\\%$.",
      "pdf_url": "https://arxiv.org/pdf/2601.03894.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04504",
      "title": "Weak Lensing Low Multipoles",
      "authors": [
        "Albert Bonnefous",
        "Roya Mohayaee"
      ],
      "abstract": "Albert Bonnefous, Roya Mohayaee Cosmology and Nongalactic Astrophysics (astro-ph.CO) We analyse the low--multipole components of the weak-lensing convergence field in a FLRW universe. The low--multipole convergence field, encodes the largest-angle coherent potential gradients, essential for assessment of large-angle features in data. To study this large angle signal, we perform a combined analytical, numerical and observational study. Starting from exact analytical expressions for the convergence power spectrum, we quantify how the dipole, quadrupole and octupole build up with source redshift and show that, in $\\Lambda$CDM, they saturate at an amplitude of order $10^{-4}$. We then use full-sky, horizon-scale $N$-body simulations (Quijote) to explore the dependence of this signal on the observer's environment, comparing random observers to ``Milky Way--like'' observers. In parallel, we reconstruct the convergence field due to our local Universe with the 2MASS Redshift Survey (2MRS), with proper treatment of incompleteness and galaxy bias. We find that the observed low multipoles from observation is above the $\\Lambda$CDM mean predictions, but in full agreement with Milky Way--like observers in the simulation. Finally, by converting the convergence dipole into a number-count dipole, we test whether weak lensing can contribute to the cosmic dipole anomaly, an idea motivated by its natural alignment with the CMB dipole and by the fact that lensing, unlike clustering, cannot be removed by cross-matching surveys and thus survives in all high-redshift catalogues. We show that weak lensing by local structure contributes at most a few percent to this observed anomaly.",
      "pdf_url": "https://arxiv.org/pdf/2602.04504.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25309",
      "title": "Non-explosive pre-supernova feedback in the COLIBRE model of galaxy formation",
      "authors": [
        "Alejandro Benítez-Llambay",
        "Sylvia Ploeckinger",
        "Joop Schaye",
        "Alexander J. Richings",
        "Evgenii Chaikin",
        "Matthieu Schaller",
        "James W. Trayford",
        "Carlos S. Frenk",
        "Filip Huško",
        "Camila Correa"
      ],
      "abstract": "Non-explosive pre-supernova feedback in the COLIBRE model of galaxy formation Alejandro Benítez-Llambay, Sylvia Ploeckinger, Joop Schaye, Alexander J. Richings, Evgenii Chaikin, Matthieu Schaller, James W. Trayford, Carlos S. Frenk, Filip Huško, Camila Correa Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the implementation and testing of a subgrid non-explosive pre-supernova (NEPS) feedback module for the COLIBRE model of galaxy formation. The NEPS module incorporates three key physical processes sourced by young, massive stars that act immediately following star formation: momentum injection from stellar winds and radiation pressure, and thermal energy from photoheating in HII regions. The age- and metallicity-dependent energy and momentum budgets are derived from BPASS stellar population models and are coupled self-consistently to the local gas properties. We test the model using a suite of smoothed particle hydrodynamics simulations of isolated, unstable gaseous disks at various numerical resolutions (gas particle masses in the range $10^4-10^6$ $\\rm M_{\\odot}$). We find that the NEPS module successfully regulates star formation by providing pressure support that prevents catastrophic gas collapse. This regulation improves the numerical convergence of star formation rates and disk structure. In our model, feedback from HII regions is the dominant regulatory mechanism. Furthermore, we demonstrate a crucial synergy with subsequent supernova feedback; NEPS feedback pre-processes the interstellar medium, creating a more homogeneous environment that moderates the effect of explosive feedback from supernova events. Our NEPS module thus provides a physically motivated and numerically robust framework that mitigates resolution-dependent artefacts and promotes self-regulated galaxy growth.",
      "pdf_url": "https://arxiv.org/pdf/2509.25309.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17770",
      "title": "Magnetic field spreading from stellar and galactic dynamos into the exterior",
      "authors": [
        "Axel Brandenburg",
        "Oindrila Ghosh",
        "Franco Vazza",
        "Andrii Neronov"
      ],
      "abstract": "Magnetic field spreading from stellar and galactic dynamos into the exterior Axel Brandenburg, Oindrila Ghosh, Franco Vazza, Andrii Neronov 16 pages, 10 figures, 1 table, resubmitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The exteriors of stellar and galactic dynamos are usually modeled as a current-free potential field. A more realistic description might be that of a force-free magnetic field. Here, we suggest that, in the absence of outflows, neither of those reflect the actual behavior when the magnetic field spreads diffusively into a more poorly conducting turbulent exterior outside dynamo. In particular, we explain why the usual ordering of the dipole magnetic field being the most slowly decaying one is altered, and that the quadrupole can develop a toroidal component that decays even more slowly with radial distance. This behavior is best seen for spherical dynamo volumes and becomes more complicated for oblate ones. In either case, however, those fields are confined within a magnetosphere beyond which the field drops exponentially. The magnetosphere radius expands ballistically (i.e., linearly in time $t$) during the exponential growth phase of the dynamo, but diffusively proportional to $t^{1/2}$ during the saturated phase. We demonstrate that the Faraday displacement current, which plays a role in a vacuum, can safely be neglected in all cases. The superposition of magnetic fields from galaxies in the outskirts of the voids between galaxy clusters can therefore not explain the void magnetization of the intergalactic medium, reinforcing the conventional expectation that those fields are of primordial origin. For quadrupolar configurations, the synchrotron emission from the magnetosphere is found to be constant along concentric rings. Dipolar or the quadrupolar configurations display large-scale radial trends that are potentially distinguishable with existing radio telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2512.17770.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09124",
      "title": "Continuous Gravitational Waves from Supersoft X-ray Sources: Promising Targets for deci-Hz Detectors",
      "authors": [
        "Mayusree Das",
        "Tomasz Bulik",
        "Sreeta Roy",
        "Banibrata Mukhopadhyay"
      ],
      "abstract": "Continuous Gravitational Waves from Supersoft X-ray Sources: Promising Targets for deci-Hz Detectors Mayusree Das, Tomasz Bulik, Sreeta Roy, Banibrata Mukhopadhyay 14 pages, 9 figures, 1 table, comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) Supersoft X-ray sources (SSSs) host white dwarfs (WDs) accreting at rates that sustain steady nuclear burning, driving rapid mass growth, radial contraction, and magnetic field amplification. Angular-momentum transfer from the accretion disk naturally spins up the WD, while the amplified internal magnetic field induces a non-axisymmetric deformation in presence of a misaligned rotation. Such WDs emits continuous gravitational waves (CGWs). We model the coupled evolutions of stellar mass, spin, and magnetic structure in accreting WDs in SSSs with \\texttt{MESA}, and compute the resulting quadrupolar deformation with the Einstein-Maxwell solver \\texttt{XNS}. We show that WDs in SSSs, particularly near the end ofthermal timescale mass transfer and close to the Chandrasekhar mass limit, produce CGWs predominantly in the deci-Hz band accessible to planned detectors such as DECIGO, BBO, Deci-Hz, ALIA, and LGWA, and are distinguishable from other Galactic CGW sources such as AM\\,CVn systems, detached double WDs, and isolated WDs. Well-studied SSSs such as CAL~83 and RX~J0019+2156 can be detectable, enabling targeted CGW measurements that directly probe WD's internal magnetic fields and rotation, while blind searches can reveal hundreds of obscured SSSs otherwise missed in soft X-rays and map the hidden population of accreting, rapidly rotating, magnetized WDs in nearby galaxies. A CGW detection from WDs in SSSs could also identify potential pre-explosion Type~Ia progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2602.09124.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.09175",
      "title": "A Comparative Study of the Supernova Remnant Cassiopeia A from 2013--2020 Deep [Fe II]+[Si I] Images",
      "authors": [
        "Seung-Hoon Jung",
        "Bon-Chul Koo",
        "Yong-Hyun Lee",
        "Hyun-Jeong Kim",
        "Jae-Joon Lee"
      ],
      "abstract": "A Comparative Study of the Supernova Remnant Cassiopeia A from 2013--2020 Deep [Fe II]+[Si I] Images Seung-Hoon Jung, Bon-Chul Koo, Yong-Hyun Lee, Hyun-Jeong Kim, Jae-Joon Lee 41 pages, 12 figures, accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present a comparative analysis of supernova remnant Cassiopeia A based on two deep, narrow-band images covering the [Fe II] 1.644um + [Si I] 1.645um lines obtained in 2013 and 2020 with the same instruments on the UKIRT 3.8m telescope. The identical setup and observing procedure allow for direct, accurate measurements of morphological and kinematic changes over a seven-year baseline. We identified 263 compact knots in the 2020 image and, through comparison with the 2013 catalog of Koo et al. 2018 (arXiv:1809.07935), classified them into quasi-stationary circumstellar knots and fast-moving knots (FMKs) of supernova ejecta. The FMKs show significant flux fluctuations, and many of those detected in 2013 are absent in the 2020 image. Proper-motion measurements derived from cross-correlation analysis indicate that most FMKs follow nearly ballistic expansion, whereas some, particularly those just beyond the eastern Fe-rich, X-ray emitting ejecta region, exhibit noticeable deceleration. The proper motions of the main ejecta shell were also measured and modeled as a uniformly expanding shell with a systemic motion, which reproduces the observed geometric and kinematic asymmetries of the remnant.",
      "pdf_url": "https://arxiv.org/pdf/2602.09175.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09232",
      "title": "Transient Relativistic Iron Emission Line from an X-ray Flaring Supermassive Black Hole",
      "authors": [
        "Xiurui Zhao",
        "Marco Ajello",
        "Francesca Civano",
        "Javier A. Garcıa",
        "Elias Kammoun",
        "Stefano Marchesi",
        "Yue Shen",
        "Daniel Stern",
        "Qian Yang",
        "Peter G. Boorman",
        "Fiona Harrison",
        "Erin Kara",
        "Andrealuna Pizzetti",
        "Ross Silver",
        "Kirill V. Sokolovsky",
        "Zachary Stone",
        "Nuria Torres-Alba",
        "Qiaoya Wu",
        "Peixin Zhu"
      ],
      "abstract": "Transient Relativistic Iron Emission Line from an X-ray Flaring Supermassive Black Hole Xiurui Zhao, Marco Ajello, Francesca Civano, Javier A. Garcıa, Elias Kammoun, Stefano Marchesi, Yue Shen, Daniel Stern, Qian Yang, Peter G. Boorman, Fiona Harrison, Erin Kara, Andrealuna Pizzetti, Ross Silver, Kirill V. Sokolovsky, Zachary Stone, Nuria Torres-Alba, Qiaoya Wu, Peixin Zhu 13 pages, 3 figures, Accepted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We report the discovery of the first transient relativistic iron K{\\alpha} line in an Active Galactic Nucleus (AGN) J1047+5907. The line was detected 21.5 days (rest-frame) after an X-ray coronal flare observed in 2008 and it exhibits significant broadening consistent with relativistic reflection from the accretion disk in the vicinity of the central supermassive black hole (SMBH). The line has a width of ~300 eV, corresponding to a Keplerian velocity of 14,000 km s-1, at a distance of 5-41 light-days from the SMBH, strongly implying that the observed coronal flare triggered the emergence of the line. This event provides rare direct evidence of the response of the accretion disk to impulsive coronal illumination and offers a new method to probe the SMBH and disk physics. The relativistic modeling favors a broadened line produced by distant reflection from an accretion disk around a rapidly spinning black hole viewed at an intermediate inclination, consistent with other observations. Systematic monitoring of type 1 AGN following strong X-ray flares may open a new observational window into the innermost regions of AGN, enabling constraints on the physics of SMBH and its accretion disk at different radii that are otherwise challenging to access.",
      "pdf_url": "https://arxiv.org/pdf/2602.09232.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09400",
      "title": "Mass-Radius Constraints for 2S 0918-549 from an RXTE Superexpansion Burst: A Direct Cooling-Tail Analysis",
      "authors": [
        "Hongbin Fan",
        "Helei Liu",
        "Zhaosheng Li",
        "Yupeng Chen",
        "Shoutao Ban",
        "Guoliang Lü",
        "Akira Dohi",
        "Chunhua Zhu",
        "Renxin Xu"
      ],
      "abstract": "Mass-Radius Constraints for 2S 0918-549 from an RXTE Superexpansion Burst: A Direct Cooling-Tail Analysis Hongbin Fan, Helei Liu, Zhaosheng Li, Yupeng Chen, Shoutao Ban, Guoliang Lü, Akira Dohi, Chunhua Zhu, Renxin Xu 12 pages, 5 figures, 2 tables, published in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Thermonuclear (Type I ) X-ray bursts from accreting neutron stars offer a means to determine neutron-star (NS) mass ($M$) and radius ($R$) and thereby probe the properties of matter at supranuclear density. A subset of these events, photospheric radius-expansion (PRE) bursts, provide a particularly powerful tool to constrain the neutron-star $M$ and $R$. Here, we apply the direct cooling-tail method to 2S~0918$-$549, using a rare superexpansion burst observed by \\emph{RXTE}. We fit only the post-touchdown data within \\(F/F_{\\rm td}\\in[0.6,0.95]\\), employing modern atmosphere models (pure He and metal-enriched). The pure-He atmosphere yields a good description of the cooling tail (\\(\\chi^{2}/\\nu=18.12/14\\)), whereas metal-rich models fail; information-criterion tests (AIC/BIC) disfavor adding a free absorption edge in every time bin, indicating that heavy-element ashes are unnecessary. The joint fit gives a distance \\(d=4.1-5.3\\) kpc and mass-radius constraints \\(M=1-2\\,M_\\odot\\) and \\(R=9.7-11.9\\) km (99\\% confidence). These results suggest that representative families of both gravity-bound and self-bound equations of state remain viable at the $1\\sigma$ confidence level.",
      "pdf_url": "https://arxiv.org/pdf/2602.09400.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09544",
      "title": "Systematic Study of the Simultaneous Events Detected by GECAM",
      "authors": [
        "Yang-Zhao Ren",
        "Feng-Rong Zhu",
        "Shao-Lin Xiong",
        "Yan-Qiu Zhang",
        "Chen-Wei Wang",
        "Jia-Cong Liu",
        "Hao-Xuan Guo",
        "Shuo Xiao",
        "Dong-Ya Guo",
        "Zheng-Hua An",
        "Ce Cai",
        "Pei-Yi Feng",
        "Min Gao",
        "Ke Gong",
        "Yue Huang",
        "Bing Li",
        "Xiao-Bo Li",
        "Xin-Qiao Li",
        "Xiao-Jing Liu",
        "Ya-Qing Liu",
        "Xiang Ma",
        "Wen-Xi Peng",
        "Rui Qiao",
        "Li-Ming Song",
        "Xi-Lei Sun",
        "Wen-Jun Tan",
        "Jin Wang",
        "Jin-Zhou Wang",
        "Ping Wang",
        "Yue Wang",
        "Xiang-Yang Wen",
        "Sheng-Lun Xie",
        "Wang-Chen Xue",
        "Sheng Yang",
        "Qi-Bin Yi",
        "Zheng-Hang Yu",
        "Da-Li Zhang",
        "Fan Zhang",
        "Hong-Mei Zhang",
        "Jin-Peng Zhang",
        "Peng Zhang",
        "Shuang-Nan Zhang",
        "Wen-Long Zhang",
        "Zhen Zhang",
        "Xiao-Yun Zhao",
        "Yi Zhao",
        "Chao Zheng",
        "Shi-Jie Zheng"
      ],
      "abstract": "Systematic Study of the Simultaneous Events Detected by GECAM Yang-Zhao Ren, Feng-Rong Zhu, Shao-Lin Xiong, Yan-Qiu Zhang, Chen-Wei Wang, Jia-Cong Liu, Hao-Xuan Guo, Shuo Xiao, Dong-Ya Guo, Zheng-Hua An, Ce Cai, Pei-Yi Feng, Min Gao, Ke Gong, Yue Huang, Bing Li, Xiao-Bo Li, Xin-Qiao Li, Xiao-Jing Liu, Ya-Qing Liu, Xiang Ma, Wen-Xi Peng, Rui Qiao, Li-Ming Song, Xi-Lei Sun, Wen-Jun Tan, Jin Wang, Jin-Zhou Wang, Ping Wang, Yue Wang, Xiang-Yang Wen, Sheng-Lun Xie, Wang-Chen Xue, Sheng Yang, Qi-Bin Yi, Zheng-Hang Yu, Da-Li Zhang, Fan Zhang, Hong-Mei Zhang, Jin-Peng Zhang, Peng Zhang, Shuang-Nan Zhang, Wen-Long Zhang, Zhen Zhang, Xiao-Yun Zhao, Yi Zhao, Chao Zheng, Shi-Jie Zheng High Energy Astrophysical Phenomena (astro-ph.HE) GECAM is a constellation of all-sky monitors in hard X-ray and gamma-ray band primarily aimed at high energy transients such as gamma-ray bursts, soft gamma-ray repeaters, solar flares and terrestrial gamma-ray flashes. As GECAM has the highest temporal resolution (0.1~$\\mu$s) among instruments of its kind, it can identify the so-called simultaneous events (STE) that deposit signals in multiple detectors nearly at the same time (with a 0.3~$\\mu$s window). However, the properties and origin of STE have not yet been explored. In this work, we implemented, for the first time, a comprehensive analysis of the STE detected by GECAM, including their morphology, energy deposition, and the dependence on the geomagnetic coordinates. We find that these STE probably result from direct interactions between high-energy charged cosmic rays and satellite. These results demonstrate that GECAM can detect, identify, and characterize high-energy cosmic rays, making it a Micro Cosmic-Ray Observatory (MICRO) in low Earth orbit.",
      "pdf_url": "https://arxiv.org/pdf/2602.09544.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09582",
      "title": "X-ray Timing and Spectral studies of bare AGN Mrk 110",
      "authors": [
        "Deblina Lahiri",
        "K. Sriram",
        "Vivek Kumar Agrawal"
      ],
      "abstract": "X-ray Timing and Spectral studies of bare AGN Mrk 110 Deblina Lahiri, K. Sriram, Vivek Kumar Agrawal 16 pages, 8 figures, 2 tables, PASJ (under Review), received minor comments PASJ (under Review), received minor comments, 2026 High Energy Astrophysical Phenomena (astro-ph.HE) The origin of the soft X-ray excess below 2 keV in active galactic nuclei (AGNs) remains debated, with relativistic reflection from the inner accretion disk and warm Comptonization in an optically thick corona being the leading explanations. We investigate the timing and spectral properties of the Seyfert galaxy Mrk 110 using six XMM-Newton observations. A frequency-dependent lag analysis in the 7-9 $\\times 10^{-5}$ Hz range reveals a soft X-ray lag of 889-3000s in the combined 2019 data, detected with a significance of 80%. The cross-correlation function analysis, supported by simulations, also detects lags of similar nature. Spectral modeling performed by adopting both proposed black hole masses in the literature for Mrk 110 confirms the presence of a warm corona in all observations, along with a weak relativistic reflection component and the reflection fraction remains low (Rf < 1). Interpreting the measured soft lag in terms of light travel time implies an emission radius 4.5 Rg for a supermassive black hole mass of $M = 1.4 \\times 10^8$ solar mass , favoring a reflection scenario. However, if a lower mass of $M = 2 \\times 10^7$ solar mass is adopted, the inferred radius increases, and both relativistic reflection and warm Comptonization can plausibly contribute to the observed soft lag. The warm corona radius appears larger in the high accretion state and smaller in a lower accretion state, although no trend can be established. The persistently low reflection fraction suggests an outflowing inner corona in Mrk 110, consistent with the recent detection of jet activity in this source.",
      "pdf_url": "https://arxiv.org/pdf/2602.09582.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09886",
      "title": "In-flight calibration of the INTEGRAL/IBIS Compton mode: Application to the Crab Nebula polarization",
      "authors": [
        "Tristan Bouchet",
        "Philippe Laurent",
        "Floriane Cangemi",
        "Jérôme Rodriguez"
      ],
      "abstract": "In-flight calibration of the INTEGRAL/IBIS Compton mode: Application to the Crab Nebula polarization Tristan Bouchet, Philippe Laurent, Floriane Cangemi, Jérôme Rodriguez 15 pages, 19 figures. Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE) The INTEGRAL satellite explored the gamma-ray sky since its launch on October 17, 2002, and until the end of its scientific operation on February 28, 2025. A large fraction of the available data is still largely untouched, due to the complexity of analysis. We describe the latest in-flight calibration of the Compton mode of the INTEGRAL/IBIS telescope, taking into account more than twenty years of data. The spectroscopy and polarization of the standard candle that is the Crab Nebula is analyzed in detail. We operate the IBIS telescope as a Coded mask Compton telescope, using the Crab Nebula to refine the calibration, as is usually done for high-energy instruments. We have determined the spectroscopic and polarimetric properties of the IBIS Compton mode and their evolution along the entire duration of the mission. In addition, the long-term evolution of the Crab Nebula's polarization has been successfully measured and compared with other high-energy experiments. We could estimate the energy dependence of the Crab Nebula polarization in four bands between 200 keV and 1 MeV. In particular, the detection of polarized emissions strictly above 400 keV makes it the highest energy measurement ever performed for the Crab Nebula. A Python library was also made publicly available to analyze processed data.",
      "pdf_url": "https://arxiv.org/pdf/2602.09886.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09993",
      "title": "The supernova remnant J0450.4-7050 possesses a jets-shaped point-symmetric morphology",
      "authors": [
        "Noam Soker"
      ],
      "abstract": "The supernova remnant J0450.4-7050 possesses a jets-shaped point-symmetric morphology Noam Soker (Technion, Israel) It will be submitted in two days to allow for comments (including missing references) High Energy Astrophysical Phenomena (astro-ph.HE) By examining recently published images in different wavelengths, I identify a point-symmetric morphology in the Large Magellanic Cloud core-collapse supernova (CCSN) remnant (CCSNR) J0450.4-7050 (SNR 0450-70.9; nicknamed Veliki), which I attribute to at least three pairs of energetic jets that participated in the explosion of the progenitor in the framework of the jittering jets explosion mechanism (JJEM). Two pairs of ears, a pair of blowouts in the north and south along the long axis of this SNR, and a pair of dents compose the point symmetric morphology. The fact that the symmetry axes of two pairs include pairs of opposite structural features in the inner ejecta implies that the shaping is by jets and not due to an interaction with an ambient material. While the JJEM predicts such morphologies, the competing neutrino-driven mechanism cannot account for point-symmetric morphologies. This study provides strong support for the claim that the JJEM is the primary CCSN explosion mechanism.",
      "pdf_url": "https://arxiv.org/pdf/2602.09993.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09171",
      "title": "Unraveling the mysteries of Jets in peculiar NLSy1 galaxies through multi-wavelength variability",
      "authors": [
        "Vineet Ojha",
        "Xue-Bing Wu",
        "Luis C. Ho",
        "Raj Prince",
        "Joysankar Majumdar",
        "Hum Chand",
        "Chi-Zhuo Wang"
      ],
      "abstract": "Unraveling the mysteries of Jets in peculiar NLSy1 galaxies through multi-wavelength variability Vineet Ojha, Xue-Bing Wu, Luis C. Ho, Raj Prince, Joysankar Majumdar, Hum Chand, Chi-Zhuo Wang Submitted to the A&A Journal. 10 figures and 5 tables in the main text and 3 figures in the appendix. Comments and suggestions are most welcome. A reduced abstract is presented here due to the arXiv limit Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Radio-quiet narrow-line Seyfert 1 galaxies (RQ-NLSy1s) are generally considered to be dominated by thermal emission from the accretion disk. However, recurring 37 GHz radio flares detected from seven RQ-NLSy1s by the Metsahovi Radio Observatory suggest that non-thermal processes may also contribute to their emission. We present a systematic optical and mid-infrared (MIR) variability study combined with broadband SED modeling to investigate the origin of their flux variations and assess the relative contributions of accretion disk and possible jet-related components. High-cadence optical light curves in the g, r, and i bands were obtained from ZTF, while long-term MIR light curves in the W1 and W2 bands were taken from WISE. Optical variability was quantified using the FAGN-test, peak-to-peak variability amplitude, and fractional variability, while MIR variability was characterized using redshift-corrected intrinsic variability amplitudes. Optical variability was examined from intra-night to long-term timescales, and MIR variability on long-term timescales. All RQ-NLSy1s show statistically significant long-term optical variability, with amplitudes increasing toward shorter wavelengths. Three sources exhibit bluer-when-brighter trends and increasing variability amplitudes across the optical bands, indicating a non-thermal contribution. Intrinsic MIR variability is detected in three of the four sources. Significant optical-MIR and MIR intra-band lags are observed, while optical intra-band lags are insignificant. Optical variability amplitudes are anti-correlated with the Eddington ratio and positively correlated with black hole mass. These results suggest that a subset of RQ-NLSy1s hosts weak or intermittent jets contributing to their optical and MIR emission, supported by SED modeling. Coordinated multi-wavelength monitoring is required to better constrain the origin of these variations.",
      "pdf_url": "https://arxiv.org/pdf/2602.09171.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09377",
      "title": "Orbital Period Changes of Recurrent Nova T Pyxidis Demonstrate that M_ejecta >> 11.3xM_accreted and Is Not a Type Ia Supernova Progenitor",
      "authors": [
        "Bradley E. Schaefer"
      ],
      "abstract": "Orbital Period Changes of Recurrent Nova T Pyxidis Demonstrate that M_ejecta >> 11.3xM_accreted and Is Not a Type Ia Supernova Progenitor Bradley E. Schaefer (Louisiana State University) 7th in a series of ApJ papers, each proving that popular progenitor candidates cannot become Type Ia supernovae: 1. V445 Pup (arXiv:2412.17286), 2. T CrB (arXiv:2510.01587), 3. U Sco (arXiv:2510.01589), 4. FQ Cir (arXiv:2511.16594), 5. all symbiotic stars (arXiv:2511.19948), 6. V1405 Cas (ApJ submitted), 7. T Pyx (ApJ in press) Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Recurrent nova (RN) T Pyxidis (T Pyx) has a complex history of mass accreting-onto and ejection-from the white dwarf, with a classical nova eruption around 1866 kick-starting a RN-phase with six RN eruptions from 1890--2011. T Pyx is a primary progenitor candidate for Type Ia supernovae (SNIa). This is chiefly a question of whether the mass accreted by the white dwarf ($M_{\\rm accreted}$) is more-or-less than the mass ejected by the nova eruptions ($M_{\\rm ejecta}$) over the entire eruption cycle. Prior attempts to measure $M_{\\rm ejecta}$ from the traditional methods have a scatter of $>$130$\\times$, so only a new technique can provide a measure of adequate accuracy and reliability. This new technique is the timing experiment of measuring the orbital period from 1986 to 2025, where the period increased by $+$50.3$\\pm$7.9 parts-per-million across the 2011 eruption. With simple and sure physics, the best estimate for the mass ejected by one RN event is $>$2400$\\times$10$^{-7}$ M$_{\\odot}$, with an extreme inviolate limit of $\\gg$354$\\times$10$^{-7}$ M$_{\\odot}$. Over all eruptions in a cycle, $M_{ejecta}$$>$17120$\\times$10$^{-7}$ M$_{\\odot}$, with an inviolate limit of $M_{ejecta}$$\\gg$2144$\\times$10$^{-7}$ M$_{\\odot}$. Over the full eruption cycle, the white dwarf accreted 220$\\times$10$^{-7}$ M$_{\\odot}$. So M$_{\\rm ejecta}$$\\gg$11.3$\\times$M$_{\\rm accreted}$, and T Pyx can never become a SNIa. This paper is the seventh in a series proving that each of various popular candidate SNIa progenitors cannot possibly evolve to a supernova; including V445 Pup, U Sco, T CrB, all symbiotic stars, FQ Cir, V1405 Cas, and now T Pyx.",
      "pdf_url": "https://arxiv.org/pdf/2602.09377.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09694",
      "title": "Stellar-mass black holes in young massive and open stellar clusters -- VII. Comparisons with gravitational-wave events until LVK-O4a and Gaia compact binaries",
      "authors": [
        "Sambaran Banerjee"
      ],
      "abstract": "Stellar-mass black holes in young massive and open stellar clusters -- VII. Comparisons with gravitational-wave events until LVK-O4a and Gaia compact binaries Sambaran Banerjee 34 pages, 20 figures, including Appendix content. Submitted. Comments are welcome Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Gravitational-wave (GW) detections by the LIGO-Virgo-KAGRA (LVK) observatories suggest multiple formation channels for GW compact binary mergers. Here I assess the role of young massive clusters (YMC) evolving into old open clusters (OC) -- the YMC/OC channel -- to the GW merger population. A homogeneous grid of 90 N-body evolutionary model star clusters, spanning initial masses of $10^4M_\\odot\\leq M_{cl}(0)\\leq10^5M_\\odot$, half-mass radii of 1-3 pc, and metallicities between 0.0002-0.02 is computed with the direct, post-Newtonian N-body code NBODY7. The N-body simulations include primordial binaries, delayed stellar-remnant model forming black holes (BH) and neutron stars (NS), BH spin prescriptions, and GW recoil kicks, and they are evolved until BH depletion. Most GW mergers from the cluster models are dynamically assembled binary black holes (BBH) that merge within their host clusters. Merger mass ratios reach down to 0.1-0.2 despite an overall bias toward nearly symmetric pairs. The GW merger efficiency varies non-monotonically with cluster mass, peaking around $M_{cl}(0)=7.5\\times10^4M_\\odot$ and also for $M_{cl}(0)\\leq3.0\\times10^4M_\\odot$. The computed mergers reproduce some of the key features of the latest observed GW event catalogue, including asymmetric low-mass mergers, misaligned events among highly spinning, massive BHs, and an excess of $30M_\\odot$ primaries, though they under-produce $10M_\\odot$ primaries, hinting at contributions from other channels. The model merger rate density accounts for 25%-33% of the observed rate; it increases with redshift somewhat faster than the cosmic star formation, consistently with LVK's inferences. The model effective spin distribution is positively asymmetric at zero redshift and broadens with redshift. The models yield field BH- and NS-main sequence star binaries with parameters consistent with the Gaia-discovered candidates. [Abgd.]",
      "pdf_url": "https://arxiv.org/pdf/2602.09694.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.10084",
      "title": "Narrow absorption lines from intervening material in supernovae. IV. Type Ia supernovae: Na I D line strength relating to external material and intrinsic properties",
      "authors": [
        "Santiago González-Gaitán",
        "Claudia P. Gutiérrez",
        "João Duarte",
        "Rita Santos",
        "Gonçalo Martins",
        "Joseph P. Anderson",
        "Lluís Galbany"
      ],
      "abstract": "Narrow absorption lines from intervening material in supernovae. IV. Type Ia supernovae: Na I D line strength relating to external material and intrinsic properties Santiago González-Gaitán, Claudia P. Gutiérrez, João Duarte, Rita Santos, Gonçalo Martins, Joseph P. Anderson, Lluís Galbany Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Type Ia supernovae (SNe Ia) are thermonuclear runaways in certain white dwarfs in binary systems. They have been extensively studied, yet their progenitor and explosion mechanisms remain poorly understood. We study a large sample of SNe Ia comparing the narrow interstellar absorption features in their spectra with various photometric and spectroscopic supernova properties, as well as with environmental characteristics. We find that the sodium absorption is significantly stronger in younger, more star-forming and more centrally located SNe Ia, as expected. However, we also show that there is a strong dependence on intrinsic properties that is independent of the environment. In fact, we find strong evidence for two environmental SN Ia populations, an old and a young one, with the young population showing significantly different distributions of sodium strength when divided according to the Si II ejecta velocity, nebular velocity, extinction, E(B-V), and reddening curve, RV. Performing a clustering of the SNe Ia, we recover an old population of SNe with low extinction and normal ejecta velocity, while we confirm that the young population can be subdivided into a group of highly-extincted, high-velocity SNe Ia with much stronger blueshifted sodium absorption, and another of low-extincted, normal-velocity objects with little sodium absorption. We interpret this relation of intervening material with intrinsic properties as evidence for the young SN Ia population, occurring in young and star-forming environments, to have asymmetric radiation that interacts with nearby material, and whose observables depend thus on the viewing angle. Finally, we show that the cosmological mass-step is consistent with these populations.",
      "pdf_url": "https://arxiv.org/pdf/2602.10084.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.12729",
      "title": "The Multi-Wavelength Context of Delayed Radio Emission in TDEs: Evidence for Accretion-Driven Outflows",
      "authors": [
        "Kate D. Alexander",
        "Raffaella Margutti",
        "Sebastian Gomez",
        "Michael Stroh",
        "Ryan Chornock",
        "Tanmoy Laskar",
        "Y. Cendes",
        "Edo Berger",
        "Tarraneh Eftekhari",
        "Noah Franz",
        "Aprajita Hajela",
        "B. D. Metzger",
        "Giacomo Terreran",
        "Michael Bietenholz",
        "Collin Christy",
        "Fabio de Colle",
        "S. Komossa",
        "Matt Nicholl",
        "Enrico Ramirez-Ruiz",
        "Richard Saxton",
        "Genevieve Schroeder",
        "Peter K. G. Williams",
        "William Wu"
      ],
      "abstract": "The Multi-Wavelength Context of Delayed Radio Emission in TDEs: Evidence for Accretion-Driven Outflows Kate D. Alexander, Raffaella Margutti, Sebastian Gomez, Michael Stroh, Ryan Chornock, Tanmoy Laskar, Y. Cendes, Edo Berger, Tarraneh Eftekhari, Noah Franz, Aprajita Hajela, B. D. Metzger, Giacomo Terreran, Michael Bietenholz, Collin Christy, Fabio de Colle, S. Komossa, Matt Nicholl, Enrico Ramirez-Ruiz, Richard Saxton, Genevieve Schroeder, Peter K. G. Williams, William Wu 35 pages, 5 figures, 8 tables. Accepted to ApJ; text updated to match accepted version. All data used in this analysis will be made publicly available at this https URL upon article publication High Energy Astrophysical Phenomena (astro-ph.HE) Recent observations presented in Cendes et al. (2024a) show that optically selected tidal disruption events (TDEs) commonly produce delayed radio emission that can peak years post-disruption. Here, we explore the multi-wavelength properties of a sample of radio-observed optically selected TDEs to shed light on the physical process(es) responsible for the late-rising radio emission. We combine new late-time X-ray observations with archival optical, UV, X-ray, and radio data to conclude that a diversity of accretion-driven outflows may power delayed radio emission in TDEs. Our analysis suggests that some late radio outflows may be launched by a delayed phase of super-Eddington accretion onto the central supermassive black hole (SMBH), while others may result from a state transition to a ``low-hard'' radiatively inefficient accretion flow or the deceleration of an off-axis relativistic jet. We find that TDEs with delayed radio emission are less likely to exhibit helium emission lines at early times ($p=0.002$) and may have larger optical/UV photospheric radii ($p=0.026$) than other TDEs, possibly also indicating that the onset of SMBH accretion is delayed in these systems. Our results have implications for our understanding of state changes in SMBH accretion flows, the circularization timescale for TDE debris, and the prevalence of off-axis jets in TDEs, and motivate systematic, long-term monitoring of these unique transients. The objects in our sample with the brightest radio emission are also detected in the VLA Sky Survey (VLASS), demonstrating that all-sky radio surveys can play an important role in discovering unexpected properties of the TDE population.",
      "pdf_url": "https://arxiv.org/pdf/2506.12729.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.15954",
      "title": "2D or not 2D? Exploring 3D relativistic magnetic reconnection dynamics with highly accurate numerical simulations",
      "authors": [
        "Vittoria Berta",
        "Matteo Bugli",
        "Andrea Mignone",
        "Giancarlo Mattia",
        "Luca Del Zanna",
        "Stefano Truzzi"
      ],
      "abstract": "2D or not 2D? Exploring 3D relativistic magnetic reconnection dynamics with highly accurate numerical simulations Vittoria Berta, Matteo Bugli, Andrea Mignone, Giancarlo Mattia, Luca Del Zanna, Stefano Truzzi Accepted for publication on MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Fast reconnection in magnetically dominated plasmas is widely invoked in models of dissipation in pulsar winds, gamma-ray flares in the Crab nebula, and to explain the radio nanoshots of pulsars. When current sheets evolve reaching a critical inverse aspect ratio, scaling as $S^{-1/3}$ with the plasma Lundquist number, the so-called \\textit{ideal} tearing instability sets in, with modes growing, independently of $S$, extremely rapidly on timescales of only a few light-crossing times of the sheet length. We present the first set of fully 3D simulations of current-sheet disruption triggered by the ideal tearing instability within the resistive relativistic MHD approximation, as appropriate in situations where the Alfvén velocity approaches the speed of light. We compare 3D setups with different initial conditions with their 2D counterparts, and we assess the impact of dimensionality and of the magnetic field topology on the onset, evolution, and efficiency of reconnection. In force-free configurations, 3D runs develop ideal tearing, secondary instabilities, and a thick, turbulent current layer, sustaining dissipation of magnetic energy longer than in 2D. In pressure-balanced current sheets with a null guide field, 2D reference runs show the familiar reconnection dynamics, whereas in 3D tearing dynamics is quenched after the linear phase, as pressure-driven modes growing on forming plasmoids outcompete plasmoid coalescence and suppress fast dissipation of magnetic energy. Taken together, these results suggest that the evolution and efficiency of reconnection depend sensitively on the local plasma conditions and current-sheet configuration, and can be properly captured only in fully 3D simulations.",
      "pdf_url": "https://arxiv.org/pdf/2512.15954.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10393",
      "title": "Long Period Transients (LPTs): a comprehensive review",
      "authors": [
        "Nanda Rea",
        "Natasha Hurley-Walker",
        "Manisha Caleb"
      ],
      "abstract": "Long Period Transients (LPTs): a comprehensive review Nanda Rea (ICE-CSIC, IEEC, Spain), Natasha Hurley-Walker (ICRAR, Curtin U., Australia), Manisha Caleb (University of Sydney, Australia) 23 pages, 12 figures, 3 tables. Accepted for publication in the Elsevier Journal of High Energy Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Long Period Transients (LPTs) are a recently identified class of sources characterized by periodic radio bursts lasting seconds to minutes, with flux densities that might reach several tens of Jy. These radio bursts repeat with periodicity from minutes to hours, and they exhibit strong polarization and transient activity periods. To date, about 12 such sources have been identified, which might encompass the same or different physical scenarios. Proposed explanations include binary systems with a white dwarf and a low-mass star companion, slow-spinning magnetars, highly magnetized isolated white dwarfs, and other exotic objects. In a few cases the optical counterpart indeed points toward a white dwarf with a low-mass companion, while in other cases, transient X-ray emission was detected, very common in magnetars. However, despite being able to reproduce partially some of the characteristics of LPTs, all the proposed scenarios find difficulty in explaining the exact physical origin of their bright, highly polarized and periodic radio emission. We review here the state-of-the-art in the observations and interpretation of this puzzling class of radio transients.",
      "pdf_url": "https://arxiv.org/pdf/2601.10393.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.01983",
      "title": "The temperature and metallicity distributions of the ICM: insights with TNG-Cluster for XRISM-like observations",
      "authors": [
        "Dimitris Chatzigiannakis",
        "Annalisa Pillepich",
        "Aurora Simionescu",
        "Nhut Truong",
        "Dylan Nelson"
      ],
      "abstract": "The temperature and metallicity distributions of the ICM: insights with TNG-Cluster for XRISM-like observations Dimitris Chatzigiannakis, Annalisa Pillepich, Aurora Simionescu, Nhut Truong, Dylan Nelson Updated version after review process. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The new era of high-resolution X-ray spectroscopy will significantly improve our understanding of the intra-cluster medium (ICM) by providing precise constraints on its underlying physical properties. However, spectral fitting requires reasonable assumptions on the thermal and chemical distributions of the gas. We use the output of TNG-Cluster, the newest addition to the IllustrisTNG suite of cosmological magnetohydrodynamical simulations, to provide theoretical expectations for the multi-phase nature of the ICM across hundreds of z=$ clusters (M$_{500c} = 10^{14.0-15.3}~M_\\odot$) based upon a realistic model for galaxy formation and evolution. We create and analyse, in an observer-like manner, end-to-end XRISM/Resolve mock observations towards cluster centres. We then systematically compare the intrinsic temperature and Fe abundance of the simulated gas with the inferred ones from spectral fitting via a variety of commonly used spectral-emission models. Our analysis suggests that models with a distribution of temperatures, better describe the broad thermal distributions of the ICM, as predicted by TNG-Cluster, but still incur biases in the inferred temperature of 0.5-2 keV (16th-84th percentiles). However, all spectral-emission models systematically underestimate the Fe abundance of the central ICM by 0.12 Solar (22 per cent), almost an order of magnitude higher than the abundance errors reported in the literature, primarily due to projection effects. Selecting only strong cool core clusters leads to minor improvements on inference quality, removing the majority of outliers but maintaining similar overall biases and cluster-to-cluster scatter.",
      "pdf_url": "https://arxiv.org/pdf/2503.01983.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09085",
      "title": "Multi-wavelength morphology and dust emission in low-redshift dwarf galaxies in COSMOS-Web with HST and JWST",
      "authors": [
        "D. Kakkad",
        "I. Lazar",
        "S. Harish",
        "B. Bichang'a",
        "R. K. Cochrane",
        "S. Kaviraj",
        "A. E. Watkins",
        "G. Martin",
        "S. Koudmani",
        "Andrew J. Battisti",
        "Caitlin Casey",
        "Maximilien Franco",
        "G. Gozaliasl",
        "M. Hirschmann",
        "Jeyhan Kartaltepe",
        "A. A. Khostovan",
        "Anton Koekemoer",
        "Daizhong Liu",
        "Henry Joy McCracken",
        "Jason Rhodes",
        "Brant Robertson"
      ],
      "abstract": "Multi-wavelength morphology and dust emission in low-redshift dwarf galaxies in COSMOS-Web with HST and JWST D. Kakkad, I. Lazar, S. Harish, B. Bichang'a, R. K. Cochrane, S. Kaviraj, A. E. Watkins, G. Martin, S. Koudmani, Andrew J. Battisti, Caitlin Casey, Maximilien Franco, G. Gozaliasl, M. Hirschmann, Jeyhan Kartaltepe, A. A. Khostovan, Anton Koekemoer, Daizhong Liu, Henry Joy McCracken, Jason Rhodes, Brant Robertson Accepted for publication in MNRAS; 13 pages, 9 figures, 2 tables Astrophysics of Galaxies (astro-ph.GA) Low-mass or dwarf galaxies (M$_{\\ast}<10^{9}$ M${\\odot}$) are abundant in the Universe, yet their formation and evolution remain poorly understood. Their enhanced sensitivity to feedback from star formation and active galactic nuclei (AGN) make them excellent laboratories to test whether feedback prescriptions in cosmological simulations accurately reproduce their interstellar medium (ISM) properties. We present JWST/NIRCam and MIRI imaging of nine dwarf galaxies from COSMOS-Web survey at redshift $z<0.08$, with star formation rates ranging from 0.003-0.3 M${\\odot}$ yr$^{-1}$ and stellar masses of log M$_{\\ast}\\sim8-9$ M$_{\\odot}$. The detection rate with both NIRCam and MIRI is 100\\%, indicating that these dwarfs possess substantial ISM content. The detected sample includes a roughly equal mix of early-type and late-type dwarfs, suggesting that it is representative of the broader dwarf galaxy population in low-density environments. We find that the observed MIRI flux distributions are comparable to forward-modelled flux distributions of mass-matched simulated galaxies in TNG50. We further conduct a multi-wavelength morphological analysis complementing the JWST NIRCam and MIRI imaging with archival HST/ACS data, employing the CAS (concentration, asymmetry, smoothness) framework. Among the multi-wavelength images, MIRI exhibits the largest variation in CAS parameters, likely due to dust lanes and clumps in several galaxies, also suggested by Spectral Energy Distribution (SED) fitting. This suggests that the dust content in these systems may be higher than those implied by rest-frame optical or near-infrared observations alone. Upcoming UV/optical and mid-infrared spectroscopic follow-up will be critical for constraining the gas kinematics and dust grain properties of dwarf galaxies in low-density environments such as COSMOS.",
      "pdf_url": "https://arxiv.org/pdf/2602.09085.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09094",
      "title": "Downsizing does not extend to dwarf galaxies: identifying the stellar mass regimes shaped by supernova and AGN feedback",
      "authors": [
        "Ilin Lazar",
        "Sugata Kaviraj",
        "Garreth Martin",
        "Christopher J. Conselice",
        "Sophie Koudmani",
        "Aaron E. Watkins",
        "Sukyoung K. Yi",
        "Darshan Kakkad",
        "Thomas M. Sedgwick",
        "Yohan Dubois",
        "Julien E. G. Devriendt",
        "Katarina Kraljic",
        "Sebastien Peirani"
      ],
      "abstract": "Downsizing does not extend to dwarf galaxies: identifying the stellar mass regimes shaped by supernova and AGN feedback Ilin Lazar, Sugata Kaviraj, Garreth Martin, Christopher J. Conselice, Sophie Koudmani, Aaron E. Watkins, Sukyoung K. Yi, Darshan Kakkad, Thomas M. Sedgwick, Yohan Dubois, Julien E. G. Devriendt, Katarina Kraljic, Sebastien Peirani Accepted for publication in MNRAS, 14 pages, 7 figures Astrophysics of Galaxies (astro-ph.GA) We explore how the fraction of red (quenched) galaxies varies in the dwarf galaxy regime (10^7 MSun < Mstar < 10^9.5 MSun), using a mass-complete sample of ~5900 dwarfs at z<0.15, constructed using deep multi-wavelength data in the COSMOS field. The red fraction decreases steadily until Mstar ~ 10^8.5 MSun and then increases again towards lower stellar masses. This 'U' shape demonstrates that the traditional notion of 'downsizing' (i.e. that progressively lower mass galaxies maintain star formation until later epochs) is incorrect -- downsizing does not continue uninterrupted into the dwarf regime. The U shape persists regardless of environment, indicating that it is driven by internal processes rather than external environment-driven mechanisms. Our results suggest that, at Mstar < 10^8 MSun, the quenching of star formation is dominated by supernova (SN) feedback and becomes more effective with decreasing stellar mass, as the potential well becomes shallower. At Mstar > 10^9 MSun, the quenching is driven by a mix of SN feedback and AGN feedback (which becomes more effective with increasing stellar mass, as central black holes become more massive). The processes that quench star formation are least effective in the range 10^8 MSun < Mstar < 10^9 MSun, likely because the potential well is deep enough to weaken the impact of SN feedback, while the effect of AGN feedback is still insignificant. The cosmological simulations tested here do not match the details of how the red fraction varies as a function of stellar mass -- we propose that the red fraction vs stellar mass relation (particularly in the dwarf regime) is a powerful calibrator for the processes that regulate star formation in galaxy formation models.",
      "pdf_url": "https://arxiv.org/pdf/2602.09094.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09192",
      "title": "Probing Dust Composition in Distant Galaxies with JWST Mid-IR Spectroscopy of Quasars with Foreground 2175 A Absorbers I: Methodology",
      "authors": [
        "Viacheslav V. Klimenko",
        "Varsha P. Kulkarni",
        "Monique C. Aller"
      ],
      "abstract": "Probing Dust Composition in Distant Galaxies with JWST Mid-IR Spectroscopy of Quasars with Foreground 2175 A Absorbers I: Methodology Viacheslav V. Klimenko, Varsha P. Kulkarni, Monique C. Aller Astrophysics of Galaxies (astro-ph.GA) Interstellar dust plays a crucial role in gas cooling and molecule formation, influencing galaxy evolution. However, the composition and structure of dust in distant galaxies are still poorly understood. We have started a JWST MIRI MRS program investigating the dust features in gas-rich and dusty galaxies at redshifts $z<$1.2, with strong 2175~Å bumps detected in absorption along the lines of sight to distant background quasars. Here we describe our program strategy, and present MIRI MRS observations of IR dust features at $z=0.5-1.2$ in five quasar spectra that form the first part of our full sample. We identify artifacts in MIRI MRS data that affect the background in IFU cubes, and propose methods to reduce their effects. We pay special attention to modeling the quasar mid-IR continuum, which shows significant variation depending on AGN morphology, redshift, and black hole mass. Dust in foreground galaxies produces significant absorption from the 10~$\\mu$m silicate feature in all five quasar spectra. Compared with the average 10~$\\mu$m silicate feature in the diffuse ISM of the Milky Way, we find differences in the absorption peak position, width of the features, and asymmetry of the profiles. A detailed study of these silicate features is presented in our next paper (Klimenko et al. 2026b). In two quasar spectra, we tentatively detect weak IR features near 3.0 and 3.4~$\\mu$m. Their strengths are comparable to those seen in the Milky Way ISM, but follow-up observations are required to confirm these detections.",
      "pdf_url": "https://arxiv.org/pdf/2602.09192.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09217",
      "title": "A Gravitational Wave Background from Intermediate Mass Black Holes in AGN Disks",
      "authors": [
        "Chiara M. F. Mingarelli"
      ],
      "abstract": "A Gravitational Wave Background from Intermediate Mass Black Holes in AGN Disks Chiara M. F. Mingarelli 8 pages, 1 figure. This is Paper II. Paper 1 is Mingarelli (2026a) Astrophysics of Galaxies (astro-ph.GA) Intermediate mass black holes (IMBHs) formed in active galactic nucleus (AGN) disks are expected to inspiral into their central supermassive black holes (SMBHs), generating a stochastic gravitational-wave (GW) background in the mHz--decihertz band. Using the population-agnostic energetic formalism, we treat the AGN-disk channel as a mass-flow pipeline connecting the stellar-mass black hole population observed by LIGO/Virgo/KAGRA (LVK) to the SMBH mass reservoir via IMBHs. By anchoring this estimate to the LVK merger rate densities and the cosmic SMBH mass density derived from scaling relations, we derive a limit on the background amplitude. We show that the total energy density of the background is bounded by the global mass budget of SMBH growth. For fiducial parameters consistent with the fourth Gravitational-Wave Transient Catalog (GWTC-4), this yields a characteristic strain $A_{\\rm IMR} \\simeq (1.2_{-0.2}^{+0.2})\\times 10^{-21}$ at $3\\,{\\rm mHz}$. While this fiducial amplitude is subdominant to the Galactic white dwarf foreground and the stellar-mass Extreme Mass Ratio Inspiral (EMRI) background, we show it can be distinguished by its non-Gaussian statistics and higher frequency cutoff. This new background may be detectable in the decihertz band where proposed detectors such as the Big Bang Observer or long-baseline lunar interferometers can measure it cleanly. A detection would provide a direct, model-independent constraint on the efficiency with which AGN disks process stellar remnants into SMBH mass growth, linking the LVK and LISA bands.",
      "pdf_url": "https://arxiv.org/pdf/2602.09217.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.09251",
      "title": "ALMA [CI] Image of the Circumnuclear Disk of the Milky Way: Inflowing Low-density Molecular Gas",
      "authors": [
        "Kunihiko Tanaka",
        "Makoto Nagai",
        "Kazuhisa Kamegai"
      ],
      "abstract": "ALMA [CI] Image of the Circumnuclear Disk of the Milky Way: Inflowing Low-density Molecular Gas Kunihiko Tanaka, Makoto Nagai, Kazuhisa Kamegai 26 pages, 17 figures. Accepted for publication in the Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) We present ALMA [\\ion{C}{1}]~$^3P_1$--$^3P_0$ imaging of the central $6.6\\times4.2~\\mathrm{pc}^2$ region of the Galaxy encompassing the circumnuclear disk (CND). The data reveal low-density ($n_\\mathrm{H_2}\\sim10^3~$cm$^{-3}$) molecular gas with inward motion, widespread both inside and outside the CND. The normalized [\\ion{C}{1}] to CS~7--6 intensity difference decreases inwardly from $R=4$~pc to 1.7~pc and azimuthally along the CND's rotation, likely tracing paths of low-density gas inflow. By projecting spaxels into orbital coordinates assuming a velocity field model, we identify four kinematic features: a pair of spiral outer streamers toward the CND, inner streamers extending to 0.5~pc from Sgr~A$^*$, an outer disk at $ R\\sim3$--6~pc, and the rotating ring at $R=2$~pc. $P$--$P$--$V$ correlation between the inner streamers and H42$\\alpha$ indicates gas supply to the mini-spiral through the western arc (WA) and northern arm (NA). The total inflowing mass is $1.5\\times10^4~M_\\odot$, 1.7 times the mass of the rotating ring. The identified flows can be organized into two main pathways connecting the CND exterior and interior: ``WA flow'' feeding the mini-spiral WA via the CND, and ``NA flow'' bypassing the purely rotating orbit. The inflow rate along the former is approximately constant (0.1--0.16~$M_\\odot~\\mathrm{yr}^{-1}$), implying a CND dwelling time comparable to its orbital period and supporting the CND's transient nature. We also identify two [\\ion{C}{1}]-bright clumps (CBCs) lacking dense-gas counterparts near the contact point between the northern outer streamer and the CND. Apparently intact against tidal disruption despite subcritical densities, the CBCs may represent a chemically young phase shortly after formation in colliding flows.",
      "pdf_url": "https://arxiv.org/pdf/2602.09251.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09274",
      "title": "Are carbon deflagration supernovae triggered by dark matter ?",
      "authors": [
        "Jeremy Mould"
      ],
      "abstract": "Are carbon deflagration supernovae triggered by dark matter ? Jeremy Mould Astrophysics of Galaxies (astro-ph.GA) Collisions between stellar remnants and dark matter in the Galactic bulge are frequent, and the kinetic energy of a primordial black hole incident on a white dwarf, if it is all thermalized, will raise the degenerate core's temperature, by at least a degree in the case of a lunar mass black hole. This is an underestimate in two ways: the specific heat is less than 3k/2 per particle, and the incoming object is accelerated by gravitational focusing. Detailed physical models have recently been made of this triggering event. Present observational data are equivocal as to whether the radial distribution of type Ia supernovae in galaxies follows the starlight in the galaxies, or is more concentrated towards the center, as collisional triggering would suggest. But future samples of millions of supernovae from the Rubin telescope will change that.",
      "pdf_url": "https://arxiv.org/pdf/2602.09274.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09308",
      "title": "Selecting Post-Starburst Galaxies Based on Star Formation History",
      "authors": [
        "Sara Starecheski",
        "K. Decker French",
        "Vicente Villanueva",
        "Sebastion F. Sanchez",
        "Tony Wong",
        "Margaret E. Verrico",
        "Alex Green",
        "Akshat Tripathi",
        "Keaton Donaghue"
      ],
      "abstract": "Selecting Post-Starburst Galaxies Based on Star Formation History Sara Starecheski, K. Decker French, Vicente Villanueva, Sebastion F. Sanchez, Tony Wong, Margaret E. Verrico, Alex Green, Akshat Tripathi, Keaton Donaghue Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) Post-StarBurst (PSB) galaxies are galaxies that have undergone a large burst of star formation followed by rapid quenching. Understanding their properties as a population can help us better understand how galaxies evolve to quiescence. This project aims to use Star Formation History (SFH) measurements from the Integral Field Spectroscopy (IFS) surveys MaNGA, CALIFA, and AMUSING++ processed with the Pipe3D analysis pipeline in order to select PSB galaxies as well as PSB regions in galaxies. Most PSB selection methods use cutoffs determined by spectral features, but in this work we introduce a new PSB selection method based directly on the property we are most interested in; inferred SFHs. IFS data allows us to probe a galaxy's star formation on a spatially resolved scale, enabling us to examine the size, shape, and location of PSB regions within a galaxy. We select 107 PSB galaxies, only 7 of which are among known PSBs selected by other methods. Unlike traditional PSB selection methods, our approach is not biased against Active Galactic Nuclei (AGN). Despite this, we still find no evidence for a significant Seyfert 2 PSB population, suggesting that strong AGN activity is uncommon throughout the PSB phase. Our spatially-resolved SFH selection identifies a wide range of galaxies, including globally quiescent elliptical galaxies with centrally-concentrated PSB spaxels, galaxies with ring-like PSB spaxels and a preference for inside-out age gradients (contrary to what has previously been observed in the literature), and galaxies with widespread PSB regions that have significant star formation elsewhere in the galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2602.09308.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09404",
      "title": "A Monopolar Jet from Protostar HOPS 10: Evidence for Asymmetric Magnetized Launching",
      "authors": [
        "Somnath Dutta"
      ],
      "abstract": "A Monopolar Jet from Protostar HOPS 10: Evidence for Asymmetric Magnetized Launching Somnath Dutta Accepted for publication in the Astronomical Journal Astrophysics of Galaxies (astro-ph.GA) A fundamental challenge in star formation is understanding how a protostar accretes mass from its circumstellar disk while removing excess angular momentum. Protostellar jets are widely invoked as the primary channels for angular momentum removal, yet the mechanism by which they are launched and extract angular momentum remains poorly constrained. Here we report high-resolution ALMA Band 7 (345 GHz) and Band 6 (230 GHz) observations of CO (3-2), CO (2-1), and SiO (5-4) emission from the protostar HOPS 10 (G209.55-19.68S2). The combined data trace both the entrained outflow and the collimated jet with excellent spatial and velocity resolution, revealing a uniquely monopolar protostellar jet, the clearest example reported to date. The system exhibits a distinctly unipolar high-velocity jet with velocity offsets of +44 to +66 km s-1, unlike the predominantly bipolar morphology characteristic of most protostellar jets. While the low-velocity outflow, with velocity offsets of -20 to +30 km s-1, is detected in both directions, the high-velocity jet appears only on one side, and this monopolarity is consistent across all tracers. Given the nearly edge-on geometry and low submillimeter extinction, comparable emission would normally be expected from both lobes. The shock tracer SiO emission confirms a genuine, highly collimated jet rather than cloud contamination, and no ambient structure is capable of obscuring a counterjet. We argue that intrinsically asymmetric mass loading along the disk magnetic field lines provides the most plausible explanation for the observed monopolarity.",
      "pdf_url": "https://arxiv.org/pdf/2602.09404.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09478",
      "title": "A deep MeerKAT view of associated HI absorption in radio AGNs at intermediate redshift: Role of absorber geometry and conditions of the gas",
      "authors": [
        "Raffaella Morganti",
        "Tom Oosterloo",
        "Clive Tadhunter",
        "Suma Murthy"
      ],
      "abstract": "A deep MeerKAT view of associated HI absorption in radio AGNs at intermediate redshift: Role of absorber geometry and conditions of the gas Raffaella Morganti, Tom Oosterloo, Clive Tadhunter, Suma Murthy 14 pages, Accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) We present MeerKAT observations searching for HI absorption in a sample of 17 powerful ($L_{\\rm 1.4GHz}> 10^{27}$ W Hz$^{-1}$) radio sources at intermediate redshifts ($0.25<z<0.7$). The sample is well characterised at radio and optical wavelengths, allowing us to connect the presence (or absence) of HI to the properties of the AGN and its host galaxy. The sample consists mostly of core-dominated sources and quasars. Half of the targets have a UV luminosity $L_{\\rm UV} = 10^{23}$ W Hz$^{-1}$, above this limit, the gas would be expected to be ionised by this radiation. We obtained 15 spectra free (or almost free) of radio frequency interference, reaching extremely low optical depths ($\\tau_{\\rm peak} < 0.005$) resulting in three new HI absorption detections. Two are associated HI absorptions, giving a detection rate of such systems of $13\\%\\pm 7\\%$. Both are found in young radio sources (PKS 1151-34 and PKS 1306-09), confirming the trend that this type of sources are more often detected in HI compared to more evolved ones. The UV luminosity of both these sources is below $10^{23}$ W Hz$^{-1}$. Surprisingly, one of the detections (PKS 1151-34) is hosted by a quasar, suggesting that the radio lobes are still embedded in the circumnuclear disc. In the second source (PKS 1306-09), the HI is highly blueshifted and likely part of a jet-driven outflow. A third detection is a 'local intervening' system, caused by a galaxy in the local environment of PKS 0405-12 and located in front of the southern radio lobe of this source, about 100 kpc in projection from this quasar. Overall, the results indicate a variety of plausible situations, which resemble what is seen at low redshifts. For the associated absorption, a combination of evolutionary status of the radio sources, physical conditions, and geometry of the gas structure determine the detection rate of HI absorption.",
      "pdf_url": "https://arxiv.org/pdf/2602.09478.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09571",
      "title": "Herschel/HIFI Observations of Molecular Lines Toward G10.47+0.03",
      "authors": [
        "Indrajit Mondal",
        "Prasanta Gorai",
        "Ankan Das",
        "Suman Kumar Mondal",
        "Ruben Fedriani",
        "Xiaohu Li",
        "Parama Mahapatra",
        "Sabyaasachi Banik",
        "Sheng-Li Qin"
      ],
      "abstract": "Herschel/HIFI Observations of Molecular Lines Toward G10.47+0.03 Indrajit Mondal, Prasanta Gorai, Ankan Das, Suman Kumar Mondal, Ruben Fedriani, Xiaohu Li, Parama Mahapatra, Sabyaasachi Banik, Sheng-Li Qin 22 pages and 7 figures. Accepted for publication in the Frontiers in Astronomy and Space Sciences https://www.frontiersin.org/journals/astronomy-and-space-sciences/articles/10.3389/fspas.2026.1740003/abstract Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present a spectral line analysis of the hot molecular core G10.47+0.03 (hereafter, G10). Our aim is to determine molecular abundances and excitation conditions across a wide spectral range inaccessible to ground-based observatories. We utilize archival data from the Herschel Space Observatory, obtained with the Heterodyne Instrument for the Far-Infrared (HIFI). We report here the detection of high-excitation CO, 13CO, and C18O, H2O isotopologues, HCO+, HCN, HNC, CS, C34S, SO, SO2, H2CS, and CH3OH. CO, p-H2O, CS, and HCN show similar velocity profiles with a narrow, blueshifted component, which may be linked to the outer outflow layer. Redshifted wings may indicate inner outflow activity. A Markov Chain Monte Carlo framework is employed to infer column densities and temperatures accurately. We also performed spectral energy distribution fitting to constrain the global physical parameters of G10, providing essential context for interpreting the molecular emission. The MCMC analysis revealed two excitation temperature components: a warm component (30-65 K) and a hot component (90-250 K). The higher temperatures indicate dense, hot gas typical of massive hot cores. The lower temperatures correspond to the warm, less dense envelope around the core. Transitions of H2O, high-excitation CO, and HCN indicate outflowing gas and high-density shocked regions. These findings highlight G10's complex dynamical environment.",
      "pdf_url": "https://arxiv.org/pdf/2602.09571.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09656",
      "title": "Organic Acid Chemistry in ISM: Detection of Formic Acid and its Prebiotic Chemistry in Hot Core G358.93$-$0.03 MM1",
      "authors": [
        "Arijit Manna",
        "Sabyasachi Pal",
        "Sekhar Sinha",
        "Sushanta Kumar Mondal"
      ],
      "abstract": "Organic Acid Chemistry in ISM: Detection of Formic Acid and its Prebiotic Chemistry in Hot Core G358.93$-$0.03 MM1 Arijit Manna, Sabyasachi Pal, Sekhar Sinha, Sushanta Kumar Mondal Published in Research in Astronomy and Astrophysics (RAA) Res. Astron. Astrophys. 26, 035019 (2026) Astrophysics of Galaxies (astro-ph.GA); Chemical Physics (physics.chem-ph); Space Physics (physics.space-ph) In the interstellar medium, formic acid (HCOOH) plays a significant role in the synthesis of the simplest amino acid, glycine (NH$_{2}$CH$_{2}$COOH). The presence of HCOOH suggests that oxygen-bearing molecules may be directly involved in the chemical and physical evolution of star formation regions, particularly in hot molecular cores. This paper presents the first detection of the rotational emission lines of the $trans$-conformer of HCOOH toward the hot molecular core G358.93$-$0.03 MM1, located in the massive star formation region G358.93$-$0.03. This study employed high-resolution observations from the Atacama Large Millimeter/submillimeter Array (ALMA) in Band 7. The column density and excitation temperature of $t$-HCOOH are determined as $(8.13\\pm0.72)\\times10^{15}$ cm$^{-2}$ and $120\\pm15$ K, respectively. The fractional abundance of $t$-HCOOH relative to H$_{2}$ is $(2.62\\pm 0.29)\\times 10^{-9}$. The column density ratios of $t$-HCOOH/CH$_{3}$OH and $t$-HCOOH/H$_{2}$CO are $(1.56 \\pm 0.12)\\times 10^{-2}$ and $(1.16 \\pm 0.12)$, respectively. We computed a three-phase warm-up chemical model of HCOOH using the gas-grain chemical code UCLCHEM. We found that the observed and modelled abundances of HCOOH are almost identical, within a factor of 0.89. Based on chemical modelling, we showed that HCOOH may be formed through the reaction between HCO and OH on the grain surface, which is further released in the gas-phase.",
      "pdf_url": "https://arxiv.org/pdf/2602.09656.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09658",
      "title": "EMU Radio Observations of Barred Spiral Galaxy NGC 5938 (Araish)",
      "authors": [
        "H. Zakir",
        "M.D. Filipović",
        "L. Barnes",
        "R. Z. E. Alsaberi",
        "T. An",
        "K. Dage",
        "S. W. Duchesne",
        "A. M. Hopkins",
        "A. Kapinska",
        "B. Koribalski",
        "S. Lazarević",
        "D. Leahy",
        "Z. Liu",
        "R. P. Norris",
        "A. Rau",
        "Z.J. Smeaton",
        "T. Jarrett"
      ],
      "abstract": "EMU Radio Observations of Barred Spiral Galaxy NGC 5938 (Araish) H. Zakir, M.D. Filipović, L. Barnes, R. Z. E. Alsaberi, T. An, K. Dage, S. W. Duchesne, A. M. Hopkins, A. Kapinska, B. Koribalski, S. Lazarević, D. Leahy, Z. Liu, R. P. Norris, A. Rau, Z.J. Smeaton, T. Jarrett This Paper has been accepted for publication in PASA. It contains 12 Pages, 7 figures, and 2 Tables Astrophysics of Galaxies (astro-ph.GA) We present multi-wavelength observations of the nearby spiral galaxy NGC 5938 (Araish) to investigate the origin of its radio emission, specifically the contribution from active galactic nucleus (AGN) activity and star formation. Using Evolutionary Map of the Universe (EMU) data, we detect extended radio emission extending outwards to the galactic axis, with a steep non-thermal spectral index ($\\alpha = -1.2 \\pm 0.2$) indicative of synchrotron radiation from an AGN jet. The jet has a physical extent of $\\approx 8.2\\,kpc$ (angular length of $64^{\\prime\\prime}$). Multi-wavelength data from The Dark Energy Camera Plane Survey 2 (DECaPS2), Wide-field Infrared Survey Explorer (WISE), and extended Roentgen Survey with an Imaging Telescope Array (eROSITA) provide further support for this interpretation. The colour-colour diagram presenting WISE infrared observations suggests the presence of dust and young stars that trace the galaxy's disk structure. Our analysis reveals a radio jet, alongside star formation traced by infrared emission, demonstrating the complex interplay of AGN activity and star formation in this well-resolved galaxy. Intriguingly, the spatial relationship reveals the brighter X-ray emission to be largely adjacent to and enveloping the extended radio emission. This suggests that the radio jet, while extending at a significant angle to the galactic disk, is confined by the larger X-ray gas halo, similar to other systems (i.e., ESO 295-IG022, Centaurus A) and may indicate jet collimation and channelling effects.",
      "pdf_url": "https://arxiv.org/pdf/2602.09658.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09663",
      "title": "Global statistical entropy and its implications for the main sequences of stars and galaxies",
      "authors": [
        "David Elbaz"
      ],
      "abstract": "Global statistical entropy and its implications for the main sequences of stars and galaxies David Elbaz 8 pages, 3 figures, accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA); Classical Physics (physics.class-ph) In a dissipative system such as star or a galaxy, the emitted photons are decoupled from matter particles and may therefore be considered as part of a closed system to which the Second Law of Thermodynamics applies. In the present paper, we define a global entropy using a statistical approach that accounts for the contributions of both matter particles and photons. The statistical contribution of radiation is described as a photon gas in the definition of this global entropy. The increase in global entropy can foster structure formation -- rather than disorder -- because structures such as stars and galaxies are efficient at dissipating energy in the form of photons, and thus at producing entropy. We show that stars generate a nearly equal amount of specific entropy, and therefore a comparable number of photons per unit mass, over their lifetime on the main sequence of the Hertzsprung-Russell (HR) diagram. This suggests that the main sequence of the HR diagram constitutes a locus of convergence toward a universal specific entropy production by stars. We then examine the implications of this approach for the star-formation main sequence in galaxies, and find a similar result. The emergence of organized structures in cosmic history reflects the second law, as organized matter is efficient at generating entropy through the slicing of energy into lower-frequency photons. This is also reflected in the dominant contribution of low-frequency photons to the extragalactic background light. Finally, we briefly discuss how this perspective may inform us on the possibility of the existence of life elsewhere in the universe.",
      "pdf_url": "https://arxiv.org/pdf/2602.09663.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09675",
      "title": "Two-dimensional metallicity distribution of the ionized gas in NGC 628 and NGC 6946",
      "authors": [
        "Bernabé Cedrés",
        "Jordi Cepa",
        "Ángel Bongiovanni",
        "Héctor Castañeda",
        "Miguel Sánchez-Portal",
        "A. Tomita"
      ],
      "abstract": "Two-dimensional metallicity distribution of the ionized gas in NGC 628 and NGC 6946 Bernabé Cedrés, Jordi Cepa, Ángel Bongiovanni, Héctor Castañeda, Miguel Sánchez-Portal, A. Tomita 41 pages, 18 figures, old paper not in Arxiv Astrophysics of Galaxies (astro-ph.GA) We present here two H II region catalogues with azimuthal resolution for the two grand design galaxies NGC 628 and NGC 6946. With the help of these catalogues, we study several properties of the star-forming processes occurring in spiral galaxies. We obtained direct imaging in the narrow-band filters centred at H{\\alpha}, H\\b{eta}, [O II]{\\lambda}3727, and [O III]{\\lambda}{\\lambda}4959, 5007 and their respective continua. After the calibration and correction of the data, we obtained for each H II region the de-reddened fluxes in the aforementioned lines, the size, the H{\\alpha} equivalent width, and, using two different empirical calibrations, the metallicity. Employing a method based on the Delaunay triangulation, a two-dimensional (2D) representation of the metallicity was obtained. Data for 209 H II regions of NGC 628 and 226 H II regions of NGC 6946 are obtained. The radial behaviours of the H{\\alpha} equivalent width, the excitation, and the oxygen abundance are derived. Two-dimensional representations of the metallicity and the excitation are calculated for the galaxies in the study. The two empirical calibrations of the metallicity are compared. The oxygen abundance gradients obtained in this study agree with previously published values. However, more regions were examined than in previous studies. We find a difference of about 0.6 dex between the two empirical calibrations employed. Finally, the 2D representations of the metallicity reveal high metallicity knots in NGC 628, and for NGC 6946 a high metallicity azimuthal structure is discovered. These high metallicity regions seem to be linked to the arms of the galaxies and are probably produced by an increase in the temperature of the ionizing clusters in the H II regions, which may be linked to variations in the initial mass functions of the galaxies between the arm and interarm regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.09675.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09773",
      "title": "Massive disk galaxies with high surface brightness plus low surface brightness stellar disks, hosted by massive dark matter halo -- a TNG50 simulation study",
      "authors": [
        "Suchira Sarkar",
        "Kanak Saha"
      ],
      "abstract": "Massive disk galaxies with high surface brightness plus low surface brightness stellar disks, hosted by massive dark matter halo -- a TNG50 simulation study Suchira Sarkar, Kanak Saha This was accepted for publication in the International Astronomical Union Proceedings Series ( IAU General Assembly, August- 2024, Cape Town, South Africa) Astrophysics of Galaxies (astro-ph.GA) We study massive disk galaxies (total stellar mass$>=10^{11}$ $\\mathrm{M_{\\odot}}$) from IllustrisTNG50 simulation, and perform 2-D structural decomposition of the galaxies using their idealised, synthetic SDSS images for z=0. We find an interesting sample of galaxies having a central high surface brightness (HSB) stellar disk, surrounded by an extended low surface brightness (LSB) stellar disk, similar to giant LSB galaxies. These massive, double-exponential disk galaxies are found to be hosted by dark matter haloes of $\\sim 10^{12} \\mathrm{M_{\\odot}}$ in agreement to observations of such galaxies. Their maximum rotation velocity, an approximate measure of their dynamical mass, lies within $\\sim$ (300-500) km/s. The stellar-to-dark matter mass ratio and the baryon-to-dark matter mass ratio of the sample lies in the range of $\\sim$ (0.04 - 0.46) and $\\sim$ (0.07 - 0.47) respectively. Our results show that cosmological simulations are able to form disc galaxies with HSB plus LSB disks, as in observations.",
      "pdf_url": "https://arxiv.org/pdf/2602.09773.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09779",
      "title": "Analysis of Galactic cirrus filaments in HSC-SSP high-resolution deep images using artificial neural networks",
      "authors": [
        "Denis M. Poliakov",
        "Anton A. Smirnov",
        "Sergey S. Savchenko",
        "Alexander A. Marchuk",
        "Aleksandr V. Mosenkov",
        "Vladimir B. Ilin",
        "George A. Gontcharov",
        "Daria G. Turichina",
        "Andrey D. Panasyuk"
      ],
      "abstract": "Analysis of Galactic cirrus filaments in HSC-SSP high-resolution deep images using artificial neural networks Denis M. Poliakov, Anton A. Smirnov, Sergey S. Savchenko, Alexander A. Marchuk, Aleksandr V. Mosenkov, Vladimir B. Ilin, George A. Gontcharov, Daria G. Turichina, Andrey D. Panasyuk 42 pages, 21 figures. This is a preprint of the article accepted for publication in Astronomy and Computing (Elsevier). The final published version is available at DOI: this https URL Astrophysics of Galaxies (astro-ph.GA) The existence of Galactic optical cirrus poses a challenge for observing faint objects within our Galaxy and dim extragalactic structures. To investigate individual cirrus filaments in the Hyper Suprime-Cam Subaru Strategic Program public data release 3 (HSC-SSP DR3) we use a technique based on convolutional neural networks and ensemble learning. This approach allows us to distinguish cirrus filaments from foreground and background objects across the entire HSC-SSP, using optical images in the $g$, $r$, and $i$ wavebands. A comparison with previous work using deep Sloan Digital Sky Survey Stripe~82 (SDSS Stripe~82) data reveals that the cirrus clouds identified in this study are highly consistent in location within the overlapping survey region. However, in the deeper HSC-SSP dataset, we were able to detect $4.5$ times more cirrus clouds. Our study indicates that the sky background in HSC-SSP coadd images is over-subtracted, as evidenced by the surface brightness distribution in cirrus filaments and surrounding regions. Objects with surface brightness of $m = 29~\\mbox{mag~arcsec}^{-2}$ near large filaments can be dimmed by over-subtraction of $0.5$ magnitude in the $r$ band. This suggests that cirrus clouds should be taken into account in algorithms for estimating the sky background. For practical use, we provide a catalog of filaments and a framework that allows one to train neural network models for segmenting cirri in HSC-SSP coadd images.",
      "pdf_url": "https://arxiv.org/pdf/2602.09779.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09871",
      "title": "Resolved Dust Emission and CO Isotopologues in Giant Molecular Clouds of the Andromeda Galaxy",
      "authors": [
        "Chloe Bosomworth",
        "Jan Forbrich",
        "Charles J. Lada",
        "Glen Petitpas"
      ],
      "abstract": "Resolved Dust Emission and CO Isotopologues in Giant Molecular Clouds of the Andromeda Galaxy Chloe Bosomworth, Jan Forbrich, Charles J. Lada, Glen Petitpas Astrophysics of Galaxies (astro-ph.GA) Dust emission at submillimeter wavelengths can be used to reliably trace the basic properties of molecular clouds. Early results from a recent Submillimeter Array (SMA) survey of the Andromeda Galaxy (M31) include the first detections of resolved dust continuum emission from individual giant molecular clouds (GMCs) in an external spiral galaxy. This paper updates on the now-complete SMA survey of 80 Herschel-identified giant molecular associations (GMAs) in M31. The SMA survey simultaneously probes dust continuum emission at 230 GHz and the $J = 2 \\rightarrow 1$ transitions of the CO isotopologues, $^{12}\\rm CO$, $^{13}\\rm CO$, and $\\rm C^{18}O$ at a spatial resolution of $\\lesssim 15~\\mathrm{pc}$. Dust continuum emission was detected in 71 cloud cores, of which 26 were resolved. This more than doubles the size of the previous sample. By comparing dust and CO observations with identical astrometry, we directly measure the dust mass to-light ratios, $\\rm \\alpha^{\\prime}_{^{12}CO}$, and $\\rm \\alpha^{\\prime}_{^{13}CO}$. We derive $<\\alpha^{\\prime}_{\\rm ^{12}\\rm CO}>~=~0.070~\\pm~0.031~M_{\\odot}\\,(\\rm K~km~s^{-1}~pc^{2})^{-1}$ and $<\\alpha^{\\prime}_{\\rm ^{13}\\rm CO}>~=~0.37~\\pm~0.20~M_{\\odot}\\,(\\rm K~km~s^{-1}~pc^{2})^{-1}$ for the increased sample, which are in agreement with previously reported values. From virial analysis, we find that 80% of the GMC regions traced by resolved dust emission are bound and close to virial equilibrium. Finally, we update our analysis on the metallicity dependence of $\\rm \\alpha^{\\prime}_{\\rm CO}$ by combining SMA observations with existing MMT/Hectospec optical spectroscopy toward H II regions. We find no trend in $\\rm \\alpha^{\\prime}_{\\rm CO}$ with metallicity, supporting the previous findings.",
      "pdf_url": "https://arxiv.org/pdf/2602.09871.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09954",
      "title": "Physical properties of circumnuclear ionising clusters. IV. NGC 1097",
      "authors": [
        "Sandra Zamora",
        "Angeles I. Díaz",
        "Asier Castrillo"
      ],
      "abstract": "Physical properties of circumnuclear ionising clusters. IV. NGC 1097 Sandra Zamora, Angeles I. Díaz, Asier Castrillo 14 pages, 10 figures, Submitted to Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) The circumnuclear star-forming ring of the barred spiral galaxy NGC 1097 provides a unique laboratory to study star formation under extreme conditions. This work aims to derive the physical properties of the circumnuclear star-forming regions (CNSFRs) using MUSE integral field spectroscopy observations. A total of 24 individual ionised HII are identified and analysed within its ring, which spans from $\\sim$385 pc to $\\sim$1.3 kpc. Despite the complex nuclear activity, all HII regions are found to be purely photoionised. Directly derived abundances reveal supersolar metallicities, with the highest one exceeding five times the solar value (12+log(S/H) = 7.875 $\\pm$ 0.353, T$_e$([SIII]) = 3912 $\\pm$ 567 K), and representing the highest abundance reported to date. In this high-metallicity regime, we find a break in the ionisation parameter-[SII]/[SIII] relation, which can be explained by changes in the ionisation structure and line emissivities, as confirmed by photoionisation models that successfully reproduce the observed emission-line ratios. Our results also indicate that the local gas supply regulates the star formation activity within the ring, with the young stars ionising 8 % of the total gas in the ring. Furthermore, our findings support a propagating starburst scenario, originating in the galaxy nucleus and extending towards the ends of the bar and into the circumnuclear ring through bar-driven shocks, this being consistent with the results of previous multi-wavelength studies. Finally, we likely detect optical signatures associated with one of the two known jets in this galaxy. This finding, together with the radio core emission previously found at sub-parsec scales, reflects the presence of feedback processes operating even on small galactic disc scales.",
      "pdf_url": "https://arxiv.org/pdf/2602.09954.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10072",
      "title": "SDSS-V Local Volume Mapper (LVM): Helix Nebula public data, Data Analysis Pipeline data products",
      "authors": [
        "S. F. Sánchez",
        "J.E. Méndez-Delgado",
        "A. Mejía-Narváez",
        "C. Román-Zuñiga",
        "O. V. Egorov",
        "C. Morisset",
        "N. Drory",
        "G. A. Blanc",
        "K. Kreckel",
        "E. J. Johnston",
        "Ivan Yu. Katkov",
        "A. Roman Lopes",
        "M. A. Villa-Durango",
        "H. Ibarra-Medel",
        "H.-W. Rix",
        "R. de J. Zermeño",
        "J. G. Fernández Trincado",
        "A. Singh",
        "P. García",
        "G. S. Stringfellow",
        "L. Sabin",
        "J. Toalá",
        "R. Orozco Duarte",
        "A. M. Jones"
      ],
      "abstract": "SDSS-V Local Volume Mapper (LVM): Helix Nebula public data, Data Analysis Pipeline data products S. F. Sánchez, J.E. Méndez-Delgado, A. Mejía-Narváez, C. Román-Zuñiga, O. V. Egorov, C. Morisset, N. Drory, G. A. Blanc, K. Kreckel, E. J. Johnston, Ivan Yu. Katkov, A. Roman Lopes, M. A. Villa-Durango, H. Ibarra-Medel, H.-W. Rix, R. de J. Zermeño, J. G. Fernández Trincado, A. Singh, P. García, G. S. Stringfellow, L. Sabin, J. Toalá, R. Orozco Duarte, A. M. Jones 20 pages, 12 figures, accepted for publishing in RMxA&A Astrophysics of Galaxies (astro-ph.GA) We present a spatially resolved spectroscopic analysis of the Helix Nebula (NGC 7293) using data from the SDSS-V Local Volume Mapper (LVM), by applying the recently developed LVM Data Analysis Pipeline (LVM-DAP). Covering the full optical range (3600-9800 Å) over a contiguous ~ 0.5 degree field, the LVM data provide the first hexagonally sampled, wide-field emission-line maps of all major ionic species in this archetypal planetary nebula. The resulting flux, kinematic, and line-ratio maps reveal the well-known ionization stratification of the nebula, from the compact He++ core to the bright [O III] ring and the extended low-ionization envelope, enabling a detailed comparison with classical aperture spectroscopy. Owing to the sensitivity and uniform spatial sampling of the LVM, numerous faint auroral and diagnostic lines are detected across the nebula, including [O III] 4363, [N II] 5755, and He I lines, allowing precise measurements of weak-line morphology. The derived radial trends confirm the remarkably low dust content and the overall homogeneity of electron temperature and density across the main ring. Ionized-gas kinematics traced by H{\\alpha} further support the scenario of a slowly expanding, limb-brightened shell consistent with previous studies. This work demonstrates the diagnostic power of LVM spectroscopy for extended nebulae and highlights its capability to recover both global and spatially resolved physical conditions across complex ionized structures.",
      "pdf_url": "https://arxiv.org/pdf/2602.10072.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10082",
      "title": "Effects of Numerical Resolution on Simulated Cloud-Wind Interactions",
      "authors": [
        "Hannah Leary",
        "Helena M. Richie",
        "Evan Schneider"
      ],
      "abstract": "Effects of Numerical Resolution on Simulated Cloud-Wind Interactions Hannah Leary, Helena M. Richie, Evan Schneider 14 pages, 7 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) Mixing by hydrodynamical instabilities plays a key role in cloud-wind interactions, causing cloud destruction in the adiabatic limit and facilitating cloud survival with efficient radiative cooling. However, the rate of mixing in numerical simulations is sensitive to the smallest resolved scale, and the relationship between resolution and cloud evolution is under-explored. Using a set of cloud-crushing simulations, we investigate the effects of numerical resolution on cloud survival and acceleration. Modeling both adiabatic and radiative cases, in a subsonic and supersonic wind, we find that cloud survival and velocity does depend on the numerical resolution, however, no single resolution requirement can be applied to all scenarios. In the radiative subsonic case, we find that mass growth and acceleration appear converged at only 4 cells per cloud radius. Conversely, in the supersonic regime, we see a clear dependence of cloud destruction and velocity on resolution that is not converged even at 48 cells per cloud radius, implying that accurately capturing cloud destruction may require higher resolution than capturing growth. We also present a simple model illustrating how ram pressure accelerates cool clouds at early times before mixing kicks in as an acceleration mechanism.",
      "pdf_url": "https://arxiv.org/pdf/2602.10082.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09837",
      "title": "Investigating the Nested Structure of the Outflow from the Low Luminosity Protostar IRAS 16253-2429 using JWST and ALMA",
      "authors": [
        "Mayank Narang",
        "Himanshu Tyagi",
        "Nagayoshi Ohashi",
        "P. Manoj",
        "S. Thomas Megeath",
        "John J. Tobin",
        "Ewine F. van Dishoeck",
        "Neal J. Evans II",
        "Dan M. Watson",
        "Alessio Caratti o Garatti",
        "Jes K. Jørgensen",
        "Robert Gutermuth",
        "Yusuke Aso",
        "Henrik Beuther",
        "Leslie W. Looney",
        "David A. Neufeld",
        "Guillem Anglada",
        "Mayra Osorio",
        "Adam E. Rubinstein",
        "Samuel Federman",
        "Lee W. Hartmann",
        "Pooneh Nazari",
        "Nicole Karnath",
        "Hendrik Linz",
        "Thomas Stanke",
        "Tyler L. Bourke",
        "Yao-Lun Yang",
        "Rolf Kuiper",
        "Joel Green",
        "Pamela Klaassen",
        "Wafa Zakri",
        "Nolan Habel",
        "Nashanty Brunken",
        "James Muzerolle",
        "Katerina Slavicinska",
        "Amelia M. Stutz",
        "Lukasz Tychoniec",
        "Scott Wolk",
        "Will R. M. Rocha",
        "William J. Fischer"
      ],
      "abstract": "Investigating the Nested Structure of the Outflow from the Low Luminosity Protostar IRAS 16253-2429 using JWST and ALMA Mayank Narang, Himanshu Tyagi, Nagayoshi Ohashi, P. Manoj, S. Thomas Megeath, John J. Tobin, Ewine F. van Dishoeck, Neal J. Evans II, Dan M. Watson, Alessio Caratti o Garatti, Jes K. Jørgensen, Robert Gutermuth, Yusuke Aso, Henrik Beuther, Leslie W. Looney, David A. Neufeld, Guillem Anglada, Mayra Osorio, Adam E. Rubinstein, Samuel Federman, Lee W. Hartmann, Pooneh Nazari, Nicole Karnath, Hendrik Linz, Thomas Stanke, Tyler L. Bourke, Yao-Lun Yang, Rolf Kuiper, Joel Green, Pamela Klaassen, Wafa Zakri, Nolan Habel, Nashanty Brunken, James Muzerolle, Katerina Slavicinska, Amelia M. Stutz, Lukasz Tychoniec, Scott Wolk, Will R. M. Rocha, William J. Fischer 22 pages, 14 figures, in press at AAS Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Understanding the earliest stage of star and planet formation requires detailed observations to address the connection and interplay between the accretion, outflow, and disk evolution. We present results from observations of the low luminosity ($L_{\\mathrm{bol}} \\sim 0.2,L_{\\odot}$) and low mass ($M_{*} \\sim 0.15,M_{\\odot}$) Class 0 protostar IRAS~16253$-$2429, conducted as part of the eDisk ALMA Large Program and the JWST Cycle~1 GO program IPA. Observations reveal a wide hourglass-shaped continuum cavity traced in scattered light (at $\\leq 5,\\mu$m), with a brighter, extended northern side. We detect 15 pure rotational H$2$ transitions ($E{\\mathrm{up}} = 1015$--21411~K), revealing a wide-angle molecular outflow. The outflow width traced by H$_2$~0-0~S(11) at the protostellar location measures $\\leq 35$~au, slightly larger than the dust and Keplerian disk diameters ($\\sim 30$~au) but wider than the 20--23~au jet width in [Fe~II]. The opening angle narrows from 40--35 degrees for the low-$J$ H$_2$ lines (up to S(5)) and the cold gas component traced by ALMA $^{12}$CO to $\\sim 28$--19 degrees for the high-$J$ H$_2$ lines (S(7)--S(11)). Position--velocity diagrams of H$2$ reveal higher velocities for higher $E{\\mathrm{up}}$, ranging from $\\sim 12.5$~km~s$^{-1}$ for H$_2$~0-0~S(1) and S(2) to $\\sim 28.5$~km~s$^{-1}$ for H$_2$~0-0~S(5) and S(7) with respect to the mean flow velocity. The nested excitation and velocity structure of the collimated jet and wide-angle wind suggests a magnetohydrodynamic wind as a likely launching mechanism, similar to findings in other protostars and Class~II sources. The lower-velocity millimeter CO emission may be gas from the infalling envelope accelerated outward by the wide-angle wind along the cavity walls.",
      "pdf_url": "https://arxiv.org/pdf/2602.09837.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.19968",
      "title": "Circumgalactic medium of quasar host galaxies at 0.4<z<0.8 probed by strong Mg II absorption",
      "authors": [
        "Paryag Sharma",
        "Raghunathan Srianand",
        "Hum Chand",
        "Labanya Kumar Guha"
      ],
      "abstract": "Circumgalactic medium of quasar host galaxies at 0.4<z<0.8 probed by strong Mg II absorption Paryag Sharma, Raghunathan Srianand, Hum Chand, Labanya Kumar Guha MNRAS, Volume 541, Issue 1, July 2025, Pages 601-609 Astrophysics of Galaxies (astro-ph.GA) Using a sample of 166 projected quasar pairs we investigate the influence of active galactic nuclei on the circumgalactic medium (CGM) of the quasar host galaxies probed using strong Mg II absorption (i.e., $W_{2796}\\ge 1\\dot{A}$) at impact parameters ($D$) $<$100 kpc. The foreground quasars are restricted to the redshift range $0.4 \\leq z \\leq 0.8$ and have median bolometric luminosity and stellar mass of $10^{45.1} erg~s^{-1}$and $10^{10.89} M_\\odot$ respectively. We report detections of Mg II absorption in 29 cases towards the background quasar and in 4 cases along the line of sight to the foreground quasars. We do not find any difference in the distribution of $W_{2796}$ and covering fraction ($f_c$) as a function of $D$ between quasar host galaxies and control sample of normal galaxies. These results are different from what has been reported in the literature, possibly because: (i) our sample is restricted to a narrow redshift range, (ii) comparative analysis is carried out after matching the galaxy parameters, (iii) we focus mainly on strong Mg II absorption and (iv) our sample lacks foreground quasars with high bolometric luminosity (i.e., $L_{bol}>10^{45.5}$ erg s$^{-1}$). Future studies probing luminous foreground quasars, preferably at lower impact parameters and higher equivalent width sensitivity is needed to consolidate our findings.",
      "pdf_url": "https://arxiv.org/pdf/2503.19968.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.11023",
      "title": "If quasars form from primordial black holes",
      "authors": [
        "Jeremy Mould",
        "Adam Batten"
      ],
      "abstract": "If quasars form from primordial black holes Jeremy Mould, Adam Batten for submission to Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) We explore the consequences of a novel but increasingly well-supported hypothesis that supermassive black holes may have formed from primordial black holes form ed prior to, and rapidly growing in, the radiation-dominated universe. We show that this hypothesis can predict the luminosity of quasars and their luminosity distribution. With reasonable values of the parameters introduced, these predictions are borne out by observations. The model predicts density evolution in accordance with observations. If the same galaxy interaction rate creates quasars and radio galaxies, whose primordial black hole nuclei seem somewhat less massive, their relative number densities reflect relative lifetimes in these states.",
      "pdf_url": "https://arxiv.org/pdf/2507.11023.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20190",
      "title": "Interpreting nebular emission lines in the high-redshift Universe",
      "authors": [
        "Aswin P. Vijayan",
        "Robert M. Yates",
        "Christopher C. Lovell",
        "William J. Roper",
        "Stephen M. Wilkins",
        "Hiddo S. B. Algera",
        "Shihong Liao",
        "Paurush Punyasheel",
        "Lucie E. Rowland",
        "Louise T. C. Seeyave"
      ],
      "abstract": "Interpreting nebular emission lines in the high-redshift Universe Aswin P. Vijayan, Robert M. Yates, Christopher C. Lovell, William J. Roper, Stephen M. Wilkins, Hiddo S. B. Algera, Shihong Liao, Paurush Punyasheel, Lucie E. Rowland, Louise T. C. Seeyave 26 pages and 19 figures. Published in the Open Journal of Astrophysics. Github page to reproduce plots at: this https URL Astrophysics of Galaxies (astro-ph.GA) One of the most remarkable outcomes from \\textit{JWST} has been the exquisite UV-optical spectroscopic data for galaxies in the high-redshift Universe ($z \\geq 5$), enabling the use of various nebular emission lines to infer conditions of the interstellar medium. In this work, we assess the reliability of commonly used diagnostics for estimating the star formation rate (SFR), the ionising photon production efficiency ($\\xi_{\\rm ion}$), and the gas-phase oxygen abundance, focusing on dust corrections based on A$_{\\rm V}$ (V-band attenuation) and the Balmer decrement. Using forward-modelled galaxy spectra from idealised toy models and the FLARES cosmological hydrodynamical simulations, we examine how variations in stellar populations and star-dust geometry affect these diagnostics. We find that the clumpy nature of \\flares\\ galaxies lead to strong internal variation in age, metallicity and dust attenuation, biasing the inferred quantities. In FLARES the SFRD at the bright-end of the SFR function can be underestimated by as much as $30\\%$ compared to the true values. While the intrinsic $\\xi_{\\rm ion}$ in FLARES is nearly constant with stellar mass, estimates derived from H$\\alpha$ or H$\\beta$ can be underestimated by more than 0.5 dex at high stellar masses ($>10^{9.5}$ M$_{\\odot}$), introducing an artificial declining trend. Similarly, the dust-corrected mass-metallicity relation inferred from line ratios is significantly flatter than the intrinsic mass-weighted relation. These systematic offsets arise from the coupling between heterogeneous stellar populations and non-uniform star-dust geometry and depend on the diagnostic and the dust-correction method employed. No single dust-correction approach yields unbiased estimates of all quantities simultaneously, highlighting the need for forward modelling and comparisons in observed space for robust high-redshift inference.",
      "pdf_url": "https://arxiv.org/pdf/2507.20190.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.12082",
      "title": "YOLO-CIANNA: Galaxy detection with deep learning in radio data: II. Winning the SKA SDC2 using a generalized 3D-YOLO network",
      "authors": [
        "D. Cornu",
        "B. Semelin",
        "P. Salomé",
        "X. Lu",
        "S. Aicardi",
        "J. Freundlich",
        "F. Mertens",
        "A. Marchal",
        "G. Sainton",
        "F. Combes",
        "C. Tasse"
      ],
      "abstract": "YOLO-CIANNA: Galaxy detection with deep learning in radio data: II. Winning the SKA SDC2 using a generalized 3D-YOLO network D. Cornu, B. Semelin, P. Salomé, X. Lu, S. Aicardi, J. Freundlich, F. Mertens, A. Marchal, G. Sainton, F. Combes, C. Tasse Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) As the scientific exploitation of the Square Kilometre Array (SKA) approaches, there is a need for new advanced data analysis and visualization tools capable of processing large high-dimensional datasets. In this study, we aim to generalize the YOLO-CIANNA deep learning source detection and characterization method for 3D hyperspectral HI emission cubes. We present the adaptations we made to the regression-based detection formalism and the construction of an end-to-end 3D convolutional neural network (CNN) backbone. We then describe a processing pipeline for applying the method to simulated 3D HI cubes from the SKA Observatory Science Data Challenge 2 (SDC2) dataset. The YOLO-CIANNA method was originally developed and used by the MINERVA team that won the official SDC2 competition. Despite the public release of the full SDC2 dataset, no published result has yet surpassed MINERVA's top score. In this paper, we present an updated version of our method that improves our challenge score by 9.5%. The resulting catalog exhibits a high detection purity of 92.3%, best-in-class characterization accuracy, and contains 45% more confirmed sources than concurrent classical detection tools. The method is also computationally efficient, processing the full ~1TB SDC2 data cube in 30 min on a single GPU. These state-of-the-art results highlight the effectiveness of 3D CNN-based detectors for processing large hyperspectral data cubes and represent a promising step toward applying YOLO-CIANNA to observational data from SKA and its precursors.",
      "pdf_url": "https://arxiv.org/pdf/2509.12082.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.02116",
      "title": "Hidden in Plain Sight II: Characterizing the luminous companion to Kappa Velorum with VLTI/GRAVITY",
      "authors": [
        "D. M. Rowan",
        "S. Kraus",
        "Todd A. Thompson"
      ],
      "abstract": "Hidden in Plain Sight II: Characterizing the luminous companion to Kappa Velorum with VLTI/GRAVITY D. M. Rowan, S. Kraus, Todd A. Thompson 17 pages, 9 figures. Published in PASP Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Kappa Velorum (Markeb, HD 81188) is one of the brightest stars in the Southern sky and has long been known to be a single-lined spectroscopic binary. The binary mass function is large, $f(M)=1.15\\ M_\\odot$, suggesting that the bright (V=2.5) B2IV star may host a dark, compact object companion. We use VLTI GRAVITY observations to definitively test this possibility by directly resolving the binary. We detect a main sequence B star companion and rule out the compact object scenario. By combining the relative astrometric orbit and archival radial velocities, we report an updated precise characterization of the orbit (period $P=116.795\\pm0.002$ d, eccentricity $e=0.1764\\pm0.0004$, inclination $i=74.04\\pm0.01^{\\circ}$) and estimate the masses of the B stars. Using the original Hipparcos parallax measurement $\\varpi = 6.05\\pm0.48$ mas, we find $M_1 = 10^{+4}_{-2}\\ M_\\odot$ and $M_2 = 6.9\\pm1.0\\ M_\\odot$. The uncertainties on the masses are primarily driven by the uncertain parallax, which we find is likely biased by the orbital motion. We use an archival UVES spectrum and MIST evolutionary tracks to refine our mass estimates. Finally, we discuss how interferometry and high-contrast imaging may be used to characterize other candidate star+compact object binaries, including those that will be discovered with Gaia DR4, as part of a larger effort to uncover the hidden population of black holes in the Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2512.02116.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.04477",
      "title": "The Binary Fraction of Stars in the Dwarf Galaxy Ursa Minor via Dark Energy Spectroscopic Instrument",
      "authors": [
        "Tian Qiu",
        "Wenting Wang",
        "Sergey Koposov",
        "Ting S. Li",
        "Nathan R. Sandford",
        "Joan Najita",
        "Songting Li",
        "Jiaxin Han",
        "Arjun Dey",
        "Constance Rockosi",
        "Boris Gaensicke",
        "Jesse Han",
        "Benjamin Alan Weaver",
        "Adam Myers",
        "Jessica Nicole Aguilar",
        "Steven Ahlen",
        "Carlos Allende Prieto",
        "Davide Bianchi",
        "David Brooks",
        "Todd Claybaugh",
        "Axel de la Macorra",
        "Peter Doel",
        "Andreu Font-Ribera",
        "Jaime Forero-Romero",
        "Enrique Gaztanaga",
        "Satya Gontcho A Gontcho",
        "Gaston Gutierrez",
        "Jorge Jimenez",
        "Dick Joyce",
        "Theodore Kisner",
        "Claire Lamman",
        "Martin Landriau",
        "Laurent Le Guillou",
        "Aaron Meisner",
        "Ramon Miquel",
        "Seshadri Nadathur",
        "Will Percival",
        "Claire Poppett",
        "Francisco Prada",
        "Ignasi Perez-Rafols",
        "Graziano Rossi",
        "Eusebio Sanchez",
        "David Schlegel",
        "Joseph Harry Silber",
        "David Sprayberry",
        "Gregory Tarle",
        "Rongpu Zhou",
        "Hu Zou"
      ],
      "abstract": "The Binary Fraction of Stars in the Dwarf Galaxy Ursa Minor via Dark Energy Spectroscopic Instrument Tian Qiu, Wenting Wang, Sergey Koposov, Ting S. Li, Nathan R. Sandford, Joan Najita, Songting Li, Jiaxin Han, Arjun Dey, Constance Rockosi, Boris Gaensicke, Jesse Han, Benjamin Alan Weaver, Adam Myers, Jessica Nicole Aguilar, Steven Ahlen, Carlos Allende Prieto, Davide Bianchi, David Brooks, Todd Claybaugh, Axel de la Macorra, Peter Doel, Andreu Font-Ribera, Jaime Forero-Romero, Enrique Gaztanaga, Satya Gontcho A Gontcho, Gaston Gutierrez, Jorge Jimenez, Dick Joyce, Theodore Kisner, Claire Lamman, Martin Landriau, Laurent Le Guillou, Aaron Meisner, Ramon Miquel, Seshadri Nadathur, Will Percival, Claire Poppett, Francisco Prada, Ignasi Perez-Rafols, Graziano Rossi, Eusebio Sanchez, David Schlegel, Joseph Harry Silber, David Sprayberry, Gregory Tarle, Rongpu Zhou, Hu Zou Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We utilize multi-epoch line-of-sight velocity measurements from the Milky Way Survey of the Dark Energy Spectroscopic Instrument to estimate the binary fraction for member stars in the dwarf spheroidal galaxy Ursa Minor. Our dataset comprises 670 distinct member stars, with a total of more than 2,000 observations collected over approximately one year. We constrain the binary fraction for UMi to be $0.61^{+0.16}_{-0.20}$ and $0.69^{+0.19}_{-0.17}$, with the binary orbital parameter distributions based on solar neighborhood observation from Duquennoy & Mayor (1991) and Moe & Di Stefano (2017), respectively. Furthermore, by dividing our data into two subsamples at the median metallicity, we identify that the binary fraction for the metal-rich ([Fe/H]>-2.14) population is slightly higher than that of the metal-poor ([Fe/H]<-2.14) population. Based on the Moe & Di Stefano model, the best-constrained binary fractions for metal-rich and metal-poor populations in UMi are $0.86^{+0.14}_{-0.24}$ and $0.48^{+0.26}_{-0.19}$, respectively. After a thorough examination, we find that this offset cannot be attributed to sample selection effects. We also divide our data into two subsamples according to their projected radius to the center of UMi, and find that the more centrally concentrated population in a denser environment has a lower binary fraction of $0.33^{+0.30}_{-0.20}$, compared with $1.00^{+0.00}_{-0.32}$ for the subsample in more outskirts.",
      "pdf_url": "https://arxiv.org/pdf/2512.04477.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09160",
      "title": "The Y Dwarf Population with HST: unlocking the secrets of our coolest neighbours -- III. Near-Infrared Photometry",
      "authors": [
        "Clémence Fontanive",
        "Luigi R. Bedin",
        "Mark W. Phillips",
        "Michele Scalco",
        "Loïc Albert",
        "Daniella C. Bardalez Gagliuffi",
        "Beth Biller"
      ],
      "abstract": "The Y Dwarf Population with HST: unlocking the secrets of our coolest neighbours -- III. Near-Infrared Photometry Clémence Fontanive, Luigi R. Bedin, Mark W. Phillips, Michele Scalco, Loïc Albert, Daniella C. Bardalez Gagliuffi, Beth Biller 20 page, 9 figures. Accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Y dwarfs represent the coldest class of brown dwarfs, with effective temperatures below 500K, and provide unique analogues to cold giant exoplanets. We present a large compilation of uniform near-infrared photometry from the Hubble Space Telescope for 21 Y dwarfs across multiple WFC3/IR filters, including the F105W, F125W and F160W bands. We employed refined PSF-fitting and calibration procedures to reach photometric uncertainties at the 0.02-0.05 mag level for most targets. Combined with precise parallax measurements, our data reveal well-defined Y-dwarf sequences in near-infrared colour-magnitude diagrams, observed with a markedly improved tightness. Known photometric trends emerge with minimal scatter, including the continuous redward progression in F125W-F160W with decreasing temperature, and the blueward trend in F105W-F125W with possible hints of a reversal around 350K. Comparisons to the ATMO, Sonora Elf Owl, and Lacy & Burrows atmospheric models highlight systematic discrepancies, in particular F105W-F125W and F105W-F160W colours predicted to be too red. Low-metallicity grids provide the best fits to the global Y-dwarf population, although closer inspection across wavelengths shows that these preferences likely reflect compensating effects in missing or incomplete physics rather than true population-level abundances. While some atmospheric diversity is expected among Y dwarfs, their tight observational sequences and systematic offsets from model predictions reveal that key physical and chemical processes remain inadequately captured in current grids. Our results underscore the importance of high-precision, internally consistent datasets in robustly tracing the Y-dwarf cooling sequence and providing the empirical constraints needed to advance theoretical models at the lowest temperatures.",
      "pdf_url": "https://arxiv.org/pdf/2602.09160.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09199",
      "title": "Unipolarity of the solar magnetic field in equatorial coronal holes",
      "authors": [
        "Khagendra Katuwal",
        "R.T. James McAteer"
      ],
      "abstract": "Unipolarity of the solar magnetic field in equatorial coronal holes Khagendra Katuwal, R.T. James McAteer Solar and Stellar Astrophysics (astro-ph.SR) A study of the unbalanced magnetic polarity distribution of 70 coronal holes was performed. Data from the Helioseismic and Magnetic Imager (HMI) were used to examine the photospheric line-of-sight magnetic field ($B_{\\mathrm{LOS}}$) beneath these coronal holes. The skewness ($S$) values of the $B_{\\mathrm{LOS}}$ distributions revealed significant asymmetry, characterized by the dominance of one magnetic polarity, with $\\sim88\\%$ of the coronal holes exhibiting a skewness value ranging from $\\pm(0.20~\\text{to}~0.40)$. The corresponding magnetic flux imbalance ($\\Phi_{\\mathrm{imb}}$) ranges from $20\\%$ to $45\\%$. In contrast, quiet-Sun regions show symmetric magnetic field distributions with skewness values less than$~0.11$ and flux imbalance less than $11.0\\%$. A study of a coronal hole as it traverses across the disk shows that the magnetic field distribution does not evolve significantly over this time, remaining stable across half a solar rotation. A moderate correlation ($r = 0.60$) between the magnetic flux imbalance and the speed of associated high speed solar wind streams ($v_{\\mathrm{HSS}}$) suggests that flux imbalance may contribute to the generation of these faster solar wind streams. These results imply that regions with higher flux imbalance ($\\Phi_{\\mathrm{imb}}$), indicative of more open magnetic field structures, present more favorable conditions for plasma acceleration as compared to closed bi-polar field, but the moderate correlation indicates that other factors may also play important roles.",
      "pdf_url": "https://arxiv.org/pdf/2602.09199.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09224",
      "title": "Characterisation of starspot structure and differential rotation of Kepler-411",
      "authors": [
        "Mikko Tuomi",
        "András Haris",
        "Thomas Hackman"
      ],
      "abstract": "Characterisation of starspot structure and differential rotation of Kepler-411 Mikko Tuomi, András Haris, Thomas Hackman About 16 pages, including the appendix. Perhaps containing processing errors. Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Starspots and their movements on stellar surfaces enable investigating the mechanisms of stellar magnetic activity. Information on the spot distribution and differential rotation provide important constraints for the behaviour of stellar magnetic dynamos. We analyse the Kepler photometry of Kepler-411, a known exoplanet host, to determine the distribution and properties of star spots on the stellar surface with two independent and complementary methods: modelling the photometric effect of rotation of spots on the stellar surface and mapping of spots by transiting planets. By constructing a spot model accounting for geometry, differential rotation and spot evolution, we model the spots of the stellar surface giving rise to the observed brightness variations. We also search for evidence for occultations of starspots in high-cadence photometry. Our spot models reproduce the observed photometric variations well and we are able to obtain information on the distribution and movement of spots on the stellar surface. We do not obtain evidence for differential rotation -- the rotational profile is consistent with rigid-body rotation with a period of 10.52$\\pm$0.34 days. We detect three occultations of spots by planet c. The positions of these spots coincide well with the positions of larger spot structures identified by our modelling of the rotational modulation of the light curve.",
      "pdf_url": "https://arxiv.org/pdf/2602.09224.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09390",
      "title": "Spectroscopic He I 1083 nm prominence eruption observations in the middle corona with MLSO/UCoMP",
      "authors": [
        "Chloe Pistelli",
        "Momchil E Molnar",
        "Giuliana de Toma",
        "Joseph Plowman"
      ],
      "abstract": "Spectroscopic He I 1083 nm prominence eruption observations in the middle corona with MLSO/UCoMP Chloe Pistelli, Momchil E Molnar, Giuliana de Toma, Joseph Plowman Submitted to Solar Physics, comments welcome Solar and Stellar Astrophysics (astro-ph.SR) Coronal mass ejections (CMEs) are a major driver of space weather as they propagate through the heliosphere. Many CMEs have associated prominence material entangled in their magnetic structure which contains cooler plasma. This cooler CME component contains significant amounts of neutral elements, which emit brightly in permitted atomic lines. It has been hypothesized that permitted transitions of neutral elements in eruptions could be used for inferring the magnetic field in CMEs, which is crucial for space weather forecasting. We present observations made with the Upgraded Coronal Multi-channel Polarimeter (UCoMP) in He I 1083 nm that clearly show the presence of neutral helium in eruptive prominences associated with CMEs as they propagate through the lower and middle corona. We find that solar prominence eruptions can be detected in He I 1083 nm observations up to the edge of the instrument field of view at about 2 solar radii, providing valuable spectral information that complements existing extreme ultraviolet and white-light coronal imaging observatories. These results illustrate the capability of UCoMP to probe the dynamic behavior of prominence eruptions, allowing for their line-of-sight velocity estimation, and potentially improving space weather forecasting by enabling earlier and more accurate identification of Earth-directed eruptions.",
      "pdf_url": "https://arxiv.org/pdf/2602.09390.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09680",
      "title": "A Deep Precursor-Dip-Main Superoutburst Sequence in VW Hydri Observed with TESS: High-Cadence Constraints on the Thermal-Tidal Instability Model",
      "authors": [
        "Bisi Bernard Ogunwale",
        "Shara Michael",
        "Avi Shporer",
        "Dafne Guetta",
        "Lev Tal-Or"
      ],
      "abstract": "A Deep Precursor-Dip-Main Superoutburst Sequence in VW Hydri Observed with TESS: High-Cadence Constraints on the Thermal-Tidal Instability Model Bisi Bernard Ogunwale, Shara Michael, Avi Shporer, Dafne Guetta, Lev Tal-Or 16 pages, 8 figures, submitted to Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR) We present 120s cadence TESS observations of three superoutbursts of the SU UMa-type dwarf nova VW Hydri. Two events (SO2 in Sectors 87+88 and SO3 in Sector 93) exhibit a pronounced, temporally pronounced precursor-dip followed by a rapid rise into the main superoutburst plateau. This morphology, previously seen in Kepler light curves of V1504 Cyg and V344 Lyr, is a key prediction of the thermal-tidal instability (TTI) model when a normal (precursor) outburst expands the disk only marginally beyond the 3:1 resonance radius, allowing the tidal instability to grow slowly and produce a deep dip approaching quiescence before rapid amplification drives the main superoutburst. A sliding-window time-frequency analysis reveals superhump power already during the decline and near minimum light, with a smooth period evolution across the dip and stabilization after the system returns to the hot state, consistent with the growth and saturation of disk eccentricity at the 3:1 resonance. From the stabilized Stage A superhump periods, we infer a representative mass ratio $q = 0.131 \\pm 0.002$. Combined with either a typical SU UMa white-dwarf mass prior or the semi-empirical donor sequence at an orbital period of 107~min, the implied component masses are $M_1 \\simeq 0.6$--$1.0\\,M_\\odot$ and $M_2 \\simeq 0.08$--$0.14\\,M_\\odot$, ruling out a brown-dwarf donor and establishing VW~Hyi as a benchmark system for testing tidal-instability models in low-$q$ dwarf novae.",
      "pdf_url": "https://arxiv.org/pdf/2602.09680.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09777",
      "title": "Characterisation of an EXor outburst SPICY 97589",
      "authors": [
        "Aaron Labdon",
        "Rik Claes"
      ],
      "abstract": "Characterisation of an EXor outburst SPICY 97589 Aaron Labdon, Rik Claes Solar and Stellar Astrophysics (astro-ph.SR) Stellar outbursts from variable or periodic accretion are thought to be ubiquitous across young stellar populations. However, relatively few outbursting objects have been discovered to date. Here, we present the characterisation of a new EXor-type episodic accretor. We aim to characterise the nature of the 2023 outburst of SPICY 97589/Gaia23bab and characterise the stellar source for the first time, while exploring how an accretion outburst contributes to disk evolution. We employ multi-waveband medium-resolution spectroscopy with UVB-VIS-NIR coverage during the peak of the 2023 outburst and the post-outburst quiescent object. The broad wavelength coverage of the dataset allows for robust measurements of the accretion rate using known line tracers. The addition of quiescent spectra provides a good estimation of stellar parameters of the central star while also informing us on the evolution of the disk during outburst phases. We find the stellar source to be a 3410\\,K, M3.0 type star with a luminosity of 0.41 $L_\\odot$ and an estimated stellar mass of 0.29 $M_\\odot$. We measure the accretion rate of SPICY 97589 to be $\\dot M = 2.38\\pm0.58\\times10^{-7}\\,\\mathrm{M_\\odot yr^{-1}}$. This value is at two orders of magnitude greater than the quiescent accretion rate. Thus, we confirm that the 2023 outburst was driven by an influx of material from the surrounding environment to the central star, an accretion outburst. The spectral fingerprint of emission lines is also characteristic of an outbursting EXor-type source, including variable disk winds.",
      "pdf_url": "https://arxiv.org/pdf/2602.09777.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09819",
      "title": "Estimating Electron Densities in the Middle Solar Corona using White-light and Radio Observations",
      "authors": [
        "Surajit Mondal",
        "Shaheda Begum Shaik",
        "Russell A. Howard",
        "Peijin Zhang",
        "Bin Chen",
        "Xingyao Chen",
        "Sijie Yu",
        "Dale Gary",
        "Marin M. Anderson",
        "Judd D. Bowman",
        "Ruby Byrne",
        "Morgan Catha",
        "Sherry Chhabra",
        "Larry D Addario",
        "Ivey Davis",
        "Jayce Dowell",
        "Gregg Hallinan",
        "Charlie Harnach",
        "Greg Hellbourg",
        "Jack Hickish",
        "Rick Hobbs",
        "David Hodge",
        "Mark Hodges",
        "Yuping Huang",
        "Andrea Isella",
        "Daniel C. Jacobs",
        "Ghislain Kemby",
        "John T. Klinefelter",
        "Matthew Kolopanis",
        "Nikita Kosogorov",
        "James Lamb",
        "Casey Law",
        "Nivedita Mahesh",
        "Brian O Donnell",
        "Corey Posner",
        "Travis Powell",
        "Vinand Prayag",
        "Andres Rizo",
        "Andrew Romero Wolf",
        "Jun Shi",
        "Greg Taylor",
        "Jordan Trim",
        "Mike Virgin",
        "Akshatha Vydula",
        "Sandy Weinreb",
        "Scott White",
        "David Woody",
        "Thomas Zentmeyer"
      ],
      "abstract": "Estimating Electron Densities in the Middle Solar Corona using White-light and Radio Observations Surajit Mondal, Shaheda Begum Shaik, Russell A. Howard, Peijin Zhang, Bin Chen, Xingyao Chen, Sijie Yu, Dale Gary, Marin M. Anderson, Judd D. Bowman, Ruby Byrne, Morgan Catha, Sherry Chhabra, Larry D Addario, Ivey Davis, Jayce Dowell, Gregg Hallinan, Charlie Harnach, Greg Hellbourg, Jack Hickish, Rick Hobbs, David Hodge, Mark Hodges, Yuping Huang, Andrea Isella, Daniel C. Jacobs, Ghislain Kemby, John T. Klinefelter, Matthew Kolopanis, Nikita Kosogorov, James Lamb, Casey Law, Nivedita Mahesh, Brian O Donnell, Corey Posner, Travis Powell, Vinand Prayag, Andres Rizo, Andrew Romero Wolf, Jun Shi, Greg Taylor, Jordan Trim, Mike Virgin, Akshatha Vydula, Sandy Weinreb, Scott White, David Woody, Thomas Zentmeyer Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) The electron density of the solar corona is a fundamental parameter in many areas of solar physics. Traditionally, routine estimates of coronal density have relied exclusively on white-light observations. However, these density estimates, obtained by inverting the white-light data, require simplifying assumptions, which may affect the robustness of the measurements. Hence, to improve the reliability of coronal density measurements, it is highly desirable to explore other complementary methods. In this study, we estimate the coronal electron densities in the middle corona, between approximately $1.7-3.5R_\\odot$, using low-frequency radio observations from the recently commissioned Long Wavelength Array at the Owens Valley Radio Observatory (OVRO-LWA). The results demonstrate consistency with those derived from white-light coronagraph data and predictions from theoretical models. We also derive a density model valid between 1.7--3.5 $r_\\odot$ and is given by $\\rho (r')=1.27r'^{-2}+29.02r'^{-4}+71.18r'^{-6}$, where $r'=r/R_\\odot$, and $r$ is the heliocentric distance. OVRO-LWA is a solar-dedicated radio interferometer that provides science-ready images with low latency, making it well-suited for generating regular and independent estimates of coronal densities to complement existing white-light techniques.",
      "pdf_url": "https://arxiv.org/pdf/2602.09819.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09835",
      "title": "Searching for rotational X-ray modulation on TIC 277539431",
      "authors": [
        "Desmond Dsouza",
        "Katja Poppenhaeger",
        "Ekaterina Ilin"
      ],
      "abstract": "Searching for rotational X-ray modulation on TIC 277539431 Desmond Dsouza, Katja Poppenhaeger, Ekaterina Ilin Astronomische Nachrichten e70085 (2026) Solar and Stellar Astrophysics (astro-ph.SR) TIC 277539431, a fast rotating M7 dwarf, was detected to host the highest latitude flare to date at $81^\\circ$. Magnetic activity like stellar flares occurring at high latitude indicate occurrence of coronal loops at these latitudes on fully-convective M dwarfs. In contrast, sunspots usually occur below $30^\\circ$. In our study we look for modulation on the X-ray signal occurring due to occultation of coronal loops by the star due to stellar rotation. We report an updated rotation period for this star as $P_{\\text{rot}}=273.593$ min based on TESS sectors 12, 37, 39, 64 and 65. We conducted $\\chi^2_{\\textrm{red}}$ fits by varying the amplitude and the phase of a sinusoidally modulated signal derived from the new rotation period. We find no evidence of rotational modulation in the X-ray signal. This could be due to multiple scenarios, such as lack of a stable coronal loop during observation or the modulated signal being too weak, however given the dataset, individual scenarios cannot be distinguished.",
      "pdf_url": "https://arxiv.org/pdf/2602.09835.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09865",
      "title": "A comparison of G-band brightness as a proxy-magnetometer in various magnetic configurations",
      "authors": [
        "Malay Shukla",
        "Sneha Pandit",
        "Nitin Yadav"
      ],
      "abstract": "A comparison of G-band brightness as a proxy-magnetometer in various magnetic configurations Malay Shukla, Sneha Pandit, Nitin Yadav accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) We investigate the diagnostic potential of the G-band at 430.4 nm for probing small-scale magnetic fields in the solar photosphere. Combining three-dimensional MHD simulations from the MURaM code and spectral synthesis via the RH 1.5D code, we evaluate the intensity contrast in the G-band filtergrams by comparing the filter centered at 430.4 nm in comparison to the conventional 430.5 nm. Our results show that filtergrams centered at 430.4 nm provide higher contrast across varying magnetic environments, particularly at narrow filter widths. This enhancement arises from its slightly higher formation height and greater sensitivity to temperature variations in magnetized regions. These findings indicate that G-band filtergrams centered at 430.4 nm show enhanced diagnostic potential under the assumptions of the present modeling. The obtained results are also relevant and suggest potential applications in stellar contexts, where molecular bands are often used as proxies for magnetic activity.",
      "pdf_url": "https://arxiv.org/pdf/2602.09865.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09925",
      "title": "A Detailed Study of the Physical and Orbital Characteristics, and Eclipse Timing Variations of the Post Common Envelope Binary DD CrB",
      "authors": [
        "Özgür Baştürk",
        "Ezgi Sertkan",
        "Furkan Akar",
        "Ulisse Munari",
        "Barış Güler",
        "Ekrem M. Esmer",
        "Selim O. Selam",
        "Ahmet C. Kutluay",
        "Marek Wolf",
        "Petr Zasche",
        "Hanna Kučáková",
        "Miloslav Zejda",
        "Özlem Şimşir"
      ],
      "abstract": "A Detailed Study of the Physical and Orbital Characteristics, and Eclipse Timing Variations of the Post Common Envelope Binary DD CrB Özgür Baştürk, Ezgi Sertkan, Furkan Akar, Ulisse Munari, Barış Güler, Ekrem M. Esmer, Selim O. Selam, Ahmet C. Kutluay, Marek Wolf, Petr Zasche, Hanna Kučáková, Miloslav Zejda, Özlem Şimşir Accepted for publication by the Monthly Notices of the Royal Astronomical Society, 18 pages, 11 figures, 5 tables Solar and Stellar Astrophysics (astro-ph.SR) We present an in-depth analysis of the eclipsing binary DD CrB, composed of a B-type subdwarf primary and an M-type main-sequence secondary, with the main goal of investigating its eclipse timing variations (ETVs). Our new multi-color photometric observations, radial velocity measurements, and precise eclipse timings from TESS allow us to constrain the system parameters. The Romer delay between primary and secondary minima yields a mass ratio of $q = 0.299 \\pm 0.009$, enabling robust simultaneous modeling of the light and radial velocity curves with {\\sc phoebe} 2.17. By fixing the albedo of the secondary to its maximum physically plausible value (A$_2 = 1.0$), despite the degeneracy between albedo, surface temperature, and radius, we obtained a satisfactory fit, resulting in a significantly lower temperature ($T_2 \\sim 2360$ K) and a radius ($R_2 \\sim 0.16$ R$_\\odot$) in agreement with literature values. Using the total mass of the components and the orbital size derived from this modeling, we interpret the ETVs and find them best explained by a Jupiter-mass tertiary companion on a $\\sim13$-year orbit in all competing models, while the eccentric (e $\\sim0.46$) models perform better in terms of fit statistics.",
      "pdf_url": "https://arxiv.org/pdf/2602.09925.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09943",
      "title": "Chromospheric Flashes in a Solar Pore: Insights from Multi-line Spectropolarimetric Diagnostics",
      "authors": [
        "Sandeep Dubey",
        "Christian Beck",
        "Rahul Yadav",
        "Tobias Felipe",
        "Shibu K Mathew"
      ],
      "abstract": "Chromospheric Flashes in a Solar Pore: Insights from Multi-line Spectropolarimetric Diagnostics Sandeep Dubey, Christian Beck, Rahul Yadav, Tobias Felipe, Shibu K Mathew The paper has been accepted for publication in ApJ. It's currently in press Solar and Stellar Astrophysics (astro-ph.SR) Solar pores are strongly magnetized regions lacking a photospheric penumbra and characterized by predominantly vertical magnetic fields. We present a multi-line study of flashes in a solar pore using high-resolution observations from the Swedish 1-m Solar Telescope in Fe~\\textsc{i}~6302~Å, Ca~\\textsc{ii}~8542~Å and K, and H-$\\beta$, complemented by (E)UV data from \\textit{IRIS} and \\textit{SDO}/AIA. Bisector analysis and spectral inversions with \\textsc{SIR} and \\textsc{NICOLE} were used to infer stratifications of temperature, line-of-sight velocity, and magnetic field. Flashes, confined to one half of the pore, exhibit cooler photospheric temperatures ($\\Delta T \\approx 400$~K), stronger magnetic fields ($\\Delta B \\approx 250$~G), larger inclinations ($\\sim25^{\\circ}$ versus $\\sim18^{\\circ}$), and persistent upflows ($\\sim0.5$~km~s$^{-1}$) compared to the quiescent pore. They are co-spatial with enhanced 3- and 5-minute power in the photosphere, while only 3-minute power persists in the chromosphere. Flashes are detected down to $\\sim50\\%$ line depth in Ca~\\textsc{ii}~8542~Å intensity and show central chromospheric upflows ($\\sim1$~km~s$^{-1}$) flanked by strong downflows ($\\sim8$~km~s$^{-1}$). Temperature enhancements reach $\\sim500$~K at $\\log\\tau \\approx -5$ and $\\sim2500$~K at $\\log\\tau \\approx -6$, with a bimodal velocity distribution. Flashes correspond one-to-one with radially outward running waves near the pore boundary (5--15~km~s$^{-1}$). Strong Ca~\\textsc{ii} core emission, occasional Stokes~$V$ reversals, and H-$\\beta$ enhancements indicate that pore flashes are confined to the lower and mid-chromosphere, with little influence on higher atmospheric layers.",
      "pdf_url": "https://arxiv.org/pdf/2602.09943.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10070",
      "title": "Gaia white dwarfs with infrared excess I. The 100 pc catalogue",
      "authors": [
        "R. Murillo-Ojeda",
        "F. M. Jiménez-Esteban",
        "A. Rebassa-Mansergas",
        "S. Torres"
      ],
      "abstract": "Gaia white dwarfs with infrared excess I. The 100 pc catalogue R. Murillo-Ojeda, F. M. Jiménez-Esteban, A. Rebassa-Mansergas, S. Torres Solar and Stellar Astrophysics (astro-ph.SR) The presence of infrared excess flux observed in white dwarfs (WDs) is related to the existence of debris disks or substellar companions. These systems provide important clues in the study of extrasolar planetary material and binary evolution. However, fully characterising their properties requires a statistically significant, complete sample. This work aims to identify a complete sample of WDs with infrared excess emission within 100 pc of the Sun. We built the spectral energy distributions (SEDs) of the WDs using synthetic photometry in 56 optical filters of the J-PAS system, generated from Gaia Data Release 3 low-resolution spectra and complemented with the latest infrared photometry available at the Virtual Observatory (VO). VOSA was used to fit the SEDs with different atmospheric WD models depending on the source spectral type. We visually checked optical and infrared images to identify contaminated photometry. We built a catalogue of 456 infrared excess WDs, of which 292 are robust identifications, and 164 are candidates. 351 ($\\sim$75%) are new identifications. This implies a fraction of infrared excess WDs between 5.9$\\pm$0.3% and 9.2$\\pm$0.4%, higher than previous works, but in agreement with some more recent estimates. Furthermore, for the sample of infrared excess WDs, the fraction of sources with non-hydrogen atmosphere increases with the Gaia GBP-GRP colour, contrary to the general WD population. However, this result should be interpreted with caution. Additionally, a thorough comparison of our catalogue with those of previous studies was performed. The sample of WDs with infrared excess emission within 100 pc presented in this work is the largest, most complete and reliable to date. Due to their proximity, they are ideal targets for follow-up studies aimed at characterising circumstellar disks, substellar companions, and the composition of accreted planetary material.",
      "pdf_url": "https://arxiv.org/pdf/2602.10070.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09422",
      "title": "The compositions of the HR 8799 planets reflect accretion of both solids and metal-enriched gas",
      "authors": [
        "Jerry W. Xuan",
        "Jean-Baptiste Ruffio",
        "Yayaati Chachan",
        "Kazumasa Ohno",
        "Aurora Y. Kesseli",
        "Ruth A. Murray-Clay",
        "Eve J. Lee",
        "Julianne I. Moses",
        "William O. Balmer",
        "Aneesh Baburaj",
        "Geoffrey A. Blake",
        "Doug Johnstone",
        "Yapeng Zhang",
        "Heather A. Knutson",
        "Dimitri Mawet",
        "Charles Beichman",
        "Klaus W. Hodapp",
        "Marshall D. Perrin",
        "Quinn M. Konopacky",
        "Michael R. Meyer",
        "Geoffrey Bryden",
        "Thomas P. Greene",
        "Jarron Leisenring",
        "Marie Ygouf",
        "Björn Benneke",
        "Julie Inglis",
        "Nicole L. Wallack"
      ],
      "abstract": "The compositions of the HR 8799 planets reflect accretion of both solids and metal-enriched gas Jerry W. Xuan, Jean-Baptiste Ruffio, Yayaati Chachan, Kazumasa Ohno, Aurora Y. Kesseli, Ruth A. Murray-Clay, Eve J. Lee, Julianne I. Moses, William O. Balmer, Aneesh Baburaj, Geoffrey A. Blake, Doug Johnstone, Yapeng Zhang, Heather A. Knutson, Dimitri Mawet, Charles Beichman, Klaus W. Hodapp, Marshall D. Perrin, Quinn M. Konopacky, Michael R. Meyer, Geoffrey Bryden, Thomas P. Greene, Jarron Leisenring, Marie Ygouf, Björn Benneke, Julie Inglis, Nicole L. Wallack Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) With four giant planets ($m\\sim5-10~M_{\\rm Jup}$, $T_\\rm{eff}\\sim900-1200$ K) orbiting between 15-70 au, HR 8799 provides an unparalleled testbed for studying giant planet formation and probing compositional trends across the protoplanetary disk. We present new JWST/NIRSpec IFU observations ($2.85-5.3~\\mu$m, $R\\approx2700$) that now include the spectrum of HR 8799 b, and higher S/N spectra for HR 8799 c, d, and e compared to that in Ruffio & Xuan et al. 2026. We detect CO, CH$_4$, H$_2$O, H$_2$S, CO$_2$, and for planet b, NH$_3$. We combine the NIRSpec spectra with $1-5 \\mu$m photometry to perform atmospheric retrievals that account for disequilibrium chemistry and clouds, and allow C/H, O/H, N/H, and S/H to scale independently. While the four planets are similarly enriched in carbon and oxygen, with C/H and O/H between $3-5\\times$ stellar, we observe a tentative trend of increasing S/H - a tracer of refractory solids - from $2-5 \\times$ stellar with increasing orbital distance. From HR 8799 b's NH$_3$ abundance, we estimate $\\rm N/H=21.2^{+16.2}_{-8.8}\\times$ stellar, suggesting the outer planet accreted significant amounts of N-rich gas. Overall, the elemental abundance patterns we observe are consistent with a picture where planet b formed between the CO snowline and the more-distant N$_2$ snowline, while the inner planets accreted $3 \\times$ stellar CO-enriched disk gas within the CO snowline. The excess volatile mass from pebble drift and evaporation implies an integrated pebble flux of $750 \\pm 200~M_{\\oplus}$. The increase in the planets' S/H with orbital distance implies more solid accretion further out, which is quantitatively compatible with expectations from both pebble and planetesimal accretion ($2 \\times$ Minimum Mass Solar Nebula) paradigms.",
      "pdf_url": "https://arxiv.org/pdf/2602.09422.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.05454",
      "title": "Time-Dependence of Subsurface Solar Convection Using the Time-Distance Deep-Focus Method",
      "authors": [
        "John T. Stefan",
        "Alexander G. Kosovichev",
        "Gustavo Guerrero",
        "Andrey M. Stejko"
      ],
      "abstract": "Time-Dependence of Subsurface Solar Convection Using the Time-Distance Deep-Focus Method John T. Stefan, Alexander G. Kosovichev, Gustavo Guerrero, Andrey M. Stejko This manuscript replaces the previous version and newly implements the common convention for the convective power. Using this convention, we find the power spectrum qualitatively agrees with the previous result, whereas the previous version of the manuscript erroneously stated convective power several orders of magnitude higher due to different power conventions Solar and Stellar Astrophysics (astro-ph.SR) We re-examine the deep-focus methodology of time-distance helioseismology previously used to estimate the power spectrum of the solar convection at a depth of about 30 Mm, which was found to be significantly weaker than predicted by theory and simulations. The Global Acoustic, Linearized Euler (GALE) and Eulerian Lagrangian (EULAG) codes are used to generate ground-truth simulations to evaluate the accuracy of the inferred convective power spectrum. This validation process shows that the power spectrum derived using the time-distance methodology diverges significantly from ground truth beyond spatial scales corresponding to the spherical harmonic degree $\\ell=15$--$30$ because of the limited resolution of helioseismic measurements at that depth. However, the power estimated at larger spatial scales ($\\ell<15$) is sufficiently accurate. We then apply the methodology to solar data selected from throughout Solar Cycle 24 and find some evidence that the magnitude of the convective power changes throughout the Cycle. An average of the convective power across the Solar Cycle reveals a spectrum that is qualitatively similar to previous estimates, though about half an order of magnitude greater. The disagreement between observations of solar convection and the magnitudes predicted by simulations persists.",
      "pdf_url": "https://arxiv.org/pdf/2505.05454.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.09268",
      "title": "Evolution of a Long-Lived Deep-Seated Main-Sequence Magnetic Field During White Dwarf Cooling",
      "authors": [
        "Matias Castro-Tapia",
        "Maria Camisassa",
        "Shu Zhang"
      ],
      "abstract": "Evolution of a Long-Lived Deep-Seated Main-Sequence Magnetic Field During White Dwarf Cooling Matias Castro-Tapia, Maria Camisassa, Shu Zhang Solar and Stellar Astrophysics (astro-ph.SR) We study the evolution of white dwarf (WD) magnetic fields that originate from core-convective dynamos during the main-sequence. Using stellar evolution and WD cooling models combined with magnetic field diffusion calculations, we demonstrate that a surviving field from the main-sequence can account for various features observed in magnetic WDs. In particular, the earlier emergence of stronger magnetic fields in more massive WDs, compared to older, less massive, and less magnetic ones, can be explained by this framework. This is because the magnetic boundary at the onset of WD cooling lies deeper in less massive WDs, resulting in a slower and weaker evolution of the surface magnetic field due to increasing electrical conductivity over time. We further show that many of the magnetic field strengths observed across different WD samples can be reproduced if the deep-seated field generated during the main sequence is comparable to predictions from magnetohydrodynamic simulations of core-convective dynamos, or if equipartition provides a valid scaling for the main-sequence dynamo. Additionally, our predictions for surface magnetic fields vary by a factor of 2 to 4 when higher-order modes of poloidal magnetic field expansion and turbulent diffusion driven by crystallization-induced convection are included. These effects should therefore be considered when investigating the origin of magnetic fields in individual WDs.",
      "pdf_url": "https://arxiv.org/pdf/2508.09268.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.16594",
      "title": "FQ Circini: An Ordinary Nova with a High-mass B1 V(n)(e) Companion Whose Decretion Disk Transfers Mass to the White Dwarf via Roche-Lobe Overflow",
      "authors": [
        "Bradley E. Schaefer",
        "Andrew Pearce",
        "Tom Love",
        "Michael M. Shara",
        "Lee Townsend",
        "Simon J. Murphy",
        "Christopher J. Corbally"
      ],
      "abstract": "FQ Circini: An Ordinary Nova with a High-mass B1 V(n)(e) Companion Whose Decretion Disk Transfers Mass to the White Dwarf via Roche-Lobe Overflow Bradley E. Schaefer (Louisiana State University), Andrew Pearce (AAVSO), Tom Love (University of Southern Queensland), Michael M. Shara (American Museum of Natural History), Lee Townsend (South African Astronomical Observatory), Simon J. Murphy (University of Southern Queensland), Christopher J. Corbally (Vatican Observatory Research Group) ApJ in press, Figure 10 is new, a good image showing how this unique system looks and works Solar and Stellar Astrophysics (astro-ph.SR) FQ Cir was an ordinary fast He/N classical nova, peaking at $V$=10.9. The pre-eruption and post-eruption counterpart was at $V$=14.0, making the smallest known classical nova amplitude of 3.1 mag. The nova light and the counterpart coincide to 0.034 arc-seconds, and the counterpart is a rare hot/blue emission-line star with flickering, so the identification of the quiescent nova is certain. The counterpart is a weak Be main sequence star, B1 V(n)(e). A coherent photometric period appears in all four {\\it TESS} Sectors and in the AAVSO post-eruption light curve, as ellipsoidal modulation with orbital period 2.041738 days. The companion must have been spun-up to a fast rotation, and like all Be stars, a decretion disk is exuded. With the constraints of the blackbody radius and the main sequence, the companion mass is 13.0$^{+0.2}_{-0.5}$ $M_{\\odot}$, with radius 6.2$\\pm$0.2 $R_{\\odot}$. This is the discovery of a cataclysmic variable with a high-mass companion, a new class that we call `High Mass Cataclysmic Variables'. The white dwarf mass is 1.25$\\pm$0.10 $M_{\\odot}$ and must have an accretion disk that supplies fuel for the nova eruption. FQ Cir represents a new mode of accretion in interacting binaries, with Roche lobe overflow from the decretion disk feeding mass into the usual accretion disk around the white dwarf, for disk-to-disk accretion. From the mass budget of the binary, the primary star must have its initial mass $>$7.6 $M_{\\odot}$, forming an ONe white dwarf, so FQ Cir can never become a Type Ia supernova.",
      "pdf_url": "https://arxiv.org/pdf/2511.16594.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16202",
      "title": "A multiwavelength ALMA view of gas and dust in binary protoplanetary system AS 205: Evidence of dust asymmetric distribution",
      "authors": [
        "Nguyen Thi Phuong",
        "Nguyen Tat Thang"
      ],
      "abstract": "A multiwavelength ALMA view of gas and dust in binary protoplanetary system AS 205: Evidence of dust asymmetric distribution Nguyen Thi Phuong, Nguyen Tat Thang Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) We present Atacama Large Millimeter/Submillimeter Array observations of multi-wavelength dust emissions at 3.1 and 1.3 mm; along with molecular line emissions of CO(2-1), CO(3-2), $^{13}$CO(3-2), and C$^{18}$O(3-2) at spatial resolutions of 7-45 AU towards the protoplanetary system AS 205. The dust emissions exhibit two distinct components of AS 205 N and AS 205 S, separated by 1.3 arcsec. While gas kinematics within the dust disk regions are dominated by Keplerian rotation, the more extended gas emission displays complex morphology and kinematics strongly affected by the binary gravitational interaction in the outer regions. The stellar masses of AS 205 N and AS 205 S are estimated at $0.78\\pm0.19$ and $1.93\\pm0.86$ M$_\\odot$, respectively. Azimuthal variation is observed in the spectral index distribution of both disks. In AS 205 N, the spectral index minimum in the southwest is coincident with the peaks of CO($2-1$), CO($3-2$), and $^{13}$CO($3-2$) integrated intensity and the relative position of its southern counterpart. On the other hand, the spectral index distribution in AS 205 S exhibits two prominent maxima, with the one in the northeast aligning with the peak of $^{13}$CO($3-2$), and the peak in the south coinciding with local maxima in CO($2-1$) and CO($3-2$) azimuthal profiles. These results suggest a correlation between dust grain size and/or optical depth with the gas distributions. Dust trapping along the spiral arms possibly contributes to the spectral index minima in AS 205 N; however, the observed asymmetry across both disks suggests the involvement of additional mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2601.16202.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.03650",
      "title": "The Tarantula massive binary monitoring VII. The nature of the eccentric O+BH binary candidate VFTS 812",
      "authors": [
        "K. Deshmukh",
        "H. Sana",
        "O. Verhamme",
        "R. Willcox",
        "P. Marchant",
        "T. Shenar",
        "F. Backs",
        "S. Janssens",
        "B. Ludwig",
        "L. Mahy",
        "J. O. Sundqvist",
        "J. I. Villaseñor"
      ],
      "abstract": "The Tarantula massive binary monitoring VII. The nature of the eccentric O+BH binary candidate VFTS 812 K. Deshmukh, H. Sana, O. Verhamme, R. Willcox, P. Marchant, T. Shenar, F. Backs, S. Janssens, B. Ludwig, L. Mahy, J. O. Sundqvist, J. I. Villaseñor 8 pages, 6 figures. Accepted in A&A Solar and Stellar Astrophysics (astro-ph.SR) Massive O-type stars ($M\\gtrsim15\\,M_\\odot$) with an X-ray quiet black hole (BH) companion represent a crucial stage in massive binary evolution leading to binary BH mergers. The population of such binaries remains elusive, with $\\lesssim5$ candidate or confirmed systems. The Tarantula nebula harbors thousands of massive stars, 2-3 % of which are expected to have BH companions. It is therefore an ideal place to hunt for such systems. Here we analyse 30 epochs of VLT/FLAMES IFU high-resolution observations of the H$\\delta$ region, as well as archival FLAMES spectroscopy, of VFTS 812, a 17-day single-lined spectroscopic binary with an O4V primary and a minimum secondary mass of $5.1\\,M_\\odot$. Following careful removal of the nebular contamination, spectral disentangling on the new data did not reveal any signature of the hidden companion. We derive $T_\\mathrm{eff}=49^{+3}_{-4}$ kK, $\\log L/L_\\odot=5.7\\pm0.1$ and $v_\\mathrm{rot,max}{\\rm \\,sin\\,}i=110^{+25}_{-35}$ km/s for the O4V component, yielding a (single star) evolutionary mass of $53^{+6}_{-5}$ $M_\\odot$ and an age in the range of 0-1.6 Myr. Using injection tests of various luminous artificial companions in our data, we exhaustively rule out the presence of any luminous signature from a main sequence star more massive than $6\\,M_\\odot$. We discuss the possible nature of the companion, suggesting that the rejuvenated O star + BH companion is the most suitable scenario to consistently explain the location, (rejuvenated) young age, eccentricity and lack of companion signature. While this establishes VFTS 812 as a strong candidate O+BH system, follow-up observations are deemed necessary for robust confirmation and to search for accretion signatures on the O4V star.",
      "pdf_url": "https://arxiv.org/pdf/2602.03650.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09126",
      "title": "An Interactive Metrics Dashboard for the Keck Observatory Archive",
      "authors": [
        "G. Bruce Berriman",
        "Min Phone Myat Zaw"
      ],
      "abstract": "An Interactive Metrics Dashboard for the Keck Observatory Archive G. Bruce Berriman, Min Phone Myat Zaw 4 pages, 2 figures, Submitted to Proc. ADASS 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Information Retrieval (cs.IR) Since 2004, the Keck Observatory Archive (KOA) has operated as a NASA-funded collaboration between the NASA Exoplanet Science Institute ( NExScI) and the W.M. Keck Observatory. It ingests and serves all data acquired by the twin 10-meter Keck telescopes on Mauna Kea, Hawaii. In the past three years, KOA has begun a modernization program to replace the architecture and systems used since the archive's creation with a new modern Python-based infrastructure. This infrastructure will position KOA to respond to the rapid growth of new and complex data sets that will be acquired by new instruments now in development, and enable follow-up to identify the deluge of alerts of transient sources expected by new survey telescopes such as the Vera C. Rubin Observatory. Since 2022, KOA has ingested new data in near-real time, generally within one minute of creation, and has made them immediately accessible to observers through a dedicated web interface. The archive is now deploying a new, scalable, Python-based, VO-compliant query infrastructure built with the Plotly-Dash framework and R-tree indices to speed-up queries by a factor of 20. The project described here exploits the new query infrastructure to develop a dashboard that will return live metrics on the performance and growth of the archive. These metrics assess the current health of the archive and guide planning future hardware and software upgrades. This single dashboard will enable, for example, monitoring of real-time ingestion, as well as studying the long-term growth of the archive. Current methods of gathering metrics that have been in place since the archive opened will not support the archive as it continues to scale. These methods suffer from high latency, are not optimized for on-demand metrics, are scattered among various tools, and are cumbersome to use.",
      "pdf_url": "https://arxiv.org/pdf/2602.09126.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.IR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09139",
      "title": "Spectral response of SPHEREx",
      "authors": [
        "Howard Hui , James J. Bock , Samuel Condon , C. Darren Dowell , Woong-Seob Jeong , Young-soo Jo , Phillip M. Korngut , Kenneth Manatt , Chi Nguyen , Hien Nguyen , Stephen Padin , Sung-Joon Park , Jeonghyun Pyo , Yujin Yang , Matthew L. N. Ashby , Yoonsoo P. Bach , Yi-Kuan Chiang , Asantha Cooray , Brendan P. Crill , Ari J. Cukierman , Andreas L. Faisst , Jae Hwan Kang , Carey M. Lisse , Daniel C. Masters , Roberta Paladini , Zafar Rustamkulov , Volker Tolls , Michael W. Werner , Michael Zemcov Department of Physics, California Institute of Technology, Jet Propulsion Laboratory, California Institute of Technology, Department of Physics, Stanford University, Korea Astronomy and Space Science Institute, University of Science, Viet Nam National University, Center for Astrophysics, Harvard-Smithsonian, Academia Sinica Institute of Astronomy and Astrophysics, Department of Physics and Astronomy, University of California Irvine, IPAC, California Insitute of Technology, Johns Hopkins University, Johns Hopkins University Applied Physics Laboratory, School of Physics and Astronomy, Rochester Institute of Technology)"
      ],
      "abstract": "Howard Hui (1 and 2), James J. Bock (1 and 2), Samuel Condon (3), C. Darren Dowell (2 and 1), Woong-Seob Jeong (4), Young-soo Jo (4), Phillip M. Korngut (1 and 2), Kenneth Manatt (2), Chi Nguyen (1), Hien Nguyen (2 and 5), Stephen Padin (1), Sung-Joon Park (4), Jeonghyun Pyo (4), Yujin Yang (4), Matthew L. N. Ashby (6), Yoonsoo P. Bach (4), Yi-Kuan Chiang (7), Asantha Cooray (8), Brendan P. Crill (2 and 1), Ari J. Cukierman (1), Andreas L. Faisst (9), Jae Hwan Kang (1), Carey M. Lisse (10 and 11), Daniel C. Masters (9), Roberta Paladini (9), Zafar Rustamkulov (9), Volker Tolls (6), Michael W. Werner (2), Michael Zemcov (12 and 2) ((1) Department of Physics, California Institute of Technology, (2) Jet Propulsion Laboratory, California Institute of Technology, (3) Department of Physics, Stanford University, (4) Korea Astronomy and Space Science Institute, (5) University of Science, Viet Nam National University, (6) Center for Astrophysics, Harvard-Smithsonian, (7) Academia Sinica Institute of Astronomy and Astrophysics, (8) Department of Physics and Astronomy, University of California Irvine, (9) IPAC, California Insitute of Technology, (10) Johns Hopkins University, (11) Johns Hopkins University Applied Physics Laboratory, (12) School of Physics and Astronomy, Rochester Institute of Technology) Instrumentation and Methods for Astrophysics (astro-ph.IM) The Spectro Photometer for the History of the Universe, Epoch of Reionization, and Ices Explorer (SPHEREx) is conducting the first all-sky near infrared spectral survey spanning 0.75 to 5.0um with resolving power R~35 to 130. Linear variable filters mounted in front of six H2RG detectors produce a position dependent spectral response across the focal plane. This paper presents the ground-based spectral calibration of SPHEREx, including the cryogenic apparatus, optical configuration, measurement strategy, analysis pipeline, and resulting calibration products. Monochromatic wavelength scans are used to derive the spectral response function, band center, and resolving power for every pixel. Band centers are measured to better than 1nm for Bands 1 through 4 (0.75 to 3.82um) and better than 10nm for Bands 5 and 6 (3.82 to 5.0um). Out-of-band leakage is negligible for detectors above 1.64um and is present at the percent level below this wavelength. The resolving power is measured to within 5% and agrees with design expectations to within 10%. An on-sky spectrum of the Cat's Eye Nebula (NGC 6543) constructed from repeated observations provides in-flight verification and shows agreement between ground calibrated response and astrophysical emission features. Calibration products, including per-pixel band center and resolving power maps, are released through IPAC to support community use of SPHEREx data. The absolute spectral calibration will continue to improve through in-flight measurements, with further reductions in uncertainty expected for the longest-wavelength bands.",
      "pdf_url": "https://arxiv.org/pdf/2602.09139.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09223",
      "title": "astromorph: Self-supervised machine learning pipeline for astronomical morphology analysis",
      "authors": [
        "Per Bjerkeli",
        "Jouni Kainulainen",
        "Maria Carmen Toribio",
        "Leon Boschman",
        "Otoniel Maya Lucas"
      ],
      "abstract": "astromorph: Self-supervised machine learning pipeline for astronomical morphology analysis Per Bjerkeli, Jouni Kainulainen, Maria Carmen Toribio, Leon Boschman, Otoniel Maya Lucas Instrumentation and Methods for Astrophysics (astro-ph.IM) Modern telescopes generate increasingly large and diverse datasets, often consisting of complex and morphologically rich structures. To efficiently explore such data requires automated methods that can extract and organize physically meaningful information, ideally without the need for extensive manual interaction. We aim to provide a user-friendly implementation of a self-supervised machine learning framework to explore morphological properties of large datasets, based on the BYOL (Bootstrap Your Own Latents) method. By enabling the generation of meaningful image embeddings without manually labelled data, the framework will enable key tasks such as clustering, anomaly detection, and similarity based exploration. In contrast to existing BYOL implementations, astromorph accommodates data of varying dimensions and resolutions, including both single-channel FITS images and multi-channel spectral cubes. The package is built with usability in mind, offering streamlined pipeline scripts for ease of use as well as deeper customization options via PyTorch-based classes. To demonstrate the utility of astromorph, we apply it in two contrasting science cases representing different astronomical domains: images of protoplanetary disks observed with ALMA, and infrared dark clouds observed with Spitzer and Herschel. In both cases, we demonstrate how astromorph produces scientifically meaningful embeddings that capture morphological differences and similarities across large samples. astromorph enables users to apply a robust, label-free approach for uncovering morphological patterns in astronomical datasets. The successful application to two markedly different datasets suggest that the pipeline is broadly applicable across a wide range of imaging-rich astronomical context, providing a user friendly tool for advancing discovery in observational astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2602.09223.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09513",
      "title": "A new strategy for achieving multiple continuous cooling stages in an adiabatic demagnetization refrigerator",
      "authors": [
        "Yanan Li",
        "Ke Li",
        "Teng Pan",
        "Yaxuan Wang",
        "Wei Dai"
      ],
      "abstract": "A new strategy for achieving multiple continuous cooling stages in an adiabatic demagnetization refrigerator Yanan Li, Ke Li, Teng Pan, Yaxuan Wang, Wei Dai Instrumentation and Methods for Astrophysics (astro-ph.IM) This paper presents a three-stage continuous adiabatic demagnetization refrigerator (CADR) simultaneously providing cooling platforms at two different temperatures. Unlike conventional CADR with two continuous stages, this system does not require an extra continuous stage. It is achieved with carefully designed heat switch operations and stage sequences. This new strategy significantly reduces system complexity and mass. The detailed implementation of the two cooling platforms is described, and factors limiting system performance are analyzed. This CADR system has achieved a cooling power of 20 {\\mu}W@1 K and 4 {\\mu}W@300 mK simultaneously, offering a new design strategy for the development of CADR with multiple continuous stages.",
      "pdf_url": "https://arxiv.org/pdf/2602.09513.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09670",
      "title": "Talking with the Latents -- how to convert your LLM into an astronomer",
      "authors": [
        "Ilay Kamai",
        "Marc-Huertas Company",
        "Mike J. Smith",
        "Hagai B. Perets"
      ],
      "abstract": "Talking with the Latents -- how to convert your LLM into an astronomer Ilay Kamai, Marc-Huertas Company, Mike J. Smith, Hagai B. Perets Instrumentation and Methods for Astrophysics (astro-ph.IM) Recent advances in Large Language Models (LLMs) offer unique opportunities for scientific tasks, yet their ability to reason over complex numerical data remains largely unexplored. We propose a simple mechanism to introduce domain-specific physical knowledge into LLMs by fusing pre-trained latent physical features with a pre-trained language model. Our method employs a teacher-student knowledge distillation framework where a large LLM (teacher) generates synthetic question-answer supervision to transfer physical reasoning to a smaller LLM (student). The student is conditioned on latent physical features and trained via a lightweight adapter and Low-Rank Adaptation (LoRA). We demonstrate that this approach, applied to models with 1B, 8B, and 32B parameters, enables effective reasoning over real scientific data. Our models substantially outperform strong baselines, such as Gemini 3 Pro, across multiple downstream tasks without task-specific fine-tuning. We show that the model combines latent information with general physical understanding to predict complex properties and can be \"steered\" by identifying physically meaningful directions in the latent space. This allows for explicit physical manipulation and natural language interpretation of latent structures. While our experiments focus on astrophysics, the framework is domain-agnostic and applicable to various scientific fields. Our main contribution is a general framework for using LLMs as interpretable interfaces to scientific latent spaces, enabling a single model to perform diverse tasks through natural language guidance. This work marks a step toward developing scientifically capable and useful LLMs.",
      "pdf_url": "https://arxiv.org/pdf/2602.09670.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09828",
      "title": "The Pollux European instrument concept for HWO: a high-resolution spectrograph and spectropolarimeter from the far-UV to the near-IR",
      "authors": [
        "Coralie Neiner",
        "Jean-Claude Bouret",
        "Luca Fossati",
        "David le Mignant",
        "Eduard Muslimov",
        "Ana Ines Gomez de Castro",
        "Frédéric Marin"
      ],
      "abstract": "The Pollux European instrument concept for HWO: a high-resolution spectrograph and spectropolarimeter from the far-UV to the near-IR Coralie Neiner, Jean-Claude Bouret, Luca Fossati, David le Mignant, Eduard Muslimov, Ana Ines Gomez de Castro, Frédéric Marin HWO2025 symposium held in Washington in July 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM) Pollux is a high-resolution spectrograph and spectropolarimeter working from 100 nm to 1.8 microns proposed for HWO by a European consortium. Pollux will allow us to study stellar and (exo)planetary systems, as well as cosmic ecosystems. For example, Pollux will provide new insights on exoplanet formation and evolution, characterization of the atmospheres and magnetospheres of stars and planets, and star-planet interactions. It will also allow us to resolve narrow UV emission and absorption lines, enabling us to follow the baryon cycle over cosmic time -- from galaxies forming stars out of interstellar gas and grains, and planets forming in circumstellar disks, to the various forms of feedback into the interstellar and intergalactic medium -- and from active galactic nuclei. The most innovative characteristic of Pollux is its unique spectropolarimetric capability in the UV, which will open a new parameter space. Its very high spectral resolution (~70000 to ~100000) and stability over a very large wavelength range will also be a major asset. In this paper, we summarize the main scientific drivers of Pollux and present its current design, technological challenges, and the Pollux consortium organization.",
      "pdf_url": "https://arxiv.org/pdf/2602.09828.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09917",
      "title": "Reference File Updates Following the Application of New Geometric Distortion and Walk Corrections I: Overview",
      "authors": [
        "Nick Indriolo",
        "William J. Fischer",
        "Elaine Frazer",
        "David French",
        "Sten Hasselquist",
        "Jaquline Hernandez",
        "Christian I. Johnson",
        "Darshan Kakkad",
        "Lauren P. Miller",
        "Marc Rafelski",
        "Ravi Sankrit"
      ],
      "abstract": "Reference File Updates Following the Application of New Geometric Distortion and Walk Corrections I: Overview Nick Indriolo, William J. Fischer, Elaine Frazer, David French, Sten Hasselquist, Jaquline Hernandez, Christian I. Johnson, Darshan Kakkad, Lauren P. Miller, Marc Rafelski, Ravi Sankrit Instrumentation and Methods for Astrophysics (astro-ph.IM) The calibration of Cosmic Origins Spectrograph (COS) data is performed by the data processing pipeline known as CalCOS. CalCOS utilizes several reference files that store information required for data processing (e.g., dispersion solutions), and these reference files can be updated for the purpose of improving calibrated data products. In 2024 a major effort to improve the far-ultraviolet (FUV) geometric distortion, delta-geometric, and walk corrections was completed. Those three corrections occur early in the CalCOS workflow and shift photon events into the corrected reference frame ((XCORR, YCORR) coordinate system) in which subsequent calibration steps-and their reference files-are defined. This change necessitated the re-derivation of all \"downstream\" reference files in use at the time. Here we summarize the effort to create new versions of 56 reference files applicable to lifetime positions 1 through 6 and intended for use with the new geometric distortion, delta geometric, and walk corrections. The primary outcome of this work is improved wavelength and flux calibrations for COS FUV spectra.",
      "pdf_url": "https://arxiv.org/pdf/2602.09917.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10040",
      "title": "Operational Mass Measurement for Flyby Reconnaissance Missions of Potentially Hazardous Asteroid",
      "authors": [
        "Justin A. Atchison",
        "Gael Cascioli",
        "Anivid Pedros-Faura",
        "Erwan Mazarico",
        "Rylie A. Bull",
        "Jay McMahon",
        "Evan J. Smith",
        "Daniel R. Cremons"
      ],
      "abstract": "Operational Mass Measurement for Flyby Reconnaissance Missions of Potentially Hazardous Asteroid Justin A. Atchison, Gael Cascioli, Anivid Pedros-Faura, Erwan Mazarico, Rylie A. Bull, Jay McMahon, Evan J. Smith, Daniel R. Cremons Submitted to the Journal of the Astronautical Sciences Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) This study evaluates a technique for determining the mass of a potentially hazardous asteroid from a high-speed flyby in the context of a rapid reconnaissance planetary defense scenario. We consider a host spacecraft that dispenses a small CubeSat, which acts as a test-mass. Both spacecraft perform approach maneuvers to target their flyby locations, with the host targeting a close proximity flyby and the CubeSat targeting a distant flyby. By incorporating short-range intersatellite measurements between the host and the CubeSat, the mass measurement sensitivity is substantially improved. We evaluate a set of proposed host and CubeSat hardware options against the 2023 and 2025 Planetary Defense Conference hypothetical threats, as well as a hypothetical flyby of 2024 YR4. These scenarios differ predominantly in their flyby speeds, which span from 1.7 to 22 km/s. Based on these scenarios, we demonstrate that a typical radio-frequency intersatellite measurement is ineffective for asteroids with diameters relevant to planetary defense (i.e., 50 - 500 m). However, we find that augmenting the system with a laser-based intersatellite ranging system or a high-precision Doppler system can enable mass measurements of asteroids as small as 100 m across all cases, and as small as 50 m for the slower (< 8 km/s) cases. The results are very sensitive to the timing of the final maneuver, which is used to target the low-altitude flyby point. This presents an operational challenge for the smallest objects, where optical detection times are comparatively late and the optical navigation targeting knowledge converges too slowly.",
      "pdf_url": "https://arxiv.org/pdf/2602.10040.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09553",
      "title": "A Narrowband Technosignature Search Toward the Hycean Candidate K2-18b Using the VLA and MeerKAT",
      "authors": [
        "C. D. Tremblay",
        "S. Chaudhary",
        "Megan G. Li",
        "Sofia Z. Sheikh",
        "T. Myburgh",
        "D. Czech",
        "D. E. MacMahon",
        "P. B. Demorest",
        "R. A. Donnachie",
        "A. P. V. Siemion",
        "V. Gajjar",
        "M. Lebofsky",
        "K. Wandia",
        "K. I. Perez.",
        "Nikku Madhusudhan"
      ],
      "abstract": "A Narrowband Technosignature Search Toward the Hycean Candidate K2-18b Using the VLA and MeerKAT C. D. Tremblay, S. Chaudhary, Megan G. Li, Sofia Z. Sheikh, T. Myburgh, D. Czech, D. E. MacMahon, P. B. Demorest, R. A. Donnachie, A. P. V. Siemion, V. Gajjar, M. Lebofsky, K. Wandia, K. I. Perez., Nikku Madhusudhan Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) K2-18b, a sub-Neptune exoplanet located in the habitable zone of its host star, has emerged as an important target for atmospheric characterization and assessments of potential habitability. Motivated by recent interpretations of JWST observations suggesting a hydrogen-rich atmosphere consistent with Hycean-world scenarios, we conducted a coordinated, multi-epoch search for narrowband radio technosignatures using the Karl G. Jansky Very Large Array equipped with the COSMIC backend and the MeerKAT telescope with the BLUSE backend. Our observations span frequencies from 544MHz to 9.8GHz and include multiple epochs that cover at least one full orbital period of the planet. In this work, we outline, create, and apply a comprehensive post-processing framework that incorporates observatory-informed RFI masking, drift-rate filtering based on the expected dynamics of the K2-18 system, multibeam spatial discrimination, primary and secondary transit filtering (when applicable), and SNR-based excision of weak and strong spurious signals. Across all bands and epochs, no signals consistent with an astrophysical or artificial origin were identified at a limit of 10^12 to 10^13W. These non-detections allow us to place upper limits on the presence of persistent, isotropic narrowband transmitters within the K2-18 system, providing the first interferometric technosignature constraints for a Hycean-planet candidate. Our results demonstrate the efficacy of coordinated multiepoch interferometric searches and establish a methodological framework for future technosignature studies of nearby potentially habitable exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2602.09553.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22399",
      "title": "Space AI: Leveraging Artificial Intelligence for Space to Improve Life on Earth",
      "authors": [
        "Ziyang Wang"
      ],
      "abstract": "Space AI: Leveraging Artificial Intelligence for Space to Improve Life on Earth Ziyang Wang Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI); Space Physics (physics.space-ph) Artificial Intelligence (AI) is transforming domains from healthcare and agriculture to finance and industry. As progress on Earth meets growing constraints, the next frontier is outer space, where AI can enable autonomous, resilient operations under extreme uncertainty and limited human oversight. This paper introduces Space AI as a unified interdisciplinary field at the intersection of artificial intelligence and space science and technology. We consolidate historical developments and contemporary progress, and propose a systematic framework that organises Space AI into four mission contexts: 1 AI on Earth, covering intelligent mission planning, spacecraft design optimisation, simulation, and ground-based data analytics; 2 AI in Orbit, focusing on satellite and station autonomy, space robotics, on-board/near-real-time data processing, communication optimisation, and orbital safety; 3 AI in Deep Space, enabling autonomous navigation, adaptive scientific discovery, resource mapping, and long-duration human-AI collaboration under communication constraints; and 4 AI for Multi-Planetary Life, supporting in-situ resource utilisation, habitat and infrastructure construction, life-support and ecological management, and resilient interplanetary networks. Ultimately, Space AI can accelerate humanity's capability to explore and operate in space, while translating advances in sensing, robotics, optimisation, and trustworthy AI into broad societal impact on Earth.",
      "pdf_url": "https://arxiv.org/pdf/2512.22399.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.18300",
      "title": "The Atacama Cosmology Telescope: Release of A databaSe of millimeTeR ObservatioNs of Asteroids Using acT (ASTRONAUT)",
      "authors": [
        "Ricco C. Venterea",
        "John Orlowski-Scherer",
        "Nicholas Battaglia",
        "Sigurd Naess",
        "Steve K. Choi",
        "Allen Foster",
        "Joseph Golec",
        "Bruce Patridge",
        "Cristóbal Sifón",
        "Edward J. Wollack"
      ],
      "abstract": "The Atacama Cosmology Telescope: Release of A databaSe of millimeTeR ObservatioNs of Asteroids Using acT (ASTRONAUT) Ricco C. Venterea, John Orlowski-Scherer, Nicholas Battaglia, Sigurd Naess, Steve K. Choi, Allen Foster, Joseph Golec, Bruce Patridge, Cristóbal Sifón, Edward J. Wollack 7 pages, 2 figures, 2 tables, submitted to ApJS Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present A databaSe of millimeTeR ObservatioNs of Asteroids Using acT (ASTRONAUT) hosted on Amazon Web Services, Inc. (AWS) in the form of a public Amazon Simple Storage Service (S3) bucket. This bucket is an Amazon cloud storage database containing flux measurements for a group of asteroids at millimeter (mm) wavelengths. These measurements were collected by the Atacama Cosmology Telescope (ACT) from 2017 to 2021 in frequency bands centered near 90, 150, and 220 GHz. The ASTRONAUT database contains observation times, normalized flux values, and associated error bars for 170 asteroids above a signal-to-noise ratio of 5 for a single frequency band over the stacked co-added maps. We provide an example in generating light curves with this database. We also present a Jupyter notebook to serve as a reference guide when using the S3 bucket. The container and notebook are publicly available in a GitHub repository.",
      "pdf_url": "https://arxiv.org/pdf/2508.18300.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.15913",
      "title": "ExoIris: fast exoplanet transmission spectroscopy in Python",
      "authors": [
        "Hannu Parviainen"
      ],
      "abstract": "ExoIris: fast exoplanet transmission spectroscopy in Python Hannu Parviainen Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) I present ExoIris, a user-friendly Python package for exoplanet transmission and emission spectroscopy. Unlike existing tools, ExoIris models two-dimensional spectrophotometric transit time series directly and supports the joint analysis of multiple datasets obtained with different instruments and at different epochs, as well as modeling stellar spot crossings and the influence of unocculted heterogeneities (the transit light source effect). These features enable a self-consistent estimation of both wavelength-independent and wavelength-dependent parameters. They offer a more robust workflow than the commonly used two-step approach, in which a \"white\" light curve is fitted first, and the transmission spectrum is then derived from independent fits constrained by the white-light solution. Despite its increased flexibility and robustness, ExoIris remains computationally efficient. A low-resolution transmission spectrum can be estimated from a single JWST NIRISS transit observation in ~5 minutes assuming white noise, and in ~15 minutes when accounting for time-correlated systematics using a Gaussian process noise model, on a standard desktop computer.",
      "pdf_url": "https://arxiv.org/pdf/2509.15913.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.08432",
      "title": "NovaMoon: A Strategic Lunar Reference Station for Positioning, Timing, and Largely Enhanced Science in the Earth-Moon System",
      "authors": [
        "Serena Molli",
        "Agnès Fienga",
        "Pascale Defraigne",
        "Krzysztof Sośnica",
        "Luigi Cacciapuoti",
        "Luca Porcelli",
        "Lotfi Massarweh",
        "Sara Bruni",
        "Riccardo Pozzobon",
        "Albert Roura",
        "Francesco Vespe",
        "Diego Blas",
        "Ozgur Karatekin",
        "Yoann Audet",
        "Floor Melman",
        "Richard Swinden",
        "Javier Ventura-Traveset",
        "Olivier Alibart",
        "Marie-Christine Angonin",
        "Daniel Arnold",
        "Ruth Bamford",
        "Emmanuele Battista",
        "Marco Belloni",
        "J.C. Berton",
        "Orfeu Bertolami",
        "Mathis Bloßfeld",
        "Adrien Bourgoin",
        "Giada Bargiacchi",
        "Salvatore Buoninfante",
        "Nicolò Burzillà",
        "Roberto Campagnola",
        "Paolo Cappuccio",
        "Salvatore Capozziello",
        "Giuseppe Cimò",
        "Clément Courde",
        "Rolf Dach",
        "Mario Siciliani de Cumis",
        "Simone Dell'Agnello",
        "Fabrizio De Marchi",
        "Valentina Galluzzi",
        "Francesco Gini",
        "Philipp Glaeser",
        "Klaus Gwinner",
        "Alex Guinard",
        "Rüdiger Haas",
        "Aurélien Hees",
        "Hauke Hussmann",
        "Luciano Iess",
        "Alexander C. Jenkins",
        "Siddarth K. Joshi",
        "Maria Karbon",
        "Sergei Klioner",
        "Kaisa Laiho",
        "Christophe Le Poncin-Lafitte",
        "Marco Lucente",
        "David Lucchesi",
        "Riccardo March",
        "Lucia McCallum",
        "Jürgen Müller",
        "Weijie Nie",
        "Jillian Oduber",
        "Roberto Peron",
        "Francesco Picciariello",
        "Théo Pichavant",
        "Michael Plumaris",
        "Eleonora Polini",
        "Ana-Catalina Plesa",
        "Dimitrios Psychas",
        "Bernardino Quaranta",
        "Nicolas Rambaux",
        "Marc Rovira-Navarro",
        "Francesco Santoli",
        "Matthias Schartner",
        "Florian Seitz",
        "Ilaria Sesia",
        "Yan Seyffert",
        "Stefano Speretta",
        "Tim Springer",
        "Giuseppe Vallone",
        "Paolo Villoresi",
        "Sebastien Vincent-Bonnieu",
        "Ben Wadsworth",
        "Pierre Waller",
        "Radosław Zajdel",
        "Erik Schoenemann"
      ],
      "abstract": "NovaMoon: A Strategic Lunar Reference Station for Positioning, Timing, and Largely Enhanced Science in the Earth-Moon System Serena Molli, Agnès Fienga, Pascale Defraigne, Krzysztof Sośnica, Luigi Cacciapuoti, Luca Porcelli, Lotfi Massarweh, Sara Bruni, Riccardo Pozzobon, Albert Roura, Francesco Vespe, Diego Blas, Ozgur Karatekin, Yoann Audet, Floor Melman, Richard Swinden, Javier Ventura-Traveset, Olivier Alibart, Marie-Christine Angonin, Daniel Arnold, Ruth Bamford, Emmanuele Battista, Marco Belloni, J.C. Berton, Orfeu Bertolami, Mathis Bloßfeld, Adrien Bourgoin, Giada Bargiacchi, Salvatore Buoninfante, Nicolò Burzillà, Roberto Campagnola, Paolo Cappuccio, Salvatore Capozziello, Giuseppe Cimò, Clément Courde, Rolf Dach, Mario Siciliani de Cumis, Simone Dell'Agnello, Fabrizio De Marchi, Valentina Galluzzi, Francesco Gini, Philipp Glaeser, Klaus Gwinner, Alex Guinard, Rüdiger Haas, Aurélien Hees, Hauke Hussmann, Luciano Iess, Alexander C. Jenkins, Siddarth K. Joshi, Maria Karbon, Sergei Klioner, Kaisa Laiho, Christophe Le Poncin-Lafitte, Marco Lucente, David Lucchesi, Riccardo March, Lucia McCallum, Jürgen Müller, Weijie Nie, Jillian Oduber, Roberto Peron, Francesco Picciariello, Théo Pichavant, Michael Plumaris, Eleonora Polini, Ana-Catalina Plesa, Dimitrios Psychas, Bernardino Quaranta, Nicolas Rambaux, Marc Rovira-Navarro, Francesco Santoli, Matthias Schartner, Florian Seitz, Ilaria Sesia, Yan Seyffert, Stefano Speretta, Tim Springer, Giuseppe Vallone, Paolo Villoresi, Sebastien Vincent-Bonnieu, Ben Wadsworth, Pierre Waller, Radosław Zajdel, Erik Schoenemann This manuscript is a preprint and has not yet been peer reviewed. It is currently under review at Space Science Reviews Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The renewed interest in lunar exploration and the development of future lunar communication and navigation services highlight the need for a precise, stable, and interoperable geodetic and timing infrastructure on the Moon. NovaMoon, proposed as a scientific and navigation payload for ESA's Argonaut lander, is designed as a lunar-based local differential, geodetic, and timing station supporting both operational needs in the Moon's south polar region and a broad range of scientific investigations. The payload integrates a lunar laser retroreflector, a Very Long Baseline Interferometry transmitter, a receiver for navigation signals compatible with LunaNet standards, high-stability atomic clocks, and direct-to-Earth radio links -- making it the first lunar station to co-locate multiple ranging, tracking, and timing techniques. NovaMoon will enable sub-metre to decimetre positioning, provide local differential corrections for lunar users, and ensure an accurate and stable realisation of position and time. Preliminary simulation studies show that this multi-technique dataset improves the lunar reference frame, orientation and ephemerides, and estimates of interior parameters like tidal response and core properties. NovaMoon will also provide the first long-duration physical realisation of a lunar time reference. Beyond its primary goals, it supports improved cartography, precise surface geolocation, and higher-resolution topography, contributing to safer landings and operations. It also enables new tests of fundamental physics, including constraints on relativity and possible deviations from classical gravity.",
      "pdf_url": "https://arxiv.org/pdf/2602.08432.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09129",
      "title": "Limits on the Post-eclipse Emission Spectrum of HD 80606 b From High-Resolution Spectroscop",
      "authors": [
        "Luke Finnerty",
        "Aurora Kesseli",
        "Kyle Pearson",
        "Charles Beichman",
        "Michael P. Fitzgerald"
      ],
      "abstract": "Limits on the Post-eclipse Emission Spectrum of HD 80606 b From High-Resolution Spectroscop Luke Finnerty, Aurora Kesseli, Kyle Pearson, Charles Beichman, Michael P. Fitzgerald 21 pages, 11 figures, 3 tables, accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP) We present Keck/NIRSPEC $K$-band observations of HD 80606 b, one of the most eccentric known exoplanets. HD 80606 b was observed after secondary eclipse, close to periastron, when the planet passes within 0.03 AU of HD 80606 and the rapid heating of the atmosphere may lead to extreme chemical changes and a temporary thermal inversion. The rapid change in the planetary radial velocity near periastron is sufficient to enable high-resolution cross-correlation spectroscopy (HRCCS) analysis, which produces a tentative detection ($\\rm SNR\\sim4$) of HD 80606 b. Injection-recovery tests appear to reject strong thermal inversions near periastron, consistent with recent results from JWST. We also perform atmospheric retrievals with free parameters for the Pressure-Temperature ($P-T$) profile and with a profile matched to the JWST results, which suggest the presence of absorption features from CH$_4$ and CO. While HD 80606 b is not definitively detected in these data, these results are consistent with JWST observations, which found the post-eclipse atmosphere of HD 80606 b shows weak absorption features from these species. Future observations with higher spectral resolution and/or wider wavelength coverage are needed for a confident atmospheric detection of HD 80606 b via high-resolution spectroscopy alone, but such observations are a challenge to schedule due to the 111-day orbital period.",
      "pdf_url": "https://arxiv.org/pdf/2602.09129.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09281",
      "title": "Origin of Hyperion and Saturn's Rings in A Two-Stage Saturnian System Instability",
      "authors": [
        "Matija Ćuk",
        "Maryame El Moutamid",
        "Jim Fuller",
        "Valéry Lainey"
      ],
      "abstract": "Origin of Hyperion and Saturn's Rings in A Two-Stage Saturnian System Instability Matija Ćuk, Maryame El Moutamid, Jim Fuller, Valéry Lainey Earth and Planetary Astrophysics (astro-ph.EP) The age of the rings and some of the moons of Saturn is an open question, and multiple lines of evidence point to a recent (few hundred Myr ago) cataclysm involving disruption of past moons. The main driver of the evolution of the Saturnian system is the relatively rapid tidal expansion of its largest moon, Titan, which is likely driven by resonant tides within Saturn. The obliquity of Saturn and the orbit of the small moon Hyperion both serve as a record of the past orbital evolution of Titan. Saturn's obliquity was likely generated by a secular spin-orbit resonance with the planets, while Hyperion is caught in a mean-motion resonance with Titan, with both phenomena driven by Titan's orbital expansion. We propose that the breaking of Saturn's spin resonance was also the event in which Hyperion formed, when an outer mid-sized satellite (``Proto-Hyperion'') was destabilized and collided with Titan, with some of the debris accreting into Hyperion. During the instability Proto-Hyperion's perturbations produced the observed orbital inclination of Iapetus. The same event also excited the eccentricity of Titan, which then, through Titan's resonant interaction with the inner moons, led to destabilization, collisional disruption and re-accretion of the inner moon system, including the rings. We present numerical integrations that show that this chain of events has a relatively high probability, and discuss how it fits within our knowledge of the Saturnian system.",
      "pdf_url": "https://arxiv.org/pdf/2602.09281.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.09601",
      "title": "Comet 73P/Schwassmann-Wachmann 3's Dust Trail as a Source of Pickup Ions",
      "authors": [
        "Samuel R. Grant",
        "Geraint H. Jones",
        "Antoinette B. Galvin"
      ],
      "abstract": "Comet 73P/Schwassmann-Wachmann 3's Dust Trail as a Source of Pickup Ions Samuel R. Grant, Geraint H. Jones, Antoinette B. Galvin Earth and Planetary Astrophysics (astro-ph.EP) 73P/Schwassmann-Wachmann 3 is a short-period comet that has undergone multiple fragmentation events in the last few decades. During May-June 2006, while passing near Earth, multiple fragments of comet 73P passed sunward of Sun-Earth Lagrange Point 1, while cometary pickup ions were detected concurrently by instruments on both the ACE and Wind spacecraft, implying the crossing of one or more ion tail. Additionally, during August 2011, a fragment of 73P passed directly sunward of spacecraft STEREO-B. A detection of cometary ions is shown to originate at fragment 73P-AM. Solar wind velocity measurements are used to extrapolate the flow of the solar wind in 3 dimensions and, when compared with the positions of known comets and cometary fragments, estimate the separation between the cometary ion tail and the spacecraft. Using this technique, it is shown that the alignment of the major cometary fragments with the spacecraft was poor for the transport of cometary ions via the solar wind, but the encounter was near enough for immersion in the diffuse ion tail surrounding an extended dust trail within which the nucleus fragments reside. This implies that, at this distance, the extended trail of cometary debris was a significant source of cometary ions in the case of comet 73P.",
      "pdf_url": "https://arxiv.org/pdf/2602.09601.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.06966",
      "title": "GEMS JWST: Transmission spectroscopy of TOI-5205b reveals significant stellar contamination and a metal-poor atmosphere",
      "authors": [
        "Caleb I. Cañas",
        "Jacob Lustig-Yaeger",
        "Shang-Min Tsai",
        "Simon Müller",
        "Ravit Helled",
        "Dana R. Louie",
        "Giannina Guzmán Caloca",
        "Shubham Kanodia",
        "Peter Gao",
        "Jessica Libby-Roberts",
        "Kevin K. Hardegree-Ullman",
        "Knicole D. Colón",
        "Ian Czekala",
        "Megan Delamer",
        "Te Han",
        "Andrea S.J. Lin",
        "Suvrath Mahadevan",
        "Erin M. May",
        "Joe P. Ninan",
        "Anjali A. A. Piette",
        "Guðmundur Stefánsson",
        "Kevin B. Stevenson",
        "Johanna Teske",
        "Nicole L. Wallack"
      ],
      "abstract": "GEMS JWST: Transmission spectroscopy of TOI-5205b reveals significant stellar contamination and a metal-poor atmosphere Caleb I. Cañas, Jacob Lustig-Yaeger, Shang-Min Tsai, Simon Müller, Ravit Helled, Dana R. Louie, Giannina Guzmán Caloca, Shubham Kanodia, Peter Gao, Jessica Libby-Roberts, Kevin K. Hardegree-Ullman, Knicole D. Colón, Ian Czekala, Megan Delamer, Te Han, Andrea S.J. Lin, Suvrath Mahadevan, Erin M. May, Joe P. Ninan, Anjali A. A. Piette, Guðmundur Stefánsson, Kevin B. Stevenson, Johanna Teske, Nicole L. Wallack 29 pages + appendix, 23 figures including 6 figure sets, 13 tables, data behind the figures will appear in journal, accepted for publication in AJ. Updates from first version: improvements to the spot fitting and associated retrievals Earth and Planetary Astrophysics (astro-ph.EP) Recent discoveries of transiting giant exoplanets around M dwarfs (GEMS) present an opportunity to investigate their atmospheric compositions and explore how such massive planets can form around low-mass stars contrary to canonical formation models. Here, we present the first transmission spectra of TOI-5205b, a short-period ($P=1.63~\\mathrm{days}$) Jupiter-like planet ($M_p=1.08~\\mathrm{M_J}$ and $R_p=0.94~\\mathrm{R_J}$) orbiting an M4 dwarf. We obtained three transits using the PRISM mode of the JWST Near Infrared Spectrograph (NIRSpec) spanning $0.6-5.3$ um. Our data reveal significant stellar contamination that is evident in the light curves as spot-crossing events and in the transmission spectra as a larger transit depth at bluer wavelengths. Atmospheric retrievals demonstrate that stellar contamination from unocculted star spots is the dominant component of the transmission spectrum at wavelengths $\\lambda\\lesssim3.0$ um, which reduced the sensitivity to the presence of clouds or hazes in our models. The degree of stellar contamination also prevented the definitive detection of any $\\mathrm{H_2O}$, which has primary absorption features at these shorter wavelengths. The broad wavelength coverage of NIRSpec PRISM enabled a robust detection of $\\mathrm{CH_4}$ and $\\mathrm{H_2S}$, which have detectable molecular features between $3.0-5.0$ um. Our gridded and Bayesian retrievals consistently favored an atmosphere with both sub-solar metallicity ($\\log\\mathrm{[M/H]}\\sim-2$ for a clear atmosphere) and super-solar C/O ratio ($\\log\\mathrm{[C/O]}\\sim3$ for a clear or cloudy atmosphere). This contrasts with estimates from planetary interior models that predict a bulk metallicity of 10--20%, which is $\\sim100\\times$ the atmospheric metallicity, and suggests that the planetary interior for TOI-5205b is decoupled from its atmosphere and not well mixed.",
      "pdf_url": "https://arxiv.org/pdf/2502.06966.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.08929",
      "title": "RedDots: Multiplanet system around M dwarf GJ 887 in the solar neighborhood",
      "authors": [
        "C. Hartogh",
        "S. V. Jeffers",
        "S. Dreizler",
        "J. R. Barnes",
        "C. A. Haswell",
        "F. Liebing",
        "A. Collier Cameron",
        "P. Gorrini",
        "F. Del Sordo",
        "P. Cortés-Zuleta"
      ],
      "abstract": "RedDots: Multiplanet system around M dwarf GJ 887 in the solar neighborhood C. Hartogh, S. V. Jeffers, S. Dreizler, J. R. Barnes, C. A. Haswell, F. Liebing, A. Collier Cameron, P. Gorrini, F. Del Sordo, P. Cortés-Zuleta Earth and Planetary Astrophysics (astro-ph.EP) GJ 887 is a bright M dwarf in the solar neighborhood with two currently reported nontransiting exoplanets with periods of $9~\\mathrm{d}$ and $21~\\mathrm{d,}$ along with an additional unconfirmed signal at $50~\\mathrm{d}$. We reanalyzed the system with 101 new HARPS and 12 new ESPRESSO radial velocities (RVs) secured with a cadence to confirm or refute the origin of the $50~\\mathrm{d}$ signal. To do so, we searched for signals related to stellar activity in photometric data and spectroscopic indicators. We modeled the stellar activity in the RVs with Gaussian processes (GPs). With the Bayesian analysis, we confirmed a four-planet model, including the two previously known planets at periods of $9.2619\\pm0.0005~\\mathrm{d}$ and $21.784\\pm0.004~\\mathrm{d,}$ as well as two newly confirmed exoplanets: an Earth-mass planet, with a $4.42490\\pm0.00014~\\mathrm{d}$ period and a sub-meter-per-second amplitude, and a super-Earth with a $50.77\\pm0.05~\\mathrm{d}$ period located in the habitable zone (HZ). This super-Earth is the second closest planet in the HZ, after Proxima Cen b. We found an additional signal in a 2:1 resonance with the $4.4~\\mathrm{d}$ planet at $2.21661\\pm0.00010~\\mathrm{d}$ with an amplitude of $0.37\\pm0.09~\\mathrm{m/s}$, which could be related to an additional planet. However, other explanations of its origin are also plausible. This signal remains a candidate, as further investigation is required to confirm its true nature. If the signal is caused by a planet, its minimum mass would be half that of Earth. We measured the stellar rotation period with the characteristic periodic timescale of the GP. We found a period of $38.7\\pm0.5~\\mathrm{d}$, which is consistent with the rotation period determined from photometry and other activity indices.",
      "pdf_url": "https://arxiv.org/pdf/2602.08929.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}