{
  "date": "2025-12-09",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.HE",
    "astro-ph.SR",
    "astro-ph.CO",
    "astro-ph.GA",
    "astro-ph.IM"
  ],
  "total_papers": 87,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.05548",
      "title": "How Dark Sector Equations of State Govern Interaction Signatures",
      "authors": [
        "Peng-Ju Wu",
        "Ming Zhang",
        "Shang-Jie Jin"
      ],
      "abstract": "How Dark Sector Equations of State Govern Interaction Signatures Peng-Ju Wu, Ming Zhang, Shang-Jie Jin Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Using late-Universe observations, we demonstrate that freeing dark energy and dark matter equations of state (EoS) dramatically alters the inferred strength and direction of their interactions. When dark sector EoS are fixed to $w_{\\mathrm{de}}=-1$ and $w_{\\mathrm{dm}}=0$, the data consistently favor an energy transfer from dark energy to dark matter across various interaction forms. This apparent evidence, however, proves highly sensitive to the EoS assumptions: treating $w_{\\mathrm{de}}$ as a free parameter substantially weakens the evidence for interaction, with its value converging to the quintessence regime ($w_{\\mathrm{de}}>-1$). In contrast, freeing $w_{\\mathrm{dm}}$ maintains a preference for interaction, revealing a correlation where positive $w_{\\mathrm{dm}}$ is associated with energy transfer from dark energy to dark matter, and negative $w_{\\mathrm{dm}}$ with energy transfer from dark matter to dark energy. These findings caution against the simplistic assumption of $\\Lambda$CDM EoS values when attempting to detect a possible interaction. Despite these fundamental degeneracies, model comparison using the Akaike and Deviance information criteria shows that all of the tested interacting dark energy scenarios receive substantial support over the $\\Lambda$CDM model.",
      "pdf_url": "https://arxiv.org/pdf/2512.05548.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05898",
      "title": "Differentially rotating neutron stars with dark matter cores",
      "authors": [
        "Lorenzo Cipriani",
        "Violetta Sagun",
        "Kalin V. Staykov",
        "Daniela D. Doneva",
        "Stoytcho S. Yazadjiev"
      ],
      "abstract": "Differentially rotating neutron stars with dark matter cores Lorenzo Cipriani, Violetta Sagun, Kalin V. Staykov, Daniela D. Doneva, Stoytcho S. Yazadjiev High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); Nuclear Theory (nucl-th) Dark matter is expected to accumulate inside neutron stars, modifying the structure of isolated stars and influencing both the dynamics of binary mergers and the evolution of the resulting hypermassive remnants. Since differential rotation is the primary mechanism delaying the collapse of these remnants, understanding its behavior is crucial when assessing the impact of an embedded dark component. In this work, we extend the numerical code RNS to describe two gravitationally coupled fluids in differential rotation, with baryonic matter modeled by a realistic nuclear equation of state and dark matter represented as a self-interacting bosonic condensate. Within this framework, we construct equilibrium sequences for a representative differential rotation law, providing a basis to explore how dark matter may influence the global properties and rotational dynamics of binary neutron star remnants.",
      "pdf_url": "https://arxiv.org/pdf/2512.05898.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "hep-ph",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.14106",
      "title": "Intrinsic non-Gaussianity of ultra slow-roll inflation",
      "authors": [
        "Guillermo Ballesteros",
        "Jesús Gambín Egea",
        "Thomas Konstandin",
        "Alejandro Pérez Rodríguez",
        "Mathias Pierre",
        "Julián Rey"
      ],
      "abstract": "Intrinsic non-Gaussianity of ultra slow-roll inflation Guillermo Ballesteros, Jesús Gambín Egea, Thomas Konstandin, Alejandro Pérez Rodríguez, Mathias Pierre, Julián Rey 29 pages, 7 figures; added references and lightly extended discussion, results unaffected. Matches version to appear in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We study the non-Gaussian tail of the curvature fluctuation, $\\zeta$, in an inflationary scenario with a transient ultra slow-roll phase that generates a localized large enhancement of the spectrum of $\\zeta$. To do so, we implement a numerical procedure that provides the probability distribution of $\\zeta$ order by order in perturbation theory. The non-Gaussianities of $\\zeta$ can be shown to arise from its non-linear relation to the inflaton fluctuations and from the intrinsic non-Gaussianities of the latter, which stem from its self interactions. We find that intrinsic non-Gaussianities, which have often been ignored to estimate the abundance of primordial black holes in this kind of scenario, are important. The relevance of the intrinsic contribution depends on the rapidity with which the transient ultra slow-roll phase occurs, as well as on its duration. Our method cannot be used accurately when the perturbative in-in formalism fails to apply, highlighting the relevance of developing fully non-perturbative approaches to the problem.",
      "pdf_url": "https://arxiv.org/pdf/2412.14106.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.09700",
      "title": "Turbulence and Magnetic Reconnection in Relativistic Multispecies Plasmas",
      "authors": [
        "Mario Imbrogno",
        "Claudio Meringolo",
        "Alejandro Cruz-Osorio",
        "Luciano Rezzolla",
        "Benoît Cerutti",
        "Sergio Servidio"
      ],
      "abstract": "Turbulence and Magnetic Reconnection in Relativistic Multispecies Plasmas Mario Imbrogno, Claudio Meringolo, Alejandro Cruz-Osorio, Luciano Rezzolla, Benoît Cerutti, Sergio Servidio The Astrophysical Journal Letters, Volume 990, Number 2, L33 (2025) Plasma Physics (physics.plasm-ph); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Simulations of relativistic plasmas traditionally focus on the dynamics of two-species mixtures of charged particles under the influence of external magnetic fields and those generated by particle currents. However, the extreme conditions of astrophysical plasmas near compact objects such as black holes and neutron stars are often characterized by mixtures of electrons, protons, and positrons, whose dynamics can differ significantly because of the considerable mass contrast. We present the first two-dimensional particle-in-cell simulations of relativistic turbulence and magnetic reconnection in a three-species plasma, varying the relative abundance of electrons, protons, and positrons while employing realistic mass ratios to achieve unprecedented accuracy. We find that turbulence leads to the formation of magnetic islands, current sheets, and plasmoids. Reconnection occurs between these structures, with plasma composition playing a key role in determining the number of reconnection sites and their energy-conversion efficiency. In particular, as the proton fraction increases, very small-scale features of the turbulence are washed out, while global dissipative effects are amplified. Finally, using a novel generalization of Ohm's law for a relativistic multi-species plasma, we find that the reconnection rate is primarily governed by the electric fields associated to the divergence of the positron and electron pressure tensors. These results provide new insights into dissipation and particle acceleration in turbulent relativistic plasmas, such as those near black holes and neutron stars, and can be used to interpret their high-energy emission and phenomenology.",
      "pdf_url": "https://arxiv.org/pdf/2505.09700.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.17415",
      "title": "Model-Independent Dark Energy Measurements from DESI DR2 and Planck 2015 Data",
      "authors": [
        "Yun Wang",
        "Katherine Freese"
      ],
      "abstract": "Model-Independent Dark Energy Measurements from DESI DR2 and Planck 2015 Data Yun Wang (Caltech), Katherine Freese (UT Austin &amp; NORDITA) 24 pages, 9 figures. Expanded to include the alternatives of Planck 2015 and 2018 distance priors allowing neutrino mass to vary, and a table of X(z) measurements. Version accepted for publication by JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Using DESI DR2 baryon acoustic oscillation (BAO) distance measurements and Planck cosmic microwave background distance priors, we have measured the dark energy density $\\rho_X(z)$ and dark energy equation of state w_X(z) as free functions of redshift (smoothly interpolated from values at {z_i}={0, 1/3, 2/3, 1, 4/3, 2.33}, and find both to be consistent with a cosmological constant, with only deviations of 1\\sigma for $\\rho_X(z)$ & ~ 2$\\sigma$ for w_X(z) at z=2/3. We also find that measuring {$\\rho_X(z_i)$} is preferred to measuring {w_X(z_i)} by model selection using the Akaike Information Criterion (AIC) as well as the Bayesian Information Criterion (BIC). Varying the choice of redshift values of the $\\rho_X(z)$ measurements leads to very consistent results, with AIC/BIC slightly favoring the case of our fiducial {z_i} with z=4/3 omitted. We find agreement with a cosmological constant except for the 1-2$\\sigma$ deviation at 0.4 < z < 0.9, where DESI DR2 BAO measurements deviate from a cosmological constant at similar statistical significance. Our results differ noticeably from those of the DESI Collaboration, in which they used the same DESI DR2 data combined with Planck data and found a 3.1$\\sigma$ deviation from a cosmological constant, which is primarily the consequence of their assuming parametrization w_X(z)=w_0+w_a(1-a). Our results indicate that assuming a linear w_X(z) could be misleading and precludes discovering how dark energy actually varies with time at higher redshifts. In our quest to discover the physical nature of dark energy, the most urgent goal at present is to determine definitively whether dark energy density varies with time. It is of critical importance to measure dark energy density as a free function of redshift from data. Future galaxy redshift surveys by Euclid and Roman at higher redshifts will significantly advance our understanding of dark energy.",
      "pdf_url": "https://arxiv.org/pdf/2505.17415.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.13264",
      "title": "From Wide Triples to UCXBs: Multimessenger Signatures of Dynamically-formed Black Hole-White Dwarf Systems in the LISA Band",
      "authors": [
        "Zeyuan Xuan",
        "Cheyanne Shariat",
        "Smadar Naoz"
      ],
      "abstract": "From Wide Triples to UCXBs: Multimessenger Signatures of Dynamically-formed Black Hole-White Dwarf Systems in the LISA Band Zeyuan Xuan, Cheyanne Shariat, Smadar Naoz 12+6 pages, 3+3 figures. Updated to match the published version in ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) Ultracompact X-ray binaries (UCXBs) are a subclass of low-mass X-ray binaries characterized by tight orbits and degenerate donors, which pose significant challenges to our understanding of their formation. Recent discoveries of black hole (BH) candidates with main-sequence (MS) or red giant (RG) companions suggest that BH-white dwarf (BH-WD) binaries are common in the Galactic field. Motivated by these observations and the fact that most massive stars are born in triples, we show that wide BH-WD systems can naturally form UCXBs through the eccentric Kozai-Lidov (EKL) mechanism. Notably, EKL-driven eccentricity excitations combined with gravitational wave (GW) emission and WD dynamical tides can effectively shrink and circularize the orbit, leading to mass-transferring BH-WD binaries. These systems represent promising multimessenger sources in both X-ray and GW observations. Specifically, we predict that the wide triple channel can produce $\\sim3-27$ ($\\sim1-5$) detectable UCXBs in the Milky Way (Andromeda galaxy), including $\\sim1$ system observable by the mHz GW detection of LISA. If the final WD mass can reach sufficiently small values, this channel could contribute up to $\\sim 10^3$ UCXBs in the Galaxy. Furthermore, the identification of tertiary companions in observed UCXBs would provide direct evidence for this formation pathway and yield unique insights into their dynamical origins.",
      "pdf_url": "https://arxiv.org/pdf/2508.13264.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.05401",
      "title": "The Glow of Axion Quark Nugget Dark Matter: (IV) CMB Spectral and Anisotropy Signatures",
      "authors": [
        "Fereshteh Majidi",
        "Xunyu Liang",
        "Michael Sekatchev",
        "Ludovic Van Waerbeke",
        "Ariel Zhitnitsky"
      ],
      "abstract": "The Glow of Axion Quark Nugget Dark Matter: (IV) CMB Spectral and Anisotropy Signatures Fereshteh Majidi, Xunyu Liang, Michael Sekatchev, Ludovic Van Waerbeke, Ariel Zhitnitsky Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Axion quark nuggets (AQNs) are macroscopic dark-matter candidates, with masses of the order of a few grams to a kilogram and sub-micron radius, thought to form at the Quantum Chromo Dynamic era through axion-induced charge separation. This framework naturally links the dark and visible matter abundances ($\\Omega_{\\rm DM} \\sim \\Omega_{\\rm visible}$) and provides a mechanism for generating the baryon-antibaryon asymmetry where dark matter is composed of matter AQNs and antimatter AQNs. Although behaving as cold dark matter on cosmological scales, baryons annihilate with antimatter AQNs, producing ionizing high-energy photons. The resulting energy injection may imprint spectral distortions on the cosmic microwave background (CMB) and modify the reionization history. Using a modified version of the \\texttt{CLASS} Boltzmann code we compute the impact of this energy injection on the $\\mu$ and $y$ spectral distortion parameters as well as on the optical depth. We find that (1) the CMB anisotropies remain essentially unaffected by baryon annihilation, and (2) the associated spectral distortion signatures lie within the sensitivity reach of proposed CMB spectral distortion missions. Finally, we discuss the similarities and differences between the AQN scenario and annihilating or decaying dark matter models.",
      "pdf_url": "https://arxiv.org/pdf/2512.05401.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05435",
      "title": "Spinning Primordial Black Holes and Scalar Induced Gravitational Waves from Single Field Inflation",
      "authors": [
        "Abolhassan Mohammadi",
        "Yogesh",
        "Qiang Wu",
        "Tao Zhu"
      ],
      "abstract": "Spinning Primordial Black Holes and Scalar Induced Gravitational Waves from Single Field Inflation Abolhassan Mohammadi, Yogesh, Qiang Wu, Tao Zhu Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the formation of primordial black holes (PBHs), their spin and abundance, in a single-field inflationary model based on a mutated hilltop potential inserted with a small step-like feature. This step induces a brief phase of ultra-slow-roll inflation, producing the large enhancement of the scalar power spectrum required for an appreciable amount of PBH abundance. Instead of the commonly used analytical power spectra, we compute the primordial power spectrum accurately by numerically solving the Mukhanov-Sasaki equation. Using the obtained power spectrum, we apply peak theory with $\\nabla^2 \\zeta$ treated as a Gaussian random field and parametrize the curvature profile by its amplitude $\\mu$ and characteristic width $K$. Confining the study to Type-I PBH, the threshold value is calculated using two robust methods: the average of the compaction function and the q-function method. Using the result, the dimensionless spin parameter of the resulting PBHs is calculated at linear order and found to be $\\sqrt{\\langle a_\\star^2 \\rangle} \\sim 10^{-3}$; however, it can be higher for smaller masses. We present detailed predictions for two representative parameter sets, calculate the present-day PBH mass function $f_{\\rm PBH}(M)$ and the associated scalar-induced gravitational waves (SIGW). The first produces PBHs of mass $M \\simeq 10^{-13}\\,M_\\odot$ that can account for $100\\%$ of dark matter, while the second yields $M \\simeq 10^{-2}\\,M_\\odot$ PBHs contributing approximately $2.4\\%$ of the dark matter density. The predicted signals of SIGWs lie within the sensitivity bands of future experiments such as LISA, DECIGO, BBO, and SKA. In particular, the second parameter set produces a SIGWs compatible with the recent NANOGrav evidence for a low-frequency gravitational-wave signal.",
      "pdf_url": "https://arxiv.org/pdf/2512.05435.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.05503",
      "title": "Absorption in the 21 cm Hydrogen Line at $z>10$ as a Sensitive Tool for the Construction of a Cosmological Model on Small Scales",
      "authors": [
        "Yu.N. Eroshenko , V.N. Lukash , E.V. Mikheeva , S.V. Pilipenko , M.V. Tkachev Institute for Nuclear Research, Russian Academy of Sciences, Moscow, 117312 Russia, Astro Space Center, Lebedev Physical Institute, Russian Academy of Sciences, Moscow, 117997 Russia)"
      ],
      "abstract": "Absorption in the 21 cm Hydrogen Line at $z>10$ as a Sensitive Tool for the Construction of a Cosmological Model on Small Scales Yu.N. Eroshenko (1), V.N. Lukash (2), E.V. Mikheeva (2), S.V. Pilipenko (2), M.V. Tkachev (2) ((1) Institute for Nuclear Research, Russian Academy of Sciences, Moscow, 117312 Russia, (2) Astro Space Center, Lebedev Physical Institute, Russian Academy of Sciences, Moscow, 117997 Russia) Cosmology and Nongalactic Astrophysics (astro-ph.CO) The cosmic microwave background absorption intensity in the 21 cm line of neutral hydrogen in the presence of additional power in the form of a \"bump\" in the spectrum of cosmological density perturbations is calculated. The main absorption-amplifying effect is the earlier birth of the first stars forming an ultraviolet radiation background. This radiation reduces the spin temperature of neutral hydrogen and, thus, amplifies the absorption in the 21 cm line. A comparison of various cosmological models (with and without a bump in the density perturbation spectrum) shows that it is possible to determine the probable position of the bump in the perturbation spectrum and, thus, to reconstruct the spectrum of cosmological perturbations on scales $k>1$~Mpc${}^{-1}$ from the position of the absorption frequency profile.",
      "pdf_url": "https://arxiv.org/pdf/2512.05503.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05581",
      "title": "Growth rate measurements from a joint analysis of the large-scale galaxy clustering in Fourier and configuration space",
      "authors": [
        "Vincenzo Aronica",
        "Julian E. Bautista",
        "Arnaud de Mattia",
        "Hector Gil-Marín"
      ],
      "abstract": "Growth rate measurements from a joint analysis of the large-scale galaxy clustering in Fourier and configuration space Vincenzo Aronica, Julian E. Bautista, Arnaud de Mattia, Hector Gil-Marín Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work, we test a framework to perform the analysis of redshift-space distortions simultaneously in configuration and Fourier space. We test our methods with the AbacusSummit suite of N-body simulations as well as a more numerous set of approximate EZmocks, reproducing the sample of luminous red galaxies of from the Baryon Oscillation Spectroscopic Survey (BOSS) and its extension (eBOSS). Our clustering models are based on the effective field theory of large-scale structures in a Lagrangian frame, used in the latest results from the Dark Energy Spectroscopic Instrument. We perform a template type of analysis, including dilation parameters and the slope parameter from the ShapeFit framework. We find that the joint space inference yields unbiased and robust constraints on simulated datasets, consistent with results from individual spaces or previous methods to obtain consensus results. Our joint space analysis on the the BOSS+eBOSS LRG sample obtains $ f\\sigma_8 = 0.463 \\pm 0.052 $, in good agreement with the official 2020 results.",
      "pdf_url": "https://arxiv.org/pdf/2512.05581.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05588",
      "title": "Squared-field cross-correlation between kinetic Sunyaev-Zel'dovich effect and 21-cm intensity mapping",
      "authors": [
        "Zi-Yan Yuwen , Yu-Er Jiang , Yin-Zhe Ma , Paul La Plante , Adam Lidz , Yan Gong Department of Physics, Stellenbosch University, Matieland 7602, South Africa, Institute of Theoretical Physics, Chinese Academy of Sciences , Beijing 100190, China, University of Chinese Academy of Sciences , Beijing 100049, China, National Astronomical Observatories, Chinese Academy of Sciences, Beijing 100012, China, Department of Computer Science, University of Nevada, Las Vegas, NV 89154, USA, Nevada Center for Astrophysics, University of Nevada, Las Vegas, NV 89154, USA, Center for Particle Cosmology, Department of Physics and Astronomy, University of Pennsylvania, Philadelphia, PA 19104, USA, Science Center for China Space Station Telescope, National Astronomical Observatories, Chinese Academy of Sciences, Beijing 100012, China)"
      ],
      "abstract": "Squared-field cross-correlation between kinetic Sunyaev-Zel'dovich effect and 21-cm intensity mapping Zi-Yan Yuwen (1,2,3), Yu-Er Jiang (1,3,4), Yin-Zhe Ma (1), Paul La Plante (5,6), Adam Lidz (7), Yan Gong (3,4,8) ((1) Department of Physics, Stellenbosch University, Matieland 7602, South Africa, (2) Institute of Theoretical Physics, Chinese Academy of Sciences (CAS), Beijing 100190, China, (3) University of Chinese Academy of Sciences (UCAS), Beijing 100049, China, (4) National Astronomical Observatories, Chinese Academy of Sciences, Beijing 100012, China, (5) Department of Computer Science, University of Nevada, Las Vegas, NV 89154, USA, (6) Nevada Center for Astrophysics, University of Nevada, Las Vegas, NV 89154, USA, (7) Center for Particle Cosmology, Department of Physics and Astronomy, University of Pennsylvania, Philadelphia, PA 19104, USA, (8) Science Center for China Space Station Telescope, National Astronomical Observatories, Chinese Academy of Sciences, Beijing 100012, China) Cosmology and Nongalactic Astrophysics (astro-ph.CO) Neutral hydrogen (HI) 21-cm intensity mapping is an effective method to track the distribution of baryonic matter, and extract astrophysical and cosmological information. The 21-cm intensity field has a non-vanishing cross-correlation with the kinetic Sunyaev-Zel'dovich (kSZ) effect that traces the velocity and density perturbations of free electrons. By using the linear perturbation theory, in this paper we calculate analytically, for the first time, the cross-correlation between the squared kSZ field and the projection of the squared HI intensity mapping field with the flat-sky approximation. This statistic remains non-vanishing even after the long-wavelength line-of-sight modes ($k_{\\parallel}$) are removed due to foreground contamination. We further forecast for the prospects of detection with the SKA-MID 21-cm intensity mapping experiments (redshifts in range of $0.3 < z < 1$), and the kSZ maps measured by Atacama Cosmology Telescope (ACT) and Simons Observatory (SO). The predicted cumulative signal-to-noise ratio (SNR) is $1.92$ for SKA-ACT and $3.99$ for SKA-SO. These results show a possible on-the-edge detection on the cross-correlation signal at low redshifts, which in turn could serve as a validation step towards using it for the Epoch of Reionization studies.",
      "pdf_url": "https://arxiv.org/pdf/2512.05588.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05819",
      "title": "Constraints on nDGP gravity from SPT galaxy clusters with DES and HST weak-lensing mass calibration and from Planck PR4 CMB anisotropies",
      "authors": [
        "S. M. L. Vogt",
        "S. Bocquet",
        "C. T. Davies",
        "J. J. Mohr",
        "F. Schmidt",
        "C.-Z. Ruan",
        "B. Li",
        "C. Hernändez-Aguayo",
        "S. Grandis",
        "L. E. Bleem",
        "M. Klein",
        "M. Aguena",
        "S. Allam",
        "F. Andrade-Oliveira",
        "D. Bacon",
        "D. Brooks",
        "R. Camilleri",
        "A. Carnero Rosell",
        "J. Carretero",
        "M. Costanzi",
        "L. N. da Costa",
        "M. E. da Silva Pereira",
        "J. De Vicente",
        "P. Doel",
        "J. Garcïa-Bellido",
        "P. Giles",
        "D. Gruen",
        "G. Gutierrez",
        "S. R. Hinton",
        "D. L. Hollowood",
        "D. J. James",
        "K. Kuehn",
        "S. Lee",
        "J. L. Marshall",
        "J. Mena-Fernändez",
        "F. Menanteau",
        "R. Miquel",
        "J. Myles",
        "A. A. Plazas Malagön",
        "A. Porredon",
        "J. Prat",
        "C. L. Reichardt",
        "A. K. Romer",
        "E. Sanchez",
        "I. Sevilla-Noarbe",
        "M. Smith",
        "M. Soares-Santos",
        "E. Suchyta",
        "M. E. C. Swanson",
        "C. To",
        "V. Vikram",
        "N. Weaverdyck"
      ],
      "abstract": "Constraints on nDGP gravity from SPT galaxy clusters with DES and HST weak-lensing mass calibration and from Planck PR4 CMB anisotropies S. M. L. Vogt, S. Bocquet, C. T. Davies, J. J. Mohr, F. Schmidt, C.-Z. Ruan, B. Li, C. Hernändez-Aguayo, S. Grandis, L. E. Bleem, M. Klein, M. Aguena, S. Allam, F. Andrade-Oliveira, D. Bacon, D. Brooks, R. Camilleri, A. Carnero Rosell, J. Carretero, M. Costanzi, L. N. da Costa, M. E. da Silva Pereira, J. De Vicente, P. Doel, J. Garcïa-Bellido, P. Giles, D. Gruen, G. Gutierrez, S. R. Hinton, D. L. Hollowood, D. J. James, K. Kuehn, S. Lee, J. L. Marshall, J. Mena-Fernändez, F. Menanteau, R. Miquel, J. Myles, A. A. Plazas Malagön, A. Porredon, J. Prat, C. L. Reichardt, A. K. Romer, E. Sanchez, I. Sevilla-Noarbe, M. Smith, M. Soares-Santos, E. Suchyta, M. E. C. Swanson, C. To, V. Vikram, N. Weaverdyck 12 pages, 6 figures, submitted to PRD Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present constraints on the normal branch of the Dvali-Gabadadze-Porrati (nDGP) braneworld gravity model from the abundance of massive galaxy clusters. On scales below the nDGP crossover scale $r_{\\rm c}$, the nDGP model features an effective gravity-like fifth force that alters the growth of structure, leading to an enhancement of the halo mass function (HMF) on cluster scales. The enhanced cluster abundance allows for constraints on the nDGP model using cluster samples. We employ the SPT cluster sample, selected through the thermal Sunyaev-Zel'dovich effect (tSZE) with the South Pole Telescope (SPT) and with mass calibration using weak-lensing data from the Dark Energy Survey (DES) and the Hubble Space Telescope (HST). The cluster sample contains 1,005 clusters with redshifts $0.25 < z < 1.78$, which are confirmed with the Multi-Component Matched Filter (MCMF) algorithm using optical and near-infrared data. Weak-lensing data from DES and HST enable a robust mass measurement of the cluster sample. We use DES Year 3 data for 688 clusters with redshifts $z < 0.95$, and HST data for 39 clusters with redshifts $ 0.6 < z <1.7$. We account for the enhancement in the HMF through a semi-analytic correction factor to the $\\nu\\Lambda$CDM HMF derived from the spherical collapse model in the nDGP model. We then further calibrate this model using $N$-body simulations. In addition, for the first time, we analyze the primary cosmic microwave background (CMB) temperature and polarization anisotropy measurements from Planck PR4 within the nDGP model. We obtain a competitive constraint from the joint analysis of the SPT cluster abundance with the Planck PR4 data, and report an upper bound of $1/\\sqrt{H_0r_{\\rm c}}< 1.41$ at $95\\%$ when assuming a cosmology with massive neutrinos.",
      "pdf_url": "https://arxiv.org/pdf/2512.05819.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05847",
      "title": "A redshift-independent theoretical halo mass function validated with the Uchuu simulations",
      "authors": [
        "Elena Fernández-García",
        "Juan E. Betancort-Rijo",
        "Francisco Prada",
        "Tomoaki Ishiyama",
        "Anatoly Klypin",
        "José Ruedas"
      ],
      "abstract": "A redshift-independent theoretical halo mass function validated with the Uchuu simulations Elena Fernández-García, Juan E. Betancort-Rijo, Francisco Prada, Tomoaki Ishiyama, Anatoly Klypin, José Ruedas Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a new theoretical framework for the halo mass function (HMF) that accurately predicts the abundance of dark matter haloes across an exceptionally wide range in mass and redshift. Building on a generalised Press & Schechter model and triaxial collapse (GPS+), we predict the HMF in terms of the variance of the linear density field, with only a weak explicit dependence on halo mass and no explicit dependence on redshift. The GPS+ model naturally provides the correct normalization and high-mass behaviour without requiring empirical fitting. We calibrate and validate the GPS+ model using the Uchuu N-body simulation suite, which combines large cosmological volume and high mass resolution under Planck cosmology. Using six simulations with up to 300 realizations, we obtain precision HMF measurements spanning halo masses in the range 6.5 < log($M_{\\rm 200m}$/[h$^{-1}$ $M_{\\odot}$]) <16 over 0 < z < 20, with reduced cosmic variance. Across this full domain, the GPS+ model reproduces the simulated HMF with deviations typically below 10-20%. Comparison with the Sheth-Tormen (ST) model shows similar performance at z < 2, but markedly improved agreement at higher redshifts, where ST can deviate by 70-80% while our model remains within ~20%. Finally, we assess the impact of the halo mass definition: adopting the evolving virial overdensity of Bryan & Norman (1998) worsens agreement at low redshift and high masses, whereas M200m yields a more universal, nearly redshift-independent HMF.",
      "pdf_url": "https://arxiv.org/pdf/2512.05847.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05405",
      "title": "Ruminations Upon the Modeling of X-ray Foregrounds, Backgrounds and Faint Sources",
      "authors": [
        "Adam B. Mantz",
        "Anthony M. Flores",
        "Taweewat Somboonpanyakul",
        "Steven W. Allen",
        "R. Glenn Morris",
        "Abigail Y. Pan",
        "Haley R. Stueber"
      ],
      "abstract": "Ruminations Upon the Modeling of X-ray Foregrounds, Backgrounds and Faint Sources Adam B. Mantz, Anthony M. Flores, Taweewat Somboonpanyakul, Steven W. Allen, R. Glenn Morris, Abigail Y. Pan, Haley R. Stueber 28 pages, 17 figures; submitted version Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) With the goal of extracting as much information as possible from Chandra and XMM-Newton observations of faint, diffuse sources such as galaxy clusters, as well as those of future X-ray telescopes, we present a strategy for forward modeling all the foreground and background signals present in these data. This work leverages widespread efforts to understand the soft X-ray emission from the Galaxy, as well as the cosmic X-ray background and instrument-specific, particle-induced backgrounds. Statistically, a forward model of the foregrounds and backgrounds is preferable to alternatives because it requires no binning of the data, and allows straightforward marginalization over systematic uncertainties. We apply these methods to several galaxy clusters at intermediate-to-high redshifts, spanning a range of masses and morphologies, using Chandra and/or XMM-Newton data. Our results suggest a modest improvement even for relatively bright clusters at these redshifts, and more substantial advantages in the high-redshift, low-surface-brightness regime. We also discuss and provide a simple correction for a time-dependent miscalibration of the Chandra ACIS detectors identified in archival galaxy cluster data.",
      "pdf_url": "https://arxiv.org/pdf/2512.05405.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05719",
      "title": "Stellar cores live long and prosper in cuspy dark matter halos",
      "authors": [
        "Jenni Häkkinen , Alexander Rawlings , Till Sawala , Matthew G. Walker University of Helsinki, Carnegie Mellon University)"
      ],
      "abstract": "Stellar cores live long and prosper in cuspy dark matter halos Jenni Häkkinen (1), Alexander Rawlings (1), Till Sawala (1), Matthew G. Walker (2) ((1) University of Helsinki, (2) Carnegie Mellon University) 12 pages, 5 figures. For analysis code and data, see this https URL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The existence of cuspy or cored centers of dark matter halos is a crucial discriminant between different dark matter models. It has recently been claimed based on dynamical arguments that perfectly cored stellar systems cannot survive inside cuspy dark matter halos, which would make the observation of stellar cores in ultra-faint dwarf galaxies, where dark matter cores cannot form through baryonic processes, a direct falsification of the cold dark matter paradigm. Here, we use idealized simulations to show explicitly that cored stellar systems like those observed in dwarf galaxies can be stable within cuspy dark matter halos over at least several Hubble times. We also demonstrate that observations of ultra-faint dwarf galaxies cannot distinguish mildly positive, flat, or negative inner density slopes, further precluding the dynamical inference of the gravitational potential from the stellar configuration.",
      "pdf_url": "https://arxiv.org/pdf/2512.05719.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05909",
      "title": "Learning the Cosmic Web: Graph-based Classification of Simulated Galaxies by their Dark Matter Environments",
      "authors": [
        "Dakshesh Kololgi",
        "Krishna Naidoo",
        "Amelie Saintonge",
        "Ofer Lahav"
      ],
      "abstract": "Learning the Cosmic Web: Graph-based Classification of Simulated Galaxies by their Dark Matter Environments Dakshesh Kololgi, Krishna Naidoo, Amelie Saintonge, Ofer Lahav 15 pages, 7 figures, 9 tables, submitted to Royal Astronomical Society Techniques and Instruments Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a novel graph-based machine learning classifier for identifying the dark matter cosmic web environments of galaxies. Large galaxy surveys offer comprehensive statistical views of how galaxy properties are shaped by large-scale structure, but this requires robust classifications of galaxies' cosmic web environments. Using stellar mass-selected IllustrisTNG-300 galaxies, we apply a three-stage, simulation-based framework to link galaxies to the total (mainly dark) underlying matter distribution. Here, we apply the following three steps: First, we assign the positions of simulated galaxies to a void, wall, filament, or cluster environment using the T-Web classification of the underlying matter distribution. Second, we construct a Delaunay triangulation of the galaxy distribution to summarise the local geometric structure with ten graph metrics for each galaxy. Third, we train a graph attention network (GAT) on each galaxy's graph metrics to predict its cosmic web environment. For galaxies with stellar mass $\\mathrm{>10^9 M_{\\odot}}$, our GAT+ model achieves an accuracy of $85\\,\\%$, outperforming graph-agnostic multilayer perceptrons and graph convolutional networks. Our results demonstrate that graph-based representations of galaxy positions provide a powerful and physically meaningful way to infer dark matter environments. We plan to apply this simulation-based graph modelling to investigate how the properties of observed galaxies from the Dark Energy Spectroscopic Instrument (DESI) survey are influenced by their dark matter environments.",
      "pdf_url": "https://arxiv.org/pdf/2512.05909.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.00903",
      "title": "Probing cosmic isotropy: Hubble constant and matter density large-angle variations with the Pantheon+SH0ES data",
      "authors": [
        "Rahima Mokeddem",
        "Maria Lopes",
        "Felipe Avila",
        "Armando Bernui",
        "Wiliam S. Hipólito-Ricaldi"
      ],
      "abstract": "Probing cosmic isotropy: Hubble constant and matter density large-angle variations with the Pantheon+SH0ES data Rahima Mokeddem, Maria Lopes, Felipe Avila, Armando Bernui, Wiliam S. Hipólito-Ricaldi Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this study we investigate potential large-angle anisotropies in the angular distribution of the cosmological parameters $H_0$ (the Hubble constant) and $\\Omega_m$ (the matter density) in the flat-$\\Lambda$CDM framework, using the Pantheon+SH0ES supernovae catalog. For this we perform a directional analysis by dividing the celestial sphere into a set of directions, and estimate the best-fit cosmological parameters across the sky using a MCMC approach. Our results show a dominant dipolar pattern for both parameters in study, suggesting a preferred axis in the universe expansion and in the distribution of matter. However, we also found that for $z \\gtrsim 0.015$, this dipolar behavior is not statistically significant, confirming the expectation -- in the $\\Lambda$CDM scenario -- of an isotropic expansion and a uniform angular distribution of matter (both results at $1\\,\\sigma$ confidence level). Nevertheless, for nearby supernovae, at distances $\\lesssim 60$ Mpc or $z \\lesssim 0.015$, the peculiar velocities introduce a highly significant dipole in the angular distribution of $H_0$. Furthermore, we perform various robustness tests that support our findings, and consistency tests of our methodology.",
      "pdf_url": "https://arxiv.org/pdf/2504.00903.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.13439",
      "title": "Dark Energy Survey Year 3 results: $w$CDM cosmology from simulation-based inference with persistent homology on the sphere",
      "authors": [
        "J. Prat",
        "M. Gatti",
        "C. Doux",
        "P. Pranav",
        "C. Chang",
        "N. Jeffrey",
        "L. Whiteway",
        "D. Anbajagane",
        "S. Sugiyama",
        "A. Thomsen",
        "A. Alarcon",
        "A. Amon",
        "K. Bechtol",
        "G. M. Bernstein",
        "A. Campos",
        "R. Chen",
        "A. Choi",
        "C. Davis",
        "J. DeRose",
        "S. Dodelson",
        "K. Eckert",
        "J. Elvin-Poole",
        "S. Everett",
        "A. Ferté",
        "D. Gruen",
        "E. M. Huff",
        "I. Harrison",
        "K. Herner",
        "M. Jarvis",
        "N. Kuropatkin",
        "P.-F. Leget",
        "N. MacCrann",
        "J. McCullough",
        "J. Myles",
        "A. Navarro-Alsina",
        "S. Pandey",
        "M. Raveri",
        "R. P. Rollins",
        "A. Roodman",
        "C. Sánchez",
        "L. F. Secco",
        "E. Sheldon",
        "T. Shin",
        "M. A. Troxel",
        "I. Tutusaus",
        "T. N. Varga",
        "B. Yanny",
        "B. Yin",
        "Y. Zhang",
        "J. Zuntz",
        "T. M. C. Abbott",
        "M. Aguena",
        "S. Allam",
        "F. Andrade-Oliveira",
        "J. Blazek",
        "S. Bocquet",
        "D. Brooks",
        "J. Carretero",
        "A. Carnero Rosell",
        "R. Cawthon",
        "J. De Vicente",
        "S. Desai",
        "M. E. da Silva Pereira",
        "H. T. Diehl",
        "B. Flaugher",
        "J. Frieman",
        "J. García-Bellido",
        "R. A. Gruendl",
        "G. Gutierrez",
        "S. R. Hinton",
        "D. L. Hollowood",
        "K. Honscheid",
        "D. J. James",
        "K. Kuehn",
        "L. N. da Costa",
        "O. Lahav",
        "S. Lee",
        "J. L. Marshall",
        "J. Mena-Fernández",
        "R. Miquel",
        "J. J. Mohr",
        "R. L. C. Ogando",
        "A. A. Plazas Malagón",
        "A. Porredon",
        "S. Samuroff",
        "E. Sanchez",
        "B. Santiago",
        "I. Sevilla-Noarbe",
        "M. Smith",
        "E. Suchyta",
        "M. E. C. Swanson",
        "D. Thomas",
        "C. To",
        "V. Vikram",
        "A. R. Walker",
        "N. Weaverdyck",
        "J. Weller"
      ],
      "abstract": "Dark Energy Survey Year 3 results: $w$CDM cosmology from simulation-based inference with persistent homology on the sphere J. Prat, M. Gatti, C. Doux, P. Pranav, C. Chang, N. Jeffrey, L. Whiteway, D. Anbajagane, S. Sugiyama, A. Thomsen, A. Alarcon, A. Amon, K. Bechtol, G. M. Bernstein, A. Campos, R. Chen, A. Choi, C. Davis, J. DeRose, S. Dodelson, K. Eckert, J. Elvin-Poole, S. Everett, A. Ferté, D. Gruen, E. M. Huff, I. Harrison, K. Herner, M. Jarvis, N. Kuropatkin, P.-F. Leget, N. MacCrann, J. McCullough, J. Myles, A. Navarro-Alsina, S. Pandey, M. Raveri, R. P. Rollins, A. Roodman, C. Sánchez, L. F. Secco, E. Sheldon, T. Shin, M. A. Troxel, I. Tutusaus, T. N. Varga, B. Yanny, B. Yin, Y. Zhang, J. Zuntz, T. M. C. Abbott, M. Aguena, S. Allam, F. Andrade-Oliveira, J. Blazek, S. Bocquet, D. Brooks, J. Carretero, A. Carnero Rosell, R. Cawthon, J. De Vicente, S. Desai, M. E. da Silva Pereira, H. T. Diehl, B. Flaugher, J. Frieman, J. García-Bellido, R. A. Gruendl, G. Gutierrez, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. J. James, K. Kuehn, L. N. da Costa, O. Lahav, S. Lee, J. L. Marshall, J. Mena-Fernández, R. Miquel, J. J. Mohr, R. L. C. Ogando, A. A. Plazas Malagón, A. Porredon, S. Samuroff, E. Sanchez, B. Santiago, I. Sevilla-Noarbe, M. Smith, E. Suchyta, M. E. C. Swanson, D. Thomas, C. To, V. Vikram, A. R. Walker, N. Weaverdyck, J. Weller (DES Collaboration) Matches the version accepted by MNRAS. 18 + 3 pages. 17 figures Monthly Notices of the Royal Astronomical Society, staf2152, 2025 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present cosmological constraints from Dark Energy Survey Year 3 (DES Y3) weak lensing data using persistent homology, a topological data analysis technique that tracks how features like clusters and voids evolve across density thresholds. For the first time, we apply spherical persistent homology to galaxy survey data through the algorithm TopoS2, which is optimized for curved-sky analyses and HEALPix compatibility. Employing a simulation-based inference framework with the Gower Street simulation suite, specifically designed to mimic DES Y3 data properties, we extract topological summary statistics from convergence maps across multiple smoothing scales and redshift bins. After neural network compression of these statistics, we estimate the likelihood function and validate our analysis against baryonic feedback effects, finding minimal biases (under $0.3\\sigma$) in the $\\Omega_\\mathrm{m}-S_8$ plane. Assuming the $w$CDM model, our combined Betti numbers and second moments analysis yields $S_8 = 0.821 \\pm 0.018$ and $\\Omega_\\mathrm{m} = 0.304\\pm0.037$-constraints 70% tighter than those from cosmic shear two-point statistics in the same parameter plane. Our results demonstrate that topological methods provide a powerful and robust framework for extracting cosmological information, with our spherical methodology readily applicable to upcoming Stage IV wide-field galaxy surveys.",
      "pdf_url": "https://arxiv.org/pdf/2506.13439.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.08931",
      "title": "Cosmic Dipoles from Large-Scale Structure Surveys",
      "authors": [
        "Jaiyul Yoo",
        "Matteo Magi",
        "Dragan Huterer"
      ],
      "abstract": "Cosmic Dipoles from Large-Scale Structure Surveys Jaiyul Yoo, Matteo Magi (Zürich), Dragan Huterer (Michigan) 23 pages, 3 figures, published in PRD Phys. Rev. D 112, 123013 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO) Large-scale structure surveys can be used to measure the dipole in the cosmic microwave background (CMB), in the luminosity distances inferred from type-Ia supernova observations, and in the spatial distribution of galaxies and quasars. The measurements of these cosmic dipoles appear to be mutually inconsistent, even though they are expected to indicate the common observer velocity. This observational tension may represent a significant challenge to the standard model of cosmology. Here we study in detail what contributes to the cosmic dipoles from CMB, supernova, and galaxy survey in the standard $\\Lambda$CDM model, though our theoretical model can be applied beyond the standard model. While measurements of the cosmic dipoles yield the relative velocities between the source samples and the observer velocity, the motion of the observer is the dominant contribution in the conformal Newtonian gauge, and the intrinsic velocities of the samples fall steeply with increasing redshift of the sources. Hence the cosmic dipoles of CMB, type-Ia supernovae, and galaxies should be aligned but can have different amplitudes. We also clarify several misconceptions that are commonly found in the literature.",
      "pdf_url": "https://arxiv.org/pdf/2507.08931.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.22812",
      "title": "Biased Domain Walls and the Origin of Early Massive Structures",
      "authors": [
        "Clara Winckler",
        "Pedro P. Avelino",
        "Lara Sousa"
      ],
      "abstract": "Biased Domain Walls and the Origin of Early Massive Structures Clara Winckler, Pedro P. Avelino, Lara Sousa Phys.Rev.D 112 (2025) 12, 123506 Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Discrete symmetry-breaking phase transitions in the early universe may have caused the formation of networks of sheet-like topological defects, usually referred to as domain walls, which separate regions that have settled into different vacuum states. Field theory simulations predict the successive collapse of increasingly larger domains, which could potentially leave observable imprints in present-day large-scale structures. We use a non-parametric analytical model to provide an estimate of the final decay energy of these walls and their associated collapse rate, as a function of redshift. The energy released by collapsing walls can act as a seed for density perturbations in the background matter field, influencing structure formation. We estimate the dependence of the current mass of the resulting non-linear objects on the collapse redshift and wall tension, showing that domain walls can contribute to the formation of objects as massive as present-day galaxy clusters. Still, we confirm that the contribution of standard domain walls to structure formation is subdominant. In contrast, biased domain walls - originating in models with an approximate (or biased) discrete symmetry breaking - generally face much less stringent constraints on their tension, which allows for significantly higher collapse energies. Based on our analysis, we are able to show that the collapse of such biased wall networks can provide a significant contribution to structure formation, and, in particular, a mass excess at $z \\gtrsim 7$ as suggested by JWST data.",
      "pdf_url": "https://arxiv.org/pdf/2507.22812.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02061",
      "title": "Strong-lensing rates of massive black hole binaries in LISA",
      "authors": [
        "Juan Gutiérrez",
        "Macarena Lagos"
      ],
      "abstract": "Strong-lensing rates of massive black hole binaries in LISA Juan Gutiérrez, Macarena Lagos Phys. Rev. D 112, 123512 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO) Similarly to electromagnetic (EM) signals, gravitational lensing by intervening galaxies can also affect gravitational waves (GWs). In this paper, we estimate the strong-lensing rate of massive black hole mergers observed with LISA. Given the uncertainties in the source populations as well as in the population of galaxies at high redshift, we consider: six different source population models, including light and heavy seeds, as well as three lens population models, including redshift-independent and redshift-dependent evolution properties. Among all the scenarios explored, the expected number of strong lensed events detected in a 4-year observation time in LISA ranges between 0.13-231 with most of them having two (one) images detectable in the heavy (light) seed scenarios. The event numbers obtained correspond to 0.2%-0.9% of all detected unlensed events. Out of all the detectable strong-lensed events, up to 61% (in the light-seed scenario) and 1% (in the heavy-seed scenario) of them are above the detectability threshold solely due to strong lensing effects and would otherwise be undetectable. For detectable pairs of strong-lensed events by galaxy lenses, we also find between 72%-81% of them to have time delays from 1 week to 1 year.",
      "pdf_url": "https://arxiv.org/pdf/2510.02061.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.14464",
      "title": "Built-in precision: Improving cluster cosmology through the self-calibration of a galaxy cluster sample",
      "authors": [
        "Junhao Zhan",
        "Christian L. Reichardt"
      ],
      "abstract": "Built-in precision: Improving cluster cosmology through the self-calibration of a galaxy cluster sample Junhao Zhan, Christian L. Reichardt 8 pages, 3 figures, 1 Table, accepted for publication in Publications of the Astronomical Society of Australia (PASA) Cosmology and Nongalactic Astrophysics (astro-ph.CO) We examine the potential improvements in constraints on the dark energy equation of state parameter $w$ and matter density $\\Omega_M$ from using clustering information along with number counts for future samples of thermal Sunyaev-Zel'dovich selected galaxy clusters. We quantify the relative improvement from including the clustering power spectrum information for three cluster sample sizes from 33,000 to 140,000 clusters and for three assumed priors on the mass slope and redshift evolution of the mass-observable relation. As expected, clustering information has the largest impact when (i) there are more clusters and (ii) the mass-observable priors are weaker. For current knowledge of the cluster mass-observable relationship, we find the addition of clustering information reduces the uncertainty on the dark energy equation of state, $\\sigma(w)$, by factors of $1.023\\pm 0.007$ to $1.0790\\pm 0.011$, with larger improvements observed with more clusters. Clustering information is more important for the matter density, with $\\sigma(\\Omega_M)$ reduced by factors of $1.068 \\pm 007$ to $1.145 \\pm 0.012$. The improvement in $w$ constraints from adding clustering information largely vanishes after tightening priors on the mass-observable relationship by a factor of two. For weaker priors, we find clustering information improves the determination of the cluster mass slope and redshift evolution by factors of $1.389 \\pm 0.041$ and $1.340 \\pm 0.039$ respectively. These findings highlight that, with the anticipated surge in cluster detections from next generation surveys, self-calibration through clustering information will provide an independent cross-check on the mass slope and redshift evolution of the mass-observable relationship as well as enhancing the precision achievable from cluster cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2510.14464.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.06755",
      "title": "Redshift-Frame Systematics and Their Impact on the Hubble Constant from Pantheon+ Supernovae",
      "authors": [
        "Said Laaroua"
      ],
      "abstract": "Redshift-Frame Systematics and Their Impact on the Hubble Constant from Pantheon+ Supernovae Said Laaroua Received reviews on methodology, will be enhanced Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We perform a full-sky, covariance-weighted quantification of redshift-frame systematics in the Pantheon+ Type Ia supernova sample with the explicit goal of determining whether such effects can meaningfully bias the inferred Hubble constant. Using 1,543 unique SNe with heliocentric and CMB-frame redshifts, we detect statistically significant but physically small residuals: a monopole offset $\\langle z_{\\rm CMB} - z_{\\rm HEL}\\rangle = (-3.8 \\pm 0.1)\\times 10^{-4}$ and a kinematic dipole with amplitude $A = (1.5 \\pm 0.1)\\times 10^{-3}$ aligned to within $1^\\circ$ of the CMB dipole. When propagated through the full Pantheon+ STAT+SYS covariance matrix, these residuals shift the inferred Hubble constant by only $\\Delta H_0 = 0.07~{\\rm km,s^{-1},Mpc^{-1}}$, corresponding to about $1%$ of the present $5$--$6~{\\rm km,s^{-1},Mpc^{-1}}$ Hubble tension. This shows that redshift-frame inconsistencies in Pantheon+ cannot contribute more than a percent-level fraction of the $H_0$ discrepancy. We therefore rule out a class of proposed explanations attributing the Hubble tension to SN redshift-frame errors.",
      "pdf_url": "https://arxiv.org/pdf/2511.06755.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.15851",
      "title": "DESI-Like Hubble Expansion From Staged Symmetry Breaking",
      "authors": [
        "Zachary J. Hoelscher",
        "Thomas W. Kephart",
        "Robert J. Scherrer",
        "Kelly Holley-Bockelmann"
      ],
      "abstract": "DESI-Like Hubble Expansion From Staged Symmetry Breaking Zachary J. Hoelscher, Thomas W. Kephart, Robert J. Scherrer, Kelly Holley-Bockelmann Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) The Dark Energy Spectroscopic Instrument (DESI) second data release shows a moderate preference for dark energy with a time-varying equation of state parameter, suggesting that the standard $\\Lambda$CDM model may need to be revised. In particular, DESI favors dark energy whose equation of state parameter can drop below $-1$, violating the null energy condition. Chen and Loeb have recently suggested that this violation may be avoided if a subcomponent of the dark matter possesses a time-dependent equation of state. In this work, we present a realization of that idea which can be regarded as a more natural effective field theory. We show that such a construction not only yields dark matter with a time-varying equation of state parameter, but also naturally produces a self-interacting dark matter candidate with a velocity-dependent cross section as a consequence of gauge invariance. The second feature is relevant for addressing tensions between $\\Lambda$CDM and observations of small-scale structure, particularly the diversity of galactic rotation curves.",
      "pdf_url": "https://arxiv.org/pdf/2511.15851.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.13267",
      "title": "A catalog to unite them all: REGALADE, a revised galaxy compilation for the advanced detector era",
      "authors": [
        "Hugo Tranin",
        "Nadejda Blagorodnova",
        "Marco A. Gómez-Muñoz",
        "Maxime Wavasseur",
        "Paul J. Groot",
        "Lloyd Landsberg",
        "Fiorenzo Stoppa",
        "Steven Bloemen",
        "Paul M. Vreeswijk",
        "Daniëlle L.A. Pieterse",
        "Jan van Roestel",
        "Simone Scaringi",
        "Sara Faris"
      ],
      "abstract": "A catalog to unite them all: REGALADE, a revised galaxy compilation for the advanced detector era Hugo Tranin, Nadejda Blagorodnova, Marco A. Gómez-Muñoz, Maxime Wavasseur, Paul J. Groot, Lloyd Landsberg, Fiorenzo Stoppa, Steven Bloemen, Paul M. Vreeswijk, Daniëlle L.A. Pieterse, Jan van Roestel, Simone Scaringi, Sara Faris Accepted for publication in A&A. 18 pages including 4 pages of appendix. 18 figures. (replaced with accepted version) Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Many applications in transient science, gravitational wave follow-up, and galaxy population studies require all-sky galaxy catalogs with reliable distances, extents, and stellar masses. However, existing catalogs often lack completeness beyond $\\sim 100$ Mpc, suffer from stellar contamination, or do not provide homogeneous stellar mass estimates and size information. Our goal is to build a high-purity, high-completeness, all-sky galaxy catalog out to 2,000 Mpc, specifically designed to support time-domain and multi-messenger astrophysics. We combined major galaxy catalogs and deep imaging surveys -- including the Legacy Surveys, Pan-STARRS, DELVE, and SDSS -- and added spectroscopic, photometric, and redshift-independent distances. We cleaned the sample using the Gaia catalog to remove stars and visually inspected all ambiguous cases below 100 Mpc through a classification platform that gathered 27,000 expert votes. Stellar masses were estimated using optical and mid-infrared profile-fit photometry, and we improved the accuracy of photometric distances by combining multiple independent estimates. The resulting catalog, REGALADE, includes nearly 80 million galaxies with distances under 2,000 Mpc. It provides stellar masses for 88% of the sample and ellipse fits for 80%. REGALADE is more than 90% complete for galaxies contributing 50% of the total $r$-band luminosity out to 360 Mpc. In science tests, it recovers 60% more known supernova hosts, doubles the number of low-luminosity transient hosts, and identifies more reliable hosts for ultraluminous and hyper-luminous X-ray sources. REGALADE is one of the most complete and reliable all-sky galaxy catalog to date for the nearby Universe, built for real-world applications in transient and multi-messenger astrophysics. The full dataset, visual classifications, and code will be released to support broad community use.",
      "pdf_url": "https://arxiv.org/pdf/2508.13267.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.08896",
      "title": "Magnetic fields in galactic environments probed by Fast Radio Bursts",
      "authors": [
        "Ilya S. Khrykin",
        "Nicolas Tejos",
        "J. Xavier Prochaska",
        "Alexandra Mannings",
        "Lluis Mas-Ribas",
        "Kentaro Nagamine",
        "Khee-Gan Lee",
        "Bryan Gaensler",
        "Zhao Joseph Zhang",
        "Lucas Bernales-Cortes"
      ],
      "abstract": "Magnetic fields in galactic environments probed by Fast Radio Bursts Ilya S. Khrykin, Nicolas Tejos, J. Xavier Prochaska, Alexandra Mannings, Lluis Mas-Ribas, Kentaro Nagamine, Khee-Gan Lee, Bryan Gaensler, Zhao Joseph Zhang, Lucas Bernales-Cortes 13 pages, 8 figures, accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) FRBs constitute a unique probe of various astrophysical and cosmological environments via their characteristic dispersion and rotation (RM) measures that encode information about the ionized gas traversed by the FRB sightlines. In this work, we analyse observed RM measured for 14 localized FRBs at $0.05 \\lesssim z \\lesssim 0.5$, to infer total magnetic fields in various galactic environments. Additionally, we calculate $f_{\\rm gas}$ - the average fraction of halo baryons in the ionized CGM. We build a spectroscopic dataset of FRB foreground galaxy halos, acquired with VLT/MUSE and FLIMFLAM survey. We develop a novel Bayesian algorithm and use it to correlate the individual intervening halos with the observed RM. This approach allows us to disentangle the magnetic fields present in various environments traversed by the FRB. Our analysis yields the first direct FRB constraints on the strength of magnetic fields in the ISM and halos of the FRB host galaxies, as well as in halos of foreground galaxies. We find that the average magnetic field in the ISM of FRB hosts is $B_{\\rm host}^{\\rm local} = 5.44^{+1.13}_{-0.87}\\mu{\\rm G}$. Additionally, we place upper limits on average magnetic field in FRB host halos, $B_{\\rm host}^{\\rm halo} < 4.81\\mu{\\rm G}$, and in foreground intervening halos, $B_{\\rm f/g}^{\\rm halo} < 4.31\\mu{\\rm G}$. Moreover, we estimate the average fraction of cosmic baryons inside $10 \\lesssim \\log_{10} \\left( M_{\\rm halo} / M_{\\odot}\\right) \\lesssim 13.1$ halos $f_{\\rm gas} = 0.45^{+0.21}_{-0.19}$. We find that the magnetic fields inferred in this work are in good agreement with previous measurements. In contrast to previous studies that analysed FRB RMs and have not considered contributions from the halos of the foreground and/or FRB host galaxies, we show that they can contribute a non-negligible amount of RM and must be taken into account when analysing future FRB samples.",
      "pdf_url": "https://arxiv.org/pdf/2509.08896.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16302",
      "title": "Recovering unbiased CMB polarization maps using modern ground-based experiments with minimal assumptions about atmospheric emission",
      "authors": [
        "Simon Biquard",
        "Josquin Errard",
        "Radek Stompor"
      ],
      "abstract": "Recovering unbiased CMB polarization maps using modern ground-based experiments with minimal assumptions about atmospheric emission Simon Biquard, Josquin Errard, Radek Stompor 21 pages (main text 16), 8 figures. Version accepted for publication in PRD Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a study of unbiased reconstruction of cosmic microwave background (CMB) polarization maps from data collected by modern ground-based observatories. Atmospheric emission is a major source of correlated noise in such experiments, complicating the recovery of faint cosmological signals. We consider estimators that require minimal assumptions about unpolarized atmospheric emission properties, instead exploiting hardware solutions commonly implemented in modern instruments, such as pairs of orthogonal antennas in each focal plane pixel, and polarization signal modulation via a continuously rotating half-wave plate (HWP). We focus on two techniques: (i) statistical down-weighting of low-frequency atmospheric signals, and (ii) pair-differencing (PD), which involves differencing signals collected by two detectors in the same focal plane pixel. We compare their performance against the idealized case where the atmospheric signal is perfectly known and cleanly subtracted. We show that PD can be derived from maximum likelihood principles under general assumptions about the atmospheric signal, optimizing map sensitivity. In the absence of instrumental systematics but with reasonable detector noise variations, PD yields polarized sky maps with noise levels only slightly worse than the ideal case. While down-weighting could match this performance, it requires highly accurate atmospheric models that are not readily available. PD performance is affected by instrumental systematics, particularly those leaking atmospheric signal to the difference time stream. However, effects like gain mismatch are efficiently mitigated by a rotating HWP, making PD a competitive, robust, and efficient solution for CMB polarization mapmaking without atmospheric modeling.",
      "pdf_url": "https://arxiv.org/pdf/2509.16302.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25167",
      "title": "Vz-GAL: Probing Cold Molecular Gas in Dusty Star-forming Galaxies at z=1-6",
      "authors": [
        "Prachi Prajapati",
        "Dominik Riechers",
        "Pierre Cox",
        "Axel Weiss",
        "Amelie Saintonge",
        "Bethany Jones",
        "Tom J. L. C. Bakx",
        "Stefano Berta",
        "Paul van der Werf",
        "Roberto Neri",
        "Kirsty M. Butler",
        "Asantha Cooray",
        "Diana Ismail",
        "Andrew J. Baker",
        "Edoardo Borsato",
        "Andrew Harris",
        "Rob Ivison",
        "Matthew Lehnert",
        "Lucia Marchetti",
        "Hugo Messias",
        "Alain Omont",
        "Catherine Vlahakis",
        "Chentao Yang"
      ],
      "abstract": "Vz-GAL: Probing Cold Molecular Gas in Dusty Star-forming Galaxies at z=1-6 Prachi Prajapati, Dominik Riechers, Pierre Cox, Axel Weiss, Amelie Saintonge, Bethany Jones, Tom J. L. C. Bakx, Stefano Berta, Paul van der Werf, Roberto Neri, Kirsty M. Butler, Asantha Cooray, Diana Ismail, Andrew J. Baker, Edoardo Borsato, Andrew Harris, Rob Ivison, Matthew Lehnert, Lucia Marchetti, Hugo Messias, Alain Omont, Catherine Vlahakis, Chentao Yang Submitted on September 25, 2025; Revised on November 24, 2025; Accepted on December 1, 2025 in ApJS. Please check this https URL (and this https URL) for downloading the figures (and data products) from this cold gas catalog Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the first results of Vz-GAL, a high-redshift CO(J=1-0) large survey with the Karl G. Jansky Very Large Array, targeting 92 Herschel-selected, infrared-luminous, dusty star-forming galaxies (DSFGs) at redshifts 1 to 6. These sources are selected based on having redshifts and mid/high-J CO transitions from the NOrthern Extended Millimeter Array z-GAL survey. We successfully detect CO(J=1-0) emission in 90/92 galaxies at the expected positions and redshifts, including 9 tentative detections at $2\\sigma - 3\\sigma$ significance, and CO(J=2-1) emission in 10 of these galaxies. The CO(J=1-0) luminosities suggest apparent gas masses in the range $\\mu {M}_{\\rm H_2}$ = $(2-20) \\times {10}^{11}~(\\alpha_{CO}/{4.0})~\\mathrm{M_{\\odot}}$, which implies gas depletion times of $(50-600)$ Myr. These timescales show similar spread as local ULIRGs, suggesting a self-regulatory mechanism that maintains a consistent SFR per unit gas mass in starbursts across redshifts. To quantify the contribution of \"excitation correction\" factors to gas mass estimates, we calculate median CO line brightness temperature ratios of $r_{21}=0.88\\pm0.25$, $r_{31}=0.61\\pm0.22$, $r_{41}=0.49\\pm0.15$, $r_{51}=0.47\\pm0.13$, and $r_{61}=0.28\\pm0.13$. Accounting for these corrections results in a reduced scatter in 'gas mass$-$star formation rate' relations. We also find a median log(${L}^{\\prime}_{\\mathrm{[CI]}(^{3}P_1 - ^{3}P_0)}/{L}^{\\prime}_{\\mathrm{CO}(J=1-0)})=-0.71\\pm0.12$ for a subsample of 23 sources, consistent with the ratios derived for local star-forming galaxies. Together, our findings are in agreement with common conditions in the cold gas reservoirs among star-forming galaxies over a broad range in star formation modes, efficiencies, and scales.",
      "pdf_url": "https://arxiv.org/pdf/2509.25167.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05194",
      "title": "Lagrangian versus Eulerian Methods for Toroidally-Magnetized Isothermal Disks",
      "authors": [
        "Yashvardhan Tomar",
        "Philip F. Hopkins"
      ],
      "abstract": "Lagrangian versus Eulerian Methods for Toroidally-Magnetized Isothermal Disks Yashvardhan Tomar, Philip F. Hopkins 4 pages, 1 figure. Submitted to The Open Journal of Astrophysics. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM); Plasma Physics (physics.plasm-ph) A number of simulations have seen the emergence of strongly-toroidally-magnetized accretion disks from interstellar medium inflows. Recently, Guo et al. 2025 (G25) studied an idealized test problem of toroidally-magnetized disks in isothermal ideal MHD with an Eulerian static-mesh method, and argued the midplane behavior changes qualitatively (with a significant loss of toroidal magnetic flux) when the the thermal scale-length is resolved ($\\Delta x < H_{\\rm thermal}$). We rerun the G25 test problem with two Lagrangian methods: meshless finite-mass, and meshless finite-volume. We show that Lagrangian methods reproduce the high-resolution ($\\Delta x \\ll H_{\\rm thermal}$) Eulerian G25 results. At low resolution ($\\Delta x \\gg H_{\\rm thermal}$), behaviors differ: Lagrangian methods still lose flux and evolve 'as close as possible' to the converged solution, while Eulerian methods show no evolution. We argue this difference in convergence behavior is related to the ability of Lagrangian codes to follow flows to an arbitrarily thin midplane layer, analogous to the well-studied difference in Jeans fragmentation problems. This and results from other higher-resolution simulations and different codes suggest that the sustained midplane toroidal fields seen in recent Lagrangian multi-scale, multi-physics simulations cannot be a numerical resolution effect, and some physical difference between those simulations and the G25 test problem explains their different behaviors.",
      "pdf_url": "https://arxiv.org/pdf/2512.05194.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05218",
      "title": "Two Step Localization Method for Electromagnetic Followup of LIGO-Virgo-KAGRA Gravitational-Wave Triggers",
      "authors": [
        "Daniel Skorohod",
        "Ofek Birnholtz"
      ],
      "abstract": "Two Step Localization Method for Electromagnetic Followup of LIGO-Virgo-KAGRA Gravitational-Wave Triggers Daniel Skorohod, Ofek Birnholtz High Energy Astrophysical Phenomena (astro-ph.HE) Rapid detection and follow-up of electromagnetic (EM) counterparts to gravitational wave (GW) signals from binary neutron star (BNS) mergers are essential for constraining source properties and probing the physics of relativistic transients. Observational strategies for these early EM searches are therefore critical, yet current practice remains suboptimal, motivating improved, coordination-aware approaches. We propose and evaluate the Two-Step Localization strategy, a coordinated observational protocol in which one wide-field auxiliary telescope and one narrow-field main telescope monitor the evolving GW sky localization in real time. The auxiliary telescope, by virtue of its large field of view, has a higher probability of detecting early EM emission. Upon registering a candidate signal, it triggers the main telescope to slew to the inferred location for prompt, high-resolution follow-up. We assess the performance of Two-Step Localization using large-scale simulations that incorporate dynamic sky-map updates, realistic telescope parameters, and signal-to-noise ratio (SNR)-weighted localization contours. For context, we compare Two-Step Localization to two benchmark strategies lacking coordination. Our results demonstrate that Two-Step Localization significantly reduces the median detection latency, highlighting the effectiveness of targeted cooperation in the early-time discovery of EM counterparts. Our results point to the most impactful next step: next-generation faster telescopes that deliver drastically higher slew rates and shorter scan times, reducing the number of required tiles; a deeper, truly wide-field auxiliary improves coverage more than simply adding more telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2512.05218.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.05220",
      "title": "Multiple outflows and delayed ejections revealed by early imaging of novae",
      "authors": [
        "Elias Aydi",
        "John D. Monnier",
        "Antoine Mérand",
        "Gail H. Schaefer",
        "Laura Chomiuk",
        "Magdalena Otulakowska-Hypka",
        "Jhih-Ling Fan",
        "Kwan Lok Li",
        "Kirill V. Sokolovsky",
        "Ricardo Salinas",
        "Michael Tucker",
        "Benjamin Shappee",
        "Richard Rudy",
        "Kim L. Page",
        "N. Paul M. Kuin",
        "David A. H. Buckley",
        "Peter Craig",
        "Luca Izzo",
        "Justin Linford",
        "Brian D. Metzger",
        "Koji Mukai",
        "Marina Orio",
        "Ken J. Shen",
        "Jay Strader",
        "Jennifer L. Sokoloski",
        "Robert E. Williams",
        "Montana N. Williams",
        "Gesesew R. Habtie",
        "Stefan Kraus",
        "Narsireddy Anugu",
        "Jean-Baptiste Le Bouquin",
        "Sorabh Chhabra",
        "Isabelle Codron",
        "Tyler Gardner",
        "Mayra Gutierrez",
        "Noura Ibrahim",
        "Cyprien Lanthermann",
        "Benjamin R. Setterholm",
        "Christopher Ashall",
        "Jason T. Hinkle",
        "Thomas de Jaeger",
        "Anna V. Payne"
      ],
      "abstract": "Multiple outflows and delayed ejections revealed by early imaging of novae Elias Aydi, John D. Monnier, Antoine Mérand, Gail H. Schaefer, Laura Chomiuk, Magdalena Otulakowska-Hypka, Jhih-Ling Fan, Kwan Lok Li, Kirill V. Sokolovsky, Ricardo Salinas, Michael Tucker, Benjamin Shappee, Richard Rudy, Kim L. Page, N. Paul M. Kuin, David A. H. Buckley, Peter Craig, Luca Izzo, Justin Linford, Brian D. Metzger, Koji Mukai, Marina Orio, Ken J. Shen, Jay Strader, Jennifer L. Sokoloski, Robert E. Williams, Montana N. Williams, Gesesew R. Habtie, Stefan Kraus, Narsireddy Anugu, Jean-Baptiste Le Bouquin, Sorabh Chhabra, Isabelle Codron, Tyler Gardner, Mayra Gutierrez, Noura Ibrahim, Cyprien Lanthermann, Benjamin R. Setterholm, Christopher Ashall, Jason T. Hinkle, Thomas de Jaeger, Anna V. Payne 62 pages, 29 Figures, 6 Tables, Published in Nature Astronomy High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Novae are thermonuclear eruptions on accreting white dwarfs in interacting binaries. Although most of the accreted envelope is expelled, the mechanism -- impulsive ejection, multiple outflows or prolonged winds, or a common-envelope interaction -- remains uncertain. GeV $\\gamma$-ray detections from $>20$ Galactic novae establish these eruptions as nearby laboratories for shock physics and particle acceleration, underscoring the need to determine how novae eject their envelopes. Here we report on near-infrared interferometry, supported with multiwavelength observations, of two $\\gamma$-ray detected novae. The images of the very fast 2021 nova V1674~Her, taken just 2--3 days after discovery, reveal the presence of two perpendicular outflows. The interaction between these outflows likely drives the observed $\\gamma$-ray emission. Conversely, the images of the very slow 2021 nova V1405~Cas suggest a delay in the ejection of the bulk of the accreted envelope of more than 50 days after the start of eruption, as the nova slowly rises to visible peak and during which the envelope engulfed the system in a common envelope phase. These unprecedented images offer direct observational evidence that the mechanisms driving mass ejection from the surfaces of accreting white dwarfs are not as simple as previously thought, revealing multiple outflows and delayed ejections.",
      "pdf_url": "https://arxiv.org/pdf/2512.05220.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05281",
      "title": "Absorption of strong electromagnetic waves in magnetized pair plasmas",
      "authors": [
        "Emanuele Sobacchi"
      ],
      "abstract": "Absorption of strong electromagnetic waves in magnetized pair plasmas Emanuele Sobacchi 6 pages, accepted for publication by PRE High Energy Astrophysical Phenomena (astro-ph.HE) We discuss synchrotron absorption of a short electromagnetic pulse that propagates in a cold magnetized pair plasma. We show that the pulse can be absorbed when $\\omega_{\\rm B}/a_0< \\omega< a_0\\omega_{\\rm B}$, where $a_0>1$ is the strength parameter of the pulse, and $\\omega$ and $\\omega_{\\rm B}$ respectively are the frequency of the wave and the cyclotron frequency in the background magnetic field (all quantities are defined in the reference frame where the particles are at rest before being illuminated by the pulse). The condition $\\omega_{\\rm B}/a_0< \\omega< a_0\\omega_{\\rm B}$ is essentially a generalization of the cyclotron resonance to strong electromagnetic pulses with $a_0>1$. When $\\omega_{\\rm B}/a_0< \\omega< a_0\\omega_{\\rm B}$, the propagation of electromagnetic waves in a plasma can be very different with respect to the propagation in vacuum because the wave equation is strongly non-linear. Then it is unclear whether the particles are heated stochastically due to synchrotron absorption, as found by studying the motion of a test particle in the field of a vacuum electromagnetic wave. We discuss implications of our results for constraining emission models of fast radio bursts.",
      "pdf_url": "https://arxiv.org/pdf/2512.05281.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05315",
      "title": "Nuclear parameter inference with semi-agnostic priors",
      "authors": [
        "Lami Suleiman",
        "Anthea F. Fantina",
        "Francesca Gulminelli",
        "Jocelyn Read"
      ],
      "abstract": "Nuclear parameter inference with semi-agnostic priors Lami Suleiman, Anthea F. Fantina, Francesca Gulminelli, Jocelyn Read High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) Radio pulsar timing, X-ray pulse profile modeling or gravitational-wave detections of binary mergers involving at least one neutron star offer the opportunity to elucidate the properties of dense and neutron rich matter in thermodynamic regimes inaccessible to nuclear laboratories. Such inference relies on building appropriate equation-of-state priors, such as the recently introduced semi-agnostic constructions that incorporate nuclear theory and experimental information available in low to intermediate density regimes, while offering the necessary flexibility at high density. In this paper, we assess how detections of mass, radius, and tidal deformability for low-mass ($\\sim 1$M$_{\\odot}$) or high-mass ($\\sim 1.9$M$_{\\odot}$) neutron stars would contribute to constraining nuclear empirical parameters in an inference based on semi-agnostic equation-of-state priors. We first assessed the correlation factors between nuclear empirical parameters and the zero-temperature and $\\beta$-equilibrated pressure in different regimes of density. We then simulate observations for three nucleonic equations of state to test the recovery of the corresponding nuclear empirical parameters. We show that not all nuclear empirical parameters significantly correlate with the pressure and find a competition between them in the high-density regime that challenges their inference. We also find that using semi-agnostic constructions instead of assuming a nucleonic content up to the highest densities in the neutron-star core can help recover more accurately the true nuclear empirical parameters. Parameterizing the high-density regime of the equation of state with the nucleonic meta-model can pollute the inference of nuclear empirical parameters; semi-agnostic constructions are a solution to that. However, many nuclear matter empirical parameters contribute in a similar way to the building of baryonic pressure.",
      "pdf_url": "https://arxiv.org/pdf/2512.05315.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.05448",
      "title": "A Persistently Active Fast Radio Burst source Embedded in an Expanding Supernova Remnant",
      "authors": [
        "Chen-Hui Niu",
        "Di Li",
        "Yuan-Pei Yang",
        "Yuhao Zhu",
        "Yongkun Zhang",
        "Jia-heng Zhang",
        "Zexin Du",
        "Jumei Yao",
        "Xiaoping Zheng",
        "Pei Wang",
        "Yi Feng",
        "Bing Zhang",
        "Weiwei Zhu",
        "Wenfei Yu",
        "Ji-an Jiang",
        "Shi Dai",
        "Chao-Wei Tsai",
        "A. M. Chen",
        "Yijun Hou",
        "Jiarui Niu",
        "Weiyang Wang",
        "Chenchen Miao",
        "Xinming Li",
        "Junshuo Zhang"
      ],
      "abstract": "A Persistently Active Fast Radio Burst source Embedded in an Expanding Supernova Remnant Chen-Hui Niu, Di Li, Yuan-Pei Yang, Yuhao Zhu, Yongkun Zhang, Jia-heng Zhang, Zexin Du, Jumei Yao, Xiaoping Zheng, Pei Wang, Yi Feng, Bing Zhang, Weiwei Zhu, Wenfei Yu, Ji-an Jiang, Shi Dai, Chao-Wei Tsai, A. M. Chen, Yijun Hou, Jiarui Niu, Weiyang Wang, Chenchen Miao, Xinming Li, Junshuo Zhang High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs) remain one of the most puzzling astrophysical phenomena. While most FRBs are detected only once or sporadically, we present the identification of FRB 20190520B as the first persistently active source over a continuous span of ~ four years. This rare long-term activity enabled a detailed investigation of its dispersion measure (DM) evolution. We also report that FRB 20190520B exhibits a substantial decrease in DM at a global rate of minus 12.4 plus or minus 0.3 pc cm^-3 yr^-1, exceeding previous FRB DM variation measurements by a factor of three and surpassing those observed in pulsars by orders of magnitude. The magnitude and consistency of the DM evolution, along with a high host DM contribution, strongly indicate that the source resides in a dense, expanding ionized medium, likely a young supernova remnant (SNR).",
      "pdf_url": "https://arxiv.org/pdf/2512.05448.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05493",
      "title": "Search for UHE gamma photons in cosmic rays by studying the geomagnetic influence on air-shower muons",
      "authors": [
        "Animesh Basak",
        "Meghamani Haldar",
        "Kishor Chaudhury",
        "Rajat K. Dey"
      ],
      "abstract": "Search for UHE gamma photons in cosmic rays by studying the geomagnetic influence on air-shower muons Animesh Basak, Meghamani Haldar, Kishor Chaudhury, Rajat K. Dey High Energy Astrophysical Phenomena (astro-ph.HE) A major challenge in ground-based ultra-high-energy gamma-ray observations remains in discriminating sporadic gamma-ray signals from a huge background of cosmic-ray events. To achieve good discrimination power of gamma rays against protons, an unconventional approach is presented that exploits the geomagnetic influence on air shower muons in Monte Carlo shower events. A recognizable polar asymmetry in the positive and negative muon distributions is noticed after transforming the impact coordinates of each muon from the observer plane onto the shower front plane, plus a judicious ignoring of the minimal attenuation of muons in the space between the two planes. A couple of observables, $d_{\\text{max}}$ and $N_{\\mu; \\text{IQS}}^{\\text{tr.}}$, can be extracted from the formation of two densely populated positive and negative muon zones in each shower. Both observables demonstrate excellent gamma/proton discrimination power, with efficiencies of $93.2\\%$ and $98.6\\%$. This analysis permitted the usage of muon detectors just covering a small area of $\\simeq{1.4}\\%$ of a square-km array for ultra-high-energy gamma-ray observations. It is expected that the present and future gamma-ray observatories will implement the current approach.",
      "pdf_url": "https://arxiv.org/pdf/2512.05493.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05544",
      "title": "Evolution of the Inner Accretion Flow in Swift J1727.8$-$1613 across Intermediate States: Insights from Broadband Spectral and Timing Analysis",
      "authors": [
        "Swadesh Chand",
        "Andrzej A. Zdziarski",
        "Gulab C. Dewangan",
        "Pragati Sahu"
      ],
      "abstract": "Evolution of the Inner Accretion Flow in Swift J1727.8$-$1613 across Intermediate States: Insights from Broadband Spectral and Timing Analysis Swadesh Chand, Andrzej A. Zdziarski, Gulab C. Dewangan, Pragati Sahu 21 pages, 8 figures, submitted to ApJ after first revision High Energy Astrophysical Phenomena (astro-ph.HE) We present a comprehensive broadband spectral and variability study of the newly detected black hole X-ray binary Swift~J1727.8--1613 in the intermediate states during its 2023 outburst, using multi-mission observations from NICER, NuSTAR, AstroSat, and Insight-HXMT. The spectral data up to $78$ keV in the hard-intermediate state (HIMS) requires models with two Comptonizing regions. In contrast, models with a single Comptonizing region adequately describe the soft-intermediate states (SIMS), implying a significant evolution in the disk-corona geometry between the states. The hard X-ray tail above $100$ keV in the HIMS, detected with both AstroSat/CZTI and Insight-HXMT/HE, indicates that the electron population in the corona is not purely thermal but rather hybrid, with a power-law distribution above the thermal cutoff. While both the reflection modeling and disk continuum fitting favor a truncated disk geometry in the HIMS, the disk substantially moves close to the innermost stable circular orbit in the SIMS, accompanied by a significant rise in the disk temperature. This interpretation is further supported by the increase in the QPO frequency from $\\sim1.3$ to $\\sim6.6$ Hz. From joint modeling of the disk continuum and reflection component, we estimate a black hole mass of $10.5^{+7.7}_{-3.0}$, spin of $0.79^{+0.03}_{-0.13}$, and disk inclination angle of $42^\\circ$-$50^\\circ$, which match well with the previously reported spectro-polarimetric measurements. The inferred source distance of $\\sim3.5$ kpc is consistent with the recent estimate based on optical spectroscopy. We find a weakly variable or stable disk and a highly variable Comptonized component.",
      "pdf_url": "https://arxiv.org/pdf/2512.05544.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05634",
      "title": "CTAO LST-1 observations of magnetar SGR 1935+2154: Deep limits on sub-second bursts and persistent tera-electronvolt emission",
      "authors": [
        "K. Abe",
        "S. Abe",
        "A. Abhishek",
        "F. Acero",
        "A. Aguasca-Cabot",
        "I. Agudo",
        "C. Alispach",
        "D. Ambrosino",
        "F. Ambrosino",
        "L. A. Antonelli",
        "C. Aramo",
        "A. Arbet-Engels",
        "C. Arcaro",
        "T.T.H. Arnesen",
        "K. Asano",
        "P. Aubert",
        "A. Baktash",
        "M. Balbo",
        "A. Bamba",
        "A. Baquero Larriva",
        "U. Barres de Almeida",
        "J. A. Barrio",
        "L. Barrios Jiménez",
        "I. Batkovic",
        "J. Baxter",
        "J. Becerra González",
        "E. Bernardini",
        "J. Bernete",
        "A. Berti",
        "I. Bezshyiko",
        "C. Bigongiari",
        "E. Bissaldi",
        "O. Blanch",
        "G. Bonnoli",
        "P. Bordas",
        "G. Borkowski",
        "G. Brunelli",
        "A. Bulgarelli",
        "M. Bunse",
        "I. Burelli",
        "L. Burmistrov",
        "M. Cardillo",
        "S. Caroff",
        "A. Carosi",
        "R. Carraro",
        "M. S. Carrasco",
        "F. Cassol",
        "N. Castrejón",
        "D. Cerasole",
        "G. Ceribella",
        "A. Cerviño Cortínez",
        "Y. Chai",
        "K. Cheng",
        "A. Chiavassa",
        "M. Chikawa",
        "G. Chon",
        "L. Chytka",
        "G. M. Cicciari",
        "A. Cifuentes",
        "J. L. Contreras",
        "J. Cortina",
        "H. Costantini",
        "M. Dalchenko",
        "P. Da Vela",
        "F. Dazzi",
        "A. De Angelis",
        "M. de Bony de Lavergne",
        "R. Del Burgo",
        "C. Delgado",
        "J. Delgado Mengual",
        "M. Dellaiera",
        "D. della Volpe",
        "B. De Lotto",
        "L. Del Peral",
        "R. de Menezes",
        "G. De Palma",
        "C. Díaz",
        "A. Di Piano",
        "F. Di Pierro",
        "R. Di Tria",
        "L. Di Venere",
        "R. M. Dominik",
        "D. Dominis Prester",
        "A. Donini",
        "D. Dorner",
        "M. Doro",
        "L. Eisenberger",
        "D. Elsässer",
        "G. Emery",
        "J. Escudero",
        "V. Fallah Ramazani",
        "F. Ferrarotto",
        "A. Fiasson",
        "L. Foffano",
        "F. Frías García-Lago",
        "S. Fröse",
        "Y. Fukazawa",
        "S. Gallozzi",
        "R. Garcia López",
        "S. Garcia Soto"
      ],
      "abstract": "CTAO LST-1 observations of magnetar SGR 1935+2154: Deep limits on sub-second bursts and persistent tera-electronvolt emission K. Abe (1), S. Abe (2), A. Abhishek (3), F. Acero (4, 5), A. Aguasca-Cabot (6), I. Agudo (7), C. Alispach (8), D. Ambrosino (9), F. Ambrosino (10), L. A. Antonelli (10), C. Aramo (9), A. Arbet-Engels (11), C. Arcaro (12), T.T.H. Arnesen (13), K. Asano (2), P. Aubert (14), A. Baktash (15), M. Balbo (8), A. Bamba (16), A. Baquero Larriva (17, 18), U. Barres de Almeida (19), J. A. Barrio (17), L. Barrios Jiménez (13), I. Batkovic (12), J. Baxter (2), J. Becerra González (13), E. Bernardini (12), J. Bernete (20), A. Berti (11), I. Bezshyiko (21), C. Bigongiari (10), E. Bissaldi (22), O. Blanch (23), G. Bonnoli (24), P. Bordas (6), G. Borkowski (25), G. Brunelli (26, 27), A. Bulgarelli (26), M. Bunse (28), I. Burelli (29), L. Burmistrov (21), M. Cardillo (30), S. Caroff (14), A. Carosi (10), R. Carraro (10), M. S. Carrasco (31), F. Cassol (31), N. Castrejón (32), D. Cerasole (33), G. Ceribella (11), A. Cerviño Cortínez (17), Y. Chai (11), K. Cheng (2), A. Chiavassa (34, 35), M. Chikawa (2), G. Chon (11), L. Chytka (36), G. M. Cicciari (37, 38), A. Cifuentes (20), J. L. Contreras (17), J. Cortina (20), H. Costantini (31), M. Dalchenko (21), P. Da Vela (26), F. Dazzi (10), A. De Angelis (12), M. de Bony de Lavergne (39), R. Del Burgo (9), C. Delgado (20), J. Delgado Mengual (40), M. Dellaiera (14), D. della Volpe (21), B. De Lotto (29), L. Del Peral (32), R. de Menezes (34), G. De Palma (22), C. Díaz (20), A. Di Piano (26), F. Di Pierro (34), R. Di Tria (33), L. Di Venere (41), R. M. Dominik (42), D. Dominis Prester (43), A. Donini (10), D. Dorner (44), M. Doro (12), L. Eisenberger (44), D. Elsässer (42), G. Emery (31), J. Escudero (7), V. Fallah Ramazani (45, 46), F. Ferrarotto (47), A. Fiasson (14, 48), L. Foffano (30), F. Frías García-Lago (13), S. Fröse (42), Y. Fukazawa (49), S. Gallozzi (10), R. Garcia López (13), S. Garcia Soto 13 pages, 5 figures. Accepted for publication in Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) The Galactic magnetar SGR 1935+2154 has exhibited prolific high-energy (HE) bursting activity in recent years. Investigating its potential tera-electronvolt counterpart could provide insights into the underlying mechanisms of magnetar emission and very high-energy (VHE) processes in extreme astrophysical environments. We aim to search for a possible tera-electronvolt counterpart to both its persistent and sub-second-scale burst emission. We analysed over 25 h of observations from the Large-Sized Telescope prototype (LST-1) of the Cherenkov Telescope Array Observatory (CTAO) during periods of HE activity from SGR 1935+2154 in 2021 and 2022 to search for persistent emission. For bursting emission, we selected and analysed nine 0.1 s time windows centred around known short X-ray bursts, targeting potential sub-second-scale tera-electronvolt counterparts in a low-photon-statistics regime. While no persistent or bursting emission was detected in our search, we establish upper limits for the tera-electronvolt emission of a short magnetar burst simultaneous to its soft gamma-ray flux. Specifically, for the brightest burst in our sample, the ratio between tera-electronvolt and X-ray flux is less than $10^{-3}$. The non-detection of either persistent or bursting tera-electronvolt emission from SGR 1935+2154 suggests that if such components exist, they may occur under specific conditions not covered by our observations. This aligns with theoretical predictions of VHE components in magnetar-powered fast radio bursts and the detection of MeV - GeV emission in giant magnetar flares. These findings underscore the potential of magnetars, fast radio bursts, and other fast transients as promising candidates for future observations in the low-photon-statistics regime with Imaging Atmospheric Cherenkov Telescopes, particularly with the CTAO.",
      "pdf_url": "https://arxiv.org/pdf/2512.05634.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05739",
      "title": "The X-ray/UV Connection in NGC 5548: A Rapidly Varying Corona",
      "authors": [
        "M. Papoutsis",
        "I. E. Papadakis",
        "C. Panagiotou",
        "E. Kammoun",
        "M. Dovciak"
      ],
      "abstract": "The X-ray/UV Connection in NGC 5548: A Rapidly Varying Corona M. Papoutsis, I. E. Papadakis, C. Panagiotou, E. Kammoun, M. Dovciak 7 pages, 4 figures, Accepted for publication in Astronomy & Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Recent intensive monitoring campaigns of active galactic nuclei (AGN) have provided simultaneous X-ray, UV, and optical data of unprecedented quality. The observations reveal a strong correlation between the UV and optical variability, but a weaker correlation between the X-ray and UV bands, challenging the standard X-ray reprocessing scenario. We revisit the X-ray/UV connection in NGC 5548 by fitting archival 2014 HST and Swift/XRT light curves assuming X-ray reverberation from a dynamically evolving X-ray corona. Our results show that, as long as the corona height, photon index and power vary over time, X-ray reverberation can explain the observed UV and optical variability within 2% and 5%, respectively (on average). The evolution of the best-fit parameters suggests that fast changes in coronal geometry and energetics on a time scale of days are required to explain the observed variability.",
      "pdf_url": "https://arxiv.org/pdf/2512.05739.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05807",
      "title": "SRG/eROSITA-SDSS view on the relation between X-ray and UV emission for quasars",
      "authors": [
        "S. A. Prokhorenko",
        "S. Yu. Sazonov",
        "M. R. Gilfanov",
        "S. A. Balashev",
        "A. V. Meshcheryakov",
        "A. V. Ivanchik",
        "I. F. Bikmaev",
        "R. A. Sunyaev"
      ],
      "abstract": "SRG/eROSITA-SDSS view on the relation between X-ray and UV emission for quasars S. A. Prokhorenko, S. Yu. Sazonov, M. R. Gilfanov, S. A. Balashev, A. V. Meshcheryakov, A. V. Ivanchik, I. F. Bikmaev, R. A. Sunyaev Submitted to Journal of High Energy Astrophysics, 29 pages, 5 tables, 18 figures High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Motivated by the idea of using quasars as standardizable candles for cosmology, we examine the relation between X-ray (at 2 keV, $L_{\\rm 2keV}$) and ultraviolet (at 2500 Angstrom, $L_{\\rm 2500}$) monochromatic luminosities of quasars using a sample of 2414 X-ray sources from the SRG/eROSITA all-sky survey cross-matched with the Sloan Digital Sky Survey data release 16 quasar catalogue (SDSS DR16Q), at redshifts between 0.5 and 2.5. These objects are bright both in X-rays and in the optical, so that the sample is characterized by nearly 100% statistical completeness. We have developed a new method for determining the $L_{\\rm 2keV}-L_{\\rm 2500}$ relation, which consistently takes into account (i) X-ray and UV flux limited object selection, (ii) X-ray and UV variability of quasars, and (iii) the decreasing space density of quasars with increasing luminosity. Assuming a linear relation between $l_{\\rm X}\\equiv\\log(L_{\\rm 2keV}/[{\\rm erg\\,s^{-1}\\,Hz^{-1}}])$ and $l_{\\rm UV}\\equiv\\log(L_{\\rm 2500}/[{\\rm erg\\,s^{-1}\\,Hz^{-1}}])$, we find the slope, $\\gamma=0.69\\pm0.02$ (hereafter all uncertainties are quoted at the 68% confidence level), and normalization, $l_{\\rm X}=26.45\\pm0.02$ at $l_{\\rm UV}=30.5$, of the $L_{\\rm 2keV}$ ($L_{\\rm 2500}$) dependence. These values are not substantially different from the results of previous studies. A key novel aspect of our work is allowance for intrinsic scatter (which adds to the dispersion induced by quasar variability and flux measurement uncertainties) of the $L_{\\rm 2keV}-L_{\\rm 2500}$ relation in both variables, i.e. in X-ray and UV luminosity. The intrinsic X-ray scatter ($\\sigma^2_{\\rm intX}=0.066\\pm0.005$) strongly dominates over the UV one ($\\sigma^2_{\\rm intUV}=0.001^{+0.003}_{-0.001}$). Further studies should seek to explain this behaviour in terms of accretion onto supermassive black holes and orientation of quasars with respect to the observer.",
      "pdf_url": "https://arxiv.org/pdf/2512.05807.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05839",
      "title": "Hadronic Emissions from the Microquasar V4641 Sgr, SS433, and its implications in the Diffuse Galactic Emission",
      "authors": [
        "Basanti Paul",
        "Abhijit Roy",
        "Jagdish C. Joshi",
        "Debanjan Bose"
      ],
      "abstract": "Hadronic Emissions from the Microquasar V4641 Sgr, SS433, and its implications in the Diffuse Galactic Emission Basanti Paul, Abhijit Roy, Jagdish C. Joshi, Debanjan Bose High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Microquasars (MQs) are Galactic binary systems, consisting of a star and a compact object, a neutron star or a stellar mass black hole, which accretes matter from its companion star and gives rise to relativistic jets. Recent detection of very-high-energy (VHE; $E \\gtrsim 100,\\text{GeV}$) and ultra-high-energy (UHE; $E \\gtrsim 100,\\text{TeV}$) gamma-rays by LHAASO, HAWC and HESS from the MQ V4641 Sgr and SS 433 suggests them as Galactic PeVatrons. In this work, we studied a hadronic origin of the observed TeV-PeV gamma-ray emission from these MQs. We considered the hadronic scenario where the gamma-rays are produced by the interaction of relativistic protons in the MQ jet with the stellar wind. We fitted our model with observed data and constrained physical parameters like the hadronic jet power fraction, the proton spectral index, the maximum proton energy and the jet bulk Lorentz factor. Our best-fit model shows hard proton spectra ($1.84-2.44$) and maximum proton energies between 1 and 5 PeV. We also estimated the all-flavor neutrino fluxes corresponding to the gamma-ray fluxes from the hadronic model and found that V4641 sgr can be detected by next-generation neutrino telescopes like KM3NeT-ARCA and TRIDENT. Furthermore, we modeled a synthetic population of Galactic MQs and estimated their contribution to the diffuse TeV-PeV gamma-ray flux. For the inner Galaxy PSR contribution dominates in the range 10-100 TeV, and above 100 TeV diffused cosmic ray interactions with the molecular clouds is most dominant. We find that a population $\\sim 14$ MQs is required to explain the LHAASO data above 100 TeV. For the outer Galaxy, we show that MQs are the dominant class of sources, and we constrain their population $\\sim$14. Our findings strongly suggest that MQs are efficient particle accelerators, contributing to Galactic PeVatrons and potential multimessenger sources in our Galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2512.05839.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.04175",
      "title": "Global Kinetic Simulations of Monster Shocks and Their Emission",
      "authors": [
        "Dominic Bernardi",
        "Yajie Yuan",
        "Alexander Y. Chen"
      ],
      "abstract": "Global Kinetic Simulations of Monster Shocks and Their Emission Dominic Bernardi, Yajie Yuan, Alexander Y. Chen 9 pages with 4 figures and 3 pages of supplemental materials with 2 figures High Energy Astrophysical Phenomena (astro-ph.HE) Fast magnetosonic waves are one of the two low-frequency plasma modes that can exist in a neutron star magnetosphere. It was recently realized that these waves may become nonlinear within the magnetosphere and steepen into some of the strongest shocks in the universe. These shocks, when in the appropriate parameter regime, may emit GHz radiation in the form of precursor waves. We present the first global Particle-in-Cell simulations of the nonlinear steepening of fast magnetosonic waves in a dipolar magnetosphere, and quantitatively demonstrate the strong plasma acceleration in the upstream of these shocks. In these simulations, we observe the production of precursor waves in a finite angular range. Using analytic scaling relations, we predict the expected frequency, power, and duration of this emission. Within a reasonable range of progenitor wave parameters, these precursor waves can reproduce many aspects of FRB observations.",
      "pdf_url": "https://arxiv.org/pdf/2506.04175.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.20193",
      "title": "Microquasar jet-cocoon systems as PeVatrons",
      "authors": [
        "B. Theodore Zhang",
        "Shigeo S. Kimura",
        "Kohta Murase"
      ],
      "abstract": "Microquasar jet-cocoon systems as PeVatrons B. Theodore Zhang, Shigeo S. Kimura, Kohta Murase 11 pages, 8 figures, accepted for publication in PRD High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph) The origin of Galactic cosmic rays (CRs), particularly around the knee region ($\\sim$3 PeV), remains a major unsolved question. Recent observations by LHAAASO suggest that the knee is shaped mainly by protons, with a transition to heavier elements at higher energies. Microquasars -- compact jet-emitting sources -- have emerged as possible PeV CR accelerators, especially after detections of ultrahigh-energy gamma rays from these systems. We propose that the observed proton spectrum (hard below a few PeV, steep beyond) arises from the reacceleration of sub-TeV Galactic CRs via shear acceleration in large-scale microquasar jet-cocoon structures. Our model also naturally explains the observed spectrum of energies around a few tens of PeV by summing up heavier nuclei contributions. Additionally, similar reacceleration processes in radio galaxies can contribute to ultrahigh-energy CRs, bridging Galactic and extragalactic origins. Combined with low-energy CRs from supernova remnants and galaxy clusters around the second knee region, this scenario could provide a unified explanation for CRs across the entire energy spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2506.20193.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ex",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.04872",
      "title": "The demographics of core-collapse supernovae. The role of binary evolution and CSM interaction",
      "authors": [
        "Andrea Ercolino",
        "Harim Jin",
        "Norbert Langer",
        "Avishay Gal-Yam",
        "Abel Schootemeijer",
        "Caroline Mannes"
      ],
      "abstract": "The demographics of core-collapse supernovae. The role of binary evolution and CSM interaction Andrea Ercolino, Harim Jin, Norbert Langer, Avishay Gal-Yam, Abel Schootemeijer, Caroline Mannes 20 pages, 13 figures. Updated following referee report. Accepted to Astronomy and Astrophysics. Abstract is abridged Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) The observational properties of core-collapse supernovae (CC-SNe) are shaped by the envelopes of their progenitors. In massive binary systems, mass-transfer alters the pre-SN structures compared to single stars, leading to a diversity in SN explosions. Aims. We compute the distribution of CC-SN properties based on comprehensive detailed grids of single and binary stellar evolution models. We conduct a grid-based population synthesis to produce a synthetic population of CC-SNe, and compare it to observed SN samples. We also apply various explodability and merger criteria to our models. In line with earlier results, we identify interacting SN progenitors as those stars that undergo CC during or shortly after a Roche-lobe overflow phase. With an interacting binary fraction of 68%, our models predict two-thirds of all CC-SNe to be of Type IIP/L, and one third of Type Ibc, in agreement with recent volume-limited SN surveys. We find that 76% of the Type Ibc SN progenitors took part in a previous binary mass transfer (mostly as mass donor), but also 63% of the Type IIP/L SN progenitors (mostly as mass gainers), yielding a much broader envelope mass distribution than expected from single stars. We find that mass-transfer induced interacting SNe make up ~5% of all CC-SNe, which is close to the observed fractions of Type IIn and Type Ibn SNe. When assuming a disk or toroidal CSM geometry for Type IIn SNe, our models predict a bimodal distribution of the radiated energies, similar to that deduced from observations. While we find the effect of binary evolution on the relative number of Type Ibc and Type IIP/L SNe to be moderate, it leads to lower average ejecta masses in Type Ibc and Type IIb SNe, and can lead to higher pre-SN masses in Type IIP/L SNe than single stars. Binary models are also able to reproduce the number and properties of interacting SNe.",
      "pdf_url": "https://arxiv.org/pdf/2510.04872.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.03415",
      "title": "Building a Radio AGN Sample from Cosmic Morning -- The Radio High-Redshift Quasar Catalog (RHzQCat): I. Catalog from SDSS Quasars and Radio Surveys at $z > 3$",
      "authors": [
        "Yingkang Zhang",
        "Ruqiu Lin",
        "Krisztina Perger",
        "Sándor Frey",
        "Tao An",
        "Xiang Ji",
        "Qiqi Wu",
        "Shilong Liao"
      ],
      "abstract": "Building a Radio AGN Sample from Cosmic Morning -- The Radio High-Redshift Quasar Catalog (RHzQCat): I. Catalog from SDSS Quasars and Radio Surveys at $z > 3$ Yingkang Zhang, Ruqiu Lin, Krisztina Perger, Sándor Frey, Tao An, Xiang Ji, Qiqi Wu, Shilong Liao 26 pages, 9 figures, published by Universe as part of Special Issue: Advances in Studies of Galaxies at High Redshift. Issue website: this https URL paper link: this https URL Supplementary data can be found via zenodo: this https URL Universe, Vol. 11, No. 12, id. 392 (2025) Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Radio-loud high-redshift quasars (RHRQs) provide crucial insights into the evolution of relativistic jets and their connection to the growth of supermassive black holes. Beyond the extensively studied population at $z \\ge 5$, the cosmic morning epoch ($3 \\lesssim z \\lesssim 5$) marks the peak of active galactic nucleus (AGN) activity and black hole accretion, yet remains relatively unexplored. In this work, we compiled the radio high-redshift quasar catalog (RHzQCat) by cross-matching the SDSS DR16Q catalog with four major radio surveys -- FIRST,NVSS, RACS, and GLEAM. Our tier-based cross-matching framework and visual validation ensured reliable source identification across surveys with diverse beam sizes. The catalog included 1629 reliable and 315 candidate RHRQs, with radio luminosities uniformly spanning $10^{25.5}$ -- $10^{29.3}$ W Hz$^{-1}$. About 95\\% of the confirmed sources exhibited compact morphologies, consistent with Doppler-boosted or young AGN populations at high redshifts. Our catalog increases the number of known RHRQs at $z\\ge3$ by an order of magnitude, representing the largest and most homogeneous catalog of radio quasars at cosmic morning, filling the observational gap between the early ($z>6$) and local Universe. It provides a robust reference for future statistical studies of jet evolution, AGN feedback, and cosmic magnetism with next-generation facilities such as the Square Kilometer Array (SKA).",
      "pdf_url": "https://arxiv.org/pdf/2512.03415.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05180",
      "title": "Little red dot variability over a century reveals black hole envelope via a giant Einstein cross",
      "authors": [
        "Zijian Zhang",
        "Mingyu Li",
        "Masamune Oguri",
        "Xiaojing Lin",
        "Kohei Inayoshi",
        "Catherine Cerny",
        "Dan Coe",
        "Jose M. Diego",
        "Seiji Fujimoto",
        "Linhua Jiang",
        "Guillaume Mahler",
        "Jorryt Matthee",
        "Rohan P. Naidu",
        "Keren Sharon",
        "Yue Shen",
        "Adi Zitrin",
        "Abdurro'uf",
        "Hollis Akins",
        "Joseph F. V. Allingham",
        "Ricardo Amorín",
        "Yoshihisa Asada",
        "Hakim Atek",
        "Franz E. Bauer",
        "Maruša Bradač",
        "Larry D. Bradley",
        "Zheng Cai",
        "Sebastiano Cantalupo",
        "Christopher Conselice",
        "Liang Dai",
        "Pratika Dayal",
        "Eiichi Egami",
        "Daniel J. Eisenstein",
        "Andreas L. Faisst",
        "Xiaohui Fan",
        "Qinyue Fei",
        "Brenda L. Frye",
        "Yoshinobu Fudamoto",
        "Lukas J. Furtak",
        "Miriam Golubchik",
        "Mauro González-Otero",
        "Yuichi Harikane",
        "Tiger Yu-Yang Hsiao",
        "Yolanda Jiménez-Teja",
        "Jeyhan S. Kartaltepe",
        "Tomokazu Kiyota",
        "Anton M. Koekemoer",
        "Kotaro Kohno",
        "Vasily Kokorev",
        "Nimisha Kumari",
        "Ivo Labbe",
        "Claudia D. P. Lagos",
        "Conor Larison",
        "Yongming Liang",
        "Ray A. Lucas",
        "Jianwei Lyu",
        "Nicholas S. Martis",
        "Georgios E. Magdis",
        "Matteo Messa",
        "Minami Nakane",
        "Gaël Noirot",
        "Rafael Ortiz III",
        "Masami Ouchi",
        "Justin D. R. Pierel",
        "Marc Postman",
        "Naveen Reddy",
        "Massimo Ricotti",
        "Daniel Schaerer",
        "Raffaella Schneider",
        "Charles C. Steidel",
        "Wei Leong Tee",
        "Roberta Tripodi",
        "James A. A. Trussler",
        "Hiroya Umeda",
        "Francesco Valentino",
        "Eros Vanzella",
        "Feige Wang",
        "Rogier Windhorst",
        "Yunjing Wu",
        "Zihao Wu",
        "Hiroto Yanagisawa",
        "Jinyi Yang",
        "Fengwu Sun"
      ],
      "abstract": "Little red dot variability over a century reveals black hole envelope via a giant Einstein cross Zijian Zhang, Mingyu Li, Masamune Oguri, Xiaojing Lin, Kohei Inayoshi, Catherine Cerny, Dan Coe, Jose M. Diego, Seiji Fujimoto, Linhua Jiang, Guillaume Mahler, Jorryt Matthee, Rohan P. Naidu, Keren Sharon, Yue Shen, Adi Zitrin, Abdurro'uf, Hollis Akins, Joseph F. V. Allingham, Ricardo Amorín, Yoshihisa Asada, Hakim Atek, Franz E. Bauer, Maruša Bradač, Larry D. Bradley, Zheng Cai, Sebastiano Cantalupo, Christopher Conselice, Liang Dai, Pratika Dayal, Eiichi Egami, Daniel J. Eisenstein, Andreas L. Faisst, Xiaohui Fan, Qinyue Fei, Brenda L. Frye, Yoshinobu Fudamoto, Lukas J. Furtak, Miriam Golubchik, Mauro González-Otero, Yuichi Harikane, Tiger Yu-Yang Hsiao, Yolanda Jiménez-Teja, Jeyhan S. Kartaltepe, Tomokazu Kiyota, Anton M. Koekemoer, Kotaro Kohno, Vasily Kokorev, Nimisha Kumari, Ivo Labbe, Claudia D. P. Lagos, Conor Larison, Yongming Liang, Ray A. Lucas, Jianwei Lyu, Nicholas S. Martis, Georgios E. Magdis, Matteo Messa, Minami Nakane, Gaël Noirot, Rafael Ortiz III, Masami Ouchi, Justin D. R. Pierel, Marc Postman, Naveen Reddy, Massimo Ricotti, Daniel Schaerer, Raffaella Schneider, Charles C. Steidel, Wei Leong Tee, Roberta Tripodi, James A. A. Trussler, Hiroya Umeda, Francesco Valentino, Eros Vanzella, Feige Wang, Rogier Windhorst, Yunjing Wu, Zihao Wu, Hiroto Yanagisawa, Jinyi Yang, Fengwu Sun 59 pages, 13 figures, 3 tables, submitted to a peer-reviewed journal; comments are welcome Astrophysics of Galaxies (astro-ph.GA) \"Little red dots\" (LRDs) represent a new population of astronomical objects uncovered by JWST whose nature remains debated. Although many LRDs are suspected as active galactic nuclei (AGN), they show little variability on days-years timescales. We report the discovery of two gravitationally lensed LRDs at redshift $\\sim$4.3 behind the cluster RXCJ2211-0350, one of which (RX1) is quadruply imaged with time delays spanning $\\sim$130 years. RX1 exhibits intrinsic color and brightness variations of up to 0.7 magnitude among its images. These changes are consistent with blackbody-temperature variations of a photosphere, indicating long-term variability analogous to Cepheid-like pulsations but in a far more extended ($R \\sim 2000$ AU) and massive ($M \\gtrsim 10^6 \\, M_{\\odot}$) systems. These results suggest LRDs as a distinct class of AGN with stellar-like envelopes.",
      "pdf_url": "https://arxiv.org/pdf/2512.05180.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05187",
      "title": "The dependence of the intracluster light fraction on galaxy cluster properties",
      "authors": [
        "Louisa Canepa",
        "Sarah Brough",
        "Mireia Montes",
        "Nina Hatch"
      ],
      "abstract": "The dependence of the intracluster light fraction on galaxy cluster properties Louisa Canepa, Sarah Brough, Mireia Montes, Nina Hatch Accepted for publication in MNRAS; 17 pages, 13 figures Astrophysics of Galaxies (astro-ph.GA) We use machine learning to measure the intracluster light (ICL) fractions of 177 galaxy groups and clusters identified from Hyper Suprime-Cam Subaru Strategic Program imaging to explore how the ICL varies with the properties of its host cluster. We study the variation in ICL fraction with host cluster redshift, halo mass, and magnitude gap to investigate how the ICL develops over time, in various cluster environments, and with cluster relaxation. We find that there is a decreasing correlation with redshift (Spearman correlation $r_S=-0.604$, p-value $=9\\times10^{-10}$), however this can be plausibly accounted for by including the effects of cosmological surface brightness dimming and the passive aging of stellar populations. There is a weak negative correlation with halo mass ($r_S=-0.330$, p-value $=8\\times 10^{-5}$) where ICL fractions are higher in lower halo mass groups than higher halo mass clusters. We also find that there is a marginal positive correlation with magnitude gap ($r_S=0.226$, p-value = 0.01), indicating that relaxed clusters are more likely to host higher ICL fractions. These results are consistent with a scenario where the dominant formation mechanism of the ICL is galaxy-galaxy interactions such as tidal stripping, and demonstrates the capability of the method to easily construct large samples and study large-scale trends in the ICL fraction.",
      "pdf_url": "https://arxiv.org/pdf/2512.05187.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05213",
      "title": "GA-NIFS: A smouldering disk galaxy undergoing ordered rotation at z=4.26",
      "authors": [
        "Gareth C. Jones",
        "Roberto Maiolino",
        "Francesco D'Eugenio",
        "Santiago Arribas",
        "Andrew J. Bunker",
        "Stephane Charlot",
        "Michele Perna",
        "Bruno Rodriguez del Pino",
        "Hannah Übler",
        "Torsten Böker",
        "Giovanni Cresci",
        "Isabella Lamperti",
        "Eleonora Parlanti",
        "Robert Pascalau",
        "Jan Scholtz",
        "Sandra Zamora"
      ],
      "abstract": "GA-NIFS: A smouldering disk galaxy undergoing ordered rotation at z=4.26 Gareth C. Jones, Roberto Maiolino, Francesco D'Eugenio, Santiago Arribas, Andrew J. Bunker, Stephane Charlot, Michele Perna, Bruno Rodriguez del Pino, Hannah Übler, Torsten Böker, Giovanni Cresci, Isabella Lamperti, Eleonora Parlanti, Robert Pascalau, Jan Scholtz, Sandra Zamora 19 pages, 14 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) Rotating galaxies with relaxed gaseous disks have been discovered across cosmic time, from the local Universe to high redshift (z>4). But few such sources have been confirmed at z>4, making them a precious sample to examine what conditions result in such ordered kinematics in an early, more chaotic Universe. One of the best examples of this sample is the galaxy DLA0817g1 (z=4.2603), which shows remarkably clear rotation in ALMA [CII] data. We present recent JWST/NIRSpec IFU data (R~2700) of DLA0817g1, which we combine with archival ALMA [CII] observations to place constraints on its ISM conditions and morpho-kinematics. From a combination of line ratios, we find a high gas-phase metallicity (~0.7 solar), high fraction of obscured star formation, low ionisation (compared to other high-redshift galaxies observed with JWST), and no significant evidence for AGN (based on the WHAN diagnostic). Dynamical modelling with 3DBarolo reveal nearly identical rotation in Halpha and [CII], but with a higher velocity dispersion in the former. Using our metallicity estimate and previous CO and [CII] detections, we derive a new estimate of the molecular gas mass, relieving a previous strain in the mass budget. Altogether, we suggest that this is a 'smouldering' galaxy, where past star formation resulted in significant chemical enrichment (i.e., Zgas and Mdust), but the current activity is low (i.e., lower ionisation parameter and electron temperature). These new observations have opened a window into questions regarding the interplay of gas, metallicity, star formation, and kinematics in a prototypical early disk galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2512.05213.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05458",
      "title": "Investigating Unusually Extended Main Sequence Turnoff of the Galactic Open Cluster NGC 3532",
      "authors": [
        "Khushboo K Rao",
        "Wen-Ping Chen"
      ],
      "abstract": "Investigating Unusually Extended Main Sequence Turnoff of the Galactic Open Cluster NGC 3532 Khushboo K Rao (Institute of Astronomy, National Central University, Taiwan), Wen-Ping Chen (Institute of Astronomy, National Central University, Taiwan) Astrophysics of Galaxies (astro-ph.GA) Extended main-sequence turnoffs are observed in the color-magnitude diagrams of some young and intermediate-age star clusters. Here we report the case study of NGC 3532. Among the cluster member candidates identified using the ML-MOC algorithm on Gaia DR3 sources, we found that fast rotators are significantly redder. Stars near the main-sequence turnoff exhibit a multi-modal distribution in the Gaia broadening velocity ($v_{\\rm broad}$). A comparison with relevant literature suggests binaries being typically interspersed with fast rotators, often manifesting as slow to moderate rotators. Additionally, chemically peculiar stars are predominantly located in the bluer regions of the turnoff, with those in the fast-rotator region having large values of Gaia re-normalised unit weight error, indicating plausible companions. Our analysis suggests multiple channels responsible for angular momentum loss to account for the extended turnoff.",
      "pdf_url": "https://arxiv.org/pdf/2512.05458.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05535",
      "title": "Is Crater II disrupting?",
      "authors": [
        "A. Katherina Vivas , Alistair Walker , Clara Martínez-Vázquez , MJ Cooke , Carme Gallart , Matteo Monelli , Jaime A. Rojas Cancino , David Nidever NOIRLab, The University of Texas at Austin, IAC, INAF, Pontificia Universidad Católica de Chile, Montana State University)"
      ],
      "abstract": "A. Katherina Vivas (1), Alistair Walker (1), Clara Martínez-Vázquez (1), MJ Cooke (2), Carme Gallart (3), Matteo Monelli (4), Jaime A. Rojas Cancino (5), David Nidever (6) ((1) NOIRLab, (2) The University of Texas at Austin, (3) IAC, (4) INAF, (5) Pontificia Universidad Católica de Chile, (6) Montana State University) Astrophysics of Galaxies (astro-ph.GA) Crater~II (CraII) is a very intriguing, low-surface brightness and extended galaxy in the vicinity of our Milky Way. Motivated by its huge area and the number of RR Lyrae stars (RRLS) detected near to its core, we performed a follow-up campaign to get deep multi-band ($g,i$) and multi-epoch DECam observations in the outskirts of CraII, covering up to 8$r_h$ in the North-East direction and up to 13$r_h$ in the South-West direction (spanning almost 10 degr in the sky across the galaxy). We confirm the existence of tails coming out from CraII. In our survey, we detected a total of 97 periodic variable stars, of which 46 are CraII members [37 RRLS and 7 anomalous Cepheids (AC)]. The RRLS show a strong gradient in distance of 3.7~kpc/deg, which follows the relation: $d (\\rm {kpc}) = (-3.70\\pm 0.21)\\, \\xi' + (116.2 \\pm 0.32)$ (where $\\xi'$ is the planar coordinate rotated to fit the CraII tails). We also found an indication that the gradient in distance in the distant part of the near-side tail (North-East) may be less steep than it is in the inner $5°$. The leading tail also displays a significant over-density of RRLS located $\\sim 3.25$ deg from the center of CraII. Despite covering a smaller area than previous works, our deeper photometry has allowed us to unveil more variable stars in the region and better define the tidal tails of CraII.",
      "pdf_url": "https://arxiv.org/pdf/2512.05535.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05584",
      "title": "Stellar feedback drives the baryon deficiency in low-mass galaxies",
      "authors": [
        "Haoran Yu",
        "Enci Wang",
        "Zeyu Chen",
        "Céline Péroux",
        "Hu Zou",
        "Zhicheng He",
        "Huiyuan Wang",
        "Cheqiu Lyu",
        "Cheng Jia",
        "Chengyu Ma",
        "Xu Kong"
      ],
      "abstract": "Stellar feedback drives the baryon deficiency in low-mass galaxies Haoran Yu, Enci Wang, Zeyu Chen, Céline Péroux, Hu Zou, Zhicheng He, Huiyuan Wang, Cheqiu Lyu, Cheng Jia, Chengyu Ma, Xu Kong 32 pages, 11 figures. Submitted to Science Advances Astrophysics of Galaxies (astro-ph.GA) Stellar feedback, as a key process regulating the baryon cycle, is thought to greatly redistribute baryonic material inside and outside the dark matter halos (DMHs), however the observational evidences are lacking. Through stacking analyses of ~400,000 galaxy spectra from Dark Energy Spectroscopic Instrument (DESI), we find star formation driven cool outflows in Mg II absorption line. Assuming only gravity acts on the launched gas, our calculations reveal that outflows from low mass galaxies (log M*<10) are capable of escaping beyond the DMHs, which aligns well with our finding in the circumgalactic medium (CGM) absorption along the minor-axes of galaxies using background quasars. This research offers indirect evidence that stellar feedback drives the low baryon retention rate in low-mass haloes, implicating that baryonic processes within galaxies are connected with the diffuse matter beyond the DMHs.",
      "pdf_url": "https://arxiv.org/pdf/2512.05584.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05622",
      "title": "First Statistical Detection of Cool Gas Outflows with JWST Towards Cosmic Dawn",
      "authors": [
        "Cheqiu Lyu",
        "Haoran Yu",
        "Enci Wang",
        "Junxian Wang",
        "Cheng Jia",
        "Jie Song",
        "Yangyao Chen",
        "Jinyang Wang",
        "Zeyu Chen",
        "Chengyu Ma",
        "Yifan Wang",
        "Xu Kong"
      ],
      "abstract": "First Statistical Detection of Cool Gas Outflows with JWST Towards Cosmic Dawn Cheqiu Lyu, Haoran Yu, Enci Wang, Junxian Wang, Cheng Jia, Jie Song, Yangyao Chen, Jinyang Wang, Zeyu Chen, Chengyu Ma, Yifan Wang, Xu Kong 16 pages, 6+2 figures, to be submitted Astrophysics of Galaxies (astro-ph.GA) Galactic-scale outflows are a crucial component of galaxy evolution, yet their properties in the early universe remain poorly constrained. We present the first statistical investigation of cool gas outflows in galaxies spanning a wide cosmic timeline from $z \\approx 1$ to $z \\approx 10$. Using thousands of public JWST/NIRSpec spectra, we employ a signal-to-noise weighted spectral stacking technique on the \\ion{Mg}{2} $\\lambda\\lambda2796, 2803$ absorption doublet. We robustly detect blueshifted \\ion{Mg}{2} absorption in all stellar mass and redshift bins. The outflow equivalent width exhibits a strong, positive correlation with stellar mass ($M_*$) at all epochs, increasing from $\\sim 1$~Å at $M_* \\approx 10^9~\\mathrm{M}_\\odot$ to over $3$~Å at $M_* > 10^{10.5}~\\mathrm{M}_\\odot$. Our work provides the first statistical constraints on cool outflows in the low-mass ($M_* \\lesssim 10^{9.5}~\\mathrm{M}_\\odot$), high-redshift ($z > 3$) regime, vital for constraining feedback in the numerous progenitors of typical present-day galaxies. Crucially, the scaling relation between outflow properties and stellar mass shows no significant evolution at $z > 3$. This suggests a persistent, unevolving feedback mechanism governing the baryon cycle in the early universe, placing strong constraints on models that invoke a fundamental change in feedback physics at Cosmic Dawn, such as the feedback-free starburst model.",
      "pdf_url": "https://arxiv.org/pdf/2512.05622.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05768",
      "title": "Multi-band ALMA Polarization Observations of BHB07-11 Reveal Aligned Dust Grains in Complex Spiral Arm Structures",
      "authors": [
        "Austen Fourkas",
        "Leslie W. Looney",
        "Zhe-Yu Daniel Lin",
        "Martin Radecki",
        "Zhi-Yun Li",
        "John J. Tobin",
        "Ian W. Stephens",
        "Manuel Fernández-López",
        "Haifeng Yang",
        "Woojin Kwon",
        "Rachel Harrison"
      ],
      "abstract": "Multi-band ALMA Polarization Observations of BHB07-11 Reveal Aligned Dust Grains in Complex Spiral Arm Structures Austen Fourkas, Leslie W. Looney, Zhe-Yu Daniel Lin, Martin Radecki, Zhi-Yun Li, John J. Tobin, Ian W. Stephens, Manuel Fernández-López, Haifeng Yang, Woojin Kwon, Rachel Harrison Accepted to ApJ, 30 pages, 21 figures Astrophysics of Galaxies (astro-ph.GA); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Polarization-mode observations from the Atacama Large Millimeter/submillimeter Array (ALMA) are powerful tools for studying the dust grain populations in circumstellar disks. Many sources exhibit polarization signatures consistent with aligned dust grains, yet the physical origin of this alignment remains uncertain. One such source is BHB07-11, a Class I protobinary object in the Pipe Nebula with complex spiral arm structures in its circumbinary disk. While magnetic fields are often invoked to explain grain alignment in the interstellar medium, the contrasting conditions in circumstellar disk environments demand further investigation into grain alignment mechanisms. To determine BHB07-11's dominant polarization mechanism, we leverage ALMA polarization-mode dust continuum observations in Bands 3 ($\\lambda$=3.1 mm), 6 ($\\lambda$=1.3 mm), and 7 ($\\lambda$=0.87 mm), in combination with high-resolution dust continuum and spectral line observations in Band 6. Observed polarization vectors in each band are consistent with emission from aligned grains and follow the structure of the spiral arms as shown in the high-resolution observations. Given the relationship between the observed polarization vector orientation and the spiral arms, we find that the polarization morphology is most consistent with grains aligned through a relative velocity flow between gas and dust in the spiral arms, as envisioned in the recently developed badminton birdie-like alignment mechanism, rather than alignment with a magnetic field or other known alignment mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2512.05768.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05801",
      "title": "Stability of the Milky Way Satellite Galaxy Plane under the Influence of Neighbors",
      "authors": [
        "S.V. Pilipenko",
        "N.R. Arakelyan"
      ],
      "abstract": "Stability of the Milky Way Satellite Galaxy Plane under the Influence of Neighbors S.V. Pilipenko, N.R. Arakelyan Astrophysics of Galaxies (astro-ph.GA) Trajectories of test particles in a time-varying nonspherical gravitational potential model of our Galaxy are considered. The role of the quadrupole component of the potential, which at distances greater than 50 kpc is associated with the distribution of matter in the Galaxy's neighborhood (mainly with the influence of the galaxy M31), is studied. It is shown that perturbations of the potential created by the environment can significantly change the trajectories of particles at distances greater than 100 kpc from the Galactic center, but the magnitude of this effect depends on the still poorly known trajectory of the galaxy M31. For some variants of this trajectory, structures resembling a \"thin plane\" of satellite galaxies cannot exist for more than 2-3 billion years.",
      "pdf_url": "https://arxiv.org/pdf/2512.05801.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05854",
      "title": "A new Gaia census of OB associations within 1 kpc",
      "authors": [
        "Alexis L. Quintana",
        "Nicholas J. Wright",
        "Lilly A. Kormann",
        "João Alves",
        "David Katz",
        "Laia Casamiquela",
        "Paola Di Matteo",
        "Misha Haywood",
        "Chervin Laporte"
      ],
      "abstract": "A new Gaia census of OB associations within 1 kpc Alexis L. Quintana, Nicholas J. Wright, Lilly A. Kormann, João Alves, David Katz, Laia Casamiquela, Paola Di Matteo, Misha Haywood, Chervin Laporte 19 pages, 6 figures, submitted to MNRAS. Comments welcome! Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) OB associations are primordial tracers of star formation and Galactic structure. Originally defined about 80 years ago, their historical membership lists have been superseded thanks to the precise astrometry from ESA's \\textit{Gaia}'s satellite. Recent studies have however been mostly focused on individual OB associations or limited by the coverage of spectroscopic surveys. In this paper, we exploit a complete census of $\\sim$25,000 O- and B-type stars within 1 kpc of the Sun to produce a highly-reliable catalogue of 57 OB associations using the HDBSCAN clustering algorithm, increasing the number of known OB associations by a factor of two within this volume. We assess the validity of this catalogue by crossmatching our OB association members with other catalogues of OB associations, star clusters and young stellar groups, confirming the high-confidence of our census of OB associations. We characterize these OB associations physically (total initial stellar mass, number of OB stars, ...) and kinematically (velocity dispersion, linear expansion ages, ...). Nearly three quarters of the OB associations (41 out of 57) exhibit a significant expansion pattern in at least one direction, including 13 in both plane-of-the-sky directions, though differences in expansion velocity suggest anisotropical expansion patterns. We compare the locations of these OB associations with superclouds and features in the local Milky Way such as the Radcliffe Wave and discuss the implications for star formation in the solar neighbourhood.",
      "pdf_url": "https://arxiv.org/pdf/2512.05854.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05914",
      "title": "ALMAGAL VI. The spatial distribution of dense cores during the evolution of cluster-forming massive clump",
      "authors": [
        "E.Schisano",
        "S.Molinari",
        "A.Coletta",
        "D.Elia",
        "P.Schilke",
        "A.Traficante",
        "Á.Sanchez-Monge",
        "H.Beuther",
        "M.Benedettini",
        "C.Mininni",
        "R.S.Klessen",
        "J.D.Soler",
        "A.Nucara",
        "S.Pezzuto",
        "F.van der Tak",
        "P.Hennebelle",
        "M.T.Beltrán",
        "L.Moscadelli",
        "K.L.J.Rygl",
        "P.Sanhueza",
        "P.M.Koch",
        "D.C.Lis",
        "R.Kuiper",
        "G.A.Fuller",
        "A.Avison",
        "L.Bronfman",
        "U.Lebreuilly",
        "T.Möller",
        "T.Liu",
        "V.-M.Pelkonen",
        "L.Testi",
        "Q.Zhang",
        "T.Zhang",
        "A.Ahmadi",
        "J.Allande",
        "C.Battersby",
        "J.Wallace",
        "C.L.Brogan",
        "S.Clarke",
        "F.De Angelis",
        "F.Fontani",
        "P.T.P.Ho",
        "T.R.Hunter",
        "B.Jones",
        "K.G.Johnston",
        "P.D.Klaassen",
        "S.J.Liu",
        "S.-Y.Liu",
        "Y.Maruccia",
        "A.J.Rigby",
        "Y.-N.Su",
        "Y.Tang",
        "S.Walch",
        "H.Zinnecker"
      ],
      "abstract": "ALMAGAL VI. The spatial distribution of dense cores during the evolution of cluster-forming massive clump E.Schisano, S.Molinari, A.Coletta, D.Elia, P.Schilke, A.Traficante, Á.Sanchez-Monge, H.Beuther, M.Benedettini, C.Mininni, R.S.Klessen, J.D.Soler, A.Nucara, S.Pezzuto, F.van der Tak, P.Hennebelle, M.T.Beltrán, L.Moscadelli, K.L.J.Rygl, P.Sanhueza, P.M.Koch, D.C.Lis, R.Kuiper, G.A.Fuller, A.Avison, L.Bronfman, U.Lebreuilly, T.Möller, T.Liu, V.-M.Pelkonen, L.Testi, Q.Zhang, T.Zhang, A.Ahmadi, J.Allande, C.Battersby, J.Wallace, C.L.Brogan, S.Clarke, F.De Angelis, F.Fontani, P.T.P.Ho, T.R.Hunter, B.Jones, K.G.Johnston, P.D.Klaassen, S.J.Liu, S.-Y.Liu, Y.Maruccia, A.J.Rigby, Y.-N.Su, Y.Tang, S.Walch, H.Zinnecker 32 pages, 22 figures, accepted for publication in the Astronomy & Astrophysics journal, abstract adapted from current version Astrophysics of Galaxies (astro-ph.GA) High-mass stars and star clusters form from the fragmentation of massive dense clumps driven by gravity, turbulence, and magnetic fields. The ALMAGAL project observed $\\sim1000$ clumps at $\\sim$1000\\,au resolution, enabling a statistically significant characterization of this process across a large range of clump physical parameters and evolutionary stages. In this work, we investigated the spatial distribution of dense cores in the 514 massive, potentially cluster-forming, clumps hosting at least 4 cores, to trace fragmentation's initial conditions and early evolution. We used quantitative descriptors, evaluated against the clump bolometric luminosity-to-mass ratio as an indicator of evolution. Core separations were measured with the minimum spanning tree method (MST) and compared with the Jeans gravitational fragmentation theory. We used the $Q$ parameter and the mass segregation ratio, $\\Lambda_{MSR}$, to evaluate whether cores have specific arrangements or differences depending on their masses. ALMAGAL cores are usually arranged in elliptical groups with an axis ratio $e\\sim2.2$, but $e\\geq$5 is also observed. A single characteristic core separation per clump is found in $\\sim76$% of cases, but signatures of multiple fragmentation lengths not rare. Typical core separations are compatible with the clump-averaged thermal Jeans length, $\\lambda^{th}_{J}$, though a population, typical of low-fragmented/young clumps, has wider separations with $l\\approx3\\times\\lambda^{th}_{J}$. The core separation decreases on average from $l\\sim22000$ au in younger systems to $l\\sim7000$ au in more evolved ones. Cores are typically distributed in fractal-type subclusters, with centrally concentrated patterns appearing only at later stages, but without a progressive evolutionary transition. Finally, mass segregation is found in 110 systems, with its occurrence increasing with evolution.",
      "pdf_url": "https://arxiv.org/pdf/2512.05914.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.17689",
      "title": "Relationship between the $γ-$ray variability and the pc-scale jet in the blazar 3C 454.3",
      "authors": [
        "Eva Palafox",
        "Víctor Manuel Patiño-Álvarez",
        "Vahram Chavushyan",
        "Sergio A. Dzib",
        "Andrei Lobanov",
        "J. Anton Zensus"
      ],
      "abstract": "Relationship between the $γ-$ray variability and the pc-scale jet in the blazar 3C 454.3 Eva Palafox, Víctor Manuel Patiño-Álvarez, Vahram Chavushyan, Sergio A. Dzib, Andrei Lobanov, J. Anton Zensus A&A accepted, 9 pages, 6 figures High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) 3C 454.3 is a flat spectrum radio quasar (FSRQ) known for its high variability across the electromagnetic spectrum, showing structural and flux variability in its pc-scale jet, and correlated variability among frequency bands. This study aims to identify the structure, dynamics, and radiative processes common to the innermost regions of the blazar 3C 454.3. We investigate whether any jet component can be associated with $\\gamma-$ray emission and variability. We analyze the relationship between the variable $\\gamma-$ray emission and pc-scale jet properties in 3C 454.3 by combining $\\gamma-$ray data spanning twelve years with contemporaneous VLBA multi-epoch images at 15 and 43 GHz. Spearman rank correlation tests are conducted to determine if the flux variability of any jet component is associated with $\\gamma-$ray variability. Core emission at 43 and 15 GHz strongly correlates with $\\gamma-$ray emission. The 43 GHz core (Q0) contributes around 37$\\%$ of the observed $\\gamma-$ray variability, while the 15 GHz core (K0) accounts for 30$\\%$. A quasi-stationary component at 43 GHz, at a projected distance of 4.6 pc, correlates with the $\\gamma-$ray flux, accounting for 20$\\%$ of its emission between 2016 and 2021. We found a mobile component (Q3 between 2010.18 and 2011.16) at 43 GHz with a projected distance between 0.8 and 2.3 pc and apparent velocity of $\\beta_{app} = 9.9 \\pm 1.1$ c, accounting for approximately 28% of the $\\gamma-$ray emission. The observed simultaneous variability in emission regions beyond the central parsec strongly suggests synchrotron self-Compton (SSC) as the primary mechanism for $\\gamma-$ray production in these regions. Our findings demonstrate the existence of multiple $\\gamma-$ray emission regions within the blazar jet but also suggest that some of these regions are non-stationary over time.",
      "pdf_url": "https://arxiv.org/pdf/2502.17689.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05182",
      "title": "Predictions of the Nancy Grace Roman Space Telescope Galactic Exoplanet Survey. V. Detection Rates of Multiplanetary Systems in High Magnification Microlensing Events",
      "authors": [
        "Vito Saggese",
        "Étienne Bachelet",
        "Sebastiano Calchi Novati",
        "Valerio Bozza",
        "Giovanni Covone",
        "Farzaneh Zohrabi",
        "Michael D. Albrow",
        "Jay Anderson",
        "Charles Beichman",
        "David P. Bennett",
        "Aparna Bhattacharya",
        "Christopher Brandon",
        "Sean Carey",
        "Jessie Christiansen",
        "Alison Crisp",
        "William DeRocco",
        "B. Scott Gaudi",
        "Jon Hulberg",
        "Macy J. Huston",
        "Stela Ishitani Silva",
        "Eamonn Kerins",
        "Somayeh Khakpash",
        "Katarzyna Kruszyńska",
        "Casey Lam",
        "Jessica R. Lu",
        "Amber Malpas",
        "Arjun Murlidhar",
        "Marz Newman",
        "Greg Olmschenk",
        "Matthew Penny",
        "Keivan G. Stassun",
        "Alexander P. Stephan",
        "Rachel A. Street",
        "Takahiro Sumi",
        "Sean K. Terry",
        "Himanshu Verma",
        "Weicheng Zang"
      ],
      "abstract": "Predictions of the Nancy Grace Roman Space Telescope Galactic Exoplanet Survey. V. Detection Rates of Multiplanetary Systems in High Magnification Microlensing Events Vito Saggese, Étienne Bachelet, Sebastiano Calchi Novati, Valerio Bozza, Giovanni Covone, Farzaneh Zohrabi, Michael D. Albrow, Jay Anderson, Charles Beichman, David P. Bennett, Aparna Bhattacharya, Christopher Brandon, Sean Carey, Jessie Christiansen, Alison Crisp, William DeRocco, B. Scott Gaudi, Jon Hulberg, Macy J. Huston, Stela Ishitani Silva, Eamonn Kerins, Somayeh Khakpash, Katarzyna Kruszyńska, Casey Lam, Jessica R. Lu, Amber Malpas, Arjun Murlidhar, Marz Newman, Greg Olmschenk, Matthew Penny, Keivan G. Stassun, Alexander P. Stephan, Rachel A. Street, Takahiro Sumi, Sean K. Terry, Himanshu Verma, Weicheng Zang 14 pages, 8 figures, 2 tables, Submitted to A&A Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Nancy Grace Roman Space Telescope will expand the reach of gravitational microlensing surveys by increasing the number of events monitored and the precision of their light curves. We investigate Roman's ability to detect triple-lens microlensing systems, cases where a foreground star with two bound exoplanets produces detectable anomalies in a microlensing event, using its planned high-cadence observations toward the Galactic bulge. We simulate a large set of high-magnification microlensing light curves based on Roman's expected survey characteristics. A detection criterion, based on a required $\\chi^2$ improvement for a two-planet model, is applied to determine whether the second planet can be reliably distinguished from a single-planet (binary-lens) model. Our simulations show that the majority of two-planet microlensing events would be detectable with Roman. Events in which both planets are relatively massive (planet-star mass ratios of order $10^{-3}$), or in which the more massive planet occupies a favorable resonant configuration, produce strong central perturbations, resulting in detection efficiencies of roughly 90\\%. By contrast, systems with only low-mass planets ($q \\sim 10^{-4}$) or with less favorable alignments generate much weaker signals, which often fall below the detection threshold. In general, the planetary mass ratios and the resulting caustic geometry (e.g., central caustic size in resonant versus wide/close orbits) are the dominant factors governing detectability. Taking into account the expected frequency of planetary systems and the fraction of high-magnification events, we estimate that Roman will detect a high-magnification triple-lens event in approximately 4.5\\% of multi-planet microlensing events, corresponding to about 64 events over the course of the full survey.",
      "pdf_url": "https://arxiv.org/pdf/2512.05182.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05899",
      "title": "Euclid Quick Data Release (Q1). From simulations to sky: Advancing machine-learning lens detection with real Euclid data",
      "authors": [
        "Euclid Collaboration: N. E. P. Lines",
        "T. E. Collett",
        "P. Holloway",
        "K. Rojas",
        "S. Schuldt",
        "R. B. Metcalf",
        "T. Li",
        "A. Verma",
        "G. Despali",
        "F. Courbin",
        "R. Gavazzi",
        "C. Tortora",
        "B. Clément",
        "N. Aghanim",
        "B. Altieri",
        "L. Amendola",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "A. Balestra",
        "S. Bardelli",
        "P. Battaglia",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "H. M. Courtois",
        "M. Cropper",
        "H. Degaudenzi",
        "G. De Lucia",
        "H. Dole",
        "F. Dubath",
        "X. Dupac",
        "S. Dusini",
        "A. Ealet",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "P. Gómez-Alvarez",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "S. V. H. Haugan",
        "W. Holmes",
        "I. M. Hook",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "B. Kubik",
        "M. Kümmel",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti",
        "D. Maino",
        "E. Maiorano",
        "O. Mansutti",
        "S. Marcin",
        "O. Marggraf",
        "M. Martinelli",
        "N. Martinet",
        "F. Marulli",
        "R. J. Massey",
        "E. Medinaceli",
        "S. Mei",
        "M. Melchior"
      ],
      "abstract": "Euclid Quick Data Release (Q1). From simulations to sky: Advancing machine-learning lens detection with real Euclid data Euclid Collaboration: N. E. P. Lines (1), T. E. Collett (1), P. Holloway (1), K. Rojas (2), S. Schuldt (3 and 4), R. B. Metcalf (5 and 6), T. Li (1), A. Verma (7), G. Despali (5 and 6 and 8), F. Courbin (9 and 10 and 11), R. Gavazzi (12 and 13), C. Tortora (14), B. Clément (15 and 16), N. Aghanim (17), B. Altieri (18), L. Amendola (19), S. Andreon (20), N. Auricchio (6), C. Baccigalupi (21 and 22 and 23 and 24), M. Baldi (25 and 6 and 8), A. Balestra (26), S. Bardelli (6), P. Battaglia (6), A. Biviano (22 and 21), E. Branchini (27 and 28 and 20), M. Brescia (29 and 14), S. Camera (30 and 31 and 32), G. Cañas-Herrera (33 and 34), V. Capobianco (32), C. Carbone (4), J. Carretero (35 and 36), M. Castellano (37), G. Castignani (6), S. Cavuoti (14 and 38), A. Cimatti (39), C. Colodro-Conde (40), G. Congedo (33), C. J. Conselice (41), L. Conversi (42 and 18), Y. Copin (43), H. M. Courtois (44), M. Cropper (45), H. Degaudenzi (46), G. De Lucia (22), H. Dole (17), F. Dubath (46), X. Dupac (18), S. Dusini (47), A. Ealet (43), S. Escoffier (48), M. Farina (49), R. Farinelli (6), F. Faustini (37 and 50), S. Ferriol (43), F. Finelli (6 and 51), M. Frailis (22), E. Franceschi (6), M. Fumana (4), S. Galeotta (22), K. George (52), B. Gillis (33), C. Giocoli (6 and 8), P. Gómez-Alvarez (53 and 18), J. Gracia-Carpio (54), A. Grazian (26), F. Grupp (54 and 55), S. V. H. Haugan (56), W. Holmes (57), I. M. Hook (58), F. Hormuth (59), A. Hornstrup (60 and 61), K. Jahnke (62), M. Jhabvala (63), B. Joachimi (64), E. Keihänen (65), S. Kermiche (48), A. Kiessling (57), B. Kubik (43), M. Kümmel (55), M. Kunz (66), H. Kurki-Suonio (67 and 68), A. M. C. Le Brun (69), S. Ligori (32), P. B. Lilje (56), V. Lindholm (67 and 68), I. Lloro (70), G. Mainetti (71), D. Maino (3 and 4 and 72), E. Maiorano (6), O. Mansutti (22), S. Marcin (2), O. Marggraf (73), M. Martinelli (37 and 74), N. Martinet (12), F. Marulli (5 and 6 and 8), R. J. Massey (75), E. Medinaceli (6), S. Mei (76 and 77), M. Melchior Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) In the era of large-scale surveys like Euclid, machine learning has become an essential tool for identifying rare yet scientifically valuable objects, such as strong gravitational lenses. However, supervised machine-learning approaches require large quantities of labelled examples to train on, and the limited number of known strong lenses has lead to a reliance on simulations for training. A well-known challenge is that machine-learning models trained on one data domain often underperform when applied to a different domain: in the context of lens finding, this means that strong performance on simulated lenses does not necessarily translate into equally good performance on real observations. In Euclid's Quick Data Release 1 (Q1), covering 63 deg2, 500 strong lens candidates were discovered through a synergy of machine learning, citizen science, and expert visual inspection. These discoveries now allow us to quantify this performance gap and investigate the impact of training on real data. We find that a network trained only on simulations recovers up to 92% of simulated lenses with 100% purity, but only achieves 50% completeness with 24% purity on real Euclid data. By augmenting training data with real Euclid lenses and non-lenses, completeness improves by 25-30% in terms of the expected yield of discoverable lenses in Euclid DR1 and the full Euclid Wide Survey. Roughly 20% of this improvement comes from the inclusion of real lenses in the training data, while 5-10% comes from exposure to a more diverse set of non-lenses and false-positives from Q1. We show that the most effective lens-finding strategy for real-world performance combines the diversity of simulations with the fidelity of real lenses. This hybrid approach establishes a clear methodology for maximising lens discoveries in future data releases from Euclid, and will likely also be applicable to other surveys such as LSST.",
      "pdf_url": "https://arxiv.org/pdf/2512.05899.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2309.14743",
      "title": "The galactic tooth-fairy and a cosmic bullet: Amateur discoveries and a call for further research",
      "authors": [
        "Muhammad Shaheer Niazi"
      ],
      "abstract": "The galactic tooth-fairy and a cosmic bullet: Amateur discoveries and a call for further research Muhammad Shaheer Niazi Astrophysics of Galaxies (astro-ph.GA) There are countless digital sky surveys and automated scans of the night sky which use computer algorithms to detect and categorize objects. With the advent of Artificial Intelligence such surveys will become even more efficient in the near future. Despite this some objects are missed by surveys or pose no initial interest. At times such missed objects are unique in nature and of decent angular sizes, demanding research, unlike the billions of tiny specs of galaxies that would be too tedious to name and study. In this scenario the amateur astronomer and their spirit for old school astronomical discovery steps in, to manually comb the sky and catalogue unique objects as was done in the early days of astronomy. In this paper two unique, previously uncatalogued galaxy candidates, namely Shaheer I and Shaheer II are identified and studied. Both galaxies lay at a distance of 6.67 arc-minutes from each other in the constellation of Camelopardalis. One boasts an unusual morphological profile, akin to a molar tooth, while the other seems to be shooting through space at tremendous velocities. The objects were discovered during visual inspection of digital surveys and then imaged from amateur telescopes at Taqwa observatory, Pakistan's first and only dark sky observatory (bortle 1). We perform photometry using PetroFit to discuss the potential nature of the galaxies and implore further collaborative research to fully uncover their characteristics.",
      "pdf_url": "https://arxiv.org/pdf/2309.14743.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.01437",
      "title": "AGN -- host galaxy photometric decomposition using a fast, accurate and precise deep learning approach",
      "authors": [
        "Berta Margalef-Bentabol",
        "Lingyu Wang",
        "Antonio La Marca",
        "Vicente Rodriguez-Gomez"
      ],
      "abstract": "AGN -- host galaxy photometric decomposition using a fast, accurate and precise deep learning approach Berta Margalef-Bentabol, Lingyu Wang, Antonio La Marca, Vicente Rodriguez-Gomez Astrophysics of Galaxies (astro-ph.GA) Identifying active galactic nuclei (AGN) is extremely important for understanding galaxy evolution and its connection with the assembly of supermassive black holes (SMBH). With the advent of deep and high angular resolution imaging surveys such as those conducted with the James Webb Space Telescope (JWST), it is now possible to identify galaxies with a central point source out to the very early Universe. In this study, we develop a fast, accurate and precise method to identify galaxies which host AGNs and recover the intrinsic AGN contribution to the observed total light ($f_{AGN}$). We trained a deep learning (DL) based method Zoobot to estimate the fractional contribution of a central point source to the total light. Our training sample comprises realistic mock JWST images of simulated galaxies from the IllustrisTNG cosmological hydrodynamical simulations. We injected different amounts of the real JWST point spread function (PSF) models to represent galaxies with different levels of $f_{AGN}$. We analyse the performance of our method and compare it with results obtained from the traditional light profile fitting tool GALFIT. We find excellent performance of our DL method in recovering the injected AGN fraction $f_{AGN}$, both in terms of precision and accuracy. The mean difference between the predicted and true injected $f_{AGN}$ is -0.002 and the overall root mean square error (RMSE) is 0.013. The relative absolute error (RAE) is 0.076 and the outlier (defined as predictions with RAE >20%) fraction is 6.5%. In comparison, using GALFIT on the same dataset, we achieve a mean difference of -0.02, RMSE of 0.12, RAE of 0.19 and outlier fraction of 19%. We applied our trained DL model to real JWST observations and found that 33% of X-ray-selected AGN and 15% of MIR-selected AGN are also identified as AGN using a cut at $f_{\\rm AGN} > 0.1$.",
      "pdf_url": "https://arxiv.org/pdf/2410.01437.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.19721",
      "title": "MUSE-DARK-I: Dark matter halo properties of intermediate-z star-forming galaxies",
      "authors": [
        "B.I. Ciocan",
        "N.F. Bouché",
        "J. Fensch",
        "W. Mercier",
        "D. Krajnović",
        "J. Richard",
        "T. Contini",
        "A. Jeanneau"
      ],
      "abstract": "MUSE-DARK-I: Dark matter halo properties of intermediate-z star-forming galaxies B.I. Ciocan, N.F. Bouché, J. Fensch, W. Mercier, D. Krajnović, J. Richard, T. Contini, A. Jeanneau Revised after submission to A&A Astrophysics of Galaxies (astro-ph.GA) [Abridged] We analyse the dark matter (DM) halo properties of 127 0.3<z<1.5 star-forming galaxies (SFGs) down to low stellar masses (8<log(Mstar/Msun)<11), using data from the MUSE Hubble Ultra Deep Field Survey and photometry from HST and JWST. We employ a 3D forward modelling approach to analyse the morpho-kinematics of our sample, enabling measurement of individual rotation curves out to 2-3 times the effective radius. We perform a disk-halo decomposition with a 3D parametric model that includes stellar, gas, and DM components, with pressure support corrections. We validate our methodology on mock data cubes generated from idealised disk simulations. We select the best-fitting DM model among six density profiles, including the Navarro-Frenk-White and the generalised alpha-beta-gamma profile of Di Cintio et al. (2014, DC14). Our Bayesian analysis shows that DC14 performs as well as or better than the other profiles in >80% of the sample. We find that the kinematically inferred stellar masses agree with values from SED fitting. We find that 89% of galaxies have DM fractions >50%. For 66% of SFGs, we infer a DM inner slope, gamma < 0.5, indicating cored DM profiles, but no correlation is found between gamma and star formation rate of the sample. The stellar- and concentration-mass relations agree with theoretical expectations, but with larger scatter. We confirm the anticorrelation between halo scale radius and DM density. The halo scale radii and DM surface densities increase with Mstar, while DM densities stay constant. We find tentative evidence of an evolution of the DM density with z, which suggests that the DM halos of intermediate-z systems are denser than those of local galaxies. In contrast, the halo scale radii are z-invariant.",
      "pdf_url": "https://arxiv.org/pdf/2506.19721.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.16917",
      "title": "Atomic hydrogen reservoirs in quiescent galaxies at z = 0.4",
      "authors": [
        "A. Bianchetti",
        "G. Rodighiero",
        "D. Donevski",
        "F. Sinigaglia",
        "E. Elson",
        "M. Vaccari",
        "A. Marasco",
        "L. Bisigello",
        "I. Prandoni",
        "M. Baes",
        "M. Glowacki",
        "F. M. Maccagni",
        "G. Lorenzon",
        "I. Heywood"
      ],
      "abstract": "Atomic hydrogen reservoirs in quiescent galaxies at z = 0.4 A. Bianchetti, G. Rodighiero, D. Donevski, F. Sinigaglia, E. Elson, M. Vaccari, A. Marasco, L. Bisigello, I. Prandoni, M. Baes, M. Glowacki, F. M. Maccagni, G. Lorenzon, I. Heywood published by Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) Context. Based on Local Universe observations, quiescent galaxies (QGs) host lower to no HI compared to star-forming galaxies (SFGs), but no constraints have been derived so far at higher redshift (z>0.1). Understanding whether QGs can retain significant HI reservoirs at higher z is crucial to refine quenching and gas accretion models and to constrain overall star formation efficiency at different epochs. Aims. We aim to probe HI in candidate QGs at intermediate redshifts (z=0.36) and to understand whether there exists a class of QGs retaining consistent HI reservoirs and which parameters (dust content, stellar mass, Dn4000, morphology, environment) effectively capture HI-rich QGs. Methods. We perform 21-cm spectral line stacking on MIGHTEE-HI data at z=0.36, targeting two different samples of QGs, defined by means of a color-selection criterion and a spectroscopic criterion based on Dn4000, respectively. We also perform stacking on subsamples of the spectroscopically-selected quiescent sample to investigate the correlation between the HI content and other galaxy properties. Results. We find that QGs with an IR counterpart (i.e., dusty galaxies) are found to host a substantial HI content, on average just 40% lower than SFGs. In contrast, color-selected QGs still hold HI, but lower than SFGs by a factor 3. Among dusty objects, we find morphology to have a mild impact on the atomic gas content, with spirals hosting approximately 15-30% more HI than spheroids. Environmental effects are also present, with low-density regions hosting galaxies that are HI-richer than in high-density ones, by approximately 30% for spirals and 60% for spheroids. We suggest that, in general, HI content is driven by several factors, including quenching mechanisms and ISM enrichment processes. Also, quiescent galaxies - and especially dusty systems - seem to yield HI more consistently than in the Local Universe.",
      "pdf_url": "https://arxiv.org/pdf/2507.16917.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.00103",
      "title": "The warm outer layer of a Little Red Dot as the source of [Fe II] and collisional Balmer lines with scattering wings",
      "authors": [
        "Alberto Torralba",
        "Jorryt Matthee",
        "Gabriele Pezzulli",
        "Rohan P. Naidu",
        "Yuzo Ishikawa",
        "Gabriel B. Brammer",
        "Seok-Jun Chang",
        "John Chisholm",
        "Anna de Graaff",
        "Francesco D'Eugenio",
        "Claudia Di Cesare",
        "Anna-Christina Eilers",
        "Jenny E. Greene",
        "Max Gronke",
        "Edoardo Iani",
        "Vasily Kokorev",
        "Gauri Kotiwale",
        "Ivan Kramarenko",
        "Yilun Ma",
        "Sara Mascia",
        "Benjamín Navarrete",
        "Erica Nelson",
        "Pascal Oesch",
        "Robert A. Simcoe",
        "Stijn Wuyts"
      ],
      "abstract": "The warm outer layer of a Little Red Dot as the source of [Fe II] and collisional Balmer lines with scattering wings Alberto Torralba, Jorryt Matthee, Gabriele Pezzulli, Rohan P. Naidu, Yuzo Ishikawa, Gabriel B. Brammer, Seok-Jun Chang, John Chisholm, Anna de Graaff, Francesco D'Eugenio, Claudia Di Cesare, Anna-Christina Eilers, Jenny E. Greene, Max Gronke, Edoardo Iani, Vasily Kokorev, Gauri Kotiwale, Ivan Kramarenko, Yilun Ma, Sara Mascia, Benjamín Navarrete, Erica Nelson, Pascal Oesch, Robert A. Simcoe, Stijn Wuyts 18 pages incl. references. Main figure: 4 ([Fe II] model). Corrected wrong values in Table 1. Submitted to A&A Astrophysics of Galaxies (astro-ph.GA) The population of the Little Red Dots (LRDs) may represent a key phase of supermassive black hole (SMBH) growth. A cocoon of dense excited gas is emerging as key component to explain the most striking properties of LRDs, such as strong Balmer breaks and Balmer absorption, as well as the weak IR emission. To dissect the structure of LRDs, we analyze new deep JWST/NIRSpec PRISM and G395H spectra of FRESCO-GN-9771, one of the most luminous known LRDs at $z=5.5$. These reveal a strong Balmer break, broad Balmer lines and very narrow [O III] emission. We unveil a forest of optical [Fe II] lines, which we argue is emerging from a dense ($n_{\\rm H}=10^{9-10}$ cm$^{-3}$) warm layer with electron temperature $T_{\\rm e}\\approx7000$ K. The broad wings of H$\\alpha$ and H$\\beta$ have an exponential profile due to electron scattering in this same layer. The high $\\rm H\\alpha:H\\beta:H\\gamma$ flux ratio of $\\approx10.4:1:0.14$ is an indicator of collisional excitation and resonant scattering dominating the Balmer line emission. A narrow H$\\gamma$ component, unseen in the other two Balmer lines due to outshining by the broad components, could trace the ISM of a normal host galaxy with a star formation rate $\\sim5$ M$_{\\odot}$ yr$^{-1}$. The warm layer is mostly opaque to Balmer transitions, producing a characteristic P-Cygni profile in the line centers suggesting outflowing motions. This same layer is responsible for shaping the Balmer break. The broad-band spectrum can be reasonably matched by a simple photoionized slab model that dominates the $\\lambda>1500$ Å continuum and a low mass ($\\sim10^8$ M$_{\\odot}$) galaxy that could explain the narrow [O III], with only subdominant contribution to the UV continuum. Our findings indicate that Balmer lines are not directly tracing gas kinematics near the SMBH and that the BH mass scale is likely much lower than virial indicators suggest.",
      "pdf_url": "https://arxiv.org/pdf/2510.00103.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21479",
      "title": "Scalable and Robust Multiband Modeling of AGN Light Curves in Rubin-LSST",
      "authors": [
        "Weixiang Yu",
        "John J. Ruan",
        "Colin J. Burke",
        "Roberto J. Assef",
        "Tonima T. Ananna",
        "Franz E. Bauer",
        "Demetra De Cicco",
        "Keith Horne",
        "Lorena Hernández-García",
        "Dragana Ilić",
        "Vivek Kumar Jha",
        "Andjelka B. Kovačević",
        "Marcin Marculewicz",
        "Swayamtrupta Panda",
        "Claudio Ricci",
        "Gordon T. Richards",
        "Rogemar A. Riffel",
        "Donald P. Schneider",
        "Paula Sánchez-Sáez",
        "Sarath Satheesh Sheeba",
        "Francesco Tombesi",
        "Matthew J. Temple",
        "Michael S. Vogeley",
        "Ilsang Yoon",
        "Fan Zou"
      ],
      "abstract": "Scalable and Robust Multiband Modeling of AGN Light Curves in Rubin-LSST Weixiang Yu, John J. Ruan, Colin J. Burke, Roberto J. Assef, Tonima T. Ananna, Franz E. Bauer, Demetra De Cicco, Keith Horne, Lorena Hernández-García, Dragana Ilić, Vivek Kumar Jha, Andjelka B. Kovačević, Marcin Marculewicz, Swayamtrupta Panda, Claudio Ricci, Gordon T. Richards, Rogemar A. Riffel, Donald P. Schneider, Paula Sánchez-Sáez, Sarath Satheesh Sheeba, Francesco Tombesi, Matthew J. Temple, Michael S. Vogeley, Ilsang Yoon, Fan Zou Accepted for publication in ApJ, 24 pages, 15 figures Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) will monitor tens of millions of active galactic nuclei (AGNs) for a period of 10 years with an average cadence of 3 days in six broad photometric bands. This unprecedented dataset will enable robust characterizations of AGN UV/optical variability across a wide range of AGN physical properties. However, existing tools for modeling AGN light curves are not yet capable of fully leveraging the volume, cadence, and multiband nature of LSST data. We present EzTaoX, a scalable light curve modeling tool designed to take advantage of LSST's multiband observations to simultaneously characterize AGN UV/optical stochastic variability and measure interband time delays. EzTaoX achieves a speed increase of $\\sim 10^2-10^4 \\times$ on CPUs over current tools with similar capabilities, while maintaining equal or better accuracy in recovering simulated variability properties. This performance gain enables continuum time-delay measurements for all AGNs discovered by LSST -- both in the Wide Fast Deep survey and the Deep Drilling Fields -- thereby opening new opportunities to probe AGN accretion-flow geometries. In addition, EzTaoX's multiband capability allows robust characterization of AGN stochastic variability down to hourly timescales, facilitating the identification of accreting low-mass AGNs -- such as those residing in dwarf galaxies -- through their distinctive variability signatures.",
      "pdf_url": "https://arxiv.org/pdf/2511.21479.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.23299",
      "title": "Sulfur-Bearing Cyclic Hydrocarbons in Space",
      "authors": [
        "Mitsunori Araki",
        "Miguel Sanz-Novo",
        "Christian P. Endres",
        "Paola Caselli",
        "Víctor M. Rivilla",
        "Izaskun Jiménez-Serra",
        "Laura Colzi",
        "Shaoshan Zeng",
        "Andrés Megías",
        "Álvaro López-Gallifa",
        "Antonio Martínez-Henares",
        "David San Andrés",
        "Sergio Martín",
        "Miguel A. Requena-Torres",
        "Juan García de la Concepción",
        "Valerio Lattanzi"
      ],
      "abstract": "Sulfur-Bearing Cyclic Hydrocarbons in Space Mitsunori Araki, Miguel Sanz-Novo, Christian P. Endres, Paola Caselli, Víctor M. Rivilla, Izaskun Jiménez-Serra, Laura Colzi, Shaoshan Zeng, Andrés Megías, Álvaro López-Gallifa, Antonio Martínez-Henares, David San Andrés, Sergio Martín, Miguel A. Requena-Torres, Juan García de la Concepción, Valerio Lattanzi Astrophysics of Galaxies (astro-ph.GA) Molecules harbouring sulfur are thought to have played a key role in the biological processes of life on Earth. We report the first astronomical detection of a sulfur-bearing cyclic 1hydrocarbon in interstellar space. Observations of the Galactic center molecular cloud G+0.693-0.027 reveal the presence of 2,5-cyclohexadien-1-thione - a structural isomer of thiophenol ($c$-C$_6$H$_6$S). To allow the astronomical identification, we first performed precise laboratory measurements of the thiophenol discharge products system. These measurements, conducted in the radio band using a chirped-pulse Fourier transform microwave spectrometer, enabled us to characterize this highly polar molecular species and provided unambiguous fingerprints needed to identify this organosulfur compound in space, which now ranks as the largest interstellar sulfur-bearing molecule. These results herald the discovery of a new family of prebiotically relevant sulfur-bearing species, potentially acting as a bridge between the chemical inventory of the interstellar medium and the composition of the minor bodies of the Solar System.",
      "pdf_url": "https://arxiv.org/pdf/2511.23299.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.03159",
      "title": "A Catalogue of Interstellar Material Delivery From Nearby Debris Disks",
      "authors": [
        "Cole R. Gregg",
        "Paul A. Wiegert"
      ],
      "abstract": "A Catalogue of Interstellar Material Delivery From Nearby Debris Disks Cole R. Gregg, Paul A. Wiegert Accepted for publication in PSJ. Main text: 31 pages, 5 figures, 6 tables. Appendix: Additional 42 pages, 60 figures, 2 tables Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We modeled the trajectories of material ejected from 20 nearby debris disk stars, including Epsilon Eridani (Ran), Vega, Fomalhaut, and Beta Pictoris, within a simulated Milky Way potential in order to quantify their contribution to the population of interstellar material entering the solar system. Our simulations show that material from each of these 20 systems is currently to be expected within our planetary system. We calculate expected fluxes of both macroscopic interstellar objects (ISOs, $\\geq100~$m), which could be detected by telescopic surveys, and smaller meteoroids ($\\geq200~$microns), which could manifest as meteors in Earth's atmosphere. We estimate that the ISO population originating from these debris disks and currently within the inner solar system is on the order of ~2, only a fraction of the expected total ISO population but nonetheless likely to be discovered by Rubin. Meteors in Earth's atmosphere from these systems are expected as well, but current methods, both radar and video, might require decades to collect even a single event. Our sample is found to be rich in relatively low excess velocity particles compared to the broader expected ISO population, which might make them harder to distinguish observationally from bound objects in some cases. These results provide a framework for linking detections of interstellar material to their astrophysical origins, offering new opportunities to probe the composition and dynamical history of nearby planetary systems.",
      "pdf_url": "https://arxiv.org/pdf/2512.03159.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05670",
      "title": "Polarimetric and spectropolarimetric observations with FoReRo2: Instrument overview and standard stars monitoring",
      "authors": [
        "Yanko Nikolov",
        "Galin Borisov",
        "Stefano Bagnulo",
        "Plamen Nikolov",
        "Rumen Bogdanovski",
        "Tanyu Bonev"
      ],
      "abstract": "Polarimetric and spectropolarimetric observations with FoReRo2: Instrument overview and standard stars monitoring Yanko Nikolov, Galin Borisov, Stefano Bagnulo, Plamen Nikolov, Rumen Bogdanovski, Tanyu Bonev Submitted to Astronomy & Astrophysics, 19 pages, 19 figures Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) In this paper, we present a description and characterisation of the 2-Channel Focal Reducer Rozhen (FoReRo2), with an emphasis on its polarimetric and spectropolarimetric observation modes. FoReRo2 is a multimode instrument mounted at the Ritchey-Chretien(RC) focus of the 2-meter Ritchey-Chretien-Coude (RCC) telescope at the Bulgarian National Astronomical Observatory (BNAO) - Rozhen. The primary targets of this instrument include novae, Be/X-ray binaries, symbiotic stars, asteroids, and comets. Standard stars with a high degree of polarisation are an essential part of the polarimetric observations. In our sample, HD 204827 shows short-term variability in position angle, making it unsuitable for calibration. HD 183143 displays intrinsic polarisation variability but remains stable in position angle. For the first time, we present a statistical study of K and {\\lambda}_max of the Serkowski law, including their mean value, standard deviation, and distribution. In order to show the FoReRo2 polarimetric capabilities, we also present several examples. The recurrent nova RS Oph shows variability of Serkowski's K parameter due to dust formation within the first few days after the 2021 outburst. The examples also include imaging polarimetry of comet C/2019 Y4 (ATLAS) and spectropolarimetric observations of the symbiotic star Z And.",
      "pdf_url": "https://arxiv.org/pdf/2512.05670.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05702",
      "title": "The Ratan Active Region Patches (RARPs) Database: A New Database of Solar Active Region Radio Signatures from the RATAN-600 Telescope",
      "authors": [
        "Maxim Korelov",
        "Irina Knyazeva",
        "Evgenii Kurochkin",
        "Nikolay Makarenko",
        "Denis Derkach"
      ],
      "abstract": "The Ratan Active Region Patches (RARPs) Database: A New Database of Solar Active Region Radio Signatures from the RATAN-600 Telescope Maxim Korelov, Irina Knyazeva, Evgenii Kurochkin, Nikolay Makarenko, Denis Derkach Submitted to Astronomy and Computing Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) Solar flares and coronal mass ejections, originating from solar active regions (ARs), are the primary drivers of space weather and can disrupt technological systems. Forecasting efforts heavily rely on photospheric magnetic field data from the Space-weather HMI Active Region Patch (SHARPs) data products. However, the crucial energy release occurs higher in the solar corona. Radio observations from instruments like the RATAN-600 telescope directly probe this region, but their scientific use has been hindered by a lack of standardized and accessible data products. To address this gap, we have developed the Ratan Active Region Patches (RARPs) database, a new public resource of multi-frequency radio spectra for solar ARs. Generated using RATANSunPy software, RARPs provides the first standardized radio counterpart to magnetic field archives. The database contains over 160,000 calibrated AR observations from 2009 to 2025, each including 3-18 GHz spectra and rich metadata. We demonstrate the scientific utility of this database by using machine learning to forecast solar flares. The radio spectra are first compressed into low-dimensional embedded features using an autoencoder, which are then used as predictors in baseline logistic regression classifiers. We compare the predictive power of these embedded RARPs features with that of the 18 SHARPs magnetic field parameters provided in the SHARPs data product headers. Our results show that while SHARPs data provides superior flare discrimination, the radio signatures in RARPs possess clear predictive potential and, for M-class and above flares, yield lower Brier Scores and positive Brier Skill Scores relative to SHARPs, indicating more accurate probabilistic forecasts for these events. This establishes radio data as a valuable and complementary information source.",
      "pdf_url": "https://arxiv.org/pdf/2512.05702.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05860",
      "title": "High-contrast L-band Integral Field Spectroscopy of HD 33632 Ab",
      "authors": [
        "Jordan M. Stone",
        "Steve Ertel",
        "Travis Barman",
        "Andrew J. I. Skemer",
        "Jarron M. Leisenring",
        "Philip M. Hinz",
        "Charles E. Woodward",
        "Michael F. Skrutskie"
      ],
      "abstract": "High-contrast L-band Integral Field Spectroscopy of HD 33632 Ab Jordan M. Stone, Steve Ertel, Travis Barman, Andrew J. I. Skemer, Jarron M. Leisenring, Philip M. Hinz, Charles E. Woodward, Michael F. Skrutskie Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) We present LBTI/ALES 3.07-4.08 micron spectroscopic observations of HD~33632~Ab, a ~53 M_Jup directly imaged companion to an F8 star. Spectroscopic measurements of HD 33632 Ab now span 1-4 micron, and we perform the first spectroscopic analysis covering this full range. The data are compared to isolated brown dwarf template spectra, indicating that HD 33632 Ab is similar to L8/9 field brown dwarfs. Synthetic atmosphere model spectra from multiple model families are fit, with cloudy models providing the best fits, consistent with expectations for an L-dwarf. Evolutionary model predictions for the bulk properties of HD 33632 Ab are highly constrained by the precise dynamical mass found for the object. In particular, predictions for surface gravity are narrowly peaked, log(g)=5.21+/-0.05, and not dependent on the effects of clouds or cloud dispersion. We find significant tension between the surface gravities and object radii inferred from atmosphere model fits and those predicted by evolutionary models. We conclude with a comparison to the spectra of the HR 8799 c, d, and e, and emphasize the case that HD 33632 Ab, and other L/T transition directly imaged companions with constrained masses, will serve an essential role in understanding the complex physical processes governing the appearance of clouds in planetary atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2512.05860.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05864",
      "title": "Asteroseismology of SPB stars: a comparison of forward asteroseismic modelling results from Kepler and TESS",
      "authors": [
        "L. J. A. Scott",
        "D. M. Bowman"
      ],
      "abstract": "Asteroseismology of SPB stars: a comparison of forward asteroseismic modelling results from Kepler and TESS L. J. A. Scott, D. M. Bowman 25 pages, 15 figures. Accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR) The slowly pulsating B (SPB) stars are a class of variable star with masses between about 3 and 8 M$_{\\odot}$. Their gravity-mode pulsation frequencies are sensitive to the near-core structure, which makes them useful probes of rotation and mixing in the deep stellar interior. Time series photometry, such as from the Kepler and TESS space telescopes, allows the extraction of their pulsation frequencies and construction of period spacing patterns. Previously, samples of slowly pulsating B stars were observed by the Kepler mission and underwent forward asteroseismic modelling to retrieve stellar parameters such as mass, age and core mass. However, all of these stars have since been re-observed by the ongoing TESS mission with light curves that are usually shorter and non-continuous, resulting in more difficult frequency extraction and interpretation in terms of constructing period spacing patterns. In this paper we compare the results of forward asteroseismic modelling of a sample of SPB stars using intermittent TESS light curve data to those based on long-duration Kepler light curves. We show how in some cases that the masses and core masses derived from only a few sectors of TESS data agree well with the 4-yr Kepler mission results, despite the stars having far fewer significant pulsation frequencies in their TESS light curves. However, some stars yield incompatible results, emphasising the complexities in forward asteroseismic modelling of gravity-mode pulsators with sparsely sampled or short duration TESS light curves.",
      "pdf_url": "https://arxiv.org/pdf/2512.05864.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05191",
      "title": "Keck Observations in the INfrared of Taurus and $ρ$ Oph Exoplanets And Ultracool dwarfs (KOINTREAU) I: A Planetary-Mass Companion and a Disk-Obscured Stellar Companion Discovered in Taurus",
      "authors": [
        "Samuel A. U. Walker",
        "Michael C. Liu",
        "Dimitri Mawet",
        "Charlotte Bond",
        "Mark Chun",
        "Raquel A. Martinez",
        "Mark W. Phillips",
        "Jonathan P. Williams",
        "Zhoujian Zhang",
        "Bin B. Ren",
        "Karl Stapelfeldt",
        "Taichi Uyama",
        "Nicole Wallack"
      ],
      "abstract": "Keck Observations in the INfrared of Taurus and $ρ$ Oph Exoplanets And Ultracool dwarfs (KOINTREAU) I: A Planetary-Mass Companion and a Disk-Obscured Stellar Companion Discovered in Taurus Samuel A. U. Walker, Michael C. Liu, Dimitri Mawet, Charlotte Bond, Mark Chun, Raquel A. Martinez, Mark W. Phillips, Jonathan P. Williams, Zhoujian Zhang, Bin B. Ren, Karl Stapelfeldt, Taichi Uyama, Nicole Wallack 29 pages, 18 figures, accepted for publication by AJ Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We present the first discoveries from Keck Observations in the INfrared of Taurus and $\\rho$ Oph Exoplanets And Ultracool dwarfs (KOINTREAU), an adaptive optics imaging survey of young stars in the Taurus and $\\rho$ Oph star-forming regions using the Keck infrared pyramid wavefront sensor (PyWFS). We have found two faint ($\\Delta$K~7 mag), wide-separation companions to two ~3-Myr-old Taurus members. Relative astrometry for these systems show that both companions are bound to their host stars. We obtained near-infrared spectra of these companions using IRTF/SpeX (R~100) and Gemini/GNIRS (R~1000-2000), and combine these with photometry from our NIRC2 imaging, the Pan-STARRS survey, and Spitzer/IRAC archival imaging to constrain their properties. One companion, KOINTREAU-1b (at a projected separation of 690 au), has an average near-IR spectral type of M9$\\pm$2, a gravity classification of VL-G, and a changing spectral type between the SpeX (M7) and GNIRS (L1) observations. We estimate this object's mass to be $10.6^{+2.5}_{-2.3}$ M$_{\\rm Jup}$, making KOINTREAU-1b the fifth planetary-mass companion found in Taurus. The other companion, KOINTREAU-2b (projected separation 560 au), has a spectral type of M4.5$\\pm$1 but is ~4 magnitudes underluminous relative to other Taurus stars of the same spectral type. We detect exceptionally strong He I 1.083 micron emission from this object, indicative of outflows driven by ongoing accretion, but with a conspicuous lack of accompanying H emission. We conclude that KOINTREAU-2b is a young star obscured by an edge-on disk and observed in scattered light. Finally, we derive a distortion solution for NIRC2 imaging which shows a 0.118° difference in position angle from the previous distortion solution.",
      "pdf_url": "https://arxiv.org/pdf/2512.05191.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20125",
      "title": "The lower mass limit for circumbinary disc fragmentation",
      "authors": [
        "Matthew Teasdale",
        "Dimitris Stamatellos"
      ],
      "abstract": "The lower mass limit for circumbinary disc fragmentation Matthew Teasdale, Dimitris Stamatellos Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) In recent years, many wide orbit circumbinary giant planets have been discovered; some of these may have formed by gravitational fragmentation of circumbinary discs. The aim of this work is to investigate the lower mass limit for circumbinary disc fragmentation. We use the Smoothed Particle Hydrodynamics code SEREN, which employs an approximate method for the radiative transfer, to perform 3 sets of simulations of gravitationally unstable discs. The first set of simulations covers circumstellar discs heated by a single 0.7M$_{\\odot}$ star (circumstellar model), the second set covers binaries with the same total stellar mass as the circumstellar model, attended by circumbinary discs with the same temperature profile (circumbinary fiducial model), and the third set covers circumbinary discs heated by each individual star (circumbinary realistic model). We vary the binary separation, mass ratio and eccentricity to see their effect on disc fragmentation. For the circumstellar disc model, we find a lower disc-to-star mass ratio for fragmentation of $\\sim\\,$0.31. For the circumbinary fiducial disc model we find the same disc-to-star mass ratio for fragmentation (but slightly lower for more eccentric, equal-mass binaries; 0.26). On the other hand, realistic circumbinary discs fragment at a lower mass limit (disc-to-star mass ratio of 0.17-0.26), depending on the binary properties. We conclude that circumbinary discs fragment at a lower disc mass (by $\\sim 45\\%$) than circumstellar discs. Therefore, gas giant planet around binaries may be able to form by gravitational instability easier than around single stars.",
      "pdf_url": "https://arxiv.org/pdf/2509.20125.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25636",
      "title": "Mode Composition Shapes Magnetic Anisotropy in Solar Wind Turbulence",
      "authors": [
        "Siqi Zhao",
        "Huirong Yan",
        "Terry Z. Liu",
        "Chuanpeng Hou"
      ],
      "abstract": "Mode Composition Shapes Magnetic Anisotropy in Solar Wind Turbulence Siqi Zhao, Huirong Yan, Terry Z. Liu, Chuanpeng Hou Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) Turbulence is a ubiquitous process that transfers energy across many spatial and temporal scales, thereby influencing particle transport and heating. Recent progress has improved our understanding of the anisotropy of turbulence with respect to the mean magnetic field; however, its exact form and implications for magnetic topology and energy transfer remain unclear. In this study, we investigate the nature of magnetic anisotropy in compressible magnetohydrodynamic (MHD) turbulence within low-$\\beta$ solar wind using measurements from the Cluster spacecraft. By decomposing small-amplitude fluctuations into Alfvén and compressible modes, we reveal that magnetic anisotropy is largely mode dependent: Alfvenic fluctuations are broadly distributed in propagation angle, whereas compressible fluctuations are concentrated near the quasi-parallel (slab) direction, a feature closely linked to collisionless damping of compressible modes. For $\\beta\\rightarrow0$, compressible modes become dominant within the slab component at smaller scales. These findings advance our understanding of magnetic anisotropy in solar wind turbulence and offer a new perspective on the three-dimensional turbulence cascade, with broad implications for particle transport, acceleration, and magnetic reconnection.",
      "pdf_url": "https://arxiv.org/pdf/2510.25636.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.08481",
      "title": "Stellar cycle variability in Mount Wilson stars and dynamo models: Rotation rate and dynamo number dependency",
      "authors": [
        "Suyog Garg",
        "Bidya Binay Karak",
        "Rohan B. Mandrai"
      ],
      "abstract": "Stellar cycle variability in Mount Wilson stars and dynamo models: Rotation rate and dynamo number dependency Suyog Garg, Bidya Binay Karak, Rohan B. Mandrai 11 pages, 7 figures, 3 tables. Accepted for publication in the Astrophysical Journal (in press) Solar and Stellar Astrophysics (astro-ph.SR) Similar to the solar cycle, the magnetic cycles of other solar-type stars are also variable. How the variability of the stellar cycle changes with the rotation rate or the dynamo number is a valuable information for understanding the stellar dynamo process. We examine the variability in the stellar magnetic cycles by studying 81 stars from the data of the Mount Wilson Observatory, which started observations in 1966. For 28 stars, we have time series data available till 2003, while for others, the data are limited till 1995. We specifically explore how the variability changes with respect to three rotation-related parameters. We find a modest positive correlation between the variability and the stellar rotation period. In addition, we find suggestive negative correlations between the variability and the inverse squared Rossby number ($Ro^{-2}$), and the ratio of the mean cycle duration and rotation period ($\\log \\, (\\langle P_{\\rm cyc} \\rangle / P_{\\rm rot})^2$). Variability computed from the magnetic field of stellar dynamo models also show similar trends. Finally, inspired by previous studies, we examine dynamo number scaling in our model data and find that $Ro^{-0.6}$ (instead of $Ro^{-2}$ as suggested in the linear $\\alpha \\Omega$ dynamo theory) and $(\\langle P_{\\rm cyc} \\rangle /P_{\\rm rot})^{0.6}$ (instead of $\\log \\, (\\langle P_{\\rm cyc} \\rangle / P_{\\rm rot})^2$ as predicted in previous observations) are a good measure of the dynamo number. In conclusion, our results demonstrate that the stellar magnetic cycle variability decreases with the increase of the rotation rate or the dynamo number.",
      "pdf_url": "https://arxiv.org/pdf/2511.08481.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.21987",
      "title": "Interferometric view into RT Pav's long secondary period. binary vs oscillatory convective modes",
      "authors": [
        "B. Courtney-Barrer",
        "X. Haubois",
        "P. Wood",
        "D. Dionese",
        "L. Decin",
        "C. Paladini",
        "I. El Mellah",
        "D. Defrère",
        "M. Ireland"
      ],
      "abstract": "Interferometric view into RT Pav's long secondary period. binary vs oscillatory convective modes B. Courtney-Barrer, X. Haubois, P. Wood, D. Dionese, L. Decin, C. Paladini, I. El Mellah, D. Defrère, M. Ireland Minor corrections and final formatting for journal publication. No changes to results Solar and Stellar Astrophysics (astro-ph.SR) Long secondary periods (LSPs) occur in about one-third of evolved stars, yet their origin remains unclear. The leading explanations are oscillatory convective modes and a binary companion embedded in dust. We investigate the LSP of the red giant RT Pav using multi-wavelength VLTI interferometry (PIONIER, GRAVITY, MATISSE; 1.5-5.0 microns), obtained near the phase where a companion would appear most separated. These data, combined with photometry and Gaia DR3 astrometry, constrain possible companion masses, orbits, and photometric effects. We model the interferometric observables using uniform-disk, limb-darkened, ellipse, binary, and oscillatory convective dipole representations, supported by Monte Carlo simulations. Gaia limits any companion to a mass whose Roche-lobe volume is too small to hold the obscuring or scattering material required to reproduce the observed LSP modulation. While binary fits can yield low chi-squared values, the inferred positions are inconsistent across wavelength, closure phases do not increase with wavelength as dusty companions predict, and significant detections occur in only two of four bands. Theoretical estimates show that a roughly 1 percent flux companion at LSP-like separations should be consistently detectable for typical O-rich AGB dust, but is not consistently observed. In contrast, an oscillatory convective dipole with a temperature contrast of about 200 K reproduces the H-band morphology and visible-light amplitude without violating Gaia or photometric constraints, and binary-like residuals vanish when dipole models are fitted. Our results therefore favor oscillatory convective modes over a binary origin for the LSP in RT Pav. Time-resolved spectro-interferometry across the LSP cycle is a natural next step.",
      "pdf_url": "https://arxiv.org/pdf/2511.21987.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.18971",
      "title": "The OATMEAL Survey. II. The 3D spin-orbit obliquity of an eccentric transiting brown dwarf in the Ruprecht 147 open cluster",
      "authors": [
        "Theron W. Carmichael",
        "Steven Giacalone",
        "Noah Vowell",
        "Daniel Huber",
        "Xian-Yu Wang",
        "Malik Bossett",
        "Luke Handley",
        "Aaron Householder",
        "Yaguang Li",
        "Benjamin J. Fulton",
        "Andrew Howard",
        "Howard Isaacson",
        "Samuel Halverson",
        "Arpita Roy"
      ],
      "abstract": "The OATMEAL Survey. II. The 3D spin-orbit obliquity of an eccentric transiting brown dwarf in the Ruprecht 147 open cluster Theron W. Carmichael, Steven Giacalone, Noah Vowell, Daniel Huber, Xian-Yu Wang, Malik Bossett, Luke Handley, Aaron Householder, Yaguang Li, Benjamin J. Fulton, Andrew Howard, Howard Isaacson, Samuel Halverson, Arpita Roy 16 pages, 5 figures, 4 tables, published in AJ Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We present new analysis of the CWW 89 system as part of the Orbital Architectures of Transiting Massive Exoplanets And Low-mass stars (OATMEAL) survey. The CWW 89 system is a member of the 2.8 Gyr old Ruprecht 147 (NGC 6774) cluster and features two stars, CWW 89A (EPIC 219388192) and CWW 89B, with the primary hosting a transiting brown dwarf. We use in-transit, highly precise radial velocity measurements with the Keck Planet Finder (KPF) to characterize the Rossiter-McLaughlin (RM) effect and measure the projected spin-orbit obliquity $|\\lambda|=1.4\\pm2.5^\\circ$ and the full 3D spin-orbit obliquity of the brown dwarf to be $\\psi=15.1^{+15.0^\\circ}_{-10.9}$. This value of $\\lambda$ implies that the brown dwarf's orbit is prograde and well-aligned with the equator of the host star, continuing the trend of transiting brown dwarfs showing a preference for alignment ($\\lambda \\approx 0^\\circ$) regardless of the stellar effective temperature. We find that this contrast with the transiting giant planet population, whose spin-orbit alignments depend on host $T_{\\rm eff}$, shows an increasingly clear distinction in the formation and orbital migration mechanisms between transiting giant planets and transiting brown dwarfs like CWW 89Ab. For this system in particular, we find it plausible that the brown dwarf may have undergone coplanar high-eccentricity migration influence by CWW 89B.",
      "pdf_url": "https://arxiv.org/pdf/2506.18971.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21506",
      "title": "Electrostatic waves in astrophysical Druyvesteyn plasmas: I. Langmuir waves",
      "authors": [
        "Simon Tischmann",
        "Rudi Gaelzer",
        "Dustin Schröder",
        "Marian Lazar",
        "Horst Fichtner"
      ],
      "abstract": "Electrostatic waves in astrophysical Druyvesteyn plasmas: I. Langmuir waves Simon Tischmann, Rudi Gaelzer, Dustin Schröder, Marian Lazar, Horst Fichtner Accepted for publication in The Astrophysical Journal Plasma Physics (physics.plasm-ph); Solar and Stellar Astrophysics (astro-ph.SR) Plasmas in various astrophysical systems are in non-equilibrium states as evidenced by direct in-situ measurements in the solar wind, solar corona and planetary environments as well as by indirect observations of nonthermal sources of waves and emissions. Specific to observed non-equilibrium plasmas are non-Maxwellian velocity distributions with suprathermal tails, most often described by Kappa (power-law) distributions. In this paper, we introduce an alternative modeling for linear waves in plasmas described by the generalized Druyvesteyn distribution model. This model can reproduce not only high-energy tails, but also low-energy flat-tops of velocity distributions, like those of electrons in interplanetary shocks and the solar transition region. The wave dispersion relation of longitudinal waves is derived in terms of the newly introduced Druyvesteyn dispersion function. The dispersion curves as well as damping rates of high-frequency Langmuir waves are numerically computed for the isotropic case, and their analytical approximations are provided in the limit of weak damping. We thus offer a new tool for modeling longitudinal waves, and in particular Langmuir waves under the specific conditions of Druyvesteyn distributions.",
      "pdf_url": "https://arxiv.org/pdf/2509.21506.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05601",
      "title": "Commissioning an Inexpensive Off-the-shelf Spectrograph for Radial-Velocity Studies",
      "authors": [
        "Lukas Stock",
        "Andreas Schrimpf"
      ],
      "abstract": "Commissioning an Inexpensive Off-the-shelf Spectrograph for Radial-Velocity Studies Lukas Stock, Andreas Schrimpf Astronomical Notes, e70067, 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a way to set up an inexpensive out of the shelf spectrograph at a local observatory. Stability and resolution of the spectrograph are high enough for radial velocity determination of binary stars or determination of stellar characteristics. Even some exoplanets might be detectable via the radial velocity method.",
      "pdf_url": "https://arxiv.org/pdf/2512.05601.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05949",
      "title": "Removing correlated noise stripes from the Nancy Grace Roman Space Telescope survey images",
      "authors": [
        "Katherine Laliotis",
        "Christopher M. Hirata",
        "Emily Macbeth",
        "Kaili Cao"
      ],
      "abstract": "Removing correlated noise stripes from the Nancy Grace Roman Space Telescope survey images Katherine Laliotis, Christopher M. Hirata, Emily Macbeth, Kaili Cao 15 pages, 10 figures, submitted to PASJ for review Instrumentation and Methods for Astrophysics (astro-ph.IM) Weak gravitational lensing has emerged as a powerful tool for investigating the matter distribution in the Universe and how it has evolved over cosmic time. The Wide Field Instrument (WFI) on the Nancy Grace Roman Space Telescope (Roman) will deliver some of the highest precision measurements of weak lensing ever made. Since weak lensing is based on statistics of faint sources, it can be biased by even tiny instrument systematics, including correlated read noise. Previous works have shown the infrared detectors used in the Roman WFI show correlations in their noise fields at a level significant for weak lensing measurements, even after application of standard reference pixel corrections; of particular concern is 1/f noise, which appears as horizontal banding in the detector frame. In this paper, we present imDestripe: a new Python module utilizing the multiple roll angles in Roman's observing strategy and linear algebra techniques to remove correlated noise stripes from observed images. We test imDestripe in a hybrid simulation by combining real noise realizations (from darks taken during ground testing) with simulated images of the astronomical scene, and find that the power spectrum of the banding can be suppressed by factors of 10--30 on large scales. We briefly discuss plans for further development of imDestripe in the context of the WFI pipeline.",
      "pdf_url": "https://arxiv.org/pdf/2512.05949.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07223",
      "title": "Readout noise of digital frequency multiplexed TES detectors for CUPID",
      "authors": [
        "Michel Adamič",
        "Joseph Camilleri",
        "Chiara Capelli",
        "Matt Dobbs",
        "Tucker Elleflot",
        "Yury G. Kolomensky",
        "Daniel Mayer",
        "Joshua Montgomery",
        "Valentine Novosad",
        "Vivek Singh",
        "Graeme Smecher",
        "Aritoki Suzuki",
        "Bradford Welliver"
      ],
      "abstract": "Readout noise of digital frequency multiplexed TES detectors for CUPID Michel Adamič, Joseph Camilleri, Chiara Capelli, Matt Dobbs, Tucker Elleflot, Yury G. Kolomensky, Daniel Mayer, Joshua Montgomery, Valentine Novosad, Vivek Singh, Graeme Smecher, Aritoki Suzuki, Bradford Welliver 8 pages, 8 figures. Presented at the IEEE SORMA West 2025, accepted for publication in IEEE Transactions on Nuclear Science IEEE Transactions on Nuclear Science Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM); Nuclear Experiment (nucl-ex) Superconducting transition-edge sensor (TES) detectors have been the standard in Cosmic Microwave Background experiments for almost two decades and are now being adapted for use in nuclear physics, such as neutrinoless double beta decay searches. In this paper we focus on a new high-bandwidth frequency multiplexed TES readout system developed for CUPID, a neutrinoless double beta decay experiment that will replace CUORE. In order to achieve the high energy resolution requirements for CUPID, the readout noise of the system must be kept to a minimum. Low TES operating resistance and long wiring between the readout SQUID and the warm electronics are needed for CUPID, prompting a careful consideration of the design parameters of this application of frequency multiplexing. In this work, we characterize the readout noise of the newly designed frequency multiplexed TES readout system for CUPID and construct a noise model to understand it. We find that current sharing between the SQUID coil impedance and other branches of the circuit, as well as the long output wiring, worsen the readout noise of the system. To meet noise requirements, a SQUID with a low input inductance, high transimpedance and/or low dynamic impedance is needed, and the wiring capacitance should be kept as small as possible. Alternatively, the option of adding a cryogenic low-noise amplifier at the output of the SQUID should be explored.",
      "pdf_url": "https://arxiv.org/pdf/2509.07223.pdf",
      "categories": [
        "astro-ph.IM",
        "nucl-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05279",
      "title": "Multi-bandpass Photometry for Exoplanet Atmosphere Reconnaissance (MPEAR) with the Habitable Worlds Observatory (HWO) -- I. Differentiating Earth from Neptunes During Discovery",
      "authors": [
        "Eleonora Alei",
        "Avi M. Mandell",
        "Miles H. Currie",
        "Aki Roberge",
        "Christopher C. Stark",
        "Allison Payne",
        "Vincent Kofman",
        "Geronimo L. Villanueva",
        "Renyu Hu",
        "Amber V. Young"
      ],
      "abstract": "Multi-bandpass Photometry for Exoplanet Atmosphere Reconnaissance (MPEAR) with the Habitable Worlds Observatory (HWO) -- I. Differentiating Earth from Neptunes During Discovery Eleonora Alei, Avi M. Mandell, Miles H. Currie, Aki Roberge, Christopher C. Stark, Allison Payne, Vincent Kofman, Geronimo L. Villanueva, Renyu Hu, Amber V. Young 28 pages, 11 figures, 3 tables. Accepted for publication to AJ Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) As the architecture for the Habitable Worlds Observatory (HWO) is being developed, it is crucial to optimize the observing strategies for a survey to detect and characterize Earth-like planets around Sun-like stars. Efficient target identification and characterization will help drive mission requirements that can be matched to the planned observations. Current HWO concepts allow simultaneous multi-bandpass observations with the coronagraph instrument, critical for performing a qualitative planetary reconnaissance to optimize observing time for deriving orbital constraints and prioritize characterization of promising targets. We describe a new algorithm designed to determine the best combination of broadband photometric observations for extracting maximum information from the first visit. It identifies degeneracies in the orbital configurations, fluxes, and noise, and determines optimal secondary photometry bands to reduce these. We demonstrate its application by comparing an Earth seen at quadrature with a cold and a warm Neptune at inclined orbits and varying phases, with comparable flux in the discovery bandpass centered at 500 nm (20\\% bandwidth). Using the noise and exposure time calculator that we developed for the HWO coronagraph instrument, we find that the baseline $S/N=7$ (corresponding to 3.2 hours observing time for a planet at 10pc) is only sufficient to marginally differentiate the Earth from a cold Neptune-like planet assuming two parallel bandpasses (550 nm + 850 nm). However, increasing to $S/N=15$ (7 hours observing time) and using three parallel bandpasses (360 nm + 500 nm + 1.11 micron) would differentiate the Earth from either a warm or cold Neptune.",
      "pdf_url": "https://arxiv.org/pdf/2512.05279.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05330",
      "title": "On-Orbit Calibration of Danuri/PolCam. I. Geometric Calibration",
      "authors": [
        "Kilho Baek",
        "Sungsoo S. Kim",
        "Minsup Jeong",
        "Young-Jun Choi"
      ],
      "abstract": "On-Orbit Calibration of Danuri/PolCam. I. Geometric Calibration Kilho Baek, Sungsoo S. Kim, Minsup Jeong, Young-Jun Choi 13 pages, 9 figure, 2 tables, published on 12/01/2025 in Journal of the Korean Astronomical Society (JKAS), see this https URL J. Korean Astron. Soc., 58, (2025), 291-303 Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The wide-angle Polarimetric Camera (PolCam) onboard South Korea's first lunar orbiter, Danuri, is a pioneering instrument designed to conduct the first global polarimetric and high-phase-angle survey of the Moon. Precise geometric calibration is critical for this mission, particularly due to PolCam's highly oblique viewing geometry, which introduces significant topographic distortion. We present a comprehensive on-orbit geometric calibration that relies on 160,256 tie points derived from matching features between PolCam images and the well-orthorectified global map of the Kaguya Multiband Imager (MI). This dataset allows us to address two fundamental challenges: (1) the accurate reconstruction of the observation time for each line of an observation strip via a simple linear model, and (2) the refinement of the precise camera model, geometric model for PolCam optics. Our optimization method for these two challenges transforms the 2D image coordinates of identified features into 3D lunar coordinates and minimizes the reprojection error against the reference coordinates provided by the Kaguya MI map. From the refined observation time and camera model, we compute the precise longitude, latitude, and elevation of each pixel of an observed image. These estimated 3D coordinates are then used to generate orthorectified images, the final product of the geometric calibration. The resulting calibration achieves a geometric precision comparable to that of previous lunar orbiters and establishes the foundational framework necessary to produce geometrically-corrected data products of PolCam.",
      "pdf_url": "https://arxiv.org/pdf/2512.05330.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05935",
      "title": "Transformation of orientation and rotation angles of synchronous satellites: Application to the Galilean moons",
      "authors": [
        "Marie Yseboodt",
        "Rose-Marie Baland"
      ],
      "abstract": "Transformation of orientation and rotation angles of synchronous satellites: Application to the Galilean moons Marie Yseboodt, Rose-Marie Baland Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The orientation and rotation of a synchronous satellite can be referred to both its Laplace plane and the ICRF equatorial plane, in terms of Euler angles or spin axis Cartesian coordinates and Earth equatorial coordinates, respectively. We computed second-order analytical expressions to make the transformation between the two systems and applied them to the Galilean satellites (Io, Europa, Ganymede, and Callisto). If one term of the spin axis Cartesian coordinates series is dominant, trigonometric series can be generated for the inertial and orbital obliquities, node longitude and offset with respect to the Cassini plane. Since the transformation does not require any fit of amplitudes and frequencies on numerical series, the physical meaning of the frequencies is preserved from the input series and the amplitudes can be directly related to the geophysical parameters of interest. We provide tables for the coordinates and angles' series assuming that the satellites are entirely solid, and considering two different orbital theories. The possible amplitude ranges for the main terms are also examined in the case where a liquid layer is assumed in the interior model. We use our transformation method to propose an updated IAU WG solution which would result in an improvement with respect to zero obliquity models used so far. This method will also be useful for the interpretation of future Earth-based radar observations or JUICE data.",
      "pdf_url": "https://arxiv.org/pdf/2512.05935.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05175",
      "title": "TESS phase curve of ultra-hot Jupiter WASP-189 b",
      "authors": [
        "J. A. Patel",
        "D. Kitzmann",
        "A. Brandeker",
        "T. G. Wilson",
        "A. Deline",
        "M. Lendl",
        "V. Singh"
      ],
      "abstract": "TESS phase curve of ultra-hot Jupiter WASP-189 b J. A. Patel, D. Kitzmann, A. Brandeker, T. G. Wilson, A. Deline, M. Lendl, V. Singh 13 pages, 6 + 2 figures, 2 tables, accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) The thermal structures of highly irradiated ultra-hot Jupiters can deviate substantially from those of cooler hot Jupiters. For planets orbiting rapidly rotating, and consequently oblate, host stars, photometric light curves provide a unique opportunity to measure the spin-orbit angle. Moreover, in systems with significant spin-orbit misalignment, the stellar oblateness can induce observable orbital precession. We wish to study the atmosphere and orbital architecture of an ultra-hot Jupiter WASP-189 b, orbiting around a hot A-type star. We use the photometric phase curves and gravity-darkened transits of WASP-189 b observed with the Transiting Exoplanet Survey Satellite (TESS), complemented with the archival observations from CHaracterising ExOPlanet Satellite (CHEOPS). We detected a phase curve signal with significant occultation depth of 203.4 (+16.2) (-16.3) ppm, while the nightside flux, -71.8 (+36.4) (-36.0) ppm, is consistent with zero at 2-sigma. We invert the phase curve signal to construct the temperature map of the planet. The map was subsequently used to estimate the Bond albedo and heat redistribution efficiency, the expected median ranges of which are found to be 0.19-0.35 and 0.09-0.41, respectively. Finally, we analysed gravity-darkened transits to find that the planet is in polar orbit with the spin-orbit angle of 89.46 (+1.08) (-1.08) deg. We found no hint of orbital precession while comparing our results with those from the literature. Our observations, together with atmospheric modelling, suggest that the dayside emission of WASP-189 b in TESS and CHEOPS bandpasses is dominated by thermal emission from an atmosphere with extremely inefficient heat transport and negligible contribution from reflected light.",
      "pdf_url": "https://arxiv.org/pdf/2512.05175.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05737",
      "title": "Radial modes of pressure bumps and dips in astrophysical discs",
      "authors": [
        "Armand Leclerc",
        "Guillaume Laibe",
        "Elliot Lynch",
        "Nicolas Perez"
      ],
      "abstract": "Radial modes of pressure bumps and dips in astrophysical discs Armand Leclerc, Guillaume Laibe, Elliot Lynch, Nicolas Perez 10 pages of main text. To be presented at the International Conference on Exoplanets and Planet Formation (EPF25), 8th-12th Dec 2025. Submitted to Astronomy and Astrophysics Earth and Planetary Astrophysics (astro-ph.EP); Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Fluid Dynamics (physics.flu-dyn) This study investigates the signatures of pressure extrema on global oscillations in discs. To this end, we use the framework of wave topology to establish a generalised local dispersion relation that includes pressure gradients. We highlight the influence of a previously unrecognized epicyclic-acoustic frequency and derive an analytical criterion for the existence of a branch of modes transiting between the inertial and the pressure bands. We find that pressure extrema consist of wave guides in which such topological modes propagate. The fundamental mode trapped at a pressure bump can propagate at all frequencies, allowing it to resonate with any temporal forcing, while the mode associated with a pressure gap propagates at a fixed frequency, propagates with arbitrary vertical phase velocity. These specific features make them attractive candidates for future discoseismology.",
      "pdf_url": "https://arxiv.org/pdf/2512.05737.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05751",
      "title": "Exoplanet formation inference using conditional invertible neural networks",
      "authors": [
        "Remo Burn",
        "Victor F. Ksoll",
        "Hubert Klahr",
        "Thomas Henning"
      ],
      "abstract": "Exoplanet formation inference using conditional invertible neural networks Remo Burn, Victor F. Ksoll, Hubert Klahr, Thomas Henning 10 pages, accepted poster for the Machine Learning and the Physical Sciences Workshop at the 39th conference on Neural Information Processing Systems (NeurIPS 2025) Machine Learning and the Physical Sciences Workshop, 39th conference on Neural Information Processing Systems (NeurIPS 2025) Earth and Planetary Astrophysics (astro-ph.EP); Neural and Evolutionary Computing (cs.NE); Data Analysis, Statistics and Probability (physics.data-an) The interpretation of the origin of observed exoplanets is usually done only qualitatively due to uncertainties of key parameters in planet formation models. To allow a quantitative methodology which traces back in time to the planet birth locations, we train recently developed conditional invertible neural networks (cINN) on synthetic data from a global planet formation model which tracks growth from dust grains to evolved final giant planets. In addition to deterministic single planet formation runs, we also include gravitationally interacting planets in multiplanetary systems, which include some measure of chaos. For the latter case, we treat them as individual planets or choose the two or three planets most likely to be discovered by telescopes. We find that training on multiplanetary data, each planet treated as individual point, is promising. The single-planet data only covers a small range of planets and does not extrapolate well to planet properties not included in the training data. Extension to planetary systems will require more training data due to the higher dimensionality of the problem.",
      "pdf_url": "https://arxiv.org/pdf/2512.05751.pdf",
      "categories": [
        "astro-ph.EP",
        "cs.NE"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05816",
      "title": "Most Rocky Sub-Neptunes are Molten: Mapping the Solidification Shoreline for Gas Dwarf Exoplanets",
      "authors": [
        "Robb Calder",
        "Oliver Shorttle",
        "Harrison Nicholls",
        "Tim Lichtenberg",
        "Claire-Marie Guimond"
      ],
      "abstract": "Most Rocky Sub-Neptunes are Molten: Mapping the Solidification Shoreline for Gas Dwarf Exoplanets Robb Calder, Oliver Shorttle, Harrison Nicholls, Tim Lichtenberg, Claire-Marie Guimond 12 pages, 9 figures, submitted for review in Monthly Notices of the Royal Astronomical Society (MNRAS) December 2025, comments welcome Earth and Planetary Astrophysics (astro-ph.EP) Sub-Neptunes are the most common type of detected exoplanet, yet their observed masses and radii are degenerate with several interior structures. One possibility is that sub-Neptunes have silicate/iron interiors and H$_2$-dominated atmospheres, i.e., they are `gas dwarfs'. If gas dwarfs have molten interiors, interactions between their magma oceans and atmospheres will produce distinct observational signatures. These signatures may break the degeneracy in interior structure, while providing insight into their interior processes, history, and population trends. We expect all such planets are born molten, but under what conditions do they remain molten today? We use the coupled interior-climate evolution model, PROTEUS, to estimate the `solidification shoreline': the instellation flux boundary (as a function of stellar $T_{\\rm eff}$) that separates molten gas dwarfs from solidified ones. Our results show that 98\\% of detected sub-Neptunes occupy a region of parameter space consistent with their having permanent magma oceans, if they are gas dwarfs. While mantle $f{\\rm O}_2$ and bulk volatile C/H ratio both influence magma ocean lifetimes, planets with oxidising mantles and carbon-rich atmospheres are unlikely to have radii consistent with the sub-Neptune classification. Therefore, most detected sub-Neptunes (if they are gas dwarfs) have permanent magma oceans. This result motivates further research into the interactions between molten interiors and overlying atmospheres, and campaigns to identify unambiguous signatures of these interactions.",
      "pdf_url": "https://arxiv.org/pdf/2512.05816.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}