{
  "date": "2025-12-31",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.SR",
    "astro-ph.IM",
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.HE"
  ],
  "total_papers": 96,
  "gw_related_papers": 7,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.22924",
      "title": "Primordial black holes within Higgs hybrid metric-Palatini approach",
      "authors": [
        "Brahim Asfour",
        "Farida Bargach",
        "Yahya Ladghami",
        "Ahmed Errahmani",
        "Taoufik Ouali"
      ],
      "abstract": "Primordial black holes within Higgs hybrid metric-Palatini approach Brahim Asfour, Farida Bargach, Yahya Ladghami, Ahmed Errahmani, Taoufik Ouali Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) In this paper, we investigate the production of primordial black holes (PBHs) during the radiation-dominated era. The collapse of significant density perturbations originating from large primordial scalar fluctuations generated during inflation can lead to the formation of primordial black holes. In our study, we adopt the Higgs hybrid metric-Palatini model as our framework, in which the inflaton field and the Palatini curvature are non-minimally coupled. To achieve our objective, we analyze the behavior of the primordial curvature power spectrum, which exhibits a large enhancement at small scales corresponding to large wavenumbers $k$. Furthermore, we examine the probability of PBHs formation by studying the mass variance, $\\sigma(M_{PBH})$, and the mass fraction of the total energy density collapsing into PBHs, $\\beta(M_{PBH})$. The evolution of both functions is consistent with current observational constraints. Finally, we investigate the abundance of primordial black holes as a dark matter candidate. We found that they can account for the totality or a fraction of the current dark matter content, depending primarily on the values of the coupling constant and the e-folds number.",
      "pdf_url": "https://arxiv.org/pdf/2512.22924.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23057",
      "title": "Reconstructing Relativistic Magnetohydrodynamics with Physics-Informed Neural Networks",
      "authors": [
        "Corwin Cheung",
        "Marcos Johnson-Noya",
        "Michael Xiang",
        "Dominic Chang",
        "Alfredo Guevara"
      ],
      "abstract": "Reconstructing Relativistic Magnetohydrodynamics with Physics-Informed Neural Networks Corwin Cheung, Marcos Johnson-Noya, Michael Xiang, Dominic Chang, Alfredo Guevara 7 pages with figures. Code available on this http URL Computational Physics (physics.comp-ph); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We construct the first physics-informed neural-network (PINN) surrogates for relativistic magnetohydrodynamics (RMHD) using a hybrid PDE and data-driven workflow. Instead of training for the conservative form of the equations, we work with Jacobians or PDE characteristics directly in terms of primitive variables. We further add to the trainable system the divergence-free condition, without the need of cleaning modes. Using a novel MUON optimizer implementation, we show that a baseline PINN trained on early-time snapshots can extrapolate RMHD dynamics in one and two spatial dimensions, and that posterior residual-guided networks can systematically reduce PDE violations.",
      "pdf_url": "https://arxiv.org/pdf/2512.23057.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23098",
      "title": "Two birds with one stone: simultaneous realization of both Lunar Coordinate Time and lunar geoid time by a single orbital clock",
      "authors": [
        "Tian-Ning Yang",
        "Ren-Fang Geng",
        "Jing Zhang",
        "Chong Yang",
        "Yong Huang",
        "Yi Xie"
      ],
      "abstract": "Two birds with one stone: simultaneous realization of both Lunar Coordinate Time and lunar geoid time by a single orbital clock Tian-Ning Yang, Ren-Fang Geng, Jing Zhang, Chong Yang, Yong Huang, Yi Xie Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); General Relativity and Quantum Cosmology (gr-qc) Context. Among options for definition of the lunar reference time, the option taking Lunar Coordinate Time (O1) has its simplicity but cannot be realized by any clock without steering, while another option adopting the lunar geoid (selenoid) proper time (O2) has its convenience for users on the lunar surface but would bring a new scaling of spatial coordinates and mass parameter of the Moon. Aims. We propose a ''time aligned orbit'' that the readings of an ideal clock in this orbit could equal to the selenoid proper time in O2 and these readings could be converted to Lunar Coordinate Time in O1 by a known linear transformation. Methods. We show that there exist the time aligned orbit around the Moon with its semi-major axis of about 1.5 lunar radius slightly depending on its inclination. We conduct a set of numerical simulations to assess to what extent a clock on these orbits could realize O2 in a more realistic lunar environment. Results. We find that the proper time in our simulations would desynchronize from the selenoid proper time up to 190 ns after a year with a frequency offset of 6E-15, which is solely 3.75% of the frequency difference in O2 caused by the lunar surface topography. These numbers might be further reduced to 13 ns and 4E-16, if we could account for the deviation of the mean orbits in our simulations from the nominal ones. Conclusions. One might simultaneously realize O1 and O2 by deployment of a single clock in the time aligned orbit. This approach also has its scalability for other terrestrial planets beyond the Earth-Moon system.",
      "pdf_url": "https://arxiv.org/pdf/2512.23098.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.15419",
      "title": "Impact of general relativistic accretion on primordial black holes",
      "authors": [
        "Santabrata Das",
        "Md Riajul Haque",
        "Jitumani Kalita",
        "Rajesh Karmakar",
        "Debaprasad Maity"
      ],
      "abstract": "Impact of general relativistic accretion on primordial black holes Santabrata Das, Md Riajul Haque, Jitumani Kalita, Rajesh Karmakar, Debaprasad Maity 9 pages, 6 figures, published in Physical Review D Phys. Rev. D 112, 123540 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We demonstrate that general relativistic corrections to the accretion of relativistic matter onto primordial black holes (PBHs) can significantly enhance their mass growth during the early Universe. Contrary to previous Newtonian treatments, our analysis reveals that PBH masses can increase by an order of magnitude before evaporation, leading to substantial modifications of their lifetime and cosmological imprints. We quantify the resulting shifts in the minimum PBH mass constrained by Big Bang Nucleosynthesis (BBN), the revised lower bound for PBHs surviving today, and the dark matter parameter space allowed by PBH evaporation. Furthermore, we show that the enhanced accretion alters the high-frequency gravitational wave spectrum from PBH evaporation, potentially within the reach of future detectors. Our results provide a comprehensive, relativistically consistent framework to delineate the role of PBHs in early-universe cosmology and dark matter phenomenology.",
      "pdf_url": "https://arxiv.org/pdf/2505.15419.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.09704",
      "title": "Cooling of dark neutron stars",
      "authors": [
        "B. X. Zhou",
        "H. C. Das",
        "J. B. Wei",
        "G. F. Burgio",
        "Z. H. Li",
        "H.-J. Schulze"
      ],
      "abstract": "B. X. Zhou, H. C. Das, J. B. Wei, G. F. Burgio, Z. H. Li, H.-J. Schulze 14 pages, 10 figures, Published in Phys. Rev. D Phys. Rev. D 112, 123035 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); Nuclear Theory (nucl-th) We study the cooling of isolated dark-matter-admixed neutron stars, employing a realistic nuclear equation of state and realistic nuclear pairing gaps, together with fermionic dark matter of variable particle mass and dark-matter fraction. The related parameter space is scanned for the stellar structural and cooling properties. We find that a consistent description of all current cooling data requires fast direct Urca cooling and reasonable proton 1S0 gaps. Dark matter affects the cooling properties by a modification of the nuclear density profiles, but also changes stellar radius and maximum mass. Possible signals of a large dark matter content could be a very massive but slow-cooling star or a very light but fast-cooling star.",
      "pdf_url": "https://arxiv.org/pdf/2508.09704.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25083",
      "title": "Extended mass distribution of PBHs during QCD phase transition: SGWB and mini-EMRIs",
      "authors": [
        "Nilanjandev Bhaumik",
        "Huai-Ke Guo",
        "Si-Jiang Liu"
      ],
      "abstract": "Extended mass distribution of PBHs during QCD phase transition: SGWB and mini-EMRIs Nilanjandev Bhaumik, Huai-Ke Guo, Si-Jiang Liu v1: 33 Pages, 9 Figures, 2 Tables, v2: 38 Pages, 10 Figures, 2 Tables, Added waveforms from IMRPhenomXAS and FastEMRIWaveforms, v3: 40 Pages, 10 Figures, 3 Tables (minor changes, version accepted for publication in Phys. Rev. D) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Primordial black holes (PBHs) are one of the most important tracers of cosmic history. In this work, we investigate the formation of PBHs around the time of the QCD phase transition from a broadly peaked inflationary scalar power spectrum, which naturally produces an extended PBH mass function. This scenario yields two distinct stochastic gravitational wave backgrounds (SGWB): (i) scalar-induced, second-order tensor perturbations generated at PBH formation, and (ii) a merger-driven SGWB from the subsequent PBH binary population. Using Bayesian analysis, we examine both SGWB channels with the data from the NANOGrav 15-year dataset and the first three observing runs of LVK. We also forecast continuous-wave signals from mini extreme mass ratio inspirals (mini-EMRIs) for direct comparison with NANOGrav and LVK constraints. Our parameter scans identify regions of the parameter space where the combined SGWB is detectable in future ground-based and space-based detectors. A broad PBH mass distribution naturally gives rise to mini-EMRIs, which future ground-based observatories, such as LVK A+, ET, and CE, can detect. For a large part of the PBH parameter space, the SGWB of astrophysical origin masks the primordial SGWB in the frequency band of ground-based detectors. Thus, for extended PBH mass distributions, we find that the detection of mini-EMRIs is a more robust channel for probing the PBH parameter space than the corresponding SGWB.",
      "pdf_url": "https://arxiv.org/pdf/2509.25083.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.04459",
      "title": "Study the nature of dynamical dark energy by measuring the CMB polarization rotation angle",
      "authors": [
        "Hua Zhai",
        "Si-Yu Li",
        "Yang Liu",
        "Yiwei Zhong",
        "Hong Li",
        "Yaqiong Li",
        "Congzhan Liu",
        "Mingzhe Li",
        "Xinmin Zhang"
      ],
      "abstract": "Study the nature of dynamical dark energy by measuring the CMB polarization rotation angle Hua Zhai, Si-Yu Li, Yang Liu, Yiwei Zhong, Hong Li, Yaqiong Li, Congzhan Liu, Mingzhe Li, Xinmin Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Recent results from the Dark Energy Spectroscopic Instrument (DESI) support the dynamical dark energy. Intriguingly, the data favor a transition of the dark energy equation of state across $w=-1$, a hallmark of the Quintom scenario. In this paper, we consider a different approach to the dynamical nature of dark energy by investigating its interaction with ordinary matters, specifically the Chern-Simons (CS) interaction with photons. In cosmology, this interaction rotates the polarized plane of the cosmic microwave background (CMB) photons, which induces non-zero polarized TB and EB power spectra. We forecast this measurement with the Ali CMB Polarization Telescope (AliCPT) experiment. We take the best-fit value of the isotropic rotation angle from Planck data as our fiducial input. We project that 11 module-year (modyr) of observations will yield an improved detection sensitivity with a significance $\\sim 5\\sigma$, given a calibration precision of $0.1^\\circ$ in the polarization angle. We also forecast AliCPT's sensitivity to the amplitude of a scale invariant spectrum of the anisotropic polarization rotation field. With $50$~modyr of observations, the large-aperture configuration is expected to reach $\\sigma_{A_{\\mathrm{CB}}}\\sim10^{-2}$, offering a sixfold improvement over the small-aperture design and enabling competitive tests of spatial fluctuations in the dark energy field.",
      "pdf_url": "https://arxiv.org/pdf/2511.04459.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.06018",
      "title": "Nearly forgotten results in development of physical cosmology",
      "authors": [
        "Alexander F. Zakharov"
      ],
      "abstract": "Nearly forgotten results in development of physical cosmology Alexander F. Zakharov presented as a plenary talk at The XXVIth International Baldin Seminar on High Energy Physics Problems \"Relativistic Nuclear Physics and Quantum Chromodynamics\" (JINR, Dubna), minor misprints are corrected, references were added, accepted in Physics of Elementary Particles and Atomic Nuclei, 23 pages, 3 figures History and Philosophy of Physics (physics.hist-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) It would be reasonable to recall some critical issues in physical cosmology development. GR was created by A. Einstein in 1915. In 1917 Einstein proposed the first (static) cosmological model. Soon after the A. Eddington proved that the model is unstable therefore it can not be realizable in nature. In 1922 and 1924 A. A. Friedmann found non-stationary solutions for cosmological equations written in the framework of GR. In 1927 G. Lemaitre obtained very similar results and, in addition, he derived the Hubble law (E. Hubble obtained this law from observations). Unfortunately, G. Lemaitre published his paper in not very popular Belgium journal. In 1931 Lemaitre proposed the first version of hot Universe model (he called it hypothesis of the primeval atom). In his book Lemaitre predicted even a background radiation as a signature of his model. One of the important property of the Lemaitre -- Gamow model was a prediction of CMB radiation with a temperature around a few K. It was recalled that the discovery of CMB radiation was done by T. Shmaonov in 1956 and his paper was published in 1957 (several years before Penzias and Wilson). In 1965, 1970 E. B. Gliner proposed vacuum like equation of matter which could correspond to exponential explosion of the Universe which was later called inflation. For decades in USSR, Friedmann's cosmological non-stationary models were treated as purely mathematical results without cosmologocal applications. On September 16, 1925 passed away untimely and it would be reasonable to remind today his great contribution in physical cosmology since the authors of book on Friedmann wrote that \"similarly to Copernicus who forced the Earth to move Friedmann forced the Universe to expand\".",
      "pdf_url": "https://arxiv.org/pdf/2511.06018.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.06640",
      "title": "Starobinsky Inflation and the Latest CMB Data: A Subtle Tension?",
      "authors": [
        "J. Bezerra-Sobrinho",
        "L. G. Medeiros"
      ],
      "abstract": "Starobinsky Inflation and the Latest CMB Data: A Subtle Tension? J. Bezerra-Sobrinho, L. G. Medeiros Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We analyze the Starobinsky inflation model and the impact of curvature corrections, particularly a cubic $R^3$ term, to assess their behavior in light of the latest observational results from the Atacama Cosmology Telescope (ACT). With the recent sixth data release (DR6), the scalar spectral index was measured to be $n_s=0.9743 \\pm 0.0034$, which appears to exclude the pure Starobinsky model at approximately the $2\\sigma$ level. In this paper, we implement the Starobinsky inflationary potential directly into the CLASS code, without relying on the slow-roll approximation, and we constrain the number of e-folds of inflation $N_k$ using a theoretically motivated range derived from reheating considerations and standard couplings between matter fields and gravity. We show that it is still possible to identify a significant region of parameter space where the Starobinsky model remains highly consistent with the latest observational data. While the pure Starobinsky model remains a compelling candidate for cosmic inflation, we explore how including a cubic $R^3$ term can shift its predictions to better align with the Planck and ACT measurements.",
      "pdf_url": "https://arxiv.org/pdf/2511.06640.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13544",
      "title": "The Serendipitous Axiodilaton: A Self-Consistent Recombination-Era Solution to the Hubble Tension",
      "authors": [
        "Adam Smith",
        "Maria Mylova",
        "Carsten van de Bruck",
        "C.P. Burgess",
        "Eleonora Di Valentino"
      ],
      "abstract": "The Serendipitous Axiodilaton: A Self-Consistent Recombination-Era Solution to the Hubble Tension Adam Smith, Maria Mylova, Carsten van de Bruck, C.P. Burgess, Eleonora Di Valentino Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Axio-dilaton cosmology provides a minimal benchmark model for both Dark Matter (DM) and Dark Energy (DE) that is well motivated by fundamental physics. The axion and dilaton arise as pseudo-Goldstone modes of symmetries that predict particle masses depend on the dilaton, and therefore to evolve cosmologically, leading to correlated modifications of recombination physics, the sound horizon, and late-time expansion and growth histories. We confront this model with Planck 2018 temperature, polarisation, and lensing data, SPT-3G high-$\\ell$ measurements, DESI DR2 BAO, and Pantheon$+$ supernovae, assuming that the axion makes up all of the dark matter and that the dilaton plays the role of a dark energy field. We find that it fits the data somewhat better than $\\Lambda$CDM cosmology, with the $\\chi^2$ lowered by $\\simeq 7$ for three additional parameters, and significantly raises the inferred Hubble constant to $H_0 \\simeq 69.2\\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, reducing the Hubble tension to $\\lesssim 3\\sigma$ and thereby allowing a joint fit of CMB and SH0ES data. The model fits this enlarged data set as well as the $w_0w_a$ model with an electron mass modified by hand at recombination, though it does so with calculable dynamics. Axio-dilaton self-interactions robustly fake a phantom equation of state in DESI measurements. There is a sting: cosmology prefers dilaton-matter couplings $|\\mathbf{g}|\\sim 10^{-2}$-$10^{-1}$, which are large enough to have been detected in solar-system tests of General Relativity. These results show how axio-dilatons can provide a viable cosmology preferred by current data at surprisingly large couplings, within a framework that links dark energy, dark matter, and time-dependent particle masses in a coherent way. They suggest both new observable signals and new theoretical directions, aimed at resolving the apparent inconsistency with non-cosmological observations.",
      "pdf_url": "https://arxiv.org/pdf/2512.13544.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.18290",
      "title": "Robust and scalable simulation-based inference for gravitational wave signals with gaps",
      "authors": [
        "Ruiting Mao",
        "Jeong Eun Lee",
        "Matthew C. Edwards"
      ],
      "abstract": "Robust and scalable simulation-based inference for gravitational wave signals with gaps Ruiting Mao, Jeong Eun Lee, Matthew C. Edwards Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); Data Analysis, Statistics and Probability (physics.data-an); Instrumentation and Detectors (physics.ins-det) The Laser Interferometer Space Antenna (LISA) data stream will inevitably contain gaps due to maintenance and environmental disturbances, introducing nonstationarities and spectral leakage that compromise standard frequency-domain likelihood evaluations. We present a scalable Simulation-Based Inference (SBI) framework capable of robust parameter estimation directly from gapped time-series data. We employ Flow Matching Posterior Estimation (FMPE) conditioned on a learned summary of the data, optimized through an end-to-end training strategy. To address the computational challenges of long-duration signals, we propose a dual-pathway summarizer architecture: a 1D Convolutional Neural Network (CNN) operating on the time domain for high precision, and a novel wavelet-based 2D CNN utilizing asymmetric, dilated kernels to achieve scalability for datasets spanning months. We demonstrate the efficacy of this framework on simulated Galactic Binary-like signals, showing that our joint training approach yields tighter, unbiased posteriors compared to two-stage reconstruction pipelines. Furthermore, we provide the first systematic comparison showing that FMPE offers superior stability and coverage calibration over conventional Normalizing Flows in the presence of severe data artifacts.",
      "pdf_url": "https://arxiv.org/pdf/2512.18290.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.19000",
      "title": "$\\mathbf{Ω_1Ω_2}$-$\\mathbfΛ$CDM: A promising phenomenological extension of the standard model of cosmology",
      "authors": [
        "Suresh Kumar"
      ],
      "abstract": "$\\mathbf{Ω_1Ω_2}$-$\\mathbfΛ$CDM: A promising phenomenological extension of the standard model of cosmology Suresh Kumar Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate a phenomenological extension of the standard $\\Lambda$CDM framework, the $\\Omega_1\\Omega_2$-$\\Lambda$CDM model, in which the total energy density of the universe is expanded in powers of $1+z$. This parameterization recovers the standard $\\Lambda$CDM framework and contributes two additional terms, $\\Omega_1(1+z)$ and $\\Omega_2(1+z)^2$, in the dark energy sector, alongside the cosmological constant, leading to a physically interpretable and observationally testable dynamics of effective dark energy. Using Planck cosmic microwave background (CMB) data, we find that the model allows increased freedom in the late-time expansion history while preserving the standard early-universe physics. When DESI baryon acoustic oscillation (BAO) data are included in the analysis, the inferred Hubble constant is $H_0 = 69.74 \\pm 0.77~\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$ (68\\% CL), which is consistent with recent Tip of the Red Giant Branch (TRGB) measurements from the Carnegie--Chicago Hubble Program (CCHP). The reconstructed dark energy equation of state exhibits a smooth transition across the phantom divide followed by asymptotic de Sitter behavior, leading to modified late-time dynamics of universe while maintaining standard early-time cosmology. Overall, our results demonstrate that controlled late-time deviations from $\\Lambda$CDM can improve cosmological concordance.",
      "pdf_url": "https://arxiv.org/pdf/2512.19000.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22356",
      "title": "Clustering Confuses Spectro-photometry: An Investigation of 2D and 3D Forced Profile Matching for Stacking Line-intensity Mapping Data on Source Catalogues",
      "authors": [
        "Ella M. Mansfield",
        "Delaney A. Dunne",
        "Dongwoo T. Chung"
      ],
      "abstract": "Clustering Confuses Spectro-photometry: An Investigation of 2D and 3D Forced Profile Matching for Stacking Line-intensity Mapping Data on Source Catalogues Ella M. Mansfield, Delaney A. Dunne, Dongwoo T. Chung 13 pages, 8 figures, 3 tables, To be submitted to ApJ, Comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Line-intensity mapping (LIM) is an emerging observational technique that is used to observe the universe on large scales at low resolution through spectral line emission. Stacking analyses coadd cutouts of LIM data on positions of known signal emitters, robustly detecting signal otherwise hidden in a noisy map. In this article, we present two augmentations of a stacking pipeline, both aiming to refine the sensitivity of the stack by assuming a specific observed signal shape in 2D spatial axes or 3D spatial and spectral axes, as well as stacking on source coordinates more precise than the resolution of the LIM data cube. We test these methods on a series of simplistic and complex simulations mimicking observations with the CO Mapping Array Project (COMAP) Pathfinder. We find that these fitting methods provide up to a 25% advantage in detection significance over the original stack method in realistic COMAP-like simulations. We also find that the optimal fitting profile, given our CO line model and galaxy model, is larger than the 5' width of the COMAP beam and takes on a Lorentzian shape in the spectral dimension. Our findings suggest a nuanced dependence of the optimal profile size and shape on the LIM signal itself, including redshift-space clustering and fingers-of-God effects that depend on the tracer luminosity function and bias.",
      "pdf_url": "https://arxiv.org/pdf/2512.22356.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22683",
      "title": "A Generative Reconstruction of Low-$\\ell$ CMB B-Mode Signal using Reverse Diffusion in Deep Learning",
      "authors": [
        "Anumanchi Agastya Sai Ram Likhit",
        "Rajib Saha"
      ],
      "abstract": "A Generative Reconstruction of Low-$\\ell$ CMB B-Mode Signal using Reverse Diffusion in Deep Learning Anumanchi Agastya Sai Ram Likhit, Rajib Saha Cosmology and Nongalactic Astrophysics (astro-ph.CO) Detecting primordial B-mode polarization of the Cosmic Microwave Background (CMB) provides a direct probe of inflationary gravitational waves. However, the signal is extremely faint and contaminated by gravitational lensing, instrumental noise, and astrophysical foregrounds. Here we present a score-based diffusion approach, formulated using variance-exploding stochastic differential equations (VE-SDEs), to reconstruct the primordial B-mode angular power spectrum from contaminated observations. The method employs a reverse SDE guided by a score model trained exclusively on random realizations of the primordial low $\\ell$ B-mode angular power spectrum corresponding to a fixed tensor-to-scalar ratio $r=0.001$. During inference, the reverse SDE iteratively drives the observed angular power spectrum toward the learned primordial manifold, effectively denoising and delensing the input. The model is tested on simulated observational spectra that include gravitational lensing, complex polarized foreground combinations, and instrumental noise characteristics representative of the proposed ECHO mission. The trained score model learns the underlying statistical distribution of the primordial B-mode field for the given $r$, which acts as a physics-guided prior that can generate new, consistent realizations of the signal. This approach provides a robust framework for primordial signal recovery in future CMB polarization missions.",
      "pdf_url": "https://arxiv.org/pdf/2512.22683.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.22964",
      "title": "A new path to constrain the expansion history of the Universe in future spectroscopic galaxy surveys",
      "authors": [
        "Elena Tomasetti",
        "Michele Moresco",
        "Nicola Borghi",
        "Dinko Milaković",
        "Stephanie Escoffier",
        "Margherita Talia",
        "Lucia Pozzetti",
        "Andrea Cimatti",
        "Lauro Moscardini"
      ],
      "abstract": "A new path to constrain the expansion history of the Universe in future spectroscopic galaxy surveys Elena Tomasetti, Michele Moresco, Nicola Borghi, Dinko Milaković, Stephanie Escoffier, Margherita Talia, Lucia Pozzetti, Andrea Cimatti, Lauro Moscardini White Paper submitted to \"ESO Expanding Horizons: Transforming Astronomy in the 2040s\" Cosmology and Nongalactic Astrophysics (astro-ph.CO) The current tension between early- and late-Universe measurements of the Hubble constant ($H_0$), along with the still elusive nature of dark matter and dark energy, calls for model-independent probes of the Universe's expansion history. The cosmic chronometers (CC) method offers a unique opportunity to directly measure the Hubble parameter $H(z)$ without relying on any cosmological model assumptions or integrated distance measurements. Despite its potential, this technique remains statistics-limited: no current survey is optimized to detect large samples of CC, restricting the precision on $H(z)$ to $\\sim$20% at intermediate redshifts. Here, we investigate the opportunities that a next-generation spectroscopic facility could offer to CC studies, providing an estimate of the accuracy achievable on the reconstruction of the Hubble parameter in redshift. We demonstrate that with such a facility, it will be possible to derive constraints on key cosmological parameters, assessing the impact that such improvements would have on our understanding of the expansion history of the Universe and on current cosmological tensions.",
      "pdf_url": "https://arxiv.org/pdf/2512.22964.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23423",
      "title": "Three channel dissipative warm Higgs inflation with global inference via genetic algorithms",
      "authors": [
        "Wei Cheng"
      ],
      "abstract": "Three channel dissipative warm Higgs inflation with global inference via genetic algorithms Wei Cheng Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) This paper constructs and analyzes a three channel dissipative framework for Warm Higgs Inflation, wherein the total dissipation coefficient, $\\Upsilon(h,T)$, is decomposed into low temperature, high temperature, and threshold activated contributions. A genetic algorithm is employed for the global numerical solution and statistical inference of the background field dynamics. To overcome the single channel dominance degeneracy in high dimensional parameter scans, two classes of structural priors are introduced into the objective function: a \\texttt{mixing} prior to suppress extreme channel fractions and an \\texttt{entropy} prior to favor multi channel coexistence. Furthermore, the adoption of a layered warmness criterion (e.g., $Q \\equiv \\Upsilon/3H$) decouples model selection from cosmological observables, thereby enhancing analytical transparency. The complete workflow is demonstrated on a $14$ dimensional phenomenological model. An ablation study of the priors (\\texttt{noprior} vs. \\texttt{mixing} vs. \\texttt{mixing+entropy}) yields $18871$ viable parameter points, revealing that the priors significantly enhance the discovery probability of non-trivial multi channel solutions within a parameter space naturally biased towards single channel dominance. After imposing the observational constraint $r < 0.036$, the number of retained solutions for each scenario is $14485$, $1889$, and $1971$, respectively. A typical best fit solution exhibits a \"channel relay\" dynamical feature during its evolution and a genuinely mixed state at the pivot scale (e.g., $f_{{\\rm HT},*}\\simeq 0.399480$, $f_{{\\rm th},*}\\simeq 0.600517$), implying that the microscopic origin of dissipation need not be unique within a single inflationary history.",
      "pdf_url": "https://arxiv.org/pdf/2512.23423.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22268",
      "title": "Quenching pathways in the green valley at low redshift: confronting SDSS AGN hosts with IllustrisTNG and EAGLE",
      "authors": [
        "Gaurav Gawade"
      ],
      "abstract": "Quenching pathways in the green valley at low redshift: confronting SDSS AGN hosts with IllustrisTNG and EAGLE Gaurav Gawade 12 pages, 12 figures. Reproducibility notebook on Zenodo (DOI: https://doi.org/10.5281/zenodo.17917468) Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We compare low-redshift ($z<0.1$) BPT-selected pure optical AGN hosts in SDSS DR7 to colour-selected \"green-valley\" analogue central galaxies in IllustrisTNG100 and EAGLE Ref-L0100N1504. To reduce cross-dataset systematics, we define the green valley internally using $(g-r)$ percentiles: for galaxies with $\\log_{10}(M_\\star/M_\\odot)>10$, we select the 75th-95th percentiles (SDSS observed-frame fibre colours; simulations rest-frame synthetic colours within 30 kpc). SDSS hosts are linked to the MPA-JHU catalogue for stellar masses and aperture-corrected total SFRs. TNG green-valley centrals are almost entirely quenched, with a sharp pile-up at the imposed SFR floor and median $\\log_{10}\\mathrm{sSFR}\\simeq-14.85$ ($\\sim$3.5 dex below SDSS). EAGLE instead produces a broad, continuous distribution with median $\\log_{10}\\mathrm{sSFR}\\simeq-11.71$ and substantial overlap with SDSS, robust to varying the lower percentile between 60 and 90. At fixed mass, TNG yields higher green-valley occupancy fractions (reaching $\\gtrsim60$ per cent near $M_\\star\\sim10^{11}M_\\odot$) than EAGLE (20-40 per cent). A simple forward model of nebular line ratios places EAGLE analogues across the star-forming and composite loci in the BPT plane, while TNG analogues concentrate in a LINER-like, low-sSFR regime. We infer that TNG's kinetic mode drives an efficient, near-binary shutdown of star formation, whereas EAGLE's stochastic thermal feedback supports a slower decline more consistent with local AGN hosts. All catalogues and analysis scripts are publicly released.",
      "pdf_url": "https://arxiv.org/pdf/2512.22268.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22727",
      "title": "Heavy dark matter in rapidly evolving massive stars",
      "authors": [
        "Sandra Robles",
        "Walter Tangarife",
        "Giorgio Busoni"
      ],
      "abstract": "Heavy dark matter in rapidly evolving massive stars Sandra Robles, Walter Tangarife, Giorgio Busoni Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) We study the impact of heavy dark matter (DM) captured in massive stars via scattering(s) with the star constituents. We focus on the first stars and use stellar evolution simulations to track down how DM capture evolves over time from the zero-age main sequence to the late metal-rich stages of stellar evolution. During the early hydrogen-helium-dominated phase, the capture process is well described by scattering with two targets. As a star evolves, metal production leads to the formation of a dense core surrounded by a lighter envelope. The core significantly enhances the capture of ultra-heavy DM; in this case, three distinct nuclear species are required to accurately describe multiple-scattering capture. We use the Eddington inversion method to obtain a realistic DM velocity distribution, better suited when the star is near the center of a halo, than the widely used Maxwell-Boltzmann distribution. We find that heavy DM would be able to thermalize and achieve capture-annihilation equilibrium within a massive star's lifetime for regions of the parameter space not excluded by direct detection. For non-annihilating DM, because of the high amount of targets available for capture and despite massive stars being short-lived, it would even be possible for DM to achieve self-gravitation and collapse to a black hole, which eventually could swallow the star from within before the expected end of the star's life, for non-excluded regions of the parameter space. Our results highlight the dependence of DM capture on the stellar evolutionary stage, composition, and halo location, demonstrating that accurate modeling of massive stars is essential for constraining heavy DM with primordial stellar populations.",
      "pdf_url": "https://arxiv.org/pdf/2512.22727.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23008",
      "title": "An Empirical Law to Reproduce the Galaxy Rotation Curves",
      "authors": [
        "Kento Kamada"
      ],
      "abstract": "An Empirical Law to Reproduce the Galaxy Rotation Curves Kento Kamada Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Profiles of galaxy's rotation velocity (rotation curves) remain unexpectedly flat at large distances, where visible matter alone should make the rotation speed decrease with radius. The usual explanation requires large amounts of unseen dark matter. Here, we introduce an empirical law in which spacetime itself appears to store additional energy when distorted by baryonic matter. The baryonic potential $\\Phi_b$ made by the baryonic energy density $\\rho_b$ generates an additional energy density $\\rho_s = \\mu_s \\Phi_b^2 / c^4$, leading to a Poisson equation for the total potential $\\Phi_{\\rm tot}$, \\[ \\nabla^2\\Phi_{\\rm tot} = 4\\pi G\\,\\rho_b /c^2 + 4\\pi G\\,\\mu_s\\,\\Phi_b^2 / c^6. \\] When assuming $\\mu_s = K M_b^{-3/2}$ with a parameter $K$, we applied this equation to 91 galaxies from the SPARC database. The model reproduced quite well both the inner rise and outer flat regions of the observed rotation curves using the observed baryonic mass profiles only. The $K$ values for the 91 galaxies were found to be concentrated within a narrow range. These results suggest that dark matter is directly connected to the baryonic gravitational potential. A theoretical interpretation of the empirical law is also discussed, in which a relation between the additional energy and the cosmological constant is implied.",
      "pdf_url": "https://arxiv.org/pdf/2512.23008.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23039",
      "title": "Dark matter direct detection: status, results and future plans",
      "authors": [
        "Laura Baudis"
      ],
      "abstract": "Dark matter direct detection: status, results and future plans Laura Baudis 10 pages, 4 figures; published in the Proceedings of the 11th Symposium on Large TPCs for low-energy rare event detection, December 2023. Updated figure 4 J. Phys.: Conf. Ser. 3162 012007, 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Experiment (hep-ex) Direct dark matter detection experiments search for rare signals induced by hypothetical, galactic dark matter particles in low-background detectors operated deep underground. I will briefly review the direct detection principles, the expected signals and backgrounds, and the main experimental techniques. I will then discuss the status of ongoing experiments aiming to discover new particles in the keV - TeV mass range, as well as future detectors and their sensitivity.",
      "pdf_url": "https://arxiv.org/pdf/2512.23039.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "hep-ex"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2403.02171",
      "title": "Predicting large scale cosmological structure evolution with generative adversarial network-based autoencoders",
      "authors": [
        "Marion Ullmo",
        "Nabila Aghanim",
        "Aurélien Decelle",
        "Miguel Aragon-Calvo"
      ],
      "abstract": "Predicting large scale cosmological structure evolution with generative adversarial network-based autoencoders Marion Ullmo, Nabila Aghanim, Aurélien Decelle, Miguel Aragon-Calvo Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG) Predicting the nonlinear evolution of cosmic structure from initial conditions is typically approached using Lagrangian, particle-based methods. These techniques excel in terms of tracking individual trajectories, but they might not be suitable for applications where point-based information is unavailable or impractical. In this work, we explore an alternative, field-based approach using Eulerian inputs. Specifically, we developed an autoencoder architecture based on a generative adversarial network (GAN) and trained it to evolve density fields drawn from dark matter N-body simulations. We tested this method on both 2D and 3D data. We find that while predictions on 2D density maps perform well based on density alone, accurate 3D predictions require the inclusion of associated velocity fields. Our results demonstrate the potential of field-based representations to model cosmic structure evolution, offering a complementary path to Lagrangian methods in contexts where field-level data is more accessible.",
      "pdf_url": "https://arxiv.org/pdf/2403.02171.pdf",
      "categories": [
        "astro-ph.CO",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.02141",
      "title": "Nonminimal infrared gravitational reheating in light of ACT observation",
      "authors": [
        "Ayan Chakraborty",
        "Debaprasad Maity",
        "Rajesh Mondal"
      ],
      "abstract": "Nonminimal infrared gravitational reheating in light of ACT observation Ayan Chakraborty, Debaprasad Maity, Rajesh Mondal 32 pages + appendices, 9 figures, 1 table Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Inflation is known to produce large infrared scalar fluctuations. Further, if a scalar field $(\\chi)$ is non-minimally coupled with gravity through $\\xi \\chi^2 R$, those infrared modes experience \\textit{tachyonic instability} during and after inflation. Those large non-perturbative infrared modes can collectively produce hot Big Bang universe upon their horizon entry during the post-inflationary period. We indeed find that for reheating equation of state (EoS), $w_{\\phi} > 1/3$, and coupling strength, $\\xi>1/6$, large infrared fluctuations lead to successful reheating. We further analyze perturbative reheating by solving the standard Boltzmann equation in both Jordan and Einstein frames, and compare the results with the non-perturbative ones. Finally, embedding this infrared reheating scenario into the well-known $\\alpha-$attractor inflationary model, we examine possible constraints on the model parameters in light of the latest ACT, DESI results. To arrive at the constraints, we take into account the latest bounds on tensor-to-scalar ratio, $r_{0.05}\\leq 0.038$, isocurvature power spectrum, $\\mathcal{P}_{\\mathcal{S}} \\lesssim 8.3\\times 10^{-11}$, and effective number of relativistic degrees of freedom, $\\Delta N_{\\rm eff} \\lesssim 0.17 $. Subject to these constraints, we find successful reheating to occur only for EoS $w_{\\phi}\\gtrsim 0.6$, which translates to a sub-class of $\\alpha-$attractor models being favored and placing them within the 2$\\sigma$ region in the $ n_s-r$ plane of the latest ACT, DESI data. In this range of EoS, we find that the coupling strength should lie within $2.11\\lesssim\\xi\\lesssim 2.95$ for $w_{\\phi}=0.6$. Finally, we compute secondary gravitational wave signals induced by the scalar infrared modes, which are found to be strong enough to be detected by future GW observatories, namely BBO, DECIGO, LISA, and ET.",
      "pdf_url": "https://arxiv.org/pdf/2506.02141.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.21852",
      "title": "The Lyman-$α$ Forest from LBGs: First 3D Correlation Measurement with DESI and Prospects for Cosmology",
      "authors": [
        "Hiram K. Herrera-Alcantar",
        "Eric Armengaud",
        "Christophe Yèche",
        "Calum Gordon",
        "Laura Casas",
        "Andreu Font-Ribera",
        "Christophe Magneville",
        "Corentin Ravoux",
        "J. Aguilar",
        "S. Ahlen",
        "A. Anand",
        "D. Brooks",
        "E. Chaussidon",
        "T. Claybaugh",
        "A. Cuceu",
        "K. S. Dawson",
        "A. de la Macorra",
        "Arjun Dey",
        "P. Doel",
        "S. Ferraro",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "S. Gontcho A Gontcho",
        "A. X. Gonzalez-Morales",
        "G. Gutierrez",
        "J. Guy",
        "C. Hahn",
        "D. Kirkby",
        "A. Kremin",
        "O. Lahav",
        "A. Lambert",
        "M. Landriau",
        "L. Le Guillou",
        "M. Manera",
        "P. Martini",
        "A. Meisner",
        "R. Miquel",
        "A. Muñoz-Gutiérrez",
        "S. Nadathur",
        "N. Palanque-Delabrouille",
        "W. J. Percival",
        "F. Prada",
        "I. Pérez-Ràfols",
        "G. Rossi",
        "E. Sanchez",
        "D. Schlegel",
        "M. Schubnell",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarlé",
        "B. A. Weaver",
        "R. Zhou",
        "H. Zou"
      ],
      "abstract": "The Lyman-$α$ Forest from LBGs: First 3D Correlation Measurement with DESI and Prospects for Cosmology Hiram K. Herrera-Alcantar, Eric Armengaud, Christophe Yèche, Calum Gordon, Laura Casas, Andreu Font-Ribera, Christophe Magneville, Corentin Ravoux, J. Aguilar, S. Ahlen, A. Anand, D. Brooks, E. Chaussidon, T. Claybaugh, A. Cuceu, K. S. Dawson, A. de la Macorra, Arjun Dey, P. Doel, S. Ferraro, J. E. Forero-Romero, E. Gaztañaga, S. Gontcho A Gontcho, A. X. Gonzalez-Morales, G. Gutierrez, J. Guy, C. Hahn, D. Kirkby, A. Kremin, O. Lahav, A. Lambert, M. Landriau, L. Le Guillou, M. Manera, P. Martini, A. Meisner, R. Miquel, A. Muñoz-Gutiérrez, S. Nadathur, N. Palanque-Delabrouille, W. J. Percival, F. Prada, I. Pérez-Ràfols, G. Rossi, E. Sanchez, D. Schlegel, M. Schubnell, J. Silber, D. Sprayberry, G. Tarlé, B. A. Weaver, R. Zhou, H. Zou Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Lyman-$\\alpha$ (Ly$\\alpha$) forest is a key tracer of large-scale structure at redshifts z > 2, traditionally studied using spectra of quasars. Here, we explore the viability Lyman Break Galaxies (LBGs) as alternative background sources for Ly$\\alpha$ forest studies. We analyze 4,151 Ly$\\alpha$ forest skewers extracted from LBG spectra obtained in the DESI pilot surveys in the COSMOS and XMM-LSS fields. We present the first measurement of the Ly$\\alpha$ forest auto-correlation function derived exclusively from LBG spectra, probing comoving separations up to 48 $h^{-1}$Mpc at an effective redshift of $z_\\mathrm{eff}$ = 2.70. The measured signal is consistent with that from DESI DR2 quasar Ly$\\alpha$ forest spectra at a comparable redshift, validating LBGs as reliable background sources. We also measure the cross-correlation between the LBG Ly$\\alpha$ forest and 13,362 galaxy positions, showing that this observable serves as a sensitive diagnostic for galaxy redshift uncertainties and systematic offsets. Finally, using synthetic LBG spectra and Fisher forecasts, we show that a future wide-area survey over 5000 deg$^2$, targeting 1000 LBGs per deg$^2$ at similar signal-to-noise than our dataset, could enable Ly$\\alpha$ forest baryon acoustic oscillation (BAO) measurements with 0.4% precision on the isotropic BAO scale and 1.3% on the anisotropic (Alcock-Paczynski) scale. Combining BAO with a Ly$\\alpha$ forest full-shape analysis improves the AP constraint to 0.6%. These results open a new path for precision cosmology at high redshift using dense LBG samples.",
      "pdf_url": "https://arxiv.org/pdf/2507.21852.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.25419",
      "title": "A Unified Photometric Redshift Calibration for Weak Lensing Surveys using the Dark Energy Spectroscopic Instrument",
      "authors": [
        "Johannes U. Lange",
        "Diana Blanco",
        "Alexie Leauthaud",
        "Angus Wright",
        "Abigail Fisher",
        "Joshua Ratajczak",
        "Jessica Nicole Aguilar",
        "Steven Ahlen",
        "Stephen Bailey",
        "Davide Bianchi",
        "Chris Blake",
        "David Brooks",
        "Todd Claybaugh",
        "Andrei Cuceu",
        "Kyle Dawson",
        "Axel de la Macorra",
        "Joseph DeRose",
        "Arjun Dey",
        "Peter Doel",
        "Ni Putu Audita Placida Emas",
        "Simone Ferraro",
        "Andreu Font-Ribera",
        "Jaime E. Forero-Romero",
        "Cristhian Garcia-Quintero",
        "Enrique Gaztañaga",
        "Satya Gontcho A Gontcho",
        "Gaston Gutierrez",
        "Sven Heydenreich",
        "Hendrik Hildebrandt",
        "Mustapha Ishak",
        "Jorge Jimenez",
        "Shahab Joudaki",
        "Robert Kehoe",
        "David Kirkby",
        "Theodore Kisner",
        "Anthony Kremin",
        "Ofer Lahav",
        "Claire Lamman",
        "Martin Landriau",
        "Laurent Le Guillou",
        "Michael Levi",
        "Leonel Medina Varela",
        "Aaron Meisner",
        "Ramon Miquel",
        "John Moustakas",
        "Seshadri Nadathur",
        "Jeffrey A. Newman",
        "Nathalie Palanque-Delabrouille",
        "Anna Porredon",
        "Francisco Prada",
        "Ignasi Pérez-Ràfols",
        "Graziano Rossi",
        "Rossana Ruggeri",
        "Eusebio Sanchez",
        "Christoph Saulder",
        "David Schlegel",
        "Michael Schubnell",
        "David Sprayberry",
        "Zechang Sun",
        "Gregory Tarlé",
        "Benjamin Alan Weaver",
        "Sihan Yuan",
        "Pauline Zarrouk",
        "Hu Zou"
      ],
      "abstract": "A Unified Photometric Redshift Calibration for Weak Lensing Surveys using the Dark Energy Spectroscopic Instrument Johannes U. Lange, Diana Blanco, Alexie Leauthaud, Angus Wright, Abigail Fisher, Joshua Ratajczak, Jessica Nicole Aguilar, Steven Ahlen, Stephen Bailey, Davide Bianchi, Chris Blake, David Brooks, Todd Claybaugh, Andrei Cuceu, Kyle Dawson, Axel de la Macorra, Joseph DeRose, Arjun Dey, Peter Doel, Ni Putu Audita Placida Emas, Simone Ferraro, Andreu Font-Ribera, Jaime E. Forero-Romero, Cristhian Garcia-Quintero, Enrique Gaztañaga, Satya Gontcho A Gontcho, Gaston Gutierrez, Sven Heydenreich, Hendrik Hildebrandt, Mustapha Ishak, Jorge Jimenez, Shahab Joudaki, Robert Kehoe, David Kirkby, Theodore Kisner, Anthony Kremin, Ofer Lahav, Claire Lamman, Martin Landriau, Laurent Le Guillou, Michael Levi, Leonel Medina Varela, Aaron Meisner, Ramon Miquel, John Moustakas, Seshadri Nadathur, Jeffrey A. Newman, Nathalie Palanque-Delabrouille, Anna Porredon, Francisco Prada, Ignasi Pérez-Ràfols, Graziano Rossi, Rossana Ruggeri, Eusebio Sanchez, Christoph Saulder, David Schlegel, Michael Schubnell, David Sprayberry, Zechang Sun, Gregory Tarlé, Benjamin Alan Weaver, Sihan Yuan, Pauline Zarrouk, Hu Zou 23 pages, 9 figures, accepted for publication in ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) The effective redshift distribution $n(z)$ of galaxies is a critical component in the study of weak gravitational lensing. Here, we introduce a new method for determining $n(z)$ for weak lensing surveys based on high-quality redshifts and neural network-based importance weights. Additionally, we present the first unified photometric redshift calibration of the three leading stage-III weak lensing surveys, the Dark Energy Survey (DES), the Hyper Suprime-Cam (HSC) survey and the Kilo-Degree Survey (KiDS), with state-of-the-art spectroscopic data from the Dark Energy Spectroscopic Instrument (DESI). We verify our method using a new, data-driven approach and obtain $n(z)$ constraints with statistical uncertainties of order $\\sigma_{\\bar z} \\sim 0.01$ and smaller. Our analysis is largely independent of previous photometric redshift calibrations and, thus, provides an important cross-check in light of recent cosmological tensions. Overall, we find excellent agreement with previously published results on the DES Y3 and HSC Y1 data sets while there are some differences on the mean redshift with respect to the previously published KiDS-1000 results. We attribute the latter to mismatches in photometric noise properties in the COSMOS field compared to the wider KiDS SOM-gold catalog. At the same time, the new $n(z)$ estimates for KiDS do not significantly change estimates of cosmic structure growth from cosmic shear. Finally, we discuss how our method can be applied to future weak lensing calibrations with DESI data.",
      "pdf_url": "https://arxiv.org/pdf/2510.25419.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10317",
      "title": "A Dynamical Scalar Field Model for Dark Energy: Addressing the Hubble Tension and Cosmic Evolution",
      "authors": [
        "Arpit Kottur",
        "Jui Mahajan",
        "Raka Dabhade"
      ],
      "abstract": "A Dynamical Scalar Field Model for Dark Energy: Addressing the Hubble Tension and Cosmic Evolution Arpit Kottur, Jui Mahajan, Raka Dabhade Cosmology and Nongalactic Astrophysics (astro-ph.CO) We propose a dynamical dark energy model based on a canonical scalar field with a hybrid potential of the form $V(\\phi) = V_{0}e^{-\\lambda\\phi} + V_{1}\\phi^{n}$. We constrain the model's 11-dimensional parameter space using a comprehensive combination of cosmological data, including the Planck 2018 Cosmic Microwave Background (CMB) power spectra, Baryon Acoustic Oscillations (BAO), the Pantheon+ supernova sample, SH0ES and the matter power spectrum from SDSS. The model provides an excellent fit to the data, with a reduced chi-squared of $\\chi^2_{\\text{red}} = 0.989$, while successfully alleviating the Hubble constant tension. Our analysis yields a Hubble constant of $H_0 \\approx 72.820$ km/s/Mpc, reducing the discrepancy between early and late-universe measurements. We find that the data favors a 'thawing' quintessence scenario, characterized by a potential slope parameter $\\lambda \\approx 0.056$. This small but non-zero slope drives a late-time deviation from $\\Lambda$CDM ($w(z=0) \\approx -0.85$) while preserving the standard expansion history at high redshifts. A model comparison using the Bayesian Information Criterion finds that the standard $\\Lambda$CDM model is still slightly preferred ($\\Delta\\text{BIC} = 2.178$) due to its fewer parameters. Nevertheless, our results demonstrate that this hybrid potential model is a compelling, physically motivated alternative to a cosmological constant.",
      "pdf_url": "https://arxiv.org/pdf/2511.10317.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.19607",
      "title": "Connecting clustering and the cosmic web:Observational constraints on secondary halo bias",
      "authors": [
        "Facundo Rodriguez",
        "Antonio D. Montero-Dorta"
      ],
      "abstract": "Connecting clustering and the cosmic web:Observational constraints on secondary halo bias Facundo Rodriguez, Antonio D. Montero-Dorta 12 pages, 10 figures. Submitted to A&A, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) Cosmological simulations predict significant secondary dependencies of halo clustering on internal properties and environment. Detecting these subtle signals in observational data remains challenging, with important ramifications for galaxy evolution and cosmology. We probe secondary halo bias in observational survey data, using galaxy groups as dark matter halo proxies. We quantify secondary bias using central galaxy colour and environmental diagnostics. We use an extended, refined galaxy group catalogue from the Sloan Digital Sky Survey. Secondary bias is defined as any deviation in group clustering strength at fixed mass, quantified through the projected two-point correlation function. Our environmental analysis uses DisPerSE to compute distances to critical points of the density field, incorporating local group overdensity measurements on multiple scales. We robustly detect several forms of secondary bias in the clustering of galaxy groups. At fixed mass, groups hosting red central galaxies are more strongly clustered than those with blue centrals, with $b_{\\rm relative}$ ranging from $\\sim 1.2$ for the 15\\% reddest centrals to $\\sim 0.8$ for the bluest ones. Environmental dependencies based on cosmic-web distances are also present, though significantly weaker and largely mass-independent. The strongest signal arises from local overdensity: groups in the densest 15\\% of environments reach $b_{\\rm relative} \\sim 1.4$, while those in the least dense regions fall to $b_{\\rm relative} \\sim 0.7$. These results establish a clear observational hierarchy for secondary halo bias. The colour of central galaxies correlates with the local group overdensity, which, in turn, correlates with the bias at fixed group mass. Assuming that central galaxy colour traces halo assembly history, this three-stage picture offers a conceptual link between our results and halo assembly bias.",
      "pdf_url": "https://arxiv.org/pdf/2511.19607.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.20188",
      "title": "The Evolving Baryonic Tully Fisher Relation: A Universal Law from Galaxies to Galactic Clusters",
      "authors": [
        "Stuart Marongwe",
        "Stuart Kauffman"
      ],
      "abstract": "The Evolving Baryonic Tully Fisher Relation: A Universal Law from Galaxies to Galactic Clusters Stuart Marongwe, Stuart Kauffman Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The Baryonic Tully-Fisher relation (BTFR) links the baryonic mass of galaxies to their characteristic rotational velocity and has been shown to hold with remarkable precision across a wide mass range. Recent studies, however, indicate that galaxy clusters occupy a parallel but offset relation, raising questions about the universality of the BTFR. Here, we demonstrate that the offset between galaxies and clusters arises naturally from cosmic time evolution. Using the evolving BTFR derived from the Nexus Paradigm of quantum gravity, we show that the normalization of the relation evolves as an exponential function of cosmic time., while the slope remains fixed at $\\sim 4$. This provides a simple and predictive framework in which both galaxies and clusters obey the same universal scaling law, with their apparent offset reflecting their different formation epochs. Our results unify mass-velocity scaling across five orders of magnitude in baryonic mass, offering new insights into cosmic structure formation.",
      "pdf_url": "https://arxiv.org/pdf/2511.20188.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08506",
      "title": "Search for a photon peak from keV-scale dark matter annihilation with NuSTAR: Constraints on $\\langle σv \\rangle$ after 11 years of observations",
      "authors": [
        "E. I. Zakharov",
        "V. V. Barinov",
        "D. S. Gorbunov",
        "R. A. Krivonos",
        "A. A. Mukhin"
      ],
      "abstract": "Search for a photon peak from keV-scale dark matter annihilation with NuSTAR: Constraints on $\\langle σv \\rangle$ after 11 years of observations E. I. Zakharov, V. V. Barinov, D. S. Gorbunov, R. A. Krivonos, A. A. Mukhin 7 pages, 8 figures; Published in Physical Review D Phys. Rev. D 112 (2025), 103037 High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We report new constraints on the velocity-independent annihilation cross section $\\langle \\sigma v \\rangle$ of keV-scale dark matter particles based on 11 years of observations with the NuSTAR X-ray telescope. Using the unfocused stray light mode of the instrument, which provides a wide field-of-view and a stable instrumental background, we perform a sensitive search for photon signatures from dark matter annihilation in the Galactic halo. We model the resulting diffuse X-ray spectrum over the 3-20 keV energy range and search for line-like spectral features that may arise from the annihilation of dark matter particles into photons. No statistically significant excess over the expected astrophysical background is found. We therefore place upper limits on $\\langle \\sigma v \\rangle$ as a function of dark matter mass, assuming a velocity-independent s-wave annihilation and several Galactic dark matter profiles. Across most of the explored mass range our results provide the strongest X-ray constraints to date, reaching the level of $\\langle\\sigma v\\rangle \\lesssim 10^{-33}$ -- $10^{-34}$ cm$^3$ s$^{-1}$, and they are complementary to the most recent bounds derived from SRG/ART-XC observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.08506.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12616",
      "title": "A Search for Hard X-ray/Soft $γ$-ray Emission from SPT-CL J2012-5649 (Abell 3667) Using INTEGRAL/ISGRI",
      "authors": [
        "Siddhant Manna",
        "Shantanu Desai",
        "Roman A. Krivonos"
      ],
      "abstract": "A Search for Hard X-ray/Soft $γ$-ray Emission from SPT-CL J2012-5649 (Abell 3667) Using INTEGRAL/ISGRI Siddhant Manna, Shantanu Desai, Roman A. Krivonos High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a search for hard X-ray/soft $\\gamma$-ray emission from the merging galaxy cluster SPT-CL J2012-5649 (Abell~3667) using archival INTEGRAL/ISGRI observations. This cluster located at $z=0.0556$ hosts prominent radio relics associated with merger-driven shocks, suggesting the presence of relativistic electrons capable of producing inverse-Compton (IC) emission in the hard X-ray to soft $\\gamma$-ray regime. We searched for emission in the 30--300~keV energy range using the INTEGRAL Off-line scientific analysis software with a total effective exposure of 2817 s. No significant emission was detected at the cluster position in the aforementioned energy interval. The extracted ISGRI spectrum is consistent with pure background, and no physically meaningful model parameters can be constrained. From the mosaic variance maps, we derive a conservative $3\\sigma$ upper limit of $F_{30-100\\,\\mathrm{keV}} < 4.4 \\times 10^{-10}\\,\\mathrm{erg\\,cm^{-2}\\,s^{-1}}$. This limit rules out bright IC scenarios and constrains the efficiency of merger-driven particle acceleration in SPT-CL J2012-5649. Our results provide the most stringent soft $\\gamma$-ray constraint on this system to date and highlight the need for next-generation hard X-ray missions, such as HEX-P or eXTP, to probe IC emission at theoretically predicted levels in merging clusters.",
      "pdf_url": "https://arxiv.org/pdf/2512.12616.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17964",
      "title": "A Correlation Between Black Hole Mass and Dark Matter Halo Concentration in Cosmological Simulations",
      "authors": [
        "John K. Nino"
      ],
      "abstract": "A Correlation Between Black Hole Mass and Dark Matter Halo Concentration in Cosmological Simulations John K. Nino 6 pages, 1 figure, 2 tables. v2: Corrected Li et al. (2024) citation. Added sample selection note. Added acknowledgment Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We report the discovery of a positive correlation between supermassive black hole mass and dark matter halo concentration at fixed halo mass in cosmological hydrodynamical simulations. Analyzing central galaxies in TNG100 (N = 18,954), EAGLE (N = 1,522), and CAMELS-TNG (N = 6,664), we find partial correlation coefficients of r = +0.24, +0.34, and +0.66 respectively, all highly significant (p < 10^-10). The correlation is absent in SIMBA (r = +0.01, p = 0.09), which employs a torque-limited black hole accretion model rather than the Bondi-based prescription used by the other simulations. Both TNG and EAGLE exhibit a mass-dependent sign transition: the correlation is negative or null at log(M200/Msun) < 11.5 but strongly positive at higher masses. We interpret this pattern as reflecting the coupling between Bondi accretion rates and central gas density structure: halos with higher concentration have denser cores, enabling more efficient black hole growth at fixed halo mass. The absence of the correlation in torque-limited models supports this interpretation. These results suggest that halo concentration may be a fundamental parameter governing black hole-galaxy coevolution.",
      "pdf_url": "https://arxiv.org/pdf/2512.17964.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22338",
      "title": "Multi-Messenger Predictions for T Coronae Borealis: Probing Particle Acceleration in Novae",
      "authors": [
        "Prantik Sarmah",
        "Sovan Chakraborty",
        "Xilu Wang"
      ],
      "abstract": "Multi-Messenger Predictions for T Coronae Borealis: Probing Particle Acceleration in Novae Prantik Sarmah, Sovan Chakraborty, Xilu Wang High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph) The MAGIC detection of near-TeV gamma-rays from the 2021 outburst of the recurrent nova RS Ophiuchi (RS Oph) has established it as a TeV-scale particle accelerator. However, the underlying production mechanism --\\textit{hadronic} versus \\textit{leptonic}-- remains uncertain due to the non-detection of coincident neutrinos at IceCube. Indeed, the neutrino flux predicted by the hadronic model for RS Oph was below IceCube sensitivity. T Coronae Borealis (T CrB), a nova similar to RS Oph, is anticipated to undergo an outburst soon. Being closer to Earth (0.8 kpc versus 2.45 kpc for RS Oph), T CrB is expected to yield a higher neutrino flux, making the upcoming outburst a once in a lifetime opportunity to test-and potentially detect-nova neutrinos. In this work, we present the first model-based estimates of the hadronic secondary fluxes from T CrB and assess their detectability with gamma-ray (LHAASO, Fermi-LAT, MAGIC, H.E.S.S., MACE, and HERD) and neutrino (IceCube and KM3NeT) telescopes. We adopt two proton-acceleration mechanisms: (i) an external shock (ES) driven mechanism at the interaction ($10^{13}$ cm) of nova ejecta and the red giant wind, and (ii) magnetic reconnection (MR) near the white dwarf surface ($10^{9}$ cm). The latter, arising deep inside the nova system, will fully absorb gamma-rays while allowing only neutrinos to escape. This could potentially produce neutrino signals hours before the ES origin photons or neutrinos-a unique temporal delay signature. For our benchmark ES model, gamma-rays are detectable across all facilities, while the neutrino detection prospect is poor. Only a tiny upper part of the ES model parameter space is above IceCube/KM3NeT sensitivity. In contrast, both observatories have significantly better prospects for detecting neutrinos in the MR scenario.",
      "pdf_url": "https://arxiv.org/pdf/2512.22338.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22875",
      "title": "Hierarchical Test of Lorentz Invariance with Gamma-Ray Burst Spectral-Lag Measurements",
      "authors": [
        "Shen-Shi Du",
        "Yi Gong",
        "Jun-Jie Wei",
        "Zi-Ke Liu",
        "Zhi-Qiang You",
        "Yan-Zhi Meng",
        "Xing-Jiang Zhu"
      ],
      "abstract": "Hierarchical Test of Lorentz Invariance with Gamma-Ray Burst Spectral-Lag Measurements Shen-Shi Du, Yi Gong, Jun-Jie Wei, Zi-Ke Liu, Zhi-Qiang You, Yan-Zhi Meng, Xing-Jiang Zhu 12 pages, 12 figures, 2 tables, accepted for publication in The Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE) Gamma-ray bursts (GRBs) are among the most potent probes of Lorentz invariance violation (LIV), offering direct constraints on the quantum gravity energy scale ($E_{\\rm QG}$) based on observations of energy-dependent time lags. Individual GRBs with well-defined positive-to-negative lag transitions have been used to set lower limits on $E_{\\rm QG}$, but they suffer from uncertainties of spectral-lag measurements and systematics due to theoretical modeling of each burst. Here, we combine observations of 32 GRBs with positive-to-negative lag transitions to derive a statistically robust constraint on $E_{\\rm QG}$ through hierarchical Bayesian inference. We find that the dominant systematic uncertainty in LIV constraints arises from the intrinsic lag modeling. Accounting for this uncertainty with cubic spline interpolation, we derive robust limits of $E_{\\rm QG,1} \\ge 4.37 \\times 10^{16}$~GeV for linear LIV and $E_{\\rm QG,2} \\ge 3.02 \\times 10^{8}$~GeV for quadratic LIV. We find that the probability for LIV, i.e., $E_{\\rm QG,1}$ being below the Planck scale, is estimated to be around 90\\%, which we conclude as no significant evidence for LIV signatures in current GRB spectral lag observations. Our hierarchical approach provides a rigorous statistical framework for future LIV searches and can be extended to incorporate multi-messenger observations.",
      "pdf_url": "https://arxiv.org/pdf/2512.22875.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22978",
      "title": "Pulsed, Polarized X-ray Emission from Neutron Star Surfaces: the Effects of Vacuum Birefringence in the Magnetosphere",
      "authors": [
        "Hoa Dinh Thi",
        "Matthew G. Baring",
        "Kun Hu",
        "Alice K. Harding",
        "Rachael E. Stewart",
        "George A. Younes",
        "Joseph A. Barchas"
      ],
      "abstract": "Pulsed, Polarized X-ray Emission from Neutron Star Surfaces: the Effects of Vacuum Birefringence in the Magnetosphere Hoa Dinh Thi, Matthew G. Baring, Kun Hu, Alice K. Harding, Rachael E. Stewart, George A. Younes, Joseph A. Barchas 27 pages, 10 figures, accepted for publication in The Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE) Intense magnetic fields in the atmospheres of neutron stars render non-trivial angular dependence of intensity and polarization of soft X-ray emission originating from their surfaces. By tracking the complex electric field vector for each photon during its atmospheric transport and propagation in general relativistic and birefringent magnetospheres, our Monte Carlo simulation, named MAGTHOMSCATT, allows for capturing the complete polarization properties, including the intricate interplay between linearity and circularity. The new inclusion in MAGTHOMSCATT of quantum electrodynamical influences on polarization in the magnetosphere is presented. We simulate the pulsed and polarized X-ray emission from the outer layers of optically thick, fully ionized atmospheres of neutron stars, with a focus on the radiation emitted from extended polar caps of magnetars, which are the most highly magnetized neutron stars. Using the recent intensity pulse profile data for the magnetar 1RXS J11708-4009, we constrain the geometric parameters, namely the angles between the magnetic axis and the observer's viewing direction relative to the spin axis, as well as the sizes of emission regions. The distributions of these parameters and the best-fit configuration are provided. In addition, we discuss the important impacts of vacuum birefringence in the magnetosphere on increasing the linear polarization degree. A comparison with the case of a weakly magnetized neutron star, RX J0822.0-4300, is also discussed. Our simulation still needs further development, particularly to incorporate the vacuum resonance effect. Nevertheless, the formalism presented here can be employed to constrain geometric parameters for various types of neutron stars.",
      "pdf_url": "https://arxiv.org/pdf/2512.22978.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23231",
      "title": "Unveiling Multimessenger Emission from Hidden Cores of Microquasars",
      "authors": [
        "Yu-Jia Wei",
        "Kohta Murase",
        "B. Theodore Zhang"
      ],
      "abstract": "Unveiling Multimessenger Emission from Hidden Cores of Microquasars Yu-Jia Wei, Kohta Murase, B. Theodore Zhang 26 pages, 10 figures, 6 tables; comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) Microquasars are radio-emitting X-ray binaries accompanied by relativistic jets. They are established sources of 100~TeV gamma rays and are considered promising candidates for cosmic-ray acceleration. Motivated by recent detections of $\\sim 100~$TeV photons from Cygnus~X-1 and $\\sim~$PeV photons from Cygnus~X-3 by the Large High Altitude Air Shower Observatory (LHAASO), we employ the Astrophysical Multimessenger Emission Simulator (AMES) to model their multimessenger emission considering compact outflow regions as cosmic-ray accelerators, spanning from radio to ultra-high-energy gamma rays. Our results show that the observed $>$TeV gamma rays can originate from either $p\\gamma$ or $pp$ interactions, depending on the location and physical conditions of the emission region, while also reproducing the lower-energy spectra. The different configurations yield unique, observationally testable predictions. In the $0.1-10$~TeV energy range, where current observations provide only upper limits, they predict either a deep dip, a mild suppression, or a power-law spectrum. Additionally, models involving AU-scale blob regions predict strong variability, while those invoking more extended and static external zones show more stable behavior. We also provide a possible qualitative explanation for the distinct modulation patterns across different energy bands, which relies primarily on changes in the Doppler factor and external $\\gamma\\gamma$ absorption. Finally, our neutrino predictions, which properly account for muon and pion cooling effects, reveal a significantly suppressed flux, indicating that detecting these sources may be more challenging than previously anticipated.",
      "pdf_url": "https://arxiv.org/pdf/2512.23231.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23252",
      "title": "Interpreting the diversity of afterglow emission from radio-detected tidal disruption events with instantaneous and delayed outflows",
      "authors": [
        "Yuri Sato",
        "Mukul Bhattacharya",
        "Jose Carpio",
        "Jewel Capili",
        "Kohta Murase"
      ],
      "abstract": "Interpreting the diversity of afterglow emission from radio-detected tidal disruption events with instantaneous and delayed outflows Yuri Sato, Mukul Bhattacharya, Jose Carpio, Jewel Capili, Kohta Murase High Energy Astrophysical Phenomena (astro-ph.HE) Tidal disruption events (TDEs) occur when a star is gravitationally disrupted by the tidal field of a supermassive black hole during a close encounter. Radio emission has recently been detected in TDEs and is commonly attributed to synchrotron radiation from both wind and jetted outflows. However, several TDEs exhibit bright radio flares at late times, which cannot be easily explained if the wind is launched promptly after the stellar disruption. In this study, we model the radio light curves of TDEs with delayed radio flares using three scenarios: an instantaneous wind, a delayed wind, and a delayed relativistic jet. We show that the instantaneous wind model struggles to reproduce delayed radio flare events, indicating the necessity of an additional delayed outflow component. In contrast, the delayed wind model provides a consistent explanation for the observed radio phenomenology, successfully reproducing events both with and without delayed radio flares. For some delayed radio flare events (e.g., ASASSN-15oi and AT 2019dsg), both the delayed wind and delayed jet models can reproduce the observed radio light curves. The delayed jet model produces x-ray and optical emission that is detectable at typical TDE distances, in contrast to wind-driven scenarios. This highlights how multiwavelength observations offer an effective means of distinguishing among possible outflow mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2512.23252.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23267",
      "title": "SN 2022acko: a low-luminosity SNe IIP with signs of early circumstellar interaction",
      "authors": [
        "Lin Han",
        "Zhang Jujia",
        "Wang Xiaofeng",
        "Hu Maokai",
        "Zha Shuai",
        "Xiang Danfeng",
        "Li Liping",
        "Reguitti Andrea",
        "Zhang Xinghan",
        "Cai Yongzhi",
        "Wang Zhenyu",
        "Zhao Zeyi",
        "Zhai Qian",
        "Huang Fang",
        "Lin Weili",
        "Bai Jinming"
      ],
      "abstract": "SN 2022acko: a low-luminosity SNe IIP with signs of early circumstellar interaction Lin Han, Zhang Jujia, Wang Xiaofeng, Hu Maokai, Zha Shuai, Xiang Danfeng, Li Liping, Reguitti Andrea, Zhang Xinghan, Cai Yongzhi, Wang Zhenyu, Zhao Zeyi, Zhai Qian, Huang Fang, Lin Weili, Bai Jinming High Energy Astrophysical Phenomena (astro-ph.HE) We present optical-ultraviolet photometry and optical spectra for the type II supernova (SN) 2022acko. The spectroscopic observations span phases from $\\sim$ 1.5 to $\\sim$ 60 days after the explosion, while the light curve was observed up to $\\sim$ 300 days. The V-band peak is $-15.5 \\pm 0.3$ mag, suggesting that SN 2022acko is a low-luminosity SN II (LLSN). The overall observed properties of SN 2022acko are consistent with those produced by a lower mass progenitor ($\\rm M_{ZAMS} \\sim $9-10M$_{\\odot}$). The spectra at $t=1.5$d and $t=2.5$d exhibit a broad emission feature peaking near 4600 Å(the ``ledge'' feature), which we interpret as blueshifted He II 4686 Ålines arising from the ionized ejecta. Moreover, a possible flash-ionized (FI) emission line of H$\\alpha$ (FWHM $\\sim 1100\\ \\rm km \\ s^{-1}$) was superposed on the broad emission component of H$\\alpha$ P-Cgyni profile in the $t=1.5$d spectrum. Assuming an ejecta velocity of $\\rm 12000\\ km\\ s^{-1}$, the rapid disappearance of this narrow H$\\alpha$ emission line within two days suggests highly confined CSM within $\\sim \\rm 2\\times10^{14}\\, cm$. Assuming a spherically symmetric CSM, the mass loss rate within this radius is estimated to be $\\rm \\sim 5 \\times 10^{-4} M_{\\odot} \\ year^{-1}$ based on our hybrid light curve model. The early ``ledge'' feature observed in SN 2022acko have also been observed in other SNe II, suggesting that early-phase circumstellar interaction (CSI) is more common than previously thought.",
      "pdf_url": "https://arxiv.org/pdf/2512.23267.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23282",
      "title": "New Constraints on Cosmic-ray boosted Sub-GeV Dark Matter via Light Mediators",
      "authors": [
        "Yang Yu",
        "Guan-Sen Wang",
        "Bo Zhang",
        "Tian-Peng Tang",
        "Bing-Yu Su",
        "Lei Feng"
      ],
      "abstract": "New Constraints on Cosmic-ray boosted Sub-GeV Dark Matter via Light Mediators Yang Yu, Guan-Sen Wang, Bo Zhang, Tian-Peng Tang, Bing-Yu Su, Lei Feng High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) Traditional direct detection experiments lack the sensitivity to probe the sub-GeV dark matter (DM), primarily due to the low energy of the expected nuclear recoils. In this work, we investigate cosmic-ray (CR) upscattering as a mechanism to accelerate DM particles to detectable velocities in underground experiments. By analyzing four models of DM-nucleon interactions -- namely scalar, vector, pseudoscalar, and axial-vector mediators -- we derive constraints on the coupling parameters using data from the LZ, XENON, and Borexino experiments, covering mediator mass from $10^{-6}$ to $1$ GeV. As the mediator mass varies, the shift in dominance between momentum transfer and mediator mass leads to a turnover in the constraints around $10^{-2}$--$10^{-3}~\\mathrm{GeV}$. Our results extend the reach of direct detection into the sub-GeV window and clarify the critical role of momentum dependence in light-mediator scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2512.23282.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23354",
      "title": "Kilonova and progenitor properties of merger-driven gamma-ray bursts",
      "authors": [
        "P. Singh",
        "G. Stratta",
        "A. Rossi",
        "P.T.H. Pang",
        "M. Bulla",
        "F. Ragosta",
        "A. De Rosa",
        "D.A. Kann",
        "F. Cogato"
      ],
      "abstract": "Kilonova and progenitor properties of merger-driven gamma-ray bursts P. Singh, G. Stratta, A. Rossi, P.T.H. Pang, M. Bulla, F. Ragosta, A. De Rosa, D.A. Kann, F. Cogato High Energy Astrophysical Phenomena (astro-ph.HE) Gamma-Ray Burst (GRB) prompt and afterglow emission, as well as a kilonova (KN), are the expected electromagnetic (EM) counterparts of Binary Neutron Star (BNS) and Neutron Star -- Black Hole (NSBH) mergers. We aim to infer the KN ejecta parameters and the progenitor properties by modeling merger-driven GRBs with a claim of KN, good data and robust redshift measurement. We model the afterglow and KN, and perform a Bayesian analysis, within the Nuclear physics and Multi-Messenger Astrophysics (NMMA) framework. The KN emission is modeled with the radiative transfer code POSSIS and for afterglow we use the afterglowpy library. In contrast to previous approaches, our methodology simultaneously models both afterglow and KN. We find that all GRBs in our sample have a KN, but we were unable to confirm or exclude its presence in GRB 150101B. A BNS progenitor is favored for GRB 160821B, GRB 170817A/AT2017gfo, GRB 211211A, and GRB 230307A. For GRB 150101B and GRB 191019A, we obtain a slight preference for NSBH scenario, while a BNS is also viable. For KN emission, we find that the median wind mass $\\langle M_{\\rm wind}\\rangle=0.027^{+0.046}_{-0.019}$ $M_{\\odot}$ is larger than the dynamical $\\langle M_{\\rm dyn}\\rangle = 0.012^{+0.007}_{-0.006}$ $M_{\\odot}$. We find that $M_{\\rm wind}$ and the beaming corrected kinetic energy of the jet can be attributed as $log(M_{\\rm wind})=-20.23+0.38\\,log(E_{0,J})$. We confirm the results of numerical simulation that $\\tilde\\Lambda$ increases with decrease in $\\mathcal{M}_{\\rm \\,Chirp}$. Our work shows that EM modeling can be effective for probing the progenitors, and for the first time presents the progenitor properties of a sizable sample of merger-driven GRBs.",
      "pdf_url": "https://arxiv.org/pdf/2512.23354.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23392",
      "title": "Revisiting the Reported Period of FRB 20201124A Using MCMC Methods",
      "authors": [
        "Jun-Yi Shen",
        "Yuan-Chuan Zou"
      ],
      "abstract": "Revisiting the Reported Period of FRB 20201124A Using MCMC Methods Jun-Yi Shen, Yuan-Chuan Zou Submitted to Astrophysics and Space Science High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs) are millisecond-duration radio transients whose phys- ical origin remains uncertain. Magnetar-based models, motivated by observed properties such as polarization and large rotation measures, suggest that FRB emission may be modulated by the magnetar spin period. We present an efficient method to search for periodic signals in repeating FRBs by combining phase folding and Markov Chain Monte Carlo (MCMC) parameter estimation. Our method accelerates period searches. We test the method using observational data from repeater FRB 20201124A, and show that it can recover reported candidate periods.",
      "pdf_url": "https://arxiv.org/pdf/2512.23392.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23416",
      "title": "Possibility of Month-scale Quasi-periodic Oscillations in the Gamma-ray Light Curve of OP 313",
      "authors": [
        "Sandeep Kumar Mondal",
        "Shubham Kishore",
        "Alok C. Gupta",
        "Gwenael Giacinti"
      ],
      "abstract": "Possibility of Month-scale Quasi-periodic Oscillations in the Gamma-ray Light Curve of OP 313 Sandeep Kumar Mondal, Shubham Kishore, Alok C. Gupta, Gwenael Giacinti 14 pages, 7 figures, Submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) In this work, we report evidence suggesting the potential future detection of a month-scale quasi-periodic oscillation (QPO) in the gamma-ray light curve of OP 313. We analysed almost 16.8 years of Fermi-LAT gamma-ray data and applied the Bayesian block method to the monthly-binned light curve. We identified four high-flux states and investigated the possibility of a QPO in the fourth high-flux state (MJD 59482-60832). Using the Weighted Wavelet Z-transform (WWZ) and Lomb-Scargle Periodogram (LSP) methods, we find tentative evidence for a month-scale QPO; however, its detection significance is limited by the small number of observed cycles. With a sufficiently long data set, the QPO may be detected with higher significance in the future. We further explored possible physical origins of this potential QPO and examined several models. We found that a curved-jet model can explain the observed behaviour.",
      "pdf_url": "https://arxiv.org/pdf/2512.23416.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23428",
      "title": "Unveiling SN 2022eyw: A Bright Member of the Type Iax Supernova Subclass",
      "authors": [
        "Hrishav Das",
        "Devendra K. Sahu",
        "Anirban Dutta",
        "Mridweeka Singh",
        "G.C. Anupama",
        "Rishabh Singh Teja"
      ],
      "abstract": "Unveiling SN 2022eyw: A Bright Member of the Type Iax Supernova Subclass Hrishav Das, Devendra K. Sahu, Anirban Dutta, Mridweeka Singh, G.C. Anupama, Rishabh Singh Teja 22 pages, 14 figures, 4 tables, Accepted for publication in the Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE) We present comprehensive photometric and spectroscopic observations of Supernova (SN) 2022eyw, a luminous member of the Type Iax SN subclass. SN 2022eyw reached a peak absolute magnitude of $M_g = -17.80\\pm0.15$ mag and exhibited a rise time of $\\sim$15 days, placing it among the brighter Iax events. The bolometric light curve indicates a synthesized $^{56}$Ni mass of $0.120\\pm0.003~\\text{M}_{\\odot}$, with an estimated ejecta mass of $0.79\\pm0.09~\\text{M}_{\\odot}$ and kinetic energy of $0.19\\times10^{51}$ erg. The spectral evolution from -8 to +110 days past maximum reveals features characteristic of bright Type Iax Supernovae, including a transition from Fe III to Fe II dominance, moderate expansion velocities, and a lack of strong C III absorption. TARDIS spectral modelling of the early-phase spectra indicates a well-mixed ejecta dominated by Fe-group elements. In addition, traces of unburnt carbon are detected, pointing to incomplete burning as expected in pure deflagration models. Late-time spectral evolution shows a blend of permitted and forbidden lines. Comparison with deflagration models suggests that SN 2022eyw originated from a partial deflagration of a Chandrasekhar-mass white dwarf, with explosion properties intermediate between the N3-def and N5-def models. These observations support pure deflagration of a CO white dwarf as a viable explosion mechanism for its luminous members.",
      "pdf_url": "https://arxiv.org/pdf/2512.23428.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23458",
      "title": "Observations of the Fermi bubbles and the Galactic center excess with the DArk Matter Particle Explorer",
      "authors": [
        "F. Alemanno",
        "Q. An",
        "P. Azzarello",
        "F. C. T. Barbato",
        "P. Bernardini",
        "X. J. Bi",
        "H. Boutin",
        "I. Cagnoli",
        "M. S. Cai",
        "E. Casilli",
        "J. Chang",
        "D. Y. Chen",
        "J. L. Chen",
        "Z. F. Chen",
        "Z. X. Chen",
        "P. Coppin",
        "M. Y. Cui",
        "T. S. Cui",
        "I. De Mitri",
        "F. de Palma",
        "A. Di Giovanni",
        "T. K. Dong",
        "Z. X. Dong",
        "G. Donvito",
        "J. L. Duan",
        "K. K. Duan",
        "R. R. Fan",
        "Y. Z. Fan",
        "F. Fang",
        "K. Fang",
        "C. Q. Feng",
        "L. Feng",
        "S. Fogliacco",
        "J. M. Frieden",
        "P. Fusco",
        "M. Gao",
        "F. Gargano",
        "E. Ghose",
        "K. Gong",
        "Y. Z. Gong",
        "D. Y. Guo",
        "J. H. Guo",
        "S. X. Han",
        "Y. M. Hu",
        "G. S. Huang",
        "X. Y. Huang",
        "Y. Y. Huang",
        "M. Ionica",
        "L. Y. Jiang",
        "W. Jiang",
        "Y. Z. Jiang",
        "J. Kong",
        "A. Kotenko",
        "D. Kyratzis",
        "S. J. Lei",
        "B. Li",
        "M. B. Li",
        "W. H. Li",
        "W. L. Li",
        "X. Li",
        "X. Q. Li",
        "Y. M. Liang",
        "C. M. Liu",
        "H. Liu",
        "J. Liu",
        "S. B. Liu",
        "Y. Liu",
        "F. Loparco",
        "M. Ma",
        "P. X. Ma",
        "T. Ma",
        "X. Y. Ma",
        "G. Marsella",
        "M. N. Mazziotta",
        "D. Mo",
        "Y. Nie",
        "X. Y. Niu",
        "A. Parenti",
        "W. X. Peng",
        "X. Y. Peng",
        "C. Perrina",
        "E. Putti-Garcia",
        "R. Qiao",
        "J. N. Rao",
        "Y. Rong",
        "R. Sarkar",
        "P. Savina",
        "A. Serpolla",
        "Z. Shangguan",
        "W. H. Shen",
        "Z. Q. Shen",
        "Z. T. Shen",
        "L. Silveri",
        "J. X. Song",
        "H. Su",
        "M. Su",
        "H. R. Sun",
        "Z. Y. Sun",
        "A. Surdo",
        "X. J. Teng"
      ],
      "abstract": "Observations of the Fermi bubbles and the Galactic center excess with the DArk Matter Particle Explorer F. Alemanno, Q. An, P. Azzarello, F. C. T. Barbato, P. Bernardini, X. J. Bi, H. Boutin, I. Cagnoli, M. S. Cai, E. Casilli, J. Chang, D. Y. Chen, J. L. Chen, Z. F. Chen, Z. X. Chen, P. Coppin, M. Y. Cui, T. S. Cui, I. De Mitri, F. de Palma, A. Di Giovanni, T. K. Dong, Z. X. Dong, G. Donvito, J. L. Duan, K. K. Duan, R. R. Fan, Y. Z. Fan, F. Fang, K. Fang, C. Q. Feng, L. Feng, S. Fogliacco, J. M. Frieden, P. Fusco, M. Gao, F. Gargano, E. Ghose, K. Gong, Y. Z. Gong, D. Y. Guo, J. H. Guo, S. X. Han, Y. M. Hu, G. S. Huang, X. Y. Huang, Y. Y. Huang, M. Ionica, L. Y. Jiang, W. Jiang, Y. Z. Jiang, J. Kong, A. Kotenko, D. Kyratzis, S. J. Lei, B. Li, M. B. Li, W. H. Li, W. L. Li, X. Li, X. Q. Li, Y. M. Liang, C. M. Liu, H. Liu, J. Liu, S. B. Liu, Y. Liu, F. Loparco, M. Ma, P. X. Ma, T. Ma, X. Y. Ma, G. Marsella, M. N. Mazziotta, D. Mo, Y. Nie, X. Y. Niu, A. Parenti, W. X. Peng, X. Y. Peng, C. Perrina, E. Putti-Garcia, R. Qiao, J. N. Rao, Y. Rong, R. Sarkar, P. Savina, A. Serpolla, Z. Shangguan, W. H. Shen, Z. Q. Shen, Z. T. Shen, L. Silveri, J. X. Song, H. Su, M. Su, H. R. Sun, Z. Y. Sun, A. Surdo, X. J. Teng 22 pages, 18 figures and 5 tables High Energy Astrophysical Phenomena (astro-ph.HE) The DArk Matter Particle Explorer (DAMPE) is a space-borne high-energy particle detector that surveys the $\\gamma$-ray sky above$\\sim 2~\\rm GeV$ with a peak acceptance of $\\sim 0.2~\\rm m^2\\,sr$. With the 102 months of data collected by DAMPE, we show that the Fermi bubbles are detected at a significance of $\\sim 26\\sigma$ and identify a GeV excess in the direction of Galactic center at $\\sim 7 \\sigma$ confidence. Both spectra and morphology are consistent with those observed by Fermi-LAT and the GeV excess component can be interpreted by the dark matter annihilation with a mass of $\\sim 50$ GeV and a velocity-averaged cross section of $\\sim 10^{-26}~{\\rm cm^{3}~s^{-1}}$ for the $\\chi \\chi \\rightarrow b\\bar{b}$ channel. Our results thus provide the first independent detection of these two intriguing diffuse gamma-ray sources besides Fermi-LAT.",
      "pdf_url": "https://arxiv.org/pdf/2512.23458.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23577",
      "title": "Limits on dark matter existence in neutron stars from recent astrophysical observations and mass correlation analysis",
      "authors": [
        "Jing Fu Hu",
        "Hang Lu",
        "Bao Yuan Sun"
      ],
      "abstract": "Limits on dark matter existence in neutron stars from recent astrophysical observations and mass correlation analysis Jing Fu Hu, Hang Lu, Bao Yuan Sun High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) Dark matter admixed neutron stars (DANSs) serve as a specific astrophysical laboratory for probing the features of dark matter (DM) and have emerged as a promising candidate for interpreting recent astrophysical observations (e.g., by NICER and LIGO/Virgo). Accurately constraining the internal DM content of DANSs is therefore of critical importance. In this work, we construct the equations of state (EoS) for DANS matter by employing twelve nuclear matter (NM) models within the covariant density functional (CDF) theory and a self-interacting fermionic model for DM. Using these EoSs as input, we solve the two-fluid Tolman-Oppenheimer-Volkov (TOV) equations to systematically investigate the influence of DM on the global properties of neutron stars (NSs). By incorporating recent observational constraints on NS properties, the maximum DM mass fraction $f_\\chi^{\\mathrm{max}}$ in DANSs is determined for each NM EoS model. Our analysis reveals a strong linear correlation (Pearson coefficient $r=0.98$) between $f_\\chi^{\\mathrm{max}}$ and the maximum mass of a pure NS, $M_{\\rm{NS}}^{\\mathrm{max}}$, described by $f_{\\chi}^{\\mathrm{max}} = 0.22 M_{\\mathrm{NS}}^{\\mathrm{max}} - 0.44$. Leveraging this correlation and the observed NS maximum mass distribution, $P(M_{\\text{NS}}^{\\max} \\mid \\text{EM})$, we derive the probability distribution function (PDF) for the maximum DM mass, $P(M_{\\chi}^{\\max} \\mid \\text{EM})$, in DANSs. We find that at the 68\\% confidence level, $M_{\\chi}^{\\mathrm{max}}=0.150^{+0.070}_{-0.051}\\ M_{\\odot}$. This quantitative constraint on the DM mass provides a critical prior for interpreting potential observational signatures of DANSs, such as anomalous tidal deformabilities and distinctive gravitational-wave signals.",
      "pdf_url": "https://arxiv.org/pdf/2512.23577.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.23660",
      "title": "Classification and Characteristics of Double-trigger Gamma-ray Bursts",
      "authors": [
        "Liang Li"
      ],
      "abstract": "Classification and Characteristics of Double-trigger Gamma-ray Bursts Liang Li 23 pages, 7 figures (including 21 panels), 4 tables High Energy Astrophysical Phenomena (astro-ph.HE) Over the past two decades, the \\textit{Swift} and \\textit{Fermi} missions have identified a rare class of ``double-trigger'' gamma-ray bursts (GRBs) that produce two independent trigger events. These events are characterized by a sufficiently long quiescent period during which the on-board trigger system can reset, resulting in the subsequent emission being recorded as a second independent event. Consistent sky localization confirms that both trigger events originated from the same astrophysical source. Here, we present a systematic classification and characteristics study of three such cases: GRB 091024A, GRB 110709B, and GRB 220627A. We investigate each trigger episode emission independently using standard classification diagnostics, including duration ($T_{90}$), hardness ratio, minimum variability timescale (MVT), spectral lag ($\\tau_{\\rm lag}$), peak energy ($E_{\\rm p}$), and energetics. We compare these properties with those of typical long GRBs (LGRBs) and with single-trigger LGRBs that exhibit extended quiescent periods. Our analysis reveals that all sub-bursts from the three double-trigger events consistently lie within the LGRB classification region. These results indicate that double-trigger GRBs are not a physically distinct subclass, but rather products of LGRB central engines that undergo extended dormancy and subsequent reactivation.",
      "pdf_url": "https://arxiv.org/pdf/2512.23660.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22411",
      "title": "On the origin and nature of double-double radio galaxies",
      "authors": [
        "David Garofalo",
        "Zhiyuan Liu",
        "Atticus V. Magerko"
      ],
      "abstract": "On the origin and nature of double-double radio galaxies David Garofalo, Zhiyuan Liu, Atticus V. Magerko Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Double-double radio galaxies (DDRGs) display inner and outer jets or lobes thought to result from intermittent accretion. Due to randomly triggered accretion events, the lifetime of the retriggered jet is not expected to have any connection to the time of quiescence between jets, yet we show that a correlation between the two quantities may exist, which we interpret as resulting from continued accretion through the quiescent jet phase. Despite continuous accretion, a jet is absent because its presence depends on a non-zero value of black hole spin, but accretion transitions the system from counter-rotation to corotation, and therefore through zero black hole spin where a jet cannot form. The time of jet quiescence depends on how long it takes to spin the black hole up again in corotation, which is longer for lower accretion rates. Once the black hole spin is large enough for a renewed jet, this inner jet will last longer the lower the accretion rate is. Hence, in a continuous accretion scenario, longer quiescent times tend to associate to longer inner jet times. In addition, DDRG jets are of FRII morphology which we show to result from the absence of a tilt in the accretion disk in the transition through zero black hole spin, ensuring the absence of an FRI jet in a way that connects with our understanding of X-shaped radio galaxies. Both correlated timescales as well as sameness in jet morphology offers evidence in favor of our picture.",
      "pdf_url": "https://arxiv.org/pdf/2512.22411.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.00985",
      "title": "Vortex driven Schwingrer pair creation in the magnetosphere of SgrA*",
      "authors": [
        "Zaza N. Osmanov"
      ],
      "abstract": "Vortex driven Schwingrer pair creation in the magnetosphere of SgrA* Zaza N. Osmanov High Energy Astrophysical Phenomena (astro-ph.HE) In this study we consider the possibility of the Schwinger pair creation driven by the centrifugal mechanism in the magnetosphere of SgrA*. In particular, it is shown that the magneto-centrifugal effects become extremely efficient due to the vortex driven magnetic field, which is by several orders of magnitude bigger than previously thought. Dynamics of the magneto-centrifugally accelerated charged particles leads to charge-separation, parametrically inducing the Langmuir waves. The corresponding electric field exponentially amplifies and after reaching the Schwinger threshold, the efficient pair production occurs, that is eventually saturated by the annihilation process.",
      "pdf_url": "https://arxiv.org/pdf/2501.00985.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.04402",
      "title": "Non-Stationary Discs and Instabilities",
      "authors": [
        "Omer Blaes",
        "Yan-Fei Jiang",
        "Jean-Pierre Lasota",
        "Galina Lipunova"
      ],
      "abstract": "Non-Stationary Discs and Instabilities Omer Blaes, Yan-Fei Jiang, Jean-Pierre Lasota, Galina Lipunova 55 pages, 8 figures. We thank the International Space Science Institute in Bern for hosting a workshop on the first 50 years of research on accretion discs. This version has been accepted for publication but is not the Version of Record and does not reflect post-acceptance improvements, or any corrections. The Version of Record is available at this http URL Blaes, O., Jiang, YF., Lasota, JP., Lipunova G. Non-Stationary Discs and Instabilities. Space Sci Rev 221, 120 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) We review our current knowledge of thermal and viscous instabilities in accretion discs around compact objects. We begin with classical disc models based on analytic viscosity prescriptions, discussing physical uncertainties and exploring time-dependent solutions of disc evolution. We also review the ionization instability responsible for outbursting dwarf nova and X-ray binary systems, including some detailed comparisons between alpha-based models and the observed characteristics of these systems. We then review modern theoretical work based on ideas around angular momentum transport mediated by magnetic fields, focusing in particular on knowledge gained through local and global computer simulations of MHD processes in discs. We discuss how magnetohydrodynamics (MHD) may alter our understanding of outbursts in white dwarf and X-ray binary systems. Finally, we turn to the putative thermal/viscous instabilities that were predicted to exist in the inner, radiation pressure-dominated regions of black hole and neutron star discs, in apparent contradiction to the observed stability of the high/soft state in black hole X-ray binaries.",
      "pdf_url": "https://arxiv.org/pdf/2505.04402.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.14711",
      "title": "Investigating FRB 20240114A with FAST: Morphological Classification and Drifting Rate Measurements in a Burst-Cluster Framework",
      "authors": [
        "Long-Xuan Zhang",
        "Shiyan Tian",
        "Junyi Shen",
        "Jun-Shuo Zhang",
        "Dejiang Zhou",
        "Lin Zhou",
        "Po Ma",
        "Tian-Cong Wang",
        "Dengke Zhou",
        "Jinlin Han",
        "Yunpeng Men",
        "Fayin Wang",
        "Jiarui Niu",
        "Pei Wang",
        "Weiwei Zhu",
        "Bing Zhang",
        "Di Li",
        "Yuan-Chuan Zou",
        "Wei-Yang Wang",
        "Yuan-Pei Yang",
        "Qin Wu",
        "He Gao",
        "Ke-Jia Lee",
        "Jia-Wei Luo",
        "Rui Luo",
        "Chao-Wei Tsai",
        "Lin Lin",
        "Wanjin Lu",
        "Jintao Xie",
        "Jianhua Fang",
        "Jinhuang Cao",
        "Chen-Chen Miao",
        "Yuhao Zhu",
        "Yunchuan Chen",
        "Yong-Kun Zhang",
        "Shuo Cao",
        "Zi-Wei Wu",
        "Chunfeng Zhang",
        "Silu Xu",
        "Huaxi Chen",
        "Xiang-Lei Chen",
        "Xianghan Cui",
        "Yi Feng",
        "Yu-Xiang Huang",
        "Weicong Jing",
        "Dong-Zi Li",
        "Jian Li",
        "Ye Li",
        "Chen-Hui Niu",
        "Yong-Feng Huang",
        "Qingyue Qu",
        "Yuanhong Qu",
        "Bojun Wang",
        "Yi-Dan Wang",
        "Suming Weng",
        "Xuefeng Wu",
        "Heng Xu",
        "Shihan Yew",
        "Aiyuan Yang",
        "Wenfei Yu",
        "Lei Zhang",
        "Rushuang Zhao"
      ],
      "abstract": "Investigating FRB 20240114A with FAST: Morphological Classification and Drifting Rate Measurements in a Burst-Cluster Framework Long-Xuan Zhang, Shiyan Tian, Junyi Shen, Jun-Shuo Zhang, Dejiang Zhou, Lin Zhou, Po Ma, Tian-Cong Wang, Dengke Zhou, Jinlin Han, Yunpeng Men, Fayin Wang, Jiarui Niu, Pei Wang, Weiwei Zhu, Bing Zhang, Di Li, Yuan-Chuan Zou, Wei-Yang Wang, Yuan-Pei Yang, Qin Wu, He Gao, Ke-Jia Lee, Jia-Wei Luo, Rui Luo, Chao-Wei Tsai, Lin Lin, Wanjin Lu, Jintao Xie, Jianhua Fang, Jinhuang Cao, Chen-Chen Miao, Yuhao Zhu, Yunchuan Chen, Yong-Kun Zhang, Shuo Cao, Zi-Wei Wu, Chunfeng Zhang, Silu Xu, Huaxi Chen, Xiang-Lei Chen, Xianghan Cui, Yi Feng, Yu-Xiang Huang, Weicong Jing, Dong-Zi Li, Jian Li, Ye Li, Chen-Hui Niu, Yong-Feng Huang, Qingyue Qu, Yuanhong Qu, Bojun Wang, Yi-Dan Wang, Suming Weng, Xuefeng Wu, Heng Xu, Shihan Yew, Aiyuan Yang, Wenfei Yu, Lei Zhang, Rushuang Zhao 23 pages, 14 figures, 1 tables, the 3rd of papers from the FAST FRB Key Science Project Collaboration on FRB 20240114A: Burst Morphology Analysis, accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) This study investigates the morphological classification and drifting rate measurement of the repeating fast radio burst (FRB) source FRB 20240114A using the Five-hundred-meter Aperture Spherical Telescope (FAST). Detected on January 14, 2024, FRB 20240114A exhibited an exceptionally high burst rate, revealing unique properties. Through observational campaigns over several months, we selected a dataset comprising 3,203 bursts (2,109 burst-clusters) during a continuous monitoring session (15,780 seconds) on March 12, 2024. Improving upon previous work, we clarify the definitions of sub-bursts, bursts and burst-clusters. Using an average dispersion measures (DM) of 529.2 pc cm$^{-3}$, we classified the burst-clusters into Downward Drifting, Upward Drifting, No Drifting, No Evidence for Drifting, Not-Clear, and Complex burst-clusters. Among the 978 burst-clusters that exhibit drifting behavior, 233 (23.82%) show upward drifting. Additionally, if 142 upward drifting single-component burst-clusters are excluded, upward drifting double- and multi-component burst-clusters still account for 10.89% of the 836 burst-clusters exhibiting drifting behavior, equating to 91 burst-clusters. Furthermore, if only upward drifting burst-clusters with consecutive time intervals (or upward drifting bursts) are considered, only 9 bursts remain. Drifting rate comparisons with other physical quantities reveal that the drifting rate increases with peak frequency for single-component burst-clusters with drifting behavior. Moreover, in single-component burst-clusters, those with upward drifting exhibit smaller effective widths, bandwidths, and fluxes than their downward drifting counterparts. A Kolmogorov-Smirnov test further indicates that upward drifting burst-clusters possess longer consecutive time intervals than downward drifting ones, suggesting distinct underlying physical mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2507.14711.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25915",
      "title": "The Formation of Electron-capture Supernovae: A Review",
      "authors": [
        "Bo Wang",
        "Dongdong Liu",
        "Yunlang Guo",
        "Zhanwen Han"
      ],
      "abstract": "The Formation of Electron-capture Supernovae: A Review Bo Wang, Dongdong Liu, Yunlang Guo, Zhanwen Han 22 pages, 8 figures, accepted for publication in RAA, an invited review High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) It is generally believed that the electron-capture reactions happen when the oxygen-neon (ONe) cores grow in masses close to the Chandrasekhar limit, leading to the formation of neutron stars (NSs) via electron-capture supernovae (EC-SNe). EC-SNe are predicted to be the most likely short-lived and faint optical transients, and a small ejecta mass is expected during the collapse. This kind of SNe provide an alternative channel for producing isolated NSs and NS systems, especially for the formation of X-ray binaries and double NSs. Although EC-SNe were proposed ~45 yr ago, there are still some uncertainties for the origin of EC-SNe. In this article, we review recent studies on the two classic progenitor channels of EC-SNe, i.e., the single star channel and the binary star channel. In the single star channel, EC-SNe can happen in super asymptotic giant branch stars or He stars, whereas in the binary star channel EC-SNe can occur in He stars in binaries (involving He star+MS systems and NS+He star systems) or accretion-induced collapse in white dwarf binaries (involving the single-degenerate scenario and the double-degenerate scenario). Recent progress on the two progenitor channels is discussed, including the initial parameter range for EC-SNe, the evolutionary paths to EC-SNe, related objects and some observational constraints, etc. We also make some discussions on the possible candidates for EC-SNe in this article, and the impacts of EC-SNe on some research fields, e.g., the properties of NSs, double NS population and chemical products, etc. We also discuss the differences between EC-SNe and ultra-stripped SNe in this article. Research on EC-SNe is at a pivotal stage, with key theoretical uncertainties and observational challenges requiring integrated modeling and multi-wavelength observations for robust identification.",
      "pdf_url": "https://arxiv.org/pdf/2509.25915.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12465",
      "title": "Optically thick winds of very massive stars suppress intermediate-mass black hole formation",
      "authors": [
        "Stefano Torniamenti",
        "Michela Mapelli",
        "Lumen Boco",
        "Filippo Simonato",
        "Giuliano Iorio",
        "Erika Korb"
      ],
      "abstract": "Optically thick winds of very massive stars suppress intermediate-mass black hole formation Stefano Torniamenti, Michela Mapelli, Lumen Boco, Filippo Simonato, Giuliano Iorio, Erika Korb 10 pages, 7 figures. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Intermediate-mass black holes (IMBHs) are the link between stellar-mass and supermassive black holes. Gravitational waves have started unveiling a population of IMBHs in the $\\sim 100-300 \\, \\mathrm{M_{\\odot}}$ range. Here, we investigate the formation of IMBHs from non-rotating very massive stars (VMSs, $>100\\,{} \\mathrm{M_{\\odot}}$). We calculate new VMS models that account for the transition from optically thin to optically thick winds, and study how this enhanced mass loss affects IMBH formation and the black hole mass function at intermediate and high metallicity ($Z=10^{-4}-0.02$). We show that optically thick winds suppress the formation of IMBHs from direct VMS collapse at metallicities $Z>0.001$, one order of magnitude lower than predicted by previous models. Our models indicate that the stellar progenitors of GW231123 must have had a metallicity $Z<0.002$, if the primary black hole formed via direct VMS collapse.",
      "pdf_url": "https://arxiv.org/pdf/2510.12465.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.25762",
      "title": "Radiation-dominated polar emitting region of an accreting X-ray pulsar -- I. Polarization- and spectrum-dependent structure, and the emergent continuum",
      "authors": [
        "M. I. Gornostaev"
      ],
      "abstract": "Radiation-dominated polar emitting region of an accreting X-ray pulsar -- I. Polarization- and spectrum-dependent structure, and the emergent continuum M. I. Gornostaev High Energy Astrophysical Phenomena (astro-ph.HE) The radiation-dominated polar emitting region of an accreting X-ray pulsar is simulated numerically in the framework of a three-dimensional (geometrically two-dimensional) model. The radiative transfer within the emitting region and the structure of the latter are calculated with the use of the self-consistent algorithm developed earlier. The magnetic scattering cross sections dependent on the photon energy and polarization have been incorporated. Second-order bulk Comptonization over entire emitting region, induced Compton scattering, the switching of the polarization modes, free-free processes, the cyclotron emission because of electron-proton collisions, and a realistic shape of the accretion channel have been taken into account. The case of a dipole magnetic field is considered. It is shown that the induced Compton effect can play a notable role in establishing the electron temperature in the post-shock zone. Within the model shock wave, a higher electron temperature is achieved than in the post-shock zone by means of the bulk-heating mechanism. The photons gaining the energy in the shock wave and above it due to bulk motion effects and the thermal Doppler effect are responsible for the formation of high-energy regions in the emergent continuum of the polarization modes.",
      "pdf_url": "https://arxiv.org/pdf/2510.25762.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16638",
      "title": "Cygnus X-3: A variable petaelectronvolt gamma-ray source",
      "authors": [
        "LHAASO Collaboration"
      ],
      "abstract": "Cygnus X-3: A variable petaelectronvolt gamma-ray source LHAASO Collaboration High Energy Astrophysical Phenomena (astro-ph.HE) We report the discovery of variable $\\gamma$-rays up to petaelectronvolt from Cygnus X-3, an iconic X-ray binary. The $\\gamma$-ray signal was detected with a statistical significance of approximately 10 $\\sigma$ by the Large High Altitude Air Shower Observatory (LHAASO). Its intrinsic spectral energy distribution (SED), extending from 0.06 to 3.7 PeV, shows a pronounced rise toward 1 PeV after accounting for absorption by the cosmic microwave background radiation. The detected month-scale variability,together with a 3.2$\\sigma$ evidence for orbital modulation, suggests that the PeV $\\gamma$-rays originate within, or in close proximity to, the binary system itself. The observed energy spectrum and temporal modulation can be naturally explained by $\\gamma$-ray production through photomeson processes in the innermost region of the relativistic jet, where protons need to be accelerated to tens of PeV energies.",
      "pdf_url": "https://arxiv.org/pdf/2512.16638.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22617",
      "title": "Evidence for a Stratified Accretion Disk Wind in AGN",
      "authors": [
        "P. Marziani",
        "E. Bon",
        "S. Panda",
        "N. Bon",
        "A. Del Olmo",
        "A. Deconto-Machado",
        "K. Garnica",
        "D. Dultzin"
      ],
      "abstract": "Evidence for a Stratified Accretion Disk Wind in AGN P. Marziani, E. Bon, S. Panda, N. Bon, A. Del Olmo, A. Deconto-Machado, K. Garnica, D. Dultzin 14 pages, 3 figures, submitted to Contrib. Astron. Obs. Skalnaté Pleso Astrophysics of Galaxies (astro-ph.GA) We present observational evidence supporting the presence of a stratified accretion disk wind in active galactic nuclei (AGN), based on multi-wavelength spectroscopic analysis of broad and narrow emission lines. The diversity in emission line profiles, ionization potentials, and kinematic signatures suggests a structured outflow emerging from the accretion disk, with different zones contributing to specific spectral features. High-ionization lines (e.g., Civ {\\lambda}1549) exhibit strong blueshifts and asymmetric profiles indicative of fast, inner winds, while low-ionization lines (e.g., H\\b{eta}, Mgii {\\lambda} 2800) show more symmetric profiles consistent with predominant emission from slower, denser regions farther out, although exhibiting systematic blueshifts in quasars radiating at high Eddington ratios. The intermediate ionization lines (e.g., Aliii {\\lambda}1860) present a situation that is intermediate in terms of shift amplitudes, although in several super-Eddington candidates radial outflow velocity may reach values comparable to the ones of the high ionization lines. These results are consistent with radiatively driven wind models featuring radial stratification. We made preliminary photoionization modeling assuming unabsorbed radiation emitted from the corona and the hotter disk regions emission or absorbed by a layer of gas. Our findings provide new constraints on the geometry and physical conditions of AGN winds, providing clear evidence in favor of stratified wind emission.",
      "pdf_url": "https://arxiv.org/pdf/2512.22617.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22661",
      "title": "Kinematical and Photometric Deconstruction of the UGC 694-IC 412 System: Evidence for a Line-of-Sight Projection",
      "authors": [
        "Ikbar Faiz"
      ],
      "abstract": "Kinematical and Photometric Deconstruction of the UGC 694-IC 412 System: Evidence for a Line-of-Sight Projection Ikbar Faiz Astrophysics of Galaxies (astro-ph.GA) This study re-evaluates the previously assumed interaction between the galaxy pair UGC 694 and IC 412 through a combined kinematical and photometric approach. While morphological features such as tidal bridges have been visually identified in past surveys, our quantitative analysis using SDSS DR16 kinematical data reveals a significant radial velocity offset of approximately 8372 km/s. UGC 694 exhibits a heliocentric velocity of 12683 +/- 34 km/s, placing it at a distance of approximately 188 Mpc, whereas IC 412 is located in the foreground at approximately 62 Mpc with a velocity of 4311 +/- 46 km/s. This vast spatial separation of approximately 123.5 Mpc confirms that the perceived proximity is a line-of-sight projection effect rather than a physical gravitational encounter. Furthermore, we utilize differential photometry to analyze the structural asymmetry and color distribution of UGC 694. Our photometric findings suggest that the galaxy's disturbed morphology is not a result of a tidal encounter with IC 412, but likely originates from internal evolutionary processes or minor mergers with undetected companions. This work emphasizes the critical role of multi-wavelength validation in classifying interacting systems to avoid misinterpretation due to projection effects.",
      "pdf_url": "https://arxiv.org/pdf/2512.22661.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22685",
      "title": "Lithium abundance and stellar rotation in the Galactic halo and thick disc: Contribution from low-mass giant field stars",
      "authors": [
        "Ramiro de la Reza",
        "Felix Llorente de Andrés",
        "Emilio J. Alfaro",
        "Carolina Chavero"
      ],
      "abstract": "Lithium abundance and stellar rotation in the Galactic halo and thick disc: Contribution from low-mass giant field stars Ramiro de la Reza, Felix Llorente de Andrés, Emilio J. Alfaro, Carolina Chavero Accepted for publication in Astronomy & Astrophysics, 11 pages, 9 figures Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The stellar evolution of lithium-rich (Li-rich) giant stars at very low metallicities remains largely unexplored to date. Using two recent large LAMOST catalogues of field, low-mass giant stars (both Li-rich and Li-poor) with metallicities from -4.0 to -1.0, we studied the conditions for Li enrichment and the distribution of stellar rotations in the Galactic halo and thick disc. Due to the scarcity of stars with [Fe/H] < -3.0, only three Li-rich RGB stars are known in this regime. The observational appearance of giants across the horizontal branch (HB) and asymptotic giant branch (AGB) stages (with Li abundances up to 6.15 dex) has been detected for metallicities > -2.5. Among these stars, we detected IR excesses indicative of giant stars losing mass, showing a recent episodic Li-enrichment process related to the Cameron-Fowler mechanism for the formation of new 7Li. Because stars with IR excesses are distributed across most metallicity values, we suggest this mechanism is at work throughout an important part of the Galaxy's evolutionary history. Based on these IR excesses, we identified three Li thresholds: about 1.5 dex for RGB stars, about 0.5 dex for HB stars, and about -0.5 dex for AGB stars, establishing a new criterion to characterise Li-rich giants. We carried out a study of stellar rotations in metal-poor giant stars, revealing that a plateau appears for velocities greater than 40 km/s up to near 90 km/s, with Li abundances from 1.02 to 1.82 dex. Among Li-rich giants with v sin i > 40 km/s, increasing rotation is observed as metallicity decreases from -1.0 to -2.5. The presence of RGB and HB Li-rich giants with rotations up to 90 km/s suggests that stellar models must account for extended 3He reservoir lifetimes as a source of 7Li. The velocity around 40 km/s appears to be a new critical value.",
      "pdf_url": "https://arxiv.org/pdf/2512.22685.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22698",
      "title": "Cloud Properties and Star Formation in M31",
      "authors": [
        "J. Armijos-Abendaño",
        "S. A. Eales",
        "M. W. L. Smith"
      ],
      "abstract": "Cloud Properties and Star Formation in M31 J. Armijos-Abendaño, S. A. Eales, M. W. L. Smith Accepted for publication in MNRAS. 14 pages, 16 figures Astrophysics of Galaxies (astro-ph.GA) We present a catalogue of 453 molecular clouds in M31 extracted from CO J=1-0 data observed with CARMA using a dendrogram. Our clouds have the mean values of 2.8 km s$^{-1}$, 22.1 pc and 10$^{5.2}$ M$_\\odot$ for the velocity dispersion, radius and mass, respectively. The velocity dispersion shows a weak anti-correlation with the galactocentric radius. The clouds in M31 show mean and median values of 2.0 and 1.4, respectively, for their virial parameters, indicating that most of them are gravitationally bound. Our dendrogram analysis identifies 35 sources with multiple velocity components, which we classify as molecular cloud complexes. We study the size-velocity dispersion and size-mass relationships for the clouds in M31, finding the slopes of 0.43$\\pm$0.05 and 1.36$\\pm$0.06 for the former and the latter, respectively. Our size-velocity dispersion relationship agrees with those of Milky Way (MW) and M31 clouds. The slope of our size-mass relationship is shallower than those in clouds and cloud complexes of the MW. We find offsets between the isosurfaces of the clouds and star formation rate (SFR) peaks in M31, supporting the scenario where the evolutionary state of individual sources plays a role in the Kennicutt-Schmidt (KS) law at parsec scales. We find a slope of 0.66$\\pm$0.07 for the KS law, which is slightly lower than the values of $\\sim$0.8 for MW clouds.",
      "pdf_url": "https://arxiv.org/pdf/2512.22698.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22751",
      "title": "Rotation and stability of the circumnuclear gas disk in the Galactic Center potential by the ALMA CMZ Exploration Survey (ACES)",
      "authors": [
        "Yoshiaki Sofue",
        "Steven N. Longmore",
        "Daniel Walker",
        "Adam Ginsburg",
        "Jonathan D. Henshaw",
        "John Bally",
        "Ashley T. Barnes",
        "Cara Battersby",
        "Laura Colzi",
        "Paul Ho",
        "Jimenez-Serra",
        "J.M.Diederik Kruijssen",
        "Elizabeth Mills",
        "Maya A. Petkova",
        "Mattia C. Sormani",
        "Jen Wallace",
        "Jairo Armijos-Abendano",
        "Zi-Xuan Feng",
        "Karl Fiteni",
        "Pablo García",
        "Savannah Gramze",
        "Christian Henkel",
        "Pei-Ying Hsieh",
        "Ralf S. Klessen",
        "Francisco Nogueras-Lara",
        "Dylan M. Paré",
        "Victor M.",
        "Rivilla",
        "Alvaro Sánchez-Monge"
      ],
      "abstract": "Rotation and stability of the circumnuclear gas disk in the Galactic Center potential by the ALMA CMZ Exploration Survey (ACES) Yoshiaki Sofue, Steven N. Longmore, Daniel Walker, Adam Ginsburg, Jonathan D. Henshaw, John Bally, Ashley T. Barnes, Cara Battersby, Laura Colzi, Paul Ho, Jimenez-Serra, J.M.Diederik Kruijssen, Elizabeth Mills, Maya A. Petkova, Mattia C. Sormani, Jen Wallace, Jairo Armijos-Abendano, Zi-Xuan Feng, Karl Fiteni, Pablo García, Savannah Gramze, Christian Henkel, Pei-Ying Hsieh, Ralf S. Klessen, Francisco Nogueras-Lara, Dylan M. Paré, Victor M., Rivilla, Alvaro Sánchez-Monge Accepted for PASJ, 20 pages, 20 figures Astrophysics of Galaxies (astro-ph.GA) We investigated the gravitational potential and mass distribution in the Galactic Center by examining the morphology and kinematics of the circumnuclear gaseous disk revealed by the molecular line data from the ALMA CMZ Exploration Survey (ACES). We obtain an estimate of the shape of the potential {within the central $\\sim 20$ pc} to reproduce the observed properties of the circumnuclear gas disk (CND) by simulating the motion of test particles for various axial ratios and show that the potential is approximately spherical. We construct a rotation curve by applying the terminal velocity method to the position-velocity diagrams, and calculate the mass distribution in the Galactic Center. The distribution of mass density is found to be of cusp type, approximated by $\\rho_{\\rm mass} \\sim 1.56\\times 10^5(R/1 {\\rm pc})^{-1.9}~M_{\\odot} {\\rm pc}^{-3}$, where $R$ is the distance from the nucleus. We discuss the tidal effect caused by the gravitational potential that produces the rotation curve and show that the gas disk is stable against self-gravitational contraction within a critical radius of $ R_{\\rm T}\\sim 14 ~(\\rho_{\\rm gas}/10^5 {\\rm H_2~cm^{-3}})^{-1/2}~{\\rm pc}$. This suggests suppression of star formation and a top-heavy IMF in the circmunuclear region.",
      "pdf_url": "https://arxiv.org/pdf/2512.22751.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23060",
      "title": "Finding Quasars behind the Galactic Plane. IV. Candidate Selection from Chandra with Random Forest",
      "authors": [
        "Xu Zhang",
        "Yanli Ai",
        "Yanxia Zhang",
        "Yuming Fu",
        "Xue-Bing Wu",
        "Zhiying Huo",
        "Wenfeng Wen",
        "Jiayuan Zhou",
        "Dexuan Kong",
        "Linfeng Zeng",
        "Heng Wang"
      ],
      "abstract": "Finding Quasars behind the Galactic Plane. IV. Candidate Selection from Chandra with Random Forest Xu Zhang, Yanli Ai, Yanxia Zhang, Yuming Fu, Xue-Bing Wu, Zhiying Huo, Wenfeng Wen, Jiayuan Zhou, Dexuan Kong, Linfeng Zeng, Heng Wang Astrophysics of Galaxies (astro-ph.GA) Quasar samples remain severely incomplete at low Galactic latitudes because of strong extinction and source confusion. We conduct a systematic search for quasars behind the Galactic plane using X-ray sources from the Chandra Source Catalog (CSC 2.1), combined with optical data from Gaia DR3 and mid-infrared data from CatWISE2020. Using spectroscopically confirmed quasars and stars from data sets including DESI, SDSS, and LAMOST, we apply a Random Forest classifier to identify quasar candidates, with stellar contaminants suppressed using Gaia proper-motion constraints. Photometric redshifts are estimated for the candidates using a Random Forest regression model. Applying this framework to previously unclassified CSC sources, we identify 6286 quasar candidates, including 863 Galactic Plane Quasar (GPQ) candidates at |b|<20°, of which 514 are high-confidence candidates. Relative to the previously known GPQ sample, our selected GPQs reach fainter optical and X-ray fluxes, improving sensitivity to low-flux GPQs. In addition, both the GPQ candidates and known GPQs display harder X-ray spectra than the all-sky quasar sample, consistent with increased absorption through the Galactic plane. Pilot spectroscopy confirms two high-confidence GPQ candidates as quasars at spectroscopic redshifts of z=1.2582 and z=1.1313, and further spectroscopic follow-up of the GPQ sample is underway. This work substantially improves the census of GPQs and provides a valuable target sample for future spectroscopic follow-up, enabling the use of GPQs to refine the reference frames for astrometry and probe the Milky Way interstellar and circumgalactic media with the absorption features of GPQs.",
      "pdf_url": "https://arxiv.org/pdf/2512.23060.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23157",
      "title": "The GLASS-JWST Early Release Science Program. V. H$α$ luminosity functions at $z\\sim1.3$ and $z\\sim2.0$",
      "authors": [
        "Yuxuan Pang",
        "Xin Wang",
        "Tommaso Treu",
        "Qianqiao Zhou",
        "Shengzhe Wang",
        "Xue-Bing Wu",
        "Maruša Bradač",
        "Karl Glazebrook",
        "Nicha Leethochawalit",
        "Matthew A. Malkan",
        "Themiya Nanayakkara",
        "Benedetta Vulcani",
        "Peter J. Watson",
        "Hu Zhan"
      ],
      "abstract": "The GLASS-JWST Early Release Science Program. V. H$α$ luminosity functions at $z\\sim1.3$ and $z\\sim2.0$ Yuxuan Pang, Xin Wang, Tommaso Treu, Qianqiao Zhou, Shengzhe Wang, Xue-Bing Wu, Maruša Bradač, Karl Glazebrook, Nicha Leethochawalit, Matthew A. Malkan, Themiya Nanayakkara, Benedetta Vulcani, Peter J. Watson, Hu Zhan 17 pages, 7 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) We present H$\\alpha$ luminosity function (LF) measurements at redshifts $z\\sim1.3$ and $z\\sim2.0$ using JWST NIRISS grism data from the GLASS-JWST survey. Based on emission lines spectroscopically identified in the F115W, F150W and F200W filters, we select 99 H$\\alpha$ emitters. Through detailed effective volume and completeness analysis for each source, we construct the H$\\alpha$ LF in two redshift bins. Thanks to the sensitivity of NIRISS WFSS and gravitational lensing magnification, our sample reaches intrinsic H$\\alpha$ luminosities $\\sim$10 times deeper than previous grism surveys, down to $L_{\\rm H\\alpha}\\sim10^{40.5}~\\rm erg~s^{-1}$ at $z\\sim1.3$ and $L_{\\rm H\\alpha}\\sim10^{40.9}~\\rm erg~s^{-1}$ at $z\\sim2.0$ with completeness larger than 0.8, corresponding to star formation rates of 0.4 and 1.0 $M_{\\odot}~\\rm yr^{-1}$, respectively. We robustly constrain the faint-end slope of the H$\\alpha$ luminosity function to be $-1.50^{+0.14}_{-0.08}$ at $z\\sim1.3$ and $-1.60^{+0.17}_{-0.09}$ at $z\\sim2.0$ after considering the cosmic variance of $\\sim 20\\%$, consistent with previous estimations. The emission-line samples presented here will enable further detailed studies of galaxy properties including metallicities. We find a negligible contribution from bright active galactic nuclei in our sample. We estimate integrated cosmic star formation rate densities of $0.097^{+0.015}_{-0.016}~M_{\\odot}~\\rm yr^{-1}~Mpc^{-3}$ at $z\\sim1.3$ and $0.129^{+0.025}_{-0.030}~M_{\\odot}~\\rm yr^{-1}~Mpc^{-3}$ at $z\\sim2.0$. The methodology presented here can be readily applicable to other JWST slitless spectroscopic datasets and future wide-field slitless surveys, including those from Euclid, Roman, and the Chinese Space Station Telescope.",
      "pdf_url": "https://arxiv.org/pdf/2512.23157.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23202",
      "title": "MAMMOTH-LyC: Investigating the Role of Galaxy Mergers in a Strong Lyman Continuum Leaker at $z=2.39$",
      "authors": [
        "Shengzhe Wang",
        "Xin Wang",
        "Matthew A. Malkan",
        "Harry I. Teplitz",
        "Rebecca L. Davies",
        "Karl Glazebrook",
        "Keunho J. Kim",
        "Themiya Nanayakkara",
        "Hang Zhou",
        "Yiming Yang",
        "Chao-Wei Tsai",
        "Yuxuan Pang",
        "Zheng Cai",
        "Xiaohui Fan",
        "Alaina Henry",
        "Zihao Li",
        "Dong Dong Shi",
        "Xian Zhong Zheng",
        "Zhiyu Yan"
      ],
      "abstract": "MAMMOTH-LyC: Investigating the Role of Galaxy Mergers in a Strong Lyman Continuum Leaker at $z=2.39$ Shengzhe Wang, Xin Wang, Matthew A. Malkan, Harry I. Teplitz, Rebecca L. Davies, Karl Glazebrook, Keunho J. Kim, Themiya Nanayakkara, Hang Zhou, Yiming Yang, Chao-Wei Tsai, Yuxuan Pang, Zheng Cai, Xiaohui Fan, Alaina Henry, Zihao Li, Dong Dong Shi, Xian Zhong Zheng, Zhiyu Yan 18 pages, 6 figures, 4 tables, submitted Astrophysics of Galaxies (astro-ph.GA) The MAMMOTH-LyC survey is a cycle 30 Hubble Space Telescope (HST) medium program obtaining 18-orbit-deep WFC3/UVIS F225W imaging in two massive galaxy protocluster fields at $z\\sim2.2$. We introduce this survey by reporting the discovery of J1244-LyC1, a strong Lyman continuum (LyC) leaker at $z = 2.39$, exhibiting clear merger signatures. J1244-LyC1 has a highly significant ($10\\sigma$) LyC detection, corresponding to an absolute escape fraction of $f_{\\mathrm{esc}} \\! =\\!36\\%\\pm4\\%$ ($1\\sigma$). The LyC emission is spatially resolved into multiple peaks that coincide with the system's disturbed morphology, confirming genuine multi-site LyC leakage. With a stellar mass of $10^{10.2}{M_\\odot}$, J1244-LyC1 is both the first confirmed high-redshift LyC-leaking merger and the most massive LyC emitter known to date. We interpret J1244-LyC1 as a merger-driven starburst system in which tidal interactions have disrupted the interstellar medium, creating multiple low-column-density pathways that facilitate LyC escape. This discovery provides the first direct evidence of spatially resolved LyC escape in a merging system, offering new insight into the potential role of major mergers in driving the cosmic reionization.",
      "pdf_url": "https://arxiv.org/pdf/2512.23202.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23311",
      "title": "The Dependence of the Extinction Coefficient on Reddening for Galactic Cepheids",
      "authors": [
        "Huajian Wang",
        "Xiaodian Chen",
        "Shu Wang"
      ],
      "abstract": "The Dependence of the Extinction Coefficient on Reddening for Galactic Cepheids Huajian Wang, Xiaodian Chen, Shu Wang 9 pages, 4 figures, 1 table, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Cepheids are fundamental distance indicators, playing a crucial role not only in the cosmic distance ladder but also in mapping the structure, kinematics, and extinction properties of the Milky Way. Using high-precision photometry and parallaxes from $Gaia$, we identify a significant anti-correlation between the $G$-band extinction coefficient and reddening for Galactic Cepheids, quantified as $R_G = 1.921 \\pm 0.060 - (0.107 \\pm 0.022)\\,E(G_{\\mathrm{BP}} - G_{\\mathrm{RP}})$. We propose that this anti-correlation is partly driven by the pronounced non-linear effects inherent to the broad $Gaia$ bands, while the remaining part arise from the $R_V$ variations caused by diverse interstellar medium. Adopting a fixed $R_G$ would not only lead to an overestimation of the metallicity dependence of Cepheid luminosities, but also systematically underestimate the distances to highly reddened Cepheids. Moreover, the strong reddening dependence of $R_G$ makes Wesenheit function based on it unsuitable for highly reddened Cepheids, since the definition of Wesenheit magnitudes requires a fixed extinction coefficient. In contrast, infrared-based distances, being less affected by non-linear effects and insensitive to $R_V$, provide the most reliable Cepheid distances at present. This work emphasizes the importance of accurately determining $R_V$ for Galactic Cepheids and accounting for non-linear effects in distance measurements, particularly in the optical bands.",
      "pdf_url": "https://arxiv.org/pdf/2512.23311.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23384",
      "title": "SiO emission in the filamentary Infrared Dark Cloud G035.39-00.33: An ALMA view",
      "authors": [
        "Rong Liu",
        "Izaskun Jiménez-Serra",
        "Giuliana Cosentino",
        "Jonathan C. Tan",
        "Ashley Thomas Barnes",
        "Francesco Fontani",
        "Paola Caselli",
        "Antonio Martínez-Henares",
        "Chi-Yan Law",
        "Jonathan D. Henshaw",
        "Tie Liu"
      ],
      "abstract": "SiO emission in the filamentary Infrared Dark Cloud G035.39-00.33: An ALMA view Rong Liu, Izaskun Jiménez-Serra, Giuliana Cosentino, Jonathan C. Tan, Ashley Thomas Barnes, Francesco Fontani, Paola Caselli, Antonio Martínez-Henares, Chi-Yan Law, Jonathan D. Henshaw, Tie Liu Accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) Filamentary infrared dark clouds (IRDCs) are believed to represent the initial conditions for massive star and cluster formation. We investigate the IRDC G035.39-00.33 using SiO, H13CO+, CH3OH, and CS emission observed with ALMA at 3.5\\arcsec\\ resolution (0.05 pc). The SiO emission traces shock activity within the cloud, providing insights into current star formation and cloud formation mechanisms. We identify several regions with broad SiO emission clearly associated with outflows, pinpointing the locations of ongoing star formation across the cloud. The ALMA images also reveal a series of spatially extended SiO emission spots with narrow line profiles, aligned along an arc-like path that is also seen in CS and CH3OH emission. While the broad SiO emission is mainly associated with the main cloud filament, as seen in visual extinction, the narrow SiO arch is located at the edge of the cloud, far from the identified sites of star formation activity. The presence of these arc-like morphologies suggests that large-scale shocks may have compressed the gas in the surroundings of the G035.39-00.33 cloud, shaping its filamentary structure. By inspecting the large-scale radio continuum emission around G035.39-00.33, we find that this IRDC is part of a larger star-forming complex where the densest and coolest material appears at the interacting regions between a Supernova Remnant (SNR) and an expanding HII region. In particular, we hypothesize that this IRDC may be spatially coincident with the ionized expanding gas associated with the previously identified SNR G35.6-0.4. We suggest that collisions between giant molecular clouds and expanding gas flows from interacting SNRs and HII regions may be responsible for the observed arc-like structures. Such shock compressions could play an important role in the formation of IRDCs and in the potential triggering of star formation.",
      "pdf_url": "https://arxiv.org/pdf/2512.23384.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23452",
      "title": "Detections of Compact Radio Continuum toward Methanol Maser Rings Using the VLA",
      "authors": [
        "Anna Bartkiewicz",
        "Olga Bayandina",
        "Alberto Sanna",
        "Marian Szymczak",
        "Luca Moscadelli",
        "Agnieszka Kobak",
        "Huib Jan van Langevelde",
        "Ashwin Varma"
      ],
      "abstract": "Detections of Compact Radio Continuum toward Methanol Maser Rings Using the VLA Anna Bartkiewicz, Olga Bayandina, Alberto Sanna, Marian Szymczak, Luca Moscadelli, Agnieszka Kobak, Huib Jan van Langevelde, Ashwin Varma The Astrophysical Journal, Volume 995, 2025, Issue 2, id.176, 16 pp Astrophysics of Galaxies (astro-ph.GA) High-mass protostars are deeply embedded in dust inside their natal cores and are not easily detectable. However, maser emission at centimeter wavelengths, owing to its high brightness, enables us to study gas kinematics in protostars' circumstellar regions. We aim to understand the origin of the ring-like structures outlined by the 6.7 GHz methanol maser emission in six high-mass young stellar objects by performing a sensitive search of the associated radio-continuum emission and derive its properties. We used the Karl G. Jansky Very Large Array in the A configuration at C and K bands in order to image radio-continuum as well as 6.7 GHz methanol and 22 GHz water maser emission. We present the first images of the thermal jets towards four targets in our sample, G23.389+00.185, G23.657-00.127, G28.817+00.365, and G30.400-00.296. In a further target, G23.207-00.377, the complex K band continuum emission makes it unclear whether the detected peaks trace jet knots from a single young protostar or mark multiple compact young protostars. The remaining source G31.047+00.356 shows radio continuum emission associated with an evolved H II region.",
      "pdf_url": "https://arxiv.org/pdf/2512.23452.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22354",
      "title": "Water Production of Interstellar Comet 3I/ATLAS from SOHO/SWAN Observations after Perihelion",
      "authors": [
        "M.R.Combi",
        "T. Mâkinen",
        "J.-L. Bertaux",
        "E. Quemerais",
        "S. Ferron",
        "R. Lallement",
        "W. Schmidt"
      ],
      "abstract": "Water Production of Interstellar Comet 3I/ATLAS from SOHO/SWAN Observations after Perihelion M.R.Combi, T. Mâkinen, J.-L. Bertaux, E. Quemerais, S. Ferron, R. Lallement, W. Schmidt The Astrophysical Journal Letters (submitted), 14 pages, 1 Figure, 1 Table, Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The Solar Wind ANisotropies (SWAN) all-sky hydrogen Lyman-alpha camera on the Solar and Heliosphere Observatory (SOHO) observed the hydrogen coma of interstellar comet 3I/ATLAS, also called C/2025 N1 (ATLAS), beginning on November 6, 2025, 9 days after perihelion. Water production rates were calculated from each image of 3I/ATLAS using the methodology of Mäkinen & Combi (2005, Icarus 177, 217) and fluorescence rates calculated using the daily solar Lyman-alpha fluxes from the LASP database corrected for solar rotation. The method has been used for over 90 comet apparitions (Combi 2022; Combi et al 2019). A water production rate of 3.17 x 10^29 s^-1 was found on November 6 when the comet was at a heliocentric distance of 1.40 au and at a sufficient solar elongation angle. It decreased over time after that, down to 1-2 x 10^28 s^-1 around 40 days post-perihelion (December 8).",
      "pdf_url": "https://arxiv.org/pdf/2512.22354.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22365",
      "title": "Interstellar Interloper 3I/ATLAS: Nucleus Size, Photometry in RGB, Af(rho) and Antitail Structure Analysis",
      "authors": [
        "Toni Scarmato"
      ],
      "abstract": "Interstellar Interloper 3I/ATLAS: Nucleus Size, Photometry in RGB, Af(rho) and Antitail Structure Analysis Toni Scarmato Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Interstellar comet 3I/ATLAS (C/2025 N1) exhibits an unusual, tightly collimated dust feature in the sunward hemisphere which has been widely described as an anti-tail. At the same time, precise constraints on the nucleus size have been derived from a combination of high-resolution imaging and non-gravitational dynamics. In this work I present a unified analysis that combines existing constraints on the nucleus radius with new ground-based RGB imaging of the dust anti-tail obtained with a 0.25 m telescope at the Toni Scarmato Astronomical Observatory (MPC L92).",
      "pdf_url": "https://arxiv.org/pdf/2512.22365.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22566",
      "title": "Starkindler: An Uncertainty Aware Objective for Photometric Redshift Estimation",
      "authors": [
        "Raahul Singh",
        "Ashutosh Pandey"
      ],
      "abstract": "Starkindler: An Uncertainty Aware Objective for Photometric Redshift Estimation Raahul Singh, Ashutosh Pandey Code available at this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) Photometric Redshift is critical for analyzing astronomical objects, but existing ML methods often overlook the aleatoric uncertainties inherent in observed data. We introduce Starkindler, a novel training objective that explicitly incorporates observational errors into the model's objective function, thereby directly accounting for aleatoric uncertainty. Unlike traditional probabilistic models that focus solely on epistemic uncertainty, Starkindler provides uncertainty estimates that are regularised by aleatoric uncertainty, and is designed to be more interpretable. We train a simple convolutional neural network (CNN) using data from Sloan Digital Sky Survey (SDSS) and compare against the Photometric redshift estimates provided by SDSS. We show improvements in accuracy, calibration and reduction in predicted outlier rate. We also conduct an ablation study which confirms that excluding observational errors significantly degrades model performance, underscoring the importance of accounting for aleatoric uncertainty. Our results suggest that Starkindler not only enhances predictive performance but also provides interpretable uncertainty estimates, making it a robust tool for astronomical data analysis.",
      "pdf_url": "https://arxiv.org/pdf/2512.22566.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23451",
      "title": "On Systematic Errors in Cross-Identification of Binary Stars in Gaia",
      "authors": [
        "E. Malik",
        "P. Kaigorodov",
        "D. Kovaleva",
        "O. Malkov"
      ],
      "abstract": "On Systematic Errors in Cross-Identification of Binary Stars in Gaia E. Malik, P. Kaigorodov, D. Kovaleva, O. Malkov Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Using Gaia DR3 data, binary star catalogs have been created containing information on a total of more than 2.6 million pairs. This increases by more than an order of magnitude the ensemble of binary stars with known characteristics, which previously numbered about 140 thousand pairs. To perform statistical analysis of the complete ensemble of binary stars, including both previously known and newly discovered pairs, cross-identification by coordinates was carried out between the most complete pre-Gaia publication compilative binary star catalog ILB and data from binary star catalogs based on Gaia DR3 results. An analysis of the results of this identification was performed, showing the dependence of its characteristics both on the data from the source catalogs and on coordinates. It is shown that in dense stellar fields, particularly in the Galactic disk, an increase in the fraction of false positive identifications can be expected. At the same time, for systems with large proper motion, there is a high probability of a false negative outcome. Possible modifications to the identification method are proposed to reduce the role of the described systematic errors and increase the reliability of its results.",
      "pdf_url": "https://arxiv.org/pdf/2512.23451.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23691",
      "title": "Galaxy Zoo Evo: 1 million human-annotated images of galaxies",
      "authors": [
        "Mike Walmsley",
        "Steven Bamford",
        "Hugh Dickinson",
        "Tobias Géron",
        "Alexander J. Gordon",
        "Annette M.N. Ferguson",
        "Lucy Fortson",
        "Sandor Kruk",
        "Natalie Lines",
        "Chris J. Lintott",
        "Karen L. Masters",
        "Robert G. Mann",
        "James Pearson",
        "Hayley Roberts",
        "Anna M.M. Scaife",
        "Stefan Schuldt",
        "Brooke Simmons",
        "Rebecca Smethurst",
        "Josh Speagle",
        "Kyle Willett"
      ],
      "abstract": "Galaxy Zoo Evo: 1 million human-annotated images of galaxies Mike Walmsley, Steven Bamford, Hugh Dickinson, Tobias Géron, Alexander J. Gordon, Annette M.N. Ferguson, Lucy Fortson, Sandor Kruk, Natalie Lines, Chris J. Lintott, Karen L. Masters, Robert G. Mann, James Pearson, Hayley Roberts, Anna M.M. Scaife, Stefan Schuldt, Brooke Simmons, Rebecca Smethurst, Josh Speagle, Kyle Willett Submitted to NeurIPS Datasets and Benchmarks 2025. Positive reviews but rejected by AC; see OpenReview Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) We introduce Galaxy Zoo Evo, a labeled dataset for building and evaluating foundation models on images of galaxies. GZ Evo includes 104M crowdsourced labels for 823k images from four telescopes. Each image is labeled with a series of fine-grained questions and answers (e.g. \"featured galaxy, two spiral arms, tightly wound, merging with another galaxy\"). These detailed labels are useful for pretraining or finetuning. We also include four smaller sets of labels (167k galaxies in total) for downstream tasks of specific interest to astronomers, including finding strong lenses and describing galaxies from the new space telescope Euclid. We hope GZ Evo will serve as a real-world benchmark for computer vision topics such as domain adaption (from terrestrial to astronomical, or between telescopes) or learning under uncertainty from crowdsourced labels. We also hope it will support a new generation of foundation models for astronomy; such models will be critical to future astronomers seeking to better understand our universe.",
      "pdf_url": "https://arxiv.org/pdf/2512.23691.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.04683",
      "title": "Probing the Cosmic Reionization History with JWST: Gunn-Peterson and Ly$α$ Damping Wing Absorption at $4.5 < z < 13$",
      "authors": [
        "Hiroya Umeda",
        "Masami Ouchi",
        "Yuta Kageura",
        "Yuichi Harikane",
        "Minami Nakane",
        "Tran Thi Thai",
        "Kimihiko Nakajima"
      ],
      "abstract": "Probing the Cosmic Reionization History with JWST: Gunn-Peterson and Ly$α$ Damping Wing Absorption at $4.5 < z < 13$ Hiroya Umeda, Masami Ouchi, Yuta Kageura, Yuichi Harikane, Minami Nakane, Tran Thi Thai, Kimihiko Nakajima Accepted for Publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We present a statistical analysis of Ly$\\alpha$ absorption using 581 galaxies at $z=4.5$--13 observed with multiple JWST/NIRSpec spectroscopy programs, including JADES, UNCOVER, CEERS, and GO/DDT. We carefully construct composite spectra binned by redshift with homogeneous UV properties (UV magnitudes, UV slopes, and Ly$\\alpha$ equivalent widths) and identify significant Ly$\\alpha$ forest signals in galaxies at $z\\sim5$--6, which diminish toward higher redshifts. We also find UV continuum breaks at rest-frame 1216 Å that soften beyond $z\\gtrsim6$, confirming the effects of cosmic reionization through a self-consistent transition from Gunn-Peterson to Ly$\\alpha$ damping wing absorption in galaxies. Fair comparisons of composite spectra with matched UV magnitudes and slopes across redshift reveal that UV-faint galaxies clearly show stronger Ly$\\alpha$ absorption than UV-bright galaxies towards high redshift, providing insights into the topological evolution of reionization. We estimate Ly$\\alpha$ transmission at the Gunn-Peterson trough and Ly$\\alpha$ damping wing absorption by comparing the galaxy spectra to low-$z$ ($z\\sim2$-5) galaxy templates that include galactic and circumgalactic absorption and Ly$\\alpha$ emission. Using these measurements together with reionization simulations, we derive volume average neutral hydrogen fractions of $\\langle x_{\\rm HI} \\rangle$ = ${0.00}^{+0.12}_{-0.00}$, ${0.25}^{+0.10}_{-0.20}$, ${0.65}^{+0.27}_{-0.35}$, ${1.00}^{+0.00}_{-0.20}$, and ${1.00}^{+0.00}_{-0.40}$ at $z\\sim5$, 6, 7, 9, and 10, respectively. These values broadly align with a reionization history characterized by a rapid transition around $z\\sim7$--8, consistent with Ly$\\alpha$ emitter observations. While the physical driver of this rapid reionization remains unclear, it may involve the emergence of hidden AGN populations and/or the onset of Lyman-continuum escape from galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2504.04683.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.21187",
      "title": "A joint JWST and HST view of Omega Centauri: Multiple stellar populations and their kinematics",
      "authors": [
        "T. Ziliotto",
        "A. P. Milone",
        "G. Cordoni",
        "A. F. Marino",
        "M. V. Legnardi",
        "E. Dondoglio",
        "E. Bortolan",
        "F. Muratore"
      ],
      "abstract": "A joint JWST and HST view of Omega Centauri: Multiple stellar populations and their kinematics T. Ziliotto, A. P. Milone, G. Cordoni, A. F. Marino, M. V. Legnardi, E. Dondoglio, E. Bortolan, F. Muratore Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We combine F115W and F277W images collected with the Near Infrared Camera of the James Webb Space Telescope (JWST) with multi-band, multi-epoch Hubble Space Telescope (HST) observations of Omega Centauri to investigate its multiple stellar populations and internal kinematics. Our study focuses on a region spanning $\\sim$0.9 to $\\sim$2.3 half-light radii from the cluster center, largely unexplored by HST and JWST. Using chromosome maps, we identify the principal populations along the upper main sequence and among M-dwarfs, distinguishing lower-stream (LS) stars, chemically akin to first-generation globular cluster stars with similar metallicities, and upper-stream (US) stars, enriched in helium and nitrogen but oxygen-poor. Both streams also host subpopulations with varying metallicities. We find radially anisotropic motions, with US stars exhibiting significantly stronger anisotropy than LS stars. Subdividing the US into extreme and intermediate light-element populations reveals a gradient in anisotropy, with intermediate stars lying between the LS and extreme US populations. However, metal-rich and metal-poor stars within each stream show moderate kinematic differences. The LS stars show higher angular momentum and dispersion compared to US stars, and also exhibit stronger systemic rotation and tangential proper-motion skewness, further highlighting their kinematic divergence. Finally, leveraging a mass range of $\\sim$0.15 - 0.7 solar masses, we detect a low degree of energy equipartition for all cluster stars, which decreases with radial distance from the cluster center.",
      "pdf_url": "https://arxiv.org/pdf/2506.21187.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03248",
      "title": "Alpha effect and dynamo in density-stratified turbulence with large-scale shear: applications to protoplanetary discs and astrophysical clouds",
      "authors": [
        "Igor Rogachevskii",
        "Nathan Kleeorin"
      ],
      "abstract": "Alpha effect and dynamo in density-stratified turbulence with large-scale shear: applications to protoplanetary discs and astrophysical clouds Igor Rogachevskii, Nathan Kleeorin 15 pages, this http URL, revised paper Astrophysics of Galaxies (astro-ph.GA); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) A joint effect of the density-stratified turbulence (or inhomogeneous turbulence) and a large-scale shear for arbitrary Mach numbers results in the $\\alpha$ effect and mean-field dynamo action. These effects also produce the effective pumping velocity of a large-scale magnetic field. Compressibility of the turbulent velocity field (i.e., finite Mach number effects) does not affect the contributions to the $\\alpha$ tensor caused by the joint effect of inhomogeneity of turbulence and a large-scale shear. The isotropic part of the $\\alpha$ tensor is independent of the exponent of the turbulent kinetic energy spectrum. There is also an additional contribution to the effective pumping velocity of the mean magnetic field that is proportional to the product of the fluid density gradient and the divergence of the mean fluid velocity caused, e.g., by collapsing (or expanding) astrophysical clouds. Applications of these effects to protoplanetary discs, proto-galactic and proto-stellar clouds are discussed.",
      "pdf_url": "https://arxiv.org/pdf/2509.03248.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.03466",
      "title": "VLA FRAMEx. III. Circumnuclear Radio Emission Mechanisms in Hard X-ray Selected Active Galactic Nuclei",
      "authors": [
        "Andrew J. Sargent",
        "Alexander J. van der Horst",
        "Megan C. Johnson",
        "Travis C. Fischer",
        "Nathan J. Secrest",
        "Onic I. Shuvo",
        "Macon A. Magno",
        "Luis C. Fernandez"
      ],
      "abstract": "VLA FRAMEx. III. Circumnuclear Radio Emission Mechanisms in Hard X-ray Selected Active Galactic Nuclei Andrew J. Sargent, Alexander J. van der Horst, Megan C. Johnson, Travis C. Fischer, Nathan J. Secrest, Onic I. Shuvo, Macon A. Magno, Luis C. Fernandez 22 pages, 5 figures, 5 tables. Accepted in ApJ Astrophysics of Galaxies (astro-ph.GA) We present Stokes I continuum analysis for a volume-limited sample ($<40~\\rm{Mpc}$) of hard X-ray selected active galactic nuclei (AGNs) using $4-12$ GHz observations with the Karl G. Jansky Very Large Array (VLA). All of the 25 sources analyzed here have previously been observed with the Very Long Baseline Array (VLBA) to probe their subparsec projected physical scales, but detected emission has only been measured for 12 of the sources at $C$ band (4.4 GHz), despite expectations. We determined that coronal emission is unlikely to be a dominant emission mechanism for the sources not detected by the VLBA, and the emission measured with the VLA is likely produced beyond parsec spatial scales. We also explore potential radiation mechanisms for the circumnuclear radio emission that is produced beyond the observable ~parsec physical scales probed with the VLBA but within the $\\leq30-110$ parsec spatial scales observed with the VLA. From an energetics perspective, we find that all targets have extranuclear radio emission that is compatible with AGN winds, assuming a maximum of 10% of the bolometric output can supply the mechanical energy observed. We also find that the excess emission is likely too strong for star formation alone when compared to results from optical spectroscopy, but may contribute in smaller capacities.",
      "pdf_url": "https://arxiv.org/pdf/2509.03466.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.16111",
      "title": "The ALPINE-CRISTAL-JWST Survey: JWST/IFU Optical Observations for 18 Main-Sequence Galaxies at z=4-6",
      "authors": [
        "A. L. Faisst",
        "S. Fujimoto",
        "A. Tsujita",
        "W. Wang",
        "N. Nezhad",
        "F. Loiacono",
        "H. Übler",
        "M. Béthermin",
        "P. Cassata",
        "M. Dessauges-Zavadsky",
        "R. Herrera-Camus",
        "D. Schaerer",
        "J. Silverman",
        "L. Yan",
        "M. Aravena",
        "I. De Looze",
        "N. M. Förster Schreiber",
        "J. González-López",
        "J. Spilker",
        "K. Tadaki",
        "C. M. Casey",
        "M. Franco",
        "S. Harish",
        "H. J. McCracken",
        "J. S. Kartaltepe",
        "A. M. Koekemoer",
        "A. A. Khostovan",
        "D. Liu",
        "J. Rhodes",
        "B. E. Robertson",
        "R. Amorin",
        "R. J. Assef",
        "A. J. Battisti",
        "J. E. Birkin",
        "M. Boquien",
        "E. Da Cunha",
        "P. Dam",
        "R. L. Davies",
        "D. A. Gómez-Espinoza",
        "A. Ferrara",
        "Y. Fudamoto",
        "S. Gillman",
        "M. Ginolfi",
        "G. Gozaliasl",
        "C. Gruppioni",
        "A. Hadi",
        "N. Hathi",
        "E. Ibar",
        "R. Ikeda",
        "H. Inami",
        "G. C. Jones",
        "M. Kohandel",
        "Y. Li",
        "Y-H. Lin",
        "Z. Liu",
        "L-J. Liu",
        "A. S. Long",
        "G. Magdis",
        "C. Maraston",
        "C. L. Martin",
        "I. Mitsuhashi",
        "B. Mobasher",
        "J. Molina",
        "A. Nanni",
        "M. Palla",
        "A. Pallottini",
        "F. Pozzi",
        "M. Relano",
        "W. Ren",
        "D. A. Riechers",
        "M. Romano",
        "D. B. Sanders",
        "P. Sawant",
        "M. Shuntov",
        "R. Smit",
        "L. Sommovigo",
        "M. Talia",
        "L. Vallini",
        "E. Veraldi",
        "D. Vergani",
        "A. P. Vijayan",
        "V. Villanueva",
        "G. Zamorani"
      ],
      "abstract": "The ALPINE-CRISTAL-JWST Survey: JWST/IFU Optical Observations for 18 Main-Sequence Galaxies at z=4-6 A. L. Faisst, S. Fujimoto, A. Tsujita, W. Wang, N. Nezhad, F. Loiacono, H. Übler, M. Béthermin, P. Cassata, M. Dessauges-Zavadsky, R. Herrera-Camus, D. Schaerer, J. Silverman, L. Yan, M. Aravena, I. De Looze, N. M. Förster Schreiber, J. González-López, J. Spilker, K. Tadaki, C. M. Casey, M. Franco, S. Harish, H. J. McCracken, J. S. Kartaltepe, A. M. Koekemoer, A. A. Khostovan, D. Liu, J. Rhodes, B. E. Robertson, R. Amorin, R. J. Assef, A. J. Battisti, J. E. Birkin, M. Boquien, E. Da Cunha, P. Dam, R. L. Davies, D. A. Gómez-Espinoza, A. Ferrara, Y. Fudamoto, S. Gillman, M. Ginolfi, G. Gozaliasl, C. Gruppioni, A. Hadi, N. Hathi, E. Ibar, R. Ikeda, H. Inami, G. C. Jones, M. Kohandel, Y. Li, Y-H. Lin, Z. Liu, L-J. Liu, A. S. Long, G. Magdis, C. Maraston, C. L. Martin, I. Mitsuhashi, B. Mobasher, J. Molina, A. Nanni, M. Palla, A. Pallottini, F. Pozzi, M. Relano, W. Ren, D. A. Riechers, M. Romano, D. B. Sanders, P. Sawant, M. Shuntov, R. Smit, L. Sommovigo, M. Talia, L. Vallini, E. Veraldi, D. Vergani, A. P. Vijayan, V. Villanueva, G. Zamorani 21 pages, 21 figures, 5 tables. Accepted by ApJS Astrophysics of Galaxies (astro-ph.GA) To fully characterize the formation and evolution of galaxies, we need to observe their stars, gas, and dust on resolved spatial scales. We present the ALPINE-CRISTAL-JWST survey, which combines kpc-resolved imaging and spectroscopy from HST, JWST, and ALMA for 18 representative main-sequence galaxies at z=4-6 and log(M/$M_\\odot$) > 9.5 to study their star formation, chemical properties, and extended gas reservoirs. The co-spatial measurements resolving the ionized gas, molecular gas, stars, and dust on 1-2 kpc scales make this a unique benchmark sample for the study of galaxy formation and evolution at $z\\sim5$, connecting the Epoch of Reionization with the cosmic noon. In this paper, we outline the survey goals and sample selection, and present a summary of the available data for the 18 galaxies. In addition, we measure spatially integrated quantities (such as global gas metallicity), test different star formation rate indicators, and quantify the presence of H$\\alpha$ halos. Our targeted galaxies are relatively metal rich (10-70% solar), complementary to JWST samples at lower stellar mass, and there is broad agreement between different star formation indicators. One galaxy has the signature of an active galactic nuclei (AGN) based on its emission line ratios. Six show broad H$\\alpha$~emission suggesting type 1 AGN candidates. We conclude with an outlook on the exciting science that will be pursued with this unique sample in forthcoming papers.",
      "pdf_url": "https://arxiv.org/pdf/2510.16111.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21674",
      "title": "A systematic study on the aromatic and aliphatic hydrocarbon emission features of nearby galaxies using AKARI near-IR spectra",
      "authors": [
        "Tsubasa Kondo",
        "Hidehiro Kaneda",
        "Shinki Oyabu",
        "Takuma Kokusho",
        "Toyoaki Suzuki",
        "Risako Katayama",
        "Eiko Kozaki",
        "Itsuka Yachi",
        "Keita Yoshida",
        "Shohei Ono"
      ],
      "abstract": "A systematic study on the aromatic and aliphatic hydrocarbon emission features of nearby galaxies using AKARI near-IR spectra Tsubasa Kondo, Hidehiro Kaneda, Shinki Oyabu, Takuma Kokusho, Toyoaki Suzuki, Risako Katayama, Eiko Kozaki, Itsuka Yachi, Keita Yoshida, Shohei Ono 14 pages, 13 figures, accepted for publication in PASJ Astrophysics of Galaxies (astro-ph.GA) Interstellar hydrocarbon dust containing aromatic and aliphatic hydrocarbons, like polycyclic aromatic hydrocarbons (PAHs), is believed to be processed by various factors including UV radiation fields and mechanical shocks in the galactic environments. We systematically investigate the processing of hydrocarbon dust, especially the likely causes for the variations of the luminosity ratio of aliphatic to aromatic hydrocarbon emission features, using the near-infrared (IR) spectral features at wavelengths 3.3 um and 3.4-3.6 um observed with AKARI/IRC. We analyzed 243 near-IR spectra of 240 star-forming (U)LIRGs (the total IR luminosity, $L_\\rm{IR}>10^{11}\\ L_\\odot$), 119 spectra of 105 star-forming IRGs ($10^{10}\\ L_\\odot<L_\\rm{IR}<10^{11}\\ L_\\odot$), and 94 spectra of 65 sub-IRGs ($L_\\rm{IR}<10^{10}\\ L_\\odot$), in addition to 232 spectra of 36 Galactic HII regions as a reference sample. We performed near-IR spectral model fitting to estimate the luminosities of the aromatic and aliphatic hydrocarbon features and the HI recombination line Br$\\rm{\\alpha}$. The result indicates that the luminosity ratios of the aliphatic to the aromatic hydrocarbons ($L_\\rm{ali}/L_\\rm{aro}$) in the sample galaxies show considerably large variations, compared to those in the Galactic HII regions, $L_\\rm{ali}/L_\\rm{aro}$ systematically decreasing with $L_\\rm{IR}$ and $L_\\rm{Br\\alpha}$. We find that (sub-)IRGs with continuum colors bluer at 4 um tend to have higher $L_\\rm{ali}/L_\\rm{aro}$, which is likely to reflect the intrinsic nature of PAHs outside the HII region where the PAHs remain non-processed by strong UV radiation fields. We also find that some ULIRGs with continuum colors redder at 4 um show extremely low $L_\\rm{ali}/L_\\rm{aro}$, which is likely to be caused by blending aliphatic emission and absorption features due to the presence of an obscured galactic nucleus in merger systems.",
      "pdf_url": "https://arxiv.org/pdf/2512.21674.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.15898",
      "title": "A Generative Model for Disentangling Galaxy Photometric Parameters",
      "authors": [
        "Keen Leung",
        "Colen Yan",
        "Jun Yin"
      ],
      "abstract": "A Generative Model for Disentangling Galaxy Photometric Parameters Keen Leung, Colen Yan, Jun Yin Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Artificial Intelligence (cs.AI) Ongoing and future photometric surveys will produce unprecedented volumes of galaxy images, necessitating robust, efficient methods for deriving galaxy morphological parameters at scale. Traditional approaches, such as parametric light-profile fitting, offer valuable insights but become computationally prohibitive when applied to billions of sources. In this work, we propose a Conditional AutoEncoder (CAE) framework to simultaneously model and characterize galaxy morphology. Our CAE is trained on a suite of realistic mock galaxy images generated via GalSim, encompassing a broad range of galaxy types, photometric parameters (e.g., flux, half-light radius, Sersic index, ellipticity), and observational conditions. By encoding each galaxy image into a low-dimensional latent representation conditioned on key parameters, our model effectively recovers these morphological features in a disentangled manner, while also reconstructing the original image. The results demonstrate that the CAE approach can accurately and efficiently infer complex structural properties, offering a powerful alternative to existing methods.",
      "pdf_url": "https://arxiv.org/pdf/2507.15898.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22341",
      "title": "On the origin of sinusoidal brightness variations in F to O-type stars through radial velocities",
      "authors": [
        "E. Šipková",
        "M. Skarka",
        "M. Vaňko",
        "V. Chmelař",
        "T. Pribulla",
        "Z. Mikulášek"
      ],
      "abstract": "On the origin of sinusoidal brightness variations in F to O-type stars through radial velocities E. Šipková, M. Skarka, M. Vaňko, V. Chmelař, T. Pribulla, Z. Mikulášek Solar and Stellar Astrophysics (astro-ph.SR) Stellar variability may originate from various phenomena such as binarity, pulsations, or rotation. These mechanisms can induce flux variations of similar magnitudes, shapes, and periods. We aim to determine mechanisms responsible for the sinusoidal variations in main-sequence stars hotter than 6500 K. We conducted our analysis using TESS long-cadence data complemented with high-resolution spectra from three spectrographs. From the initial sample of almost 46000 objects, we selected 35 targets for spectroscopic follow-up. Comparison of light curves and radial velocity curves allowed for robust classification of these targets. Among the 35 selected objects, 18 displayed variability, suggesting the presence of a companion (including the discovery of 7 new binary systems and 1 candidate for a triple-star system), 1 was identified as a new pulsator, 9 as new candidates for spotted stars, and 7 objects had uncertain classification. Our analysis shows that at least half of randomly selected stars with sinusoidal brightness variations are binaries. The presented results illustrate the need for an individual approach to stellar classification, especially in cases where the photometric data alone is insufficient for determining the underlying phenomena behind the observed variations.",
      "pdf_url": "https://arxiv.org/pdf/2512.22341.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22379",
      "title": "Simulations of facular magnetic fields on cool stars I: Main sequence stars with solar metallicity",
      "authors": [
        "Tanayveer Singh Bhatia",
        "Robert H. Cameron",
        "Sami K. Solanki",
        "Damien F. Przybylski",
        "Veronika Witzke",
        "Alexander Shapiro",
        "Nadiia Kostogryz"
      ],
      "abstract": "Simulations of facular magnetic fields on cool stars I: Main sequence stars with solar metallicity Tanayveer Singh Bhatia, Robert H. Cameron, Sami K. Solanki, Damien F. Przybylski, Veronika Witzke, Alexander Shapiro, Nadiia Kostogryz 16 pages, 19 figures, accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) Stellar convection in the presence of magnetic field affects the emergent intensity, as well as the structure and evolution of cool main-sequence dwarfs. We aim to understand the effect of faculae-like field strengths on near-surface stellar convection using 3D radiative MHD simulations of near-surface magneto-convection. We compare simulations of F, G, K and M main-sequence stars with a small-scale dynamo (SSD) to faculae-like spatially averaged field strengths (from 100 to 500 G). We focus on the effect of imposed magnetic field on the thermodynamic stratification and velocities, along with the bolometric intensity and surface field strength. Imposed magnetic fields result in reduced average density and gas pressure near the surface compared to the SSD simulations. The temperature stratification also shows a dip at and just below the stellar surface. The changes in average bolometric intensity are within a percent, with different trends with field strength for different stellar types. In addition, the convective velocities are reduced. The magnitude of changes in thermodynamic quantities are related to field strength as well as the stellar $T_{\\rm eff}$. Faculae-strength magnetic fields modify the near surface convection by reducing gas pressure and density as well as suppressing convection in regions with strong field concentrations. The strength of these effects depends on the stellar type.",
      "pdf_url": "https://arxiv.org/pdf/2512.22379.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22963",
      "title": "Impacts of the $^{16}$O($^{16}$O, n)$^{31}$S reaction rate on the evolution and nucleosynthesis in Pop III massive stars",
      "authors": [
        "Wenyu Xin",
        "Ken'ichi Nomoto",
        "Xianfei Zhang",
        "Shaolan Bi"
      ],
      "abstract": "Impacts of the $^{16}$O($^{16}$O, n)$^{31}$S reaction rate on the evolution and nucleosynthesis in Pop III massive stars Wenyu Xin, Ken'ichi Nomoto, Xianfei Zhang, Shaolan Bi Solar and Stellar Astrophysics (astro-ph.SR) We first present a systematic investigation into the effect of the $^{16}$O($^{16}$O, n)$^{31}$S reaction rate on the evolution and nucleosynthesis of Population III (Pop III) stars. We simulate the evolution of a 15 M$_\\odot$ Pop III star from the zero-age main sequence through to core collapse, while varying the $^{16}$O($^{16}$O, n)$^{31}$S reaction rate by factors of 0.1, 1, and 10. Our results demonstrate that increasing this reaction rate prompts earlier onset and extended duration of core oxygen burning at lower temperatures and densities. A higher reaction rate also increases neutron excess in OSi-rich layers, thereby promoting the synthesis of neutron-rich isotopes, particularly $^{31}$P and $^{39}$K. Most notably, the K yield is enhanced by a factor of 6.4. For a tenfold enhancement of the $^{16}$O($^{16}$O, n)$^{31}$S rate, the predicted [K/Ca] and [K/Fe] values from presupernova models reach 0.29 and 0.22 dex, respectively-values that are consistent with the most recent observational data for extremely metal-poor stars. These findings hold promise as a potential new solution to the problem of potassium underproduction and offer a valuable theoretical reference and motivation for subsequent measurements of oxygen fusion reaction rate.",
      "pdf_url": "https://arxiv.org/pdf/2512.22963.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23645",
      "title": "The 24 Aqr triple system: A closer look at its unique high-eccentricity hierarchical architecture",
      "authors": [
        "Ahmad Abushattal",
        "Mashhoor A. Al-Wardat",
        "Elliott P. Horch",
        "Nikolaos Georgakarakos",
        "Hatem A. Al-Ameryeen",
        "Enas M. Abu-Alrob",
        "Abdallah M. Hussein"
      ],
      "abstract": "The 24 Aqr triple system: A closer look at its unique high-eccentricity hierarchical architecture Ahmad Abushattal, Mashhoor A. Al-Wardat, Elliott P. Horch, Nikolaos Georgakarakos, Hatem A. Al-Ameryeen, Enas M. Abu-Alrob, Abdallah M. Hussein Published in Advances in Space Research Advances in Space Research, 2024, Volume 73, Issue 1, Pages 1170-1184 Solar and Stellar Astrophysics (astro-ph.SR) As its periastron passage occurred during the third quarter of 2020, system 24 Aqr is of particular significance. New visual solutions for the latest speckle interferometry observations collected by the Lowell Discovery Telescope (LTD) with its new QWSSI speckle camera are presented here. A variety of techniques were used to analyze the system, including ORBITX code for orbital solution, Al-Wardat's method for analyzing multiple stellar systems, and Edwards' method for analyzing visual and spectroscopic binaries. We derive precise masses and the complete set of its fundamental parameters for the three components, and we introduce a new orbital solution, and a new dynamical parallax, which is very close to the measured value given by Hipparcos 2007 and from that of Gaia DR2. In the next section, we discuss the possibility of a coplanar orbit. In conclusion, we demonstrate that we need a 65-m telescope to resolve the inner binary visually, although an array of telescopes could be used instead.",
      "pdf_url": "https://arxiv.org/pdf/2512.23645.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23138",
      "title": "Why Machine Learning Models Systematically Underestimate Extreme Values II: How to Fix It with LatentNN",
      "authors": [
        "Yuan-Sen Ting"
      ],
      "abstract": "Why Machine Learning Models Systematically Underestimate Extreme Values II: How to Fix It with LatentNN Yuan-Sen Ting 19 pages, 7 figures, submitted to OJAp Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR); Machine Learning (cs.LG); Machine Learning (stat.ML) Attenuation bias -- the systematic underestimation of regression coefficients due to measurement errors in input variables -- affects astronomical data-driven models. For linear regression, this problem was solved by treating the true input values as latent variables to be estimated alongside model parameters. In this paper, we show that neural networks suffer from the same attenuation bias and that the latent variable solution generalizes directly to neural networks. We introduce LatentNN, a method that jointly optimizes network parameters and latent input values by maximizing the joint likelihood of observing both inputs and outputs. We demonstrate the correction on one-dimensional regression, multivariate inputs with correlated features, and stellar spectroscopy applications. LatentNN reduces attenuation bias across a range of signal-to-noise ratios where standard neural networks show large bias. This provides a framework for improved neural network inference in the low signal-to-noise regime characteristic of astronomical data. This bias correction is most effective when measurement errors are less than roughly half the intrinsic data range; in the regime of very low signal-to-noise and few informative features. Code is available at this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2512.23138.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR",
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23378",
      "title": "Predicting the detection yields of giant planets and brown dwarfs with CSST astrometry",
      "authors": [
        "Yifan Xuan",
        "Fabo Feng",
        "Zhensen Fu",
        "Shilong Liao",
        "Zhaoxiang Qi",
        "Yang Chen"
      ],
      "abstract": "Predicting the detection yields of giant planets and brown dwarfs with CSST astrometry Yifan Xuan, Fabo Feng, Zhensen Fu, Shilong Liao, Zhaoxiang Qi, Yang Chen 18 pages, 8 figures, 2 tables; accepted for publication in the Astronomical Journal Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Chinese Space Station Telescope (CSST), which will begin its scientific operations around 2027, is going to survey the sky area of the median-to-high Galactic latitude and median-to-high ecliptic latitude. The high astrometric precision of the CSST Survey Camera for faint objects enables the detection of a number of giant planets and brown dwarfs around M-dwarfs and brown dwarfs via differential astrometry in its optical survey. In this paper, we predict the number of giant planets and brown dwarfs around stars and brown dwarfs detectable with CSST astrometry. We generate synthetic samples of CSST stellar and substellar sources, and carry out companion injection-recovery simulations in the samples using different occurrence rates for FGK-dwarfs, M-dwarfs, and brown dwarfs. We calculate companion yields based on CSST astrometric precision. Our analysis reveals that over its 10-year mission, the CSST Survey Camera could barely discover giant planets and low-mass BDs around FGK-dwarfs, but is projected to detect 20 - 170 giant planets and low-mass brown dwarfs around M-dwarfs within 300 pc, and 300 - 570 brown dwarf binaries within 600 pc. Therefore, CSST astrometry is likely to significantly increase the current sample of substellar companions around M-dwarfs and brown dwarfs. This sample will deepen our understanding of planet formation and evolution around low-mass stars and brown dwarfs.",
      "pdf_url": "https://arxiv.org/pdf/2512.23378.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23652",
      "title": "Precise Physical Parameters, Habitability, and Orbital Stability of Sun-like SB2 Systems: HD 130669, HD 184467, HD 191854, and HD 214222",
      "authors": [
        "Ahmad Abushattal",
        "Nikolaos Georgakarakos",
        "Mashhoor A. Al-Wardat",
        "Bilal Algnamat",
        "Hassan B. Haboubi",
        "Deshinta Arrova Dewi",
        "Enas M. Abu-Alrob",
        "Abdallah M. Hussein"
      ],
      "abstract": "Precise Physical Parameters, Habitability, and Orbital Stability of Sun-like SB2 Systems: HD 130669, HD 184467, HD 191854, and HD 214222 Ahmad Abushattal, Nikolaos Georgakarakos, Mashhoor A. Al-Wardat, Bilal Algnamat, Hassan B. Haboubi, Deshinta Arrova Dewi, Enas M. Abu-Alrob, Abdallah M. Hussein The Astronomical Journal, 2025, Volume 170, Issue 5, id.268, 15 pp Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) This work analyzes four Sun-like double-lined spectroscopic binary (SB2) systems by combining visual and spectroscopic observational data with Al-Wardat's atmospheric modeling method to accurately determine their fundamental parameters. For each system, we determine stellar masses, orbital parallaxes, effective temperatures, spectral types, semimajor axes, and eccentricities with high precision, resolving discrepancies between astrometric and spectroscopic measurements. Moreover, we assess the potential for stable planetary orbits in these systems. We also calculate habitable zones around these binaries based on the orbital evolution of planetary orbits. These systems may represent promising targets for future extrasolar planet searches around Sun-like stars due to their robust physical and orbital parameters that can be used to determine planetary habitability and stability.",
      "pdf_url": "https://arxiv.org/pdf/2512.23652.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.12190",
      "title": "Doppler imaging combined with high-cadence photometry. I. Revisiting the surface of a pre-main-sequence flare star",
      "authors": [
        "Sanghee Lee",
        "Engin Bahar",
        "Hakan Volkan Şenavcı",
        "Emre Işık",
        "Kai Ikuta",
        "Kosuke Namekata",
        "Haruhi Nagata",
        "Kiyoe Kawauchi",
        "Masashi Omiya",
        "Hideyuki Izumiura",
        "Akito Tajitsu",
        "Bun'ei Sato",
        "Satoshi Honda",
        "Daisaku Nogami"
      ],
      "abstract": "Doppler imaging combined with high-cadence photometry. I. Revisiting the surface of a pre-main-sequence flare star Sanghee Lee, Engin Bahar, Hakan Volkan Şenavcı, Emre Işık, Kai Ikuta, Kosuke Namekata, Haruhi Nagata, Kiyoe Kawauchi, Masashi Omiya, Hideyuki Izumiura, Akito Tajitsu, Bun'ei Sato, Satoshi Honda, Daisaku Nogami 18 pages, 14 figures, Accepted for publication to A&A Solar and Stellar Astrophysics (astro-ph.SR) Latitude distribution of stellar magnetic activity is not well constrained by observations, despite its importance for a better understanding of stellar dynamos. We aim to obtain an accurate reconstruction of the surface spot distribution on the young, rapidly rotating K2 star PW And by combining spectroscopic and photometric diagnostics. In particular, we seek to assess how the inclusion of continuous high-precision TESS photometry in parallel with high-resolution spectroscopy improves latitude recovery of starspots, especially at low latitudes and in the southern hemisphere, which are poorly constrained by Doppler imaging (DI) alone. We explore the spatial origins of the observed white-light flares. We performed simultaneous Doppler imaging and light curve inversion (DI+LCI) using contemporaneous high-resolution GAOES-RV spectra from the 3.8 m Seimei telescope (R~65000) and high-precision TESS light curves. Surface reconstructions employ the SpotDIPy code to model both line profiles and continuum brightness variations. We compare DI+LCI maps with DI-only solutions, conduct artificial-spot simulations to evaluate the effects of latitude, phase coverage, and S/N on reconstruction reliability. We also investigate the spatial correlation between the DI+LCI reconstructed map and flares detected in the TESS data. The DI+LCI reconstruction reveals significant spot features at mid-to-low latitudes, equatorial regions, and even in the southern hemisphere. Simulations show that DI+LCI provides more accurate reconstructions than DI-only, especially under conditions of incomplete phase coverage and low S/N, by better recovering both spot latitudes and filling factors. A comparison between the DI+LCI map and the TESS flare timings also suggests potential association between flare occurrence and reconstructed spot longitudes.",
      "pdf_url": "https://arxiv.org/pdf/2511.12190.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.19436",
      "title": "Unveiling the Velocity-Space Signature of Ion Cyclotron Damping Using Liouville Mapping",
      "authors": [
        "Rui Huang",
        "Gregory G. Howes"
      ],
      "abstract": "Unveiling the Velocity-Space Signature of Ion Cyclotron Damping Using Liouville Mapping Rui Huang, Gregory G. Howes Phys. Plasmas 1 December 2025; 32 (12): 122902 Plasma Physics (physics.plasm-ph); Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) Ion cyclotron damping is a key mechanism for the dissipation of electromagnetic wave energy in weakly collisional plasmas. This study presents a combined approach using Liouville mapping and the field-particle correlation technique to investigate qualitatively and quantitatively the velocity-space signature of ion cyclotron damping. Liouville mapping offers a computationally efficient way to predict perturbations to the particle velocity distribution function using single-particle trajectories in prescribed electromagnetic fields. One may apply the field-particle correlation technique to these perturbed velocity distributions to reveal the unique velocity-space signatures of the secular energy transfer rate associated with specific wave-particle interactions. We validate this method by reproducing known Landau damping signatures for kinetic Alfvén waves, and then we apply this method to ion cyclotron waves where ion cyclotron damping dominates. The resulting velocity-space signature reveals distinct energization features of ion cyclotron damping : (i) a quadrupolar pattern in the perpendicular $(v_x, v_y)$ plane; and (ii) a localized energization near the $n = 1$ resonant velocity in gyrotropic $(v_\\parallel, v_\\perp)$ velocity-space. The quantitative patterns remain unchanged as the ion plasma beta $\\beta_i$ is varied, ultimately showing minimal $v_\\perp$ dependence on $\\beta_i$ of the velocity-space signature at the $n = 1$ resonant velocity. This work provides a systematic study of how the ion cyclotron damping signature varies with $\\beta_i$, offering a practical foundation to identify ion cyclotron damping using kinetic simulation data or spacecraft data.",
      "pdf_url": "https://arxiv.org/pdf/2507.19436.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.14400",
      "title": "Electron Inertia and Magnetic Reconnection",
      "authors": [
        "Allen H Boozer"
      ],
      "abstract": "Electron Inertia and Magnetic Reconnection Allen H Boozer Plasma Physics (physics.plasm-ph); Solar and Stellar Astrophysics (astro-ph.SR) When electron inertia is the only non-ideal effect in the evolution of a magnetic field $\\vec{B}$, the field lines of $\\vec{B}$ reconnect, but the lines of a related field $\\vec{\\mathcal{B}}$ do not. $\\vec{\\mathcal{B}} \\equiv \\vec{B} + \\vec{\\nabla}\\times \\left( (c/\\omega_{pe})^2\\mu_0\\vec{j} \\right)$ with $\\omega_{pe}$ the plasma frequency and $\\vec{j}$ the current density. Although a full four-dimensional relativistic calculation of $\\vec{\\mathcal{B}}$ has been made, studies of $\\vec{\\mathcal{B}}$ have been focused on systems that depend on only two spatial coordinates. Three results are given: (1) A relatively simple demonstration in three dimensional space that the lines of $\\vec{\\mathcal{B}}$ do not reconnect when electron inertia is the only non-ideal effect. (2) The guiding center motion of charged particles is modified by a term that is proportional to $(c/\\omega_{pe})^2$, which is smaller than the drifts proportional to the gyroradius unless the current density is extremely large. (3) In three dimensional space, the evolution velocity of $\\vec{\\mathcal{B}}$ is characteristically chaotic, which means neighboring streamlines separate exponentially on a timescale $\\tau_u$. $\\vec{\\mathcal{B}}$ undergoes large scale reconnection on a timescale that is only an order of magnitude or two longer than $\\tau_u$ unless all diffusive non-ideal effects, such as resistivity, are absolutely zero.",
      "pdf_url": "https://arxiv.org/pdf/2509.14400.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22399",
      "title": "Space AI: Leveraging Artificial Intelligence for Space to Improve Life on Earth",
      "authors": [
        "Ziyang Wang"
      ],
      "abstract": "Space AI: Leveraging Artificial Intelligence for Space to Improve Life on Earth Ziyang Wang Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI); Space Physics (physics.space-ph) Artificial Intelligence (AI) is transforming domains from healthcare and agriculture to finance and industry. As progress on Earth meets growing constraints, the next frontier is outer space, where AI can enable autonomous, resilient operations under extreme uncertainty and limited human oversight. This paper introduces Space AI as a unified interdisciplinary field at the intersection of artificial intelligence and space science and technology. We consolidate historical developments and contemporary progress, and propose a systematic framework that organises Space AI into four mission contexts: 1 AI on Earth, covering intelligent mission planning, spacecraft design optimisation, simulation, and ground-based data analytics; 2 AI in Orbit, focusing on satellite and station autonomy, space robotics, on-board/near-real-time data processing, communication optimisation, and orbital safety; (3) AI in Deep Space, enabling autonomous navigation, adaptive scientific discovery, resource mapping, and long-duration human-AI collaboration under communication constraints; and 4 AI for Multi-Planetary Life, supporting in-situ resource utilisation, habitat and infrastructure construction, life-support and ecological management, and resilient interplanetary networks. Ultimately, Space AI can accelerate humanity's capability to explore and operate in space, while translating advances in sensing, robotics, optimisation, and trustworthy AI into broad societal impact on Earth.",
      "pdf_url": "https://arxiv.org/pdf/2512.22399.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23490",
      "title": "Lossless compression of simulated radio interferometric visibilities",
      "authors": [
        "A. R. Offringa",
        "R. J. van Weeren"
      ],
      "abstract": "Lossless compression of simulated radio interferometric visibilities A. R. Offringa, R. J. van Weeren Accepted for publication in A&A. 8 pages, 3 figures Instrumentation and Methods for Astrophysics (astro-ph.IM) Context. Processing radio interferometric data often requires storing forward-predicted model data. In direction-dependent calibration, these data may have a volume an order of magnitude larger than the original data. Existing lossy compression techniques work well for observed, noisy data, but cause issues in calibration when applied to forward-predicted model data. Aims. To reduce the volume of forward-predicted model data, we present a lossless compression method called Simulated Signal Compression (Sisco) for noiseless data that integrates seamlessly with existing workflows. We show that Sisco can be combined with baseline-dependent averaging for further size reduction. Methods. Sisco decomposes complex floating-point visibility values and uses polynomial extrapolation in time and frequency to predict values, groups bytes for efficient encoding, and compresses residuals using the Deflate algorithm. We evaluate Sisco on diverse LOFAR, MeerKAT, and MWA datasets with various extrapolation functions. Implemented as an open-source Casacore storage manager, it can directly be used by any observatory that makes use of this format. Results. We find that a combination of linear and quadratic prediction yields optimal compression, reducing noiseless forward-predicted model data to 24% of its original volume on average. Compression varies by dataset, ranging from 13% for smooth data to 38% for less predictable data. For pure noise data, compression achieves just a size of 84% due to the unpredictability of such data. With the current implementation, the achieved compression throughput is with 534 MB/s mostly dominated by I/O on our testing platform, but occupies the processor during compression or decompression. Finally, we discuss the extension to a lossy algorithm.",
      "pdf_url": "https://arxiv.org/pdf/2512.23490.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23530",
      "title": "Sidelobe Modification for an Offset Gregorian Reflector System using a Reconfigurable Intelligent Surface-Equipped Subreflector",
      "authors": [
        "S.W. Ellingson",
        "A.J. Yip"
      ],
      "abstract": "Sidelobe Modification for an Offset Gregorian Reflector System using a Reconfigurable Intelligent Surface-Equipped Subreflector S.W. Ellingson, A.J. Yip Instrumentation and Methods for Astrophysics (astro-ph.IM); Systems and Control (eess.SY) In past work, we described the use of a reconfigurable intelligent surface (RIS) mounted on the rim of an axisymmetric prime focus-fed reflector to create nulls in the close-in sidelobes. In this paper, we show that similar performance is possible in an offset Gregorian reflector system using a RIS on the rim of the subreflector. Applications include radio astronomy, where offset Gregorian reflectors are common and observations are subject to deleterious levels of interference from satellites entering through sidelobes. We show that an efficient RIS replacing the outer one-third of the subreflector surface, employing passive elements with 1-bit phase-only control, can create a null in the peak of the second sidelobe in the quiescent pattern. This is achieved using a simple unconstrained optimization algorithm to set the states of the RIS elements. The algorithm yields a deep null with just 0.2~dB reduction in main lobe directivity, despite lacking any constraints on main lobe pattern. Compared to our previous approach of mounting the RIS on the rim of the main reflector, the subreflector-based approach demonstrated in this paper requires a much smaller RIS and can implemented in existing systems by replacing the subreflector.",
      "pdf_url": "https://arxiv.org/pdf/2512.23530.pdf",
      "categories": [
        "astro-ph.IM",
        "eess.SY"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22574",
      "title": "Double to tenfold M-shell photoionization of singly charged lanthanum ions",
      "authors": [
        "M. Looshorn",
        "B. M. Döhring",
        "P.-M. Hillenbrand",
        "M. Martins",
        "A. Müller",
        "S. Reinwardt",
        "J. Seltmann",
        "F. Trinter",
        "S. X. Wang",
        "A. K. Sahoo",
        "S. Fritzsche",
        "S. Schippers"
      ],
      "abstract": "Double to tenfold M-shell photoionization of singly charged lanthanum ions M. Looshorn, B. M. Döhring, P.-M. Hillenbrand, M. Martins, A. Müller, S. Reinwardt, J. Seltmann, F. Trinter, S. X. Wang, A. K. Sahoo, S. Fritzsche, S. Schippers Atomic Physics (physics.atom-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM) Using the photon-ion merged-beams technique at the PETRA\\,III synchrotron light source, we have measured cross sections for double and up to tenfold photoionization of La$^{+}$ ions by a single photon in the energy range 820--1400~eV, where resonances and thresholds occur that are associated with the excitation or ionization of one $M$-shell electron. These cross sections represent experimental benchmark data for the further development of quantum theoretical methods, which will have to provide the bulk of the atomic data required for the modeling of nonequilibrium plasmas such as kilonovae. In the present work, we have upgraded the Jena Atomic Calculator (JAC) and pushed the state-of-the-art of quantum calculations for heavy many-electron systems to new limits. In particular, we have performed large-scale calculations of the La$^+$ photoabsorption cross section and of the deexcitation cascades, which set in after the initial creation of a $3d$ hole. Our theoretical results largely agree with our experimental findings. However, our theoretical product-ion charge state distributions are somewhat narrower than the experimental ones, which is most probably due to the simplifications necessary to keep the cascade calculations tractable.",
      "pdf_url": "https://arxiv.org/pdf/2512.22574.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23040",
      "title": "A Linearized Approach to Radial-Velocity Extraction. II: Shot-Noise-Limited Precision via Spectral Factorization",
      "authors": [
        "Sahar Shahaf",
        "Barak Zackay"
      ],
      "abstract": "A Linearized Approach to Radial-Velocity Extraction. II: Shot-Noise-Limited Precision via Spectral Factorization Sahar Shahaf, Barak Zackay Submitted for publication in MNRAS Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We generalize the short-time Fourier transform (STFT) formalism for radial velocity extraction to cases where the underlying spectral components are unknown. The method factorizes a spectroscopic time series into principal spectra and time-dependent kernels, enabling simultaneous recovery of both. In Fourier space, each inverse-wavelength slice is decomposed by singular value decomposition, and radial velocity shifts are inferred from phase differences between epochs. In the high-SNR regime, this provides a linearized and statistically tractable estimate of differential velocities. The method is validated on synthetic and SOAP simulations and applied to EXPRES observations of HD 34411 and $\\tau$ Ceti, recovering coherent signals and reaching the instrumental precision limit of ~30 cm/s. Apart from p-mode modulation, the residuals show no significant long-term correlations and allow the detection of signals with semi-amplitudes down to ~50 cm/s with $\\lesssim10$ cm/s uncertainty. The framework thus enables extreme-precision radial velocity measurements in the presence of spectral variability, representing a step toward detecting and characterizing Earth-like planets around solar-type stars.",
      "pdf_url": "https://arxiv.org/pdf/2512.23040.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.06144",
      "title": "First Use of GPS Satellites for Beam Calibration of Radio Dish Telescopes",
      "authors": [
        "Sabrina Berger",
        "Arianna Lasinski",
        "Vincent MacKay",
        "Eamon Egan",
        "Dallas Wulf",
        "Aman Chokshi",
        "Jonathan Sievers"
      ],
      "abstract": "First Use of GPS Satellites for Beam Calibration of Radio Dish Telescopes Sabrina Berger, Arianna Lasinski, Vincent MacKay, Eamon Egan, Dallas Wulf, Aman Chokshi, Jonathan Sievers Accepted to PASA. 17 pages, 12 figures Instrumentation and Methods for Astrophysics (astro-ph.IM) We present results from the first application of the Global Navigation Satellite System (GNSS; e.g., the Global Positioning System, GPS) for radio beam calibration using a commercial GNSS receiver with the Deep Dish Development Array (D3A) at the Dominion Radio Astrophysical Observatory (DRAO). Several GNSS satellites pass through the main and sidelobes of the beam each day, enabling efficient mapping of the 2D beam structure. Due to the high SNR and abundance of GNSS satellites, we find evidence that GNSS can probe several sidelobes of the beam through repeatable measurements of the beam over several days. Over three days of measurements, the smallest observed difference in the primary beam's main lobe was 0.56 dB-Hz. We also compare our results in the sidelobes to simulations and find rough agreement in shape. When scaling the observations and simulations to match in the main lobe power levels, we find deviations in at least one of the first few nulls of approximately 5 dB or less. There is saturation in the main lobe for most satellites, which can likely be mitigated by better attenuation before the receiver input. We compare our work to other satellite systems that have been successful and are likely complementary to this technique. However, GNSS offers key advantages, including continuous transmission, broader frequency coverage relevant to CHORD, SKA-mid, and the DSA-2000, as well as more frequent satellite passes, making it a promising calibration method. These results also motivate further development of this technique for radio astronomy applications.",
      "pdf_url": "https://arxiv.org/pdf/2411.06144.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16995",
      "title": "Towards an agnostic algorithm for sampling empirical structure models: The case of Uranus and Neptune",
      "authors": [
        "Stefano Wirth",
        "Luca Morf",
        "Ravit Helled"
      ],
      "abstract": "Towards an agnostic algorithm for sampling empirical structure models: The case of Uranus and Neptune Stefano Wirth, Luca Morf, Ravit Helled Accepted for publication in A&A; v2 and v3: Language compliance updates with A&A guidelines Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present an algorithm to efficiently sample the full space of planetary interior density profiles. Our approach uses as few assumptions as possible to pursue an agnostic algorithm. The algorithm avoids the common Markov Chain Monte Carlo method and instead uses an optimisation-based gradient-descent approach designed for computational efficiency. In this work, we use Uranus and Neptune as test cases and obtain empirical models that provide density and pressure profiles consistent with the observed physical properties (total mass, radius, and gravitational moments). We compare our findings to other work and find that while other studies are generally in line with our findings, they do not cover the entire space of solutions faithfully. Furthermore, we present guidance for modellers that construct Uranus or Neptune interior models with a fixed number of layers. We provide a statistical relation between the steepness classifying a density discontinuity and the resulting number of discontinuities to be expected. For example, if one classifies a discontinuity as a density gradient larger than 0.02 kg$\\,$m$^{-4}$, then most solutions should have at most one such discontinuity. Finally, we find that discontinuities, if present, are concentrated around a planetary normalised radius of 0.65 for Uranus and 0.7 for Neptune. Our algorithm to efficiently and faithfully investigate the full space of possible interior density profiles can be used to study all planetary objects with gravitational field data.",
      "pdf_url": "https://arxiv.org/pdf/2512.16995.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22375",
      "title": "Formation of the Moon and Binary Asteroids",
      "authors": [
        "Nick Gorkavyi"
      ],
      "abstract": "Formation of the Moon and Binary Asteroids Nick Gorkavyi Izvestia Crimean Astrophys. Observatory. 2007. v. 103. N 2, pp. 143-155 Earth and Planetary Astrophysics (astro-ph.EP) The proposed multi-impact model explains the formation of the Moon, Charon, and binary asteroids without invoking catastrophic cosmic events. The main elements of the new model are as follows: a. A primordial, low-mass proto-satellite disk with prograde rotation existed around the proto-Earth. b. Most of the lunar material was ejected from Earth mantle by numerous impacts of large asteroids. This naturally explains the lunar iron deficiency. c. Collisions between ejecta and particles of the prograde proto-satellite disk stabilize the fragments on satellite orbits. We demonstrate the high efficiency of the multi-impact mechanism: ejecta on prograde orbits readily merges with the prograde proto-satellite disk, whereas retrograde ejecta falls back onto Earth.",
      "pdf_url": "https://arxiv.org/pdf/2512.22375.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22429",
      "title": "Chain Reactions in Space: Analyzing the Impact of Satellite Collisions and Debris Accumulation",
      "authors": [
        "Mark Ballard",
        "Guanqun Song",
        "Ting Zhu"
      ],
      "abstract": "Chain Reactions in Space: Analyzing the Impact of Satellite Collisions and Debris Accumulation Mark Ballard, Guanqun Song, Ting Zhu Earth and Planetary Astrophysics (astro-ph.EP) The exponential increase in artificial satellites, growing from 852 in 2004 to over 9,000 in 2023, has intensified the risk of the Kessler Syndrome: a cascading chain reaction of orbital collisions. This paper analyzes the dynamics of space debris accumulation to identify the primary orbital features contributing to this systemic risk. We compiled and analyzed Two-Line Element (TLE) datasets from this http URL and historical collision data using a Python-based data mining approach. Specifically, we derived satellite velocities using the Vis-Viva equation and evaluated the correlation of five key features, launch piece count, orbital period, apogee, perigee, and Radar Cross Section (RCS) size, with debris density. Our evaluation reveals that apogee and orbital period exhibit the strongest correlation with the risk of the Kessler Syndrome, indicating that satellites in higher orbits pose a disproportionately greater threat to long-term sustainability due to navigational constraints. Contrary to common assumptions, our data suggests that velocity and object size (RCS) show negligible direct correlation with collision incidence in the current dataset. Based on these findings, we propose mitigation strategies focusing on integrating AI-driven autonomous navigation systems and deploying advanced radiation-resistant shielding materials to enhance the resilience of high-orbit assets.",
      "pdf_url": "https://arxiv.org/pdf/2512.22429.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23542",
      "title": "Not Just Gas: How Solid-Driven Torques Shaped the Migration of the Galilean Moons",
      "authors": [
        "Lucas Gonzalez-Rivas",
        "Leonardo Krapp",
        "Ximena Ramos",
        "Pablo Benitez-Llambay"
      ],
      "abstract": "Not Just Gas: How Solid-Driven Torques Shaped the Migration of the Galilean Moons Lucas Gonzalez-Rivas, Leonardo Krapp, Ximena Ramos, Pablo Benitez-Llambay 5 pages, 2 figures, submitted to A&A Letter to the editor Earth and Planetary Astrophysics (astro-ph.EP) Surviving rapid inward orbital migration is a crucial aspect of formation models for the Jupiter's Galilean moons. The primary aim of this study is to investigate the orbital migration of the Galilean moons by incorporating self-consistent solid dynamics in circumjovian disk models. We perform two-fluid simulations using the FARGO3D code on a 2D polar grid. The simulations model a satellite with the mass of a proto-moon, Europa, or Ganymede interacting with a circumjovian disk. The dust component, coupled to the gas via a drag force, is characterized by the dust-to-gas mass ratio ($\\epsilon$) and the Stokes number ($T_s$). The effect of solids fundamentally alter the satellites' evolution. We identify a vast parameter space where migration is slowed, halted, robustly reversed -leading to outward migration-, or significantly accelerated inward. The migration rate is dependent on satellite mass, providing a natural source of differential migration. Solid dynamics provides a robust and self-consistent mechanism that fundamentally alters the migration of the Galilean moons, potentially addressing the long-standing migration catastrophe. This mechanism critically affects the survival of satellites and could offer a viable physical process to explain the establishment of resonances through differential migration. These findings establish that solid torques are a critical, non-negligible factor in shaping the final architecture of satellite systems.",
      "pdf_url": "https://arxiv.org/pdf/2512.23542.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11459",
      "title": "A mini-review on combinatorial solutions to the Marcus-Lushnikov irreversible aggregation",
      "authors": [
        "Michał Łepek",
        "Agata Fronczak",
        "Piotr Fronczak"
      ],
      "abstract": "A mini-review on combinatorial solutions to the Marcus-Lushnikov irreversible aggregation Michał Łepek, Agata Fronczak, Piotr Fronczak 42 pages, 15 figures, a mini-review Statistical Mechanics (cond-mat.stat-mech); Earth and Planetary Astrophysics (astro-ph.EP); Soft Condensed Matter (cond-mat.soft); Mathematical Physics (math-ph); Chemical Physics (physics.chem-ph) Over the past decade, a combinatorial framework for discrete, finite, and irreversibly aggregating systems has emerged. This work reviews its progress, practical applications, and limitations. We outline the approach's assumptions and foundations, based on direct enumeration of system states, contrasting with classical Smoluchowski and Marcus-Lushnikov methods. Using the constant kernel as an example, we derive combinatorial expressions for the average number of clusters of a given size and their standard deviation, and present the complete probability distribution for cluster counts. The method is then extended to several kernels (additive, product, linear-chain, condensation) by explicitly enumerating ways to form clusters of a given size. For general kernels, approximate solutions are obtained via recursive expressions, enabling predictions without explicit solutions. Applications to aerosol growth and planetesimal formation are demonstrated, with comparisons to numerical results. We summarize issues of validity and precision and propose open problems. The appendix includes partial Bell polynomials, generating functions, Lagrange inversion, potential applications, and links between combinatorial and scaling solutions of the Smoluchowski equation.",
      "pdf_url": "https://arxiv.org/pdf/2512.11459.pdf",
      "categories": [
        "astro-ph.EP",
        "math-ph"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}