{
  "date": "2026-01-05",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.CO",
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.IM",
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "total_papers": 100,
  "gw_related_papers": 3,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.24672",
      "title": "An Effective Theory for Biased Tracers via the Boltzmann-Equation Approach",
      "authors": [
        "Tomohiro Fujita",
        "Tomo Takahashi",
        "Sora Yamashita"
      ],
      "abstract": "An Effective Theory for Biased Tracers via the Boltzmann-Equation Approach Tomohiro Fujita, Tomo Takahashi, Sora Yamashita Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We develop an effective theory for biased tracers formulated at the level of the Boltzmann equation, providing a unified description of density and velocity bias. We introduce a general effective collision term in the tracer Boltzmann equation to encode tracer dynamics that are intrinsically different from those of dark matter. This collision operator leads to modified continuity and Euler equations, with source terms reflecting the collision-term physics. At linear order, this framework predicts time- and scale-dependent bias parameters in a self-consistent manner, encompassing peak bias as a special case while clarifying how velocity bias and higher-derivative effects arise. Applying the resulting bias model to redshift-space distortions, we show that the Boltzmann-equation approach reproduces the power spectrum of biased tracers obtained in the Effective Field Theory of Large-Scale Structure up to $k^4$ terms with fewer independent parameters.",
      "pdf_url": "https://arxiv.org/pdf/2512.24672.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.02607",
      "title": "Gravitational wave probes of particle dark matter: a review",
      "authors": [
        "Andrew L. Miller"
      ],
      "abstract": "Gravitational wave probes of particle dark matter: a review Andrew L. Miller 54 pages + references, 28 figures, comments are welcome. Matches published version International Journal of Modern Physics D, Vol. 35, No. 01, 2530005 (2026) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Various theories of dark matter predict distinctive astrophysical signatures in gravitational-wave sources that could be observed by ground- and space-based laser interferometers. Different candidates-including axions, dark photons, macroscopic dark matter, WIMPs, and dark-matter spikes-may appear in interferometer data via their coupling to gravity or the Standard Model, altering the measured gravitational-wave strain in distinct ways. Despite their differences, these candidates share two key features: (1) they can be probed through their effects on gravitational waves from inspiraling compact objects, isolated black holes, and neutron stars, or via direct interactions with detectors, and (2) their signatures likely persist far longer than the seconds-long mergers detected today, necessitating new data analysis methods beyond matched filtering. This review outlines these dark matter candidates, their observational signatures, and approaches for their detection.",
      "pdf_url": "https://arxiv.org/pdf/2503.02607.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.09470",
      "title": "When Dark Matter Heats Up: A Model-Independent Search for Non-Cold Behavior",
      "authors": [
        "Mazaharul Abedin",
        "Luis A. Escamilla",
        "Supriya Pan",
        "Eleonora Di Valentino",
        "Weiqiang Yang"
      ],
      "abstract": "When Dark Matter Heats Up: A Model-Independent Search for Non-Cold Behavior Mazaharul Abedin, Luis A. Escamilla, Supriya Pan, Eleonora Di Valentino, Weiqiang Yang Version 2, ~21 pages including references and appendices; 8 captioned figures, 6 tables; published in Phys. Rev. D Phys. Rev. D \\textbf{112}, no.12, 123537 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) This article questions the common assumption of cold dark matter (DM) by exploring the possibility of a non-zero equation of state (EoS) without relying on any parametric approach. In standard cosmological analyses, DM is typically modeled as pressureless dust with $w_{\\rm DM} = 0$, an assumption that aligns with large-scale structure formation, supports the empirical success of the $\\Lambda$CDM model, and simplifies cosmological modeling. However, there is no fundamental reason to exclude a non-zero $w_{\\rm DM}$ from the cosmological framework. In this work, we explore this possibility through non-parametric and parametric reconstructions based on Gaussian Process Regression. The reconstructions use Hubble parameter measurements from Cosmic Chronometers (CC), the Pantheon+ sample of Type Ia supernovae, and Baryon Acoustic Oscillation (BAO) data from DESI DR1 and DR2. Our findings suggest that a dynamical EoS for DM, although only mildly supported statistically, cannot be conclusively ruled out. Notably, we observe a mild tendency ($\\sim 1\\sigma$) toward a negative $w_{\\rm DM}$ at the present epoch, which is most likely due to inconsistencies between the BAO data from DESI and other datasets.",
      "pdf_url": "https://arxiv.org/pdf/2505.09470.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16551",
      "title": "Decoupling perturbations from background in $f(Q)$ gravity: the square-root correction and the alleviation of the $σ_8$ tension",
      "authors": [
        "Chunyu Li",
        "Xin Ren",
        "Yuhang Yang",
        "Emmanuel N. Saridakis",
        "Yi-Fu Cai"
      ],
      "abstract": "Decoupling perturbations from background in $f(Q)$ gravity: the square-root correction and the alleviation of the $σ_8$ tension Chunyu Li, Xin Ren, Yuhang Yang, Emmanuel N. Saridakis, Yi-Fu Cai Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate a perturbation-level modification of symmetric teleparallel gravity of the form $f(Q)=F(Q)+M\\sqrt{Q}$ and assess its ability to ease the $\\sigma_8$ tension. The square-root term leaves the background expansion unchanged while modifying the effective gravitational coupling, providing a pure decoupling between background cosmology and structure-growth evolution. Using the latest redshift-space distortion data, including DESI DR1 Full-Shape measurements, we constrain $M$ and $\\sigma_8$ across three representative backgrounds: $\\Lambda$CDM, an $H_0$-tension-reducing model, and a DESI-motivated dynamical dark energy scenario. In all cases, the square-root correction suppresses growth and can reconcile $\\sigma_8$ with Planck at the $1\\sigma$ level, with the strongest improvement occurring in the $H_0$-tension-oriented background. A residual degeneracy between $M$ and $\\sigma_8$ remains, indicating that future multi-probe analyses combining lensing and full-shape clustering will be required to determine whether the $\\sqrt{Q}$ term represents a genuine signal of modified gravity.",
      "pdf_url": "https://arxiv.org/pdf/2512.16551.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23811",
      "title": "Clustering of cosmic string loops within a Milky-way like halo",
      "authors": [
        "Itamar Allali",
        "Mudit Jain",
        "Shi Yan"
      ],
      "abstract": "Clustering of cosmic string loops within a Milky-way like halo Itamar Allali, Mudit Jain, Shi Yan 13 pages (including an appexdix), 6 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Loops of cosmic string experience a recoil from anisotropic gravitational radiation, known as the rocket effect, which influences the extent to which they are captured by galaxies during structure formation. Analytical studies have reached different conclusions regarding loop capture in galaxies: early treatments argued for efficient capture, while later analyses incorporating the loop rocket force throughout halo formation found that capture efficiency is reduced and strongly dependent on loop size. In this work, we employ the N-body simulation code GADGET-4, introducing non-backreacting tracer particles subject to a constant recoil force to model cosmic string loops with the rocket effect. We simulate the formation of a Milky-Way-like halo from redshift $z=127$ to $z=0$, considering loop populations characterized by a range of length parameters $\\xi$, inversely proportional to the rocket acceleration. We find that the number of captured loops exhibits a pronounced peak at $\\xi_{\\textrm{peak}}\\simeq 12.5$, arising from the competition between rocket-driven ejection at small $\\xi$ and the declining intrinsic loop abundance at large $\\xi$. For fiducial string tensions, this corresponds to $\\mathcal{O}(10^6)$ loops within the halo. We further find that loops with weak rocket forces closely trace the dark-matter distribution, while those subject to stronger recoil but still captured -- particularly the most abundant loops near $\\xi_{\\textrm{peak}}$ -- are preferentially concentrated toward the central regions of the halo.",
      "pdf_url": "https://arxiv.org/pdf/2512.23811.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23899",
      "title": "The Tianlai-WIYN North Celestial Cap Redshift Survey",
      "authors": [
        "Reza Ansari",
        "Gabriela A. Marques",
        "John P. Marriner",
        "Olivier Perdereau",
        "Elena Pinetti",
        "Lily Robinthal",
        "Albert Stebbins",
        "Haoxuan Sun",
        "Peter Timbie",
        "Gregory S. Tucker",
        "Eli Doyle",
        "Jocelyn Chu",
        "E. Revsen Karaalp",
        "Xuelei Chen",
        "Jixia Li",
        "Fengquan Wu"
      ],
      "abstract": "The Tianlai-WIYN North Celestial Cap Redshift Survey Reza Ansari, Gabriela A. Marques, John P. Marriner, Olivier Perdereau, Elena Pinetti, Lily Robinthal, Albert Stebbins, Haoxuan Sun, Peter Timbie, Gregory S. Tucker, Eli Doyle, Jocelyn Chu, E. Revsen Karaalp, Xuelei Chen, Jixia Li, Fengquan Wu Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the results of a small, low redshift spectroscopic survey of galaxies within 3 degrees of the North Celestial Pole (NCP) selected using V-band photometry obtained from the North Celestial Cap Survey (NCCS) (Gorbikov & Brosch 2014). The purpose of the current survey is to create a redshift space template for 21 cm emission from neutral hydrogen with which to correlate radio line intensity observations by the Tianlai dish and cylinder interferometers. A total of 898 redshifts were obtained from the 2102 extended objects in the NCCS with m_V < 19 in the survey area. After accounting for extinction, the survey geometry and selection effects, the number density and clustering pattern of galaxies in the redshift catalog are consistent with other low redshift surveys. We were also able to identify 11 galaxy cluster candidates from this redshift catalog.",
      "pdf_url": "https://arxiv.org/pdf/2512.23899.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24309",
      "title": "$S_8-H_0$ tension in a SI-ULDM scenario",
      "authors": [
        "Jessica N. López-Sánchez"
      ],
      "abstract": "$S_8-H_0$ tension in a SI-ULDM scenario Jessica N. López-Sánchez 14 pages, 3 figures. Comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We study the cosmological impact of a transient self-interaction phase in Ultra-Light Dark Matter (ULDM), focusing on its simultaneous effects on the sound horizon and the late-time growth of structure. In the presence of a quartic self-interaction, the scalar field undergoes a short-lived radiation-like phase before evolving into matter-like behaviour, inducing a localized modification of the expansion history at early times. We develop a perturbative and model-independent framework in which the self-interaction energy density is parametrized as a localized contribution to the total energy budget. Within this approach, the responses of the sound horizon and the linear growth factor can be expressed as weighted integrals over cosmic time, with distinct kernels encoding the temporal sensitivity of each observable. This structure leads to a simple analytic relation linking the corresponding early- and late-time responses, and naturally predicts correlated shifts in $H_0$ and $S_8$ whose sign and magnitude depend on the timing of the self-interaction episode. Our results show that a single transient modification of the expansion history can interpolate between early-time effects on the sound horizon and late-time suppression of structure growth within a unified physical framework, providing an analytical understanding of their joint response.",
      "pdf_url": "https://arxiv.org/pdf/2512.24309.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24350",
      "title": "Self-Gravitating Scalar Field Configurations, Ultra Light Dark Matter and Galactic Scale Observations",
      "authors": [
        "Bihag Dave"
      ],
      "abstract": "Self-Gravitating Scalar Field Configurations, Ultra Light Dark Matter and Galactic Scale Observations Bihag Dave Thesis accepted for the award of PhD degree from Ahmedabad University, September 2025. Based on arXiv:2202.11081, arXiv:2304.04463, arXiv:2310.19664 and arXiv:2412.03547 Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) In this thesis, we investigate the possibility that dark matter consists of ultra light spin-zero particles with mass $m \\sim 10^{-22}\\ \\text{eV}$. We focus on the role of self-interactions, assuming all other non-gravitational couplings to Standard Model particles are negligible. Such ultra light dark matter (ULDM) is expected to form stable self-gravitating scalar field configurations (solitons), whose properties depend on the particle mass and self-coupling $\\lambda$. Using solutions of the Gross-Pitaevskii-Poisson equations, we explore how galactic-scale observations can constrain $m$ and $\\lambda$. We show that observational upper limits on the mass enclosed in central galactic regions can probe both attractive and repulsive self-interactions with strengths $\\lambda \\sim \\pm 10^{-96} - 10^{-95}$. We further demonstrate that self-interactions can allow ULDM to describe observed rotation curves as well as satisfy an empirical soliton-halo mass relation in low surface brightness galaxies for $m \\sim 10^{-22}\\ \\text{eV}$ and $\\lambda \\gtrsim 10^{-90}$. We also study tidal effects in satellite dwarf galaxies and find that attractive self-interactions can extend their lifetimes over cosmological timescales, allowing ULDM to evade recent constraints derived for the non-interacting case. Finally, we explore machine learning based inference of dark matter and baryonic parameters from galaxy rotation curves, showing that neural networks can recover parameters consistent with observations.",
      "pdf_url": "https://arxiv.org/pdf/2512.24350.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24369",
      "title": "Integrated Sachs-Wolfe maps from the Gower Street $w$CDM simulations",
      "authors": [
        "Mina Ghodsi Yengejeh",
        "András Kovács",
        "István Szapudi",
        "István Csabai"
      ],
      "abstract": "Integrated Sachs-Wolfe maps from the Gower Street $w$CDM simulations Mina Ghodsi Yengejeh, András Kovács, István Szapudi, István Csabai submitted to A&A, 11 pages, 9 figures. Codes and data will be publicly available Cosmology and Nongalactic Astrophysics (astro-ph.CO) The late-time linear Integrated Sachs-Wolfe (ISW) effect directly probes the dynamics of cosmic acceleration and the nature of dark energy. Detecting these weak, secondary temperature anisotropy signals of the CMB requires accurate theoretical predictions of their amplitude across cosmological models. By extending the pyGenISW package, previously limited to $\\Lambda$CDM, we aim to generate full-sky ISW maps for a suite of 791 $w$CDM cosmologies using the Gower Street N-body simulations, thereby enabling ISW analyses across a broader dark-energy parameter space. We make our code and ISW data publicly available. We compute the ISW signals by tracing the time evolution of the gravitational potential across large-volume simulations that span dark energy equation of state parameters from phantom to quintessence, $-1.79 \\lesssim w \\lesssim -0.34$. These data are projected onto the sphere using HEALPix to obtain full-sky temperature maps. We validate our pipeline by comparing the measured ISW angular power spectra and ISW-density cross-correlations against linear theory expectations ($2 \\leq \\ell \\leq 200$) computed with benchmarks from the pyCCL library. The agreement is excellent across the multipole range where the ISW contribution is expected to dominate, confirming the reliability of our modelling of gravitational-potential evolution. With additional tests of the ISW signal's strength in density extrema, as well as comparing all models to a reference $\\Lambda$CDM cosmology, we found that quintessence-like models ($w > -1$) show higher ISW amplitudes than phantom models ($w < -1$), consistent with enhanced late-time decay of gravitational potentials. The consistency of our $w$CDM ISW maps and their agreement with theory predictions confirm the robustness of our methodology, establishing it as a reliable tool for theoretical and observational ISW-LSS analyses.",
      "pdf_url": "https://arxiv.org/pdf/2512.24369.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24422",
      "title": "OmniCosmos: Transferring Particle Physics Knowledge Across the Cosmos",
      "authors": [
        "Vinicius Mikuni",
        "Ibrahim Elsharkawy",
        "Benjamin Nachman"
      ],
      "abstract": "OmniCosmos: Transferring Particle Physics Knowledge Across the Cosmos Vinicius Mikuni, Ibrahim Elsharkawy, Benjamin Nachman Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) Foundation models build an effective representations of data that can be deployed on diverse downstream tasks. Previous research developed the OmniLearned foundation model for collider physics and showed that it could significantly advance discovery potential across collider experiments. In this paper we go beyond collider physics and show that Foundation Models trained on collider data can help improve the prediction of cosmological parameters and to predict halo and galaxy velocities in different datasets from CosmoBench. This is the first time a collider physics model is shown to generalize across scientific fields.",
      "pdf_url": "https://arxiv.org/pdf/2512.24422.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24918",
      "title": "Cosmological dynamics and observational constraints of an interacting early scalar field coupled to radiation",
      "authors": [
        "Dorian Araya",
        "Felipe Herrera",
        "Nelson Videla"
      ],
      "abstract": "Cosmological dynamics and observational constraints of an interacting early scalar field coupled to radiation Dorian Araya, Felipe Herrera, Nelson Videla Cosmology and Nongalactic Astrophysics (astro-ph.CO) We study the cosmic evolution of an interacting scalar field radiation model, in which a minimally coupled scalar field exchanges energy with the radiation sector through an exponential coupling. Extending previous formulations, a non-relativistic matter component is included explicitly, which allows a self consistent description of cosmological dynamics from the radiation-dominated era to late-time acceleration. Analytical expressions for the background expansion are derived and characterized using kinematic diagnostics. We constrain the model using observational Hubble data, Type Ia Supernovae, baryon acoustic oscillations (including DESI DR2), and compressed cosmic microwave background distance information, performing a Bayesian MCMC analysis. The interaction parameter is found to be consistent with zero, though small deviations from standard radiation scaling are allowed. These deviations can partially alleviate the Hubble tension by modifying the sound horizon, but this is accompanied by correlated shifts in the matter density. The reconstructed expansion history remains close to LCDM at late times. Model comparison suggest that the interacting scenario is statistically competitive but not decisively preferred by current background data.",
      "pdf_url": "https://arxiv.org/pdf/2512.24918.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24966",
      "title": "Cosmic Himalayas in CROCODILE : Probing the Extreme Quasar Overdensities by Count-in-Cells analysis and Nearest Neighbor Distribution",
      "authors": [
        "Yuto Kuwayama",
        "Yongming Liang",
        "Kentaro Nagamine",
        "Yuri Oku",
        "Daisuke Nishihama",
        "Daisuke Toyouchi",
        "Keita Fukushima",
        "Hidenobu Yajima",
        "Hyunbae Park",
        "Masami Ouchi"
      ],
      "abstract": "Cosmic Himalayas in CROCODILE : Probing the Extreme Quasar Overdensities by Count-in-Cells analysis and Nearest Neighbor Distribution Yuto Kuwayama, Yongming Liang, Kentaro Nagamine, Yuri Oku, Daisuke Nishihama, Daisuke Toyouchi, Keita Fukushima, Hidenobu Yajima, Hyunbae Park, Masami Ouchi 18 pages, 10 figures, submitted to ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The recently reported Cosmic Himalayas (CH) -- an extreme quasar overdensity at z~2 -- poses an apparent challenge to the Lambda CDM framework, with a reported significance of 16.9-sigma under Gaussian assumptions. Such an event appears improbably rare, with a formal probability of P ~ 10^-68. In this work, we investigate whether CH-like structures can naturally arise in cosmological hydrodynamic simulations. Using the CROCODILE simulation, which self-consistently models galaxy-black hole coevolution, we examine quasar clustering through two complementary approaches: the count-in-cells (CIC) statistic, which probes large-scale overdensities, and the nearest-neighbor distribution (NND), sensitive to small-scale environments. CIC analysis reveals that the underlying distribution is heavy-tailed and non-Gaussian, and that conventional Gaussian-based evaluation substantially overestimates the significance of extreme events. When modeled with an asymmetric generalized normal distribution (AGND), the inferred rarity of the CH is substantially reduced and reconciled with standard Lambda CDM; for instance, regions appearing as 12-sigma outliers under Gaussian assumptions (P ~ 10^-33) are found to occur in the AGND regime with a probability of P ~ 10^-4. NND analysis further demonstrates that extreme overdense regions within the simulation can naturally sustain two-point correlation function values similar to those observed in the CH (r0 ~ 30 Mpc/h), suggesting that the strong clustering stems from sample selection biases and local environmental variations. These two analyses conclusively highlight the importance of adopting non-Gaussian statistics when quantifying extreme overdensities of quasars and establish that the CH is not an anomaly, but a natural outcome of structure formation in the Lambda CDM universe.",
      "pdf_url": "https://arxiv.org/pdf/2512.24966.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.25040",
      "title": "Towards precision cosmology with Voids x CMB correlations (I): Roman-Agora mock catalogs and pipeline validation",
      "authors": [
        "Mar Pérez Sar",
        "Carlos Hernández Monteagudo",
        "András Kovács",
        "Alice Pisani"
      ],
      "abstract": "Towards precision cosmology with Voids x CMB correlations (I): Roman-Agora mock catalogs and pipeline validation Mar Pérez Sar, Carlos Hernández Monteagudo, András Kovács, Alice Pisani 19 pages, 8 figures, submitted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) We construct and validate a set of multi-purpose mock galaxy catalogs designed to capture, to different degrees of accuracy, the main characteristics of the Nancy Grace Roman Space Telescope survey. These catalogs provide a foundation for void statistics and various CMB cross-correlation analyses. Our approach differs from traditional halo occupation or abundance matching methods by directly translating a reference mock catalog -- containing basic properties of the host halos -- into a new simulation (in our case Agora). This technique, which we call analog matching, assigns a halo counterpart in the new simulation to each reference galaxy through a nearest-neighbor search in a multi-dimensional parameter space. This space can include halo mass, environmental measures and other galaxy-specific attributes. By varying the composition of this parameter vector, we can generate catalogs of differing complexity and conduct systematic tests to examine the influence of modelling choices on LSS statistics. We find that analog matching based on halo mass alone, or halo mass and galaxy-type indicators, successfully reproduces the expected Roman emission-line galaxy statistics. We also show that reproducing two-dimensional galaxy clustering does not guarantee consistent void properties. Our results highlight the importance of matching void statistics for improved mock accuracy, and demonstrate that measuring voids provides independent and sensitive constraints on galaxy-halo connections beyond the matter power spectrum. An important by-product of our setup is that it is fully general and can be applied to any combination of simulation and reference catalog, provided that the desired parameter space for both is specified. The resulting Roman-Agora mock catalogs offer a versatile resource for LSS x CMB studies and a benchmark for assessing the impact of mock accuracy on cosmological observables.",
      "pdf_url": "https://arxiv.org/pdf/2512.25040.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.25064",
      "title": "Feeling Blue: Constructing a Robust SALT3 UV Template and Constraining its Redshift Dependency",
      "authors": [
        "Qinan Wang",
        "David O. Jones",
        "Justin D. R. Pierel",
        "Matthew R. Siebert",
        "W. D'Arcy Kenworthy",
        "Richard Kessler",
        "Mi Dai",
        "Ryan J. Foley",
        "Ori D. Fox",
        "Suvi Gezari",
        "Sebastian Gomez",
        "Peter McGill",
        "Armin Rest",
        "César Rojas-Bravo",
        "Melissa Shahbandeh",
        "Lou Strolger"
      ],
      "abstract": "Feeling Blue: Constructing a Robust SALT3 UV Template and Constraining its Redshift Dependency Qinan Wang, David O. Jones, Justin D. R. Pierel, Matthew R. Siebert, W. D'Arcy Kenworthy, Richard Kessler, Mi Dai, Ryan J. Foley, Ori D. Fox, Suvi Gezari, Sebastian Gomez, Peter McGill, Armin Rest, César Rojas-Bravo, Melissa Shahbandeh, Lou Strolger Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Upcoming cosmological surveys will obtain numerous rest-frame ultraviolet (UV) observations of Type Ia supernovae (SNe Ia), yet there is concern about how standardizable SNe Ia are in the UV. In this work, we train a robust optical--UV SED model for SNe Ia (SALT3-UV) with the open-source model-training software $\\texttt{SALTshaker}$. We incorporate a spectroscopic UV data sample from HST, including 67 UV spectra from 18 nearby SNe Ia. Unlike previous training spectra, the HST spectra have sufficiently precise calibration that they do not require additional warping to match coincident photometric data. Additionally, while including this new SN Ia sample necessitates incorporating auxiliary photometric data from ZTF and ATLAS that have insufficient calibration for cosmological analyses, the improvements in the calibration of these data is anticipated in the near future. Compared to the previous SALT3-K21 model, the SALT3-UV model shows a significant improvement in the UV down to $2000\\mathring{\\text{A}}$, with over a threefold improvement in model uncertainty and a more physically accurate continuum and line features. We further evaluate potential redshift evolution in the UV template by separating the UV training sample into low- and high-$z$ subsamples. Our results reveal a non-negligible $\\gtrsim 0.05$ mag difference between low- and high-$z$ SALT3-UV models in the $g-$band at $z\\gtrsim0.5$ and the $u-$band at $z\\gtrsim0.2$. We demonstrate that, if confirmed, such evolution could lead to a few-percent bias in the measurement of $w$ if high-$z$ rest-frame UV data are included in future cosmological surveys such as LSST and $\\textit{Roman}$.",
      "pdf_url": "https://arxiv.org/pdf/2512.25064.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.14749",
      "title": "Growth Index in the $γδ$CDM model",
      "authors": [
        "Cemsinan Deliduman",
        "Furkan Şakir Dilsiz",
        "Selinay Sude Binici"
      ],
      "abstract": "Growth Index in the $γδ$CDM model Cemsinan Deliduman, Furkan Şakir Dilsiz, Selinay Sude Binici 27 pages, 12 figures, 6 tables. v2: Extended gravitational growth framework is utilized. Main results are unchanged. v3: Final version Cosmology and Nongalactic Astrophysics (astro-ph.CO) To better distinguish the nature of $H_0$ and $S_8$ tensions, it is necessary to separate the effects of expansion and the growth of structure. The growth index $\\gamma$ was identified as the most important parameter that characterizes the growth of density fluctuations independently of the effects of cosmic expansion. In the $\\Lambda$CDM model, analyses performed with various cosmological datasets indicate that the growth index has to be larger than its theoretically predicted value. Cosmological models based on $f(R)$ gravity theories have scale-dependent growth indices, whose values are even more at odds with the growth rate data. In this work, we evaluate the growth index in the $\\gamma\\delta$CDM model both theoretically and numerically. Although based on $f(R)$ gravity theory, we show through several analyses with different combinations of datasets that the growth index in the $\\gamma\\delta$CDM model is very close in value to the $\\Lambda$CDM and the $\\omega$CDM models. The growth of structure is suppressed in the $\\gamma\\delta$CDM model, which is formulated with the extended gravitational growth framework. Upon analyzing cosmological data, we ascertain that the $\\gamma\\delta$CDM model is equally competitive as the $\\Lambda$CDM and the $\\omega$CDM models.",
      "pdf_url": "https://arxiv.org/pdf/2508.14749.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.05618",
      "title": "Primordial Black Holes Evaporating before Big Bang Nucleosynthesis",
      "authors": [
        "Quan-feng Wu",
        "Xun-Jie Xu"
      ],
      "abstract": "Primordial Black Holes Evaporating before Big Bang Nucleosynthesis Quan-feng Wu, Xun-Jie Xu 26 pages, 7 figures, more calculations added, accepted by JCAP, code available at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Primordial black holes (PBHs) formed from the collapse of density fluctuations provide a unique window into the physics of the early Universe. Their evaporation through Hawking radiation around the epoch of Big Bang nucleosynthesis (BBN) can leave measurable imprints on the primordial light-element abundances. In this work, we analyze in detail the effects of PBHs evaporating before BBN, with various intermediate steps understood analytically, and obtain the BBN constraint on PBHs within a transparent and reproducible framework. We find that, to produce observable effects on BBN, the PBH mass must exceed $10^{9}$ g, a threshold higher than that reported in some earlier studies. Slightly above $10^{9}$ g, the BBN sensitivity rapidly increases with the mass and then decreases, with the turning point occurring at $2\\times10^{9}$ g. For PBHs in the mass range $[10^{9},\\ 10^{10}]$ g, current measurements of BBN observables set an upper bound on the initial mass fraction parameter $\\beta$ ranging from $10^{-17}$ to $10^{-19}$. To facilitate future improvements, we make our code publicly available, enabling straightforward incorporation of updated nuclear reaction rates, particle-physics inputs, and cosmological data.",
      "pdf_url": "https://arxiv.org/pdf/2509.05618.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.00076",
      "title": "RHINO: A large horn antenna for detecting the 21cm global signal",
      "authors": [
        "Philip Bull",
        "Ahmed El-Makadema",
        "Hugh Garsden",
        "John Edgley",
        "Neil Roddis",
        "Jens Chluba",
        "Christopher J. Conselice",
        "Sohini Dutta",
        "Katrine A. Glasscock",
        "Ainulnabilah Nasirudin",
        "Jordan Norris",
        "Michael J. Wilensky",
        "Isabelle Ye",
        "Zheng Zhang"
      ],
      "abstract": "RHINO: A large horn antenna for detecting the 21cm global signal Philip Bull, Ahmed El-Makadema, Hugh Garsden, John Edgley, Neil Roddis, Jens Chluba, Christopher J. Conselice, Sohini Dutta, Katrine A. Glasscock, Ainulnabilah Nasirudin, Jordan Norris, Michael J. Wilensky, Isabelle Ye, Zheng Zhang 19 pages, 17 figures. Matches published version RAS Techniques and Instruments, Volume 4, 2025, rzaf046 Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The sky-averaged brightness temperature of the 21cm line from neutral hydrogen provides a sensitive probe of the thermal state of the intergalactic medium, particularly before and during Cosmic Dawn and the Epoch of Reionisation. This `global signal' is faint, on the order of tens to hundreds of millikelvin, and spectrally relatively smooth, making it exceedingly difficult to disentangle from foreground radio emission and instrumental artefacts. In this paper, we introduce RHINO, an experiment based around a large horn antenna operating from 60-85 MHz. Horn antennas are highly characterisable and provide excellent shielding from their immediate environment, which are potentially decisive advantages when it comes to the beam measurement and modelling problems that are particularly challenging for this kind of experiment. The system also includes a novel continuous wave calibration source to control correlated gain fluctuations, allowing continuous monitoring of the overall gain level without needing to rapidly switch between the sky and a calibration source. Here, we describe the basic RHINO concept, including the antenna design, EM simulations, and receiver electronics. We use a basic simulation and analysis pipeline to study the impact of the limited bandwidth on recovery of physical 21cm global signal model parameters, and discuss a basic calibration scheme that incorporates the continuous wave signal. Finally, we report on the current state of a scaled-down prototype system under construction at Jodrell Bank Observatory.",
      "pdf_url": "https://arxiv.org/pdf/2410.00076.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.10220",
      "title": "Kinematic Confirmation of a Remarkable Linear Trail of Galaxies in the NGC 1052 Field, Consistent with Formation in a High-Speed Bullet Dwarf Collision",
      "authors": [
        "Michael A. Keim",
        "Pieter van Dokkum",
        "Zili Shen",
        "Harrison Souchereau",
        "Imad Pasha",
        "Shany Danieli",
        "Roberto Abraham",
        "Aaron J. Romanowsky",
        "Yimeng Tang"
      ],
      "abstract": "Kinematic Confirmation of a Remarkable Linear Trail of Galaxies in the NGC 1052 Field, Consistent with Formation in a High-Speed Bullet Dwarf Collision Michael A. Keim, Pieter van Dokkum, Zili Shen, Harrison Souchereau, Imad Pasha, Shany Danieli, Roberto Abraham, Aaron J. Romanowsky, Yimeng Tang Accepted for publication in ApJ (as in prior version). New this version: minor typos identified in proofs by the ApJ team (prior to publication of final version) are hereby corrected Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) A unique linear trail of diffuse galaxies was recently identified in the NGC 1052 field. This trail includes the remarkable, ultra-diffuse galaxies DF2 and DF4 which lack dark matter and host unusually luminous globular clusters. It has been proposed that the trail formed via a high-speed collision between two gas-rich dwarf galaxies. This scenario predicts that the trail galaxies are kinematically connected and follow a specific trend in radial velocity as a function of position, based on the known velocities and positions of DF2 and DF4. To test this hypothesis, we measured radial velocities for seven additional galaxies on the trail. While the galaxies' low surface brightnesses presented observational challenges, we employ several methods to obtain measurements for galaxies with effective surface brightnesses up to 28.6 mag arcsec$^{-2}$, including a narrow slit placed over globular clusters and a novel wide slit mode on Keck/LRIS, as well as a 'light bucket' mode on Keck/KCWI. We find that five of our seven targets follow the precise velocity trend predicted by DF2 and DF4, to a degree with just a 2% chance of randomly occurring. Moreover, the trail galaxies' radial velocities are significantly higher than those of the NGC 1052 group, setting it apart as a separate, kinematically connected system. Our findings support the theory that this trail of galaxies, including DF2 and DF4, formed together in a single event. A 'bullet dwarf' collision remains the only known explanation for all the unusual properties of DF2, DF4, and the associated trail of galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2506.10220.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.14664",
      "title": "NGC 3521 as the Milky Way near twin: spectral energy distribution from UV to radio decameter ranges",
      "authors": [
        "O.V. Kompaniiets",
        "I.B. Vavilova",
        "Y.V. Vasylkivskyi",
        "O.O. Konovalenko",
        "O.S.Pastoven",
        "I.O. Izviekova",
        "Junais",
        "A.M. Dmytrenko",
        "D.V. Dobrycheva",
        "P.N. Fedorov",
        "V.P. Khramtsov",
        "O. Sergijenko",
        "A.A. Vasylenko"
      ],
      "abstract": "NGC 3521 as the Milky Way near twin: spectral energy distribution from UV to radio decameter ranges O.V. Kompaniiets, I.B. Vavilova, Y.V. Vasylkivskyi, O.O. Konovalenko, O.S.Pastoven, I.O. Izviekova, Junais, A.M. Dmytrenko, D.V. Dobrycheva, P.N. Fedorov, V.P. Khramtsov, O. Sergijenko, A.A. Vasylenko 17 pages, 10 figures, 5 tables, 3 appendices Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Milky Way analogues (MWAs) are usually selected from structural and kinematic properties, but robust SED-based similarity criteria are limited by heterogeneous photometry and incomplete wavelength coverage. We present a homogeneous, aperture-photometry SED of the Milky Way near-twin NGC~3521 from the ultraviolet to the radio decameter range. Fluxes are measured within a fixed elliptical isophotal aperture using GALEX, SDSS, WISE, Spitzer/MIPS, Herschel/PACS+SPIRE, and VLA data, and supplemented by meter/decameter constraints. We report new observations obtained in Jan-Feb 2022 with the Ukrainian T-shape radio telescope and derive, for the first time, an upper limit in the 24--32~MHz band. The UV-to-decameter SED (27 points) is modelled with \\textsc{CIGALE}, including a dedicated low-frequency radio prescription (\\texttt{radio_extra}) that accounts for emission and absorption effects. Using ZTF and NEOWISE data (2014--2025), we detect genuine nuclear variability; optical trends at $\\sim2^{\\prime\\prime}$ primarily trace the compact nucleus, while NEOWISE variability reflects a mix of nuclear changes and warm-dust emission within the larger aperture. The preferred fit yields $M_\\star \\simeq 6.0\\times10^{10},M_\\odot$, ${\\rm SFR}\\simeq1.65,M_\\odot,{\\rm yr}^{-1}$, $M_{\\rm dust}\\simeq1.3\\times10^{8},M_\\odot$, and an effective dust temperature of $\\sim23$~K. The decameter constraint gives $S_{28,{\\rm MHz}}<11.22$~Jy, consistent with expectations for a Milky Way-like system placed at 10.7~Mpc. We conclude that an integrated, homogeneous SED, especially below 100~MHz, provides a complementary diagnostic for identifying and validating MWAs and for interpreting how Milky Way properties would appear to an external observer.",
      "pdf_url": "https://arxiv.org/pdf/2512.14664.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23758",
      "title": "Machine-Learning Classification of Neutron-Star Matter Composition from Macroscopic and Oscillation Observables",
      "authors": [
        "Wasif Husain"
      ],
      "abstract": "Machine-Learning Classification of Neutron-Star Matter Composition from Macroscopic and Oscillation Observables Wasif Husain High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) The microscopic composition of neutron star interiors remains uncertain, with possible scenarios including nucleonic matter, hyperonic matter, dark matter admixed cores, and strange self-bound matter. Traditional constraints on the equation of state rely on Tolman Oppenheimer Volkoff modelling and comparison with multimessenger observations, but machine learning provides a complementary pathway by learning composition dependent patterns directly from astrophysically accessible observables. This work presents a compact supervised learning framework for EOS family classification using stellar properties derived from TOV modelling, asteroseismology, and gravitational wave descriptors. A labelled dataset of neutron star configurations spanning four EOS families (nucleonic, strange matter, dark matter admixed, and hyperonic) is constructed using seven input features: gravitational mass, radius, fundamental f mode frequency, quadrupole moment, redshift, damping time, and characteristic strain. A multilayer perceptron is trained to infer the underlying matter composition. On a held out test set, the classifier achieves an accuracy of 97.4 percent with strong class wise precision and recall. Permutation based feature importance analysis shows that oscillation related quantities, especially the f mode frequency and damping time, dominate the discriminatory power, while mass and radius provide secondary support. Residual misclassifications occur in physically intuitive regions where different EOS families produce partially overlapping macroscopic signatures. These results show that lightweight neural models can reliably identify EOS family fingerprints from a modest set of observables, providing a reproducible baseline for future extensions incorporating Bayesian uncertainty and observational posteriors from NICER and gravitational wave events.",
      "pdf_url": "https://arxiv.org/pdf/2512.23758.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.23815",
      "title": "COBIPLANE: A Systematic Search for Compact Binary Millisecond Pulsars at Low Galactic Latitudes",
      "authors": [
        "Marco Turchetta",
        "Manuel Linares",
        "Karri Koljonen",
        "Paulo A. Miles-Páez",
        "Jordan A. Simpson"
      ],
      "abstract": "COBIPLANE: A Systematic Search for Compact Binary Millisecond Pulsars at Low Galactic Latitudes Marco Turchetta, Manuel Linares, Karri Koljonen, Paulo A. Miles-Páez, Jordan A. Simpson 38 pages, 87 figures, 5 tables. This paper has been accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present the main results obtained from the COmpact BInary Pulsar search in the low-LAtitude NEighborhood (COBIPLANE), an optical photometric survey designed to find new `spider' binary millisecond pulsars. We conducted observations targeting 30 unidentified sources from the 4FGL-DR3 Fermi Large Area Telescope (Fermi-LAT) catalog, selected for their pulsar-like $\\gamma$-ray properties. Extending to Galactic latitudes as low as $\\pm3^{\\circ}$, this survey reaches closer to the Galactic plane than its predecessor survey, the COmpact BInary PULsar SEarch (COBIPULSE). We report the discovery of five optical variables coincident with the localizations of 4FGL J0821.5-1436, 4FGL J1517.9-5233, 4FGL J1639.3-5146, 4FGL J1748.8-3915, and 4FGL J2056.4+3142. These systems show optical flux modulation at the presumed orbital periods of $0.41576(6) \\ \\mathrm{d}$, $0.305(2) \\ \\mathrm{d}$, $0.204(7) \\ \\mathrm{d}$, $0.3(2) \\ \\mathrm{d}$, and $0.4395(1) \\ \\mathrm{d}$, respectively, and photometric temperatures of $4000$--$6000 \\ \\mathrm{K}$, consistent with the companion stars of `redback' subtype of spider pulsar binaries. Based on their optical light curve shapes and X-ray properties characteristic for spider systems -- namely, a luminosity of $1.5 \\times 10^{32} \\ (D / 3.9 \\ \\mathrm{kpc})^2 \\ \\mathrm{erg} \\ \\mathrm{s}^{-1}$ ($0.3$--$10 \\ \\mathrm{keV}$) for 4FGL J1748.8-3915, and upper limits of $\\sim10^{31}$--$10^{33} \\ \\mathrm{erg} \\ \\mathrm{s}^{-1}$ ($0.2$--$12 \\ \\mathrm{keV}$) for the others -- we classify these sources as new spider candidate systems.",
      "pdf_url": "https://arxiv.org/pdf/2512.23815.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23826",
      "title": "A secondary orbiter under collisions with an accretion disk",
      "authors": [
        "Vladimir Karas"
      ],
      "abstract": "A secondary orbiter under collisions with an accretion disk Vladimir Karas Write-up from a conference: Proceedings of RAGtime #26--28: Workshops on black holes and neutron stars (Silesian University in Opava), 11 pp., in prep High Energy Astrophysical Phenomena (astro-ph.HE) Dynamics of stellar orbits in dense stellar systems and nuclear star clusters (NSC) with an embedded supermassive black hole (SMBH) is governed a complex interplay of different forces. In particular, star--star gravitational collisions (relaxation), physical collisions between stars, and the hydrodynamical interaction with any surrounding gaseous environment, such as an accretion disk. These processes influence the stellar distribution, the feeding of the central black hole, and the generation of observable phenomena. Furthermore, the self-gravity of the accretion medium modulates the long-term evolution, adding significant complexity to the system's dynamics. By employing elementary arguments we outline the mentioned influences in their mutual competition.",
      "pdf_url": "https://arxiv.org/pdf/2512.23826.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23999",
      "title": "Time-Dependent Accretion Disks with Magnetically Driven Winds: Green's Function Solutions",
      "authors": [
        "Mageshwaran Tamilan"
      ],
      "abstract": "Time-Dependent Accretion Disks with Magnetically Driven Winds: Green's Function Solutions Mageshwaran Tamilan (Manipal Centre for Natural Sciences, Manipal Academy of Higher Education, India) 44 pages, 12 figures, accepted for publication in Progress of Theoretical and Experimental Physics (PTEP) High Energy Astrophysical Phenomena (astro-ph.HE) We present Green's function solutions for a geometrically thin, one-dimensional Keplerian accretion disk that includes angular momentum extraction and mass loss due to magnetohydrodynamic (MHD) winds. The disk viscosity is assumed to vary radially as $\\nu \\propto r^{n}$. We derive solutions for three types of boundary conditions applied at the inner radius $r_{\\rm in}$: (i) zero torque, (ii) zero mass accretion rate, and (iii) finite torque and finite accretion rate, and investigate the time evolution of a disk with an initial surface density represented by a Dirac-delta function. The mass accretion rate at the inner radius decays with time as $t^{-3/2}$ for $n = 1$ at late times in the absence of winds under the zero-torque condition, consistent with Lynden-Bell \\& Pringle (1974), while the presence of winds leads to a steeper decay. All boundary conditions yield identical asymptotic time evolution for the accretion and wind mass-loss rates, though their radial profiles differ near $r_{\\rm in}$. Applying our solutions to protoplanetary disks, we find that the disk follows distinct evolutionary tracks in the accretion rate-disk mass plane depending on $\\psi$, a dimensionless parameter that regulates the strength of the vertical stress driving the wind, with the disk lifetime decreasing as $\\psi$ increases due to enhanced wind-driven mass loss. The inner boundary condition influences the evolution for $\\psi < 1$ but becomes negligible at higher $\\psi$, indicating that strong magnetically driven winds dominate and limit mass inflow near the boundary. Our Green's function solutions offer a general framework to study the long-term evolution of accretion disks with magnetically driven winds.",
      "pdf_url": "https://arxiv.org/pdf/2512.23999.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24003",
      "title": "Machine-learning approaches to dispersion measure estimation for fast radio bursts",
      "authors": [
        "Hosein Rajabi",
        "Zhejian Liu",
        "Fereshteh Rajabi",
        "Martin Houde"
      ],
      "abstract": "Machine-learning approaches to dispersion measure estimation for fast radio bursts Hosein Rajabi, Zhejian Liu, Fereshteh Rajabi, Martin Houde 13 pages, 6 figures, and 8 tables High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs) are bright, mostly millisecond-duration transients of extragalactic origin whose emission mechanisms remain unknown. As FRB signals propagate through ionized media, they experience frequency-dependent delays quantified by the dispersion measure (DM), a key parameter for inferring source distances and local plasma conditions. Accurate DM estimation is therefore essential for characterizing FRB sources and testing physical models, yet current dedispersion methods can be computationally intensive and prone to human bias. In this proof-of-concept study, we develop and benchmark three deep-learning architectures, a conventional convolutional neural network (CNN), a fine-tuned ResNet-50, and a hybrid CNN-LSTM model, for automated DM estimation. All models are trained and validated on a large set of synthetic FRB dynamic spectra generated using CHIME/FRB-like specifications. The hybrid CNN-LSTM achieves the highest accuracy and stability while maintaining low computational cost across the investigated DM range. Although trained on simulated data, these models can be fine-tuned on real CHIME/FRB observations and extended to future facilities, offering a scalable pathway toward real-time, data-driven DM estimation in large FRB surveys.",
      "pdf_url": "https://arxiv.org/pdf/2512.24003.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24085",
      "title": "SSC Radiation in the ICMART Model: Spectral Simulations and Application to the Record-Breaking GRB 221009A",
      "authors": [
        "Xueying Shao",
        "He Gao"
      ],
      "abstract": "SSC Radiation in the ICMART Model: Spectral Simulations and Application to the Record-Breaking GRB 221009A Xueying Shao, He Gao High Energy Astrophysical Phenomena (astro-ph.HE) This paper presents simulations of the synchrotron self-Compton (SSC) spectrum within the Internal-Collision-induced Magnetic Reconnection and Turbulence (ICMART) model. We investigate how key parameters like the magnetization $\\sigma_0$ shape the broadband spectral energy distribution by regulating the electron distribution and magnetic field strength. The overall spectrum typically comprises two components: synchrotron radiation peaking at $E_{\\rm p}$ with a low-energy spectral index $\\alpha$ between -1 and -1.5, and an SSC component peaking at $E_{\\rm ssc}$. At high energies, Klein-Nishina suppression causes an exponential cutoff. The flux ratio Y between these components is critical: when Y is small, the SSC peak can be suppressed. Spectral features of the synchrotron component reveal the underlying physical conditions: harder spectra with $\\alpha\\sim-1$ indicate a large Y parameter and strong KN suppression. We find a positive correlation between Y and $\\sigma_0$, contrasting with internal shock model predictions. Applied to GRB 221009A, our model suggests $\\sigma_0\\leq20$ can reproduce the MeV-TeV observations. This study underscores the value of combined MeV-TeV observations in probing GRB emission mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2512.24085.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24141",
      "title": "Evolution of Accretion Properties in Mrk 1040 using long-term X-ray Observations",
      "authors": [
        "Prantik Nandi",
        "Narendranath Layek",
        "Sandip K Chakrabarti",
        "Sachindra Naik",
        "Priyadarshee P. Dash"
      ],
      "abstract": "Evolution of Accretion Properties in Mrk 1040 using long-term X-ray Observations Prantik Nandi, Narendranath Layek, Sandip K Chakrabarti, Sachindra Naik, Priyadarshee P. Dash High Energy Astrophysical Phenomena (astro-ph.HE) We present a comprehensive long-term, multi-epoch spectral and timing study of the Seyfert 1 Active Galactic Nucleus (AGN) Mrk~1040, utilizing X-ray observations spanning from 2009 to 2024 ($\\sim$15 years). The source exhibits pronounced spectral and temporal variability, indicative of transitions between different accretion regimes in the vicinity of the central supermassive black hole. The earlier reported soft excess is re-examined within a uniform, physically motivated multi-epoch framework. We confirm the presence of this soft excess in the 2009 observation, where it is well described by a warm, extended Comptonizing corona with $kT_{\\rm e,warm} \\sim 0.26$~keV and a radial extent of $R_{\\rm warm} \\sim 30~r_g$. In subsequent epochs, the soft excess is not statistically significant, possibly due to a combination of enhanced ionized absorption, intrinsic weakening of the warm Comptonizing region, or partial truncation of the inner disc. A strong correlation between the soft and hard X-ray fluxes suggests a common physical origin for both components, likely within a multi-layered Comptonizing structure that evolved into a compact and thermally stable corona after 2013. The observed spectral variability, together with changes in the Fe~K$\\alpha$ line strength, reflects the evolving coronal geometry and accretion flow dynamics. Variations in the intrinsic column density ($N_H$) further indicate that Mrk~1040 is embedded within a clumpy, dynamically variable absorber responding to changes in the accretion rate. Using the TCAF model, we estimate the black hole mass as $M_{\\rm BH} = (4.50 \\pm 1.62) \\times 10^7~M_\\odot$, consistent with previous estimates.",
      "pdf_url": "https://arxiv.org/pdf/2512.24141.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24178",
      "title": "A Seyfert galaxy as a hidden counterpart to a neutrino-associated blazar",
      "authors": [
        "Emma Kun",
        "Santiago del Palacio",
        "Imre Bartos",
        "Francis Halzen",
        "Julia Becker Tjus",
        "Peter L. Biermann",
        "Anna Franckowiak",
        "Claudio Ricci"
      ],
      "abstract": "A Seyfert galaxy as a hidden counterpart to a neutrino-associated blazar Emma Kun, Santiago del Palacio, Imre Bartos, Francis Halzen, Julia Becker Tjus, Peter L. Biermann, Anna Franckowiak, Claudio Ricci 12 pages, 4 figures. Submitted. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) The origin and production mechanisms of high-energy astrophysical neutrinos remain open questions in multimessenger astronomy. Previous studies have hinted at a possible linear correlation between the hard X-ray and high-energy neutrino emission in active galactic nuclei. New \\textit{NuSTAR} observations, first presented here, reveal that blazar PKS 1424+240, located within a prominent IceCube neutrino hotspot, is far fainter in hard X-rays than expected from this trend. Motivated by this apparent ambiguity, we identify the nearby Seyfert galaxy NGC 5610, also coincident with the hotspot, whose unabsorbed hard X-ray flux exceeds that of PKS 1424+240 by about an order of magnitude. When the local IceCube neutrino flux is apportioned between the two AGN in proportion to their hard X-ray emission, both align with the previously suggested X-ray-neutrino correlation. This suggests that certain IceCube hotspots may be unresolved blends of multiple AGN, and supports a multimessenger scenario in which high-energy neutrinos and hard X-rays originate from the same hadronic interactions, with the X-ray emission produced through cascade reprocessing.",
      "pdf_url": "https://arxiv.org/pdf/2512.24178.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24203",
      "title": "Abundance Stratification in Type Iax SN 2020rea with TARDIS",
      "authors": [
        "Sohini Kayal",
        "P. Gayatri",
        "Mridweeka Singh",
        "Kuntal Misra"
      ],
      "abstract": "Abundance Stratification in Type Iax SN 2020rea with TARDIS Sohini Kayal, P. Gayatri, Mridweeka Singh, Kuntal Misra 10 pages, 4 figures, accepted for publication in Journal of Astrophysics and Astronomy High Energy Astrophysical Phenomena (astro-ph.HE) Using the 1D Monte Carlo-based radiative transfer code TARDIS, we investigate the spectral evolution of the Type Iax supernova (SN) 2020rea from -7 days before to +21 days after maximum light. Our best-fit models indicate stratified, velocity-dependent abundances at early times, successfully reproducing most observed spectral features. As the SN evolves, the ejecta transition from a layered to a more homogeneous composition, posing an alternative to pure deflagration models that predict fully mixed ejecta. These results highlight the need for further investigation, as current pure deflagration models cannot fully explain the origin or spectral properties of Type Iax SNe like SN 2020rea.",
      "pdf_url": "https://arxiv.org/pdf/2512.24203.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24228",
      "title": "H.E.S.S. detection and multi-wavelength study of the $z \\sim$ 1 blazar PKS 0346$-$27",
      "authors": [
        "H.E.S.S. collaboration"
      ],
      "abstract": "H.E.S.S. detection and multi-wavelength study of the $z \\sim$ 1 blazar PKS 0346$-$27 H.E.S.S. collaboration Accepted for publication in A&A; Corresponding authors: O. Chibueze, B. Bi, M. Boettcher, F. Jankovsky, A. Luashvili High Energy Astrophysical Phenomena (astro-ph.HE) PKS 0346-27 is a Low Synchrotron Peaked (LSP) blazar at redshift 0.991. The very-high-energy (VHE, E > 100 GeV) spectra of blazars are always affected by $\\gamma\\gamma$ absorption by the Extragalactic Background Light (EBL) and subsequently, no blazars have been detected in VHE $\\gamma$-rays at redshifts exceeding 1. Extending the redshift range of VHE-detected blazars to $z \\gtrsim 1$ will yield insights into the cosmological evolution of both the VHE blazar population and the EBL. This is the goal of a target-of-opportunity (ToO) programme by H.E.S.S. to observe flaring high-redshift ($z \\gtrsim 1$) blazars. We report on H.E.S.S. ToO and multi-wavelength observations of the blazar PKS\\,0346$-$27. Along with H.E.S.S., simultaneous data from {\\it Fermi}-LAT, {\\it Swift} (XRT and UVOT), and ATOM have been analysed and modelled using single-zone leptonic and hadronic models. PKS~0346-27 has been detected by H.E.S.S at a significance of 6.3$\\sigma$ during one night, on 3 November 2021, while for other nights before and after this day, upper limits on the VHE flux are determined. No evidence for intra-night $\\gamma$-ray variability has been found. A flare in high-energy (HE, $E > 100$~MeV) $\\gamma$-rays detected by {\\it Fermi}-LAT preceded the H.E.S.S. detection by 2 days. A fit with a single-zone emission model to the contemporaneous spectral energy distribution during the detection night was possible with a proton-synchrotron-dominated hadronic model, requiring a proton-kinetic-energy-dominated jet power temporarily exceeding the source's Eddington limit, although alternative (e.g. multi-zone) models can not be ruled out. A one-zone leptonic model is, in principle, also able to fit the flare-state SED, however, requiring implausible parameter choices, in particular, extreme Doppler and bulk Lorentz factors of $\\gtrsim 80$.",
      "pdf_url": "https://arxiv.org/pdf/2512.24228.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24257",
      "title": "Improved lanthanide constraints for the kilonova AT 2017gfo",
      "authors": [
        "J. H. Gillanders",
        "A. Flors",
        "R. Ferreira da Silva"
      ],
      "abstract": "Improved lanthanide constraints for the kilonova AT 2017gfo J. H. Gillanders, A. Flors, R. Ferreira da Silva Submitted to MNRAS; comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Spectroscopic observations of the kilonova AT 2017gfo provide a unique opportunity to identify signatures from individual heavy elements freshly synthesised via the {\\it r}-process, the nucleosynthetic channel responsible for producing $\\sim$half of all trans-iron-group elements. Limitations in the available atomic data have historically hampered comprehensive line identification studies; however, renewed interest has led to the generation of improved (more complete and accurately calibrated) line lists for {\\it r}-process species. Here we demonstrate the utility of such data, by exploiting newly generated line lists for the lanthanides to model the photospheric-phase 3.4d X-shooter spectrum of AT 2017gfo with the radiative transfer tool \\textsc{tardis}. We find the data can only be reproduced by invoking a substantially diminished lanthanide mass fraction ($X_{\\textsc{ln}}$) than that proposed by previous studies. Specifically, our model necessitates $X_{\\textsc{ln}} \\approx 2.5 \\times 10^{-3}$, a value $20 \\times$ lower than previously claimed. This substantial reduction in $X_{\\textsc{ln}}$ is driven by our inclusion of much more complete lanthanide line information that enables better estimation of their total contribution to the observations. We encourage future modelling works to exploit all atomic data advances, and also encourage continued efforts to generate the necessary data for the remaining {\\it r}-process species of interest.",
      "pdf_url": "https://arxiv.org/pdf/2512.24257.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24563",
      "title": "Evidence for the transition from thermal to non-thermal emission in the prompt emission of GRB 161117A",
      "authors": [
        "Xue-Zhao Chang",
        "HouJun Lü",
        "Jia-Ming Chen",
        "En-Wei Liang"
      ],
      "abstract": "Evidence for the transition from thermal to non-thermal emission in the prompt emission of GRB 161117A Xue-Zhao Chang, HouJun Lü, Jia-Ming Chen, En-Wei Liang 18 pages, 7 figures, and 2 tables. Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) GRB 161117A is a long-duration GRB with three main overlapping peaks. By analyzing the time-resolved spectra of its data observed with the Gamma-Ray Burst Monitor (GBM) on board the Fermi mission, we find that the spectral evolution shows a transition from thermal (single BB) to hybrid (PL$+$BB), and finally to non-thermal (Band and CPL) emissions. Such a transition suggests that the jet composition of GRB 161117A should be changed from a fireball to a Poynting-flux-dominated jet. The bulk Lorentz factor ($\\Gamma_{\\rm ph}$), radii ($R_{\\rm ph}$ and $R_{0}$), magnetization factor at the central engine ($\\sigma_0$), and dimensionless entropy ($\\eta$) of the outflow can be inferred by invoking the observed quasi-thermal component within two models (e.g., pure fireball and hybrid). It is found that $\\Gamma_{\\rm ph}$ seems to be tracking with the light curve, and $R_{0}$ remains a constant at $\\sim$ $10^{8}$ cm. The low magnetization ($1+\\sigma_0 \\sim$ 1) and high dimensionless entropy ($\\eta \\gg$ 1) during the first seven time-intervals suggest to be a pure fireball outflow. Moreover, we also estimate the lower limit of magnetization parameter at the photosphere radius ($\\sigma_{\\rm ph}\\sim 1.4$ and 0.75) for late phase via the non-thermal spectra, and it indicates that the particle acceleration mechanism is dominated by internal shocks rather than magnetic dissipation processes. Finally, the $\\nu \\bar{\\nu}$ annihilation mechanism of NDAF model to explain the thermal emission of GRB 161117A is also discussed.",
      "pdf_url": "https://arxiv.org/pdf/2512.24563.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24729",
      "title": "The role of PSR J0614-3329 in defining the high-density matter at Neutron star cores",
      "authors": [
        "Asim Kumar Saha",
        "Tuhin Malik",
        "Ritam Mallick"
      ],
      "abstract": "The role of PSR J0614-3329 in defining the high-density matter at Neutron star cores Asim Kumar Saha, Tuhin Malik, Ritam Mallick 17 pages, 10 Figures and 3 Tables High Energy Astrophysical Phenomena (astro-ph.HE) In this work, we investigate how astrophysical observations from NICER and GW data constrain the matter properties at high densities, with a primary focus on the recent PSR J0614-3329 data. We have constructed three distinct classes of an ensemble of agnostic equation of state by speed of sound parametrisation. Bayesian inference is then employed to constrain the EoS construction parameters-namely, the squared speed of sound and chemical potential at each interpolation segment-using the observational data. Both the NICER and GW constraints hint towards a smoother EoS where PT occurs late, significantly reducing the maximum mass of NS. Also, the maximum-mass and maximum-compact sequences are distinctly different, as the former allows for the maximally stiff EoS to maximise the star mass. In contrast, the latter prefers a softer low-density and stiffer high-density EoS to maximise the compactness. The Bayesian analysis demonstrates that the observational bounds are effective in significantly constraining the low-density region of the equation of state. It is also seen that the astrophysical bound prefers the phase transition in the intermediate-density range and also prefers a small density jump for a discontinuous equation of state.",
      "pdf_url": "https://arxiv.org/pdf/2512.24729.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24936",
      "title": "Searching for Periodicity in FRB 20240114A",
      "authors": [
        "J. I. Katz"
      ],
      "abstract": "Searching for Periodicity in FRB 20240114A J. I. Katz High Energy Astrophysical Phenomena (astro-ph.HE) FRB 20240114A is extraordinarily active, and therefore presents an opportunity to search for the periodicity predicted by magnetar models of Fast Radio Bursts (FRB). Zhang, et al. (2025) observed 11,553 bursts, including 3196 on MJD 60381 (March 12, 2024). We find no significant peak in the periodogram of those bursts, which occur within 15628 s, short enough that even with a characteristic slowing age of 1 year a signal with period $\\ge 0.1\\,$s it would not significantly dephase within the observation. Introducing modulation artificially shows that an amplitude of 0.15 would have been detected robustly. Implications for magnetar models of FRB are briefly considered.",
      "pdf_url": "https://arxiv.org/pdf/2512.24936.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24054",
      "title": "The role of particle feedback on particle acceleration in magnetic reconnection",
      "authors": [
        "Shimin Liang",
        "Nianyu Yi"
      ],
      "abstract": "The role of particle feedback on particle acceleration in magnetic reconnection Shimin Liang, Nianyu Yi 9 pages, 7 figures, 1 table, accepted for publication in PoP Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE) Magnetic reconnection is a ubiquitous process in astrophysical plasmas and an efficient mechanism for particle acceleration. Using 2.5D magnetohydrodynamic (MHD) simulations with a co-evolving fluid-particle framework, we investigate how particle feedback affects reconnection and acceleration. Our simulations demonstrate that particle feedback to the fluid amplifies shear flows within magnetic islands, which strengthens the convective electric field and thereby boosts particle acceleration. This mechanism results in a higher maximum particle energy and a harder non-thermal energy spectrum. The guide field suppresses both the increase in gas internal energy and particle acceleration. These findings highlight the complex interplay between feedback, guide fields, and reconnection dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2512.24054.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24187",
      "title": "Connecting disc-corona physics and ionised outflows in AGN in the 2040s",
      "authors": [
        "Susanna Bisogni",
        "Giustina Vietri",
        "Andrea Travascio",
        "Adriana Gargiulo",
        "Chiara Mancini",
        "Swayamtrupta Panda"
      ],
      "abstract": "Connecting disc-corona physics and ionised outflows in AGN in the 2040s Susanna Bisogni, Giustina Vietri, Andrea Travascio, Adriana Gargiulo, Chiara Mancini, Swayamtrupta Panda Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers) Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We outline a science case for next-generation wide-field spectroscopic surveys aimed at connecting the physics of the accretion disc and X-ray corona in active galactic nuclei (AGN) with the properties of their nebular regions and circumgalactic medium (CGM). We focus on the non-linear Lx-Luv relation and on deviations from this canonical coupling encoded in $\\Delta \\alpha_{OX}$, the offset of the optical-to-X-ray index from the mean relation, and propose to use broad and narrow line emission and CGM nebulae as calorimeters of the ionising SED to trace different accretion \"states\". We propose an observational strategy based on rest-frame UV/optical spectroscopy of $\\sim 10^{4}-10^{5}$ AGN, a time-domain reverberation-mapping tier for a well-defined subsample, coordinated X-ray coverage, and wide-field IFU mapping of CGM emission (including H$\\alpha$ and Ly$\\alpha$). From these goals we derive requirements for a future ESO facility in the 2040s: a dedicated, wide-field, high-multiplex optical-NIR spectroscopic telescope with time-domain flexibility and arcmin-scale IFU capability.",
      "pdf_url": "https://arxiv.org/pdf/2512.24187.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24363",
      "title": "The sun as colliding beam, betatron cosmic ray factory",
      "authors": [
        "Richard M. Talman"
      ],
      "abstract": "The sun as colliding beam, betatron cosmic ray factory Richard M. Talman Accelerator Physics (physics.acc-ph); High Energy Astrophysical Phenomena (astro-ph.HE) A theory of cosmic ray production within the solar system (not extra-galactic) is presented. The sun's time variable magnetic flux linkage makes the sun (as well, perhaps, as Jupiter) a natural, all-purpose, betatron storage ring, with semi-infinite acceptance aperture, capable of storing and accelerating counter-circulating, opposite-sign, colliding beams. The puzzle of how positrons and anti-protons can be well represented at all energies, is explained, initially, by the low energy capture of particles of either sign by the sun's magnetic dipole field. Later, as the magnetic field bending has become negligible compared to the gravitational bending, both positive and negative beams will have survived the gradual transition from predominantly magnetic to predominantly gravitational bending. Later, anti-particles produced in QED beam-beam collisions of sufficiently high energy, are also accelerated. The high quality of cosmic ray data collected over recent decades, at steadily increasing energies, especially by the International Space Station (ISS), make the study of cosmic ray production mechanisms both timely and essential. The paper describes how longitudinal electric fields, explained by the Parker solar wind theory can enable the sun to serve as a ``booster'' accelerator of cosmic rays, increasing the maximum cosmic ray energies enough to produce the observed 13 orders of magnitude maximum particle energy and the energy flux needed to maintain the observed cosmic ray atmosphere equilibrium within the solar system. A steady state mechanism is described, based on semi-quantitative discussion of a relativistic Hamilton-Jacobi formalism, according to which the highest energy cosmic rays observed can have been produced by the Parker longitudinal electric field component, during fractionally brief, but periodic, circular or semi-circular turns centered on the sun.",
      "pdf_url": "https://arxiv.org/pdf/2512.24363.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24425",
      "title": "Turbulence-Driven Corrugation of Collisionless Fast-Magnetosonic Shocks",
      "authors": [
        "Immanuel Christopher Jebaraj",
        "Mikhail Malkov",
        "Nicolas Wijsen",
        "Jens Pomoell",
        "Vladimir Krasnoselskikh",
        "Nina Dresing",
        "Rami Vainio"
      ],
      "abstract": "Turbulence-Driven Corrugation of Collisionless Fast-Magnetosonic Shocks Immanuel Christopher Jebaraj, Mikhail Malkov, Nicolas Wijsen, Jens Pomoell, Vladimir Krasnoselskikh, Nina Dresing, Rami Vainio Main text: 15 pages, 6 figures. Appendix: 5 pages Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE); Space Physics (physics.space-ph) Collisionless fast-magnetosonic shocks are often treated as smooth, planar boundaries, yet observations point to organized corrugation of the shock surface. A plausible driver is upstream turbulence. Broadband fluctuations arriving at the front can continually wrinkle it, changing the local shock geometry and, in turn, conditions for particle injection and radiation. We develop a linear-MHD formulation that treats the shock as a moving interface rather than a fixed boundary. In this approach the shock response can be summarized by an effective impedance determined by the Rankine-Hugoniot base state and the shock geometry, while the upstream turbulence enters only through its statistics. This provides a practical mapping from an assumed incident spectrum to the corrugation amplitude, its drift along the surface, and a coherence scale set by weak damping or leakage. The response is largest when the transmitted downstream fast mode propagates nearly parallel to the shock in the shock frame, which produces a Lorentzian-type enhancement controlled by the downstream normal group speed. We examine how compression, plasma $\\beta$, and obliquity affect these corrugation properties and discuss implications for fine structure in heliospheric and supernova-remnant shock emission.",
      "pdf_url": "https://arxiv.org/pdf/2512.24425.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24764",
      "title": "LUNCH: A Lightweight Unified Deep-Learning Framework for General Transients Classification in High-Energy Time-Domain Astronomy",
      "authors": [
        "Peng Zhang",
        "Chen-Wei Wang",
        "Zheng-Hang Yu",
        "Ren-Zhou Gui",
        "Shao-Lin Xiong",
        "Xiao-Bo Li",
        "Li-Ming Song",
        "Shi-Jie Zheng",
        "Xiao-Yun Zhao",
        "Yue Huang",
        "Wang-Chen Xue",
        "Ya-Qi Wang",
        "Long-Bo Han",
        "Jia-Cong Liu",
        "Chao Zheng",
        "Wen-Jun Tan",
        "Sheng-Lun Xie",
        "Ce Cai",
        "Yan-Qiu Zhang",
        "Hao-Xuan Guo",
        "Yue Wang",
        "Yang-Zhao Ren"
      ],
      "abstract": "LUNCH: A Lightweight Unified Deep-Learning Framework for General Transients Classification in High-Energy Time-Domain Astronomy Peng Zhang, Chen-Wei Wang, Zheng-Hang Yu, Ren-Zhou Gui, Shao-Lin Xiong, Xiao-Bo Li, Li-Ming Song, Shi-Jie Zheng, Xiao-Yun Zhao, Yue Huang, Wang-Chen Xue, Ya-Qi Wang, Long-Bo Han, Jia-Cong Liu, Chao Zheng, Wen-Jun Tan, Sheng-Lun Xie, Ce Cai, Yan-Qiu Zhang, Hao-Xuan Guo, Yue Wang, Yang-Zhao Ren Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) The increasing data volume of high-energy space monitors necessitates real-time, automated transient classification for multi-messenger follow-up. Conventional methods rely on empirical features like hardness ratios and reliable localization, which are not always precisely available during early detection. We developed the Lightweight Unified Neural Classifier for High-energy Transients (LUNCH) - an end-to-end deep-learning framework that performs general transient classification directly from raw multi-band light curves, eliminating the need for background subtraction or source localization. Its dual-scale architecture fuses long- and short-scale temporal evolution adaptively. Evaluated on 15 years of Fermi/GBM triggers, the optimal model achieves 97.23% accuracy when trained on complete energy spectra. A lightweight version using only three broad energy bands retains 95.07% accuracy, demonstrating that coarse spectral information fused with temporal context enables robust discrimination. The system significantly outperforms the GBM in-flight classifier on three months of independent test data. Feature visualization reveals well-separated class clusters, confirming physical interpretability. LUNCH combines high accuracy, low computational cost, and instrument-agnostic inputs, offering a practical solution for real-time in-flight processing that enables timely triggers for immediate multi-wavelength and multi-messenger follow-up observations in future time-domain missions.",
      "pdf_url": "https://arxiv.org/pdf/2512.24764.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24782",
      "title": "TTC: Transformer-based TDE Classifier for the Wide Field Survey Telescope (WFST)",
      "authors": [
        "Ranfang Zheng",
        "Zheyu Lin",
        "Xu Kong",
        "Dezheng Meng",
        "Zelin Xu",
        "Lulu Fan",
        "Ji-an Jiang",
        "Ning Jiang",
        "Jie Lin",
        "Tinggui Wang",
        "Qingfeng Zhu",
        "Feng Li",
        "Ming Liang",
        "Hao Liu",
        "Zheng Lou",
        "Wentao Luo",
        "Jinlong Tang",
        "Hairen Wang",
        "Jian Wang",
        "Yongquan Xue",
        "Dazhi Yao",
        "Hong-fei Zhang",
        "Wen Zhao",
        "Xianzhong Zheng",
        "Yingxi Zuo"
      ],
      "abstract": "TTC: Transformer-based TDE Classifier for the Wide Field Survey Telescope (WFST) Ranfang Zheng, Zheyu Lin, Xu Kong, Dezheng Meng, Zelin Xu, Lulu Fan, Ji-an Jiang, Ning Jiang, Jie Lin, Tinggui Wang, Qingfeng Zhu, Feng Li, Ming Liang, Hao Liu, Zheng Lou, Wentao Luo, Jinlong Tang, Hairen Wang, Jian Wang, Yongquan Xue, Dazhi Yao, Hong-fei Zhang, Wen Zhao, Xianzhong Zheng, Yingxi Zuo 17 pages, 9 figures, 7 tables; accepted by ApJ Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) We propose the Transformer-based Tidal disruption events (TDE) Classifier (\\texttt{TTC}), specifically designed to operate effectively with both real-time alert streams and archival data of the Wide Field Survey Telescope (WFST). It aims to minimize the reliance on external catalogs and find TDE candidates from pure light curves, which is more suitable for finding TDEs in faint and distant galaxies. \\texttt{TTC} consists of two key modules that can work independently: (1) A light curve parametric fitting module and (2) a Transformer (\\texttt{Mgformer})-based classification network. The training of the latter module and evaluation for each module utilize a light curve dataset of 7413 spectroscopically classified transients from the Zwicky Transient Facility (ZTF). The \\texttt{Mgformer}-based module is superior in performance and flexibility. Its representative recall and precision values are 0.79 and 0.76, respectively, and can be modified by adjusting the threshold. It can also efficiently find TDE candidates within 30 days from the first detection. For comparison, the parametric fitting module yields values of 0.72 and 0.40, respectively, while it is $>$10 times faster in average speed. Hence, the setup of modules allows a trade-off between performance and time, as well as precision and recall. \\texttt{TTC} has successfully picked out all spectroscopically identified TDEs among ZTF transients in a real-time classification test, and selected $\\sim$20 TDE candidates in the deep field survey data of WFST. The discovery rate will greatly increase once the differential database for the wide field survey is ready.",
      "pdf_url": "https://arxiv.org/pdf/2512.24782.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2401.08969",
      "title": "Effect of Magnetised Discontinuity on Diffusive Shock Acceleration",
      "authors": [
        "Anshuman Verma",
        "Saksham Chandna",
        "Divyansh Tripathi",
        "Ritam Mallick"
      ],
      "abstract": "Effect of Magnetised Discontinuity on Diffusive Shock Acceleration Anshuman Verma, Saksham Chandna, Divyansh Tripathi, Ritam Mallick 21 pages, 7 figures and have substantial changes from previous version High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the impact of magnetic fields and diffusion mechanisms on the energy spectra of particles accelerated via diffusive shock acceleration. We analyse magnetised shock jump conditions and demonstrate how magnetisation and angular dependence modify upstream and downstream velocities, which enter the transport equation within a Monte Carlo simulation framework. We consider constant, momentum-dependent, and pitch-angle-dependent diffusion coefficients to assess their influence on particle acceleration. Our results show that magnetic fields enhance particle confinement and facilitate more efficient energy gain. In the absence of magnetisation, particle spectra tend to be steeper due to rapid escape and weaker scattering effects, whereas magnetised shocks systematically produce flatter spectra across all diffusion models. Among them, pitch-angle-dependent diffusion leads to the strongest spectral flattening, underscoring its role in sustaining extended acceleration. It is also seen that an increased upstream pressure, associated with enhanced magnetic turbulence, broadens the spectral range by improving particle scattering efficiency and enabling multiple shock crossings. As the shock inclination angle increases, the velocity contrast between upstream and downstream regions diminishes, modulating the spatial extent of the acceleration zone. Notably, pitch-angle-dependent diffusion remains robust under varying shock conditions, ensuring sustained acceleration.",
      "pdf_url": "https://arxiv.org/pdf/2401.08969.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2408.09905",
      "title": "Observation of the $γ$-ray Emission from W43 with LHAASO",
      "authors": [
        "Zhen Cao",
        "F. Aharonian",
        "Y.X. Bai",
        "Y.W. Bao",
        "D. Bastieri",
        "X.J. Bi",
        "Y.J. Bi",
        "W. Bian",
        "J. Blunier",
        "A.V. Bukevich",
        "C.M. Cai",
        "Y.Y. Cai",
        "W.Y. Cao",
        "Zhe Cao",
        "J. Chang",
        "J.F. Chang",
        "E.S. Chen",
        "G.H. Chen",
        "H.K. Chen",
        "L.F. Chen",
        "Liang Chen",
        "Long Chen",
        "M.J. Chen",
        "M.L. Chen",
        "Q.H. Chen",
        "S. Chen",
        "S.H. Chen",
        "S.Z. Chen",
        "T.L. Chen",
        "X.B. Chen",
        "X.J. Chen",
        "X.P. Chen",
        "Y. Chen",
        "N. Cheng",
        "Q.Y. Cheng",
        "Y.D. Cheng",
        "M.Y. Cui",
        "S.W. Cui",
        "X.H. Cui",
        "Y.D. Cui",
        "B.Z. Dai",
        "H.L. Dai",
        "Z.G. Dai",
        "Danzengluobu",
        "Y.X. Diao",
        "A.J. Dong",
        "X.Q. Dong",
        "K.K. Duan",
        "J.H. Fan",
        "Y.Z. Fan",
        "J. Fang",
        "J.H. Fang",
        "K. Fang",
        "C.F. Feng",
        "H. Feng",
        "L. Feng",
        "S.H. Feng",
        "X.T. Feng",
        "Y. Feng",
        "Y.L. Feng",
        "S. Gabici",
        "B. Gao",
        "Q. Gao",
        "W. Gao",
        "W.K. Gao",
        "M.M. Ge",
        "T.T. Ge",
        "L.S. Geng",
        "G. Giacinti",
        "G.H. Gong",
        "Q.B. Gou",
        "M.H. Gu",
        "F.L. Guo",
        "J. Guo",
        "K.J. Guo",
        "X.L. Guo",
        "Y.Q. Guo",
        "Y.Y. Guo",
        "R.P. Han",
        "O.A. Hannuksela",
        "M. Hasan",
        "H.H. He",
        "H.N. He",
        "J.Y. He",
        "X.Y. He",
        "Y. He",
        "S. Hernández-Cadena",
        "B.W. Hou",
        "C. Hou",
        "X. Hou",
        "H.B. Hu",
        "S.C. Hu",
        "C. Huang",
        "D.H. Huang",
        "J.J. Huang",
        "X.L. Huang",
        "X.T. Huang",
        "X.Y. Huang",
        "Y. Huang",
        "Y.Y. Huang"
      ],
      "abstract": "Observation of the $γ$-ray Emission from W43 with LHAASO Zhen Cao, F. Aharonian, Y.X. Bai, Y.W. Bao, D. Bastieri, X.J. Bi, Y.J. Bi, W. Bian, J. Blunier, A.V. Bukevich, C.M. Cai, Y.Y. Cai, W.Y. Cao, Zhe Cao, J. Chang, J.F. Chang, E.S. Chen, G.H. Chen, H.K. Chen, L.F. Chen, Liang Chen, Long Chen, M.J. Chen, M.L. Chen, Q.H. Chen, S. Chen, S.H. Chen, S.Z. Chen, T.L. Chen, X.B. Chen, X.J. Chen, X.P. Chen, Y. Chen, N. Cheng, Q.Y. Cheng, Y.D. Cheng, M.Y. Cui, S.W. Cui, X.H. Cui, Y.D. Cui, B.Z. Dai, H.L. Dai, Z.G. Dai, Danzengluobu, Y.X. Diao, A.J. Dong, X.Q. Dong, K.K. Duan, J.H. Fan, Y.Z. Fan, J. Fang, J.H. Fang, K. Fang, C.F. Feng, H. Feng, L. Feng, S.H. Feng, X.T. Feng, Y. Feng, Y.L. Feng, S. Gabici, B. Gao, Q. Gao, W. Gao, W.K. Gao, M.M. Ge, T.T. Ge, L.S. Geng, G. Giacinti, G.H. Gong, Q.B. Gou, M.H. Gu, F.L. Guo, J. Guo, K.J. Guo, X.L. Guo, Y.Q. Guo, Y.Y. Guo, R.P. Han, O.A. Hannuksela, M. Hasan, H.H. He, H.N. He, J.Y. He, X.Y. He, Y. He, S. Hernández-Cadena, B.W. Hou, C. Hou, X. Hou, H.B. Hu, S.C. Hu, C. Huang, D.H. Huang, J.J. Huang, X.L. Huang, X.T. Huang, X.Y. Huang, Y. Huang, Y.Y. Huang 11 pages, 2 figures, and 3 tables. Accepted for publication in SCPMA Sci. China Phys. Mech. Astron. 68, 279502 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) In this paper, we report the detection of the very-high-energy (VHE, $ 100{\\rm\\ GeV} < E < 100{\\rm\\ TeV} $) and ultra-high-energy (UHE, $E > 100\\rm\\ TeV$) $\\gamma$-ray emissions from the direction of the young star-forming region W43, observed by the Large High Altitude Air Shower Observation (LHAASO). The extended $\\gamma$-ray source was detected with a significance of ${\\sim}16\\,\\sigma$ by KM2A and ${\\sim}17\\,\\sigma$ by WCDA, respectively. The angular extension of this $\\gamma$-ray source is about 0.5 degrees, corresponding to a physical size of about 50 pc. We discuss the origin of the $\\gamma$-ray emission and possible cosmic ray acceleration in the W43 region using multi-wavelength data. Our findings suggest that W43 is likely another young star cluster capable of accelerating cosmic rays (CRs) to at least several hundred TeV.",
      "pdf_url": "https://arxiv.org/pdf/2408.09905.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2409.09499",
      "title": "Deep view of Composite SNR CTA1 with LHAASO in $γ$-rays up to 300 TeV",
      "authors": [
        "LHAASO Collaboration"
      ],
      "abstract": "Deep view of Composite SNR CTA1 with LHAASO in $γ$-rays up to 300 TeV LHAASO Collaboration update LHAASO Collaboration member list High Energy Astrophysical Phenomena (astro-ph.HE) The ultra-high-energy (UHE) gamma-ray source 1LHAASO J0007+7303u is positionally associated with the composite SNR CTA1 that is located at high Galactic Latitude $b\\approx 10.5^\\circ$. This provides a rare opportunity to spatially resolve the component of the pulsar wind nebula (PWN) and supernova remnant (SNR) at UHE. This paper conducted a dedicated data analysis of 1LHAASO J0007+7303u using the data collected from December 2019 to July 2023. This source is well detected with significances of 21$\\sigma$ and 17$\\sigma$ at 8$-$100 TeV and $>$100 TeV, respectively. The corresponding extensions are determined to be 0.23$^{\\circ}\\pm$0.03$^{\\circ}$ and 0.17$^{\\circ}\\pm$0.03$^{\\circ}$. The emission is proposed to originate from the relativistic electrons and positrons accelerated within the PWN of PSR J0007+7303. The energy spectrum is well described by a power-law with an exponential cutoff function $dN/dE = (42.4\\pm4.1)(\\frac{E}{20\\rm\\ TeV})^{-2.31\\pm0.11}\\exp(-\\frac{E}{110\\pm25\\rm\\ TeV})$ $\\rm\\ TeV^{-1}\\ cm^{-2}\\ s^{-1}$in the energy range from 8 TeV to 300 TeV, implying a steady-state parent electron spectrum $dN_e/dE_e\\propto (\\frac{E_e}{100\\rm\\ TeV})^{-3.13\\pm0.16}\\exp[(\\frac{-E_e}{373\\pm70\\rm\\ TeV})^2]$ at energies above $\\approx 50 \\rm\\ TeV$. The cutoff energy of the electron spectrum is roughly equal to the expected current maximum energy of particles accelerated at the PWN terminal shock. Combining the X-ray and gamma-ray emission, the current space-averaged magnetic field can be limited to $\\approx 4.5\\rm\\ \\mu G$. To satisfy the multi-wavelength spectrum and the $\\gamma$-ray extensions, the transport of relativistic particles within the PWN is likely dominated by the advection process under the free-expansion phase assumption.",
      "pdf_url": "https://arxiv.org/pdf/2409.09499.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.08988",
      "title": "Ultrahigh-Energy Gamma-ray Emission Associated with Black Hole-Jet Systems",
      "authors": [
        "The LHAASO Collaboration",
        "Zhen Cao",
        "Felix Aharonian",
        "Yun-Xiang Bai",
        "Yi-Wei Bao",
        "Denis Bastieri",
        "Xiao-Jun Bi",
        "Yu-Jiang Bi",
        "Wen-Yi Bian",
        "Anatoly V Bukevich",
        "Chengmiao Cai",
        "Wen-Yu Cao",
        "Zhe Cao",
        "Jin Chang",
        "Jin-Fan Chang",
        "Aming Chen",
        "En-Sheng Chen",
        "Guohai Chen",
        "Hua-Xi Chen",
        "Liang Chen",
        "Long Chen",
        "Ming-Jun Chen",
        "Ma-Li Chen",
        "Qi-Hui Chen",
        "Shi Chen",
        "Su-Hong Chen",
        "Song-Zhan Chen",
        "Tian-Lu Chen",
        "Xiao-Bin Chen",
        "Xuejian Chen",
        "Yang Chen",
        "Ning Cheng",
        "Yao-Dong Cheng",
        "Ming Chung Chu",
        "Ming-Yang Cui",
        "Shu-Wang Cui",
        "Xiao-Hong Cui",
        "Yi-Dong Cui",
        "Ben-Zhong Dai",
        "Hong-Liang Dai",
        "Zigao Dai",
        "Danzeng Luobu",
        "Yang-Xuan Diao",
        "Xu-Qiang Dong",
        "Kai-Kai Duan",
        "Jun-Hui Fan",
        "Yi-Zhong Fan",
        "Jun Fang",
        "Jian-Hua Fang",
        "Kun Fang",
        "Cun-feng Feng",
        "Hua Feng",
        "Li Feng",
        "Shaohui Feng",
        "Xiao-ting Feng",
        "Yi Feng",
        "You-liang Feng",
        "Stefano Gabici",
        "Bo Gao",
        "Chuan-dong Gao",
        "Qi Gao",
        "Wei Gao",
        "Wei-kang Gao",
        "Maomao Ge",
        "Ting-Ting Ge",
        "Lisi Geng",
        "Gwenael Giacinti",
        "Guanghua Gong",
        "Quanbu Gou",
        "Min-Hao Gu",
        "Fu-Lai Guo",
        "Jing Guo",
        "Xiao-Lei Guo",
        "Yi-Qing Guo",
        "Ying-Ying Guo",
        "Yi-Ang Han",
        "Otto A Hannuksela",
        "Mariam Hasan",
        "Hui-Hai He",
        "Hao-Ning He",
        "Jia-Yin He",
        "Xinyu He",
        "Yu He",
        "Sergio Hernández-Cadena",
        "Bo-Wen Hou",
        "Chao Hou",
        "Xian Hou",
        "Hong-Bo Hu",
        "Shi-Cong Hu",
        "Chen Huang",
        "Dai-Hui Huang",
        "Jiajun Huang",
        "Tian-Qi Huang",
        "Wen-Jun Huang",
        "Xing-Tao Huang",
        "Xiao-Yuan Huang",
        "Yong Huang",
        "Yi-Yun Huang",
        "Xiao-Lu Ji",
        "Huan-Yu Jia"
      ],
      "abstract": "Ultrahigh-Energy Gamma-ray Emission Associated with Black Hole-Jet Systems The LHAASO Collaboration, Zhen Cao, Felix Aharonian, Yun-Xiang Bai, Yi-Wei Bao, Denis Bastieri, Xiao-Jun Bi, Yu-Jiang Bi, Wen-Yi Bian, Anatoly V Bukevich, Chengmiao Cai, Wen-Yu Cao, Zhe Cao, Jin Chang, Jin-Fan Chang, Aming Chen, En-Sheng Chen, Guohai Chen, Hua-Xi Chen, Liang Chen, Long Chen, Ming-Jun Chen, Ma-Li Chen, Qi-Hui Chen, Shi Chen, Su-Hong Chen, Song-Zhan Chen, Tian-Lu Chen, Xiao-Bin Chen, Xuejian Chen, Yang Chen, Ning Cheng, Yao-Dong Cheng, Ming Chung Chu, Ming-Yang Cui, Shu-Wang Cui, Xiao-Hong Cui, Yi-Dong Cui, Ben-Zhong Dai, Hong-Liang Dai, Zigao Dai, Danzeng Luobu, Yang-Xuan Diao, Xu-Qiang Dong, Kai-Kai Duan, Jun-Hui Fan, Yi-Zhong Fan, Jun Fang, Jian-Hua Fang, Kun Fang, Cun-feng Feng, Hua Feng, Li Feng, Shaohui Feng, Xiao-ting Feng, Yi Feng, You-liang Feng, Stefano Gabici, Bo Gao, Chuan-dong Gao, Qi Gao, Wei Gao, Wei-kang Gao, Maomao Ge, Ting-Ting Ge, Lisi Geng, Gwenael Giacinti, Guanghua Gong, Quanbu Gou, Min-Hao Gu, Fu-Lai Guo, Jing Guo, Xiao-Lei Guo, Yi-Qing Guo, Ying-Ying Guo, Yi-Ang Han, Otto A Hannuksela, Mariam Hasan, Hui-Hai He, Hao-Ning He, Jia-Yin He, Xinyu He, Yu He, Sergio Hernández-Cadena, Bo-Wen Hou, Chao Hou, Xian Hou, Hong-Bo Hu, Shi-Cong Hu, Chen Huang, Dai-Hui Huang, Jiajun Huang, Tian-Qi Huang, Wen-Jun Huang, Xing-Tao Huang, Xiao-Yuan Huang, Yong Huang, Yi-Yun Huang, Xiao-Lu Ji, Huan-Yu Jia 47 pages, 27 figures, 9 tables; Published in National Science Review National Science Review, Volume 12, Issue 12, December 2025, nwaf496 High Energy Astrophysical Phenomena (astro-ph.HE) Black holes (BH), one of the most intriguing objects in the universe, can manifest themselves through electromagnetic radiation initiated by the accretion flow. Some stellar-mass BHs drive relativistic jets when accreting matter from their companion stars, forming microquasars. Non-thermal emission from the radio to tera-electronvolt (TeV) gamma-ray band has been observed from microquasars, indicating the acceleration of relativistic particles. Here we report detection of four microquasars (SS 433, V4641 Sgr, GRS 1915+105, MAXI J1820+070) of spectrum extending to the ultrahigh-energy (UHE; photon energy $E>100$ TeV) band and one microquasar (Cygnus X-1) of spectrum approaching 100 TeV, using the Large High Altitude Air Shower Observatory (LHAASO). Notably, the total emission associated with SS 433 cannot be interpreted with a single leptonic component. In the UHE band, its emission is in spatial coincidence with a giant atomic cloud, which is consistent with a hadronic origin. An elongated source is discovered from V4641 Sgr with the spectrum continuing up to 800 TeV. The detection of UHE gamma rays demonstrates that accreting BHs and their environments can operate as extremely efficient accelerators of particles out of 1 peta-electronvolt (PeV), suggesting microquasars to be important contributors to Galactic cosmic rays especially around the `knee' region.",
      "pdf_url": "https://arxiv.org/pdf/2410.08988.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.12065",
      "title": "Unraveling the Nature of HAWC J1844-034 with Fermi-LAT Data Analysis and Multi-wavelength Modeling",
      "authors": [
        "Sovan Boxi",
        "Saptarshi Ghosh",
        "Nayantara Gupta"
      ],
      "abstract": "Unraveling the Nature of HAWC J1844-034 with Fermi-LAT Data Analysis and Multi-wavelength Modeling Sovan Boxi, Saptarshi Ghosh, Nayantara Gupta 10 pages, 5 figures, 3 tables; Published in ApJ The Astrophysical Journal, Volume 980, Number 2, 208 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) The extended ultra-high-energy (UHE) gamma-ray source HAWC J1844-034 is closely associated with two other sources, HAWC J1843-032 and HWC J1846-025. Moreover, other gamma-ray observatories like H.E.S.S., LHAASO, and Tibet AS$_{\\gamma}$ have detected UHE gamma-ray sources whose spatial positions coincide with the position of HAWC J1844-034. The UHE gamma-ray data from several observatories help analyse the spectral features of this source in detail at TeV energies. Of the four pulsars near HAWC J1844-034, PSR J1844-0346 is closest to it and possibly supplies the cosmic-ray leptons to power this source. We have analysed the Fermi-LAT data to explore this source's morphology and identify its spectral feature in the Fermi-LAT energy band. After removing the contribution of the pulsar to the gamma-ray spectral energy distribution by pulsar phased analysis, we have obtained upper limits on the photon flux and identified the GeV counterpart PS J1844.2-0342 in the Fermi-LAT energy band with more than 5$\\sigma$ significance, which may be a pulsar wind nebula (PWN). Finally, the multi-wavelength spectral energy distribution is modeled, assuming HAWC J1844-034 is a PWN.",
      "pdf_url": "https://arxiv.org/pdf/2501.12065.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.12105",
      "title": "NLTE spectral modelling for a carbon-oxygen and helium white-dwarf merger as a Ca-rich transient candidate",
      "authors": [
        "F. P. Callan",
        "A. Holas",
        "J. Morán-Fraile",
        "S. A. Sim",
        "C. E. Collins",
        "L. J. Shingles",
        "J. M. Pollin",
        "F. K. Roepke",
        "R. Pakmor",
        "F. R. N. Schneider"
      ],
      "abstract": "NLTE spectral modelling for a carbon-oxygen and helium white-dwarf merger as a Ca-rich transient candidate F. P. Callan, A. Holas, J. Morán-Fraile, S. A. Sim, C. E. Collins, L. J. Shingles, J. M. Pollin, F. K. Roepke, R. Pakmor, F. R. N. Schneider High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We carry out NLTE (non local thermodynamic equilibrium) radiative transfer simulations to determine whether explosion during the merger of a carbon-oxygen (CO) white dwarf (WD) with a helium (He) WD can reproduce the characteristic Ca II/[Ca II] and He I lines observed in Ca-rich transients. Our study is based on a 1D representation of a hydrodynamic simulation of a 0.6 $M_{\\odot}$ CO + 0.4 $M_{\\odot}$ He WD merger. We calculate both photospheric and nebular-phase spectra including treatment for non-thermal electrons, as is required for accurate modelling of He I and [Ca II]. Consistent with Ca-rich transients, our simulation predicts a nebular spectrum dominated by emission from [Ca II] 7291, 7324 angstrom and the Ca II near-infrared (NIR) triplet. The photospheric-phase synthetic spectrum also exhibits a strong Ca II NIR triplet, prominent optical absorption due to He I 5876 angstrom and He I 10830 angstrom in the NIR, as is commonly observed for Ca-rich transients. Overall, our results therefore suggest that CO+He WD mergers are a promising channel for Ca-rich transients. However, the current simulation overpredicts some He I features, in particular both He I 6678 and 7065 angstrom and shows a significant contribution from Ti II, which results in a spectral energy distribution that is substantially redder than most Ca-rich transients at peak. Additionally the Ca II nebular emission features are too broad. Future work should investigate if these discrepancies can be resolved by considering full 3D models and exploring a range of CO+He WD binary configurations.",
      "pdf_url": "https://arxiv.org/pdf/2503.12105.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.00601",
      "title": "Study of Ultra-High-Energy Gamma-Ray Source 1LHAASO J0056+6346u and Its Possible Origins",
      "authors": [
        "Zhen Cao",
        "F. Aharonian",
        "Y.X. Bai",
        "Y.W. Bao",
        "D. Bastieri",
        "X.J. Bi",
        "Y.J. Bi",
        "W. Bian",
        "J. Blunier",
        "A.V. Bukevich",
        "C.M. Cai",
        "Y.Y. Cai",
        "W.Y. Cao",
        "Zhe Cao",
        "J. Chang",
        "J.F. Chang",
        "E.S. Chen",
        "G.H. Chen",
        "H.K. Chen",
        "L.F. Chen",
        "Liang Chen",
        "Long Chen",
        "M.J. Chen",
        "M.L. Chen",
        "Q.H. Chen",
        "S. Chen",
        "S.H. Chen",
        "S.Z. Chen",
        "T.L. Chen",
        "X.B. Chen",
        "X.J. Chen",
        "X.P. Chen",
        "Y. Chen",
        "N. Cheng",
        "Q.Y. Cheng",
        "Y.D. Cheng",
        "M.Y. Cui",
        "S.W. Cui",
        "X.H. Cui",
        "Y.D. Cui",
        "B.Z. Dai",
        "H.L. Dai",
        "Z.G. Dai",
        "Danzengluobu",
        "Y.X. Diao",
        "A.J. Dong",
        "X.Q. Dong",
        "K.K. Duan",
        "J.H. Fan",
        "Y.Z. Fan",
        "J. Fang",
        "J.H. Fang",
        "K. Fang",
        "C.F. Feng",
        "H. Feng",
        "L. Feng",
        "S.H. Feng",
        "X.T. Feng",
        "Y. Feng",
        "Y.L. Feng",
        "S. Gabici",
        "B. Gao",
        "Q. Gao",
        "W. Gao",
        "W.K. Gao",
        "M.M. Ge",
        "T.T. Ge",
        "L.S. Geng",
        "G. Giacinti",
        "G.H. Gong",
        "Q.B. Gou",
        "M.H. Gu",
        "F.L. Guo",
        "J. Guo",
        "K.J. Guo",
        "X.L. Guo",
        "Y.Q. Guo",
        "Y.Y. Guo",
        "R.P. Han",
        "O.A. Hannuksela",
        "M. Hasan",
        "H.H. He",
        "H.N. He",
        "J.Y. He",
        "X.Y. He",
        "Y. He",
        "S. Hernández-Cadena",
        "B.W. Hou",
        "C. Hou",
        "X. Hou",
        "H.B. Hu",
        "S.C. Hu",
        "C. Huang",
        "D.H. Huang",
        "J.J. Huang",
        "X.L. Huang",
        "X.T. Huang",
        "X.Y. Huang",
        "Y. Huang",
        "Y.Y. Huang"
      ],
      "abstract": "Study of Ultra-High-Energy Gamma-Ray Source 1LHAASO J0056+6346u and Its Possible Origins Zhen Cao, F. Aharonian, Y.X. Bai, Y.W. Bao, D. Bastieri, X.J. Bi, Y.J. Bi, W. Bian, J. Blunier, A.V. Bukevich, C.M. Cai, Y.Y. Cai, W.Y. Cao, Zhe Cao, J. Chang, J.F. Chang, E.S. Chen, G.H. Chen, H.K. Chen, L.F. Chen, Liang Chen, Long Chen, M.J. Chen, M.L. Chen, Q.H. Chen, S. Chen, S.H. Chen, S.Z. Chen, T.L. Chen, X.B. Chen, X.J. Chen, X.P. Chen, Y. Chen, N. Cheng, Q.Y. Cheng, Y.D. Cheng, M.Y. Cui, S.W. Cui, X.H. Cui, Y.D. Cui, B.Z. Dai, H.L. Dai, Z.G. Dai, Danzengluobu, Y.X. Diao, A.J. Dong, X.Q. Dong, K.K. Duan, J.H. Fan, Y.Z. Fan, J. Fang, J.H. Fang, K. Fang, C.F. Feng, H. Feng, L. Feng, S.H. Feng, X.T. Feng, Y. Feng, Y.L. Feng, S. Gabici, B. Gao, Q. Gao, W. Gao, W.K. Gao, M.M. Ge, T.T. Ge, L.S. Geng, G. Giacinti, G.H. Gong, Q.B. Gou, M.H. Gu, F.L. Guo, J. Guo, K.J. Guo, X.L. Guo, Y.Q. Guo, Y.Y. Guo, R.P. Han, O.A. Hannuksela, M. Hasan, H.H. He, H.N. He, J.Y. He, X.Y. He, Y. He, S. Hernández-Cadena, B.W. Hou, C. Hou, X. Hou, H.B. Hu, S.C. Hu, C. Huang, D.H. Huang, J.J. Huang, X.L. Huang, X.T. Huang, X.Y. Huang, Y. Huang, Y.Y. Huang 16 pages, 8 figures, Accepted for publication in SCPMA Sci. China-Phys. Mech. Astron. 68, 279505 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) We report a dedicated study of the newly discovered extended UHE $\\gamma$-ray source 1LHAASO J0056+6346u. Analyzing 979 days of LHAASO-WCDA data and 1389 days of LHAASO-KM2A data, we observed a significant excess of $\\gamma$-ray events with both WCDA and KM2A. Assuming a point power-law source with a fixed spectral index, the significance maps reveal excesses of ${\\sim}12.65\\,\\sigma$, ${\\sim}22.18\\,\\sigma$, and ${\\sim}10.24\\,\\sigma$ in the energy ranges of 1--25 TeV, 25--100 TeV, and $> 100$ TeV, respectively. We use a 3D likelihood algorithm to derive the morphological and spectral parameters, and the source is detected with significances of $12.65\\,\\sigma$ by WCDA and $25.27\\,\\sigma$ by KM2A. The best-fit positions derived from WCDA and KM2A data are (R.A. = $13.96^\\circ\\pm0.09^\\circ$, Decl. = $63.92^\\circ\\pm0.05^\\circ$) and (R.A. = $14.00^\\circ\\pm0.05^\\circ$, Decl. = $63.79^\\circ\\pm0.02^\\circ$), respectively. The angular size ($r_{39}$) of 1LHAASO J0056+6346u is $0.34^\\circ\\pm0.04^\\circ$ at 1--25 TeV and $0.24^\\circ\\pm0.02^\\circ$ at $> 25$ TeV. The differential flux of this UHE $\\gamma$-ray source can be described by an exponential cutoff power-law function: $(2.67\\pm0.25) \\times 10^{-15} (E/20\\,\\text{TeV})^{-1.97\\pm0.10} e^{-E/(55.1\\pm7.2)\\,\\text{TeV}} \\,\\text{TeV}^{-1}\\,\\text{cm}^{-2}\\,\\text{s}^{-1}$. To explore potential sources of $\\gamma$-ray emission, we investigated the gas distribution around 1LHAASO J0056+6346u. 1LHAASO J0056+6346u is likely to be a TeV PWN powered by an unknown pulsar, which would naturally explain both its spatial and spectral properties. Another explanation is that this UHE $\\gamma$-ray source might be associated with gas content illuminated by a nearby CR accelerator, possibly the SNR candidate G124.0+1.4.",
      "pdf_url": "https://arxiv.org/pdf/2504.00601.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.05737",
      "title": "Search for Lorentz Invariance Violation with spectral lags of GRB 190114C using profile likelihood",
      "authors": [
        "Vyaas Ramakrishnan",
        "Shantanu Desai"
      ],
      "abstract": "Search for Lorentz Invariance Violation with spectral lags of GRB 190114C using profile likelihood Vyaas Ramakrishnan, Shantanu Desai 14 pages, 4 figures. Accepted in Int J. of Modern Physics D High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We search for Lorentz invariance violation (LIV) by re-analyzing the spectral lag data for GRB 190114C \\rthis{from Fermi-GBM} using frequentist analysis, where we deal with the astrophysical nuisance parameters using profile likelihood. For this use case, we find a global minima for the $\\chi^2$ as a function of energy scale of LIV ($E_{QG}$), well below the Planck scale. The best-fit $1\\sigma$ central intervals for $E_{QG}$ are given by $2.81^{+0.50}_{-0.37}\\times 10^{14}$ GeV and $9.85^{+0.84}_{-0.60}\\times 10^{5}$ GeV for linear and quadratic LIV, respectively, and agree with the Bayesian estimates obtained so far in a previous work. Therefore, the results from the frequentist analysis of GRB 190114C agree with Bayesian analysis.",
      "pdf_url": "https://arxiv.org/pdf/2506.05737.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07265",
      "title": "Setting limits on blazar-boosted dark matter with xenon-based detectors",
      "authors": [
        "Erin Barillier",
        "Laura Manenti",
        "Knut Mora",
        "Paolo Padovani",
        "Isaac Sarnoff",
        "Yongheng Xu",
        "Bjorn Penning",
        "Francesco Arneodo"
      ],
      "abstract": "Setting limits on blazar-boosted dark matter with xenon-based detectors Erin Barillier, Laura Manenti, Knut Mora, Paolo Padovani, Isaac Sarnoff, Yongheng Xu, Bjorn Penning, Francesco Arneodo High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex); Data Analysis, Statistics and Probability (physics.data-an) Dual-phase xenon time-projection chambers achieve optimal sensitivity to dark matter in the mass range from about 10 to 1000~GeV/$c^{2}$. However, sub-GeV dark-matter particles do not produce nuclear recoils above detection thresholds in these detectors. Blazar-boosted dark matter provides a way to overcome this limitation: relativistic jets in active galactic nuclei can accelerate light dark matter in their host-galaxy halos to energies capable of producing detectable nuclear-recoil signals in xenon-based detectors on Earth. We present the first blazar-boosted dark-matter search that incorporates full detector-response modeling, using public data from XENON1T and LZ for the blazar TXS 0506+056. We model dark matter-proton scattering in the jet environment, tracing the full process from acceleration in the jet to the detector response on Earth, and we investigate the impact of the host-galaxy dark-matter density profile on the predicted signals. We set model-dependent exclusion regions on the dark matter-nucleon scattering cross section for dark matter with mass $m_\\chi \\simeq 1~\\mathrm{MeV}$. Using XENON1T data, the excluded cross-section range spans approximately $5.8\\times10^{-31}$ to $6.3\\times10^{-29}~\\mathrm{cm}^{2}$, while LZ effective-field-theory searches exclude cross sections between $9.9\\times10^{-32}$ and $2.5\\times10^{-28}~\\mathrm{cm}^{2}$. Our results show that astrophysical uncertainties -- particularly those associated with the dark-matter distribution near the supermassive black hole -- are the dominant limitation of this search, rather than detector-related effects. The resulting limits are therefore model-dependent and should be regarded as exploratory, highlighting both the potential and the present theoretical uncertainties of blazar-boosted dark matter as a probe of light dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2509.07265.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ex"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21314",
      "title": "Explaining the Origin of TeV Gamma Rays from M87 During High and Low States",
      "authors": [
        "Nibedita Mondal",
        "Sandeep Kumar Mondal",
        "Nayantara Gupta"
      ],
      "abstract": "Explaining the Origin of TeV Gamma Rays from M87 During High and Low States Nibedita Mondal, Sandeep Kumar Mondal, Nayantara Gupta 18 pages, 4 figures, Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) The detection of very high-energy gamma-rays from M87 can provide crucial insights into particle acceleration and radiation mechanisms in jets. The recent observations by the Large High Altitude Air Shower Observatory (LHAASO) detector extend the energy range of TeV gamma-ray astronomy, and also the variability study to the TeV energy domain. We have modelled the low state and flare state multi-wavelength spectral energy distributions of M87 within a time-dependent framework. In our model, the low state gamma-ray flux results from the emissions from the sub-parsec and the kilo-parsec scale jets of M87, whereas the flare state gamma-ray flux is mainly produced in the sub-parsec scale jet. We have shown that the spectral and temporal features of the TeV gamma-ray spectrum of M87 are consistent with this two-zone model, where the contribution from the sub-parsec scale jet significantly increases during the flare state.",
      "pdf_url": "https://arxiv.org/pdf/2509.21314.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26594",
      "title": "Effects of Coronal Mass Ejection on PSR J1022+1001 and Possible Mode Change of PSR J2145-0750 in the InPTA DR2",
      "authors": [
        "Shaswata Chowdhury",
        "M. A. Krishnakumar",
        "Manjari Bagchi",
        "Bhal Chandra Joshi",
        "Nobleson K.",
        "Jibin Jose",
        "Shantanu Desai",
        "Manpreet Singh",
        "Vaishnavi Vyasraj",
        "Kuldeep Meena",
        "Amarnath",
        "Manoneeta Chakraborty",
        "Shubham Kala",
        "Debabrata Deb",
        "Zenia Zuraiq",
        "Arul Pandian B",
        "Neelam Dhanda Batra",
        "Churchil Dwivedi",
        "Sushovan Mondal",
        "Avinash Kumar Paladi",
        "Kaustubh Rai",
        "Abhimanyu Susobhanan",
        "Adya Shukla",
        "Aman Srivastava",
        "Mayuresh Surnis",
        "Hemanga Tahbildar",
        "Keitaro Takahashi",
        "Pratik Tarafdar",
        "Prabu Thiagaraj",
        "Kunjal Vara"
      ],
      "abstract": "Effects of Coronal Mass Ejection on PSR J1022+1001 and Possible Mode Change of PSR J2145-0750 in the InPTA DR2 Shaswata Chowdhury, M. A. Krishnakumar, Manjari Bagchi, Bhal Chandra Joshi, Nobleson K., Jibin Jose, Shantanu Desai, Manpreet Singh, Vaishnavi Vyasraj, Kuldeep Meena, Amarnath, Manoneeta Chakraborty, Shubham Kala, Debabrata Deb, Zenia Zuraiq, Arul Pandian B, Neelam Dhanda Batra, Churchil Dwivedi, Sushovan Mondal, Avinash Kumar Paladi, Kaustubh Rai, Abhimanyu Susobhanan, Adya Shukla, Aman Srivastava, Mayuresh Surnis, Hemanga Tahbildar, Keitaro Takahashi, Pratik Tarafdar, Prabu Thiagaraj, Kunjal Vara High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The Indian Pulsar Timing Array (InPTA) has recently published its second data release (DR2), comprising the timing analysis of seven years of data on 27 millisecond pulsars (MSPs), observed simultaneously in the 300-500 MHz (band 3) and 1260-1460 MHz (band 5), using the upgraded Giant Metrewave Radio Telescope (uGMRT). The low-frequency data, particularly in band 3, is highly sensitive to propagation effects such as dispersion measure (DM) fluctuations, which can be imprints of some astrophysical phenomena (scientific outliers). Here, we analyze the two outliers of possible astrophysical origin coming from the band 3 DM time series of two pulsars: PSR J1022+1001, with an ecliptic latitude of -0.06 degree, and PSR J2145-0750, one of the brightest MSPs, with multi-component profile morphology. Our study reveals compelling evidence for a coronal mass ejection (CME) event traced in the data of PSR J1022+1001, and reports evidence for a potential mode-changing event in PSR J2145-0750. By contrasting these two cases, we show that DM fluctuations due to CME interacions and intrinsic mode-changing events produce distinct observational signatures, enabling a physically informed classification of scientific outliers in PTA datasets. Extending the analyses presented here to the full sample of InPTA-DR2 pulsars is expected to reveal additional CME events, and possible mode-changing events. Such detections will not only improve our understanding of solar and pulsar magnetospheric plasma interactions but will also enable more accurate modelling of DM variations, leading to improved pulsar timing solutions, which are crucial for high-precision Pulsar Timing Array (PTA) science.",
      "pdf_url": "https://arxiv.org/pdf/2510.26594.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.09850",
      "title": "A Precessing, Magnetically Dominated, Structured Jet Powering the Hour-scale Quasiperiodic GRB 250702B",
      "authors": [
        "Tao An"
      ],
      "abstract": "A Precessing, Magnetically Dominated, Structured Jet Powering the Hour-scale Quasiperiodic GRB 250702B Tao An The Astrophysical Journal Letters, Volume 995, Issue 1, id.L2, 11 pp High Energy Astrophysical Phenomena (astro-ph.HE) GRB 250702B shows ultra-long, episodic prompt activity (three hard gamma-ray episodes over ~ 3.2 h with quasi-regular spacing P~ 2825 s preceded by a soft X-ray flare about one day earlier. We interpret these phenomena with a unified scenario in which a stellar-mass black hole accretes from a massive, misaligned debris disk and launches a magnetically dominated, precessing, structured (spine-sheath) jet. The engine \"clock\" arises from Lense-Thirring precession of the outer annulus of a geometrically thick inner torus at r ~ 250-300 rg, while the hard spectra reflect magnetic-reconnection dissipation in the spine. A slightly off-axis viewing geometry resolves the apparent opening-angle tension without invoking late energy injection. \"Missing\" pulses in the second/third cycles occur naturally when low-amplitude nutation causes the beaming cone to miss the line of sight. The model yields concrete, falsifiable predictions, providing a self-consistent explanation of GRB 250702B's radiative and outflow anomalies.",
      "pdf_url": "https://arxiv.org/pdf/2511.09850.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.12477",
      "title": "Detection of disk-jet co-precession in a tidal disruption event",
      "authors": [
        "Yanan Wang",
        "Zikun Lin",
        "Linhui Wu",
        "Weihua Lei",
        "Shuyuan Wei",
        "Shuang-Nan Zhang",
        "Long Ji",
        "Santiago del Palacio",
        "Ranieri D. Baldi",
        "Yang Huang",
        "Jifeng Liu",
        "Bing Zhang",
        "Aiyuan Yang",
        "Rurong Chen",
        "Yangwei Zhang",
        "Ailing Wang",
        "Lei Yang",
        "Panos Charalampopoulos",
        "David R. A. Williams-Baldwin",
        "Zhu-Heng Yao",
        "Fu-Guo Xie",
        "Defu Bu",
        "Hua Feng",
        "Xinwu Cao",
        "Hongzhou Wu",
        "Wenxiong Li",
        "Erlin Qiao",
        "Giorgos Leloudas",
        "Joseph P Anderson",
        "Xinwen Shu",
        "Dheeraj R. Pasham",
        "Hu Zou",
        "Matt Nicholl",
        "Thomas Wevers",
        "Tomas E. Muller-Bravo",
        "Jing Wang",
        "Jianyan Wei",
        "Yu-Lei Qiu",
        "Weijian Guo",
        "Claudia P. Gutierrez",
        "Mariusz Gromadzki",
        "Cosimo Inserra",
        "Lydia Makrygianni",
        "Francesca Onori",
        "Tanja Petrushevska",
        "Diego Altamirano",
        "Lluis Galbany",
        "Miguel Perez-Torres",
        "Ting-Wan Chen"
      ],
      "abstract": "Detection of disk-jet co-precession in a tidal disruption event Yanan Wang, Zikun Lin, Linhui Wu, Weihua Lei, Shuyuan Wei, Shuang-Nan Zhang, Long Ji, Santiago del Palacio, Ranieri D. Baldi, Yang Huang, Jifeng Liu, Bing Zhang, Aiyuan Yang, Rurong Chen, Yangwei Zhang, Ailing Wang, Lei Yang, Panos Charalampopoulos, David R. A. Williams-Baldwin, Zhu-Heng Yao, Fu-Guo Xie, Defu Bu, Hua Feng, Xinwu Cao, Hongzhou Wu, Wenxiong Li, Erlin Qiao, Giorgos Leloudas, Joseph P Anderson, Xinwen Shu, Dheeraj R. Pasham, Hu Zou, Matt Nicholl, Thomas Wevers, Tomas E. Muller-Bravo, Jing Wang, Jianyan Wei, Yu-Lei Qiu, Weijian Guo, Claudia P. Gutierrez, Mariusz Gromadzki, Cosimo Inserra, Lydia Makrygianni, Francesca Onori, Tanja Petrushevska, Diego Altamirano, Lluis Galbany, Miguel Perez-Torres, Ting-Wan Chen accepted version. minor corrections Science Advances, 11, 25.9068 (2025) High Energy Astrophysical Phenomena (astro-ph.HE) Theories and simulations predict that intense spacetime curvature near black holes bends the trajectories of light and matter, driving disk and jet precession under relativistic torques. However, direct observational evidence of disk-jet co-precession remains elusive. Here, we report the most compelling case to date: a tidal disruption event (TDE) exhibiting unprecedented 19.6-day quasi-periodic variations in both X-rays and radio, with X-ray amplitudes exceeding an order of magnitude. The nearly synchronized X-ray and radio variations suggest a shared mechanism regulating the emission regions. We demonstrate that a disk-jet Lense-Thirring precession model successfully reproduces these variations while requiring a low-spin black hole. This study uncovers previously uncharted short-term radio variability in TDEs, highlights the transformative potential of high-cadence radio monitoring, and offers profound insights into disk-jet physics.",
      "pdf_url": "https://arxiv.org/pdf/2511.12477.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.18144",
      "title": "Cosmogenic Origin of KM3-230213A: Delayed Gamma-Ray Emission from A Cosmic-Ray Transient",
      "authors": [
        "Sovan Boxi",
        "Saikat Das",
        "Nayantara Gupta"
      ],
      "abstract": "Cosmogenic Origin of KM3-230213A: Delayed Gamma-Ray Emission from A Cosmic-Ray Transient Sovan Boxi, Saikat Das, Nayantara Gupta 8 pages, 7 figures; Accepted for publication in ApJL High Energy Astrophysical Phenomena (astro-ph.HE) The highest-energy cosmic neutrino detected by the ARCA detector of KM3NeT has reignited the quest to pinpoint the sources of ultrahigh-energy cosmic rays (UHECRs; $E\\gtrsim 0.1$ EeV). By uncovering the associated multimessenger signals, we investigate the origin of the 220 PeV $\\nu_\\mu$ event KM3-230213A from an unknown transient that accelerated cosmic rays to $\\sim 10$ EeV. Unlike an astrophysical origin, where the $\\nu_\\mu$ is produced inside the source, here we consider UHECR protons that escape the source interact with the cosmic background radiation, producing a PeV-EeV cosmogenic neutrino spectrum. The secondary $e^\\pm$ and $\\gamma$-rays initiate an electromagnetic cascade, resulting in a cosmogenic $\\gamma$-ray spectrum. The latter peaks at a delayed time of $\\gtrsim 10^4$ years compared to the light travel time from the transient to observer, due to deflection of charged particles in the extragalactic magnetic field (EGMF). Our results shed light on the nature of the UHECR source for the $\\nu_\\mu$ event and provide crucial insights into the detection of multi-TeV $\\gamma$-rays of cosmogenic origin from similar past cosmological transients. Using the $\\gamma$-ray sensitivity of currently operating and next-generation imaging atmospheric Cherenkov telescopes, the flux and time-delay distribution can constrain the source distance. We further show that the detection of such a $\\gamma$-ray signal above the background depends on the EGMF strength. Together with the non-detection of coincident spatial or temporal photon counterparts at the current epoch, this detection is the first compelling candidate for a sub-EeV cosmogenic neutrino.",
      "pdf_url": "https://arxiv.org/pdf/2511.18144.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.22149",
      "title": "Constraining the Properties of GRB Accreting Magnetar with $R/I$ Evolutionary Effects Using \\emph{Swift}/XRT Data",
      "authors": [
        "Lin Lan",
        "He Gao",
        "Litao Zhao",
        "Shunke Ai",
        "Jie Lin",
        "Long Li",
        "Lang Xie",
        "Li-Ping Xin",
        "Jian-Yan Wei"
      ],
      "abstract": "Constraining the Properties of GRB Accreting Magnetar with $R/I$ Evolutionary Effects Using \\emph{Swift}/XRT Data Lin Lan, He Gao, Litao Zhao, Shunke Ai, Jie Lin, Long Li, Lang Xie, Li-Ping Xin, Jian-Yan Wei 22 pages, 6 figures, and 2 tables. Accepted for publication in ApJ, and matched with the published verison High Energy Astrophysical Phenomena (astro-ph.HE) A newly born millisecond magnetar has been proposed as one possible central engine of some long gamma-ray bursts (LGRBs) with X-ray plateau. In this work, we used a universal correlation between initial spin period ($P_0$) and surface magnetic field ($B_p$) of newborn magnetar based on an LGRB sample in \\cite{Lan2025} to explore the propeller properties of accreting magnetars with $R/I$ evolutionary effects. We found that $B_p-P_0$ relation is approximately consistent with $B_p\\propto P_{\\rm eq}^{7/6}$. Here $P_{\\rm eq}$ is equilibrium spin period in magnetic propeller model. The $B_p-P_0$ relation indicates that $P_0$ may not be true initial spin period of newborn magnetar but had reached an equilibrium spin period via fallback accretion in propeller model. The magnetar accretion rate in our LGRBs is in range of $\\dot{M}\\sim10^{-5}-10^{-2} M_{\\odot} \\rm s^{-1}$ by incorporating $R/I$ evolutionary effects and using the transition relation between gravitational mass $M_g$ and baryonic mass $M_b$ in different equations of state. Such accretion rates ensure that the accreting magnetars in our sample survive until reaching the equilibrium spin period, and the accretion rate is one order of magnitude lower compared to the statistical results in \\cite{Stratta2018} and \\cite{Linweili2020}, which used constant $R/I/M_g$ scenario. We suggested that adopting a constant $R/I/M_g$ scenario for modeling propeller regime in accreting magnetar results in a higher mass accretion rate, which may impair our understanding of the physical nature and its surroundings of accreting magnetar, and low-metallicity progenitors can provide enough material to satisfy the accretion requirements of newborn accreting magnetar in LGRBs.",
      "pdf_url": "https://arxiv.org/pdf/2511.22149.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11488",
      "title": "The Polarized X-ray Universe: Insights and Discoveries",
      "authors": [
        "Arbind Pradhan",
        "Sree Bhattacherjee",
        "Biplob Sarkar"
      ],
      "abstract": "The Polarized X-ray Universe: Insights and Discoveries Arbind Pradhan, Sree Bhattacherjee, Biplob Sarkar 11 pages, 0 figure, The manuscript will appear as a book chapter in the forthcoming book entitled \"Advances in Physical Sciences: Theories, Applications, and Innovations High Energy Astrophysical Phenomena (astro-ph.HE) Polarization is one of the fundamental natures of electromagnetic radiation. The detection of polarization or polarized photons from distant X-ray radiating systems (such as X-ray binaries (XBs), active galactic nuclei (AGN), pulsars, and stars) complements the timing, spectral, and imagining analysis to better understand the physical mechanisms taking place in these sources. Polarization has enhanced the understanding of the internal geometry of these systems and their vicinity. Polarized X-rays can be generated either directly through non-thermal physical processes in the presence of a magnetic field(B) or through the scattering of unpolarized thermal radiation within plasma structures such as an accretion disk. X-ray polarization can measure the two important independent parameters, the polarization degree (PD) and polarization angle (PA) of the X-ray photons. These parameters are crucial as they reveal the characteristics of particles in such a strong magnetic and gravitational field. In this chapter, we have discussed (i) the basic idea of polarization, (ii) some distant sources radiating polarized X-ray photons, (iii) missions dedicated to observing polarized X-ray photons, and (iv) recent breakthroughs and upcoming missions.",
      "pdf_url": "https://arxiv.org/pdf/2512.11488.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.21889",
      "title": "Long-term monitoring of repeating FRB 20220912A with the uGMRT at low radio frequencies",
      "authors": [
        "Ajay Kumar",
        "Yogesh Maan",
        "Banshi Lal",
        "Yash Bhusare",
        "Shriharsh P. Tendulkar",
        "Visweshwar Ram Marthi",
        "Puja Majee"
      ],
      "abstract": "Long-term monitoring of repeating FRB 20220912A with the uGMRT at low radio frequencies Ajay Kumar, Yogesh Maan, Banshi Lal, Yash Bhusare, Shriharsh P. Tendulkar, Visweshwar Ram Marthi, Puja Majee 22 Pages, 16 Figures, 1 Table, Submitted to ApJ, Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) Some repeating FRBs exhibit occasional extreme repetition rates, but very few show a sustained high activity level. One such hyperactive repeater is FRB 20220912A, which was discovered by CHIME/FRB Collaboration on 2022 September 12. Here, we present results from a long-term monitoring campaign of FRB 20220912A using the upgraded Giant Metrewave Radio Telescope (uGMRT) in the frequency range from 300 to 750 MHz. Over the course of nearly two years, we detected a total of 643 bursts in this frequency range. The source exhibited extreme activity for a few months after its discovery and sustained its active phase for over 500 days, with unsystematic modulations in the activity during this phase. The cumulative energy distributions in both bands show a break, consistent with other active repeaters like FRB 20121102A, FRB 202011124A, etc., suggesting common underlying emission mechanisms. Moreover, we show that the energy distribution shape for FRB 20220912A remains broadly same across a large range of frequencies and over time. Overall, the extended high activity, estimated total energy output, persistent power-law tails in the energy distributions, and the lack of detectable short timescale periodicity favor progenitor models invoking young dynamic magnetars, potentially emitting pulses across large rotation phase ranges.",
      "pdf_url": "https://arxiv.org/pdf/2512.21889.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.11546",
      "title": "Constraining Lens Masses in Moderately to Highly Magnified Microlensing Events from Gaia",
      "authors": [
        "U. Pylypenko",
        "Ł. Wyrzykowski",
        "P. J. Mikołajczyk",
        "K. Kotysz",
        "P. Zielinski",
        "N. Ihanec",
        "M. Wicker",
        "M. Ratajczak",
        "M. Sitek",
        "K. Howil",
        "M. Jablonska",
        "Z. Kaczmarek",
        "K. Kruszynska",
        "A. Udalski",
        "G. Damljanovic",
        "M. Stojanovic",
        "M. D. Jovanovic",
        "T. Kvernadze",
        "O. Kvaratskhelia",
        "M. Zejmo",
        "S. M. Brincat",
        "J. K. T. Qvam",
        "T. Güver",
        "E. Bachelet",
        "K. A. Rybicki",
        "A. Garofalo",
        "J. Zdanavicius",
        "E. Pakstiene",
        "S. Zola",
        "S. Kurowski",
        "D. E. Reichart",
        "J. W. Davidson Jr.",
        "U. Burgaz",
        "J. P. Rivet",
        "M. Jelinek",
        "A. Popowicz",
        "H. H. Esenoglu",
        "E. Sonbas",
        "J. M. Carrasco",
        "S. Awiphan",
        "O. Tasuya",
        "V. Godunova",
        "A. Simon",
        "A. Fukui",
        "C. Galdies",
        "K. Bąkowska",
        "P. Hofbauer",
        "A. Gurgul",
        "B. Joachimczyk",
        "M. Dominik",
        "F. Cusano",
        "I. Ilyin",
        "Y. Tsapras",
        "R. A. Street",
        "M. Hundertmark",
        "V. Bozza",
        "P. Rota",
        "A. Cassan",
        "J. Wambsganss",
        "R. Figuera Jaimes"
      ],
      "abstract": "Constraining Lens Masses in Moderately to Highly Magnified Microlensing Events from Gaia U. Pylypenko, Ł. Wyrzykowski, P. J. Mikołajczyk, K. Kotysz, P. Zielinski, N. Ihanec, M. Wicker, M. Ratajczak, M. Sitek, K. Howil, M. Jablonska, Z. Kaczmarek, K. Kruszynska, A. Udalski, G. Damljanovic, M. Stojanovic, M. D. Jovanovic, T. Kvernadze, O. Kvaratskhelia, M. Zejmo, S. M. Brincat, J. K. T. Qvam, T. Güver, E. Bachelet, K. A. Rybicki, A. Garofalo, J. Zdanavicius, E. Pakstiene, S. Zola, S. Kurowski, D. E. Reichart, J. W. Davidson Jr., U. Burgaz, J. P. Rivet, M. Jelinek, A. Popowicz, H. H. Esenoglu, E. Sonbas, J. M. Carrasco, S. Awiphan, O. Tasuya, V. Godunova, A. Simon, A. Fukui, C. Galdies, K. Bąkowska, P. Hofbauer, A. Gurgul, B. Joachimczyk, M. Dominik, F. Cusano, I. Ilyin, Y. Tsapras, R. A. Street, M. Hundertmark, V. Bozza, P. Rota, A. Cassan, J. Wambsganss, R. Figuera Jaimes Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Microlensing events provide a unique way to detect and measure the masses of isolated, non-luminous objects, particularly dark stellar remnants. Under certain conditions, it is possible to measure the mass of these objects using photometry alone, specifically when a microlensing light curve displays a finite source (FS) effect. This effect generally occurs in highly magnified light curves, i.e. when the source and the lens are very well aligned. In this study, we analyse Gaia Alerts and Gaia Data Release 3 datasets, identifying four moderate-to-high-magnification microlensing events without a discernible FS effect. The absence of this effect suggests a large Einstein radius, implying substantial lens masses. In each event, we constrained the FS effect, and therefore established lower limits for the angular Einstein radius and lens mass. Additionally, we used the DarkLensCode software to obtain the mass, distance, and brightness distribution for the lens based on the Galactic model. Our analysis established lower mass limits of $\\sim 0.7$ $M_{\\odot}$ for one lens and $\\sim 0.3-0.5$ $M_{\\odot}$ for two others. A DarkLensCode analysis supports these findings, estimating lens masses in the range of $\\sim 0.42-1.70$ $M_{\\odot}$ and dark lens probabilities exceeding 80%. These results strongly indicate that the lenses are stellar remnants, such as white dwarfs or neutron stars. While further investigations are required to confirm the nature of these lenses, we demonstrate a straightforward yet effective approach to identifying stellar remnant candidates.",
      "pdf_url": "https://arxiv.org/pdf/2504.11546.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23846",
      "title": "A clustering-based search for substructures in the Galactic plane and bulge using RR Lyrae stars as tracers",
      "authors": [
        "N. Cristi-Cambiaso",
        "C. Navarrete",
        "M. Catelan",
        "M. Zoccali",
        "C. Quezada"
      ],
      "abstract": "A clustering-based search for substructures in the Galactic plane and bulge using RR Lyrae stars as tracers N. Cristi-Cambiaso, C. Navarrete, M. Catelan, M. Zoccali, C. Quezada 12 pages, 6 figures, including 4 pages of Appendix. Abstract shortened for arXiv. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Although many globular clusters (GCs) have been identified in the Galaxy, their population is estimated to be incomplete, especially in regions with strong crowding and interstellar extinction such as the Galactic bulge and this http URL Lyrae stars, as bright standard candles and tracers of old stellar populations, are powerful tools for finding GCs in these regions, and large catalogs of such stars have recently become available. We aim to construct a sample of RR Lyrae stars with six-dimensional information (three-dimensional positions, proper motions, and metallicities) in the Galactic plane and bulge, and to exploit it using a hierarchical clustering algorithm to search for Galactic substructures. We build a sample of fundamental-mode RR Lyrae (RRab) stars with positions, distances, proper motions, and photometric metallicity estimates from Gaia and VVV data. Using a clustering algorithm calibrated to optimize GC recovery, we identify groups of RRab stars with similar locations in the six-dimensional parameter space. The most promising groups are selected by comparison with the properties of known GCs. We recover many RRab groups associated with known Galactic GCs and derive the first RR Lyrae-based distances for BH 140 and NGC 5986. We also detect small groups of two to three RRab stars at distances up to ~25 kpc that are not associated with any known GC, but display GC-like distributions in all six parameters. Several of these groups, mostly pairs, lie toward the Galactic bulge but show distinct proper motions or distances, suggesting they may not belong to the bulge population. Overall, our approach identifies dozens of GC-like RRab groups in the Galactic plane and bulge, which are excellent targets for follow-up observations. Future radial velocity measurements can test whether the RRab members of these groups are truly co-moving.",
      "pdf_url": "https://arxiv.org/pdf/2512.23846.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23863",
      "title": "The ionization structure and chemical history in isolated H ii regions of dwarf galaxies with VIMOS/IFU II. The Leo A galaxy",
      "authors": [
        "A. Andrade",
        "I. Saviane",
        "L. Monaco",
        "M. Gullieuszik"
      ],
      "abstract": "The ionization structure and chemical history in isolated H ii regions of dwarf galaxies with VIMOS/IFU II. The Leo A galaxy A. Andrade, I. Saviane, L. Monaco, M. Gullieuszik Paper accepted for publication on A&A. 17 pages, 14 figures, 5 appendices Astrophysics of Galaxies (astro-ph.GA) Study the ionized gas in metal-poor environments is key to understanding the mechanisms regulating galaxy evolution. However, most of the previous studies of extragalactic HII regions rely on unresolved observations of gaseous structures. We study the south-western, spatially resolved, HII region of Leo A, one of the most studied isolated dwarf galaxies in the Local Group. Using archival VIMOS-IFU/VLT data, we explored its gaseous structure through optical emission lines to gain insights into the present-day drivers of gas physics in this dIrr, and we place constraints on the chemical evolution scenario responsible for this low chemical enrichment. The emission line maps reveal that the strongest emission comes from the south-west region. A stratified distribution of ionic species was detected, likely powered by the young star cluster at the nebular centre. HST/ACS data show that the brightest star is in the centre of both the HII region and the star cluster. Photoionization production rates derived indicate that this star can sustain the ionization budget to power the HII region, although subject to the assumed electron density. Using the direct method, we derived a metallicity of $12+\\log(\\mathrm{O/H})=7.29\\pm0.06$ dex, increasing to $7.46\\pm0.09$ dex after correcting for temperature fluctuations, placing Leo A in the low-mass end of the MZR. Chemical evolution models suggest that, under constant accretion, the stellar mass growth and metal enrichment over the last 10 Gyr are successfully reproduced by both leaky-box and gas-regulator models. Those results are similar to those found in SagDIG, supporting a picture in which the present-day evolution of Leo A is dominated by stellar feedback processes. The combination of mass loss mechanisms and accretion events reproduces its chemical evolution, suggesting that Leo A has evolved under a gas equilibrium regime across its lifetime.",
      "pdf_url": "https://arxiv.org/pdf/2512.23863.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23958",
      "title": "Variation of the 2175 Å extinction feature in Andromeda galaxy",
      "authors": [
        "Bing Yan",
        "Shu Wang",
        "Jian Gao",
        "Yuxi Wang",
        "Bingqiu Chen"
      ],
      "abstract": "Variation of the 2175 Å extinction feature in Andromeda galaxy Bing Yan, Shu Wang, Jian Gao, Yuxi Wang, Bingqiu Chen 19pages, 12 figures, 3 tables, accepted for publication in RAA Astrophysics of Galaxies (astro-ph.GA) Extinction curves contain key information on interstellar dust composition and size distribution, with the 2175 Å bump being the most prominent feature. We analyze 20 sightlines toward M31 using HST/STIS UV spectroscopy combined with multi-band photometry to characterize this feature. The extinction curves show substantial diversity, from MW-like shapes to flatter profiles with $R_V$ reaching up to $\\sim5.8$. The strength of the 2175 Å feature varies widely, including two sightlines where the bump is essentially absent. The bump central wavelength spans a broader range than previously reported, while its width remains consistent with earlier studies. A moderate positive correlation is found between bump strength ($c_3$) and width ($\\gamma$). We derive an average UV extinction curve toward M31 with $R_V \\approx 3.53$. These results provide new constraints on dust properties and their spatial variations in this galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2512.23958.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24109",
      "title": "photoD with Rubin's Data Preview 1: first stellar photometric distances and deficit of faint blue stars. Stellar distances with Rubin's DP1",
      "authors": [
        "L. Palaversa",
        "E. Donev",
        "Ž. Ivezić",
        "K. Mrakovčić",
        "N. Caplar",
        "M. Jurić",
        "T. Jurkić",
        "S. Campos",
        "M. DeLucchi",
        "D. Jones",
        "K. Malanchev",
        "A.I. Malz",
        "S. McGuire",
        "B. Abel",
        "L. Girardi",
        "G. Pastorelli",
        "M. Trabucchi",
        "S. Zaggia",
        "E. Acosta",
        "C.L. Adair",
        "J. Andrew",
        "É. Aubourg",
        "A.E. Bauer",
        "W. Beebe",
        "E.C. Bellm",
        "R.D. Blum",
        "M.T. Booth",
        "A. Boucaud",
        "D. Branton",
        "D.L. Burke",
        "D. Calabrese",
        "J.L. Carlin",
        "H-F. Chiang",
        "Y. Choi",
        "A.J. Connolly",
        "S. Dagoret-Campagne",
        "P.N. Daly",
        "F. Daruich",
        "G. Daubard",
        "E. Dennihy",
        "H. Drass",
        "O. Eiger",
        "A.M. Eisner",
        "L.P. Guy",
        "J. Hoblitt",
        "P. Ingraham",
        "F. Jammes",
        "B.T. Jannuzi",
        "M.J. Jee",
        "T. Jenness",
        "R.L. Jones",
        "C. Juramy-Gilles",
        "S.M. Kahn",
        "Y. Kang",
        "A. Kannawadi",
        "L.S. Kelvin",
        "I.V. Kotov",
        "G. Kovács",
        "N.R. Kurita",
        "T. Lange",
        "D. Laporte",
        "J.C. Lazarte",
        "S. Liang",
        "M. Lopez",
        "N.B. Lust",
        "M. Lutfi",
        "O. Lynn",
        "G. Mainetti",
        "F. Menanteau",
        "M. Miller",
        "M. Moniez",
        "N. Sedaghat",
        "E. Nourbakhsh",
        "H.Y. Park",
        "J.R. Peterson",
        "R. Plante",
        "A. Plazas Malagón",
        "M.N. Porter",
        "K.A. Reil",
        "V.J. Riot",
        "A. Roodman",
        "E.S. Rykoff",
        "R.H. Schindler",
        "J. Sebag",
        "R.A. Shaw",
        "A. Shugart",
        "K.B. Siruno",
        "J.A. Smith",
        "J.D. Swinbank",
        "J.G. Thayer",
        "S. Thomas",
        "R. Tighe",
        "D.L. Tucker",
        "M. Turri",
        "E.K. Urbach",
        "B. Van Klaveren",
        "W. van Reeven",
        "C.Z. Waters",
        "B. Willman"
      ],
      "abstract": "photoD with Rubin's Data Preview 1: first stellar photometric distances and deficit of faint blue stars. Stellar distances with Rubin's DP1 L. Palaversa, E. Donev, Ž. Ivezić, K. Mrakovčić, N. Caplar, M. Jurić, T. Jurkić, S. Campos, M. DeLucchi, D. Jones, K. Malanchev, A.I. Malz, S. McGuire, B. Abel, L. Girardi, G. Pastorelli, M. Trabucchi, S. Zaggia, E. Acosta, C.L. Adair, J. Andrew, É. Aubourg, A.E. Bauer, W. Beebe, E.C. Bellm, R.D. Blum, M.T. Booth, A. Boucaud, D. Branton, D.L. Burke, D. Calabrese, J.L. Carlin, H-F. Chiang, Y. Choi, A.J. Connolly, S. Dagoret-Campagne, P.N. Daly, F. Daruich, G. Daubard, E. Dennihy, H. Drass, O. Eiger, A.M. Eisner, L.P. Guy, J. Hoblitt, P. Ingraham, F. Jammes, B.T. Jannuzi, M.J. Jee, T. Jenness, R.L. Jones, C. Juramy-Gilles, S.M. Kahn, Y. Kang, A. Kannawadi, L.S. Kelvin, I.V. Kotov, G. Kovács, N.R. Kurita, T. Lange, D. Laporte, J.C. Lazarte, S. Liang, M. Lopez, N.B. Lust, M. Lutfi, O. Lynn, G. Mainetti, F. Menanteau, M. Miller, M. Moniez, N. Sedaghat, E. Nourbakhsh, H.Y. Park, J.R. Peterson, R. Plante, A. Plazas Malagón, M.N. Porter, K.A. Reil, V.J. Riot, A. Roodman, E.S. Rykoff, R.H. Schindler, J. Sebag, R.A. Shaw, A. Shugart, K.B. Siruno, J.A. Smith, J.D. Swinbank, J.G. Thayer, S. Thomas, R. Tighe, D.L. Tucker, M. Turri, E.K. Urbach, B. Van Klaveren, W. van Reeven, C.Z. Waters, B. Willman Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Aims: We investigate the utility of Rubin's Data Preview 1 for estimating stellar number density profile in the Milky Way halo. Methods: Stellar broad-band near-UV to near-IR $ugrizy$ photometry released in Rubin's Data Preview 1 is used to estimate distance and metallicity for blue main sequence stars brighter than $r=24$ in three $\\sim$1.1. sq.~deg. fields at southern Galactic latitudes. Results: Compared to TRILEGAL simulations of the Galaxy's stellar content by (Dal Tio, 2022), we find a significant deficit of blue main sequence turn-off stars with $22 < r < 24$. We interpret this discrepancy as a signature of a much steeper halo number density profile at galactocentric distances $10-50$ kpc than the cannonical $\\sim1/r^3$ profile assumed in TRILEGAL simulations. Conclusions: This interpretation is consistent with earlier suggestions based on observations of more luminous, but much less numerous, evolved stellar populations, and a few pencil beam surveys of blue main sequence stars in the northern sky. These results bode well for the future Galactic halo exploration with Rubin's Legacy Survey of Space and Time.",
      "pdf_url": "https://arxiv.org/pdf/2512.24109.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24433",
      "title": "A Convolutional Neural Network for the Recovery of Transfer Functions From Velocity-Resolved Reverberation Mapping Data",
      "authors": [
        "Kirk Long",
        "Keith Horne",
        "Jason Dexter",
        "Benoit Tremblay"
      ],
      "abstract": "A Convolutional Neural Network for the Recovery of Transfer Functions From Velocity-Resolved Reverberation Mapping Data Kirk Long, Keith Horne, Jason Dexter, Benoit Tremblay 18 pages, 11 figures, submitted to ApJ, comments/suggestions welcome Astrophysics of Galaxies (astro-ph.GA) One of the hallmarks of active galactic nuclei are that they are highly variable with time. In watching the spectra vary it has been observed that the emission-lines often appear to \"reverberate\" -- that is they vary in response to continuum variations assumed to originate close to the black hole. This critical observation underlies the reverberation mapping technique, an elegant physics experiment that has allowed us to characterize the environment around many supermassive black holes in nearby active galactic nuclei. Recent observations are of such quality that the response can be measured as a function of velocity across the emission-line, and in doing so we can construct velocity-delay maps that show the structure and physics of the gas in the broad-line region better than any other measurement to date. Unfortunately constructing such maps requires a deconvolution, and given that the data are often noisy and with gaps such deconvolutions are non-trivial. Here we present a novel deconvolution method for the recovery of velocity-delay maps using a custom convolutional neural network architecture, showcasing that such methods have great promise for the deconvolution of reverberation mapping data products. While we have designed this new method with the BLR in mind, in principle this technique could be applied to any reverberation deconvolution problem, including in the accretion disk and torus.",
      "pdf_url": "https://arxiv.org/pdf/2512.24433.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24537",
      "title": "The Redshifts from 122 Bands: Comparative Redshift Forecast for Low-Resolution Spectra from SPHEREx and 7-Dimensional Sky Survey (7DS)",
      "authors": [
        "Jangho Bae",
        "Bomee Lee",
        "Myungshin Im",
        "Hyeonguk Bahk",
        "Kim Dachan",
        "Ho Seong Hwang",
        "Sungryong Hong",
        "Suk Kim",
        "Minjin Kim",
        "Taewan Kim",
        "Jeyeon Lee",
        "Jubee Sohn",
        "Hyunmi Song",
        "Seo-Won Chang",
        "Yun-Ting Cheng",
        "Andreas L. Faisst",
        "Zhaoyu Huai",
        "Woong-Seob Jeong",
        "Ji Hoon Kim",
        "Dohyeong Kim",
        "Yongjung Kim",
        "Seong-Kook Lee",
        "Daniel C. Masters",
        "Eunhee Ko"
      ],
      "abstract": "The Redshifts from 122 Bands: Comparative Redshift Forecast for Low-Resolution Spectra from SPHEREx and 7-Dimensional Sky Survey (7DS) Jangho Bae, Bomee Lee, Myungshin Im, Hyeonguk Bahk, Kim Dachan, Ho Seong Hwang, Sungryong Hong, Suk Kim, Minjin Kim, Taewan Kim, Jeyeon Lee, Jubee Sohn, Hyunmi Song, Seo-Won Chang, Yun-Ting Cheng, Andreas L. Faisst, Zhaoyu Huai, Woong-Seob Jeong, Ji Hoon Kim, Dohyeong Kim, Yongjung Kim, Seong-Kook Lee, Daniel C. Masters, Eunhee Ko 22 pages, 10 figures, 2 tables; accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) The recently initiated SPHEREx and 7DS surveys will deliver low-resolution spectra ($R\\approx 30-130$) for hundreds of millions of galaxies over the optical to near-infrared range ($0.4-5.0\\mu m$), covering a wide sky area without sample selection. These unique datasets will improve redshift estimation and provide a rich redshift catalog for the community. In this study, we forecast the performance of widely-used photometric redshift estimation methods using simulated SPHEREx and 7DS data. Four template-fitting approaches and two machine-learning (ML) methods are used to derive photometric redshifts from low-resolution spectrophotometric data. We measure redshifts using mock catalogs based on the GAMA and COSMOS galaxy samples and achieve high precision for bright (13 < i < 18) galaxies, with $\\sigma_{NMAD}\\lesssim 0.005$, bias $\\lesssim 0.005$, and a catastrophic failure rate $\\lesssim 0.005$ for all methods employed. We find that the combined SPHEREx + 7DS dataset significantly improves redshift estimation compared to using either the SPHEREx or 7DS datasets alone, highlighting the synergy between the two surveys. Moreover, we compare the redshift estimation performance across magnitude ranges for the different methods and examine the probability distribution functions (PDFs) produced by the template-fitting approaches. As a result, we identify some factors that can affect the redshift measurements, like treatments on dust extinction or inclusion of flux uncertainty in the ML model. We also show that the PDFs are relatively well calibrated, although the confidence intervals are generally underestimated, particularly for bright galaxies in the template-fitting methods. This study demonstrates the strong potential of SPHEREx and 7DS to deliver improved redshift measurements from low-resolution spectrophotometric data, underscoring the scientific value of jointly utilizing both datasets.",
      "pdf_url": "https://arxiv.org/pdf/2512.24537.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24670",
      "title": "Dust destruction in bubbles driven by multiple supernovae explosions",
      "authors": [
        "Evgenii O. Vasiliev",
        "Biman B. Nath"
      ],
      "abstract": "Dust destruction in bubbles driven by multiple supernovae explosions Evgenii O. Vasiliev, Biman B. Nath Astrophysics of Galaxies (astro-ph.GA) Dust lifetime derived from an isolated supernova (SN) evolution in the interstellar medium is known to be an order of magnitude shorter than the time needed to replenish dust mass by its production in various Galactic sources. We show, using 3-D numerical hydrodynamical simulations, that destruction of dust in the case of multiple SNe in a star cluster is markedly different from that in an isolated SN. We find that the mass of dust destroyed in the bubble does not grow for a considerable time, while SNe continue to explode. This regime is attained at saturation timescale, which is proportional to SNe rate in cluster. We show that the mass of dust destroyed in bubble per SN decreases for higher SN rate. Thus, the destruction efficiency -- defined as the ratio of the the total mass of dust destroyed by clustered SNe to that destroyed by the same number of isolated SNe -- in bubbles evolved in a homogeneous medium drops for massive clusters, e.g. around clusters with $M_\\ast > 4\\times 10^4 M_\\odot$ it is less $0.4$\\%. For lower mass clusters, the efficiency is proportional to the average time delay between SNe. We found that each cluster with $M_\\ast < 4\\times 10^4 M_\\odot$ destroys the same mass of dust as a single isolated SN. In a clumpy medium in bubbles formed around clusters with $M_\\ast \\sim 4\\times 10^4 M_\\odot$ and up to 4 times around $M_\\ast \\sim 8\\times 10^5 M_\\odot$. We argue that the interstellar dust swept up by multiple SNe almost completely survives in the shells of bubbles around such massive clusters. Therefore, the destruction of the interstellar dust is controlled by SNe in low-mass clusters. We point out that the interstellar dust lifetime for a given SN rate is at least a factor $\\sim 10$ longer as compared to the estimates derived from an isolated SN. (abridged)",
      "pdf_url": "https://arxiv.org/pdf/2512.24670.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24677",
      "title": "Destruction of the interstellar dust by a supernova",
      "authors": [
        "Evgenii O. Vasiliev"
      ],
      "abstract": "Destruction of the interstellar dust by a supernova Evgenii O. Vasiliev Astrophysics of Galaxies (astro-ph.GA) Destruction of the interstellar dust proceeds primary behind supernova shocks. The previous estimates of the mass of the interstellar dust destroyed in the SN remnant do not take into account the physical properties of the ambient medium. Here we consider how some parameters, i.e. gas density and metallicity, can influence the destruction of the interstellar dust. We show that there are two regimes of the interstellar dust grains destruction in SN remnants: rapid and almost complete in compact low-mass SN remnants expanding in dense medium, and gradual and weak destruction in massive remnants evolving in the low-dense environment. When time for thermal sputtering is close to the dynamical one, i.e. to the SN remnant age, the mass of the interstellar dust destroyed in the SN remnant reaches its maximum value. We find that change of the ambient gas density results in the reduction of the dust mass logarithmically. We argue that dust cooling suppresses the interstellar dust destruction up to a factor of 1.6 by mass. This factor decreases for higher density of the ambient medium. We found that the dust mass depends linearly on gas metallicity as ${\\rm log}~M_d \\sim {\\rm [Z/H]}$ or, in other words, on the dust-to-gas ratio as $M_d \\sim \\zeta_d$. In turn, the destruction efficiency is higher in low-metallicity environments due to relatively longer adiabatic phase. We point out that the mass of the interstellar dust destroyed per one SN in a high density environment of the high star formation regions like in local ultraluminous infrared and high-redshift massive galaxies is about several times smaller than that in the Milky Way diffuse medium.",
      "pdf_url": "https://arxiv.org/pdf/2512.24677.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24840",
      "title": "Scalable Stellar Parameter Inference Using Python-based LASP: From CPU Optimization to GPU Acceleration",
      "authors": [
        "Jun-Chao Liang",
        "Yin-Bi Li",
        "A-Li Luo",
        "Fang Zuo",
        "Bing Du",
        "Shuo Li",
        "Xiao-Xiao Ma",
        "Shu-Guo Ma",
        "Hai-Ling Lu",
        "Ke-Fei Wu",
        "Zhi-Hua Zhong",
        "Wen Hou",
        "Xiao Kong",
        "Shuo Ye",
        "Li-Li Wang",
        "Hugh R. A. Jones"
      ],
      "abstract": "Scalable Stellar Parameter Inference Using Python-based LASP: From CPU Optimization to GPU Acceleration Jun-Chao Liang, Yin-Bi Li, A-Li Luo, Fang Zuo, Bing Du, Shuo Li, Xiao-Xiao Ma, Shu-Guo Ma, Hai-Ling Lu, Ke-Fei Wu, Zhi-Hua Zhong, Wen Hou, Xiao Kong, Shuo Ye, Li-Li Wang, Hugh R. A. Jones Astrophysics of Galaxies (astro-ph.GA) To enhance the efficiency, scalability, and cross-survey applicability of stellar parameter inference in large spectroscopic datasets, we present a modular, parallelized Python framework with automated error estimation, built on the LAMOST Atmospheric Parameter Pipeline (LASP) originally implemented in IDL. Rather than a direct code translation, this framework refactors LASP with two complementary modules: LASP-CurveFit, a new implementation of the LASP fitting procedure that runs on a CPU, preserving legacy logic while improving data I/O and multithreaded execution efficiency; and LASP-Adam-GPU, a GPU-accelerated method that introduces grouped optimization by constructing a joint residual function over multiple observed and model spectra, enabling high-throughput parameter inference across tens of millions of spectra. Applied to 10 million LAMOST spectra, the framework reduces runtime from 84 to 48 hr on the same CPU platform and to 7 hr on an NVIDIA A100 GPU, while producing results consistent with those from the original pipeline. The inferred errors agree well with the parameter variations from repeat observations of the same target (excluding radial velocities), while the official empirical errors used in LASP are more conservative. When applied to DESI DR1, our effective temperatures and surface gravities agree better with APOGEE than those from the DESI pipeline, particularly for cool giants, while the latter performs slightly better in radial velocity and metallicity. These results suggest that the framework delivers reliable accuracy, efficiency, and transferability, offering a practical approach to parameter inference in large spectroscopic surveys. The code and DESI-based catalog are available via \\dataset[DOI: https://doi.org/10.12149/101679]{this https URL} and \\dataset[DOI: https://doi.org/10.12149/101675]{this https URL}, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2512.24840.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24924",
      "title": "Discovery of a galaxy associated with the HI cloud FAST J0139+4328",
      "authors": [
        "Ana Mitrašinović",
        "Marko Grozdanović",
        "Ana Lalović",
        "Milena Jovanović",
        "Michal Bilek",
        "Nataša Pavlov",
        "Alexei V. Moiseev",
        "Dmitry V. Oparin"
      ],
      "abstract": "Discovery of a galaxy associated with the HI cloud FAST J0139+4328 Ana Mitrašinović, Marko Grozdanović, Ana Lalović, Milena Jovanović, Michal Bilek, Nataša Pavlov, Alexei V. Moiseev, Dmitry V. Oparin accepted for publication in Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) The search for ``dark galaxies,'' a key prediction of the lambda cold dark matter, has yielded few viable candidates. Recently, FAST J0139+4328 was reported as the first isolated dark galaxy in the nearby universe, based on a neutral hydrogen (HI) detection and a non-detection in the Pan-STARRS1 survey. To verify the nature of this candidate, we obtained deep optical imaging, using the $1.4\\,\\mathrm{m}$ \\textit{Milanković} and $0.6\\,\\mathrm{m}$ \\textit{Nedeljković} telescopes, and spectroscopic follow-up of the field. We report the unambiguous discovery of a low-surface-brightness (LSB) optical counterpart at the location of the HI cloud. Furthermore, the detection of H$\\alpha$ emission via the $6\\,\\mathrm{m}$ Big Telescope Alt-Azimuthal (BTA) confirms that the stellar system lies at a redshift consistent with the HI source, establishing their physical association. Through detailed photometry and employing color-dependent mass-to-light scaling relations, we derive a total stellar mass of $M_\\star = (7.2 \\pm 3.7) \\times 10^6\\, M_{\\odot}$, about an order of magnitude higher than the previously estimated upper limit. Using the literature HI mass, this implies a gas-to-stellar mass ratio of $M_{\\mathrm{HI}} / M_{\\star} = 11.5 \\pm 6.4$. Our findings demonstrate that FAST J0139+4328 is not a dark galaxy but an extremely gas-rich LSB dwarf galaxy, whose stellar component was simply below the detection limit of the Pan-STARRS1 survey. This reclassification resolves the status of this prominent dark galaxy candidate and underscores the necessity of deep optical follow-up to classify faint HI-selected systems.",
      "pdf_url": "https://arxiv.org/pdf/2512.24924.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24299",
      "title": "From Nbody1 to Nbody7: the Growth of Sverres Industry",
      "authors": [
        "Rainer Spurzem"
      ],
      "abstract": "From Nbody1 to Nbody7: the Growth of Sverres Industry Rainer Spurzem 10 pages, 3 figures; talk presented at IAU symposium No.398, Compact Objects and Binaries in Dense Star Clusters, in Seoul, Korea (Rep.), June 16-20, 2025, in special session about the work and life of Sverre Aarseth; accepted for publication in Proceedings of IAU Symposium No. 398, H.M. Lee, J. Hong, R. Spurzem, eds., Cambridge Univ. Press Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) From NBODY1 to NBODY6 : The Growth of an Industry is the title of a 1999 invited review by Sverre Aarseth, for Publications of the Astronomical Society of the Pacific (PASP). I took this as an inspiration for the title of this paper; it describes how Sverres NBODY Industry has further grown since 90s of the previous century, and how it is further flourishing and hopefully developing, in his spirit, even after the sad news of his passing away reached us. My contact and friendship with Sverre started a few decades ago being sent to Cambridge to learn NBODY5, counting input parameters, and learning about the fact that even a sophisticated code (which had already at that time quite a history) requires permanent maintenance and bug fixes. Managed by Sverre, who relentlessly ran his code and responded to the widely spread crowd of customer colleagues. There has been a phase of massive and fast development and improvements due to vectorization, parallelization, GRAPE and GPU acceleration, and Sverre has been always on top of it if not ahead, but also fully adopting ideas of collaborators, once they tested well. NBODY6++GPU and NBODY7 entered the scene, and also recent new competitors, such as PETAR or BIFROST . We all have learnt a lot from Sverre, and strive to continue in his open-minded spirit, for open source and exchange. A striking evidence for the further growth of the industry is the number of papers here (and two of them follow in this session, but also in other sessions) using and further developing the aforementioned codes, as well as the occurrence of new and competing codes, which keep the field alive.",
      "pdf_url": "https://arxiv.org/pdf/2512.24299.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24380",
      "title": "A millimeter methanol maser ring tracing the deceleration of the heat wave powered by the massive protostellar accretion outburst in G358.93-0.03 MM1",
      "authors": [
        "T. R. Hunter",
        "C. L. Brogan",
        "G. C. MacLeod",
        "C. J. Cyganowski",
        "R. A. Burns",
        "B. A. McGuire"
      ],
      "abstract": "A millimeter methanol maser ring tracing the deceleration of the heat wave powered by the massive protostellar accretion outburst in G358.93-0.03 MM1 T. R. Hunter, C. L. Brogan, G. C. MacLeod, C. J. Cyganowski, R. A. Burns, B. A. McGuire 11 pages, 3 figures, 3 tables, accepted for publication in the Astrophysical Journal Letters Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) We present multi-epoch, multi-band ALMA imaging of the new Class II millimeter methanol masers excited during the accretion outburst of the massive protostar G358.93-0.03 MM1. The highest angular resolution image (24 mas $\\approx$ 160 au) reveals a nearly complete, circular ring of strong maser spots in the 217.2992 GHz ($v_t$=1) maser line that closely circumscribes the dust continuum emission from MM1. Weaker maser emission lies inside the eastern and southern halves of the maser ring, generally coincident with the centimeter masers excited during the outburst, but avoiding the densest parts of the hot core gas traced by high excitation lines of CH$_3$CN. Using a variety of fitting techniques on the image cubes of the two strongest maser lines, each observed over 3-4 epochs, we find the diameter of the ring increased by $\\gtrsim$60% (from $\\approx$1100 to $\\approx$1800 au in the 217 GHz line) over 200 days, consistent with an average radial propagation rate of $\\approx$0.01c, while the maser intensity declined exponentially. Fitting the angular extent of the millimeter masers versus time yields a power law of index 0.39$\\pm$0.06, which also reproduces the observed extent of the 6.7 GHz masers in the first VLBI epoch of R. A. Burns et al. (2020). This exponent is consistent with the prediction of radius vs. time in the Taylor-von Neumann-Sedov self-similar solution for an intense spherical explosion from a point source ($R \\propto t^{2/5}$). These results demonstrate the explosive nature of accretion outbursts in massive protostars and their ability to generate subluminal heat waves traceable by centimeter and millimeter masers for several months as the energy traverses the surrounding molecular material.",
      "pdf_url": "https://arxiv.org/pdf/2512.24380.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24388",
      "title": "A closer look at the young stellar group around Sh 2-295",
      "authors": [
        "João Victor Corrêa-Rodrigues",
        "Jane Gregorio-Hetem"
      ],
      "abstract": "A closer look at the young stellar group around Sh 2-295 João Victor Corrêa-Rodrigues, Jane Gregorio-Hetem 9 pages, 3 tables, 7 figures, and 4 pages of supplementary material to be published in A&A Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Star formation is governed by multiple physical processes, making it inherently complicated. One excellent example is the Canis Major OB1/R1 Association, whose complex history of star formation is related to different episodes. Three supernova (SN) events potentially altered the environment and impacted star formation and stellar evolution. Prior investigations revealed two stellar groups of different ages associated with GU CMa and Z CMa. This work focusses on identifying the low-mass young stellar population near FZ CMa, located between these two groups and spatially related to the H II region Sh 2-295. Our main goal is to verify whether this group is age-mixed and characterise its physical properties. We analysed multi-object spectroscopic data acquired with Gemini/GMOS to search for typical features of T Tauri stars (TTs) and to determine their spectral types. Lithium absorption line ($\\lambda$ 6708 $\\mathring{A}$) was used as a youth indicator, while H$\\alpha$ emission was investigated to probe accretion activity. We also derived ages based on optical photometry from Gaia DR3 and compared the projected spatial distribution to diffuse infrared (IR) emission. We identified 29 TTs, including six new members of the association and three Classical TTs (CTTs). The equivalent width of the Li I absorption line suggests an age of $8.1^{+2.1}_{-3.8}$ Myr, while optical photometric data indicate stellar ages ranging from $\\sim$1 to 14 Myr. Younger stars are concentrated around Sh 2-295, whereas the older ones are more widely dispersed. We increased the number of known TTs related to the CMa association. Our results support a scenario of multiple star-formation episodes, including a younger group that may have been triggered by the expansion of Sh 2-295. The influence of SN events appears limited in this context.",
      "pdf_url": "https://arxiv.org/pdf/2512.24388.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24895",
      "title": "Resolving the Origins and Pathways of Ionizing Radiation Escape with UV Integral Field Spectroscopy",
      "authors": [
        "Cody Carr",
        "Renyue Cen",
        "Brian Fleming",
        "Sophia Flury",
        "Stephan McCandliss",
        "Sally Oey",
        "Allison Strom"
      ],
      "abstract": "Resolving the Origins and Pathways of Ionizing Radiation Escape with UV Integral Field Spectroscopy Cody Carr, Renyue Cen, Brian Fleming, Sophia Flury, Stephan McCandliss, Sally Oey, Allison Strom 26 pages, 2 figures, comments welcome. arXiv admin note: substantial text overlap with arXiv:2506.23105 Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) The Epoch of Reionization marks the last major phase transition in the early Universe, during which the majority of neutral hydrogen once filling the intergalactic medium was ionized by the first galaxies. The James Webb Space Telescope (JWST) is now identifying promising galaxy candidates capable of producing sufficient ionizing photons to drive this transformation. However, the fraction of these photons that escape into intergalactic space--the escape fraction--remains highly uncertain. Stellar feedback is thought to play a critical role in carving low-density channels that allow ionizing radiation to escape, but the dominant mechanisms, their operation, and their connection to observable signatures are not well understood. Local analogs of high-redshift galaxies offer a powerful alternative for studying these processes, since ionizing radiation is unobservable at high redshift due to intergalactic absorption. However, current UV space-based instrumentation lacks the spatial resolution and sensitivity required to fully address this problem. The core challenge lies in the multiscale nature of LyC escape: ionizing photons are generated on scales of 1--100 pc in super star clusters but must traverse the circumgalactic medium which can extend beyond 100 kpc. The proposed Habitable Worlds Observatory (HWO) will provide a platform for future UV instruments capable of resolving these scales. In this article, we present a science case for understanding how LyC photons escape from star-forming galaxies and define the observational requirements for future instruments aboard HWO, including a UV integral field spectrograph (IFS).",
      "pdf_url": "https://arxiv.org/pdf/2512.24895.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.02245",
      "title": "Intermediate-mass black holes and contribution to extragalactic background light from Population III stars in Milky Way-like galaxies",
      "authors": [
        "Artak Mkrtchyan",
        "Dieter Horns"
      ],
      "abstract": "Intermediate-mass black holes and contribution to extragalactic background light from Population III stars in Milky Way-like galaxies Artak Mkrtchyan, Dieter Horns Astrophysics of Galaxies (astro-ph.GA) The mass range of observed black holes extends from stellar-mass to supermassive scales, yet the existence of objects in the intermediate-mass range of $10^{2} - 10^{5} \\text{M}_{\\odot}$ remains unconfirmed. Black holes are suspected to compress the surrounding dark matter distribution, forming a ``spike''. If dark matter is self-annihilating, the spike could produce gamma-ray emission sufficiently luminous to be detected. This work aims to estimate the number of expected unmerged intermediate-mass black holes in a Milky Way-like galaxy that could form such spikes. These intermediate-mass black holes are assumed to have formed from the collapse of high-mass Population III stars, such that the resulting merger rate is constrained by observations of gravitational wave emission. It is furthermore estimated to what extent the progenitor Population III stars contribute to the extragalactic background light. The Population III stars are simulated and tracked using the A-SLOTH semi-analytical simulation code and the resulting number of intermediate-mass black holes is constrained by applying the Population III binary black hole merger rate to an effective volume determined from the Population III star formation rate. In this framework, $\\sim 130$ unmerged IMBHs from Population III stars are expected to reside in a Milky Way-like galaxy. The contribution of their progenitors to the extragalactic background light in the near-infrared is less than $10^{-3} \\text{nW} \\text{m}^{-2} \\text{sr}^{-1}$, well below previous estimates.",
      "pdf_url": "https://arxiv.org/pdf/2505.02245.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.12618",
      "title": "Supermassive Stars Match the Spectral Signatures of JWST's Little Red Dots",
      "authors": [
        "Devesh Nandal",
        "Abraham Loeb"
      ],
      "abstract": "Supermassive Stars Match the Spectral Signatures of JWST's Little Red Dots Devesh Nandal, Abraham Loeb 14 pages, 8 figures. Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The James Webb Space Telescope (JWST) has unveiled a population of enigmatic, compact sources at high redshift known as ``Little Red Dots'' (LRDs), whose physical nature remains a subject of intense debate. Concurrently, the rapid assembly of the first supermassive black holes (SMBHs) requires the formation of heavy seeds, for which supermassive stars (SMSs) are leading theoretical progenitors. In this work, we perform the first quantitative test of the hypothesis that LRDs are the direct observational manifestation of these primordial SMSs. We present a novel, first-principles pipeline generating synthetic spectra for a non-rotating, metal-free SMS up to $10^6 \\, M_\\odot$. We establish that its luminosity ($L_\\lambda \\approx 1.7 \\times 10^{44} \\, \\text{erg} \\, \\text{s}^{-1} \\, \\mu\\text{m}^{-1}$ at 4050\\,Å) provides a decisive constraint, matching prominent LRDs. Our model self-consistently reproduces their defining spectral features: the V-shaped Balmer break morphology is shown to be an intrinsic photospheric effect, while the complex line phenomenology, strong H$\\beta$ in emission with other Balmer lines in absorption arises from non-LTE effects in a single stellar atmosphere. With wind and macroturbulent broadening, we match LRD spectra at $z=7.76$ and $z=3.55$, including the H$\\beta$ width of MoM-BH*-1 to within 4\\%. We predict a luminosity-dependent observability window, $\\sim10^{4}$ yr for the most luminous systems and $10^{5}$--$10^{6}$ yr if $L_\\lambda(4050\\,\\textÅ)$ is lower by 1--2 dex. These results provide a self-consistent alternative to multi-component obscured AGN scenarios and suggest JWST may be witnessing luminous stages of SMBH progenitors before collapse.",
      "pdf_url": "https://arxiv.org/pdf/2507.12618.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.14883",
      "title": "The superclouds of the local Milky Way",
      "authors": [
        "Lilly A. Kormann",
        "João Alves",
        "Michelangelo Pantaleoni González",
        "Cameren Swiggum",
        "Torsten A. Enßlin",
        "Gordian Edenhofer"
      ],
      "abstract": "The superclouds of the local Milky Way Lilly A. Kormann, João Alves, Michelangelo Pantaleoni González, Cameren Swiggum, Torsten A. Enßlin, Gordian Edenhofer Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Recent 3D dust maps of the local Milky Way are revolutionizing our understanding of the Sun's Galactic neighborhood, providing much needed insight into the large-scale organization of the interstellar medium. Focusing on the largest scales in $\\textit{Gaia}$-based 3D dust maps, we find a pattern of seven highly elongated, mostly parallel structures in the local $\\sim 5\\,\\mathrm{kpc}^2$, five of which were previously unknown. These structures show pitch angles of $33.5 \\pm 4.0 ^\\circ$ and masses ranging from $10^5$ to $10^6$ $\\mathrm{M}_\\odot$. We refer to these structures as superclouds. Nearly all known star-forming regions in the solar neighborhood lie within the superclouds, primarily along their central axes, supporting the idea that they act as gas reservoirs for the formation of giant molecular clouds. All but one of the seven superclouds show an underlying undulation, indicating that this is not a property unique to the Radcliffe Wave. We find that while the superclouds have linear masses that vary by about a factor of 4, their volume densities only vary by about 10$\\%$. This suggests that superclouds self-regulate their physical sizes and internal structure to maintain pressure equilibrium with their environment. These findings establish a new framework for understanding how large-scale Galactic structures shape the conditions for star formation in the solar vicinity, and likely in galaxies like the Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2507.14883.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.03331",
      "title": "Radio Detection of a Local Little Red Dot",
      "authors": [
        "L. F. Rodriguez",
        "I. F. Mirabel"
      ],
      "abstract": "Radio Detection of a Local Little Red Dot L. F. Rodriguez, I. F. Mirabel 6 pages, 3 figures, submitted to A&A Astrophysics of Galaxies (astro-ph.GA) Context. One of the most important discoveries by the James Webb Space Telescope (JWST) is the unexpected existence in the Early Universe (z > 4) of very large quantities of \"Little Red Dots\" (LRDs), compact luminous red galaxies of intriguing physical properties. One of those intriguing properties is the absence of radio detections in high redshift LRDs. Aims. We wish to know if LRDs have radio emission that may be produced by accreting Intermediate/Supermassive Black Holes (IMBHs/SMBHs) or by frequent supernovae (SNe) from a cluster of massive stars. Methods. Assuming LRDs at high redshifts have not been detected at radio wavelengths due to their large distances and/or present limitations of observational capabilities, we analyse here archive Very Large Array radio observations of J1047+0739 and J1025+1402, two analog candidates of LRDs in the Local Universe (LLRDs) at redshifts z = 0.1 - 0.2. Results. The LLRD source J1047+0739 at z = 0.1682 is detected at 6.0 GHz in 2018 with the VLA-A (Very Large Array) as a compact source with radius less than 0.2 arcsec ($<$700 pc at d = 750 Mpc). Its flux density was 117$\\pm$8 $\\mu$Jy and its in-band spectral index was -0.85$\\pm$0.24, which is typical of optically-thin synchrotron emission. It was also detected at 5.0 GHz in 2010 with the VLA-C, showing a flux density of 130$\\pm$9 $\\mu$Jy. Conclusions. The observed flux densities can be provided by either a radio luminous supernova or an accreting IMBH/SMBH. However, the lack of important variation in flux density over eight years favors the IMBH/SMBH hypothesis. Radio time monitoring of this and other LLRDs could help clarify the mystery of the radio silence of its cosmological counterparts.",
      "pdf_url": "https://arxiv.org/pdf/2512.03331.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13778",
      "title": "Resolving dust and Lyα emission in a lensed galaxy at the epoch of reionization with JWST/CANUCS",
      "authors": [
        "V. Markov",
        "M. Bradač",
        "V. Estrada-Carpenter",
        "G. Desprez",
        "G. Rihtaršič",
        "J. Judež",
        "R. Tripodi",
        "M. Sawicki",
        "G. Noirot",
        "N. Martis",
        "C. Willott",
        "G. T. E. Sarrouh",
        "S. Withers",
        "A. Muzzin",
        "Y. Asada",
        "S. Gallerani",
        "A. Ferrara",
        "I. Goovaerts",
        "A. Harshan",
        "S. Fujimoto"
      ],
      "abstract": "Resolving dust and Lyα emission in a lensed galaxy at the epoch of reionization with JWST/CANUCS V. Markov, M. Bradač, V. Estrada-Carpenter, G. Desprez, G. Rihtaršič, J. Judež, R. Tripodi, M. Sawicki, G. Noirot, N. Martis, C. Willott, G. T. E. Sarrouh, S. Withers, A. Muzzin, Y. Asada, S. Gallerani, A. Ferrara, I. Goovaerts, A. Harshan, S. Fujimoto 11 pages, 5 figures, submitted to A&A Astrophysics of Galaxies (astro-ph.GA) Lyman $\\alpha$ emission is highly sensitive to dust and neutral hydrogen and is therefore expected to be strongly suppressed in dusty or gas-rich galaxies during the epoch of reionization (EoR). Nevertheless, numerous moderately dusty Ly$\\alpha$ emitters (LAEs) are observed at this epoch, suggesting that complex interstellar medium (ISM) geometries and feedback-driven outflows may facilitate Ly$\\alpha$ escape. We investigate the dust, gas, and stellar properties of the gravitationally lensed LAE HCM 6A at $z=6.5676$ to characterize its multiphase ISM and the physical conditions regulating Ly$\\alpha$ escape. We combine JWST/NIRISS slitless spectroscopy, HST+JWST/NIRCam imaging, and JWST/NIRSpec slit spectra from the CANUCS program. Using a customized BAGPIPES SED-fitting framework with a flexible attenuation law, we derive stellar, nebular, and dust properties on integrated ($\\sim$kpc), slit-level ($\\sim$0.1 kpc), and pixel-level ($\\sim$25 pc) scales, enabled by strong lensing ($\\mu \\approx 8.3$-$9.1$). A Ly$\\alpha$ map from SLEUTH traces the spatial distribution of Ly$\\alpha$ emission. We measure an unlensed stellar mass of $\\log M_\\ast = 8.3$-$8.4$ and an intrinsic UV magnitude of $M_{\\rm UV} = -19.8 \\pm 0.1$. The older region (S1) is moderately dusty with consistent stellar and nebular attenuation indicators, implying a uniform ISM geometry, while the youngest region (S3) shows strong discrepancies among dust tracers, indicating a feedback-shaped multiphase ISM. Ly$\\alpha$ emission arises primarily from S3, where a dust-cleared central clump enables efficient Ly$\\alpha$ escape. We find Calzetti-like attenuation curves with a UV bump that strengthens with stellar age and decreasing $A_V$. Our observations provide a uniquely detailed, spatially resolved view of a moderately dusty LAE during the EoR, demonstrating how feedback and multiphase ISM structure govern Ly$\\alpha$ escape.",
      "pdf_url": "https://arxiv.org/pdf/2512.13778.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.22751",
      "title": "Rotation and stability of the circumnuclear gas disk in the Galactic Center potential by the ALMA CMZ Exploration Survey (ACES)",
      "authors": [
        "Yoshiaki Sofue",
        "Steven N. Longmore",
        "Daniel Walker",
        "Adam Ginsburg",
        "Jonathan D. Henshaw",
        "John Bally",
        "Ashley T. Barnes",
        "Cara Battersby",
        "Laura Colzi",
        "Paul Ho",
        "Jimenez-Serra",
        "J.M.Diederik Kruijssen",
        "Elizabeth Mills",
        "Maya A. Petkova",
        "Mattia C. Sormani",
        "Jen Wallace",
        "Jairo Armijos-Abendano",
        "Zi-Xuan Feng",
        "Karl Fiteni",
        "Pablo García",
        "Savannah Gramze",
        "Christian Henkel",
        "Pei-Ying Hsieh",
        "Ralf S. Klessen",
        "Francisco Nogueras-Lara",
        "Dylan M. Paré",
        "Victor M.",
        "Rivilla",
        "Alvaro Sánchez-Monge"
      ],
      "abstract": "Rotation and stability of the circumnuclear gas disk in the Galactic Center potential by the ALMA CMZ Exploration Survey (ACES) Yoshiaki Sofue, Steven N. Longmore, Daniel Walker, Adam Ginsburg, Jonathan D. Henshaw, John Bally, Ashley T. Barnes, Cara Battersby, Laura Colzi, Paul Ho, Jimenez-Serra, J.M.Diederik Kruijssen, Elizabeth Mills, Maya A. Petkova, Mattia C. Sormani, Jen Wallace, Jairo Armijos-Abendano, Zi-Xuan Feng, Karl Fiteni, Pablo García, Savannah Gramze, Christian Henkel, Pei-Ying Hsieh, Ralf S. Klessen, Francisco Nogueras-Lara, Dylan M. Paré, Victor M., Rivilla, Alvaro Sánchez-Monge Accepted for PASJ, 20 pages, 20 figures Astrophysics of Galaxies (astro-ph.GA) We investigated the gravitational potential and mass distribution in the Galactic Center by examining the morphology and kinematics of the circumnuclear gaseous disk revealed by the molecular line data from the ALMA CMZ Exploration Survey (ACES). We obtain an estimate of the shape of the potential {within the central $\\sim 20$ pc} to reproduce the observed properties of the circumnuclear gas disk (CND) by simulating the motion of test particles for various axial ratios and show that the potential is approximately spherical. We construct a rotation curve by applying the terminal velocity method to the position-velocity diagrams, and calculate the mass distribution in the Galactic Center. The distribution of mass density is found to be of cusp type, approximated by $\\rho_{\\rm mass} \\sim 1.56\\times 10^5(R/1 {\\rm pc})^{-1.9}~M_{\\odot} {\\rm pc}^{-3}$, where $R$ is the distance from the nucleus. We discuss the tidal effect caused by the gravitational potential that produces the rotation curve and show that the gas disk is stable against self-gravitational contraction within a critical radius of $ R_{\\rm T}\\sim 14 ~(\\rho_{\\rm gas}/10^5 {\\rm H_2~cm^{-3}})^{-1/2}~{\\rm pc}$. This suggests suppression of star formation and a top-heavy IMF in the circmunuclear region.",
      "pdf_url": "https://arxiv.org/pdf/2512.22751.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24185",
      "title": "Tidally Trapped Two-pole Pulsations Discovered in a Close Binary with a Massive $β$ Cephei Star",
      "authors": [
        "Ping Li",
        "Wen-Ping Liao",
        "Sheng-Bang Qian",
        "Li-Ying Zhu",
        "Jia Zhang",
        "Qi-Bin Sun",
        "Fang-Bin Meng"
      ],
      "abstract": "Tidally Trapped Two-pole Pulsations Discovered in a Close Binary with a Massive $β$ Cephei Star Ping Li, Wen-Ping Liao, Sheng-Bang Qian, Li-Ying Zhu, Jia Zhang, Qi-Bin Sun, Fang-Bin Meng Solar and Stellar Astrophysics (astro-ph.SR) Tidally tilted pulsators (TTPs), whose pulsation axis aligns with the binary's semi-major axis, represent a newly established class of oscillators in binary systems. While all previously known TTPs are either $\\delta$ Scuti or subdwarf B-type stars, their existence has remained unidentified in more massive $\\beta$ Cephei variables. Here, we report the discovery of tidally trapped pulsations in the massive ellipsoidal variable HD~329379, based on photometry from the Transiting Exoplanet Survey Satellite (TESS). Our analysis reveals a $\\beta$ Cephei pulsator in a 2.25-day orbit whose pulsation mode amplitude is strongly modulated with the orbital frequency. Based on our analysis, we concluded that this modulation can be explained by pulsations with significantly larger amplitude near the star's two tidal poles (apsides). We interpret this as a tidally distorted quadrupole pulsation chariacteristiced by trapped two-pole pulsations, with a pulsation axis aligned with the tidal axis. This represents the first identification of such a pulsation mode in a $\\beta$ Cephei star, which differs from single-sided pulsations observed in previous works, marking a rare and important discovery. Our work extends the family of TTPs beyond $\\delta$ Scuti and subdwarf B-type stars to include more massive $\\beta$ Cephei variables. In particular, the two-pole pulsator HD~329379 stands out as the prototype of a new class of TTPs in massive stars. These results not only provide a new insight to probe the interior structure and evolutionary state for massive stars but also offer a unique opportunity to study the interaction between pulsations and strong tidal distortions.",
      "pdf_url": "https://arxiv.org/pdf/2512.24185.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24319",
      "title": "The Likelihood of Hosting Undetected Brown Dwarfs in the Solar Vicinity",
      "authors": [
        "Diana Bakirova",
        "Oleg Malkov"
      ],
      "abstract": "The Likelihood of Hosting Undetected Brown Dwarfs in the Solar Vicinity Diana Bakirova, Oleg Malkov Solar and Stellar Astrophysics (astro-ph.SR) Based on the spatial distribution of objects in the solar neighbourhood with a radius of 20 parsecs, and after correcting for the incompleteness of observational data, an expression was obtained for estimating the probability of finding an object at a given distance from the Sun. According to these estimates, with a probability of about 0.5, there exists a brown dwarf in the immediate solar vicinity (< 1.2 pc). The possible multiplicity of this hypothetical object is discussed, as well as the reasons why it has not yet been detected.",
      "pdf_url": "https://arxiv.org/pdf/2512.24319.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24507",
      "title": "3D Radiative MHD Modeling of Particle Beam Heating of the Solar Atmosphere",
      "authors": [
        "Samuel Granovsky",
        "Alexander G. Kosovichev",
        "Irina N. Kitiashvili",
        "Alan A. Wray"
      ],
      "abstract": "3D Radiative MHD Modeling of Particle Beam Heating of the Solar Atmosphere Samuel Granovsky, Alexander G. Kosovichev, Irina N. Kitiashvili, Alan A. Wray Solar and Stellar Astrophysics (astro-ph.SR) While solar flares are primarily associated with enhanced ultraviolet and X-ray emission, a subset of flares exhibit significant continuum brightening in visible light and are classified as white-light flares (WLFs). Despite extensive observational and modeling efforts, the physical mechanisms responsible for the compact, short-lived photospheric brightenings in WLF kernels observed during the impulsive phase of solar flares remain uncertain. Thick-target electron-beam models typically deposit energy in the upper chromosphere, and their ability to reproduce the magnitude and spatial localization of photospheric continuum enhancements observed in white-light flare kernels remains an open question. To investigate the role of realistic atmospheric structuring and multidimensional transport in flare energy deposition, we perform three-dimensional radiative MHD simulations of electron-beam heating using the StellarBox code for beam fluxes of $10^{12}$ erg\\,s$^{-1}$\\,cm$^{-2}$ and low-energy cutoffs of 10--25\\,keV. We then compute Fe\\,I 6173\\,Å~Stokes profiles using the RH 1.5D radiative transfer code for direct comparison with Helioseismic and Magnetic Imager (HMI) observations. The simulations produce strong upper-chromospheric heating, multiple shock fronts, and continuum enhancements up to a factor of 2.5 relative to pre-flare levels, comparable to continuum enhancements observed during strong X-class white-light flares. Comparison with one-dimensional RADYN simulations highlights the influence of fine-scale structuring on flare dynamics and continuum emission that arises in three-dimensional geometry.",
      "pdf_url": "https://arxiv.org/pdf/2512.24507.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24578",
      "title": "Inferring Solar Magnetic fields From the Polarization of the Mg II h and k Lines",
      "authors": [
        "Hao Li",
        "Tanausú del Pino Alemán",
        "Javier Trujillo Bueno"
      ],
      "abstract": "Inferring Solar Magnetic fields From the Polarization of the Mg II h and k Lines Hao Li, Tanausú del Pino Alemán, Javier Trujillo Bueno Accepted for publication in Reviews of Modern Plasma Physics Solar and Stellar Astrophysics (astro-ph.SR) The polarization of the Mg II h and k lines holds significant diagnostic potential for measuring chromospheric magnetic fields, which are crucial for understanding the physical processes governing the energy transport and dissipation in the solar upper atmosphere, as well as the subsequent heating of the chromosphere and corona. The Chromospheric Layer Spectropolarimeter was launched twice in 2019 and 2021, successfully acquiring spectropolarimetric observations across the Mg II h and k lines. The analysis of these observations confirms the capability of these lines for inferring magnetic fields in the upper chromosphere. In this review, we briefly introduce the physical mechanisms behind the polarization of the Mg II h and k lines, including the joint action of the Zeeman and Hanle effects, the magneto-optical effect, partial frequency redistribution, and atomic level polarization. We also provide an overview of recent progress in the interpretation of the Stokes profiles of the Mg II h and k lines.",
      "pdf_url": "https://arxiv.org/pdf/2512.24578.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24749",
      "title": "Coronal flux tube illuminated by strong shock spot: New Year's Eve solar eruption of 2023-Dec-31",
      "authors": [
        "Illya Plotnikov",
        "Alexis P. Rouillard",
        "Athanasios Kouloumvakos",
        "Immanuel Jebaraj"
      ],
      "abstract": "Coronal flux tube illuminated by strong shock spot: New Year's Eve solar eruption of 2023-Dec-31 Illya Plotnikov, Alexis P. Rouillard, Athanasios Kouloumvakos, Immanuel Jebaraj 24 pages, 8 figures, submitted to Solar Physics Solar and Stellar Astrophysics (astro-ph.SR) Powerful solar eruptions are known to produce fast and wide shock waves in the solar corona and inner heliosphere. The relationship between the coronal shock waves, solar energetic particles and different types of radio emission is a subject of long-lasting research activity. In this work, we perform a case study of 31 December 2023 eruption that occurred near eastern limb of the Sun. It produced a X5.0 class X-ray flare, a global EUV wave, a fast $\\sim3000$ km/s Coronal Mass Ejection, strong radio emissions (including several type III and type II bursts), solar energetic particles in-situ, and long duration high-energy gamma-ray emission. We employ a technique that combines the reconstructed coronal shock from observations with background coronal MHD simulations to produce shock-mediated synthetic radio spectrum, assuming local emission at plasma frequency. We show that transient high Mach number and quasi-perpendicular coronal shock region explains both a ``hot flux tube'' precursor seen in EUV observations and reverse drifting radio spectral features observed by ground-based facilities. The occurrence of this evanescent strong shock patch was observed when it propagated across pseudo-streamer's cusp where the magnetic field was particularly low. We also find evidence that, at higher coronal altitudes, the low-frequency type II radio burst detected by several spacecraft, is triggered by the interaction of the shock with the heliospheric current sheet. This study provides additional evidence that high-$M_A$ regions of coronal shock surface are instrumental in energetic particle phenomenology.",
      "pdf_url": "https://arxiv.org/pdf/2512.24749.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.25002",
      "title": "Distributions of wide binary stars in theory and in Gaia data: III. Orbital momenta, masses, and manifestations of MOND",
      "authors": [
        "Valeri V. Makarov"
      ],
      "abstract": "Distributions of wide binary stars in theory and in Gaia data: III. Orbital momenta, masses, and manifestations of MOND Valeri V. Makarov Solar and Stellar Astrophysics (astro-ph.SR) Using the censored catalog of 103,169 resolved Gaia DR3 binary stars with accurate astrometric data for each component, a new observable, object-specific parameter is computed for each pair: the projected orbital momentum. This parameter is the product of four functions of physical characteristics: total mass, semimajor axis, eccentricity, and inclination angle. Using the previously estimated marginal probability densities of eccentricity and semimajor axis, and assuming an isotropic orientation of binary systems, the sample distribution of mass was adjusted using a concordance metric of the observed and synthetic distributions of orbital momenta and an ad hoc functional model. The best-fitting mass density model is found to faithfully reproduce the observed dependence of orbital momenta on apparent separation, although the absolute luminosity distributions indicate a tendency of the widest systems to more frequently include solar-type primaries. The anticipated manifestation of MOND is computed in the investigated parameter space \\{separation, momentum\\}. This effect is absent in the given data. The median total mass of the widest Gaia binaries is found to be somewhat higher than that of the tighter pairs, which is interpreted as a dynamical age effect.",
      "pdf_url": "https://arxiv.org/pdf/2512.25002.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24004",
      "title": "Atmospheric Mass Flux as a Function of Ionospheric Emission on Unmagnetized Earth",
      "authors": [
        "P. C. Hinton",
        "D. A. Brain",
        "N. R. Schnepf",
        "R. Jarvinen",
        "J. Cessna",
        "F. Bagenal"
      ],
      "abstract": "Atmospheric Mass Flux as a Function of Ionospheric Emission on Unmagnetized Earth P. C. Hinton, D. A. Brain, N. R. Schnepf, R. Jarvinen, J. Cessna, F. Bagenal Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We explore ion escape from, and solar ion deposition to, \\hll{an unmagnetized Earth-like planet}. We use RHybrid, an ion-kinetic electron-fluid code to simulate the global plasma interaction of unmagnetized Earth with the solar wind. We vary the global ionospheric emission rate, and quantify the resultant planetary ion escape rates ($O^+$ and $H^+$) and the solar wind deposition rate ($H^+$). We use these results to compute the net mass flux to the atmosphere and find that the solar ion deposition rate could be comparable to planetary ion escape rates. For the emission rates simulated, our results show that under typical solar wind conditions ($v_{sw} = 400 \\ km \\ s^{-1}$, $n_{sw} = 5 \\ cm^{-3}$), the mass of the atmosphere would decrease by less than 3\\% over a billion years, indicating that Earth's intrinsic magnetic field may be unnecessary for retention of its atmosphere. Lastly, we present a hypothesis suggesting that ionospheric emission may evolve through time towards a critical emission rate that occurs at a net mass flux of zero.",
      "pdf_url": "https://arxiv.org/pdf/2512.24004.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24067",
      "title": "Antarctic TianMu Staring Observation Project I: Overview and Implementation of the Prototype Telescope",
      "authors": [
        "Dan Zhou",
        "Jing Zhong",
        "Jianchun Shi",
        "Zhenghong Tang",
        "Shiyin Shen",
        "Peng Jiang",
        "Jie Zhu",
        "Yong Yu",
        "Lixin Zheng",
        "Jianjun Cao",
        "Guoping Chen",
        "Xinyu Yao",
        "Congcong Zhang",
        "Lurun Shen",
        "Hui Zhang",
        "Xiang Pan",
        "Chenwei Yang",
        "Tuo Ji",
        "Xian Shi",
        "Hengxiao Guo",
        "Zhen Yan",
        "Donghai Zhao",
        "Liang Chen",
        "Jianeng Zhou",
        "Minfeng Gu",
        "Fuguo Xie",
        "Wenbiao Han",
        "Jinliang Hou",
        "Bixuan Zhao",
        "Wenwen Zuo",
        "Chun Xu",
        "Zhengyi Shao",
        "Lei Hao",
        "Jian Fu"
      ],
      "abstract": "Antarctic TianMu Staring Observation Project I: Overview and Implementation of the Prototype Telescope Dan Zhou, Jing Zhong, Jianchun Shi, Zhenghong Tang, Shiyin Shen, Peng Jiang, Jie Zhu, Yong Yu, Lixin Zheng, Jianjun Cao, Guoping Chen, Xinyu Yao, Congcong Zhang, Lurun Shen, Hui Zhang, Xiang Pan, Chenwei Yang, Tuo Ji, Xian Shi, Hengxiao Guo, Zhen Yan, Donghai Zhao, Liang Chen, Jianeng Zhou, Minfeng Gu, Fuguo Xie, Wenbiao Han, Jinliang Hou, Bixuan Zhao, Wenwen Zuo, Chun Xu, Zhengyi Shao, Lei Hao, Jian Fu 15 pages, 10 figures, accepted for publication in Astronomical Techniques and Instruments (ATI) Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Wide-field rapid sky surveys serve as critical observational methods for time-domain astronomical research. The Antarctic region, with several months of continuous dark nights annually, is an ideal site for time-domain astronomical observations. The Antarctic TianMu Staring Observation Project aims to deploy a fleet of small telescopes, adopting an array observation model to conduct time-domain optical observations in Antarctica, featuring wide-sky coverage, high-cadence sampling, long-period staring, and simultaneous multi-band measurements. Considering the severe challenges optical telescopes face in Antarctica, including extremely low temperatures, unattended operation, and limited power supply and network transmission, we have designed and developed the Antarctic TianMu prototype telescope based on drift-scan charge-coupled device technology. In October 2022, our prototype (with an aperture of 18 cm), named AT-Proto was transported to Zhongshan Station in Antarctica aboard China's 39th Antarctic Research Expedition. It has since operated stably and reliably in the frigid environment for over two years, demonstrating the significant advantages of this technology in polar astronomical observations. The experimental observation results of AT-Proto provide a solid foundation for the subsequent construction of a time-domain astronomy observation array in Antarctica.",
      "pdf_url": "https://arxiv.org/pdf/2512.24067.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24068",
      "title": "Antarctic TianMu Staring Observation Project II: Data reduction and preliminary results",
      "authors": [
        "Hubiao Niu",
        "Jing Zhong",
        "Yu Zhang",
        "Jianchun Shi",
        "Rui Rong",
        "Jinzhong Liu",
        "Shiyin Shen",
        "Zhenghong Tang",
        "Dan Zhou"
      ],
      "abstract": "Antarctic TianMu Staring Observation Project II: Data reduction and preliminary results Hubiao Niu, Jing Zhong, Yu Zhang, Jianchun Shi, Rui Rong, Jinzhong Liu, Shiyin Shen, Zhenghong Tang, Dan Zhou 17 pages, 12 figures, accepted for publication in Astronomical Techniques and Instruments (ATI) Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) The Antarctic TianMu Staring Observation Program is a time-domain optical sky survey project carried out in Antarctica, capable of large sky coverage, high-cadence sampling, and long-period staring. It utilizes the exceptional observing conditions in Antarctica to conduct high-cadence time-domain sky surveys. At present, we have successfully developed an 18-cm aperture Antarctic TianMu prototype, which has been deployed at Zhongshan Station in Antarctica for two consecutive years of trouble-free observations, during which more than 300,000 original images were obtained. This paper systematically outlines the commissioning data of the prototype telescope in 2023, the primary data processing pipeline, and the preliminary data products. The core pipeline encompasses four key stages: Data preprocessing, instrumental effect correction, astrometric solution, and full-field stellar photometry. Here, we release the 2023 data products, which specifically include reduced image data and a photometric catalog, for which, preliminary analyses demonstrate robust performance. Using Gaia Data Release 3 as a reference catalog, the astrometric precision, quantified by the root mean square of positional errors, is determined to be better than approximately 2 arcseconds, validating the observational capabilities of the system. For a 30-second exposure, the detection limit in the G-band is achieved at 15.00~mag, with a detection threshold of 1.5~$\\sigma$. The photometric errors are below 0.1~mag for the majority of stars brighter than 14.00~mag. Furthermore, it improves significantly, reaching better than 0.01~mag for most stars brighter than 11.00~mag and 12.00~mag when employing the adaptive aperture photometry and point spread function photometry methods, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2512.24068.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24479",
      "title": "Understanding Solar Flares and Energetic Events: Open questions, observational requirements, and instrumental needs over the coming decade",
      "authors": [
        "Malcolm K. Druett",
        "Graham S. Kerr",
        "Joel C. Allred",
        "Philippa K. Browning",
        "Giulio Del Zanna",
        "Jaroslav Dudík",
        "Robertus Erdélyi",
        "Andrzej Fludra",
        "David R. Graham",
        "Hamish A. S. Reid",
        "Laura A. Hayes",
        "Sarah A. Matthews",
        "James A. McLaughlin",
        "Christopher M. J. Osborne",
        "Alex G. M. Pietrow",
        "Vanessa Polito",
        "Alex J. B. Russell",
        "Peter F. Wyper"
      ],
      "abstract": "Understanding Solar Flares and Energetic Events: Open questions, observational requirements, and instrumental needs over the coming decade Malcolm K. Druett, Graham S. Kerr, Joel C. Allred, Philippa K. Browning, Giulio Del Zanna, Jaroslav Dudík, Robertus Erdélyi, Andrzej Fludra, David R. Graham, Hamish A. S. Reid, Laura A. Hayes, Sarah A. Matthews, James A. McLaughlin, Christopher M. J. Osborne, Alex G. M. Pietrow, Vanessa Polito, Alex J. B. Russell, Peter F. Wyper A white Paper in response to Space Frontiers 2035. Primary Thematic Area: Heliophysics Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Solar flares are the largest energy-release events in the Solar System, allowing us to study fundamental physical phenomena under extreme conditions. Those include magnetic reconnection, particle acceleration, radiation transport, and various plasma physics processes, all of which occur throughout the heliosphere and rest of the Universe. Flares and eruptive events are also components of geo-effective space weather. Their impacts from a space weather perspective are numerous, such as harm to satellites, disruption to GPS, communications and power systems, and impacts on passenger air travel. A comprehensive understanding of solar flares is therefore not just a compelling science problem, but also important for national security and infrastructure. This white paper (WP) addresses critical open science questions related to solar flares. Key observations and capabilities required to make significant advancements over the coming decade are identified. The UK has a robust and vibrant solar flare community. We are key partners in international collaborations, and also provide instrumentation for existing and upcoming ESA/NASA/JAXA space missions. Continuing this effort over the coming decade is vital to maintain UK leadership in this field, achieve Solar System Advisory Panel roadmap goals, and to work under the UK Space Agency's National Space Strategy Pillars. Several complementary WPs have been submitted that discuss instruments or concepts that would directly address the observational requirements we describe (including: SPARK, solar optimised IFUs, Solar-C/EUVST, and OSIRIS), as well as required numerical modelling efforts and infrastructure.",
      "pdf_url": "https://arxiv.org/pdf/2512.24479.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04346",
      "title": "An alternative theory of magnetic flux tubes in strong fields via axion origin photons",
      "authors": [
        "Vitaliy Rusov",
        "Tatiana Zelentsova"
      ],
      "abstract": "An alternative theory of magnetic flux tubes in strong fields via axion origin photons Vitaliy Rusov, Tatiana Zelentsova Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) In our alternative theory, built around the coincidence of experimental and theoretical data, three \"free\" parameters -- the magnetic field in the tachocline of the order of ~10^7 G (see Fig.(A.1) and Eq.(A17) in V. D. Rusov et al. (2021)), the axion mass ma ~3.2*10^{-2} eV (see Eq. (11) in V. D. Rusov et al. (2021)), and the asymmetric dark matter (ADM) in the Universe with mADM ~5 GeV ((see V. D. Rusov et al. (2021); A. C. Vincent et al. (2016)) -- give a complete solution to the problem of the theory of magnetic flux tubes in strong fields with 11-year variations of axion-origin photons, which are caused by and anticorrelated to the 11-year variations in density of ADM, gravitationally captured on the Sun.",
      "pdf_url": "https://arxiv.org/pdf/2511.04346.pdf",
      "categories": [
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.15345",
      "title": "Photometric and spectroscopic variability of the blue supergiant rho Leo",
      "authors": [
        "V.A. Checha",
        "A. Aret",
        "I. Kolka",
        "T. Liimets",
        "I. Araya",
        "A. Christen",
        "G.F. Avila Marín",
        "R.S. Levenhagen",
        "L. Cidale",
        "T. Eenmäe",
        "G. Hajiyeva",
        "Ü. Kivila",
        "V. Mitrokhina",
        "H. Ramler",
        "T. Verro"
      ],
      "abstract": "Photometric and spectroscopic variability of the blue supergiant rho Leo V.A. Checha, A. Aret, I. Kolka, T. Liimets, I. Araya, A. Christen, G.F. Avila Marín, R.S. Levenhagen, L. Cidale, T. Eenmäe, G. Hajiyeva, Ü. Kivila, V. Mitrokhina, H. Ramler, T. Verro 14 pages, 14 figures, accepted for publication in Astronomy & Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) Context. The post-main-sequence evolution of massive stars remains poorly understood, particularly for blue supergiants. These objects play a crucial role in the dynamical and chemical evolution of galaxies and exhibit pronounced photometric and spectroscopic variability, often quasi-periodic rather than strictly periodic. Aims. We investigate the variability of the evolved B-type star rho Leo to determine its physical properties, identify the underlying mechanisms driving its variability, and constrain its evolutionary stage. Methods. We analyse long-term spectroscopic and photometric datasets obtained from multiple sources, including the TESS and Kepler space missions and observations with the 1.5 m telescope in Estonia. Period analysis is performed using the Generalized Lomb-Scargle periodogram, Lomb-Scargle pre-whitening, and the Weighted Wavelet Z-Transform. Fundamental stellar parameters are derived by fitting synthetic line profiles computed with the FastWind code to the HARPS spectrum, while the stellar rotation inclination is estimated using the ZPEKTR code. Results. The He I 6678.151 A line shows significant radial-velocity and line-profile moment variations. We detect a set of periods and harmonics spanning approximately 0.8 to 35 days. Some periods remain stable over time, whereas others vary between observing seasons. A comparison of spectroscopic and photometric variability, together with phase-curve morphology, allows us to constrain the origin of several signals. In particular, the approximately 11 day period is attributed to stellar rotation, while the approximately 17 day period is linked to radial pulsations. Conclusions. Although the variability is quasi-periodic, most detected periods persist across multiple seasons. The wide range of timescales suggests that rho Leo is likely evolving along a blue loop following the red supergiant phase.",
      "pdf_url": "https://arxiv.org/pdf/2512.15345.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25332",
      "title": "Dynamical Architectures of S-type Transiting Planets in Binaries II: A Dichotomy in Orbital Alignment of Small Planets in Close Binary Systems",
      "authors": [
        "Jingwen Zhang",
        "Daniel Huber",
        "Michael Bottom",
        "Lauren M. Weiss",
        "Jerry W. Xuan",
        "Adam L. Kraus",
        "Chih-Chun Hsu",
        "Jason J. Wang",
        "Fei Dai",
        "Katelyn Horstman",
        "Ashley Baker",
        "Randall Bartos",
        "Benjamin Calvin",
        "Sylvain Cetre",
        "Catherine A. Clark",
        "David R. Ciardi",
        "Jacques-Robert Delorme",
        "Gregory W. Doppmann",
        "Daniel Echeverri",
        "Luke Finnerty",
        "Michael P. Fitzgerald",
        "Steve B. Howell",
        "Howard Isaacson",
        "Nemanja Jovanovic",
        "Kathryn V. Lester",
        "Joshua Liberman",
        "Ronald A. López",
        "Dimitri Mawet",
        "Evan Morris",
        "Jacklyn Pezzato-Rovner",
        "Jean-Baptiste Ruffio",
        "Ben Sappey",
        "Tobias Schofield",
        "Andrew Skemer",
        "J. Kent Wallace",
        "Ji Wang",
        "Yinzi Xin",
        "Judah Van Zandt"
      ],
      "abstract": "Dynamical Architectures of S-type Transiting Planets in Binaries II: A Dichotomy in Orbital Alignment of Small Planets in Close Binary Systems Jingwen Zhang, Daniel Huber, Michael Bottom, Lauren M. Weiss, Jerry W. Xuan, Adam L. Kraus, Chih-Chun Hsu, Jason J. Wang, Fei Dai, Katelyn Horstman, Ashley Baker, Randall Bartos, Benjamin Calvin, Sylvain Cetre, Catherine A. Clark, David R. Ciardi, Jacques-Robert Delorme, Gregory W. Doppmann, Daniel Echeverri, Luke Finnerty, Michael P. Fitzgerald, Steve B. Howell, Howard Isaacson, Nemanja Jovanovic, Kathryn V. Lester, Joshua Liberman, Ronald A. López, Dimitri Mawet, Evan Morris, Jacklyn Pezzato-Rovner, Jean-Baptiste Ruffio, Ben Sappey, Tobias Schofield, Andrew Skemer, J. Kent Wallace, Ji Wang, Yinzi Xin, Judah Van Zandt Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Stellar multiplicity plays a crucial role in shaping planet formation and dynamical evolution. We present a survey of 54 TESS Objects of Interest (TOIs) within 300 pc that exhibit significant Hipparcos-Gaia astrometric accelerations. We identified 35 TOIs with stellar companions at projected separations between $0.1^{\\prime\\prime}$ to $2^{\\prime\\prime}$ (or $10-200$ AU). We also identified 12 TOIs that could host planetary-mass or brown dwarf companions, including 6 that are newly discovered. Furthermore, we perform three-dimensional orbital characterization for 12 binaries hosting confirmed planets or planet candidates, allowing us to constrain the line-of-sight mutual inclination, $\\Delta I_{\\mathrm{los}}$, between the planetary and binary orbits. Combining our sample with previous measurements, we apply Bayesian hierarchical analysis to a total of 26 binary systems with S-type transiting planets ($r_p<5R_{\\oplus}$). Specifically, we fit the $\\Delta I_{\\mathrm{los}}$ distribution with both single (Rayleigh) and mixture models (two-component Rayleigh and Rayleigh-isotropic mixture). We find the mixture models are strongly favored ($\\log Z\\gtrsim13.9$, or $\\approx$5$\\sigma$), indicating the observed planet-binary $\\Delta I_{\\mathrm{los}}$ values likely originate from two underlying populations: one nearly aligned ($\\sigma_1 = 2^{\\circ}.4^{+0.7}_{-0.9}$) and one with more scattered mutual inclinations ($\\sigma_2 = 23^{\\circ}.6^{+8.8}_{-7.1}$). Alternatively, the misaligned systems can be equally well described by an isotropic distribution of inclinations. This observed dichotomy likely reflects different dynamical histories. Notably, the misaligned population only emerges in systems with stellar periastron distances $>40$ AU while systems with close-in or eccentric stellar companions (periastron distances $<40$ AU) preserve planet-binary alignment.",
      "pdf_url": "https://arxiv.org/pdf/2509.25332.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24465",
      "title": "Picture an Astronomer: Best Practices for Retaining Talent in Astrophysics",
      "authors": [
        "Ava Polzin",
        "Katherine E. Whitaker",
        "C. Megan Urry",
        "Henna Abunemeh",
        "Sanyukta Agarwal",
        "Aadya Agrawal",
        "Nathaniel Alden",
        "Ann-Marsha Alexis",
        "Sydney Andersen",
        "Melanie Archipley",
        "Yasmeen Asali",
        "Katie Auchettl",
        "Bradford Benson",
        "Binod Bhattarai",
        "Sarah Biddle",
        "Madison Brady",
        "Katelyn Breivik",
        "Disha Chakraborty",
        "Mikel Charles",
        "Hsiao-Wen Chen",
        "Josephine Chishala",
        "Anirudh Chiti",
        "Panagiota Eleftheria Christopoulou",
        "Mi Dai",
        "Flaminia Fortuni",
        "Shanika Galaudage",
        "Daniel Glazer",
        "Anika Goel",
        "Andrea Gokus",
        "Jenny E. Greene",
        "Ryn Grutkoski",
        "Yiqing Guo",
        "Joseph Guzman",
        "Renée Hložek",
        "Lindsay R. House",
        "Lillian N. Joseph",
        "Molly Beth Jourdan",
        "Tanvi Karwal",
        "Zuzanna Kocjan",
        "Emily Koivu",
        "Varun Kore",
        "Andrey Kravtsov",
        "Keerthi Kunnumkai",
        "Shalini Kurinchi-Vendhan",
        "Johannes U. Lange",
        "Sarah R. Loebman",
        "Kira Lund",
        "Julie Malewicz",
        "Olivia McAuley",
        "Rebecca McClain",
        "Stephen McKay",
        "Emily McPike",
        "Cassidy Metzger",
        "Lamiya A. Mowla",
        "Katherine Myers",
        "Erica Nelson",
        "Aline Novais",
        "Camilla Nyhagen",
        "Micah Oeur",
        "Lou Baya Ould Rouis",
        "Paarmita Pandey",
        "Raagini Patki",
        "Sonu Tabitha Paulson",
        "Haile M. L. Perkins",
        "Ashi Poorey",
        "Izabella Pozo",
        "Heather L. Preston",
        "Pazit Rabinowitz",
        "Alexandra S. Rahlin",
        "Janiris Rodriguez-Bueno",
        "Francisco Rodríguez Montero",
        "Huei Sears",
        "Álvaro Segovia Otero",
        "Uliana Solovieva",
        "Rachel Somerville",
        "Jessica Speedie",
        "Tjitske Starkenburg",
        "Laura Stiles-Clarke",
        "Chin Yi Tan",
        "Yu-Hsuan Teng",
        "Tanya Urrutia",
        "Padmavathi Venkatraman",
        "Margaret E. Verrico",
        "Amanda Wasserman",
        "Claire E. Williams",
        "Tony Wong",
        "Shirin Gul Zaidi",
        "Chantene Zichterman"
      ],
      "abstract": "Picture an Astronomer: Best Practices for Retaining Talent in Astrophysics Ava Polzin, Katherine E. Whitaker, C. Megan Urry, Henna Abunemeh, Sanyukta Agarwal, Aadya Agrawal, Nathaniel Alden, Ann-Marsha Alexis, Sydney Andersen, Melanie Archipley, Yasmeen Asali, Katie Auchettl, Bradford Benson, Binod Bhattarai, Sarah Biddle, Madison Brady, Katelyn Breivik, Disha Chakraborty, Mikel Charles, Hsiao-Wen Chen, Josephine Chishala, Anirudh Chiti, Panagiota Eleftheria Christopoulou, Mi Dai, Flaminia Fortuni, Shanika Galaudage, Daniel Glazer, Anika Goel, Andrea Gokus, Jenny E. Greene, Ryn Grutkoski, Yiqing Guo, Joseph Guzman, Renée Hložek, Lindsay R. House, Lillian N. Joseph, Molly Beth Jourdan, Tanvi Karwal, Zuzanna Kocjan, Emily Koivu, Varun Kore, Andrey Kravtsov, Keerthi Kunnumkai, Shalini Kurinchi-Vendhan, Johannes U. Lange, Sarah R. Loebman, Kira Lund, Julie Malewicz, Olivia McAuley, Rebecca McClain, Stephen McKay, Emily McPike, Cassidy Metzger, Lamiya A. Mowla, Katherine Myers, Erica Nelson, Aline Novais, Camilla Nyhagen, Micah Oeur, Lou Baya Ould Rouis, Paarmita Pandey, Raagini Patki, Sonu Tabitha Paulson, Haile M. L. Perkins, Ashi Poorey, Izabella Pozo, Heather L. Preston, Pazit Rabinowitz, Alexandra S. Rahlin, Janiris Rodriguez-Bueno, Francisco Rodríguez Montero, Huei Sears, Álvaro Segovia Otero, Uliana Solovieva, Rachel Somerville, Jessica Speedie, Tjitske Starkenburg, Laura Stiles-Clarke, Chin Yi Tan, Yu-Hsuan Teng, Tanya Urrutia, Padmavathi Venkatraman, Margaret E. Verrico, Amanda Wasserman, Claire E. Williams, Tony Wong, Shirin Gul Zaidi, Chantene Zichterman White paper from Picture an Astronomer symposium Instrumentation and Methods for Astrophysics (astro-ph.IM); Physics and Society (physics.soc-ph) Women are consistently underrepresented in astrophysics yet are simultaneously subject to disproportionate attrition at every career stage. This disparity between demonstrated efficacy in job performance and ultimate career outcome was the primary motivation for the Picture an Astronomer series, which included both targeted public outreach to increase representation of women in astrophysics and high-level, solution-oriented discussions among professional astronomers. In March 2025, more than 200 astronomers came together in a hybrid-format symposium focused on the state of the field for female scientists, combining scientific exchange with discussions of policies and practices to strengthen retention of talent in the field. This white paper is the result of those discussions, offering a wide range of recommendations developed in the context of gendered attrition in astrophysics but which ultimately support a healthier climate for all scientists alike.",
      "pdf_url": "https://arxiv.org/pdf/2512.24465.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24475",
      "title": "Nine years of UVIT: assessing sensitivity variation",
      "authors": [
        "Akanksha Dagore",
        "Prajwel Joseph",
        "S. N. Tandon",
        "Annapurni Subramaniam",
        "S. K. Ghosh",
        "C. S. Stalin"
      ],
      "abstract": "Nine years of UVIT: assessing sensitivity variation Akanksha Dagore, Prajwel Joseph, S. N. Tandon, Annapurni Subramaniam, S. K. Ghosh, C. S. Stalin Accepted for publication in The Astronomical Journal Instrumentation and Methods for Astrophysics (astro-ph.IM) The Ultra-Violet Imaging Telescope (UVIT) is one of the five payloads onboard the first Indian multiwavelength astronomical observatory, AstroSat, launched by the Indian Space Research Organisation on 28 September 2015. UVIT, designed for simultaneous imaging in the far-ultraviolet (FUV; 1300-1800 Å) and near-ultraviolet (NUV; 2000-3000 Å) channels, has completed nine years in orbit in 2024 despite the failure of the NUV channel in 2018. As the FUV optics is subject to possible reduction in sensitivity due to microscopic amounts of contaminants, we used the FUV data acquired by UVIT over the past nine years on the open cluster NGC 188 and the white dwarf HZ 4 to study sensitivity variations in the UVIT FUV channel. Our findings indicate no significant reduction in the sensitivity of the FUV channel over the last nine years, with no significant episodic variations due to unknown causes.",
      "pdf_url": "https://arxiv.org/pdf/2512.24475.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24754",
      "title": "AstroReview: An LLM-driven Multi-Agent Framework for Telescope Proposal Peer Review and Refinement",
      "authors": [
        "Yutong Wang",
        "Yunxiang Xiao",
        "Yonglin Tian",
        "Junyong Li",
        "Jing Wang",
        "Yisheng Lv"
      ],
      "abstract": "AstroReview: An LLM-driven Multi-Agent Framework for Telescope Proposal Peer Review and Refinement Yutong Wang, Yunxiang Xiao, Yonglin Tian, Junyong Li, Jing Wang, Yisheng Lv Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI) Competitive access to modern observatories has intensified as proposal volumes outpace available telescope time, making timely, consistent, and transparent peer review a critical bottleneck for the advancement of astronomy. Automating parts of this process is therefore both scientifically significant and operationally necessary to ensure fair allocation and reproducible decisions at scale. We present AstroReview, an open-source, agent-based framework that automates proposal review in three stages: (i) novelty and scientific merit, (ii) feasibility and expected yield, and (iii) meta-review and reliability verification. Task isolation and explicit reasoning traces curb hallucinations and improve transparency. Without any domain specific fine tuning, AstroReview used in our experiments only for the last stage, correctly identifies genuinely accepted proposals with an accuracy of 87%. The AstroReview in Action module replicates the review and refinement loop; with its integrated Proposal Authoring Agent, the acceptance rate of revised drafts increases by 66% after two iterations, showing that iterative feedback combined with automated meta-review and reliability verification delivers measurable quality gains. Together, these results point to a practical path toward scalable, auditable, and higher throughput proposal review for resource limited facilities.",
      "pdf_url": "https://arxiv.org/pdf/2512.24754.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23885",
      "title": "Control and read-out of the HEPD-02 tracking system onboard CSES-02 satellite",
      "authors": [
        "S. Bartocci",
        "R. Battiston",
        "S. Beolè",
        "F. Benotto",
        "P. Cipollone",
        "S. Coli",
        "A. Contin",
        "M. Cristoforetti",
        "C. De Donato",
        "C. De Santis",
        "A. Di Luca",
        "F. Dumitrache",
        "F. M. Follega",
        "S. Garrafa Botta",
        "G. Gebbia",
        "R. Iuppa",
        "A. Lega",
        "M. Lolli",
        "G. Masciantonio",
        "M. Mergè",
        "M. Mese",
        "R. Nicolaidis",
        "F. Nozzoli",
        "A. Oliva",
        "G. Osteria",
        "F. Palma",
        "F. Palmonari",
        "B. Panico",
        "S. Perciballi",
        "F. Perfetto",
        "P. Picozza",
        "M. Pozzato",
        "E. Ricci",
        "M. Ricci",
        "S. B. Ricciarini",
        "Z. Sahnoun",
        "U. Savino",
        "V. Scotti",
        "E. Serra",
        "A. Sotgiu",
        "R. Sparvoli",
        "P. Ubertini",
        "V. Vilona",
        "S. Zoffoli",
        "P. Zuccon"
      ],
      "abstract": "Control and read-out of the HEPD-02 tracking system onboard CSES-02 satellite S. Bartocci, R. Battiston, S. Beolè, F. Benotto, P. Cipollone, S. Coli, A. Contin, M. Cristoforetti, C. De Donato, C. De Santis, A. Di Luca, F. Dumitrache, F. M. Follega, S. Garrafa Botta, G. Gebbia, R. Iuppa, A. Lega, M. Lolli, G. Masciantonio, M. Mergè, M. Mese, R. Nicolaidis, F. Nozzoli, A. Oliva, G. Osteria, F. Palma, F. Palmonari, B. Panico, S. Perciballi, F. Perfetto, P. Picozza, M. Pozzato, E. Ricci, M. Ricci, S. B. Ricciarini, Z. Sahnoun, U. Savino, V. Scotti, E. Serra, A. Sotgiu, R. Sparvoli, P. Ubertini, V. Vilona, S. Zoffoli, P. Zuccon 17 pages and 7 figures; Accepted for publication on JINST Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) The High Energy Particle Detector (HEPD-02) is a payload of the second China Seismo-Electromagnetic Satellite (CSES-02), designed and built by the Italian Limadou collaboration. Its purpose is to detect cosmic rays and trapped particles of radiation belts, in the kinetic energy range 3-100 MeV for electrons, 30-200 MeV for protons. HEPD-02 is the first space detector to use a tracking detector based on Monolithic Active Pixel Sensors (MAPS). The MAPS provides high spatial resolution, low noise, increased robustness, and low production costs. Operating MAPS in space presents a significant challenge due to strict power consumption requirements. To meet such constraints, a custom Tracker Data Acquisition (TDAQ) board and firmware have been designed and implemented, by using a commercial low-power Field Programmable Gate Array (FPGA). This paper addresses the design features of the TDAQ unit, enabling the tracking detector to be operated efficiently, with particular focus on the power consumption performance.",
      "pdf_url": "https://arxiv.org/pdf/2512.23885.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.09918",
      "title": "XSPECT on-board XPoSat: Calibration and First Results",
      "authors": [
        "Rwitika Chatterjee",
        "Koushal Vadodariya",
        "Radhakrishna Vatedka",
        "Vivek Kumar Agrawal",
        "Anurag Tyagi",
        "Kiran M Jayasurya",
        "Shyam Prakash V. P.",
        "Ramadevi M C",
        "Vaishali Sharan"
      ],
      "abstract": "XSPECT on-board XPoSat: Calibration and First Results Rwitika Chatterjee, Koushal Vadodariya, Radhakrishna Vatedka, Vivek Kumar Agrawal, Anurag Tyagi, Kiran M Jayasurya, Shyam Prakash V. P., Ramadevi M C, Vaishali Sharan 29 pages, 19 figures, 3 tables. Published in JATIS J. Astron. Telesc. Instrum. Syst. 11(4), 044007 (2025) Instrumentation and Methods for Astrophysics (astro-ph.IM) XPoSat is India's first X-ray spectro-polarimetry mission, consisting of two co-aligned instruments, a polarimeter (POLIX) and a spectrometer (XSPECT), to study the X-ray emission from celestial sources. Since polarimetry is a photon-hungry technique, the mission is designed to observe sources for long integration times (~ few days to weeks). This provides an unique opportunity, enabling XSPECT to carry out long-term monitoring of sources, and study their spectro-temporal evolution. To ensure that the instrument is able to fulfill its scientific objectives, it was extensively calibrated on-ground. Post launch, these calibrations were validated using on-board observations. Additionally, some aspects of the instrument such as alignment and effective area were also derived and fine-tuned from in-flight data. In this paper, we describe the calibration of XSPECT instrument in detail, including some initial results derived from its data to establish its capabilities.",
      "pdf_url": "https://arxiv.org/pdf/2506.09918.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21754",
      "title": "FITrig: A High-Performance Detection Technique for Efficient Ultra-Long-Period Pulsars",
      "authors": [
        "X. Li",
        "K. Adamek",
        "W. Armour"
      ],
      "abstract": "FITrig: A High-Performance Detection Technique for Efficient Ultra-Long-Period Pulsars X. Li, K. Adamek, W. Armour Accepted by Astronomy and Computing Instrumentation and Methods for Astrophysics (astro-ph.IM) Ultra-long-period (ULP) pulsars, a newly identified class of celestial transients, offer unique insights into astrophysics, though very few have been detected to date. In radio astronomy, most time-domain detection methods cannot find these pulsars, and current image-based detection approaches still face challenges, including low sensitivity, high false positive rate, and low computational efficiency. In this article, we develop Fast Imaging Trigger (FITrig), a GPU-accelerated, statistics-based method for ULP pulsar detection and localisation. FITrig includes two complementary approaches -- an image domain and an image-frequency domain strategy. FITrig offers advantages by increasing sensitivity to faint pulsars, suppressing false positives (from noise, processing artefacts, or steady sources), and improving search efficiency in large-scale wide-field images. Compared to the state-of-the-art source finder SOFIA 2, FITrig increases the detection speed by 4.3 times for large images ($50\\mathrm{K} \\times 50\\mathrm{K}$ pixels) and reduces false positives by up to 858.8 times (at 6$\\sigma$ significance) for the image domain branch, while the image-frequency domain branch suppresses false positives even further. FITrig maintains the capability to detect pulsars that are 20 times fainter than surrounding steady features, even under critical Nyquist sampling conditions. In this article, the performance of FITrig is demonstrated using both real-world data (MeerKAT observations of PSR J0901-4046) and simulated datasets based on MeerKAT and SKA Array Assembly (AA) 2 telescope configurations. With its real-time processing capabilities and scalability, FITrig is a promising tool for next-generation telescopes, such as the SKA, with the potential to uncover hidden ULP pulsars.",
      "pdf_url": "https://arxiv.org/pdf/2509.21754.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11806",
      "title": "KDP as a thermal blocking filter -- Deep near IR observations with a warm narrow band filter",
      "authors": [
        "J. K. M. Viuho , A. A. Djupvik , A. N. Sørensen , D. Kumar , P. Steiner , J. P. U. Fynbo , S. Armas , M. I. Andersen Cosmic Dawn Center , Niels Bohr Institute, University of Copenhagen, Copenhagen N, Denmark, Nordic Optical Telescope, Brena Baja, Spain, Department of Physics and Astronomy, Aarhus University, Aarhus C, Denmark, Ferroperm Optics A/S, Vedbæk, Denmark)"
      ],
      "abstract": "KDP as a thermal blocking filter -- Deep near IR observations with a warm narrow band filter J. K. M. Viuho (1,2,3,4), A. A. Djupvik (3,4), A. N. Sørensen (1,2), D. Kumar (5), P. Steiner (5), J. P. U. Fynbo (1,2), S. Armas (3,4), M. I. Andersen (1,2) ((1) Cosmic Dawn Center (DAWN), (2) Niels Bohr Institute, University of Copenhagen, Copenhagen N, Denmark, (3) Nordic Optical Telescope, Brena Baja, Spain, (4) Department of Physics and Astronomy, Aarhus University, Aarhus C, Denmark, (5) Ferroperm Optics A/S, Vedbæk, Denmark) 16 pages, 8 figures, 6 tables. Accepted to PASP Instrumentation and Methods for Astrophysics (astro-ph.IM) Ground-based astronomy suffers from strong atmospheric line- and thermal continuum emission, at the near infrared (NIR, 0.7-1.1$\\mu$m), and short-wave infrared (SWIR, 1.1-2.5$\\mu$m) wavelengths. The thermal continuum emission increases exponentially towards the red sensitivity cutoff of the state-of-the-art 2.5$\\mu$m cutoff SWIR detectors. Given availability of an optical quality shortpass filter material with strong blocking density in the SWIR, lower cost instrumentation, and higher performance filters could be designed. We demonstrate monopotassium dihydrogen phosphate (KDP, chemical formula KH$_2$PO$_4$) as a strong candidate for this purpose. KDP is fully transparent at wavelengths from ultraviolet to 1.3$\\mu$m, but becomes highly opaque at wavelengths >2$\\mu$m. We demonstrate on-sky use of KDP by improving performance of a cryogenic broadband filter with known off-band thermal leak, and using a non-cryogenic narrow band filter for deep observation. KDP reduces the sky background by 4.5 magnitudes in the leaky Z-band filter we use. Our 4nm wide, central wavelength 1.191$\\mu$m narrowband filter in combination with KDP reduces the sky surface brightness by three magnitudes compared to a J broadband. We find a sky surface brightness of 18.5mag arcsec$^{-2}$ at 1.191$\\mu$m, and interpret it as the airglow continuum. KDP is an excellent thermal blocker, when its temperature is maintained above its Curie point at 123K. Below Curie point, KDP transforms its crystal structure, degrading its otherwise good imaging properties.",
      "pdf_url": "https://arxiv.org/pdf/2511.11806.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05331",
      "title": "EMPEROR I. Exoplanet MCMC parallel tempering for RV orbit retrieval",
      "authors": [
        "Pablo A. Peña",
        "James S. Jenkins"
      ],
      "abstract": "EMPEROR I. Exoplanet MCMC parallel tempering for RV orbit retrieval Pablo A. Peña, James S. Jenkins Accepted for publication in A&A Sect. 15. Numerical methods and codes. The official acceptance date is 19/10/2025 Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present EMPEROR, an open-source Python framework designed for efficient exoplanet detection and characterisation with radial velocities (RV). EMPEROR integrates Dynamic Nested Sampling (DNS) and Adaptive Parallel Tempering (APT) Markov Chain Monte Carlo (MCMC), supporting multiple noise models such as Gaussian Processes (GPs) and Moving Averages (MA). The framework enables systematic model comparison using statistical metrics, including Bayesian evidence ($\\ln{\\mathcal{Z}}$) and Bayesian Information Criterion (BIC), while providing automated, publish-ready visualisations. EMPEROR is evaluated across three distinct systems to assess its capabilities in different detection scenarios. Sampling performance, model selection, and the search for Earth-mass planets are evaluated in data for 51 Pegasi, HD 55693 and Barnard's Star (GJ 699). For 51 Pegasi, APT achieves an effective sampling increase over DNS by a factor 3.76, while retrieving tighter parameter estimates. For HD 55693 the stellar rotation $P_{\\text{rot}}=29.72^{+0.01}_{-0.02}$ and magnetic cycle $P_{\\text{mag}}=2557.0^{+70.1}_{-36.7}$ are recovered, while demonstrating the sensitivity of $\\ln{\\mathcal{Z}}$ to prior selection. For Barnard's star, several noise models are compared, and the confirmed planet parameters are successfully retrieved with all of them. The best model shows a period of 3.1536$\\pm$0.0003~d, minimum mass of 0.38$\\pm$0.03 M$_{\\rm{\\oplus}}$, and semi-major axis of 0.02315$\\pm$0.00039~AU. Purely statistical inference might be insufficient on its own for robust exoplanet detection. Effective methodologies must integrate domain knowledge, heuristic criteria, and multi-faceted model comparisons. The versatility of EMPEROR in handling diverse noise structures, its systematic model selection, and its improved performance make it a valuable tool for RV exoplanetary studies.",
      "pdf_url": "https://arxiv.org/pdf/2511.05331.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.24538",
      "title": "Seafloor Weathering and Stochastic Outgassing Unlikely to Significantly Shorten the Future Lifespan of Earth's Terrestrial Biosphere",
      "authors": [
        "Livia Zhu",
        "R.J. Graham",
        "Dorian S. Abbot"
      ],
      "abstract": "Seafloor Weathering and Stochastic Outgassing Unlikely to Significantly Shorten the Future Lifespan of Earth's Terrestrial Biosphere Livia Zhu, R.J. Graham, Dorian S. Abbot The Astrophysical Journal Letters, 996(1), L14 (2025) Earth and Planetary Astrophysics (astro-ph.EP) Current understanding suggests that as the Sun brightens in the far future, Earth's carbonate-silicate cycle will offset increasing temperatures by drawing CO$_2$ out of the atmosphere, ultimately leading to the extinction of all terrestrial plant life via either overheating or CO$_2$ starvation. Most previous estimates put the future lifespan of Earth's terrestrial biosphere at $\\sim$1 billion yr, but recent work used a new coupled climate-continental weathering model with up-to-date parameter constraints to revise this estimate upward to 1.6-1.86 billion yr. In this study, we extend the model to examine the impacts of seafloor weathering and stochastic variations in CO$_2$ outgassing rates on the remaining lifespan of Earth's terrestrial biosphere. We find that if seafloor weathering has a stronger feedback than continental weathering and accounts for a large portion of global silicate weathering, then the remaining lifespan of the terrestrial biosphere can be shortened, but a lifespan of more than 1 billion yr (Gyr) remains likely. Similarly, stochastic fluctuations in outgassing rates can have a significant impact if the size of the fluctuations exceed those observed over the last 1 billion yr. The impact of weak seafloor weathering and lower variability stochasticity are minor. Our work provisionally supports a lengthened lifespan of Earth's terrestrial biosphere, suggests robustness of this lengthened lifespan to planetary parameters that may vary among exoplanets, and identifies seafloor weathering as a key process that requires further study and constraint.",
      "pdf_url": "https://arxiv.org/pdf/2512.24538.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11459",
      "title": "A mini-review on combinatorial solutions to the Marcus-Lushnikov irreversible aggregation",
      "authors": [
        "Michał Łepek",
        "Agata Fronczak",
        "Piotr Fronczak"
      ],
      "abstract": "A mini-review on combinatorial solutions to the Marcus-Lushnikov irreversible aggregation Michał Łepek, Agata Fronczak, Piotr Fronczak 42 pages, 15 figures, a mini-review; in this version, the incorrectly changing date has been removed from the title page Statistical Mechanics (cond-mat.stat-mech); Earth and Planetary Astrophysics (astro-ph.EP); Soft Condensed Matter (cond-mat.soft); Mathematical Physics (math-ph); Chemical Physics (physics.chem-ph) Over the past decade, a combinatorial framework for discrete, finite, and irreversibly aggregating systems has emerged. This work reviews its progress, practical applications, and limitations. We outline the approach's assumptions and foundations, based on direct enumeration of system states, contrasting with classical Smoluchowski and Marcus-Lushnikov methods. Using the constant kernel as an example, we derive combinatorial expressions for the average number of clusters of a given size and their standard deviation, and present the complete probability distribution for cluster counts. The method is then extended to several kernels (additive, product, linear-chain, condensation) by explicitly enumerating ways to form clusters of a given size. For general kernels, approximate solutions are obtained via recursive expressions, enabling predictions without explicit solutions. Applications to aerosol growth and planetesimal formation are demonstrated, with comparisons to numerical results. We summarize issues of validity and precision and propose open problems. The appendix includes partial Bell polynomials, generating functions, Lagrange inversion, potential applications, and links between combinatorial and scaling solutions of the Smoluchowski equation.",
      "pdf_url": "https://arxiv.org/pdf/2512.11459.pdf",
      "categories": [
        "astro-ph.EP",
        "math-ph"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}