{
  "date": "2025-10-24",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.SR",
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.EP",
    "astro-ph.IM",
    "astro-ph.CO"
  ],
  "total_papers": 94,
  "gw_related_papers": 4,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.18968",
      "title": "A resistive MHD module in the GPU-accelerated GRMHD code GRaM-X",
      "authors": [
        "Sara Azizi",
        "Swapnil Shankar",
        "Philipp Mösta",
        "Roland Haas",
        "Erik Schnetter"
      ],
      "abstract": "A resistive MHD module in the GPU-accelerated GRMHD code GRaM-X Sara Azizi, Swapnil Shankar, Philipp Mösta, Roland Haas, Erik Schnetter 24 pages, 10 figures. Submitted to CQG High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Relativistic macroscopic plasma dynamics can be described by general-relativistic magnetohydrodynamics. In many high-energy astrophysical settings, such as the interior dynamics of magnetized stars, the ideal GRMHD approximation, in which we assume infinite conductivity, provides an excellent description. However, ideal GRMHD neglects resistive effects that are essential for processes such as magnetic reconnection, dissipation, and magnetospheric dynamics. Incorporating resistivity into astrophysical plasma models accounts for the fact that plasmas in such environments are not perfect conductors. We present a resistive version of the GPU-accelerated GRMHD code GRaM-X, which evolves the full resistive GRMHD equations using the Z4c formalism for Einstein's equations. We implement a second-order implicit-explicit Runge-Kutta scheme to handle stiff source terms, obtain the primitive quantities from the conserved quantities using a one-dimensional recovery method, and employ the HLLE Riemann solver in combination with TVD and WENO reconstruction schemes. We validate the module using a range of standard tests, including 1D shocktubes, current sheets, Alfvén waves, 2D cylindrical explosions, and 3D TOV stars. The results of these tests demonstrate accurate recovery of the ideal MHD limit, correct resistive behavior, and stable evolution in dynamical spacetimes. Leveraging the GPU-accelerated resistive version of GRaM-X enables efficient large-scale simulations, paving the way for realistic studies of binary mergers, accretion flows, and relativistic jets within the framework of multi-messenger astrophysics.",
      "pdf_url": "https://arxiv.org/pdf/2510.18968.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19233",
      "title": "Nearly Monochromatic Primordial Black Holes as total Dark Matter from Bubble Collapse",
      "authors": [
        "Haonan Wang",
        "Ying-li Zhang",
        "Teruaki Suyama"
      ],
      "abstract": "Nearly Monochromatic Primordial Black Holes as total Dark Matter from Bubble Collapse Haonan Wang, Ying-li Zhang, Teruaki Suyama Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We propose a two-field model where the inflaton $\\chi$ is non-minimally coupled to the instanton $\\phi$. By choosing an appropriate coupling function, we realize the scenario where the difference of the values of potential between false vacuum (FV) and true vacuum (TV) is maximized during inflation. Most of the bubbles are created at this time. After inflation ends, the potential value of FV drops below that of TV so that these bubbles collapse to form primordial black holes (PBHs). By tuning the parameters of our model, we analyze the Coleman-de Luccia (CDL) and Hawking-Moss (HM) process, finding that the corresponding mass function of PBHs is sharply peaked, implying that we can realize either PBHs as cold dark matter, sub-solar PBHs, or supermassive PBHs in this scenario without enhancement of primordial curvature perturbations.",
      "pdf_url": "https://arxiv.org/pdf/2510.19233.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.17305",
      "title": "Gas-induced perturbations on the gravitational wave in-spiral of live post-Newtonian LISA massive black hole binaries",
      "authors": [
        "Mudit Garg",
        "Alessia Franchini",
        "Alessandro Lupi",
        "Matteo Bonetti",
        "Lucio Mayer"
      ],
      "abstract": "Gas-induced perturbations on the gravitational wave in-spiral of live post-Newtonian LISA massive black hole binaries Mudit Garg, Alessia Franchini, Alessandro Lupi, Matteo Bonetti, Lucio Mayer 10 pages, 4 figures. Accepted by ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); General Relativity and Quantum Cosmology (gr-qc) We investigate the effect of dynamically coupling gas torques with gravitational wave (GW) emission during the orbital evolution of an equal-mass massive black hole binary (MBHB). We perform hydrodynamical simulations of eccentric MBHBs with total mass $M=10^6~{\\rm M}_\\odot$ embedded in a prograde locally isothermal circumbinary disk (CBD). We evolve the binary from $55$ to $49$ Schwarzschild radii separations using up to 2.5 post-Newtonian (PN) corrections to the binary dynamics, which allow us to follow the GW-driven in-spiral. For the first time, we report the measurement of gas torques onto a live binary a few years before the merger, with and without concurrent GW radiation. We also report the gas-induced orbital dephasing $\\delta \\phi_{\\rm orb}\\sim-0.007$ rad over $278$ orbital cycles that is likely driven mainly by disc-induced precession and LISA should be able to detect it at redshift $z=1$. Our results show how GWs alone can be used to probe the astrophysical properties of CBDs and have important implications for multi-messenger strategies aimed at studying the environments of MBHBs.",
      "pdf_url": "https://arxiv.org/pdf/2410.17305.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.03743",
      "title": "Bimetric gravity improves the fit to DESI BAO and eases the Hubble tension",
      "authors": [
        "Marcus Högås",
        "Edvard Mörtsell"
      ],
      "abstract": "Bimetric gravity improves the fit to DESI BAO and eases the Hubble tension Marcus Högås, Edvard Mörtsell Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate whether the latest combination of DESI DR2 baryon acoustic oscillation (BAO) measurements, cosmic microwave background (CMB) data (Planck 2018 + ACT), and Type Ia supernovae (SNe Ia) compilations (Pantheon+, Union3, and DES Y5) favor a dynamical dark energy component, and explore if such a scenario can simultaneously help resolve the Hubble tension. We contrast two frameworks: the widely used phenomenological $w_0 w_a$CDM model, and bimetric gravity, a fundamental modification of general relativity that naturally gives rise to phantom dark energy. The $w_0 w_a$CDM model is moderately preferred over $\\Lambda$CDM, at the $2$-$4 \\, \\sigma$ level, when fitting DESI DR2 + CMB + SNe Ia, but it exacerbates the Hubble tension. By comparison, bimetric gravity provides a modest improvement in fit quality, at the $1 \\, \\sigma$ level, but, by inferring $H_0 = 69.0 \\pm 0.4 \\, \\mathrm{km/s/Mpc}$, it partially eases the Hubble tension, from a $5 \\,\\sigma$ discrepancy to a $3.7 \\, \\sigma$ tension. Including locally calibrated SNe Ia brings the overall preference for the bimetric model over $\\Lambda$CDM to the $2 \\, \\sigma$ level, comparable to that of the $w_0 w_a$CDM model when including the local SN Ia calibration.",
      "pdf_url": "https://arxiv.org/pdf/2507.03743.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.12881",
      "title": "Revealing evolution of Dark Energy density from observations",
      "authors": [
        "José Blanco",
        "Víctor H. Cárdenas",
        "Cuauhtémoc Campuzano"
      ],
      "abstract": "Revealing evolution of Dark Energy density from observations José Blanco, Víctor H. Cárdenas, Cuauhtémoc Campuzano Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present a model--independent reconstruction of the normalized dark energy density function, $X(z) \\equiv \\rho_{\\mathrm{de}}(z)/\\rho_{\\mathrm{de}}(0)$, derived directly from the DES-SN5YR Type~Ia supernova sample. The analysis employs an inversion formalism that relates the derivative of the distance modulus, $\\mu^{\\prime}(z)$, to the expansion history, allowing the data to determine the shape of $X(z)$ without assuming a specific equation--of--state or dark energy density parameterization. A statistically optimized binning of the supernova sample (using 17 intervals following the Freedman--Diaconis criterion and 34 following Scott's rule) ensures a stable estimation of $\\mu^{\\prime}(z)$ and a controlled propagation of uncertainties throughout the inversion process. The resulting $X(z)$ remains statistically consistent with a constant value within one standard deviation across the entire redshift range, showing no significant evidence for an evolving dark energy component at present. In a direct comparison among $\\Lambda$CDM, CPL, and the quadratic $X^2(z)$ parameterization -- where CPL and $X^2(z)$ each introduce two additional free parameters relative to $\\Lambda$CDM -- the CPL model attains the best statistical agreement with the data, albeit only marginally and strictly within this restricted model set. These outcomes indicate that current observations are compatible with an almost constant dark energy density ($w \\simeq -1$), while the inversion framework remains sensitive to subtle departures that forthcoming high--precision surveys could resolve.",
      "pdf_url": "https://arxiv.org/pdf/2510.12881.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18981",
      "title": "The Lensing Counter Narrative: An Effective Description of Small-Scale Clustering in Weak Lensing Power Spectra",
      "authors": [
        "Joseph DeRose",
        "Shi-Fan Chen"
      ],
      "abstract": "The Lensing Counter Narrative: An Effective Description of Small-Scale Clustering in Weak Lensing Power Spectra Joseph DeRose, Shi-Fan Chen 22 pages, 16 figures, likelihood code released at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a new formalism to separate large- and small-scale contributions to cosmic shear through $\\textit{lensing counterterms}$ (LCT) inspired by effective field theory (EFT). Marginalizing over these LCTs isolates the large-scale cosmological signal in weak lensing power spectra while simultaneously constraining the impact of baryonic feedback or new physics (e.g. axion dark matter) at small scales. Our formalism removes the need for hard scale cuts in standard analyses, even when theoretical predictions are limited to below a physical cutoff $\\Lambda$, resulting in significant improvements in constraining power -- up to $5\\times$ smaller in the case of a LSST-Y10-like analysis without marginalizing over baryons when the analysis cutoff is set to $\\Lambda = 1.0h$ Mpc$^{-1}$. We conduct a proof-of-principle analysis on the publicly available DES Y3 data, finding $S_8= 0.761\\pm 0.045$ and $S_8 = 0.794\\pm 0.040$ for analyses with cutoffs of $\\Lambda = 0.5h$ Mpc$^{-1}$ and $1.0 h$ Mpc$^{-1}$, respectively, with no detection of modifications to small-scale clustering at $k > \\Lambda$ beyond the predictions of collisionless dark matter in a $\\Lambda$CDM universe. We make our $\\texttt{JAX}$-based pipeline, $\\texttt{gholax}$, integrated with intrinsic alignment predictions from the EFT of large-scale structure at 1-loop, publicly available.",
      "pdf_url": "https://arxiv.org/pdf/2510.18981.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19069",
      "title": "Hubble tension in an anisotropic Universe",
      "authors": [
        "Maksym Deliyergiyev",
        "Morgan Le Delliou",
        "Antonino Del Popolo"
      ],
      "abstract": "Hubble tension in an anisotropic Universe Maksym Deliyergiyev, Morgan Le Delliou, Antonino Del Popolo Mon.Not.Roy.Astron.Soc., 542 (2025) 3105-3124 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Data Analysis, Statistics and Probability (physics.data-an) We explore the Hubble tension within an anisotropic cosmological framework by revisiting the Bianchi type-I model introduced in Le Delliou et al. 2020. Motivated by ongoing debates surrounding back-reaction effects and observed anomalies in the cosmic microwave background (CMB), we investigate whether a departure from isotropy in the late Universe could reconcile the observed discrepancies in Hubble constant measurements. Using a Bayesian inference framework, we constrain the model parameters employing multiple nested sampling algorithms: bilby, PyMultiNest, and nessai. We perform the analysis under both uniform and Gaussian priors, allowing us to systematically assess the sensitivity of the inferred cosmological parameters to different prior assumptions. This dual-prior strategy balances agnostic parameter exploration with constraints informed by theory and observation. Our findings demonstrate the reliability of our inference pipeline across different samplers and emphasize the crucial role of prior selection in non-standard cosmological model testing. The results suggest that anisotropic models remain viable contenders in addressing current cosmological tensions: even though the present model does not show alleviation of the Hubble tension, the data points towards anisotropies. Future work may extend this methodology to more complex anisotropic scenarios and incorporate additional cosmological probes such as CMB polarization and gravitational wave standard sirens.",
      "pdf_url": "https://arxiv.org/pdf/2510.19069.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.19149",
      "title": "$H_0$ Without the Sound Horizon (or Supernovae): A 2% Measurement in DESI DR1",
      "authors": [
        "E. A. Zaborowski",
        "P. Taylor",
        "K. Honscheid",
        "A. Cuceu",
        "A. de Mattia",
        "A. Krolewski",
        "M. Rashkovetskyi",
        "A. J. Ross",
        "C. To",
        "J. Aguilar",
        "S. Ahlen",
        "A. Anand",
        "S. BenZvi",
        "D. Bianchi",
        "D. Brooks",
        "F. J. Castander",
        "T. Claybaugh",
        "A. de la Macorra",
        "J. Della Costa",
        "P. Doel",
        "S. Ferraro",
        "A. Font-Ribera",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "G. Gutierrez",
        "H. K. Herrera-Alcantar",
        "C. Howlett",
        "D. Huterer",
        "M. Ishak",
        "R. Joyce",
        "D. Kirkby",
        "T. Kisner",
        "A. Kremin",
        "O. Lahav",
        "C. Lamman",
        "M. Landriau",
        "L. Le Guillou",
        "M. Manera",
        "P. Martini",
        "A. Meisner",
        "R. Miquel",
        "J. Moustakas",
        "S. Nadathur",
        "G. Niz",
        "N. Palanque-Delabrouille",
        "W. J. Percival",
        "F. Prada",
        "I. Pérez-Ràfols",
        "G. Rossi",
        "L. Samushia",
        "E. Sanchez",
        "D. Schlegel",
        "M. Schubnell",
        "H. Seo",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarlé",
        "B. A. Weaver",
        "P. Zarrouk",
        "R. Zhou",
        "H. Zou"
      ],
      "abstract": "$H_0$ Without the Sound Horizon (or Supernovae): A 2% Measurement in DESI DR1 E. A. Zaborowski, P. Taylor, K. Honscheid, A. Cuceu, A. de Mattia, A. Krolewski, M. Rashkovetskyi, A. J. Ross, C. To, J. Aguilar, S. Ahlen, A. Anand, S. BenZvi, D. Bianchi, D. Brooks, F. J. Castander, T. Claybaugh, A. de la Macorra, J. Della Costa, P. Doel, S. Ferraro, A. Font-Ribera, J. E. Forero-Romero, E. Gaztañaga, G. Gutierrez, H. K. Herrera-Alcantar, C. Howlett, D. Huterer, M. Ishak, R. Joyce, D. Kirkby, T. Kisner, A. Kremin, O. Lahav, C. Lamman, M. Landriau, L. Le Guillou, M. Manera, P. Martini, A. Meisner, R. Miquel, J. Moustakas, S. Nadathur, G. Niz, N. Palanque-Delabrouille, W. J. Percival, F. Prada, I. Pérez-Ràfols, G. Rossi, L. Samushia, E. Sanchez, D. Schlegel, M. Schubnell, H. Seo, J. Silber, D. Sprayberry, G. Tarlé, B. A. Weaver, P. Zarrouk, R. Zhou, H. Zou Cosmology and Nongalactic Astrophysics (astro-ph.CO) The sound horizon scale $r_s$ is a key source of information for early-time $H_0$ measurements, and is therefore a common target of new physics proposed to solve the Hubble tension. We present a sub-2% measurement of the Hubble constant that is independent of this scale, using data from the first data release of the Dark Energy Spectroscopic Instrument (DESI DR1). Building on previous work, we remove dependency on the sound horizon size using a heuristic rescaling procedure at the power spectrum level. A key innovation is the inclusion of \\emph{uncalibrated} (agnostic to $r_s$) post-reconstruction BAO measurements from DESI DR1, as well as using the CMB acoustic scale $\\theta_*$ as a high-redshift anchor. Uncalibrated type-Ia supernovae are often included as an independent source of $\\Omega_m$ information; here we demonstrate the robustness of our results by additionally considering two supernova-independent alternative datasets. We find somewhat higher values of $H_0$ relative to our previous work: $69.2^{+1.3}_{-1.4}$, $70.3^{+1.4}_{-1.2}$, and $69.6^{+1.3}_{-1.8}\\,{\\rm km\\,s^{-1}\\,Mpc^{-1}}$ respectively when including measurements from i) Planck/ACT CMB lensing $\\times$ unWISE galaxies, ii) the DES Year 3 6$\\times$2pt analysis, and iii) Planck/ACT CMB lensing + the DES Year 5 supernova analysis. These remarkably consistent constraints achieve better than 2% precision; they are among the most stringent sound horizon-independent measurements from LSS to date, and provide a powerful avenue for probing the origin of the Hubble tension.",
      "pdf_url": "https://arxiv.org/pdf/2510.19149.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19168",
      "title": "Transfer Learning Beyond the Standard Model",
      "authors": [
        "Veena Krishnaraj",
        "Adrian E. Bayer",
        "Christian Kragh Jespersen",
        "Peter Melchior"
      ],
      "abstract": "Transfer Learning Beyond the Standard Model Veena Krishnaraj, Adrian E. Bayer, Christian Kragh Jespersen, Peter Melchior 4+8 pages, 7 figures. Accepted at NeurIPS 2025 Workshop: Machine Learning and the Physical Sciences Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an) Machine learning enables powerful cosmological inference but typically requires many high-fidelity simulations covering many cosmological models. Transfer learning offers a way to reduce the simulation cost by reusing knowledge across models. We show that pre-training on the standard model of cosmology, $\\Lambda$CDM, and fine-tuning on various beyond-$\\Lambda$CDM scenarios -- including massive neutrinos, modified gravity, and primordial non-Gaussianities -- can enable inference with significantly fewer beyond-$\\Lambda$CDM simulations. However, we also show that negative transfer can occur when strong physical degeneracies exist between $\\Lambda$CDM and beyond-$\\Lambda$CDM parameters. We consider various transfer architectures, finding that including bottleneck structures provides the best performance. Our findings illustrate the opportunities and pitfalls of foundation-model approaches in physics: pre-training can accelerate inference, but may also hinder learning new physics.",
      "pdf_url": "https://arxiv.org/pdf/2510.19168.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19224",
      "title": "BaryonBridge: Stochastic Interpolant Model for Fast Hydrodynamical Simulations",
      "authors": [
        "Benjamin Horowitz",
        "Carolina Cuesta-Lazaro",
        "Omar Yehia"
      ],
      "abstract": "BaryonBridge: Stochastic Interpolant Model for Fast Hydrodynamical Simulations Benjamin Horowitz, Carolina Cuesta-Lazaro, Omar Yehia Abstract accepted to the 3rd Machine Learning for Astrophysics Workshop at ICML (July 2025), 3 figures, 6 pages Cosmology and Nongalactic Astrophysics (astro-ph.CO) Constructing a general-purpose framework for mapping between dark matter simulations and observable hydrodynamical simulation outputs is a long-standing problem in modern astrophysics. In this work, we present a new approach utilizing stochastic interpolants to map between cheap fast particle mesh simulations and baryonic quantities in three dimensions, requiring a total of 7 GPU minutes per 256^3 grid size simulation. Using the CAMELS multifield dataset, we are able to condition our mapping on both cosmological and astrophysical properties. We focus this work on hydrodynamical quantities suitable for Lya observables finding excellent agreement up to small spatial scales, k ~ 10.0 (h^(-1) Mpc) at z=2.0, for Lya flux statistics. Our approach is fully convolutional, allowing training on comparatively small volumes and application to larger volumes, which was tested on TNG50.",
      "pdf_url": "https://arxiv.org/pdf/2510.19224.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19629",
      "title": "Beyond Standard Model equation of state and primordial black holes",
      "authors": [
        "Xavier Pritchard",
        "Matthew Starbuck",
        "Wingfung Leung"
      ],
      "abstract": "Beyond Standard Model equation of state and primordial black holes Xavier Pritchard, Matthew Starbuck, Wingfung Leung 27 pages plus appendices. 12 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) The Standard Model of particle physics successfully describes all known fundamental particles and their interactions; however, it leaves several unanswered questions. Theories beyond the Standard Model typically introduce new particles and symmetries to address these issues. In the early universe, when such particles become non-relativistic, or the symmetries are broken, there are associated reductions in the equation of state of the primordial plasma. These reductions lead to an exponential enhancement in the formation rate of primordial black holes. In this paper, we calculate the equation of state for several supersymmetric and composite Higgs models, which naturally predict a large number of additional degrees of freedom. Using these equations of state, we compute some example primordial black hole abundances, which we find can be enhanced by up to 20 orders of magnitude.",
      "pdf_url": "https://arxiv.org/pdf/2510.19629.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19647",
      "title": "The Impact of Population III.1 Flash Reionization for CMB Polarization and Thomson Scattering Optical Depth",
      "authors": [
        "Jonathan C. Tan",
        "Eiichiro Komatsu"
      ],
      "abstract": "The Impact of Population III.1 Flash Reionization for CMB Polarization and Thomson Scattering Optical Depth Jonathan C. Tan, Eiichiro Komatsu Submitted to PRL, comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Population III.1 theory for supermassive black hole (SMBH) formation predicts a very early ($z\\sim20-25$), transient phase, ``The Flash'', of cosmic reionization powered by supermassive stars that are SMBH progenitors. The universe then quickly recombined to become mostly neutral, with this state persisting until galaxies begin to reionize intergalactic gas again at $z\\sim 10$. The overall Thomson scattering optical depth, $\\tau$, from The Flash has been shown to be $\\tau_{\\rm PopIII.1}\\sim0.03$, leading to a total $\\tau\\sim0.08-0.09$. Such a value, while significantly larger than that previously inferred from {\\it Planck} observations of the low-$l$ $EE$ polarization power spectrum of the CMB, can help relieve several ``tensions'' faced by the standard $\\Lambda$CDM cosmological model, especially the preference for negative neutrino masses and dynamic dark energy. Here we compute $EE$ power spectra of example models of The Flash. We find that, because of its very high redshift, the contribution to $l\\lesssim8$ modes is dramatically reduced compared to usual low-$z$ reionization models for the same value of $\\tau$, while the power at $l\\gtrsim8$ is boosted. Thus the Pop III.1 reionization scenario provides a natural way to increase $\\tau$, while remaining closer to the latest CMB low-$l$ polarization observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.19647.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19798",
      "title": "Detecting gravitational lensing by matter currents",
      "authors": [
        "C. Murray",
        "R. Kou",
        "J. G. Bartlett"
      ],
      "abstract": "Detecting gravitational lensing by matter currents C. Murray, R. Kou, J. G. Bartlett Cosmology and Nongalactic Astrophysics (astro-ph.CO) We explore the observational prospects for detecting gravitational lensing induced by cosmological matter currents, a relativistic correction to the standard scalar lensing effect arising from the motion of matter. We propose to isolate this contribution by cross-correlating the weak-lensing convergence field with a reconstructed cosmic momentum field inferred from galaxy surveys. Using numerical simulations, we demonstrate that this reconstructed momentum field is uncorrelated with the scalar lensing signal, enabling a clean separation of the gravitomagnetic component. We then forecast the detectability of this signal for upcoming wide-field galaxy and weak-lensing surveys, showing that a statistically significant detection may be achievable under realistic observational conditions. Such a measurement would provide the first direct probe of the large-scale cosmic momentum field, offering a novel test of general relativity and Lorentz invariance on cosmological scales.",
      "pdf_url": "https://arxiv.org/pdf/2510.19798.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19803",
      "title": "The richest clusters in the Coma and Leo superclusters: Properties and evolution",
      "authors": [
        "Maret Einasto",
        "Peeter Tenjes",
        "Rain Kipper",
        "Pekka Heinämäki",
        "Elmo Tempel",
        "Lauri Juhan Liivamägi",
        "Michael J. West",
        "Boris Deshev",
        "Jaan Einasto"
      ],
      "abstract": "The richest clusters in the Coma and Leo superclusters: Properties and evolution Maret Einasto, Peeter Tenjes, Rain Kipper, Pekka Heinämäki, Elmo Tempel, Lauri Juhan Liivamägi, Michael J. West, Boris Deshev, Jaan Einasto 19 pages, 12 figures, A&A, accepted Cosmology and Nongalactic Astrophysics (astro-ph.CO) We study the substructure, connectivity, and galaxy content of galaxy clusters A1656 and 1367 in the Coma supercluster and of A1185 in the Leo supercluster with the aim of understanding the evolution of clusters from turnaround to virialisation. We used data from the SDSS DR10 MAIN galaxy sample and from DESI cluster catalogues. The projected phase space diagram and the distribution of mass were used to identify regions of various infall stages (early and late infall, and regions of ongoing infall, i.e. regions of influence), their characteristic radii, embedded mass, and density contrasts in order to study the evolution of clusters with the spherical collapse model. We determined the substructure of clusters using normal mixture modelling and their connectivity by counting filaments in the cluster's regions of influence, analysed galaxy content of clusters, and derived scaling relations between cluster masses. All three clusters have a substructure with two to five components and up to six filaments connected to them. The radii of regions of influence are $R_\\mathrm{inf} \\approx 4$ Mpc, and the density contrast at their borders is $\\Delta\\rho_{inf} \\approx 50 - 60$. The scaling relations between the masses of clusters have a very small scatter. The galaxy content of the clusters and of their regions of influence vary from cluster to cluster. In superclusters the percentage of quiescent galaxies is higher than in low-density regions between superclusters. The collapse of the regions of influence of clusters started at redshifts $z \\approx 0.4 - 0.5$. Clusters will be virialised in $\\approx 3.3$ Gyrs. Clusters in superclusters will not merge, and their present-day turnaround regions will be virialised in $\\approx 10$ Gyrs. The large variety of properties of clusters suggests that they have followed different paths during evolution.",
      "pdf_url": "https://arxiv.org/pdf/2510.19803.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18920",
      "title": "Very High Precision Astrometry for Exoplanets and Dark Matter with the Habitable Worlds Observatory",
      "authors": [
        "Fabien Malbet",
        "J. Amiaux",
        "F. Ardellier-Desages",
        "E. Doumayrou",
        "P.-A. Frugier",
        "R. Goullioud",
        "T. Greene",
        "L. Labadie",
        "P.-O. Lagage",
        "M. Lizzana",
        "A. Léger",
        "T. Lépine",
        "G. Mamon",
        "J. Martignac",
        "F. Pancher",
        "T. Pichon",
        "A. Roberge",
        "S. Ronayette",
        "H. Rousset",
        "S. Soler",
        "A. Sozzetti",
        "T. Tourette"
      ],
      "abstract": "Very High Precision Astrometry for Exoplanets and Dark Matter with the Habitable Worlds Observatory Fabien Malbet (IPAG), J. Amiaux (DAP), F. Ardellier-Desages (DAP), E. Doumayrou (DAP), P.-A. Frugier (DAP), R. Goullioud (JPL), T. Greene (IPAC), L. Labadie, P.-O. Lagage (DAP), M. Lizzana (IPAG, CNES), A. Léger (IAS), T. Lépine (IOGS, LabHC), G. Mamon (IAP), J. Martignac (DAP), F. Pancher (IPAG), T. Pichon (DAP), A. Roberge, S. Ronayette (DAP), H. Rousset, S. Soler (IPAG), A. Sozzetti (OATo), T. Tourette (DAP) Towards the Habitable Worlds Observatory: Visionary Science and Transformational Technology, Lee, Janice, Jul 2025, Washington DC, United States Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Astrometry, one of the oldest branches of astronomy, has been revolutionized by missions like Hipparcos and especially Gaia, which mapped billions of stars with extraordinary precision. However, challenges such as detecting Earth-like exoplanets in nearby habitable zones and probing the influence of dark matter in galactic environments require sub-microarcsecond accuracy. With a 6--8 meter large-aperture telescope operating across at visible wavelengths, the Habitable Worlds Observatory by NASA can combine astrometry and direct imaging to detect rocky exoplanets within 10 parsecs and study their atmospheres. We consider here the scientific requirements and present a concept for a dedicated astrometric instrument on HWO. It is capable to produce diffraction-limited images of large fields, achieving a point-spread function (PSF) precision of 20 milliarcseconds. Equipped with a detector calibration system, HWO can perform high precision astrometry, and, detect and measure the orbit of Earth-mass planets in the habitable zone of Nearby Solar-type stars. HWO can dramatically improve current constraints on the self- interaction cross-section of heavy dark matter particles (WIMPs) and on the masses of ultra-high dark matter particles, through the study of stellar motions in galactic environments. The visible channel of the instrument features a large CMOS-based focal plane with stitched pixel arrays, enabling a large field of view. The ``Detector Calibration Unit'' system uses interferometric laser fringes to calibrate pixel positions. Using differential astrometry and pointed observations with a stable telescope design enables extended integration times, enhancing sensitivity to sub-microarcsecond precision for detecting exoplanets and studying dark matter through stellar motion.",
      "pdf_url": "https://arxiv.org/pdf/2510.18920.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18946",
      "title": "The THESAN project: Lyman-alpha emitters as probes of ionized bubble sizes",
      "authors": [
        "Meredith Neyer , Aaron Smith , Mark Vogelsberger , Luz Ángela García , Rahul Kannan , Enrico Garaldi , Laura Keating MIT, UT Dallas, ECCI, York, IPMU, Edinburgh)"
      ],
      "abstract": "The THESAN project: Lyman-alpha emitters as probes of ionized bubble sizes Meredith Neyer (1), Aaron Smith (2), Mark Vogelsberger (1), Luz Ángela García (3), Rahul Kannan (4), Enrico Garaldi (5), Laura Keating (6) ((1) MIT, (2) UT Dallas, (3) ECCI, (4) York, (5) IPMU, (6) Edinburgh) 17 pages, 17 figures. Comments welcome Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We use the THESAN radiation-hydrodynamics simulations to investigate how Lyman-$\\alpha$ emitters (LAEs) trace ionized bubble sizes during the Epoch of Reionization. We generate realistic LAE catalogs by combining accurate intrinsic Ly$\\alpha$ production and intergalactic transmission with an empirical model for dust absorption and gas outflows. By calibrating to observationally-constrained Ly$\\alpha$ luminosity functions, we reproduce the rapid decline in Ly$\\alpha$ visibility toward higher redshifts while revealing mild tensions in LAE fractions near the end of reionization. Before the midpoint of reionization, galaxies within larger line-of-sight bubbles ($\\gtrsim 10$ cMpc) have higher observed Ly$\\alpha$ luminosity and equivalent width (EW), demonstrating that the evolving LAE fraction provides a practical statistical tracer for bubble size. These correlations weaken as percolation progresses and the IGM becomes increasingly ionized. In LAE selected samples with $L_{\\text{Ly}\\alpha} > 10^{41.5}\\ \\text{erg s}^{-1}$, Ly$\\alpha$ properties correlate with bubble size more strongly than UV magnitude, especially at $z \\gtrsim 7$. This simulation-based framework maps LAE selections to bubble-size statistics, clarifies biases in more idealized models, and will supply public catalogs to interpret current and forthcoming JWST and narrow-band LAE surveys in terms of the evolving topology of reionization.",
      "pdf_url": "https://arxiv.org/pdf/2510.18946.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19822",
      "title": "Supermassive Black Hole Growth in Massive Galaxies at Cosmic Dawn",
      "authors": [
        "James Sunseri",
        "Zachary L. Andalman",
        "Romain Teyssier"
      ],
      "abstract": "Supermassive Black Hole Growth in Massive Galaxies at Cosmic Dawn James Sunseri, Zachary L. Andalman, Romain Teyssier Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Among the emerging excess of massive, bright galaxies at Cosmic Dawn $z \\gtrsim 9$ seen by the James Webb Space Telescope, several exhibit spectral features associated with active galactic nuclei (AGN). These AGN candidates suggest that supermassive black holes (SMBHs) grow rapidly in the early Universe. In a series of numerical experiments, we investigate how SMBHs grow within and influence the most massive galaxies at Cosmic Dawn using cosmological hydrodynamic zoom-in simulations run with the adaptive mesh refinement code RAMSES. Our suite of simulations explore how super-Eddington accretion, seed mass, and the strength of feedback influence SMBH-galaxy co-evolution in the early Universe. We find that SMBH growth is sensitive to stellar feedback which generates a turbulent-multiphase interstellar medium (ISM) that stochastically starves the SMBH. In the absence of AGN feedback, we find that the SMBH is starved $\\sim 50\\%$ of the time after the onset of star formation in the galaxy. SMBH growth can become self-regulated by AGN feedback if the SMBH becomes massive enough, either by accretion or seeding, for its feedback to dominate the surrounding nuclear region. We find no evidence of galaxy-scale, AGN-driven quenching in the star formation rate (SFR) across all simulations in our suite.",
      "pdf_url": "https://arxiv.org/pdf/2510.19822.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.24039",
      "title": "TOPz: Photometric redshifts using template fitting applied to the GAMA survey",
      "authors": [
        "E. Tempel",
        "J. Laur",
        "Z. R. Jones",
        "R. Kipper",
        "L. J. Liivamägi",
        "D. Pandey",
        "G. Sakteos",
        "A. Tamm",
        "A. N. Triantafyllaki",
        "T. Tuvikene"
      ],
      "abstract": "TOPz: Photometric redshifts using template fitting applied to the GAMA survey E. Tempel, J. Laur, Z. R. Jones, R. Kipper, L. J. Liivamägi, D. Pandey, G. Sakteos, A. Tamm, A. N. Triantafyllaki, T. Tuvikene 24 pages, 30 figures, accepted for publication in A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Context. Accurate photometric redshift estimation is crucial for cosmological and galaxy evolution studies, especially with the advent of large-scale photometric surveys. Aims. We developed a photo-z estimation code called TOPz (Tartu Observatory Photo-z) and applied it to the GAMA photometric catalogue. Using nine-band photometric data from the GAMA project, we assessed the accuracy of TOPz by comparing its photo-z estimates to available spectroscopic redshifts from GAMA and DESI. The latter extends to z < 2 and m_Z < 24, allowing the photo-z accuracy to be validated beyond the GAMA limits. Methods. TOPz employs a Bayesian template-fitting approach to estimate photo-z from marginalised redshift posteriors. We generated synthetic galaxy spectra using the CIGALE software and ran template set optimisation. We improved the photometry by applying flux and flux uncertainty corrections. An analytical prior was then imposed on the resulting posteriors to refine the redshift estimates. Results. The photo-z estimates produced by TOPz show good agreement with the spectroscopic redshifts in the low-redshift regime (z < 0.5). We demonstrate the redshift accuracy across various magnitude bins and tested how the flux corrections and posteriors reflect the actual uncertainty of the estimates. For the GAMA sample, the sigma_NMAD = 0.012 for m_Z <18 and increases to sigma_NMAD = 0.021 for m_Z >19. The outlier fraction (|dz|/(1 + z)>0.1) in the same magnitude bins increases from 1% to 5%. We show that the TOPz results are consistent with those obtained from other photo-z codes (EAZY and SFM) applied to the same data set. Conclusions. TOPz is an advanced photo-z estimation code that integrates flux corrections, physical priors, and template set optimisation to provide state-of-the-art photo-z among competing template-based redshift estimators.",
      "pdf_url": "https://arxiv.org/pdf/2503.24039.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.06648",
      "title": "Primordial black holes with mass ratio-modulated initial clustering: merger suppression and projected constraints",
      "authors": [
        "Gabriel Luis Dizon"
      ],
      "abstract": "Primordial black holes with mass ratio-modulated initial clustering: merger suppression and projected constraints Gabriel Luis Dizon (National Institute of Physics, University of the Philippines - Diliman) Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a modification of the expected local primordial black hole (PBH) count $N(y)$, typically seen in the context of the early PBH binary merger rate as a term in the merger rate suppression. We utilize recent results in small-scale PBH clustering to formulate $N(y)$ in such a way that accounts for variations in the binary mass ratio $q$. We then examine how this change affects the projected constraints on PBH abundance from simulated Einstein Telescope (ET) and LISA mergers. Our results indicate that for broadly extended mass distributions, the merger suppression is greatly reduced for binaries with $q \\gg 1$. This leads to an enhanced merger rate for binary distributions favoring a lighter average mass. This change is best reflected by an extension of the low mass end of the constraint windows derived from the resolvable merger channel, although this result is present as well in the stochastic gravitational wave background (SGWB) constraints. Our results imply that the assumption of PBH clustering is testable at abundances and mass ranges much lower than anticipated, although more work must be done to explore how high mass ratio PBH binaries actually evolve.",
      "pdf_url": "https://arxiv.org/pdf/2506.06648.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.16889",
      "title": "The Effects of Linear Matter Power Spectrum Enhancement on Dark Matter Substructure",
      "authors": [
        "Ethan O. Nadler",
        "Vera Gluscevic",
        "Andrew Benson"
      ],
      "abstract": "The Effects of Linear Matter Power Spectrum Enhancement on Dark Matter Substructure Ethan O. Nadler, Vera Gluscevic, Andrew Benson 11 pages, 9 figures; updated to published version. Data is available at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present cosmological dark matter (DM)--only zoom-in simulations of a Milky Way analog originating from enhanced linear matter power spectra $P(k)$ relative to the standard cold, collisionless DM (CDM) cosmology. We consider a Gaussian power excess in $P(k)$ followed by a cutoff in select cases; this behavior could arise from early-Universe physics that alters the primordial matter power spectrum or DM physics in the radiation-dominated epoch. We find that enhanced initial conditions (ICs) lead to qualitative differences in substructure relative to CDM. In particular, the subhalo mass function (SHMF) resulting from ICs with both an enhancement and cutoff is amplified at high masses and suppressed at low masses, indicating that DM substructure is sensitive to features in $P(k)$. Critically, the amplitude and shape of the SHMF enhancement depend on the wavenumber of the $P(k)$ excess and the presence or absence of a cutoff on smaller scales. These alterations to the SHMF are mainly imprinted at infall rather than during tidal evolution. Additionally, subhalos are found systematically closer to the host center, and their concentrations are increased in scenarios with $P(k)$ enhancement. Our work thus reveals effects that must be captured to enable $P(k)$ reconstruction using DM substructure.",
      "pdf_url": "https://arxiv.org/pdf/2507.16889.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.02225",
      "title": "New Radio Data on Sources of the Big Trio Program for Searching for Distant Radio Galaxies",
      "authors": [
        "Olga Zhelenkova",
        "Adelina Temirova",
        "Yurij Parijskij",
        "Natalia Soboleva"
      ],
      "abstract": "New Radio Data on Sources of the Big Trio Program for Searching for Distant Radio Galaxies Olga Zhelenkova, Adelina Temirova, Yurij Parijskij, Natalia Soboleva 15 pages, 6 figures, 2 tables; to be published in Proceedings of the conference \"Modern Observational Cosmology 2025\" Cosmology and Nongalactic Astrophysics (astro-ph.CO) Radio sources with steep and ultra-steep spectra, identified through a series of surveys of the Cold experiment using the RATAN-600 radio telescope, formed the basis of the Big Trio program aimed at discovering distant radio galaxies. With the advent of new radio, optical, and infrared sky surveys, it became possible to carry out additional studies of the 113 radio sources observed within this program using the 6-meter BTA telescope. Morphological features indicative of the evolutionary state of radio sources revealed that 9 objects exhibit signs of restarted activity, 12 can be classified as young, and 2 as dying. Based on their WAT/NAT and WRS morphologies, 24 sources are likely located within galaxy groups or clusters, or show evidence of jet reorientation. Additionally, four objects in the sample represent pairs of radio sources whose host galaxies are separated by only a few tens of kiloparsecs. Continuum spectra were constructed, and variability indices were calculated. A high proportion of sources with a variability index ($V>3$) is attributed to significant differences in angular resolution between the TXS and VCSS surveys, as well as to underestimated flux densities for certain double-lobed sources. A comparison of spectral indices derived from older and newer data indicates a decrease in the number of steep-spectrum sources in the sample. This reduction is most likely due to improved characterization of the low-frequency portion of the continuum spectra following the incorporation of GLEAM data. However, for some radio sources, the observed spectral changes may reflect internal evolution, that observed in a shift of the spectral peak or a roll-off in the radio spectrum towards lower frequencies, as evidenced by flux density measurements from various catalogues covering a period of up to forty years.",
      "pdf_url": "https://arxiv.org/pdf/2508.02225.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.20904",
      "title": "Clustering of DESI galaxies split by thermal Sunyaev-Zeldovich effect",
      "authors": [
        "M. Rashkovetskyi",
        "D. J. Eisenstein",
        "J. Aguilar",
        "S. Ahlen",
        "A. Anand",
        "D. Bianchi",
        "D. Brooks",
        "F. J. Castander",
        "T. Claybaugh",
        "A. Cuceu",
        "K. S. Dawson",
        "A. de la Macorra",
        "Arjun Dey",
        "P. Doel",
        "S. Ferraro",
        "A. Font-Ribera",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "G. Gutierrez",
        "H. K. Herrera-Alcantar",
        "K. Honscheid",
        "C. Howlett",
        "M. Ishak",
        "R. Joyce",
        "R. Kehoe",
        "T. Kisner",
        "A. Kremin",
        "O. Lahav",
        "A. Lambert",
        "M. Landriau",
        "M. Manera",
        "R. Miquel",
        "E. Mueller",
        "S. Nadathur",
        "N. Palanque-Delabrouille",
        "W. J. Percival",
        "F. Prada",
        "I. Pérez-Ràfols",
        "A. J. Ross",
        "G. Rossi",
        "E. Sanchez",
        "D. Schlegel",
        "M. Schubnell",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarlé",
        "B. A. Weaver",
        "R. Zhou",
        "H. Zou"
      ],
      "abstract": "Clustering of DESI galaxies split by thermal Sunyaev-Zeldovich effect M. Rashkovetskyi, D. J. Eisenstein, J. Aguilar, S. Ahlen, A. Anand, D. Bianchi, D. Brooks, F. J. Castander, T. Claybaugh, A. Cuceu, K. S. Dawson, A. de la Macorra, Arjun Dey, P. Doel, S. Ferraro, A. Font-Ribera, J. E. Forero-Romero, E. Gaztañaga, G. Gutierrez, H. K. Herrera-Alcantar, K. Honscheid, C. Howlett, M. Ishak, R. Joyce, R. Kehoe, T. Kisner, A. Kremin, O. Lahav, A. Lambert, M. Landriau, M. Manera, R. Miquel, E. Mueller, S. Nadathur, N. Palanque-Delabrouille, W. J. Percival, F. Prada, I. Pérez-Ràfols, A. J. Ross, G. Rossi, E. Sanchez, D. Schlegel, M. Schubnell, J. Silber, D. Sprayberry, G. Tarlé, B. A. Weaver, R. Zhou, H. Zou Published in the Open Journal of Astrophysics. 15 pages, 12 figures. The data (including all the points from the plots) and source code are available at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) The thermal Sunyaev-Zeldovich (tSZ) effect is associated with galaxy clusters - extremely large and dense structures tracing the dark matter with a higher bias than isolated galaxies. We propose to use the tSZ data to separate galaxies from redshift surveys into distinct subpopulations corresponding to different densities and biases independently of the redshift survey systematics. Leveraging the information from different environments, as in density-split and density-marked clustering, is known to tighten the constraints on cosmological parameters, like $\\Omega_m$, $\\sigma_8$ and neutrino mass. We use data from the Dark Energy Spectroscopic Instrument (DESI) and the Atacama Cosmology Telescope (ACT) in their region of overlap to demonstrate informative tSZ splitting of Luminous Red Galaxies (LRGs). We discover a significant increase in the large-scale clustering of DESI LRGs corresponding to detections starting from 1-2 sigma in the ACT DR6 + Planck tSZ Compton-$y$ map, below the cluster candidate threshold (4 sigma). We also find that such galaxies have higher line-of-sight coordinate (and velocity) dispersions and a higher number of close neighbors than both the full sample and near-zero tSZ regions. We produce simple simulations of tSZ maps that are intrinsically consistent with galaxy catalogs and do not include systematic effects, and find a similar pattern of large-scale clustering enhancement with tSZ effect significance. Moreover, we observe that this relative bias pattern remains largely unchanged with variations in the galaxy-halo connection model in our simulations. This is promising for future cosmological inference from tSZ-split clustering with semi-analytical models. Thus, we demonstrate that valuable cosmological information is present in the lower signal-to-noise regions of the thermal Sunyaev-Zeldovich map, extending far beyond the individual cluster candidates.",
      "pdf_url": "https://arxiv.org/pdf/2508.20904.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.21275",
      "title": "One-Loop Nonlinear Matter Power Spectrum from Unified Lagrangian Perturbation Theory: Fast Computation and Comparison with Emulators",
      "authors": [
        "Naonori Sugiyama"
      ],
      "abstract": "One-Loop Nonlinear Matter Power Spectrum from Unified Lagrangian Perturbation Theory: Fast Computation and Comparison with Emulators Naonori Sugiyama Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a fast and accurate formulation for computing the nonlinear matter power spectrum at one-loop order based on Unified Lagrangian Perturbation Theory (ULPT). ULPT decomposes the density field into the Jacobian deviation, capturing intrinsic nonlinear growth, and the displacement-mapping factor, accounting for large-scale distortions due to bulk flows. This structural separation leads to a natural division of the power spectrum into a source term and a displacement-mapping factor, ensuring infrared (IR) safety by construction. We implement an efficient numerical algorithm using FFTLog and FAST-PT, achieving approximately 2-second evaluations on a standard laptop. The results are validated against simulation-based emulators, including the Dark Emulator and Euclid Emulator 2. Across 100 sampled cosmologies, ULPT agrees with emulator predictions at the 2--3\\% level up to \\( k \\simeq 0.4\\,h\\,\\mathrm{Mpc}^{-1} \\) for \\( z \\geq 0.5 \\), without any nuisance parameters. Similar agreement is found in configuration space, where the two-point correlation function remains accurate down to \\( r \\simeq 10\\,h^{-1}\\mathrm{Mpc} \\). Compared to standard perturbation theory, which fails at small scales due to series expansion of the displacement factor, ULPT maintains convergence by preserving its full exponential form. We also clarify the mechanism of BAO damping: exponential suppression by displacement and peak sharpening by nonlinear growth. The combination accurately reproduces BAO features seen in simulations. ULPT thus offers a robust, IR-safe, and computationally efficient framework for modeling large-scale structure in galaxy surveys. The numerical implementation developed in this work is publicly released as the open-source Python package \\texttt{ulptkit} (this https URL).",
      "pdf_url": "https://arxiv.org/pdf/2508.21275.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.04142",
      "title": "Renormalization-Free Galaxy Bias in Unified Lagrangian Perturbation Theory",
      "authors": [
        "Naonori Sugiyama"
      ],
      "abstract": "Renormalization-Free Galaxy Bias in Unified Lagrangian Perturbation Theory Naonori Sugiyama Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a renormalization-free framework for modeling galaxy bias based on Unified Lagrangian Perturbation Theory (ULPT). In this approach, the biased density fluctuation is built solely from Galileon-type operators associated with the intrinsic nonlinear growth of dark matter. This ensures the bias expansion is well defined at the field level, automatically satisfies statistical conditions of vanishing ensemble and volume averages, and removes the need for ad hoc renormalization. We derive analytic one-loop expressions for the galaxy-galaxy and galaxy-matter power spectra and implement an efficient numerical algorithm using \\texttt{FFTLog} and \\texttt{FAST-PT}, enabling rapid and accurate evaluation. The model requires only a minimal set of bias parameters: three parameters are sufficient to describe correlation functions in configuration space, while four parameters are needed for power spectra in Fourier space. To test accuracy, we jointly fit halo auto- and cross-spectra from the \\textit{Dark Emulator}, covering nine redshift-mass combinations with 100 cosmologies each. A single set of bias parameters reproduces both spectra within $\\sim1\\%$ up to $k \\simeq 0.3\\,h\\,\\mathrm{Mpc}^{-1}$ for typical linear bias $b_1 \\sim 0.8$-2, and to $k \\simeq 0.2\\,h\\,\\mathrm{Mpc}^{-1}$ for $b_1 \\sim 3$. The same parameters also match two-point correlation functions down to $r \\simeq 15\\,h^{-1}\\mathrm{Mpc}$. Moreover, ULPT predicts the relation $b_{K^2}^{\\mathrm{E}} = -\\tfrac{3}{4} b_2^{\\mathrm{E}}$, validated against $N$-body results. These results demonstrate that ULPT provides a physically consistent and efficient model for nonlinear galaxy bias, with applications to redshift-space distortions, bispectra, and reconstruction. The numerical implementation is released as the open-source Python package this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2509.04142.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2407.16339",
      "title": "A smooth filament origin for distant prolate galaxies seen by JWST and HST",
      "authors": [
        "Alvaro Pozo",
        "Tom Broadhurst",
        "Razieh Emami",
        "Philip Mocz",
        "Mark Vogelsberger",
        "Lars Hernquist",
        "Christopher J. Conselice",
        "Hoang Nhan Luu",
        "George F. Smoot",
        "Rogier Windhorst"
      ],
      "abstract": "A smooth filament origin for distant prolate galaxies seen by JWST and HST Alvaro Pozo, Tom Broadhurst, Razieh Emami, Philip Mocz, Mark Vogelsberger, Lars Hernquist, Christopher J. Conselice, Hoang Nhan Luu, George F. Smoot, Rogier Windhorst Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The initial gravitational collapse of Dark Matter and gas forms a universal filamentary network where the first galaxies form, with shapes and sizes that depend on the choice of Dark Matter. Claims from deep space imaging surveys that elongated galaxies predominate at $z > 3$ are examined here by comparison with detailed hydrodynamical simulations of Cold Dark Matter (CDM), Warm Dark Matter (WDM), and Wave/Fuzzy Dark Matter, $\\psi$DM. For CDM and WDM we have sufficient volume, $10^{3}\\,\\mathrm{Mpc/h}^{3}$, to generate galaxies with stellar masses $> 10^{9}\\,M_{\\odot}$ at $z > 2$, allowing comparison with the CEERS and CANDELS surveys. We find the observed tendency towards elongated, prolate-shaped young galaxies is well matched by WDM, from material accreted along smooth filaments during the first $\\simeq 500\\,\\mathrm{Myr}$, with little dependence on stellar mass. This contrasts with CDM, where the stellar morphology is mainly spheroidal, formed from merging of fragmented filaments. For CDM, several subhalos are predicted to be visible, whereas for WDM and $\\psi$DM, early merging is rare. Our findings show how the shapes and sizes of early galaxies are sensitive to the smoothness of the underlying filament network, providing a new constraint on the nature of dark matter.",
      "pdf_url": "https://arxiv.org/pdf/2407.16339.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19010",
      "title": "Constraints on Axion-Like Particles from VERITAS Observations of a Flaring Radio Galaxy in the Perseus Cluster",
      "authors": [
        "C. B. Adams",
        "A. Archer",
        "P. Bangale",
        "J. T. Bartkoske",
        "W. Benbow",
        "Y. Chen",
        "J. L. Christiansen",
        "A. J. Chromey",
        "A. Duerr",
        "M. Errando",
        "M. Escobar Godoy",
        "J. Escudero Pedrosa",
        "S. Feldman",
        "Q. Feng",
        "S. Filbert",
        "L. Fortson",
        "A. Furniss",
        "W. Hanlon",
        "O. Hervet",
        "C. E. Hinrichs",
        "J. Holder",
        "Z. Hughes",
        "T. B. Humensky",
        "M. Iskakova",
        "W. Jin",
        "P. Kaaret",
        "M. Kertzman",
        "M. Kherlakian",
        "D. Kieda",
        "T. K. Kleiner",
        "N. Korzoun",
        "F. Krennrich",
        "S. Kumar",
        "S. Kundu",
        "M. J. Lang",
        "M. Lundy",
        "P. Moriarty",
        "R. Mukherjee",
        "W. Ning",
        "R. A. Ong",
        "A. Pandey",
        "M. Pohl",
        "E. Pueschel",
        "J. Quinn",
        "P. L. Rabinowitz",
        "K. Ragan",
        "P. T. Reynolds",
        "D. Ribeiro",
        "E. Roache",
        "C. Rulten",
        "I. Sadeh",
        "L. Saha",
        "M. Santander",
        "G. H. Sembroski",
        "R. Shang",
        "D. Tak",
        "A. K. Talluri",
        "J. V. Tucci",
        "J. Valverde",
        "V. V. Vassiliev",
        "D. A. Williams",
        "S. L. Wong",
        "J. Woo",
        "T. Yoshikoshi",
        "M. Meyer"
      ],
      "abstract": "Constraints on Axion-Like Particles from VERITAS Observations of a Flaring Radio Galaxy in the Perseus Cluster C. B. Adams, A. Archer, P. Bangale, J. T. Bartkoske, W. Benbow, Y. Chen, J. L. Christiansen, A. J. Chromey, A. Duerr, M. Errando, M. Escobar Godoy, J. Escudero Pedrosa, S. Feldman, Q. Feng, S. Filbert, L. Fortson, A. Furniss, W. Hanlon, O. Hervet, C. E. Hinrichs, J. Holder, Z. Hughes, T. B. Humensky, M. Iskakova, W. Jin, P. Kaaret, M. Kertzman, M. Kherlakian, D. Kieda, T. K. Kleiner, N. Korzoun, F. Krennrich, S. Kumar, S. Kundu, M. J. Lang, M. Lundy, P. Moriarty, R. Mukherjee, W. Ning, R. A. Ong, A. Pandey, M. Pohl, E. Pueschel, J. Quinn, P. L. Rabinowitz, K. Ragan, P. T. Reynolds, D. Ribeiro, E. Roache, C. Rulten, I. Sadeh, L. Saha, M. Santander, G. H. Sembroski, R. Shang, D. Tak, A. K. Talluri, J. V. Tucci, J. Valverde, V. V. Vassiliev, D. A. Williams, S. L. Wong, J. Woo, T. Yoshikoshi (The VERITAS Collaboration), M. Meyer 18 pages, 6 figures, accepted for publication in the Physical Review D (PRD) High Energy Astrophysical Phenomena (astro-ph.HE) Background: Axion-like particles (ALPs) are hypothetical particles that emerge in numerous theoretical extensions to the Standard Model. Their coupling to electromagnetic field implies that ALPs would mix with photons in the presence of external magnetic fields. As ALP phenomenology is governed by the mass and strength of its coupling, there is a subset of this parameter space in which this mixing would be expected to leave an imprint on the spectra of TeV gamma-ray sources. Data: In 2017, the VERITAS gamma-ray observatory recorded the second day of a dramatic flare of the radio galaxy NGC 1275, embedded at the center of the Perseus galaxy cluster. This serendipitous locale provides a spatially-extended magnetic field of strength O(10$\\mu$G) through which escaping photons traverse, making it an excellent target to study ALPs. Methods: We analyze the VERITAS data of NGC 1275's 2017 flare with the gammapy analysis package. Extensive fitting and modeling are performed to ultimately conduct a likelihood analysis used to search for any evidence of a preference for ALPs and to explore the confidence with which constraints can be set. We adopt the CLs method for this study for its conservative approach to setting limits in regimes where the search has limited sensitivity. Results: No evidence for the existence of ALPs is found, and no combination of mass and coupling strength can be excluded at or above 95% confidence level. We provide a map showing the strength of our exclusions in the mass and coupling parameter space. The strongest exclusions are found in the mass range $2 \\times 10^{-7}$eV $\\lesssim m_a \\lesssim 4 \\times 10^{-7}$eV and at the coupling strength of $g_{a\\gamma} \\gtrsim 3 \\times 10^{-11}$ GeV$^{-1}$ up to 80% confidence level, which are consistent with previous studies. Conclusions: We find the CLs method to be a trustworthy approach, and advocate for its...",
      "pdf_url": "https://arxiv.org/pdf/2510.19010.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19102",
      "title": "X-ray Observations of Nova Scorpii 2023 (V1716 Sco) in Outburst",
      "authors": [
        "John Worley",
        "Marina Orio",
        "Andrej Dobrotka",
        "Jozef Magdolen",
        "Kim Page",
        "Ehud Behar",
        "Jeremy Drake",
        "Sharon Mitrani"
      ],
      "abstract": "X-ray Observations of Nova Scorpii 2023 (V1716 Sco) in Outburst John Worley, Marina Orio, Andrej Dobrotka, Jozef Magdolen, Kim Page, Ehud Behar, Jeremy Drake, Sharon Mitrani 21 pages including bibliography, 9 figures High Energy Astrophysical Phenomena (astro-ph.HE) Nova Scorpii 2023 was first detected as a luminous supersoft X-ray source (SSS) 93 days after outburst and continued emitting soft X-rays for over two months, until it was too close to the Sun to observe. The nova was monitored with the Swift X-ray Telescope (XRT) and the Neutron Star Interior Composition Explorer (NICER) on the International Space Station, and in long exposures with the Chandra High Resolution Camera (HRC) and Low Energy Transmission Grating (LETG) on days 128, 129, and 183-185 after optical maximum. Swift detected a rapidly decaying SSS when observations resumed, constraining the constant bolometric luminosity phase to 9 months. The SSS flux was irregularly variable. A nearly three-fold increase in flux was observed between August and October 2023 in the 15 to 35 Angstrom range, from 3.5 x 10^(-11) to 9.4 x 10^(-11) erg cm^(-2) s^(-1). The SSS duration and effective temperature derived from the October LETG spectra indicate a massive white dwarf with temperature fitting nova evolutionary tracks for a 1.2 solar mass WD; emission lines superimposed on the WD continuum are attributed to surrounding shocked ejecta. We present a timing study based on Chandra and archival NICER data. The irregular variability timescale was days, but a 77.9 second periodic modulation in the SSS flux with varying amplitude was measured in many observations. Our analysis shows that this period was stable; short drifts derived with NICER, but not in long, uninterrupted Chandra exposures, are artifacts of measuring variable amplitude modulation. We suggest the modulations are associated with the WD rotation.",
      "pdf_url": "https://arxiv.org/pdf/2510.19102.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19132",
      "title": "Evidence of Energy Injection in the Short and Distant GRB 250221A",
      "authors": [
        "Camila Angulo-Valdez",
        "Rosa L. Becerra",
        "Ramandeep Gill",
        "Noémie Globus",
        "William H. Lee",
        "Diego López-Cámara",
        "Cassidy Mihalenko",
        "Enrique Moreno-Méndez",
        "Roberto Ricci",
        "Karelle Siellez",
        "Alan M. Watson",
        "Muskan Yadav",
        "Yu-han Yang",
        "Dalya Akl",
        "Sarah Antier",
        "Jean-Luc Atteia",
        "Stéphane Basa",
        "Nathaniel R. Butler",
        "Simone Dichiara",
        "Damien Dornic",
        "Jean-Grégoire Ducoin",
        "Francis Fortin",
        "Leonardo García-García",
        "Kin Ocelotl López",
        "Francesco Magnani",
        "Brenda O'Connor",
        "Margarita Pereyra",
        "Ny Avo Rakotondrainibe",
        "Fredd Sánchez-Álvarez",
        "Benjamin Schneider",
        "Eleonora Troja",
        "Antonio de Ugarte Postigo"
      ],
      "abstract": "Evidence of Energy Injection in the Short and Distant GRB 250221A Camila Angulo-Valdez, Rosa L. Becerra, Ramandeep Gill, Noémie Globus, William H. Lee, Diego López-Cámara, Cassidy Mihalenko, Enrique Moreno-Méndez, Roberto Ricci, Karelle Siellez, Alan M. Watson, Muskan Yadav, Yu-han Yang, Dalya Akl, Sarah Antier, Jean-Luc Atteia, Stéphane Basa, Nathaniel R. Butler, Simone Dichiara, Damien Dornic, Jean-Grégoire Ducoin, Francis Fortin, Leonardo García-García, Kin Ocelotl López, Francesco Magnani, Brenda O'Connor, Margarita Pereyra, Ny Avo Rakotondrainibe, Fredd Sánchez-Álvarez, Benjamin Schneider, Eleonora Troja, Antonio de Ugarte Postigo High Energy Astrophysical Phenomena (astro-ph.HE) We present the photometric and spectroscopic analysis of the short-duration GRB 250221A ($T_{90}=1.80\\pm0.32$ s), using a data set from the optical facilities COLIBRÍ, the Harlingten 50 cm Telescope, and the Very Large Telescope. We complement these observations with data from the \\textit{Neil Gehrels Swift Observatory} and the \\textit{Einstein Probe}, as well as radio observations from the Very Large Array. GRB 250221A is among the few short GRBs with direct afterglow spectroscopy, which gives a secure redshift determination of $z=0.768$ and allows the unambiguous identification of the host as a galaxy with a star-formation rate of $\\sim3\\,M_\\odot\\,{\\rm yr}^{-1}$. The X-ray and optical light curves up to $T_0+10$ ks (where $T_0$ refers to the GRB trigger time) are well described by forward-shock synchrotron emission in the slow-cooling regime within the standard fireball framework. However, at $T_0+0.6$ days, both the X-ray and optical bands exhibit an excess over the same interval, which we interpret as evidence of energy injection into a jet with a half-opening angle of $\\theta_j=11.5^{\\circ}$ through a refreshed shock powered by late central engine activity or a radially stratified ejecta. The burst properties (duration, spectral hardness, peak energy, and location in the Amati plane) all favour a compact binary merger origin. However, our modelling of the afterglow suggests a dense circumburst medium ($n\\sim80$ cm$^{-3}$), which is more typical of a Collapsar environment. This tension over the classification of this burst (short-hard vs. long-soft) as inferred from the prompt and afterglow emissions makes GRB~250221A an unusual event and underscores the limitations of duration-based classifications and the importance of multi-wavelength, time-resolved follow-up observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.19132.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19143",
      "title": "Fast Radio Bursts",
      "authors": [
        "J. I. Katz"
      ],
      "abstract": "Encyclopedia of Astrophysics (Elsevier 2025) High Energy Astrophysical Phenomena (astro-ph.HE) Eighteen years after their discovery, the astronomical sources and radiation mechanisms of fast radio bursts remain mysterious. Their radiation is as bright as that of pulsars, with brightness temperatures as high as $\\sim 10^{36}$ K, implying coherent emission, but the plasma physics that forms the coherent charge bunches, with net charges of order a Coulomb, is not understood. Some FRB have been identified with galaxies at redshifts of a few tenths, but one originated within a globular cluster in the galaxy M81 at a distance of 3.6 Mpc. A minority of FRB have been observed to repeat, in some cases thousands of times. The vast majority of FRB have not been observed to repeat, but it is not known if they are truly ``one-offs'' or repeat at unobservably long intervals. Some FRB originate within dense, rapidly varying, plasma environments, while others appear to be surrounded by high vacuum. Hypotheses for their sources include magnetars and black hole accretion discs.",
      "pdf_url": "https://arxiv.org/pdf/2510.19143.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19177",
      "title": "An XMM long look at the accretion disk plasma in the dipping neutron star LMXB 4U1624-490",
      "authors": [
        "Eleonora Caruso",
        "Elisa Costantini",
        "Nathalie Degenaar",
        "Maria Diaz Trigo"
      ],
      "abstract": "An XMM long look at the accretion disk plasma in the dipping neutron star LMXB 4U1624-490 Eleonora Caruso, Elisa Costantini, Nathalie Degenaar, Maria Diaz Trigo 15 pages, 11 figures, . Accepted by A&A High Energy Astrophysical Phenomena (astro-ph.HE) Dipping neutron star low-mass X-ray binaries (NS LMXBs) are systems that exhibit periodic drops in their X-ray light curves. These are believed to be caused by material at the impact point of the gas stream onto the accretion disk, the bulge. Dipping systems are observed at high inclination and provide exceptional opportunities to address important open questions about accretion disks, such as the physical properties of the bulge, and the connection between disk atmospheres and disk winds. We aimed to characterize the accretion disk plasmas present in the 21h-period NS LMXB 4U 1624-490, and perform a detailed spectral analysis of the material present at the impact region. We used four XMM EPIC pn observations that were specifically targeting dips, and allow us to probe dipping activity over different timescales (i.e. consecutive orbits and $\\sim$6 months). We use both time- and flux-resolved spectroscopic analysis to probe the structural properties of the bulge moving along the line of sight and its homogeneity, respectively. During dipping, the primary spectrum is modulated by an ionized (log$\\xi\\sim$ 3.4) absorber with varying column density and covering factor, as well as a colder absorber. This suggests that the bulge is a multiphase and clumpy absorbing medium. From size scale arguments, we estimate the number of clumps in the bulge to be $>$7$\\times10^{3}$. A highly ionized disk atmosphere becomes evident only when different phases of absorption are analyzed individually. This work demonstrates the feasibility of constructing a physical picture of the bulge, and highlights how future research could reveal how its properties depend on system parameters, and whether the bulge could influence the dynamics of the accretion disk.",
      "pdf_url": "https://arxiv.org/pdf/2510.19177.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19388",
      "title": "Anomalous scattering of pulsars towards the Gum Nebula",
      "authors": [
        "M. A. Krishnakumar",
        "Bhal Chandra Joshi",
        "P. K. Manoharan"
      ],
      "abstract": "Anomalous scattering of pulsars towards the Gum Nebula M. A. Krishnakumar, Bhal Chandra Joshi, P. K. Manoharan High Energy Astrophysical Phenomena (astro-ph.HE) We report wideband scatter-broadening estimates of 14 pulsars towards the Gum nebula region using the Band-3 of the upgraded GMRT. This work increases the measurements of frequency scaling index of scatter-broadening ($\\alpha$) across the nebula by more than 3 times. A strong correlation between the distance and the scattering strength is observed for pulsars behind the nebula. It is also observed that for distant pulsars ($> 2 kpc$), the effect of the Gum nebula in DM and scattering strength is not substantial. We also report a much flatter $\\alpha$ for the Vela pulsar and argue that its scattering is not caused by the Gum nebula, but the Vela supernova remnant.",
      "pdf_url": "https://arxiv.org/pdf/2510.19388.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19434",
      "title": "Application and development of advanced mathematical tools for population and time series analysis in pulsar astrophysics",
      "authors": [
        "C.R. García"
      ],
      "abstract": "Application and development of advanced mathematical tools for population and time series analysis in pulsar astrophysics C.R. García PhD thesis defended at the Autonomous University of Barcelona (UAB) on September 4, 2025. Advisors: Diego F. Torres and Alessandro Patruno High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) In this thesis, we introduce novel methods for analyzing pulsar populations using a variety of mathematical techniques. These tools-particularly graph theory-have been thoroughly validated in advanced mathematics, enabling us to overcome some of the constraints (even dimensional) inherent in conventional visualization approaches. This exploration benefits from dimensionality reduction techniques, which not only lessen computational demands but also highlight potential for describing physical characteristics. The resulting structures encode information about pulsar similarities that extend beyond standard spin parameters, revealing relationships that are not readily apparent in traditional diagrams. With a physically motivated topological perspective, we leverage the strengths of these methods and present results that span from prospective source classification and the emergence of new classes to catalog comparison, among other applications. This new approach enables fresh interpretations of longstanding problems, laying a new foundation for visualizing the pulsar population and categorizing sources. Building on this, we identify several sources as likely members of specific binary subclasses and investigate the potential transitional nature of others. Furthermore, we extend the use of graph theory to the boundary of machine learning, demonstrating its capability for binary separation in an unsupervised context. Finally, we introduce and apply an innovative, flexible time-series alignment technique to the field of gamma-ray astrophysics. The method identifies notable similarities among the light curves of gamma-ray pulsars. The results presented here are promising, offering a refreshing direction for the field and new pathways for rigorous mathematical analysis, ultimately providing meaningful alternatives to traditional approaches in high-energy astrophysics.",
      "pdf_url": "https://arxiv.org/pdf/2510.19434.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19443",
      "title": "The impact of superradiance on the spin evolution of variably accreting massive black holes",
      "authors": [
        "Adithya Nandakumar",
        "Ricarda S. Beckmann",
        "Vid Irsic"
      ],
      "abstract": "The impact of superradiance on the spin evolution of variably accreting massive black holes Adithya Nandakumar, Ricarda S. Beckmann, Vid Irsic High Energy Astrophysical Phenomena (astro-ph.HE) This paper explores how time-varying increases in mass accretion onto rapidly spinning black holes influence their long-term spin evolution when affected by superradiance - a process where energy is extracted from the black hole by a surrounding axion field. Using simulations the study tracks how sudden accretion boosts affect a critical spin-down phase (the superradiance drop) during which the black hole's spin rapidly decreases while its mass remains nearly constant. The black hole spin evolution is controlled by the competition between two processes: how fast angular momentum is added through accretion, and how fast it is removed by the axion cloud. One major conclusion is that boosts to the accretion rate before the superradiance drop have the strongest effect, as they can delay or reshape the drop and significantly shrink the region of the mass-spin plane depopulated due to the superradiance. In particular, a super-Eddington accretion rate of 5 times Eddington accretion, lasting for 4 Myr and occurring 30 Myr before the superradiance drop can reduce the superradiance exclusion region in the mass-spin plane by 40 percent. In contrast, boosts to the accretion rate after the superradiance drop only cause temporary changes in the black hole spin. The study also shows that black holes with lighter axion clouds are more sensitive to these early boosts and can show observable spin changes lasting tens to hundreds of millions of years. Heavier axion clouds, however, require much stronger or longer-lasting boosts to produce similar effects, making them more stable under variable accretion.",
      "pdf_url": "https://arxiv.org/pdf/2510.19443.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19446",
      "title": "Interacting supernovae and where to find them",
      "authors": [
        "Robert Brose",
        "Iurii Sushch",
        "Jonathan Mackey",
        "Maria Arias"
      ],
      "abstract": "Interacting supernovae and where to find them Robert Brose, Iurii Sushch, Jonathan Mackey, Maria Arias 18 pages, 14 figures, accepted by A&A High Energy Astrophysical Phenomena (astro-ph.HE) Early interaction of supernova blast waves with CSM has the potential to accelerate particles to PeV energies, although this has not yet been detected. Current models for this interaction assume the shock expands into a smooth stellar wind, although observations of many SNe do not support this assumption. We extend previous work by considering shocks expanding into complex density profiles consisting of smooth winds with dense CSM shells at various distances from the progenitor star. We aim to predict the gamma-ray and multiwavelength signatures of CSM interaction. We used the PION code to model the CSM around LBV including a brief episode of enhanced mass-loss and to simulate the formation of photoionization-confined shells around RSGs. Consequently, we used the time-dependent acceleration-code RATPaC to study the acceleration of cosmic rays in SNe expanding into these media and to evaluate the emitted radiation across the whole electromagnetic spectrum. We find that the interaction with the CSM shells can significantly boost the gamma-ray emission, with the emission peaking weeks to years after the explosion. The peak luminosity for Type-IIP and Type-IIn remnants can exceed the luminosity expected for smooth winds by orders of magnitude. For Type-IIP explosions, the light-curve peak is only reached years after the explosion. We evaluate the multiwavelength signatures expected from the interaction of the blast wave with a dense CSM shell from radio, over optical, to thermal X-rays. We identify high-cadence optical surveys and continuous monitoring of nearby SN in radio and mm wavelengths as the best-suited strategies for identifying targets that should be followed-up by gamma-ray observatories. We predict that gamma-rays from interaction with dense CSM shells may be detectable out to a few Mpc for late interaction, and tens of Mpc for early interaction.",
      "pdf_url": "https://arxiv.org/pdf/2510.19446.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19485",
      "title": "Can we ignore the time dependence in matter neutrino resonance?",
      "authors": [
        "Owais Ullah Faiz",
        "Mushahid Hussain",
        "Shashank Shalgar"
      ],
      "abstract": "Can we ignore the time dependence in matter neutrino resonance? Owais Ullah Faiz, Mushahid Hussain, Shashank Shalgar High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) In the vicinity of neutron star mergers (NSMs), it is possible for the neutrino self-interaction potential to cancel with the matter potential leading to matter neutrino resonance (MNR). MNR is one of the most interesting mechanisms by which neutrino flavor evolution can occur in dense astrophysical environments. Previous studies have typically assumed that the neutrino flavor field evolves to a steady state -- a simplification also used in other self-interaction models such as the neutrino-bulb model. Here, we perform reproducible calculations of MNR using both time-independent and time-dependent formalisms and show that they yield qualitatively different flavor survival probabilities. The time-independent approach produces unstable steady-state solutions that differ fundamentally from the dynamical behavior captured in time-dependent simulations. These results demonstrate that the steady-state assumption is generally invalid, and physical interpretations based on time-independent calculations of dense neutrino systems require re-evaluation.",
      "pdf_url": "https://arxiv.org/pdf/2510.19485.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19539",
      "title": "Probing Accretion Disk Winds of Stratified Nature with Fe XXVI Doublet in Black Hole X-ray Binaries",
      "authors": [
        "Keigo Fukumura",
        "Shoji Ogawa",
        "Atsushi Tanimoto",
        "Francesco Tombesi",
        "Alfredo Luminari",
        "Maxime Parra",
        "Megumi Shidatsu",
        "Liyi Gu",
        "Ehud Behar"
      ],
      "abstract": "Probing Accretion Disk Winds of Stratified Nature with Fe XXVI Doublet in Black Hole X-ray Binaries Keigo Fukumura, Shoji Ogawa, Atsushi Tanimoto, Francesco Tombesi, Alfredo Luminari, Maxime Parra, Megumi Shidatsu, Liyi Gu, Ehud Behar 10 pages, 4 figures, accepted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Powerful ionized accretion disk winds are often observed during episodic outbursts in Galactic black hole transients. Among those X-ray absorbers, \\fexxvi\\ doublet structure (Ly$\\alpha_1$+Ly$\\alpha_2$ with $\\sim 20$eV apart) has a unique potential to better probe the underlying physical nature of the wind; i.e. density and kinematics. We demonstrate, based on a physically-motivated magnetic disk wind scenario of a stratified structure in density and velocity, that the doublet line profile can be effectively utilized as a diagnostics to measure wind density and associated velocity dispersion (due to thermal turbulence and/or dynamical shear motion in winds). Our simulated doublet spectra with post-process radiative transfer calculations indicate that the profile can be (1) broad with a single peak for higher velocity dispersion ($\\gsim 5,000$ km~s$^{-1}$), (2) a standard shape with 1:2 canonical flux ratio for moderate dispersion ($\\sim 1,000-5,000$ km~s$^{-1}$) or (3) double-peaked with its flux ratio approaching 1:1 for lower velocity dispersion ($\\lsim 1,000$ km~s$^{-1}$) in optically-thin regime, allowing various line shape. Such a diversity in doublet profile is indeed unambiguously seen in recent observations with XRISM/Resolve at microcalorimeter resolution. We show that some implications inferred from the model will help constrain the local wind physics where \\fexxvi\\ is predominantly produced in a large-scale, stratified wind.",
      "pdf_url": "https://arxiv.org/pdf/2510.19539.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19584",
      "title": "Accretion with two-phase gas supply and its application in black hole X-ray binaries",
      "authors": [
        "Yilong Wang",
        "B. F. Liu",
        "Mingjun Liu"
      ],
      "abstract": "Accretion with two-phase gas supply and its application in black hole X-ray binaries Yilong Wang, B. F. Liu, Mingjun Liu 10 pages, 6 figures; accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) Accretion in black hole X-ray binaries is commonly believed to be supplied by the Roche lobe overflow or the stellar wind. The former is thought to form a geometrically thin disc while the diffuse wind could form a geometrically thick hot accretion flow. In this paper, we instead consider a more generalised case, i.e., accretion with both cold and hot gas supplies, which feed a disc and a corona respectively. We investigate the interaction of disc and corona by analysing the energy coupling and matter exchange, i.e. corona condensation/disc evaporation, with a semi-analytical method. It is found that the accretion geometry in the radial direction and the resultant emission spectrum depend strongly on both the total gas supply rate and the ratio of cold and hot gases. For gas supply rates of a few percent of the Eddington value, diverse geometries and spectral shapes are possible, depending on the fraction of cold gas supply. This provides an interpretation for the various spectra observed in intermediate states. However, at higher accretion rates, regardless of the form of the feeding gas, the inner accretion flow is always disc-dominated, implying an inevitable transition to the soft state, while at very low gas supply rates, hard state spectrum dominated by the hot flow is expected. We also present the predicted hardness-intensity correlation of Cygnus X-1, and constrain the value of the viscosity parameter of the accretion flow to the range of 0.25--0.35 by comparing our results with MAXI observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.19584.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19606",
      "title": "Revisiting the Radio Lateral Distribution Function: An amplitude dependence on $X_{\\rm max}$ and primary composition",
      "authors": [
        "Washington R. Carvalho Jr.",
        "Lech Piotrowski"
      ],
      "abstract": "Revisiting the Radio Lateral Distribution Function: An amplitude dependence on $X_{\\rm max}$ and primary composition Washington R. Carvalho Jr., Lech Piotrowski High Energy Astrophysical Phenomena (astro-ph.HE) We show that there is a strong dependence of the radio LDF electric field amplitudes at ground level on the position of $X_{\\rm max}$ in the atmosphere, even accounting for differences in the EM energy of the showers. Since an $X_{\\rm max}$ dependence leads to a primary composition dependence, this implies that information on the mass composition is encoded not only in the LDF shape but also in its amplitude. This $X_{\\rm max}$ dependence can be explained in terms of two competing scalings of the measured electric field: One goes with $(1/\\rho)^J$, where $\\rho$ is the air density at $X_{\\rm max}$ and $J$ is a zenith dependent non-linearity factor describing coherence loss. This density scaling tends to decrease the geomagnetic emission of deeper showers. The other scaling goes with $(1/R)$, where $R$ is the distance from $X_{\\rm max}$ to the core at ground, and instead increases the measured electric field of deeper showers. At low zenith angles, the $(1/R)$ scaling is stronger and leads to larger measured electric fields as $X_{\\rm max}$ increases. The picture at higher zeniths, i.e., lower densities, is more nuanced. In this region, the deflections due to the Lorentz force are much larger and introduce extra time delays between the particle tracks, decreasing the coherence of the emission. This loss of coherence is highly dependent on the strength of the geomagnetic field and can slow down, or even reverse the increase of the radio emission with decreasing air density. This strong, yet historically overlooked LDF amplitude dependence on $X_{\\rm max}$/composition could be used to directly infer, even bypassing any $X_{\\rm max}$ reconstruction, the cosmic ray primary composition on an event-by-event basis. It could also have some repercussions on other radio reconstruction methods, such as a possible $X_{\\rm max}$/composition bias on shower electromagnetic energy reconstruction methods.",
      "pdf_url": "https://arxiv.org/pdf/2510.19606.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19610",
      "title": "Distortions in Periodicity Analysis of Blazars II: The Impact of Gaps",
      "authors": [
        "P. Peñil",
        "N. Torres-Albà",
        "A. Rico",
        "S. Buson",
        "M. Ajello",
        "A. Domínguez",
        "S. Adhikari"
      ],
      "abstract": "Distortions in Periodicity Analysis of Blazars II: The Impact of Gaps P. Peñil, N. Torres-Albà, A. Rico, S. Buson, M. Ajello, A. Domínguez, S. Adhikari High Energy Astrophysical Phenomena (astro-ph.HE) Time series analysis is fundamental to characterizing the variability inherent in multi-wavelength emissions from blazars. However, a major observational challenge lies in the need for well-sampled, temporally uniform data, which is often hindered by irregular sampling and data gaps. These gaps can significantly affect the reliability and accuracy of methods used to probe source variability. This paper investigates the impact of such observational gaps on time series analysis of blazar emissions. To do so, we systematically evaluate how these gaps alter observed variability patterns, mask genuine periodic signals, and introduce false periodicity detections. This evaluation is conducted using both simulated and real observational data. We assess a range of widely used time series analysis methods, including the Lomb-Scargle periodogram, Phase Dispersion Minimization, and the recently proposed Singular Spectrum Analysis (SSA). Our results demonstrate a clear and significant degradation in period detection reliability when the percentage of gaps exceeds 50\\%. In such cases, the period-significance relationship becomes increasingly distorted, often leading to misleading results. Among the tested methods, SSA stands out for its ability to yield consistent and robust detections despite high data incompleteness. Additionally, the analyzed methods tend to identify artificial periodicities of around one year, likely due to seasonal sampling effects, which can result in false positives if not carefully recognized. Finally, the periods detected with $\\geq$3$\\sigma$ confidence are unlikely to result from stochastic processes or from the presence of gaps in the analyzed time series.",
      "pdf_url": "https://arxiv.org/pdf/2510.19610.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19662",
      "title": "On the origin of ~ 100 TeV neutrinos from the Seyfert galaxy NGC 7469",
      "authors": [
        "Qi-Rui Yang",
        "Xiao-Bin Chen",
        "Ruo-Yu Liu",
        "Xiang-Yu Wang",
        "Martin Lemoine"
      ],
      "abstract": "On the origin of ~ 100 TeV neutrinos from the Seyfert galaxy NGC 7469 Qi-Rui Yang, Xiao-Bin Chen, Ruo-Yu Liu, Xiang-Yu Wang, Martin Lemoine High Energy Astrophysical Phenomena (astro-ph.HE) The origin of TeV-PeV neutrinos detected by IceCube remains largely unknown. The most significant individual neutrino source is the close-by Seyfert galaxy NGC 1068 at 4.2$\\sigma$ level with a soft spectral index. Another notable candidate is the Seyfert galaxy NGC 7469, which has been recently proposed as a potential neutrino emitter. The likelihood fit of the IceCube data for this source returned a very hard spectral index of ~ 1.9 and the excess is dominated by two high-energy events, issued as two neutrino alerts IC220424A and IC230416A. The energies of the two neutrinos are estimated to be 100-200 TeV, implying a maximum proton energy > 2 PeV, significantly higher than that in NGC 1068. The lack of lower-energy neutrinos from NGC 7469 also suggests a neutrino spectrum harder than that of NGC 1068. In this paper, we analyze the Fermi-LAT observations of NGC 7469, which yield non-detection. By requiring the cascade flux accompanying neutrino production not to exceed the upper limit of the GeV flux, the size of the neutrino-emitting region can be constrained when the neutrino flux takes a high value of the allowed range. We suggest that protons are accelerated to PeV energies via turbulence or magnetic reconnection in the corona of NGC 7469 and interact with OUV photons from the accretion disk and X-rays from the corona through the $p\\gamma$ process, producing neutrinos with energy of 100-200 TeV. In the turbulence acceleration scenario, the required maximum proton energy can be achieved with a magnetization parameter close to unity ($\\sigma\\sim 1$), while in the reconnection scenario, a magnetization parameter with $\\sigma\\sim 10$ is needed. In both scenarios, a pair dominated composition for the corona is preferred. The difference in the neutrino spectrum between NGC 7469 and NGC 1068 could be due to a different magnetization despite that they belong to the same type of AGN.",
      "pdf_url": "https://arxiv.org/pdf/2510.19662.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19729",
      "title": "Coupling of neutrino beam-driven MHD waves and resonant instabilities in rotating magnetoplasmas with neutrino two-flavor oscillations",
      "authors": [
        "Jyoti Turi",
        "Amar P. Misra"
      ],
      "abstract": "Coupling of neutrino beam-driven MHD waves and resonant instabilities in rotating magnetoplasmas with neutrino two-flavor oscillations Jyoti Turi, Amar P. Misra High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) We present an analysis of neutrino-driven magnetohydrodynamic (MHD) waves and instabilities in a rotating magnetoplasma with weak neutrino interactions. We show, for the first time, that neutrino-driven shear Alfv{é}n and oblique magnetosonic waves can be coupled by the Coriolis force, forming new wave modes affected by this force, as well as neutrino beam and two neutrino flavor oscillations. Our work extends previous theories by demonstrating that shear Alfv{é}n waves are influenced by neutrino effects and by identifying instabilities resulting from resonant interactions with both a streaming neutrino beam and flavor oscillations. We find that the Coriolis force, as well as plasma density and magnetic field strength, have a significant impact on the profiles of the instability growth rates. Our findings may shed new light on the physical mechanisms underlying core-collapse supernovae.",
      "pdf_url": "https://arxiv.org/pdf/2510.19729.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2202.05417",
      "title": "Galactic Positrons from Thermonuclear Supernovae",
      "authors": [
        "T.B. Mera Evans",
        "P. Hoeflich",
        "R. Diehl"
      ],
      "abstract": "Galactic Positrons from Thermonuclear Supernovae T.B. Mera Evans, P. Hoeflich, R. Diehl High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Type Ia Supernovae (SNe Ia) may originate from a wide variety of explosion scenarios and progenitor channels. They exhibit a factor of about 10 difference in brightness and, thus, a differentiation in the mass of 56Ni->56Co->56 Fe. We present a study on the fate of positrons within SNe Ia in order to evaluate their escape fractions and energy spectra. Our detailed Monte Carlo transport simulations for positrons and gamma-rays include both beta + decay of 56 Co and pair production. We simulate a wide variety of explosion scenarios, including the explosion of white dwarfs (WD) close to the Chandrasekhar mass, M(Ch), He-triggered explosions of sub-M Ch WDs, and dynamical mergers of two WDs. For each model, we study the influence of the size and morphology of the progenitor magnetic field between 1 and 1E13 G. Population synthesis based on the observed brightness distribution of SNe Ia was used to estimate the overall contributions to Galactic positrons due to escape from SN Ia. We find that this is dominated by normal-bright SNe Ia, where variations in the distribution of emitted positrons are small. We estimate a total SNe Ia contribution to the Galactic positrons of < 2% and, depending on the magnetic field morphology, less than 6...20% for M(Ch) and sub-M(Ch), respectively.",
      "pdf_url": "https://arxiv.org/pdf/2202.05417.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.05087",
      "title": "Prospects for Observing Astrophysical Transients with GeV Neutrinos",
      "authors": [
        "Angelina Sherman",
        "Jessie Thwaites",
        "Ke Fang",
        "Justin Vandenbroucke",
        "Brian D. Metzger"
      ],
      "abstract": "Prospects for Observing Astrophysical Transients with GeV Neutrinos Angelina Sherman, Jessie Thwaites, Ke Fang, Justin Vandenbroucke, Brian D. Metzger High Energy Astrophysical Phenomena (astro-ph.HE) Although Cherenkov detectors of high-energy neutrinos in ice and water are often optimized to detect TeV-PeV neutrinos, they may also be sensitive to transient neutrino sources in the 1-100~GeV energy range. A wide variety of transient sources have been predicted to emit GeV neutrinos. In light of the upcoming IceCube-Upgrade, which will extend the IceCube detector's sensitivity down to a few GeV, as well as improve its angular resolution, we survey a variety of transient source models and compare their predicted neutrino fluences to detector sensitivities, in particular those of IceCube-DeepCore and the IceCube Upgrade. We consider the ranges of neutrino fluence from transients powered by non-relativistic shocks, such as novae, supernovae, fast blue optical transients, and tidal disruption events. We also consider fast radio bursts and relativistic outflows of high- and low-luminosity gamma-ray bursts. Our study sheds light on the prospects of observing GeV transients with existing and upcoming neutrino facilities.",
      "pdf_url": "https://arxiv.org/pdf/2412.05087.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.12404",
      "title": "Spectro-temporal analysis of ultra-fast radio bursts using per-channel arrival times",
      "authors": [
        "Mohammed A. Chamma",
        "Victor Pop",
        "Fereshteh Rajabi"
      ],
      "abstract": "Spectro-temporal analysis of ultra-fast radio bursts using per-channel arrival times Mohammed A. Chamma, Victor Pop, Fereshteh Rajabi 20 pages, 14 figures. Accepted at MNRAS. Measurements and code available at this https URL High Energy Astrophysical Phenomena (astro-ph.HE) Fast radio bursts (FRBs), especially those from repeating sources, exhibit a rich variety of morphologies in their dynamic spectra (or waterfalls). Characterizing these morphologies and spectro-temporal properties is a key strategy in investigating the underlying unknown emission mechanism of FRBs. This type of analysis has been typically accomplished using two-dimensional Gaussian techniques and the autocorrelation function (ACF) of the waterfall. These techniques are effective and precise at all duration scales, but can be limited in the presence of scattered tails, complex morphologies, or recently observed microshot forests. Here, we present a technique that involves the tagging of per-channel arrival times of an FRB to perform spectro-temporal measurements using a Gaussian profile model for each channel. While scattering and dispersion remain important and often dominating sources of uncertainty in measurements, this technique provides an adaptable and firm foundation for obtaining spectro-temporal properties from all types of FRB morphologies. We present measurements using this technique of several hundred bursts across 12 repeating sources, including over 400 bursts from the repeating sources FRB 20121102A, FRB 20220912A, and FRB 20200120E, all of which exhibit recently observed microsecond-long ultra-FRBs, as well as 143 multi-component drift rates. In addition to retrieving the known relationship between sub-burst slope and duration, we explore other correlations between burst properties. We find that the sub-burst slope law extends smoothly to ultra-FRBs, and that ultra-FRBs appear to form a distinct population in the duration-frequency relation.",
      "pdf_url": "https://arxiv.org/pdf/2412.12404.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.21378",
      "title": "Proto-neutron Stars with Dark Matter Admixture: A Single-Fluid Approach",
      "authors": [
        "Adamu Issifu",
        "Débora P. Menezes",
        "Tobias Frederico"
      ],
      "abstract": "Proto-neutron Stars with Dark Matter Admixture: A Single-Fluid Approach Adamu Issifu, Débora P. Menezes, Tobias Frederico 15 pages, 9 figures (Accepted for publication in Physics of the Dark Universe) High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) This work investigates the impact of dark matter (DM) on the microscopic and macroscopic properties of proto-neutron stars (PNSs). We employ a single-fluid framework in which DM interacts with ordinary matter (OM) via the Higgs portal and remains in thermal equilibrium through non-gravitational interactions. Using a quasi-static approximation, we analyze the evolution of PNSs during the Kelvin-Helmholtz phase by varying the DM mass while keeping the entropy per baryon and lepton fraction fixed. Our results show that DM absorbs thermal energy from the stellar medium without efficient re-emission, thereby altering neutrino emission and affecting the star's thermal evolution history. Furthermore, neutrinos contribute significantly to pressure support in the PNS phase, inhibiting DM mass accretion during neutrino-trapped stages. Based on the requirement to satisfy the observed $2,\\rm M_\\odot$ neutron star mass constraint and to maintain consistency with supernova remnant data, we suggest an upper limit of $m_\\chi \\leq 0.62,\\rm GeV$ for the DM mass that can accrete in evolving PNSs, within the model framework. In contrast, we established that cold neutron stars (NSs) can support higher DM masses without compromising equilibrium stability, owing to increased central density, enhanced gravitational binding energy, and reduced thermal pressure.",
      "pdf_url": "https://arxiv.org/pdf/2506.21378.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.03085",
      "title": "Exploring the X-ray-radio connection for AGN via measurements of the multi-dimensional luminosity function",
      "authors": [
        "Clara M. Pennock",
        "James Aird",
        "Cassandra L. Barlow-Hall"
      ],
      "abstract": "Exploring the X-ray-radio connection for AGN via measurements of the multi-dimensional luminosity function Clara M. Pennock, James Aird, Cassandra L. Barlow-Hall High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We present new methods to quantify the AGN population in terms of a multi-dimensional luminosity function that describes the space density of sources as a function of both X-ray and radio luminosity. We compile a sample of 1538 radio and X-ray detected extragalactic sources from the Boötes and COSMOS fields. First, we investigate the X-ray-radio luminosity correlation in the sample and find that an apparent correlation is introduced due to the sensitivity limits of the surveys; when considering individual redshift bins we find a wide range of radio luminosities associated with a given X-ray luminosity, and vice versa, indicating little direct connection between the emission processes. We then measure the X-ray luminosity function, radio luminosity function and multi-dimensional X-ray-radio luminosity function across redshift ($0<z<6$). We apply luminosity thresholds in X-ray and radio to restrict our sample to those in the AGN-dominated regime and explore how the fraction of radio-selected AGN within the overall X-ray sample varies with increasing X-ray luminosity (and vice versa). We find that towards the highest X-ray and radio luminosities the fraction of sources with both an X-ray and radio detection increases towards 100%, indicating that at the highest luminosities we are more likely to obtain a detection in both bands, though the source will not necessarily be bright in both bands. Thus, the most luminous accretion events are more likely to be associated with the production of a jet, despite the distinct physical structures that produce the emission and likely persist over very different timescales.",
      "pdf_url": "https://arxiv.org/pdf/2507.03085.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.18785",
      "title": "JWST Observations of SN 2023ixf I: Completing the Early Multi-Wavelength Picture with Plateau-phase Spectroscopy",
      "authors": [
        "J. M. DerKacy",
        "C. Ashall",
        "E. Baron",
        "K. Medler",
        "T. Mera",
        "P. Hoeflich",
        "M. Shahbandeh",
        "C. R. Burns",
        "M. D. Stritzinger",
        "M. A. Tucker",
        "B. J. Shappee",
        "K. Auchettl",
        "C. R. Angus",
        "D. D. Desai",
        "A. Do",
        "J. T. Hinkle",
        "W. B. Hoogendam",
        "M. E. Huber",
        "A. V. Payne",
        "D. O. Jones",
        "J. Shi",
        "M. Y. Kong",
        "S. Romagnoli",
        "A. Syncatto",
        "S. Moran",
        "E. Fereidouni",
        "P. J. Brown",
        "M. Engesser",
        "O. D. Fox",
        "L. Galbany",
        "E. Y. Hsiao",
        "T. de Jaeger",
        "S. Kumar",
        "J. Lu",
        "M. Matsuura",
        "P. Mazzali",
        "N. Morrell",
        "C. M. Pfeffer",
        "M. M. Phillips",
        "A. Rest",
        "S. Shiber",
        "L. Strolger",
        "N. B. Suntzeff",
        "T. Temim",
        "S. Tinyanont",
        "Q. Wang",
        "R. Wesson",
        "S. H. Park",
        "J. Rho"
      ],
      "abstract": "JWST Observations of SN 2023ixf I: Completing the Early Multi-Wavelength Picture with Plateau-phase Spectroscopy J. M. DerKacy, C. Ashall, E. Baron, K. Medler, T. Mera, P. Hoeflich, M. Shahbandeh, C. R. Burns, M. D. Stritzinger, M. A. Tucker, B. J. Shappee, K. Auchettl, C. R. Angus, D. D. Desai, A. Do, J. T. Hinkle, W. B. Hoogendam, M. E. Huber, A. V. Payne, D. O. Jones, J. Shi, M. Y. Kong, S. Romagnoli, A. Syncatto, S. Moran, E. Fereidouni, P. J. Brown, M. Engesser, O. D. Fox, L. Galbany, E. Y. Hsiao, T. de Jaeger, S. Kumar, J. Lu, M. Matsuura, P. Mazzali, N. Morrell, C. M. Pfeffer, M. M. Phillips, A. Rest, S. Shiber, L. Strolger, N. B. Suntzeff, T. Temim, S. Tinyanont, Q. Wang, R. Wesson, S. H. Park, J. Rho 20 pages, 10 figures, accepted by ApJ; updated to accepted version High Energy Astrophysical Phenomena (astro-ph.HE) We present and analyze panchromatic (0.35--14 $\\mu$m) spectroscopy of the Type II supernova 2023ixf, including near- and mid-infrared spectra obtained 33.6 days after explosion during the plateau-phase, with the James Webb Space Telescope (JWST). This is the first in a series of papers examining the evolution of SN 2023ixf with JWST spanning the initial 1000 days after explosion, monitoring the formation and growth of molecules and dust in ejecta and surrounding environment. The JWST infrared spectra are overwhelmingly dominated by H lines, whose profiles reveal ejecta structures, including flat tops, blue notches, and red shoulders, unseen in the optical spectra. We characterize the nature of these structures, concluding that they likely result from a combination of ejecta geometry, viewing angle, and opacity effects. We find no evidence for the formation of dust precursor molecules such as carbon-monoxide (CO), nor do we observe an infrared excess attributable to dust. These observations imply that the detections of molecules and dust in SN 2023ixf at later epochs arise either from freshly synthesized material within the ejecta or circumstellar material at radii not yet heated by the supernova at this epoch.",
      "pdf_url": "https://arxiv.org/pdf/2507.18785.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.14013",
      "title": "Extensive Analysis of gamma-Ray Periodicity in Jetted AGN from the 4FGL Catalog Using Fermi-LAT Observations",
      "authors": [
        "P. Peñil",
        "A. Domínguez",
        "S. Buson",
        "M. Ajello",
        "S. Adhikari",
        "A. Rico"
      ],
      "abstract": "Extensive Analysis of gamma-Ray Periodicity in Jetted AGN from the 4FGL Catalog Using Fermi-LAT Observations P. Peñil, A. Domínguez, S. Buson, M. Ajello, S. Adhikari, A. Rico High Energy Astrophysical Phenomena (astro-ph.HE) The quest to uncover periodic patterns within the $\\gamma$-ray emissions of jetted active galactic nuclei (AGN) has recently emerged as a focal point in astrophysics. One of the primary challenges has been the necessity for prolonged exposures in the $\\gamma$-ray energy band. In our investigation, we leverage 12 years' worth of observations from the \\textit{Fermi}-LAT to systematically explore periodicity across 1492 jetted AGN cataloged in 4FGL, representing the largest sample analyzed to date. Our analysis involves a robust pipeline employing nine distinct techniques designed to detect potential periodic emissions within their $\\gamma$ rays. We note that 24 objects with previous hints of periodicity are deliberately excluded in the present work since they were reanalyzed in a dedicated paper using a similar methodology. Using this thorough approach, we do not find any evidence for periodic signals in the 1492 jetted AGN $\\gamma$-ray light curves analyzed here.",
      "pdf_url": "https://arxiv.org/pdf/2509.14013.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25877",
      "title": "A fast powerful X-ray transient from possible tidal disruption of a white dwarf",
      "authors": [
        "D.-Y. Li",
        "W.-D. Zhang",
        "J. Yang",
        "J.-H. Chen",
        "W. Yuan",
        "H.-Q. Cheng",
        "F. Xu",
        "X.-W. Shu",
        "R.-F. Shen",
        "N. Jiang",
        "J.-Z. Zhu",
        "C. Zhou",
        "W.-H. Lei",
        "H. Sun",
        "C.-C. Jin",
        "L.-X. Dai",
        "B. Zhang",
        "Y.-H. Yang",
        "W.-J. Zhang",
        "H. Feng",
        "B.-F. Liu",
        "H.-Y. Zhou",
        "H.-W. Pan",
        "M.-J. Liu",
        "S. Corbel",
        "S. K. Jagan",
        "M. C. Baglio",
        "C. Burns",
        "F. Cangemi",
        "C. Chen",
        "Y.-H. Cheng",
        "A. Coleiro",
        "F. Coti Zelati",
        "S. R. Das",
        "Z.-N. Dong",
        "L. Galbany",
        "N. Grollimund",
        "D. Kelson",
        "D. Lai",
        "X. Li",
        "Y. Liu",
        "A. Marino",
        "B. Mockler",
        "P. O'Brien",
        "E.-L. Qiao",
        "N. Rea",
        "L. Resmi",
        "J. Rodriguez",
        "R. Saxton",
        "L.-M. Sun",
        "L. Tao",
        "T.-G. Wang",
        "Y.-L. Wang",
        "X.-F. Wu",
        "D. Xu",
        "Y.-J. Zhang",
        "G.-Y. Zhao",
        "Z.-M. Cai",
        "Y. Chen",
        "B. Cordier",
        "Z. Fan",
        "H. Gao",
        "G. Ghirlanda",
        "J.-W. Hu",
        "Y.-F. Huang",
        "S.-M. Jia",
        "S. Komossa",
        "H.-Y. Liu",
        "H.-Q. Liu",
        "J.-U. Ness",
        "A. Rau",
        "J. Sanders",
        "R. Soria",
        "S.-L. Sun",
        "X.-J. Sun",
        "E. Troja",
        "S.-X. Wen",
        "Y.-Q. Xue",
        "Y.-H. I. Yin",
        "C. Zhang",
        "S.-N. Zhang",
        "Y.-H. Zhang"
      ],
      "abstract": "A fast powerful X-ray transient from possible tidal disruption of a white dwarf D.-Y. Li, W.-D. Zhang, J. Yang, J.-H. Chen, W. Yuan, H.-Q. Cheng, F. Xu, X.-W. Shu, R.-F. Shen, N. Jiang, J.-Z. Zhu, C. Zhou, W.-H. Lei, H. Sun, C.-C. Jin, L.-X. Dai, B. Zhang, Y.-H. Yang, W.-J. Zhang, H. Feng, B.-F. Liu, H.-Y. Zhou, H.-W. Pan, M.-J. Liu, S. Corbel, S. K. Jagan, M. C. Baglio, C. Burns, F. Cangemi, C. Chen, Y.-H. Cheng, A. Coleiro, F. Coti Zelati, S. R. Das, Z.-N. Dong, L. Galbany, N. Grollimund, D. Kelson, D. Lai, X. Li, Y. Liu, A. Marino, B. Mockler, P. O'Brien, E.-L. Qiao, N. Rea, L. Resmi, J. Rodriguez, R. Saxton, L.-M. Sun, L. Tao, T.-G. Wang, Y.-L. Wang, X.-F. Wu, D. Xu, Y.-J. Zhang, G.-Y. Zhao, Z.-M. Cai, Y. Chen, B. Cordier, Z. Fan, H. Gao, G. Ghirlanda, J.-W. Hu, Y.-F. Huang, S.-M. Jia, S. Komossa, H.-Y. Liu, H.-Q. Liu, J.-U. Ness, A. Rau, J. Sanders, R. Soria, S.-L. Sun, X.-J. Sun, E. Troja, S.-X. Wen, Y.-Q. Xue, Y.-H. I. Yin, C. Zhang, S.-N. Zhang, Y.-H. Zhang High Energy Astrophysical Phenomena (astro-ph.HE) Stars captured by black holes (BHs) can be torn apart by strong tidal forces, producing electromagnetic flares. To date, more than 100 tidal disruption events (TDEs) have been observed, each involving invariably normal gaseous stars whose debris falls onto the BH, sustaining the flares over years. White dwarfs (WDs), which are the most prevalent compact stars and a million times denser--and therefore tougher--than gaseous stars, can only be disrupted by intermediate-mass black holes (IMBHs) of 10^2--10^5 solar masses. WD-TDEs are considered to generate more powerful and short-lived flares, but their evidence has been lacking. Here we report observations of a fast and luminous X-ray transient EP250702a detected by Einstein Probe. Its one-day-long X-ray peak as luminous as 10^(47-49) erg/s showed strong recurrent flares with hard spectra extending to several tens of MeV gamma-rays, as detected by Fermi/GBM and Konus-Wind, indicating relativistic jet emission. The jet's X-ray dropped sharply from 3 x 10^49 erg/s to around 10^44 erg/s within 20 days (10 days in the source rest frame). These characteristics are inconsistent with any known transient phenomena other than a jetted-TDE evolving over an unprecedentedly short timescale, indicating the disruption of a WD by an IMBH. At late times, a new soft component progressively dominates the X-ray spectrum, exhibiting an extreme super-Eddington luminosity, which possibly originates from an accretion disc. WD-TDEs open a new window for investigating the elusive IMBHs and their surrounding stellar environments, and they are prime sources of gravitational waves in the band of space-based interferometers.",
      "pdf_url": "https://arxiv.org/pdf/2509.25877.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.18937",
      "title": "Living with Neighbors. VI. Unraveling the Dual Impact of Bars on Star Formation in Paired Galaxies Using DESI",
      "authors": [
        "Woong-Bae G. Zee",
        "Suk-Jin Yoon"
      ],
      "abstract": "Living with Neighbors. VI. Unraveling the Dual Impact of Bars on Star Formation in Paired Galaxies Using DESI Woong-Bae G. Zee, Suk-Jin Yoon Astrophysics of Galaxies (astro-ph.GA) We present a comprehensive investigation into the influence of stellar bars on star formation (SF) in galaxy pairs, using a large sample of low-redshift galaxies ($0.02$\\,$<$\\,z\\,$<$\\,$0.08$) from the DESI Legacy Imaging Surveys DR8. Our analysis examines whether bars enhance or suppress SF during pair interactions, and how these outcomes depend on the star-forming properties of companion galaxies. We find that bars either catalyze or inhibit SF in their host galaxies, depending on the companion's SF activity. In particular, barred galaxies paired with actively star-forming companions experience more pronounced central starbursts (with sSFR up to $\\sim$\\,2.5 dex higher) than unbarred counterparts, whereas those with passive companions often have suppressed SF (sometimes below isolated galaxy levels). The notion of the dual role of bars can reconcile conventional conflicting reports of bar-driven enhancement versus quenching of SF activity. Bars, well known to regulate kpc-scale dynamics, may also link to the impact of external environments: when a star-forming companion provides sufficient gas, bars drive central starbursts, whereas in gas-poor interactions, bars hasten gas depletion and contribute to SF suppression. This work highlights the necessity of accounting for both internal structure and companion properties to fully understand SF regulation in interacting galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.18937.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18942",
      "title": "Warped Disk Galaxies. II. From the Cosmic Web to the Galactic Warp",
      "authors": [
        "Woong-Bae G. Zee",
        "S. Lyla Jung",
        "Sanjaya Paudel",
        "Suk-Jin Yoon"
      ],
      "abstract": "Warped Disk Galaxies. II. From the Cosmic Web to the Galactic Warp Woong-Bae G. Zee, S. Lyla Jung, Sanjaya Paudel, Suk-Jin Yoon Astrophysics of Galaxies (astro-ph.GA) Galactic warps are common in disk galaxies. While often attributed to galaxy--galaxy tides, a non-spherical dark matter (DM) halo has also been proposed as a driver of disk warping. We investigate links among warp morphology, satellite distribution, and large-scale structure using the Sloan Digital Sky Survey catalog of warped disks compiled by Zee et al.\\ (2022). Warps are classified into 244 S and 127 U types, hosting 1,373 and 740 satellites, respectively, and are compared to an unwarped control matched in stellar mass, redshift, and local density. As an indirect, population-level proxy for the host halo's shape and orientation, we analyze the stacked spatial distribution of satellites. Warped hosts show a significant anisotropy: an excess at $45^{\\circ}<\\phi<90^{\\circ}$ (measured from the host major axis), peaking at $P(\\phi)\\simeq 0.003$, versus nearly isotropic controls. Satellites of S-type warps preferentially align with the nearest cosmic filament, whereas those of U-type warps are more often perpendicular. The incidence of warps increases toward filaments ($r_{\\rm fil}<4,{\\rm Mpc},h^{-1}$), while the number of satellites around warped hosts remains approximately constant with filament distance, indicating a direct influence of the large-scale environment. We discuss possible links between galactic warps and the cosmic web, including anisotropic tidal fields and differences in evolutionary stage.",
      "pdf_url": "https://arxiv.org/pdf/2510.18942.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18957",
      "title": "Galaxy Activity, Torus and Outflow Survey (GATOS) X: Molecular gas clumpiness under the influence of AGN",
      "authors": [
        "Federico Esposito",
        "Almudena Alonso-Herrero",
        "Santiago García-Burillo",
        "Ismael García-Bernete",
        "Françoise Combes",
        "Richard Davies",
        "Enrique Lopez-Rodriguez",
        "Omaira González-Martín",
        "Cristina Ramos Almeida",
        "Anelise Audibert",
        "Erin K. S. Hicks",
        "Miguel Querejeta",
        "Claudio Ricci",
        "Enrica Bellocchi",
        "Peter Boorman",
        "Andrew J. Bunker",
        "Steph Campbell",
        "Daniel E. Delaney",
        "Tanio Díaz-Santos",
        "Donaji Esparza-Arredondo",
        "Sebastian Hönig",
        "Álvaro Labiano Ortega",
        "Nancy A. Levenson",
        "Chris Packham",
        "Miguel Pereira-Santaella",
        "Rogemar A. Riffel",
        "Dimitra Rigopoulou",
        "David J. Rosario",
        "Antonio Usero",
        "Lulu Zhang"
      ],
      "abstract": "Galaxy Activity, Torus and Outflow Survey (GATOS) X: Molecular gas clumpiness under the influence of AGN Federico Esposito, Almudena Alonso-Herrero, Santiago García-Burillo, Ismael García-Bernete, Françoise Combes, Richard Davies, Enrique Lopez-Rodriguez, Omaira González-Martín, Cristina Ramos Almeida, Anelise Audibert, Erin K. S. Hicks, Miguel Querejeta, Claudio Ricci, Enrica Bellocchi, Peter Boorman, Andrew J. Bunker, Steph Campbell, Daniel E. Delaney, Tanio Díaz-Santos, Donaji Esparza-Arredondo, Sebastian Hönig, Álvaro Labiano Ortega, Nancy A. Levenson, Chris Packham, Miguel Pereira-Santaella, Rogemar A. Riffel, Dimitra Rigopoulou, David J. Rosario, Antonio Usero, Lulu Zhang 14 pages, 13 figures, accepted for publication by Astronomy & Astrophysics Astrophysics of Galaxies (astro-ph.GA) The distribution of molecular gas on small scales regulates star formation and the growth of supermassive black holes in galaxy centers, yet the role of active galactic nuclei (AGN) feedback in shaping this distribution remains poorly constrained. We investigate how AGN influence the small-scale structure of molecular gas in galaxy centers, by measuring the clumpiness of CO(3 - 2) emission observed with the Atacama Large Millimeter/submillimeter Array (ALMA) in the nuclear regions (50 - 200 pc from the AGN) of 16 nearby Seyfert galaxies from the Galaxy Activity, Torus, and Outflow Survey (GATOS). To quantify clumpiness, we apply three different methods: (1) the median of the pixel-by-pixel contrast between the original and smoothed maps; (2) the ratio of the total excess flux to the total flux, after substracting the background smoothed emission; and (3) the fraction of total flux coming from clumpy regions, interpreted as the mass fraction in clumps. We find a negative correlation between molecular gas clumpiness and AGN X-ray luminosity (L_X), suggesting that higher AGN activity is associated with smoother gas distributions. All methods reveal a turnover in this relation around L_X = 10^{42} erg/s, possibly indicating a threshold above which AGN feedback becomes efficient at dispersing dense molecular structures and suppressing future star formation. Our findings provide new observational evidence that AGN feedback can smooth out dense gas structures in galaxy centers.",
      "pdf_url": "https://arxiv.org/pdf/2510.18957.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18964",
      "title": "Dark Matter profiles of \"in silico\" galaxies: deep learning inference",
      "authors": [
        "Martín de los Rios",
        "Serafina Di Gioia",
        "Fabio Iocco",
        "Roberto Trotta"
      ],
      "abstract": "Dark Matter profiles of \"in silico\" galaxies: deep learning inference Martín de los Rios, Serafina Di Gioia, Fabio Iocco, Roberto Trotta Astrophysics of Galaxies (astro-ph.GA); Data Analysis, Statistics and Probability (physics.data-an) Machine learning has the potential to improve the reconstruction of the dark matter profile of galaxies with respect to traditional methods, like rotation curves. We demonstrate on the simulation suite Illustris-TNG that a steerable equivariant convolutional neural network (CNN) is able to infer the dark matter profiles within and around individual galaxies from photometric and interferometric data, improving on a standard CNN. Within the in silico environment of the simulations, our architecture is able to capture the dark matter distribution within galaxies without a parametrization of the profile. We perform an interpretability analysis to understand the internal mechanisms of the trained model and the most important data features used to estimate the dark matter profiles. The equivariant CNN recovers the dark matter profile of galaxies within the stellar mass range $[10^{10} - 10^{12} ]$ $M_{\\odot}$ with excellent precision and accuracy: the mean squared error is reduced by a factor of ~ 3 from its value under the training distribution, demonstrating that the network has learnt from the data features. While this holds within the controlled 'in silico' environment of the simulation, we argue that few additional steps are needed before this method can be reliably applied to galaxies in the real field observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.18964.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18971",
      "title": "Accreted stars and stellar haloes of simulated galaxies in TNG50",
      "authors": [
        "Bruno M. Celiz",
        "Julio F. Navarro",
        "Mario G. Abadi"
      ],
      "abstract": "Accreted stars and stellar haloes of simulated galaxies in TNG50 Bruno M. Celiz, Julio F. Navarro, Mario G. Abadi 10 pages, 9 figures. Accepted for publication in Astronomy & Astrophysics (A&A) Astrophysics of Galaxies (astro-ph.GA) We use the TNG50 cosmological hydrodynamic simulation to study the accreted stellar component and stellar haloes of isolated galaxies spanning a wide range of masses ($10^8<M_*/M_\\odot<10^{11}$). We find that stars formed in the main progenitor (i.e., in-situ stars) typically dominate the inner regions as far as $\\sim$10 half-light radii from the centre, implying that detecting uncontrovertible evidence for the presence of an accreted stellar halo requires probing the far outskirts of a galaxy. Stars from accreted, disrupted satellites (i.e., ex-situ stars) dominate beyond that radius (roughly $25\\%$ of the virial radius, $r_{200}$), which we identify as the inner boundary of the outer stellar halo. The fraction of accreted stars decreases monotonically with decreasing galaxy mass, $M_*$, from $\\sim$$20\\%$ on average in $\\sim$$2\\times 10^{12}\\, M_\\odot$ haloes ($M_*\\sim$$10^{11}\\, M_\\odot$) to $2$-$3\\%$ in $\\sim$$2\\times 10^{10}\\, M_\\odot$ haloes ($M_*\\sim$$10^{8}\\, M_\\odot$). The outer halo has a mass comparable to roughly $10\\%$ of all accreted stars. Fewer than $\\sim$$30\\%$ of stars in the outer halo are in-situ stars, many of which originate from star-forming satellites during the late stages of disruption, especially in low-mass systems. Accreted stars are systematically more metal poor in less massive systems, which makes the outer haloes of dwarf galaxies a fertile hunting ground for extremely metal-poor stars. At given galaxy mass, the more massive stellar haloes are systematically more concentrated (smaller $R_{\\rm eff}$) and have steeper density profiles (larger $n$). Our results provide a blueprint for interpreting observations of the outskirts of isolated galaxies in terms of their assembly histories.",
      "pdf_url": "https://arxiv.org/pdf/2510.18971.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18985",
      "title": "Resolving the Nuclear Environments of Tidal Disruption Event Host Galaxies within 45 pc",
      "authors": [
        "Megan Newsome",
        "Iair Arcavi",
        "K. Decker French",
        "Curtis McCully",
        "Ann Zabludoff",
        "Nicholas Stone",
        "Sjoert van Velzen",
        "Tinggui Wang"
      ],
      "abstract": "Resolving the Nuclear Environments of Tidal Disruption Event Host Galaxies within 45 pc Megan Newsome, Iair Arcavi, K. Decker French, Curtis McCully, Ann Zabludoff, Nicholas Stone, Sjoert van Velzen, Tinggui Wang 15 pages, 6 figures. Accepted to ApJ Astrophysics of Galaxies (astro-ph.GA) Using HST/STIS observations, we present the highest-spatial-resolution spectroscopic study to date of four tidal disruption event (TDE) host galaxies, with the best observed being the post-starburst (PSB) host of ASASSN-14li. The stellar population of ASASSN-14li's host, within 44 pc of the nucleus, reveals a younger recent starburst ($\\sim$340 Myr) compared to the population at an offset radius of 88 pc that excludes the nucleus ($\\sim$550 Myr), a radial age gradient suggesting gas inflows from a minor merger. We estimate a stellar density of $\\sim5900 \\pm 800 \\, M_\\odot / \\mathrm{pc}^3$ within 30 pc of the nucleus of ASASSN-14li's host, exceeding densities expected for nuclear star clusters. High-ionization ``coronal\" emission lines, [Fe VI] $\\lambda 5677$, [Fe VII] $\\lambda 6087$, and [Fe X] $\\lambda 6375$, are also detected within the nuclear spectra of the hosts of ASASSN-14li and PTF09ge, importantly alongside the non-detection of [O III] at the same scale. We similarly do not detect [O III] in the nuclear region of ASASSN-14ae's host despite its presence in the SDSS spectrum. The different ionization radiation levels detected at various radii from TDE host nuclei may indicate echoes of earlier accretion episodes, including, potentially, a prior TDE. We posit that a minor merger driving gas inflow to the nucleus could drive the enhanced TDE rates in post-starburst galaxies, inducing variation in nuclear gas properties and star formation history on $<$150 pc scales in TDE hosts.",
      "pdf_url": "https://arxiv.org/pdf/2510.18985.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19016",
      "title": "Modeling the Optical Colors of Galactic Cirrus Clouds in the Stripe 82 Region",
      "authors": [
        "Kwang-Il Seon",
        "Jongwan Ko",
        "Woowon Byun",
        "Jaehyun Lee",
        "Young-Soo Jo"
      ],
      "abstract": "Modeling the Optical Colors of Galactic Cirrus Clouds in the Stripe 82 Region Kwang-Il Seon, Jongwan Ko, Woowon Byun, Jaehyun Lee, Young-Soo Jo Accepted for publications in AJ; 15 pages, 10 figures Astrophysics of Galaxies (astro-ph.GA) Observations have shown that the optical colors of Galactic cirrus clouds differ significantly from those of extragalactic sources; thus, they can be used to distinguish Galactic cirrus from extragalactic low surface brightness (LSB) features. To understand these properties, we calculate radiative transfer models in dust clouds, where photons are incident from the ambient interstellar medium (ISM). Dust clouds are modeled to mimic a turbulent medium using a fractional Brownian motion algorithm, resulting in a lognormal density distribution and a power-law power spectral density that are appropriate for the ISM. The results are compared with optical observations of cirrus clouds in the Stripe 82 region. The observed color--color ($g-r$, $r-i$, and $i-z$) diagrams of the cirrus clouds can be reproduced by scattered light if the interstellar radiation field (ISRF) of Mathis et al. (as updated by Draine) is modified, either by reducing the intensities in the $i$ and $z$ bands or by enhancing those in the $g$ and $r$ bands. Similar results can also be obtained by adjusting the scattering albedos at the corresponding wavelengths. This demonstrates that the color--color diagrams are effective not only for identifying extragalactic LSB features but also for studying the ISRF and the properties of interstellar dust.",
      "pdf_url": "https://arxiv.org/pdf/2510.19016.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19044",
      "title": "The slope and scatter of the star forming main sequence at z~5 : reconciling observations with simulations",
      "authors": [
        "Claudia Di Cesare",
        "Jorryt Matthee",
        "Rohan P. Naidu",
        "Alberto Torralba",
        "Gauri Kotiwale",
        "Ivan G. Kramarenko",
        "Jeremy Blazoit",
        "Joakim Rosdahl",
        "Joel Leja",
        "Edoardo Iani",
        "Angela Adamo",
        "Alba Covelo-Paz",
        "Lukas J. Furtak",
        "Kasper E. Heintz",
        "Sara Mascia",
        "Benjamín Navarrete",
        "Pascal A. Oesch",
        "Michael Romano",
        "Irene Shivaei",
        "Sandro Tacchella"
      ],
      "abstract": "The slope and scatter of the star forming main sequence at z~5 : reconciling observations with simulations Claudia Di Cesare, Jorryt Matthee, Rohan P. Naidu, Alberto Torralba, Gauri Kotiwale, Ivan G. Kramarenko, Jeremy Blazoit, Joakim Rosdahl, Joel Leja, Edoardo Iani, Angela Adamo, Alba Covelo-Paz, Lukas J. Furtak, Kasper E. Heintz, Sara Mascia, Benjamín Navarrete, Pascal A. Oesch, Michael Romano, Irene Shivaei, Sandro Tacchella Main text 15 pages with 11 figures. Figure 7 shows the key measurements and Fig 8 model inference. Submitted to A&A. Comments welcome Astrophysics of Galaxies (astro-ph.GA) Galaxies exhibit a tight correlation between their star-formation rate and stellar mass over a wide redshift range known as the star-forming main sequence (SFMS). With JWST, we can now investigate the SFMS at high redshifts down to masses of $\\sim10^6$ M$_{\\odot}$, using sensitive star-formation rate tracers such as H$\\alpha$ emission -- which allow us to probe the variability in star formation histories. We present inferences of the SFMS based on 316 H$\\alpha$-selected galaxies at $z\\sim4$-$5$ with $\\log(\\rm M_\\star/M_\\odot) = 6.4$ -$10.6$. These galaxies were identified behind the Abell 2744 lensing cluster with NIRCam grism spectroscopy from the ``All the Little Things'' (ALT) survey. At face value, our data suggest a shallow slope of the SFMS (SFR $\\propto \\mathrm{M}_\\star^\\alpha$, with $\\alpha=0.45$). After correcting for the H$\\alpha$-flux limited nature of our survey using a Bayesian framework, the slope steepens to $\\alpha = 0.59^{+0.10}_{-0.09}$, whereas current data on their own are inconclusive on the mass dependence of the scatter. These slopes differ significantly from the slope of $\\approx1$ expected from the observed evolution of the galaxy stellar mass function and from simulations. When fixing the slope to $\\alpha=1$, we find evidence for a decreasing intrinsic scatter with stellar mass (from $\\approx 0.5$ dex at M$_\\star=10^8$ M$_\\odot$ to $0.4$ dex at M$_\\star=10^{10}$ M$_\\odot$). This tension might be explained by a (combination of) luminosity-dependent SFR(H$\\alpha$) calibration, a population of (mini)-quenched low-mass galaxies, or underestimated dust attenuation in high-mass galaxies. Future deep observations across facilities can quantify these processes, enabling better insights into the variability of star formation histories.",
      "pdf_url": "https://arxiv.org/pdf/2510.19044.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19087",
      "title": "The dynamics of S-stars and G-sources orbiting a supermassive compact object made of fermionic dark matter",
      "authors": [
        "Valentina Crespi",
        "Carlos R. Argüelles",
        "Eduar A. Becerra-Vergara",
        "Martín F. Mestre",
        "Florian Peissker",
        "Jorge A. Rueda",
        "Remo Ruffini"
      ],
      "abstract": "The dynamics of S-stars and G-sources orbiting a supermassive compact object made of fermionic dark matter Valentina Crespi, Carlos R. Argüelles, Eduar A. Becerra-Vergara, Martín F. Mestre, Florian Peissker, Jorge A. Rueda, Remo Ruffini 13 pages, 11 figures, 5 tables. Version accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Surrounding Sgr A*, a cluster of young and massive stars coexist with a population of dust-enshrouded objects, whose astrometric data can be used to scrutinize the nature of Sgr A*. An alternative to the black hole (BH) scenario has been recently proposed in terms of a supermassive compact object composed of self-gravitating fermionic dark matter (DM). Such horizon-less configurations can reproduce the relativistic effects measured for S2 orbit, while being part of a single continuous configuration whose extended halo reproduces the latest GAIA-DR3 rotation curve. In this work, we statistically compare different fermionic DM configurations aimed to fit the astrometric data of S2, and five G-sources, and compare with the BH potential when appropriate. We sample the parameter spaces via Markov Chain Monte Carlo statistics and perform a quantitative comparison estimating Bayes factors for models that share the same likelihood function. We extend previous results of the S2 and G2 orbital fits for 56 keV fermions (low core-compactness) and show the results for 300 keV fermions (high core-compactness). For the selected S2 dataset, the former model is slightly favoured over the latter. However, more precise S2 datasets, as obtained by the GRAVITY instrument, remain to be analysed in light of the fermionic models. For the G-objects, no conclusive preference emerges between models. For all stellar objects tested, the BH and fermionic models predict orbital parameters that differ by less than 1%. More accurate data, particularly from stars closer to Sgr A*, is necessary to statistically distinguish between the models considered.",
      "pdf_url": "https://arxiv.org/pdf/2510.19087.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19258",
      "title": "On the origins, growth, and radiative efficiency of J0529-4351, reportedly the fastest-growing known black hole",
      "authors": [
        "Yash Aggarwal"
      ],
      "abstract": "On the origins, growth, and radiative efficiency of J0529-4351, reportedly the fastest-growing known black hole Yash Aggarwal Astrophysics of Galaxies (astro-ph.GA) SMSS J0521-4351 is reportedly the most luminous quasar known to date, and assuming a mean radiative efficiency of 0.1, it is inferred to be the fastest-growing black hole, accreting approximately one solar mass per day. Assessing the implications of this assumption on the seed mass and inception time of J0529-4351, we show that the inferred accretion rate is unreasonably high and that its radiative efficiency must be much greater than 0.1. Then, we derive its accretion rate and seed mass, and for comparison of three other similar-size (~1-2E+10 solar masses) black holes at various redshifts, using well-tested empirical scaling relations. The results indicate that J0529-4351 grew from a heavy seed (~2-3E+04 solar masses), and that its accretion rate (~10-13 solar masses/year) is the lowest of the four black holes. However, its radiative efficiency inferred from its bolometric luminosity and the derived accretion rate is the highest, which explains why it is the most luminous despite having the lowest accretion rate. This study challenges the prevailing notion that a higher luminosity or a higher Eddington ratio implies a higher accretion rate, highlights the dependence of a black hole's luminosity on radiative efficiency, reveals the pitfalls of inferring black hole properties assuming a standard value for radiative efficiency, and suggests that the Eddington ratios of high-luminosity BHs may be significantly overestimated.",
      "pdf_url": "https://arxiv.org/pdf/2510.19258.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19409",
      "title": "Modeling Globular Cluster Counts with Bayesian Latent Models",
      "authors": [
        "Rafael S. de Souza",
        "Ana L. Chies-Santos"
      ],
      "abstract": "Modeling Globular Cluster Counts with Bayesian Latent Models Rafael S. de Souza, Ana L. Chies-Santos Accepted in Research Notes of AAS Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a Bayesian latent model to describe the scaling relation between globular cluster populations and their host galaxies, updating the framework proposed in de Souza 2015. GC counts are drawn from a negative-binomial (NB) process linked to host stellar mass, augmented with a newly introduced Gaussian observation layer that enables efficient propagation of measurement errors. The revised formulation preserves the underlying NB process while improving computational tractability. The code snippets, implemented in Nimble and PyMC are released under the MIT license at this https URL",
      "pdf_url": "https://arxiv.org/pdf/2510.19409.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19466",
      "title": "WALLABY: an untargeted search for H I-bearing ultra-diffuse galaxies uncovers the first known ultra-diffuse galaxy pair",
      "authors": [
        "T. O'Beirne",
        "V. A. Kilborn",
        "M. E. Cluver",
        "O. I. Wong",
        "N. Deg",
        "K. Spekkens",
        "N. Arora",
        "R. Dudley",
        "B. Catinella",
        "H. Dénes",
        "K. Lee-Waddell",
        "P. E. Mancera Piña",
        "C. Murugeshan",
        "J. Rhee",
        "L. Staveley-Smith",
        "A. X. Shen",
        "T. Westmeier"
      ],
      "abstract": "WALLABY: an untargeted search for H I-bearing ultra-diffuse galaxies uncovers the first known ultra-diffuse galaxy pair T. O'Beirne, V. A. Kilborn, M. E. Cluver, O. I. Wong, N. Deg, K. Spekkens, N. Arora, R. Dudley, B. Catinella, H. Dénes, K. Lee-Waddell, P. E. Mancera Piña, C. Murugeshan, J. Rhee, L. Staveley-Smith, A. X. Shen, T. Westmeier 14 pages, 8 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Using the Widefield ASKAP L-band Legacy All-sky Blind surveY (WALLABY) we performed an untargeted search for H I-bearing ultra-diffuse galaxies (UDGs). We identified a core sample of 10 UDGs defined by $\\mu_{g,0}\\ge24$ mag arcsec$^{-2}$ and $R_{e}\\ge1.5$ kpc, and a broader sample including 12 additional faint diffuse galaxies ($\\mu_{g,0}\\ge23.7$ mag arcsec$^{-2}$ and $R_{e}\\ge1.3$ kpc). Within the core sample, we highlight the first discovery of a UDG pair. Their projected separation is just 75 arcsec (22 kpc at 61.9 Mpc), with a central H I velocity difference of 34 km s$^{-1}$. The North-Western UDG (WALLABY J104513-262755-UDG-1) has a larger H I reservoir, $\\log_{10}(M_{HI}/\\rm M_{\\odot}) = 8.95\\pm0.03$, compared to the South-Eastern UDG (WALLABY J104513-262755-UDG-2), $\\log_{10}(M_{HI}/\\rm M_{\\odot}) = 8.60\\pm0.04$. UDG-1's stellar mass and star formation rate are also approximately an order of magnitude larger at $\\log_{10}(M_*/\\rm M_{\\odot}) = 8.07\\pm0.12$ and $\\log_{10}(SFR/\\rm M_{\\odot}~yr^{-1}) = -1.26\\pm0.12$ respectively. The pair has an isolated local environment, with no other galaxies or H I sources within 30 arcmin (525 kpc) and $\\pm1000$ km s$^{-1}$. However, in the context of the larger-scale structure, the pair is located outside the virial radius of the Hydra cluster, with its position on the phase-space diagram indicating that it is infalling into the cluster. The identification of this H I-bearing UDG pair raises important questions around the formation of such a unique system and the evolution of UDGs in a transitional phase before ram pressure stripping and cluster infall.",
      "pdf_url": "https://arxiv.org/pdf/2510.19466.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19500",
      "title": "XRISM mock observations of simulated AGN jets in the core of a galaxy cluster",
      "authors": [
        "Mahiro Shirotori",
        "Yutaka Fujita"
      ],
      "abstract": "XRISM mock observations of simulated AGN jets in the core of a galaxy cluster Mahiro Shirotori, Yutaka Fujita Submitted to PASJ, 8 pages, 4 figures, 3 tables Astrophysics of Galaxies (astro-ph.GA) Jets from active galactic nuclei (AGNs) are expected to heat the surrounding intracluster medium (ICM). We investigate how the interaction between jets and the ICM appears in high-resolution X-ray observations using mock X-ray observations based on two-dimensional hydrodynamic simulations. We constructed a model of an active galactic nucleus (AGN) similar to Cygnus A (Cyg A), a powerful FR II radio galaxy. Our simulations model bipolar jets propagating into a stratified ICM, forming forward shocks and low-density cocoons. Based on these results, we generate synthetic spectra that incorporate both shocked and unshocked ICM components. Then, we perform mock observations using the XRISM/Resolve X-ray spectrometer. We focus particularly on viewing angle effects. Our mock observations revealed that the smallest line broadening, observed as velocity dispersion, associated with the cocoon's bulk expansion occurs when observing along the jet direction, where the expansion velocity is highest. Although this may appear counterintuitive, it occurs because the rapidly expanding jet head contributes little to X-ray emission due to its high temperature and low density. Our results highlight the importance of considering the temperature and density structure of AGN-driven shocks and cocoons when interpreting XRISM data. These findings lay the groundwork for XRISM's observations of AGN jets and will improve our understanding of AGN feedback processes in galaxy clusters.",
      "pdf_url": "https://arxiv.org/pdf/2510.19500.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19673",
      "title": "Beyond single tracers: CNN-based inference of galaxy mass profiles from combined gas and stellar kinematics",
      "authors": [
        "Julen Expósito-Márquez",
        "Arianna Di Cintio",
        "Chris Brook",
        "Jorge Sarrato-Alós",
        "Andrea V. Macciò"
      ],
      "abstract": "Beyond single tracers: CNN-based inference of galaxy mass profiles from combined gas and stellar kinematics Julen Expósito-Márquez, Arianna Di Cintio, Chris Brook, Jorge Sarrato-Alós, Andrea V. Macciò Astrophysics of Galaxies (astro-ph.GA) We investigate whether combining gas and stellar kinematic maps provides measurable advantages in recovering galaxy mass profiles, compared to using single-component maps alone. While traditional methods struggle to integrate multi-tracer data effectively, we test whether deep learning models can leverage this joint information. We develop a probabilistic convolutional neural network (CNN) framework trained and tested on mock galaxy kinematic maps from multiple cosmological simulation suites. Our model is trained on gas-only, stars-only, and combined gas+stellar velocity maps, allowing direct comparison of performance across tracers. To assess robustness, we include simulations with differing feedback models and galaxy properties. Combining gas and stellar maps reduces the dispersion in the inferred mass profiles by up to a factor of $\\sim$1.5 compared to models using either tracer independently. The CNN architecture effectively captures complementary information from the two components. However, we find limitations in generalizing between simulation suites, with reduced performance when applying models trained on one suite to galaxies from another.",
      "pdf_url": "https://arxiv.org/pdf/2510.19673.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18965",
      "title": "Intermediate-Mass Stripped Stars in the Magellanic Clouds: Forward Modeling the Observed Population Discovered Via UV Excess",
      "authors": [
        "Lisa Blomberg",
        "Kareem El-Badry",
        "Bethany Ludwig",
        "Maria Drout",
        "Ylva Gotberg"
      ],
      "abstract": "Intermediate-Mass Stripped Stars in the Magellanic Clouds: Forward Modeling the Observed Population Discovered Via UV Excess Lisa Blomberg, Kareem El-Badry, Bethany Ludwig, Maria Drout, Ylva Gotberg 29 pages, 19 figures, submitted to PASP Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Stripped stars are hot, helium-rich stars formed when binary interactions remove a star's hydrogen envelope. While low-mass ($\\lesssim 1\\,M_\\odot$) and high-mass ($\\gtrsim 8\\,M_\\odot$) stripped stars are well studied as hot subdwarfs and Wolf-Rayet stars, their intermediate-mass counterparts ($1-8 \\,M_\\odot$) have only recently been discovered. The Stripped-Star Ultraviolet Magellanic Cloud Survey (SUMS) identified UV-excess sources in the Magellanic Clouds using Swift-UVOT photometry and selected 820 photometric stripped-star candidates. However, the selection function, completeness, and purity of this sample remain poorly understood. We forward model the population of stripped stars in the Magellanic Clouds using a binary population synthesis model combined with spatially resolved star formation histories and simulated UV photometry. To assess survey sensitivity, we inject simulated sources into real Swift-UVOT images and reproduce the SUMS selection process, including crowding, extinction, and photometric quality cuts. We recover $\\sim 250$ simulated stripped stars with masses $\\gtrsim 1\\,M_{\\odot}$, which corresponds to a recover rate of $9-13\\,\\%$. The rest are missed due to dilution by luminous companions, crowding, and high extinction. The observed population is biased toward systems with low-mass companions formed by common envelope evolution and toward systems with compact object companions. Of the stripped stars which show UV excess, $25-45\\,\\%$ are identifiable by SUMS; higher-resolution data or improved reddening corrections are needed to detect the rest. We predict contamination of the observed stripped star candidates by main-sequence stars with spurious UV excess due to crowding and provide guidelines for selecting higher-purity subsamples. These results enable tests of binary evolution models and realistic comparison of observed and simulated stripped-star populations.",
      "pdf_url": "https://arxiv.org/pdf/2510.18965.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19635",
      "title": "FAUST. XXVIII. High-Resolution ALMA Observations of Class 0/I Disks: Structure, Optical Depths, and Temperatures",
      "authors": [
        "M.J. Maureira",
        "J.E. Pineda",
        "H. B. Liu",
        "P. Caselli",
        "C. Chandler",
        "L. Testi",
        "D. Johnstone",
        "D. Segura-Cox",
        "L. Loinard",
        "E. Bianchi",
        "C. Codella",
        "A. Miotello",
        "L. Podio",
        "L. Cacciapuoti",
        "Y. Oya",
        "A. Lopez-Sepulcre",
        "N. Sakai",
        "Z. Zhang",
        "N. Cuello",
        "S. Ohashi",
        "Y. Aikawa",
        "G. Sabatini",
        "Y. Zhang",
        "C. Ceccarelli",
        "S. Yamamoto"
      ],
      "abstract": "FAUST. XXVIII. High-Resolution ALMA Observations of Class 0/I Disks: Structure, Optical Depths, and Temperatures M.J. Maureira, J.E. Pineda, H. B. Liu, P. Caselli, C. Chandler, L. Testi, D. Johnstone, D. Segura-Cox, L. Loinard, E. Bianchi, C. Codella, A. Miotello, L. Podio, L. Cacciapuoti, Y. Oya, A. Lopez-Sepulcre, N. Sakai, Z. Zhang, N. Cuello, S. Ohashi, Y. Aikawa, G. Sabatini, Y. Zhang, C. Ceccarelli, S. Yamamoto 31 pages, 15 figures, Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We present high-resolution (~7.5 au) ALMA observations at 1.3 and 3 mm of 16 disks around Class 0/I protostars across multiple star-forming regions and a variety of multiplicities, showing a range of disk sizes (~2-100 au) and including circumbinary disks (CBDs) in binaries with separations <100 au. The disk properties show similarities to Class II disks, including (a) low spectral index (SI) values (alpha=2.1) that increase with disk radius, (b) 3 mm disk sizes only marginally smaller than at 1.3 mm (<10%), and (c) radial intensity profiles well described by modified self-similar profiles. We also find key differences: (i) SI values increasing with radius, but exceeding 2 only at the disk edge (ii) higher brightness temperatures Tb, in some cases higher than the predicted temperatures due to irradiation, and (iii) ~10x higher luminosity at a given size compared to the Class II disks. These results confirm significant optical depth in the observed Class 0/I disks, at both 1.3 and 3 mm, helping to explain their higher luminosities, but higher temperatures are also required for the most compact (< 40 au) disks, suggesting additional viscous heating. Considering optical depth, most disk dust masses are estimated in the range 30-900 Mearth (0.01-0.3 Msun in gas), resulting in some disks reaching marginal gravitational instability. The median location of the water iceline is ~3 au, but it can extend beyond 10-20 au for the hottest disks. CBDs exhibit lower optical depths at both wavelengths and hence higher SI values (alpha=3.0), dust masses of 100 Mearth, and beta~1.5 (2 Class 0 CBDs) and beta~1 (1 Class I CBD), suggesting substantial grain growth only in the more evolved CBD. The inferred high optical depths provide a compelling explanation for the apparent scarcity of dust substructures in the younger disks at ~ 1 mm, despite mounting evidence for early planet formation (ABRIDGED).",
      "pdf_url": "https://arxiv.org/pdf/2510.19635.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19686",
      "title": "Collisional Excitation in Space: Recent Advances and Future Challenges in the JWST Era",
      "authors": [
        "Francesca Tonolo"
      ],
      "abstract": "Collisional Excitation in Space: Recent Advances and Future Challenges in the JWST Era Francesca Tonolo perspective article, 19 pages, 2 tables, 1 figure Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); Chemical Physics (physics.chem-ph); Computational Physics (physics.comp-ph) This perspective offers a viewpoint on how the challenges of molecular scattering investigations of astrophysical interest have evolved in recent years. Computational progress has steadily expanded collisional databases and provided essential tools for modeling non-LTE astronomical regions. However, the observational leap enabled by the JWST and new observational facilities has revealed critical gaps in these databases. In this framework, two major frontiers emerge: the characterization of collisional processes involving heavy projectiles, and the treatment of ro-vibrational excitation. The significant computational effort of these investigations emphasizes the need to test and develop robust theoretical methods and approximations, capable of extending the census of collisional coefficients required for reliable astrophysical modeling. Recent developments in these directions are outlined, with particular attention to their application and their potential to broaden the coverage of molecular systems and physical environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.19686.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.13838",
      "title": "Cool dark gas in Cygnus X: The first large-scale mapping of low-frequency carbon recombination lines",
      "authors": [
        "Kimberly L. Emig",
        "Pedro Salas",
        "Loren D. Anderson",
        "D. Anish Roshi",
        "Lars Bonne",
        "Alberto D. Bolatto",
        "Isabelle A. Grenier",
        "Rebecca C. Levy",
        "Dylan J. Linville",
        "Matteo Luisi",
        "M. Riley Owens",
        "J. Poojapriyatharsheni",
        "Nicola Schneider",
        "Luigi Tibaldo",
        "Alexander G. G. M. Tielens",
        "Stefanie K. Walch",
        "Glenn J. White"
      ],
      "abstract": "Cool dark gas in Cygnus X: The first large-scale mapping of low-frequency carbon recombination lines Kimberly L. Emig, Pedro Salas, Loren D. Anderson, D. Anish Roshi, Lars Bonne, Alberto D. Bolatto, Isabelle A. Grenier, Rebecca C. Levy, Dylan J. Linville, Matteo Luisi, M. Riley Owens, J. Poojapriyatharsheni, Nicola Schneider, Luigi Tibaldo, Alexander G. G. M. Tielens, Stefanie K. Walch, Glenn J. White 26 pages. 13 figures. accepted ApJ Astrophysics of Galaxies (astro-ph.GA) Understanding the transition from atomic gas to molecular gas is critical to explain the formation and evolution of molecular clouds. However, the gas phases involved, cold HI and CO-dark molecular gas, are challenging to directly observe and physically characterize. We observed the Cygnus X star-forming complex in carbon radio recombination lines (CRRLs) at 274--399 MHz with the Green Bank Telescope at 48' (21 pc) resolution. Of the 30 deg$^2$ surveyed, we detect line-synthesized C273$\\alpha$ emission from 24 deg$^2$ and produce the first large-area maps of low-frequency CRRLs, which likely originate in CO-dark molecular gas. The morphology of the C273$\\alpha$ emission reveals arcs, ridges, and extended possibly sheet-like gas which are often on the outskirts of CO emission. We find a correlation between velocity-integrated C273$\\alpha$ and the 8 $\\mu$m intensity with a power-law slope of $1.3 \\pm 0.2$. We interpret the relation as the dependence of cool dark gas emission on the FUV radiation field, $G_0 \\approx 40 - 160$. We determine the typical angular separation between C273$\\alpha$ and $^{13}$CO emission to be 12 pc. Velocity differences between C273$\\alpha$ and $^{13}$CO are apparent throughout the region and have a typical value of 2.9 km s$^{-1}$. We estimate gas densities of $n \\approx 20 - 900$ cm$^{-3}$ with a nominal $n \\approx 400$ cm$^{-3}$ in the C$^{+}$/H$_2$ layer. The evolution of the C273$\\alpha$ gas seems to be dominated by turbulent pressure, with a characteristic timescale to form H$_2$ of about 2.6 Myr. These observations underline the richness of low-frequency CRRLs to provide revelatory insights into the characteristics of (CO-)dark gas and the evolution of molecular gas.",
      "pdf_url": "https://arxiv.org/pdf/2501.13838.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.15340",
      "title": "WALLABY Pilot Survey: A gas-rich diffuse dwarf on the baryonic Tully Fisher relation",
      "authors": [
        "Rebecca Dudley",
        "N. Deg",
        "Kristine Spekkens",
        "N. Arora",
        "T. O'Beirne",
        "V. Kilborn",
        "B. Catinella",
        "Pavel E. Mancera Piña"
      ],
      "abstract": "WALLABY Pilot Survey: A gas-rich diffuse dwarf on the baryonic Tully Fisher relation Rebecca Dudley, N. Deg, Kristine Spekkens, N. Arora, T. O'Beirne, V. Kilborn, B. Catinella, Pavel E. Mancera Piña 14 pages, 6 figures, submitted to ApJL Astrophysics of Galaxies (astro-ph.GA) Diffuse dwarf galaxies, and particularly ultra diffuse galaxies (UDGs), challenge our understanding of galaxy formation and the role of dark matter due to their large sizes, low surface brightness, and varying dark matter content. In this work, we investigate the gas-rich diffuse dwarf galaxy WALLABY J125956-192430 (aka. KK176) using high-resolution HI data from the WALLABY survey. We produce the most reliable kinematic model for KK176 to date. Using this model, the derived mass decomposition shows that KK176 is dark matter dominated. We also place KK176 on the baryonic Tully-Fisher relation (bTFR), finding that it is consistent with low-mass dwarf galaxies but distinctly different from reported dark matter-deficient UDGs.",
      "pdf_url": "https://arxiv.org/pdf/2509.15340.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24555",
      "title": "M3DIS -- A grid of 3D radiation-hydrodynamics stellar atmosphere models for stellar surveys. II. Carbon-enhanced metal-poor stars",
      "authors": [
        "Philipp Eitner",
        "Maria Bergemann",
        "Richard Hoppe",
        "Nicholas Storm",
        "Veronika Lipatova",
        "Simon C. O. Glover",
        "Ralf S. Klessen",
        "Åke Nordlund",
        "Andrius Popovas"
      ],
      "abstract": "M3DIS -- A grid of 3D radiation-hydrodynamics stellar atmosphere models for stellar surveys. II. Carbon-enhanced metal-poor stars Philipp Eitner, Maria Bergemann, Richard Hoppe, Nicholas Storm, Veronika Lipatova, Simon C. O. Glover, Ralf S. Klessen, Åke Nordlund, Andrius Popovas 16 pages, 13 figures, accepted by A&A Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Understanding the origin and evolution of carbon-enhanced metal-poor (CEMP) stars is key to tracing the Galaxy's early chemical enrichment. We investigate how realistic 3D radiation-hydrodynamics (RHD) model atmospheres affect carbon abundances in CEMP stars and implications for their classification and Galactic chemical evolution (GCE). We focus on biases from traditional 1D hydrostatic models. We use the M3DIS code to compute 3D RHD model atmospheres for main-sequence and sub-giant stars over a wide range of metallicities and carbon enhancements. Synthetic spectra of the CH G-band are calculated with 3D radiative transfer and compared to spectra from classical 1D MARCS models. We derive abundance corrections and apply them to a large SAGA database sample to quantify effects on the carbon abundance distribution and CEMP classification. Our new 3D CEMP models predict cooler upper atmospheric layers than in 1D models, resulting in stronger CH absorption and lower inferred carbon abundances by up to -0.9 dex at the lowest metallicities. Carbon enhancement in the atmosphere itself increases molecular opacities and leads to radiative re-heating, partly offsetting adiabatic cooling in 3D models and reducing 3D-1D abundance corrections. Applying these corrections lowers the CEMP fraction by up to 20% below [Fe/H]=-3 and alters the relative contribution of CEMP sub-classes. The fraction of CEMP-no stars increases while the number of CEMP-r/s stars decreases, due to the downward revision of absolute carbon abundances. These changes bring the Galactic carbon distribution into better agreement with GCE models assuming a 20% contribution from faint supernovae. Realistic model atmospheres are essential to reliably reconstruct the Galaxy's early chemical enrichment history.",
      "pdf_url": "https://arxiv.org/pdf/2509.24555.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18959",
      "title": "A spectral library and census of near-infrared stellar large-amplitude variables from Palomar Gattini-IR",
      "authors": [
        "Nicholas Earley",
        "Viraj Karambelkar",
        "Mansi Kasliwal",
        "Kishalay De",
        "Lynne Hillenbrand",
        "Roberto Soria",
        "Aswin Suresh",
        "Michael C. B. Ashley",
        "Matthew J. Hankins",
        "Anna M. Moore",
        "Jamie Soon",
        "Tony Travouillon"
      ],
      "abstract": "A spectral library and census of near-infrared stellar large-amplitude variables from Palomar Gattini-IR Nicholas Earley, Viraj Karambelkar, Mansi Kasliwal, Kishalay De, Lynne Hillenbrand, Roberto Soria, Aswin Suresh, Michael C. B. Ashley, Matthew J. Hankins, Anna M. Moore, Jamie Soon, Tony Travouillon 72 pages, 47 figures, 7 tables; Recommended for publication in PASP 2025-10-06 Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a near-infrared census of stellar large-amplitude variables (LAVs) observed by the Palomar Gattini-IR (PGIR) surveyor from 2019-2021. Over the three-year time period, PGIR performed a brightness-limited survey of the Northern sky (18,000 sq. deg) to J-band AB magnitudes of $\\sim 13$ within and $\\sim 15$ outside the Galactic plane. From 70 million stars detected in PGIR reference images, we provide a spectral and photometric library of the 128 largest amplitude stellar variables detected to median SNR > 10 for more than 50 epochs with more than 5 high-amplitude detections, peak-to-peak magnitudes $\\geq$ 2, and von Neumann ratios $\\leq$ 0.2. We obtained medium-resolution near-infrared spectra with TripleSpec on the 200-inch Hale Telescope at Palomar Observatory and SpeX at NASA's Infrared Telescope Facility. The spectral census consists of 82 evolved and dust-obscured Asymptotic Giant Branch stars, 16 R Coronae Borealis stars, 13 young-stellar or pre-main-sequence objects, 8 symbiotic binaries, 7 erratic carbon- and oxygen-rich giants, and 2 RV Tauri supergiants. The spectral and photometric dataset serves as an atlas of near-infrared LAVs and a repository of evolved stars, eruptive variables, and binary systems for future deeper infrared surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.18959.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19023",
      "title": "A very young and fast rotating shell star discovered in the eclipsing binary ZTF J200347.63+394429.8",
      "authors": [
        "Norbert Hauck"
      ],
      "abstract": "A very young and fast rotating shell star discovered in the eclipsing binary ZTF J200347.63+394429.8 Norbert Hauck 6 pages including 2 tables and 4 figures. Accepted for publication in BAV Rundbrief,vol.74, no.4, (2025) Solar and Stellar Astrophysics (astro-ph.SR) A photometric study in combination with existing stellar models has revealed details of this eclipsing post-mass-transfer binary. The shell star has an equatorial/ polar radius of ~2.60/1.90 Rsun at an equatorial rotational velocity of ~430 km s-1, an effective mean temperature Teff of ~13300 K and a mass of ~3.42 Msun. This former accretor star is surrounded by a large decretion disk of ~47 Rsun. The secondary star is a helium white dwarf precursor with a radius of 0.98 Rsun, a Teff of ~17100 K and a mass of 0.29 Msun. The parameters of this former donor star indicate an age of the binary system of only ~1.8 Myr after the end of mass transfer. The results fit to a sub-solar metallicity of Z = 0.007.",
      "pdf_url": "https://arxiv.org/pdf/2510.19023.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19125",
      "title": "Linking Magnetic Field Diagnostics with 3D CME Speeds in Solar Active Regions",
      "authors": [
        "Harshita Gandhi",
        "Huw Morgan"
      ],
      "abstract": "Linking Magnetic Field Diagnostics with 3D CME Speeds in Solar Active Regions Harshita Gandhi, Huw Morgan Accepted for publication in the Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR) Understanding how active-region properties influence coronal mass ejection (CME) dynamics is essential for constraining eruption models and improving space-weather prediction. Magnetic diagnostics derived above polarity inversion lines (PILs), including the critical height ($h_{\\rm crit}$) of torus instability onset, the overlying field strength ($B_{\\rm t}$), and ribbon flux ($R_{\\rm f}$), provide physically motivated measures of eruption onset. The two main aims of this work are to (i) show that $h_{\\rm crit}$ and $B_{\\rm t}$ can equally well predict CME speeds when evaluated over the region of interest (ROI) not directly above the PIL, and (ii) assess the value of $h_{\\rm crit}$, $B_{\\rm t}$ and $R_{\\rm f}$ in predicting CME speed. Photospheric magnetograms are modeled with potential-field extrapolations to obtain decay index profiles. Critical heights above PILs correlate strongly with 3D CME speed ($r = 0.71$). Using ROIs of $\\approx$ 1.8, 3.7, and 7.3 Mm), centered on the PIL, weighted $h_{\\rm crit}$ from the 7.3x7.3 ROI provides the strongest correlation ($r = 0.73$), while mean $B_{\\rm t}$ at 150 Mm is weaker ($r = 0.33$). Combining both offers little improvement ($r = 0.74$), confirming $h_{\\rm crit}$ as the dominant predictor. CME speed correlates moderately with $B_{\\rm t} \\times R_{\\rm f}$ ($r = 0.44$), and highest when combined with $h_{\\rm crit}$ ($r = 0.76$). Thus, in potential field models, ROI-based critical heights are as predictive as those above the PIL, indicating that the broader active-region field structure is equally valid as a diagnostic. When all parameters are considered together, $h_{\\rm crit}$ alone consistently shows the highest predictive power for CME speed.",
      "pdf_url": "https://arxiv.org/pdf/2510.19125.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19719",
      "title": "The magnetic sensitivity of the Ca II resonance and subordinate lines in the solar atmosphere",
      "authors": [
        "I. Juanikorena Berasategi",
        "E. Alsina Ballester",
        "T. del Pino Alemán",
        "J. Trujillo Bueno"
      ],
      "abstract": "The magnetic sensitivity of the Ca II resonance and subordinate lines in the solar atmosphere I. Juanikorena Berasategi, E. Alsina Ballester, T. del Pino Alemán, J. Trujillo Bueno 15 pages, 14 figures, 3 annexes. Submitted to Astronomy&Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) Aims: The polarization of the Ca II resonant doublet (H and K lines) and the subordinate infrared triplet lines are key observables for diagnosing solar chromospheric magnetism. It is thus necessary to understand the physical mechanisms that shape their Stokes profiles in magnetic environments. Methods: Using the spectral synthesis module of the HanleRT-TIC code, we study the effects of anisotropic radiation pumping with partial frequency redistribution (PRD) and J-state interference (JSI) in a plane-parallel semi-empirical static solar atmospheric model. We also analyze the sensitivity of these lines to magnetic fields of varying strengths and orientations, accounting for the combined action of the Hanle and Zeeman effects. Results: Including PRD is crucial to model the polarization in the core regions of the resonant lines, while JSI strongly affects their far wings. The metastable lower levels of the subordinate lines also influence the scattering polarization of the K line. With horizontal magnetic fields, the resonant lines respond to field strengths from sub-gauss to tens of gauss, whereas the infrared triplet scattering polarization is mainly sensitive to milligauss fields. At a near-limb line of sight (LOS) with $\\mu = 0.1$, the Hanle effect modifies the scattering polarization via a depolarization and a rotation in the plane of linear polarization. At disk center, horizontal fields generate linear polarization in the 1D model: for the K line, the Hanle effect dominates from sub-gauss to a few tens of gauss, and the Zeeman effect dominates in stronger fields. For vertical fields, the Hanle effect vanishes, but magneto-optical effects affect the linear polarization wings. Finally, atomic level polarization impacts the outer circular polarization lobes of the resonant lines, and the weak-field approximation overestimates the LOS magnetic component in this frequency range.",
      "pdf_url": "https://arxiv.org/pdf/2510.19719.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19800",
      "title": "Chromospherically active stars: Lithium and CNO abundances in northern RS CVn stars",
      "authors": [
        "B. Bale",
        "G. Tautvaisiene",
        "R. Minkeviciute",
        "A. Drazdauskas",
        "S. Mikolaitis",
        "E. Stonkute",
        "M. Ambrosch"
      ],
      "abstract": "Chromospherically active stars: Lithium and CNO abundances in northern RS CVn stars B. Bale, G. Tautvaisiene, R. Minkeviciute, A. Drazdauskas, S. Mikolaitis, E. Stonkute, M. Ambrosch Solar and Stellar Astrophysics (astro-ph.SR) Aims: We carried out a detailed investigation of Lithium and CNO abundances, including carbon isotope ratios, in RS CVn stars to assess the role of magnetic activity in the mixing of stellar atmospheres. Methods: We obtained high-resolution spectra at the Moletai Astronomical Observatory. Lithium abundances were determined by spectral synthesis of the 6707 A line and the CNO abundances using the C2 band heads at 5135 and 5635.5 A CN bands at 6470- 6490 A and 7980 to 8005 A, and the [O I] line at 6300 A. By fitting the 13CN band at 8004.7 A, we determined the carbon isotope this http URL. We determined the main atmospheric parameters and investigated the chemical composition of 32 RS CVn stars. Lithium abundances were determined for 13 additional stars using archival spectra. We report that *iot Gem and HD 179094 have carbon isotope ratios already affected by extra-mixing, even though they are in the evolutionary stage below the red giant branch luminosity bump. About half of the low-mass giants, for which the lithium abundance was determined, follow the first dredge-up predictions; however, other stars show reduced Lithium abundances, as predicted by thermohaline-induced mixing. The intermediate-mass stars show reduced Lithium abundances reduced, as predicted by rotation-induced mixing. Conclusions. In low-mass, chromospherically active RS CVn stars, extra-mixing of lithium and carbon isotopes may begin earlier than in normal giants. The Li-rich RS CVn giant V*OP And has large C/N and carbon isotope ratios and raises questions about the origin of its lithium enhancement.",
      "pdf_url": "https://arxiv.org/pdf/2510.19800.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19810",
      "title": "A Census of Chemically Peculiar Stars in Stellar Associations",
      "authors": [
        "Lukas Kueß , Ernst Paunzen Department of Astrophysics, Vienna University, Department of Theoretical Physics and Astrophysics, Faculty of Science, Masaryk University)"
      ],
      "abstract": "A Census of Chemically Peculiar Stars in Stellar Associations Lukas Kueß (1), Ernst Paunzen (2) ((1) Department of Astrophysics, Vienna University, (2) Department of Theoretical Physics and Astrophysics, Faculty of Science, Masaryk University) 30 Pages, 17 Figures, Published in MDPI Astronomy Solar and Stellar Astrophysics (astro-ph.SR) The pre-main-sequence evolution of the chemically peculiar (CP) stars on the upper main sequence is still a vast mystery and not well understood. Our analysis of young associations and open clusters aims to find (very) young CP stars to try to put a lower boundary on the age of such objects. Using three catalogues of open clusters and associations, we determined membership probabilities using HDBSCAN. The hot stars from this selection were submitted to synthetic $\\Delta a$ photometry, spectral, and light curve classification to determine which ones are CP stars and candidates. Subsequently, we used spectral energy distribution fitting and emission line analysis to check for possible PMS CP stars. The results were compared to the literature. We detected 971 CP stars and candidates {in 217 clusters and associations}. A relatively large fraction, $\\sim$10\\% of those, show characteristics of PMS CP stars. This significantly expands the known list of candidate PMS CP stars, bringing us closer to solving the mystery of their origin.",
      "pdf_url": "https://arxiv.org/pdf/2510.19810.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.11772",
      "title": "MESA-QUEST: Tracing the formation of direct collapse black hole seeds via quasi-stars",
      "authors": [
        "Andrew D. Santarelli",
        "Claire B. Campbell",
        "Ebraheem Farag",
        "Earl P. Bellinger",
        "Priyamvada Natarajan",
        "Matthew E. Caplan"
      ],
      "abstract": "MESA-QUEST: Tracing the formation of direct collapse black hole seeds via quasi-stars Andrew D. Santarelli, Claire B. Campbell, Ebraheem Farag, Earl P. Bellinger, Priyamvada Natarajan, Matthew E. Caplan 14 pages, 3 figures, submitted to the Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The origin of the first supermassive black holes (SMBHs) observed at redshifts $z\\geq 9$ remains one of the most challenging open questions in astrophysics. Their rapid emergence suggests that massive ``heavy seeds'' must have formed early, possibly through the direct collapse of pristine gas clouds in the first galaxies. We present MESA-QUEST, a new framework built upon the Modules for Experiments in Stellar Astrophysics (MESA) code, designed to model the structure and evolution of quasi-stars -- massive, radiation-supported envelopes hosting accreting black holes at their cores -- believed to be the progenitors of direct-collapse black hole (DCBH) seeds. Our implementation introduces flexible boundary conditions representing both Bondi accretion and saturated-convection regimes, and explores the impact of several stellar wind and mass-loss prescriptions, including Reimers, Dutch, and super-Eddington radiation-driven winds. We find that quasi-stars can grow central black holes to $\\geq 10^3\\,M_{\\odot}$ under favorable conditions, with saturated-convection models yielding BH-to-total mass ratios up to 0.55$M_*$ -- five times higher than Bondi-limited cases. However, strong radiation-driven winds can dramatically curtail growth, potentially quenching heavy-seed formation unless balanced by sustained envelope accretion. Our results delineate the physical limits under which quasi-stars can remain stable and produce heavy seeds capable of evolving into the earliest SMBHs detected by JWST and Chandra. Future extensions will incorporate rotation, magnetic fields, and GR-radiation hydrodynamics to refine accretion physics and constrain the viability of the quasi-star pathway for early SMBH formation.",
      "pdf_url": "https://arxiv.org/pdf/2510.11772.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.17952",
      "title": "Evolutionary Tracks and Spectral Properties of Quasi-stars and Their Correlation with Little Red Dots",
      "authors": [
        "Andrew D. Santarelli",
        "Ebraheem Farag",
        "Earl P. Bellinger",
        "Priyamvada Natarajan",
        "Rohan P. Naidu",
        "Claire B. Campbell",
        "Matthew E. Caplan"
      ],
      "abstract": "Evolutionary Tracks and Spectral Properties of Quasi-stars and Their Correlation with Little Red Dots Andrew D. Santarelli, Ebraheem Farag, Earl P. Bellinger, Priyamvada Natarajan, Rohan P. Naidu, Claire B. Campbell, Matthew E. Caplan 9 pages, 4 figures, submitted to the Astrophysical Journal Letters Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) JWST has revealed a population of red, compact, high-redshift (${z\\sim3-10}$) objects referred to as ``Little Red Dots'' (LRDs). These objects exhibit unusual spectral features reminiscent of stellar spectra with blackbody-like SEDs, large hydrogen Balmer breaks, Balmer line absorption, and classical stellar absorption features such as calcium H&K and the calcium triplet. Following the recent suggestion that these may be actively accreting direct-collapse black holes in the process of assembly, i.e. quasi-stars, we present evolutionary models of quasi-stars using our recently released, publicly available MESA-QUEST modeling framework. We compute a grid of models spanning a range of black hole masses and predict the luminosities, temperatures, surface gravities, and lifetimes of these objects. We find that these models lie along a Hayashi track once they hit their ``late-stage'' which constitutes the majority of their lives ($\\sim 20$~Myr). We present scaling relations for estimating the mass of a quasi-star as a function of the bolometric luminosity, as well as the bolometric luminosity as a function of the effective temperature for the Hayashi track. The short lifetimes in tandem with the observed number density of LRDs imply the possibility that every supermassive black hole was once a quasi-star. We compare synthetic spectra of our quasi-star models to observations of LRDs, and show that these models are broadly capable of reproducing the continuum spectra of observed LRDs. These results indicate that quasi-stars are promising candidates for the origin of supermassive black holes via direct collapse in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2510.17952.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19162",
      "title": "A Compact Multi-Planet System of Three Transiting Giant Planets Around TIC118798035",
      "authors": [
        "Rafael Brahm",
        "Trifon Trifonov",
        "Andrés Jordán",
        "Thomas Henning",
        "Néstor Espinoza",
        "Felipe I. Rojas",
        "Marcelo Tala Pinto",
        "Matías I. Jones",
        "Daniel Thorngren",
        "Lorena Acuña",
        "Jan Eberhardt",
        "Yared Reinarz",
        "Helem Salinas",
        "Michaela Vítková",
        "Juan I. Espinoza-Retamal",
        "Gaspar Bakos",
        "Attila Bódi",
        "Gavin Boyle",
        "Zoltan Csubry",
        "Joel Hartman",
        "Anthony Keyes",
        "Vincent Suc",
        "Geert Jan Talens"
      ],
      "abstract": "A Compact Multi-Planet System of Three Transiting Giant Planets Around TIC118798035 Rafael Brahm, Trifon Trifonov, Andrés Jordán, Thomas Henning, Néstor Espinoza, Felipe I. Rojas, Marcelo Tala Pinto, Matías I. Jones, Daniel Thorngren, Lorena Acuña, Jan Eberhardt, Yared Reinarz, Helem Salinas, Michaela Vítková, Juan I. Espinoza-Retamal, Gaspar Bakos, Attila Bódi, Gavin Boyle, Zoltan Csubry, Joel Hartman, Anthony Keyes, Vincent Suc, Geert Jan Talens 17 pages, submitted to AAS journals Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We report the discovery and characterization of three transiting giant planets in the TIC118798035 system. The three planets were identified as transiting candidates from data of the TESS mission, and confirmed with ground-based photometric transit observations along with radial velocity variations obtained with FEROS, HARPS and ESPRESSO. The three planets present transit timing variations (TTVs). We performed a N-body orbital fitting to the TTVs and radial velocities finding that TIC118798035 b is as warm low-density Neptune with a mass of 0.0250$\\pm$0.0023 $M_J$, a radius of 0.655$\\pm$0.018 $R_J$, and an orbital period of 11.507 d; TIC118798035 c is a warm Saturn with a mass of 0.403$\\pm$0.024 $M_J$, a radius of 0.973$\\pm$0.023 $R_J$, and an orbital period of 22.564 d; and TIC118798035 d is a warm Jupiter with a mass of 0.773$\\pm$0.052 $M_J$, a radius of 0.923$\\pm$0.044 $R_J$, and an orbital period of 48.925 d. The bulk metallicities of the three planets don't fully follow the mass-metallicity correlation found for the giant planets of the solar system, which hints at a somewhat different formation history for the planets of the TIC118798035 system. TIC118798035 is the only system having more than two transiting planets larger than 0.5 $R_J$ with a precise orbital and physical characterization, amenable for future atmospheric studies.",
      "pdf_url": "https://arxiv.org/pdf/2510.19162.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.12045",
      "title": "FIP Bias Evolution in an Emerging Active Region as observed in SPICE Synoptic Observations",
      "authors": [
        "T. Varesano",
        "D. M. Hassler",
        "N. Zambrana Prado",
        "J. M. Laming",
        "J. Plowman",
        "D.J. Knipp",
        "M. Molnar",
        "K. Barczynski",
        "The SPICE consortium"
      ],
      "abstract": "FIP Bias Evolution in an Emerging Active Region as observed in SPICE Synoptic Observations T. Varesano, D. M. Hassler, N. Zambrana Prado, J. M. Laming, J. Plowman, D.J. Knipp, M. Molnar, K. Barczynski, The SPICE consortium Solar and Stellar Astrophysics (astro-ph.SR) We investigate the time evolution of relative elemental abundances in the context of the first ionization potential effect focusing on an active region. Our aim is to characterize this evolution in different types of solar active region structures as well as in different atmospheric layers. We wish to assert how the measured changes relate to different magnetic topologies by computing abundance enhancement in different conditions using the ponderomotive force model. Leveraging spectroscopic observations from the Spectral Imaging of the Coronal Environment instrument on board Solar Orbiter, we use extreme ultraviolet lines from ions formed across a broad temperature range--from the upper chromosphere to the low corona--and we perform relative abundance ratios following differential emission measure analysis. This methodology yields relative abundance maps from low, intermediate, and high first ionization potential elements. We obtain the temporal evolution of a number of abundance ratios for different structures on the Sun. We compare these results with the outcomes of the ponderomotive force model. We find good correlation between the model and our results, suggesting an Alfvén-wave driven fractionation of the plasma. Fan loops, loop footpoints and active region boundaries exhibit coronal abundances, while the active region core shows more photospheric-like composition. A slow and steady increase in the magnesium to neon relative first ionization potential bias values is observed, starting around 1.5 and increasing by about 50\\% after two days. The sulfur to oxygen evolution coupled with the model brings evidence of resonant waves fractionating the plasma in transition region structures.",
      "pdf_url": "https://arxiv.org/pdf/2502.12045.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18044",
      "title": "84 Second and 169 Second Rotation of Two Isolated, Ultramassive, Strongly Magnetic White Dwarfs",
      "authors": [
        "Kurtis Williams",
        "Zorayda Martinez",
        "Melissa Ornelas"
      ],
      "abstract": "84 Second and 169 Second Rotation of Two Isolated, Ultramassive, Strongly Magnetic White Dwarfs Kurtis Williams, Zorayda Martinez, Melissa Ornelas 9 pages, 2 figures, accepted for publication in the AAS Journals. Revised version fixing embarrassing typo in the title Solar and Stellar Astrophysics (astro-ph.SR) Photometric variability in massive, magnetic white dwarfs (WDs) on the timescales of less than a few hours is oft interpreted as being due to magnetic spots on the surface of a rotating star. Increasingly, numbers of these short period variables are being discovered with the continued growth of time-domain astronomy, testing theories of magnetic white dwarf formation and angular momentum evolution. We present the detection of extremely rapid rotation in the WDs SDSS J1557+0411 and PG 1312+099, with periods of 168.94 s and 83.72 s, respectively. We consider other possible causes of the monoperiodic photometric variability, including binarity (eclipses and ellipsoidal variations) and asteroseismic pulsations. Though these cannot be ruled out with the existing data, these alternative explanations seem unlikely. SDSS J1557+0411 was predicted to be a rapidly rotating oxygen-neon core WD by Camisassa et al. (2022), a prediction borne out at least in part by our observations. PG 1312+099 was previously observed via polarimetry to be rotating with a period of ~5.4 h; we propose that this object may be an unresolved double degenerate system.",
      "pdf_url": "https://arxiv.org/pdf/2510.18044.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.19041",
      "title": "The Evolution of Jupiter and Saturn as a function of the Parameter R$_ρ$",
      "authors": [
        "Ankan Sur",
        "Adam Burrows",
        "Roberto Tejada Arevalo"
      ],
      "abstract": "The Evolution of Jupiter and Saturn as a function of the Parameter R$_ρ$ Ankan Sur, Adam Burrows, Roberto Tejada Arevalo 13 pages, 6 figures, accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Computed using the APPLE planetary evolution code, we present updated evolutionary models for Jupiter and Saturn that incorporate helium rain, non-adiabatic thermal structures, and \"fuzzy\" extended heavy-element cores. Building on our previous Ledoux-stable models, we implement improved atmospheric boundary conditions that account for composition-dependent effective temperatures and systematically explore the impact of varying the parameter $R_{\\rho}$, which allows one to explore in an approximate way the efficiency of semiconvection. For both Jupiter and Saturn, we construct models spanning from $R_{\\rho}=1$ (Ledoux) to $R_{\\rho}=0$ (Schwarzschild), and identify best-fit solutions that match each planet's effective temperature, equatorial radius, lower-order gravitational moments, and atmospheric composition at 4.56 Gyr. We find that lower $R_{\\rho}$ values lead to stronger convective mixing, resulting in higher surface metallicities and lower deep interior temperatures, while requiring reduced heavy-element masses and lower initial entropies to stabilize the dilute inner cores. Our Saturn models also broadly agree with the observed brunt frequency profile inferred from Cassini ring seismology, with stable layers arising from both the helium rain region and the dilute core. These findings support the presence of complex, compositionally stratified interiors in both gas giants.",
      "pdf_url": "https://arxiv.org/pdf/2506.19041.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19071",
      "title": "Modeling atmospheric phase corruptions in high-frequency VLBI using Gaussian processes",
      "authors": [
        "Uri Rolls",
        "Dominic W. Pesce",
        "Paul Tiede",
        "Lindy Blackburn",
        "Iniyan Natarajan",
        "Sheperd S. Doeleman"
      ],
      "abstract": "Modeling atmospheric phase corruptions in high-frequency VLBI using Gaussian processes Uri Rolls, Dominic W. Pesce, Paul Tiede, Lindy Blackburn, Iniyan Natarajan, Sheperd S. Doeleman 16 pages, 7 figures, accepted for publication in AJ Instrumentation and Methods for Astrophysics (astro-ph.IM) Using very long baseline interferometry (VLBI) observations at (sub)millimeter wavelengths, the Event Horizon Telescope (EHT) currently achieves the finest angular resolution of any astronomical facility, necessary for imaging the horizon-scale structure around supermassive black holes. A significant calibration challenge for high-frequency VLBI stems from rapid variations in the atmospheric water vapor content above each telescope in the array, which induce corresponding fluctuations in the phase of the correlated signal that limit the coherent integration time and thus the achievable sensitivity. In this paper, we introduce a model that describes station-based phase corruptions jointly with a parameterization for the source structure. We adopt a Gaussian Process (GP) prescription for the time evolution of these phase corruptions, which provides sufficient flexibility to capture even highly erratic phase behavior. The use of GPs permits the application of a Kalman filtering algorithm for numerical marginalization of these phase corruptions, which permits efficient exploration of the remaining parameter space. Our model also removes the need to specify an arbitrary ``reference station'' during calibration, instead establishing a global phase zeropoint by enforcing the GPs at all stations to have fixed mean and finite variance. We validate our method using a real EHT observation of the blazar 3C 279, demonstrating that our approach yields calibration solutions that are consistent with those determined by the EHT Collaboration. The model presented here can be straightforwardly extended to incorporate frequency-dependent phase behavior, such as is relevant for the frequency phase transfer calibration technique.",
      "pdf_url": "https://arxiv.org/pdf/2510.19071.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19335",
      "title": "Segmentation and Celestial Mapping of Unobservable Regions in Nighttime All-sky Images for the Mephisto Observations",
      "authors": [
        "Jian Cui",
        "Guo-Wang Du",
        "Xin-Zhong Er",
        "Chu-Xiang Li",
        "Jun-Fan Hou",
        "Yu-Xin Xin",
        "Xiang-kun Liu",
        "Xiao-Wei Liu"
      ],
      "abstract": "Segmentation and Celestial Mapping of Unobservable Regions in Nighttime All-sky Images for the Mephisto Observations Jian Cui, Guo-Wang Du, Xin-Zhong Er, Chu-Xiang Li, Jun-Fan Hou, Yu-Xin Xin, Xiang-kun Liu, Xiao-Wei Liu Instrumentation and Methods for Astrophysics (astro-ph.IM) Accurate identification of unobservable regions in nighttime is essential for autonomous scheduling and data quality control in this http URL methods-such as infrared sensing or photometric extinction-provide only coarse,non-spatial estimates of sky clarity,making them insufficient for real-time this http URL not only wastes observing time but also introduces contamination when telescopes are directed toward cloud-covered or moonlight-affected this http URL address these limitations,we propose a deep learning-based segmentation framework that provides pixel-level masks of unobservable areas using all-sky this http URL by a manually annotated dataset of nighttime images,our method enables precise detection of cloud- and moonlight-affected this http URL segmentation results are further mapped to celestial coordinates through Zenithal Equal-Area projection,allowing seamless integration with observation control systems (OCS) for real-time cloud-aware this http URL developed for the Mephisto telescope,the framework is generalizable and applicable to other wide-field robotic observatories equipped with all-sky monitoring.",
      "pdf_url": "https://arxiv.org/pdf/2510.19335.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19469",
      "title": "Advances in detector response and background modelling in the ANAIS-112 experiment for annual modulation and other rare event searches",
      "authors": [
        "Tamara Pardo Yanguas"
      ],
      "abstract": "Advances in detector response and background modelling in the ANAIS-112 experiment for annual modulation and other rare event searches Tamara Pardo Yanguas PhD thesis in Physics, University of Zaragoza, 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) Numerous astronomical and cosmological observations point to the existence of dark matter, which constitutes about 27% of the Universe. Despite extensive efforts, only the DAMA/LIBRA experiment, using NaI(Tl) detectors at Gran Sasso National Laboratory, has reported a positive dark matter signal. To independently verify this result, using the same NaI target is essential. This is the goal of ANAIS-112, operating with 112.5 kg of NaI(Tl) scintillators since 2017 at the Canfranc Underground Laboratory (LSC). This thesis presents work within ANAIS-112, focusing on data analysis and the development of Geant4-based simulations to reduce systematics and increase sensitivity. Efforts have focused on understanding the ANAIS-112 crystals' response to nuclear recoils. Systematic uncertainties related to the scintillation quenching factors (QFs) of sodium and iodine recoiling in NaI(Tl) must be addressed to ensure reliable comparisons with DAMA/LIBRA and other experiments. For that purpose, onsite neutron calibrations in ANAIS-112 have been performed since 2021 at LSC using 252Cf sources. This work has compared calibration data with Geant4-based neutron simulations, which has revealed Geant4 deficiencies in certain decay processes and cross sections in some versions. The simulations have proven highly sensitive to the QF used, favouring models in which the QF increases with energy and disfavouring DAMA values. In parallel, this thesis has contributed to improving the ANAIS-112 background model through a multiparametric fit of its background components. New physics searches have been conducted using ANAIS-112 data, including a reanalysis of the annual modulation signal and a search for solar axions using six years of exposure. Finally, this thesis also includes work within the COSINUS experiment, focused on background modelling and the impact of internal backgrounds on the experiment's sensitivity.",
      "pdf_url": "https://arxiv.org/pdf/2510.19469.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19542",
      "title": "Singular Value-based Atmospheric Tomography with Fourier Domain Regularization (SAFR)",
      "authors": [
        "Lukas Weissinger",
        "Simon Hubmer",
        "Bernadett Stadler",
        "Ronny Ramlau"
      ],
      "abstract": "Singular Value-based Atmospheric Tomography with Fourier Domain Regularization (SAFR) Lukas Weissinger, Simon Hubmer, Bernadett Stadler, Ronny Ramlau Instrumentation and Methods for Astrophysics (astro-ph.IM); Numerical Analysis (math.NA) Atmospheric tomography, the problem of reconstructing atmospheric turbulence profiles from wavefront sensor measurements, is an integral part of many adaptive optics systems. It is used to enhance the image quality of ground-based telescopes, such as for the Multiconjugate Adaptive Optics Relay For ELT Observations (MORFEO) instrument on the Extremely Large Telescope (ELT). To solve this problem, a singular-value decomposition (SVD) based approach has been proposed before. In this paper, we focus on the numerical implementation of the SVD-based Atmospheric Tomography with Fourier Domain Regularization Algorithm (SAFR) and its performance for Multi-Conjugate Adaptive Optics (MCAO) systems. The key features of the SAFR algorithm are the utilization of the FFT and the pre-computation of computationally demanding parts. Together, this yields a fast algorithm with less memory requirements than commonly used Matrix Vector Multiplication (MVM) approaches. We evaluate the performance of SAFR regarding reconstruction quality and computational expense in numerical experiments using the simulation environment COMPASS, in which we use an MCAO setup resembling the physical parameters of the MORFEO instrument of the ELT.",
      "pdf_url": "https://arxiv.org/pdf/2510.19542.pdf",
      "categories": [
        "astro-ph.IM",
        "math.NA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19594",
      "title": "Exploring Synergies between Twinkle and Ariel: a Pilot Study",
      "authors": [
        "Andrea Bocchieri",
        "Luke Booth",
        "Lorenzo V. Mugnai"
      ],
      "abstract": "Exploring Synergies between Twinkle and Ariel: a Pilot Study Andrea Bocchieri, Luke Booth, Lorenzo V. Mugnai Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Launching in 2027 and 2029, respectively, Twinkle and Ariel will conduct the first large-scale homogeneous spectroscopic surveys of the atmospheres of hundreds of diverse exoplanets. This will fundamentally transition the field to an era of population-level characterisation. In this pilot study, we aim to explore possible synergies between Twinkle and Ariel to determine for instance whether prior Twinkle observations can substantially inform the target selection and observing strategy of Ariel. This study primarily aims to encourage further investigation by both consortium communities by showing what a potential scientific synergy would look like on a promising scientific case that requires further exploration. For this aim, we select a small subset of \"cool\" planets that are also particularly well-suited to be observed by Twinkle and therefore Ariel. By using representative noise estimates for both missions, we compute the number of visits required for an observation. Then, we simulate and retrieve transmission spectra of each target, assuming gaseous, H2/He-dominated atmospheres and various atmospheric models. For all candidates, we find that atmospheric parameters are generally retrieved well within 1-sigma to input values, with Ariel typically achieving tighter constraints. We demonstrate that for a small subset of cool gaseous planets, exploitable synergies exist between Twinkle and Ariel observations and Twinkle may very well provide a vantage point to plan Ariel observations. The true extent of the potential synergies, far beyond our considered sample, will be determined by the final target lists. Once Twinkle is operational and its performance is known, it could reliably inform Ariel's target prioritization and Ariel's capabilities which are already well-established can help define optimal targets and observational approaches for Twinkle.",
      "pdf_url": "https://arxiv.org/pdf/2510.19594.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.02103",
      "title": "Using LSDB to enable large-scale catalog distribution, cross-matching, and analytics",
      "authors": [
        "Neven Caplar",
        "Wilson Beebe",
        "Doug Branton",
        "Sandro Campos",
        "Andrew Connolly",
        "Melissa DeLucchi",
        "Derek Jones",
        "Mario Juric",
        "Jeremy Kubica",
        "Konstantin Malanchev",
        "Rachel Mandelbaum",
        "Sean McGuire"
      ],
      "abstract": "Using LSDB to enable large-scale catalog distribution, cross-matching, and analytics Neven Caplar, Wilson Beebe, Doug Branton, Sandro Campos, Andrew Connolly, Melissa DeLucchi, Derek Jones, Mario Juric, Jeremy Kubica, Konstantin Malanchev, Rachel Mandelbaum, Sean McGuire 4 pages, 2 figures, Proceedings of XXXIV Astronomical Data Analysis Software & Systems (ADASS) conference, November 10-14 2024, Valletta, Malta Instrumentation and Methods for Astrophysics (astro-ph.IM) The Vera C. Rubin Observatory will generate an unprecedented volume of data, including approximately 60 petabytes of raw data and around 30 trillion observed sources, posing a significant challenge for large-scale and end-user scientific analysis. As part of the LINCC Frameworks Project we are addressing these challenges with the development of the HATS (Hierarchical Adaptive Tiling Scheme) format and analysis package LSDB. HATS partitions data adaptively using a hierarchical tiling system to balance the file sizes, enabling efficient parallel analysis. Recent updates include improved metadata consistency, support for incremental updates, and enhanced compatibility with evolving datasets. LSDB complements HATS by providing a scalable, user-friendly interface for large catalog analysis, integrating spatial queries, crossmatching, and time-series tools while utilizing Dask for parallelization. We have successfully demonstrated the use of these tools with datasets such as ZTF and Pan-STARRS data releases on both cluster and cloud environments. We are deeply involved in several ongoing collaborations to ensure alignment with community needs, with future plans for IVOA standardization and support for upcoming Rubin, Euclid and Roman data. We provide our code and materials at this http URL.",
      "pdf_url": "https://arxiv.org/pdf/2501.02103.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.13844",
      "title": "Low-temperature Performance of $\\mathrm{Gd_3(Ga, Al)_5O_{12}}$:Ce Scintillators",
      "authors": [
        "Merlin Kole",
        "Kasun Wimalasena",
        "Richard Gorby",
        "Torsten Diesel",
        "Zachary Greenberg",
        "Fabian Kislat"
      ],
      "abstract": "Low-temperature Performance of $\\mathrm{Gd_3(Ga, Al)_5O_{12}}$:Ce Scintillators Merlin Kole, Kasun Wimalasena, Richard Gorby, Torsten Diesel, Zachary Greenberg, Fabian Kislat Submitted to Journal of Low Temperature Physics Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) The last years have seen the first cryogenic detectors to be proposed for usage on balloon-borne missions. In such missions, the instrument will be exposed to the high radiation environment of the upper atmosphere. This radiation can induce a significant background to the measurements, something which can be mitigated through the use of an anti-coincidence shield. For hard X-ray and gamma-ray detectors such a shield typically consists photomultiplier tubes or, more recently, silicon photomultipliers coupled to scintillators placed around the detector. When using cryogenic detectors, the shield can be placed around the entire cryostat which will make it large, heavy and expensive. For the ASCENT (A SuperConducting ENergetic x-ray Telescope) mission, which uses Transition Edge Detectors, it was therefore considered to instead place the shield inside. This comes with the challenge of operating it at cryogenic temperatures. For this purpose, we tested the performance of 2 different types of GAGG:Ce scintillators down to 15 mK for the first time. Although significant variations of both the decay time and the light yield were found when varying the temperature, at 4 K its performance was found to be similar to that at room temperature. Furthermore, unexpected behavior around 2 K was found for both types of GAGG:Ce, leading to more in depth studies around these temperatures. Overall, the studies show that the combination of materials will allow to produce a functional anti-coincidence shield at several Kelvin.",
      "pdf_url": "https://arxiv.org/pdf/2508.13844.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18955",
      "title": "Intruder Alert: Breaking Resonant Chains with Planetesimal Flybys",
      "authors": [
        "Jiaru Li",
        "Christopher E. O'Connor",
        "Frederic A. Rasio"
      ],
      "abstract": "Intruder Alert: Breaking Resonant Chains with Planetesimal Flybys Jiaru Li, Christopher E. O'Connor, Frederic A. Rasio Lead jointly by JL and CEO, 16 pages, 7 figures, 2 tables, submitted to ApJL Earth and Planetary Astrophysics (astro-ph.EP) The orbital architectures of compact exoplanet systems record their complicated dynamical histories. Recent research supports the ``breaking-the-chains'' hypothesis, which proposes that compact systems typically form in chains of mean-motion resonances (MMRs) but subsequently break out on a $\\sim 100$Myr timescale. We investigate a scenario for breaking the chains through intermittent flybys of planetesimals originating from a distant reservoir. Using $N$-body simulations and semi-analytical calculations, we characterize the disruption of MMRs through these flybys. We find a planetesimal reservoir of total mass $\\gtrsim 0.04 M_{\\oplus}$ is required to disrupt MMR chains, depending on the mass distribution and the typical number of flybys executed by each planetesimal. We verify that systems disrupted in this way are frequently unstable to close encounters within $\\sim 100$Myr of the final flyby. This mechanism operates in systems with both a sufficiently massive reservoir and an efficient mechanism for planetesimal injection. Consequently, we predict an anti-correlation between resonant inner systems and dynamically active outer configurations.",
      "pdf_url": "https://arxiv.org/pdf/2510.18955.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18970",
      "title": "Eccentric discs as a gateway to giant planets outward migration",
      "authors": [
        "Chiara E. Scardoni",
        "Giovanni P. Rosotti",
        "Cathie J. Clarke",
        "Enrico Ragusa",
        "Richard A. Booth"
      ],
      "abstract": "Eccentric discs as a gateway to giant planets outward migration Chiara E. Scardoni, Giovanni P. Rosotti, Cathie J. Clarke, Enrico Ragusa, Richard A. Booth 14 pages, 13 figures, accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) Recent studies on planet-dominated Type II migration demonstrated the presence of a correlation between the direction of planet migration and the parameter K describing the depth of the planetary gap. It was found that high (low) value for K correspond to outward (inward) migration. In this paper we aim at understanding the mechanism driving inward/outward migration and why it correlates with the gap depth. We performed a suite of 2D, live-planet, long-term simulations of massive planets migrating in discs with the hydro-code Fargo3D. We focus on a range of planet masses (1-13 m_J) and disc aspect ratios (0.03-0.1) and analyze the evolution of orbital elements and gap structure. We also study the torque contributions from outer Lindblad resonances to investigate their role in the migration outcome. We find that, while all planets initially migrate inwards, those with high enough K eventually enter a phase in which the torque reverses sign and migration becomes outwards, until eventually stalling. This behavior is associated with eccentricity growth in the outer disc and changes in the gap structure. We identify the surface density ratio at the 1:2 and 1:3 outer Lindblad resonances as a key output diagnostic that correlates with the migration direction. This ratio regulates the migration for all the cases where the massive planet remains in an almost circular orbit and the outer gap region exhibits moderate eccentricity. This characteristic sequence of inward-reversal-outwards-stalling occurs for a variety of K values and thus further work is required to identify the simulation input parameters that determine the onset of this sequence. Our results suggest that outward migration in the planet-dominated regime is primarily governed by the relative importance of the 1:2 and 1:3 resonances and, therefore, the gap profile plays a crucial role in determining the direction of migration.",
      "pdf_url": "https://arxiv.org/pdf/2510.18970.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19717",
      "title": "Compositional characterisation of asteroid (84) Klio with JWST",
      "authors": [
        "Tania Le Pivert-Jolivet",
        "Julia de León",
        "Javier Licandro",
        "Bryan Holler",
        "Noemí Pinilla-Alonso",
        "Mário De Prá",
        "Joshua Emery",
        "Brittany Harvison",
        "Joseph Masiero",
        "Lucas McClure",
        "Driss Takir"
      ],
      "abstract": "Compositional characterisation of asteroid (84) Klio with JWST Tania Le Pivert-Jolivet, Julia de León, Javier Licandro, Bryan Holler, Noemí Pinilla-Alonso, Mário De Prá, Joshua Emery, Brittany Harvison, Joseph Masiero, Lucas McClure, Driss Takir 9 pages, 9 figures, plus appendix. Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) The analysis of the composition of primitive C$-$complex asteroids is essential to understand the distribution of volatiles in the Solar System since its formation. Primitive low-albedo families within the inner main asteroid belt are of particular interest because they are a significant source of carbonaceous near-Earth asteroids, such as Ryugu and Bennu. This study, part of the JWST SAMBA3 project (Spectral Analysis of Main Belt Asteroids in the 3 $\\mu$m region), report the first spectroscopic analysis of asteroid (84) Klio in the 3 $\\mu$m region, in order to better constrain its composition. We analysed the infrared (0.97$-$5.10 $\\mu$m) Spectrum of Klio measured by the NIRSpec instrument on board JWST. We used the NEATM thermal model to extract the reflectance spectrum of the asteroid. Several spectral features were then analysed in the 2.8, 3.4, and 3.9 $\\mu$m regions by different Gaussian fitting. The Spectrum of Klio shows an absorption band at 2.776 $\\pm$ 0.001 $\\mu$m that we attributed to phyllosilicates. We compared the position and shape of the feature with that observed in primitive materials such as carbonaceous chondrites and returned samples from Ryugu and Bennu. The position and shape of the 2.8 $\\mu$m band, as well as the presence of a 0.7 $\\mu$m band in the visible, suggest that Klio's spectrum is similar to certain CM2 meteorites. We observed an absorption band around 3.9 $\\mu$m, with a depth of $0.020 \\pm 0.001$ that could be attributed to carbonates. We could not clearly detect any absorption associated with organics at 3.4 $\\mu$m.",
      "pdf_url": "https://arxiv.org/pdf/2510.19717.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19776",
      "title": "Exoplanetary radio emission predictions and detectability in the SKA era",
      "authors": [
        "Mahdiyar Mousavi-Sadr",
        "Fatemeh S. Tabatabaei",
        "Alexander Wolszczan",
        "Ghassem Gozaliasl"
      ],
      "abstract": "Exoplanetary radio emission predictions and detectability in the SKA era Mahdiyar Mousavi-Sadr, Fatemeh S. Tabatabaei, Alexander Wolszczan, Ghassem Gozaliasl 14 pages, 8 figures. Submitted to MNRAS Earth and Planetary Astrophysics (astro-ph.EP) Radio observations provide a window into a planet's interior and play a crucial role in studying its atmosphere and surface, key factors to find potential habitability. The discovery of thousands of exoplanets, together with advances in radio astronomy through the Square Kilometre Array (SKA), motivates the search for planetary-scale radio emissions. Here, we employ the radiometric Bode's law (RBL) and machine learning techniques to analyze a dataset of 1330 confirmed exoplanets, aiming to estimate their potential radio emission. Permutation Importance (PI) and SHapley Additive exPlanations (SHAP) analyses indicate that a planet's mass, radius, orbital semi-major axis, and distance from Earth are sufficient to dependably forecast its radio flux and frequency. The random forest model accurately reproduces these radio characteristics, confirming its reliability for exoplanetary radio predictions. Considering observational constraints, we find that 64 exoplanets could generate signals detectable by the SKA, 52 of which remain observable in the intermediate AA* deployment. Among these, MASCARA-1 b stands out with a predicted flux of 7.209 mJy at 135.1 MHz, making it an excellent SKA-Low target. Meanwhile, WASP-18 b, with a flux of 18.638 mJy peaking at 812.9 MHz, is the most promising candidate for SKA-Mid. These results show that the SKA can detect gas giants, such as MASCARA-1 b (SNR>400) and WASP-18 b (SNR>4236), within feasible integration times. Additionally, we identify four candidates (HATS-18 b, WASP-12 b, WASP-103 b, and WASP-121 b) that are likely affected by radio quenching, highlighting the importance of considering this effect in target selection for observation campaigns.",
      "pdf_url": "https://arxiv.org/pdf/2510.19776.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.11813",
      "title": "Forcing Planets to Evolve: Interactions Between Uranus and Neptune at Late Stages of Dynamical Evolution",
      "authors": [
        "Arcelia Hermosillo Ruiz",
        "Ruth Murray-Clay",
        "Kathryn Volk",
        "Rosemary Pike"
      ],
      "abstract": "Forcing Planets to Evolve: Interactions Between Uranus and Neptune at Late Stages of Dynamical Evolution Arcelia Hermosillo Ruiz, Ruth Murray-Clay, Kathryn Volk, Rosemary Pike Updated with revised version. Code can be found here: this https URL Earth and Planetary Astrophysics (astro-ph.EP) In early Solar System numerical simulations, where chaos is a primary driver, it is difficult to explore parameter space in a systematic way. In such simulations, stable configurations are hard to come by, and often require special fine-tuning. In addition, it is infeasible to run suites of well-resolved, realistic simulations with a disk of massive particles to drive planetary evolution where enough particles remain to represent the transneptunian populations to robustly statistically compare with observations. To complement state of the art full N-body simulations, we develop a method to artificially control each planet's orbital elements independently from each other, which when carefully applied, can be used to test a wider suite of models. We modify two widely used publicly available N-body integrators: (1) the C code, \\texttt{REBOUND} and (2) the FORTRAN code, \\texttt{Mercury6.2}. We show how the application of specific fictitious forces within numerical integrators can be used to tightly control planetary evolution to more easily explore migration and orbital excitation and damping. This tool allows us to replicate the impact a massive planetesimal disk would have on the planets, without actually including the massive planetesimals, thus decreasing the chaos and simulation runtime. We demonstrate the utility of this tool by applying it to the coupled orbital evolution of Uranus and Neptune, and show that Neptune's eccentricity damping and radial outward migration have the appropriate affect on Uranus' eccentricity.",
      "pdf_url": "https://arxiv.org/pdf/2410.11813.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22785",
      "title": "Re-accretion of Giant Impact Ejecta Can Drive Significant Atmospheric Erosion on Terrestrial Planets",
      "authors": [
        "Tuhin Ghosh",
        "Mark Wyatt",
        "Oliver Shorttle"
      ],
      "abstract": "Re-accretion of Giant Impact Ejecta Can Drive Significant Atmospheric Erosion on Terrestrial Planets Tuhin Ghosh, Mark Wyatt, Oliver Shorttle 16 pages, 8 Figures, Accepted for publication in MNRAS Earth and Planetary Astrophysics (astro-ph.EP) Giant impacts, the collisions between planetary embryos, play a crucial role in sculpting the planets and their orbital architectures. Numerical simulations have advanced our understanding of these events, enabling estimations of mass and atmospheric loss during the primary impacts. However, high computational costs have restricted investigations to the immediate aftermath, limiting our understanding of the longer-term consequences. In this study, we investigate the effect of re-accretion of giant impact debris, a process previously overlooked, on the atmospheres of terrestrial planets. Following the collisional and dynamical evolution of the debris ejected during the primary impacts, we quantify the amount of debris that would be re-accreted by the progenitor. We find that $\\sim 0.003\\ M_{\\oplus}$ would be re-accreted over a wide range of Earth-like planet properties, assuming $1\\%$ of their mass is ejected as non-vaporised debris. Over a prolonged period, the secondary impacts during re-accretion drive enhanced atmospheric loss. Notably, the impacts from the debris of the canonical Moon-forming impact would have gradually eroded an atmosphere similar to present-day Earth's in $\\sim 30$ Myr. More generally, any planet growing via giant impacts within $2$ au is likely to experience significant post-impact atmospheric erosion unless the initial atmosphere was at least $5$ times more massive than Earth's. Our results highlight the crucial role secondary impacts from giant-impact ejecta could have in driving the long-term atmospheric evolution of Earth-like planets, and demonstrate that giant impacts can be significantly more effective at eroding such atmospheres than previously thought, when re-accretion of debris is considered.",
      "pdf_url": "https://arxiv.org/pdf/2509.22785.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}