{
  "date": "2026-02-24",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.GA",
    "astro-ph.IM",
    "astro-ph.CO",
    "astro-ph.HE",
    "astro-ph.SR"
  ],
  "total_papers": 84,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.16575",
      "title": "Chiral gravitational waves from multi-phase magnetogenesis",
      "authors": [
        "H. V. Ragavendra",
        "Gianmassimo Tasinato",
        "L. Sriramkumar"
      ],
      "abstract": "Chiral gravitational waves from multi-phase magnetogenesis H. V. Ragavendra, Gianmassimo Tasinato, L. Sriramkumar Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Cosmological vector fields are central to many early-Universe phenomena, including inflationary dynamics, primordial magnetogenesis, and dark-matter scenarios. However, constructing models able to generate cosmological magnetic fields while avoiding strong coupling, backreaction, and cosmic microwave background constraints remains challenging. We study a novel mechanism in which brief non--slow-roll phases during inflation amplify primordial magnetic fields at small scales, while maintaining theoretical consistency and observational viability. We incorporate parity-violating interactions in the vector sector and demonstrate, for the first time in a non--slow-roll framework, that chirality can significantly boost magnetic-field amplitudes and imprint distinctive polarization-dependent spectral features. We complement detailed numerical computations with an analytical treatment yielding compact expressions for chiral vector mode functions that reproduce the main spectral properties. We then develop a systematic formalism to evaluate the stochastic gravitational-wave background naturally induced at second order by these amplified fields, identifying both an intensity component and a circularly polarized contribution with characteristic frequency profiles. We discuss detection prospects with future multiband gravitational-wave observatories, showing that chiral signatures could provide a distinctive observational probe. Our results introduce new avenues for enhancing primordial magnetic fields and their associated gravitational-wave signals, opening promising possibilities for their future detection and interpretation, both with cosmological and gravitational wave probes.",
      "pdf_url": "https://arxiv.org/pdf/2602.16575.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.17756",
      "title": "Pushing spectral siren cosmology into the third-generation era: a blinded mock data challenge",
      "authors": [
        "Matteo Tagliazucchi",
        "Michele Moresco",
        "Alessandro Agapito",
        "Michele Mancarella",
        "Sarah Ferraiuolo",
        "Simone Mastrogiovanni",
        "Nicola Borghi",
        "Francesco Pannarale",
        "Daniele Bonacorsi"
      ],
      "abstract": "Pushing spectral siren cosmology into the third-generation era: a blinded mock data challenge Matteo Tagliazucchi, Michele Moresco, Alessandro Agapito, Michele Mancarella, Sarah Ferraiuolo, Simone Mastrogiovanni, Nicola Borghi, Francesco Pannarale, Daniele Bonacorsi Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational wave (GW) spectral sirens offer a promising method for measuring cosmological parameters using GW data only - without relying on external redshift information such as electromagnetic counterparts or galaxy catalogs - by exploiting distributional features in the population of GW sources. The advent of third-generation detectors like the Einstein Telescope (ET) will provide catalogs three orders of magnitudes larger than current ones, raising questions about the scalability and robustness of existing inference pipelines. We present a blinded mock data challenge that tests three public pipelines with distinct numerical implementations, namely, $\\texttt{ICAROGW}$, $\\texttt{CHIMERA}$, and $\\texttt{pymcpop-gw}$, on simulated ET observations containing the best $\\mathcal{O}(10^4)$ binary black hole mergers that can be observed in 1 year. We assess their computational performance, validate their agreement in a blinded setting, and forecast cosmological constraints. We find that, thanks to GPU acceleration, these pipelines can process the events expected from ET within a manageable timeframe. All pipelines recover consistent cosmological and population parameters. Assuming a flat $\\Lambda$CDM model, we measure $H(z)$ at $z\\sim1.5$ with 2.4% precision, and achieve a mean precision on $H(z)$ of 2.8% across $0.7<z<1.8$ with a catalog of $\\sim 12,000$ high-S/N events. This corresponds to joint constraints of $\\sim 10%$ on $H_0$ and $\\sim 26%$ on $\\Omega_{\\rm m,0}$. We also identify the events that contribute mostly to constraining cosmological parameters, showing that low-distance sources near population features drive the constraining power on all cosmological parameters, while higher-distance events primarily constrain $\\Omega_{\\rm m,0}$. Our results establish a validated, performance-tested framework for spectral siren cosmology in the era of third-generation GW observatories.",
      "pdf_url": "https://arxiv.org/pdf/2602.17756.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.18272",
      "title": "CMB anisotropies from cosmic (super)strings in light of ACT DR6",
      "authors": [
        "Juhan Raidal",
        "Anastasios Avgoustidis",
        "Edmund Copeland",
        "Adam Moss"
      ],
      "abstract": "CMB anisotropies from cosmic (super)strings in light of ACT DR6 Juhan Raidal, Anastasios Avgoustidis, Edmund Copeland, Adam Moss Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We present updated constraints on cosmic string and superstring parameters derived from Cosmic Microwave Background (CMB) anisotropies. The constraints are obtained via Markov Chain Monte Carlo (MCMC) analyses of the full \\textit{Planck} temperature and polarization data combined with the Atacama Cosmology Telescope (ACT) Data Release 6 (DR6). For ordinary cosmic strings, we constrain the string tension $G\\mu$, the string wiggliness parameter $\\alpha$, and the self-chopping efficiency $\\tilde{c}$. For cosmic superstrings, we constrain the fundamental string tension $G\\mu_F$, the string coupling $g_s$, and a parameter $w$ describing the volume of the compact extra dimensions. In both cases, we find significantly tighter bounds on the string tension compared to previous analyses, obtaining $2\\sigma$ upper limits of $G\\mu < 3.66\\times10^{-8}$ and $G\\mu_F < 1.38\\times10^{-8}$. We also discuss the significant prior-dependence of these results. The computational pipeline used in this work, including a modified version of \\texttt{CAMB} capable of computing CMB anisotropies sourced by any active network described via unequal-time correlators, is released publicly as \\texttt{CAMBactive} \\cite{Raidal_CAMBactive_CAMB_extension_2026}.",
      "pdf_url": "https://arxiv.org/pdf/2602.18272.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.12228",
      "title": "Quantum estimation of cosmological parameters",
      "authors": [
        "Michał Piotrak",
        "Thomas Colas",
        "Ana Alonso-Serrano",
        "Alessio Serafini"
      ],
      "abstract": "Quantum estimation of cosmological parameters Michał Piotrak, Thomas Colas, Ana Alonso-Serrano, Alessio Serafini 27 pages without appendices (41 pages in total), 3 figures; matches published version in JHEP Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Quantum Physics (quant-ph) Understanding how well future cosmological experiments can reconstruct the mechanism that generated primordial inhomogeneities is key to assessing the extent to which cosmology can inform fundamental physics. In this work, we apply a quantum metrology tool - the quantum Fisher information - to the squeezed quantum state describing cosmological perturbations at the end of inflation. This quantifies the ultimate precision achievable in parameter estimation, assuming ideal access to early-universe information. By comparing the quantum Fisher information to its classical counterpart - derived from measurements of the curvature perturbation power spectrum alone (homodyne measurement) - we evaluate how close current observations come to this quantum limit. Focusing on the tensor-to-scalar ratio as a case study, we find that the gap between classical and quantum Fisher information grows exponentially with the number of e-folds a mode spends outside the horizon. This suggests the existence of a highly efficient (but presently inaccessible) optimal measurement. Conversely, we show that accessing the decaying mode of inflationary perturbations is a necessary (but not sufficient) condition for exponentially improving the inference of the tensor-to-scalar ratio.",
      "pdf_url": "https://arxiv.org/pdf/2507.12228.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th",
        "quant-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.14120",
      "title": "A spherical hydrodynamical model of cosmic voids in ΛCDM and beyond",
      "authors": [
        "Tommaso Moretti",
        "Giovanni Verza",
        "Noemi Frusciante",
        "Francesco Pace"
      ],
      "abstract": "A spherical hydrodynamical model of cosmic voids in ΛCDM and beyond Tommaso Moretti, Giovanni Verza, Noemi Frusciante, Francesco Pace 42 pages, 17 figures. This version matches the published one Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Cosmic voids have emerged as powerful probes for cosmology, providing complementary information on the large-scale structure of the universe. We present the first application of a hydrodynamical framework to model the evolution of cosmic voids. This approach offers a physically intuitive characterization of void dynamics and can naturally be applied to non-standard cosmologies. We derive the cosmology-dependent mapping that relates the linear (Lagrangian) and fully non-linear (Eulerian) evolution of the matter density contrast, a central component for accurate theoretical modeling of void statistics. Furthermore, we present a new method for determining the shell-crossing epoch across arbitrary cosmological backgrounds, thereby extending previous treatments restricted to the Einstein-de Sitter universe. Motivated by recent DESI results hinting at dynamical dark energy, we investigate void evolution in $ w_0w_a$CDM cosmologies by varying $ w_0$ and $w_a$. We also consider the impact of varying the matter density parameter, $ \\Omega_{\\mathrm{m},0}$. We find that the evolution of isolated, spherically symmetric cosmic voids is most sensitive to $ \\Omega_{\\mathrm{m},0} $ and $ w_0 $, which can alter the non-linear density contrast by up to 20-30%. Variations in $w_a$ have a smaller impact, but may still lead to measurable effects. We also show that the cosmology-dependent mapping between linear and non-linear density contrasts may provide a sensitive probe of dynamical dark energy in precision void analyses.",
      "pdf_url": "https://arxiv.org/pdf/2507.14120.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20964",
      "title": "Comparing measures of the Hubble and BAO tensions in $Λ$CDM and possible solutions in $f(Q)$ gravity",
      "authors": [
        "José Antonio Nájera",
        "Indranil Banik",
        "Harry Desmond",
        "Vasileios Kalaitzidis"
      ],
      "abstract": "Comparing measures of the Hubble and BAO tensions in $Λ$CDM and possible solutions in $f(Q)$ gravity José Antonio Nájera, Indranil Banik, Harry Desmond, Vasileios Kalaitzidis 32 pages, 9 figures, 7 tables. Resubmitted with substantial revisions to Galaxies special issue on the Hubble tension in this form Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We test whether $f(Q)$ symmetric teleparallel gravity theories can solve the Hubble tension consistently with DESI~DR2 BAO. We consider three $f(Q)$ functional forms: logarithmic, exponential, and hyperbolic tangent. We extend these models by allowing a cosmological constant, and compare to phenomenological models with a flexible exponential, hyperbolic secant, and polynomial decay addition to the standard $\\Lambda$CDM $H(z)$. We test these models against DESI~DR2 BAO, CMB (\\emph{Planck}~2018 + SPT-3G + ACT~DR6), local $H_0$, and Cosmic Chronometer data. The logarithmic and hyperbolic tangent $f(Q)$ models do not provide an adequate solution, but the exponential model does. Furthermore, it slightly reduces the $(\\Omega_m, H_0 r_d)$ parameter space tension between CMB and BAO datasets to $2.56\\sigma$, down from $2.65\\sigma$ for $\\Lambda$CDM. Although $\\Lambda$CDM faces only $1.66\\sigma$ tension in DESI data space, the $1\\sigma$ higher tension in parameter space suggests a real anomaly. The models assisted by the cosmological constant perform slightly better still, at the cost of undermined theoretical motivation. They also perform poorly once local $H_0$ measurements are included. The phenomenological models fit all data reasonably well, yet the best-fitting models predict isotropically averaged BAO distances exceeding the DESI~DR2 measurements at all redshifts. This highlights the difficulties of finding a theoretically motivated solution to the Hubble tension while remaining consistent with BAO data.",
      "pdf_url": "https://arxiv.org/pdf/2510.20964.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.04055",
      "title": "A simple mechanism for the enhancement of the inflationary power spectrum",
      "authors": [
        "I. Dalianis",
        "A. Katsis",
        "N. Tetradis"
      ],
      "abstract": "A simple mechanism for the enhancement of the inflationary power spectrum I. Dalianis, A. Katsis, N. Tetradis Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The background evolution in two-field inflation can feature two distinct stages, corresponding to the evolution along two successive field directions. When the second stage occurs at a significantly lower energy scale, the inflationary trajectory includes a sharp transition, accompanied by a series of rapid turns in field space. Fluctuations crossing the Hubble horizon during this turning phase can experience amplification by several orders of magnitude. This mechanism is very intuitive and can be implemented even in simple two-field models. It produces a peak in the scalar power spectrum that can lead to significant abundances of primordial black holes and secondary gravitational waves.",
      "pdf_url": "https://arxiv.org/pdf/2602.04055.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.15929",
      "title": "Supermassive black holes swallow stellar objects at high rates: from Little Red Dots to Black Hole Stars",
      "authors": [
        "Konstantinos Kritos",
        "Joseph Silk"
      ],
      "abstract": "Supermassive black holes swallow stellar objects at high rates: from Little Red Dots to Black Hole Stars Konstantinos Kritos, Joseph Silk High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Supermassive black hole growth plausibly occurs via runaway astrophysical black hole mergers in nuclear star clusters that form intermediate mass black hole seeds at high redshifts. Such a model of Little Red Dots yields an order-of-magnitude higher rate of tidal disruption events than that of black hole captures. Our prediction, normalised to our proposed resolution of SMBH seeding, yields detectable TDE rates at high redshift. The resulting dense gas cocoons generate the nuclei of LRDs, each incorporating a central massive black-hole-star, with comparable masses in gas, stars, and massive black hole within a scale of around a parsec as inferred from the various spectral signatures.",
      "pdf_url": "https://arxiv.org/pdf/2602.15929.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17821",
      "title": "Lyα forest bounds on sterile neutrino production via neutrino self-interactions",
      "authors": [
        "Priyank Parashari",
        "Vera Gluscevic",
        "Yue Zhang",
        "Simeon Bird",
        "Mikhail M. Ivanov",
        "Adam He"
      ],
      "abstract": "Lyα forest bounds on sterile neutrino production via neutrino self-interactions Priyank Parashari, Vera Gluscevic, Yue Zhang, Simeon Bird, Mikhail M. Ivanov, Adam He Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Sterile neutrinos in the keV mass range have long been considered a well-motivated dark matter (DM) candidate. In this work, we explore a sterile neutrino production mechanism through active neutrino self-interactions in the early universe, assuming that they constitute the full DM abundance. We implement a self-consistent treatment of the sterile-neutrino free streaming and the active-neutrino self-interactions on structure formation, which yield a unique scale-dependent modification to the linear matter power spectrum. We then set bounds on this scenario using a combination of the cosmic microwave background and Ly$\\alpha$ forest constraints. Specifically, we utilize the two recent likelihoods derived from eBOSS data: (i) an effective field theory (EFT) based full-shape likelihood and (ii) a compressed likelihood obtained from the PRIYA-simulation emulator. We produce some of the most stringent observational constraints to date on sterile neutrino DM, comparable to the bounds from the most stringent laboratory constraints.",
      "pdf_url": "https://arxiv.org/pdf/2602.17821.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18218",
      "title": "First Dark Photon Search Results from the Dandelion Experiment",
      "authors": [
        "I. Ourahou",
        "C. Beaufort",
        "M. Bastero-Gil",
        "A. Catalano",
        "J. Macias-Perez",
        "S. Savorgnano",
        "D. Santos",
        "C. Smith",
        "F. Naraghi",
        "J. Bounmy",
        "D. Tourres",
        "F. Vezzu"
      ],
      "abstract": "First Dark Photon Search Results from the Dandelion Experiment I. Ourahou, C. Beaufort, M. Bastero-Gil, A. Catalano, J. Macias-Perez, S. Savorgnano, D. Santos, C. Smith, F. Naraghi, J. Bounmy, D. Tourres, F. Vezzu Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Detectors (physics.ins-det) This paper presents the first results from the Dandelion experiment, a directional detection, which searches for 1 meV dark photon dark matter. We use a spherical mirror to convert dark photons into standard millimeter-wavelength photons that can then be detected with an array of 221 Kinetic Inductance Detectors (KIDs) cooled down to 150 mK within the KISS (KIDs Interferometric Spectral Surveyor) camera and operating between 150 and 350 GHz. We used 1480 minutes of data to search for the signal of dark photons in the KID detectors, which is expected to be modulated due to the Earth's rotation. Our main challenge was to deal with a large background from room temperature and stray-light fluctuations. We used a de-correlation analysis to remove these background fluctuations. Templates of the background fluctuations were constructed from a Principal Component Analysis decomposition of detector measurements outside the expected Field of View trajectory of dark photons. We found that the dark photon signal was consistent with zero, giving a new upper limit on the dark photon's kinetic mixing, $\\chi$, with masses between 0.6 meV and 1.4 meV. These are the first constraints on dark photons as a dark matter candidate using an array of KIDs at millimeter wavelength.",
      "pdf_url": "https://arxiv.org/pdf/2602.18218.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18311",
      "title": "Cosmological Constraints on Temperature-Dependent Interaction between Dark Matter and Neutrinos",
      "authors": [
        "Ren-Peng Zhou",
        "Da Huang"
      ],
      "abstract": "Cosmological Constraints on Temperature-Dependent Interaction between Dark Matter and Neutrinos Ren-Peng Zhou, Da Huang Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We study the influence of the temperature-dependent interaction between dark matter (DM) and neutrinos on the measurement of cosmological parameters. We pay attention to the neutrino mass effects, so that the derivation of Boltzmann equations needs to specify the concrete form of interaction. We work in a model in which the DM-neutrino scatterings are induced by a dimension-six operator, and present the details for deriving the full Boltzmann hierarchy for DM and neutrinos, including a novel method to obtain the fluid approximation for modes entering the horizon. It is shown that our interaction can induce the dark acoustic oscillation in the DM-neutrino fluid, leaving distinct signatures on the CMB and matter power spectra. By using the latest CMB and BAO datasets from Planck, DESI and ACT, the constraint on today's DM-neutrino interaction parameter for the normal neutrino mass ordering reaches $u^0_{\\chi-\\nu} \\lesssim {\\cal O}(10^{-13})$, nearly nine orders stronger than that for temperature-independent case in the literature. This can be understood by noting that the scattering cross section increases nearly quadratically with cosmological temperature in the early universe, leading to enhanced effects. We have investigated alternative scenarios with different neutrino mass assumptions. In particular, models with degenerate neutrino masses give rise to weaker constraint of $u^0_{\\chi-\\nu} \\lesssim {\\cal O}(10^{-11})$, showing the importance to incorporate the realistic neutrino mass ordering in the fits. Finally, when employing the logarithmic flat prior for $u^0_{\\chi-\\nu}$, we have shown hints to a nonzero interaction at $95\\%$ CL by combining Planck, DESI and ACT data.",
      "pdf_url": "https://arxiv.org/pdf/2602.18311.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17928",
      "title": "Scaling Relations across Galaxy Classification Schemes: I. Star Formation Rate-Stellar Mass Plane of CALIFA Nearby Galaxies",
      "authors": [
        "Veselina Kalinova",
        "Keiichi Kodaira",
        "Dario Colombo"
      ],
      "abstract": "Scaling Relations across Galaxy Classification Schemes: I. Star Formation Rate-Stellar Mass Plane of CALIFA Nearby Galaxies Veselina Kalinova, Keiichi Kodaira, Dario Colombo Bulgarian Astronomical Journal 45, 2026 Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) To gain deeper insights into galaxy evolution and the mechanisms driving transitions between different galaxy morphologies, we analyse the connection between star formation rate and stellar mass for 231 galaxies spanning Hubble types E1-Sdm from the Calar Alto Legacy Integral Field Spectroscopy Area survey using three complementary classification schemes. The Hubble classification provides structural information, the circular velocity curve classification$-$based on principal component analysis$-$ traces the total gravitational potential, and the Quenching classification$-$derived from H$_{\\alpha}$ equivalent width maps$-$indicates the spatial extent of quenched regions relative to star-forming areas. We find a clear separation of galaxy populations on the star formation rate-stellar mass plane. Late-type spirals with slow-rising circular velocity curves, represented by star-forming and quiescent-nuclear-ring galaxies, dominate the blue cloud. Early-type spirals with flat or round-peaked circular velocity curves belonging to centrally quiescent or mixed class populate the green valley, representing a transitional stage. Elliptical and lenticular galaxies with round- or sharp-peaked circular velocity curves from nearly retired or fully retired QSs reside on the red sequence. Furthermore, our results indicate that the morphological groups Sc-Scd, Sd-Sdm, and E1-E3 are characterized by a unique set of QSs and circular velocity curves, while galaxies with morphologies such as Sa-Sbc spread over multiple QSs and circular velocity curves. The distribution of the classification classes shows a tight link between galaxy structure, gravitational potential, and suppression of star-formation in the galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2602.17928.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18294",
      "title": "Single and double headed ORCs in the LOFAR surveys",
      "authors": [
        "F. De Gasperin",
        "M. Brüggen",
        "T. Pasini",
        "H. Andernach",
        "A. Ivleva",
        "C. Spingola",
        "L. M. Böss",
        "J. Callingham",
        "M. Hardcastle",
        "G. Di Gennaro"
      ],
      "abstract": "Single and double headed ORCs in the LOFAR surveys F. De Gasperin, M. Brüggen, T. Pasini, H. Andernach, A. Ivleva, C. Spingola, L. M. Böss, J. Callingham, M. Hardcastle, G. Di Gennaro Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Deep radio surveys are now producing catalogues with millions of radio sources. Radio sources can have complex morphologies that depend both on the production mechanisms and the local environment. Recently, an unusual class of circular radio sources have been identified that were named \"odd radio circles\" (ORC). They have sizes of about 1', a circular/elliptical shape and appear edge brightened. Subsequent observations have suggested that this class may comprise a variety of sources. Despite various attempts to explain these sources, their origin remains unclear. The main goal of this work is to increase the number of known ORCs and derive common characteristics that can help identify the origin of these sources. We searched the LOFAR Two Metre Sky Survey (LoTSS) data release 3 (DR3) at 144 MHz for ORCs using a combination of parameter filtering on catalogue entries and visual inspection. We then identified possible optical counterparts and derived information such as redshift, physical size, and spectral index using further radio data at 54 and 1400 MHz. We isolated 18 sources with ORC structures. Four of these are double headed ORCs (ORCs with two rings), and two are new discoveries. We also found 5 new single headed ORCs and 9 candidate ORCs. With this work we significantly expanded the population of known ORCs. Our findings confirms that ORCs are a rare and heterogenous population of radio sources. We confirm the association with large ellipticals in most cases and we note a relation between the ORCs physical size and their integrated spectral index with small ORCs avoiding steep spectra.",
      "pdf_url": "https://arxiv.org/pdf/2602.18294.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.20999",
      "title": "New Interpretations of the Cosmological Preference for a Negative Neutrino Mass",
      "authors": [
        "Peter W. Graham",
        "Daniel Green",
        "Joel Meyers"
      ],
      "abstract": "New Interpretations of the Cosmological Preference for a Negative Neutrino Mass Peter W. Graham, Daniel Green, Joel Meyers 53+6 pages, 12 figures; v2: Updated to match published version Phys. Rev. D 113, 043514 (2026) Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Recent observations of the cosmic microwave background (CMB) and baryon acoustic oscillations (BAO) show some tension with a $\\Lambda$CDM cosmology. For one, the cosmological parameters determined by the CMB are at odds with the expansion history determined by latest BAO measurements. In addition, the combined data has placed uncomfortably strong constraints on neutrino mass. Both effects can be interpreted as negative neutrino mass, one describing the change to the expansion history and the other one describing enhanced lensing. In this paper, we show the current tensions can be solved with a single change either to the lensing of the CMB or the expansion of the universe. We show additional lensing could arise from a variety of models with new light fields. However, these models rarely give the same signal in temperature and polarization, giving a concrete test of the scenario. Alternatively, dark sector models can explain the changes to the expansion by changing the evolution of the matter density. These models introduce new forces, giving rise to long range signals in the three-point statistics of galaxies. We discuss a range of other examples which all illustrate the pattern that additional signals should appear if these tensions are explained by beyond the Standard Model physics.",
      "pdf_url": "https://arxiv.org/pdf/2508.20999.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.01361",
      "title": "Joint Constraints on Fuzzy and Warm Dark Matter from Satellite Populations of the Milky Way and Andromeda",
      "authors": [
        "Jianxiang Liu",
        "Yan Gong",
        "Kai Liao"
      ],
      "abstract": "Joint Constraints on Fuzzy and Warm Dark Matter from Satellite Populations of the Milky Way and Andromeda Jianxiang Liu, Yan Gong, Kai Liao 15 pages, 8 figures. Accepted for publication in ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) We perform a joint analysis of the Milky Way (MW) and Andromeda (M31) satellite populations to constrain the properties of fuzzy dark matter (FDM) and thermal-relic warm dark matter (WDM). We combine MW satellite observations from the Dark Energy Survey (DES) and Pan-STARRS1 (PS1) with M31 satellite data from the Pan-Andromeda Archaeological Survey (PAndAS), and model the corresponding observable satellite populations using the empirical galaxy--halo connection model described in Nadler et al. (2020) together with the appropriate selection functions. Uncertainties in the virial masses of the MW and M31 are incorporated through host-mass priors that linearly scale the relevant model parameters, allowing us to infer the full posterior distributions of all parameters. For the FDM case, we obtain $m_{\\mathrm{FDM}} > 1.74 \\times 10^{-20}~\\mathrm{eV}$ (95\\% CL) and $m_{\\mathrm{FDM}} > 1.42 \\times 10^{-20}~\\mathrm{eV}$ (20:1 posterior ratio). For thermal-relic WDM, we find $m_{\\mathrm{WDM}} > 6.20~\\mathrm{keV}$ (95\\% CL) and $m_{\\mathrm{WDM}} > 5.75~\\mathrm{keV}$ (20:1 posterior ratio). These results represent a moderate improvement over MW-only constraints, and provide the strongest constraints to date on the FDM and WDM derived from satellite galaxy populations in the Local Group.",
      "pdf_url": "https://arxiv.org/pdf/2512.01361.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.02928",
      "title": "Redshift Assessment Infrastructure Layers (RAIL): Rubin-era photometric redshift stress-testing and at-scale production",
      "authors": [
        "The RAIL Team",
        "Jan Luca van den Busch",
        "Eric Charles",
        "Johann Cohen-Tanugi",
        "Alice Crafford",
        "John Franklin Crenshaw",
        "Sylvie Dagoret",
        "Josue De-Santiago",
        "Juan De Vicente",
        "Qianjun Hang",
        "Benjamin Joachimi",
        "Shahab Joudaki",
        "J. Bryce Kalmbach",
        "Arun Kannawadi",
        "Shuang Liang",
        "Olivia Lynn",
        "Alex I. Malz",
        "Rachel Mandelbaum",
        "Grant Merz",
        "Irene Moskowitz",
        "Drew Oldag",
        "Jaime Ruiz-Zapatero",
        "Mubdi Rahman",
        "Markus M. Rau",
        "Samuel J. Schmidt",
        "Jennifer Scora",
        "Raphael Shirley",
        "Benjamin Stölzner",
        "Laura Toribio San Cipriano",
        "Luca Tortorelli",
        "Ziang Yan",
        "Tianqing Zhang",
        "the Dark Energy Science Collaboration"
      ],
      "abstract": "Redshift Assessment Infrastructure Layers (RAIL): Rubin-era photometric redshift stress-testing and at-scale production The RAIL Team, Jan Luca van den Busch, Eric Charles, Johann Cohen-Tanugi, Alice Crafford, John Franklin Crenshaw, Sylvie Dagoret, Josue De-Santiago, Juan De Vicente, Qianjun Hang, Benjamin Joachimi, Shahab Joudaki, J. Bryce Kalmbach, Arun Kannawadi, Shuang Liang, Olivia Lynn, Alex I. Malz, Rachel Mandelbaum, Grant Merz, Irene Moskowitz, Drew Oldag, Jaime Ruiz-Zapatero, Mubdi Rahman, Markus M. Rau, Samuel J. Schmidt, Jennifer Scora, Raphael Shirley, Benjamin Stölzner, Laura Toribio San Cipriano, Luca Tortorelli, Ziang Yan, Tianqing Zhang, the Dark Energy Science Collaboration Accepted by OJAp, 21 pages, 6 figures, 5 tables Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Virtually all extragalactic use cases of the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) require the use of galaxy redshift information, yet the vast majority of its sample of tens of billions of galaxies will lack high-fidelity spectroscopic measurements thereof, instead relying on photometric redshifts (photo-$z$) subject to systematic imprecision and inaccuracy best encapsulated by photo-$z$ probability density functions (PDFs). We present the version 1 release of Redshift Assessment Infrastructure Layers (RAIL), an open source Python library for at-scale probabilistic photo-$z$ estimation, initiated by the LSST Dark Energy Science Collaboration (DESC) with contributions from the LSST Interdisciplinary Network for Collaboration and Computing (LINCC) Frameworks team. RAIL's three subpackages provide modular tools for end-to-end stress-testing, including a forward modeling suite to generate realistically complex photometry, a unified API for estimating per-galaxy and ensemble redshift PDFs by an extensible set of algorithms, and built-in metrics of both photo-$z$ PDFs and point estimates. RAIL serves as a flexible toolkit enabling the derivation and optimization of photo-$z$ data products at scale for a variety of science goals and is not specific to LSST data. We thus describe to the extragalactic science community, including and beyond Rubin the design and functionality of the RAIL software library so that any researcher may have access to its wide array of photo-$z$ characterization and assessment tools.",
      "pdf_url": "https://arxiv.org/pdf/2505.02928.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.13677",
      "title": "Unveiling Electron Density Profile in Nearby Galaxies using SDSS MaNGA",
      "authors": [
        "Shivam Burman",
        "Sunil Malik",
        "Suprit Singh",
        "Yogesh Wadadekar"
      ],
      "abstract": "Unveiling Electron Density Profile in Nearby Galaxies using SDSS MaNGA Shivam Burman, Sunil Malik, Suprit Singh, Yogesh Wadadekar Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Most observational studies of galactic-scale magnetic fields using Faraday rotation rely on estimates of thermal electron densities in galaxies and their radial variations. However, the spatial distribution of electrons in the interstellar medium (ISM) is not clearly known. In this study, we propose and utilize collision-excited doublet emission line ratios of [S II] $\\lambda\\lambda$ 6716, 6731 $Å$ to estimate the electron densities ($n_e$). To map their distribution in the galaxies, we employ IFU spectroscopic observations from the SDSS MaNGA survey, utilising data products from both the MaNGA Data Analysis Pipeline (DAP). We present a spatially resolved analysis of $66$ face-on galaxies (inclination, $i \\leq 15^\\circ$), including $46$ star-forming galaxies (SFGs) and $20$ Non-SFGs. Azimuthally averaged radial profiles of $n_e$ are obtained. We found that both SFGs and Non-SFGs exhibit $n_e$ gradients, with higher densities of $n_e$(S II) = $52.87 \\pm 8.32$ cm$^{-3}$ and $99.39 \\pm 24.37$ cm$^{-3}$, respectively, in the inner disk region (r/R$_e$ $\\leq$ 1.5), which decreases to $n_e$(S II) = $20.92 \\pm 4.2$ cm$^{-3}$ in SFGs and $34.64 \\pm 11.24$ cm$^{-3}$ in Non-SFGs, in the outer disk region (r/R$_e$ $>$ 1.5). We have also analysed these sources with Pipe3D fluxes. We translated $n_e$ to electron column densities ($N_e$) by assuming a typical disk of thickness 1 kpc and note that $N_e \\sim 10^{22}$ cm$^{-2}$ at $\\sim$14 kpc in the disk outer region. We have also discussed the profiles obtained using [O II] $\\lambda\\lambda$ 3726, 3729 $Å$ doublet. These electron density estimates at different radii provide valuable insights for resolving ambiguities in current and future studies of magnetic fields in galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2505.13677.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.10058",
      "title": "The Cosmic Owl: Twin Active Collisional Ring Galaxies with Starburst Merging Front at $z=1.14$",
      "authors": [
        "Mingyu Li",
        "Bjorn H. C. Emonts",
        "Zheng Cai",
        "Takumi S. Tanaka",
        "Wilfried Mercier",
        "Yunjing Wu",
        "Fujiang Yu",
        "Fengwu Sun",
        "Fuyan Bian",
        "Emanuele Daddi",
        "Xiaohui Fan",
        "Xiaojing Lin",
        "Jianwei Lyu",
        "Jeyhan S. Kartaltepe",
        "Francesco Valentino"
      ],
      "abstract": "The Cosmic Owl: Twin Active Collisional Ring Galaxies with Starburst Merging Front at $z=1.14$ Mingyu Li, Bjorn H. C. Emonts, Zheng Cai, Takumi S. Tanaka, Wilfried Mercier, Yunjing Wu, Fujiang Yu, Fengwu Sun, Fuyan Bian, Emanuele Daddi, Xiaohui Fan, Xiaojing Lin, Jianwei Lyu, Jeyhan S. Kartaltepe, Francesco Valentino Accepted by ApJ, 17 pages, 9 figures Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Galaxy mergers play a critical role in driving galaxy evolution, especially by transforming galaxy morphology, redistributing gas around galaxies, triggering active galactic nuclei (AGN), and stimulating star formation. We present the Cosmic Owl, a galaxy merger at $z=1.14$, identified in the COSMOS field. Deep imaging and spectroscopy from JWST, ALMA, and VLA reveal a complex system of twin collisional ring galaxies, exhibiting nearly identical morphologies. The grism spectra from the JWST COSMOS-3D program confirm that both galaxies host an AGN. A bipolar radio jet from one AGN extends to strike the merging front. In addition, we detect a starburst at the merging front, characterized by luminous extended nebular line emission and a massive cold gas reservoir. This starburst is likely triggered by interstellar shocks induced by galaxy collision and the AGN jet. The twin ring structure of the Cosmic Owl requires further numerical simulations to clarify the precise conditions that lead to the formation of this rare morphology. This system exemplifies how shock-induced star formation, driven by galaxy collision or AGN jet, can act as a crucial mechanism for triggering intense starbursts in the early Universe.",
      "pdf_url": "https://arxiv.org/pdf/2506.10058.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.12120",
      "title": "No evidence for Keplerian taper of far-out galactic rotation",
      "authors": [
        "Adriana Bariego-Quintana",
        "Felipe J. Llanes-Estrada"
      ],
      "abstract": "No evidence for Keplerian taper of far-out galactic rotation Adriana Bariego-Quintana, Felipe J. Llanes-Estrada 20 pages, 7 figures Revised according to referee observations Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a statistical analysis of the 175 SPARC galactic rotation curves to test the hypothesis of whether the Keplerian velocity tapering at large radii ($V(r)\\propto 1/\\sqrt{r}$) germane to a convergent mass distribution in typical spherical halo models agrees with observational data. The null hypothesis is Rubin's flat-rotation curve, $V(r)=\\text{constant}$ -such as can be obtained from a spherical, isothermal-like density profile, or alternatively with a very prolate halo-. To decide whether we adopt the null (Rubin behaviour) or alternative (Keplerian behaviour) hypothesis, we evaluate the derivative in each galaxy of $V(r)$ with its last data points. The test is model independent inasmuch we are testing for the \\emph{slope} of the dark matter rotation curve, whether it is or not compatible with zero. We conclude that the data is presently compatible with the null hypothesis -no taper off, no decline of $V(r)$ is seen. Separately, beyond SPARC, our own Milky Way galaxy, for which recent data sets have been reported, does show clear $V(r)$ fall-off at the level of 20\\%.",
      "pdf_url": "https://arxiv.org/pdf/2507.12120.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17755",
      "title": "Relativistic Magnetohydrodynamic Simulations of Giant Magnetar Bursts",
      "authors": [
        "Koushik Chatterjee",
        "Alexander Philippov",
        "Andrei M. Beloborodov",
        "Kyle Parfrey",
        "Bart Ripperda",
        "Elias R. Most"
      ],
      "abstract": "Relativistic Magnetohydrodynamic Simulations of Giant Magnetar Bursts Koushik Chatterjee, Alexander Philippov, Andrei M. Beloborodov, Kyle Parfrey, Bart Ripperda, Elias R. Most High Energy Astrophysical Phenomena (astro-ph.HE) Gradual crustal deformation can generate strongly twisted magnetic fields around magnetars, potentially triggering giant flares with total energies exceeding $10^{44}\\,\\mathrm{erg}$. In this Letter, we present the first relativistic magnetohydrodynamic simulation of a surface shear-driven magnetar eruption, capturing reconnection-driven plasma heating, the ejection of relativistically hot plasma, and the formation of a hot fireball confined within the inner magnetosphere. We find that magnetic reconnection in the equatorial current sheet launches a hot trailing outflow capable of powering the initial spike observed in giant flares, while simultaneously leaving behind a thermally stratified fireball with sufficient thermal energy to produce the pulsating, decaying tail. Together, these features provide a self-consistent physical framework for understanding the observed energetics of magnetar giant flares. The eruption also expels a magnetically dominated giant plasmoid carrying up to $\\sim 9\\%$ of the magnetosphere's total magnetic energy. Furthermore, our simulation demonstrates how the plasmoid drives the formation of a blast wave -- an important ingredient in models linking magnetar eruptions to fast radio bursts.",
      "pdf_url": "https://arxiv.org/pdf/2602.17755.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17759",
      "title": "Addressing the Impact of Solar Modulation Systematic Uncertainties on Cosmic-Ray Propagation Models",
      "authors": [
        "Isabelle John",
        "Alessandro Cuoco",
        "Mattia Di Mauro"
      ],
      "abstract": "Addressing the Impact of Solar Modulation Systematic Uncertainties on Cosmic-Ray Propagation Models Isabelle John, Alessandro Cuoco, Mattia Di Mauro 17 pages, 10 figures, 2 tables. Appendices add 21 pages, 9 figures, 5 tables High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We perform a comprehensive analysis of cosmic-ray propagation using the time-dependent AMS-02 flux measurements covering a full solar cycle, with particular emphasis on the role of solar modulation. We fit two representative Galactic propagation scenarios, convection- and re-acceleration-dominated models, in combination with three solar modulation prescriptions: the standard force-field approximation, an extended force-field model with a rigidity break, and the heliospheric propagation code $\\texttt{HelMod}$. The inclusion of time-resolved antiproton data provides a unique probe of charge-sign-dependent modulation effects and low-energy systematics. We find that the force-field approximation can describe positively charged nuclei reasonably well outside the solar maximum in convection-dominated models, but fails during periods of high solar activity and for antiprotons at all times. In re-acceleration scenarios, strong degeneracies between solar modulation and low-energy propagation lead to unphysical results when simple modulation models are employed. Across all models, we identify systematic uncertainties of order 10-15% in the reconstructed local interstellar spectra and propagation parameters, driven by limitations in current solar modulation modelling. Compared to the percent level error of current measurements, these uncertainties significantly limit the precision of cosmic-ray studies. Future time-dependent measurements spanning a full 22-year solar cycle will be crucial to reduce these uncertainties.",
      "pdf_url": "https://arxiv.org/pdf/2602.17759.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18105",
      "title": "TROYE: Modeling Dynamic Phase Transitions in Gravitational Waves from Neutron Star-Black Hole Mergers",
      "authors": [
        "Ofek Dan",
        "Ofek Birnholtz"
      ],
      "abstract": "TROYE: Modeling Dynamic Phase Transitions in Gravitational Waves from Neutron Star-Black Hole Mergers Ofek Dan, Ofek Birnholtz 14 pages, 10 figures, open-source codebase available at this https URL High Energy Astrophysical Phenomena (astro-ph.HE) The Equation of State (EoS) of dense nuclear matter remains one of the most compelling open questions in high-energy astrophysics. While static EoS models are increasingly well-constrained by observations of binary neutron star (BNS) inspirals, the possibility of a dynamic phase transition occurring during the coalescence has been thus far deferred from standard gravitational-wave (GW) analyses. In this work, we investigate the detectability of such a phase transition, manifesting as a macroscopic shift in the tidal deformability parameter $\\Lambda$, using GWs from Neutron Star-Black Hole (NSBH) coalescences. We argue that NSBH systems serve as a cleaner laboratory for this phenomenology than BNS systems due to the absence of the $\\tilde{\\Lambda}(\\Lambda_1,\\Lambda_2)$ degeneracy, allowing for the isolation of single-body tidal evolution. We introduce a phenomenological waveform model, TROYE (Transitional Representation Of varYing Equation-of-state), which stitches together two waveform approximants in the time domain to simulate a smooth but rapid transition between two equations of state during the late inspiral. We perform a comprehensive Bayesian injection and recovery campaign on 100 simulated events using the bilby inference library. Our results demonstrate that a phase transition corresponding to a tidal shift of $|\\Delta\\Lambda| \\gtrsim 400$ is detectable with Advanced LIGO design sensitivity, yielding decisive statistical evidence ($\\ln B > 5$). We further identify a \"V-shape\" asymmetry in detectability, where \"softening\" transitions (decreasing $\\Lambda$) are systematically easier to detect than \"stiffening\" ones due to the specific phase evolution of the tidal sector. Finally, we present \"stress tests\" showing that the transition remains recoverable even when marginalized over uncertainties in the stitching time and binary mass ratio.",
      "pdf_url": "https://arxiv.org/pdf/2602.18105.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.18118",
      "title": "Updated Air-Shower $X_{\\rm max}$ Moment Parametrizations for UHECR Composition with Latest Hadronic Interaction Models",
      "authors": [
        "Carmelo Evoli",
        "Igor Vaiman",
        "Sergio Petrera",
        "Francesco Salamida"
      ],
      "abstract": "Updated Air-Shower $X_{\\rm max}$ Moment Parametrizations for UHECR Composition with Latest Hadronic Interaction Models Carmelo Evoli, Igor Vaiman, Sergio Petrera, Francesco Salamida 19 pages, 10 figures, 5 tables. All data products and fit coefficients used in this work are publicly available via Zenodo at this https URL High Energy Astrophysical Phenomena (astro-ph.HE) The mass composition of ultra-high-energy cosmic rays (UHECRs) is commonly inferred from the first two moments of the depth of shower maximum, $X_{\\rm max}$, measured by fluorescence and hybrid detectors. Such analyses require fast and accurate mappings between the moments of $X_{\\rm max}$ and those of the logarithmic mass, $\\ln A$, based on realistic air-shower simulations. In this work we provide updated parametrizations of the $X_{\\rm max}$ moments and distributions for air showers initiated by nuclei from proton to iron, simulated with CONEX for three state-of-the-art hadronic interaction models: Epos LHC-R, Sibyll 2.3e, and QGSJet-III-01. We parametrize the mean depth $\\langle X_{\\rm max}\\rangle$ and the variance $\\sigma^2(X_{\\rm max})$ as functions of energy and mass. For the variance we compare a second-order polynomial model with an exponential model. In addition, we model the full $X_{\\rm max}$ distributions with a three-parameter generalized Gumbel function. The Gumbel parameters are fitted using an unbinned likelihood and are validated by comparing the implied mean and variance with the raw CONEX samples and with the moment parametrizations. Across the full energy range considered, residuals between the parametrizations (or the Gumbel representation) and the simulations are at the level of a few g cm$^{-2}$ for the mean and a few (g cm$^{-2}$)$^2$ for the variance, making these parametrizations suitable for precision UHECR composition studies and forward-folding analyses of $X_{\\rm max}$ distributions.",
      "pdf_url": "https://arxiv.org/pdf/2602.18118.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18191",
      "title": "A geometric physics-informed machine learning inference for the neutron star maximum mass and the inverse problem",
      "authors": [
        "Rounak Mukherjee",
        "Ritam Mallick"
      ],
      "abstract": "A geometric physics-informed machine learning inference for the neutron star maximum mass and the inverse problem Rounak Mukherjee, Ritam Mallick High Energy Astrophysical Phenomena (astro-ph.HE) The existence of a distinct mass boundary between the heaviest neutron stars and the lightest black holes remains in question. It is an artefact of our ignorance of the properties of matter at supra-nuclear densities, which exist in the cores of neutron stars. The study addresses these problems with a physics-informed machine learning approach, guided by astrophysical observations. The Transformer model is trained on an agnostically generated ensemble of equations of state. Two geometric parameters are defined on the mass-radius sequence of a neutron star--the front bending and the back bending. The transformer provides a two-step solution: first, the model predicts the maximum mass and radius using the bending parameters. Second, it predicts the square of the sound speed profile, completing the inverse mapping. The prediction is that massive neutron stars form when the sound speed peaks at low density, leading to strong back-bending and an early phase transition to quark matter. Massive stars favour a stiff equation of state at low density, and the density of matter at the star's core is sufficiently small. The maximum mass for a neutron star predicted by the astrophysical constrained transformer model is $2.477$ solar masses, and a minimum radius of about $11.498$ km for a neutron star of $1.4$ solar masses.",
      "pdf_url": "https://arxiv.org/pdf/2602.18191.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18367",
      "title": "Numerical simulations of cold clumps in the hot accretion flows around black holes",
      "authors": [
        "Na-Duo Liu",
        "Yu-Heng Sheng",
        "De-Fu Bu",
        "Xiao-Hong Yang",
        "Mao-Chun Wu",
        "Ren-Yi Ma"
      ],
      "abstract": "Numerical simulations of cold clumps in the hot accretion flows around black holes Na-Duo Liu, Yu-Heng Sheng, De-Fu Bu, Xiao-Hong Yang, Mao-Chun Wu, Ren-Yi Ma 14 pages, 10 figures, accepted for publication by ApJ High Energy Astrophysical Phenomena (astro-ph.HE) Previous numerical simulations have shown that cold clumps can form within hot accretion flows, offering insights into the detailed processes of the state transition in black hole X-ray binaries. However, the evolution of the cold clumps has not been investigated in detail yet. In this paper, we conduct hydrodynamic simulations to investigate the evolution of the cold clumps. In addition to previous result that when the accretion rate is high enough the cold clumps emerge within the hot accretion flow, we found that instead of directly moving toward to the black hole, the clumps moves outward when they initially form. The reason should be the combination of viscous torque and the condensation of hot gas from larger radii, which lead to the slightly super-Keplerian angular momentum of the clumps. After reaching the equilibrium position, the clumps begin to fragment at the inner edge with each fragment moving inward sequentially. Generally, the azimuthal movement of the clumps are quasi-Keplerian, being closer to the outer detached Keplerian cold disk rather than the surrounding sub-Keplerian hot accretion flow, which agrees well with the semi-analytical results for weak coupling case in Wang et al. (2012).",
      "pdf_url": "https://arxiv.org/pdf/2602.18367.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18436",
      "title": "Chandra Proper Motions and Milliarcsecond Astrometry of Nineteen Pulsars",
      "authors": [
        "Jack T. Dinsmore",
        "Roger W. Romani"
      ],
      "abstract": "Chandra Proper Motions and Milliarcsecond Astrometry of Nineteen Pulsars Jack T. Dinsmore, Roger W. Romani 11 + 3 pages, 4 figures, 2 tables. Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present X-ray proper motion (PM) measurements of 19 pulsars using new and archival data from the Chandra X-ray Observatory, including pulsar wind trails and X-ray filaments. Precise X-ray PMs are often limited by uncertainties in aligning observations to a common reference frame. Our analysis uses unresolved X-ray flux from stars in the Gaia catalog in addition to X-ray bright point sources for alignment, improving uncertainties. We obtain absolute positions referenced to Gaia with typical astrometric precision $\\sim$10 mas and PM statistical uncertainties down to 1.3 mas yr$^{-1}$, the most precise X-ray PM achieved to date. With our improved frame alignment, PM accuracies are now limited by the pulsar flux in most cases. These results reveal a new X-ray filament and illuminate the wind nebula structures and origins of several of these pulsars.",
      "pdf_url": "https://arxiv.org/pdf/2602.18436.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17762",
      "title": "Teen TITANS simulations -- I. Inefficient intermediate-mass black hole seeding via stellar collisions in young massive clusters",
      "authors": [
        "Benedetta Mestichelli",
        "Sara Rastello",
        "Michela Mapelli",
        "Manuel Arca Sedda",
        "Marica Branchesi"
      ],
      "abstract": "Teen TITANS simulations -- I. Inefficient intermediate-mass black hole seeding via stellar collisions in young massive clusters Benedetta Mestichelli, Sara Rastello, Michela Mapelli, Manuel Arca Sedda, Marica Branchesi 14 pages, 12 figures, 2 tables. Comments welcome Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Young massive clusters (YMCs) provide favorable environments for frequent stellar collisions, potentially leading to the formation of very massive stars (VMSs) and seeds of intermediate-mass black holes (IMBHs). We investigate the role of repeated stellar collisions in YMCs using TITANS, a new suite of 18 direct $N$-body simulations. Our models span cluster masses $10^5 - 10^6\\,\\rm M_\\odot$, half-mass densities $\\rho_{\\rm h}=100 - 10^5\\,\\rm M_\\odot\\,pc^{-3}$, and include high primordial binary fractions, consistent with observations of massive stars in young clusters. Overall, our simulations assume cluster properties that are typical of YMCs in the low-redshift Universe. We find that repeated stellar collisions are efficient only in the densest clusters with short relaxation times and are absent in systems with $\\rho_{\\rm h}<500\\,\\rm M_\\odot\\,pc^{-3}$ and $t_{\\rm rh}>1.3\\,\\rm Gyr$. Rapid mass segregation allows massive stars to sink to the cluster center, merge, and undergo subsequent collisions, even in clusters with long core-collapse times. However, collision chains are typically triggered by primordial binary mergers and usually involve only two collisions. In our simulations, only three VMSs form through repeated collisions and reach $m_*>330\\,\\rm M_\\odot$, while most VMSs have $m_*<300\\,\\rm M_\\odot$ and form through primordial binary mergers. None constitute viable IMBH seeds, as their helium cores fall in the (pulsational) pair-instability regime. We form five IMBHs from stellar collisions involving stars at different evolutionary stages, while the dominant channel is the merger of stellar-mass black holes, producing twelve IMBHs. For properties typical of local YMCs, stellar collision chains are therefore inefficient in producing IMBHs more massive than $140\\,\\rm M_\\odot$, as most collisionally formed VMSs attain masses that fall in the pair-instability regime.",
      "pdf_url": "https://arxiv.org/pdf/2602.17762.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.11966",
      "title": "A solution to the tension of burning on neutron stars and nuclear physics",
      "authors": [
        "Y. Cavecchi",
        "D. Galloway",
        "A. Heger",
        "P. SantillÁn-Ortega",
        "M. Nava-Callejas",
        "F. M. Vincentelli",
        "L. Rivera Sandoval",
        "A. Goodwin",
        "Z. Johnston",
        "S. Puente Mancilla",
        "D. Page"
      ],
      "abstract": "A solution to the tension of burning on neutron stars and nuclear physics Y. Cavecchi, D. Galloway, A. Heger, P. SantillÁn-Ortega, M. Nava-Callejas, F. M. Vincentelli, L. Rivera Sandoval, A. Goodwin, Z. Johnston, S. Puente Mancilla, D. Page The Astrophysical Journal, 998:25 (14pp), 2026 February 10 High Energy Astrophysical Phenomena (astro-ph.HE) When neutron stars accrete matter from a companion star, this matter forms a disc around them and eventually falls on their surface. Here, the fuel can ignite into bright flashes called Type I bursts. Theoretical calculations based on state-of-the-art nuclear reactions are able to explain many features of the bursts. However, models predict that the bursts should cease at high accretion rates, whereas in many sources they disappear at much lower rates. Moreover, their recurrence times also show strong discrepancies with predictions. Although various solutions have been proposed, none can account for all the observational constraints. Here we describe a new model that explains all the contradictory behaviours within a single picture. We are able to reconstruct the conditions on the star surface that determine the burst properties by comparing data to new simulations. We find strong evidence that the physical mechanism driving the burst behaviour is the structure of the accretion disc in the regions closest to the star. This connection reconciles the puzzling burst phenomenology with nuclear physics and also opens a new window on the study of accretion processes around compact objects.",
      "pdf_url": "https://arxiv.org/pdf/2506.11966.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.15288",
      "title": "$r$-process Heating Feedback on Disk Outflows from Neutron Star Mergers",
      "authors": [
        "Li-Ting Ma",
        "Kuo-Chuan Pan",
        "Meng-Ru Wu",
        "Rodrigo Fernández"
      ],
      "abstract": "$r$-process Heating Feedback on Disk Outflows from Neutron Star Mergers Li-Ting Ma, Kuo-Chuan Pan, Meng-Ru Wu, Rodrigo Fernández 17 pages, 11 figures. Accepted for publication in The Astrophysical Journal. This version matches the accepted manuscript High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Theory (nucl-th) Neutron star mergers produce $r$-process elements, with yields that are sensitive to the kinematic and thermodynamic properties of the ejecta. These ejecta properties are potentially affected by dynamically-important feedback from $r$-process heating, which is usually not coupled to the hydrodynamics in post-merger simulations modeling the ejecta launching and expansion. The multi-messenger detection of GW170817 showed the importance of producing reliable ejecta predictions, to maximize the diagnostic potential of future events. In this paper, we develop a prescription for including $r$-process heating as a source term in the hydrodynamic equations. This prescription depends on local fluid properties and on the $Y_{e}$ history as recorded by dedicated tracer particles, which exchange information with the grid using the Cloud-in-Cell method. The method is implemented in long-term viscous hydrodynamic simulations of accretion disk outflows to investigate its feedback on ejecta properties. We find that $r$-process heating can increase the unbound disk ejecta mass by $\\sim 10\\%$ relative to a baseline case that only considers alpha particle recombination. Nuclear heating also enhances the radial velocity of the ejecta with $Y_e < 0.25$ by up to a factor of two, while concurrently suppressing marginally-bound convective ejecta.",
      "pdf_url": "https://arxiv.org/pdf/2508.15288.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09590",
      "title": "Ultra-high energy event KM3-230213A as a cosmogenic neutrino in light of minimal UHECR flux models",
      "authors": [
        "M. Yu. Kuznetsov",
        "N. A. Petrov",
        "Y. S. Savchenko"
      ],
      "abstract": "Ultra-high energy event KM3-230213A as a cosmogenic neutrino in light of minimal UHECR flux models M. Yu. Kuznetsov, N. A. Petrov, Y. S. Savchenko 12 pages, 5 figures; accepted to JETP Lett High Energy Astrophysical Phenomena (astro-ph.HE) Recently, the KM3NeT experiment reported the detection of a neutrino with exceptionally high energy E = 220 PeV, whose origin remains unclear. The corresponding value of the neutrino flux is in tension with the results of other high-energy neutrino experiments. In this study, we discuss the possibility that this neutrino is cosmogenic, i. e., produced by ultra-high energy cosmic rays (UHECR) during their propagation through the intergalactic medium. We adopt the UHECR flux models derived by the Telescope Array experiment, which features a predominantly light mass composition. We show that the predictions of the cosmogenic neutrino flux in these models are consistent with the measurements of the KM3NeT-only and with that of the \"global neutrino observatory\" at approximately 2${\\sigma}$ level. Notably, this result is achieved in a minimal version of the UHECR flux models, that assume one source population with a standard cosmological evolution. We also estimate the corresponding cosmogenic gamma-ray flux and show that it is consistent with Fermi-LAT IGRB measurements and UHE gamma-ray limits; the improvement of the latter can probe these predictions in future.",
      "pdf_url": "https://arxiv.org/pdf/2509.09590.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.21461",
      "title": "Stochastic analysis of ultra-high energy cosmic ray interactions",
      "authors": [
        "Leonel Morejon",
        "Karl-Heinz Kampert"
      ],
      "abstract": "Stochastic analysis of ultra-high energy cosmic ray interactions Leonel Morejon, Karl-Heinz Kampert Accepted for publication in Astronomy & Astrophysics (A&A) High Energy Astrophysical Phenomena (astro-ph.HE); Nuclear Experiment (nucl-ex); Nuclear Theory (nucl-th) Photonuclear interactions between ultra-high-energy cosmic ray (UHECR) nuclei and surrounding photon fields are key to understanding the connection between the compositions observed at Earth and those emitted from the sources. These interactions can completely disintegrate a nucleus of iron over trajectory lengths of a few and up to hundreds of megaparsecs, depending on the energy of the UHECR. The stochastic nature of these interactions means that it is not possible to describe them deterministically for a single cosmic ray, and an exact formulation of the probability distributions is not yet available. Current approaches describe these interactions using either Monte Carlo simulations or solving ordinary differential equations that neglect stochasticity. Because of the limitations of these approaches, only partial capture of the process is achieved. This paper presents an analytic probabilistic description of UHECR interactions and the resulting nuclear cascades, establishing their connection to Markov jump processes. The fundamental properties of these cascades are presented, as is the computation of the usual quantities of interest, such as the horizon, spectrum, and composition. The benefits of this description are outlined using astrophysical examples related to extragalactic propagation and UHECR sources.",
      "pdf_url": "https://arxiv.org/pdf/2509.21461.pdf",
      "categories": [
        "astro-ph.HE",
        "nucl-ex",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22779",
      "title": "Ultra-long Gamma-ray Bursts from Micro-Tidal Disruption Events: The Case of GRB 250702B",
      "authors": [
        "Paz Beniamini",
        "Hagai B. Perets",
        "Jonathan Granot"
      ],
      "abstract": "Ultra-long Gamma-ray Bursts from Micro-Tidal Disruption Events: The Case of GRB 250702B Paz Beniamini, Hagai B. Perets, Jonathan Granot 11 pages, 1 figure. Published in the Open Journal of Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE) Ultra-long gamma-ray bursts (ULGRBs), a rare class of high-energy transients with durations $>10^3$s, remain poorly understood. GRB 250702B is notable for its multi-hour prompt emission, an X-ray pre-peak emission starting $\\sim$1 day earlier, off-nuclear host position, and hard, rapidly variable gamma-rays. This combination is difficult to explain with standard ULGRB progenitors such as blue-supergiant collapsars, magnetar engines, or white-dwarf tidal disruptions by intermediate-mass black holes. We interpret the event as a micro-tidal disruption event ($\\mu$TDE), where a stellar-mass black hole or neutron star partially or fully disrupts a main-sequence star. Three $\\mu$TDE pathways can reproduce the observed pre-peak emission to main flare delay: (i) a dynamical (partial/repeating) disruption, in which a grazing passage yields a faint precursor and the core returns after $\\sim$day for a deeper encounter; (ii) a natal-kick disruption, where the delay reflects the ballistic motion of a newborn compact object relative to its companion, leading to full disruption; and (iii) a hybrid natal-kick + partial case, in which the kick seeds the close encounter but the first passage is only partial, with the core returning on the day-scale period. Cross-section scalings imply comparable rates for partial and full outcomes in both dynamical and natal-kick scenarios. The highly variable, hard $\\gamma$-ray emission supports association with a stellar-mass compact object. Fallback and viscous accretion naturally explain the ultra-long duration, energetics, and ks-scale X-ray variability. We outline observational discriminants between the three channels and argue that $\\mu$TDEs offer a compelling framework for ULGRBs such as GRB 250702B.",
      "pdf_url": "https://arxiv.org/pdf/2509.22779.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.05120",
      "title": "Multigroup Radiation Diffusion on a Moving Mesh: Implementation in RICH and Application to Tidal Disruption Events",
      "authors": [
        "Itamar Giron",
        "Menahem Krief",
        "Nicholas C. Stone",
        "Elad Steinberg"
      ],
      "abstract": "Multigroup Radiation Diffusion on a Moving Mesh: Implementation in RICH and Application to Tidal Disruption Events Itamar Giron, Menahem Krief, Nicholas C. Stone, Elad Steinberg High Energy Astrophysical Phenomena (astro-ph.HE); Computational Physics (physics.comp-ph) Radiation-hydrodynamics (RHD) determines the bulk evolution and observable emission in a wide variety of high-energy astrophysical phenomena. Due to their complexity, RHD problems must usually be studied through numerical simulation. We have extended the publicly available RICH code, which previously solved the equations of RHD in the limit of grey flux-limited diffusion (FLD), to operate with a multigroup FLD solver. RICH is a semi-Lagrangian code that solves the equations of RHD on an unstructured moving mesh, and is the first multigroup RHD moving mesh code, making it uniquely applicable to problems with extreme dynamic range and dynamically important radiation forces. We validate our multigroup module against multiple analytic benchmarks, including a novel test of the RHD Doppler term. The computational efficiency of the code is aided by a novel scheme to accelerate convergence in optically thick cells by limiting the absorption coefficients. Finally, we apply multigroup \\textsc{rich} in a pilot three dimensional study of a stellar tidal disruption event (TDE), using a $10^4 M_\\odot$ intermediate-mass black hole. Our simulations self-consistently produce a bright early-time X-ray flash prior to peak optical/UV light, in qualitative agreement with post-processing of (grey) RICH simulations of supermassive black hole TDEs, as well as X-ray observations of the TDE AT 2022dsb.",
      "pdf_url": "https://arxiv.org/pdf/2601.05120.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.19329",
      "title": "The dramatic transition of the extreme Red Supergiant WOH G64 to a Yellow Hypergiant",
      "authors": [
        "G. Munoz-Sanchez",
        "M. Kalitsounaki",
        "S. de Wit",
        "K. Antoniadis",
        "A.Z. Bonanos",
        "E. Zapartas",
        "K. Boutsia",
        "E. Christodoulou",
        "G. Maravelias",
        "I. Soszynski",
        "A. Udalski"
      ],
      "abstract": "The dramatic transition of the extreme Red Supergiant WOH G64 to a Yellow Hypergiant G. Munoz-Sanchez, M. Kalitsounaki, S. de Wit, K. Antoniadis, A.Z. Bonanos, E. Zapartas, K. Boutsia, E. Christodoulou, G. Maravelias, I. Soszynski, A. Udalski 46 pages, 11 figures, 4 Tables. Accepted to Nature Astronomy. This paper is under press embargo until 23rd February, 6 pm UTC Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Red Supergiants (RSGs) are cool, evolved massive stars in their final evolutionary stage before exploding as a supernova. However, the evolution and fate of the most luminous RSGs remain uncertain. Observational evidence for luminous warm, post-RSG objects and the apparent lack of luminous RSGs as supernova progenitors suggest a blueward evolution. Since the 1980s, WOH G64 has been considered the most extreme RSG in the Large Magellanic Cloud, given its large obscuration, outstanding size, luminosity, and mass-loss rate. Here we report a sudden, yet smooth change in its apparent nature. Time-series photometry and subsequent spectroscopy revealed the most extreme transition ever seen in the optical spectral features of a RSG. We discovered that WOH G64 is a rare, massive symbiotic binary system where the RSG transitioned to a Yellow Hypergiant. The dramatic transition can be explained either by the partial ejection of the pseudo-atmosphere during a common-envelope phase, or the return to a quiescent state after an outstanding eruption exceeding 30 years. WOH G64 offers a unique opportunity to witness stellar evolution in real-time and assess the role of binarity on the final phases of massive stars and their resulting supernovae.",
      "pdf_url": "https://arxiv.org/pdf/2411.19329.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17763",
      "title": "Bonnor-Ebert sphere collapse in filamentary structures",
      "authors": [
        "Stefan Heigl",
        "Andreas Burkert"
      ],
      "abstract": "Bonnor-Ebert sphere collapse in filamentary structures Stefan Heigl, Andreas Burkert Astrophysics of Galaxies (astro-ph.GA) Star formation within filaments may arise due to the growth of cores according to linear perturbation theory. This implies a minimum core separation, as shorter modes would not be able to grow. While many observations agree with core separations by theoretical predictions, some observations also show star forming cores which lie closer together than the minimum wavelength given by perturbation theory. We explore whether non-linear effects during the late stages of core growth can explain the discrepancy between theory and observations. We perform three-dimensional hydrodynamical simulations with the Ramses code to follow the evolution of initial perturbations within filaments and compare the measured growth rates to expectations from theoretical models. Non-linear evolution sets in as soon as the core mass reaches a value where the gravitational potential is not any longer dominated by the cylindrical potential of the filament but by the spherical potential of the Bonnor-Ebert sphere. Consequently, core collapse is not triggered by the loss of hydrostatic stability of the filament but by the loss of hydrostatic stability of the Bonnor-Ebert sphere. As the core is embedded in the filament, the maximum core mass is given by the pressure within the filament which results in a constant line-mass threshold for core collapse. As core collapse is triggered as soon as overdensities reach a certain line-mass, cores which form as large line-mass perturbations during filament formation can go into direct collapse even if their separation is closer than predicted by linear perturbation theory. Therefore, our result can explain the discrepancy between theory and observations.",
      "pdf_url": "https://arxiv.org/pdf/2602.17763.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17766",
      "title": "Molecular Gas Excitation in z ~ 0.7 Gas-Rich Post-starburst Galaxies from SQuIGGLE",
      "authors": [
        "Vincenzo R. D'Onofrio",
        "Justin S. Spilker",
        "Rachel Bezanson",
        "Robert Feldmann",
        "Andy D. Goulding",
        "Jenny E. Greene",
        "Mariska Kriek",
        "Anika Kumar",
        "Yuanze Luo",
        "Desika Narayanan",
        "David J. Setton",
        "Katherine A. Suess",
        "Margaret E. Verrico"
      ],
      "abstract": "Molecular Gas Excitation in z ~ 0.7 Gas-Rich Post-starburst Galaxies from SQuIGGLE Vincenzo R. D'Onofrio, Justin S. Spilker, Rachel Bezanson, Robert Feldmann, Andy D. Goulding, Jenny E. Greene, Mariska Kriek, Anika Kumar, Yuanze Luo, Desika Narayanan, David J. Setton, Katherine A. Suess, Margaret E. Verrico 13 pages, 4 figures. Submitted to ApJ, comments welcome! Astrophysics of Galaxies (astro-ph.GA) Many post-starburst galaxies at $z\\sim0.7$ have been shown to retain substantial molecular gas reservoirs yet host low ongoing star formation, suggesting that the remaining gas may be inefficient at forming stars during the early post-burst phase. We present new Atacama Large Millimeter/submillimeter Array CO(5-4) observations of nine gas-rich post-starburst galaxies at $z\\sim0.7$ from the Studying Quenching in Intermediate-z Galaxies: Gas, angu$\\vec{L}$ar momentum, and Evolution (SQuIGG$\\vec{L}$E) survey, providing a view of the molecular gas excitation in these systems. Combined with existing CO(2-1) data, we detect CO(5-4) in 8/9 targets and find that most have moderate CO excitation with $r_{52}\\equiv L'_{\\rm CO(5-4)}/L'_{\\rm CO(2-1)}\\approx0.1-0.3$. These systems show no clear trend between $r_{52}$ and either total or surface-density of star formation. Specifically, all objects have $\\Sigma_{\\mathrm{SFR}} \\sim 0.01-1\\ \\text{M}_\\odot\\ \\text{yr}^{-1}\\ \\text{kpc}^{-2}$, consistent with compact, modest star formation, even when allowing for buried activity, as these galaxies decline from their peak. One object J1448+1010, which has clear optical, mid-infrared, and radio indicators of an active galactic nucleus, is an outlier with $r_{52}\\approx0.6$; its elevated excitation likely requires significant non-stellar heating, with a contribution from potentially obscured star formation. Together, most gas-rich SQuIGG$\\vec{L}$E post-starbursts have moderately excited molecular gas alongside little to modest star-forming activity, indicating that the remaining gas hosts relatively suppressed star formation efficiencies instead of strong buried starburst activity.",
      "pdf_url": "https://arxiv.org/pdf/2602.17766.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17767",
      "title": "There and back again? Neutral outflows in z~3.5 quiescent galaxies",
      "authors": [
        "Pengpei Zhu",
        "Kei Ito",
        "Francesco Valentino",
        "Massissilia Hamadouche",
        "Gianluca Scarpe",
        "Katherine E. Whitaker",
        "Takumi Kakimoto",
        "William M. Baker",
        "Anna R. Gallazzi",
        "Steven Gillman",
        "Rashmi Gottumukkala",
        "Christian Kragh Jespersen",
        "Minju Lee",
        "Allison W. S. Man",
        "Georgios Magdis",
        "Masato Onodera",
        "Rhythm Shimakawa",
        "Aswin Vijayan",
        "Po-Feng Wu"
      ],
      "abstract": "There and back again? Neutral outflows in z~3.5 quiescent galaxies Pengpei Zhu, Kei Ito, Francesco Valentino, Massissilia Hamadouche, Gianluca Scarpe, Katherine E. Whitaker, Takumi Kakimoto, William M. Baker, Anna R. Gallazzi, Steven Gillman, Rashmi Gottumukkala, Christian Kragh Jespersen, Minju Lee, Allison W. S. Man, Georgios Magdis, Masato Onodera, Rhythm Shimakawa, Aswin Vijayan, Po-Feng Wu 14 Pages, 6 Figures. Submitted to Astronomy&Astrophysics 19/02/2026 Astrophysics of Galaxies (astro-ph.GA) Neutral gas outflows play a crucial role in the baryon cycle of galaxies, their properties provide key insights into the transition from star formation to quiescence. In this work, we investigate the neutral gas outflow of 23 massive ($M_\\star = 10^{10.1-11.6}\\,\\rm M_\\odot$) quiescent galaxies (QGs) at z=2.82--4.61, selected from the JWST NIRSpec (R~1000) and NIRCam program DeepDive. We trace the neutral gas outflows using the NaI Doublet absorption lines and detect excess NaI D in 13/23 (57%) targets, of which 7/23 (30%) show blueshifted absorption with velocity offsets $|{\\Delta}v|$ >~ 150 km/s. The z ~ 3.5 targets have ${\\Delta}v$ similar to those of their local counterparts; they are also equivalent when compared in SFR--${\\Delta}v$ space. We derive mass outflow rates and identify the most extreme neutral gas outflow rate $\\log(\\dot M_{\\rm out} / \\mathrm{M_\\odot \\, yr}^{-1})=2.68\\pm0.27$ beyond the local Universe, coincident with an X-ray AGN. For all NaI D detected systems, the inferred mass outflow rate can, in principle, suppress ongoing star formation; however, the outflows are unlikely to escape their hosts, suggesting recycling on relatively short timescales (~3--180 Myr), depending on the assumed potential and launching radius. All NaI D detected targets occupy the LI(N)ER region of the BPT diagram and/or are X-ray detected, but we find no strong correlation between ongoing AGN and the neutral outflow: 2/4 broad-line/X-ray AGNs are NaI D undetected -- yet, the outflows can be powered by fossil/episodic AGNs, and one broad-line target shows a possible P-Cygni profile that indicates strong outflows. As neutral outflows alone are not able to permanently quench star formation by removing gas in our sample at z ~ 3.5, the presence of gas cycling in and out of massive passive systems may instead be the signature of feedback-regulated quenching-maintenance processes.",
      "pdf_url": "https://arxiv.org/pdf/2602.17767.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17957",
      "title": "A Bayesian Exploration of the Mass of Ursa Major III: Kinematics, Rotation and their influence on the Mass to Light Ratio",
      "authors": [
        "T.R. Adams",
        "B.J. Brewer",
        "G.F. Lewis"
      ],
      "abstract": "A Bayesian Exploration of the Mass of Ursa Major III: Kinematics, Rotation and their influence on the Mass to Light Ratio T.R. Adams, B.J. Brewer, G.F. Lewis Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) We investigate the kinematics of the potential ultra-faint dwarf galaxy (UFD) UMa III/U1 using Bayesian inference to search for the signal of any potential intrinsic rotation. The magnitude of rotation is relevant to estimating the total mass of UMa III/U1, which is critical in determining whether or not UMa III/U1 is in fact a UFD, or possibly a star cluster home to a significant binary fraction. A non-rotating model and a rotational model are fitted for the current total population of member stars of UMa III/U1, finding that a non-rotating model was preferred by a factor of $\\sim 5-12 \\times$. This was repeated on a reduced population of UMa III/U1, where potential contaminant stars were removed. A similar preference for non-rotation was found for these reduced populations. We calculate a lower-bound rotational mass estimate for UMa III/U1 and a corresponding lower bound mass-to-light ratio of $ 734.4^{+339.0}_{-176.2} \\mathrm{M_\\odot} / \\mathrm{L_\\odot} $ for the total population. We conclude that UMa III/U1 still remains an ambiguous object with viable arguments for both the UFD and self-gravitating star cluster scenarios, however under both, UMa III/U1 is unlikely to be supported by rotational pressure.",
      "pdf_url": "https://arxiv.org/pdf/2602.17957.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17980",
      "title": "A Comprehensive Catalog of Radio Sources and Rotation Measures in the Perseus Molecular Cloud from Very Large Array Observations",
      "authors": [
        "Haleh Hajizadeh",
        "Jeroen Stil",
        "René Plume",
        "Mehrnoosh Tahani",
        "Preshanth Jagannathan"
      ],
      "abstract": "A Comprehensive Catalog of Radio Sources and Rotation Measures in the Perseus Molecular Cloud from Very Large Array Observations Haleh Hajizadeh, Jeroen Stil, René Plume, Mehrnoosh Tahani, Preshanth Jagannathan Astrophysics of Galaxies (astro-ph.GA) We present a comprehensive radio polarization study of the Perseus molecular cloud using wideband L-band observations from the Karl G. Jansky Very Large Array. Our survey covers $\\sim13.8$~deg$^2$ with a mean Stokes~$I$ sensitivity of $\\sim80~\\mu$Jy~beam$^{-1}$, enabling the detection of 1410 compact radio sources. From this population, we construct a catalog of source properties, including positions, integrated flux densities, and spectral indices measured across nine spectral windows. The majority of sources exhibit negative spectral indices, consistent with non-thermal synchrotron emission. Using RM Synthesis and RM CLEAN techniques, we detect 205 polarized background sources above an $8\\sigma$ threshold. This corresponds to a sampling density of $\\sim14.8$~deg$^{-2}$, representing more than an order-of-magnitude increase compared to previous NVSS-based measurements. The resulting rotation measures exhibit coherent large-scale variations across the surveyed region, with additional small-scale structure superimposed. The enhanced sensitivity, frequency coverage, and sampling density of our observations enable a substantially improved mapping of the line-of-sight magnetic field component toward the Perseus molecular cloud compared to previous surveys.",
      "pdf_url": "https://arxiv.org/pdf/2602.17980.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18046",
      "title": "MATLAS-42, A Globular Cluster-Rich Ultra-Diffuse Galaxy That Diverges from the \"Failed Galaxy'' Formation Pathway",
      "authors": [
        "Jonah S. Gannon",
        "Duncan A. Forbes",
        "Francine R. Marleau",
        "Anna Ferré-Mateu",
        "Aaron J. Romanowsky",
        "Maria Luisa Buzzo",
        "Jean P. Brodie"
      ],
      "abstract": "MATLAS-42, A Globular Cluster-Rich Ultra-Diffuse Galaxy That Diverges from the \"Failed Galaxy'' Formation Pathway Jonah S. Gannon, Duncan A. Forbes, Francine R. Marleau, Anna Ferré-Mateu, Aaron J. Romanowsky, Maria Luisa Buzzo, Jean P. Brodie 10 pages, 6 figures, Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) To date, there has been significant interest in globular cluster (GC)-rich ultra-diffuse galaxies (UDGs) and the evidence that they have formed via an unexpected, ``failed galaxy'' formation pathway. The majority of the evidence for ``failed galaxy'' UDGs originates from spectroscopic observations targeting passive GC-rich UDGs, with a focus on those residing in galaxy clusters. In this work, we study the gas-rich, GC-rich group UDG MATLAS-42 and derive its stellar population properties using the Keck Cosmic Web Imager. We measure a redshift for the galaxy ($V_{\\rm R, \\star}=2433\\pm8$~km s$^{-1}$), confirming the previous assumptions that it is both part of the NGC~502 group and has an associated HI-reservoir ($V_{\\rm R,HI}=2423\\pm 15$~km s$^{-1}$). We measure integrated stellar populations and find the galaxy to be both young (mass-weighted age $=3.2^{+2.6}_{-1.5}$Gyr) and of average-to-low metallicity ($[M/H]=-1.19^{+0.42}_{-0.30}$ dex). When considering these properties in the context of the galaxy's formation, we note it likely does not follow the ``failed galaxy'' formation pathway commonly attributed to GC-rich, cluster UDGs, as it has experienced recent star formation. At most it started failed, however, it has recently rejuvenated its star formation. Finally, we build a toy model of the passive evolution of this galaxy, finding that its relative GC-richness (i.e., $M_{\\rm GC}/M_\\star$) will likely decrease with time as GCs slowly evaporate/disrupt to contribute to the stellar mass of the galaxy. Due to this, we hypothesise that it is likely not a low redshift analogue of the progenitor to a ``failed galaxy'' UDGs.",
      "pdf_url": "https://arxiv.org/pdf/2602.18046.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18068",
      "title": "Investigating the role of mergers in galaxy assembly in the early Universe (z > 5)",
      "authors": [
        "A. Calabrò",
        "L. Pentericci",
        "M. Llerena",
        "S. Rossi",
        "L. Napolitano",
        "D. Bevacqua",
        "M. Giavalisco",
        "R. Somerville",
        "G. Gandolfi",
        "E. Daddi",
        "M. Dickinson",
        "S. Finkelstein",
        "A. Fontana",
        "M. Hirschmann",
        "J. S. Kartaltepe",
        "D. Kocevski",
        "A. Koekemoer",
        "H. Leung",
        "R.A. Lucas",
        "A. Taylor",
        "R. Tripodi",
        "X. Wang",
        "L.Y.A. Yung"
      ],
      "abstract": "Investigating the role of mergers in galaxy assembly in the early Universe (z > 5) A. Calabrò, L. Pentericci, M. Llerena, S. Rossi, L. Napolitano, D. Bevacqua, M. Giavalisco, R. Somerville, G. Gandolfi, E. Daddi, M. Dickinson, S. Finkelstein, A. Fontana, M. Hirschmann, J. S. Kartaltepe, D. Kocevski, A. Koekemoer, H. Leung, R.A. Lucas, A. Taylor, R. Tripodi, X. Wang, L.Y.A. Yung 15 pages + appendix material with tables and image cutouts (3 pages) ; submitted to A&A Astrophysics of Galaxies (astro-ph.GA) Galaxy mergers play a crucial role in shaping the morphology, the star formation, and the mass growth of galaxies across cosmic time. While mergers have been extensively investigated in the local Universe, the evolution of their frequency and physical properties in the early Universe has yet to be fully understood. We investigate the role of mergers in a large spectroscopic sample of 1233 galaxies in the range 5<z<14 with good detection (S/N-pixel > 3) in JWST imaging, covering six different extragalactic fields. We identify mergers from rest-frame optical disturbances in F444W, using a combination of Gini, M-20, and Asymmetry parameters. We find a morphological merger fraction f_m that does not strongly evolve with redshift from z=0 to z ~ 8. The average f_m of our primary major merger condition (Gini+0.14xM-20 > 0.33, A>0.35) is ~ 5 %, which increases to ~13 % for major+minor merger tracers. Accounting for the evolving observability timescale of each tracer, we find that the merger rate is strongly increasing from z=1 to 7 by more than 1 dex, averaging ~ 2 merger/galaxy/Gyr at 5<z<10 for major mergers (in agreement with photometric pair studies), and a factor of 3 higher for minor+major mergers. We also perform SED modeling using available HST+JWST photometry to infer stellar masses and SFRs, using a non parametric star-formation history. We find that mergers at z > 5 have a significant impact, although significantly lower than at z<1, on the SFR of galaxies. When averaged over 10 Myr (comparable to the observability timescale of morphological disturbances), their SFRs are a factor of 1.7 higher than a mass and redshift matched sample of non-mergers, suggesting that mergers trigger new star-formation through short-lived powerful bursty episodes. Despite this, mergers contribute only by 5% - 10% to the mass build-up of galaxies in the redshift range explored.",
      "pdf_url": "https://arxiv.org/pdf/2602.18068.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18128",
      "title": "MIGHTEE HI observations of low surface brightness and ultra-diffuse galaxies in the XMM-LSS field",
      "authors": [
        "Elizabeth A. K. Adams",
        "Barbara Šiljeg",
        "Anastasia Ponomareva",
        "Natasha Maddox",
        "Pavel Enrique Mancera Piña",
        "Maarten Baes",
        "Bradley Frank",
        "Marcin Glowacki",
        "Matt Jarvis",
        "Sambatriniaina Rajohnson",
        "Gauri Sharma"
      ],
      "abstract": "MIGHTEE HI observations of low surface brightness and ultra-diffuse galaxies in the XMM-LSS field Elizabeth A. K. Adams, Barbara Šiljeg, Anastasia Ponomareva, Natasha Maddox, Pavel Enrique Mancera Piña, Maarten Baes, Bradley Frank, Marcin Glowacki, Matt Jarvis, Sambatriniaina Rajohnson, Gauri Sharma Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Untargeted neutral hydrogen (HI) surveys are well suited to identifying low surface brightness galaxies (LSBGs) that are gas rich, and they offer a complementary view to optically selected populations. We examined the LSBG population as identified via stellar and gaseous content using the MIGHTEE HI XMM-LSS early science data and the publicly available catalogs of optically identified LSBGs. There is currently little overlap between these datasets, with only three galaxies commonly detected. We performed surface brightness photometry of selected MIGHTEE HI detections to find 29 LSBGs, and 26 of these meet the size requirement (R_eff > 1.5 kpc) to be ultra-diffuse galaxies (UDGs). Furthermore, we extracted HI spectra at the location of all optically identified galaxies, placing upper limits on the HI-to-stellar mass ratio in these systems. While the HI-identified population overall tends toward bluer colors, the HI-identified and the optically selected samples mostly overlap in mean effective surface brightness, effective radii, and color. Although it is not straightforward to discern why the HI-identified LSBGs were missed in optical searches, this work highlights the utility of HI surveys in finding these faint systems. The HI-identified LSBGs are gas rich compared to the general HI-selected population. Furthermore, three out of four HI-selected UDGs with available kinematics show no systematic offset from the baryonic Tully-Fisher relation, although we are biased away from sources with low rotational velocities due to the low spectral resolution of the data. This work demonstrates the utility of HI observations for finding and characterizing the low surface brightness Universe.",
      "pdf_url": "https://arxiv.org/pdf/2602.18128.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18209",
      "title": "The GUAPOS project -- VII: Physical structure and molecular environment of the G31.41+0.31 HII region",
      "authors": [
        "R. Cesaroni",
        "M. T. Beltrán",
        "V. M. Rivilla",
        "Á. Sánchez-Monge",
        "L. Colzi",
        "F. Fontani",
        "Á. López-Gallifa",
        "A. Lorenzani",
        "C. Mininni"
      ],
      "abstract": "The GUAPOS project -- VII: Physical structure and molecular environment of the G31.41+0.31 HII region R. Cesaroni, M. T. Beltrán, V. M. Rivilla, Á. Sánchez-Monge, L. Colzi, F. Fontani, Á. López-Gallifa, A. Lorenzani, C. Mininni Astrophysics of Galaxies (astro-ph.GA) Ionised regions around OB-type stars are formed at an early stage of their evolution and are important to investigate the formation process of these objects. However, so far only few observations of their physical structure and interaction with the parental molecular cloud have been made. The high resolution and sensitivity of new instruments such as ALMA and the upgraded VLA allow us to fill this gap in our knowledge. We investigate the well known core-halo ultracompact HII region G31.41+0.31 and the surrounding molecular clump with the aim to determine the density and temperature of both the ionised and neutral gas, and possibly obtain a 3D picture of their spacial distribution. We take advantage of the full-band frequency coverage at 3 mm obtained with ALMA for the GUAPOS project to image the emission of a plethora of hydrogen recombination lines towards the G31.41+0.31 HII region as well as several molecular transitions which are tracers of medium-density ($\\sim$$10^4$--$10^6$ cm$^{-3}$) gas. The line data are complemented by continuum measurements obtained with the VLA at 1 cm and 7 mm. By fitting these lines also using a model that takes into account non-LTE effects we can investigate the density and temperature structure and the velocity field of the region. Our findings, based on a model fit accounting for non-LTE effects, indicate that the electron temperature of the HII region is mostly spanning a range between 5000 and 6000 K, while the density varies between 2500 and 7500 cm$^{-3}$. All in all, the distribution of these parameters as well as the corresponding velocity field hint at a cometary shaped HII region expanding away from the observer to the NW. The molecular gas appears to be still infalling towards the peak of the UC HII region, and its density and temperature are consistent with pressure confinement of the ionised gas to the SE.",
      "pdf_url": "https://arxiv.org/pdf/2602.18209.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18320",
      "title": "Linear filament and nested cluster evolution tomography (LANCET) I. Capture the evolution of dense gas in 14-parsec filament G316.8",
      "authors": [
        "Fengwei Xu",
        "Ke Wang",
        "Nicola Schneider",
        "Roberto Galván-Madrid",
        "Floris F. S. van der Tak",
        "Adam Ginsburg",
        "Jonathan C. Tan",
        "Hauyu Baobab Liu",
        "Qizhou Zhang",
        "Wenyu Jiao",
        "Guido Garay",
        "Sihan Jiao",
        "Keyun Su",
        "Beth M. Jones",
        "Lei Zhu"
      ],
      "abstract": "Linear filament and nested cluster evolution tomography (LANCET) I. Capture the evolution of dense gas in 14-parsec filament G316.8 Fengwei Xu (KIAA, MPIA), Ke Wang, Nicola Schneider, Roberto Galván-Madrid, Floris F. S. van der Tak, Adam Ginsburg, Jonathan C. Tan, Hauyu Baobab Liu, Qizhou Zhang, Wenyu Jiao, Guido Garay, Sihan Jiao, Keyun Su, Beth M. Jones, Lei Zhu 12 pages, 8 figures. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) A dynamic view of mass assembly is essential for understanding the formation of massive stars and clusters. Interpreting evolutionary diagnostics from Galactic-wide surveys, however, requires careful control of distance and environmental variations. The G316.8 filament provides an ideal laboratory: a 14-pc nearly linear structure composed of three contiguous subregions with comparable molecular gas reservoirs (~10,000 $M_\\odot$ each) but spanning a clear evolutionary sequence from an infrared dark cloud (young) through a massive young stellar object (intermediate) to an HII region (evolved). As part of the Linear filament and nested cluster evolution tomography (LANCET) project, we mapped the full filament with the Atacama Compact Array at 1.3 mm, achieving 0.08 pc resolution over 17.1 pc$^2$. Combined with Herschel and APEX/ArTéMiS data, we derived high-resolution temperature and column-density maps. We quantify structural evolution using dense-fragment statistics, column-density PDFs, and $\\Delta$-variance analysis. From young to evolved regions, the maximum fragment mass increases from 8 to 490 $M_\\odot$, while the dense-gas mass fraction ($>0.5$ g cm$^{-2}$) rises from 0.4% to 9.6%. The N-PDF develops a secondary power-law tail and the $\\Delta$-variance slope becomes progressively shallower, indicating ongoing assembly of dense sub-parsec structures. Our further ALMA 12m continuum and spectral line data will extend this dynamic scenarios down to 800 AU scale.",
      "pdf_url": "https://arxiv.org/pdf/2602.18320.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18426",
      "title": "Spatio-Spectroscopic Representation Learning using Unsupervised Convolutional Long-Short Term Memory Networks",
      "authors": [
        "Kameswara Bharadwaj Mantha",
        "Lucy Fortson",
        "Ramanakumar Sankar",
        "Claudia Scarlata",
        "Chris Lintott",
        "Sandor Kruk",
        "Mike Walmsley",
        "Hugh Dickinson",
        "Karen Masters",
        "Brooke Simmons",
        "Rebecca Smethurst"
      ],
      "abstract": "Spatio-Spectroscopic Representation Learning using Unsupervised Convolutional Long-Short Term Memory Networks Kameswara Bharadwaj Mantha, Lucy Fortson, Ramanakumar Sankar, Claudia Scarlata, Chris Lintott, Sandor Kruk, Mike Walmsley, Hugh Dickinson, Karen Masters, Brooke Simmons, Rebecca Smethurst This manuscript was previously submitted to ICML for peer review. Reviewers noted that while the underlying VAE-based architecture builds on established methods, its application to spatially-resolved IFS data is promising for unsupervised representation learning in astronomy. This version is released for community visibility. Reviewer decisions: Weak accept and Weak reject (Final: Reject) Astrophysics of Galaxies (astro-ph.GA); Computer Vision and Pattern Recognition (cs.CV) Integral Field Spectroscopy (IFS) surveys offer a unique new landscape in which to learn in both spatial and spectroscopic dimensions and could help uncover previously unknown insights into galaxy evolution. In this work, we demonstrate a new unsupervised deep learning framework using Convolutional Long-Short Term Memory Network Autoencoders to encode generalized feature representations across both spatial and spectroscopic dimensions spanning $19$ optical emission lines (3800A $< \\lambda <$ 8000A) among a sample of $\\sim 9000$ galaxies from the MaNGA IFS survey. As a demonstrative exercise, we assess our model on a sample of $290$ Active Galactic Nuclei (AGN) and highlight scientifically interesting characteristics of some highly anomalous AGN.",
      "pdf_url": "https://arxiv.org/pdf/2602.18426.pdf",
      "categories": [
        "astro-ph.GA",
        "cs.CV"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17938",
      "title": "dfcosmic: A Python package for cosmic ray removal",
      "authors": [
        "Carter Lee Rhea",
        "Pieter van Dokkum",
        "Steven R. Janssens",
        "Imad Pasha",
        "Roberto Abraham",
        "William P. Bowman",
        "Deborah Lokhorst",
        "Seery Chen"
      ],
      "abstract": "dfcosmic: A Python package for cosmic ray removal Carter Lee Rhea, Pieter van Dokkum, Steven R. Janssens, Imad Pasha, Roberto Abraham, William P. Bowman, Deborah Lokhorst, Seery Chen Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) Astronomical images often show sharp features that are caused by cosmic ray (CR) hits, hot pixels, or non-Gaussian noise. this http URL (van Dokkum 2001) is a widely used edge detection algorithm that identifies and replaces such features. Here we describe dfcosmic, a direct python port of this http URL utilizing PyTorch and C++ to enable efficient performance on both CPUs and GPUs. The code was developed for the MOTHRA array, which is projected to produce more than 1000 large format CMOS images every 15 minutes. Compared to previous python implementations, dfcosmic achieves a speed gain of at least 20%.",
      "pdf_url": "https://arxiv.org/pdf/2602.17938.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18340",
      "title": "A method to derive self-consistent NLTE astrophysical parameters for 4 million high-resolution 4MOST stellar spectra in half a day with invertible neural networks",
      "authors": [
        "Victor F. Ksoll",
        "Nicholas Storm",
        "Maria Bergemann",
        "Katherine Lee",
        "Ralf S. Klessen",
        "R. Albarracín",
        "Guillaume Guiglion",
        "Gražina Tautvaišienė"
      ],
      "abstract": "A method to derive self-consistent NLTE astrophysical parameters for 4 million high-resolution 4MOST stellar spectra in half a day with invertible neural networks Victor F. Ksoll, Nicholas Storm, Maria Bergemann, Katherine Lee, Ralf S. Klessen, R. Albarracín, Guillaume Guiglion, Gražina Tautvaišienė 25 pages, 14 figures, 7 tables, accepted for publication in Astronomy & Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Modern spectroscopic surveys obtain spectra for millions of stars. However, classical spectroscopic methods can often be computationally expensive, rendering them impractical for the analysis of large datasets. We introduce a novel simulation-based deep-learning approach for the efficient analysis of high-resolution stellar spectra to be obtained with the upcoming high-resolution 4MOST spectrograph. We used a suite of synthetic non-local thermodynamic equilibrium (NLTE) spectra generated with Turbospectrum to mimic 4MOST observations and trained a conditional invertible neural network (cINN) for the purpose of predicting self-consistently stellar surface parameters and chemical abundances. The cINN is a neural network architecture that estimates full posterior distributions for the target stellar properties, providing an intrinsic uncertainty estimate. We evaluated the predictive performance of the trained cINN model on both synthetic data and observed spectra of stars. We found that our new cINN trained on NLTE synthetic spectra is capable of recovering stellar parameters with average errors ($\\sigma$) of $33$ K for $T_\\mathrm{eff}$, $0.16$ dex for $\\log(g)$, and $0.12$ dex for [Fe/H], $0.1$ dex for [Ca/Fe], $0.11$ for [Mg/Fe], and $0.51$ dex for [Li/Fe], respectively, at a signal to noise ratio of 250 per Angstrom. From the analysis of the observed spectra of Gaia-ESO / 4MOST / PLATO benchmark stars, we verified that our NLTE estimates for stellar parameters and abundances are consistent with results obtained with the independent code TSFitPy. We conclude that the NLTE cINN is robust and can, theoretically, evaluate 4 million high-resolution 4MOST spectra in less than a day, using GPU acceleration.",
      "pdf_url": "https://arxiv.org/pdf/2602.18340.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.01690",
      "title": "The Impact of Baryonic Effects on the Dynamical Masses Inferred Using Satellite Kinematics",
      "authors": [
        "Josephine F.W. Baggen",
        "Frank C. van den Bosch",
        "Kaustav Mitra"
      ],
      "abstract": "The Impact of Baryonic Effects on the Dynamical Masses Inferred Using Satellite Kinematics Josephine F.W. Baggen, Frank C. van den Bosch, Kaustav Mitra Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) Satellite kinematics offers a powerful method to infer dynamical halo masses and has been demonstrated to yield tight constraints on the galaxy-halo connection. However, previous studies have assumed that the halos in which the satellites orbit are composed solely of dark matter, neglecting the role of baryons. Here, we develop an analytical model incorporating stars, gas, and the adiabatic response of dark matter to assess the impact of baryonic effects on the inference from satellite kinematics. The model covers halos in the mass range $10^{12}-10^{15}M_\\odot$ and is tuned to agree with well-established observational scaling relations. In addition, the model uses simple functional forms for the mass fractions of ejected baryons and diffuse halo stars, calibrated to the median trends in the EAGLE hydrodynamical simulations. We find that baryonic effects mainly result in a reduction of the satellite line-of-sight velocity dispersion due to the ejection of baryons and the resulting response of the dark matter halo. The effect is minimal (less than 1%) for the most massive halos, but reaches ~5-6% for halos in the mass range $10^{12}-10^{13}M_\\odot$, and up to 8% in extreme cases. We propose a simple formalism for correcting the satellite line-of-sight velocity dispersion for baryonic effects, and for marginalizing over the uncertainties. We integrate this correction function into BASILISK, a Bayesian hierarchical inference method applied to satellite kinematics data extracted from large redshift surveys, and find that this shifts central galaxies to higher inferred halo masses at fixed luminosity by up to ~0.3 dex. In a forthcoming work, we demonstrate that these few-percent level baryonic effects can have a non-negligible impact on the inference of cosmological parameters, motivating a novel approach to constraining the efficiency of feedback processes associated with galaxy formation.",
      "pdf_url": "https://arxiv.org/pdf/2509.01690.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.14019",
      "title": "The Galaxy Activity, Torus, and Outflow Survey (GATOS): N. Unveiling physical processes in local active galaxies. Unsupervised hierarchical clustering of JWST MIRI/MRS observations",
      "authors": [
        "L. Hermosa Muñoz",
        "J. R. González Fernández",
        "A. Alonso-Herrero",
        "I. García-Bernete",
        "O. González-Martín",
        "M. Pereira-Santaella",
        "E. López-Rodríguez",
        "C. Ramos Almeida",
        "S. García-Burillo",
        "L. Zhang",
        "A. Audibert",
        "E. Bellochi",
        "F. Combes",
        "T. Díaz-Santos",
        "D. Esparza-Arredondo",
        "B. García-Lorenzo",
        "M. García-Marín",
        "E. K. S. Hicks",
        "Á. Labiano",
        "N. A. Levenson",
        "M. Martínez-Paredes",
        "C. Packham",
        "R. A. Riffel",
        "D. Rigopoulou",
        "J. Schneider",
        "M. Villar-Martín"
      ],
      "abstract": "The Galaxy Activity, Torus, and Outflow Survey (GATOS): N. Unveiling physical processes in local active galaxies. Unsupervised hierarchical clustering of JWST MIRI/MRS observations L. Hermosa Muñoz, J. R. González Fernández, A. Alonso-Herrero, I. García-Bernete, O. González-Martín, M. Pereira-Santaella, E. López-Rodríguez, C. Ramos Almeida, S. García-Burillo, L. Zhang, A. Audibert, E. Bellochi, F. Combes, T. Díaz-Santos, D. Esparza-Arredondo, B. García-Lorenzo, M. García-Marín, E. K. S. Hicks, Á. Labiano, N. A. Levenson, M. Martínez-Paredes, C. Packham, R. A. Riffel, D. Rigopoulou, J. Schneider, M. Villar-Martín Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) With the rise of the integral field spectroscopy, we are currently dealing with large amounts of spatially resolved data, whose analysis has become challenging, especially when observing complex objects such as nearby galaxies. We aim to develop a method to automatically separate different physical regions within the central parts (1\"~160 pc, on average) of galaxies. This can allow us to better understand the systems, and provide an initial characterisation of the main ionisation sources affecting its evolution. We have developed an unsupervised hierarchical clustering algorithm to analyse data cubes based on spectral similarity. It clusters together spaxels with similar spectra, which is useful to disentangle between different physical processes. We have applied this method to a sample of 15 nearby (distances <100 Mpc) galaxies, 7 from the Galaxy Activity, Torus, and Outflow Survey (GATOS) and 8 archival sources, all observed with the medium resolution spectrometer (MRS) of the Mid-Infrared Instrument (MIRI) on board of the JWST. From the clusters, we computed their median spectrum and measured the line and continuum properties. We used these measurements to train random forest models and create several empirical mid-IR diagnostic diagrams for the MRS channel 3 wavelength range, including among others the bright [Ne II], [Ne III], and [Ne V] lines, several H2 transitions, and PAH features. The clustering technique allows to differentiate emission coming from an AGN, the disc, and star forming regions in galaxies, and other composite regions, potentially ionised by several sources simultaneously. This is supported by the results from the empirical diagnostic diagrams, that are indeed able to separate physically distinct regions. This innovative method serves as a tool to identify regions of interest in any data cube prior to an in-depth analysis of the sources. [abridged]",
      "pdf_url": "https://arxiv.org/pdf/2509.14019.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06347",
      "title": "MEGATRON: Disentangling Physical Processes and Observational Bias in the Multi-Phase ISM of High-Redshift Galaxies",
      "authors": [
        "Nicholas Choustikov",
        "Harley Katz",
        "Alex J. Cameron",
        "Aayush Saxena",
        "Julien Devriendt",
        "Adrianne Slyz",
        "Martin P. Rey",
        "Corentin Cadiou",
        "Jeremy Blaizot",
        "Taysun Kimm",
        "Isaac Laseter",
        "Kosei Matsumoto",
        "Joki Rosdahl"
      ],
      "abstract": "MEGATRON: Disentangling Physical Processes and Observational Bias in the Multi-Phase ISM of High-Redshift Galaxies Nicholas Choustikov, Harley Katz, Alex J. Cameron, Aayush Saxena, Julien Devriendt, Adrianne Slyz, Martin P. Rey, Corentin Cadiou, Jeremy Blaizot, Taysun Kimm, Isaac Laseter, Kosei Matsumoto, Joki Rosdahl 22 pages, 14 figures, 1 table. Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA) Now detected out to redshifts of $z\\sim 14.5$, the rest-frame ultraviolet and optical spectra of galaxies encode numerous physical properties of the interstellar medium (ISM). Accurately extracting these properties from spectra remains a key challenge that numerical simulations are uniquely suited to address. We present a study of the observed ISM of galaxies in MEGATRON: a suite of cosmological radiation hydrodynamics simulations coupled to on-the-fly non-equilibrium thermochemistry, with multiple prescriptions for star formation/feedback and parsec-scale resolution; capable of directly predicting spectroscopic properties of early galaxies. We find that irrespective of feedback physics used, the ISM of high-redshift galaxies is denser, less metal enriched, and subject to higher ionization parameters and radiation fields compared to similar mass galaxies in the local Universe -- in agreement with interpretations of JWST observations. Using common observational techniques to infer bulk galaxy properties, we find that ISM gas density controls the slope of the mass-metallicity relation. Similarly, at the densities reached in some high-redshift galaxies, O32 becomes a density tracer rather than one of ionization parameter. This motivates the use of other line ratios like C43 and N43 to infer the ionization state of the gas. Finally, various feedback models populate different regions of strong-line diagnostic diagrams as the line ratios are sensitive to the feedback-modulated density-temperature structure of the ISM. Therefore, observed strong-line diagnostics can provide a strong constraint on the underlying physics of star formation and feedback in the high-redshift Universe.",
      "pdf_url": "https://arxiv.org/pdf/2510.06347.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.11702",
      "title": "The Sunburst Arc with JWST. IV. The importance of interaction, turbulence, and feedback for Lyman-continuum escape",
      "authors": [
        "T. Emil Rivera-Thorsen",
        "Brian Welch",
        "Taylor Hutchison",
        "Matthew J. Hayes",
        "Jane R. Rigby",
        "Keunho Kim",
        "Suhyeon Choe",
        "Michael Florian",
        "Matthew B. Bayliss",
        "Gourav Khullar",
        "Keren Sharon",
        "Håkon Dahle",
        "John Chisholm",
        "Erik Solhaug",
        "M. Riley Owens",
        "Michael D. Gladders"
      ],
      "abstract": "The Sunburst Arc with JWST. IV. The importance of interaction, turbulence, and feedback for Lyman-continuum escape T. Emil Rivera-Thorsen, Brian Welch, Taylor Hutchison, Matthew J. Hayes, Jane R. Rigby, Keunho Kim, Suhyeon Choe, Michael Florian, Matthew B. Bayliss, Gourav Khullar, Keren Sharon, Håkon Dahle, John Chisholm, Erik Solhaug, M. Riley Owens, Michael D. Gladders 29 pages, 17 figures. Submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) At present, the best opportunity for detailed Lyman Continuum escape studies is in gravitationally lensed galaxies at z >~ 2. Only one such galaxy currently exists in the literature with sufficient spatial magnification: The Sunburst Arc at redshift z = 2.37. Here, we present rest-frame optical JWST NIRSpec integral field observations of the Sunburst Arc that cover a large fraction of the source plane. From this dataset, we generate precise maps of ISM kinematics, dust geometry, ionization, and chemical enrichment. We extract a stacked spectrum of five gravitationally lensed images of the Lyman-Continuum leaking cluster, as well as an magnification-corrected, integrated spectrum of most of the galaxy, enabling a direct comparison to other LyC leakers in the literature. We find that the galaxy rotates but also shows strong, possibly dominant, signatures of turbulence, which are indicative of recent or ongoing major interaction. The cluster that leaks ionizing photons shows little variation in kinematics or dust coverage, but dramatically elevated ionization, indicating that photoionization is the predominant mechanism that creates paths for LyC escape. We conjecture that tidal stripping of H I gas due to an interaction could have removed a large portion of the neutral ISM around the LyC emitting cluster, making it easier for the cluster to completely ionize the rest.",
      "pdf_url": "https://arxiv.org/pdf/2510.11702.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.16042",
      "title": "The PAU Survey: The $i$-band galaxy luminosity function from the present-day to $z = 2$",
      "authors": [
        "S. Koonkor",
        "C. M. Baugh",
        "G. Manzoni",
        "D. Navarro-Gironés",
        "P. Renard",
        "H. Hoekstra",
        "H. Hildebrandt",
        "E. Gaztañaga",
        "J. García-Bellido",
        "P. Tallada-Crespí",
        "F. J. Castander",
        "J. De Vincente",
        "R. Casas",
        "R. Miquel",
        "N. Sevilla-Noarbe",
        "M. Eriksen"
      ],
      "abstract": "The PAU Survey: The $i$-band galaxy luminosity function from the present-day to $z = 2$ S. Koonkor, C. M. Baugh, G. Manzoni, D. Navarro-Gironés, P. Renard, H. Hoekstra, H. Hildebrandt, E. Gaztañaga, J. García-Bellido, P. Tallada-Crespí, F. J. Castander, J. De Vincente, R. Casas, R. Miquel, N. Sevilla-Noarbe, M. Eriksen Accepted for publication in MNRAS. 23 pages, 17(+4) figures, 3(+2) tables Astrophysics of Galaxies (astro-ph.GA) We present a measurement of the $i$-band galaxy luminosity function from the present-day to $z = 2$, using over 1.1 million galaxies from the Physics of the Accelerating Universe Survey (PAUS). PAUS combines broad-band imaging from the Canada-France-Hawaii Telescope Lensing Survey with narrow-band photometry from PAUCam, enabling high-precision photometric redshifts with an accuracy of $\\sigma_{68} (\\Delta z) = 0.019$ down to $i_{\\textrm{AB}} = 23$. A synthetic lightcone mock catalogue built using the \\texttt{GALFORM} semi-analytic model is used to simulate PAUS selection effects and photometric uncertainties, and to derive a machine-learning based estimate of the $k$-correction. We recover rest-frame $i$-band luminosities using a random forest regressor trained on simulated $ugriz$ photometry and redshifts. Luminosity functions are estimated using the $1/V_{\\textrm{max}}$ method, accounting for photometric redshift and magnitude errors, and validated against mock data. We find good agreement between observations and models at $z < 1$, with increasing discrepancies at higher redshifts due to photometric redshift outliers. The bright-end of the luminosity function becomes flatter at high redshift, primarily driven by redshift errors. We show that the faint-end of the luminosity function becomes more incomplete with increasing redshift, but is still useful for constraining models. We analyze the red and blue galaxy populations separately, observing distinct evolutionary trends. The model overpredicts the number of both faint red and blue galaxies. Our study highlights the importance of accurate redshift estimation and selection modeling for robust luminosity function recovery, and demonstrates that PAUS can characterise the galaxy population with photometric redshifts across a wide redshift baseline.",
      "pdf_url": "https://arxiv.org/pdf/2511.16042.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.17334",
      "title": "Simulating Disky Broad Line Region Reverberation",
      "authors": [
        "Mary Ogborn",
        "Michael Eracleous",
        "Jessie C. Runnoe",
        "Massimo Dotti",
        "Niana N. Mohammed",
        "Collin M. Dabbieri"
      ],
      "abstract": "Simulating Disky Broad Line Region Reverberation Mary Ogborn, Michael Eracleous, Jessie C. Runnoe, Massimo Dotti, Niana N. Mohammed, Collin M. Dabbieri 18 pages, 15 figures, Accepted for publication in ApJS Astrophysics of Galaxies (astro-ph.GA) Variability studies of the broad emission lines of Active Galactic Nuclei (AGNs) and quasars show stochastic radial velocity variations (i.e., fluctuations in the centroid of the line), 'jitter', on timescales of weeks to months. This jitter may be intrinsic as the broad-line emitting region (BLR) reverberates from the AGN continuum. There are also coordinated variations in the width of the broad emission lines and the luminosity of the central source ('breathing' or 'anti-breathing') which remain unexplained. These can be used as a tool for testing models of the BLR. We have constructed a pipeline to simulate a disk-like BLR geometry that reverberates in response to various chosen continuum light curves and produce synthetic emission line profiles. These profiles can then be characterized by measured shape parameters (centroid velocity shift, velocity dispersion, and Pearson skewness coefficient) and compared to observed time series of those same parameters. We have found that through our pipeline, we can recreate the velocity jitter at similar variations found in observations. The computational tools presented in this paper will also be applicable to case studies of quasars observed under the Sloan Digital Sky Survey V (SDSS-V) Black Hole Mapper reverberation mapping program. This paper is the first in a series of papers -- in this paper, we present the model and pipeline, and in future papers, we will present applications.",
      "pdf_url": "https://arxiv.org/pdf/2511.17334.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16262",
      "title": "PDRs4All XXI. JWST-NIRCam Photometric properties of protoplanetary disks in the Orion Nebula Cluster",
      "authors": [
        "P. Amiot",
        "O. Berné",
        "I. Schroetter",
        "M. Robberto",
        "T. J. Haworth",
        "C. Boersma",
        "E. Dartois",
        "A. Fuente",
        "J.R. Goicoechea",
        "E. Habart",
        "M. J. McCaughrean",
        "T. Onaka",
        "E. Peeters"
      ],
      "abstract": "PDRs4All XXI. JWST-NIRCam Photometric properties of protoplanetary disks in the Orion Nebula Cluster P. Amiot, O. Berné, I. Schroetter, M. Robberto, T. J. Haworth, C. Boersma, E. Dartois, A. Fuente, J.R. Goicoechea, E. Habart, M. J. McCaughrean, T. Onaka, E. Peeters Astrophysics of Galaxies (astro-ph.GA) We use the high angular resolution NIRCam images from the PDRs4All program, combined with those of GTO program 1256, to extract key properties of disks in the Orion Nebula Cluster. We measure disk radii in silhouette against the bright background, identify dissociation fronts (DFs) and ionization fronts (IFs), determine Paschen $\\alpha$ intensities, and derive near-infrared spectral energy distributions (SEDs). From these diagnostics we define a typology of ONC disks. Type I sources show merged IFs and DFs close to the disk surface. Type II sources have DFs at the disk surface and IFs located tens of astronomical units away. Type III sources show a DF at the disk surface but no IF. For all types, PAH emission traces the PDR. We find that the disk radius $r_{\\rm disk}$ increases with projected distance to the ionizing source $d_{\\rm proj}$, following $r_{\\rm disk} \\propto d_{\\rm proj}^{0.30}$, consistent with disk truncation by photoevaporation. Disk radii measured in the infrared are larger than those measured at millimeter wavelengths, suggesting radial dust segregation within the disks. In agreement with PDR models, the thermal pressure in the disk PDR increases with the FUV radiation field $G_0$, but with a flatter slope. Finally, the SEDs of candidate Jupiter Mass Binary Objects (JuMBOs) are similar to those of Type III disks, except for JuMBO24, which resembles a Type I or Type II source. Its SED is consistent with a young low-mass binary hosting an unresolved ionized disk.",
      "pdf_url": "https://arxiv.org/pdf/2602.16262.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.22076",
      "title": "HOLISMOKES XVII: Detecting strongly lensed SNe Ia from time series of multi-band LSST-like imaging data",
      "authors": [
        "Satadru Bag",
        "Raoul Canameras",
        "Sherry H. Suyu",
        "Stefan Schuldt",
        "Stefan Taubenberger",
        "Irham Taufik Andika",
        "Alejandra Melo"
      ],
      "abstract": "HOLISMOKES XVII: Detecting strongly lensed SNe Ia from time series of multi-band LSST-like imaging data Satadru Bag, Raoul Canameras, Sherry H. Suyu, Stefan Schuldt, Stefan Taubenberger, Irham Taufik Andika, Alejandra Melo 22 pages, 17 figures, accepted in A&A, paper number in the HOLISMOKES series updated from XVIII to XVII Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) Strong gravitationally lensed supernovae (LSNe), though rare, are exceptionally valuable probes for cosmology and astrophysics. Upcoming time-domain surveys like the Vera Rubin Observatory's Legacy Survey of Space and Time (LSST) offer a major opportunity to discover them in large numbers. Early identification is crucial for timely follow-up observations. We develop a deep learning pipeline to detect LSNe using multi-band, multi-epoch image cutouts. Our model is based on a 2D convolutional long short-term memory (ConvLSTM2D) architecture, designed to capture both spatial and temporal correlations in time-series imaging data. Predictions are made after each observation in the time series, with accuracy improving as more data arrive. We train the model on realistic simulations derived from Hyper Suprime-Cam (HSC) data, which closely matches LSST in depth and filters. This work focuses exclusively on Type Ia supernovae (SNe Ia). LSNe Ia are injected onto HSC luminous red galaxies (LRGs) at various phases of evolution to create positive examples. Negative examples include variable sources from HSC Transient Survey (including unclassified transients), and simulated unlensed SNe Ia in LRG and spiral galaxies. Our multi-band model shows rapid classification improvements during the initial few observations and quickly reaches high detection efficiency: at a fixed false-positive rate (FPR) of $0.01\\%$, the true-positive rate (TPR) reaches $\\gtrsim 60\\%$ by the 7th observation and exceeds $\\gtrsim 70\\%$ by the 9th. Among the negative examples, SNe in LRGs remain the primary source of FPR, as they can resemble their lensed counterparts under certain conditions. The model detects quads more effectively than doubles and performs better on systems with larger image separations. Although trained and tested on HSC-like data, our approach applies to any cadenced imaging survey, particularly LSST.",
      "pdf_url": "https://arxiv.org/pdf/2506.22076.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.20999",
      "title": "DRAGNs in the Forest: Identifying Artifacts with Random Forest Models in the VLASS DRAGNs Catalog",
      "authors": [
        "Verene Einwalter",
        "Eric J. Hooper",
        "Melissa E. Morris",
        "Sarah Bach",
        "Yjan A. Gordon"
      ],
      "abstract": "DRAGNs in the Forest: Identifying Artifacts with Random Forest Models in the VLASS DRAGNs Catalog Verene Einwalter, Eric J. Hooper, Melissa E. Morris, Sarah Bach, Yjan A. Gordon Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA) The Quick Look data products from the Very Large Array Sky Survey (VLASS) contain widespread imaging artifacts arising from the simplified imaging algorithm used in their production. The catalog of double radio sources associated with active galactic nuclei (DRAGNs) found in the VLASS first epoch Quick Look release using the DRAGNhunter algorithm suffers from contamination from these artifacts. These sources contain two or three individual components, each of which can be an artifact. We train random forest models to classify these DRAGNs based on the number of artifacts they contain, ranging from zero to three artifacts. We optimize our models and mitigate the class imbalance of our dataset with judicious training set selection, and the best of our models achieves a weighted F1 score of $97.01\\%^{+1.12\\%}_{-1.32\\%}$. Using our classifications, we produce a catalog of VLASS DRAGNs from which an estimated 99.3% complete catalog of 97.7% artifact-free sources can be extracted.",
      "pdf_url": "https://arxiv.org/pdf/2512.20999.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17796",
      "title": "On the Origin of Coronal Picoflare Jets",
      "authors": [
        "Annu Bura",
        "Daniel Nóbrega-Siverio",
        "Tanmoy Samanta",
        "Jayant Joshi"
      ],
      "abstract": "On the Origin of Coronal Picoflare Jets Annu Bura, Daniel Nóbrega-Siverio, Tanmoy Samanta, Jayant Joshi 12 Pages, 5 figures, 2 Tables, Accepted for Publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) Small-scale jet-like eruptions, such as picoflare jets and jetlets, are recognized as potential contributors to coronal heating and solar wind acceleration, yet their physical origin is still not fully established. Using ultra-high-resolution extreme ultraviolet imaging datasets from the Extreme Ultraviolet Imager on board the Solar Orbiter mission, we investigate tiny coronal jets observed off-limb in the Sun's polar regions. Visual inspection reveals that the majority of these jets exhibit distinct morphological features, including a bright spire accompanied by a dark eruptive jet component. We analyzed eleven of these jets in detail and found that their spatial and temporal scales are comparable to previously reported jetlets, while their kinetic energies are two to three orders of magnitude lower, placing them in the picoflare regime. The bright and dark components show distinct dynamics, with the dark structures generally displaying lower speeds. A comparison with coordinated Interface Region Imaging Spectrograph and the Atmospheric Imaging Assembly on board the Solar Dynamics Observatory data, together with 2.5D radiative-MHD simulations performed with the Bifrost code, reveals a one-to-one morphological correspondence between the dark counterparts and cool chromospheric surges accompanying the bright jet spire. This association suggests that flux emergence and magnetic reconnection at low atmospheric heights may produce coupled bright-dark structures, providing a plausible mechanism for the generation of picoflare jets. Our results demonstrate Solar Orbiter's ability to resolve the dynamics of small-scale jets and place new constraints on their origin.",
      "pdf_url": "https://arxiv.org/pdf/2602.17796.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17800",
      "title": "Long-term eclipse time variations in white dwarf binaries",
      "authors": [
        "Amalie Yates",
        "S. G. Parsons",
        "A. J. Brown",
        "N. Castro Segura",
        "V. S. Dhillon",
        "M. J. Dyer",
        "J. A. Garbutt",
        "M. J. Green",
        "D. Jarvis",
        "M. R. Kennedy",
        "P. Kerry",
        "D. Kilkenny",
        "S. P. Littlefair",
        "J. McCormac",
        "J. Munday",
        "I. Pelisoli",
        "E. Pike",
        "D. I. Sahman"
      ],
      "abstract": "Long-term eclipse time variations in white dwarf binaries Amalie Yates, S. G. Parsons, A. J. Brown, N. Castro Segura, V. S. Dhillon, M. J. Dyer, J. A. Garbutt, M. J. Green, D. Jarvis, M. R. Kennedy, P. Kerry, D. Kilkenny, S. P. Littlefair, J. McCormac, J. Munday, I. Pelisoli, E. Pike, D. I. Sahman Accepted for publication in MNRAS. 14 pages, 6 figures. Supplementary information will be available online with the published journal article (also available from the corresponding author by request) Solar and Stellar Astrophysics (astro-ph.SR) The overwhelming majority of eclipsing white dwarf (WD) binary systems show quasi-periodic variations in eclipse timings on many year timescales. Currently, the mechanism behind these eclipse time variations (ETVs) is not known, with the main competing theories being the planetary hypothesis and the Applegate/Lanza mechanisms. Here, we present a comprehensive study of 43 WD binary systems, the vast majority of which have more than a decade of eclipse timing measurements, analysing their global properties to determine which driving force is the likely origin of the observed ETVs. Long-term, high-speed photometry data obtained with ULTRACAM, ULTRASPEC and HiPERCAM have allowed us to track the evolution of the ETVs in these systems, and analyse any previously unseen trends. From this analysis, we find a clear difference in the level of observed ETVs past the fully convective boundary, where systems with partially radiative companion stars consistently showing high levels of variation. While some systems may be affected by the presence of an unknown planet, the results from this study strongly indicates that an Applegate- or Lanza-like mechanism is the most likely driving force for the timing variations seen in the majority of systems in this sample. However, as found in previous studies, the Applegate/Lanza mechanisms are still not able to reproduce the large and rapid timing variations seen in the vast majority of systems, with the companion star to the WD unable to provide sufficient energy on these short timescales.",
      "pdf_url": "https://arxiv.org/pdf/2602.17800.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17870",
      "title": "The SB9 catalogue: status, comparison with non-single stars from Gaia DR3 and evolution to SBX",
      "authors": [
        "T. Merle",
        "A. Jorissen",
        "S. Alexandre",
        "J. Desuter",
        "C. Loup",
        "A. Tokovinin",
        "G. Traven",
        "M. Van der Swaelmen",
        "S. Van Eck",
        "G. Van de Steene",
        "J. Southworth",
        "G. Sadowski"
      ],
      "abstract": "The SB9 catalogue: status, comparison with non-single stars from Gaia DR3 and evolution to SBX T. Merle, A. Jorissen, S. Alexandre, J. Desuter, C. Loup, A. Tokovinin, G. Traven, M. Van der Swaelmen, S. Van Eck, G. Van de Steene, J. Southworth, G. Sadowski 25 pages, 22 figures, 14 tables, accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR) The Ninth Catalogue of Spectroscopic Binary Orbits (SB9) is a comprehensive compilation of spectroscopic binaries (SBs) with orbital parameters sourced from literature, comprising approximately 4000 systems (2800 single-lined and 1200 double-lined). This work presents the latest status of SB9 after two decades of development, detailing the statistical properties of SBs through orbital period distributions and eccentricity-period diagrams categorized by spectral type and evolutionary stage. We performed a rigorous cross-match with Gaia Data Release 3 (DR3) to update astrometric parameters and compare SB9 with the Gaia DR3 Non-Single Star (NSS) catalogue. Our methodology utilized positional separations, magnitudes, and proper-motion back-propagation for identification. The final SB9 version updated by D. Pourbaix includes 4003 systems, including higher-order multiples: 152 triples, 71 quadruples, and 14 higher-order systems. Of these, 3976 have Gaia DR3 identifiers; 21 are too bright and six too faint for detection. Ten SB9 systems with periods exceeding 1180 days were spatially resolved by Gaia DR3. We identified a common sample of 827 binaries cross-matched with Gaia NSS, with 655 considered highly reliable based on period and eccentricity differences under 10%. The limited overlap (20-30% of SB9) results from NSS selection cuts, brightness limits, and temporal baselines. This study highlights the complementary strengths of both catalogues and establishes a benchmark sample for binary star research. Finally, this work marks the transition of SB9 into SBX (The eXtended Catalogue of Spectroscopic Binary Orbits), featuring a modern relational database, improved web interface, and Virtual Observatory access standards to enhance data quality and accessibility for the stellar community.",
      "pdf_url": "https://arxiv.org/pdf/2602.17870.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18069",
      "title": "Modeling brightness temperature of sunspots using ALMA single-dish observations",
      "authors": [
        "F. Matković",
        "R. Brajša",
        "A. O. Benz",
        "H.-G. Ludwig",
        "C. L. Selhorst",
        "I. Skokić",
        "D. Sudar",
        "A. Hanslmeier"
      ],
      "abstract": "Modeling brightness temperature of sunspots using ALMA single-dish observations F. Matković, R. Brajša, A. O. Benz, H.-G. Ludwig, C. L. Selhorst, I. Skokić, D. Sudar, A. Hanslmeier 11 pages, 1 figure, 2 tables, accepted and published in Astronomische Nachrichten/Astronomical Notes Solar and Stellar Astrophysics (astro-ph.SR) We model sunspot brightness temperature in the wavelength range 0.3-10mm using the Atacama Large Millimeter/submillimeter Array (ALMA) single-dish measurements together with other instruments. Our modeling idea starts from an existing model, the 1D semi-empirical Avrett-Tian-Landi-Curdt-Wülser (ATLCW) model for sunspots. The original model is then modified in density and temperature with a constant factor over all heights. A least-square fit in both density and temperature to the observed values yields an improved model for sunspot brightness temperature. Observations show that sunspots are darker than QS at wavelengths below 2 mm and brighter beyond, while fitting of the ATLCW sunspot model imply that sunspots should be darker than QS over the entireALMArange. The best-fitted sunspot brightness temperature profiles resulted in 3.6-4.0 times lower sunspot density compared to the original sunspot ATLCW model, or 1.4-1.8 times higher density compared to QS. The temperature came out around 1.2 times higher than the original ATLCW predictions for sunspots, or 1.2 times lower than QS temperature. Even with improved density and temperature parameters, the remaining discrepancy between the bestfitted models and observations indicated that additional improvements are needed in the ATLCW model and modeling assumptions.",
      "pdf_url": "https://arxiv.org/pdf/2602.18069.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18085",
      "title": "The attempted polarity reversal and evolving magnetic environment of AD Leo",
      "authors": [
        "K.G. Smith",
        "D. Evensberget",
        "S. Bellotti",
        "J. Morin",
        "A.A. Vidotto",
        "B.J.S. Pope"
      ],
      "abstract": "The attempted polarity reversal and evolving magnetic environment of AD Leo K.G. Smith, D. Evensberget, S. Bellotti, J. Morin, A.A. Vidotto, B.J.S. Pope 15 pages, 10 figures and 3 tables. Accepted in Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) In the past two decades, the observed large-scale magnetic field of the active M dwarf star AD Leo has evolved from strongly to mildly negative, raising a suspicion that it might switch polarity. Although magnetic field reversals are observed every 11 years for the Sun, such reversals are poorly understood for M dwarfs. Further, no reversals have been observed for fast-rotating M dwarfs. We examine the properties of AD Leo's large-scale magnetic field and investigate how its evolution affects the space weather environment. We analysed spectropolarimetric data collected by ESPaDOnS and SPIRou in late-2022 and early-2023. With the optical and near-infrared data we computed the longitudinal magnetic field, and with the near-infrared data reconstructed the large-scale magnetic field using Zeeman-Doppler imaging. Using five magnetograms, from 2019 to 2023, we simulated three-dimensional Alfven wave-driven stellar winds using the space weather code SWMF. Although we see an evolution of the large-scale magnetic field of AD Leo, we find no polarity reversal. Rather, we see a restoration of the field to a simpler configuration with consistently negative values for the longitudinal magnetic field strength. Our new large-scale field reconstruction for AD Leo is characterised by a highly axisymmetric, poloidal-dipolar field with an increased mean large-scale field strength. SWMF simulations find the stellar mass loss rates to be, on average, an order of magnitude greater than that of the Sun. Additionally, we find that the habitable zone resides beyond the Alfven surface. Hypothetical magnetised habitable zone planets (with planetary field strengths greater than 0.34 G) would likely be shielded from the incident wind and atmospheric erosion would be negligible. Further, we find variable conditions across each epoch due to the evolving axisymmetry of the stellar large-scale magnetic field.",
      "pdf_url": "https://arxiv.org/pdf/2602.18085.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18100",
      "title": "3D radiative transfer modeling of scattering polarization with partial frequency redistribution I. Verification and disk-center results for the solar Ca I 4227 Å line",
      "authors": [
        "Pietro Benedusi",
        "Simone Riva",
        "Tanausú del Pino Alemán",
        "Gioele Janett",
        "Fabio Riva",
        "Jirí Štepán",
        "Rolf Krause",
        "Javier Trujillo Bueno",
        "Luca Belluzzi"
      ],
      "abstract": "3D radiative transfer modeling of scattering polarization with partial frequency redistribution I. Verification and disk-center results for the solar Ca I 4227 Å line Pietro Benedusi, Simone Riva, Tanausú del Pino Alemán, Gioele Janett, Fabio Riva, Jirí Štepán, Rolf Krause, Javier Trujillo Bueno, Luca Belluzzi Solar and Stellar Astrophysics (astro-ph.SR) Several strong solar resonance lines show observable linear scattering polarization signals, holding a great potential for investigating the magnetism of the outer solar atmosphere. Accurately modeling these signals requires solving the radiative transfer (RT) problem for polarized radiation in comprehensive 3D models of the solar atmosphere, in non-local thermodynamic equilibrium, accounting for partial frequency redistribution (PRD) effects. This problem has so far been computationally inaccessible. We present the first scientific application of TRIP, a novel software for the massively parallel solution of the 3D non-LTE RT problem for polarized radiation, including scattering polarization and PRD. We aim to verify the code and explore the combined action of PRD and the 3D structure of the solar atmosphere on scattering polarization. We run TRIP to synthesize the Stokes profiles of the Ca I line at 4227 Å in a 3D model of the solar atmosphere extracted from a radiation magneto-hydrodynamic simulation. We efficiently solve the resulting large-scale problem, with up to $4 \\times 10^{10}$ degrees of freedom, with a state-of-the-art preconditioned Krylov method, using up to 20 thousand parallel CPUs. After including verification tests, we find that the joint impact of PRD effects and the detailed 3D structure of the atmospheric model produce disk-center scattering polarization signals in the line wings. These signals are sensitive to the magnetic field, via magneto-optical effects, and to bulk velocity gradients. We also show that the CRD approximation underestimates the amplitude of disk-center line-core signals. This achievement represents a crucial step forward for diagnosing the magnetism of the solar chromosphere and transition region through the quantitative comparisons of synthetic and observational data.",
      "pdf_url": "https://arxiv.org/pdf/2602.18100.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18127",
      "title": "A Photometric and Spectroscopic investigation of 11 TESS eclipsing contact binaries",
      "authors": [
        "Yani Guo",
        "Kai Li",
        "Yanke Tang",
        "Xiang Gao",
        "Qiqi Xia",
        "Liheng Wang",
        "Meng Guo"
      ],
      "abstract": "A Photometric and Spectroscopic investigation of 11 TESS eclipsing contact binaries Yani Guo, Kai Li, Yanke Tang, Xiang Gao, Qiqi Xia, Liheng Wang, Meng Guo 15 pages, 4 figures, 6 tables, accepted by ApJ Solar and Stellar Astrophysics (astro-ph.SR) By cross-matching the eclipsing binary catalog provided by Prsa et al. (2022) with LAMOST medium resolution spectra, we obtained 11 targets. Combining light and radial velocity curves analysis, we have derived accurate physical parameters for these 11 targets. The results indicate that there are 3 deep contact binaries, 3 moderate ones, and 5 shallow ones. Among them, 3 targets exhibit the O'Connell effect, which is attributed to the presence of star-spot on the component's surface. One target is a low-mass ratio deep contact binary and may be contact binary merging candidates. The evolutionary status of these 11 targets was studied using the mass-luminosity and mass-radius relation diagrams. Based on the O-C (Observed minus Calculated) analysis of 10 targets, we found that the orbital periods of 5 contact binaries show a long-term decreasing trend, likely due to the combined effects of mass transfer between the two components and loss of angular momentum. Meanwhile, the orbital periods of the other 4 stars are continuously increasing, which is attributed to mass transfer. Besides, the O-C curves of 3 targets show clear periodic changes, which might result from the Applegate mechanism or the light travel time effect.",
      "pdf_url": "https://arxiv.org/pdf/2602.18127.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18133",
      "title": "Power-law Indices of EUV Intensity Power Spectrum in Flaring Coronal Active Regions",
      "authors": [
        "Sihui Zhong",
        "Dmitrii Y. Kolotkov",
        "Valery M. Nakariakov"
      ],
      "abstract": "Power-law Indices of EUV Intensity Power Spectrum in Flaring Coronal Active Regions Sihui Zhong, Dmitrii Y. Kolotkov, Valery M. Nakariakov 19 pages, 9 figures, accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) Solar intensity power spectra are usually characterised by coloured noise, with the spectral energy following a segmented power-law function of frequency, $S(f)\\propto f^{-\\alpha}$, over different frequency ranges. Typically, the power-law index exceeds 1 in the low-frequency part ($\\alpha_\\mathrm{lf}$) and is around 0 at high frequencies ($\\alpha_\\mathrm{hf}$). This work investigates the spatial and temporal evolution of the power-law indices of coronal EUV intensity power spectra in flare-hosting active regions. The spatial distribution of the power-law index in the low-frequency domain ($\\alpha_\\mathrm{lf}$) closely mirrors EUV intensity images, indicating that $\\alpha_\\mathrm{lf}$ can reveal the dynamics of coronal plasma structures. Temporally, $\\alpha_\\mathrm{lf}$ remains stable in quiescent active regions, but it exhibits significant variability before the flare onset. Motivated by this behaviour, we analysed 14 flare events, quantifying the temporal variation of the indices $\\alpha_\\mathrm{lf}$ and $\\alpha_\\mathrm{hf}$ as potential flare precursors. In all flare events considered, notable deviations of $\\alpha_\\mathrm{lf}$ beyond a defined threshold consistently occurred at the flare site within a few minutes before the flare. In some cases, the change in the value of $\\alpha_\\mathrm{lf} - \\alpha_\\mathrm{hf}$ was detected within 30--90\\, minutes before the flare. This proof-of-concept study suggests that the temporal variation of the power-law indices in coronal EUV intensity power spectra could potentially serve as short-term precursors of solar flares, which needs to be validated on a larger flare sample.",
      "pdf_url": "https://arxiv.org/pdf/2602.18133.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17760",
      "title": "Identifying Exoplanets with Deep Learning VI. Enhancing neural network mitigation of stellar activity RV signals with additional metrics",
      "authors": [
        "Naomi McWilliam",
        "Zoë L. de Beurs",
        "Andrew Vanderburg",
        "Javier Viaña",
        "Annelies Mortier",
        "Lars A. Buchhave",
        "Andrew Collier Cameron",
        "Rosario Cosentino",
        "Xavier Dumusque",
        "Adriano Ghedina",
        "Ben Lakeland",
        "Marcello Lodi",
        "Mercedes López-Morales",
        "Dimitar Sasselov",
        "Alessandro Sozzetti"
      ],
      "abstract": "Identifying Exoplanets with Deep Learning VI. Enhancing neural network mitigation of stellar activity RV signals with additional metrics Naomi McWilliam, Zoë L. de Beurs, Andrew Vanderburg, Javier Viaña, Annelies Mortier, Lars A. Buchhave, Andrew Collier Cameron, Rosario Cosentino, Xavier Dumusque, Adriano Ghedina, Ben Lakeland, Marcello Lodi, Mercedes López-Morales, Dimitar Sasselov, Alessandro Sozzetti 31 pages, 16 figures, 5 tables. Accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) The measurement of exoplanet masses using the radial velocity (RV) technique is currently limited by stellar activity, which introduces quasiperiodic variability signals that must be modeled and removed to enhance the sensitivity of the RV measurements to exoplanet signals. Neural networks have previously been demonstrated effective in modeling stellar activity signals in HARPS-N solar data using white light cross correlation functions (CCFs). Building on this work, we train a neural network on six years of HARPS-N solar data with additional parameters commonly associated to stellar activity, including chromatic CCFs, line shape metrics, spectral activity indicators, total solar irradiance (TSI) light curves from SORCE and TSIS-1, and TSI time derivatives. Our results show that parameters such as the bisector inverse slope and Na D equivalent widths do not significantly improve the neural network's ability to predict activity-induced RV variations compared to using the white light CCFs alone. However, parameters such as unsigned magnetic flux, the TSI and its time derivative, S-index, H-alpha equivalent width, chromatic CCFs, contrast, and full width at half maximum do improve the neural network's ability to predict RV scatter. Our new model reduces the RV scatter in a held-out test set from 147.1 cm/s to 93.3 cm/s, consistent with supergranulation noise levels reported in previous studies. These results suggest that finding effective tracers for (super)granulation will be critical to train models capable of further mitigating RV jitter, and necessary for characterizing Earth analogues.",
      "pdf_url": "https://arxiv.org/pdf/2602.17760.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18108",
      "title": "The GAPS Programme at the TNG: LXX. TOI-5734b: A hot sub-Neptune orbiting a relatively young K dwarf with an Earth-like density",
      "authors": [
        "S. Filomeno",
        "T. Trifonov",
        "M. Damasso",
        "M. Baratella",
        "S. Benatti",
        "K. Biazzo",
        "K.A. Collins",
        "R. Cosentino",
        "S. Desidera",
        "C. Di Maio",
        "D. Locci",
        "A. Maggio",
        "L. Mancini",
        "S. Messina",
        "L. Naponiello",
        "D. Nardiello",
        "K. G. Stassun",
        "F. Amadori",
        "S. Antoniucci",
        "F. Biassoni",
        "A.S. Bonomo",
        "L. Cabona",
        "C.A. Clark",
        "M. Gonzalez",
        "A. F. Lanza",
        "D.W. Latham",
        "V. Lorenzi",
        "L. Malavolta",
        "G. Mantovan",
        "M. Pedani",
        "G. Scandariato",
        "A. Shporer",
        "A. Sozzetti",
        "T. Zingales",
        "D. Ciardi",
        "M. Everett",
        "M.B. Lund",
        "H. Osborn",
        "I. A. Strakhov",
        "J. Villaseñor",
        "D. Watanabe",
        "A. Youngblood",
        "R. Zambelli"
      ],
      "abstract": "The GAPS Programme at the TNG: LXX. TOI-5734b: A hot sub-Neptune orbiting a relatively young K dwarf with an Earth-like density S. Filomeno, T. Trifonov, M. Damasso, M. Baratella, S. Benatti, K. Biazzo, K.A. Collins, R. Cosentino, S. Desidera, C. Di Maio, D. Locci, A. Maggio, L. Mancini, S. Messina, L. Naponiello, D. Nardiello, K. G. Stassun, F. Amadori, S. Antoniucci, F. Biassoni, A.S. Bonomo, L. Cabona, C.A. Clark, M. Gonzalez, A. F. Lanza, D.W. Latham, V. Lorenzi, L. Malavolta, G. Mantovan, M. Pedani, G. Scandariato, A. Shporer, A. Sozzetti, T. Zingales, D. Ciardi, M. Everett, M.B. Lund, H. Osborn, I. A. Strakhov, J. Villaseñor, D. Watanabe, A. Youngblood, R. Zambelli 19 pages, 20 figures. Accepted for publication on A&A. Language editor corrected version. Abstract abridged Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Increasing interest in young exoplanets is leading to a growing effort to understand the formation and evolutionary processes responsible for their different architectures. One interesting target is TOI-5734, a relatively young K3-K4 dwarf star ($500_{-150}^{+300}$ Myr) showing a transiting candidate in photometric observations followed up with high-resolution spectroscopic data. Using Transiting Exoplanet Survey Satellite (TESS) photometry and High Accuracy Radial velocity Planet Searcher for the Northern hemisphere (HARPS-N) radial-velocity (RV) data, we aim to validate the presence of the companion TOI-5734b, measure its planetary mass, size, and its orbital parameters after having characterised its host star. We then aim to study its possible planetary composition and atmospheric evolution. By simultaneously modelling photometry and high-cadence RVs, we measured the radius, mass, and density of TOI-5734b precisely. In particular, we employed Gaussian processes (GPs) with a flexible kernel to discriminate between the stellar activity of the young host and planetary signals. We confirmed the planetary nature of TOI-5734b and measured its orbital period ($P_{\\rm b}\\sim6.18$ d), radius ($R_{\\rm b} = 2.10^{+0.12}_{-0.12}$ $R_\\oplus$), and mass ($M_{\\rm b}=9.1^{+2.6}_{-2.6}$ $M_\\oplus$). By measuring its density ($\\rho_{\\rm b}=0.98_{-0.30}^{+0.36}$ $\\rho_\\oplus$), we infer that TOI-5734b is close to having a rocky composition and an almost completely depleted primary envelope. Our results point toward the possibility of considering the target for atmospheric studies with present and future ground- and space-based facilities.",
      "pdf_url": "https://arxiv.org/pdf/2602.18108.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18207",
      "title": "The Dispersed Matter Planet Project Sample -- Detection limits, Occurrence Rates and New Planets",
      "authors": [
        "Matthew R. Standing",
        "John R. Barnes",
        "Carole A. Haswell",
        "Adam T. Stevenson",
        "João P. Faria",
        "Erwan Quintin",
        "Zachary O. B. Ross",
        "Luca Fossati",
        "James S. Jenkins",
        "Douglas Alves",
        "Daniel Staab"
      ],
      "abstract": "The Dispersed Matter Planet Project Sample -- Detection limits, Occurrence Rates and New Planets Matthew R. Standing, John R. Barnes, Carole A. Haswell, Adam T. Stevenson, João P. Faria, Erwan Quintin, Zachary O. B. Ross, Luca Fossati, James S. Jenkins, Douglas Alves, Daniel Staab 16 pages, 10 figures, accepted for publication in MNRAS. Appendix: 20 pages, 47 figures Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) DMPP is a radial-velocity survey that aims to detect planets around stars exhibiting anomalous activity signatures, consistent with the presence of close-in evaporating planets. Here, we report the discovery of 7 new planetary signals in 5 different systems: DMPP-2c & d, HD67200/DMPP-6b & c, HD118006/DMPP-7b, HD191122/DMPP-8b, and HD200133/DMPP-9b. We update the orbital parameters of the DMPP-1, DMPP-2, and DMPP-3 systems, along with those of the planetary systems orbiting HD181433, HD39194, and HD89839. We derive detection limits for all 24 targets in our sample with adequate observational coverage, and test the DMPP hypothesis by calculating the occurrence rates for planets in this configuration. We find that the occurrence rates of planets in our sample with orbital periods shorter than $50~\\mathrm{d}$ and masses in the range $3$-$10$ M$_\\oplus$ are $83.0^{+27.1}_{-24.4}\\%$, for $10$-$30$ M$_\\oplus$ are $27.0^{+15.0}_{-11.2}\\%$, and for $30$-$100$ M$_\\oplus$ are $13.9^{+11.8}_{-7.5}\\%$. This is significantly higher than the occurrence rates reported by other radial velocity surveys, providing strong support for the DMPP hypothesis.",
      "pdf_url": "https://arxiv.org/pdf/2602.18207.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.05351",
      "title": "Deep Generative model that uses physical quantities to generate and retrieve solar magnetic active regions",
      "authors": [
        "Subhamoy Chatterjee",
        "Andres Munoz-Jaramillo",
        "Anna Malanushenko"
      ],
      "abstract": "Deep Generative model that uses physical quantities to generate and retrieve solar magnetic active regions Subhamoy Chatterjee, Andres Munoz-Jaramillo, Anna Malanushenko 14 pages, 9 figures, accepted for publication in ApJS Solar and Stellar Astrophysics (astro-ph.SR); Machine Learning (cs.LG); Machine Learning (stat.ML) Deep generative models have shown immense potential in generating unseen data that has properties of real data. These models learn complex data-generating distributions starting from a smaller set of latent dimensions. However, generative models have encountered great skepticism in scientific domains due to the disconnection between generative latent vectors and scientifically relevant quantities. In this study, we integrate three types of machine learning models to generate solar magnetic patches in a physically interpretable manner and use those as a query to find matching patches in real observations. We use the magnetic field measurements from Space-weather HMI Active Region Patches (SHARPs) to train a Generative Adversarial Network (GAN). We connect the physical properties of GAN-generated images with their latent vectors to train Support Vector Machines (SVMs) that do mapping between physical and latent spaces. These produce directions in the GAN latent space along which known physical parameters of the SHARPs change. We train a self-supervised learner (SSL) to make queries with generated images and find matches from real data. We find that the GAN-SVM combination enables users to produce high-quality patches that change smoothly only with a prescribed physical quantity, making generative models physically interpretable. We also show that GAN outputs can be used to retrieve real data that shares the same physical properties as the generated query. This elevates Generative Artificial Intelligence (AI) from a means-to-produce artificial data to a novel tool for scientific data interrogation, supporting its applicability beyond the domain of heliophysics.",
      "pdf_url": "https://arxiv.org/pdf/2502.05351.pdf",
      "categories": [
        "astro-ph.SR",
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16401",
      "title": "Quantifying the Effects of Parameters in Widespread SEP Events with EPREM",
      "authors": [
        "Matthew A. Young",
        "Bala Poduval"
      ],
      "abstract": "Quantifying the Effects of Parameters in Widespread SEP Events with EPREM Matthew A. Young, Bala Poduval Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) The Energetic Particle Radiation Environment Model (EPREM) solves the focused transport equation (FTE) on a Lagrangian grid in a frame co-moving with the solar wind plasma and simulates the acceleration and transport of solar energetic particles (SEP) in the heliosphere. When not coupled to an external magnetohydrodynamic model, EPREM functions in an uncoupled mode where an ideal cone-shock is injected into a homogeneous background solar wind. We carried out an analysis of the effects of multiple physical parameters in producing widespread SEP events simulated by the uncoupled EPREM using a relatively simple model of a strong magnetized shock propagating radially outward through the inner heliosphere to produce the requisite MHD quantities for EPREM's sophisticated model of proton acceleration and transport. We compared a baseline simulation with seven variations in which the value of a single parameter differed from its baseline value. All simulations exhibit complex profiles of SEP flux as a function of time and energy, with clear dependence on parameters related to diffusion, mean free path, and shock profile. Moreover, while all simulations exhibit significant longitudinal spread in SEP flux, for certain parameter values there exists a decrease or absence in SEP flux at observers located $\\geq 90^\\circ$ from the shock origin. Relating the differences in SEP flux to the specific values of each parameter in the simulations provides insight into the morphology of observed SEP events and the state of the solar wind through which the driving CME propagates.",
      "pdf_url": "https://arxiv.org/pdf/2509.16401.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.07190",
      "title": "Rethinking mass transfer: a unified semianalytical framework for circular and eccentric binaries. II. Orbital evolution due to nonconservative mass transfer",
      "authors": [
        "A. Parkosidis",
        "S. Toonen",
        "E. Laplace",
        "F. Dosopoulou"
      ],
      "abstract": "Rethinking mass transfer: a unified semianalytical framework for circular and eccentric binaries. II. Orbital evolution due to nonconservative mass transfer A. Parkosidis, S. Toonen, E. Laplace, F. Dosopoulou Solar and Stellar Astrophysics (astro-ph.SR) Although mass transfer (MT) has been studied primarily in circular binaries, observations show that it also occurs in eccentric systems. We investigate orbital evolution during nonconservative MT in eccentric orbits, a process especially relevant for binaries containing compact objects (COs). We examined four angular momentum loss (AML) modes: Jeans, isotropic reemission, orbital-AML, and $L_2$ mass loss, with the last mode being the most efficient AML mode. For a fixed AML mode and accretion efficiency, orbital evolution is correlated: orbits either widen while becoming more eccentric, or shrink while circularizing. Jeans mode generally yields orbital widening and eccentricity pumping, whereas $L_2$ mass loss typically leads to orbital shrinkage and eccentricity damping. Isotropic reemission and orbital-AML show an intermediate behavior. Adopting isotropic reemission, we demonstrate that eccentric MT produces compact binaries that merge via gravitational waves (GW) within a Hubble time, whereas the same systems would instead merge during MT under traditional modeling. We further show that, in eccentric orbits, the gravitational potential at $L_2$ becomes lower than at $L_1$ across a wide range of mass ratios and eccentricities, naturally linking eccentricity to $L_2$ mass loss. Eccentric MT may therefore lead to the formation of the circumbinary disks observed around eccentric post-red-giant-branch and post-asymptotic-giant-branch systems. Since interacting binaries containing COs are frequently eccentric, $L_2$ mass loss offers a new robust pathway to orbital tightening during eccentric MT, contributing to the formation rate of GW sources. This model can treat orbital evolution due to conservative and nonconservative MT in arbitrary eccentricities, with applications ranging from MT on the main sequence to GW progenitors.",
      "pdf_url": "https://arxiv.org/pdf/2511.07190.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.17736",
      "title": "Undetected past contacts with technological species: implications for technosignature science",
      "authors": [
        "Claudio Grimaldi"
      ],
      "abstract": "Undetected past contacts with technological species: implications for technosignature science Claudio Grimaldi The Astronomical Journal, 171, 154, 2026 Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) In the search for extraterrestrial intelligence (SETI), the highly incomplete sampling of the technosignature search space is often considered as a plausible explanation for the persistent lack of detections over six decades of searches. If correct, this would imply that technosignatures may already have reached Earth without being detected or correctly identified. Here, we explore this possibility using a Bayesian inference framework to estimate present-day detectability given $n\\ge 1$ undetected contacts over the past 65 years -- the period since the first SETI experiment. We show that achieving high detectability of technosignatures emitted within a few hundred light-years of Earth would require implausibly large $n$ values, even exceeding the population of habitable planets within that range. More conservative estimates can be obtained only assuming that emitters are tightly clustered near Earth or that their population in the Milky Way has undergone a very recent and sudden boost. This tension is further exacerbated for short-lived technosignatures and persists whether they are omnidirectional, as in Dysonian megastructures, or directional, as in intentional communication attempts. These findings suggest that, if undetected past contacts from the Milky Way have indeed occurred, the best prospects of detection may lie in searches extending over several thousand light-years, though only a few detectable technoemissions would be expected.",
      "pdf_url": "https://arxiv.org/pdf/2602.17736.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17816",
      "title": "Improved Identification of Satellite Trails in ACS/WFC Imaging Using a Modified Radon Transform",
      "authors": [
        "David V. Stark",
        "Norman Grogin",
        "Jenna Ryon",
        "Ray Lucas"
      ],
      "abstract": "Improved Identification of Satellite Trails in ACS/WFC Imaging Using a Modified Radon Transform David V. Stark, Norman Grogin, Jenna Ryon, Ray Lucas 25 pages, 12 figures, 2 tables. Code available at this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a new approach to identify satellite trails (or other linear artifacts) in ACS/WFC imaging data using a modified Radon Transform. We demonstrate that this approach is sensitive to features with mean brightness significantly below the background noise level, and it is resistant to the influence of bright astronomical sources (e.g., stars, galaxies) in most cases. Comparing with a set of satellite trails identified by eye, we find a trail recovery rate of 85\\% and a false detection rate (after removing diffraction spikes that are easily filtered) of 2.5\\%. By performing an analysis using a much larger ACS/WFC data set where false trails are identified by their persistence across multiple images of the same field, we identify the Radon Transform parameter space and image properties where our algorithm is unreliable, and estimate a false detection rate of $\\sim10\\%$ elsewhere. We apply our method to ACS/WFC data taken between 2002 and 2022 to determine both the frequency of satellite trail contamination in science data and also the typical trail brightness as a function of time. We find the rate of satellite trail contamination has increased by approximately a factor of two in the last two decades, but there is no clear systematic evolution in the typical trail brightness. Our satellite trail identification program is available as part of the \\texttt{acstools} package.",
      "pdf_url": "https://arxiv.org/pdf/2602.17816.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18173",
      "title": "Euclid: An automated system to match Rubin transient alerts to Euclid observations",
      "authors": [
        "C. Duffy",
        "I. M. Hook",
        "C. M. Gutierrez",
        "K. Paterson",
        "V. Petrecca",
        "T. J. Moriya",
        "F. Poidevin",
        "R. Kotak",
        "B. Altieri",
        "A. Amara",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "A. Balestra",
        "S. Bardelli",
        "P. Battaglia",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H. M. Courtois",
        "M. Cropper",
        "J.-C. Cuillandre",
        "H. Degaudenzi",
        "G. De Lucia",
        "H. Dole",
        "F. Dubath",
        "X. Dupac",
        "S. Dusini",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "S. Ferriol",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "W. Gillard",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "S. V. H. Haugan",
        "M. S. Holliman",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "S. Kermiche",
        "A. Kiessling",
        "R. Kohley",
        "B. Kubik",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti",
        "D. Maino",
        "E. Maiorano",
        "O. Mansutti",
        "S. Marcin",
        "O. Marggraf",
        "M. Martinelli",
        "N. Martinet",
        "F. Marulli",
        "R. J. Massey",
        "E. Medinaceli",
        "S. Mei",
        "Y. Mellier",
        "M. Meneghetti",
        "E. Merlin",
        "G. Meylan",
        "A. Mora",
        "M. Moresco",
        "L. Moscardini",
        "R. Nakajima",
        "C. Neissner"
      ],
      "abstract": "Euclid: An automated system to match Rubin transient alerts to Euclid observations C. Duffy (1), I. M. Hook (1), C. M. Gutierrez (2 and 3), K. Paterson (4), V. Petrecca (5 and 6), T. J. Moriya (7 and 8 and 9), F. Poidevin (2 and 3), R. Kotak (10), B. Altieri (11), A. Amara (12), S. Andreon (13), N. Auricchio (14), C. Baccigalupi (15 and 16 and 17 and 18), M. Baldi (19 and 14 and 20), A. Balestra (21), S. Bardelli (14), P. Battaglia (14), A. Biviano (16 and 15), E. Branchini (22 and 23 and 13), M. Brescia (24 and 5), S. Camera (25 and 26 and 27), G. Cañas-Herrera (28 and 29), V. Capobianco (27), C. Carbone (30), J. Carretero (31 and 32), S. Casas (33 and 34), M. Castellano (35), G. Castignani (14), S. Cavuoti (5 and 36), K. C. Chambers (37), A. Cimatti (38), C. Colodro-Conde (2), G. Congedo (28), C. J. Conselice (39), L. Conversi (40 and 11), Y. Copin (41), F. Courbin (42 and 43 and 44), H. M. Courtois (45), M. Cropper (46), J.-C. Cuillandre (47), H. Degaudenzi (48), G. De Lucia (16), H. Dole (49), F. Dubath (48), X. Dupac (11), S. Dusini (50), S. Escoffier (51), M. Farina (52), R. Farinelli (14), S. Ferriol (41), M. Frailis (16), E. Franceschi (14), M. Fumana (30), S. Galeotta (16), K. George (53), W. Gillard (51), B. Gillis (28), C. Giocoli (14 and 20), J. Gracia-Carpio (54), A. Grazian (21), F. Grupp (54 and 55), S. V. H. Haugan (56), M. S. Holliman (28), W. Holmes (57), F. Hormuth (58), A. Hornstrup (59 and 60), K. Jahnke (4), M. Jhabvala (61), S. Kermiche (51), A. Kiessling (57), R. Kohley (11), B. Kubik (41), M. Kunz (62), H. Kurki-Suonio (63 and 64), A. M. C. Le Brun (65), S. Ligori (27), P. B. Lilje (56), V. Lindholm (63 and 64), I. Lloro (66), G. Mainetti (67), D. Maino (68 and 30 and 69), E. Maiorano (14), O. Mansutti (16), S. Marcin (70), O. Marggraf (71), M. Martinelli (35 and 72), N. Martinet (73), F. Marulli (74 and 14 and 20), R. J. Massey (75), E. Medinaceli (14), S. Mei (76 and 77), Y. Mellier (78 and 79), M. Meneghetti (14 and 20), E. Merlin (35), G. Meylan (80), A. Mora (81), M. Moresco (74 and 14), L. Moscardini (74 and 14 and 20), R. Nakajima (71), C. Neissner 16 Pages, 8 Figures, Accepted in RASTI Instrumentation and Methods for Astrophysics (astro-ph.IM) The Vera C. Rubin observatory is expected to produce 10 million transient alerts per night in ugrizy filters, whilst Euclid is a visible to near-infrared space telescope engaged in a wide field survey. We present a prototype system to automatically match the transient alerts from Rubin to Euclid observations. The system produces joint light-curves containing both visible and near-infrared photometry, and joint image cutouts. Using Zwicky Transient Facility alerts as a proxy for Rubin, we demonstrate the system in use in cases where Euclid did and did not detect the transient and highlight the value that can be added in each case. For transients detected by Euclid these benefits include identifying the supernovae (SNe) in observations taken prior to ground-based detection, thereby better constraining the explosion time, such as SN 2024pvw detected ~3 d prior to ground based detections. In cases where Euclid did not detect the transient, we demonstrate the benefit of adding Euclid observations to improve host morphology measurements and associations.",
      "pdf_url": "https://arxiv.org/pdf/2602.18173.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18239",
      "title": "Mathematical derivation and verification of the amplitude of LISA's interferometric signals on an ultra-stable interferometer testbed",
      "authors": [
        "Alvise Pizzella",
        "Lennart Wissel",
        "Miguel Dovale-Alvarez",
        "Pablo Martinez Cano",
        "Rodrigo Garcia Alvarez",
        "Christoph Bode",
        "Juan Jose Esteban Delgado",
        "Gerhard Heinzel"
      ],
      "abstract": "Mathematical derivation and verification of the amplitude of LISA's interferometric signals on an ultra-stable interferometer testbed Alvise Pizzella, Lennart Wissel, Miguel Dovale-Alvarez, Pablo Martinez Cano, Rodrigo Garcia Alvarez, Christoph Bode, Juan Jose Esteban Delgado, Gerhard Heinzel Instrumentation and Methods for Astrophysics (astro-ph.IM) The Laser Interferometer Space Antenna (LISA) mission aims to detect gravitational waves by interferometrically measuring the change of separation between free-falling test masses (TMs). LISA's interferometers must deliver pm/rtHz sensitivity while accommodating beam tilts up to 1 mrad at the photodiodes, which degrade the interferometric amplitude and increase the induced readout noise coupling. This paper uses an analytical framework developed by the authors in a previous work, based on minimal and justified approximations, that relates beam tilt to the resulting heterodyne signal amplitude in a generic two-beam interferometer with circular-area photodiodes (PDs). A set of interferometric topologies is analyzed, all of high relevance for LISA. We derive the exact amplitude response for an infinite detector and a closed-form approximation for finite detectors, and we validate both against numerical simulations and experimental measurements on an ultra-stable LISA-representative testbed. We then use this model to quantify the phase-noise amplification arising from reduced signal-to-noise ratio (SNR) under tilt, showing that curvature mismatches between the interfering beams substantially enhance this effect. Finally, we introduce a compact function that captures the angular dependence of correlated and uncorrelated phase noises in quadrant photodiode (QPD)-based readouts. Here, a new noise feature, caused by wavefront curvature mismatch, is predicted and measured for the first time. These results indicate that controlling wavefront curvature mismatch in the test mass interferometer (TMI) is essential to limit excess phase noise. The models and results derived in this paper, although originating in the context of LISA, are general and can be applied to any interferometric topology undergoing tilts with pivot on the detector plane.",
      "pdf_url": "https://arxiv.org/pdf/2602.18239.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.18276",
      "title": "Chromaticity-Optimized Antenna Design and Bayesian Foreground Validation for the CANTAR Global 21 cm Experiment",
      "authors": [
        "Michelle Mora",
        "German Chaparro",
        "Juan D. Guerrero",
        "Catalina Alzate",
        "Juan P. Urrego",
        "Jimena Giraldo",
        "Pablo Cuartas-Restrepo",
        "Julian Rodriguez-Ferreira",
        "Oscar Restrepo"
      ],
      "abstract": "Chromaticity-Optimized Antenna Design and Bayesian Foreground Validation for the CANTAR Global 21 cm Experiment Michelle Mora, German Chaparro, Juan D. Guerrero, Catalina Alzate, Juan P. Urrego, Jimena Giraldo, Pablo Cuartas-Restrepo, Julian Rodriguez-Ferreira, Oscar Restrepo Accepted to ApJ, part of the CANTAR collaboration Instrumentation and Methods for Astrophysics (astro-ph.IM) Detecting the global 21 cm signal from the epoch of reionization remains a major observational challenge due to bright foregrounds and instrumental systematics. As part of the Colombian Antarctic Telescopes for 21 cm Absorption during Reionization (CANTAR) initiative, we present a simulation and analysis framework to evaluate antenna chromaticity, optimize instrument design, and assess site suitability for global 21 cm experiments. Using frequency-dependent beam models and Haslam-based sky maps, we compute dynamic spectra for the EDGES blade dipole and a set of dipole and novel monopole antennas optimized via particle swarm optimization. The optimized designs exhibit improved spectral smoothness compared to EDGES, particularly in the 70-120 MHz range. We also evaluate latitude-dependent sky brightness and identify mid-latitude sites (-40° to +5°) as optimal for foreground suppression. We apply Bayesian inference together with posterior predictive model validation to the publicly released EDGES data, assessing statistical consistency rather than hypothesis testing or model comparison. We find that physically motivated foreground and ionospheric models are statistically consistent with the data only when a 21 cm absorption feature is excluded. From the validated posterior, we generate a statistically validated ensemble of foreground corrections for use in beam-sky simulations. These results support a two-phase strategy for CANTAR: Antarctic deployments for calibration and testing, and future science operations at mid-latitude sites. Our framework provides a validated path toward robust foreground modeling, antenna design, and systematics control for global 21 cm signal detection.",
      "pdf_url": "https://arxiv.org/pdf/2602.18276.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17708",
      "title": "Spectral Homogenization of the Radiative Transfer Equation via Low-Rank Tensor Train Decomposition",
      "authors": [
        "Y. Sungtaek Ju"
      ],
      "abstract": "Spectral Homogenization of the Radiative Transfer Equation via Low-Rank Tensor Train Decomposition Y. Sungtaek Ju 30 pages; submitted for publication Chemical Physics (physics.chem-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG); Atmospheric and Oceanic Physics (physics.ao-ph); Computational Physics (physics.comp-ph); Plasma Physics (physics.plasm-ph) Radiative transfer in absorbing-scattering media requires solving a transport equation across a spectral domain with 10^5 - 10^6 molecular absorption lines. Line-by-line (LBL) computation is prohibitively expensive, while existing approximations sacrifice spectral fidelity. We show that the Young-measure homogenization framework produces solution tensors I that admit low-rank tensor-train (TT) decompositions whose bond dimensions remain bounded as the spectral resolution Ns increases. Using molecular line parameters from the HITRAN database for H2O and CO2, we demonstrate that: (i) the TT rank saturates at r = 8 (at tolerance e = 10^-6) from Ns = 16 to 4096, independent of single-scattering albedo, Henyey-Greenstein asymmetry, temperature, and pressure; (ii) quantized tensor-train (QTT) representations achieve sub-linear storage scaling; (iii) in a controlled comparison using identical opacity data and transport solver, the homogenized approach achieves over an order of magnitude lower L2 error than the correlated-k distribution at equal cost; and (iv) for atomic plasma opacity (aluminum at 60 eV, TOPS database), the TT rank saturates at r = 15 with fundamentally different spectral structure (bound-bound and bound-free transitions spanning 12 decades of dynamic range), confirming that rank boundedness is a property of the transport equation rather than any particular opacity source. These results establish that the spectral complexity of radiative transfer has a finite effective rank exploitable by tensor decomposition, complementing the spatial-angular compression achieved by existing TT and dynamical low-rank approaches.",
      "pdf_url": "https://arxiv.org/pdf/2602.17708.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18058",
      "title": "Probabilistic Methods for Initial Orbit Determination and Orbit Determination in Cislunar Space",
      "authors": [
        "Ishan Paranjape",
        "Tarun Hejmadi",
        "Suman Chakravorty"
      ],
      "abstract": "Probabilistic Methods for Initial Orbit Determination and Orbit Determination in Cislunar Space Ishan Paranjape, Tarun Hejmadi, Suman Chakravorty To be submitted to the Journal of Astronautical Sciences DISTRIBUTION A: Approved for public release; distribution is unlimited. Public affairs approval #AFRL-2026-0779 Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Systems and Control (eess.SY); Optimization and Control (math.OC); Data Analysis, Statistics and Probability (physics.data-an); Space Physics (physics.space-ph); Applications (stat.AP) In orbital mechanics, Gauss's method for orbit determination (OD) is a popular, minimal assumption solution for obtaining the initial state estimate of a passing resident space object (RSO). Since much of the cislunar domain relies on three-body dynamics, a key assumption of Gauss's method is rendered incompatible, creating a need for a new, minimal assumption method for initial orbit determination (IOD). In this work, we present a framework for short and long term probabilistic target tracking in cislunar space which produces an initial state estimate with as few assumptions as possible. Specifically, we propose an IOD method involving the kinematic fitting of several series of noisy, consecutive ground-based observations. Once a probabilistic initial state estimate in the form of a particle cloud is formed, we apply the powerful Particle Gaussian Mixture (PGM) Filter to reduce the uncertainty of our state estimate over time. This combined IOD/OD framework is demonstrated for several classes of trajectories in cislunar space and compared to better-known filtering frameworks.",
      "pdf_url": "https://arxiv.org/pdf/2602.18058.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "eess.SY",
        "math.OC",
        "stat.AP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.17592",
      "title": "AstroMLab 4: Benchmark-Topping Performance in Astronomy Q&A with a 70B-Parameter Domain-Specialized Reasoning Model",
      "authors": [
        "Tijmen de Haan",
        "Yuan-Sen Ting",
        "Tirthankar Ghosal",
        "Tuan Dung Nguyen",
        "Alberto Accomazzi",
        "Emily Herron",
        "Vanessa Lama",
        "Rui Pan",
        "Azton Wells",
        "Nesar Ramachandra"
      ],
      "abstract": "AstroMLab 4: Benchmark-Topping Performance in Astronomy Q&A with a 70B-Parameter Domain-Specialized Reasoning Model Tijmen de Haan, Yuan-Sen Ting, Tirthankar Ghosal, Tuan Dung Nguyen, Alberto Accomazzi, Emily Herron, Vanessa Lama, Rui Pan, Azton Wells, Nesar Ramachandra Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) General-purpose large language models (LLMs), despite their broad capabilities, often struggle with specialized domain knowledge. This gap hinders their deployment as reliable research agents in demanding fields such as astronomy. Building on our prior work with AstroSage-Llama-3.1-8B, this study introduces AstroSage-Llama-3.1-70B, a 70-billion parameter domain-specialized natural-language AI assistant. It is designed for research and education across astronomy, astrophysics, space science, astroparticle physics, cosmology, and astronomical instrumentation. Developed from the Meta-Llama-3.1-70B foundation, AstroSage-Llama-3.1-70B underwent extensive continued pre-training (CPT) on a vast corpus of astronomical literature, followed by supervised fine-tuning (SFT) and model merging. We integrated reasoning chains into the SFT dataset, enabling AstroSage-Llama-3.1-70B to either answer the user query immediately, or first emit a human-readable thought process. Evaluated on a validated subset of 3,846 questions from the AstroMLab-1 benchmark (Ting et al., 2024) -- derived from literature withheld during training -- AstroSage-Llama-3.1-70B achieves top-tier performance (89.0%), matching GPT-5.2, Claude-4.5-Opus, and Gemini-3-Pro while being more cost-efficient. This work demonstrates that domain specialization, when applied to large-scale models, can enable them to outperform generalist counterparts in specialized knowledge areas like astronomy, thereby advancing the frontier of AI capabilities in the field.",
      "pdf_url": "https://arxiv.org/pdf/2505.17592.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.18216",
      "title": "TasVisAn and InsPy -- Python Packages for Triple-Axis Spectrometer Data Visualization, Analysis, Instrument Resolution Calculation, and Convolution",
      "authors": [
        "Guochu Deng",
        "Garry J. McIntyre"
      ],
      "abstract": "TasVisAn and InsPy -- Python Packages for Triple-Axis Spectrometer Data Visualization, Analysis, Instrument Resolution Calculation, and Convolution Guochu Deng, Garry J. McIntyre J. Appl. Crystallogr. Volume 58, Page 2149-2162, 2025 Instrumentation and Methods for Astrophysics (astro-ph.IM); Strongly Correlated Electrons (cond-mat.str-el) Experimental data collected from a triple-axis spectrometer (TAS) are typically analysed by considering the instrument resolution, as the resolution of a TAS instrument is often complex and significantly influences the measured results. Two Python packages, TasVisAn and InsPy, have been developed to visualize and analyse data from TAS instruments - particularly from the cold-neutron TAS Sika and the thermal-neutron TAS Taipan at the Australian Centre for Neutron Scattering. TasVisAn offers a range of functions, including data importing, reduction, plotting, contour mapping, convolution fitting, and more, for data collected on TAS instruments, especially on Sika and Taipan. It also supports data reduction of the current trendy multi-analyser and multiplexing TAS instruments, including the multiplexing mode of Sika. Besides, it includes scan simulation and batch file validation tools for both Taipan and Sika, assisting users in designing and planning experiments in advance. InsPy is a general-purpose Python package designed to calculate the four-dimensional (4D) instrument resolution in momentum-energy space for any TAS instrument. Combined with InsPy, TasVisAn supports both instrument resolution calculation and resolution-convoluted data fitting. Its flexible external data import feature further allows TasVisAn to be adapted for the visualization and convolution analysis of inelastic neutron scattering data across various TAS instruments.",
      "pdf_url": "https://arxiv.org/pdf/2506.18216.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.10992",
      "title": "Joint Bayesian calibration and map-making for intensity mapping experiments",
      "authors": [
        "Zheng Zhang",
        "Philip Bull",
        "Mario G. Santos",
        "Ainulnabilah Nasirudin"
      ],
      "abstract": "Joint Bayesian calibration and map-making for intensity mapping experiments Zheng Zhang, Philip Bull, Mario G. Santos, Ainulnabilah Nasirudin 30 pages, 18 figures. (Under RASTI review.) Any comments are welcome Instrumentation and Methods for Astrophysics (astro-ph.IM) Line-intensity mapping (LIM) is an emerging cosmological technique that traces large-scale structure through the integrated spectral-line emission of unresolved sources. Reconstructing unbiased sky maps requires careful joint treatment of instrumental calibration and map-making, a task made challenging by time-varying receiver gains, thermal drifts, and correlated $1/f$ noise intrinsic to single-dish radio telescopes. We present a Bayesian framework for joint calibration and map-making using Gibbs sampling, giving access to the full joint posterior of calibration and sky map parameters. Our data model is grounded in the radiometer equation, capturing the coupling between noise level and system temperature without assuming a fixed noise amplitude. Gain and system temperature are estimated via an iterative generalised least squares (GLS) scheme, while absolute flux calibration is achieved either with external calibrators or via known signal injections such as noise diodes. We further introduce a $1/f$ noise model that avoids spurious periodic correlations arising from the common assumption of a diagonally structured noise covariance in the frequency domain. The workflow is implemented in an efficient software package using the Levinson algorithm and a polynomial emulator to reduce computational cost. Demonstrated on simulations representative of MeerKLASS single-dish observations, the framework generalises to other single-dish surveys and to cross-correlation and interferometric data.",
      "pdf_url": "https://arxiv.org/pdf/2509.10992.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17777",
      "title": "Possible stratospheric emission in the warm Neptune GJ 436 b from high-resolution spectroscopy",
      "authors": [
        "Luke Finnerty",
        "Michael P Fitzgerald",
        "Jerry W Xuan",
        "Daniel Echeverri",
        "Nemanja Jovanovic",
        "Dimitri Mawet",
        "Geoffrey A Blake",
        "Ashley Baker",
        "Randall Bartos",
        "Benjamin Calvin",
        "Sylvain Cetre",
        "Jacques-Robert Delorme",
        "Greg Doppmann",
        "Katelyn Horstman",
        "Chih-Chun Hsu",
        "Julie Inglis",
        "Joshua Liberman",
        "Ronald A López",
        "Evan Morris",
        "Jacklyn Pezzato-Rovner",
        "Jean-Baptiste Ruffio",
        "Ben Sappey",
        "Tobias Schofield",
        "Andrew Skemer",
        "J. Kent Wallace",
        "Nicole L Wallack",
        "Jason J Wang",
        "Ji Wang",
        "Yinzi Xin"
      ],
      "abstract": "Possible stratospheric emission in the warm Neptune GJ 436 b from high-resolution spectroscopy Luke Finnerty, Michael P Fitzgerald, Jerry W Xuan, Daniel Echeverri, Nemanja Jovanovic, Dimitri Mawet, Geoffrey A Blake, Ashley Baker, Randall Bartos, Benjamin Calvin, Sylvain Cetre, Jacques-Robert Delorme, Greg Doppmann, Katelyn Horstman, Chih-Chun Hsu, Julie Inglis, Joshua Liberman, Ronald A López, Evan Morris, Jacklyn Pezzato-Rovner, Jean-Baptiste Ruffio, Ben Sappey, Tobias Schofield, Andrew Skemer, J. Kent Wallace, Nicole L Wallack, Jason J Wang, Ji Wang, Yinzi Xin 22 pages, 10 figures, 2 tables, accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP) We present high spectral resolution $L$ band (2.91--3.85 $\\mu$m) observations of the warm Neptune GJ 436 b from Keck II/KPIC. KPIC's single-mode fiber feed reduces the $L$ band sky background by a factor of 100, significantly improving sensitivity compared to a seeing-limited spectrometer and enabling a tentative ($\\rm SNR = 3-4$) cross-correlation detection of GJ 436 b with a thermally inverted atmospheric model. In contrast with recent results from $JWST$ and high-resolution transmission spectroscopy, our retrieval analysis prefers the presence of H$_2$O, and possibly CH$_4$, molecular features in emission. The broad-band continuum flux associated with the maximum-likelihood model is substantially higher than expected based on both the $\\sim670\\rm\\ K$ equilibrium temperature of GJ 436 b and previous results from low-resolution spectroscopy. We demonstrate that the loss of continuum information during the processing of high-resolution spectra makes our analysis effectively insensitive to the absolute continuum level of the planet, and that scaling the maximum-likelihood model to match the broad-band flux measured from low-resolution observations of GJ 436 b results in a detection of similar strength in cross-correlation. These results could be explained by a thermal inversion arising above a haze layer in the upper atmosphere of \\gjb. Further observations, ideally post-eclipse in order to break the $K_p - \\Delta v_{sys}$ degeneracy, are needed to clarify this possible detection. This work demonstrates the potential of $L$ band high-resolution spectroscopy for characterizing significantly smaller and cooler exoplanets compared with hot Jupiters.",
      "pdf_url": "https://arxiv.org/pdf/2602.17777.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18101",
      "title": "Inhomogeneous magnetic coupling in exoplanets: the stop & go of WASP-18 b's atmospheric flows",
      "authors": [
        "Aljona Blöcker",
        "Ludmila Carone",
        "Christiane Helling"
      ],
      "abstract": "Inhomogeneous magnetic coupling in exoplanets: the stop & go of WASP-18 b's atmospheric flows Aljona Blöcker, Ludmila Carone, Christiane Helling Earth and Planetary Astrophysics (astro-ph.EP) Early studies of ionization in hot Jupiter atmospheres suggest that magnetic coupling can shape their dynamics. These effects may be most pronounced in ultra-hot Jupiters that sustain global magnetic fields. WASP-18 b hosts an ionized dayside atmosphere extending deep enough to be strongly influenced by magnetic forces. Phase curve observations suggest effective magnetic drag, yet its impact on the atmospheric circulation remains poorly constrained. This work explores how magnetic drag in an inhomogeneously ionized atmosphere shapes local and global dynamics to provide a pathway to constrain the planet's magnetic field strength. An analytical parameterization for anisotropic magnetic drag, including both Pedersen and Hall drag components, and associated frictional heating in the globally neutral atmosphere, is implemented in the 3D General Circulation Model ExoRad to study WASP-18 b's atmosphere. Climate characteristics are compared for different drag formulations to assess whether anisotropic physics is required to capture magnetic coupling effects. Anisotropic magnetic drag and frictional heating, both set by local ionization, strongly affect wind strength and direction in the upper atmosphere, modify the day-night circulation, and produce observable temperature asymmetries. They enhance the evening-morning terminator temperature difference near 0.1 bar and generate two off-equator hotspots with reduced eastward shift. The terminator regions are particularly sensitive to how magnetic drag is modeled. Anisotropic magnetic drag damps and redirects dayside-to-nightside winds, partially decoupling the equatorial flow at the morning terminator while maintaining the nightside jet. Locally varying drag forces and frictional heating create asymmetric temperature patterns manifesting as primary and secondary hotspot regions.",
      "pdf_url": "https://arxiv.org/pdf/2602.18101.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18111",
      "title": "Testing the Icy Pebble Accretion Hypothesis with Primordial Main Belt Asteroids",
      "authors": [
        "Jinfei Yu",
        "Hiroyuki Kurokawa",
        "Tetsuo Taki"
      ],
      "abstract": "Testing the Icy Pebble Accretion Hypothesis with Primordial Main Belt Asteroids Jinfei Yu, Hiroyuki Kurokawa, Tetsuo Taki 22 pages, 6 figures, 1 table, accepted in ApJ Earth and Planetary Astrophysics (astro-ph.EP) Large main-belt asteroids (diameter $D \\gtrsim 120\\ \\mathrm{km}$) exhibit a surface composition gradient as a function of heliocentric distance, ranging from anhydrous bodies to those rich in hydrated and, possibly, ammoniated materials. Their primordial nature holds key clues to the evolution of the Solar System. It has been suggested that the volatile-rich bodies formed in the outer Solar System and were implanted into the main belt. Alternatively, volatiles may have been delivered via inward-drifting icy pebbles in the protosolar disk. Here, we examine whether in-situ formed rocky embryos can acquire volatiles through pebble accretion as the snowline migrated inward. With the turbulence strength of the disk, radial pebble flux, and the dimensionless stopping time of pebbles (St) as parameters, we calculate the growth of large asteroids. The results are then compared with mass and compositional constraints based on asteroid observations. We find that a moderate pebble flux ($\\lesssim18~M_\\oplus / \\text{Myr}$) is required to enable volatile delivery while preventing the largest asteroids from becoming more massive than Ceres. Water accretion is feasible with $\\mathrm{St} \\sim 10^{-3}$ ($\\sim 1$ mm). However, only the largest asteroids (D > 200 km) can accumulate sufficient ammonia under such conditions. For most asteroids with D between 100 and 200 km, ammonia ice accretion requires $\\mathrm{St} \\sim 10^{-4}$ ($\\sim 100\\,\\mu$m). Such small particle sizes may pose both theoretical and observational challenges. Thus, we propose that the intermediate-sized, potentially ammonia-bearing asteroids serve as a record of the Solar System's dynamic evolution.",
      "pdf_url": "https://arxiv.org/pdf/2602.18111.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09330",
      "title": "NIRPS tightens the mass estimate of GJ 3090 b and detects a planet near the stellar rotation period",
      "authors": [
        "Pierrot Lamontagne",
        "Drew Weisserman",
        "Charles Cadieux",
        "David Lafrenière",
        "Alexandrine L'Heureux",
        "Mykhaylo Plotnykov",
        "Léna Parc",
        "Atanas K. Stefanov",
        "Leslie Moranta",
        "René Doyon",
        "François Bouchy",
        "Jean-Baptiste Delisle",
        "Louise D. Nielsen",
        "Gaspare Lo Curto",
        "Frédérique Baron",
        "Susana C. C. Barros",
        "Björn Benneke",
        "Xavier Bonfils",
        "Marta Bryan",
        "Bruno L. Canto Martins",
        "Ryan Cloutier",
        "Nicolas B. Cowan",
        "Daniel Brito de Freitas",
        "Jose Renan De Medeiros",
        "Xavier Delfosse",
        "Elisa Delgado-Mena",
        "Xavier Dumusque",
        "David Ehrenreich",
        "Pedro Figueira",
        "Jonay I. González Hernández",
        "Izan de Castro Leão",
        "Christophe Lovis",
        "Lison Malo",
        "Claudio Melo",
        "Lucile Mignon",
        "Christoph Mordasini",
        "Francesco Pepe",
        "Rafael Rebolo",
        "Jason Rowe",
        "Nuno C. Santos",
        "Damien Ségransan",
        "Alejandro Suárez Mascareño",
        "Stéphane Udry",
        "Diana Valencia",
        "Gregg Wade",
        "Manuel Abreu",
        "José Luan A. Aguiar",
        "Khaled Al Moulla",
        "Guillaume Allain",
        "Romain Allart",
        "Jose Manuel Almenara",
        "Tomy Arial",
        "Hugues Auger",
        "Luc Bazinet",
        "Nicolas Blind",
        "David Bohlender",
        "Étienne Artigau",
        "Isabelle Boisse",
        "Anne Boucher",
        "Vincent Bourrier",
        "Sébastien Bovay",
        "Pedro Branco",
        "Christopher Broeg",
        "Denis Brousseau",
        "Alexandre Cabral",
        "Andres Carmona",
        "Yann Carteret",
        "Zalpha Challita",
        "David Charbonneau",
        "Bruno Chazelas",
        "Catherine A. Clark",
        "João Coelho",
        "Marion Cointepas",
        "Karen A. Collins",
        "Kevin I. Collins",
        "Uriel Conod",
        "Eduardo Cristo",
        "Ana Rita Costa Silva",
        "Antoine Darveau-Bernier",
        "Laurie Dauplaise",
        "Roseane de Lima Gomes",
        "João Faria",
        "Dasaev O. Fontinele",
        "Thierry Forveille",
        "Yolanda G. C. Frensch",
        "Jonathan Gagné",
        "Frédéric Genest",
        "Ludovic Genolet",
        "João Gomes da Silva",
        "Félix Gracia Témich",
        "Nicole Gromek",
        "Nolan Grieves",
        "Olivier Hernandez",
        "Melissa J. Hobson",
        "H. Jens Hoeijmakers",
        "Norbert Hubin",
        "Neil J. Cook",
        "Marziye Jafariyazani",
        "Farbod Jahandar",
        "Ray Jayawardhana"
      ],
      "abstract": "NIRPS tightens the mass estimate of GJ 3090 b and detects a planet near the stellar rotation period Pierrot Lamontagne, Drew Weisserman, Charles Cadieux, David Lafrenière, Alexandrine L'Heureux, Mykhaylo Plotnykov, Léna Parc, Atanas K. Stefanov, Leslie Moranta, René Doyon, François Bouchy, Jean-Baptiste Delisle, Louise D. Nielsen, Gaspare Lo Curto, Frédérique Baron, Susana C. C. Barros, Björn Benneke, Xavier Bonfils, Marta Bryan, Bruno L. Canto Martins, Ryan Cloutier, Nicolas B. Cowan, Daniel Brito de Freitas, Jose Renan De Medeiros, Xavier Delfosse, Elisa Delgado-Mena, Xavier Dumusque, David Ehrenreich, Pedro Figueira, Jonay I. González Hernández, Izan de Castro Leão, Christophe Lovis, Lison Malo, Claudio Melo, Lucile Mignon, Christoph Mordasini, Francesco Pepe, Rafael Rebolo, Jason Rowe, Nuno C. Santos, Damien Ségransan, Alejandro Suárez Mascareño, Stéphane Udry, Diana Valencia, Gregg Wade, Manuel Abreu, José Luan A. Aguiar, Khaled Al Moulla, Guillaume Allain, Romain Allart, Jose Manuel Almenara, Tomy Arial, Hugues Auger, Luc Bazinet, Nicolas Blind, David Bohlender, Étienne Artigau, Isabelle Boisse, Anne Boucher, Vincent Bourrier, Sébastien Bovay, Pedro Branco, Christopher Broeg, Denis Brousseau, Alexandre Cabral, Andres Carmona, Yann Carteret, Zalpha Challita, David Charbonneau, Bruno Chazelas, Catherine A. Clark, João Coelho, Marion Cointepas, Karen A. Collins, Kevin I. Collins, Uriel Conod, Eduardo Cristo, Ana Rita Costa Silva, Antoine Darveau-Bernier, Laurie Dauplaise, Roseane de Lima Gomes, João Faria, Dasaev O. Fontinele, Thierry Forveille, Yolanda G. C. Frensch, Jonathan Gagné, Frédéric Genest, Ludovic Genolet, João Gomes da Silva, Félix Gracia Témich, Nicole Gromek, Nolan Grieves, Olivier Hernandez, Melissa J. Hobson, H. Jens Hoeijmakers, Norbert Hubin, Neil J. Cook, Marziye Jafariyazani, Farbod Jahandar, Ray Jayawardhana Published in Astronomy & Astrophysics (26 pages, 20 figures). DOI: this https URL Earth and Planetary Astrophysics (astro-ph.EP) We present an updated characterization of the planetary system orbiting the nearby M2 dwarf GJ 3090 (TOI-177; $d = 22$ pc), based on new high-precision radial velocity (RV) observations from NIRPS and HARPS. With an orbital period of 2.85 d, the transiting sub-Neptune GJ 3090 b has a mass we refine to $4.52 \\pm 0.47 M_{\\oplus}$, which, combined with our derived radius of $2.18 \\pm 0.06 R_{\\oplus}$, yields a density of $2.40^{+0.33}_{-0.30}$ g cm$^{-3}$. The combined interior structure and atmospheric constraints indicate that GJ 3090 b is a compelling water-world candidate, with a volatile-rich envelope in which water likely represents a significant fraction. We also confirm the presence of a second planet, GJ 3090 c, a sub-Neptune with a 15.9 d orbit and a minimum mass of $10.0 \\pm 1.3 M_{\\oplus}$, which does not transit. Despite its proximity to the star's 18 d rotation period, our joint analysis using a multidimensional Gaussian process (GP) model that incorporates TESS photometry and differential stellar temperature measurements distinguishes this planetary signal from activity-induced variability. In addition, we place new constraints on a non-transiting planet candidate with a period of 12.7 d, suggested in earlier RV analyses. This candidate remains a compelling target for future monitoring. These results highlight the crucial role of multidimensional GP modelling in disentangling planetary signals from stellar activity, enabling the detection of a planet near the stellar rotation period that could have remained undetected with traditional approaches.",
      "pdf_url": "https://arxiv.org/pdf/2601.09330.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}