{
  "date": "2025-10-10",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.CO",
    "astro-ph.IM",
    "astro-ph.GA",
    "astro-ph.HE",
    "astro-ph.SR"
  ],
  "total_papers": 108,
  "gw_related_papers": 10,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2505.01356",
      "title": "Gravitational Wave Memory of Primordial Black Hole Mergers",
      "authors": [
        "Silvia Gasparotto",
        "Gabriele Franciolini",
        "Valerie Domcke"
      ],
      "abstract": "Gravitational Wave Memory of Primordial Black Hole Mergers Silvia Gasparotto, Gabriele Franciolini, Valerie Domcke Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) The gravitational wave signal of binary compact objects has two main contributions at frequencies below the characteristic merger frequency: the gravitational wave signal associated with the early inspiral stage of the binary and the non-linear gravitational wave memory. We compare the sensitivity of upcoming gravitational wave detectors to these two contributions, with a particular interest in events with a merger phase at frequencies higher than the detector's peak sensitivity. We demonstrate that for light primordial black holes, current and upcoming detectors are more sensitive to the inspiral signal. Our analysis incorporates the evolution history of primordial black hole binaries, key to accurately estimating the relevant event rates. We also discuss the waveform templates of the memory signal at ground- and space-based interferometers, and the implications for a matched filtering search. This allows us to compare the sensitivity of high-frequency gravitational wave detectors, sensitive to the merger phase, with the sensitivity of existing interferometers.",
      "pdf_url": "https://arxiv.org/pdf/2505.01356.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.14774",
      "title": "Are magnetic fields in cosmic voids primordial?",
      "authors": [
        "Deepen Garg",
        "Ruth Durrer",
        "Jennifer Schober"
      ],
      "abstract": "Are magnetic fields in cosmic voids primordial? Deepen Garg, Ruth Durrer, Jennifer Schober significant revision of the first draft with added context and more detailed analysis Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The nature of magnetic fields in the voids of the large-scale structure of the Universe has been a multifaceted open puzzle for decades. On one hand, their origin is not clear with most of the magnetogenesis models using physics beyond the standard model in the early Universe, and on the other hand, their existence and potential role in explaining the spectra of TeV blazars have been intensely debated in the past decade. Here, we propose a mechanism, within classical electrodynamics, that could fill the voids with late-Universe fields and, under certain conditions, dispel the need for primordial fields altogether to explain the void fields. Specifically, we use the dipole component of the galactic fields to generate space-filling magnetic fields in voids with white-noise spectrum and sufficient amplitude to explain the lack of GeV halos around TeV blazars observed by Fermi-LAT. A definitive test for such fields in the voids will be the white-noise spectral shape, which will constrain possible plasma processes in the voids to the ones that allow for the propagation of these dipole fields into the voids.",
      "pdf_url": "https://arxiv.org/pdf/2505.14774.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.HE",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01316",
      "title": "Expectations for the first supermassive black-hole binary resolved by PTAs II: Milestones for binary characterization",
      "authors": [
        "Polina Petrov",
        "Levi Schult",
        "Stephen R. Taylor",
        "Nihan Pol",
        "Nima Laal",
        "Maria Charisi",
        "Chung-Pei Ma"
      ],
      "abstract": "Expectations for the first supermassive black-hole binary resolved by PTAs II: Milestones for binary characterization Polina Petrov, Levi Schult, Stephen R. Taylor, Nihan Pol, Nima Laal, Maria Charisi, Chung-Pei Ma Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Following the recent evidence for a gravitational wave (GW) background found by pulsar timing array (PTA) experiments, the next major science milestone is resolving individual supermassive black hole binaries (SMBHBs). The detection of these systems could arise via searches using a power-based GW anisotropy model or a deterministic template model. In Schult et al. 2025, we compared the efficacy of these models in constraining the GW signal from a single SMBHB using realistic, near-future PTA datasets, and found that the full-signal deterministic continuous wave (CW) search may achieve detection and characterization first. Here, we continue our analyses using only the CW model given its better performance, focusing now on characterization milestones. We examine the order in which CW parameters are constrained as PTA data are accumulated and the signal-to-noise ratio (S/N) grows. We also study how these parameter constraints vary across sources of different sky locations and GW frequencies. We find that the GW frequency and strain are generally constrained at the same time (or S/N), closely followed by the sky location, and later the chirp mass (if the source is highly evolving) and inclination angle. At fixed S/N, sources at higher frequencies generally achieve better precision on the GW frequency, chirp mass, and sky location. The time (and S/N) at which the signal becomes constrained is dependent on the sky location and frequency of the source, with the effects of pulsar terms and PTA geometry playing crucial roles in source detection and localization.",
      "pdf_url": "https://arxiv.org/pdf/2510.01316.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.06311",
      "title": "Modeling gravitational wave sources in the MillenniumTNG simulations",
      "authors": [
        "Federico Marinacci",
        "Marco Baldi",
        "Giuliano Iorio",
        "M. Celeste Artale",
        "Michela Mapelli",
        "Volker Springel",
        "Sownak Bose",
        "Lars Hernquist"
      ],
      "abstract": "Modeling gravitational wave sources in the MillenniumTNG simulations Federico Marinacci, Marco Baldi, Giuliano Iorio, M. Celeste Artale, Michela Mapelli, Volker Springel, Sownak Bose, Lars Hernquist 15 pages (+ 4 page Appendix), 10 figures (+ 9 figures in the Appendix). Submitted to A&A; comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) (Edited) We introduce a flexible framework for building gravitational wave (GW) event catalogs in hydrodynamic simulations of galaxy formation. Our framework couples the state-of-the-art binary population synthesis code SEVN with Arepo-GW -- a module fully integrated into the moving-mesh code Arepo -- to assign merger events of binary compact objects to stellar particles in simulations by stochastically sampling merger tables generated with SEVN. Arepo-GW supports both on-the-fly operation, producing event catalogs during simulations, and post-processing, using snapshots from existing runs. The algorithm is fully parallel and can be readily adapted to outputs from other simulation codes. To demonstrate the capabilities of our new framework, we applied Arepo-GW in post-processing to simulations from the MillenniumTNG suite, including its flagship box. We investigate key properties of the resulting GW event catalog, built on SEVN predictions, focusing on comoving merger rates, formation efficiencies, delay-time distributions, and progenitor mass and metallicity distributions. We also examine how these properties vary with simulated volume. We find that GW progenitor rates closely track simulated star formation histories and are generally consistent with current observational constraints at low redshift, aside from a factor of $\\sim 4.5$ excess in binary black hole mergers. Moreover, our binary black hole merger rates decline more slowly with redshift than current observational estimates for $z \\lesssim 1$. Finally, the analysis of progenitor mass functions across different formation channels reveals only mild redshift evolution, while the binary black hole mass function displays features compatible with current observational determinations. These findings highlight the potential of our novel framework to enable detailed predictions for upcoming GW surveys within a full cosmological context.",
      "pdf_url": "https://arxiv.org/pdf/2510.06311.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.06551",
      "title": "Primordial Black Holes and their Mass Spectra: The Effects of Mergers and Accretion within Stasis Cosmologies",
      "authors": [
        "Keith R. Dienes",
        "Lucien Heurtier",
        "Fei Huang",
        "Tim M.P. Tait",
        "Brooks Thomas"
      ],
      "abstract": "Primordial Black Holes and their Mass Spectra: The Effects of Mergers and Accretion within Stasis Cosmologies Keith R. Dienes, Lucien Heurtier, Fei Huang, Tim M.P. Tait, Brooks Thomas Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) A variety of processes in the very early universe can give rise to a population of primordial black holes (PBHs) with an extended mass spectrum. For certain mass spectra of this sort, it has been shown that the evaporation of these PBHs into radiation can drive the universe toward an epoch of cosmological stasis which can persist for a significant number of $e$-folds of cosmological expansion. However, in general, the initial mass spectrum which characterizes a population of PBHs at the time of production can subsequently be distorted by processes such as mergers and accretion. In this paper, we examine the effects that these processes have on the spectra that lead to a PBH-induced stasis. Within such stasis models, we find that mergers have only a negligible effect on these spectra within the regime of interest for stasis. We likewise find that the effect of accretion is negligible in many cases of interest. However, we find that the effect of accretion on the PBH mass spectrum is non-negligible in situations in which this spectrum is particularly broad. In such situations, the stasis epoch is abridged or, in extreme cases, does not occur at all. Thus accretion plays a non-trivial role in constraining the emergence of stasis within scenarios which lead to extended PBH mass spectra.",
      "pdf_url": "https://arxiv.org/pdf/2510.06551.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06731",
      "title": "Benchmarking AI-evolved cosmological structure formation",
      "authors": [
        "Xiaofeng Dong",
        "Nesar Ramachandra",
        "Salman Habib",
        "Katrin Heitmann"
      ],
      "abstract": "Benchmarking AI-evolved cosmological structure formation Xiaofeng Dong, Nesar Ramachandra, Salman Habib, Katrin Heitmann Expanded and thoroughly revised version of our prior NeurIPS submission (arXiv:2112.05681; which has no DOI), with new sections, experiments, and analyses Cosmology and Nongalactic Astrophysics (astro-ph.CO); Computational Physics (physics.comp-ph) The potential of deep learning-based image-to-image translations has recently attracted significant attention. One possible application of such a framework is as a fast, approximate alternative to cosmological simulations, which would be particularly useful in various contexts, including covariance studies, investigations of systematics, and cosmological parameter inference. To investigate different aspects of learning-based cosmological mappings, we choose two approaches for generating suitable cosmological matter fields as datasets: a simple analytical prescription provided by the Zel'dovich approximation, and a numerical N-body method using the Particle-Mesh approach. The evolution of structure formation is modeled using U-Net, a widely employed convolutional image translation framework. Because of the lack of a controlled methodology, validation of these learned mappings requires multiple benchmarks beyond simple visual comparisons and summary statistics. A comprehensive list of metrics is considered, including higher-order correlation functions, conservation laws, topological indicators, and statistical independence of density fields. We find that the U-Net approach performs well only for some of these physical metrics, and accuracy is worse at increasingly smaller scales, where the dynamic range in density is large. By introducing a custom density-weighted loss function during training, we demonstrate a significant improvement in the U-Net results at smaller scales. This study provides an example of how a family of physically motivated benchmarks can, in turn, be used to fine-tune optimization schemes -- such as the density-weighted loss used here -- to significantly enhance the accuracy of scientific machine learning approaches by focusing attention on relevant features.",
      "pdf_url": "https://arxiv.org/pdf/2510.06731.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07131",
      "title": "CURLING - II. Improvement on the $H_{0}$ Inference from Pixelized Cluster Strong Lens Modeling",
      "authors": [
        "Yushan Xie",
        "Huanyuan Shan",
        "Yiping Shu",
        "Nan Li",
        "Ji Yao",
        "Ran Li",
        "Xiaoyue Cao",
        "Zizhao He",
        "Yin Li",
        "Eric Jullo",
        "Jean-Paul Kneib",
        "Guoliang Li"
      ],
      "abstract": "CURLING - II. Improvement on the $H_{0}$ Inference from Pixelized Cluster Strong Lens Modeling Yushan Xie, Huanyuan Shan, Yiping Shu, Nan Li, Ji Yao, Ran Li, Xiaoyue Cao, Zizhao He, Yin Li, Eric Jullo, Jean-Paul Kneib, Guoliang Li Cosmology and Nongalactic Astrophysics (astro-ph.CO) Strongly lensed supernovae (glSNe) provide a powerful, independent method to measure the Hubble constant, $H_{0}$, through time delays between their multiple images. The accuracy of this measurement depends critically on both the precision of time delay estimation and the robustness of lens modeling. In many current cluster-scale modeling algorithms, all multiple images used for modeling are simplified as point sources to reduce computational costs. In the first paper of the CURLING program, we demonstrated that such a point-like approximation can introduce significant uncertainties and biases in both magnification reconstruction and cosmological inference. In this study, we explore how such simplifications affect $H_0$ measurements from glSNe. We simulate a lensed supernova at $z=1.95$, lensed by a galaxy cluster at $z=0.336$, assuming time delays are measured from LSST-like light curves. The lens model is constructed using JWST-like imaging data, utilizing both Lenstool and a pixelated method developed in CURLING. Under a fiducial cosmology with $H_0=70\\rm \\ km \\ s^{-1}\\ Mpc^{-1}$, the Lenstool model yields $H_0=69.91^{+6.27}_{-5.50}\\rm \\ km\\ s^{-1}\\ Mpc^{-1}$, whereas the pixelated framework improves the precision by over an order of magnitude, $H_0=70.39^{+0.82}_{-0.60}\\rm \\ km \\ s^{-1}\\ Mpc^{-1}$. Our results indicate that in the next-generation observations (e.g., JWST), uncertainties from lens modeling dominate the error budget for $H_0$ inference, emphasizing the importance of incorporating the extended surface brightness of multiple images to fully leverage the potential of glSNe for cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2510.07131.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07259",
      "title": "The cosmic web's Lyman-$α$ glow at $z \\approx 2.5$; varying hydrodynamic models, dust, and wide-field, narrow-band imaging detection",
      "authors": [
        "Oleksii Sokoliuk",
        "John K. Webb",
        "Kenneth M. Lanzetta",
        "Michael M. Shara",
        "Stefan Gromoll",
        "James S. Bolton",
        "Robert F. Carswell",
        "Gaspar Galaz",
        "Cédric Ledoux",
        "Gaspare Lo Curto",
        "Alain Smette",
        "David Valls-Gabaud",
        "Anja von der Linden",
        "Frederick M. Walter",
        "Joris Witstok"
      ],
      "abstract": "The cosmic web's Lyman-$α$ glow at $z \\approx 2.5$; varying hydrodynamic models, dust, and wide-field, narrow-band imaging detection Oleksii Sokoliuk, John K. Webb, Kenneth M. Lanzetta, Michael M. Shara, Stefan Gromoll, James S. Bolton, Robert F. Carswell, Gaspar Galaz, Cédric Ledoux, Gaspare Lo Curto, Alain Smette, David Valls-Gabaud, Anja von der Linden, Frederick M. Walter, Joris Witstok Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The diffuse glow of the cosmic web in Lyman-$\\alpha$ emission has long been predicted, yet remained elusive to direct wide field detection. We present theoretical calculations that, when compared with recent observations made using the Condor Array Telescope in New Mexico reported in Lanzetta et al. 2024, point to its discovery at $z \\approx 2.5$. Synthetic Lyman-$\\alpha$ surface brightness maps are constructed from five state-of-the-art hydrodynamic simulations (Illustris-TNG, SIMBA, EAGLE, CROCODILE, and Sherwood), incorporating dust attenuation, star formation, collisional excitation, and recombination physics. Our cosmic web Lyman-$\\alpha$ surface brightness predictions are consistent with the UV excess detected at high significance in the recent deep, wide field, narrow-band imaging Condor data. The calculations presented here thus demonstrate that diffuse Lyman-$\\alpha$ emission is observable with current (and next-generation) wide field low surface brightness facilities, opening the path to direct cartographic mapping of the cosmic web. These findings mark a turning point: for the first time, cosmology moves beyond inference from absorption and high-density peaks, into panoramic imaging of the faint intergalactic scaffolding that underpins structure formation in the Universe.",
      "pdf_url": "https://arxiv.org/pdf/2510.07259.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06325",
      "title": "Preferential Accretion onto the Secondary Black Hole Strengthens Gravitational Wave Signals",
      "authors": [
        "Julia M. Comerford",
        "Joseph Simon"
      ],
      "abstract": "Preferential Accretion onto the Secondary Black Hole Strengthens Gravitational Wave Signals Julia M. Comerford, Joseph Simon Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Pulsar timing arrays have recently found evidence for nanohertz gravitational waves that are consistent with being produced by a cosmological population of binary supermassive black holes (SMBHs). However, the amplitude of this gravitational wave background is larger than predicted from theoretical and empirical models of SMBH binary populations. We investigate preferential accretion onto the secondary, less massive SMBH of the binary as a potential solution to this discrepancy. We carry out the first observationally-based analysis of the effect of preferential accretion on the SMBH binary population, and we find that preferential accretion onto the secondary SMBH increases the binary SMBH mass ratio, causing many minor galaxy mergers to lead to major SMBH mergers. The fraction of SMBH mergers that are major mergers increases by a factor of 2-3 when preferential accretion is included. Further, we find that only a small amount of preferential accretion (10% total SMBH mass growth) is needed to bring the predicted gravitational wave background amplitude into agreement with observations. Preferential accretion has an even larger effect on gravitational wave signals detected by LISA, which will probe SMBH binaries at higher redshifts where the environment is more gas-rich, and can also help explain the rapid build up of overmassive black holes at high redshifts observed by the James Webb Space Telescope. It also shortens the time to the first detection of an individual SMBH binary emitting continuous waves. Preferential accretion strengthens the gravitational wave signals produced by any binary embedded in a circumbinary disk, including LIGO sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.06325.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.06352",
      "title": "Are all Binary Black Holes Detected from LIGO-Virgo-KAGRA Follow the Universal Time-Delay Distributions? Likely Not",
      "authors": [
        "Samsuzzaman Afroz",
        "Navdha",
        "Suvodip Mukherjee"
      ],
      "abstract": "Are all Binary Black Holes Detected from LIGO-Virgo-KAGRA Follow the Universal Time-Delay Distributions? Likely Not Samsuzzaman Afroz, Navdha, Suvodip Mukherjee High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The delay time distribution (DTD) of binary black hole (BBH) mergers encodes the evolutionary link between the formation history and gravitational-wave (GW) emission. We present a non-parametric reconstruction of the mass-dependent DTD using the BBHs from the GWTC-4 that avoids restrictive assumptions of only power-law forms. Our analysis reveals for the first time the signature for mass-dependent evolutionary pathways: lower-mass systems ($20$-$40\\,M_\\odot$) are consistent with a scale-invariant DTD, whereas higher-mass BBHs ($40$-$100\\,M_\\odot$) provide the first direct tentative evidence of DTD that deviate from simple power laws, with a pronounced preference for rapid mergers around $2-6$ Gyrs. These findings reveal the advantage of the non-parametric technique in reconstructing the mass-dependent DTD and discovering for the first-time the presence of a potential time-scale associated with high-mass GW events.",
      "pdf_url": "https://arxiv.org/pdf/2510.06352.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.06905",
      "title": "The radial acceleration relation at the EDGE of galaxy formation: testing its universality in low-mass dwarf galaxies",
      "authors": [
        "Mariana P. Júlio",
        "Justin I. Read",
        "Marcel S. Pawlowski",
        "Pengfei Li",
        "Daniel Vaz",
        "Jarle Brinchmann",
        "Martin P. Rey",
        "Oscar Agertz",
        "Tom Holmes"
      ],
      "abstract": "The radial acceleration relation at the EDGE of galaxy formation: testing its universality in low-mass dwarf galaxies Mariana P. Júlio, Justin I. Read, Marcel S. Pawlowski, Pengfei Li, Daniel Vaz, Jarle Brinchmann, Martin P. Rey, Oscar Agertz, Tom Holmes Accepted for publication in A&A on 03-10-2025. 16 pages, 12 figures, 3 tables Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) A tight correlation between the baryonic and observed acceleration of galaxies has been reported over a wide range of mass ($10^8 < M_{\\rm bar}/{\\rm M}_\\odot < 10^{11}$) - the Radial Acceleration Relation (RAR). This has been interpreted as evidence that dark matter is actually a manifestation of some modified weak-field gravity theory. In this paper, we study the radially resolved RAR of 12 nearby dwarf galaxies, with baryonic masses in the range $10^4 < M_{\\rm bar}/{\\rm M}_\\odot < 10^{7.5}$, using a combination of literature data and data from the MUSE-Faint survey. We use stellar line-of-sight velocities and the Jeans modelling code GravSphere to infer the mass distributions of these galaxies, allowing us to compute the RAR. We compare the results with the EDGE simulations of isolated dwarf galaxies with similar stellar masses in a $\\Lambda$CDM cosmology. We find that most of the observed dwarf galaxies lie systematically above the low-mass extrapolation of the RAR. Each galaxy traces a locus in the RAR space that can have a multi-valued observed acceleration for a given baryonic acceleration, while there is significant scatter from galaxy to galaxy. Our results indicate that the RAR does not apply to low-mass dwarf galaxies and that the inferred baryonic acceleration of these dwarfs does not contain enough information, on its own, to derive the observed acceleration. The simulated EDGE dwarfs behave similarly to the real data, lying systematically above the extrapolated RAR. We show that, in the context of modified weak-field gravity theories, these results cannot be explained by differential tidal forces from the Milky Way, nor by the galaxies being far from dynamical equilibrium, since none of the galaxies in our sample seems to experience strong tides. As such, our results provide further evidence for the need for invisible dark matter in the smallest dwarf galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.06905.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07198",
      "title": "Probing the cosmological 21~cm global signal from the Antarctic ice sheet",
      "authors": [
        "Shijie Sun",
        "Jiaqin Xu",
        "Minquan Zhou",
        "Shenzhe Xu",
        "Fengquan Wu",
        "Haoran Zhang",
        "Juyong Zhang",
        "Bin Ma",
        "Zhaohui Shang",
        "Xuelei Chen"
      ],
      "abstract": "Probing the cosmological 21~cm global signal from the Antarctic ice sheet Shijie Sun, Jiaqin Xu, Minquan Zhou, Shenzhe Xu, Fengquan Wu, Haoran Zhang, Juyong Zhang, Bin Ma, Zhaohui Shang, Xuelei Chen Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The redshifted 21 cm line, arising from neutral hydrogen, offers a unique probe into the intergalactic medium and the first stars and galaxies formed in the early universe. However, detecting this signal is a challenging task because of artificial radio-frequency interference (RFI) and systematic errors such as ground effects. The interior of the Antarctic continent provides an excellent location to make such observations, with minimal RFI and relatively stable foreground signals. Moreover, a flat plateau in central Antarctica, with an ice cap over 2000 m deep, will show less ground reflection of radio waves, reducing the signal complexity in the area around the probing antenna. It may be advantageous to perform cosmological 21 cm experiments in Antarctica, and a 21 cm Antarctic global spectrum experiment can potentially be deployed on the Antarctic ice cap. We have performed preliminary instrumental design, system calibration, and implementation of such an instrument optimized for extreme cold and capable of long-term autonomous operation. This system shows the ability to effectively detect the 21~cm signal, confirming Antarctica as an excellent observational site for radio cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2510.07198.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07220",
      "title": "High-energy variability of the gravitationally lensed blazar PKS 1830-211",
      "authors": [
        "Sarah M. Wagner",
        "Jeffrey D. Scargle",
        "Greg Madejski",
        "Andrea Gokus",
        "Krzysztof Nalewajko",
        "Patrick Günther",
        "Karl Mannheim"
      ],
      "abstract": "High-energy variability of the gravitationally lensed blazar PKS 1830-211 Sarah M. Wagner, Jeffrey D. Scargle, Greg Madejski, Andrea Gokus, Krzysztof Nalewajko, Patrick Günther, Karl Mannheim High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The production site and process responsible for the highly variable high-energy emission observed from blazar jets are still debated. Gravitational lenses can be used as microscopes to investigate the nature of such sources. We study the broad-band spectral properties and the high-energy variability of the gravitationally-lensed blazar PKS 1830-211, for which radio observations have revealed two images, to put constraints on the jet physics and the existence of a gravitationally-induced time delay and magnification ratio between the images. We utilize Swift/XRT, Nustar, and Fermi-LAT observations from 2016 and 2019 to compare periods of low activity and high activity in PKS 1830-211. Short-timescale variability is elucidated with an unbinned power spectrum analysis of time-tagged NuSTAR photon data. To study the gravitationally-induced time delay in the gamma-ray light curve observed with Fermi-LAT, we improve existing autocorrelation function based methods. Our modified auto-correlation method yields a delay of t_0=21.1 +/- 0.1 d and magnification factor a=0.13 +/- 0.01. These parameters remain time-invariant. In data from 2016 and 2019, the X-ray spectra remain remarkably stable, contrasting with extreme changes in gamma-rays. Both states can be fitted with a single component from Comptonisation of infrared emission from the dusty torus, with different gamma-ray states arising solely from a shift in the break of the electron energy distribution. The detection of a consistent lag throughout the whole light curve suggests that they originate from a persistent location in the jet.",
      "pdf_url": "https://arxiv.org/pdf/2510.07220.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07306",
      "title": "Probing evolution of Long GRB properties through their cosmic formation history aided by Machine Learning predicted redshifts",
      "authors": [
        "Dhruv S. Bal",
        "Aditya Narendra",
        "Maria Giovanna Dainotti",
        "Nikita S. Khatiya",
        "Aleksander L. Lenart",
        "Dieter H. Hartmann"
      ],
      "abstract": "Probing evolution of Long GRB properties through their cosmic formation history aided by Machine Learning predicted redshifts Dhruv S. Bal, Aditya Narendra, Maria Giovanna Dainotti, Nikita S. Khatiya, Aleksander L. Lenart, Dieter H. Hartmann 17 pages, 8 figures (Figure 4: interactive plot), 1 table, submitted to the Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Gamma-ray Bursts (GRBs) are valuable probes of cosmic star formation reaching back into the epoch of reionization, and a large dataset with known redshifts ($z$) is an important ingredient for these studies. Usually, $z$ is measured using spectroscopy or photometry, but $\\sim80\\%$ of GRBs lack such data. Prompt and afterglow correlations can provide estimates in these cases, though they suffer from systematic uncertainties due to assumed cosmologies and due to detector threshold limits. We use a sample with $z$ estimated via machine learning models, based on prompt and afterglow parameters, without relying on cosmological assumptions. We then use an augmented sample of GRBs with measured and predicted redshifts, forming a larger dataset. We find that the predicted redshifts are a crucial step forward in understanding the evolution of GRB properties. We test three cases: no evolution, an evolution of the beaming factor, and an evolution of all terms captured by an evolution factor $(1+z)^\\delta$. We find that these cases can explain the density rate in the redshift range between 1-2, but neither of the cases can explain the derived rate densities at smaller and higher redshifts, which may point towards an evolution term different than a simple power law. Another possibility is that this mismatch is due to the non-homogeneity of the sample, e.g., a non-collapsar origin of some long GRB within the sample.",
      "pdf_url": "https://arxiv.org/pdf/2510.07306.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2207.04924",
      "title": "On Inflation and Reheating Features in the Higgs-$R^2$ Model",
      "authors": [
        "Norma Sidik Risdianto"
      ],
      "abstract": "On Inflation and Reheating Features in the Higgs-$R^2$ Model Norma Sidik Risdianto Nucl. Phys. B 1020 (2025) 117149 Nucl. Phys. B 1020 (2025) 117149 Nucl. Phys. B 1020 (2025) 117149 Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We investigated inflation in the Higgs-$R^2$ model and assumed the trajectory to follow a single-field approximation called minimal two-field mode. Using this approximation, we tried to constrain the Higgs' non-minimal coupling $\\xi$. During inflation, we investigated the effect of $\\xi$ on the non-gaussianity. We found that $\\xi$ could not provide the large non-gaussianity. In this paper, we divided the preheating stage to be quadratic regime and quartic regime. During the quadratic regime, the gauge bosons' production is the most dominant. However, it could not drain the whole inflaton's energy. Thus, we introduced a dark matter candidate with a large coupling that could drain the whole inflaton's energy. We also found that if $\\xi<4.2$, the oscillation on the quadratic regime continued to the quartic regime. The reheating temperature obtained by this mode can be reached to be $\\sim 10^{10}$ GeV and strongly depends on the remaining inflaton's energy density. On contrary, if $\\xi>4.2$, the oscillation only happens at the quadratic regime. As we assumed the Pauli exclusion principle does exist during the quadratic regime, the instant decay of gauge bosons to fermions is restricted. Hence we expected, the reheating temperature to be low for about $\\sim 10^9$ GeV.",
      "pdf_url": "https://arxiv.org/pdf/2207.04924.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.09071",
      "title": "Foreground Removal in Ground-Based CMB Observations Using a Transformer Model",
      "authors": [
        "Ye-Peng Yan",
        "Si-Yu Li",
        "Yang Liu",
        "Jun-Qing Xia",
        "Hong Li"
      ],
      "abstract": "Foreground Removal in Ground-Based CMB Observations Using a Transformer Model Ye-Peng Yan, Si-Yu Li, Yang Liu, Jun-Qing Xia, Hong Li 19 pages, 15 figures, 1 table, accepted by ApJS Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a novel method for Cosmic Microwave Background (CMB) foreground removal based on deep learning techniques. This method employs a Transformer model, referred to as \\texttt{TCMB}, which is specifically designed to effectively process HEALPix-format spherical sky maps. \\texttt{TCMB} represents an innovative application in CMB data analysis, as it is an image-based technique that has rarely been utilized in this field. Using simulated data with noise levels representative of current ground-based CMB polarization observations, the \\texttt{TCMB} method demonstrates robust performance in removing foreground contamination. The mean absolute variance for the reconstruction of the noisy CMB Q/U map is significantly less than the CMB polarization signal. To mitigate biases caused by instrumental noise, a cross-correlation approach using two half-mission maps was employed, successfully recovering CMB EE and BB power spectra that align closely with the true values, and these results validate the effectiveness of the \\texttt{TCMB} method. Compared to the previously employed convolutional neural network (CNN)-based approach, the \\texttt{TCMB} method offers two significant advantages: (1) It demonstrates superior effectiveness in reconstructing CMB polarization maps, outperforming CNN-based methods. (2) It can directly process HEALPix spherical sky maps without requiring rectangular region division, a step necessary for CNN-based approaches that often introduces uncertainties such as boundary effects. This study highlights the potential of Transformer-based models as a powerful tool for CMB data analysis, offering a substantial improvement over traditional CNN-based techniques.",
      "pdf_url": "https://arxiv.org/pdf/2502.09071.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.17568",
      "title": "Cosmology with One Galaxy: Auto-Encoding the Galaxy Properties Manifold",
      "authors": [
        "Amanda Lue",
        "Shy Genel",
        "Marc Huertas-Company",
        "Francisco Villaescusa-Navarro",
        "Matthew Ho"
      ],
      "abstract": "Cosmology with One Galaxy: Auto-Encoding the Galaxy Properties Manifold Amanda Lue, Shy Genel, Marc Huertas-Company, Francisco Villaescusa-Navarro, Matthew Ho 10 pages, 6 figures. Published in ApJ The Astrophysical Journal, 986(2), 133 (June 2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Cosmological simulations like CAMELS and IllustrisTNG characterize hundreds of thousands of galaxies using various internal properties. Previous studies have demonstrated that machine learning can be used to infer the cosmological parameter $\\Omega_m$ from the internal properties of even a single randomly selected simulated galaxy. This ability was hypothesized to originate from galaxies occupying a low-dimensional manifold within a higher-dimensional galaxy property space, which shifts with variations in $\\Omega_m$. In this work, we investigate how galaxies occupy the high-dimensional galaxy property space, particularly the effect of $\\Omega_m$ and other cosmological and astrophysical parameters on the putative manifold. We achieve this by using an autoencoder with an Information-Ordered Bottleneck (IOB), a neural layer with adaptive compression, to perform dimensionality reduction on individual galaxy properties from CAMELS simulations, which are run with various combinations of cosmological and astrophysical parameters. We find that for an autoencoder trained on the fiducial set of parameters, the reconstruction error increases significantly when the test set deviates from fiducial values of $\\Omega_m$ and $A_{\\text{SN1}}$, indicating that these parameters shift galaxies off the fiducial manifold. In contrast, variations in other parameters such as $\\sigma_8$ cause negligible error changes, suggesting galaxies shift along the manifold. These findings provide direct evidence that the ability to infer $\\Omega_m$ from individual galaxies is tied to the way $\\Omega_m$ shifts the manifold. Physically, this implies that parameters like $\\sigma_8$ produce galaxy property changes resembling natural scatter, while parameters like $\\Omega_m$ and $A_{\\text{SN1}}$ create unsampled properties, extending beyond the natural scatter in the fiducial model.",
      "pdf_url": "https://arxiv.org/pdf/2502.17568.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.17747",
      "title": "Dark sirens and the impact of redshift precision",
      "authors": [
        "Madeline L. Cross-Parkin",
        "Cullan Howlett",
        "Tamara M. Davis",
        "Nandita Khetan"
      ],
      "abstract": "Dark sirens and the impact of redshift precision Madeline L. Cross-Parkin, Cullan Howlett, Tamara M. Davis, Nandita Khetan Cosmology and Nongalactic Astrophysics (astro-ph.CO) With the growing number of gravitational wave detections, achieving a competitive measurement of $H_0$ with dark sirens is becoming increasingly feasible. The expansion of the Ligo-Virgo-KAGRA Collaboration into a four detector network will reduce both the localisation area and the luminosity distance uncertainty associated with each gravitational wave event. It is therefore essential to identify and mitigate other major sources of error that could increase the uncertainty in $H_0$. In this work, we explore three scenarios relevant to the dark siren method in future observing runs. First, we demonstrate that there is a precision gain offered by a catalogue of spectroscopic-like redshifts compared to photometric-like redshifts, with the greatest improvements observed in smaller localisation areas. Second, we show that redshift outliers (as occur in realistic photometric redshift catalogues), do not introduce bias into the measurement of $H_0$. Finally, we find that uniformly sub-sampling spectroscopic-like redshift catalogues increases the uncertainty in $H_0$ as the completeness fraction is decreased; at a completeness of 50% the benefit of spectroscopic redshift precision is outweighed by the degradation from incompleteness. In all three scenarios, we obtain unbiased estimates of $H_0$. We conclude that a competitive measurement of $H_0$ using the dark siren method will require a hybrid catalogue of both photometric and spectroscopic redshifts, at least until highly complete spectroscopic catalogues become available. This, however, will come at the cost of a more complex selection function.",
      "pdf_url": "https://arxiv.org/pdf/2502.17747.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.02233",
      "title": "Prospects for disentangling dark matter with weak lensing",
      "authors": [
        "Calvin Preston",
        "Keir K. Rogers",
        "Alexandra Amon",
        "George Efstathiou"
      ],
      "abstract": "Prospects for disentangling dark matter with weak lensing Calvin Preston, Keir K. Rogers, Alexandra Amon, George Efstathiou Mon Not R Astron Soc (2025) 2698-2713 Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the degeneracy between the effects of ultra-light axion dark matter and baryonic feedback in suppressing the matter power spectrum. We forecast that galaxy shear data from the Rubin Observatory's Legacy Survey of Space and Time (LSST) could limit an axion of mass $m = 10^{-25}\\,\\mathrm{eV}$ to be $\\lesssim 5\\%$ of the dark matter, stronger than any current bound, if the interplay between axions and feedback is accurately modelled. Using a halo model emulator to construct power spectra for mixed cold and axion dark matter cosmologies, including baryonic effects, we find that galaxy shear is sensitive to axions from $10^{-27}\\,\\mathrm{eV}$ to $10^{-21}\\,\\mathrm{eV}$, with the capacity to set competitive bounds across much of this range. For axions with $m \\sim 10^{-25}\\,\\mathrm{eV}$, the scales at which axions and feedback impact structure formation are similar, introducing a parameter degeneracy. We find that, with an external feedback constraint, we can break the degeneracy and constrain the axion transfer function, such that LSST could detect a $10^{-25}\\,\\mathrm{eV}$ axion comprising 10\\% of the dark matter at $\\sim 3 \\sigma$ significance. Direct reconstruction of the non-linear matter power spectrum provides an alternative way of analysing weak lensing surveys, with the advantage of identifying the scale-dependent features in the data that the dark matter model imposes. We advocate for dedicated cosmological hydrodynamical simulations with an axion dark matter component so that upcoming galaxy and cosmic microwave background lensing surveys can disentangle the dark matter-baryon transfer function.",
      "pdf_url": "https://arxiv.org/pdf/2505.02233.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.19925",
      "title": "Direct reconstruction of the Reionization history from 21cm 2D Power Spectra",
      "authors": [
        "Yannic Pietschke",
        "Caroline Heneka",
        "Tom Schlenker",
        "Ayodele Ore",
        "Benedikt Schosser"
      ],
      "abstract": "Direct reconstruction of the Reionization history from 21cm 2D Power Spectra Yannic Pietschke, Caroline Heneka, Tom Schlenker, Ayodele Ore, Benedikt Schosser 21 pages, 10 figures, published in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); Data Analysis, Statistics and Probability (physics.data-an) The 21cm line from the spin-flip transition of neutral hydrogen (HI) provides a unique window into the Epoch of Reionization (EoR), the final phase transition of our Universe. The Square Kilometre Array (SKA) enables precise measurements of 21cm fluctuations that trace ionization, temperature, and density fluctuations of the intergalactic medium (IGM). Nevertheless, a direct reconstruction of the timeline of the EoR in terms of the progress of ionization remains an ongoing challenge due to the highly non-Gaussian nature and thus intractable likelihood of the 21cm signal. Here, we present EoRFlow, a simulation-based inference (SBI) framework for reconstructing the global neutral hydrogen fraction $x_{\\mathrm{HI}}(z)$ directly from 2D cylindrically averaged power spectra (2DPS) of the 21cm signal. We validate our method on realistic mock datasets for SKA-Low. Bypassing the need for explicit likelihood formulations, our approach enables fast, unbiased posterior estimation of the $x_{\\mathrm{HI}}$ evolution in narrow redshift slices, allowing for piecewise reconstruction of the global reionization history. By directly inferring the reionization history from 21cm power spectra, our framework provides a scalable and robust path forward for 21cm cosmology in the SKA era.",
      "pdf_url": "https://arxiv.org/pdf/2506.19925.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.22217",
      "title": "Requirements on bandpass resolution and measurement precision for LiteBIRD",
      "authors": [
        "S. Giardiello",
        "A. Carones",
        "T. Ghigna",
        "L. Pagano",
        "F. Piacentini",
        "L. Montier",
        "R. Takaku",
        "E. Calabrese",
        "D. Adak",
        "E. Allys",
        "A. Anand",
        "J. Aumont",
        "M. Ballardini",
        "A. J. Banday",
        "R. B. Barreiro",
        "N. Bartolo",
        "S. Basak",
        "M. Bersanelli",
        "A. Besnard",
        "M. Bortolami",
        "T. Brinckmann",
        "F. J. Casas",
        "K. Cheung",
        "M. Citran",
        "L. Clermont",
        "F. Columbro",
        "A. Coppolecchia",
        "F. Cuttaia",
        "P. de Bernardis",
        "E. de la Hoz",
        "M. De Lucia",
        "S. Della Torre",
        "E. Di Giorgi",
        "P. Diego-Palazuelos",
        "U. Fuskeland",
        "G. Galloni",
        "M. Galloway",
        "M. Gerbino",
        "M. Gervasi",
        "R. T. Génova-Santos",
        "C. Gimeno-Amo",
        "A. Gruppuso",
        "M. Hazumi",
        "S. Henrot-Versillé",
        "L. T. Hergt",
        "B. Jost",
        "K. Kohri",
        "L. Lamagna",
        "C. Leloup",
        "F. Levrier",
        "A. I. Lonappan",
        "M. López-Caniego",
        "G. Luzzi",
        "J. Macias-Perez",
        "V. Maranchery",
        "E. Martínez-González",
        "S. Masi",
        "S. Matarrese",
        "T. Matsumura",
        "S. Micheli",
        "M. Migliaccio",
        "M. Monelli",
        "G. Morgante",
        "L. Mousset",
        "R. Nagata",
        "A. Novelli",
        "F. Noviello",
        "I. Obata",
        "A. Occhiuzzi",
        "A. Paiella",
        "D. Paoletti",
        "G. Pascual-Cisneros",
        "G. Patanchon",
        "M. Pinchera",
        "G. Polenta",
        "L. Porcelli",
        "G. Puglisi",
        "N. Raffuzzi",
        "M. Remazeilles",
        "A. Rizzieri",
        "M. Ruiz-Granda",
        "J. Sanghavi",
        "V. Sauvage",
        "G. Savini",
        "M. Shiraishi",
        "G. Signorelli",
        "R. M. Sullivan",
        "Y. Takase",
        "L. Terenzi",
        "M. Tomasi",
        "M. Tristram",
        "L. Vacher",
        "B. van Tent",
        "P. Vielva",
        "I. K. Wehus",
        "G. Weymann-Despres",
        "E. J. Wollack",
        "Y. Zhou"
      ],
      "abstract": "Requirements on bandpass resolution and measurement precision for LiteBIRD S. Giardiello, A. Carones, T. Ghigna, L. Pagano, F. Piacentini, L. Montier, R. Takaku, E. Calabrese, D. Adak, E. Allys, A. Anand, J. Aumont, M. Ballardini, A. J. Banday, R. B. Barreiro, N. Bartolo, S. Basak, M. Bersanelli, A. Besnard, M. Bortolami, T. Brinckmann, F. J. Casas, K. Cheung, M. Citran, L. Clermont, F. Columbro, A. Coppolecchia, F. Cuttaia, P. de Bernardis, E. de la Hoz, M. De Lucia, S. Della Torre, E. Di Giorgi, P. Diego-Palazuelos, U. Fuskeland, G. Galloni, M. Galloway, M. Gerbino, M. Gervasi, R. T. Génova-Santos, C. Gimeno-Amo, A. Gruppuso, M. Hazumi, S. Henrot-Versillé, L. T. Hergt, B. Jost, K. Kohri, L. Lamagna, C. Leloup, F. Levrier, A. I. Lonappan, M. López-Caniego, G. Luzzi, J. Macias-Perez, V. Maranchery, E. Martínez-González, S. Masi, S. Matarrese, T. Matsumura, S. Micheli, M. Migliaccio, M. Monelli, G. Morgante, L. Mousset, R. Nagata, A. Novelli, F. Noviello, I. Obata, A. Occhiuzzi, A. Paiella, D. Paoletti, G. Pascual-Cisneros, G. Patanchon, M. Pinchera, G. Polenta, L. Porcelli, G. Puglisi, N. Raffuzzi, M. Remazeilles, A. Rizzieri, M. Ruiz-Granda, J. Sanghavi, V. Sauvage, G. Savini, M. Shiraishi, G. Signorelli, R. M. Sullivan, Y. Takase, L. Terenzi, M. Tomasi, M. Tristram, L. Vacher, B. van Tent, P. Vielva, I. K. Wehus, G. Weymann-Despres, E. J. Wollack, Y. Zhou (for the LiteBIRD Collaboration) S. Giardiello et al JCAP10(2025)038 Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) In this work, we study the impact of an imperfect knowledge of the instrument bandpasses on the estimate of the tensor-to-scalar ratio $r$ in the context of the next-generation LiteBIRD satellite. We develop a pipeline to integrate over the bandpass transmission in both the time-ordered data (TOD) and the map-making processing steps. We introduce the systematic effect by having a mismatch between the ``real'', high resolution bandpass $\\tau$, entering the TOD, and the estimated one $\\tau_s$, used in the map-making. We focus on two aspects: the effect of degrading the $\\tau_s$ resolution, and the addition of a Gaussian error $\\sigma$ to $\\tau_s$. To reduce the computational load of the analysis, the two effects are explored separately, for three representative LiteBIRD channels (40 GHz, 140 GHz and 402 GHz) and for three bandpass shapes. Computing the amount of bias on $r$, $\\Delta r$, caused by these effects on a single channel, we find that a resolution $\\lesssim 1.5$ GHz and $\\sigma \\lesssim 0.0089$ do not exceed the LiteBIRD budget allocation per systematic effect, $\\Delta r < 6.5 \\times 10^{-6}$. We then check that propagating separately the uncertainties due to a resolution of 1 GHz and a measurement error with $\\sigma = 0.0089$ in all LiteBIRD frequency channels, for the most pessimistic bandpass shape of the three considered, still produces a $\\Delta r < 6.5 \\times 10^{-6}$. This is done both with the simple deprojection approach and with a blind component separation technique, the Needlet Internal Linear Combination (NILC). Due to the effectiveness of NILC in cleaning the systematic residuals, we have tested that the requirement on $\\sigma$ can be relaxed to $\\sigma \\lesssim 0.05$. (Abridged)",
      "pdf_url": "https://arxiv.org/pdf/2506.22217.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.21681",
      "title": "Hyper Suprime-Cam Y3 results: photo-$z$ bias calibration with lensing shear ratios and cosmological constraints from cosmic shear",
      "authors": [
        "Divya Rana",
        "Surhud More",
        "Hironao Miyatake",
        "Sunao Sugiyama",
        "Tianqing Zhang",
        "Masato Shirasaki"
      ],
      "abstract": "Hyper Suprime-Cam Y3 results: photo-$z$ bias calibration with lensing shear ratios and cosmological constraints from cosmic shear Divya Rana, Surhud More, Hironao Miyatake, Sunao Sugiyama, Tianqing Zhang, Masato Shirasaki Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present an independent calibration of the photometric redshift (photo-$z$) distributions for source galaxies in the HSC-Y3 weak lensing survey using small-scale galaxy-galaxy lensing. By measuring the tangential shear around spectroscopic lens galaxies from GAMA, SDSS, and DESI, divided into fifteen narrow redshift bins, we compute shear ratios that are sensitive to the mean redshift of source galaxies. Using a blinded analysis, we derive constraints on the photo-$z$ bias parameters in source bins 2, 3 and 4, achieving signal-to-noise ratios of 59, 75, and 62, respectively. Our constraints for $\\Delta z_2$, $\\Delta z_3$ and $\\Delta z_4$ are consistent with those from HSC-Y3 cosmic shear modeling. We observe a mild shift in the $\\Delta z_3$-$\\Delta z_4$ plane due to the heterogeneous depth of the lens sample, which disappears when using only DESI-DR1 lenses. Combining shear-ratio measurements with cosmic shear data, we obtain joint constraints on cosmological parameters: $\\Omega_{\\rm m} = 0.304_{-0.029}^{+0.03}$ and $S_8 = 0.773_{-0.031}^{+0.031}$, consistent with cosmic shear-only results. This work demonstrates the utility of small-scale lensing as an independent probe for calibrating photometric redshift bias in weak lensing cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2508.21681.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08365",
      "title": "Matter power spectrum reconstruction with KiDS-Legacy: Improved internal $Λ$CDM consistency and preference for strong baryonic feedback",
      "authors": [
        "Jeger C. Broxterman",
        "Patrick Simon",
        "Lucas Porth",
        "Konrad Kuijken",
        "Angus H. Wright",
        "Marika Asgari",
        "Maciej Bilicki",
        "Catherine Heymans",
        "Hendrik Hildebrandt",
        "Henk Hoekstra",
        "Benjamin Joachimi",
        "Shun-Sheng Li",
        "Matteo Maturi",
        "Lauro Moscardini",
        "Mario Radovich",
        "Robert Reischke",
        "Maximilian Von Wietersheim-Kramsta"
      ],
      "abstract": "Matter power spectrum reconstruction with KiDS-Legacy: Improved internal $Λ$CDM consistency and preference for strong baryonic feedback Jeger C. Broxterman, Patrick Simon, Lucas Porth, Konrad Kuijken, Angus H. Wright, Marika Asgari, Maciej Bilicki, Catherine Heymans, Hendrik Hildebrandt, Henk Hoekstra, Benjamin Joachimi, Shun-Sheng Li, Matteo Maturi, Lauro Moscardini, Mario Radovich, Robert Reischke, Maximilian Von Wietersheim-Kramsta 8 pages, 5 figures (including the appendices). Accepted for publication in A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) Direct measurements of the matter power spectrum, $P_\\mathrm{m}(k,z)$, provide a powerful tool to investigate observed tensions between models of structure growth while also testing the internal consistency of cosmological probes. We analyse cosmic shear data from the final data release of the Kilo-Degree Survey (KiDS), presenting a deprojected $P_\\mathrm{m}(k,z)$, measured in up to three redshift bins. Compared to analyses using previous KiDS releases, we find improved internal consistency in the $z\\lesssim0.7$ regime. At large scales, $k\\lesssim0.1\\,h\\,\\rm Mpc^{-1}$, our power spectrum reconstruction aligns with $\\Lambda$CDM predictions with a density fluctuation amplitude $\\sigma_8=0.81$. Furthermore, at small scales, $k=3$-$20\\,h\\,\\rm Mpc^{-1}$, the average matter power spectrum is suppressed by $30\\%\\pm10\\%\\,{\\rm (stat.)}\\pm4\\%\\,{\\rm (sys.)}$ with $2.8\\sigma$ significance relative to a dark-matter-only model, consistent with expectations of strong baryonic feedback.",
      "pdf_url": "https://arxiv.org/pdf/2509.08365.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.17540",
      "title": "A Semi-analytic Framework of Population III and Subsequent Galaxy Formation on Cosmological N-body Simulations",
      "authors": [
        "Tomoaki Ishiyama",
        "Shingo Hirano"
      ],
      "abstract": "A Semi-analytic Framework of Population III and Subsequent Galaxy Formation on Cosmological N-body Simulations Tomoaki Ishiyama, Shingo Hirano 20 pages, 11 figures, accepted by ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We develop a new semi-analytic framework of Population (Pop) III and subsequent galaxy formation designed to run on dark matter halo merger trees. In our framework, we consider the effect of the Lyman-Werner flux from Pop III and II stars and the dark matter baryon streaming velocity on the critical halo mass for the Pop III formation. Our model incorporates the Lyman-Werner feedback in a self-consistent way, therefore, the spatial variation of Lyman-Werner feedback naturally emerges. The Pop III mass depends on the properties of a halo as reproducing radiative hydrodynamical simulation results. We perform statistical studies of Pop III stars by applying this framework to high-resolution cosmological N-body simulations with a maximum box size of 16 Mpc/h and enough mass resolution to resolve Pop III-forming halos. A top-heavy initial mass function emerges and two peaks corresponding to the H$_2$ ($20 \\lesssim z \\lesssim 25$) and atomic cooling halos ($z \\lesssim 15$) exist in the distribution. Supermassive stars can be formed in the atomic cooling halos, and the fractions of such supermassive stars increase with the value of streaming velocity. At least an 8 Mpc/h simulation box and the self-consistent model for the Lyman-Werner feedback are necessary to correctly model the Pop III formation in the atomic cooling halos. Our model predicts one supermassive star per halo with several $10^9$ Msun at z=7.5, which is enough to reproduce a high redshift quasar.",
      "pdf_url": "https://arxiv.org/pdf/2501.17540.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.03888",
      "title": "Synthesizer: a Software Package for Synthetic Astronomical Observables",
      "authors": [
        "Christopher C. Lovell",
        "William J. Roper",
        "Aswin P. Vijayan",
        "Stephen M. Wilkins",
        "Sophie Newman",
        "Louise Seeyave"
      ],
      "abstract": "Synthesizer: a Software Package for Synthetic Astronomical Observables Christopher C. Lovell, William J. Roper, Aswin P. Vijayan, Stephen M. Wilkins, Sophie Newman, Louise Seeyave Published in the Open Journal of Astrophysics. 27 pages, 17 figures. Please see arXiv:2506.15811 for the accompanying JOSS paper. Documentation available at this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present Synthesizer, a fast, flexible, modular and extensible platform for modelling synthetic astrophysical observables. Synthesizer can be used for a number of applications, but is predominantly designed for generating mock observables from analytical and numerical galaxy formation simulations. These use cases include (but are not limited to) analytical modelling of the star formation and metal enrichment histories of galaxies, the creation of mock images and integral field unit observations from particle based simulations, detailed photoionisation modelling of the central regions of active galactic nuclei, and spectro-photometric fitting. We provide a number of stellar population synthesis models, photoionisation code configurations, dust models, and imaging configurations that can be used 'out-of-the-box' interactively. The code can be used to quantitatively test the dependence of forward modelled observables on various model and parameter choices, and rapidly explore large parameter ranges for calibration and inference tasks. We invite and encourage the community to use, test and develop the code, and hope that the foundation developed will provide a flexible framework for a number of tasks in forward and inverse modelling of astrophysical observables. The code is publicly available at this https URL",
      "pdf_url": "https://arxiv.org/pdf/2508.03888.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.02245",
      "title": "Spectral characterization and performance of SPT-SLIM on-chip filterbank spectrometers",
      "authors": [
        "C. S. Benson",
        "K. Fichman",
        "M. Adamic",
        "A. J. Anderson",
        "P. S. Barry",
        "B. A. Benson",
        "E. Brooks",
        "J. E. Carlstrom",
        "T. Cecil",
        "C. L. Chang",
        "K. R. Dibert",
        "M. Dobbs",
        "K. S. Karkare",
        "G. K. Keating",
        "A. M. Lapuente",
        "M. Lisovenko",
        "D. P. Marrone",
        "J. Montgomery",
        "T. Natoli",
        "Z. Pan",
        "A. Rahlin",
        "G. Robson",
        "M. Rouble",
        "G. Smecher",
        "V. Yefremenko",
        "M. R. Young",
        "C. Yu",
        "J. A. Zebrowski",
        "C. Zhang"
      ],
      "abstract": "Spectral characterization and performance of SPT-SLIM on-chip filterbank spectrometers C. S. Benson, K. Fichman, M. Adamic, A. J. Anderson, P. S. Barry, B. A. Benson, E. Brooks, J. E. Carlstrom, T. Cecil, C. L. Chang, K. R. Dibert, M. Dobbs, K. S. Karkare, G. K. Keating, A. M. Lapuente, M. Lisovenko, D. P. Marrone, J. Montgomery, T. Natoli, Z. Pan, A. Rahlin, G. Robson, M. Rouble, G. Smecher, V. Yefremenko, M. R. Young, C. Yu, J. A. Zebrowski, C. Zhang Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The South Pole Telescope Shirokoff Line Intensity Mapper (SPT-SLIM) experiment is a pathfinder for demonstrating the use of on-chip spectrometers for millimeter Line Intensity Mapping. We present spectral bandpass measurements of the SLIM spectrometer channels made on site using a Fourier Transform Spectrometer during SPT-SLIMs first deployment the 2024-2025 austral summer observing season. Through this we demonstrate a technique for measuring the narrow band passes of the SPT-SLIM filterbanks that improves beyond the intrinsic resolution of a Fourier Transform Spectrometer.",
      "pdf_url": "https://arxiv.org/pdf/2509.02245.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06312",
      "title": "New ultralight scalar particles and the mass-radius relation of white dwarfs -- the important role of Sirius B",
      "authors": [
        "Kai Bartnick",
        "Detlev Koester",
        "Rolf-Peter Kudritzki",
        "Konstantin Springmann",
        "Stefan Stelzl",
        "Andreas Weiler"
      ],
      "abstract": "New ultralight scalar particles and the mass-radius relation of white dwarfs -- the important role of Sirius B Kai Bartnick, Detlev Koester, Rolf-Peter Kudritzki, Konstantin Springmann, Stefan Stelzl, Andreas Weiler submitted to MNRAS, 12 pages, 10 figures High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) We present the equation of state for two classes of new ultralight particles, a scalar field coupling to electrons and a light $\\mathbb{Z}_\\mathcal{N}$ QCD axion field coupling to nucleons. Both are potential candidates for dark matter. Using the scalar modified equations of state, we calculate models for white dwarf stars and compare their radii and masses with observed mass-radius data. The comparison results in stringent constraints on the masses of the particles and the coupling parameters. For a wide range of particle masses and coupling parameters, constraints from the white dwarf equation of state surpass existing limits, outperforming also dedicated laboratory searches. The remarkable accuracy of modern white-dwarf mass-radius relation data, exemplified by Sirius B, now allows stringent tests of dense-matter physics and constraints on new particle scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2510.06312.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06431",
      "title": "The first proper motion measurement of the acceleration regions in the large-scale jets of SS 433 powering the W50 nebula",
      "authors": [
        "Naomi Tsuji",
        "Yoshiyuki Inoue",
        "Dmitry Khangulyan",
        "Kaya Mori",
        "Samar Safi-Harb",
        "Takaaki Tanaka",
        "Laura Olivera-Nieto",
        "Brydyn Mac Intyre",
        "Kazuho Kayama",
        "Takeshi Go Tsuru",
        "Hiroyuki Uchida",
        "Tatsuki Fujiwara",
        "Felix Aharonian"
      ],
      "abstract": "The first proper motion measurement of the acceleration regions in the large-scale jets of SS 433 powering the W50 nebula Naomi Tsuji, Yoshiyuki Inoue, Dmitry Khangulyan, Kaya Mori, Samar Safi-Harb, Takaaki Tanaka, Laura Olivera-Nieto, Brydyn Mac Intyre, Kazuho Kayama, Takeshi Go Tsuru, Hiroyuki Uchida, Tatsuki Fujiwara, Felix Aharonian 14 pages, 5 figures, 3 tables. Accepted for publication in ApJ Letters High Energy Astrophysical Phenomena (astro-ph.HE) We report on new Chandra ACIS-I observations of the X-ray knots located in the western and eastern lobes of W50 associated with the parsec-scale jets of the Galactic microquasar SS 433. These knots are likely counterparts of the recently detected very-high-energy ($E>100$ GeV) gamma-ray emission by HAWC and H.E.S.S. These findings, together with the ultra-high-energy signal recently reported by the LHAASO collaboration, have established the SS 433/W50 system as a unique jet-driven PeVatron candidate. Combining new and archival Chandra data, we perform the first proper motion search of the X-ray knot structures over a time interval spanning approximately 20 years. We found no statistically significant motion of these knots at the 3$\\sigma$ confidence level, and place an upper limit of $<$ 0.019-0.033$c$ (5,800-9,800 km s$^{-1}$) for the speed of the innermost knots at an assumed distance $d=5.5$ kpc. Combined with the velocities reported in the literature, the upstream speed in the shock rest frame would reach several 10$^4$ km s$^{-1}$, suggesting that highly efficient particle acceleration, approaching the Bohm limit, is occurring. The absence of significant motion of the knots suggests the presence of a standing recollimation shock, formed by the balance between the jet pressure and the external pressure. This interpretation is consistent with the expected occurrence of such shocks at 20-30 pc from SS 433, matching the location of the observed knots.",
      "pdf_url": "https://arxiv.org/pdf/2510.06431.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06614",
      "title": "Dual perspectives on GX 17+2: a simultaneous NICER and NuSTAR study",
      "authors": [
        "Malu Sudha",
        "Renee M. Ludlam",
        "Jeroen Homan",
        "Dacheng Lin",
        "Benjamin Coughenour",
        "Edward M. Cackett"
      ],
      "abstract": "Dual perspectives on GX 17+2: a simultaneous NICER and NuSTAR study Malu Sudha, Renee M. Ludlam, Jeroen Homan, Dacheng Lin, Benjamin Coughenour, Edward M. Cackett Accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We performed the first simultaneous NICER & NuSTAR spectral and timing study of the Sco-like Z source GX 17+2. The source traced the full Z track during four observations. We detect signatures of relativistic reflection in the broadband spectra and report results using a reflection framework. The disk is relatively close to the innermost stable circular orbit ($\\sim$ 1-4 R$_{ISCO}$), which agrees with previous studies of GX 17+2, but the location of the inner disk is farther out in the horizontal branch (HB) and moves inward toward the flaring branch (FB). We find the FB to be the point of closest approach of the disk to the neutron star. We qualitatively conclude that the evolution of the source along the HID is that of a relatively truncated disk in the HB ($\\sim$ 4 R$_{ISCO}$) that approaches the neutron star as it goes along the HID towards the normal branch (NB), soft apex (SA), and finally the FB. We attribute the source evolution along the Z track to varying mass accretion rate and disk instabilities. Rms variability increases from the NB towards the SA and then drops to a constant along the FB indicating that the observed variability likely originates from the disk/boundary layer rather than the corona.",
      "pdf_url": "https://arxiv.org/pdf/2510.06614.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06741",
      "title": "Diagnosing the Properties and Evolutionary Fates of Black Hole and Wolf-Rayet X-ray Binaries as Potential Gravitational Wave Sources for the LIGO-Virgo-KAGRA Network",
      "authors": [
        "Zi-Yuan Wang",
        "Ying Qin",
        "Georges Meynet",
        "Qing-Zhong Liu",
        "Xin-Wen Shu",
        "Ya-Wen Xue",
        "Liang Yuan",
        "Jun-Qian Li",
        "Kun Jia",
        "Han-Feng Song"
      ],
      "abstract": "Diagnosing the Properties and Evolutionary Fates of Black Hole and Wolf-Rayet X-ray Binaries as Potential Gravitational Wave Sources for the LIGO-Virgo-KAGRA Network Zi-Yuan Wang, Ying Qin, Georges Meynet, Qing-Zhong Liu, Xin-Wen Shu, Ya-Wen Xue, Liang Yuan, Jun-Qian Li, Kun Jia, Han-Feng Song 16 pages, 19 figures, submitted on January 18 2025 High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) IC 10 X-1, NGC 300 X-1, and Cyg X-3 represent a unique class of X-ray binaries consisting of a stellar-mass black hole (BH) accreting material from a Wolf-Rayet (WR) star companion. These systems are particularly intriguing due to their short orbital periods (less than 1.5 d), making them promising progenitors of gravitational wave (GW) sources detectable by the LIGO-Virgo-KAGRA (LVK) network. With a newly implemented prescription for accretion efficiency in the standard Bondi-Hoyle-Lyttleton (BHL) framework and a corrected treatment of dynamical tides, we present for the \\textit{first} time detailed binary evolution models to diagnose their properties at different evolutionary states and evaluate their fates as potential GW sources detectable by the LVK network. With additional constraints on the observed properties of IC 10 X-1 and NGC 300 X-1, we determine that the upper limit of the BH mass in these systems (IC 10 X-1: $M_{\\rm BH} \\lesssim 25\\, M_\\odot$, NGC 300 X-1: $M_{\\rm BH} \\lesssim 15\\, M_\\odot$) is much lower than previously estimated. Both systems are expected to form binary black holes (BBHs) that will merge within a Hubble time, unless the BH in NGC 300 X-1 has a mass of $9\\,M_\\odot$, the lower limit estimated in a previous study based on the continuum-fitting method employing a relativistic slim-disc model. For Cyg X-3, we find that the upper limit on the BH spin magnitude cannot exceed 0.6. Interestingly, the WR star in Cyg X-3 is likely to form a lower-mass gap BH, and the resulting binary BH system will merge within the Hubble time.",
      "pdf_url": "https://arxiv.org/pdf/2510.06741.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.06744",
      "title": "Identifying the secondary jet in the RadioAstron image of OJ~287",
      "authors": [
        "Mauri J. Valtonen",
        "Lankeswar Dey",
        "Staszek Zola",
        "Alok C. Gupta",
        "Shubham Kishore",
        "Achamveedu Gopakumar",
        "Paul J. Wiita",
        "Minfeng Gu",
        "Kari Nilsson",
        "Zhongli Zhang",
        "Rene Hudec",
        "Katsura Matsumoto",
        "Marek Drozdz",
        "Waldemar Ogloza",
        "Andrei V. Berdyugin",
        "Daniel E. Reichart",
        "Markus Mugrauer",
        "Tapio Pursimo",
        "Stefano Ciprini",
        "Tatsuya Nakaoka",
        "Makoto Uemura",
        "Ryo Imazawa",
        "Michal Zejmo",
        "Vladimir V. Kouprianov",
        "James W. Davidson Jr.",
        "Alberto Sadun",
        "Jan Strobl",
        "Martin Jelinek",
        "Abhimanyu Susobhanan"
      ],
      "abstract": "Identifying the secondary jet in the RadioAstron image of OJ~287 Mauri J. Valtonen, Lankeswar Dey, Staszek Zola, Alok C. Gupta, Shubham Kishore, Achamveedu Gopakumar, Paul J. Wiita, Minfeng Gu, Kari Nilsson, Zhongli Zhang, Rene Hudec, Katsura Matsumoto, Marek Drozdz, Waldemar Ogloza, Andrei V. Berdyugin, Daniel E. Reichart, Markus Mugrauer, Tapio Pursimo, Stefano Ciprini, Tatsuya Nakaoka, Makoto Uemura, Ryo Imazawa, Michal Zejmo, Vladimir V. Kouprianov, James W. Davidson Jr., Alberto Sadun, Jan Strobl, Martin Jelinek, Abhimanyu Susobhanan The Astrophysical Journal, October 9, 2025 High Energy Astrophysical Phenomena (astro-ph.HE) The 136 year long optical light curve of OJ~287 is explained by a binary black hole model where the secondary is in a 12 year orbit around the primary. Impacts of the secondary on the accretion disk of the primary generate a series of optical flares which follow a quasi-Keplerian relativistic mathematical model. The orientation of the binary in space is determined from the behavior of the primary jet. Here we ask how the jet of the secondary black hole projects onto the sky plane. Assuming that the jet is initially perpendicular to the disk, and that it is ballistic, we follow its evolution after the Lorentz transformation to the observer's frame. Since the orbital speed of the secondary is of the order of one-tenth of the speed of light, the result is a change in the jet direction by more than a radian during an orbital cycle. We match the theoretical jet line with the recent 12 $\\mu$as-resolution RadioAstron map of OJ~287, and determine the only free parameter of the problem, the apparent speed of the jet relative to speed of light. It turns out that the Doppler factor of the jet, $\\delta\\sim5$, is much lower than in the primary jet. Besides following a unique shape of the jet path, the secondary jet is also distinguished by a different spectral shape than in the primary jet. The present result on the spectral shape agrees with the huge optical flare of 2021 November 12, also arising from the secondary jet.",
      "pdf_url": "https://arxiv.org/pdf/2510.06744.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06786",
      "title": "A Giant Peanut-shaped Ultra-High-Energy Gamma-Ray Emitter Off the Galactic Plane",
      "authors": [
        "Zhen Cao",
        "Felix Aharonian",
        "Yunxiang Bai",
        "Yiwei Bao",
        "Denis Bastieri",
        "Xiaojun Bi",
        "YuJiang Bi",
        "Mr Bian WenYi",
        "A. Butkevich",
        "Chengmiao Cai",
        "Wenyu Cao",
        "Zhe Cao",
        "Jin Chang",
        "Jinfan Chang",
        "Mr Aming Chen",
        "Ensheng Chen",
        "Mr Guo-Hai Chen",
        "Mr Huaxi Chen",
        "Liang Chen",
        "Long Chen",
        "Mingjun Chen",
        "Mali Chen",
        "Qihui Chen",
        "Shi Chen",
        "Suhong Chen",
        "Songzhan Chen",
        "Tianlu Chen",
        "Xiaobin Chen",
        "Xuejian Chen",
        "Yang Chen",
        "Ning Cheng",
        "Yaodong Cheng",
        "Ming Chung Chu",
        "Mingyang Cui",
        "Shuwang Cui",
        "Xiaohong Cui",
        "Yidong Cui",
        "Benzhong Dai",
        "Hongliang Dai",
        "Z. G. Dai",
        "Danzengluobu .",
        "Yangxuan Diao",
        "Xuqiang Dong",
        "Kaikai Duan",
        "Junhui Fan",
        "Yi-Zhong Fan",
        "Jun Fang",
        "Jianhua Fang",
        "Kun Fang",
        "Cunfeng Feng",
        "Hua Feng",
        "Li Feng",
        "Shaohui Feng",
        "Xiaoting Feng",
        "Yi Feng",
        "Youliang Feng",
        "Stefano Gabici",
        "Bo Gao",
        "Chuandong Gao",
        "Qi Gao",
        "Wei Gao",
        "Weikang Gao",
        "Maomao Ge",
        "Ting-Ting Ge",
        "Lisi Geng",
        "Gwenael Giacinti",
        "Guanghua Gong",
        "Quanbu Gou",
        "Minhao Gu",
        "Fulai Guo",
        "Jing Guo",
        "Xiaolei Guo",
        "Yiqing Guo",
        "Yingying Guo",
        "Yiang Han",
        "Otto A. Hannuksela",
        "Mariam Hasan",
        "Huihai He",
        "Hao-Ning He",
        "Jiayin He",
        "Xinyu He",
        "Yu He",
        "Sergio Hernández-Cadena",
        "Bowen Hou",
        "Chao Hou",
        "Xian Hou",
        "Hongbo Hu",
        "Shicong Hu",
        "Chen Huang",
        "Daihui Huang",
        "Jiajun Huang",
        "Tian-Qi Huang",
        "Wenjun Huang",
        "Xingtao Huang",
        "Xiaoyuan Huang",
        "Yong Huang",
        "Yi-Yun Huang",
        "Xiaolu Ji",
        "Huanyu Jia",
        "Kang Jia"
      ],
      "abstract": "A Giant Peanut-shaped Ultra-High-Energy Gamma-Ray Emitter Off the Galactic Plane Zhen Cao, Felix Aharonian, Yunxiang Bai, Yiwei Bao, Denis Bastieri, Xiaojun Bi, YuJiang Bi, Mr Bian WenYi, A. Butkevich, Chengmiao Cai, Wenyu Cao, Zhe Cao, Jin Chang, Jinfan Chang, Mr Aming Chen, Ensheng Chen, Mr Guo-Hai Chen, Mr Huaxi Chen, Liang Chen, Long Chen, Mingjun Chen, Mali Chen, Qihui Chen, Shi Chen, Suhong Chen, Songzhan Chen, Tianlu Chen, Xiaobin Chen, Xuejian Chen, Yang Chen, Ning Cheng, Yaodong Cheng, Ming Chung Chu, Mingyang Cui, Shuwang Cui, Xiaohong Cui, Yidong Cui, Benzhong Dai, Hongliang Dai, Z. G. Dai, Danzengluobu ., Yangxuan Diao, Xuqiang Dong, Kaikai Duan, Junhui Fan, Yi-Zhong Fan, Jun Fang, Jianhua Fang, Kun Fang, Cunfeng Feng, Hua Feng, Li Feng, Shaohui Feng, Xiaoting Feng, Yi Feng, Youliang Feng, Stefano Gabici, Bo Gao, Chuandong Gao, Qi Gao, Wei Gao, Weikang Gao, Maomao Ge, Ting-Ting Ge, Lisi Geng, Gwenael Giacinti, Guanghua Gong, Quanbu Gou, Minhao Gu, Fulai Guo, Jing Guo, Xiaolei Guo, Yiqing Guo, Yingying Guo, Yiang Han, Otto A. Hannuksela, Mariam Hasan, Huihai He, Hao-Ning He, Jiayin He, Xinyu He, Yu He, Sergio Hernández-Cadena, Bowen Hou, Chao Hou, Xian Hou, Hongbo Hu, Shicong Hu, Chen Huang, Daihui Huang, Jiajun Huang, Tian-Qi Huang, Wenjun Huang, Xingtao Huang, Xiaoyuan Huang, Yong Huang, Yi-Yun Huang, Xiaolu Ji, Huanyu Jia, Kang Jia High Energy Astrophysical Phenomena (astro-ph.HE) Ultra-high-energy (UHE), exceeding 100 TeV (10^12 electronvolts), {\\gamma}-rays manifests extreme particle acceleration in astrophysical sources. Recent observations by {\\gamma}-ray telescopes, particularly by the Large High Altitude Air Shower Observatory (LHAASO), have revealed a few tens of UHE sources, indicating numerous Galactic sources capable of accelerating particles to PeV (10^15 electronvolts) energies. However, discerning the dominant acceleration mechanisms (leptonic versus hadronic), the relative contributions of specific source classes, and the role of particle transport in shaping their observed emission are central goals of modern UHE astrophysics. Here we report the discovery of a giant UHE {\\gamma}-ray emitter at -17.5° off the Galactic plane - a region where UHE {\\gamma}-ray sources are rarely found. The emitter exhibits a distinctive asymmetric shape, resembling a giant \"Peanut\" spanning 0.45° \\times 4.6°, indicative of anisotropic particle distribution over a large area. A highly aged millisecond pulsar (MSP) J0218+4232 is the sole candidate accelerator positionally coincident with the Peanut region. Its association with UHE {\\gamma}-rays extending to 0.7 PeV, if confirmed, would provide the first evidence of a millisecond pulsar powering PeV particles. Such a finding challenges prevailing models, which posit that millisecond pulsars cannot sustain acceleration to PeV energies. The detection reveals fundamental gaps in understanding particle acceleration, cosmic-ray transport, and interstellar magnetic field effects, potentially revealing new PeV accelerator (PeVatron) classes.",
      "pdf_url": "https://arxiv.org/pdf/2510.06786.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06810",
      "title": "Hard X-ray view of two $γ$-ray detected low-luminosity active galactic nuclei: NGC 315 and NGC 4261",
      "authors": [
        "Yuwei Yu",
        "Jin Zhang"
      ],
      "abstract": "Hard X-ray view of two $γ$-ray detected low-luminosity active galactic nuclei: NGC 315 and NGC 4261 Yuwei Yu, Jin Zhang High Energy Astrophysical Phenomena (astro-ph.HE) Aims. The accretion disk of low-luminosity active galactic nuclei (LLAGNs) is a radiatively inefficient accretion flow (RIAF). Our goal is to find evidence of RIAF radiation from LLAGNs with jets and analyze their radiation properties, which also adds samples to future research on LLAGNs. Methods. Weconducted an analysis of the X-ray data obtained from NuSTAR and XMM-Newton observations of NGC 315 and NGC 4261, encompassing both timing and spectral investigations. The joint X-ray spectra of the two LLAGNs were fitted using various functional forms and radiative models in XSPEC. Results. No significant variability on timescales of days is observed for both NGC 315 and NGC 4261. The X-ray continuum emission of NGC 315 is suitable for cutoff power-law (PL) fitting, yielding a cutoff energy of Ecut = 18.45 keV, which is the lowest value found in LLAGNssofar. In contrast, the X-ray continuum of NGC 4261 is composed of two PL components, with no signs of a cutoff energy. A prominent neutral Fe K{\\alpha} line is observed in NGC 315, while an ionized Fe XXV line is seen in NGC 4261. The derived reflection fractions are R = 0.61 for NGC 315 and R = 0.18 for NGC 4579. Neither NGC 315 nor NGC 4261 shows evidence of a Compton reflection bump. Conclusions. The X-ray spectral characteristics support the RIAF emission as the dominant origin of the X-rays in both sources, although an additional soft PL component originating from the inner jet is observed in NGC 4261. The higher reflection fraction compared to other LLAGNs, along with the detection of a neutral Fe K{\\alpha} line, suggests the existence of a truncated accretion disk with a relatively small radius in NGC 315. Bremsstrahlung radiation appears to be the dominant cooling mechanism for the plasma in NGC315, while Comptonization within the RIAF is more likely responsible for the X-ray emission in NGC 4261.",
      "pdf_url": "https://arxiv.org/pdf/2510.06810.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06920",
      "title": "Recasting the nature of INTEGRAL hard X-ray transients previously classified as active galactic nuclei",
      "authors": [
        "V. Sguera",
        "L. Sidoli"
      ],
      "abstract": "Recasting the nature of INTEGRAL hard X-ray transients previously classified as active galactic nuclei V. Sguera, L. Sidoli Accepted for publication in A&A. 15 pages High Energy Astrophysical Phenomena (astro-ph.HE) We present new broad-band X-ray results aimed at the identification and characterization of four poorly studied hard X-ray transients discovered by INTEGRAL: IGR J16426+6536, IGR J09446-2636, IGR J21268+6203, and IGR J02447+7046. The key properties and X-ray behavior of these sources have remained largely unknown until now. We investigated the temporal, spectral, and energetic characteristics of their hard X-ray outbursts detected above 20 keV by INTEGRAL. In addition, we performed a systematic analysis of unpublished archival soft X-ray observations below 10 keV, enabling a full exploration of their large INTEGRAL error circles in search of the most likely soft X-ray counterparts. Within their arcsecond-sized X-ray error circles, we identified single optical/near-infrared counterparts for each source. We analyzed their photometric properties to constrain the nature of the systems. Our results show that the X-ray properties of these four transients are inconsistent with the previously proposed extragalactic AGN origin, and instead support a Galactic nature for all of them. Specifically, we propose a very faint X-ray transient classification for IGR J16426+6536, a nearby flaring star for IGR J09446-2636 and IGR J21268+6203, finally a gamma-ray binary nature for IGR J02447+7046.",
      "pdf_url": "https://arxiv.org/pdf/2510.06920.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06962",
      "title": "1FLAT: a Firmamento-based catalog of AGN in Fermi-LAT high Galactic latitude γ-ray sources",
      "authors": [
        "P. Giommi",
        "M. Doro",
        "M. Gouvêa",
        "L. Fronte",
        "F. Metruccio",
        "F. Arneodo",
        "U. Barres de Almeida",
        "S. Di Pippo",
        "T. Kerscher",
        "A. Macció",
        "B. Mazzon",
        "M. Morrone",
        "E. Prandini",
        "A. Rodríguez",
        "A. Ruina",
        "N. Sahakyan",
        "L. Silveri",
        "D. Tripathi"
      ],
      "abstract": "1FLAT: a Firmamento-based catalog of AGN in Fermi-LAT high Galactic latitude γ-ray sources P. Giommi, M. Doro, M. Gouvêa, L. Fronte, F. Metruccio, F. Arneodo, U. Barres de Almeida, S. Di Pippo, T. Kerscher, A. Macció, B. Mazzon, M. Morrone, E. Prandini, A. Rodríguez, A. Ruina, N. Sahakyan, L. Silveri, D. Tripathi Accepted for publication in ApJS High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a systematic reassessment of 5,062 high-Galactic latitude gamma-ray sources from the Fermi-LAT 4FGL-DR4 catalog using Firmamento, a web-based platform for multi-frequency source discovery and analysis. Our goal is to provide an independent evaluation of LAT gamma-ray source associations through alternative spectral and spatial methods that combine recent and legacy survey data, supplemented by human supervision of spectral energy distributions (SEDs), source morphology, flux variability, and template-based comparisons. Firmamento confirms the 4FGL-DR4 and 4LAC-DR3 counterparts or unassociated sources in 4,493 cases (88.8%), demonstrating the robustness of both approaches. Beyond this general agreement, we identify 421 new blazar counterparts among previously unassociated sources, thereby reducing the fraction of unidentified extragalactic Fermi-LAT sources from 25% to 17%. In addition, in 64 cases we find alternative blazar associations, while in 49 instances we do not confirm the 4FGL-DR4 association. For all confirmed blazar counterparts we provide homogeneous estimates of synchrotron peak frequency and peak flux using machine-learning and template-based methods; these agree with 4LAC-DR3 values in most cases, though significant discrepancies appear for a few dozen sources, often due to improved X-ray coverage. The primary outcome of this work is the 1st Firmamento LAT AGN table (1FLAT), made publicly available through the Firmamento platform (this https URL), where all related multi-wavelength data and images are available. The project involved extensive manual validation and benefited from the active participation of graduate and undergraduate students, highlighting the platform's value for both research and education.",
      "pdf_url": "https://arxiv.org/pdf/2510.06962.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07002",
      "title": "Revealing the Temporally Stable Bimodal Energy Distribution of FRB 20121102A with a Tripled Burst Set from AI Detections",
      "authors": [
        "Yidan Wang",
        "Jing Han",
        "Pei Wang",
        "Di Li",
        "Hanting Chen",
        "Yuchuan Tian",
        "Erbil Gugercinoglu",
        "Jianing Tang",
        "Zihan Zhang",
        "Kaichao Wu",
        "Xiaoli Zhang",
        "Yuhao Zhu",
        "Jinhuang Cao",
        "Mingtai Chen",
        "Jiapei Feng",
        "Zhaoyu Huai",
        "Zitao Lin",
        "Jieming Luan",
        "Hongbin Wang",
        "Junjie Zhao",
        "Chaowei Tsai",
        "Weiwei Zhu",
        "Yongkun Zhang",
        "Yi Feng",
        "Aiyuan Yang",
        "Dengke Zhou",
        "Jianhua Fang",
        "Jiaying Xu",
        "Chenhui Niu",
        "Jiarui Niu",
        "Jumei Yao",
        "Chunfeng Zhang",
        "Rushuang Zhao",
        "Lei Zhang",
        "Junshuo Zhang",
        "Wanjin Lu",
        "Qingyue Qu"
      ],
      "abstract": "Revealing the Temporally Stable Bimodal Energy Distribution of FRB 20121102A with a Tripled Burst Set from AI Detections Yidan Wang, Jing Han, Pei Wang, Di Li, Hanting Chen, Yuchuan Tian, Erbil Gugercinoglu, Jianing Tang, Zihan Zhang, Kaichao Wu, Xiaoli Zhang, Yuhao Zhu, Jinhuang Cao, Mingtai Chen, Jiapei Feng, Zhaoyu Huai, Zitao Lin, Jieming Luan, Hongbin Wang, Junjie Zhao, Chaowei Tsai, Weiwei Zhu, Yongkun Zhang, Yi Feng, Aiyuan Yang, Dengke Zhou, Jianhua Fang, Jiaying Xu, Chenhui Niu, Jiarui Niu, Jumei Yao, Chunfeng Zhang, Rushuang Zhao, Lei Zhang, Junshuo Zhang, Wanjin Lu, Qingyue Qu High Energy Astrophysical Phenomena (astro-ph.HE) Active repeating Fast Radio Bursts (FRBs), with their large number of bursts, burst energy distribution, and their potential energy evolution, offer critical insights into the FRBs emission mechanisms. Traditional pipelines search for bursts through conducting dedispersion trials and looking for signals above certain fluence thresholds, both of which could result in missing weak and narrow-band bursts. In order to improve the completeness of the burst set, we develop an End-to-end DedispersE-agnostic Nonparametric AI model (EDEN), which directly detect bursts from dynamic spectrum and is the first detection pipeline that operates without attempting dedispersion. We apply EDEN to archival FAST L-band observations during the extreme active phase of the repeating source FRB 20121102A, resulting in the largest burst set for any FRB to date, which contains 5,927 individual bursts, tripling the original burst set. The much enhanced completeness enables a refined analysis of the temporal behavior of energy distribution, revealing that the bimodal energy distribution remains stable over time. It is rather an intrinsic feature of the emission mechanisms than a consequence of co-evolving with burst rate.",
      "pdf_url": "https://arxiv.org/pdf/2510.07002.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07026",
      "title": "Prolonged fallback and late-time rebrightening episodes in stellar tidal disruptions as imprints of a galactic environment",
      "authors": [
        "Cedric Oña",
        "Sean Fortuna",
        "Ian Vega"
      ],
      "abstract": "Prolonged fallback and late-time rebrightening episodes in stellar tidal disruptions as imprints of a galactic environment Cedric Oña, Sean Fortuna, Ian Vega High Energy Astrophysical Phenomena (astro-ph.HE) We extend the classical Keplerian framework of existing analytic TDE models by incorporating the gravitational potential of a spherically symmetric galactic mass distribution. We then demonstrate that this broader structure imprints light curve features beyond the predictive scope of traditional models, such as phases of shallower-than-standard decay and late-time rebrightening episodes. Importantly, our framework predicts the occurrence of environment-induced rebrightenings but only on very long timescales, unless the host environment is unrealistically ultra-compact. This means the early evolution of TDEs occurring in typical galaxies is essentially untouched by the host potential, which explains why Keplerian models have been so successful in describing the first few years after disruption. To illustrate, we applied our model to the TDE candidate eRASSt J133157.9-324321 (J1331), the event with the longest reported rebrightening interval, and find that even matching its ${\\sim}$30-year rebrightening would demand an implausibly dense host. This demonstrates the limits of environmental effects as an explanation for early rebrightenings reported in the literature. More broadly, our work shows that while the host galaxy leaves TDEs nearly Keplerian at early times, it actively shapes their long-term evolution and can drive departures from the canonical $t^{-5/3}$ decay law. These delayed signals give us a testable way to see how the host galaxy shapes the event, and they may even offer clues about the galaxy's underlying structure.",
      "pdf_url": "https://arxiv.org/pdf/2510.07026.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07174",
      "title": "Archival Inference for Eccentric Stellar-Mass Binary Black Holes in Space-Based Gravitational Wave Observations",
      "authors": [
        "Han Wang",
        "Michael J. Williams",
        "Ian Harry",
        "Yi-Ming Hu"
      ],
      "abstract": "Archival Inference for Eccentric Stellar-Mass Binary Black Holes in Space-Based Gravitational Wave Observations Han Wang, Michael J. Williams, Ian Harry, Yi-Ming Hu 12 pages, 4 figures, comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) Space-based gravitational-wave observatories will detect the early inspiral of stellar-mass binary black holes and can track their eccentricity evolution. However, untargeted searches in the space band are computationally demanding and require relatively high detection thresholds (signal-to-noise ratio $\\sim 15$). Information from ground-based detections can significantly shrink the parameter space for space-band analyses and thereby substantially reduce the detection threshold. We present a Bayesian inference pipeline for ground-triggered archival space-band analyses that includes eccentricity. Using ground-informed priors, we demonstrate that with one year of LISA or TianQin data a GW190521-like source with signal-to-noise ratio $\\sim 7$ can be distinguished and tightly constrained. In this setup, space observations sharpened the redshifted chirp mass from $\\mathcal{O}(10^{-3})M_\\odot$ to $\\mathcal{O}(10^{-5})M_\\odot$, and constrain the eccentricity to $\\mathcal{O}(10^{-5})$ around the injected value $e_{0.01\\mathrm{Hz}}=0.1$. These results demonstrate that inference of eccentric stellar-mass binary black holes in noisy space-band data is practically feasible, supports an expanded yield of multiband detections, and strengthens prospects for future astrophysical and gravitational tests.",
      "pdf_url": "https://arxiv.org/pdf/2510.07174.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.07234",
      "title": "Testing new-physics scenarios with the combined LHAASO and Carpet-3 fluence spectrum of GRB 221009A: axion-like particles and Lorentz-invariance violation",
      "authors": [
        "P.S. Satunin",
        "S.V. Troitsky"
      ],
      "abstract": "Testing new-physics scenarios with the combined LHAASO and Carpet-3 fluence spectrum of GRB 221009A: axion-like particles and Lorentz-invariance violation P.S. Satunin, S.V. Troitsky 6 pages, 3 figures, JETP Letters style High Energy Astrophysical Phenomena (astro-ph.HE) From gamma-ray burst (GRB) 221009A, very high-energy photons were detected: >10 TeV with LHAASO and >100 TeV with Carpet-3. Such energetic photons are expected to be absorbed via electron-positron pair production on their way to the Earth. Their observation might be explained by new physics, including Lorentz invariance violation (LIV) or photon mixing with axion-like particles (ALPs). Here, we construct a joint fluence spectrum by combining flux measurements from both experiments, and fit it under these hypotheses. LIV can account for the Carpet-3 observation, providing a modest improvement over standard physics in the overall fit. ALP mixing improves the description of both LHAASO and Carpet-3 data, yielding a substantial enhancement in fit quality for a specific region of the ALP parameter space.",
      "pdf_url": "https://arxiv.org/pdf/2510.07234.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07311",
      "title": "Diffuse continuum emission and large extended sources at MeV energies",
      "authors": [
        "Markus Ackermann",
        "Denys Malyshev",
        "Dmitry V. Malyshev"
      ],
      "abstract": "Diffuse continuum emission and large extended sources at MeV energies Markus Ackermann, Denys Malyshev, Dmitry V. Malyshev 27 pages, 5 figures, part of the \"Unveiling the MeV Universe in the Multi-Messenger Era\" collection in Space Science Reviews High Energy Astrophysical Phenomena (astro-ph.HE) Future gamma-ray survey instruments, such as newASTROGAM and AMEGO-X, will significantly improve previous and current all-sky surveys at MeV energies. In this paper we discuss the continuum emission from the Milky Way, two prominent large extended sources, the Fermi bubbles and Loop I, and the extragalactic gamma-ray background. We highlight the importance of measurements in the MeV to GeV energy range for understanding CR production and propagation in the Galaxy, for the determination of the nature of the Fermi bubbles and Loop I, and for exploring the origin of the extragalactic gamma-ray background.",
      "pdf_url": "https://arxiv.org/pdf/2510.07311.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06331",
      "title": "Phase-resolved optical spectroscopy of the rapidly varying white dwarf ZTF 1851+1714",
      "authors": [
        "C. C. Pedersen",
        "M. R. M. Knudsen",
        "K. Valeckas",
        "L. Izzo",
        "T. M. Tauris",
        "J. P. U. Fynbo"
      ],
      "abstract": "Phase-resolved optical spectroscopy of the rapidly varying white dwarf ZTF 1851+1714 C. C. Pedersen, M. R. M. Knudsen, K. Valeckas, L. Izzo, T. M. Tauris, J. P. U. Fynbo 7 pages, 8 figures, Accepted for publication in Astronomy & Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) We report on phase-resolved optical spectroscopy and photometry in the R and B bands of the white dwarf candidate ZTF 185139.81+171430.3. The source has been reported to be variable with a large amplitude of close to 1 magnitude, in the R band, and a short period of 12.37 min. We confirm this period and interpret it as the spin period of the white dwarf. The optical spectrum shows emission lines from hydrogen and helium superposed on a featureless continuum. The continuum changes shape throughout a cycle, such that it is redder when the source is bright. There is tentative evidence for Doppler shifts in the emission lines during the spin cycle with an amplitude of a few tens of km s$^{-1}$. Notably, the H$\\alpha$ and H$\\beta$ lines exhibit different radial velocity amplitudes, suggesting that they come from different emission regions. We also identify a candidate orbital period of 1.00 hr, based on potential orbital sidebands. These features - Doppler shifts modulated at the spin frequency, brightness variations, and continuum shape changes - are consistent with the accretion curtain model, in which material is funneled from a truncated inner disc along magnetic field lines onto the magnetic poles of the white dwarf.",
      "pdf_url": "https://arxiv.org/pdf/2510.06331.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06939",
      "title": "Is the high-energy environment of K2-18b special?",
      "authors": [
        "S. Rukdee",
        "M. Güdel",
        "I. Vilović",
        "K. Poppenhäger",
        "S. Boro Saikia",
        "J. Buchner",
        "B. Stelzer",
        "G. Roccetti",
        "J. V. Seidel",
        "V. Burwitz"
      ],
      "abstract": "Is the high-energy environment of K2-18b special? S. Rukdee, M. Güdel, I. Vilović, K. Poppenhäger, S. Boro Saikia, J. Buchner, B. Stelzer, G. Roccetti, J. V. Seidel, V. Burwitz 11 pages, 9 figures, submitted to A&A Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) K2-18b lies near the radius valley that separates super-Earths and sub-Neptunes, marking a key transitional regime in planetary and atmospheric composition. The system offers a valuable opportunity to study how M-dwarf high-energy stellar radiation influences atmospheric stability and the potential for sustaining volatile species, especially important in the context of the upcoming ELT and its ANDES spectrograph. This study characterizes the high-energy environment of K2-18 with X-ray observations from eROSITA, the soft X-ray instrument on the Spectrum-Roentgen-Gamma (SRG) mission, Chandra, and XMM-Newton. We derive a representative 0.2-2 keV X-ray flux with an APEC thermal plasma model fitted with the Bayesian X-ray Analysis (BXA). With the observed X-ray flux from the exoplanet host star, we estimate the photo-evaporation mass loss of exoplanet K2-18b using the energy-limited model. In addition, we examine the thermal structure of the system based on a hydrodynamic model. In 100 ks XMM-Newton observations we identified K2-18 as a very faint X-ray source with $\\mathrm{F_X = 10^{-15}\\ erg\\,s^{-1}\\,cm^{-2}}$, with an activity level of (Lx/Lbol) $\\sim 10^{-5}$. A small flare has been detected during the observation. The planet is irradiated by an X-ray flux of $\\mathrm{F_{pl,X} = 12\\pm3\\ erg\\,s^{-1}\\,cm^{-2}}$. The X-ray flux measurement of K2-18 gives important limitations for atmospheric escape and photochemical modeling of its exoplanets. Despite its near orbit around an M-dwarf star, K2-18b's low activity level environment suggests that it can retain an atmosphere, supporting recent tentative detections of atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2510.06939.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.05506",
      "title": "Type Ibn supernovae from ultra-stripped supernova progenitors",
      "authors": [
        "Takashi J. Moriya",
        "Bernhard Mueller",
        "Sergei I. Blinnikov",
        "Marina Ushakova",
        "Elena I. Sorokina",
        "Thomas M. Tauris",
        "Alexander Heger"
      ],
      "abstract": "Type Ibn supernovae from ultra-stripped supernova progenitors Takashi J. Moriya, Bernhard Mueller, Sergei I. Blinnikov, Marina Ushakova, Elena I. Sorokina, Thomas M. Tauris, Alexander Heger 8 pages, 7 figures, accepted by Publications of the Astronomical Society of Japan High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Ultra-stripped supernovae are core-collapse supernovae from progenitors that lose a significant fraction of mass because of the binary interactions with their compact companion stars. Ultra-stripped supernovae have been connected to fast-evolving faint Type Ib or Ic supernovae. Here, we show that in some cases ultra-stripped supernovae can result in Type Ibn supernovae. Progenitors of ultra-stripped supernovae may trigger violent silicon burning shortly before the core collapse, leading to mass ejection that results in a dense circumstellar matter. By taking an ultra-stripped supernova progenitor that loses 0.2 Msun at 78 days before the core collapse, we compute the light-curve evolution of the ultra-stripped supernova within the dense circumstellar matter. The core collapse results in a supernova explosion with an ejecta mass of 0.06 Msun and an explosion energy of 9e49 erg. Because the dense circumstellar matter is more massive than the supernova ejecta, the ejecta are immediately decelerated and the light curve is powered mainly by the circumstellar interaction. Therefore, this ultra-stripped supernova is likely observed as a Type Ibn supernova. We suggest that some Type Ibn supernovae may originate from ultra-stripped supernova progenitors losing significant mass shortly before their explosion due to violent silicon burning.",
      "pdf_url": "https://arxiv.org/pdf/2507.05506.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.12119",
      "title": "Magnetars in Binaries as the Engine of Actively Repeating Fast Radio Bursts",
      "authors": [
        "Bing Zhang",
        "Rui-Chong Hu"
      ],
      "abstract": "Magnetars in Binaries as the Engine of Actively Repeating Fast Radio Bursts Bing Zhang (HKU and UNLV), Rui-Chong Hu (UNLV) 20 pages, 5 figures, version accepted for publication in ApJL High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The association between FRB 20200428D and the Galactic magnetar SGR J1935+2154 makes magnetars the leading engine of cosmological fast radio bursts (FRBs). However, there is a list of puzzles for this magnetar-for-all-FRBs scenario: known Galactic magnetars are all isolated and none of them are active repeaters; some cosmological repeaters have extremely high repetition rates but without any measurable spin-related periodicity; some show long-term periodic active windows; and some show diverse rotation measure (RM) evolution patterns, such as quasi-periodic fluctuations, sign reversals, and abrupt RM flares. Here we propose a unified theoretical framework for FRBs within the framework of magnetar engine: Most active repeating FRBs originate from magnetars in binary systems with nearly aligned rotation and magnetic axes, some of which with a triple-aligned geometry, i.e. with an alignment with the orbital axis as well; whereas apparent non-repeaters and inactive repeaters originate from magnetars in isolated systems or in binaries with a misaligned geometry. By studying various magnetar formation channels using population syntheses, we show that a few percent of magnetars in the universe can be in binary systems, most with a massive star companion and some with aligned geometry. We suggest that such binary systems can account for the rich phenomenology of active repeaters. We suggest that the existence of a companion helps to maintain the aligned geometry and that the companion may play an active role in triggering FRBs in an active repeater source.",
      "pdf_url": "https://arxiv.org/pdf/2508.12119.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.06594",
      "title": "The source of the cosmic-ray excess in the Centaurus region -- constraints on possible candidates, mass composition and cosmic magnetic fields",
      "authors": [
        "Teresa Bister"
      ],
      "abstract": "The source of the cosmic-ray excess in the Centaurus region -- constraints on possible candidates, mass composition and cosmic magnetic fields Teresa Bister High Energy Astrophysical Phenomena (astro-ph.HE) The most significant excess in the arrival directions of ultra-high-energy cosmic rays with energies $\\gtrsim40\\,\\mathrm{EeV}$ is found in the direction of several interesting source candidates, most prominently the nearby radio galaxy Centaurus A. Naturally, Cen A has been suspected to create the anisotropy - but very different scenarios have been proposed. This includes a subdominant source contribution in combination with isotropic background sources, as well as a scenario where Cen A supplies the whole cosmic-ray flux above the ankle. Recently, it was suggested that the overdensity could instead consist of strongly deflected events from the Sombrero galaxy. Thanks to the recent development of several models of the Galactic magnetic field, it is now possible to test these proposed scenarios explicitly. Leveraging the measured overdensity direction, significance, angular scale, and energy evolution, we place limits on the allowed signal fraction, the possible ejected charge number and the strength of the extragalactic magnetic field between the respective source and Earth. We find that the scenario of a subdominant source in the overdensity region requires the charge number to be $Z\\lesssim6$ and the extragalactic magnetic field quantity $B/\\mathrm{nG} \\sqrt{L_c/\\mathrm{Mpc}}$ to be between $~1$ and $~100$. For the Sombrero galaxy to be the source, the dominant charge number has to be around $Z=6$ with $1\\lesssim B/\\mathrm{nG} \\sqrt{L_c/\\mathrm{Mpc}}\\lesssim20$. We find that a scenario where all the flux above $30\\,\\mathrm{EeV}$ is supplied by Cen A or M83 is possible for $20\\lesssim B/\\mathrm{nG} \\sqrt{L_c/\\mathrm{Mpc}}\\lesssim30$ and a mixed composition - explaining both the Centaurus region excess and the distribution of the highest-energy events - however, another contributing source is possibly required in the energy range $<30\\,\\mathrm{EeV}$.",
      "pdf_url": "https://arxiv.org/pdf/2509.06594.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.01272",
      "title": "Investigating dusty Red Supergiant outflows in Westerlund 1 with 3D Hydrodynamic simulations",
      "authors": [
        "C. J. K. Larkin",
        "J. Mackey",
        "T. J. Haworth",
        "A. A. C. Sander"
      ],
      "abstract": "Investigating dusty Red Supergiant outflows in Westerlund 1 with 3D Hydrodynamic simulations C. J. K. Larkin, J. Mackey, T. J. Haworth, A. A. C. Sander 12 pages, 13 figures. Published in Astronomy & Astrophysics, updated following comments from the referee Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Recent JWST observations towards Westerlund 1 revealed extensive nebular emission associated with the cluster. Given the age of the region and proximity of that material to massive stars it cannot be primordial star forming gas and the origin is uncertain. We aim to determine whether the nebular emission in Westerlund 1 could be due to ablation flows from Red Supergiant (RSG) stars embedded in the cluster wind driven by the Wolf-Rayet stars in the cluster core. We also aim to explore the efficiency of mass-loading for the RSG wind in this scenario. We use 3D hydrodynamic simulations with the \\textsc{pion} code to study the interaction between the cluster and RSG winds. We compare with the JWST observations by generating synthetic dust-emission maps. We find that the ablation flow morphology is consistent with the observations towards Westerlund 1, with clumps and instabilities. Synthetic observations at 11 $\\mu$m predict fluxes in the ablation flow of $\\sim1000-6000$ MJy ster$^{-1}$ which is consistent with the unsaturated components of the JWST F1130W observations in the vicinity of the red supergiants in the region. This good agreement is achieved without any consideration of polycyclic aromatic hydrocarbons (PAHs), which have a known 11.3 $\\mu$m feature that appears in the F1130W band. This suggests that the ablation flow is PAH depleted. Ablation of RSG winds can explain the observed nebulosity in Westerlund 1, at least in the vicinity of the RSGs. Further observations are encouraged to enable detailed studies of these interactions.",
      "pdf_url": "https://arxiv.org/pdf/2503.01272.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.12702",
      "title": "Unveiling a New $β$-Scaling of the Tearing Instability in Weakly Collisional Plasmas",
      "authors": [
        "Gabriel L. Ferreira-Santos",
        "Grzegorz Kowal",
        "Diego A. Falceta-Gonçalves"
      ],
      "abstract": "Unveiling a New $β$-Scaling of the Tearing Instability in Weakly Collisional Plasmas Gabriel L. Ferreira-Santos, Grzegorz Kowal, Diego A. Falceta-Gonçalves Accepted for publication in ApJ on September 4, 2025. Manuscript: 15 pages, 3 figures Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We investigate the linear tearing instability in weakly collisional plasmas using a non-ideal gyrotropic-MHD framework, uncovering a previously unknown scaling relation for the instability growth rate in high-$\\beta$ environments. Even starting from an isotropic equilibrium, our analysis reveals a $\\beta$-dependence, with the maximum growth rate scaling as $\\sigma_\\mathrm{max} \\tau_a \\propto \\beta^{-1/4}$, challenging the long-held assumption of $\\beta$-independence inherent in classical MHD formulations. This novel scaling emerges due to self-consistent fluctuations in pressure anisotropy, dynamically induced by perturbations in velocity and magnetic fields. Increasing plasma-$\\beta$ always suppresses the instability, whereas a background pressure anisotropy can either enhance or further suppress it, depending on its sign: for $p_{\\parallel,0} < p_{\\perp,0}$ the instability is strengthened, while for $p_{\\parallel,0} > p_{\\perp,0}$ it is weakened. Importantly, this effect is not limited to low-collisionality plasmas at high $\\beta$; it can also manifest in more collisional environments once the strict assumption of pressure isotropy is relaxed. This finding has profound implications for various astrophysical contexts characterized by high $\\beta$ and varying degrees of collisionality, including the solar corona and heliospheric current sheets, planetary magnetospheres, as probed by space missions, and the intracluster medium, where magnetic reconnection critically impacts magnetic field evolution and cosmic ray transport. Our results therefore question the universality of the widely-accepted plasmoid-mediated fast reconnection paradigm and underscore the necessity of incorporating pressure anisotropy effects into reconnection models for accurate representation of astrophysical plasmas.",
      "pdf_url": "https://arxiv.org/pdf/2503.12702.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01317",
      "title": "Expectations for the first supermassive black-hole binary resolved by PTAs I: Model efficacy",
      "authors": [
        "Levi Schult",
        "Polina Petrov",
        "Stephen R. Taylor",
        "Nihan Pol",
        "Nima Laal",
        "Maria Charisi",
        "Chung-Pei Ma"
      ],
      "abstract": "Expectations for the first supermassive black-hole binary resolved by PTAs I: Model efficacy Levi Schult, Polina Petrov, Stephen R. Taylor, Nihan Pol, Nima Laal, Maria Charisi, Chung-Pei Ma 25 pages, 6 figures, 3 tables. Submitted to Physical Review D Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) One of the most promising targets for Pulsar Timing Arrays (PTAs) is identifying an individual supermassive black hole binary (SMBHB) out of the population of binaries theorized to produce a gravitational wave background (GWB). In this work, we emulate an evolving PTA dataset, complete with an increasing number of pulsars and timing baseline, into which we inject a single binary on top of a Gaussian GWB signal. We vary the binary's source parameters, including sky position and frequency, and create an ensemble of simulated datasets with which we assess current Bayesian binary search techniques. We apply two waveform-based template models and a frequency-resolved anisotropy search to these simulations to understand how they compare in their detection and characterization abilities. We find that a template-based search including the full gravitational-wave signal structure (i.e., both Earth and pulsar effects of an incident GW) returns the highest Bayes Factors (BF), exceeding our estimator's capabilities by (S/N)~9-19, and has the most robust parameter estimation. Our anisotropy model attains a realization-median BF>10 at 7<(S/N)<15. Interestingly, despite being a deterministic model, the Earth-term template struggles to detect and characterize low-frequency binaries (5 nHz). These binaries require higher (S/N)~16-19 to reach the same BF threshold. This is likely due to neglected confusion effects between the pulsar and Earth terms. By contrast, the frequency-resolved anisotropy model shows promise for parameter estimation despite treating a binary's GW signal as excess directional GW power without phase modeling. Sky location and frequency parameter constraints returned by the anisotropy model are only surpassed by the Earth term template model at (S/N)~12-13. Milestones for a first detection using the full-signal GW model are included in a companion paper (Petrov et al. 2025).",
      "pdf_url": "https://arxiv.org/pdf/2510.01317.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.06310",
      "title": "MUSEQuBES: Physical conditions, origins, and multi-element abundances of the circumgalactic medium of an isolated, star-forming dwarf galaxy at z=0.57",
      "authors": [
        "Sean D. Johnson",
        "Nishant Mishra",
        "Sowgat Muzahid",
        "Gwen C. Rudie",
        "Fakhri S. Zahedy",
        "Zhijie Qu",
        "Claude-André Faucher-Giguère",
        "Jonathan Stern",
        "Jennifer I-Hsiu Li",
        "Elise Fuller",
        "Sebastiano Cantalupo",
        "Hsiao-Wen Chen",
        "Ahmad Kadri",
        "Suyash Kumar",
        "Zhuoqi Will Liu",
        "Gregory Walth"
      ],
      "abstract": "MUSEQuBES: Physical conditions, origins, and multi-element abundances of the circumgalactic medium of an isolated, star-forming dwarf galaxy at z=0.57 Sean D. Johnson, Nishant Mishra, Sowgat Muzahid, Gwen C. Rudie, Fakhri S. Zahedy, Zhijie Qu, Claude-André Faucher-Giguère, Jonathan Stern, Jennifer I-Hsiu Li, Elise Fuller, Sebastiano Cantalupo, Hsiao-Wen Chen, Ahmad Kadri, Suyash Kumar, Zhuoqi Will Liu, Gregory Walth Submitted to AAS Journals; 5 figures, 1 table, 1 appendix figure Astrophysics of Galaxies (astro-ph.GA) In dwarf galaxy models, outflows expel metal-enriched interstellar medium (ISM) into the circumgalactic medium (CGM) to reproduce their observed low metallicities, but measurements of dwarf CGM properties are scarce. We present a study of the CGM of an isolated dwarf at $z=0.5723$ with a stellar mass of $\\approx5\\times10^7\\rm\\,M_{\\odot}$ and star-formation rate ($\\approx0.05\\,\\rm M_\\odot\\,yr^{-1}$) and ISM metallicity ($\\rm [O/H]\\approx-0.9$) consistent with the star-forming main sequence and mass-metallicity relation. A background quasar sightline with archival UV spectra probes the dwarf's CGM at a projected distance of 28 kpc, corresponding to approximately half of the estimated virial radius. The dwarf's CGM is detected in H I, intermediate metal ions of C III, O III, and O IV, and kinematically broader, highly-ionized O VI, but is undetected in N IV and Ne VIII. Photoionization modeling of the intermediate ions indicates a modest volume-filling factor ($\\sim 6\\%$ along the sightline or $\\sim 2\\%$ globally), and a mass of $\\sim2\\times10^8 {\\rm\\,M_\\odot}$, $\\sim4\\times$ higher than the dwarf's stellar mass, but $\\sim10\\times$ less than the highly ionized CGM. The O VI kinematics are comparable to the dwarf's estimated virial velocity, suggesting it is likely associated with cool, photoionized, and volume-filling CGM, with bulk motion or turbulence dominating over thermal pressure. The metallicity inferred for the intermediate ions is $\\rm [O/H]=-0.6$, but with low relative abundances of $\\rm [C/O]=-0.6$ and $\\rm [N/O]<-0.9$. The [N/O] is below levels expected of the dwarf's ISM, but consistent with core-collapse supernova ejecta, suggesting that supernova-enriched gas escaped the dwarf without mixing significantly with ISM enriched in nitrogen from evolved, low-mass stars.",
      "pdf_url": "https://arxiv.org/pdf/2510.06310.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06315",
      "title": "Beyond the stars: Linking H$α$ sizes, kinematics, and star formation in galaxies at $z\\approx 4-6$ with JWST grism surveys and $\\texttt{geko}$",
      "authors": [
        "A. Lola Danhaive",
        "Sandro Tacchella",
        "William McClymont",
        "Brant Robertson",
        "Stefano Carniani",
        "Courtney Carreira",
        "Eiichi Egami",
        "Andrew J. Bunker",
        "Emma Curtis-Lake",
        "Daniel J. Eisenstein",
        "Zhiyuan Ji",
        "Benjamin D. Johnson",
        "Marcia Rieke",
        "Natalia C. Villanueva",
        "Christopher N. A. Willmer",
        "Chris Willot",
        "Zihao Wu",
        "Yongda Zhu"
      ],
      "abstract": "Beyond the stars: Linking H$α$ sizes, kinematics, and star formation in galaxies at $z\\approx 4-6$ with JWST grism surveys and $\\texttt{geko}$ A. Lola Danhaive, Sandro Tacchella, William McClymont, Brant Robertson, Stefano Carniani, Courtney Carreira, Eiichi Egami, Andrew J. Bunker, Emma Curtis-Lake, Daniel J. Eisenstein, Zhiyuan Ji, Benjamin D. Johnson, Marcia Rieke, Natalia C. Villanueva, Christopher N. A. Willmer, Chris Willot, Zihao Wu, Yongda Zhu 18 pages, 11 figures, 2 tables, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) Understanding how galaxies assemble their mass during the first billion years of cosmic time is a central goal of extragalactic astrophysics, yet joint constraints on their sizes and kinematics remain scarce. We present one of the first statistical studies of the $\\mathrm{H}\\alpha$ size-mass relation at high redshift with a sample of 213 galaxies at spectroscopic redshifts of $z\\approx 4-6$ from the FRESCO and CONGRESS NIRCam grism surveys. We measure the $\\mathrm{H}\\alpha$ morphology and kinematics of our sample using the novel forward modelling Bayesian inference tool $\\texttt{geko}$, and complement them with stellar continuum sizes in the rest-frame FUV, NUV, and optical, obtained from modelling of imaging data from the JADES survey with $\\texttt{Pysersic}$. At $z\\approx5$, we find that the average H$\\alpha$ sizes are larger than the stellar continuum (FUV, NUV and optical), with $r_{\\rm e, H\\alpha}= 1.17 \\pm 0.05$ kpc and $r_{\\rm e,cont} \\approx 0.9$ kpc for galaxies with $\\log(M_{\\star} ~\\rm [M_{\\odot}])= 9.5$. However, we find no significant differences between the stellar continuum sizes at different wavelengths, suggesting that galaxies are not yet steadily growing inside-out at these epochs. Instead, we find that the ratio $r_{\\rm e, H\\alpha}/r_{\\rm e, NUV}$ increases with the distance above the star-forming main sequence ($\\Delta \\rm MS$), consistent with an expansion of H$\\alpha$ sizes during episodes of enhanced star formation caused by an increase in ionising photons. As galaxies move above the star-forming main sequence, we find an increase of their rotational support $v/\\sigma$, which could be tracing accreting gas illuminated by the \\Ha\\ emission. Finally, we find that about half of the elongated systems ($b/a < 0.5$) are not rotationally supported, indicating a potential flattened/prolate galaxy population at high redshift.",
      "pdf_url": "https://arxiv.org/pdf/2510.06315.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06322",
      "title": "Comparing XRISM cluster velocity dispersions with predictions from cosmological simulations: are feedback models too ejective?",
      "authors": [
        "XRISM Collaboration",
        "Marc Audard",
        "Hisamitsu Awaki",
        "Ralf Ballhausen",
        "Aya Bamba",
        "Ehud Behar",
        "Rozenn Boissay-Malaquin",
        "Laura Brenneman",
        "Gregory V. Brown",
        "Lia Corrales",
        "Elisa Costantini",
        "Renata Cumbee",
        "Maria Diaz Trigo",
        "Chris Done",
        "Tadayasu Dotani",
        "Ken Ebisawa",
        "Megan E. Eckart",
        "Dominique Eckert",
        "Satoshi Eguchi",
        "Teruaki Enoto",
        "Yuichiro Ezoe",
        "Adam Foster",
        "Ryuichi Fujimoto",
        "Yutaka Fujita",
        "Yasushi Fukazawa",
        "Kotaro Fukushima",
        "Akihiro Furuzawa",
        "Luigi Gallo",
        "Javier A. García",
        "Liyi Gu",
        "Matteo Guainazzi",
        "Kouichi Hagino",
        "Kenji Hamaguchi",
        "Isamu Hatsukade",
        "Katsuhiro Hayashi",
        "Takayuki Hayashi",
        "Natalie Hell",
        "Edmund Hodges-Kluck",
        "Ann Hornschemeier",
        "Yuto Ichinohe",
        "Daiki Ishi",
        "Manabu Ishida",
        "Kumi Ishikawa",
        "Yoshitaka Ishisaki",
        "Jelle Kaastra",
        "Timothy Kallman",
        "Erin Kara",
        "Satoru Katsuda",
        "Yoshiaki Kanemaru",
        "Richard Kelley",
        "Caroline Kilbourne",
        "Shunji Kitamoto",
        "Shogo Kobayashi",
        "Takayoshi Kohmura",
        "Aya Kubota",
        "Maurice Leutenegger",
        "Michael Loewenstein",
        "Yoshitomo Maeda",
        "Maxim Markevitch",
        "Hironori Matsumoto",
        "Kyoko Matsushita",
        "Dan McCammon",
        "Brian McNamara",
        "François Mernier",
        "Eric D. Miller",
        "Jon M. Miller",
        "Ikuyuki Mitsuishi",
        "Misaki Mizumoto",
        "Tsunefumi Mizuno",
        "Koji Mori",
        "Koji Mukai",
        "Hiroshi Murakami",
        "Richard Mushotzky",
        "Hiroshi Nakajima",
        "Kazuhiro Nakazawa",
        "Jan-Uwe Ness",
        "Kumiko Nobukawa",
        "Masayoshi Nobukawa",
        "Hirofumi Noda",
        "Hirokazu Odaka",
        "Shoji Ogawa",
        "Anna Ogorzałek",
        "Takashi Okajima",
        "Naomi Ota",
        "Stephane Paltani",
        "Robert Petre",
        "Paul Plucinsky",
        "Frederick S. Porter",
        "Katja Pottschmidt",
        "Kosuke Sato",
        "Toshiki Sato",
        "Makoto Sawada",
        "Hiromi Seta",
        "Megumi Shidatsu",
        "Aurora Simionescu",
        "Randall Smith",
        "Hiromasa Suzuki",
        "Andrew Szymkowiak",
        "Hiromitsu Takahashi",
        "Mai Takeo"
      ],
      "abstract": "Comparing XRISM cluster velocity dispersions with predictions from cosmological simulations: are feedback models too ejective? XRISM Collaboration, Marc Audard, Hisamitsu Awaki, Ralf Ballhausen, Aya Bamba, Ehud Behar, Rozenn Boissay-Malaquin, Laura Brenneman, Gregory V. Brown, Lia Corrales, Elisa Costantini, Renata Cumbee, Maria Diaz Trigo, Chris Done, Tadayasu Dotani, Ken Ebisawa, Megan E. Eckart, Dominique Eckert, Satoshi Eguchi, Teruaki Enoto, Yuichiro Ezoe, Adam Foster, Ryuichi Fujimoto, Yutaka Fujita, Yasushi Fukazawa, Kotaro Fukushima, Akihiro Furuzawa, Luigi Gallo, Javier A. García, Liyi Gu, Matteo Guainazzi, Kouichi Hagino, Kenji Hamaguchi, Isamu Hatsukade, Katsuhiro Hayashi, Takayuki Hayashi, Natalie Hell, Edmund Hodges-Kluck, Ann Hornschemeier, Yuto Ichinohe, Daiki Ishi, Manabu Ishida, Kumi Ishikawa, Yoshitaka Ishisaki, Jelle Kaastra, Timothy Kallman, Erin Kara, Satoru Katsuda, Yoshiaki Kanemaru, Richard Kelley, Caroline Kilbourne, Shunji Kitamoto, Shogo Kobayashi, Takayoshi Kohmura, Aya Kubota, Maurice Leutenegger, Michael Loewenstein, Yoshitomo Maeda, Maxim Markevitch, Hironori Matsumoto, Kyoko Matsushita, Dan McCammon, Brian McNamara, François Mernier, Eric D. Miller, Jon M. Miller, Ikuyuki Mitsuishi, Misaki Mizumoto, Tsunefumi Mizuno, Koji Mori, Koji Mukai, Hiroshi Murakami, Richard Mushotzky, Hiroshi Nakajima, Kazuhiro Nakazawa, Jan-Uwe Ness, Kumiko Nobukawa, Masayoshi Nobukawa, Hirofumi Noda, Hirokazu Odaka, Shoji Ogawa, Anna Ogorzałek, Takashi Okajima, Naomi Ota, Stephane Paltani, Robert Petre, Paul Plucinsky, Frederick S. Porter, Katja Pottschmidt, Kosuke Sato, Toshiki Sato, Makoto Sawada, Hiromi Seta, Megumi Shidatsu, Aurora Simionescu, Randall Smith, Hiromasa Suzuki, Andrew Szymkowiak, Hiromitsu Takahashi, Mai Takeo Accepted for publication in ApJ Letters Astrophysics of Galaxies (astro-ph.GA) The dynamics of the intra-cluster medium (ICM), the hot plasma that fills galaxy clusters, are shaped by gravity-driven cluster mergers and feedback from supermassive black holes (SMBH) in the cluster cores. XRISM measurements of ICM velocities in several clusters offer insights into these processes. We compare XRISM measurements for nine galaxy clusters (Virgo, Perseus, Centaurus, Hydra A, PKS\\,0745--19, A2029, Coma, A2319, Ophiuchus) with predictions from three state-of-the-art cosmological simulation suites, TNG-Cluster, The Three Hundred Project GADGET-X, and GIZMO-SIMBA, that employ different models of feedback. In cool cores, XRISM reveals systematically lower velocity dispersions than the simulations predict, with all ten measurements below the median simulated values by a factor $1.5-1.7$ on average and all falling within the bottom $10\\%$ of the predicted distributions. The observed kinetic-to-total pressure ratio is also lower, with a median value of $2.2\\%$, compared to the predicted $5.0-6.5\\%$ for the three simulations. Outside the cool cores and in non-cool-core clusters, simulations show better agreement with XRISM measurements, except for the outskirts of the relaxed, cool-core cluster A2029, which exhibits an exceptionally low kinetic pressure support ($<1\\%$), with none of the simulated systems in either of the three suites reaching such low levels. The non-cool-core Coma and A2319 exhibit dispersions at the lower end but within the simulated spread. Our comparison suggests that the three numerical models may overestimate the kinetic effects of SMBH feedback in cluster cores. Additional XRISM observations of non-cool-core clusters will clarify if there is a systematic tension in the gravity-dominated regime as well.",
      "pdf_url": "https://arxiv.org/pdf/2510.06322.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06329",
      "title": "Asymmetries in stellar streams induced by a galactic merger",
      "authors": [
        "Claire Guillaume",
        "Florent Renaud",
        "Nicolas F. Martin",
        "Benoit Famaey",
        "Paola Di Matteo",
        "Guillaume F. Thomas",
        "Salvatore Ferrone",
        "Rodrigo Ibata",
        "Giulia Pagnini"
      ],
      "abstract": "Asymmetries in stellar streams induced by a galactic merger Claire Guillaume, Florent Renaud, Nicolas F. Martin, Benoit Famaey, Paola Di Matteo, Guillaume F. Thomas, Salvatore Ferrone, Rodrigo Ibata, Giulia Pagnini Astrophysics of Galaxies (astro-ph.GA) Stellar streams are sensitive to perturbations from, e.g., giant molecular clouds, bars and spiral arms, infalling dwarf galaxies, or globular clusters which can imprint gaps, clumps, spurs, and asymmetries in tails. In addition to these effects, the impact of a galactic major merger on a population of stellar streams remains to be explored. Here, we focus on the emergence and longevity of asymmetries between the leading and trailing tails of streams caused by such interactions. We run collisionless N-body simulations of a Milky Way-like galaxy hosting 36 globular cluster streams and merging with a perturber galaxy. We propose a new asymmetry metric to quantify the structural differences between both tails from their respective cumulative density profiles. We find that the over- and under-densities along streams induced by the merger depend on the orbital characteristics of their progenitors. The non-simultaneity of this effect from stream to stream implies that global asymmetry signatures are less prominent than in individual cases. These population-averaged imprints remain detectable over only 2.5 Gyr but asymmetric signatures can persist over much longer periods for individual streams with wide orbits that have been perturbed prior to coalescence. We thus caution that the interpretation of streams' morphology in the context of dark matter mapping is strongly subject to degeneracies and should be performed considering the merger history of the host.",
      "pdf_url": "https://arxiv.org/pdf/2510.06329.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06332",
      "title": "A Walk on the Retrograde Side (WRS) project. II. Chemistry to disentangle in situ and accreted components in Thamnos",
      "authors": [
        "E. Ceccarelli",
        "D. Massari",
        "M. Palla",
        "A. Mucciarelli",
        "M. Bellazzini",
        "A. Helmi"
      ],
      "abstract": "A Walk on the Retrograde Side (WRS) project. II. Chemistry to disentangle in situ and accreted components in Thamnos E. Ceccarelli, D. Massari, M. Palla, A. Mucciarelli, M. Bellazzini, A. Helmi Main paper: 13 pages and 11 figures. Appendix: 1 page. Submitted to A&A, revised version after first review, addressing minor comments Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present the results of the first systematic and dedicated high-resolution chemical analysis of the Thamnos substructure, a candidate relic of the process of hierarchical merger of the Milky Way. The analysis is perfomed in comparison with the Gaia-Sausage-Enceladus (GSE) remnant, within the fully self-consistent and homogeneous framework established by the WRS project. We analyse high-resolution and high signal-to-noise ratio spectra obtained with UVES at VLT for 212 Red Giant Branch stars classified as candidate members of Thamnos and GSE, based on selections in the space of the integrals of motion. We derive precise abundances for 16 atomic species. Compared to GSE, stars attributed to the Thamnos substructure are, on average, more metal-poor, yet most of them show relatively higher [X/Fe] abundance ratios in several elements, like Na, Mg, Al, Ca, Cu, Zn, as well as lower [Eu/Fe]. The majority of candidate Thamnos stars show chemical signatures more consistent with the in situ Milky Way halo rather than a typical low-mass accreted dwarf galaxy. Our findings are further supported by comparisons with tailored galactic chemical evolution models, which fall short in reproducing the observed enhancement in the $\\alpha$-elements, but are able to fit the more metal-poor component present in the Thamnos substructure. These results confirm a high level of contamination in the Thamnos substructure from the in situ population and to a lesser degree from GSE, while still leaving room for a genuine accreted population from a small disrupted dwarf galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2510.06332.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06347",
      "title": "MEGATRON: Disentangling Physical Processes and Observational Bias in the Multi-Phase ISM of High-Redshift Galaxies",
      "authors": [
        "Nicholas Choustikov",
        "Harley Katz",
        "Alex J. Cameron",
        "Aayush Saxena",
        "Julien Devriendt",
        "Adrianne Slyz",
        "Martin P. Rey",
        "Corentin Cadiou",
        "Jeremy Blaizot",
        "Taysun Kimm",
        "Isaac Laseter",
        "Kosei Matsumoto",
        "Joki Rosdahl"
      ],
      "abstract": "MEGATRON: Disentangling Physical Processes and Observational Bias in the Multi-Phase ISM of High-Redshift Galaxies Nicholas Choustikov, Harley Katz, Alex J. Cameron, Aayush Saxena, Julien Devriendt, Adrianne Slyz, Martin P. Rey, Corentin Cadiou, Jeremy Blaizot, Taysun Kimm, Isaac Laseter, Kosei Matsumoto, Joki Rosdahl 23 pages, 14 figures, 1 table. Submitted to the Open Journal of Astrophysics. Comments are welcome! Astrophysics of Galaxies (astro-ph.GA) Now detected out to redshifts of $z\\sim 14.5$, the rest-frame ultraviolet and optical spectra of galaxies encode numerous physical properties of the interstellar medium (ISM). Accurately extracting these properties from spectra remains a key challenge that numerical simulations are uniquely suited to address. We present a study of the observed ISM of galaxies in MEGATRON: a suite of cosmological radiation hydrodynamics simulations coupled to on-the-fly non-equilibrium thermochemistry, with multiple prescriptions for star formation/feedback and parsec-scale resolution; capable of directly predicting spectroscopic properties of early galaxies. We find that irrespective of feedback physics used, the ISM of high-redshift galaxies is denser, less metal enriched, and subject to higher ionization parameters and radiation fields compared to similar mass galaxies in the local Universe -- in agreement with interpretations of JWST observations. Using common observational techniques to infer bulk galaxy properties, we find that ISM gas density controls the slope of the mass-metallicity relation. Similarly, at the densities reached in some high-redshift galaxies, O32 becomes a density tracer rather than one of ionization parameter. This motivates the use of other line ratios like C43 and N43 to infer the ionization state of the gas. Finally, various feedback models populate different regions of strong-line diagnostic diagrams as the line ratios are sensitive to the feedback-modulated density-temperature structure of the ISM. Therefore, observed strong-line diagnostics can provide a strong constraint on the underlying physics of star formation and feedback in the high-redshift Universe.",
      "pdf_url": "https://arxiv.org/pdf/2510.06347.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06362",
      "title": "Evidence of violation of Case B recombination in Little Red Dots",
      "authors": [
        "G. P. Nikopoulos",
        "D. Watson",
        "A. Sneppen",
        "V. Rusakov",
        "K. E. Heintz",
        "J. Witstok",
        "G. Brammer"
      ],
      "abstract": "Evidence of violation of Case B recombination in Little Red Dots G. P. Nikopoulos, D. Watson, A. Sneppen, V. Rusakov, K. E. Heintz, J. Witstok, G. Brammer 19 pages (11 pages main text, 8 pages Appendix), 8 figures. To be submitted to A&A. All comments are welcome Astrophysics of Galaxies (astro-ph.GA) Little Red Dots (LRDs) are a new class of compact extragalactic objects, with a v-shaped optical spectral energy distribution breaking close to the Balmer break wavelength, and broad, typically exponentially-shaped lines. They are believed to be supermassive black holes surrounded by very dense, ionized gas, leading us to explore for any departures from Case B recombination by examining the ratios of multiple hydrogen Balmer lines: $H\\alpha$, $H\\beta$, $H\\gamma$, and $H\\delta$. We analyze a dozen high-S/N LRDs with JWST/NIRSpec, measuring Balmer ratios in the seven objects with coverage of at least three lines. We decompose the line ratios into their respective broad and narrow components. Broad line ratios are consistent with Case B plus dust extinction in all objects but one, RUBIES EGS-49140, which departs from Case B expectations by more than $5\\sigma$. The narrow components are consistent with minimal dust attenuation, while two objects exhibit narrow $H\\alpha$/$H\\beta \\approx 1.8$. Such low decrements are observed in highly ionized density bounded nebulae, associated with starburst environments. Nevertheless, both flat decrement cases can be reconciled assuming an unresolved absorption feature. RUBIES EGS-49140, shows a high broad $H\\alpha$/$H\\beta$, but $H\\gamma$/$H\\alpha$ and $H\\delta$/$H\\alpha$ ratios are lower than expected for extinction-modified Case B, hinting at an unphysically steep dust law. These line ratios may be due to increased optical depth in the Balmer lines, as a direct effect of high density (log$n_e$ > 9) gas surrounding the black hole. If Case B recombination does hold in most LRDs, they must be moderate-to-heavily dust obscured ($A_V\\simeq1-8$) while the host-galaxy should be dust-free, suggesting that the extinction in the broad lines is local to the LRD and not due to the general ISM of the host galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2510.06362.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06408",
      "title": "The rise and fall of Little Red Dots could be driven by the environment",
      "authors": [
        "Rosa M. Mérida",
        "Gaia Gaspar",
        "Yoshihisa Asada",
        "Marcin Sawicki",
        "Kiyoaki Christopher Omori",
        "Chris J. Willott",
        "Nicholas S. Martis",
        "Adam Muzzin",
        "Gaël Noirot",
        "Gregor Rihtaršič",
        "Ghassan T. E. Sarrouh",
        "Roberta Tripodi"
      ],
      "abstract": "The rise and fall of Little Red Dots could be driven by the environment Rosa M. Mérida, Gaia Gaspar, Yoshihisa Asada, Marcin Sawicki, Kiyoaki Christopher Omori, Chris J. Willott, Nicholas S. Martis, Adam Muzzin, Gaël Noirot, Gregor Rihtaršič, Ghassan T. E. Sarrouh, Roberta Tripodi 14 pages, 13 figures, 5 tables. Submitted to A&A Astrophysics of Galaxies (astro-ph.GA) The Little Red Dot (LRD) paradigm comprises three main unknowns that are intrinsically connected: (1) What is the nature of these sources? (2) How do they form? (3) How do they evolve? Larger spectroscopic samples and high-resolution data are needed to delve deeper into the mechanisms ruling these sources. Understanding their formation and evolution requires identifying the rise and fall of the key features that characterize these systems, such as their compactness and ``V''-shaped spectral energy distributions. In this work, we present a galaxy system nicknamed The Stingray that was identified in the Canadian NIRISS Unbiased Cluster Survey (CANUCS). This group contains three sources at $z_{\\mathrm{spec}} = 5.12$, including an active galactic nucleus (AGN), a Balmer break galaxy, and a star-forming satellite. The latter resembles a Building Block System in which interactions boost stellar mass and black hole mass growth beyond what is expected from secular processes alone. The AGN in this system exhibits features indicative of a transitional object, bridging a normal AGN and an LRD phase. These are a blue rest-frame ultraviolet slope, compact size, and a broad H$\\alpha$ line (all of which are characteristic of LRDs), but a flatter rest-frame optical slope compared to that observed in LRDs. The features in this source point to the emergence or fading of an LRD, potentially triggered by environmental effects.",
      "pdf_url": "https://arxiv.org/pdf/2510.06408.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06667",
      "title": "Ionized gas components in low surface brightness galaxy AGC 111629",
      "authors": [
        "Tian-Wen Cao",
        "Pei-Bin Chen",
        "Zi-Jian Li",
        "Cheng Cheng",
        "Venu M. Kalari",
        "Meng-Ting Shen",
        "Chun-Yi Zhang",
        "Junfeng Wang",
        "Gaspar Galaz",
        "Hong Wu",
        "Zi-Qi Chen"
      ],
      "abstract": "Ionized gas components in low surface brightness galaxy AGC 111629 Tian-Wen Cao, Pei-Bin Chen, Zi-Jian Li, Cheng Cheng, Venu M. Kalari, Meng-Ting Shen, Chun-Yi Zhang, Junfeng Wang, Gaspar Galaz, Hong Wu, Zi-Qi Chen 12 pages, 12 figures, accepted for publication in AJ Astrophysics of Galaxies (astro-ph.GA) We present integral field spectroscopy of ionized gas components in AGC 111629, an edge-on low surface brightness galaxy (LSBG) with a stellar mass of 5.7$\\times$10$^{8}$ M$_{\\odot}$. AGC 111629 displays an irregular H$\\alpha$ morphology and an arch-like structure in the extraplanar region, which is absent in continuous stellar image. The irregular H$\\alpha$ morphology may be related to a past merger event with its satellite galaxy AGC 748815. A peanut-shaped structure at the center in the integrated [OIII]$\\lambda$5007 map, with a position angle that differs from that of the main stellar disk. This structure exhibits a higher [OIII]$\\lambda$5007/H$\\beta$ flux ratio, a larger equivalent width (EW) of [OIII]$\\lambda$5007, and a lower H$\\alpha$/H$\\beta$ flux radio ($<$ 2.86). Some spaxels associated with the peanut-shaped structure fall within the composite region of the BPT diagram based on [NII]$\\lambda$6583. These features may be associated with the central AGN. Additionally, a sub-peak in the southern disk is clearly visible in the [OIII]$\\lambda$5007 map. An extended region ($\\sim$ 2 kpc) with an extremely low value of H$\\alpha$/H$\\beta$ flux ratio is observed near this sub-peak. We interpret the sub-peak as a superbubble likely driven by supernova explosions in the southern disk. We derive the gas-phase metallicity, 12+log(O/H), using the [NII]$\\lambda$6583/H$\\alpha$ diagnostic and find that AGC 111629 exhibits low central metallicity. This may result from feedback associated with AGN activity and supernova explosions.",
      "pdf_url": "https://arxiv.org/pdf/2510.06667.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06668",
      "title": "Formation of A Nuclear Star Cluster Through A Merger Event In The Low Surface Brightness Galaxy AGC 223218",
      "authors": [
        "Tian-Wen Cao",
        "Zi-Qi Chen",
        "Zi-Jian Li",
        "Cheng Cheng",
        "Gaspar Galaz",
        "Venu M. Kalari",
        "Jun-feng Wang",
        "Chun-Yi Zhang",
        "Pei-Bin Chen",
        "Meng-Ting Shen",
        "Hong Wu"
      ],
      "abstract": "Formation of A Nuclear Star Cluster Through A Merger Event In The Low Surface Brightness Galaxy AGC 223218 Tian-Wen Cao, Zi-Qi Chen, Zi-Jian Li, Cheng Cheng, Gaspar Galaz, Venu M. Kalari, Jun-feng Wang, Chun-Yi Zhang, Pei-Bin Chen, Meng-Ting Shen, Hong Wu 11 pages, 8 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We present the properties of the nuclear star cluster (NSC) in the low surface brightness galaxy AGC 223218. The disk of the galaxy can be modeled using two S$\\acute{\\rm e}$rsic components with distinct central positions: one representing the inner bright disk and the other corresponding to the extended outer disk. We estimate the stellar masses of the NSC and the host galaxy using two methods: spectral energy distribution (SED) fitting and mass-to-light versus color relations (MLCRs). The stellar mass ratio of the NSC to AGC 223218 is 0.094 based on the SED method and 0.072 using MLCRs. The NSC presents a younger stellar population and a lower [Fe/H] value than the host, as determined from SDSS and LAMOST spectra analysis using pPXF fitting. AGC 223218 is located at the boundary between the Seyfert and star-forming regions in the [SII]-BPT diagram, whereas in the [NII]-BPT diagram, it falls in the track of star-forming SDSS galaxies. This suggests the presence of strong shocks in AGC 223218. We propose that the NSC in AGC 223218 may have formed as a result of a merger event. Furthermore, the observed X-ray luminosity of AGC 223218 with eROSITA is two orders of magnitude higher than the expected X-ray luminosity from X-ray binaries, suggesting the presence of an intermediate-mass black hole (IMBH) in the NSC. To account for the observed X-ray luminosity, we estimate the IMBH accretion rate to be approximately 0.001.",
      "pdf_url": "https://arxiv.org/pdf/2510.06668.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06681",
      "title": "The Star-forming Main Sequence and Bursty Star-formation Histories at $z>1.4$ in JADES and AURORA",
      "authors": [
        "Leonardo Clarke",
        "Alice E. Shapley",
        "Natalie Lam",
        "Michael W. Topping",
        "Gabriel B. Brammer",
        "Ryan L. Sanders",
        "Naveen A. Reddy",
        "Shreya Karthikeyan"
      ],
      "abstract": "The Star-forming Main Sequence and Bursty Star-formation Histories at $z>1.4$ in JADES and AURORA Leonardo Clarke, Alice E. Shapley, Natalie Lam, Michael W. Topping, Gabriel B. Brammer, Ryan L. Sanders, Naveen A. Reddy, Shreya Karthikeyan 40 pages, 13 figures, 3 tables. Submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) We analyze JWST spectroscopic and HST+JWST photometric observations of 659 star-forming galaxies at $1.4 < z < 9$ from DR3 of the JADES survey and the AURORA Cycle 1 program. We measure the star-forming main sequence (SFMS) for galaxies above $10^{8.5}\\rm\\ M_\\odot$ where the sample is largely representative, estimating star-formation rates (SFRs) using the H$\\alpha$ line flux and rest-frame far UV (1600Å) continuum measurements, each independently corrected for dust attenuation. We find that the intrinsic, measurement-error-subtracted scatter in the SFMS ($\\sigma_{\\rm int}$) increases with decreasing stellar mass for the H$\\alpha$-based SFMS, and we find no mass dependence of $\\sigma_{\\rm int}$ in the UV-based SFMS. Additionally, we find that $\\sigma_{\\rm int}$ decreases with increasing redshift, from $0.36^{+0.02}_{-0.02}$ dex to $0.22^{+0.08}_{-0.07}$ dex (H$\\alpha$ SFMS), and from $0.28^{+0.02}_{-0.02}$ dex to $0.20^{+0.08}_{-0.07}$ dex (UV SFMS) between $z\\sim2$ and $z\\sim 6.5$. We also measure the redshift evolution of the specific SFR and find that, assuming $\\rm sSFR\\propto (1+z)^\\gamma$, $\\gamma=1.89^{+0.16}_{-0.15}$ for the H$\\alpha$-based SFMS, and $\\gamma=1.36^{+0.13}_{-0.13}$ for the UV-based SFMS. Analyzing the observed H$\\alpha$/UV luminosity ratios and star-formation histories from the {\\sc prospector} fitting code, we find that 41--60\\% of the sample is inconsistent with having a constant star-formation history. Finally, we find tentative evidence for shorter SFR burst timescales with increasing redshift based on the distribution of $\\rm L_{H\\alpha}/\\nu L_{\\nu,1600}$ vs. $\\Delta\\rm \\log(L_{H\\alpha})$. Taken together, these results are consistent with theoretical predictions of bursty star formation in the early Universe and provide valuable constraints for theoretical models of galaxy evolution.",
      "pdf_url": "https://arxiv.org/pdf/2510.06681.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06713",
      "title": "Spectropolarimetry of NGC 1275 reveals a narrow-line radio galaxy with polarization parallel to its radio jet axis",
      "authors": [
        "F. Marin",
        "T. Pursimo",
        "I. Liodakis",
        "E. Lindfors",
        "J. Biedermann",
        "D. Hutsemékers",
        "M. Turkki"
      ],
      "abstract": "Spectropolarimetry of NGC 1275 reveals a narrow-line radio galaxy with polarization parallel to its radio jet axis F. Marin, T. Pursimo, I. Liodakis, E. Lindfors, J. Biedermann, D. Hutsemékers, M. Turkki 4 pages, 1 figure, 2 tables, accepted for publication as a Letter in A&A Astrophysics of Galaxies (astro-ph.GA) Concomitant with the Imaging X-ray Polarimetry Explorer (IXPE) observation of the Perseus cluster, we obtained optical spectropolarimetry of its central active galactic nucleus, NGC 1275, using the Alhambra Faint Object Spectrograph and Camera (ALFOSC) on the Nordic Optical Telescope (NOT). While the total-light spectrum confirms its edge-on, core obscured (type-2) classification, the polarized spectrum shows a polarization angle aligned with the arcsecond radio jet axis -- an exceptional behavior for type-2 objects. Our polarization analysis also reveals wavelength-dependent linear polarization at level 2-3% in the continuum, likely rising from a combination of variable syn",
      "pdf_url": "https://arxiv.org/pdf/2510.06713.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06726",
      "title": "3D B-fieLds in the InterStellar medium and Star-forming regions (3D-BLISS): I. Using Starlight Polarization in Massive IRDC Filament G11.11-0.12",
      "authors": [
        "Bao Truong",
        "Thiem Hoang",
        "Nguyen Bich Ngoc",
        "Nguyen Chau Giang",
        "Le Ngoc Tram",
        "Ngan Le"
      ],
      "abstract": "3D B-fieLds in the InterStellar medium and Star-forming regions (3D-BLISS): I. Using Starlight Polarization in Massive IRDC Filament G11.11-0.12 Bao Truong, Thiem Hoang, Nguyen Bich Ngoc, Nguyen Chau Giang, Le Ngoc Tram, Ngan Le 25 pages, 16 figures, 3 tables, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Three-dimensional magnetic fields (3D B-fields) are essential to understand the formation and evolution of the interstellar medium and multi-scale star formation; however, the accurate measurement of 3D B-fields is still challenging. The angle of dust polarization by magnetically aligned grains provides the projected B-fields onto the plane-of-sky, while the degree of dust polarization provides the B-field's inclination angles with respect to the line-of-sight. Our previous theoretical studies proposed a new method of probing 3D B-fields using dust polarization combined with the Radiative Torque (RAT) alignment theory and demonstrated the accurate inference of B-field inclination angles using synthetic polarization data. In this paper, we report the first application of the new technique to study 3D B-fields and dust properties in the G11.11-0.12 filament (hereafter G11) from starlight polarization observations taken by ISRF/SIRPOL at $2.19\\,\\rm\\mu m$. Using both observed starlight polarization and optical dust extinction curve from Gaia mission, we constrained the maximum grain size of $0.25\\,\\rm\\mu m$ and the grain elongation with an axial ratio of $s\\gtrsim 1.4$ in the outer regions of G11. We calculated the alignment properties in the G11 by using the \\textsc{DustPOL\\_py} code based on the RAT theory. The B-field's inclination angles are then inferred from the observed starlight polarization efficiency when the grain alignment is included, showing the inclined B-fields in the G11 with a mean angle of $\\sim 50$ degrees. From these inferred inclination angles, we found evidence of the local 3D arc-shaped B-field structure toward the sightline. These findings are important for fully understanding 3D B-field's roles in the formation and evolution of massive filamentary clouds.",
      "pdf_url": "https://arxiv.org/pdf/2510.06726.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06752",
      "title": "Warm absorber outflows in radio-loud active galactic nucleus 3C~59",
      "authors": [
        "Yijun Wang",
        "Tao Wang",
        "Junjie Mao",
        "Yerong Xu",
        "Zhicheng He",
        "Zheng Zhou",
        "Chen Li",
        "Yongquan Xue",
        "Jiayi Chen",
        "Fangzheng Shi",
        "Missagh Mehdipour"
      ],
      "abstract": "Warm absorber outflows in radio-loud active galactic nucleus 3C~59 Yijun Wang, Tao Wang, Junjie Mao, Yerong Xu, Zhicheng He, Zheng Zhou, Chen Li, Yongquan Xue, Jiayi Chen, Fangzheng Shi, Missagh Mehdipour 15 pages, 9 figures, 2 tables. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) Both jets and ionized outflows in active galactic nuclei (AGNs) are thought to play important roles in affecting the star formation and evolution of host galaxies, but their relationship is still unclear. As a pilot study, we performed a detailed spectral analysis for a radio-loud (RL) AGN 3C~59 ($z=0.1096$) by systematically considering various factors that may affect the fitting results, and thereby establishing a general spectral fitting strategy for subsequent research with larger sample. 3C~59 is one rare target for simultaneously studying jets and warm absorbers (WAs) that is one type of ionized outflows. Based on the multi-wavelength data from near-infrared (NIR) to hard X-ray bands detected by DESI, GALEX, and XMM-Newton, we used SPEX code to build broadband continuum models and perform photoionization modeling with PION code to constrain the physical parameters of WAs in 3C~59. We found two WAs with ionization parameter of $\\log [\\xi/(\\rm{erg\\ cm\\ s}^{-1})] = 2.65^{+0.10}_{-0.09}$ and $1.65\\pm 0.11$, respectively, and their outflowing velocities are $v_{\\rm out} = -528^{+163}_{-222}\\ \\rm{km\\ s}^{-1}$ and $-228^{+121}_{-122}\\ \\rm{km\\ s}^{-1}$, respectively. These WAs are located between outer torus and narrow (emission-)line region, and their positive $v_{\\rm out}$-$\\xi$ relation can be explained by the radiation-pressure-driven mechanism. We found that the estimations of these physical properties are affected by the different spectral fitting strategies, such as the inclusion of NIR to ultra-violet data, the choice of energy range of spectrum, or the composition of the spectral energy distribution. Based on the same fitting strategy, this work presents a comparative study of outflow driven mechanism between a RL AGN (3C 59) and a radio-quiet AGN (NGC 3227), which suggests a similar driven mechanism of their WA outflows and a negligible role of jets in this process.",
      "pdf_url": "https://arxiv.org/pdf/2510.06752.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06753",
      "title": "A Sample of HeII $λ$4686 \"Changing-Look\" Quasars",
      "authors": [
        "Wentao Lu",
        "Jun-Xian Wang"
      ],
      "abstract": "A Sample of HeII $λ$4686 \"Changing-Look\" Quasars Wentao Lu, Jun-Xian Wang 18 pages, 13 figures. Accepted by ApJ Astrophysics of Galaxies (astro-ph.GA) We present the first systematic search for \"changing-look\" (\"CL\") behavior in the broad He ii $\\lambda$4686 emission line in quasars, utilizing repeated spectroscopy from the Sloan Digital Sky Survey (SDSS). The He ii line, originating from high-ionization gas and powered by extreme ultraviolet photons, serves as a sensitive tracer of changes in the ionizing continuum. After applying strict spectral selection criteria and visual inspection to a parent sample of over 9,000 quasars with multi-epoch spectra, we identify a sample of 34 He ii \"changing-look\" quasars that show a significant appearance or disappearance of the broad He ii $\\lambda$4686 line. Compared with previously known H$\\beta$ \"CL\" quasars, the He ii \"CL\" sample exhibits similarly strong continuum variability and broad-line flux changes, yet shows a preference for higher Eddington ratios and lower host-galaxy contamination. These results highlight the value of He ii line in studying the central variable engines of AGNs and uncovering a more complete census of extreme quasar variability. A comparison with H$\\beta$ \"CL\" further underscores the profound selection biases inherent in \"changing-look\" studies, especially those associated with line strength, host-galaxy contamination, and spectral signal-to-noise ratio.",
      "pdf_url": "https://arxiv.org/pdf/2510.06753.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06812",
      "title": "JWST observations of photodissociation regions: II. Warm molecular Hydrogen spectroscopy in the Horsehead nebula",
      "authors": [
        "M. Zannese",
        "P. Guillard",
        "A. Abergel",
        "E. Habart",
        "P. Dell'Ova",
        "B. Trahin",
        "J. Le Bourlot",
        "K. Misselt",
        "D. Van De Putte",
        "A. N. Witt",
        "K. D. Gordon",
        "A. Noriega-Crespo",
        "M. Baes",
        "P. Bouchet",
        "B. R. Brandl",
        "M. Elyajouri",
        "O. Kannavou",
        "P. Klassen",
        "N. Ysard"
      ],
      "abstract": "JWST observations of photodissociation regions: II. Warm molecular Hydrogen spectroscopy in the Horsehead nebula M. Zannese, P. Guillard, A. Abergel, E. Habart, P. Dell'Ova, B. Trahin, J. Le Bourlot, K. Misselt, D. Van De Putte, A. N. Witt, K. D. Gordon, A. Noriega-Crespo, M. Baes, P. Bouchet, B. R. Brandl, M. Elyajouri, O. Kannavou, P. Klassen, N. Ysard Accepted in Astronomy & Astrophysics on the 01/10/2025 Astrophysics of Galaxies (astro-ph.GA) H2 is the most abundant molecule in the interstellar medium and is a useful tool to study photodissociation regions, where radiative feedback from massive stars on molecular clouds is dominant. The James Webb Space Telescope, with its high spatial resolution, sensitivity, and wavelength coverage provides unique access to the detection of most of H2 lines and the analysis of its spatial morphology. Our goal is to use H2 line emission detected with the JWST in the Horsehead nebula to constrain the physical parameters (e.g., extinction, gas temperature, thermal pressure) throughout the PDR and its geometry. The study of H2 morphology reveals that FUV-pumped lines peak closer to the edge of the PDR than thermalized lines. From H2 lines, we estimate the value of extinction throughout the PDR. We find that AV is increasing from the edge of the PDR to the second and third H2 filaments. Then, we study the H2 excitation in different regions across the PDR. The temperature profile shows that the observed gas temperature is quite constant throughout the PDR, with a slight decline in each of the dissociation fronts. This study also reveals that the OPR is far from equilibrium. We observe a spatial separation of para and ortho rovibrational levels, indicating that efficient ortho-para conversion and preferential ortho self-shielding are driving the spatial variations of the OPR. Finally, we derive a thermal pressure in the first filament around P > 6x10$^6$ K cm$^{-3}$, about ten times higher than that of the ionized gas. We highlight that template stationary 1D PDR models cannot account for the intrinsic 2D structure and the very high temperature observed in the Horsehead nebula. We argue the highly excited, over-pressurized H2 gas at the edge of the PDR interface could originate from the mixing between the cold and hot phase induced by the photo-evaporation of the cloud.",
      "pdf_url": "https://arxiv.org/pdf/2510.06812.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06853",
      "title": "MEGATRON: The environments of Population III stars at Cosmic Dawn and their connection to present day galaxies",
      "authors": [
        "Anatole Storck",
        "Harley Katz",
        "Julien Devriendt",
        "Adrianne Slyz",
        "Corentin Cadiou",
        "Nicholas Choustikov",
        "Martin P. Rey",
        "Aayush Saxena",
        "Oscar Agertz",
        "Taysun Kimm"
      ],
      "abstract": "MEGATRON: The environments of Population III stars at Cosmic Dawn and their connection to present day galaxies Anatole Storck, Harley Katz, Julien Devriendt, Adrianne Slyz, Corentin Cadiou, Nicholas Choustikov, Martin P. Rey, Aayush Saxena, Oscar Agertz, Taysun Kimm 14 pages, 5 figures, to be submitted to MNRAS, comments are welcome! Astrophysics of Galaxies (astro-ph.GA) We present results of Pop. III formation in the MEGATRON suite of simulations, which self-consistently follows radiation and non-equilibrium chemistry, and resolves gas at near-pc resolution of a Milky Way-mass halo at Cosmic Dawn. While the very first Pop. III stars form in halos with masses well below the atomic cooling limit, whose cooling is dominated by molecular hydrogen, the majority of Pop. III stars form in more massive systems above the $10^4$~K atomic cooling threshold. The shift in cooling regime of halos hosting new Pop. III stars occurs within $100$ Myr of the first Pop. III star as the Lyman-Werner (LW) background rapidly increases to $10^{-21}\\,\\rm erg\\,s^{-1}\\,cm^{-2}\\,Hz^{-1}\\,sr^{-1}$. We find that the global Pop. III star formation rate stabilizes to a value of $10^{-3}\\,\\rm M_\\odot\\,yr^{-1}$ at $z=20$. Among the three processes that quench Pop. III star formation in mini-halos, the LW background, gas starvation, and external chemical enrichment, the LW background is most important. A small fraction of haloes undergo multiple episodes of Pop. III star formation when the earlier forming stars all directly collapse to black holes. If the halos become massive enough, they can form up to $\\sim100$ Pop. III stars in a single burst, which may be observable by JWST with moderate gravitational lensing. Pop. III stars form at a wide range of distances from UV-bright galaxies, with only $0.06\\%$ of Pop. III stars forming within the virial radius of galaxies with $M_{\\rm UV} < -17$. Finally, by tracking Pop. III star remnants down to $z=0$, we find that $75-80\\,$% reside in the stellar halo of our simulated Milky Way analogue, while the remainder are gravitationally bound to lower-mass systems, including satellite halos.",
      "pdf_url": "https://arxiv.org/pdf/2510.06853.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06898",
      "title": "Unlocking AGN Variability with Custom ZTF Photometry for High-Fidelity Light Curves and Robust Selection",
      "authors": [
        "P. Arévalo , P. Sánchez-Sáez , B. Sotomayor , P. Lira F. E. Bauer , S. Ríos U. de Valparaíso, Chile, ESO, Garching, U. de Chile, U. de Tarapacá, Chile)"
      ],
      "abstract": "Unlocking AGN Variability with Custom ZTF Photometry for High-Fidelity Light Curves and Robust Selection P. Arévalo (1), P. Sánchez-Sáez (2), B. Sotomayor (2), P. Lira (3)F. E. Bauer (4), S. Ríos (3) ((1) U. de Valparaíso, Chile, (2) ESO, Garching, (3) U. de Chile, (4) U. de Tarapacá, Chile) Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) (Abridged)We explore the potential of optical variability selection methods to identify AGN, including those challenging to detect with conventional techniques. Using the unprecedented combination of depth, sky coverage, and cadence of the ZTF survey, we target even starlight-dominated AGN, known for their redder colours, weaker variability signals, and difficult nuclear photometry due to their resolved hosts. We perform aperture photometry on ZTF reference-subtracted images for 40 million sources across 8,000 deg^2, assemble light curves and classify objects employing an RF algorithm into 14 classes, including 341,938 candidate AGN. We compare variability metrics derived from our photometry to those obtained from ZTF Data Release light curves (DR11-psf), to assess the impact of our analysis. We find that the fraction of low-z quiescent galaxies exhibiting significant variability drops dramatically (from 98\\% of the sample to 7\\%) when replacing the DR11-psf light curves with our difference image, aperture photometry (DI-Ap) version. The overall number of variable low-z AGN remains high (99\\% when using DR11-psf lightcurves, 83\\% when using DI-Ap), however, implying that our photometry can detect the fainter variability in host dominated AGN. The classifier effectively distinguishes between AGN and other sources, demonstrating high recovery rates even for AGN in resolved nearby galaxies. AGN candidates in eROSITA's eFEDS field, detected in X-rays and bright enough for ZTF optical observations, were classified as AGN (79\\%) and non-variable galaxies (20\\%). These groups show a 2 dex difference in X-ray luminosity but not in X-ray flux. A significant fraction of X-ray AGN are optically too faint for ZTF, and conversely, a quarter of ZTF AGN in the eFEDS area lack X-ray detections, highlighting a wide range of X-ray-to-optical flux ratios in AGN.",
      "pdf_url": "https://arxiv.org/pdf/2510.06898.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06942",
      "title": "Simulations of Globular Cluster Evolution with Multiple Stellar Populations",
      "authors": [
        "Mirek Giersz",
        "Abbas Askar",
        "Arkadiusz Hypki",
        "Jongsuk Hong",
        "Grzegorz Wiktorowicz",
        "Lucas Hellstrom"
      ],
      "abstract": "Simulations of Globular Cluster Evolution with Multiple Stellar Populations Mirek Giersz, Abbas Askar, Arkadiusz Hypki, Jongsuk Hong, Grzegorz Wiktorowicz, Lucas Hellstrom Astrophysics of Galaxies (astro-ph.GA) The formation of stars with light-element abundance variations in globular clusters and the subsequent dynamical evolution of these multiple populations remains an open question. One of the most widely discussed is the AGB scenario, in which chemically processed material from the envelopes of AGB stars mixes with re-accreted primordial gas flowing into the center of the cluster. Based on this scenario, more than two hundred MOCCA simulations of cluster evolution have been carried out, incorporating additional physical processes related to the external environment of globular clusters and the initial properties of multiple stellar populations. Analysis of the simulations shows that most observed properties of multiple stellar populations and the global parameters of Milky Way clusters are well reproduced, with the exception of the correlation between cluster mass and the fraction of second-population stars. We present a speculative scenario of globular cluster evolution that may account for the observed properties of Milky Way clusters, including the correlation between cluster mass and the fraction of enriched stars. The scenario further predicts that, under certain conditions, the pristine first population can be more centrally concentrated than the enriched second population, as observed in some clusters. \\end{abstract",
      "pdf_url": "https://arxiv.org/pdf/2510.06942.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07005",
      "title": "Machine Learning Techniques to Distinguish Giant Stars from Dwarf Stars Using Only Photometry -- Pushing Redwards",
      "authors": [
        "Keyi Ding",
        "Carrie Filion",
        "Rosemary F.G. Wyse",
        "Evan N. Kirby",
        "Itsuki Ogami",
        "Masashi Chiba",
        "Yutaka Komiyama",
        "László Dobos",
        "Alexander S. Szalay"
      ],
      "abstract": "Machine Learning Techniques to Distinguish Giant Stars from Dwarf Stars Using Only Photometry -- Pushing Redwards Keyi Ding, Carrie Filion, Rosemary F.G. Wyse, Evan N. Kirby, Itsuki Ogami, Masashi Chiba, Yutaka Komiyama, László Dobos, Alexander S. Szalay 21 pages, 13 figures, accepted to AJ Astrophysics of Galaxies (astro-ph.GA) We present our photometric method, which combines Subaru/HSC $NB515$, g, and i band filters to distinguish giant stars in Local Group galaxies from Milky Way dwarf contamination. The $NB515$ filter is a narrow-band filter that covers the MgI+MgH features at $5150$ Å, and is sensitive to stellar surface gravity. Using synthetic photometry derived from large empirical stellar spectral libraries, we model the $NB515$ filter's sensitivity to stellar atmospheric parameters and chemical abundances. Our results demonstrate that the $NB515$ filter effectively separates dwarfs from giants, even for the reddest and coolest M-type stars. To further enhance this separation, we develop machine learning models that improve the classification on the two-color ($g-i$, $NB515-g$) diagram. We apply these models to photometric data from the Fornax dwarf spheroidal galaxy and two fields of M31, successfully identifying red giant branch stars in these galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.07005.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07021",
      "title": "The formation of Gaia BH3",
      "authors": [
        "Daniel Marín Pina",
        "Mark Gieles",
        "Sara Rastello",
        "Giuliano Iorio"
      ],
      "abstract": "Daniel Marín Pina, Mark Gieles, Sara Rastello, Giuliano Iorio 4 pages, 2 figures. Accepted for publication in IAU Conference proceedings of IAU Symposium 398 & MODEST-25: Compact Objects and Binaries in Dense Stellar Systems Astrophysics of Galaxies (astro-ph.GA) The Gaia collaboration announced the discovery of a massive black hole (BH) with a low-mass giant star companion, Gaia BH3, located in the ED-2 stellar stream. The properties of Gaia BH3 bridge the gap between known Milky Way BHs and extragalactic BHs found with gravitational waves (GWs). We aim to determine the most likely formation scenario for Gaia BH3 in the progenitor cluster of the ED-2 stream. We perform $N$-body simulations of that progenitor cluster and find that, most likely, Gaia BH3 formed from a stellar binary that formed during cluster formation, which then underwent multiple dynamical interactions that significantly altered its properties, including exchanging the companion star. We highlight the importance of cluster dynamics and discard a formation scenario where it evolved in quasi-isolation.",
      "pdf_url": "https://arxiv.org/pdf/2510.07021.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.07256",
      "title": "Beyond diagnostic-diagrams: A critical exploration on the classification of ionization processes",
      "authors": [
        "S. F. Sánchez",
        "C. Muñoz-Tuñón",
        "J. Sánchez Almeida",
        "O. González-Martín",
        "E. Pérez"
      ],
      "abstract": "Beyond diagnostic-diagrams: A critical exploration on the classification of ionization processes S. F. Sánchez, C. Muñoz-Tuñón, J. Sánchez Almeida, O. González-Martín, E. Pérez 17 pages, 9 figures, accepted for publishing in A&A Astrophysics of Galaxies (astro-ph.GA) Optical emission-line diagnostic diagrams, such as the classical BPT, are widely used to identify ionisation mechanisms in galaxies but often suffer from degeneracies, especially when multiple sources coexist. We critically evaluate the effectiveness of these diagnostics in distinguishing star-forming galaxies, retired galaxies (RGs), and active galactic nuclei (AGNs), and propose refined methods to reduce misclassifications. Using a large sample of nearby galaxies from the NASA-Sloan Atlas cross-matched with SDSS spectroscopy, we define representative subsamples of late-type/star-forming galaxies, early-type/RGs, and multiwavelength-selected AGNs. Their distributions are analysed across traditional and modern diagnostics, including WHaN, WHaD, and the newly introduced WHaO diagram, which combine H{\\alpha} equivalent width with [N II]/H{\\alpha}, {\\sigma}(H{\\alpha}), and [O III]/[O II], respectively. Quantitative comparisons reveal that classical BPT diagrams overestimate star-forming galaxies by ~10% and misclassify up to 45% of AGNs and nearly all RGs. Diagnostics incorporating EW(H{\\alpha}) achieve improved accuracy, reducing misclassifications to {\\sim} 20\\ % for AGNs and {\\sim} 15\\% for RGs. A revised classification scheme based on EW(H{\\alpha}) thresholds and consistent WHaD/WHaO results yields the highest purity (8-25% misclassifications) and better reflects underlying physical conditions. Our analysis demonstrates that BPT-based methods fail to reliably separate ionisation mechanisms, particularly in galaxies hosting weak AGNs or evolved stellar populations. Updated EW(H{\\alpha})-based diagnostics offer a more accurate framework for studying galaxy ionisation and should replace traditional schemes in future population studies.",
      "pdf_url": "https://arxiv.org/pdf/2510.07256.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07303",
      "title": "Confirming Near- to Mid-IR Photometrically-Identified Obscured AGNs in the JWST era",
      "authors": [
        "George H. Rieke",
        "Yang Sun",
        "Jianwei Lyu",
        "Christopher N. A. Willmer",
        "Yongda Zhu",
        "Pierluigi Rinaldi",
        "Meredith A. Stone",
        "Kevin N. Hainline",
        "Pablo G. Perez-Gonzalez"
      ],
      "abstract": "Confirming Near- to Mid-IR Photometrically-Identified Obscured AGNs in the JWST era George H. Rieke, Yang Sun, Jianwei Lyu, Christopher N. A. Willmer, Yongda Zhu, Pierluigi Rinaldi, Meredith A. Stone, Kevin N. Hainline, Pablo G. Perez-Gonzalez Astrophysics of Galaxies (astro-ph.GA) We evaluate the underlying assumptions for the identification of Active Galactic Nuclei (AGNs) through near- and mid-infrared photometry and spectral energy distribution (SED) fitting out to z ~ 3. For massive galaxies, log(M) > 9.5, our high resolution spectra of the rest optical range generally confirm the results of SED fitting, which relies primarily on excesses above the stellar emission between 1 and 6 microns to identify AGN. However, the method is undermined if the redshift used for the SED fitting is incorrect. Low mass galaxies, log(M) < 9:5, can contain relatively warm dust that emits in the 4 - 6 micron range. We show that the potential contamination of AGN samples by purely star forming low-mass galaxies can be avoided by the use of the infrared properties of Haro 11 as a limiting star-forming SED template. However, relatively few star forming galaxies emit as strongly in the 3 - 6 micron range as this template, so this could result in missing some obscured AGNs to avoid a minor contamination. Including the behavior of the galaxies at rest lamda ~ 13.5 microns can mitigate this problem and yield more complete samples of bona fide AGN. JWST/MIRI supports this approach out to z ~ 0.6.",
      "pdf_url": "https://arxiv.org/pdf/2510.07303.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06320",
      "title": "A Deep Look into the Intermediate-Age Open Cluster NGC 2506: What Binary Systems Reveal About Cluster Distance and Age",
      "authors": [
        "K. Yakut",
        "B. Kalomeni",
        "S. Rappaport",
        "Veselin Kostov"
      ],
      "abstract": "A Deep Look into the Intermediate-Age Open Cluster NGC 2506: What Binary Systems Reveal About Cluster Distance and Age K. Yakut, B. Kalomeni, S. Rappaport, Veselin Kostov 12 pages, 7 figures, 5 tables, Accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Using high-precision observations from the space-based \\textit{Gaia} and \\textit{TESS} missions, complemented by ground-based spectroscopic data and multi-band photometric surveys, we perform a detailed investigation of the Galactic open cluster NGC~2506. We present a new analysis of the intermediate-age open cluster NGC~2506, using joint fits to the radial velocities (RVs) and spectral energy distributions (SEDs) of five double-lined binary systems, including two eclipsing binaries. The analysis yields self-consistent estimates of the cluster's age, distance, and extinction, based on 18 free parameters: 10 stellar masses, 5 orbital inclinations, and common values for age, distance, and $A_V$. The SED fitting incorporates stellar isochrones, and the resulting parameters are examined through HR diagrams (R--$T_{\\rm eff}$, R--M, and M--$T_{\\rm eff}$) to assess evolutionary consistency. The age we derive for the cluster is $1.94 \\pm 0.03$ Gyr for an assumed [Fe/H] = -0.30, and a fitting formula is given for extrapolation to other metallicities. The distance we find from the SED fitting is $3189 \\pm 53$ pc, and this is to be compared with our own inference from the Gaia data which is $3105 \\pm 75$ pc, based on 919 stars identified as cluster members. Our results demonstrate the power of binary systems in tightly constraining cluster-wide age and distance at this evolutionary stage. This approach represents one of the most accurate characterizations of an intermediate-age open cluster using multiple binary systems.",
      "pdf_url": "https://arxiv.org/pdf/2510.06320.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06630",
      "title": "A chemodynamical study of $r$-process-enhanced stars",
      "authors": [
        "Pallavi Saraf",
        "Thirupathi Sivarani",
        "Carlos Allende Prieto",
        "Shashikiran Ganesh",
        "Drisya Karinkuzhi"
      ],
      "abstract": "A chemodynamical study of $r$-process-enhanced stars Pallavi Saraf (PRL), Thirupathi Sivarani, Carlos Allende Prieto, Shashikiran Ganesh, Drisya Karinkuzhi 10 pages, 8 figures, Submitted to Journal to Astrophysics and Astronomy Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The $r$-process enrichment in the Galaxy still remains elusive with regard to its nucleosynthesis conditions and the astrophysical sites where it occurs. As part of ongoing efforts to pinpoint the origin of chemically peculiar $r$-process-enhanced (RPE) stars, we concentrate in this study on the kinematics of RPE stars to investigate possible variations in the $r$-process enrichment among the Galactic components. We calculate the orbital parameters of a sample of 472 metal-poor RPE stars and associate them to the Galactic bulge, disk and halo populations using a physically motivated classification based on apocenter distance and maximum absolute vertical height of the orbit. We show that the Toomre diagram does not properly separate stars in the disk and halo components when they are on highly eccentric and/or retrograde orbits. The Galactic disk and halo share a similar fraction of RPE stars, in contrast to the earlier perception that the majority of RPE stars belong to the halo. We find that the stars most likely to be accreted belong to the halo. However, 3/4 of the stars lie in a mixed-zone. The inner disk, inner halo and outer halo stars exhibit similar abundance trends for the n-capture elements.",
      "pdf_url": "https://arxiv.org/pdf/2510.06630.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06771",
      "title": "Low-noise Fourier Transform Spectroscopy Enabled by Superconducting On-Chip Filterbank Spectrometers",
      "authors": [
        "Chris S. Benson",
        "Peter S. Barry",
        "Patrick Ashworth",
        "Harry Gordon-Moys",
        "Kirit S. Karkare",
        "Izaak Morris",
        "Gethin Robson"
      ],
      "abstract": "Low-noise Fourier Transform Spectroscopy Enabled by Superconducting On-Chip Filterbank Spectrometers Chris S. Benson, Peter S. Barry, Patrick Ashworth, Harry Gordon-Moys, Kirit S. Karkare, Izaak Morris, Gethin Robson Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Detectors (physics.ins-det) Historically employed spectroscopic architectures used for large field of view mapping spectroscopy in millimetere and sub-millimetre astronomy suffer from significant drawbacks. On-chip filterbank spectrometers are a promising technology in this respect; however, they must overcome an orders-of-magnitude increase in detector counts, efficiency loss due to dielectric properties, and stringent fabrication tolerances that currently limit scaling to resolutions of order 1000 over a large array. We propose coupling a medium-resolution Fourier transform spectrometer to a low-resolution filterbank spectrometer focal plane, which serves as a post-dispersion element. In this arrangement, medium resolution imaging spectroscopy is provided by the Fourier transform spectrometer, while the low resolution filterbank spectrometer serves to decrease the photon noise inherent in typical broadband Fourier transform spectrometer measurements by over an order of magnitude. This is achieved while maintaining the excellent imaging advantages of both architectures. We present predicted mapping speeds for a filterbank-dispersed Fourier transform spectrometer from a ground-based site and a balloon-borne platform. We also demonstrate the potential that an instrument of this type has for an R~1000 line intensity mapping experiment using the James Clerk Maxwell Telescope as an example platform. We demonstrate that a filterbank-dispersed Fourier transform spectrometer would be capable of R~1000 measurements of CO power spectra with a signal-to-noise ratio of 10--100 with surveys of $10^5$--$10^6$ spectrometer hours.",
      "pdf_url": "https://arxiv.org/pdf/2510.06771.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07163",
      "title": "Disk fraction among free-floating planetary-mass objects in Upper Scorpius",
      "authors": [
        "Tommy Rodrigues",
        "Hervé Bouy",
        "Sean N. Raymond",
        "Eduardo L. Martín",
        "Emmanuel Bertin",
        "Javier Olivares",
        "David Barrado",
        "Núria Huélamo",
        "Motohide Tamura",
        "Núria Miret Roig",
        "Phillip A. B. Galli",
        "Jean-Charles Cuillandre"
      ],
      "abstract": "Disk fraction among free-floating planetary-mass objects in Upper Scorpius Tommy Rodrigues, Hervé Bouy, Sean N. Raymond, Eduardo L. Martín, Emmanuel Bertin, Javier Olivares, David Barrado, Núria Huélamo, Motohide Tamura, Núria Miret Roig, Phillip A. B. Galli, Jean-Charles Cuillandre 16 pages, 5 tables, 20 figures, accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) Free-floating planetary-mass objects (FFPs) have been detected through direct imaging within several young, nearby star-forming regions. The properties of circumstellar disks around these objects may provide a valuable probe into their origin, but is currently limited by the small sizes of the sample explored. We aim to perform a statistical study of the occurrence of circumstellar disks down to the planetary-mass regime. We performed a systematic survey of disks among the population identified in the 5-10 Myr-old Upper Scorpius association (USC), restricted to members outside the younger, embedded Ophiuchus region and with estimated masses below 105 M_Jup. We took advantage of unWISE photometry to search for mid-infrared excesses in the WISE (W1-W2) color. We implemented a Bayesian outlier detection method that models the photospheric sequence and computes excess probabilities for each object, enabling statistically sound estimation of disk fractions. We explore disk fractions across an unprecedentedly fine mass grid, reaching down to objects as low as ~6 M_Jup assuming 5 Myr or ~8 M_Jup assuming 10 Myr, thus extending the previous lower boundary of disk fraction studies. Depending on the age, our sample includes between 17 and 40 FFPs. We confirm that the disk fraction steadily rises with decreasing mass and exceeds 30% near the substellar-to-planetary mass boundary at ~13 M_Jup. We find hints of a possible flattening in this trend around 25-45 M_Jup, potentially signaling a transition in the dominant formation processes. This change of trend should be considered with caution and needs to be confirmed with more sensitive observations. Our results are consistent with the gradual dispersal of disks over time, as disk fractions in Upper Scorpius appear systematically lower than those in younger regions.",
      "pdf_url": "https://arxiv.org/pdf/2510.07163.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2405.03769",
      "title": "Tracing satellite planes in the Sculptor group: II. Discovery of five faint dwarf galaxies in the DESI Legacy Survey",
      "authors": [
        "David Martinez-Delgado",
        "Michael Stein",
        "Marcel S. Pawlowski",
        "Joanna D. Sakowska",
        "Dmitry Makarov",
        "Lidia Makarova",
        "Giuseppe Donatiello",
        "Dustin Lang"
      ],
      "abstract": "Tracing satellite planes in the Sculptor group: II. Discovery of five faint dwarf galaxies in the DESI Legacy Survey David Martinez-Delgado, Michael Stein, Marcel S. Pawlowski, Joanna D. Sakowska, Dmitry Makarov, Lidia Makarova, Giuseppe Donatiello, Dustin Lang 10 pages, 6 figures, 4 Tables, submitted to Astronomy and Astrophysics Astrophysics of Galaxies (astro-ph.GA) Although substantial progress has been made in reconciling LCDM simulations with the observed abundance and distribution of satellite galaxies, important tensions persist. Studying satellite systems around spiral galaxies thus remains key in addressing these tensions. In this series of papers we report the first results of an on-going systematic survey of faint dwarf spheroidal galaxies in the vicinity of the bright late-type spiral NGC 253 galaxy, the brightest member of the Sculptor filament located at a distance of 3.7 Mpc. We performed a new NGC 253 satellite search by means of visual inspection using co-added image cutouts reprocessed in the DESI Legacy image surveys, reaching a very low surface brightness regime (28.0--29.0 mag arcsec-2). Five new dwarf galaxy candidates have been discovered in the vicinity of NGC 253, that we named them Do V, Do VI, Do VII, Do VIII and Do IX. Assuming they are associated to NGC 253, their total absolute V-magnitudes fall in the -7 to -9 mag range, which is typical for dwarf satellites in the local Universe. The central surface brightness tend to be extremely low for all the discovered dwarfs and fall roughly in the range of 25--26 mag arcsec-2 in g-band. We present a new list of galaxies located around the giant spiral NGC 253. With the inclusion of these additional satellite candidates, the overall spatial distribution of the system becomes less flattened and is now broadly consistent with analogs drawn from Lambda-CDM expectations. Interestingly, the distribution appears to be rather lopsided. Yet, firm conclusions on the presence of absence of a correlated satellite structure are hampered since distance information is lacking, the census of observed dwarfs in the system remains far from complete, and spectroscopic velocities are not even available for most known satellites.",
      "pdf_url": "https://arxiv.org/pdf/2405.03769.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.18498",
      "title": "The Southern Photometrical Local Universe Survey (S-PLUS): searching for metal-poor dwarf galaxies",
      "authors": [
        "M. Grossi",
        "D. R. Gonçalves",
        "A. C. Krabbe",
        "L. A. Gutiérrez Soto",
        "E. Telles",
        "L. S. Ribeiro",
        "T. Signorini Gonçalves",
        "A. E. de Araujo-Carvalho",
        "A. R. Lopes",
        "A. V. Smith Castelli",
        "M. E. De Rossi",
        "C. Lima-Dias",
        "G. Limberg",
        "C. E. Ferreira Lopes",
        "J. A. Hernandez-Jimenez",
        "P. K. Humire",
        "A. L. Chies-Santos",
        "L. Lomelí-Núñez",
        "S. Torres-Flores",
        "F. R. Herpich",
        "G. B. Oliveira Schwarz",
        "A. Kanaan",
        "C. Mendes de Oliveira",
        "T. Ribeiro",
        "W. Schoenell"
      ],
      "abstract": "The Southern Photometrical Local Universe Survey (S-PLUS): searching for metal-poor dwarf galaxies M. Grossi, D. R. Gonçalves, A. C. Krabbe, L. A. Gutiérrez Soto, E. Telles, L. S. Ribeiro, T. Signorini Gonçalves, A. E. de Araujo-Carvalho, A. R. Lopes, A. V. Smith Castelli, M. E. De Rossi, C. Lima-Dias, G. Limberg, C. E. Ferreira Lopes, J. A. Hernandez-Jimenez, P. K. Humire, A. L. Chies-Santos, L. Lomelí-Núñez, S. Torres-Flores, F. R. Herpich, G. B. Oliveira Schwarz, A. Kanaan, C. Mendes de Oliveira, T. Ribeiro, W. Schoenell 25 pages, 14 figures, ApJ, in press Astrophysics of Galaxies (astro-ph.GA) The metal content of a galaxy's interstellar medium reflects the interplay between different evolutionary processes such as feedback from massive stars and the accretion of gas from the intergalactic medium. Despite the expected abundance of low-luminosity galaxies, the low-mass and low-metallicity regime remains relatively understudied. Since the properties of their interstellar medium resemble those of early galaxies, identifying such objects in the Local Universe is crucial to understand the early stages of galaxy evolution. We used the DR3 catalog of the Southern Photometric Local Universe Survey (S-PLUS) to select low-metallicity dwarf galaxy candidates based on color selection criteria typical of metal-poor, star-forming, low-mass systems. The final sample contains approximately 50 candidates. Spectral energy distribution fitting of the 12 S-PLUS bands reveals that $\\sim$ 60% of the candidates are best fit by models with low stellar metallicities. We obtained long-slit observations with the Gemini Multi-Object Spectrograph to follow-up a pilot sample and confirm whether these galaxies have low metallicities. We find oxygen abundances in the range $7.28<$ 12 + log(O/H) $< 7.82$ (4% to 13% of the solar value), confirming their metal-poor nature. Most targets are outliers in the mass-metallicity relation, i.e. they display a low metal content relative to their observed stellar masses. In some cases, perturbed optical morphologies might give evidence of dwarf-dwarf interactions or mergers. These results suggest that the low oxygen abundances may be associated with an external event causing the accretion of metal-poor gas, which dilutes the oxygen abundance in these systems.",
      "pdf_url": "https://arxiv.org/pdf/2501.18498.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.03683",
      "title": "AGN ruled out as the dominant source of cosmic reionization",
      "authors": [
        "Danyang Jiang",
        "Linhua Jiang",
        "Shengxiu Sun",
        "Weiyang Liu",
        "Shuqi Fu"
      ],
      "abstract": "AGN ruled out as the dominant source of cosmic reionization Danyang Jiang, Linhua Jiang, Shengxiu Sun, Weiyang Liu, Shuqi Fu Published in Nature Astronomy on Oct 7, 2025 Astrophysics of Galaxies (astro-ph.GA) Cosmic reionization represents the latest phase transition in the Universe, when the Lyman continuum (LyC) photons turned the intergalactic medium (IGM) from neutral to highly ionized. It has long been debated whether galaxies or active galactic nuclei (AGNs) are the major source of LyC photons responsible for reionization. Previous observations slightly favored galaxies as the major ionizing source. However, the James Webb Space Telescope (JWST) recently discovered an unexpectedly high density of AGN candidates at high redshift, which has largely enhanced the influence of AGNs. Here we derive a definitive upper bound on the AGN contribution to reionization using the latest JWST data, and conclusively rule out AGNs as the dominant ionizing source during the peak epoch of reionization (EoR). We build a sample of galaxies and AGNs in a specific redshift range $7.15 \\leq z \\leq 7.75$ with a high completeness. Each object is then decomposed into a point-source component and an extended component in their rest-frame far-UV JWST images. We assume all point-source components are AGNs. Our fiducial AGN sample reaches an unprecedentedly low luminosity of $M_{\\rm UV} \\approx -15$ mag. Based on this sample, AGNs can contribute at most one third of the LyC photons budget required at $z\\sim7.5$. Our result implies that galaxies dominate the ionizing source during the EoR.",
      "pdf_url": "https://arxiv.org/pdf/2502.03683.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.01982",
      "title": "Forming the local starburst galaxy Haro 11 through hydrodynamical merger simulations",
      "authors": [
        "Timmy Ejdetjärn",
        "Oscar Agertz",
        "Florent Renaud",
        "Göran Östlin",
        "Alexandra Le Reste",
        "Angela Adamo"
      ],
      "abstract": "Forming the local starburst galaxy Haro 11 through hydrodynamical merger simulations Timmy Ejdetjärn, Oscar Agertz, Florent Renaud, Göran Östlin, Alexandra Le Reste, Angela Adamo 18 pages, 15 figures. Accepted for publication in MNRAS (October 2025) Astrophysics of Galaxies (astro-ph.GA) Haro 11 is a metal-poor, starburst galaxy believed to be the result of an ongoing merger, which is shaping the properties of the galaxy. In this study, we carry out a large suite of numerical simulations of a merger between two disc galaxies, to study possible origins of Haro 11 and understand under which conditions various features of the galaxy are formed. By varying galaxy parameters describing the orbital configurations, masses, and their inclination, we perform a total of $\\sim$500 simulations. We demonstrate that a two-disc galaxy merger reproduces key, observed features of Haro 11, including its morphology, gas kinematics, star formation history, and stellar population ages and masses. In particular, we present a fiducial Haro 11 model that produces the single observed tidal tail, three stellar knots, and inner gas morphology and kinematics. The resulting orbit and galactic morphology are robust against small variations of the initial parameters. By performing mock observations, we compare with the results of observational data and discuss possible origins for various features. Furthermore, we present newly gathered observational data that confirms the presence of a stellar tidal tail with similar length and morphology as our simulations.",
      "pdf_url": "https://arxiv.org/pdf/2503.01982.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.07421",
      "title": "Cosmic Ray Perpendicular Superdiffusion and Parallel Mirror Diffusion in a Partially Ionized and Turbulent Medium",
      "authors": [
        "Yue Hu",
        "Siyao Xu",
        "Alex Lazarian",
        "James M. Stone",
        "Philip F. Hopkins"
      ],
      "abstract": "Cosmic Ray Perpendicular Superdiffusion and Parallel Mirror Diffusion in a Partially Ionized and Turbulent Medium Yue Hu, Siyao Xu, Alex Lazarian, James M. Stone, Philip F. Hopkins 17 pages, 9 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) Understanding cosmic ray (CR) diffusion in a partially ionized medium is both crucial and challenging. In this study, we investigate CR perpendicular superdiffusion and parallel transport in turbulent, partially ionized media using high-resolution 3D two-fluid simulations that treat ions and neutrals separately. We examine the influence of neutral-ion decoupling and the associated damping of turbulence on CR propagation in both transonic and supersonic conditions. Our simulations demonstrate that neutral-ion decoupling significantly damps velocity and magnetic field fluctuations at small scales, producing spectral slopes steeper than those of Kolmogorov and Burgers scaling. In supersonic turbulence, large-scale shock motion is not subject to damping and generates small-scale density enhancements. Moreover, the damping of magnetic field fluctuations substantially decreases pitch-angle scattering, which, however, only slightly affects the CR parallel mean free path $\\lambda_\\|$, due to the nonresonant mirror interactions of CRs. In the direction perpendicular to the mean magnetic field, we identify two regimes of the perpendicular superdiffusion of CRs: a diffusive regime ($\\lambda_\\|<L_{\\rm inj}$, where $L_{\\rm inj}$ is turbulence injection scale) with perpendicular separation of CR proportional to $t^{3/4}$, and a ballistic-like regime ($\\lambda_\\|>L_{\\rm inj}$), with perpendicular separation scaling as $t^{3/2}$. At initially large pitch angles, the effects of magnetic mirroring-naturally arising in magnetohydrodynamic turbulence-become significant, enhancing the confinement of CRs and resulting in $\\lambda_\\|<L_{\\rm inj}$, despite the damping effect. These results imply that large-pitch-angle CRs can be well confined in the cold ISM, such as molecular clouds.",
      "pdf_url": "https://arxiv.org/pdf/2505.07421.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.09123",
      "title": "The hot circumgalactic medium in stacked X-rays: observations vs simulations",
      "authors": [
        "Skylar Grayson",
        "Evan Scannapieco",
        "Johan Comparat",
        "John A. ZuHone",
        "Yi Zhang",
        "Soumya Shreeram",
        "Marcus Bruggen",
        "Esra Bulbul"
      ],
      "abstract": "The hot circumgalactic medium in stacked X-rays: observations vs simulations Skylar Grayson, Evan Scannapieco, Johan Comparat, John A. ZuHone, Yi Zhang, Soumya Shreeram, Marcus Bruggen, Esra Bulbul Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) Current cosmological simulations rely on active galactic nuclei (AGN) feedback to quench star formation and match observed stellar mass distributions, but models for AGN feedback are poorly constrained. The circumgalactic medium (CGM) provides a valuable laboratory to study this process, as its metallicity, temperature, and density distributions are directly shaped by AGN activity. Recent observations from the eROSITA instrument provide constraints on the CGM through measurements of extended soft X-ray emission. In this work, we generate synthetic eROSITA observations from the EAGLE and SIMBA cosmological simulations and compare them to observations of galaxies stacked by stellar mass, halo mass, and star-formation rate. SIMBA outperforms EAGLE in matching observed surface brightness profiles, but neither simulation achieves consistent agreement with observations across the full range of galaxy properties we studied. We find that variations in CGM X-ray emission between simulations are primarily driven by density differences at $R \\lesssim 0.2 R_{200c} $, and temperature and metallicity changes at larger radii. These results highlight the need for further refinement of AGN feedback models in cosmological simulations and demonstrate the power of stacked X-ray observations as a tool for constraining feedback physics.",
      "pdf_url": "https://arxiv.org/pdf/2506.09123.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.10711",
      "title": "Distribution of Europium in The Milky Way Disk; Its Connection to Planetary Habitability and The Source of The R-Process",
      "authors": [
        "Evan M. Carrasco",
        "Matthew Shetrone",
        "Francis Nimmo",
        "Enrico Ramirez-Ruiz",
        "Joel Primack",
        "Natalie M. Batalha"
      ],
      "abstract": "Distribution of Europium in The Milky Way Disk; Its Connection to Planetary Habitability and The Source of The R-Process Evan M. Carrasco, Matthew Shetrone, Francis Nimmo, Enrico Ramirez-Ruiz, Joel Primack, Natalie M. Batalha Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) The energy provided in the radioactive decay of thorium (Th) and uranium (U) isotopes, embedded in planetary mantles, sustains geodynamics important for surface habitability such as the generation of a planetary magnetic dynamo. In order to better understand the thermal evolution of nearby exoplanets, stellar photospheric abundances can be used to infer the material composition of orbiting planets. Here we constrain the intrinsic dispersion of the r-process element europium (Eu) (measured in relative abundance [Eu/H]) as a proxy for Th and U in local F, G, and K type dwarf stars. Adopting stellar-chemical data from two high quality spectroscopic surveys, we have determined a small intrinsic scatter of 0.025 dex in [Eu/H] within the disk. We further investigate the stellar anti-correlation in [Eu/$\\alpha$] vs [$\\alpha$/H] at late metallicities to probe in what regimes planetary radiogenic heating may lead to periods of extended dynamo collapse. We find that only near-solar metallicity stars in the disk have Eu inventories supportive of a persistent dynamo in attendant planets, supporting the notion of a ``metallicity Goldilocks zone'' in the galactic disk. The observed anti-correlation further provides novel evidence regarding the nature of r-processes injection by substantiating $\\alpha$ element production is decoupled from Eu injection. This suggests either a metallicity-dependent r-process in massive core-collapse supernovae, or that neutron-star merger events dominate r-process production in the recent universe.",
      "pdf_url": "https://arxiv.org/pdf/2411.10711.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.04722",
      "title": "Abundance of strontium in the Galactic globular cluster 47 Tuc",
      "authors": [
        "E. Kolomiecas",
        "A. Kučinskas",
        "J. Klevas",
        "V. Dobrovolskas"
      ],
      "abstract": "Abundance of strontium in the Galactic globular cluster 47 Tuc E. Kolomiecas, A. Kučinskas, J. Klevas, V. Dobrovolskas Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Aims. We have determined Sr abundance in a sample of 31 red giant branch stars located in the Galactic globular cluster 47 Tuc with the aim to identify potential differences in the Sr abundance between first population (1P, Na-poor) and second population (2P, Na-rich) stars. Methods. We derived the Na and Sr abundances from the archival spectra obtained with the UVES spectrograph. To do this, we used 1D ATLAS9 model atmospheres and a 1D local thermodynamic equilibrium spectral synthesis method. Particular attention was paid to assessing the potential impact of CN line blending on the obtained Sr abundances. Furthermore, we evaluated the potential influence of convection on the Sr line formation by using 3D hydrodynamical model atmospheres computed with the CO5BOLD code. Results. Our results suggest a weak correlation between the abundances of Sr and Na. Together with a similar correlation between the abundances of Zr and Na determined in our previous study, our analysis of Sr suggests that polluters that have enriched 2P stars with light elements may have produced some s-process elements as well. The mean Sr abundance determined in 31 red giant branch stars of 47~Tuc is $\\langle {\\rm [Sr/Fe]} \\rangle = 0.18\\pm0.08$ (the error denotes the standard deviation due to the star-to-star abundance scatter). This value is within the range of the Sr abundance variation that is observed in Galactic field stars of similar metallicity. The mean [Sr/Zr] abundance ratio in our sample stars suggests that the two s-process elements could have been synthesized by either low-mass asymptotic giant branch stars ($M=1-4 {\\rm M}_{\\odot}$) or massive ($M=10-20 {\\rm M}_{\\odot}$) fast-rotating ($v_{\\rm rot}=200-300$ km/s) stars.",
      "pdf_url": "https://arxiv.org/pdf/2510.04722.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06482",
      "title": "Radiation magnetohydrodynamics modeling of an impulsively driven chromospheric jet in the solar atmosphere",
      "authors": [
        "J. J. González-Avilés"
      ],
      "abstract": "Radiation magnetohydrodynamics modeling of an impulsively driven chromospheric jet in the solar atmosphere J. J. González-Avilés 17 pages, 7 figures. Accepted for publication in Revista Mexicana de Física Solar and Stellar Astrophysics (astro-ph.SR) In this paper, we present a numerical simulation of an impulsively driven chromospheric jet in the solar atmosphere using the non-ideal magnetohydrodynamic (MHD) equations coupled with frequency- and angle-averaged radiation transport equations. These include the dynamics of the radiation energy density and radiation flux. The jet is initiated by a localized Gaussian pulse applied to the vertical velocity component in the upper chromosphere (y = 1.75 Mm), producing a collimated plasma structure that exhibits characteristics similar to macrospicules. We focus on the formation and evolution of the chromospheric jet as it propagates through an optically thin region encompassing the upper chromosphere and solar corona, where both the Planck-averaged absorption and Rosseland-averaged scattering opacities are low. Although radiation transport terms only slightly affect the jet's morphology, they play a significant role in governing radiative processes in the corona. In particular, radiation transport contributes to the dissipation of the chromospheric jet, which effectively acts as a radiative cooling mechanism as the jet evolves through the optically thin solar corona.",
      "pdf_url": "https://arxiv.org/pdf/2510.06482.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06494",
      "title": "Ensemble seismic study of the properties of the core of Red Clump stars",
      "authors": [
        "Anthony Noll",
        "Sarbani Basu",
        "Saskia Hekker"
      ],
      "abstract": "Ensemble seismic study of the properties of the core of Red Clump stars Anthony Noll, Sarbani Basu, Saskia Hekker 12 pages, 14 figures, accepted in Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) Red clump stars still pose open questions regarding several physical processes, such as the mixing around the core, or the nuclear reactions, which are ill-constrained by theory and experiments. The oscillations of red clump stars, which are of mixed gravito-acoustic nature, allow us to directly investigate the interior of these stars and thereby better understand their physics. In particular, the measurement of their period spacing is a good probe of the structure around the core. We aim to explain the distribution of period spacings in red clump stars observed by Kepler by testing different prescriptions of core-boundary mixing and nuclear reaction rate. Using the MESA stellar evolution code, we computed several grids of core-helium burning tracks, with varying masses and metallicities. Each of these grids have been computed assuming a certain core boundary mixing scheme, or carbon-alpha reaction rate. We then sampled these grids, in a Monte-Carlo fashion, using observational spectroscopic metallicities and seismic masses priors, in order to retrieve a period spacing distribution that we compared to the observations. We found that the best fitting distribution was obtained when using a \"maximal overshoot\" core-boundary scheme, which has similar seismic properties as a model whose modes are trapped outside a semi-convective region, and which does not exhibit core breathing pulses at the end of the core-helium burning phase. If no mode trapping is assumed, then no core boundary mixing scheme is compatible with the observations. Moreover, we found that extending the core with overshoot worsens the fit. Additionally, reducing the carbon-alpha reaction rate (by around 15%) improves the fit to the observed distribution. Finally, we noted that an overpopulation of early red clump stars with period spacing values around 250s is predicted by the models but not found in the observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.06494.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06968",
      "title": "Understanding an origin of palladium in metal-poor stars based on the non-LTE analysis of Pd~I lines",
      "authors": [
        "L. Mashonkina",
        "A. Smogorzhevskii"
      ],
      "abstract": "Understanding an origin of palladium in metal-poor stars based on the non-LTE analysis of Pd~I lines L. Mashonkina, A. Smogorzhevskii 13 pages, 7 tables, 8 figures, accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) Palladium is one of poorly observed neutron-capture elements. Abundance determinations for stellar samples covering a broad metallicity range are needed for better understanding the mechanisms of Pd synthesis during the Galaxy evolution. We aim to obtain accurate abundances of Pd for the Sun and the sample of metal-poor stars based on the non-local thermodynamic equilibrium (non-LTE) line formation for Pd~I. We present a new, comprehensive model atom of Pd~I. Abundances of Pd, Sr, Ba, and Eu were derived for 48 stars from the non-LTE analyses of high resolution and high signal-to-noise ratio spectra provided by the ESO archives. Non-LTE leads to weakened Pd~I lines and positive non-LTE abundance corrections growing from 0.2~dex for the solar lines up to 0.8~dex for the lines in the most luminous star of the sample. Depending on a treatment of inelastic collisions with hydrogen atoms, the solar non-LTE abundance amounts to log eps = 1.61+-0.02 to 1.70+-0.02 and agrees within the error bars with the meteoritic abundance log eps_met = 1.65. Non-LTE largely removes the discrepancies in the LTE abundances between the giant and dwarf stars of similar metallicities. Palladium tightly correlates with Eu in the -1.71 < [Fe/H] < -0.56 range indicating the r- and s-process contributions to Pd synthesis of approximately 70% and 30%, respectively. Palladium is of pure r-process origin in our two r-II stars, and a dominant contribution of the r-process to the Pd abundances is found for another two very metal-poor (VMP, [Fe/H] < -2) stars. The two VMP stars, which are strongly enhanced with Sr relative to Ba and Eu, reveal also enhancements with Pd. We propose that the source of extra Sr and Pd in these stars are VMP, fast rotating massive stars. Non-LTE is essential for obtaining the observational constraints to future models of the Galactic Pd evolution.",
      "pdf_url": "https://arxiv.org/pdf/2510.06968.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06510",
      "title": "Influence of Solar Sails on Magnetic Field Measurements in Space Plasmas",
      "authors": [
        "Konstantinos Horaites",
        "Juan V. Rodriguez",
        "Ying Liu"
      ],
      "abstract": "Influence of Solar Sails on Magnetic Field Measurements in Space Plasmas Konstantinos Horaites, Juan V. Rodriguez, Ying Liu Space Physics (physics.space-ph); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Solar sail technology is ready to be deployed in a satellite mission carrying a science-grade magnetometer. In preparation for such a mission, it is essential to characterize the interactions between the sail and the ambient plasma that could affect the magnetometer readings. The solar wind magnetic field is a key parameter in space weather prediction, because it governs the energy-releasing magnetic reconnection process at Earth's magnetopause. This paper investigates the influence of solar sails on the ambient magnetic field, particularly focusing on two critical electromagnetic effects: eddy currents and magnetic pileup. We find the induced eddy currents in the metallic sail can significantly perturb the local magnetic field at high frequencies. We also suggest that magnetic pileup can influence the spacecraft's environment when the sail size is comparable to the electron kinetic scales of the surrounding plasma. This research provides an initial guide for determining when sail-plasma interactions could impact magnetometer performance.",
      "pdf_url": "https://arxiv.org/pdf/2510.06510.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07034",
      "title": "Machine Learning for Radial Velocity Analysis I: Vision Transformers as a Robust Alternative for Detecting Planetary Candidates",
      "authors": [
        "Anoop Gavankar",
        "Tanish Mittal",
        "Joe Ninan",
        "Shravan Hanasoge"
      ],
      "abstract": "Machine Learning for Radial Velocity Analysis I: Vision Transformers as a Robust Alternative for Detecting Planetary Candidates Anoop Gavankar, Tanish Mittal, Joe Ninan, Shravan Hanasoge 29 pages, 31 figures, Accepted for publication in the Astronomical Journal Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Extreme precision radial velocity (EPRV) surveys usually require extensive observational baselines to confirm planetary candidates, making them resource-intensive. Traditionally, periodograms are used to identify promising candidate signals before further observational investment, but their effectiveness is often limited for low-amplitude signals due to stellar jitter. In this work, we develop a machine learning (ML) framework based on a Transformer architecture that aims to detect the presence and likely period of planetary signals in time-series spectra, even in the presence of stellar activity. The model is trained to classify whether a planetary signal exists and assign it to one of several discrete period and amplitude bins. Injection-recovery tests on randomly selected 100 epoch observation subsets from NEID solar data (2020-2022 period) show that for low-amplitude systems ($<$1 ms$^{-1}$), our model improves planetary candidate identification by a factor of two compared to the traditional Lomb-Scargle periodogram. Our ML model is built on a Vision Transformer (ViT) architecture that processes reduced representations of solar spectrum observations to predict the period and semi-amplitude of planetary signal candidates. By analyzing multi-epoch spectra, the model reliably detects planetary signals with semi-amplitudes as low as 65 cms$^{-1}$. Even under real solar noise and irregular sampling, it identifies signals down to 35 cms$^{-1}$. Comparisons with the Lomb-Scargle periodogram demonstrate a significant improvement in detecting low-amplitude planetary candidates, particularly for longer orbital periods. These results underscore the potential of machine learning to identify planetary candidates early in EPRV surveys, even from limited observational counts.",
      "pdf_url": "https://arxiv.org/pdf/2510.07034.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07130",
      "title": "Polka-dotted Stars II: Starspots and obliquities of Kepler-17 and Kepler-63",
      "authors": [
        "Sabina Sagynbayeva",
        "Will M. Farr"
      ],
      "abstract": "Polka-dotted Stars II: Starspots and obliquities of Kepler-17 and Kepler-63 Sabina Sagynbayeva, Will M. Farr Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) Starspots trace stellar magnetic activity and influence both stellar evolution and exoplanet characterization. While occultation-based spot analyses have been applied to individual systems, comparative studies remain limited. We apply the StarryStarryProcess Bayesian surface-mapping framework to archival Kepler light curves of two planet hosts, Kepler-63 and Kepler-17, extending the validation established on TOI-3884 (Paper I). Across both systems, we infer characteristic spot radii smaller than 10 degrees. The latitudinal spot distributions of these G dwarfs show bimodal belts: Kepler-63 near 30 degrees and Kepler-17 near 15 degrees. Our analysis yields stellar obliquity measurements in excellent agreement with previous studies, validating our methodology and demonstrating that transit-based surface mapping can simultaneously recover planetary parameters, stellar orientations, and magnetic morphologies. Together, these results reveal a range of stellar geometries from nearly aligned (Kepler-17) to highly misaligned (Kepler-63).",
      "pdf_url": "https://arxiv.org/pdf/2510.07130.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07187",
      "title": "Fomalhaut's debris disc is not dominated by primordial Plutos",
      "authors": [
        "Tim D. Pearce",
        "Torsten Löhne",
        "Alexander V. Krivov"
      ],
      "abstract": "Fomalhaut's debris disc is not dominated by primordial Plutos Tim D. Pearce, Torsten Löhne, Alexander V. Krivov Accepted for publication in MNRAS Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) A key challenge in debris-disc science is that we do not know the masses of debris discs, nor the sizes of the largest debris bodies. This is because modern observations can only detect objects up to centimetre sizes, whilst larger planetesimals, which dominate disc mass, remain hidden. We must therefore use other arguments, such as dynamics, to indirectly infer disc masses and body sizes. This paper presents a new method, applicable to narrow debris discs like Fomalhaut. We argue that such discs cannot be too massive, nor the largest bodies too large, otherwise they would self-scatter and the disc would be much broader than observed. Using n-body dynamics and collisional theory, we demonstrate that the mass of Fomalhaut's disc cannot be dominated by primordial Plutos. Instead, if the mass is dominated by primordial bodies, then they should have radii below $300^{+80}_{-70}$ km ($0.3 \\pm 0.1$ RPluto) and above $5^{+20}_{-4}$ km. Such bodies would each have less than 1 per cent the mass of Pluto. Our conclusions are robust to additional physics, including shepherding planets and collisional damping. Our results provide independent, dynamical support for the idea that the masses of bright debris discs are dominated by objects smaller than Pluto.",
      "pdf_url": "https://arxiv.org/pdf/2510.07187.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.00913",
      "title": "Determining the 3D Dynamics of Solar Flare Magnetic Reconnection",
      "authors": [
        "Joel T. Dahlin",
        "Spiro K. Antiochos",
        "Peter F. Wyper",
        "Jiong Qiu",
        "C. Richard DeVore"
      ],
      "abstract": "Determining the 3D Dynamics of Solar Flare Magnetic Reconnection Joel T. Dahlin, Spiro K. Antiochos, Peter F. Wyper, Jiong Qiu, C. Richard DeVore Accepted for publication in ApJ. Added Figure 9, expanded discussion of ribbon feature scaling (section 6.2) Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) Solar flares are major space weather events that result from the explosive conversion of stored magnetic energy into bulk motion, plasma heating, and particle acceleration. While the standard flare model has proven highly successful in explaining key morphological features of flare observations, many aspects of the energy release are not yet understood. In particular, the turbulent three-dimensional structure of the flare current sheet is thought to play an important role in fast reconnection, particle acceleration, and bursty dynamics. Although direct diagnosis of the magnetic field dynamics in the corona remains highly challenging, rich information may be gleaned from flare ribbons, which represent the chromospheric imprints of reconnection in the corona. Intriguingly, recent solar imaging observations have revealed a diversity of fine structure in flare ribbons that hints at corresponding complexity in the reconnection region. We present high-resolution three-dimensional MHD simulations of an eruptive flare and describe our efforts to interpret fine-scale ribbon features in terms of the current sheet dynamics. In our model, the current sheet is characterized by many coherent magnetic structures known as plasmoids. We derive a model analogue for ribbons by generating a time series of field-line length maps (L-maps) and identifying abrupt shortenings as flare reconnection events. We thereby demonstrate that plasmoids imprint transient 'spirals' along the analogue of the ribbon front, with a morphology consistent with observed fine structure. We discuss the implications of these results for interpreting SolO, IRIS, and DKIST observations of explosive flare energy release.",
      "pdf_url": "https://arxiv.org/pdf/2504.00913.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20594",
      "title": "Thick Disks around White Dwarfs viewed 'Edge-off': Effects on Transit Properties and Infrared Excess",
      "authors": [
        "Soumyadeep Bhattacharjee"
      ],
      "abstract": "Thick Disks around White Dwarfs viewed 'Edge-off': Effects on Transit Properties and Infrared Excess Soumyadeep Bhattacharjee 14+3 (main+appendix) pages, 14 figures. Updates: Updated optically thin calculation and added explanation for transits. Accepted for publication in PASP. The codes can be found in this https URL Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) A significant fraction of white dwarfs (WDs) host dust/debris disks formed from the tidal disruption of asteroids and planetesimals. Several studies indicate that the disks can attain significant vertical heights through collisional cascade. In this work I model the effects of geometrically thick disks on two primary observables: photometric transits by the disk when viewed at high inclinations and infrared dust emission. Specifically, I consider disks with a Gaussian vertical profile with scale heights comparable to or larger than the WD radius. I primarily focus on inclinations $\\gtrsim$$87$ degrees (`edge-off'), which can produce significant transits with moderate disk thickness. Both the transit depth and color become strong functions of inclination, and I explore their dependence on the disk parameters. I show that such a setup can produce the recently discovered reddening in the transit of WD J1013$-$0427. Moving to infrared emission, I show that the contribution from the heated inner rim can be substantial even at high inclinations. It can potentially explain the infrared excess observed in two transiting debris systems, WD 1145$+$017 and WD 1232$+$563, consistently with the transits. The other two important radiation components are the optically thin dust emission from the disk's outer layers and the optically thick emission from the backwarmed disk interior. Extending my analysis to G29-38 shows that the former can adequately produce the silicate emission feature with optically thin dust mass of $>$$10^{17}$ grams. The inner dense layers, on the other hand, allow the disk to contain orders of magnitude larger net dust mass. Overall, I show that thick disk effects can be significant and should be taken into account. I motivate detailed studies to quantify the effects accurately.",
      "pdf_url": "https://arxiv.org/pdf/2507.20594.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.26586",
      "title": "Supergranulation and poleward migration of the magnetic field at high latitudes of the Sun",
      "authors": [
        "L. P. Chitta",
        "D. Calchetti",
        "J. Hirzberger",
        "G. Valori",
        "E. R. Priest",
        "S. K. Solanki",
        "D. Berghmans",
        "C. Verbeeck",
        "E. Kraaikamp",
        "K. Albert",
        "T. Appourchaux",
        "F. J. Bailén",
        "L. R. Bellot Rubio",
        "J. Blanco Rodríguez",
        "A. Feller",
        "A. Gandorfer",
        "L. Gizon",
        "A. Lagg",
        "A. Moreno Vacas",
        "D. Orozco Suárez",
        "J. Schou",
        "U. Schühle",
        "J. Sinjan",
        "H. Strecker",
        "R. Volkmer",
        "J. Woch",
        "X. Li",
        "T. Oba",
        "A. Ulyanov"
      ],
      "abstract": "Supergranulation and poleward migration of the magnetic field at high latitudes of the Sun L. P. Chitta, D. Calchetti, J. Hirzberger, G. Valori, E. R. Priest, S. K. Solanki, D. Berghmans, C. Verbeeck, E. Kraaikamp, K. Albert, T. Appourchaux, F. J. Bailén, L. R. Bellot Rubio, J. Blanco Rodríguez, A. Feller, A. Gandorfer, L. Gizon, A. Lagg, A. Moreno Vacas, D. Orozco Suárez, J. Schou, U. Schühle, J. Sinjan, H. Strecker, R. Volkmer, J. Woch, X. Li, T. Oba, A. Ulyanov Accepted for publication in the Astrophysical Journal Letters (Online animations available from the corresponding author) Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) Magnetoconvection at the solar surface governs the dynamics in the upper solar atmosphere and sustains the heliosphere. Properties of this fundamental process are poorly described near the solar poles. Here we report the first out-of-ecliptic remote-sensing observations of the south pole of the Sun from a high-latitude campaign of the Solar Orbiter spacecraft which reveal spatial and temporal evolution of supergranular convective cells. The supergranular cells have spatial scales of 20--40 Mm. From eight days of observations starting on 2025 March 16, our analysis shows that the magnetic network migrates poleward, on average, at high latitudes (above 60\\textdegree), with speeds in the range of 10--20 m s$^{-1}$, depending on the structures being tracked. These results shed light on the buildup of the polar magnetic field that is central to our understanding of the solar cycle and the heliospheric magnetic field.",
      "pdf_url": "https://arxiv.org/pdf/2509.26586.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.00608",
      "title": "Evaluating Solar Wind Forecast Using Magnetic Maps That Include Helioseismic Far-Side Information",
      "authors": [
        "Stephan G. Heinemann",
        "Dan Yang",
        "Shaela I. Jones",
        "Jens Pomoell",
        "Eleanna Asvestari",
        "Carl J. Henney",
        "Charles N. Arge",
        "Laurent Gizon"
      ],
      "abstract": "Evaluating Solar Wind Forecast Using Magnetic Maps That Include Helioseismic Far-Side Information Stephan G. Heinemann, Dan Yang, Shaela I. Jones, Jens Pomoell, Eleanna Asvestari, Carl J. Henney, Charles N. Arge, Laurent Gizon accepted in Solar Physics/in production, Editors Choice Solar and Stellar Astrophysics (astro-ph.SR) To model the structure and dynamics of the heliosphere well enough for high-quality forecasting, it is essential to accurately estimate the global solar magnetic field used as inner boundary condition in solar wind models. However, our understanding of the photospheric magnetic field topology is inherently constrained by the limitation of systematically observing the Sun from only one vantage point, Earth. To address this challenge, we introduce global magnetic field maps that assimilate far-side active regions derived from helioseismology into solar wind modeling. Through a comparative analysis between the combined surface flux transport and helioseismic Far-side Active Region Model (FARM) magnetic maps and the base surface flux transport model without far-side active regions (SFTM), we assess the feasibility and efficacy of incorporating helioseismic far-side information in space weather forecasting. We are employing the Wang-Sheeley-Arge Solar Wind (WSA) model for statistical evaluation and leveraging the EUropean Heliospheric FOrecasting Information Asset (EUHFORIA), a three-dimensional heliospheric MHD model, to analyze a case study. Using the WSA model, we show that including far-side magnetic data improves solar wind forecasts for 2013-2014 by up to 50% in correlation and 3% in root mean square error and mean absolute error, especially near Earth and Solar TErrestrial RElations Observatory - Ahead (STEREO-A). Additionally, our 3D modeling shows significant localized differences in heliospheric structure that can be attributed to the presence or absence of active regions in the magnetic maps used as input boundaries. This highlights the importance of including far-side information to more accurately model and predict space weather effects caused by solar wind, solar transients, and geomagnetic disturbances.",
      "pdf_url": "https://arxiv.org/pdf/2510.00608.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.12608",
      "title": "The impact of Alfvenic shear flow on magnetic reconnection and turbulence",
      "authors": [
        "Tamar Ervin",
        "Alfred Mallet",
        "Stefan Eriksson",
        "M. Swisdak",
        "James Juno",
        "Orlando M. Romeo",
        "Tai Phan",
        "Trevor A. Bowen",
        "Roberto Livi",
        "Phyllis L. Whittlesey",
        "Davin E. Larson",
        "Stuart D. Bale"
      ],
      "abstract": "The impact of Alfvenic shear flow on magnetic reconnection and turbulence Tamar Ervin, Alfred Mallet, Stefan Eriksson, M. Swisdak, James Juno, Orlando M. Romeo, Tai Phan, Trevor A. Bowen, Roberto Livi, Phyllis L. Whittlesey, Davin E. Larson, Stuart D. Bale Space Physics (physics.space-ph); Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph) Magnetic reconnection is a fundamental and omnipresent energy conversion process in plasma physics. Novel observations of fields and particles from Parker Solar Probe (PSP) have shown the absence of reconnection in a large number of current sheets in the near-Sun solar wind. Using near-Sun observations from PSP Encounters 4 to 11 (Jan 2020 to March 2022), we investigate whether reconnection onset might be suppressed by velocity shear. We compare estimates of the tearing mode growth rate in the presence of shear flow for time periods identified as containing reconnecting current sheets versus non-reconnecting times, finding systematically larger growth rates for reconnection periods. Upon examination of the parameters associated with reconnection onset, we find that 85% of the reconnection events are embedded in slow, non-Alfvenic wind streams. We compare with fast, slow non-Alfvenic, and slow Alfvenic streams, finding that the growth rate is suppressed in highly Alfvenic fast and slow wind and reconnection is not seen in these wind types, as would be expected from our theoretical expressions. These wind streams have strong Alfvenic flow shear, consistent with the idea of reconnection suppression by such flows. This could help explain the frequent absence of reconnection events in the highly Alfvenic, near-Sun solar wind observed by PSP. Finally, we find a steepening of both the trace and magnitude magnetic field spectra within reconnection periods in comparison to ambient wind. We tie this to the dynamics of relatively balanced turbulence within these reconnection periods and the potential generation of compressible fluctuations.",
      "pdf_url": "https://arxiv.org/pdf/2509.12608.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.04981",
      "title": "A Link Between Rocky Planet Density and Host Star Chemistry",
      "authors": [
        "Aida Behmard",
        "Casey L. Brinkman",
        "Soichiro Hattori",
        "Ryan A. Rubenzahl",
        "Megan Bedell"
      ],
      "abstract": "A Link Between Rocky Planet Density and Host Star Chemistry Aida Behmard, Casey L. Brinkman, Soichiro Hattori, Ryan A. Rubenzahl, Megan Bedell 17 pages, 6 figures, accepted to AJ Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Planets and their host stars form from the same cloud of gas and dust, so we assume that their chemical compositions are linked. However, a clear correlation between rocky planet interior properties and host star chemistry remains elusive for planets around FGK dwarfs, and non-existent for planets around M dwarfs because cool stars frequently lack detailed chemical information. Here, we investigate the relationship between small (R$_{P}$ $\\leq$ 1.8 R$_{\\oplus}$) planet densities and host star elemental abundances. We use the Sloan Digital Sky Survey-V/Milky Way Mapper and an accompanying data-driven framework to obtain abundances for FGK and M dwarf hosts of 22 rocky planets. We find that planet densities exhibit a strong, inverse relationship to [Mg/Fe] abundances of FGK hosts (p = 0.001). This correlation becomes more significant with the addition of M dwarf hosts (p = 0.0005). If we assume that rocky planets have terrestrial-like compositions, this suggests that low [Mg/Fe] environments form planets with larger Fe-rich cores and thus higher densities. The thick disk planets in our sample help anchor this trend, illustrating the importance of sampling exoplanet properties across a range of host star populations. This finding highlights the connection between Galactic chemical evolution and rocky planet formation, and indicates that Earth-like planet compositions may vary significantly across different regions of the Galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2510.04981.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06491",
      "title": "CCAT: Readout of over 10,000 280 GHz KIDs in Mod-Cam using RFSoC Electronics",
      "authors": [
        "Darshan A. Patel",
        "Yuhan Wang",
        "Cody J. Duell",
        "Jason E. Austermann",
        "James Beall",
        "James R. Burgoyne",
        "Scott Chapman",
        "Steve K. Choi",
        "Rodrigo G. Freundt",
        "Eliza Gazda",
        "Christopher Groppi",
        "Zachary B. Huber",
        "Johannes Hubmayr",
        "Ben Keller",
        "Lawerence T. Lin",
        "Philip Mauskopf",
        "Alicia Middleton",
        "Michael D. Niemack",
        "Cody Roberson",
        "Adrian K. Sinclair",
        "Ema Smith",
        "Jeff van Lanen",
        "Anna Vaskuri",
        "Benjamin J. Vaughan",
        "Eve M. Vavagiakis",
        "Michael Vissers",
        "Samantha Walker",
        "Jordan Wheeler",
        "Ruixuan Xie"
      ],
      "abstract": "CCAT: Readout of over 10,000 280 GHz KIDs in Mod-Cam using RFSoC Electronics Darshan A. Patel, Yuhan Wang, Cody J. Duell, Jason E. Austermann, James Beall, James R. Burgoyne, Scott Chapman, Steve K. Choi, Rodrigo G. Freundt, Eliza Gazda, Christopher Groppi, Zachary B. Huber, Johannes Hubmayr, Ben Keller, Lawerence T. Lin, Philip Mauskopf, Alicia Middleton, Michael D. Niemack, Cody Roberson, Adrian K. Sinclair, Ema Smith, Jeff van Lanen, Anna Vaskuri, Benjamin J. Vaughan, Eve M. Vavagiakis, Michael Vissers, Samantha Walker, Jordan Wheeler, Ruixuan (Matt)Xie 7 pages, 7 figures, submitted to Low Temperature Detectors 2025 conference proceedings Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) Over the past decade, kinetic inductance detectors (KIDs) have emerged as a viable superconducting technology for astrophysics at millimeter and submillimeter wavelengths. KIDs spanning 210 - 850 GHz across seven instrument modules will be deployed in the Prime-Cam instrument of CCAT Observatory's Fred Young Submillimeter Telescope at an elevation of 5600 m on Cerro Chajnantor in Chile's Atacama Desert. The natural frequency-division multiplexed readout of KIDs allows hundreds of detectors to be coupled to a single radio frequency (RF) transmission line, but requires sophisticated warm readout electronics. The FPGA-based Xilinx ZCU111 radio frequency system on chip (RFSoC) offers a promising and flexible solution to the challenge of warm readout. CCAT uses custom packaged RFSoCs to read out KIDs in the Prime-Cam instrument. Each RFSoC can simultaneously read out four RF channels with up to 1,000 detectors spanning a 512 MHz bandwidth per channel using the current firmware. We use five RFSoCs to read out the >10,000 KIDs in the broadband 280 GHz instrument module inside a testbed receiver. Here, we describe and demonstrate the readout software and pipeline for the RFSoC system. We also present the preliminary averaged spectral responses of the 280 GHz instrument module using KIDs from the TiN array and the first Al array as a demonstration of the end-to-end performance of the readout and optical systems. These measurements demonstrate the foundation that will enable us to simultaneously read out over 10,000 KIDs with the RFSoC and represent a critical step toward reading out the ~100,000 KIDs in Prime-Cam in its future full capacity configuration.",
      "pdf_url": "https://arxiv.org/pdf/2510.06491.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06558",
      "title": "RFSoC receiver calibration system for 21-cm global spectrum experiments from space: The CosmoCube case",
      "authors": [
        "Jiacong Zhu",
        "Eloy de Lera Acedo",
        "Kaan Artuc",
        "Xuelei Chen"
      ],
      "abstract": "RFSoC receiver calibration system for 21-cm global spectrum experiments from space: The CosmoCube case Jiacong Zhu, Eloy de Lera Acedo, Kaan Artuc, Xuelei Chen RAS Techniques and Instruments, 4, rzae064 (2025) Instrumentation and Methods for Astrophysics (astro-ph.IM) The CosmoCube project plans to deploy a global 21-cm spectrometer with 10-100 MHz observation band in a lunar orbit. The farside part of such an orbit, i.e. the part of orbit behind the Moon, offers an ideal site for accurately measuring the 21-cm signal from the Dark Ages, Cosmic Dawn and Epoch of Reionization, as the effects of the Earth's ionosphere, artificial radio frequency interference (RFI), and complex terrain and soil are all avoided. Given the limitations of a satellite platform, we propose a receiver calibration system design based on a Radio Frequency system-on-chip, consisting of a Vector Network Analyzer (VNA) sub-system, and a source switching sub-system. We introduce the measurement principle of the VNA, and discuss the effect of quantization error. The accuracy, stability and trajectory noise of the VNA are tested in laboratory experiments. We also present the design of the source-switching sub-system, generating mock datasets, showing that the imperfect return loss, insertion loss, and isolation of surface-mounted microwave switches have a minimal effect on the sky foreground fitting residuals, which are within $\\pm10$ mK under optimal fitting condition. When all possible measurement errors in reflection coefficients and physical temperatures are taken into account, the foreground fitting residuals for the 50-90 MHz part of the spectrum remain around $\\pm20$ mK.",
      "pdf_url": "https://arxiv.org/pdf/2510.06558.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06931",
      "title": "Textual interpretation of transient image classifications from large language models",
      "authors": [
        "Fiorenzo Stoppa",
        "Turan Bulmus",
        "Steven Bloemen",
        "Stephen J. Smartt",
        "Paul J. Groot",
        "Paul Vreeswijk",
        "Ken W. Smith"
      ],
      "abstract": "Textual interpretation of transient image classifications from large language models Fiorenzo Stoppa, Turan Bulmus, Steven Bloemen, Stephen J. Smartt, Paul J. Groot, Paul Vreeswijk, Ken W. Smith Published in Nature Astronomy (2025). Publisher's Version of Record (CC BY 4.0). DOI: https://doi.org/10.1038/s41550-025-02670-z Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Modern astronomical surveys deliver immense volumes of transient detections, yet distinguishing real astrophysical signals (for example, explosive events) from bogus imaging artefacts remains a challenge. Convolutional neural networks are effectively used for real versus bogus classification; however, their reliance on opaque latent representations hinders interpretability. Here we show that large language models (LLMs) can approach the performance level of a convolutional neural network on three optical transient survey datasets (Pan-STARRS, MeerLICHT and ATLAS) while simultaneously producing direct, human-readable descriptions for every candidate. Using only 15 examples and concise instructions, Google's LLM, Gemini, achieves a 93% average accuracy across datasets that span a range of resolution and pixel scales. We also show that a second LLM can assess the coherence of the output of the first model, enabling iterative refinement by identifying problematic cases. This framework allows users to define the desired classification behaviour through natural language and examples, bypassing traditional training pipelines. Furthermore, by generating textual descriptions of observed features, LLMs enable users to query classifications as if navigating an annotated catalogue, rather than deciphering abstract latent spaces. As next-generation telescopes and surveys further increase the amount of data available, LLM-based classification could help bridge the gap between automated detection and transparent, human-level understanding.",
      "pdf_url": "https://arxiv.org/pdf/2510.06931.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06963",
      "title": "In-flight performance of the IXPE telescopes",
      "authors": [
        "Riccardo Ferrazzoli",
        "Enrico Costa",
        "Sergio Fabiani",
        "Philip Kaaret",
        "Stephen L. O'Dell",
        "Brian D. Ramsey",
        "Paolo Soffitta",
        "Luca Baldini",
        "Ronaldo Bellazzini",
        "Alessandro Di Marco",
        "Fabio La Monaca",
        "Luca Latronico",
        "Alberto Manfreda",
        "Fabio Muleri",
        "John Rankin",
        "Carmelo Sgrò",
        "Stefano Silvestri",
        "Martin C. Weisskopf"
      ],
      "abstract": "In-flight performance of the IXPE telescopes Riccardo Ferrazzoli, Enrico Costa, Sergio Fabiani, Philip Kaaret, Stephen L. O'Dell, Brian D. Ramsey, Paolo Soffitta, Luca Baldini, Ronaldo Bellazzini, Alessandro Di Marco, Fabio La Monaca, Luca Latronico, Alberto Manfreda, Fabio Muleri, John Rankin, Carmelo Sgrò, Stefano Silvestri, Martin C. Weisskopf Accepted for publication on the Astrophysical Journal, 14 pages, 7 figures, 8 tables Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a comprehensive characterization of the on-orbit imaging performance of the three telescopes on board the Imaging X-ray Polarimetry Explorer (IXPE). Each telescope comprises a Wolter-I mirror module assembly and a Gas Pixel Detector focal-plane detector unit (DU). We analyze data from point-like X-ray sources and fit a composite point spread function (PSF) model that we compare with ground calibrations. We study the dependence of the PSF parameters and of the angular resolution, in terms of half-power diameter (HPD), on the time and source counting rate. We find no significant secular evolution of PSF parameters or HPD over 30 months on orbit, with average HPDs of $26.1 \\pm 0.5$ arcsec (Telescope 1), $32.1 \\pm 0.5$ arcsec (Telescope 2), and $30.9 \\pm 0.6$ arcsec (Telescope 3), and rate trends consistent with zero up to source counting rates of $\\sim60$ cts s$^{-1}$ in the 2-3 keV energy band for all three telescopes. We set a 99% C.L. upper limit of 4.4% on the optics-induced polarization in the PSF halo, and find no measurable degradation of the polarization modulation factor in the wings versus the core due to mis-reconstructed photoelectron tracks. IXPE's imaging performance thus is consistent with the $\\leq30$ arcsec observatory requirement with high stability, ensuring robust spatially resolved polarization measurements for the mission's projected lifetime through 2030.",
      "pdf_url": "https://arxiv.org/pdf/2510.06963.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07215",
      "title": "AppleCiDEr II: SpectraNet -- A Deep Learning Network for Spectroscopic Data",
      "authors": [
        "Maojie Xu , Argyro Sasli , Alexandra Junell , Felipe Fontinele Nunes , Yu-Jing Qin , Christoffer Fremling , Sam Rose , Theophile Jegou Du Laz , Benny Border , Antoine Le Calloch , Sushant Sharma Chaudhary , Hailey Markoff , Avyukt Raghuvanshi , Nabeel Rehemtulla , Jesper Sollerman , Yashvi Sharma , Niharika Sravan , Judy Adler , Tracy X. Chen , Richard Dekany , Reed Riddle , Mansi M. Kasliwal , Matthew J. Graham , Michael W. Coughlin Department of Computer Science &amp; Engineering, University of Minnesota, Minneapolis, MN, USA, NSF Institute on Accelerated AI Algorithms for Data-Driven Discovery , School of Physics and Astronomy, University of Minnesota, Minneapolis, MN, USA, Division of Physics, Mathematics and Astronomy, California Institute of Technology, Pasadena, CA, USA, Caltech Optical Observatories, California Institute of Technology, Pasadena, CA, USA, Division of Physics, Mathematics and Astronomy, California Institute of Technology, Pasadena, CA, USA, Cahill Center for Astrophysics, California Institute of Technology, Pasadena, CA, USA, Department of Physics and Astronomy, Northwestern University, Evanston, IL, USA, Center for Interdisciplinary Exploration and Research in Astrophysics , Evanston, IL, USA, NSF-Simons AI Institute for the Sky , Chicago, IL, USA, Department of Astronomy, Stockholm University, Stockholm, Sweden, Department of Physics, Drexel University, Philadelphia, PA, USA, IPAC, California Institute of Technology, Pasadena, CA, USA, Caltech Optical Observatories, California Institute of Technology, Pasadena, CA, Division of Physics, Mathematics, and Astronomy, California Institute of Technology, Pasadena, CA, USA, Cahill Center for Astrophysics, California Institute of Technology, Pasadena, CA, USA)"
      ],
      "abstract": "AppleCiDEr II: SpectraNet -- A Deep Learning Network for Spectroscopic Data Maojie Xu (1,2), Argyro Sasli (3,2), Alexandra Junell (3,2), Felipe Fontinele Nunes (3,2), Yu-Jing Qin (4), Christoffer Fremling (5,6), Sam Rose (7), Theophile Jegou Du Laz (4,2), Benny Border (3,2), Antoine Le Calloch (3,2), Sushant Sharma Chaudhary (3,2), Hailey Markoff (3,2), Avyukt Raghuvanshi (3,2), Nabeel Rehemtulla (8,9,10), Jesper Sollerman (11), Yashvi Sharma (5), Niharika Sravan (12,2), Judy Adler (13), Tracy X. Chen (13), Richard Dekany (14), Reed Riddle (5), Mansi M. Kasliwal (15), Matthew J. Graham (16,2), Michael W. Coughlin (3,2) ((1) Department of Computer Science &amp; Engineering, University of Minnesota, Minneapolis, MN, USA, (2) NSF Institute on Accelerated AI Algorithms for Data-Driven Discovery (A3D3), (3) School of Physics and Astronomy, University of Minnesota, Minneapolis, MN, USA, (4) Division of Physics, Mathematics and Astronomy, California Institute of Technology, Pasadena, CA, USA, (5) Caltech Optical Observatories, California Institute of Technology, Pasadena, CA, USA, (6) Division of Physics, Mathematics and Astronomy, California Institute of Technology, Pasadena, CA, USA, (7) Cahill Center for Astrophysics, California Institute of Technology, Pasadena, CA, USA, (8) Department of Physics and Astronomy, Northwestern University, Evanston, IL, USA, (9) Center for Interdisciplinary Exploration and Research in Astrophysics (CIERA), Evanston, IL, USA, (10) NSF-Simons AI Institute for the Sky (SkAI), Chicago, IL, USA, (11) Department of Astronomy, Stockholm University, Stockholm, Sweden, (12) Department of Physics, Drexel University, Philadelphia, PA, USA, (13) IPAC, California Institute of Technology, Pasadena, CA, USA, (14) Caltech Optical Observatories, California Institute of Technology, Pasadena, CA, (15) Division of Physics, Mathematics, and Astronomy, California Institute of Technology, Pasadena, CA, USA, (16) Cahill Center for Astrophysics, California Institute of Technology, Pasadena, CA, USA) Instrumentation and Methods for Astrophysics (astro-ph.IM) Time-domain surveys such as the Zwicky Transient Facility (ZTF) have opened a new frontier in the discovery and characterization of transients. While photometric light curves provide broad temporal coverage, spectroscopic observations remain crucial for physical interpretation and source classification. However, existing spectral analysis methods -- often reliant on template fitting or parametric models -- are limited in their ability to capture the complex and evolving spectra characteristic of such sources, which are sometimes only available at low resolution. In this work, we introduce SpectraNet, a deep convolutional neural network designed to learn robust representations of optical spectra from transients. Our model combines multi-scale convolution kernels and multi-scale pooling to extract features from preprocessed spectra in a hierarchical and interpretable manner. We train and validate SpectraNet on low-resolution time-series spectra obtained from the Spectral Energy Distribution Machine (SEDM) and other instruments, demonstrating state-of-the-art performance in classification. Furthermore, in redshift prediction tasks, SpectraNet achieves a root mean squared relative redshift error of 0.02, highlighting its effectiveness in precise regression tasks as well.",
      "pdf_url": "https://arxiv.org/pdf/2510.07215.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07282",
      "title": "A Comoving Framework for Planet Migration",
      "authors": [
        "Ximena S. Ramos",
        "Pablo Benitez-Llambay"
      ],
      "abstract": "A Comoving Framework for Planet Migration Ximena S. Ramos, Pablo Benitez-Llambay 16 pages, 4 figures, submitted to ApJ Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) The migration of planets within their nascent protoplanetary disks is a fundamental process that shapes the final architecture of planetary systems. However, studying this phenomenon through direct hydrodynamical simulations is computationally demanding, with traditional methods on fixed grids being ill-suited for tracking planet migration over long timescales due to their high cost and limited domain. In this work, we present a self-consistent comoving framework designed to overcome these challenges. Our method employs a coordinate transformation that scales with the planet's evolving semi-major axis, keeping the planet stationary with respect to its local computational grid. This transforms the standard hydrodynamic equations by introducing a source term that accounts for the inertial forces of the non-inertial reference frame. We implement this framework in the FARGO3D code and validate it through a benchmark test, demonstrating excellent agreement with conventional fixed-grid simulations until the latter are compromised by boundary effects. Our analysis shows that the comoving method can be over an order of magnitude more computationally efficient, dramatically reducing the cost of simulating migrating planets. Furthermore, the framework's adaptability enables efficient, high-resolution studies of planets on eccentric orbits by keeping them stationary within the computational grid. This framework serves as both a powerful numerical and theoretical tool, simplifying the time-dependent flow around a migrating planet that offers clearer physical insight. It enables long-term, self-consistent studies of planet-disk interaction, representing a crucial step towards performing planet-population synthesis based on full hydrodynamical simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.07282.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2303.09502",
      "title": "M5 - Mars Magnetospheric Multipoint Measurement Mission: A multi-spacecraft plasma physics mission to Mars",
      "authors": [
        "Cormac J. K. Larkin",
        "Ville Lundén",
        "Leonard Schulz",
        "Markus Baumgartner-Steinleitner",
        "Marianne Brekkum",
        "Adam Cegla",
        "Pietro Dazzi",
        "Alessia De Iuliis",
        "Jonas Gesch",
        "Sofia Lennerstrand",
        "Sara Nesbit-Östmann",
        "Vasco D. C. Pires",
        "Inés Terraza Palanca",
        "Daniel Teubenbacher",
        "Florine Enengl",
        "Marcus Hallmann"
      ],
      "abstract": "M5 - Mars Magnetospheric Multipoint Measurement Mission: A multi-spacecraft plasma physics mission to Mars Cormac J. K. Larkin, Ville Lundén, Leonard Schulz, Markus Baumgartner-Steinleitner, Marianne Brekkum, Adam Cegla, Pietro Dazzi, Alessia De Iuliis, Jonas Gesch, Sofia Lennerstrand, Sara Nesbit-Östmann, Vasco D. C. Pires, Inés Terraza Palanca, Daniel Teubenbacher, Florine Enengl, Marcus Hallmann 16 pages, 9 figures. Published in Advances in Space Research, updated to accepted version Advances in Space Research 73 (2024) 3235-3255 Space Physics (physics.space-ph); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Geophysics (physics.geo-ph); Plasma Physics (physics.plasm-ph) Mars, lacking an intrinsic dynamo, is an ideal laboratory to comparatively study induced magnetospheres, which can be found in other terrestrial bodies as well as comets. Additionally, Mars is of particular interest to further exploration due to its loss of habitability by atmospheric escape and possible future human exploration. In this context, we propose the Mars Magnetospheric Multipoint Measurement Mission (M$^5$), a multi-spacecraft mission to study the dynamics and energy transport of the Martian induced magnetosphere comprehensively. Particular focus is dedicated to the largely unexplored magnetotail region, where signatures of magnetic reconnection have been found. Furthermore, a reliable knowledge of the upstream solar wind conditions is needed to study the dynamics of the Martian magnetosphere, especially the different dayside boundary regions but also for energy transport phenomena like the current system and plasma waves. This will aid the study of atmospheric escape processes of planets with induced magnetospheres. In order to resolve the three-dimensional structures varying both in time and space, multi-point measurements are required. Thus, M$^5$ is a five spacecraft mission, with one solar wind monitor orbiting Mars in a circular orbit at 5 Martian radii, and four smaller spacecraft in a tetrahedral configuration orbiting Mars in an elliptical orbit, spanning the far magnetotail up to 6 Mars radii with a periapsis within the Martian magnetosphere of 1.8 Mars radii. We not only present a detailed assessment of the scientific need for such a mission but also show the resulting mission and spacecraft design taking into account all aspects of the mission requirements and constraints such as mass, power, and link budgets. This mission concept was developed during the Alpbach Summer School 2022.",
      "pdf_url": "https://arxiv.org/pdf/2303.09502.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06366",
      "title": "JWST occultation reveals unforeseen complexity in Chariklo's ring system",
      "authors": [
        "Pablo Santos-Sanz",
        "Altair R. Gomes-Júnior",
        "Bruno E. Morgado",
        "Yucel Kilic",
        "Csilla E. Kalup",
        "Csaba Kiss",
        "Chrystian L. Pereira",
        "Bryan J. Holler",
        "Nicolás Morales",
        "José Luis Ortiz",
        "Bruno Sicardy",
        "Juan Luis Rizos",
        "John Stansberry",
        "Richard G. French",
        "Heidi B. Hammel",
        "Zhong-Yi Lin",
        "Damya Souami",
        "Josselin Desmars",
        "Stefanie N. Milam",
        "Felipe Braga-Ribas",
        "Marcelo Assafin",
        "Gustavo Benedetti-Rossi",
        "Julio I. B. Camargo",
        "René Duffard",
        "Flavia L. Rommel",
        "Estela Fernández-Valenzuela",
        "Noemí Pinilla-Alonso",
        "Mónica Vara-Lubiano"
      ],
      "abstract": "JWST occultation reveals unforeseen complexity in Chariklo's ring system Pablo Santos-Sanz, Altair R. Gomes-Júnior, Bruno E. Morgado, Yucel Kilic, Csilla E. Kalup, Csaba Kiss, Chrystian L. Pereira, Bryan J. Holler, Nicolás Morales, José Luis Ortiz, Bruno Sicardy, Juan Luis Rizos, John Stansberry, Richard G. French, Heidi B. Hammel, Zhong-Yi Lin, Damya Souami, Josselin Desmars, Stefanie N. Milam, Felipe Braga-Ribas, Marcelo Assafin, Gustavo Benedetti-Rossi, Julio I. B. Camargo, René Duffard, Flavia L. Rommel, Estela Fernández-Valenzuela, Noemí Pinilla-Alonso, Mónica Vara-Lubiano This manuscript contains 41 pages, 14 figures, and 5 tables Earth and Planetary Astrophysics (astro-ph.EP) Ring systems have recently been discovered around several small bodies in the outer Solar System through stellar occultations. While such measurements provide key information on ring geometry and dynamical interactions, little is known about their composition, grain size distribution, origin, lifetime, or evolutionary pathways. Here we report near-infrared observations from the James Webb Space Telescope (JWST) of a stellar occultation by the Centaur (10199) Chariklo, providing unprecedented constraints on the material properties of a small-body ring system and offering insights into their origin and evolution. These measurements reveal that Chariklo's inner dense ring contains predominantly micrometer-sized particles and exhibits a significant increase in opacity compared to previous observations, suggesting active replenishment events. Most strikingly, the outer ring shows a much weaker near-infrared occultation signature than in earlier visible-light detections. This discrepancy may indicate ongoing material loss, implying that the outer ring is transient, or it may reflect wavelength-dependent opacity consistent with a dusty structure dominated by $0.2$-$0.5$ $\\mu$m silicate grains. These scenarios, not mutually exclusive, point to an unprecedented level of complexity in small-body ring systems, unlike anything observed around other minor bodies in the Solar System.",
      "pdf_url": "https://arxiv.org/pdf/2510.06366.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06589",
      "title": "Revisiting the Orbital Dynamics of the Hot Jupiter WASP-12b with New Transit Times",
      "authors": [
        "Shraddha Biswas",
        "Ing-Guey Jiang",
        "Li-Chin Yeh",
        "Hsin-Min Liu",
        "Kaviya Parthasarathy",
        "D. Bisht",
        "Sandip K Chakrabarti",
        "D Bhowmick",
        "Mohit Singh Bisht",
        "A. Raj",
        "Bryan E. Martin",
        "R. K. S. Yadav",
        "Geeta Rangwal"
      ],
      "abstract": "Revisiting the Orbital Dynamics of the Hot Jupiter WASP-12b with New Transit Times Shraddha Biswas, Ing-Guey Jiang, Li-Chin Yeh, Hsin-Min Liu, Kaviya Parthasarathy, D. Bisht, Sandip K Chakrabarti, D Bhowmick, Mohit Singh Bisht, A. Raj, Bryan E. Martin, R. K. S. Yadav, Geeta Rangwal 30 pages, submitted to AJ, the machine-readable forms of Table 4 and 9 are included in source files Earth and Planetary Astrophysics (astro-ph.EP) In this study, we examine the transit timing variations (TTVs) of the extensively studied hot Jupiter WASP-12b using a comprehensive dataset of 391 transit light curves. The dataset includes 7 new photometric observations obtained with the 1.3 m Devasthal Fast Optical Telescope, the 0.61 m VASISTHA telescope, and the 0.3 m AG Optical IDK telescope, along with 119 light curves from the Transiting Exoplanet Survey Satellite (TESS), 97 from the Exoplanet Transit Database (ETD), 34 from the ExoClock Project, and 134 from previously published sources. To ensure homogeneity and precision, we modeled all 391 light curves and determined their mid-transit times. A detailed transit timing analysis revealed a significant orbital decay rate of $-30.31 \\, \\mathrm{ms \\, yr^{-1}}$, corresponding to a stellar tidal quality factor of $Q'_\\star = 1.61 \\times 10^{5}$, thereby confirming that the orbit of WASP-12b is indeed decaying rapidly. Furthermore, the computation of model selection metrics ($\\chi^2_r$, BIC, AIC) favors orbital decay as the most likely explanation. However, the presence of an eccentricity above the threshold value allows apsidal precession to remain a viable alternative. We also derived a planetary Love number of $k_p = 0.66 \\pm 0.28$, consistent with Jupiter's value, suggesting a similar internal density distribution. Therefore, while orbital decay is strongly supported, apsidal precession cannot be ruled out as another contributing effect, highlighting the necessity of continued high-precision monitoring to resolve the system's orbital evolution.",
      "pdf_url": "https://arxiv.org/pdf/2510.06589.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.06978",
      "title": "Protoplanetary disc population synthesis I. Constraining disc parameters to reproduce disc observations",
      "authors": [
        "Jose L. Gomez",
        "Octavio M. Guilera",
        "Marcelo M. Miller Bertolami",
        "Elisa Castro-Martínez",
        "María Paula Ronco"
      ],
      "abstract": "Protoplanetary disc population synthesis I. Constraining disc parameters to reproduce disc observations Jose L. Gomez, Octavio M. Guilera, Marcelo M. Miller Bertolami, Elisa Castro-Martínez, María Paula Ronco Submitted to A&A. Reduced abstract. Feedback is welcome Earth and Planetary Astrophysics (astro-ph.EP) Context. Protoplanetary discs are the birthplaces of planets. Recent studies highlight the role of stellar mass sampling in determining disc lifetimes from the observed fraction of stars with discs. Low-mass stars tend to host longer-lived discs, allowing planet formation via solid accretion. Observations also reveal a strong correlation between stellar (and substellar) mass and accretion rate, typically following $\\dot{M}\\propto M_\\star^2$. Aims. We aim to identify the optimal parameters of a disc evolution model that reproduces both the observed disc fractions and accretion rates in young stellar populations. Methods. We performed a population synthesis study exploring different dependencies of the viscosity parameter $\\alpha$ on stellar mass. Disc evolution includes viscous accretion and photoevaporation (internal and external). Initial disc masses and radii were drawn from observationally motivated distributions, while stellar masses followed a given distribution and a time-dependent star formation rate (SFR) was introduced. Results. Matching observed disc fractions and accretion trends requires $\\alpha$ to increase with stellar mass. External photoevaporation is necessary to produce low-mass discs with high accretion rates, and a time-dependent SFR enhances accretion in young clusters while extending disc lifetimes in older ones. A stellar mass cut-off reproduces the distance-dependent biases in observed disc fractions. Conclusions. Both stellar and environmental effects are essential to explain the observed properties of protoplanetary discs. A stellar-mass-dependent viscosity reproduces the $\\dot{M}$-$M_\\star$ relation, while external photoevaporation and extended star formation histories shape the accretion rate distribution across environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.06978.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07003",
      "title": "Modeling the formation of N2 and CH4 frost on Pluto's slopes",
      "authors": [
        "L.Lange",
        "T.Bertrand",
        "V.Belissa",
        "S.Capry",
        "L.A. Young",
        "A.Falco"
      ],
      "abstract": "Modeling the formation of N2 and CH4 frost on Pluto's slopes L.Lange, T.Bertrand, V.Belissa, S.Capry, L.A. Young, A.Falco Earth and Planetary Astrophysics (astro-ph.EP) Context:Previous studies suggested that these frosts could result from the peculiar insolation driven by the geometry of these slopes, but this has never been quantitatively tested. We aim to investigate the origin, stability, and potential role in Pluto's volatile cycle of these localized frost deposits. Methods:We implemented a new sub-grid-scale slope parameterization in the Pluto Volatile Transport Model, which accounts for the specific solar irradiation and resulting surface and subsurface temperatures on sloped terrains. This parameterization also allows the condensation and sublimation of volatiles (either N2 or CH4) on slopes, including the effect of large-scale transport of these species, which is key to determining the amount of frost that forms or disappears. Results: Our simulations reproduce the observed CH4 frost on North-facing slopes as seasonal deposits currently sublimating, predict perennial CH4 frost on South-facing slopes, and show that slope microclimates should not alter global volatile cycles. Conclusions: Seasonal and perennial N2 and CH4 frosts can form across Pluto's slopes, even in its darkest and warmest regions, due to the locally reduced sunlight received on inclined terrain. Nevertheless, despite Pluto's abundance of sloped surfaces, slope microclimates appear to have only a minor effect on the planet's global volatile cycles.",
      "pdf_url": "https://arxiv.org/pdf/2510.07003.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07253",
      "title": "JWST-TST High Contrast: Medium-resolution spectroscopy reveals a carbon-rich circumplanetary disk around the young accreting exoplanet Delorme 1 AB b",
      "authors": [
        "Mathilde Mâlin",
        "Kimberly Ward-Duong",
        "Sierra L. Grant",
        "Nicole Arulanantham",
        "Benoît Tabone",
        "Laurent Pueyo",
        "Marshall Perrin",
        "William O. Balmer",
        "Sarah Betti",
        "Christine H. Chen",
        "John H. Debes",
        "Julien H. Girard",
        "Kielan K. W. Hoch",
        "Jens Kammerer",
        "Cicero Lu",
        "Isabel Rebollido",
        "Emily Rickman",
        "Connor Robinson",
        "Kadin Worthen",
        "Roeland P. van der Marel",
        "Nikole K. Lewis",
        "Sara Seager",
        "Jeff A. Valenti",
        "Remi Soummer"
      ],
      "abstract": "JWST-TST High Contrast: Medium-resolution spectroscopy reveals a carbon-rich circumplanetary disk around the young accreting exoplanet Delorme 1 AB b Mathilde Mâlin, Kimberly Ward-Duong, Sierra L. Grant, Nicole Arulanantham, Benoît Tabone, Laurent Pueyo, Marshall Perrin, William O. Balmer, Sarah Betti, Christine H. Chen, John H. Debes, Julien H. Girard, Kielan K. W. Hoch, Jens Kammerer, Cicero Lu, Isabel Rebollido, Emily Rickman, Connor Robinson, Kadin Worthen, Roeland P. van der Marel, Nikole K. Lewis, Sara Seager, Jeff A. Valenti, Remi Soummer Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) Young accreting planetary-mass objects are thought to draw material from a circumplanetary disk (CPD) composed of gas and dust. While the gas within the disk is expected to disperse within the first million years, strong accretion has nonetheless been detected in older systems, including the 30--45 Myr-old planetary-mass companion Delorme 1 AB b. We conducted spectroscopic observations with JWST/MIRI to investigate the presence of circumplanetary material around this young, accreting planet, and to characterize the planet's atmospheric properties and composition. We perform forward modeling using atmospheric models to characterize the planet's atmosphere. Beyond 10 microns, the SED becomes dominated by this CPD rather than the planet itself. We detect strong emission from HCN and C$_2$H$_2$, while no O-bearing species are observed in the CPD spectrum, suggesting the gas in the CPD has an elevated C/O. We also identify spatially extended H$_2$ emission around the planet, tracing warm gas, with indications that it may be at a higher temperature than the non-extended component. The mid-infrared spectrum of the planetary-mass companion Delorme 1 AB b reveals the first detection of bright C-bearing species in a CPD, together with an outflow traced by H$_2$ extended emission, that could be interpreted as a disk wind. The hot dust continuum emission suggests an inner cavity in the CPD. The presence of warm gas in the CPD provides constraints on the disk's chemical composition and physical conditions, opening up new avenues for disk studies. The study of these long-lived \"Peter Pan\" disks will enhance our understanding of how accretion persists in evolved low-mass systems, shedding light on their formation, longevity, and evolutionary pathways in planetary systems.",
      "pdf_url": "https://arxiv.org/pdf/2510.07253.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}