{
  "date": "2026-01-18",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.EP",
    "astro-ph.CO",
    "astro-ph.SR",
    "astro-ph.IM",
    "astro-ph.HE",
    "astro-ph.GA"
  ],
  "total_papers": 95,
  "gw_related_papers": 11,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.09764",
      "title": "DC response of an interferometer topology with an L-shaped cavity: a tabletop study",
      "authors": [
        "Junlang Li",
        "Jiehong Huang",
        "Xinyao Guo",
        "Haixing Miao",
        "Yuchao Chen",
        "Xiaoman Huang",
        "Yuan Pan",
        "Chenjie Zhou",
        "Raffaele Flaminio",
        "Jameson Graef Rollins",
        "Bram Slagmolen",
        "Fan Zhang",
        "Teng Zhang",
        "Mengyao Wang"
      ],
      "abstract": "DC response of an interferometer topology with an L-shaped cavity: a tabletop study Junlang Li, Jiehong Huang, Xinyao Guo, Haixing Miao, Yuchao Chen, Xiaoman Huang, Yuan Pan, Chenjie Zhou, Raffaele Flaminio, Jameson Graef Rollins, Bram Slagmolen, Fan Zhang, Teng Zhang, Mengyao Wang Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); Optics (physics.optics) A new interferometer topology for kilohertz gravitational-wave detection was recently proposed in [Zhang et al. Phys. Rev. X 13, 021019 (2023)]. The design is based on an L-shaped optical cavity pumped through a Sagnac-like vortex. We report a tabletop experiment that characterizes the interferometer's optical response near DC. When the laser frequency is locked to the resonance of the L-shaped cavity, we observe that the cavity input coupler becomes effectively transparent, yielding a simple Michelson-like response. Moreover, the Sagnac vortex separates into upper and lower paths, which behave as two independent pumping paths driving the cavity. These observations are in agreement with theoretical predictions. Our results provide an intuitive physical picture of this interferometer topology and offer insight into its lock acquisition strategy.",
      "pdf_url": "https://arxiv.org/pdf/2601.09764.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.09918",
      "title": "Monitoring of Continuous-Wave Hardware Injections in LIGO Interferometers during the O4 Observing Run",
      "authors": [
        "Preet Baxi",
        "Jessica Leviton",
        "Eilam Morag",
        "Matthew Pitkin",
        "Keith Riles"
      ],
      "abstract": "Monitoring of Continuous-Wave Hardware Injections in LIGO Interferometers during the O4 Observing Run Preet Baxi, Jessica Leviton, Eilam Morag, Matthew Pitkin, Keith Riles Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Although there have now been hundreds of transient gravitational-wave detections of merging compact stars by the LIGO-Virgo-KAGRA (LVK) detector network, no continuous-wave (CW) signals have yet been discovered. To ensure that such signals, expected to be exceedingly weak, can be detected in the ongoing O4 observing run by coherent integration over years, simulated waveforms ('hardware injections') are injected directly into the LIGO data by continuously modulating the positions of the interferometer mirrors so as to mimic nearly sinusoidal signals from fast-spinning galactic neutron stars. A set of 18 such simulated CW sources are injected with signal frequencies spanning much of the LIGO detection band and with varying sky locations. By verifying the successful recovery of the simulated signals, including preservation of absolute phase over as many as 10^{11} signal cycles, we validate our understanding of detector response and end-to-end search pipelines, including data cleaning. Daily and weekly monitoring of the signal reconstruction is meant to catch any unexpected sudden changes in interferometer response, to verify that signal-to-noise ratio increases as expected and to verify that simulated source parameters are recovered correctly. We describe three methods of monitoring: 1) a highly templated matched filter to extract signal amplitude and phase precisely; 2) a frequentist Fstatistic evaluation that marginalizes over amplitude, phase and orientation of the star; and 3) a Bayesian reconstruction of the source parameters together with noise characterization. Results from each method are shown, with emphasis on the new templated method, which yields precise measurement of the critical phase offset parameter and therefore validates understanding of absolute timing delays in the detector response and data stream.",
      "pdf_url": "https://arxiv.org/pdf/2601.09918.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.10699",
      "title": "Late-time acceleration without a vacuum term in ${f(R,L_m)}$ gravity: scaling deSitter dynamics and parameter constraints",
      "authors": [
        "Luciano Navarro-Coydán",
        "J. Alberto Vázquez",
        "Israel Quiros",
        "Ricardo García-Salcedo"
      ],
      "abstract": "Late-time acceleration without a vacuum term in ${f(R,L_m)}$ gravity: scaling deSitter dynamics and parameter constraints Luciano Navarro-Coydán, J. Alberto Vázquez, Israel Quiros, Ricardo García-Salcedo Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We investigate late-time cosmic acceleration in $f(R,L_m)$ gravity driven by nonlinear matter contributions, focusing on the class $f(R,L_m)=R/2+c_1 L_m+c_n L_m^{n}+c_0$ with the explicit choice $L_m=\\rho_m$ and an uncoupled radiation sector. We analyze two realizations: (i) Case A: $f(R,L_m)=R/2+\\beta \\rho_m^{n}+\\gamma$, where $\\gamma$ acts as a vacuum term, and (ii) Case B: $f(R,L_m)=R/2+\\beta \\rho_m+\\gamma \\rho_m^{n}$, where the nonlinear sector can mimic dark energy without an explicit cosmological constant. For each case, we construct a bounded autonomous system, classify all critical points and their stability, and compute cosmographic diagnostics. The phase-space analysis shows that Case A reproduces the standard radiation$\\to$matter$\\to$de~Sitter sequence only for $n\\gtrsim 4/5$, with acceleration essentially enforced by the vacuum term. In contrast, Case~B admits a qualitatively distinct and phenomenologically appealing branch: for $0<n<1/2$ the system possesses a physical \\emph{scaling} de~Sitter future attractor inside the bounded simplex, yielding radiation$\\to$matter$\\to$acceleration with $q=-1$ and $\\omega_{\\rm eff}=-1$ and without introducing $c_0$. We confront both models with background data (CC, Union3, DESI BAO, plus a BBN prior on $\\Omega_b h^2$) using nested sampling and perform model comparison via Bayesian evidence and AIC/BIC. The full data combination constrains $n=1.08\\pm0.05$ in Case A and $n=0.05\\pm0.10$ in Case B (68\\% CL), the latter lying within the accelerating window while remaining statistically consistent with $\\Lambda$CDM kinematics at the background level. We also record minimal consistency conditions for stability (tensor no-ghost and luminal propagation) and motivate a dedicated perturbation-level analysis as the next step to test growth and lensing observables.",
      "pdf_url": "https://arxiv.org/pdf/2601.10699.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.02750",
      "title": "Gravitational-Wave Signatures of Nonstandard Neutrino Properties in Collapsing Stellar Cores",
      "authors": [
        "Jakob Ehring , Sajad Abbar , H.-Thomas Janka , Georg Raffelt , Ko Nakamura , Kei Kotake Academia Sinica, Taipei City, Taiwan, MPI Physics, Garching, Germany, MPI Astrophysics, Garching, Germany, Fukuoka University, Japan, University of Wroclaw, Poland)"
      ],
      "abstract": "Gravitational-Wave Signatures of Nonstandard Neutrino Properties in Collapsing Stellar Cores Jakob Ehring (1,2,3), Sajad Abbar (2), H.-Thomas Janka (3), Georg Raffelt (2), Ko Nakamura (4), Kei Kotake (4,5) ((1) Academia Sinica, Taipei City, Taiwan, (2) MPI Physics, Garching, Germany, (3) MPI Astrophysics, Garching, Germany, (4) Fukuoka University, Japan, (5) University of Wroclaw, Poland) 5 pages + 10 pages Supplemental Material (SM), 3 figures + 6 figures in SM; this version combines the letter and SM for convenience; during peer review we added a resolution study and extended the discussion about potential BSM scenarios; published in Phys. Rev. Letters High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) We present a novel multi-messenger approach for probing nonstandard neutrino properties through the detection of gravitational waves (GWs) from collapsing stellar cores and associated supernova explosions. We show that neutrino flavor conversion inside the proto-neutron star (PNS), motivated by physics Beyond the Standard Model (BSM), can significantly boost PNS convection. This effect leads to large-amplitude GW emission over a wide frequency range during an otherwise relatively quiescent GW phase shortly after core bounce. Such a signal provides a promising new avenue for exploring nonstandard neutrino phenomena and other BSM physics impacting PNS convection.",
      "pdf_url": "https://arxiv.org/pdf/2412.02750.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.18363",
      "title": "Topology of the Superconducting Heart of Neutron Stars: Effects of Microphysics and Gravitational-Wave Signatures",
      "authors": [
        "Mayusree Das",
        "Armen Sedrakian",
        "Banibrata Mukhopadhyay"
      ],
      "abstract": "Topology of the Superconducting Heart of Neutron Stars: Effects of Microphysics and Gravitational-Wave Signatures Mayusree Das (IISc), Armen Sedrakian (UWr, FIAS), Banibrata Mukhopadhyay (IISc) 18 latex pages including 14 figures (14 jpg files) and 1 table; modified and rearranged throughout for clarity; the version accepted for publication in Physical Review D High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) We present a general-relativistic study of the distribution of proton superconductivity in strongly magnetized neutron stars (NSs), using the XNS code to solve the coupled Einstein-Maxwell equations. We investigate equilibrium configurations with both toroidal and poloidal magnetic field geometries and incorporate complex many-body effects through microscopically derived proton pairing gaps. The models employ equations of state (EoS) obtained from microscopic many-body theory - including realistic two- and three-body nuclear interactions - as well as from relativistic mean-field approaches. We compare superconducting topologies across our collection of EoS and explore the influences of magnetic field geometry in stellar models parameterized by central density. Our models confirm the absence of $S$-wave superconductivity in the inner core and, importantly, reveal that non-superconducting regions exhibit complex three-dimensional geometries: doughnut-shaped for toroidal fields and prolate-shaped for poloidal fields -- spatial structures that are inherently absent in one-dimensional analyses. We also compute magnetic deformations and ellipticities for several millisecond pulsars (MSPs), estimating their continuous gravitational wave strain. While these MSPs remain undetectable by current detectors, next-generation instruments such as the Einstein Telescope and Cosmic Explorer may detect their signals, opening an observational window into internal superconductivity and internal magnetic field of NSs, as well as the fundamental microphysics of dense matter.",
      "pdf_url": "https://arxiv.org/pdf/2508.18363.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.20171",
      "title": "Abundance of cosmic voids in EFT of dark energy",
      "authors": [
        "Toshiki Takadera",
        "Shin'ichi Hirano",
        "Tsutomu Kobayashi"
      ],
      "abstract": "Abundance of cosmic voids in EFT of dark energy Toshiki Takadera, Shin'ichi Hirano, Tsutomu Kobayashi Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Cosmic voids in the large-scale structure are among the useful probes for testing gravity on cosmological scales. In this paper, we investigate the evolution of voids in the Horndeski theory using the effective field theory (EFT) of dark energy. Modeling the void formation with the dynamics of spherical mass shells, we study how modifications of gravity encoded into the EFT of dark energy change the linearly extrapolated critical density contrast that is relevant for the criterion for void formation, with particular focus on the time-dependent parameter characterizing the effect of kinetic braiding. It is found that the change in the critical density contrast is one order of magnitude smaller than the dimensionless EFT parameter because of a slight imbalance between two compensating effects. We then compute the void abundance using the Sheth--van de Weygaert void size function and demonstrate that it exhibits scale-dependent modifications. It is shown that the modifications to the void size function on small scales are almost entirely determined by the modified linear matter power spectrum, while the modifications on large scales are dominated by the contributions from the linear matter spectrum and the critical density contrast.",
      "pdf_url": "https://arxiv.org/pdf/2512.20171.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09054",
      "title": "Upper limits on microhertz gravitational waves from supermassive black-hole binaries using PSR J1909-3744 data from the second IPTA data release",
      "authors": [
        "Jing Zou",
        "Jingbo Wang Jianping Yuan",
        "De Zhao",
        "Yirong Wen",
        "Wei Li",
        "Na Wang",
        "Yong Xia"
      ],
      "abstract": "Upper limits on microhertz gravitational waves from supermassive black-hole binaries using PSR J1909-3744 data from the second IPTA data release Jing Zou, Jingbo Wang Jianping Yuan, De Zhao, Yirong Wen, Wei Li, Na Wang, Yong Xia 17 pages, 5 figures,accepted by Apj High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We present the results of a search for gravitational waves (GWs) from individual sources using high-cadence observations of PSR J1909\\(-\\)3744 obtained during an intensive observing campaign with the International Pulsar Timing Array second data release (IPTA-DR2) between July 2010 and November 2012. The observations, conducted at three different radio frequencies with the Nançay Radio Telescope (NRT) and Parkes Telescope (PKS) and five frequencies with the Green Bank Telescope (GBT), enabled precise corrections for dispersion measure effects and scattering variations. After these corrections, the timing residuals showed an unmodeled periodic noise component with an amplitude of 340 ns. Our analysis yields upper limits on the GW strain from individual sources, constraining it to be below \\(1.9 \\times 10^{-14}\\) at 71 nHz and \\(2.3 \\times 10^{-13}\\) at 1 \\textmu Hz for average sky locations, while for optimal source locations the limits improve to \\(6.2 \\times 10^{-15}\\) and \\(8.9 \\times 10^{-14}\\) at the same frequencies, respectively. Our new limits are about a factor of 1.52 more stringent than those of Perera et al. based on an earlier EPTA data.",
      "pdf_url": "https://arxiv.org/pdf/2601.09054.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.09803",
      "title": "Dark energy driven by an oscillating generalised axion-like quintessence field",
      "authors": [
        "Mariam Bouhmadi-López",
        "Carlos G. Boiza"
      ],
      "abstract": "Dark energy driven by an oscillating generalised axion-like quintessence field Mariam Bouhmadi-López, Carlos G. Boiza 15 pages, 5 figures, RevTex 4-2 Cosmology and Nongalactic Astrophysics (astro-ph.CO) Generalised axion-like scalar fields provide a well-motivated framework for describing the late-time acceleration of the Universe. As the field evolves, it rolls down its potential and, depending on its mass and initial conditions, it may either still be approaching the minimum or already oscillating around it. These two dynamical regimes require distinct treatments of cosmological perturbations. In this work, we perform a detailed analysis of linear cosmological perturbations in the regime where the dark-energy scalar field undergoes coherent oscillations about the minimum of its potential. We show that the standard effective fluid description breaks down in this phase and develop a consistent field-based perturbation framework, which we use to assess the impact of oscillatory dark energy on the growth of cosmic structures.",
      "pdf_url": "https://arxiv.org/pdf/2601.09803.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10152",
      "title": "The BINGO project X. Cosmological parameter constraints from HI Intensity Mapping lognormal simulations",
      "authors": [
        "Pablo Motta",
        "Camila P. Novaes",
        "Elcio Abdalla",
        "Jiajun Zhang",
        "Gabriel A. Hoerning",
        "Alessandro Marins",
        "Eduardo J. de Mericia",
        "Luiza O. Ponte",
        "Amilcar R. Queiroz",
        "Thyrso Villela",
        "Bin Wang",
        "Carlos A. Wuensche",
        "Chang Feng",
        "Edmar C. Gurjão"
      ],
      "abstract": "The BINGO project X. Cosmological parameter constraints from HI Intensity Mapping lognormal simulations Pablo Motta, Camila P. Novaes, Elcio Abdalla, Jiajun Zhang, Gabriel A. Hoerning, Alessandro Marins, Eduardo J. de Mericia, Luiza O. Ponte, Amilcar R. Queiroz, Thyrso Villela, Bin Wang, Carlos A. Wuensche, Chang Feng, Edmar C. Gurjão Cosmology and Nongalactic Astrophysics (astro-ph.CO) Building on the transformative success of optical redshift surveys, the emerging technique of neutral hydrogen (HI) intensity mapping (IM) offers a novel probe of large-scale structure (LSS) growth and the late-time accelerated expansion of the universe. We present cosmological forecasts for the Baryon Acoustic Oscillations from Integrated Neutral Gas Observations (BINGO), a pioneering HI IM experiment, quantifying its potential to constrain the \\textit{Planck}-calibrated $\\Lambda$CDM cosmology and extensions to the $w_0w_a$CDM dark energy model. For BINGO's Phase~1 configuration, we simulate the HI IM signal using a lognormal model and incorporate three dominant systematics: foreground residuals, thermal noise, and beam resolution effects. Using Bayesian inference, we derive joint constraints on six cosmological parameters ($\\Omega_b h^2$, $\\Omega_c h^2$, $100\\theta_s$, $n_s$, $\\ln 10^{10} A_s$, and $\\tau_r$) alongside 60 HI parameters ($b_{\\rm HI}^i$, $\\Omega_{\\rm HI}^i b_{\\rm HI}^i$) across 30 frequency channels. Our results demonstrate that combining BINGO with the Planck 2018 CMB dataset tightens the confidence regions of cosmological parameters to $\\sim$40\\% the size of those from Planck alone, significantly improving the precision of parameter estimation. Furthermore, BINGO constrains the redshift evolution of HI density and delivers competitive measurements of the dark energy equation of state parameters ($w_0$, $w_a$). These results demonstrate BINGO's potential to extract significant cosmological information from the HI distribution and provide constraints competitive with current and future cosmological surveys.",
      "pdf_url": "https://arxiv.org/pdf/2601.10152.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10304",
      "title": "Effect of Primordial Black Holes on the global 21-cm signal",
      "authors": [
        "Atrideb Chatterjee"
      ],
      "abstract": "Effect of Primordial Black Holes on the global 21-cm signal Atrideb Chatterjee Cosmology and Nongalactic Astrophysics (astro-ph.CO) The 21-cm global signal, a treasure trove of information about the nature of the first luminous sources of the Universe, has traditionally been modelled assuming that these early sources were predominantly star-forming galaxies. However, recent observations by the James Webb Space Telescope (JWST) have revealed several AGNs as early as z ~ 10 - 10.4 . In light of this, it is important to investigate the contribution of such AGNs to the 21-cm signal. Assuming that these AGNs are seeded by Primordial Black Holes (PBHs) and employing an analytical PBH model, consistent with existing cosmological and astrophysical constraints, we show that these exotic objects can have a significant impact on the redshift evolution of the global signal.",
      "pdf_url": "https://arxiv.org/pdf/2601.10304.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10314",
      "title": "Extracting intrinsic alignments in the Dark Energy Survey's year 1 data, using the self-calibration method and LSST-DESC tools",
      "authors": [
        "Eske M. Pedersen, Leonel Medina-Varela, Emily Phillips Longley, Mustapha Ishak, Joe Zuntz, Chihway Chang, C. Danielle Leonard )"
      ],
      "abstract": "Extracting intrinsic alignments in the Dark Energy Survey's year 1 data, using the self-calibration method and LSST-DESC tools Eske M. Pedersen, Leonel Medina-Varela, Emily Phillips Longley, Mustapha Ishak, Joe Zuntz, Chihway Chang, C. Danielle Leonard (for the LSST Dark Energy Science Collaboration (LSST DESC)) Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present the implementation of a Self-Calibration of Intrinsic Alignments of galaxies as an extension to the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) Dark Energy Science Collaboration (DESC)'s weak lensing 3x2pt pipeline (TXPipe). As a demonstration, we have run this pipeline on the Dark Energy Survey (DES) year one data set. We find indications of a non-zero intrinsic alignment signal in the higher redshift bins, while in the lower bins our results look more uncertain. We believe this is caused by known issues with the individual galaxies photo-z estimation. This effect is particularly harmful for the self-calibration method, since it has high requirements for reliable estimation of the photo-$z$s, and the need for individual galaxy point estimates and tomographic binning to match. We show how different methods of recreating the redshift probability distribution can affect the detection of intrinsic alignment.",
      "pdf_url": "https://arxiv.org/pdf/2601.10314.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10640",
      "title": "Cosmoglobe DR2. VI. Disentangling hot and cold thermal dust emission with Planck HFI",
      "authors": [
        "R. M. Sullivan",
        "E. Gjerløw",
        "M. Galloway",
        "D. J. Watts",
        "R. Aurvik",
        "A. Basyrov",
        "L. A. Bianchi",
        "A. Bonato",
        "M. Brilenkov",
        "H. K. Eriksen",
        "U. Fuskeland",
        "K. A. Glasscock",
        "L. T. Hergt",
        "D. Herman",
        "J. G. S. Lunde",
        "A. I. Silva Martins",
        "M. San",
        "D. Sponseller",
        "N.-O. Stutzer",
        "H. Thommesen",
        "V. Vikenes",
        "I. K. Wehus",
        "L. Zapelli"
      ],
      "abstract": "Cosmoglobe DR2. VI. Disentangling hot and cold thermal dust emission with Planck HFI R. M. Sullivan, E. Gjerløw, M. Galloway, D. J. Watts, R. Aurvik, A. Basyrov, L. A. Bianchi, A. Bonato, M. Brilenkov, H. K. Eriksen, U. Fuskeland, K. A. Glasscock, L. T. Hergt, D. Herman, J. G. S. Lunde, A. I. Silva Martins, M. San, D. Sponseller, N.-O. Stutzer, H. Thommesen, V. Vikenes, I. K. Wehus, L. Zapelli 19 pages, 20 figures, 3 tables. Data available at this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a four-component high-resolution model of thermal dust emission for microwave and sub-mm frequencies derived from Planck HFI, WHAM and Gaia. The resulting high-resolution model derived here forms the basis for the thermal dust model employed in the Cosmoglobe DR2 reanalysis of COBE-DIRBE. The four dust components are called ``cold dust'', ``hot dust'', ``nearby dust'', and ``Ha correlated dust'', respectively, and trace different physical environments. The spatial distributions of the nearby dust and Ha dust components are defined by the Edenhofer et al. Gaia 3D extinction model and the WHAM survey, respectively, while the hot and cold dust components are fit freely pixel-by-pixel to the Planck HFI data. We use a global parameter grid search coupled to an amplitude map Gibbs sampler to fit this model to Planck HFI data. In agreement with the companion low-resolution analysis, we find that the hot dust component is strongly correlated with the FIRAS Cii map, while the cold dust component is strongly correlated with the HI4PI Hi map. Despite its fewer degrees of freedom per pixel compared to the Planck 2015 legacy dust model, we find that this new model performs competitively in terms of overall residuals, capturing over 98% of the full-sky dust variance for all channels. When fitting a spatially varying 3-parameter MBB model to the new dust model with isotropic SEDs, we find very similar spatial distributions to those of the official Planck analysis, and this new model thus represents an economical decomposition of previously published spatially varying spectral parameter maps. We conclude that this new model represents both a statistically more efficient summary of thermal dust in the microwave and far-infrared regimes and a physically more realistic decomposition of the sky compared to the traditional 3-parameter MBB model. (abridged)",
      "pdf_url": "https://arxiv.org/pdf/2601.10640.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10472",
      "title": "From Weibel seeds to collisionless dynamos beyond pair-plasmas",
      "authors": [
        "Lise Hanebring",
        "James Juno",
        "Ammar Hakim",
        "Jason M. TenBarge",
        "Istvan Pusztai"
      ],
      "abstract": "From Weibel seeds to collisionless dynamos beyond pair-plasmas Lise Hanebring, James Juno, Ammar Hakim, Jason M. TenBarge, Istvan Pusztai Plasma Physics (physics.plasm-ph); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Bridging the spatiotemporal scales of magnetic seed field generation and subsequent dynamo amplification in the weakly collisional intracluster medium presents an extreme numerical challenge. We perform collisionless turbulence simulations with initially unmagnetized electrons that capture both magnetic seed generation via the electron Weibel instability and the ensuing dynamo amplification. Going beyond existing pair-plasma studies, we use an ion-to-electron mass ratio of 100 for which we find electron and ion dynamics are sufficiently decoupled. These simulations are enabled by the 10-moment collisionless fluid solver of Gkeyll, which evolves the full pressure tensor for all species. The electron heat-flux closure regulates pressure isotropization and effectively sets the magnetic Reynolds number. We investigate how the strength of of the closure influences the transition between a regime reminiscent of previous kinetic pair-plasma simulations and a more MHD-like dynamo regime.",
      "pdf_url": "https://arxiv.org/pdf/2601.10472.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10709",
      "title": "Euclid preparation. 3D reconstruction of the cosmic web with simulated Euclid Deep spectroscopic samples",
      "authors": [
        "Euclid Collaboration: K. Kraljic",
        "C. Laigle",
        "M. Balogh",
        "P. Jablonka",
        "U. Kuchner",
        "N. Malavasi",
        "F. Sarron",
        "C. Pichon",
        "G. De Lucia",
        "M. Bethermin",
        "F. Durret",
        "M. Fumagalli",
        "C. Gouin",
        "M. Magliocchetti",
        "J. G. Sorce",
        "O. Cucciati",
        "F. Fontanot",
        "M. Hirschmann",
        "Y. Kang",
        "M. Spinelli",
        "N. Aghanim",
        "A. Amara",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "J. Brinchmann",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "R. Casas",
        "S. Casas",
        "F. J. Castander",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "C. J. Conselice",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H. M. Courtois",
        "A. Da Silva",
        "H. Degaudenzi",
        "S. de la Torre",
        "H. Dole",
        "M. Douspis",
        "F. Dubath",
        "C. A. J. Duncan",
        "X. Dupac",
        "S. Dusini",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "S. Ferriol",
        "F. Finelli",
        "P. Fosalba",
        "N. Fourmanoit",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "W. Gillard",
        "B. Gillis",
        "C. Giocoli",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "S. V. H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "M. Kilbinger",
        "B. Kubik",
        "M. Kümmel",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti"
      ],
      "abstract": "Euclid preparation. 3D reconstruction of the cosmic web with simulated Euclid Deep spectroscopic samples Euclid Collaboration: K. Kraljic (1), C. Laigle (2), M. Balogh (3 and 4), P. Jablonka (5), U. Kuchner (6), N. Malavasi (7), F. Sarron (8 and 9), C. Pichon (2 and 10), G. De Lucia (11), M. Bethermin (1), F. Durret (12), M. Fumagalli (11 and 13), C. Gouin (2), M. Magliocchetti (14), J. G. Sorce (15 and 16), O. Cucciati (17), F. Fontanot (11 and 18), M. Hirschmann (19), Y. Kang (20), M. Spinelli (21 and 11 and 22), N. Aghanim (16), A. Amara (23), S. Andreon (24), N. Auricchio (17), C. Baccigalupi (18 and 11 and 25 and 26), M. Baldi (27 and 17 and 28), S. Bardelli (17), A. Biviano (11 and 18), E. Branchini (29 and 30 and 24), M. Brescia (31 and 32), J. Brinchmann (33 and 34 and 35), S. Camera (36 and 37 and 38), G. Cañas-Herrera (39 and 40 and 41), V. Capobianco (38), C. Carbone (42), J. Carretero (43 and 44), R. Casas (45 and 46), S. Casas (47), F. J. Castander (46 and 45), M. Castellano (48), G. Castignani (17), S. Cavuoti (32 and 49), K. C. Chambers (50), A. Cimatti (51), C. Colodro-Conde (52), G. Congedo (53), C. J. Conselice (54), L. Conversi (55 and 56), Y. Copin (57), F. Courbin (58 and 59), H. M. Courtois (60), A. Da Silva (61 and 62), H. Degaudenzi (20), S. de la Torre (63), H. Dole (16), M. Douspis (16), F. Dubath (20), C. A. J. Duncan (53 and 54), X. Dupac (56), S. Dusini (64), S. Escoffier (65), M. Farina (14), R. Farinelli (17), S. Ferriol (57), F. Finelli (17 and 66), P. Fosalba (45 and 46), N. Fourmanoit (65), M. Frailis (11), E. Franceschi (17), M. Fumana (42), S. Galeotta (11), K. George (67), W. Gillard (65), B. Gillis (53), C. Giocoli (17 and 28), J. Gracia-Carpio (7), A. Grazian (68), F. Grupp (7 and 67), S. V. H. Haugan (69), W. Holmes (70), F. Hormuth (71), A. Hornstrup (72 and 73), K. Jahnke (74), M. Jhabvala (75), B. Joachimi (76), E. Keihänen (77), S. Kermiche (65), A. Kiessling (70), M. Kilbinger (78), B. Kubik (57), M. Kümmel (67), M. Kunz (79), H. Kurki-Suonio (80 and 81), A. M. C. Le Brun (82), S. Ligori (38), P. B. Lilje (69), V. Lindholm (80 and 81), I. Lloro (83), G. Mainetti 30 pages, 23 figures. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The ongoing Euclid mission aims to measure spectroscopic redshifts for approximately two million galaxies using the H $\\alpha$ line emission detected in near-infrared slitless spectroscopic data from the Euclid Deep Fields (EDFs). These measurements will reach a flux limit of $5\\times 10^{-17}\\,{\\rm erg}\\,{\\rm cm}^{-2}\\,{\\rm s}^{-1}$ in the redshift range $0.4<z<1.8$, opening the door to numerous investigations involving galaxy evolution, extending well beyond the mission's core objectives. The achieved H $\\alpha$ luminosity depth will lead to a sufficiently high sampling, enabling the reconstruction of the large-scale galaxy environment. We assess the quality of the reconstruction of the galaxy cosmic web environment with the expected spectroscopic dataset in EDFs. The analysis is carried out on the Flagship and GAEA galaxy mock catalogues. The quality of the reconstruction is first evaluated using geometrical and topological statistics measured on the cosmic web, namely the length of filaments, the area of walls, the volume of voids, and its connectivity and multiplicity. We then quantify how accurately gradients in galaxy properties with distance from filaments can be recovered. As expected, the small-scale redshift-space distortions, have a strong impact on filament lengths and connectivity, but can be mitigated by compressing galaxy groups before skeleton extraction. The cosmic web reconstruction is biased when relying solely on H $\\alpha$ emitters. This limitation can be mitigated by applying stellar mass weighting during the reconstruction. However, this approach introduces non-trivial biases that need to be accounted for when comparing to theoretical predictions. Redshift uncertainties pose the greatest challenge in recovering the expected dependence of galaxy properties, though the well-established stellar mass transverse gradients towards filaments can still be observed.",
      "pdf_url": "https://arxiv.org/pdf/2601.10709.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.07694",
      "title": "Unified Origin of Curvature Perturbation and Baryon Asymmetry of the Universe",
      "authors": [
        "Anish Ghoshal",
        "Abhishek Naskar",
        "Nobuchika Okada"
      ],
      "abstract": "Unified Origin of Curvature Perturbation and Baryon Asymmetry of the Universe Anish Ghoshal, Abhishek Naskar, Nobuchika Okada 23 pages, 7 figures and 1 table, 1 Appendix, Matches published version Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We propose a unified framework that describes both the curvaton mechanism for generating primordial density fluctuations and the Affleck-Dine (AD) mechanism for baryogenesis. By introducing a complex scalar field (AD field) carrying a baryon/lepton number and its potential consisting of quadratic and quartic terms with a small baryon/lepton-number-violating mass term, we investigate the evolution of the scalar field during the radiation-dominated era following inflation. We set the initial conditions such that the quartic term dominates the scalar potential, and the angular component of the AD field is non-zero. We focus on a scenario where the AD field sufficiently dominates the energy density of the universe before its decay. We show that the radial component of the AD field can be identified with the curvaton to solely produce the Planck normalized scalar power spectrum while the evolution of the angular component is crucial for generating the observed baryon asymmetry of the universe. Additionally, we find that the amplitude of scalar bispectrum $f_{NL}$ is negative, which is consistent with the current Planck data and testable in future observations such as CMB-S4, LiteBIRD, LSS, and 21-cm experiments. In our estimation of the scalar power spectrum and bispectrum, we develop a novel analytical scheme for computing scalar fluctuations based on the $\\delta N$ formalism, which allows us to deal with the evolution of curvaton with polynomial potential more accurately in comparison to the existing analytical methods.",
      "pdf_url": "https://arxiv.org/pdf/2410.07694.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.19811",
      "title": "Non-Gaussian statistics in galaxy weak lensing: compressed three-point correlations and cosmological forecasts",
      "authors": [
        "Sofia Samario-Nava",
        "Alejandro Aviles",
        "Juan Carlos Hidalgo"
      ],
      "abstract": "Non-Gaussian statistics in galaxy weak lensing: compressed three-point correlations and cosmological forecasts Sofia Samario-Nava, Alejandro Aviles, Juan Carlos Hidalgo 21 pages + appendix, 11 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO) Building on previous developments of a harmonic decomposition framework for computing the three-point correlation function (3PCF) of projected scalar fields over the sky, this work investigates how much cosmological information is contained in these higher-order statistics. We perform a forecast to determine the number of harmonic multipoles required to capture the full information content of the 3PCF in the context of galaxy weak lensing, finding that only the first few multipoles are sufficient to capture the additional cosmological information provided by the 3PCF. This study addresses a critical practical question: to what extent can the high-dimensional 3PCF signal be compressed without significant loss of cosmological information? Since the different multipoles contain highly redundant information, we apply a principal component analysis (PCA) which further reduces its dimensionality and preserving information. We also account for non-linear parameter degeneracies using the DALI method, an extension of Fisher forecasting that includes higher-order likelihood information. Under optimistic settings, we find that the 3PCF considerably improves the constraining power of the 2PCF for $\\Omega_m$, reaching a 20% improvement. Other parameters also benefit, mainly due to their degeneracy with the matter abundance. For example, with our chosen scale cuts for galaxy sources at $z = 0.5$, we find that $\\sigma_8$ is more tightly constrained, whereas $S_8$ and $w_0$ are not. Finally, we construct analytical Gaussian covariance matrices that can serve as a first step toward developing semi-analytical, semi-empirical alternatives to sample covariances.",
      "pdf_url": "https://arxiv.org/pdf/2506.19811.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.16238",
      "title": "Cosmological Constraints on Neutrino Masses in a Second-Order CPL Dark Energy Model",
      "authors": [
        "Shubham Barua",
        "Shantanu Desai"
      ],
      "abstract": "Cosmological Constraints on Neutrino Masses in a Second-Order CPL Dark Energy Model Shubham Barua, Shantanu Desai 21 pages, 11 figures. Accepted for publication in Physics of the Dark Universe Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Recent DESI results indicate a strong preference for dynamical dark energy (DE) when baryon acoustic oscillation (BAO) measurements are combined with supernovae (SNe) and cosmic microwave background (CMB) data using the Chevallier-Polarski-Linder (CPL) parameterization. We analyze the exponential (EXP) parameterization, which introduces a second-order correction to CPL. We determine and compare the 95% upper bounds on the sum of neutrino masses for three dark energy (DE) models -- $\\Lambda$CDM, CPL, and EXP -- across four neutrino mass hierarchies (1 massive/2 massless, degenerate, normal, inverted) and multiple dataset combinations (CMB$+$BAO, CMB$+$BAO$+$PantheonPlus, CMB$+$BAO$+$DESY5), employing both Bayesian and frequentist frameworks with physical lower limits from oscillation experiments (0.059 eV and 0.11 eV). Our results show that CPL yields tighter ($\\lesssim10$%) bounds compared to EXP. We further confirm earlier findings that neutrino mass constraints are only mildly sensitive to the assumed hierarchy and that the frequentist bounds are tighter than Bayesian ones. Furthermore, the imposed oscillation lower limits, the datasets used and the DE parameterizations play a crucial role in the inferred cosmological neutrino mass bounds. For the datasets, hierarchies, and DE parameterizations considered, we find no statistically significant evidence for nonzero neutrino mass consistent with oscillation lower limits.",
      "pdf_url": "https://arxiv.org/pdf/2508.16238.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07074",
      "title": "Prospects and Limitations of PTAs Anisotropy Searches -- The Frequentist Case",
      "authors": [
        "Thomas Konstandin",
        "Anna-Malin Lemke",
        "Andrea Mitridate",
        "Enrico Perboni"
      ],
      "abstract": "Prospects and Limitations of PTAs Anisotropy Searches -- The Frequentist Case Thomas Konstandin, Anna-Malin Lemke, Andrea Mitridate, Enrico Perboni 28 pages, 13 figures, published version Cosmology and Nongalactic Astrophysics (astro-ph.CO) Recent findings from several Pulsar Timing Array (PTA) collaborations point to the existence of a Gravitational Wave Background (GWB) at nanohertz frequencies. A key next step towards characterizing this signal and identifying its origin is to map the sky distribution of its power. Several strategies have been proposed to reconstruct this distribution using PTA data. In this work, we compare these different strategies to determine which one is best suited to detect GWB anisotropies of different topologies. We find that, for both localized and large-scale anisotropies, reconstruction methods based on pixel and radiometer maps are the most promising. However, in both scenarios, even the optimistically large anisotropic signals discussed in this work remain challenging to detect with near-future PTA sensitivities. For example, we find that for a GWB hotspot contributing to $80\\%$ of the GWB power in the second frequency bin, detection probabilities reach at most $\\mathcal{O}(10\\%)$ for a PTA with noise properties comparable with the ones of the upcoming IPTA third data release. Finally, we consider the fundamental limitations that cosmic variance poses to these kinds of searches by deriving the smallest deviations from isotropy that could be detected by an idealized PTA with no experimental or pulsar noise.",
      "pdf_url": "https://arxiv.org/pdf/2509.07074.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.00440",
      "title": "Faraday Depolarization Study of a Radio Galaxy Using LOFAR Two-metre Sky Survey: Data Release 2",
      "authors": [
        "Samantha Sneha Paul",
        "Abhik Ghosh"
      ],
      "abstract": "Faraday Depolarization Study of a Radio Galaxy Using LOFAR Two-metre Sky Survey: Data Release 2 Samantha Sneha Paul, Abhik Ghosh 14 pages, 6 figures, Revised and resubmitted Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a detailed depolarization analysis of the radio galaxy \\texttt{ILTJ012215.21+254334.8} using polarimetric data from the \\textit{LOFAR Two-metre Sky Survey} (LoTSS) Data Release 2 (DR2) catalogue. This source, with \\textit{RM} $\\sim$ 47 rad m$^{-2}$ and projected linear size $\\sim$ 335 kpc at $z \\approx 0.05$, serves as a pilot for systematic QU-fitting of unresolved LoTSS sources, building on prior single-target studies that established the need for multi-component Faraday models in complex magneto-ionic media. Fitting five depolarization models to the LoTSS HBA (120-168 MHz) fractional polarization spectra reveals a decisively preferred three-component model (one Faraday-thin instrumental leakage, plus two external Faraday dispersions), demonstrating that LoTSS data alone can constrain moderate Faraday complexity in typical DR2 galaxies. Our results highlight turbulence and inhomogeneity in the foreground magneto-ionic medium and outline a path for population studies of LoTSS FR-I sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.00440.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.13092",
      "title": "Topological Signatures of Heating and Dark Matter in the 21 cm Forest",
      "authors": [
        "Hayato Shimabukuro"
      ],
      "abstract": "Topological Signatures of Heating and Dark Matter in the 21 cm Forest Hayato Shimabukuro Cosmology and Nongalactic Astrophysics (astro-ph.CO) We show that persistence-based topology of the 21 cm forest encodes information about Cosmic Dawn that is complementary to traditional amplitude- or correlation-based statistics. Applying topological data analysis to simulated one-dimensional forest spectra over a grid of X-ray heating efficiencies $f_X$ and warm-dark-matter masses $m_{\\rm WDM}$ (which set the free-streaming scale), we construct persistence diagrams and Betti-0 curves that track the birth-merger hierarchy of absorption troughs under sublevel filtrations. From these summaries we define three interpretable descriptors: the trough line density $\\lambda(t_\\star)$, the total squared persistence $M_2=\\sum_{j\\in I_{\\rm long}}\\tau_j^2$, and the Betti-curve asymmetry $A_{\\rm skew}$. In a Fisher forecast around a fiducial WDM model, $\\lambda(t_\\star)$ and $A_{\\rm skew}$ provide strong local leverage on the heating axis, while $M_2$ retains appreciable sensitivity to the free-streaming scale and supplies an inclined constraint direction that reduces the remaining degeneracy in the $(f_X,m_{\\rm WDM})$ plane. We further demonstrate that, under an SKA1-Low-like uncorrelated thermal-noise model, noise predominantly produces short-lived fluctuations that are removed by a uniform persistence cut, leaving the topology of long-lived troughs and the gross Betti-curve morphology largely intact. These results establish persistence-based descriptors as a robust non-Gaussian probe of small-scale structure and heating during Cosmic Dawn, naturally complementing power-spectrum and wavelet-based analyses.",
      "pdf_url": "https://arxiv.org/pdf/2511.13092.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.01034",
      "title": "Testing supermassive primordial black holes with lensing signals of binary black hole merges",
      "authors": [
        "Huan Zhou",
        "Bin Liu",
        "Zheng-Xiang Li",
        "Xi-Jing Wang",
        "Kai Liao"
      ],
      "abstract": "Testing supermassive primordial black holes with lensing signals of binary black hole merges Huan Zhou, Bin Liu, Zheng-Xiang Li, Xi-Jing Wang, Kai Liao Cosmology and Nongalactic Astrophysics (astro-ph.CO) Next-generation ground-based gravitational wave (GW) detectors are expected to observe millions of binary black hole mergers, a fraction of which will be strongly lensed by intervening galaxies or clusters, producing multiple images with characteristic distribution of time delay. Importantly, the predicted rate and properties of such events are sensitive to the abundance and distribution of strong lensing objects which directly depends on cosmological models. One such scenario posits the existence of supermassive primordial black holes (SMPBHs) in the early universe, which would enhance the formation of dark matter halos. This mechanism has been proposed to explain the abundance of high-redshift galaxies observed by James Webb Space Telescope. Crucially, the same cosmological model with SMPBHs would also leave a distinct imprint on the population of strongly lensed GWs. It predicts both an increased event rate and a modified distribution of time delays between the multiple images. Therefore, we propose statistical measurements of the rate and time delay distribution of strong lensing GW events as a powerful probe to directly constrain the abundance of SMPBHs. Considering $\\Lambda$CDM cosmology with (non-)clustered SMPBHs, we find that the abundance of SMPBHs $f_{\\rm PBH}$ with masses above $10^8~M_{\\odot}$ is constrained to be $\\sim10^{-4}$ at $95\\%$ confidence level. It will be comparable and complementary to the currently available constraint from large scale structure observations.",
      "pdf_url": "https://arxiv.org/pdf/2601.01034.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2502.07781",
      "title": "Detectability of dark matter subhalo impacts in Milky Way stellar streams",
      "authors": [
        "Junyang Lu",
        "Tongyan Lin",
        "Mukul Sholapurkar",
        "Ana Bonaca"
      ],
      "abstract": "Detectability of dark matter subhalo impacts in Milky Way stellar streams Junyang Lu, Tongyan Lin, Mukul Sholapurkar, Ana Bonaca Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Stellar streams are a promising way to probe the gravitational effects of low-mass dark matter (DM) subhalos. In recent years, there has been a remarkable explosion in the number of stellar streams detected in the Milky Way, and hundreds more may be discovered with future surveys such as LSST. Studies of DM subhalo impacts on streams have so far focused on a few of the thinnest and brightest streams, and it is not known how much information can be gained from the others. In this work, we develop a method to quickly estimate the minimum detectable DM subhalo mass of a given stream, depending on its width, length, distance, and stellar density. We use an analytic model for the impacts and apply a test statistic to determine whether they are detectable. We consider several observational scenarios, based on current and future surveys including Gaia, DESI, Via, and LSST. We find that at 95% confidence level, a stream like GD-1 has a minimum detectable subhalo mass of $\\sim 6\\times 10^6~\\mathrm{M}_\\odot$ in Gaia data and $\\sim 8\\times 10^5~\\mathrm{M}_\\odot$ with LSST 10 year sensitivity. Applying our results to confirmed Milky Way streams, we rank order them by their sensitivity to DM subhalos and identify promising ones for further study.",
      "pdf_url": "https://arxiv.org/pdf/2502.07781.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.19495",
      "title": "Rates of Strongly Lensed Tidal Disruption Events",
      "authors": [
        "E. Mamuzic",
        "T. Ryu",
        "S. H. Suyu",
        "K. Szekerczes",
        "S. Huber",
        "L. Dai",
        "M. Oguri"
      ],
      "abstract": "Rates of Strongly Lensed Tidal Disruption Events E. Mamuzic, T. Ryu, S. H. Suyu, K. Szekerczes, S. Huber, L. Dai, M. Oguri 14 pages, 13 figures, accepted by Astronomy & Astrophysics (A&A) High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) In the coming years, surveys such as the Rubin Observatory's Legacy Survey of Space and Time (LSST) are expected to increase the number of observed Tidal Disruption Events (TDEs) substantially. We employ Monte Carlo integration to calculate the unlensed and lensed TDE rate as a function of limiting magnitude in $u$, $g$, $r$, and $i$-bands. We investigate the impact of multiple luminosity models, black hole mass functions (BHMFs), and flare temperatures on the TDE rate. Notably, this includes a semi-analytical model, which enables the determination of the TDE temperature in terms of black hole (BH) mass. We predict the highest unlensed TDE rate to be in $g$-band. It ranges from $16$ to $5,440\\;\\mathrm{yr}^{-1}\\;(20,000\\;\\mathrm{deg}^2)^{-1}$ for the Zwicky Transient Facility, being more consistent with the observed rate at the low end. For LSST, we expect a rate in $g$-band between $3,580$ and $82,060\\;\\mathrm{yr}^{-1}\\;(20,000\\;\\mathrm{deg}^2)^{-1}$. A higher theoretical prediction is understandable, as we do not consider observational effects such as completeness. The unlensed and lensed TDE rates are insensitive to the redshift evolution of the BHMF, even for LSST limiting magnitudes. The best band for detecting lensed TDEs is also $g$-band. Its predicted rates range from $0.43$ to $15\\;\\mathrm{yr}^{-1}\\;(20,000\\;\\mathrm{deg}^2)^{-1}$ for LSST. The scatter of predicted rates reduces when we consider the fraction of lensed TDEs; that is, a few in ten thousand TDEs will be lensed. Despite the large scatter in the rates of lensed TDEs, our comprehensive considerations of multiple models suggest that lensed TDEs will occur in the $10$-year LSST lifetime, providing an exciting prospect for detecting such events. We expect the median redshift of a lensed TDE to be between $1.5$ and $2$. In this paper, we additionally report on lensed TDE properties, such as the BH mass and time delays.",
      "pdf_url": "https://arxiv.org/pdf/2502.19495.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.14732",
      "title": "The galaxy-environment connection revealed by constrained simulations",
      "authors": [
        "Catherine Gallagher",
        "Tariq Yasin",
        "Richard Stiskalek",
        "Harry Desmond",
        "Matt J. Jarvis"
      ],
      "abstract": "The galaxy-environment connection revealed by constrained simulations Catherine Gallagher, Tariq Yasin, Richard Stiskalek, Harry Desmond, Matt J. Jarvis 17 pages, 10 figures. Submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The evolution of galaxies is known to be connected to their position within the large-scale structure and their local environmental density. We investigate the relative importance of these using the underlying dark matter density field extracted from the Constrained Simulations in BORG (CSiBORG) suite of constrained cosmological simulations. We define cosmic web environment through both dark matter densities averaged on a scale up to 16 Mpc/h, and through cosmic web location identified by applying DisPerSE to the CSiBORG haloes. We correlate these environmental measures with the properties of observed galaxies in large surveys using optical data (from the NASA-Sloan Atlas) and 21-cm radio data (from ALFALFA). We find statistically significant correlations between environment and colour, neutral hydrogen gas (HI) mass fraction, star formation rate and Sérsic index. Together, these correlations suggest that bluer, star forming, HI rich, and disk-type galaxies tend to reside in lower density areas, further from filaments, while redder, more elliptical galaxies with lower star formation rates tend to be found in higher density areas, closer to filaments. We find analogous trends with the quenching of galaxies, but notably find that the quenching of low mass galaxies has a greater dependence on environment than the quenching of high mass galaxies. We find that the relationship between galaxy properties and the environmental density is stronger than that with distance to filament, suggesting that environmental density has a greater impact on the properties of galaxies than their location within the larger-scale cosmic web.",
      "pdf_url": "https://arxiv.org/pdf/2503.14732.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.20711",
      "title": "HSTPROMO Internal Proper Motion Kinematics of Dwarf Spheroidal Galaxies: II. Velocity Anisotropy and Dark Matter Cusp Slope of Sculptor",
      "authors": [
        "Eduardo Vitral",
        "Roeland P. van der Marel",
        "Sangmo Tony Sohn",
        "Jorge Peñarrubia",
        "Ekta Patel",
        "Laura L. Watkins",
        "Mattia Libralato",
        "Kevin McKinnon",
        "Andrea Bellini",
        "Andrés del Pino",
        "Paul Bennet"
      ],
      "abstract": "HSTPROMO Internal Proper Motion Kinematics of Dwarf Spheroidal Galaxies: II. Velocity Anisotropy and Dark Matter Cusp Slope of Sculptor Eduardo Vitral, Roeland P. van der Marel, Sangmo Tony Sohn, Jorge Peñarrubia, Ekta Patel, Laura L. Watkins, Mattia Libralato, Kevin McKinnon, Andrea Bellini, Andrés del Pino, Paul Bennet 25 pages, 14 figures, 4 tables. Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We analyze three epochs of HST imaging over 20 years for the Sculptor dwarf spheroidal galaxy, measuring precise proper motions for 119 stars and combining them with 1760 existing line-of-sight velocities. This catalog yields the first radially-resolved 3D velocity dispersion profiles for Sculptor. We confirm mild oblate rotation, with major-axis velocities reaching $\\sim 2$ km s$^{-1}$ beyond 20.0 arcmin. Using a methodology similar to that in the first paper in this series, we solve the Jeans equations in oblate axisymmetric geometry to infer the galaxy's mass profile. Our modeling reveals a significant degeneracy due to the unknown galaxy inclination, which is overlooked under spherical symmetry assumptions. This degeneracy allows acceptable fits across a range of dark matter profiles, from cuspy to cored. While we do not directly constrain the inclination with our Jeans models, higher-order line-of-sight velocity moments provide useful additional constraints: comparisons with scalefree models from de Bruijne et al. (1996) favor highly flattened (more face-on) configurations. Adopting an inclination well consistent with these comparisons ($i = 57.1$ degrees), we find, alongside radial velocity anisotropy, a dark matter density slope of $\\Gamma_{\\rm dark} = 0.29^{+0.31}_{-0.41}$ within the radial extent of the 3D velocity data, ruling out a cusp with $\\Gamma_{\\rm dark} \\leq -1$ at 99.8% confidence. This confidence increases for lower inclinations and decreases drastically for nearly edge-on configurations. The results qualitatively agree with $\\Lambda$CDM, SIDM, and Fuzzy DM scenarios that predict core formation, while our specific measurements provide quantitative constraints on the prescriptions of feedback, cross sections, or particle masses required by these models, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2508.20711.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09788",
      "title": "New Hard X-Ray and Multiwavelength Study of the PeVatron Candidate PWN G0.9+0.1 in the Galactic Center Region",
      "authors": [
        "Giulia Brunelli",
        "Kaya Mori",
        "Jaegeun Park",
        "Jordan Eagle",
        "Moaz Abdelmaguid",
        "Melania Nynka",
        "Hongjun An",
        "Aya Bamba",
        "Joseph D. Gelfand",
        "Gabriele Ponti",
        "Samar Safi-Harb",
        "Vito Sguera",
        "Cristian Vignali",
        "Jooyun Woo",
        "Roberta Zanin"
      ],
      "abstract": "New Hard X-Ray and Multiwavelength Study of the PeVatron Candidate PWN G0.9+0.1 in the Galactic Center Region Giulia Brunelli, Kaya Mori, Jaegeun Park, Jordan Eagle, Moaz Abdelmaguid, Melania Nynka, Hongjun An, Aya Bamba, Joseph D. Gelfand, Gabriele Ponti, Samar Safi-Harb, Vito Sguera, Cristian Vignali, Jooyun Woo, Roberta Zanin Accepted for publication in the Astrophysical Journal High Energy Astrophysical Phenomena (astro-ph.HE) We present a new X-ray study and multiwavelength spectral energy distribution (SED) modeling of the young pulsar wind nebula (PWN) powered by the energetic pulsar PSR J1747-2809, inside the composite supernova remnant (SNR) G0.9+0.1, located in the Galactic Center region. The source is detected by NuSTAR up to 30 keV with evidence for the synchrotron burnoff effect in the changing spatial morphology with increasing energy. The broadband 2-30 keV spectrum of PWN G0.9+0.1 is modeled by a single power law with photon index $\\Gamma=2.11\\pm0.07$. We combined the new X-ray data with the multiwavelength observations in radio, GeV, and TeV gamma rays and modeled the SED, applying a one-zone and a multi-zone leptonic model. The comparison of the models is successful, as we obtained physically compatible results in the two cases. Through the one-zone model, we constrain the age of the system to $\\sim2.2$ kyr, as well as reproduce the observed PWN and SNR radio sizes. In both the one-zone and multi-zone leptonic models, the electron injection spectrum is well-described by a single power law with spectral index $p \\sim 2.6$ and a maximum electron energy of $\\sim2$ PeV, suggesting the source could be a leptonic PeVatron candidate. We estimate the average magnetic field to be $B_{\\rm PWN} \\sim 20\\ \\mu$G. We also report the serendipitous NuSTAR detection of renewed X-ray activity from the very faint X-ray transient XMMU J174716.1-281048 and characterize its spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2601.09788.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09799",
      "title": "Stellar-wind Fueled Accretion onto Sagittarius A* in the Presence of a Nuclear Star Cluster",
      "authors": [
        "Edward Skrabacz",
        "Lena Murchikova",
        "Sean M. Ressler",
        "Asad Ukani",
        "Siddhant Solanki"
      ],
      "abstract": "Stellar-wind Fueled Accretion onto Sagittarius A* in the Presence of a Nuclear Star Cluster Edward Skrabacz, Lena Murchikova, Sean M. Ressler, Asad Ukani, Siddhant Solanki 8 pages, 4 figures. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) The Milky Way's Galactic Center hosts the black hole Sagittarius A* (Sgr A*), which provides us with a close-up view into supermassive black hole accretion and feedback. Recent works have shown that the winds from $\\sim 30$ Wolf-Rayet (WR) stars orbiting Sgr A* at about 4 arcsec are important contributors to feeding the supermassive black hole. A nuclear star cluster (NSC) with a mass of several $10^6 \\, \\text{M}_\\odot$, of which $10^6 \\, \\text{M}_\\odot$ is within 1 pc, also surrounds Sgr A*. The NSC contributes to the gravitational potential in the Galactic Center, affecting the orbits of the WR stars and their stellar winds. In this work, we examine the effects that the NSC has on the accretion of these stellar winds onto Sgr A* which have previously been neglected. We find that, on the parsec scale, the effect from the gravitational potential of the NSC is negligible on the wind-fed accretion flow, validating the existing simulations used in the literature.",
      "pdf_url": "https://arxiv.org/pdf/2601.09799.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09807",
      "title": "Magnetic Pumping: Plasma Heating to Particle Acceleration",
      "authors": [
        "Mikhail Malkov",
        "Immanuel Jebaraj"
      ],
      "abstract": "Magnetic Pumping: Plasma Heating to Particle Acceleration Mikhail Malkov, Immanuel Jebaraj High Energy Astrophysical Phenomena (astro-ph.HE) One of the earliest mechanisms proposed for plasma heating was magnetic pumping (MP). However, its significance for astrophysical phenomena, including particle acceleration, has yet to be appreciated. MP-energized particles tap energy from magnetic-field oscillations. A particle's momentum component perpendicular to the local B-field increases during field growth by virtue of the adiabatic invariant $p_{\\perp}^{2}/B=const$. The gained $p_{\\perp}$ is then partially scattered elastically into the parallel momentum, $p_{\\parallel}$, with $p^{2}=p_{\\parallel}^{2}+p_{\\perp}^{2}=const$, thereby retaining some fraction of the gained energy before the field decreases to its minimum. This scattering breaks the reversibility of energy exchange between particles and oscillating magnetic fields, thereby increasing the particle energy after each MP cycle. Field oscillations are often assumed to be sinusoidal, and the resulting MP is treated perturbatively. These simplifications restrict astrophysical applications, leaving objects with strong magnetic perturbations outside the scope of adequate treatment. We develop a nonperturbative approach to MP that is suitable for a broad spectrum of magnetic turbulence. The treatment comprises two steps. The first step is common: converting a kinetic equation into an infinite hierarchy of moments of the particle distribution function. The second step is new in MP treatments: we find an exact closure at an arbitrary level of the moment system. The heating is treated exactly at the second-moment closure. Particle acceleration generally requires a higher-level closure to determine the power-law index and the maximum energy of accelerated particles. We propose a method for extracting these crucial acceleration data from the second moment for a broadband random field.",
      "pdf_url": "https://arxiv.org/pdf/2601.09807.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09863",
      "title": "Gravitational Wave Strain and Orbital Dynamics of Binary Pulsars from LIGO-Virgo to LISA",
      "authors": [
        "Ali Taani"
      ],
      "abstract": "Gravitational Wave Strain and Orbital Dynamics of Binary Pulsars from LIGO-Virgo to LISA Ali Taani published by The European Physical Journal Plus, 2026, 141 (1), 21 The European Physical Journal Plus 141, 2026, (1), 21 High Energy Astrophysical Phenomena (astro-ph.HE) We summarize the current state of the art and calculate gravitational wave strain amplitudes for known binary pulsars, using data from current ground-based detectors (LIGO-Virgo-KAGRA) and the upcoming space-based missions (LISA). We present detailed calculations of the characteristic gravitational wave strain values, ranging from 3.0 to 73 $\\times10^{-22}$, across frequencies between 0.66 and 5.87 $\\times10^{-4}$ Hz. Our post-Newtonian approximation analysis yields predicted periastron advance rates from 1.6 to 80.5 deg/yr and orbital period decay rates between -5 and -176 $\\mu$s/yr for the binary pulsar population. We derive common envelope efficiency parameters ($\\alpha_{CE}$) for representative progenitor scenarios within our sample, finding values between 0.63 and 1.16, with notable sensitivity to the binding energy parameter $\\lambda$. Binary neutron star merger rates are estimated at $22.77^{+6.83}_{-6.83}$ Myr$^{-1}$ for the Milky Way, corresponding to a volumetric rate of $227.71^{+68.31}_{-68.31}$ Gpc$^{-3}$ yr$^{-1}$, consistent with the latest LIGO-Virgo-KAGRA observational constraints. Our results illustrate how multi-band gravitational wave observations, from LIGO/Virgo to LISA, can contribute to precise measurements of binary pulsar strain and orbital evolution histories, improving merger time predictions and constraining neutron star physics and common envelope processes",
      "pdf_url": "https://arxiv.org/pdf/2601.09863.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.09868",
      "title": "Dynamics of Apsidal Motion in Non-Synchronous Binary Pulsars Coupled Orbit and Spin Evolution",
      "authors": [
        "Ali Taani"
      ],
      "abstract": "Dynamics of Apsidal Motion in Non-Synchronous Binary Pulsars Coupled Orbit and Spin Evolution Ali Taani Published by Astrophysics and Space Science, 2025, 370, (11), 128 Published by Astrophysics and Space Science, 2025, 370, (11), 128 High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The apsidal motion of a non-synchronous binary pulsar serves as a valuable probe of relativistic gravity, stellar stricture, and dynamical evolution of close binary systems, In this study, we investigate the combined influence of general relativity, stellar oblateness and tidal interaction on the apsidal motion of three binary pulsars: 1913+16, J0737-3039A/B, and J0621+1002. Zahn's tidal equations \\cite{1977A&A....57..383Z, 1989A&A...220..112Z} were employed for numerical integrations to describe tidal effects and their role in orbital and spin evolution. We estimated the timescales for tidal synchronization and orbital circularization for each system. The results indicate that tidal effects play only a minor role in orbital decay compared with energy loss due to gravitational wave emission. This is evident in the compact system PSR 1913+16, where the orbital period decreases by approximately 76.5 $\\mu$s/yr as a result of gravitational radiation. The double pulsar J0737-3039A/B exhibits faster orbital evolution, with synchronization occurring in about 8.4$\\times10{^3}$ years, whereas the wider system J0621+1002 shows negligible orbital change over timescales exceeding 10$^{10}$ years. The simulations demonstrate clear trends of decreasing semi-major axis and eccentricity, accompanied by an increase in spin rate among the binary pulsars studied. The derived apsidal motion constants [$k\\simeq0.1$] are consistent with theoretical expected values, and the corresponding tidal friction times (between a few hours to several days) agree well with theoretical predication. These results emphasize the dominant role of relativistic effects in neutron star binaries and highlight the importance of including gravitational-wave terms long-term orbital evolution",
      "pdf_url": "https://arxiv.org/pdf/2601.09868.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.10317",
      "title": "Multimessenger Prospects for Low-Luminosity Gamma-Ray Bursts: Joint Neutrino and X-Ray Observations",
      "authors": [
        "Wenkang Lian",
        "He Gao",
        "Shunke Ai",
        "B. Theodore Zhang"
      ],
      "abstract": "Multimessenger Prospects for Low-Luminosity Gamma-Ray Bursts: Joint Neutrino and X-Ray Observations Wenkang Lian, He Gao, Shunke Ai, B. Theodore Zhang High Energy Astrophysical Phenomena (astro-ph.HE) Low--luminosity gamma-ray bursts (LLGRBs) are promising candidates for high-energy neutrinos, yet no coincident neutrino events have been detected so far. Recent advances in X-ray time-domain astronomy, together with the development of next-generation neutrino telescopes, open new opportunities for joint X-ray and neutrino observations of these transients. We calculate the jet dynamical evolution and the associated neutrino production for both non-magnetized and magnetized outflows. For individual events, joint X-ray and neutrino detection is generally limited to nearby LLGRBs or sources with high luminosities. Thus, we consider a next-generation neutrino telescope with an effective area enhanced by a factor of $\\sim30$ relative to IceCube. In the non-magnetized scenario, joint detection of individual events is enabled for sources with typical isotropic luminosities of $L_{\\mathrm{iso}}\\sim10^{47}\\,\\mathrm{erg\\,s^{-1}}$ out to luminosity distances of $D_L\\sim1.6\\times10^{2}\\,\\mathrm{Mpc}$, corresponding to an expected detection rate of order $1$ per year. In contrast, for the magnetized scenario at the same luminosity, the accessible distance is significantly reduced, with joint observations confined to sources within $D_L\\sim6.5\\times10^{1}\\,\\mathrm{Mpc}$ and an expected detection rate of order $0.5$ per year. For stacked samples of $\\sim100$ magnetized LLGRBs, stacking substantially enlarges the accessible distance range, enabling joint observations for sources with representative luminosities of $L_{\\mathrm{iso}}\\sim1\\times10^{47}\\,\\mathrm{erg\\,s^{-1}}$ out to $D_L\\lesssim7.0\\times10^{2}\\,\\mathrm{Mpc}$ and corresponding to an expected detection rate of order $2$ per year. These results demonstrate that joint X-ray and next-generation neutrino observations enable a practical multimessenger probe of LLGRBs.",
      "pdf_url": "https://arxiv.org/pdf/2601.10317.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10393",
      "title": "Long Period Transients (LPTs): a comprehensive review",
      "authors": [
        "Nanda Rea",
        "Natasha Hurley-Walker",
        "Manisha Caleb"
      ],
      "abstract": "Long Period Transients (LPTs): a comprehensive review Nanda Rea (ICE-CSIC, IEEC, Spain), Natasha Hurley-Walker (ICRAR, Curtin U., Australia), Manisha Caleb (University of Sydney, Australia) 23 pages, 12 figures, 3 tables. Under review at the Journal of High Energy Astrophysics. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Long Period Transients (LPTs) are a recently identified class of sources characterized by periodic radio bursts lasting seconds to minutes, with flux densities that might reach several tens of Jy. These radio bursts repeat with periodicity from minutes to hours, and they exhibit strong polarization and transient activity periods. To date, about 12 such sources have been identified, which might encompass the same or different physical scenarios. Proposed explanations include binary systems with a white dwarf and a low-mass star companion, slow-spinning magnetars, highly magnetized isolated white dwarfs, and other exotic objects. In a few cases the optical counterpart indeed points toward a white dwarf with a low-mass companion, while in other cases, transient X-ray emission was detected, very common in magnetars. However, despite being able to reproduce partially some of the characteristics of LPTs, all the proposed scenarios find difficulty in explaining the exact physical origin of their bright, highly polarized and periodic radio emission. We review here the state-of-the-art in the observations and interpretation of this puzzling class of radio transients.",
      "pdf_url": "https://arxiv.org/pdf/2601.10393.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10612",
      "title": "On the Physical Origins of the Millimeter Fundamental Plane in Active Galactic Nuclei",
      "authors": [
        "Kratika Mazde",
        "Angelo Ricarte",
        "George N. Wong"
      ],
      "abstract": "On the Physical Origins of the Millimeter Fundamental Plane in Active Galactic Nuclei Kratika Mazde, Angelo Ricarte, George N. Wong 13 pages, 5 figures, submitted to ApJ, comments welcome High Energy Astrophysical Phenomena (astro-ph.HE) Observations of active galactic nuclei have revealed a correlation between millimeter luminosity, X-ray luminosity, and mass, suggesting the emission in each of these bands is powered by a common source. Starting with a set of five general relativistic magnetohydrodynamic simulations with dynamically important magnetic fields, we perform ray-tracing calculations to produce spectra including synchrotron emission, bremsstrahlung emission, and Compton scattering. Our models with similar Eddington ratios to the objects for which the relationship was inferred naturally reproduce observations without tuning. Our lower Eddington ratio models depart from this relationship, likely attributable to an observational bias against extremely low accretion rates. We find that inverse Compton scattering dominates the production of X-rays over bremsstrahlung radiation in almost all models, and in all models consistent with the observed correlation. We find only a modest spin dependence in this relationship. This study demonstrates that a compact, hot accretion flow with dynamically important magnetic fields can naturally explain observed millimeter and X-ray properties in low-luminosity active galactic nuclei. Future work should explore the impacts of non-thermal electron populations, weaker magnetic fields, and radiative cooling.",
      "pdf_url": "https://arxiv.org/pdf/2601.10612.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10121",
      "title": "Direct Detection of Type II-P Supernova Progenitors with the Euclid and CSST Surveys",
      "authors": [
        "Junjie Wu",
        "Ning-Chen Sun",
        "Zexi Niu",
        "Tianmang Zhang",
        "Chun Chen",
        "Xiaohan Chen",
        "Nancy Elias-Rosa",
        "Morgan Fraser",
        "Xinyi Hong",
        "Justyn Maund",
        "Cesar Rojas-Bravo",
        "Anyu Wang",
        "Beichuan Wang",
        "Ziyang Wang",
        "Qiang Xi",
        "Linxi Zhang",
        "Yinuo Zhang"
      ],
      "abstract": "Direct Detection of Type II-P Supernova Progenitors with the Euclid and CSST Surveys Junjie Wu, Ning-Chen Sun, Zexi Niu, Tianmang Zhang, Chun Chen, Xiaohan Chen, Nancy Elias-Rosa, Morgan Fraser, Xinyi Hong, Justyn Maund, Cesar Rojas-Bravo, Anyu Wang, Beichuan Wang, Ziyang Wang, Qiang Xi, Linxi Zhang, Yinuo Zhang 9 pages, 8 figures, submitted to A&A Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) A central goal in supernova (SN) research is to identify and characterize their progenitors. However, this is very difficult due to the limited archival images with sufficient depth and spatial resolution required for direct progenitor detection and due to the circumstellar dust which often biases the estimate of their intrinsic parameters. This field will be revolutionized by Euclid and the upcoming Chinese Space Station Survey Telescope (CSST), which conduct deep, wide-field, high-resolution and multi-band imaging surveys. We analyze their detection capability by comparing the model magnitudes of red supergiant (RSG) progenitors with the detection limits under different conditions, and we estimate the annual detection rates with Monte-Carlo simulations. We explore how to recover the intrinsic properties of SN progenitors with the help of radiation transfer calculations in circumstellar dust. We find the optical and near-infrared filters of the Euclid and CSST are highly effective for detecting RSG progenitors. We predict that archival images from the completed 2 surveys will enable $\\lesssim13$ (or 24) progenitor detections per year within the mass range of 8--16 (or 8--25)M_\\odot, an order of magnitude higher than the current detection rate of $\\sim1$ detection per year. In the presence of circumstellar dust, the emerging spectral energy distribution (SED) of the progenitor is mainly affected by the optical depth and is almost independent of dust temperature in the Euclid and CSST filters. Our mock tests demonstrate that one can derive the progenitor mass and dust optical depth simultaneously by fitting the observed SED over the 11 filters of the 2 surveys while fixing the dust temperature to a typical value. Euclid and CSST will significantly enlarge the sample of direct progenitor detections with accurate mass measurements, which is crucial to resolve the long-standing RSG problem.",
      "pdf_url": "https://arxiv.org/pdf/2601.10121.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.12638",
      "title": "Neutrino and pair creation in reconnection-powered coronae of accreting black holes",
      "authors": [
        "D. Karavola",
        "M. Petropoulou",
        "D. F. G. Fiorillo",
        "L. Comisso",
        "L. Sironi"
      ],
      "abstract": "Neutrino and pair creation in reconnection-powered coronae of accreting black holes D. Karavola, M. Petropoulou, D. F. G. Fiorillo, L. Comisso, L. Sironi 33 pages, Published on JCAP (JCAP04(2025)075) High Energy Astrophysical Phenomena (astro-ph.HE) A ubiquitous feature of accreting black hole systems is their hard X-ray emission which is thought to be produced through Comptonization of soft photons by electrons and positrons in the vicinity of the black hole, in a region with optical depth of order unity. The origin and composition of this Comptonizing region, known as the corona, is a matter open for debate. In this paper we investigate the role of relativistic protons accelerated in black-hole magnetospheric current sheets for the pair enrichment and neutrino emission of AGN coronae. Our model has two free parameters, namely the proton plasma magnetization $\\sigma_{\\rm p}$, which controls the peak energy of the neutrino spectrum, and the Eddington ratio $\\lambda_{\\rm X, Edd}$ (defined as the ratio between X-ray luminosity $L_{\\rm X}$ and Eddington luminosity $L_{\\rm Edd}$), which controls the amount of energy transferred to secondary particles. For sources with $\\lambda_{\\rm X, Edd} \\gtrsim \\lambda_{\\rm Edd, crit}$ (where $\\lambda_{\\rm Edd, crit} \\sim 10^{-1}$ for $\\sigma_{\\rm p}=10^5$ or $\\sim 10^{-2}$ for $\\sigma_{\\rm p}=10^7$), proton-photon interactions and $ \\gamma \\gamma$ annihilation produce enough secondary pairs to achieve Thomson optical depths $\\tau_{\\rm T} \\sim 0.1-10$. In the opposite case of $\\lambda_{\\rm X, Edd} \\lesssim \\lambda_{\\rm Edd, crit}$, the coronal pairs cannot originate only from hadronic interactions. Additionally, we find that the neutrino luminosity scales as $L^2_{\\rm X}/L_{\\rm Edd}$ for $\\lambda_{\\rm X, Edd} \\lesssim \\lambda_{\\rm Edd, crit}$, while it is proportional to $L_{\\rm X}$ for higher $\\lambda_{\\rm X, Edd}$ values. We apply our model to four Seyfert galaxies, including NGC 1068, and discuss our results in light of recent IceCube observations.",
      "pdf_url": "https://arxiv.org/pdf/2410.12638.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.01669",
      "title": "Decoding Cygnus X-2: The Critical Role of Reflection in IXPE Data",
      "authors": [
        "Honghui Liu",
        "Jiachen Jiang",
        "Adam Ingram",
        "Cosimo Bambi",
        "Andrew C. Fabian",
        "Ruben Farinelli",
        "Renee Ludlam",
        "Nathalie Degenaar",
        "Jakub Podgorny",
        "Andrea Santangelo",
        "James F. Steiner",
        "Andrew J. Young",
        "Zuobin Zhang"
      ],
      "abstract": "Decoding Cygnus X-2: The Critical Role of Reflection in IXPE Data Honghui Liu, Jiachen Jiang, Adam Ingram, Cosimo Bambi, Andrew C. Fabian, Ruben Farinelli, Renee Ludlam, Nathalie Degenaar, Jakub Podgorny, Andrea Santangelo, James F. Steiner, Andrew J. Young, Zuobin Zhang 18 pages, 9 figures, accepted for publication in JHEAp Journal of High Energy Astrophysics, (2026), 51, 100548 High Energy Astrophysical Phenomena (astro-ph.HE) We present a spectro-polarimetric re-analysis of the first IXPE observation of Cygnus X-2 which we determine to be mainly in the normal branch, from quasi-simultaneous observations with NuSTAR, NICER, and INTEGRAL. We measure the hard X-ray polarization angle and find it to be consistent with the previously measured position angle of the radio jet. Leveraging NuSTAR's detection of both the relativistic Fe K emission line and the Compton hump, we constrain the flux contribution of the reflected emission from the inner accretion disk to be 10% of the total X-ray flux in the IXPE energy band. Unlike previous studies that modeled only the Fe K emission line, we fit the full-band reflection spectrum using a fully relativistic disk model. There is strong degeneracy between the Comptonized and reflection components. Given that the Comptonized component is not expected to be highly polarized, a polarization degree of approximately 20% for the reflection component could explain the X-ray polarization data from IXPE. We also discuss the disk inclination angle inferred from our spectro-polarimetric modeling, as well as other possible explanations for the data.",
      "pdf_url": "https://arxiv.org/pdf/2601.01669.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.03373",
      "title": "Late-Time Infrared Cooling in Magnetar-Driven Supernovae",
      "authors": [
        "Conor M. B. Omand"
      ],
      "abstract": "Late-Time Infrared Cooling in Magnetar-Driven Supernovae Conor M. B. Omand High Energy Astrophysical Phenomena (astro-ph.HE) A central magnetar engine is commonly invoked to explain energetic supernovae, which should have multiple signals in multiwavelength emission. Photoionization from the pulsar wind nebula (PWN) can create distinct spectroscopic signals in the nebular phase. Recent models suggest infrared emission, particularly from Ne II, can be prominent at late times. This work examines the cooling power of optical and infrared transitions to determine which lines contribute strongly to cooling and on what timescale. The models show infrared cooling becomes strong at $\\sim$ 3 years post-explosion and dominates by 6 years, with [Ne II] 12.8$\\mu$m being the strongest coolant. The fraction of total cooling in the infrared increases sharply once the PWN luminosity decreases below 10$^{40}$ erg s$^{-1}$, and this fraction also increases with increasing ejecta mass and decreasing average PWN photon energy. However, the emission from [Ne II] 12.8$\\mu$m increases with increasing PWN luminosity and increasing ejecta mass. Cooling at 1 year is dominated by optical O and S lines, with infrared Ar, Ni, and Ne lines becoming strong at 3 years. Optical cooling is almost negligible at 6 years, with the supernova cooling almost entirely through mid- and far-infrared transitions. JWST spectroscopy with MIRI should be able to detect these lines out to $z \\sim 0.1$. Supernovae with higher magnetic fields transition to infrared cooling on earlier timescales, while infrared-dominated supernovae should have strong emission from neutral atoms and emit strongly in radio at sub-decade timescales.",
      "pdf_url": "https://arxiv.org/pdf/2601.03373.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17705",
      "title": "Pre-supernova O-C shell mergers could produce more $^{44}\\mathrm{Ti}$ than the explosion",
      "authors": [
        "Joshua Issa",
        "Falk Herwig"
      ],
      "abstract": "Pre-supernova O-C shell mergers could produce more $^{44}\\mathrm{Ti}$ than the explosion Joshua Issa, Falk Herwig Submitted to ApJ Letters, 10 pages, 5 figures, 4 tables Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) The formation of $^{44}\\mathrm{Ti}$ in massive stars is thought to occur during explosive nucleosynthesis, however recent studies have shown it can be produced during O-C shell mergers prior to core collapse. We investigate how mixing according to 3D macro physics derived from hydrodynamic simulations impacts the pre-supernova O-C shell merger nucleosynthesis and if it can dominate the explosive supernova production of $^{44}\\mathrm{Ti}$ and other radioactive isotopes. We compare a range of observations and models of explosive $^{44}\\mathrm{Ti}$ yields to pre-explosive multi-zone mixing-burning nucleosynthesis simulations of an O-C shell merger in a $15~\\mathrm{M}_\\odot$ stellar model with mixing conditions corresponding to different 3D hydro mixing scenarios. Radioactive species produced in the O shell have a spread in their pre-explosive yields predictions across different 3D mixing scenarios of 2.14 dex on average. $^{44}\\mathrm{Ti}$ has the largest spread of 4.78 dex. The pre-explosive production of $^{44}\\mathrm{Ti}$ can be larger than the production of all massive star models in the NuGrid data set where $^{44}\\mathrm{Ti}$ is dominated by the explosive nucleosynthesis contribution, as well all other massive star and supernova models. We conclude that quantitative predictions of $^{44}\\mathrm{Ti}$ and other radioactive species more broadly require an understanding of the 3D hydrodynamic mixing conditions present during the O-C shell merger.",
      "pdf_url": "https://arxiv.org/pdf/2512.17705.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09778",
      "title": "The X-Ray Dot: Exotic Dust or a Late-Stage Little Red Dot?",
      "authors": [
        "Raphael E. Hviding",
        "Anna de Graaff",
        "Hanpu Liu",
        "Andy D. Goulding",
        "Yilun Ma",
        "Jenny E. Greene",
        "Leindert A. Boogaard",
        "Andrew J. Bunker",
        "Nikko J. Cleri",
        "Marijn Franx",
        "Michaela Hirschmann",
        "Joel Leja",
        "Rohan P. Naidu",
        "Jorryt Matthee",
        "David J. Setton",
        "Hannah Übler",
        "Giacomo Venturi",
        "Bingjie Wang"
      ],
      "abstract": "The X-Ray Dot: Exotic Dust or a Late-Stage Little Red Dot? Raphael E. Hviding, Anna de Graaff, Hanpu Liu, Andy D. Goulding, Yilun Ma, Jenny E. Greene, Leindert A. Boogaard, Andrew J. Bunker, Nikko J. Cleri, Marijn Franx, Michaela Hirschmann, Joel Leja, Rohan P. Naidu, Jorryt Matthee, David J. Setton, Hannah Übler, Giacomo Venturi, Bingjie Wang 21 pages, 7+2 Figures, 1+3 Tables, submitted to AJL. Comments welcome! Astrophysics of Galaxies (astro-ph.GA) JWST's \"Little Red Dots\" (LRDs) are increasingly interpreted as active galactic nuclei (AGN) obscured by dense thermalized gas rather than dust as evidenced by their X-ray weakness, blackbody-like continua, and Balmer line profiles. A key question is how LRDs connect to standard UV-luminous AGN and whether transitional phases exist and if they are observable. We present the \"X-Ray Dot\" (XRD), a compact source at $z=3.28$ observed by the NIRSpec WIDE GTO survey. The XRD exhibits LRD hallmarks: a blackbody-like ($T_{\\rm eff} \\simeq 6400\\,$K) red continuum, a faint but blue rest-UV excess, falling mid-IR emission, and broad Balmer lines ($\\rm FWHM \\sim 2700-3200\\,km\\,s^{-1}$). Unlike LRDs, however, it is remarkably X-ray luminous ($L_\\textrm{2$-$10$\\,$keV} = 10^{44.18}\\,$erg$\\,$s$^{-1}$) and has a continuum inflection that is bluewards of the Balmer limit. We find that the red rest-optical and blue mid-IR continuum cannot be reproduced by standard dust-attenuated AGN models without invoking extremely steep extinction curves, nor can the weak mid-IR emission be reconciled with well-established X-ray--torus scaling relations. We therefore consider an alternative scenario: the XRD may be an LRD in transition, where the gas envelope dominates the optical continuum but optically thin sightlines allow X-rays to escape. The XRD may thus provide a physical link between LRDs and standard AGN, offering direct evidence that LRDs are powered by supermassive black holes and providing insight into their accretion properties.",
      "pdf_url": "https://arxiv.org/pdf/2601.09778.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09780",
      "title": "Breathless BEARS: [O$_{\\rm \\,III}$] 88$μ$m Emission of Dusty Star-Forming Galaxies at $z = 3-4$",
      "authors": [
        "T. J. L. C. Bakx",
        "Hiddo S. B. Algera",
        "Prachi Prajapati",
        "George Bendo",
        "Stefano Berta",
        "Laura Bonavera",
        "Pierre Cox",
        "Joaquin González-Nuevo",
        "Masato Hagimoto",
        "Kevin Harrington",
        "Matthew Lehnert",
        "Stephen Serjeant",
        "Pasquale Temi",
        "Paul van der Werf",
        "Chentao Yang",
        "Gianfranco De Zotti"
      ],
      "abstract": "Breathless BEARS: [O$_{\\rm \\,III}$] 88$μ$m Emission of Dusty Star-Forming Galaxies at $z = 3-4$ T. J. L. C. Bakx, Hiddo S. B. Algera, Prachi Prajapati, George Bendo, Stefano Berta, Laura Bonavera, Pierre Cox, Joaquin González-Nuevo, Masato Hagimoto, Kevin Harrington, Matthew Lehnert, Stephen Serjeant, Pasquale Temi, Paul van der Werf, Chentao Yang, Gianfranco De Zotti Accepted in MNRAS Letters, 8 pages, 5 figures. Comments warmly welcomed Astrophysics of Galaxies (astro-ph.GA) We present [O$_{\\rm \\,III}$] 88$\\mu$m observations towards four ${\\it Herschel}$-selected dusty star-forming galaxies (DSFGs; log$_{10}$ $\\mu$L$_{\\rm IR}$/L$_{\\odot}$ = 13.5 - 14 at $z = 2.9 - 4$) using the Atacama Compact Array (ACA) in Bands 9 and 10. We detect [O$_{\\rm \\,III}$] emission in all four targets at >3$\\sigma$, finding line luminosity ratios ($L_{\\rm [O_{\\rm \\,III}]}$ / L$_{\\rm IR}$ = 10$^{-4.2}$ to 10$^{-3}$) similar to local spiral galaxies, and an order of magnitude lower when compared with local dwarf galaxies as well as high-redshift Lyman-break galaxies. Using the short-wavelength capabilities of the ACA, these observations bridge the populations of galaxies with [O$_{\\rm \\,III}$] emission at low redshift from space missions and at high redshift from ground-based studies. The difference in [O$_{\\rm \\,III}$] emission between these DSFGs and other high-redshift galaxies reflects their more evolved stellar populations (> 10 Myr), larger dust reservoirs (M$_{\\rm dust}$ $\\sim$ 10$^{9 - 11}$ M$_{\\odot}$), metal-rich interstellar medium ($Z \\sim 0.5 - 2$ Z$_{\\odot}$), and likely weaker ionization radiation fields. Ancillary [C$_{\\rm \\,II}$] emission on two targets provide $L_{[{\\rm O}_{\\rm \\,III}]} / L_{[{\\rm C}_{\\rm \\,II}]}$ ratios at 0.3 - 0.9, suggesting that ionized gas represents a smaller fraction of the total gas reservoir in DSFGs, consistent with theoretical models of DSFGs as transitional systems between gas-rich, turbulent disks and more evolved, gas-poor galaxies. Expanding samples of DSFGs with [O$_{\\rm \\,III}$] emission will be key to place this heterogeneous, poorly-understood galactic phase in its astrophysical context.",
      "pdf_url": "https://arxiv.org/pdf/2601.09780.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09789",
      "title": "Growing in number, passive in nature: tracing the evolution of the most massive quiescent galaxies since z ~ 0.8 with BOSS and DESI",
      "authors": [
        "F. R. Ditrani",
        "M. Fossati",
        "M. Longhetti",
        "F. La Barbera",
        "A. Iovino",
        "C. Maraston",
        "D. Thomas",
        "D. Bevacqua"
      ],
      "abstract": "Growing in number, passive in nature: tracing the evolution of the most massive quiescent galaxies since z ~ 0.8 with BOSS and DESI F. R. Ditrani, M. Fossati, M. Longhetti, F. La Barbera, A. Iovino, C. Maraston, D. Thomas, D. Bevacqua 16 pages, 12 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) Luminous Red Galaxies (LRGs) are among the most massive galaxies at any epoch, and lack ongoing star formation. As systems hosting most of the baryonic mass in the local Universe, they preserve imprints of the quenching mechanisms in the early Universe. We exploited the large BOSS and DESI spectroscopic datasets to perform the first homogeneous and continuous mapping of the evolution of stellar population properties of a complete sample of the most massive LRGs ($\\log (M_*/\\mathrm{M_\\odot})> 11.5$) at 0.15 < z < 0.8. By consistently fitting the same spectral indices at all redshifts, we measured trends of [Fe/H], [alpha/Fe], and light-weighted age as a function of redshift. These galaxies exhibit a passive light-weighted age evolution and flat [Fe/H] and [alpha/Fe] trends towards lower redshift, indicating genuinely passive evolution. These trends are robust against the choice of stellar population models and analysis assumptions, and they support the predictions from IllustrisTNG, which predict negligible chemical evolution for the most massive quenched systems at z < 0.8. Our results suggest that, despite nearly 5 Gyr of cosmic time and a 3-4x increase in number density, the stellar population properties of massive quiescent galaxies remain essentially unchanged since z ~ 0.8. This shows a negligible progenitor bias below z ~ 0.8, and a genuinely passive evolution. Newly added systems after $z \\sim 0.8$ were already largely quenched and chemically mature, while subsequent evolution was dominated by dry mergers without altering the bulk of the stellar populations.",
      "pdf_url": "https://arxiv.org/pdf/2601.09789.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09794",
      "title": "The influence of magnetic fields in Cloud-Cloud Collisions",
      "authors": [
        "Theotokis Georgatos",
        "AnthonyP.Whitworth"
      ],
      "abstract": "The influence of magnetic fields in Cloud-Cloud Collisions Theotokis Georgatos, AnthonyP.Whitworth 14 pages, 10 figures, submitted to MNRAS Comments are welcome Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Cloud-cloud collisions are expected to trigger star formation by compressing gas into dense, gravitationally unstable regions. However, the role of magnetic fields in this process is unclear. We use SPH to model head-on collisions between two uniform density clouds, each with mass $500 \\,$M$_{\\odot}$, initial radius 2 pc, and embedded in a uniform magnetic field parallel to the collision velocity. As in the nonmagnetic case, the resulting shock-compressed layer fragments into a network of filaments. If the collision is sufficiently slow, the filaments are dragged into radial orientations by non-homologous gravitational contraction, resulting in a $\\textit{Hub Filament}$ morphology, which spawns a centrally concentrated monolithic cluster with a broad mass function shaped by competitive accretion and dynamical ejections. If the collision is faster, a $\\textit{Spiders Web}$ of intersecting filaments forms, and star-systems condense out in small subclusters, often at the filament intersections; due to their smaller mass reservoirs, and the lower probability of dynamical ejection, the mass function of star-systems formed in these subclusters is narrower. Magnetic fields affect this dichotomy quantitatively by delaying collapse and fragmentation. As a result, the velocity threshold separating $\\textit{Hub Filament}$ and $\\textit{Spiders Web}$ morphologies is shifted upward in magnetised runs, thereby enlarging the parameter space in which $\\textit{Hub Filament}$ morphologies form, and enhancing the likelihood of producing centrally concentrated clusters. Consequently, magnetic fields regulate both the morphology and timing of star formation in cloud-cloud collisions: they broaden filaments, delay the onset of star formation, and promote the formation of $\\textit{Hub Filament}$ morphologies, monolithic clusters and high-mass star-systems.",
      "pdf_url": "https://arxiv.org/pdf/2601.09794.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09796",
      "title": "HR-GO II: chemical abundances of low-$E$ retrograde dynamically-tagged-groups: Revealing Thamnos as a very metal-poor substructure",
      "authors": [
        "Renjing Xie",
        "Zhen Yuan",
        "Haining Li",
        "Tadafumi Matsuno",
        "Nicolas F. Martin",
        "Ruizhi Zhang",
        "Zhiqiang Yan",
        "Federico Sestito",
        "Guillaume F. Thomas",
        "Projjwal Banerjee",
        "Ruizheng Jiang",
        "Linda Lombardo",
        "David S. Aguado",
        "Kohei Hattori",
        "Gang Zhao"
      ],
      "abstract": "HR-GO II: chemical abundances of low-$E$ retrograde dynamically-tagged-groups: Revealing Thamnos as a very metal-poor substructure Renjing Xie, Zhen Yuan, Haining Li, Tadafumi Matsuno, Nicolas F. Martin, Ruizhi Zhang, Zhiqiang Yan, Federico Sestito, Guillaume F. Thomas, Projjwal Banerjee, Ruizheng Jiang, Linda Lombardo, David S. Aguado, Kohei Hattori, Gang Zhao 18 pages, 8 figures, accepted for publication in ApJ. Data are available in Zenodo via this https URL Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Milky Way halo substructures identified in dynamical space are known to suffer from contamination from the Milky Way in-situ stars, which makes their accreted origins uncertain. We present detailed chemical abundances of 35 stars belonging to two sets of dynamically tagged groups, Rg8 and Rg9, to investigate their accreted nature. Both groups are composed of stars with low orbital energy and very retrograde orbits. We find that Rg8 and Rg9 are chemically indistinguishable across all elements, from C to Eu, strongly indicating that they belong to the same structure. The iron-abundance distribution of this low-$E$ retrograde group has a prominent peak at [Fe/H] $\\approx-2.1$, revealing that its main population is very metal-poor, and a secondary peak at [Fe/H] $\\approx-1.5$, very likely due to contamination from Milky Way in-situ stars. These groups also heavily overlap with the Thamnos substructure in dynamical space, and we thus use them to investigate the chemical properties of Thamnos. The dominant, low-metallicity population provides strong evidence for the ex-situ origin of Thamnos, as well as its very metal-poor nature. We do not see any evidence of an $\\alpha$ knee in our sample, which is consistent with previous studies. Comparison with the Cetus-Palca stream in the chemical space shows similar abundance distributions, and thus it suggests that the Thamnos progenitor dwarf galaxy had a truncated star formation history due to its early merger with the Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2601.09796.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09810",
      "title": "Calibrating Mid-Infrared Emission Features As Diagnostics of Star Formation in Infrared-Luminous Galaxies via Radiative Transfer Modeling",
      "authors": [
        "L. Robinson , D. Farrah , A. Efstathiou , A. Engholm , E. Hatziminaoglou , M. Joyce , V. Lebouteiller , S. Petty , L. K. Pitchford , J. Afonso , D. Clements , M. Lacy , C. Pearson , D. Rigopoulou , M. Rowan-Robinson , L. Wang Department of Astronomy, University of Wisconsin-Madison, Department of Physics and Astronomy, University of Hawaii at Manoa, Institute for Astronomy, University of Hawaii, School of Sciences, European University Cyprus, European Southern Observatory, Instituto de Astrofisica de Canarias, Universidad de La Laguna, Opto. Astrofisica, Michigan State University, Universite Paris-Saclay and Universite Paris Cite, NorthWest Research Associates, Department of Physics and Astronomy, Texas A&amp;M University, George &amp; Cynthia Woods Mitchell Institute for Fundamental Physics and Astronomy, Texas A&amp;M University, Instituto de Astrofısica e Ciencias do Espaco, Universidade de Lisboa, Departamento de Fisica, Faculdade de Ciencias, Universidade de Lisboa, Imperial College London, National Radio Astronomy Observatory, RAL Space, STFC Rutherford Appleton Laboratory, The Open University, Oxford Astrophysics, University of Oxford, SRON Netherlands Institute for Space Research, Kapteyn Astronomical Institute, University of Groningen)"
      ],
      "abstract": "Calibrating Mid-Infrared Emission Features As Diagnostics of Star Formation in Infrared-Luminous Galaxies via Radiative Transfer Modeling L. Robinson (1), D. Farrah (2 and 3), A. Efstathiou (4), A. Engholm (2 and 3), E. Hatziminaoglou (5 and 6 and 7), M. Joyce (8), V. Lebouteiller (9), S. Petty (10), L. K. Pitchford (11 and 12), J. Afonso (13 and 14), D. Clements (15), M. Lacy (16), C. Pearson (17 and 18 and 19), D. Rigopoulou (19), M. Rowan-Robinson (15), L. Wang (20 and 21) ((1) Department of Astronomy, University of Wisconsin-Madison, (2) Department of Physics and Astronomy, University of Hawaii at Manoa, (3) Institute for Astronomy, University of Hawaii, (4) School of Sciences, European University Cyprus, (5) European Southern Observatory, (6) Instituto de Astrofisica de Canarias, (7) Universidad de La Laguna, Opto. Astrofisica, (8) Michigan State University, (9) Universite Paris-Saclay and Universite Paris Cite, (10) NorthWest Research Associates, (11) Department of Physics and Astronomy, Texas A&amp;M University, (12) George &amp; Cynthia Woods Mitchell Institute for Fundamental Physics and Astronomy, Texas A&amp;M University, (13) Instituto de Astrofısica e Ciencias do Espaco, Universidade de Lisboa, (14) Departamento de Fisica, Faculdade de Ciencias, Universidade de Lisboa, (15) Imperial College London, (16) National Radio Astronomy Observatory, (17) RAL Space, STFC Rutherford Appleton Laboratory, (18) The Open University, (19) Oxford Astrophysics, University of Oxford, (20) SRON Netherlands Institute for Space Research, (21) Kapteyn Astronomical Institute, University of Groningen) Astrophysics of Galaxies (astro-ph.GA) Luminous infrared galaxies are key sites of obscured stellar mass assembly at z > 0.5. Their star formation rates (SFRs) are often estimated using the luminosities of the 6.2 micron and 11.2 micron polycyclic aromatic hydrocarbon (PAH) features, or those of the [Ne II] and [Ne III] fine-structure lines, as they are minimally affected by obscuration. It is uncertain whether the calibration of these features as SFR tracers depends on the starburst bolometric luminosity or the level of Active Galactic Nucleus (AGN) activity. We here investigate the relationship between the luminosities of PAH and Neon lines with star formation rate for highly luminous objects using radiative transfer modeling and archival observations of 42 local Ultraluminous (>= 10^12 L_sun) Infrared Galaxies (ULIRGs). We find that PAH and [Ne II] features arise mainly in star-forming regions, with small contributions from the AGN or host, but that the [Ne III] line has a mixed contribution from both star formation and AGN activity. We present relations between L_PAH and L_NeII, and both starburst luminosity and SFR. We find relations for lower luminosity (L_IR ~= 10^10-10^12 L_sun) systems underestimate the SFRs in local ULIRGs by up to ~1 dex. The 6.2 micron and 11.2 micron PAH features, and the [Ne II] line, are thus good tracers of SFR in ULIRGs. We do not find that a more luminous AGN affects the relationship between SFR and PAH or Neon luminosity, but that it can make PAH emission harder to discern. Our results and derived relations are relevant to studies of star-forming and composite galaxies at z < 3 with the James Webb Space Telescope.",
      "pdf_url": "https://arxiv.org/pdf/2601.09810.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09843",
      "title": "The formation of periodic three-body orbits for Newtonian systems",
      "authors": [
        "Simon Portegies Zwart",
        "Arjen Doelman",
        "Jelmer Sein"
      ],
      "abstract": "The formation of periodic three-body orbits for Newtonian systems Simon Portegies Zwart, Arjen Doelman, Jelmer Sein Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM); Mathematical Physics (math-ph) Braids are periodic solutions to the general N-body problem in gravitational dynamics. These solutions seem special and unique, but they may result from rather usual encounters between four bodies. We aim at understanding the existence of braids in the Galaxy by reverse engineering the interactions in which they formed. We simulate self-gravitating systems of N particles, starting with the constructing of a specific braid, and bombard it with a single object. We study how frequently the bombarded braid dissolves in four singles, a triple and a single, a binary and 2 singles, or 2 binaries. The relative proportion of those events gives us insight into how easy it is to generate a braid through the reverse process. It turns out that braids are easily generated from encounters between 2 binaries, or a triple with a single object, independent on the braid's stability. We find that 3 of the explored braids are linearly stable against small perturbations, whereas one is unstable and short-lived. The shortest-lived braid appears the least stable and the most chaotic. nonplanar encounters also lead to braid formation, which, in our experiments, themselves are planar. The parameter space in azimuth and polar angle that lead to braid formation via binary-binary or triple-single encounters is anisotropic, and the distribution has a low fractal dimension. Since a substantial fraction of ~9% of our calculations lead to periodic 3-body systems, braids may be more common than expected. They could form in multi-body interactions. We do not expect many to exist for time, but they may be common as transients, as they survive for tens to hundreds of periodic orbits. We argue that braids are common in relatively shallow-potential background fields, such as the Oort cloud or the Galactic halo. If composed of compact objects, they potentially form interesting targets for gravitational wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2601.09843.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM",
        "math-ph"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.09846",
      "title": "Are Recently Quenched Ellipticals Truly Isolated Centrals?",
      "authors": [
        "Deepak K. Deo"
      ],
      "abstract": "Are Recently Quenched Ellipticals Truly Isolated Centrals? Deepak K. Deo Astrophysics of Galaxies (astro-ph.GA) Recently Quenched Ellipticals (RQEs) provide a valuable test case for disentangling intrinsic and environmental quenching, particularly because they are commonly classified as isolated central galaxies in low-mass halos. However, central/satellite assignments and isolation labels can vary across group catalogs, and such misclassifications can strongly bias physical interpretations. We present a uniform, physically motivated reassessment of the environments of 155 RQEs previously identified as centrals in an SDSS-based group catalog. We construct value-added neighbor catalogs via KD-tree searches and apply consistent thresholds in projected separation and line-of-sight velocity to (i) verify centrality, (ii) quantify isolation using a mass-ratio-based companion criterion, and (iii) identify potential pseudo-centrals via proximity to massive clusters. We find that 132/155 (85.2\\%) RQEs remain true centrals, while 23/155 (14.8\\%) are better interpreted as misidentified centrals with a more massive neighbor within $R_{\\rm proj}\\leq0.8$~Mpc and $\\Delta V\\leq250$~km~s$^{-1}$. Among the true centrals, 110/132 (83.3\\%) satisfy our isolation criterion, and only one system meets our pseudo-central definition, indicating that direct cluster-scale preprocessing is rare for RQE centrals. Using projected number density and surface stellar mass density, we show that misidentified and non-isolated systems occupy systematically denser regimes than isolated true centrals. These results imply that while most RQEs ($\\sim$71\\%) are consistent with predominantly internal quenching in genuinely isolated centrals, a non-negligible minority ($\\sim$29\\%) likely experienced environmentally influenced pathways at group scales.",
      "pdf_url": "https://arxiv.org/pdf/2601.09846.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09948",
      "title": "Beyond UV: Rest-frame B-band and Apparent Luminosity Functions of z=5-9 Galaxies",
      "authors": [
        "Nicha Leethochawalit",
        "Takahiro Morishita",
        "Tirawut Worrakitpoonpon",
        "Michele Trenti"
      ],
      "abstract": "Beyond UV: Rest-frame B-band and Apparent Luminosity Functions of z=5-9 Galaxies Nicha Leethochawalit, Takahiro Morishita, Tirawut Worrakitpoonpon, Michele Trenti 20 pages, 6 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We present new measurements of galaxy luminosity functions (LFs) from JWST/NIRCam imaging over the redshift range z=4.5-9.7, using photometric catalogs from JADES and public extragalactic fields. Our analysis includes rest-frame UV and B-band LFs, as well as apparent LFs in F090W, F115W, F200W, F356W, and F444W. We present the first constraints on the rest-frame B-band LF at z~7-8 and extend existing measurements at z~5 to M(B) = -18 mag. The B-band LFs evolve more strongly with redshift than UV LFs, though both decline more gradually than predicted by simulations at z>5. No single existing simulation reproduces all observed trends, with discrepancies likely driven by assumptions about binary evolution and stellar population synthesis models. The apparent LFs in F356W and F444W show hints of a bright-end excess at all redshifts, extending to fainter magnitudes at higher redshift. While extreme emission line galaxies may partially account for it, the excess may also indicate a population of moderately red, optically bright sources - potentially dusty star-forming galaxies or obscured AGNs. Finally, we find that rest-frame B-band luminosity correlates more tightly with stellar mass than UV, making it a powerful tracer of mass assembly and reinforcing the diagnostic value of rest-frame optical LFs in uncovering the physical processes that drive early galaxy formation.",
      "pdf_url": "https://arxiv.org/pdf/2601.09948.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10097",
      "title": "Caught in Swallowtails: Discovery of Two Swallowtail Image Formations in MS 0451.6-0305",
      "authors": [
        "Ashish K. Meena",
        "Wenlei Chen",
        "Lukas J. Furtak",
        "Johan Richard",
        "Adi Zitrin",
        "Jose M. Diego",
        "Mathilde Jauzac",
        "Patrick L. Kelly",
        "Rogier A. Windhorst"
      ],
      "abstract": "Caught in Swallowtails: Discovery of Two Swallowtail Image Formations in MS 0451.6-0305 Ashish K. Meena, Wenlei Chen, Lukas J. Furtak, Johan Richard, Adi Zitrin, Jose M. Diego, Mathilde Jauzac, Patrick L. Kelly, Rogier A. Windhorst 11 pages, 4 figures, 4 tables. Comments welcome Astrophysics of Galaxies (astro-ph.GA) We report the discovery of two swallowtail image formations at $z=2.91$ and $z=6.70$ behind the galaxy cluster MS 0451.6-0305 in JWST-NIRCam imaging. We find that in both of the above lensed systems, the complex image morphology cannot be reproduced by simple fold/cusp caustics, and detailed lens modeling reveals higher-order swallowtail caustic configurations. In the $z=2.91$ lens system, a small part of the source galaxy (which itself is part of a galaxy group) containing atleast two compact knots sits inside the swallowtail caustic, producing a quadruply imaged arc. At two of the image positions of these knots, we infer point source magnifications of $\\gtrsim 300$, implying lensing-corrected effective radii of $\\lesssim 0.8-1.5$ pc. The $z=6.70$ system exhibits even more complex image formation. We therefore only use the most confidently identified counter-images of knots in this system as constraints in our lens modeling. The resulting model predicts magnifications $\\sim20-200$ and lensing-corrected effective radii of $\\lesssim 0.8-18.5$ pc for various knots. Together, these two systems represent the first example of observations of multiple swallowtail image formations in a single galaxy cluster and demonstrate the ability of swallowtail caustics to magnify individual substructures at sub-parsec scales, from intermediate redshifts to the first billion years of the Universe.",
      "pdf_url": "https://arxiv.org/pdf/2601.10097.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10361",
      "title": "Testing the correlation between bending angle and polarization properties of bent radio galaxies",
      "authors": [
        "S. Vanderwoude",
        "E. Osinga",
        "B. M. Gaensler",
        "J. L. West",
        "R. J. van Weeren"
      ],
      "abstract": "Testing the correlation between bending angle and polarization properties of bent radio galaxies S. Vanderwoude, E. Osinga, B. M. Gaensler, J. L. West, R. J. van Weeren Astrophysics of Galaxies (astro-ph.GA) The bending of radio galaxies in galaxy clusters is expected to be caused by interactions with the local environment. The physical processes responsible for jet bending, and their influence on the polarization properties of radio galaxies, remain poorly understood, leading to the question of whether jet properties in bent radio galaxies differ from those in linear radio galaxies. Using a sample of 24 polarized bent radio galaxies, observed with the Karl G. Jansky Very Large Array at 1--2 GHz, we test for correlation of bending angle with polarization parameters measuring Faraday rotation, intrinsic fractional polarization, and Faraday rotation dispersion, used here as a measure of turbulence along the line of sight. We find no statistically significant correlations. At the spatial resolution of our dataset (3--46 kpc, median 18.4 kpc), our results indicate that we are primarily probing larger-scale intracluster medium effects not related to bending angle. The absence of a statistically significant correlation suggests that bent radio galaxies are reliable probes of intracluster magnetic fields, because their intrinsic properties do not appear to introduce systematic biases into measured polarization parameters. We do detect a preference for source magnetic field vectors to align with the direction of jet bending. Finally, we estimate that the POSSUM and SKA surveys will contain $\\gtrsim$300 and $\\gtrsim$1000 polarized radio galaxies, respectively, providing large future samples with a range of bending angles and similar redshift distribution and number of beams per source as in our sample, enabling our results to be tested with greater statistical power.",
      "pdf_url": "https://arxiv.org/pdf/2601.10361.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10372",
      "title": "Active Galactic Nuclei and STaR fOrmation in Nearby Galaxies (AGNSTRONG). II: Results for Jetted Type-I AGNs with Strong Ionized Gas Outflows",
      "authors": [
        "Chen Qin",
        "Huynh Anh N. Le",
        "Yongquan Xue",
        "Shifu Zhu",
        "Xiaozhi Lin",
        "Kim Ngan Nhat Nguyen"
      ],
      "abstract": "Active Galactic Nuclei and STaR fOrmation in Nearby Galaxies (AGNSTRONG). II: Results for Jetted Type-I AGNs with Strong Ionized Gas Outflows Chen Qin, Huynh Anh N. Le, Yongquan Xue, Shifu Zhu, Xiaozhi Lin, Kim Ngan Nhat Nguyen Astrophysics of Galaxies (astro-ph.GA) We investigate the correlation between ionized gas outflows, jets, and star formation in a sample of 42 local type-I active galactic nuclei (AGNs) exhibiting significant [O III] outflows. This study uses both new submillimeter (sub-mm) observations and archival data from the James Clerk Maxwell Telescope. Our analysis, which includes a correction for jet emission in the sub-mm bands, fitting spectral energy distribution, and analyzing spectra, enables us to derive star-formation rates (SFRs) through various methods. By comparing radio power and SFRs, we select a sub-sample of jetted AGNs of which radio emission is mostly from the jets. We find that jetted AGNs predominantly lie above the main sequence of star-forming galaxies, suggesting a correlation between jet activity and star formation. By comparing dust extinction, we demonstrate that jetted AGNs do not have more dust which is the fuel of both star formation and AGN activity. Therefore, this correlation is more likely to arise from AGN feedback. We also find that the Eddington ratio does not impact the specific SFRs (sSFRs) of our sample. Additionally, for jetted AGNs, stronger radio emission corresponds to higher sSFRs, suggesting that jet emission may promote star formation, i.e., positive feedback. Our results not only shed light on the feedback mechanisms of AGNs but also underscore the complex interplay between black hole activity and star formation in galaxy evolution.",
      "pdf_url": "https://arxiv.org/pdf/2601.10372.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10514",
      "title": "Discovery of the First Five Carbon-Enhanced Metal-Poor Stars in the LMC",
      "authors": [
        "Madeline Lucey",
        "Vedant Chandra",
        "Alexander Ji",
        "Andrew Casey",
        "David Nidever",
        "Sean Morrison",
        "Robyn Sanderson",
        "Slater Oden",
        "José Fernández-Trincado",
        "Guilherme Limberg"
      ],
      "abstract": "Discovery of the First Five Carbon-Enhanced Metal-Poor Stars in the LMC Madeline Lucey, Vedant Chandra, Alexander Ji, Andrew Casey, David Nidever, Sean Morrison, Robyn Sanderson, Slater Oden, José Fernández-Trincado, Guilherme Limberg 13 pages, 9 figures, 1 table, submitted to ApJL, comments welcome! Astrophysics of Galaxies (astro-ph.GA) A substantial fraction of metal-poor stars in the local Milky Way halo exhibit large overabundances of carbon. These stars, dubbed Carbon-Enhanced Metal-Poor (CEMP) stars, provide crucial constraints on the nature of the early universe including the earliest nucleosynthetic events. Whether these stars exist at similar rates in nearby galaxies is a major open question with implications for the environmental dependence of early chemical evolution. Here, we present the discovery of the first five CEMP stars in the Milky Way's largest dwarf companion, the LMC, using SDSS-V spectra from the BOSS instrument. We measure metallicities ranging from [Fe/H] = -2.1 to -3.2 and evolutionary state corrected carbon enhancements of [C/Fe] = +1.2 to +2.4, placing these stars among the most metal-poor and carbon-rich ever identified in the LMC. This discovery demonstrates that CEMP stars do exist in the LMC despite previous null detections, and establishes the foundation for measuring the CEMP occurrence rate in this system. Such measurements will provide critical tests of whether environmental differences affect the formation channels and frequencies of these ancient, carbon-rich stars.",
      "pdf_url": "https://arxiv.org/pdf/2601.10514.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10573",
      "title": "Origins of the UV continuum and Balmer emission lines in Little Red Dots: observational validation of dense gas envelope models enshrouding the AGN",
      "authors": [
        "Yoshihisa Asada",
        "Kohei Inayoshi",
        "Qinyue Fei",
        "Seiji Fujimoto",
        "Chris Willott"
      ],
      "abstract": "Origins of the UV continuum and Balmer emission lines in Little Red Dots: observational validation of dense gas envelope models enshrouding the AGN Yoshihisa Asada, Kohei Inayoshi, Qinyue Fei, Seiji Fujimoto, Chris Willott Submitted to ApJL. Comments are welcome Astrophysics of Galaxies (astro-ph.GA) We present a statistical study on the origins of the UV continuum and narrow/broad emission lines in little red dots (LRDs), a newly discovered class of active galactic nuclei (AGNs). Leveraging all archived JWST/NIRSpec data, we build a sample of 28 spectroscopically-confirmed LRDs at $5<z_{\\rm spec}<7.2$, by requiring broad H$\\alpha$ emission, blue UV colors, V-shaped continua, and compact morphologies. We define a control sample of 9 blue, compact, broad-line AGNs without red optical continua (hereafter little blue dots; LBDs), and examine correlations between rest UV and the narrow/broad H$\\alpha$ luminosities in these populations. In LRDs, both narrow and broad H$\\alpha$ components are tightly correlated with the UV continuum, and the luminosity ratios are consistent with those in young starburst galaxies. In contrast, the UV to broad H$\\alpha$ ratios in LBDs closely match local unobscured AGNs and are statistically different from LRDs. The Ly$\\alpha$ occurrence rates and strengths do not differ between LRDs and LBDs and are comparable to normal star-forming galaxies. These results are consistent with a scenario where the central BH in LRDs is enshrouded by a dense opaque gas envelope -- in this model, the UV continuum as well as narrow and even broad H$\\alpha$ emissions are not powered by AGNs but predominantly by young massive stars surrounding the envelope, while the envelope radiates as a $\\sim 5000$ K blackbody. As the envelope dissipates, direct AGN emission can emerge, potentially transforming LRDs into LBDs and marking the end of a short-lived phase of rapid black hole growth.",
      "pdf_url": "https://arxiv.org/pdf/2601.10573.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10642",
      "title": "HII regions in NGC 628: the view of two catalogs",
      "authors": [
        "Ksenia I. Smirnova",
        "Dmitri S. Wiebe"
      ],
      "abstract": "HII regions in NGC 628: the view of two catalogs Ksenia I. Smirnova, Dmitri S. Wiebe 4 pages, 4 figures Conference Modern Astronomy: Science and Education (to the 270th Anniversary of Moscow University) Astrophysics of Galaxies (astro-ph.GA) The study is devoted to comparing the parameters of the interstellar medium of HII regions in the Kongiu and Groves catalogs for the galaxy NGC 628. The article analyzes the characteristics of star-forming regions, including a comparison of radiation fluxes in the ranges of 7.7 $\\mu$m and 21 $\\mu$m and in the H$\\alpha$, H$\\beta$, OIII and CO lines, calculating the kinematic parameters (FWHM) for the lines, and analyzing the spatial distribution of regions for both catalogs. The results of the study showed that the regions from the Groves catalog demonstrate higher line widths compared to the Kongiu catalog. Signs of possible misidentified classification of some regions from the Groves catalog were revealed: there is a possibility that some of them are not HII regions, but shock ionization regions.",
      "pdf_url": "https://arxiv.org/pdf/2601.10642.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09768",
      "title": "CLiMB: A Domain-Informed Novelty Detection Clustering Framework for Scientific Discovery",
      "authors": [
        "Lorenzo Monti",
        "Tatiana Muraveva",
        "Brian Sheridan",
        "Davide Massari",
        "Alessia Garofalo",
        "Gisella Clementini",
        "Umberto Michelucci"
      ],
      "abstract": "CLiMB: A Domain-Informed Novelty Detection Clustering Framework for Scientific Discovery Lorenzo Monti, Tatiana Muraveva, Brian Sheridan, Davide Massari, Alessia Garofalo, Gisella Clementini, Umberto Michelucci Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Artificial Intelligence (cs.AI) In data-driven scientific discovery, a challenge lies in classifying well-characterized phenomena while identifying novel anomalies. Current semi-supervised clustering algorithms do not always fully address this duality, often assuming that supervisory signals are globally representative. Consequently, methods often enforce rigid constraints that suppress unanticipated patterns or require a pre-specified number of clusters, rendering them ineffective for genuine novelty detection. To bridge this gap, we introduce CLiMB (CLustering in Multiphase Boundaries), a domain-informed framework decoupling the exploitation of prior knowledge from the exploration of unknown structures. Using a sequential two-phase approach, CLiMB first anchors known clusters using constrained partitioning, and subsequently applies density-based clustering to residual data to reveal arbitrary topologies. We demonstrate this framework on RR Lyrae stars data from the Gaia Data Release 3. CLiMB attains an Adjusted Rand Index of 0.829 with 90% seed coverage in recovering known Milky Way substructures, drastically outperforming heuristic and constraint-based baselines, which stagnate below 0.20. Furthermore, sensitivity analysis confirms CLiMB's superior data efficiency, showing monotonic improvement as knowledge increases. Finally, the framework successfully isolates three dynamical features (Shiva, Shakti, and the Galactic Disk) in the unlabelled field, validating its potential for scientific discovery.",
      "pdf_url": "https://arxiv.org/pdf/2601.09768.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10099",
      "title": "Using rapid rotators as tracers of multiplicity statistics as a function of stellar density",
      "authors": [
        "Priyanka Cingirikonda",
        "Marina Kounkel",
        "Joseph Mullen"
      ],
      "abstract": "Using rapid rotators as tracers of multiplicity statistics as a function of stellar density Priyanka Cingirikonda, Marina Kounkel, Joseph Mullen 7 pages, 3 figures, accepted to ApJ Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Recent works have identified that rapidly rotating stars are predominantly binaries with separations of a few to a few tenths of au. This is a crucial range of separation that is often inaccessible to searches of binary stars, providing a unique opportunity to examine their statistical properties. In particular, we have performed an analysis of rapid rotators in young moving groups. We examined their fraction as a function of the stellar density of the population in which they are found. We find that there is a deficit of rapid rotators in dense clusters such as the Orion Nebula in comparison to the more diffuse parts of the Orion Complex, as intracluster interactions with neighboring stars likely dissolve binaries with intermediate separations before they had a chance to fully form. In contrast, in older populations with an age of $\\sim100$ Myr, mass segregation redistributes binaries relative to single stars, thus in such older regions, rapid rotators are predominantly found in the regions of higher stellar density. This work sheds light on both the conditions that lead to the formation of binary stars and their dynamical evolution.",
      "pdf_url": "https://arxiv.org/pdf/2601.10099.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10240",
      "title": "Large-scale time-series spectroscopy for stellar ages",
      "authors": [
        "David Gruner",
        "Sydney A. Barnes",
        "Ansgar Reiners",
        "Klaus G. Strassmeier",
        "Cristina Chiappini",
        "Jörg Weingrill",
        "Michael Weber",
        "Ilya Ilyin",
        "Thomas Granzer",
        "Özgün Adebali",
        "Jean-Michel Désert",
        "Marica Valentini",
        "Dario Fritzewski",
        "Paolo Ventura",
        "Alfio Bonanno",
        "Jose-Dias do Nascimento",
        "Jorge Melendez",
        "Santosh Joshi",
        "Yong-Cheol Kim"
      ],
      "abstract": "Large-scale time-series spectroscopy for stellar ages David Gruner, Sydney A. Barnes, Ansgar Reiners, Klaus G. Strassmeier, Cristina Chiappini, Jörg Weingrill, Michael Weber, Ilya Ilyin, Thomas Granzer, Özgün Adebali, Jean-Michel Désert, Marica Valentini, Dario Fritzewski, Paolo Ventura, Alfio Bonanno, Jose-Dias do Nascimento, Jorge Melendez, Santosh Joshi, Yong-Cheol Kim White Paper submitted to ESO for the \"Expanding Horizons: Transforming Astronomy in the 2040s\" Call Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) To date, Galactic Astronomy has largely concerned itself with astrophysical processes, and with the locations, space motions and compositions of objects. Consider, for example, the elucidation of the components of the Galaxy over the past decades, its mapping as enabled by Gaia and its predecessors, the photometric and spectroscopic characterization of innumerable astrophysical objects in various wavelength ranges, both from the ground and from space, and the expanding discovery and characterization of exoplanets; all focused on the current, static Galaxy. This White Paper proposes a dedicated program to derive stellar ages from time-series spectroscopy to hasten the transformation of this static conception into a dynamical one with age-labeled objects and events.",
      "pdf_url": "https://arxiv.org/pdf/2601.10240.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10595",
      "title": "High-fidelity stellar extinction with Gaia and APOGEE -- I. The method and a new extinction curve",
      "authors": [
        "Jie Yu",
        "Luca Casagrande",
        "John A. Taylor",
        "Ioana Ciucă",
        "Giacomo Cordoni",
        "Ronald Drimmel",
        "Shourya Khanna",
        "Hiep Nguyen",
        "Tomasz Różański",
        "Dennis Stello",
        "Haibo Yuan",
        "Zhen Yuan"
      ],
      "abstract": "High-fidelity stellar extinction with Gaia and APOGEE -- I. The method and a new extinction curve Jie Yu, Luca Casagrande, John A. Taylor, Ioana Ciucă, Giacomo Cordoni, Ronald Drimmel, Shourya Khanna, Hiep Nguyen, Tomasz Różański, Dennis Stello, Haibo Yuan, Zhen Yuan 15 pages, 11 figures, 1 table. Submitted to MNRAS. Reddening and extinction values will become publicly available when the manuscript is accepted Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) The scarcity of high-fidelity extinction measurements remains a bottleneck in deriving accurate stellar properties from Gaia parallaxes. In this work, we aim to derive precision extinction estimates for APOGEE DR19 stars, establishing a new benchmark for Galactic stellar population studies. We first determine reddening by comparing observed colorsr, etrieved from photometric surveys or standardized synthetic magnitudes from Gaia BP/RP spectra, to intrinsic colors predicted via an XGBoost model. The model is trained on minimally reddened stars to infer intrinsic colors and their associated uncertainties, using APOGEE stellar parameters (Teff, logg, [Fe/H], and [alpha/Fe]). The derived reddening values are then converted into extinctions using an anchor ratio of A_BP / A_RP = 1.694 +/- 0.004, derived from red-clump-like stars. Here, we provide extinction measurements in 39 filters across 10 photometric systems and introduce a new empirical extinction curve optimized for broadband passbands. Our extinction estimates (Av) outperform existing results (Bayestar19, StarHorse, SEDEX), achieving a typical precision of 0.03 mag in Av. Notably, we identify systematic deviations of up to 30% between monochromatic and passband-integrated extinction ratios at wavelengths greater than 700 nm. This result highlights the necessity of adopting passband-specific coefficients when correcting extinction to derive stellar parameters. As the foundation for a forthcoming series of papers, these benchmark measurements will be used to (1) revise asteroseismic scaling relations, (2) calibrate differential reddening in open clusters, and (3) reconcile heterogeneous dust maps into a unified, all-sky extinction scheme.",
      "pdf_url": "https://arxiv.org/pdf/2601.10595.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2401.02476",
      "title": "Multiple Populations and a CH Star Found in the 300S Globular Cluster Stellar Stream",
      "authors": [
        "Sam A. Usman",
        "Alexander P. Ji",
        "Ting S. Li",
        "Andrew B. Pace",
        "Lara R. Cullinane",
        "Gary S. Da Costa",
        "Sergey E. Koposov",
        "Geraint F. Lewis",
        "Daniel B. Zucker",
        "Vasily Belokurov",
        "Joss Bland-Hawthorn",
        "Peter S. Ferguson",
        "Terese T. Hansen",
        "Guilherme Limberg",
        "Sarah L. Martell",
        "Madeleine McKenzie",
        "Joshua D. Simon"
      ],
      "abstract": "Multiple Populations and a CH Star Found in the 300S Globular Cluster Stellar Stream Sam A. Usman, Alexander P. Ji, Ting S. Li, Andrew B. Pace, Lara R. Cullinane, Gary S. Da Costa, Sergey E. Koposov, Geraint F. Lewis, Daniel B. Zucker, Vasily Belokurov, Joss Bland-Hawthorn, Peter S. Ferguson, Terese T. Hansen, Guilherme Limberg, Sarah L. Martell, Madeleine McKenzie, Joshua D. Simon 15 pages, 7 tables, 8 figures. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Milky Way globular clusters (GCs) display chemical enrichment in a phenomenon called multiple stellar populations (MSPs). While the enrichment mechanism is not fully understood, there is a correlation between a cluster's mass and the fraction of enriched stars found therein. However, present-day GC masses are often smaller than their masses at the time of formation due to dynamical mass loss. In this work, we explore the relationship between mass and MSPs using the stellar stream 300S. We present the chemical abundances of eight red giant branch member stars in 300S with high-resolution spectroscopy from Magellan/MIKE. We identify one enriched star characteristic of MSPs and no detectable metallicity dispersion, confirming that the progenitor of 300S was a globular cluster. The fraction of enriched stars (12.5\\%) observed in our 300S stars is less than the 50\\% of stars found enriched in Milky Way GCs of comparable present-day mass ($\\sim10^{4.5}$\\msun). We calculate the mass of 300S's progenitor and compare it to the initial masses of intact GCs, finding that 300S aligns well with the trend between the system mass at formation and enrichment. 300S's progenitor may straddle the critical mass threshold for the formation of MSPs and can therefore serve as a benchmark for the stellar enrichment process. Additionally, we identify a CH star, with high abundances of \\textit{s}-process elements, probably accreted from a binary companion. The rarity of such binaries in intact GCs may imply stellar streams permit the survival of binaries that would otherwise be disrupted.",
      "pdf_url": "https://arxiv.org/pdf/2401.02476.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.15664",
      "title": "Chemical Abundances in the Metal-Poor Globular Cluster ESO 280-SC06: A Formerly Massive, Tidally Disrupted Globular Cluster",
      "authors": [
        "Sam A. Usman",
        "Alexander P. Ji",
        "Jandrie Rodriguez",
        "Jeffrey D. Simpson",
        "Sarah L. Martell",
        "Ting S. Li",
        "Ana Bonaca",
        "Shivani P. Shah",
        "Madeleine McKenzie"
      ],
      "abstract": "Chemical Abundances in the Metal-Poor Globular Cluster ESO 280-SC06: A Formerly Massive, Tidally Disrupted Globular Cluster Sam A. Usman, Alexander P. Ji, Jandrie Rodriguez, Jeffrey D. Simpson, Sarah L. Martell, Ting S. Li, Ana Bonaca, Shivani P. Shah, Madeleine McKenzie 20 pages, 6 figures, 15 tables. Accepted for publication in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) We present the first high-resolution abundance study of ESO 280-SC06, one of the least luminous and most metal-poor gravitationally bound Milky Way globular clusters. Using Magellan/MIKE spectroscopy for ten stars, we confirm the cluster's low metallicity as [Fe/H] = $-2.54 \\pm 0.06$ and the presence of a nitrogen-enhanced star enriched by binary mass transfer. We determine abundances or abundance upper limits for 21 additional elements from the light, alpha, odd-Z, iron peak, and neutron-capture groups for all ten stars. We find no spread in neutron-capture elements, unlike previous trends identified in some metal-poor globular clusters such as M15 and M92. Eight of the ten stars have light-element abundance patterns consistent with second-population globular cluster stars, which is a significantly larger second-population fraction than would be expected from the low present-day mass of $10^{4.1}$ Msun. We estimate the initial mass of the cluster as $10^{5.4 - 5.7}$ Msun based on its orbit in the Milky Way. A preferential loss of first-population stars could explain the high fraction of second-population stars at the present time. Our results emphasize the importance of considering mass loss when studying globular clusters and their enrichment patterns.",
      "pdf_url": "https://arxiv.org/pdf/2506.15664.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.10551",
      "title": "Angular-momentum pairs in spherical systems: applications to the Galactic centre",
      "authors": [
        "Taras Panamarev",
        "Yonadav Barry Ginat",
        "Bence Kocsis"
      ],
      "abstract": "Angular-momentum pairs in spherical systems: applications to the Galactic centre Taras Panamarev, Yonadav Barry Ginat, Bence Kocsis 25 pages, 9 figures. Accepted by MNRAS Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) Consider a system of point masses in a spherical potential. In such systems objects execute planar orbits covering two-dimensional rings or annuli, represented by the angular-momentum vectors, which slowly reorient due to the persistent weak gravitational interaction between different rings. This process, called vector resonant relaxation, is much faster than other processes which change the size/shape of the rings. The interaction is stron9gest between objects with closely aligned angular-momentum vectors. In this paper, we show that nearly parallel angular-momentum vectors may form stable bound pairs in angular-momentum space. We examine the stability of such pairs against an external massive perturber, and determine the critical separation analogous to the Hill radius or tidal radius in the three-body problem, where the angular-momentum pairs are marginally disrupted, as a function of the perturber's mass, the orbital inclination, and the radial distance. Angular-momentum pairs or multiples closer than the critical inclination will remain bound and evolve together in angular-momentum-direction space under any external influence, such as anisotropic density fluctuations, or massive perturbers. This study has applications in various astrophysical contexts, including galactic nuclei, in particular the Milky Way's Galactic centre, globular clusters, or planetary systems. In nuclear star clusters with a central super-massive black hole, we apply this criterion to the disc of young, massive stars, and show that clusters in angular-momentum space may be used to constrain the presence of intermediate-mass black holes or the mass of the nearby gaseous torus.",
      "pdf_url": "https://arxiv.org/pdf/2507.10551.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.01372",
      "title": "A Nitrogen-rich AGN Powering a Large Ionizing Bubble at z=8.63",
      "authors": [
        "Takahiro Morishita",
        "Massimo Stiavelli",
        "Charlotte A. Mason",
        "Roberta Tripodi",
        "Marco Chiaberge",
        "Stefan Schuldt",
        "Chris J. Willott",
        "Yechi Zhang"
      ],
      "abstract": "A Nitrogen-rich AGN Powering a Large Ionizing Bubble at z=8.63 Takahiro Morishita, Massimo Stiavelli, Charlotte A. Mason, Roberta Tripodi, Marco Chiaberge, Stefan Schuldt, Chris J. Willott, Yechi Zhang accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) We report the detection of Ly${\\alpha}$ in CANUCS-LRD-z8.6, a recently discovered AGN at z = 8.63 by Tripodi et al. (2024), in new NIRSpec/MSA G140H/F070LP observations. We detect broad Ly${\\alpha}$ emission (FWHM $= 1540 \\pm 260$ km/s) near the systemic velocity, which suggests a large ionizing bubble considering that the universe is almost fully neutral at the redshift. Through Ly${\\alpha}$ line-shape modeling assuming a Stromgren sphere, we find a large bubble radius, $R_b = 1.5^{+0.3}_{-0.2}$ pMpc, and a moderately high Ly${\\alpha}$ escape fraction, $f_{esc} = 11 \\pm 3$ %. The intrinsic line width is inferred to be broad ($2200 \\pm 280$ km/s), likely originating in the broad-line region. Existing data indicate that CANUCS-LRD-z8.6 is within a mild overdensity, $\\delta = 1.8^{+3.0}_{-0.6}$, suggesting that other galaxies in its proximity might have contributed to the formation of the bubble. The high N IV]${\\lambda}$1488 / C IV${\\lambda}$1548 and N IV]${\\lambda}$1488 / O III]${\\lambda}$1661 line ratios measured in existing NIRSpec/PRISM data indicate nitrogen enrichment in this metal-poor, low-luminosity AGN. The spectroscopic features are overall similar to other nitrogen-rich galaxies discovered in the literature, such as GN-z11 and GHZ2/GLASSz12. This suggests that CANUCS-LRD-z8.6 may represent one of the evolutionary phases of those nitrogen-rich galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2508.01372.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20455",
      "title": "BlackTHUNDER: Shedding light on a dormant and extreme little red dot at z=8.50",
      "authors": [
        "Gareth C. Jones",
        "Hannah Übler",
        "Roberto Maiolino",
        "Xihan Ji",
        "Alessandro Marconi",
        "Francesco D'Eugenio",
        "Santiago Arribas",
        "Andrew J. Bunker",
        "Stefano Carniani",
        "Stéphane Charlot",
        "Giovanni Cresci",
        "Kohei Inayoshi",
        "Yuki Isobe",
        "Ignas Juodžbalis",
        "Giovanni Mazzolari",
        "Pablo G. Pérez-González",
        "Michele Perna",
        "Raffaella Schneider",
        "Jan Scholtz",
        "Sandro Tacchella"
      ],
      "abstract": "BlackTHUNDER: Shedding light on a dormant and extreme little red dot at z=8.50 Gareth C. Jones, Hannah Übler, Roberto Maiolino, Xihan Ji, Alessandro Marconi, Francesco D'Eugenio, Santiago Arribas, Andrew J. Bunker, Stefano Carniani, Stéphane Charlot, Giovanni Cresci, Kohei Inayoshi, Yuki Isobe, Ignas Juodžbalis, Giovanni Mazzolari, Pablo G. Pérez-González, Michele Perna, Raffaella Schneider, Jan Scholtz, Sandro Tacchella 24 pages, 13 figures. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Recent photometric surveys with JWST have revealed a significant population of mysterious objects with red colours, compact morphologies, frequent signs of active galactic nucleus (AGN) activity, and negligible X-ray emission. These 'Little Red Dots' (LRDs) have been explored through spectral and photometric studies, but their nature is still under debate. As part of the BlackTHUNDER survey, we have observed UNCOVER_20466, one of the most distant LRDs known (z=8.5), with the JWST/NIRSpec IFU. Previous JWST/NIRCam and JWST/NIRSpec MSA observations of this source revealed its LRD nature, as well as the presence of an AGN. Using our NIRSpec IFU data, we confirm that UNCOVER_20466 is an LRD (based on spectral slopes and compactness) that contains an overmassive black hole. However, our observed Balmer decrements do not suggest strong dust attenuation, resulting in a lower Hbeta-based bolometric luminosity and Eddington luminosity (~10%) than previously found. This source lies on local relations between M_BH-sigma_* and M_BH-M_Dyn, suggesting that this could be a progenitor of the core of a lower-redshift galaxy. We explore the possible evolution of this source, finding evidence for substantial black hole accretion in the past and a likely origin as a heavy seed at high redshift (~10^3Msol). Lyman-alpha emission is strongly detected, implying f_esc,Lya~30%. The extremely high [OIII]4363/Hgamma ratio is indicative of not only AGN photoionization and heating, but also extremely high densities (ne~10^7cm-3), suggesting that this black hole at such high redshift may be forming in an ultra-dense protogalaxy.",
      "pdf_url": "https://arxiv.org/pdf/2509.20455.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22871",
      "title": "Probing the Star Formation Main Sequence down to 10$^{7} M_\\odot$ at $1 < z < 9$",
      "authors": [
        "Rosa M. Mérida",
        "Marcin Sawicki",
        "Kartheik G. Iyer",
        "Gaël Noirot",
        "Chris J. Willott",
        "Maruša Bradač",
        "Guillaume Desprez",
        "Nicholas S. Martis",
        "Adam Muzzin",
        "Gregor Rihtaršič",
        "Ghassan T. E. Sarrouh",
        "Jeremy Favaro",
        "Gaia Gaspar",
        "Anishya Harshan",
        "Jon Judež"
      ],
      "abstract": "Probing the Star Formation Main Sequence down to 10$^{7} M_\\odot$ at $1 < z < 9$ Rosa M. Mérida, Marcin Sawicki, Kartheik G. Iyer, Gaël Noirot, Chris J. Willott, Maruša Bradač, Guillaume Desprez, Nicholas S. Martis, Adam Muzzin, Gregor Rihtaršič, Ghassan T. E. Sarrouh, Jeremy Favaro, Gaia Gaspar, Anishya Harshan, Jon Judež 20 pages, 9 figures, 6 tables. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The Main Sequence of Star-Forming Galaxies (SFGMS or MS) is a fundamental scaling relation that provides a global framework for studying galaxy formation and evolution, as well as insight into the complex star formation histories (SFHs) of individual galaxies. In this work, we combine large-area pre-JWST surveys (COSMOS2020, CANDELS), which probe high-$M_\\star$ sources (${>10^9\\,M_\\odot}$), with SHARDS/CANDELS FAINT and JWST data from CANUCS, CEERS, JADES, and UNCOVER, to obtain a high-$z$, star formation rate (SFR) and stellar mass ($M_\\star$) complete sample spanning both high- and low-$M_\\star$ regimes. Completeness in both $M_\\star$ and SFR is key to avoiding biases introduced by low-mass, highly star-forming objects. Our combined data set is 80% complete down to $10^{7.6}\\,M_\\odot$ at $z\\sim1$ ($10^{8.8}\\,M_\\odot$ at $z\\sim9$). The overall intrinsic MS slope (based on the SFR$_{100}$ and $M_\\star$ derived with Dense Basis and nonparametric SFHs) shows little evolution up to $z\\sim5$, with values $\\sim0.7 - 0.8$. The slope in the low-$M_\\star$ regime becomes steeper than that in the high-$M_\\star$ end at least up to $z\\sim5$, but the strength of this change is highly dependent on the assumptions made on the symmetry of the uncertainties in $M_\\star$ and SFR. If real, the steepening suggests reduced star formation efficiency or declining gas content with decreasing $M_\\star$. The transition between the low-$M_\\star$ regime and the canonical MS occurs around $10^{9.5}\\,M_\\odot$, independent of $z$. This critical value may coincide with the assembly of galaxies' disks, which can provide a mechanism for self-regulation that stabilizes them against feedback. The intrinsic scatter is compatible with canonical estimates, also at low-$M_\\star$, ranging from $0.2-0.3$ dex. This is indicative of rapid variations in star formation being averaged out over $\\lesssim100$ Myr.",
      "pdf_url": "https://arxiv.org/pdf/2509.22871.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.22491",
      "title": "Classical Cepheids in the Galactic thin disk I. Abundance gradients via non-local thermodynamic equilibrium spectral analysis",
      "authors": [
        "Antonino Nunnari",
        "Valentina D'Orazi",
        "Giuliana Fiorentino",
        "Vittorio F. Braga",
        "Giuseppe Bono",
        "Michele Fabrizio",
        "Henrik Jönsson",
        "Rolf-Peter Kudritzki",
        "Ronaldo da Silva",
        "Maria Bergemann",
        "Eloisa Poggio",
        "Jonah M. Otto",
        "Karina Baeza-Villagra",
        "Angela Bragaglia",
        "Giulia Ceci",
        "Massimo Dall'Ora",
        "Laura Inno",
        "Carmela Lardo",
        "Noriyuki Matsunaga",
        "Matteo Monelli",
        "Manuel Sánchez-Benavente",
        "Chris Sneden",
        "Maria Tantalo",
        "Frédéric Thévénin",
        "Marcella Di Criscienzo",
        "Gamze Böcek Topcu"
      ],
      "abstract": "Classical Cepheids in the Galactic thin disk I. Abundance gradients via non-local thermodynamic equilibrium spectral analysis Antonino Nunnari, Valentina D'Orazi, Giuliana Fiorentino, Vittorio F. Braga, Giuseppe Bono, Michele Fabrizio, Henrik Jönsson, Rolf-Peter Kudritzki, Ronaldo da Silva, Maria Bergemann, Eloisa Poggio, Jonah M. Otto, Karina Baeza-Villagra, Angela Bragaglia, Giulia Ceci, Massimo Dall'Ora, Laura Inno, Carmela Lardo, Noriyuki Matsunaga, Matteo Monelli, Manuel Sánchez-Benavente, Chris Sneden, Maria Tantalo, Frédéric Thévénin, Marcella Di Criscienzo, Gamze Böcek Topcu Manuscript accepted by A&A. Abstract shortened Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Classical Cepheids (CCs) have long been considered excellent tracers of the chemical evolution of the Milky Way's young disk. We present a homogeneous, NLTE spectroscopic analysis of 401 Galactic CCs, based on 1,351 high-resolution optical spectra, spanning Galactocentric distances from 4.6 to 29.3 kpc. Using PySME with MARCS atmospheres and state-of-the-art grids of NLTE departure coefficients, we derive atmospheric parameters and abundances for key species tracing multiple nucleosynthetic channels. Our sample-the largest CC NLTE dataset to date-achieves high internal precision and enables robust modeling of present-day thin-disk abundance patterns and radial gradients. We estimate abundance gradients using three analytic prescriptions (linear, logarithmic, bilinear with a break) within a Bayesian, outlier-robust framework, and we also apply Gaussian Process Regression to capture non-parametric variations. We find that NLTE atmospheric parameters differ systematically from LTE determinations. Moreover, iron and most elemental abundance profiles are better described by non-linear behavior rather than by single-slope linear models: logarithmic fits generally outperform simple linear models, while bilinear fits yield inconsistent break radii across elements. Gaussian Process models reveal a consistent outer-disk flattening of [X/H] for nearly all studied elements. The [X/Fe] ratios are largely flat with Galactocentric radius, indicating coherent chemical scaling with iron across the thin disk, with modest positive offsets for Na and Al and mild declines for Mn and Cu. Comparison with recent literature shows overall agreement but highlights NLTE-driven differences, especially in outer-disk abundances. These results provide tighter empirical constraints for chemo-dynamical models of the Milky Way and set the stage for future NLTE mapping with upcoming large spectroscopic surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.22491.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.02724",
      "title": "A Tale of Two Dust Disks in Our Milky Way",
      "authors": [
        "Ruoyi Zhang",
        "Haibo Yuan",
        "Bingqiu Chen",
        "Maosheng Xiang",
        "Yang Huang",
        "Xiaowei Liu",
        "Jifeng Liu"
      ],
      "abstract": "A Tale of Two Dust Disks in Our Milky Way Ruoyi Zhang, Haibo Yuan, Bingqiu Chen, Maosheng Xiang, Yang Huang, Xiaowei Liu, Jifeng Liu 13 pages, 8 figures, accepted by ApJ Astrophysics of Galaxies (astro-ph.GA) Cosmic dust plays a vital role in stellar and galactic formation and evolution, but its three-dimensional structure in the Milky Way has remained unclear due to insufficient precise reddening and distance measurements. Although early studies typically adopted a single-disk model, we detect two distinct components at Galactocentric distances of 5-14 kpc, enabled by photometric, spectroscopic, and astrometric measurements of over 5 million stars. The thin dust disk's scale height increases radially from 60 to 200 pc, while the thick disk grows from 300 to 800 pc. For the first time, we find the thin and thick dust disk correlates spatially with molecular and atomic hydrogen disk, respectively. The thin, thick, and combined disks have scale lengths of 9.6+1.2-1.1 kpc, 4.2+0.4-0.3 kpc, and 6.6+0.3-0.3 kpc, respectively. The gas-to-dust ratio shows an exponential radial gradient, increasing from around 60 at 5 kpc to around 470 at 14 kpc. These findings provide new insights into dust morphology in the Galaxy and raise fundamental questions that require further investigation.",
      "pdf_url": "https://arxiv.org/pdf/2601.02724.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09804",
      "title": "Simulating the photospheric to coronal plasma using magnetohydrodynamic characteristics III: validation including gravity, flux emergence, and an eruption",
      "authors": [
        "Lucas A. Tarr",
        "N. Dylan Kee",
        "James E. Leake",
        "Mark G. Linton",
        "Peter W. Schuck"
      ],
      "abstract": "Simulating the photospheric to coronal plasma using magnetohydrodynamic characteristics III: validation including gravity, flux emergence, and an eruption Lucas A. Tarr, N. Dylan Kee, James E. Leake, Mark G. Linton, Peter W. Schuck 17 pages, 8 figures. Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) Solar eruptions arise from instabilities or loss of equilibria in the solar atmosphere, but routinely inferring the precise magnetic and plasma properties that lead to eruptions is not currently practical using synoptic solar observations. Data driven simulations offer an appealing alternative. We test our boundary data-driven magnetohydrodynamic (MHD) approach, based on the method of characteristics, on a simulation that includes full MHD, a stratified atmosphere, and the emergence of a model solar magnetic active region, from the photosphere upwards. The driven simulation is tested against a larger, ab initio ``Ground Truth'' simulation that extends downward into the convection zone. Our driven simulation accurately reproduces the dynamic emergence of the active region above the photosphere, the formation of key topological features throughout the corona, and the subsequent eruption of mass and magnetic field. The total emerged energy matches to better than one percent, the ratio of emerged to eruptive energy is $\\approx2\\%$, and the actual values of each energy term agree to within $10\\%$ between the two cases. Crucially, the data injection cadence, when properly scaled, matches the cadence of synoptic observations of the Sun's surface magnetic field, and is three to four orders of magnitude longer than the inherent CFL time step of the simulations. The stability of the code and fidelity of the results over an entire active region lifetime, from emergence to eruption, strongly suggests that our method will produce reliable results when driven using solar synoptic observations from existing and anticipated ground and spaced based observatories.",
      "pdf_url": "https://arxiv.org/pdf/2601.09804.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10188",
      "title": "A Highly Magnetic Ultra Massive White Dwarf with a 23-minute Rotation Period",
      "authors": [
        "Jincheng Guo",
        "Xiaofeng Wang",
        "Qichun Liu",
        "Alexei V. Filippenko",
        "Thomas G. Brink",
        "Jingkun Zhao",
        "WeiKang Zhang",
        "Yi Yang",
        "Jie Lin",
        "Haowei Peng",
        "Hailiang Chen",
        "Davron O. Mirzaqulov",
        "Shuhrat A. Ehgamberdiev",
        "Bin Ma",
        "Jun Mo",
        "Cheng Liu",
        "Gaobo Xi",
        "Xiaojun Jiang",
        "Danfeng Xiang",
        "Jicheng Zhang"
      ],
      "abstract": "A Highly Magnetic Ultra Massive White Dwarf with a 23-minute Rotation Period Jincheng Guo, Xiaofeng Wang, Qichun Liu, Alexei V. Filippenko, Thomas G. Brink, Jingkun Zhao, WeiKang Zhang, Yi Yang, Jie Lin, Haowei Peng, Hailiang Chen, Davron O. Mirzaqulov, Shuhrat A. Ehgamberdiev, Bin Ma, Jun Mo, Cheng Liu, Gaobo Xi, Xiaojun Jiang, Danfeng Xiang, Jicheng Zhang 11 pages, 7 figures, 1 table. Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR) We present a physical characterization of TMTS J00063798+3104160 (J0006), a rapidly rotating,ultra-massive white dwarf (WD) identified in high-cadence light curves from the Tsinghua University-Ma Huateng Telescope for Survey (TMTS). A coherent 23-minute periodicity is detected in TMTS, TESS, and ZTF photometry. A time series of low-resolution spectra with the Keck-I 10 m telescope reveals broad, shallow hydrogen absorption features indicative of an extreme magnetic field and shows no evidence for radial-velocity variations. Atmospheric modeling yields a magnetic field strength of $\\sim$ 250 MG, while Gaia astrometry and photometry imply a mass of 1.06 $\\pm$ 0.01 M$_{\\odot}$. A significant infrared excess is detected in the WISE W1 band and is well fitted by a 550 K blackbody, likely arising from residual material of a merger. We interpret the 23-minute photometric modulation as the rotation period of an isolated, massive WD formed likely through the merger of a double WD binary. With one of the shortest rotation periods known among candidate merger remnants and with constraints from a deep Einstein Probe X-ray nondetection, J0006 provides a rare and important observational window into the poorly explored intermediate stages of post-merger evolution.",
      "pdf_url": "https://arxiv.org/pdf/2601.10188.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10283",
      "title": "Cycle dependence of helioseismic oscillations above the acoustic cut-off frequency",
      "authors": [
        "Dmitrii Kolotkov",
        "Anne-Marie Broomhall",
        "Laura Jade Millson",
        "Sergey Belov"
      ],
      "abstract": "Cycle dependence of helioseismic oscillations above the acoustic cut-off frequency Dmitrii Kolotkov, Anne-Marie Broomhall, Laura Jade Millson, Sergey Belov Accepted for publication in MNRAS Solar and Stellar Astrophysics (astro-ph.SR) Helioseismic and recent asteroseismic observations reveal fine structure in the power spectrum with alternating peaks and troughs above the acoustic cut-off frequency. This structure is interpreted as the interference patterns of high-frequency acoustic waves excited in the solar interior and propagating into the atmosphere, known as pseudomodes. Pseudomodes exhibit clear solar-cycle variability, with frequency shifts that occur predominantly in anti-phase with the activity cycle, although the underlying mechanism remains uncertain. This work investigates how the subsurface excitation source location and the photospheric acoustic cut-off frequency influence the formation, frequency distribution, and solar-cycle variability of pseudomodes. We employ an analytical Klein-Gordon subsurface cavity model, which is shown to act as an effective Fabry-Pérot interferometer for high-frequency waves that experience constructive and destructive interference between the source location and the lower turning point. We derive an effective dispersion relation isolating the effects of the source location and photospheric cut-off on the pseudomode frequency. The model reproduces the observed peak-trough pseudomode spectrum for reasonable parameter values constrained by Bayesian MCMC best-fitting to GONG observations. We also find that solar-cycle-associated 11-year modulations of the source location result in anti-phase pseudomode frequency shifts, whereas similar cyclic variations in the cut-off frequency produce harmonic-dependent behaviour, yielding both in-phase and anti-phase shifts. As the acoustic cut-off and mode excitation relate to stratification and flows in the solar interior, the results highlight pseudomodes as a powerful diagnostic tool for changes in subsurface solar and stellar structure through the solar cycle.",
      "pdf_url": "https://arxiv.org/pdf/2601.10283.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10404",
      "title": "Spectroscopic follow-up of Gaia alerted Young Stellar Object variables: the Large Binocular Telescope view",
      "authors": [
        "Teresa Giannini",
        "Manuele Gangi",
        "Fernando Cruz-Saenz de Miera",
        "Brunella Nisini",
        "Mate Szilagyi",
        "Katia Biazzo",
        "Agnes Kospal",
        "Peter Abraham",
        "Simone Antoniucci",
        "Roberta Carini",
        "Eleonora Fiorellino",
        "Adriana Gargiulo",
        "Ester Marini",
        "Zsofia Nagy",
        "Maria Gabriela Navarro",
        "Fabrizio Vitali"
      ],
      "abstract": "Spectroscopic follow-up of Gaia alerted Young Stellar Object variables: the Large Binocular Telescope view Teresa Giannini, Manuele Gangi, Fernando Cruz-Saenz de Miera, Brunella Nisini, Mate Szilagyi, Katia Biazzo, Agnes Kospal, Peter Abraham, Simone Antoniucci, Roberta Carini, Eleonora Fiorellino, Adriana Gargiulo, Ester Marini, Zsofia Nagy, Maria Gabriela Navarro, Fabrizio Vitali Solar and Stellar Astrophysics (astro-ph.SR) We analyzed optical/near-IR Large Binocular Telescope spectra of 16 sources alerted by Gaia between 2021 and 2024 due to significant photometric variability. Half of the spectra were taken during quiescence and the rest during a burst or at intermediate brightness. Our analysis of their ten-year light curves and photometric/spectroscopic features provide evidence that all 16 sources are accreting Young Stellar Objects (YSOs). One object, Gaia23bab, is a known EXor source. Other light curves either have peaks over a stable baseline, or significant variability throughout the entire observation period, suggesting multiple contributing processes. All spectra exhibit emission lines from accretion columns, and over half of them show atomic forbidden lines as signatures of outflowing gas. We determined stellar parameters, accretion luminosity (Lacc) and mass accretion rate (Macc) at different brightness phases. Only two sources showed variability primarily due to extinction. During quiescence, our sources exhibit Lacc and Macc values typical of T Tauri and Herbig Ae/Be (HAEBE) sources, supporting the hypothesis that any YSO may undergo episodic accretion. In bursts, the Lacc and Macc of sources with photometric variations exceeding 2 mag follow a shallower relation with stellar luminosity and mass, typical of known EXor sources. This group includes one Class I, one flat-spectrum, and two Class II sources. Notably, the other Class I source, Gaia24beh, shows an Lacc value about ten times higher than typical EXor bursts of the same mass. In the other cases, Lacc and Macc align with variability seen in T Tauri and HAEBE sources.",
      "pdf_url": "https://arxiv.org/pdf/2601.10404.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10528",
      "title": "Shock Signatures of the Successive Type-II Solar Radio Bursts at Meter Wavelength",
      "authors": [
        "V. Vasanth"
      ],
      "abstract": "Shock Signatures of the Successive Type-II Solar Radio Bursts at Meter Wavelength V. Vasanth Accepted for publication in Solar Physics Solar and Stellar Astrophysics (astro-ph.SR) The successive type-II solar radio bursts observed on 31 July 2012 by the Bruny Island Radio Spectrometer (BIRS) in the frequency range between 62 - 6 MHz is reported and analyzed. The first type-II radio burst shows clear fundamental and harmonic band structures, while only one band is observed for the second type-II radio burst and is considered as the harmonic band. The first type-II radio burst is observed in the frequency range of 57 - 27 MHz between 00:03 - 00:09 UT at the harmonic band. The second type-II burst is observed between 00:18 - 00:27 UT in the frequency range of 43 - 17 MHz. The type-II radio bursts are associated with a C6 class flare located at the south-eastern limb (S24E87) and a CME observed from STEREO and LASCO observations. The EUVI signatures of the CME is observed in the ST-B EUVI FOV between 23:56 (on 30 July 2012) to 00:06 UT (on 31 July 2012), and are observed in the ST-B COR1 FOV between 00:10 - 00:35 UT moving within an average speed of 725 + or - 101 km/s. The CME is observed in the LASCO C2 FOV after 00:12 UT as a partial halo CME moving with an average speed of 486 km/s. The height-time plot shows that the first type-II radio burst was formed by the CME-shock along the shock front and the second type-II radio burst along the shock-dip structure, probably the dip structure results from the shock transiting across the high dense streamer structure. The successive type-II bursts are most likely produced by the single CME shock and their interactions with the streamer structures. The first type-II radio burst by the CME shock and the second type-II radio burst by the CME shock-streamer interactions.",
      "pdf_url": "https://arxiv.org/pdf/2601.10528.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10579",
      "title": "HST Observations of HD 166620 and Tau Ceti: First UV Spectra of a Magnetic Grand Minimum Star and the Extent of Tau Ceti's Astrosphere",
      "authors": [
        "Brian E. Wood",
        "Hans-Reinhard Mueller",
        "Dean Hartshorn",
        "Seth Redfield",
        "Travis S. Metcalfe"
      ],
      "abstract": "HST Observations of HD 166620 and Tau Ceti: First UV Spectra of a Magnetic Grand Minimum Star and the Extent of Tau Ceti's Astrosphere Brian E. Wood, Hans-Reinhard Mueller, Dean Hartshorn, Seth Redfield, Travis S. Metcalfe 26 pages, 9 figures, to appear in The Astrophysical Journal Solar and Stellar Astrophysics (astro-ph.SR) We present new Hubble Space Telescope (HST) UV spectra of the K2 V star HD 166620, the first star clearly recognized to be in a \"magnetic grand minimum\" state analogous to the Sun's \"Maunder Minimum\" in the late 1600's. The stellar H I Lyman-alpha surface fluxes are extremely low, about a factor of two below fluxes observed during solar minimum, and also significantly lower than those of Tau Ceti (G8 V) and HD 191408 (K2.5 V), two stars more similar to HD 166620 in spectral type and age (~10 Gyr) than the Sun. The Tau Ceti data that are compared with HD 166620 include both old archival data and a new HST observation as well. The Lyman alpha data are used to confirm a nondetection of astrospheric Lyman-alpha absorption for this star, suggesting a very weak wind with Mdot<0.1 Mdot_sun. The very compact astrosphere inferred for Tau Ceti indicates that the star's debris disk is at least partly exposed to the ISM, and we discuss possible consequences.",
      "pdf_url": "https://arxiv.org/pdf/2601.10579.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10635",
      "title": "WEAVE imaging spectroscopy of NGC 6720: an iron bar in the Ring",
      "authors": [
        "R. Wesson",
        "J. E. Drew",
        "M. J. Barlow",
        "J. García-Rojas",
        "R. Greimel",
        "D. Jones",
        "A. Manchado",
        "R. A. H. Morris",
        "A. Zijlstra",
        "P. J. Storey",
        "J. A. L. Aguerri",
        "S. R. Berlanas",
        "E. Carrasco",
        "G. B. Dalton",
        "E. Gafton",
        "R. García-Benito",
        "A. L. González-Morán",
        "B. Gänsicke",
        "S. Hughes",
        "S. Jin",
        "R. Raddi",
        "R. Sanchez-Janssen",
        "E. Schallig",
        "D. J. B. Smith",
        "S. C. Trager",
        "N. A. Walton"
      ],
      "abstract": "WEAVE imaging spectroscopy of NGC 6720: an iron bar in the Ring R. Wesson, J. E. Drew, M. J. Barlow, J. García-Rojas, R. Greimel, D. Jones, A. Manchado, R. A. H. Morris, A. Zijlstra, P. J. Storey, J. A. L. Aguerri, S. R. Berlanas, E. Carrasco, G. B. Dalton, E. Gafton, R. García-Benito, A. L. González-Morán, B. Gänsicke, S. Hughes, S. Jin, R. Raddi, R. Sanchez-Janssen, E. Schallig, D. J. B. Smith, S. C. Trager, N. A. Walton 8 pages, 6 figures. Published in MNRAS Solar and Stellar Astrophysics (astro-ph.SR) We present spatially resolved spectroscopic observations of the planetary nebula NGC 6720, the Ring Nebula, taken during the science verification phase of WEAVE, a new instrument mounted on the William Herschel Telescope on La Palma. We use the instrument's Large Integral Field Unit (LIFU) to obtain spectra of the Ring Nebula, covering its entire optically bright inner regions as well as parts of its much fainter outer molecular halo. We report the discovery of emission from [Fe~{\\sc v}] and [Fe~{\\sc vi}] confined to a narrow ``bar'' extending across the central regions of the nebula. No lines of other elements share this morphology or, at the spectral resolving power used ($R \\sim 2500$), the same radial velocity. The extent to which iron in this bar is depleted is presently unclear; comparison with JWST-detected dust continuum emission suggests that some dust grain destruction may be occurring in the region, but there is currently no observational evidence for the $>$ 50~km\\,s$^{-1}$ shock waves or $T > 10^6$~K X-ray emitting gas needed to enable this. Where the bar is located along the line of sight through the nebula, and how it was created, are new puzzles to be solved for this iconic planetary nebula.",
      "pdf_url": "https://arxiv.org/pdf/2601.10635.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10637",
      "title": "Measuring the Coronal Magnetic Field with 2D Coronal Seismology: A Forward-Modeling Validation",
      "authors": [
        "Zihao Yang",
        "Sarah Gibson",
        "Matthias Rempel",
        "Giuliana de Toma"
      ],
      "abstract": "Measuring the Coronal Magnetic Field with 2D Coronal Seismology: A Forward-Modeling Validation Zihao Yang, Sarah Gibson, Matthias Rempel, Giuliana de Toma 17 pages, 10 figures, accepted for publication in ApJS Solar and Stellar Astrophysics (astro-ph.SR) In recent years, a two-dimensional (2D) coronal seismology technique applied to spectral-imaging data from the Coronal Multi-channel Polarimeter (CoMP) and UCoMP has enabled routine measurement of the global coronal magnetic field. The technique combines coronal transverse wave phase speed from Doppler measurements with electron densities from the Fe \\sc{xiii}\\rm{} 10798/10747 Å intensity ratio to infer the magnetic field strength, while the wave propagation directions from Doppler measurements trace the magnetic field direction. To validate the accuracy and robustness of this method, we use forward modeling of a MURaM simulation that produces open and closed magnetic structures with excited waves. From the synthetic Doppler velocity, Fe \\sc{xiii}\\rm{} infrared line intensities, and linear polarization signals, we apply the 2D coronal seismology technique to estimate the magnetic field strength and direction. A comparison with the simulation ground truth shows close agreement, indicating that the technique can recover the line-of-sight emissivity-weighted magnetic field direction and strength with high accuracy. We also perform a parameter-space analysis to quantify sensitivities of the method to parameter choice. These findings provide practical guidance for CoMP/UCoMP-like analysis and demonstrate that 2D coronal seismology can deliver reliable, LOS emissivity-weighted measurements of the coronal magnetic field from coronal wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2601.10637.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10675",
      "title": "MHD modelling of open flux evolution around solar maximum by coronal model COCONUT",
      "authors": [
        "Haopeng Wang",
        "Stefaan Poedts",
        "Andrea Lani",
        "Luis Linan",
        "Tinatin Baratashvili",
        "Hyun-Jin Jeong",
        "Rayan Dhib",
        "Quentin Noraz",
        "Wenwen Wei",
        "Mahdi Najafi-Ziyazi",
        "Junyan Liu",
        "Hao Wu",
        "Rui Zhuo",
        "José Miguel Luzia Murteira",
        "Ketevan Arabuli",
        "Brigitte Schmieder",
        "Jasmina Magdalenić Zhukov"
      ],
      "abstract": "MHD modelling of open flux evolution around solar maximum by coronal model COCONUT Haopeng Wang, Stefaan Poedts, Andrea Lani, Luis Linan, Tinatin Baratashvili, Hyun-Jin Jeong, Rayan Dhib, Quentin Noraz, Wenwen Wei, Mahdi Najafi-Ziyazi, Junyan Liu, Hao Wu, Rui Zhuo, José Miguel Luzia Murteira, Ketevan Arabuli, Brigitte Schmieder, Jasmina Magdalenić Zhukov Solar and Stellar Astrophysics (astro-ph.SR) To evaluate impact of temporal evolution and commonly used harmonic filtering of magnetograms, and the empirically defined oversimplified heating source terms on open-field distributions, we use a series of hourly-updated magnetograms, preprocessed by the 10th- and 50th-order filtered PF solvers, to drive COCONUT, configured with different heating prescriptions, to mimic coronal evolutions during CRs 2282 and 2283. We evaluate the simulated open magnetic flux at 1.01~$R_s$, 3~$R_s$, and 0.1~AU, and compare them with interplanetary observations. The results show that the simulated unsigned open flux evaluated near the solar surface can be comparable to that derived from interplanetary in situ observations. However, in low corona, numerous small-scale closed-field magnetic structures introduce magnetic polarity inversion interfaces within the open field, cancelling part of the open field near these interfaces during the volume-integration procedure of the finite-volume method. Consequently, the simulated unsigned open flux can be reduced by up to 45% at 0.1~AU and decreases more rapidly in the low corona. The results also indicate that moderate adjustments to the heating source term can effectively regulate the magnitude of the unsigned open magnetic flux. Preprocessing the initial magnetogram by a PF solver with limited spherical harmonics can reduce the open flux in the low corona and alter the distribution of open-field regions, but has little effect on the total unsigned open flux at larger heliocentric distances. The ratio of the maximum to minimum open unsigned magnetic flux can reach 1.4 within a single solar maximum CR. These findings highlight the necessity of considering finer grid resolution around magnetic polarity inversion interfaces, more realistic heating mechanisms, and the time-evolving regime of MHD coronal modelling when further addressing the ``open flux problem\".",
      "pdf_url": "https://arxiv.org/pdf/2601.10675.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10439",
      "title": "ASTRA: A Python Package for Cross-Instrument Stellar and Telluric Template Construction",
      "authors": [
        "André M. Silva",
        "J. P. Faria",
        "N. C. Santos",
        "S. G. Sousa",
        "P. T. P. Viana",
        "J. H. C. Martins"
      ],
      "abstract": "ASTRA: A Python Package for Cross-Instrument Stellar and Telluric Template Construction André M. Silva, J. P. Faria, N. C. Santos, S. G. Sousa, P. T. P. Viana, J. H. C. Martins 4 pages, published in the Journal of Open Source Software; all code available at this https URL Journal of Open Source Software, 11(117), 9413, 2026 Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) ASTRA is a Python package that provides a modular, instrument-independent interface for working with high-resolution stellar spectra. Designed to support data from multiple spectrographs, including ESPRESSO (Pepe et al., 2021), HARPS (Mayor et al., 2003; Pepe et al., 2002), MAROON-X (Seifahrt et al., 2022), and CARMENES (Quirrenbach et al., 2014). ASTRA offers a unified abstraction over their data formats, enabling consistent access to fluxes, wavelengths, uncertainties, and metadata across instruments. Furthermore, it applies the necessary wavelength and flux calibrations that are needed, as described by the official pipelines of each instrument.",
      "pdf_url": "https://arxiv.org/pdf/2601.10439.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10631",
      "title": "Circumplanetary Disk Candidate in the Disk of HD 163296 Traced by Localized Emission from Simple Organics",
      "authors": [
        "Andres F. Izquierdo",
        "Jaehan Bae",
        "Maria Galloway-Sprietsma",
        "Ewine F. van Dishoeck",
        "Stefano Facchini",
        "Giovanni Rosotti",
        "Jochen Stadler",
        "Myriam Benisty",
        "Leonardo Testi"
      ],
      "abstract": "Circumplanetary Disk Candidate in the Disk of HD 163296 Traced by Localized Emission from Simple Organics Andres F. Izquierdo, Jaehan Bae, Maria Galloway-Sprietsma, Ewine F. van Dishoeck, Stefano Facchini, Giovanni Rosotti, Jochen Stadler, Myriam Benisty, Leonardo Testi 18 pages, 11 figures, 2 tables. Accepted for publication in ApJL Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Atacama Large Millimeter/submillimeter Array observations suggest that the disc of HD 163296 is being actively shaped by embedded, yet unseen protoplanets, as indicated by numerous gas and dust substructures consistent with planet-disc interaction models. We report the first detection of simple organic molecules, HCN and C2H, tracing a candidate circumplanetary disc (CPD) in the HD 163296 system, located at an orbital radius of $R=88\\pm7$ au and azimuth $\\phi=46\\pm3^\\circ$ (or $R=0.75''$, $\\rm{PA}=350^\\circ$ in projected sky coordinates), and originating near the midplane of the circumstellar disc. The signature is localised but spectrally resolved, and it overlaps with a previously reported planet candidate, P94, identified through kinematic perturbations traced by CO lines. We propose a scenario in which the observed chemical anomalies arise from increased heating driven by the forming planet and ongoing accretion through its CPD, facilitating the thermal desorption of species that would otherwise remain frozen out in the disc midplane, and potentially triggering the activation barriers of chemical reactions that lead to enhanced molecular production. Based on a first-order dynamical analysis of the HCN spectrum from the CPD--isolated with a 7$\\sigma$ significance--we infer an upper limit on the planet mass of 1.8 $M_{\\rm Jup}$, consistent with predictions from CO kinematics and constraints from direct imaging studies. By comparing the CPD sizes derived from our models with theoretical expectations where the CPD radius corresponds to roughly one-third of the planet's Hill radius, we favor CPD gas temperatures $T > 150$ K, planet masses $M_{\\rm p} < 1.0$ $M_{\\rm Jup}$, and CPD radii $R_{\\rm CPD} < 2$ au.",
      "pdf_url": "https://arxiv.org/pdf/2601.10631.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.14331",
      "title": "On the center-to-limb variations of the He I 10 830 Å triplet",
      "authors": [
        "A.G.M. Pietrow",
        "C. Kuckein",
        "M. Verma",
        "C. Denker",
        "J.C. Trelles Arjona",
        "R. Kamlah",
        "K. Poppenhäger"
      ],
      "abstract": "On the center-to-limb variations of the He I 10 830 Å triplet A.G.M. Pietrow, C. Kuckein, M. Verma, C. Denker, J.C. Trelles Arjona, R. Kamlah, K. Poppenhäger Published in A&A. 6 pages, 6 figures. CLV data is released on the CDS Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) We present high-resolution spectroscopic observations of the quiet-Sun center-to-limb variations (CLV) of the He I triplet at 10 830 Å and the nearby Si I 10 827 Å line, observed with GREGOR Infrared Spectrograph (GRIS) and the improved High-resolution Fast Imager (HiFI+). The observations cover the interval $\\mu = [0.1,\\, 1.0]$, where $\\mu$ is the cosine of the heliocentric angle. At each $\\mu$-position, the spectra are spatially averaged over 0.02 $\\mu$, and the resulting CLVs are given both as these averaged data points and as smooth polynomial curves fitted across each wavelength point. The He I spectra were inverted using the HAnle and ZEeman Light (HAZEL) code, showing an increase in optical depth towards the limb and a reversed convective blueshift for the red component, while the blue component was entirely absent. In addition, we find a strong increase in the steepness of the He I CLV compared to that of the nearby continuum. The Si I showed a behavior more typical of photospheric lines, namely shallower CLV, a reduction in width and depth, and a more typical convective blueshift.",
      "pdf_url": "https://arxiv.org/pdf/2511.14331.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07925",
      "title": "An eclipsing 8.56 minute orbital period mass-transferring binary",
      "authors": [
        "Emma T. Chickles , Joheen Chakraborty , Kevin B. Burdge , Vik S. Dhillon , Paul Draghis , Kareem El-Badry , Matthew J. Green , Aaron Householder , Sarah Hughes , Christopher Layden , Stuart P. Littlefair , James Munday , Ingrid Pelisoli , Maya S. Redden , John Tonry , Jan van Roestel , F. Elio Angile , Alex J. Brown , Noel Castro , Jack Dinsmore , Martin Dyer , Gabor Furesz , Michelle Gabutti , James Garbutt , Daniel Jarvis , Mark R. Kennedy , Paul Kerry , James McCormac , Geoffrey Mo , Dave Osip , Steven Parsons , Eleanor Pike , Jack Piotrowski , Roger W. Romani , David Sahman , Rob Simcoe Massachusetts Institute of Technology, Cambridge, USA, University of Sheffield, Sheffield, UK, Instituto de Astrofisica de Canarias, La Laguna, Spain, California Institute of Technology, Pasadena, USA, Max Planck Institute for Astronomy, Heidelberg, Germany, University of Warwick, Coventry, UK, Stanford University, Stanford, USA, University of Hawaii, Honolulu, USA, Institute of Science and Technology Austria, Klosterneuburg, Austria, University of Amsterdam, Amsterdam, The Netherlands, University of Hamburg, Hamburg, Germany, Research Software Engineering, University of Sheffield, Sheffield, UK, University College Cork, Cork, Ireland, Carnegie Observatories, Pasadena, USA, Las Campanas Observatory, La Serena, Chile)"
      ],
      "abstract": "An eclipsing 8.56 minute orbital period mass-transferring binary Emma T. Chickles (1), Joheen Chakraborty (1), Kevin B. Burdge (1), Vik S. Dhillon (2 and 3), Paul Draghis (1), Kareem El-Badry (4), Matthew J. Green (5), Aaron Householder (1), Sarah Hughes (1), Christopher Layden (1), Stuart P. Littlefair (2), James Munday (6), Ingrid Pelisoli (6), Maya S. Redden (7), John Tonry (8), Jan van Roestel (9 and 10), F. Elio Angile (1), Alex J. Brown (11), Noel Castro (6), Jack Dinsmore (7), Martin Dyer (2 and 12), Gabor Furesz (1), Michelle Gabutti (1), James Garbutt (2), Daniel Jarvis (2), Mark R. Kennedy (13), Paul Kerry (2), James McCormac (6), Geoffrey Mo (4 and 14), Dave Osip (15), Steven Parsons (2), Eleanor Pike (2), Jack Piotrowski (14), Roger W. Romani (7), David Sahman (2), Rob Simcoe (1) ((1) Massachusetts Institute of Technology, Cambridge, USA, (2) University of Sheffield, Sheffield, UK, (3) Instituto de Astrofisica de Canarias, La Laguna, Spain, (4) California Institute of Technology, Pasadena, USA, (5) Max Planck Institute for Astronomy, Heidelberg, Germany, (6) University of Warwick, Coventry, UK, (7) Stanford University, Stanford, USA, (8) University of Hawaii, Honolulu, USA, (9) Institute of Science and Technology Austria, Klosterneuburg, Austria, (10) University of Amsterdam, Amsterdam, The Netherlands, (11) University of Hamburg, Hamburg, Germany, (12) Research Software Engineering, University of Sheffield, Sheffield, UK, (13) University College Cork, Cork, Ireland, (14) Carnegie Observatories, Pasadena, USA, (15) Las Campanas Observatory, La Serena, Chile) Solar and Stellar Astrophysics (astro-ph.SR) We report the discovery of ATLAS J101342.5-451646.8 (hereafter ATLAS J1013-4516), an eclipsing, mass-transferring AM Canum Venaticorum binary with an 8.56-minute orbital period, identified via periodic variability in light curves from the Asteroid Terrestrial-impact Last Alert System survey of Gaia white dwarf candidates. Follow-up spectroscopy with the Large Lenslet Array Magellan Spectrograph reveals a helium-dominated accretion disk, while high-speed photometry with ULTRACAM shows pronounced primary and secondary eclipses. We construct a decade-long timing baseline using data from ATLAS, Gaia, ULTRACAM on the New Technology Telescope, and the proto-Lightspeed instrument on the Magellan Clay telescope. From this baseline, we measure an orbital period derivative of dP/dt = -1.60 +/- 0.07 x 10^-12 seconds per second. Interpreted in the context of stable mass transfer, the magnitude and sign of the period derivative indicate that the orbital evolution is governed by the interplay between gravitational-wave-driven angular momentum losses and mass transfer, directly probing the donor star's structural response to mass loss. Assuming angular momentum loss dominated by gravitational wave emission, we constrain the component masses and infer the characteristic gravitational wave strain of the system for future space-based observatories such as the Laser Interferometer Space Antenna. We predict a characteristic strain corresponding to a four-year signal-to-noise ratio greater than approximately 20, establishing ATLAS J1013-4516 as a strong prospective source for probing long-term orbital evolution in the mass-transferring regime.",
      "pdf_url": "https://arxiv.org/pdf/2601.07925.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2501.14054",
      "title": "Probing the Limits of Habitability: A Catalog of Rocky Exoplanets in the Habitable Zone",
      "authors": [
        "Abigail Bohl",
        "Lucas Lawrence",
        "Gillis Lowry",
        "Lisa Kaltenegger"
      ],
      "abstract": "Probing the Limits of Habitability: A Catalog of Rocky Exoplanets in the Habitable Zone Abigail Bohl, Lucas Lawrence, Gillis Lowry, Lisa Kaltenegger 12 pages, 5 figures, accepted to MNRAS, shared first authorship between A. Bohl, L. Lawrence, and G. Lowry, data available at this https URL Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) While most of the 6000 discovered exoplanets are highly unlike the Earth, the first rocky worlds in the Habitable Zone (HZ) provide intriguing targets for the search for life in the cosmos. As detections increase, it is critical to test the empirical HZ as well as its limits using known exoplanets. However, there is not yet a list of rocky worlds that observers can use to test the limits of surface habitability. We analysed data from Gaia DR3 and the NASA Exoplanet Archive (NEA) of all known exoplanets, identifying future targets to test limits of habitability through i) orbits near the edges of the HZ, ii) similar irradiation environments to modern Earth, and iii) large eccentricities. We prioritize targets for transmission observations, light curve measurements, and direct imaging, identify the oldest HZ rocky worlds based on the NEA and complementary literature data, and provide theoretical limits for the empirical HZ and a 3D-HZ for each system. Our analysis shows 45 rocky worlds in the empirical HZ and 24 in a narrower 3D-HZ. For context, we compare their demographics to those of the full catalog of exoplanets in the NEA. The resulting list of rocky exoplanet targets in the HZ will allow observers to shape and optimize search strategies with space- and ground-based telescopes -- such as the James Webb Space Telescope (JWST), Extremely Large Telescope (ELT), Habitable Worlds Observatory (HWO), and LIFE -- and design new observing strategies and instruments to explore these worlds, addressing the question of the limits of exoplanet surface habitability.",
      "pdf_url": "https://arxiv.org/pdf/2501.14054.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.11490",
      "title": "The GAPS programme at TNG LXXI. A sub-Neptune suitable for atmospheric characterization in a multiplanet and mutually inclined system orbiting the bright K dwarf TOI-5789 (HIP 99452)",
      "authors": [
        "A. S. Bonomo",
        "L. Naponiello",
        "A. Sozzetti",
        "S. Benatti",
        "I. Carleo",
        "K. Biazzo",
        "P. E. Cubillos",
        "M. Damasso",
        "C. Di Maio",
        "C. Dorn",
        "N. Hara",
        "D. Polychroni",
        "M.-L. Steinmeyer",
        "K. A. Collins",
        "S. Desidera",
        "X. Dumusque",
        "A. F. Lanza",
        "B. S. Safonov",
        "C. Stockdale",
        "D. Turrini",
        "C. Ziegler",
        "L. Affer",
        "M. D'Arpa",
        "V. Fardella",
        "A. Harutyunyan",
        "V. Lorenzi",
        "L. Malavolta",
        "L. Mancini",
        "G. Mantovan",
        "G. Micela",
        "F. Murgas",
        "D. Nardiello",
        "I. Pagano",
        "E. Pallé",
        "M. Pedani",
        "M. Pinamonti",
        "M. Rainer",
        "G. Scandariato",
        "R. Spinelli",
        "T. Zingales"
      ],
      "abstract": "The GAPS programme at TNG LXXI. A sub-Neptune suitable for atmospheric characterization in a multiplanet and mutually inclined system orbiting the bright K dwarf TOI-5789 (HIP 99452) A. S. Bonomo, L. Naponiello, A. Sozzetti, S. Benatti, I. Carleo, K. Biazzo, P. E. Cubillos, M. Damasso, C. Di Maio, C. Dorn, N. Hara, D. Polychroni, M.-L. Steinmeyer, K. A. Collins, S. Desidera, X. Dumusque, A. F. Lanza, B. S. Safonov, C. Stockdale, D. Turrini, C. Ziegler, L. Affer, M. D'Arpa, V. Fardella, A. Harutyunyan, V. Lorenzi, L. Malavolta, L. Mancini, G. Mantovan, G. Micela, F. Murgas, D. Nardiello, I. Pagano, E. Pallé, M. Pedani, M. Pinamonti, M. Rainer, G. Scandariato, R. Spinelli, T. Zingales 13 pages, 10 figures, accepted for publication on Astronomy and Astrophysics Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Sub-Neptunes with planetary radii of $R_{p} \\simeq 2-4 R_{\\oplus}$ are the most common planets around solar-type stars in short-period ($P<100$ d) orbits. It is still unclear, however, what their most likely composition is, that is whether they are predominantly gas dwarfs or water worlds. The sub-Neptunes orbiting bright host stars are very valuable because they are suitable for atmospheric characterization, which can break the well-known degeneracy in planet composition from the planet bulk density, when combined with a precise and accurate mass measurement. Here we report on the characterization of the sub-Neptune TOI-5789 c, which transits in front of the bright ($V=7.3$ mag and $K_{s}=5.35$ mag) and magnetically inactive K1V dwarf HIP 99452 every 12.93 days, thanks to TESS photometry and 141 high-precision radial velocities obtained with the HARPS-N spectrograph. We find that its radius, mass, and bulk density are $R_{c}=2.86^{+0.18}_{-0.15} R_\\oplus$, $M_{c}=5.00 \\pm 0.50 M_\\oplus$, and $\\rho_{c}=1.16 \\pm 0.23$ g cm$^{-3}$, and we show that TOI-5789 c is a promising target for atmospheric characterization with both JWST and, in the future, Ariel. By analyzing the HARPS-N radial velocities with different tools, we also detect three additional non-transiting planets, namely TOI-5789 b, d, and e, with orbital periods and minimum masses of $P_{b}=2.76$ d, $M_{b}\\sin{i}=2.12 \\pm 0.28 M_\\oplus$, $P_{d}=29.6$ d, $M_{d}\\sin{i}=4.29 \\pm 0.68 M_\\oplus$, and $P_{e}=63.0$ d, $M_{e}\\sin{i}=11.61 \\pm 0.97 M_\\oplus$. TOI-5789 is a mutually inclined system as the difference between the orbital inclinations of planets b and c must be higher than $\\sim4$ deg. Nevertheless, from sensitivity studies based on both the HARPS-N and archival HIRES radial-velocity measurements, we can exclude that these relatively high mutual inclinations are due to the perturbation by an outer gaseous giant planet.",
      "pdf_url": "https://arxiv.org/pdf/2510.11490.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.18205",
      "title": "Red noise-based false alarm thresholds for astrophysical periodograms via Whittle's approximation to the likelihood",
      "authors": [
        "Amna Ejaz",
        "Sarah Dodson-Robinson",
        "Charlotte Haley"
      ],
      "abstract": "Red noise-based false alarm thresholds for astrophysical periodograms via Whittle's approximation to the likelihood Amna Ejaz, Sarah Dodson-Robinson, Charlotte Haley Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) Astronomers who search for periodic signals using Lomb-Scargle periodograms rely on false alarm level (FAL) estimates to identify statistically significant peaks. Although FALs are often calculated from white noise models, many astronomical time series suffer from red noise. Prewhitening is a statistical technique in which a continuum model is subtracted from log power spectrum estimate, after which the observer can proceed with a white-noise treatment. Here we present a prewhitening-based method of calculating frequency-dependent FALs. We fit power laws and autoregressive models of order 1 to each Lomb-Scargle periodogram by minimizing the Whittle approximation to the negative log-likelihood (NLL), then calculate FALs based on the best-fit model power spectrum. Our technique is a novel extension of the Whittle NLL to datasets with uneven time sampling. We demonstrate FAL calculations using observations of $\\alpha$~Cen~B, GJ~581, HD 192310, synthetic data from the radial velocity (RV) Fitting Challenge, and {\\it Kepler} observations of a differential rotator. The {\\it Kepler} data analysis shows that only true rotation signals are detected by red-noise FALs, while white-noise FALs suggest all spurious peaks in the low-frequency range are significant. A high-frequency sinusoid injected into $\\alpha$~Cen~B $\\log R^{\\prime}_{HK}$ observations exceeds the 1\\% red-noise FAL despite having only 8.9\\% of the power of the dominant rotation signal. In a periodogram of HD 192310 RVs, peaks associated with differential rotation and planets are detected against the 5\\% red-noise FAL without iterative model fitting or subtraction. Software for calculating red noise-based FALs is available on GitHub.",
      "pdf_url": "https://arxiv.org/pdf/2512.18205.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09766",
      "title": "Habitable Worlds Observatory (HWO): Living Worlds Community Working Group: The Search for Life on Potentially Habitable Exoplanets",
      "authors": [
        "Giada Arney",
        "Niki Parenteau",
        "Natalie Hinkel",
        "Eric Mamajek",
        "Joshua Krissansen-Totton",
        "Stephanie Olson",
        "Edward Schwieterman",
        "Sara Walker",
        "Kevin Fogarty",
        "Ravi Kopparapu",
        "Jacob Lustig-Yaeger",
        "Mark Moussa",
        "Sukrit Ranjan",
        "Garima Singh",
        "Clara Sousa-Silva",
        "Ruslan Belikov",
        "Maxwell Frissell",
        "Samantha Gilbert-Janziek",
        "Vincent Kofman",
        "Natasha Latouf",
        "Mary Anne Limbach",
        "Rhonda Morgan",
        "Christopher Stark",
        "Armen Tokadjian",
        "Anna Grace Ulses",
        "Nicholas Wogan",
        "Mike Wong",
        "Amber Young"
      ],
      "abstract": "Habitable Worlds Observatory (HWO): Living Worlds Community Working Group: The Search for Life on Potentially Habitable Exoplanets Giada Arney, Niki Parenteau, Natalie Hinkel, Eric Mamajek, Joshua Krissansen-Totton, Stephanie Olson, Edward Schwieterman, Sara Walker, Kevin Fogarty, Ravi Kopparapu, Jacob Lustig-Yaeger, Mark Moussa, Sukrit Ranjan, Garima Singh, Clara Sousa-Silva, Ruslan Belikov, Maxwell Frissell, Samantha Gilbert-Janziek, Vincent Kofman, Natasha Latouf, Mary Anne Limbach, Rhonda Morgan, Christopher Stark, Armen Tokadjian, Anna Grace Ulses, Nicholas Wogan, Mike Wong, Amber Young Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) The discovery of a biosphere on another planet would transform how we view ourselves, and our planet Earth, in relation to the rest of the cosmos. We now know Earth is one planet among eight circling our sun; our sun is part of a swirling galaxy of over one hundred billion other suns; and our galaxy is one of untold billions in the universe. While we do not yet know how many, if any, other biospheres exist on the countless worlds orbiting countless other suns, we stand at the precipice of a new era of discovery, enabled by powerful new facilities able to peer across the light years into the atmospheres of planets similar to our own. This article is an adaptation of a science case document (SCDD) developed for the NASA Astrophysics Flagship mission the Habitable Worlds Observatory (HWO) Science, Technology, and Architecture Review Team (START) Living Worlds Community Working Group.",
      "pdf_url": "https://arxiv.org/pdf/2601.09766.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10038",
      "title": "What Understanding Means in AI-Laden Astronomy",
      "authors": [
        "Yuan-Sen Ting",
        "André Curtis-Trudel",
        "Siyu Yao"
      ],
      "abstract": "What Understanding Means in AI-Laden Astronomy Yuan-Sen Ting, André Curtis-Trudel, Siyu Yao Perspective article, 8 pages. Based on the \"Philosophy Sees the Algorithm\" workshop held December 11-12, 2025 at The Ohio State University. Supported by the Alfred P. Sloan Foundation, the Center for Cosmology and AstroParticle Physics (CCAPP), and the University of Cincinnati Center for Humanities and Technology Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI); Machine Learning (cs.LG) Artificial intelligence is rapidly transforming astronomical research, yet the scientific community has largely treated this transformation as an engineering challenge rather than an epistemological one. This perspective article argues that philosophy of science offers essential tools for navigating AI's integration into astronomy--conceptual clarity about what \"understanding\" means, critical examination of assumptions about data and discovery, and frameworks for evaluating AI's roles across different research contexts. Drawing on an interdisciplinary workshop convening astronomers, philosophers, and computer scientists, we identify several tensions. First, the narrative that AI will \"derive fundamental physics\" from data misconstrues contemporary astronomy as equation-derivation rather than the observation-driven enterprise it is. Second, scientific understanding involves more than prediction--it requires narrative construction, contextual judgment, and communicative achievement that current AI architectures struggle to provide. Third, because narrative and judgment matter, human peer review remains essential--yet AI-generated content flooding the literature threatens our capacity to identify genuine insight. Fourth, while AI excels at well-defined problem-solving, the ill-defined problem-finding that drives breakthroughs appears to require capacities beyond pattern recognition. Fifth, as AI accelerates what is feasible, pursuitworthiness criteria risk shifting toward what AI makes easy rather than what is genuinely important. We propose \"pragmatic understanding\" as a framework for integration--recognizing AI as a tool that extends human cognition while requiring new norms for validation and epistemic evaluation. Engaging with these questions now may help the community shape the transformation rather than merely react to it.",
      "pdf_url": "https://arxiv.org/pdf/2601.10038.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10454",
      "title": "Alertissimo -- a tool for orchestration of LSST broker streams",
      "authors": [
        "V.Vujcic",
        "V.A. Sreckovic",
        "S. Babarogic"
      ],
      "abstract": "Alertissimo -- a tool for orchestration of LSST broker streams V.Vujcic, V.A. Sreckovic, S. Babarogic Instrumentation and Methods for Astrophysics (astro-ph.IM) The Vera C. Rubin Observatory, through its Legacy Survey of Space and Time, will soon start producing 10 million alerts on transient astronomical objects per night. Due to logistics and bandwidth, alerts will not be dispatched directly to the public but to 'brokers' i.e. tools selected by LSST to handle alert streams. Brokers offer both common, specific and micro-specific functionalities related to alert handling, analysis, representation and dissemination. In this ecosystem, potentially augmented by data streams from other astronomical sources, there is a - need demonstrated by the community - for use cases which combine features of individual brokers. In this paper we present initial efforts and a prototype of such a tool, along with a language that would allow users to define use cases / workflows in a manner tailored for the domain.",
      "pdf_url": "https://arxiv.org/pdf/2601.10454.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.23811",
      "title": "Superconducting Ring Resonators: Modelling, Simulation, and Experimental Characterisation",
      "authors": [
        "Zhenyuan Sun",
        "Stafford Withington",
        "Christopher Thomas",
        "Songyuan Zhao"
      ],
      "abstract": "Superconducting Ring Resonators: Modelling, Simulation, and Experimental Characterisation Zhenyuan Sun, Stafford Withington, Christopher Thomas, Songyuan Zhao Superconductor Science and Technology, 38 (2025) 095012 Superconductivity (cond-mat.supr-con); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present a theoretical and experimental study of superconducting ring resonators as an initial step toward their implementation in superconducting electronics and quantum technologies, with promising applications including superconducting parametric amplifiers with pump-signal isolation, flux-controlled quantum circuits, ultra-sensitive measurements in quantum sensing, and THz instrumentations. These devices have the potentially valuable property of supporting two orthogonal electromagnetic modes that couple to a common Cooper pair, quasiparticle, and phonon system. We present here a comprehensive theoretical and experimental analysis of the superconducting ring resonator system. We have developed superconducting ring resonator models that describe the key features of microwave behaviour to first order, providing insights into how transmission line inhomogeneities give rise to frequency splitting and mode rotation. Furthermore, we constructed signal flow graphs for a four-port ring resonator to numerically validate the behaviour predicted by our theoretical analysis. Superconducting ring resonators were fabricated in both coplanar waveguide and microstrip geometries using Al and Nb thin films. Microwave characterisation of these devices demonstrates close agreement with theoretical predictions. Our study reveals that frequency splitting and mode rotation are prevalent in ring systems with coupled degenerate modes, and these phenomena become distinctly resolved in high quality factor superconducting ring resonators.",
      "pdf_url": "https://arxiv.org/pdf/2506.23811.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.09835",
      "title": "A Robust Launching Mechanism for Freely-Floating Planets from Host Stars with Close-in Planets",
      "authors": [
        "Xiaochen Zheng",
        "Zhuoya Cao",
        "Shigeru Ida",
        "Douglas N.C. Lin",
        "Shude Mao"
      ],
      "abstract": "A Robust Launching Mechanism for Freely-Floating Planets from Host Stars with Close-in Planets Xiaochen Zheng, Zhuoya Cao, Shigeru Ida, Douglas N.C. Lin, Shude Mao 26 pages, 9 figures. Accepted by the Astrophysical Journal Earth and Planetary Astrophysics (astro-ph.EP) Secular perturbations from binary stars and distant massive planets can drive cold planets onto nearly parabolic orbits with pericenter passages extremely close to their host stars. Meanwhile, short-period super-Earths are frequently observed around nearby stars. Gravitational scattering between these two distinct populations can lead to substantial orbital energy exchange, liberating some intruders from the gravitational confinement of their host systems. This process offers a robust formation channel for a subset of the abundant freely floating planet population. It may also significantly perturb the original orbits of close-in planets, induce collisional trajectories between close-in planets and their host stars, and disrupt the dynamical evolution of cold planets toward close stellar encounters.",
      "pdf_url": "https://arxiv.org/pdf/2601.09835.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10285",
      "title": "How disc initial conditions sculpt the atmospheric composition of giant planets",
      "authors": [
        "Angie Daniela Guzmán Franco",
        "Sofia Savvidou",
        "Bertram Bitsch"
      ],
      "abstract": "How disc initial conditions sculpt the atmospheric composition of giant planets Angie Daniela Guzmán Franco, Sofia Savvidou, Bertram Bitsch Accepted by A&A, 12 pages, 4 figures, 8 pages of Appendix Earth and Planetary Astrophysics (astro-ph.EP) Past studies have revealed the dependency of the disc parameters (mass, radius, viscosity, grain fragmentation velocity, dust-to-gas ratio) on the formation of giant planets, where more massive discs seem beneficial for giant planet formation. It is unclear how the different disc properties influence the composition of forming giant planets. The idea that the atmospheric abundances can trace directly the formation location of planets is put into question, due to the chemical evolution of the disc, caused by inward drifting and evaporating pebbles. This complicates the idea of a relation between atmospheric abundances and planet formation locations. We use planet formation simulations that include the effects of pebble drift and evaporation and investigate how the different disc parameters influence the atmospheric composition of giant planets. We focus on the atmospheric C/O, C/H, O/H and S/H ratios allowing us to probe tracers for volatiles and refractories and thus different accretion pathways of giant planets. We find that most of the disc parameters have only a limited influence on the atmospheric abundances of gas giants, except for the dust-to-gas ratio, where a larger value results in higher atmospheric abundances. However the atmospheric abundances are determined by the planetary formation location, even in the pebble drift and evaporation scenario. Our study suggests that volatile-rich giant exoplanets predominantly form in the inner disc regions, where they can accrete large fractions of vapour-enhanced gas. Our study shows that simulations that try to trace the origin of giant planets via their atmospheric abundances do not have to probe all disc parameters, as long as the disc parameters allow the formation of giant planets. Our study thus suggests that the diversity of observed planetary compositions is a direct consequence of their formation location and migration history.",
      "pdf_url": "https://arxiv.org/pdf/2601.10285.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10450",
      "title": "TOI-3862 b: A dense super-Neptune deep in the hot Neptune desert",
      "authors": [
        "Ilaria Carleo",
        "Amadeo Castro-González",
        "Enric Pallé",
        "Felipe Murgas",
        "Grzegorz Nowak",
        "Gaia Lacedelli",
        "Thomas Masseron",
        "Emily W. Wong",
        "Patrick Eggenberger",
        "Vincent Bourrier",
        "Dawid Jankowski",
        "Krzysztof Goździewski",
        "Douglas R. Alves",
        "James S. Jenkins",
        "Sergio Messina",
        "Keivan G. Stassun",
        "Jose I. Vines",
        "Matteo Brogi",
        "David R. Ciardi",
        "Catherine A. Clark",
        "William Cochran",
        "Karen A. Collins",
        "Hans J. Deeg",
        "Elise Furlan",
        "Davide Gandolfi",
        "Samuel Geraldía González",
        "Artie P. Hatzes",
        "Coel Hellier",
        "Steve B. Howell",
        "Judith Korth",
        "Jorge Lillo-Box",
        "John H. Livingston",
        "Jaume Orell-Miquel",
        "Carina M. Persson",
        "Seth Redfield",
        "Boris Safonov",
        "David Baker",
        "Rafael Delfin Barrena Delgado",
        "Allyson Bieryla",
        "Andrew Boyle",
        "Pau Bosch-Cabot",
        "Núria Casasayas Barris",
        "Stavros Chairetas",
        "Jerome P. de Leon",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Pere Guerra",
        "Kai Ikuta",
        "Kiyoe Kawauchi",
        "Emil Knudstrup",
        "Florence Libotte",
        "Michael B. Lund",
        "Rafael Luque",
        "Eduardo Lorenzo Martín Guerrero de Escalante",
        "Bob Massey",
        "Edward J. Michaels",
        "Giuseppe Morello",
        "Norio Narita",
        "Hannu Parvianien",
        "Richard P. Schwarz",
        "Avi Shporer",
        "Monika Stangret",
        "Noriharu Watanabe",
        "Cristilyn N. Watkins"
      ],
      "abstract": "TOI-3862 b: A dense super-Neptune deep in the hot Neptune desert Ilaria Carleo, Amadeo Castro-González, Enric Pallé, Felipe Murgas, Grzegorz Nowak, Gaia Lacedelli, Thomas Masseron, Emily W. Wong, Patrick Eggenberger, Vincent Bourrier, Dawid Jankowski, Krzysztof Goździewski, Douglas R. Alves, James S. Jenkins, Sergio Messina, Keivan G. Stassun, Jose I. Vines, Matteo Brogi, David R. Ciardi, Catherine A. Clark, William Cochran, Karen A. Collins, Hans J. Deeg, Elise Furlan, Davide Gandolfi, Samuel Geraldía González, Artie P. Hatzes, Coel Hellier, Steve B. Howell, Judith Korth, Jorge Lillo-Box, John H. Livingston, Jaume Orell-Miquel, Carina M. Persson, Seth Redfield, Boris Safonov, David Baker, Rafael Delfin Barrena Delgado, Allyson Bieryla, Andrew Boyle, Pau Bosch-Cabot, Núria Casasayas Barris, Stavros Chairetas, Jerome P. de Leon, Izuru Fukuda, Akihiko Fukui, Pere Guerra, Kai Ikuta, Kiyoe Kawauchi, Emil Knudstrup, Florence Libotte, Michael B. Lund, Rafael Luque, Eduardo Lorenzo Martín Guerrero de Escalante, Bob Massey, Edward J. Michaels, Giuseppe Morello, Norio Narita, Hannu Parvianien, Richard P. Schwarz, Avi Shporer, Monika Stangret, Noriharu Watanabe, Cristilyn N. Watkins Earth and Planetary Astrophysics (astro-ph.EP) The structure and evolution of close-in exoplanets are shaped by atmospheric loss and migration processes, which give rise to key population features such as the hot Neptune desert, ridge, and savanna - regions of the period-radius space whose boundaries offer critical insights into planetary formation and survival. As part of the KESPRINT collaboration, we selected the TESS transiting planet candidate TOI-3862.01 for radial velocity follow-up to confirm its planetary nature and characterize its mass and bulk properties. This planet candidate is of particular interest due to its position in the middle of the hot Neptune desert, making it a valuable probe for testing theories of planet migration and atmospheric loss. We confirmed the planetary nature and determined the mass of TOI-3862.01 (hereinafter TOI-3862b) by performing a joint fit with both transit and radial velocity data, precisely characterizing the bulk properties of this planet. TOI-3862b is a super-Neptune on a 1.56-day orbit around a Sun-like star with an effective temperature of 5300$\\pm$50K. It has a mass of 53.7$_{-2.9}^{+2.8}$ M$_{\\oplus}$ and a radius of 5.53$\\pm$0.18 R$_{\\oplus}$, corresponding to a density of 1.7$\\pm$0.2 g/cm^3. This places it among the rare population of hot and dense super-Neptune desert planets. TOI-3862b, residing deep in the hot Neptune desert, represents a rare occurrence in an otherwise sparsely populated region, offering a valuable opportunity to probe the processes that may allow planets to survive in such environments.",
      "pdf_url": "https://arxiv.org/pdf/2601.10450.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10508",
      "title": "sponchpop II: Population Synthesis to Investigate Volatile Sulfur as a Fingerprint of Gas Giant Formation Histories",
      "authors": [
        "Anna Sommerville-Thomas",
        "Mihkel Kama",
        "Oliver Shottle",
        "Jason Ran"
      ],
      "abstract": "sponchpop II: Population Synthesis to Investigate Volatile Sulfur as a Fingerprint of Gas Giant Formation Histories Anna Sommerville-Thomas, Mihkel Kama, Oliver Shottle, Jason Ran 16 pages, 13 figures (including appendix), submitted and under review Earth and Planetary Astrophysics (astro-ph.EP) Planet population synthesis is an integral tool for linking exoplanets to their formation environments. Most planet population synthesis studies have focused on the carbon-to-oxygen ratio (C/O) in gas or solids, yet more insight into planet formation may be afforded by considering a wider suite of elements. Sulfur is one such key element. It has been assumed to be entirely refractory in population synthesis models, restricting it to being a tracer of accreted rocky solids. However, sulfur also has a volatile reservoir dominant at the onset of star and planet formation. We investigate sulfur's wider potential as a formation history tracer by implementing the first multi-phase treatment of S in a planet population synthesis model. We present the planet formation module of \\textsc{sponchpop} and its first predicted planet growth tracks and populations. We explore the diversity of planet compositions in terms of their sulfur budget, including both refractory and volatile components, and apply a novel gas-grain conversion of sulfur to study how formation trajectories of giant planets relate to final core and envelope compositions. We show that planets inherit a wide range of core and envelope sulfur content related to accretion history while considering late-stage planetesimal infall, providing a new diagnostic tool for planet formation. The diverse sulfur content of planet cores suggests some rocky planets may be born sulfur-poor, with implications for their geochemistry and habitability. Enhanced sulfur abundances in gas-giant atmospheres can be attributed to formation beyond the H2S iceline, such as the giants in our Solar System.",
      "pdf_url": "https://arxiv.org/pdf/2601.10508.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10585",
      "title": "Canceling Effects of Conjunctions Render Higher Order Mean Motion Resonances Weak",
      "authors": [
        "Elizabeth K Jones",
        "Samuel Hadden",
        "Daniel Tamayo"
      ],
      "abstract": "Canceling Effects of Conjunctions Render Higher Order Mean Motion Resonances Weak Elizabeth K Jones, Samuel Hadden, Daniel Tamayo Submitted to ApJ. 10 pages, 5 figures Earth and Planetary Astrophysics (astro-ph.EP) Mean motion resonances (MMRs) are a key phenomenon in orbital dynamics. The traditional disturbing function expansion in celestial mechanics shows that, at low eccentricities, $p$:$p-q$ MMRs exhibit a clear hierarchy of strengths, scaling as $e^q$, where $q$ is the order of the resonance. This explains why first-order MMRs (e.g., 3:2 and 4:3) are important, while the infinite number of higher order integer ratios are not. However, this relationship derived from a technical perturbation series expansion provides little physical intuition. In this paper, we provide a simple physical explanation of this result for closely spaced orbits. In this limit, interplanetary interactions are negligible except during close encounters at conjunction, where the planets impart a gravitational \"kick\" to each other's mean motion. We show that while first-order MMRs involve a single conjunction before the configuration repeats, higher order MMRs involve multiple conjunctions per cycle, whose effects cancel out more precisely the higher the order of the resonance. Starting from the effects of a single conjunction, we provide an alternate, physically motivated derivation of MMRs' $e^q$ strength scaling.",
      "pdf_url": "https://arxiv.org/pdf/2601.10585.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10598",
      "title": "A young progenitor for the most common planetary systems in the Galaxy",
      "authors": [
        "John H. Livingston",
        "Erik A. Petigura",
        "Trevor J. David",
        "Kento Masuda",
        "James Owen",
        "David Nesvorný",
        "Konstantin Batygin",
        "Jerome de Leon",
        "Mayuko Mori",
        "Kai Ikuta",
        "Akihiko Fukui",
        "Noriharu Watanabe",
        "Jaume Orell Miquel",
        "Felipe Murgas",
        "Hannu Parviainen",
        "Judith Korth",
        "Florence Libotte",
        "Néstor Abreu García",
        "Pedro Pablo Meni Gallardo",
        "Norio Narita",
        "Enric Pallé",
        "Motohide Tamura",
        "Atsunori Yonehara",
        "Andrew Ridden-Harper",
        "Allyson Bieryla",
        "Alessandro A. Trani",
        "Eric E. Mamajek",
        "David R. Ciardi",
        "Varoujan Gorjian",
        "Lynne A. Hillenbrand",
        "Luisa M. Rebull",
        "Elisabeth R. Newton",
        "Andrew W. Mann",
        "Andrew Vanderburg",
        "Guðmundur Stefánsson",
        "Suvrath Mahadevan",
        "Caleb Cañas",
        "Joe Ninan",
        "Jesus Higuera",
        "Kamen Todorov",
        "Jean-Michel Désert",
        "Lorenzo Pino"
      ],
      "abstract": "A young progenitor for the most common planetary systems in the Galaxy John H. Livingston, Erik A. Petigura, Trevor J. David, Kento Masuda, James Owen, David Nesvorný, Konstantin Batygin, Jerome de Leon, Mayuko Mori, Kai Ikuta, Akihiko Fukui, Noriharu Watanabe, Jaume Orell Miquel, Felipe Murgas, Hannu Parviainen, Judith Korth, Florence Libotte, Néstor Abreu García, Pedro Pablo Meni Gallardo, Norio Narita, Enric Pallé, Motohide Tamura, Atsunori Yonehara, Andrew Ridden-Harper, Allyson Bieryla, Alessandro A. Trani, Eric E. Mamajek, David R. Ciardi, Varoujan Gorjian, Lynne A. Hillenbrand, Luisa M. Rebull, Elisabeth R. Newton, Andrew W. Mann, Andrew Vanderburg, Guðmundur Stefánsson, Suvrath Mahadevan, Caleb Cañas, Joe Ninan, Jesus Higuera, Kamen Todorov, Jean-Michel Désert, Lorenzo Pino Earth and Planetary Astrophysics (astro-ph.EP) The Galaxy's most common known planetary systems have several Earth-to-Neptune-size planets in compact orbits. At small orbital separations, larger planets are less common than their smaller counterparts by an order of magnitude. The young star V1298 Tau hosts one such compact planetary system, albeit with four planets that are uncommonly large (5 to 10 Earth radii). The planets form a chain of near-resonances that result in transit-timing variations of several hours. Here we present a multi-year campaign to characterize this system with transit-timing variations, a method insensitive to the intense magnetic activity of the star. Through targeted observations, we first resolved the previously unknown orbital period of the outermost planet. The full 9-year baseline from these and archival data then enabled robust determination of the masses and orbital parameters for all four planets. We find the planets have low, sub-Neptune masses and nearly circular orbits, implying a dynamically tranquil history. Their low masses and large radii indicate that the inner planets underwent a period of rapid cooling immediately after dispersal of the protoplanetary disk. Still, they are much less dense than mature planets of comparable size. We predict the planets will contract to 1.5-4.0 Earth radii and join the population of super-Earths and sub-Neptunes that nature produces in abundance.",
      "pdf_url": "https://arxiv.org/pdf/2601.10598.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.10666",
      "title": "Observation Timelines for the Potential Lunar Impact of Asteroid 2024 YR4",
      "authors": [
        "Yifan He",
        "Yixuan Wu",
        "Yifei Jiao",
        "Wen-Yue Dai",
        "Xin Liu",
        "Bin Cheng",
        "Hexi Baoyin"
      ],
      "abstract": "Observation Timelines for the Potential Lunar Impact of Asteroid 2024 YR4 Yifan He, Yixuan Wu, Yifei Jiao, Wen-Yue Dai, Xin Liu, Bin Cheng, Hexi Baoyin Earth and Planetary Astrophysics (astro-ph.EP) The near-Earth asteroid 2024 YR4 -- a $\\sim$60 m rocky object that was once considered a potential Earth impactor -- has since been ruled out for Earth but retained a $\\sim$4.3% probability of striking the Moon in 2032. Such an impact, with equivalent kinetic energy of $\\sim$6.5 Mt TNT, is expected to produce a $\\sim$1 km crater on the Moon, and will be the most energetic lunar impact event ever recorded in human history. Despite the associated risk, this scenario offers a rare and valuable scientific opportunity. Using a hybrid framework combining Monte Carlo orbital propagation, smoothed particle hydrodynamics (SPH) impact modeling, and N-body ejecta dynamics, we evaluate the physical outcomes and propose the observation timelines of this rare event. Our results suggest an optical flash of visual magnitude from -2.5 to -3 lasting several minutes directly after the impact, followed by hours of infrared afterglow from $\\sim$2000 K molten rock cooling to a few hundred K. The associated seismic energy release would lead to a global-scale lunar reverberation (magnitude $\\sim$5.0) that can be detectable by modern seismometers. Furthermore, the impact would eject $\\sim$10$^8$ kg of debris that escapes the lunar gravity, with a small fraction reaching Earth to produce a lunar meteor outburst within 100 years. Finally, we integrate these results into a coordinated observation timeline, identifying the best detection windows for ground-based telescopes, lunar orbiters, and surface stations.",
      "pdf_url": "https://arxiv.org/pdf/2601.10666.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.08681",
      "title": "Next-Generation Improvements in Giant Exoplanet Evolutionary and Structural Models",
      "authors": [
        "Ankan Sur",
        "Roberto Tejada Arevalo",
        "Adam Burrows",
        "Yi-Xian Chen"
      ],
      "abstract": "Next-Generation Improvements in Giant Exoplanet Evolutionary and Structural Models Ankan Sur, Roberto Tejada Arevalo, Adam Burrows, Yi-Xian Chen 21 pages, 12 figures, accepted version in ApJ Earth and Planetary Astrophysics (astro-ph.EP) Many evolutionary models of giant exoplanets still rely on simplifying assumptions that are no longer adequate given detailed constraints from Jupiter, Saturn, and modern exoplanet observations. Here, we identify the key physical improvements required for next-generation planetary evolution models using our code, \\texttt{APPLE}, which enables systematic emulation and extension of legacy studies. We quantify the effects of updated equations of state, helium rain, fuzzy cores, non-adiabatic and compositionally inhomogeneous envelopes, and improved atmospheric boundary conditions by first isolating the impact of each physical ingredient and then constructing combined baseline models for planets with masses between 0.3 and 4~$M_{\\rm Jup}$ to assess their collective influence on planetary structure and observable properties. We find that the adoption of modern equations of state and realistic heavy-element distributions leads to systematic, but sometimes subtle, differences ($\\sim 5$ to 10\\%) in radius evolution, while helium rain and the treatment of convection can significantly alter thermal histories and atmospheric compositions (by $\\sim$ 5 to 20\\%). These updated physical processes must be incorporated into the next-generation exoplanet evolutionary models to achieve physically consistent interpretations of planetary observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.08681.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.12957",
      "title": "Orbit Elements from Kepler Solutions in Projective Coordinates",
      "authors": [
        "Joseph T.A. Peterson",
        "Manoranjan Majji",
        "John L. Junkins"
      ],
      "abstract": "Orbit Elements from Kepler Solutions in Projective Coordinates Joseph T.A. Peterson, Manoranjan Majji, John L. Junkins New in most recent version: corrections to previous inconsistent and misleading notation Earth and Planetary Astrophysics (astro-ph.EP); Dynamical Systems (math.DS); Classical Physics (physics.class-ph) Closed-Form Kepler solutions in projective coordinates are used to define a corresponding set of eight orbit elements and obtain their governing equations for arbitrarily-perturbed two-body dynamics. The elements and their dynamics are singularity-free in all cases besides rectilinear motion (when angular momentum vanishes). The classic J2-perturbed two-body problem is developed and used for numerical verification.",
      "pdf_url": "https://arxiv.org/pdf/2511.12957.pdf",
      "categories": [
        "astro-ph.EP",
        "math.DS"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07159",
      "title": "Limit cycles and the climate history of Mars",
      "authors": [
        "Jacob Haqq-Misra"
      ],
      "abstract": "Limit cycles and the climate history of Mars Jacob Haqq-Misra Earth and Planetary Astrophysics (astro-ph.EP) Evidence for fluvial features and standing liquid water indicate that Mars was a warmer and wetter place in its past; however, climate models have historically been unable to produce conditions to yield a warm early Mars under the faint young sun. Some models invoke thick greenhouse atmospheres to produce continuously warm conditions, but others have argued that available geologic evidence is more consistent with short-duration and transient warming events on an otherwise cold Mars. One possibility of harmonizing these perspectives is that early Mars experienced climate limit cycles that caused the climate to oscillate between short periods of warmth and prolonged periods of glaciation, due to modulation of greenhouse warming by the carbonate-silicate cycle. This study suggests that episodic limit cycling during the Noachian and Hesperian periods provides a hypothetical explanation for the timing and formation of fluvial features on Mars. A schematic time-forward trajectory of the full history of Mars is calculated using an energy balance climate model, which includes an active carbonate-silicate cycle, instellation changes due to the sun's main sequence evolution, variations in the obliquity of Mars, and supplemental warming from additional greenhouse gases beyond carbon dioxide alone. These calculations demonstrate the viability of a climate history for Mars involving episodic limit cycling to enable the formation of the valley networks at 4.1-3.5 Ga and delta features at 3.3-3.0 Ga, interspersed with cold stable climates and ending in the late Amazonian in a carbon dioxide condensation regime. This schematic climate trajectory provides a plausible narrative that remains consistent with available geologic data, and further exploration of warming mechanisms for the climate of Mars should consider the possibility of episodic transient events driven by carbonate-silicate limit cycling.",
      "pdf_url": "https://arxiv.org/pdf/2601.07159.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}