{
  "date": "2025-11-04",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.CO",
    "astro-ph.IM",
    "astro-ph.EP",
    "astro-ph.SR",
    "astro-ph.HE",
    "astro-ph.GA"
  ],
  "total_papers": 100,
  "gw_related_papers": 5,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.26931",
      "title": "GW241011 and GW241110: Exploring Binary Formation and Fundamental Physics with Asymmetric, High-Spin Black Hole Coalescence",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration: A. G. Abac",
        "I. Abouelfettouh",
        "F. Acernese",
        "K. Ackley",
        "C. Adamcewicz",
        "S. Adhicary",
        "D. Adhikari",
        "N. Adhikari",
        "R. X. Adhikari",
        "V. K. Adkins",
        "S. Afroz",
        "A. Agapito",
        "D. Agarwal",
        "M. Agathos",
        "N. Aggarwal",
        "S. Aggarwal",
        "O. D. Aguiar",
        "I.-L. Ahrend",
        "L. Aiello",
        "A. Ain",
        "P. Ajith",
        "T. Akutsu",
        "S. Albanesi",
        "W. Ali",
        "S. Al-Kershi",
        "C. Alléné",
        "A. Allocca",
        "S. Al-Shammari",
        "P. A. Altin",
        "S. Alvarez-Lopez",
        "W. Amar",
        "O. Amarasinghe",
        "A. Amato",
        "F. Amicucci",
        "C. Amra",
        "A. Ananyeva",
        "S. B. Anderson",
        "W. G. Anderson",
        "M. Andia",
        "M. Ando",
        "M. Andrés-Carcasona",
        "T. Andrić",
        "J. Anglin",
        "S. Ansoldi",
        "J. M. Antelis",
        "S. Antier",
        "F. Antonini",
        "M. Aoumi",
        "E. Z. Appavuravther",
        "S. Appert",
        "S. K. Apple",
        "K. Arai",
        "C. Araújo-Álvarez",
        "A. Araya",
        "M. C. Araya",
        "M. Arca Sedda",
        "J. S. Areeda",
        "N. Aritomi",
        "F. Armato",
        "S. Armstrong",
        "N. Arnaud",
        "M. Arogeti",
        "S. M. Aronson",
        "K. G. Arun",
        "G. Ashton",
        "Y. Aso",
        "L. Asprea",
        "M. Assiduo",
        "S. Assis de Souza Melo",
        "S. M. Aston",
        "P. Astone",
        "P. S. Aswathi",
        "F. Attadio",
        "F. Aubin",
        "K. AultONeal",
        "G. Avallone",
        "E. A. Avila",
        "S. Babak",
        "C. Badger",
        "S. Bae",
        "S. Bagnasco",
        "L. Baiotti",
        "R. Bajpai",
        "T. Baka",
        "A. M. Baker",
        "K. A. Baker",
        "T. Baker",
        "G. Baldi",
        "N. Baldicchi",
        "M. Ball",
        "G. Ballardin",
        "S. W. Ballmer",
        "S. Banagiri",
        "B. Banerjee",
        "D. Bankar",
        "T. M. Baptiste",
        "P. Baral"
      ],
      "abstract": "GW241011 and GW241110: Exploring Binary Formation and Fundamental Physics with Asymmetric, High-Spin Black Hole Coalescence The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration: A. G. Abac, I. Abouelfettouh, F. Acernese, K. Ackley, C. Adamcewicz, S. Adhicary, D. Adhikari, N. Adhikari, R. X. Adhikari, V. K. Adkins, S. Afroz, A. Agapito, D. Agarwal, M. Agathos, N. Aggarwal, S. Aggarwal, O. D. Aguiar, I.-L. Ahrend, L. Aiello, A. Ain, P. Ajith, T. Akutsu, S. Albanesi, W. Ali, S. Al-Kershi, C. Alléné, A. Allocca, S. Al-Shammari, P. A. Altin, S. Alvarez-Lopez, W. Amar, O. Amarasinghe, A. Amato, F. Amicucci, C. Amra, A. Ananyeva, S. B. Anderson, W. G. Anderson, M. Andia, M. Ando, M. Andrés-Carcasona, T. Andrić, J. Anglin, S. Ansoldi, J. M. Antelis, S. Antier, F. Antonini, M. Aoumi, E. Z. Appavuravther, S. Appert, S. K. Apple, K. Arai, C. Araújo-Álvarez, A. Araya, M. C. Araya, M. Arca Sedda, J. S. Areeda, N. Aritomi, F. Armato, S. Armstrong, N. Arnaud, M. Arogeti, S. M. Aronson, K. G. Arun, G. Ashton, Y. Aso, L. Asprea, M. Assiduo, S. Assis de Souza Melo, S. M. Aston, P. Astone, P. S. Aswathi, F. Attadio, F. Aubin, K. AultONeal, G. Avallone, E. A. Avila, S. Babak, C. Badger, S. Bae, S. Bagnasco, L. Baiotti, R. Bajpai, T. Baka, A. M. Baker, K. A. Baker, T. Baker, G. Baldi, N. Baldicchi, M. Ball, G. Ballardin, S. W. Ballmer, S. Banagiri, B. Banerjee, D. Bankar, T. M. Baptiste, P. Baral Data available from Zenodo (this https URL) or the Gravitational-Wave Open Science Center (this https URL) Astrophys. J. Letters, 993, L21 (2025) High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) We report the observation of gravitational waves from two binary black hole coalescences during the fourth observing run of the LIGO--Virgo--KAGRA detector network, GW241011 and GW241110. The sources of these two signals are characterized by rapid and precisely measured primary spins, non-negligible spin--orbit misalignment, and unequal mass ratios between their constituent black holes. These properties are characteristic of binaries in which the more massive object was itself formed from a previous binary black hole merger, and suggest that the sources of GW241011 and GW241110 may have formed in dense stellar environments in which repeated mergers can take place. As the third loudest gravitational-wave event published to date, with a median network signal-to-noise ratio of $36.0$, GW241011 furthermore yields stringent constraints on the Kerr nature of black holes, the multipolar structure of gravitational-wave generation, and the existence of ultralight bosons within the mass range $10^{-13}$--$10^{-12}$ eV.",
      "pdf_url": "https://arxiv.org/pdf/2510.26931.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.27000",
      "title": "Non-uniform Birefringence in Highly-reflective Substrate-Transferred GaAs/Al$_{0.92}$Ga$_{0.08}$As Coatings at 1064 nm",
      "authors": [
        "Andri M. Gretarsson",
        "Ambroise L.M. Juston",
        "Benjamin Nicolai",
        "Naomi Borg",
        "Breck N. Meagher",
        "Garrett D. Cole",
        "GariLynn Billingsley",
        "Camille N. Makarem",
        "Elizabeth M. Gretarsson",
        "Gregory M. Harry",
        "Steven D. Penn"
      ],
      "abstract": "Non-uniform Birefringence in Highly-reflective Substrate-Transferred GaAs/Al$_{0.92}$Ga$_{0.08}$As Coatings at 1064 nm Andri M. Gretarsson, Ambroise L.M. Juston, Benjamin Nicolai, Naomi Borg, Breck N. Meagher, Garrett D. Cole, GariLynn Billingsley, Camille N. Makarem, Elizabeth M. Gretarsson, Gregory M. Harry, Steven D. Penn Optics (physics.optics); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Detectors (physics.ins-det) Using a custom-built scanning system, we generated maps of birefringence on reflection at $\\lambda=1064$~nm from single-crystal GaAs/Al$_{0.92}$Ga$_{0.08}$As Bragg reflectors (henceforth ``AlGaAs coatings''). Ten coatings were bonded to fused silica substrates and one remained on the epitaxial growth wafer. The average phase difference on reflection between beams polarized along the fast and slow axes of the coating was found to be $\\psi = 1.09 \\pm 0.18$~mrad, consistent with values observed in high-finesse optical reference cavities using similar AlGaAs coatings. Scans of substrate-transferred coatings with diameters between 18 and 194 millimeters showed birefringence non-uniformity at a median level of $0.1$~mrad. A similar epitaxial multilayer that was not substrate transferred, but remained on the growth wafer, had by far the least birefringence non-uniformity of all mirrors tested at $0.02$~mrad. On the other hand, the average birefringence of the epi-on-wafer coating and substrate-transferred coatings was indistinguishable. Excluding non-uniformity found at the location of crystal and bonding defects, we conclude that the observed non-uniformity was imparted during the substrate transfer process, likely during bonding. Quantifying the impact on the scatter loss in a LIGO-like interferometer, we find that birefringence non-uniformity at the levels seen here is unlikely to have a significant impact on performance. Nonetheless, future efforts will focus on improved process control to minimize and ultimately eliminate the observed non-uniformity.",
      "pdf_url": "https://arxiv.org/pdf/2510.27000.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27022",
      "title": "Direct multi-model dark-matter search with gravitational-wave interferometers using data from the first part of the fourth LIGO-Virgo-KAGRA observing run",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration"
      ],
      "abstract": "Direct multi-model dark-matter search with gravitational-wave interferometers using data from the first part of the fourth LIGO-Virgo-KAGRA observing run The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration 10 pages, 1 figure (+1 figure in appendix) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational-wave detectors can probe the existence of dark matter with exquisite sensitivity. Here, we perform a search for three kinds of dark matter -- dilatons (spin-0), dark photons (spin-1) and tensor bosons (spin-2) -- using three independent methods on the first part of the most recent data from the fourth observing run of LIGO--Virgo--KAGRA. Each form of dark matter could have interacted with different standard-model particles in the instruments, causing unique differential strains on the interferometers. While we do not find any evidence for a signal, we place the most stringent upper limits to-date on each of these models. For scalars with masses between $[4\\times 10^{-14},1.5\\times 10^{-13}]$ eV that couple to photons or electrons, our constraints improve upon those from the third observing run by one order of magnitude, with the tightest limit of $\\sim 10^{-20}\\,\\text{GeV}^{-1}$ at a mass of $\\sim2\\times 10^{-13}\\text{ eV}$. For vectors with masses between $[7\\times 10^{-13},8.47\\times 10^{-12}]$ eV that couple to baryons, our constraints supersede those from MICROSCOPE and Eöt-Wash by one to two orders of magnitude, reaching a minimum of $\\sim 5\\times 10^{-24}$ at a mass of $\\sim 10^{-12}$ eV. For tensors with masses of $[4\\times 10^{-14},8.47\\times 10^{-12}]$ eV (the full mass range analyzed) that couple via a Yukawa interaction, our constraints surpass those from fifth-force experiments by four to five orders of magnitude, achieving a limit as low as $\\sim 8\\times 10^{-9}$ at $\\sim2\\times 10^{-13}$ eV. Our results show that gravitational-wave interferometers have become frontiers for new physics and laboratories for direct multi-model dark-matter detection.",
      "pdf_url": "https://arxiv.org/pdf/2510.27022.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.27086",
      "title": "Conditional variational autoencoders for cosmological model discrimination and anomaly detection in cosmic microwave background power spectra",
      "authors": [
        "Tian-Yang Sun",
        "Tian-Nuo Li",
        "He Wang",
        "Jing-Fei Zhang",
        "Xin Zhang"
      ],
      "abstract": "Conditional variational autoencoders for cosmological model discrimination and anomaly detection in cosmic microwave background power spectra Tian-Yang Sun, Tian-Nuo Li, He Wang, Jing-Fei Zhang, Xin Zhang Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The cosmic microwave background power spectra are a primary window into the early universe. However, achieving interpretable, likelihood-compatible compression and fast inference under weak model assumptions remains challenging. We propose a parameter-conditioned variational autoencoder (CVAE) that aligns a data-driven latent representation with cosmological parameters while remaining compatible with standard likelihood analyses. The model achieves high-fidelity compression of the $D_\\ell^{TT}$, $D_\\ell^{EE}$, and $D_\\ell^{TE}$ spectra into just 5 latent dimensions, with reconstruction accuracy exceeding $99.9\\%$ within Planck uncertainties. It reliably reconstructs spectra for beyond-$\\Lambda$CDM scenarios, even under parameter extrapolation, and enables rapid inference, reducing the computation time from $\\sim$40 hours to $\\sim$2 minutes while maintaining posterior consistency. The learned latent space demonstrates a physically meaningful structure, capturing a distributed representation that mirrors known cosmological parameters and their degeneracies. Moreover, it supports highly effective unsupervised discrimination among cosmological models, achieving performance competitive with supervised approaches. Overall, this physics-informed CVAE enables anomaly detection beyond $\\Lambda$CDM and points to physically meaningful directions for refinement.",
      "pdf_url": "https://arxiv.org/pdf/2510.27086.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27409",
      "title": "Probing the Penrose Process: Images of Split Hotspots and Their Observational Signatures",
      "authors": [
        "Zhixing Zhao",
        "Zhong-Ying Fan",
        "Xiaobao Wang",
        "Minyong Guo",
        "Bin Chen"
      ],
      "abstract": "Probing the Penrose Process: Images of Split Hotspots and Their Observational Signatures Zhixing Zhao, Zhong-Ying Fan, Xiaobao Wang, Minyong Guo, Bin Chen High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) While theoretically established for decades, the Penrose process - energy extraction from rotating black holes - still lacks clear observational evidence. A promising theoretical framework posits magnetic reconnection in the ergosphere as a trigger, causing a plasmoid to separate into an escaping positive-energy fragment and an infalling negative-energy one. In this work, we investigate the observational imprints of this scenario. We treat the energized plasmoid as a hotspot and calculate its light curves for a realistic plasma magnetization. In particular, we further compare with the scenario in which the plasmoid, after fragmentation, falls into the black hole with positive energy, while all other conditions remain unchanged. Our results reveal that the process of fragmentation generates distinct flares, whose characteristics depend heavily on whether the infalling fragment carries negative or positive energy. We propose that these differences serve as identifiable signatures of the Penrose process.",
      "pdf_url": "https://arxiv.org/pdf/2510.27409.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27605",
      "title": "Probing Gravity at Large Scales with kSZ-Reconstructed Velocities and CMB Lensing",
      "authors": [
        "Raagini Patki",
        "Nicholas Battaglia",
        "Rachel Bean"
      ],
      "abstract": "Probing Gravity at Large Scales with kSZ-Reconstructed Velocities and CMB Lensing Raagini Patki, Nicholas Battaglia, Rachel Bean 18 Pages, 4 Figures, 4 Tables. To be submitted to Phys. Rev. D Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present a new method for measuring the $E_G$ statistic that combines two CMB secondaries -- the kinematic Sunyaev-Zeldovich (kSZ) effect and CMB lensing -- for the first time to probe gravity on linear scales. The $E_G$ statistic is a discriminating tool for modified gravity theories, which leave imprints in lensing observables and peculiar velocities. Existing $E_G$ measurements rely on redshift space distortions (RSD) to infer the velocity field. Here, we employ kSZ velocity-reconstruction instead of RSD, a complementary technique that constrains the largest-scale modes better than the galaxy survey it uses. We construct a novel $\\widehat{V}_G$ estimator that involves a ratio between cross-correlations of a galaxy sample with a CMB convergence map and that with a 3D kSZ-reconstructed velocity field. We forecast for current and upcoming CMB maps from the Atacama Cosmology Telescope (ACT) and the Simons Observatory (SO), respectively, in combination with three spectroscopic galaxy samples from the Dark Energy Spectroscopic Instrument (DESI). We find cumulative detection significances in the range $S/N \\sim 20-55$, which can robustly test the scale-independent $E_G$ prediction under general relativity (GR) at different effective redshifts of the galaxy samples ($z\\approx 0.73, 1.33, 1.84$). In particular, the SO$\\times$DESI LRG measurement would be able to distinguish between GR and certain modified gravity models, including Hu-Sawicki $f(R)$ and Chameleon theories, with high confidence. The proposed $\\widehat{V}_G$ estimator opens up a new avenue for stress-testing gravity and the $\\Lambda$CDM+GR model at the largest observable scales.",
      "pdf_url": "https://arxiv.org/pdf/2510.27605.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.09707",
      "title": "Inflationary Models with Gauss-Bonnet Coupling in Light of ACT Observations",
      "authors": [
        "Yigan Zhu",
        "Qing Gao",
        "Yungui Gong",
        "Zhu Yi"
      ],
      "abstract": "Inflationary Models with Gauss-Bonnet Coupling in Light of ACT Observations Yigan Zhu, Qing Gao, Yungui Gong, Zhu Yi Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Recent analyses combining Atacama Cosmology Telescope (ACT) data with other cosmological datasets report a higher scalar spectral index $n_s$, creating tension with a wide range of inflationary models. Since a Gauss-Bonnet term with a coupling function $\\xi(\\phi) = 3\\lambda/[4V(\\phi)]$ leaves $n_s$ nearly unchanged (up to a field rescaling) while reducing the tensor-to-scalar ratio $r$ by a factor $(1-\\lambda)$, so choosing $(1-\\lambda)$ sufficiently small effectively removes $r$ as a limiting observable, making it easier for inflationary models to satisfy the latest observational constraints and alleviating this tension. Applying this mechanism to chaotic inflation, E-models, T-models, and hilltop inflation, we find that broad regions of parameter space become consistent with the latest ACT-based CMB constraints. These results demonstrate that Gauss-Bonnet couplings can help bring a broad class of inflationary models into agreement with current CMB measurements.",
      "pdf_url": "https://arxiv.org/pdf/2508.09707.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26901",
      "title": "Universal numerical convergence criteria for subhalo tidal evolution",
      "authors": [
        "Barry T. Chiang",
        "Frank C. van den Bosch",
        "Hsi-Yu Schive"
      ],
      "abstract": "Universal numerical convergence criteria for subhalo tidal evolution Barry T. Chiang, Frank C. van den Bosch, Hsi-Yu Schive Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Dark matter subhalos and satellite galaxies in state-of-the-art cosmological simulations still suffer from the ``overmerging'' problem, where inadequate force and/or mass resolution cause artificially enhanced tidal mass loss and premature disruption. Previous idealized simulations addressing this issue have been restricted to a small subset of the subhalo orbital parameter space, and all assumed subhalos to be isotropic. Here, we present the first extensive simulation suite that quantifies numerical convergence in the tidal evolution of anisotropic subhalos under varying numerical resolutions and orbits. We report a universal force resolution criterion: the subhalo's instantaneous tidal radius must always be resolved by at least 20 cells in adaptive mesh refinement (AMR)-based simulations, or by 20 softening lengths (Plummer equivalent) in tree-based simulations, regardless of refinement details or subhalo physical properties such as concentration or velocity anisotropy. We also report a universal expression for the discreteness-noise-driven scatter in the bound-mass fraction of subhalos that depends only on the subhalo mass resolution at infall and the instantaneous bound mass fraction, agnostic of any further subhalo properties. Such stochastic discreteness noise causes both premature disruption and, notably, spurious survival of poorly mass-resolved subhalos. We demonstrate that as many as 50 percent of all subhalos in state-of-the-art cosmological simulations are likely to be either force and/or mass unresolved. Our findings advocate for adaptive softening or grid refinement based on the instantaneous tidal radius of the subhalo.",
      "pdf_url": "https://arxiv.org/pdf/2510.26901.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26918",
      "title": "Can galactic magnetic fields diffuse into the voids?",
      "authors": [
        "Oindrila Ghosh",
        "Axel Brandenburg",
        "Chiara Caprini",
        "Andrii Neronov",
        "Franco Vazza"
      ],
      "abstract": "Can galactic magnetic fields diffuse into the voids? Oindrila Ghosh, Axel Brandenburg, Chiara Caprini, Andrii Neronov, Franco Vazza Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Cosmic voids are magnetized at the level of at least $10^{-17}$ G on Mpc scales, as implied by blazar observations. We show that an electrically conducting plasma is present in the voids, and that, because of the plasma, \\emph{diffusion} into the voids of galactic fields generated by a mean-field dynamo is far too slow to explain the present-day void magnetization. Indeed, we show that even in the presence of turbulence in the voids, dynamo-generated galactic fields diffuse out to a galactocentric radius of only 200-400 kpc. Therefore, it is challenging to meet the required volume filling-factor of the void magnetic field. We conclude that a primordial origin remains the most natural explanation to the space-filling weak fields in voids.",
      "pdf_url": "https://arxiv.org/pdf/2510.26918.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27103",
      "title": "A Comparison of Galacticus and COZMIC WDM Subhalo Populations",
      "authors": [
        "Jack Lonergan",
        "Andrew Benson",
        "Xiaolong Du"
      ],
      "abstract": "A Comparison of Galacticus and COZMIC WDM Subhalo Populations Jack Lonergan, Andrew Benson, Xiaolong Du Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present a comparative analysis of warm dark matter (WDM) subhalo populations generated by the semi-analytic model {\\sc Galacticus} and the COZMIC suite of dark matter-only $N$-body simulations. Using a range of thermal relic WDM particle masses (3--10 keV), we examine key summary statistics -- including the subhalo mass function, spatial distribution, maximum circular velocity $V_\\text{max}$, and its corresponding radius $ R_\\text{max} $ -- to evaluate the consistency between these two modeling frameworks. Both models predict a suppression of low-mass subhalos correlated with decreasing WDM particle mass, and that WDM subhalos tend to have lower $V_\\text{max} $ and larger $ R_\\text{max} $ values than their CDM counterparts at fixed mass. While {\\sc Galacticus} provides more statistically precise results due to a larger sample size, the COZMIC simulations display similar qualitative trends. We discuss how differences in halo finder algorithms, simulation resolution, and modeling assumptions affect subhalo statistics. Our findings demonstrate that {\\sc Galacticus} can reliably reproduce WDM subhalo distributions seen in $N$-body simulations, offering a computationally efficient tool for exploring the implications of WDM across astrophysical phenomena.",
      "pdf_url": "https://arxiv.org/pdf/2510.27103.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27180",
      "title": "Constraints on Axion-photon coupling from the Global 21-cm Signal",
      "authors": [
        "Hao Jiao"
      ],
      "abstract": "Constraints on Axion-photon coupling from the Global 21-cm Signal Hao Jiao Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) A radiation field can be excited via parametric resonance when an oscillating axion field couples to the electromagnetic sector through a Chern-Simons interaction. As demonstrated in previous works, this mechanism can generate primordial magnetic fields shortly after recombination and provide sufficient ultraviolet radiation for the formation of direct collapse black holes (DCBHs). In this study, I analyze constraints on the parametric resonance scenario from global 21cm observations. I find that there exist viable regions in the parameter space that satisfy both observational limits and the physical requirements of the magnetic field and DCBH formation scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2510.27180.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27227",
      "title": "First Cosmological Constraints from the Joint Analysis of Galaxy Clustering and the Kinetic Sunyaev-Zel'dovich Effect",
      "authors": [
        "Shaohong Li",
        "Yi Zheng"
      ],
      "abstract": "First Cosmological Constraints from the Joint Analysis of Galaxy Clustering and the Kinetic Sunyaev-Zel'dovich Effect Shaohong Li, Yi Zheng Cosmology and Nongalactic Astrophysics (astro-ph.CO) We perform the first joint analysis of the galaxy clustering (GC) and the kinetic Sunyaev-Zel'dovich (kSZ) effect to simultaneously constrain cosmological and astrophysical parameters in this work, utilizing a combination of the Atacama Cosmology Telescope (ACT) Data Release 6 (DR6) map and the Constant Stellar Mass (CMASS) galaxy sample. As a complementary probe to the galaxy density power spectrum, we incorporate the pairwise kSZ power spectrum detected with a high signal-to-noise ratio (S/N $\\sim 7$) to derive constraints on cosmological parameters ($H_0 = 71.16^{+5.09}_{-5.50}$, $\\Omega_{\\rm m} = 0.276^{+0.086}_{-0.067}$, $w_0 = -0.971^{+0.236}_{-0.380}$) and the average optical depth of the galaxy sample ($\\lg\\bar{\\tau} = -4.22 \\pm +0.09$). Compared to the GC-only analysis, the joint analysis yields tighter constraints on these cosmological parameters: the Figures of Merits (FoMs) improve by 29.3%, 32.3% and 21.5% for the $H_0$--$\\Omega_{\\rm m}$, $H_0$--$w_0$ and $\\Omega_{\\rm m}$--$w_0$ contours. For the first time, we demonstrate the complementary applicability of the kSZ effect in constrain cosmological parameters from real observational data.",
      "pdf_url": "https://arxiv.org/pdf/2510.27227.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27291",
      "title": "Reproducing Abell 2744 with the HyperMillennium Simulation",
      "authors": [
        "Qiao Wang",
        "Ming Li",
        "Liang Gao",
        "Qi Guo",
        "Raul E. Angulo",
        "Sangjun Cha",
        "Shaun Cole",
        "Carlos S. Frenk",
        "Kim HyeongHan",
        "Ran Li",
        "Wenxiang Pei",
        "Huanyuan Shan",
        "Jie Wang",
        "Simon D.M. White"
      ],
      "abstract": "Reproducing Abell 2744 with the HyperMillennium Simulation Qiao Wang, Ming Li, Liang Gao, Qi Guo, Raul E. Angulo, Sangjun Cha, Shaun Cole, Carlos S. Frenk, Kim HyeongHan, Ran Li, Wenxiang Pei, Huanyuan Shan, Jie Wang, Simon D.M. White 16 pages, 11 figures; Submitted to Monthly Notices of the Royal Astronomical Society Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present the Hyper Millennium (HM) simulation, an extremely large cosmological simulation designed to support next-generation galaxy surveys. The simulation follows 4.2 trillion dark matter particles in a comoving box of $2.5\\ h^{-1}{\\rm Gpc}$, with a mass resolution of $3.2 \\times 10^8\\, {\\rm M}_{\\odot}$ and a force resolution of $3.0\\ h^{-1}{\\rm kpc}$. Its combination of scale and resolution is ideal for studying large-scale structures and rare cosmic objects. In this first paper of the HM project, we explore whether the massive galaxy cluster Abell 2744 (A2744) can be reproduced in detail in the simulation. Pixel-based statistics of galaxy number density $N_{\\rm gal}$, luminosity density $L_{\\rm gal}$, and projected mass density $\\kappa$ show excellent agreement between A2744 and its analogues down to $\\sim 50\\ {\\rm kpc}$, once field-selection biases toward high galaxy surface density are accounted for. This concordance, achieved in one of the most extreme known galaxy environments, is a validation of the underlying $\\Lambda{\\rm CDM}$ model in the extreme regime of A2744 and showcases the robustness and accuracy of the HM simulation, which is capable of producing galaxy and mass catalogues of comparable quality out to high redshift across its full comoving volume of $45$ ${\\rm Gpc^3}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.27291.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27416",
      "title": "Earth-lens telescope for distant axion-like particle sources with stimulated backward reflection",
      "authors": [
        "Taiyo Nakamura",
        "Kensuke Homma"
      ],
      "abstract": "Earth-lens telescope for distant axion-like particle sources with stimulated backward reflection Taiyo Nakamura, Kensuke Homma Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We propose a novel telescope concept based on Earth's gravitational lensing effect, optimized for the detection of distant dark matter sources, particularly axion-like particles (ALPs). When a unidirectional flux of dark matter passes through Earth at sufficiently high velocity, gravitational lensing can concentrate the flux at a distant focal region in space. Our method combines this lensing effect with stimulated backward reflection (SBR), arising from ALP decays that are induced by directing a coherent electromagnetic beam toward the focal point. The aim of this work is to numerically analyze the structure of the focal region and to develop a framework for estimating the sensitivity to ALP-photon coupling via this mechanism. Numerical calculations show that, assuming an average ALP velocity of 520,km/s -- as suggested by the observed stellar stream S1 -- the focal region extends from $9 \\times 10^9$,m to $1.4 \\times 10^{10}$,m, with peak density near $9.6 \\times 10^9$,m. For a conservative point-like ALP source located approximately 8,kpc from the solar system, based on the S1 stream, the estimated sensitivity in the eV mass range reaches $g/M = \\mathcal{O}(10^{-22}),\\mathrm{GeV}^{-1}$. This concept thus opens a path toward a general-purpose, space-based ALP observatory that could, in principle, detect more distant sources -- well beyond $\\mathcal{O}(10),\\mathrm{kpc}$ -- provided that ALP-photon coupling is sufficiently strong, that is, $M \\ll M_\\mathrm{Planck}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.27416.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27505",
      "title": "Euclid: Systematic uncertainties from the halo mass conversion on galaxy cluster number count data analyses",
      "authors": [
        "T. Gayoux",
        "P.-S. Corasaniti",
        "T.R.G. Richardson",
        "S.T. Kay",
        "A.M.C. Le Brun",
        "L. Moscardini",
        "L. Pizzuti",
        "S. Borgani",
        "M. Costanzi",
        "C. Giocoli",
        "S. Grandis",
        "A. Ragagnin",
        "J. Rhodes",
        "I. Saez-Casares",
        "M. Sereno",
        "E. Sarpa",
        "B. Altieri",
        "A. Amara",
        "S. Andreon",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "S. Camera",
        "G. Canas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K.C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "L. Conversi",
        "Y. Copin",
        "F. Courbin",
        "H.M. Courtois",
        "A. Da Silva",
        "H. Degaudenzi",
        "G. De Lucia",
        "H. Dole",
        "F. Dubath",
        "C.A.J. Duncan",
        "X. Dupac",
        "S. Dusini",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "S. Farrens",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "B. Gillis",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "S.V.H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "E. Keihanen",
        "S. Kermiche",
        "A. Kiessling",
        "M. Kilbinger",
        "B. Kubik",
        "M. Kunz",
        "H. Kurki-Suonio",
        "O. Lahav",
        "S. Ligori",
        "P.B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti",
        "D. Maino",
        "E. Maiorano",
        "O. Mansutti",
        "S. Marcin",
        "O. Marggraf",
        "M. Martinelli",
        "N. Martinet",
        "F. Marulli",
        "R.J. Massey",
        "E. Medinaceli",
        "S. Mei",
        "Y. Mellier",
        "M. Meneghetti",
        "E. Merlin",
        "G. Meylan"
      ],
      "abstract": "Euclid: Systematic uncertainties from the halo mass conversion on galaxy cluster number count data analyses T. Gayoux, P.-S. Corasaniti, T.R.G. Richardson, S.T. Kay, A.M.C. Le Brun, L. Moscardini, L. Pizzuti, S. Borgani, M. Costanzi, C. Giocoli, S. Grandis, A. Ragagnin, J. Rhodes, I. Saez-Casares, M. Sereno, E. Sarpa, B. Altieri, A. Amara, S. Andreon, N. Auricchio, C. Baccigalupi, M. Baldi, S. Bardelli, A. Biviano, E. Branchini, M. Brescia, S. Camera, G. Canas-Herrera, V. Capobianco, C. Carbone, J. Carretero, S. Casas, M. Castellano, G. Castignani, S. Cavuoti, K.C. Chambers, A. Cimatti, C. Colodro-Conde, G. Congedo, L. Conversi, Y. Copin, F. Courbin, H.M. Courtois, A. Da Silva, H. Degaudenzi, G. De Lucia, H. Dole, F. Dubath, C.A.J. Duncan, X. Dupac, S. Dusini, S. Escoffier, M. Farina, R. Farinelli, S. Farrens, F. Faustini, S. Ferriol, F. Finelli, M. Frailis, E. Franceschi, M. Fumana, S. Galeotta, B. Gillis, J. Gracia-Carpio, A. Grazian, F. Grupp, S.V.H. Haugan, W. Holmes, F. Hormuth, A. Hornstrup, K. Jahnke, M. Jhabvala, E. Keihanen, S. Kermiche, A. Kiessling, M. Kilbinger, B. Kubik, M. Kunz, H. Kurki-Suonio, O. Lahav, S. Ligori, P.B. Lilje, V. Lindholm, I. Lloro, G. Mainetti, D. Maino, E. Maiorano, O. Mansutti, S. Marcin, O. Marggraf, M. Martinelli, N. Martinet, F. Marulli, R.J. Massey, E. Medinaceli, S. Mei, Y. Mellier, M. Meneghetti, E. Merlin, G. Meylan 20 pages, 11 figures, submitted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) The large catalogues of galaxy clusters expected from the Euclid survey will enable cosmological analyses of cluster number counts that require accurate cosmological model predictions. One possibility is to use parametric fits calibrated against $N$-body simulations, that capture the cosmological parameter dependence of the halo mass function. Several studies have shown that this can be obtained through a calibration against haloes with spherical masses defined at the virial overdensity. In contrast, if different mass definitions are used for the HMF and the scaling relation, a mapping between them is required. Here, we investigate the impact of such a mapping on the cosmological parameter constraints inferred from galaxy cluster number counts. Using synthetic data from $N$-body simulations, we show that the standard approach, which relies on assuming a concentration-mass relation, can introduce significant systematic bias. In particular, depending on the mass definition and the relation assumed, this can lead to biased constraints at more than 2$\\sigma$ level. In contrast, we find that in all the cases we have considered, the mass conversion based on the halo sparsity statistics result in a systematic bias smaller than the statistical error.",
      "pdf_url": "https://arxiv.org/pdf/2510.27505.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27549",
      "title": "Revealing cosmological fluctuations in 21cm intensity maps with MeerKLASS: from maps to power spectra",
      "authors": [
        "Steven Cunnington",
        "Matilde Barberi-Squarotti",
        "José Luis Bernal",
        "Stefano Camera",
        "Isabella P. Carucci",
        "Zhaoting Chen",
        "José Fonseca",
        "Mario Santos",
        "Marta Spinelli",
        "Jingying Wang",
        "Laura Wolz"
      ],
      "abstract": "Revealing cosmological fluctuations in 21cm intensity maps with MeerKLASS: from maps to power spectra Steven Cunnington, Matilde Barberi-Squarotti, José Luis Bernal, Stefano Camera, Isabella P. Carucci, Zhaoting Chen, José Fonseca, Mario Santos, Marta Spinelli, Jingying Wang, Laura Wolz Submitted to Springer Nature. This paper was prepared in response to an invitation to contribute to the Springer Nature Astronomy Prize Awardees Collections (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO) Mapping the integrated 21cm emission line from dark matter-tracing neutral hydrogen gas is the primary science goal for MeerKLASS (MeerKAT's Large Area Synoptic Survey). Prior to the arrival of MeerKAT, this intensity mapping technique had only been tested on a couple of pre-existing single-dish radio telescopes with a handful of observational hours with which to make early pioneering detections. The 64-dish MeerKAT array, precursor to the Square Kilometre Array Observatory (SKAO), can scan the sky in auto-correlation mode and perform intensity mapping across large sky areas, presenting the exciting potential for a wide-sky (${\\gtrsim}\\,10{,}000\\,{\\rm deg}^2$) spectroscopic survey across redshift $0.4\\,{<}\\,z\\,{<}\\,1.45$. Validating the auto-correlation (or single-dish) mode of observation for a multi-dish array and developing the analysis pipeline with which to make unbiased measurements has presented major challenges to this endeavour. In this work, we overview the advances in the field that have facilitated a robust analysis framework for single-dish intensity mapping, and review some results that showcase its success using early MeerKLASS surveys. We demonstrate our control of foreground cleaning, signal loss and map regridding to deliver detections of cosmological clustering within the intensity maps through cross-correlation power spectrum measurements with overlapping galaxy surveys. Finally, we discuss the prospects for future MeerKLASS observations and forecast its potential, making our code publicly available: this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2510.27549.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27579",
      "title": "String-induced vacuum decay",
      "authors": [
        "Aleksandr Chatrchyan",
        "Florian Niedermann",
        "Phoebe Richman-Taylor"
      ],
      "abstract": "Aleksandr Chatrchyan, Florian Niedermann, Phoebe Richman-Taylor Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) False vacuum decay typically proceeds via the nucleation of spherical bubbles of true vacuum, described by $O(4)$ symmetric field configurations in Euclidean time. In this work, we investigate how the presence of cosmic strings can catalyze the decay process. To this end, we consider a complex scalar field charged under a global or local $U(1)$ symmetry. Assuming a non-trivial vacuum manifold, realizable for example in a simple sextic potential, we derive relativistic bounce solutions with $O(2) \\times O(2)$ symmetry, corresponding to elongated bubbles seeded by a cosmic string of the same scalar field. Building up on earlier results in the literature, we identify the region of parameter space where vacuum decay predominantly proceeds via this alternative channel, thereby providing an explicit mechanism for the quantum decay of cosmic strings. Finally, we present an initial discussion of the gravitational wave signal associated with this type of vacuum decay and its possible connection to the recently observed stochastic signal in pulsar timing arrays.",
      "pdf_url": "https://arxiv.org/pdf/2510.27579.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.27586",
      "title": "Production of Gravitational Waves from Preheating and Tachyonic Instabilities",
      "authors": [
        "Khursid Alam",
        "Koushik Dutta",
        "Ahamadullah Khan"
      ],
      "abstract": "Production of Gravitational Waves from Preheating and Tachyonic Instabilities Khursid Alam, Koushik Dutta, Ahamadullah Khan Cosmology and Nongalactic Astrophysics (astro-ph.CO) We analyze GW production during preheating for an $\\alpha$-attractor potential terminating in the positive-curvature regime, with energy transfer via $\\phi\\chi^{2}$. Linear Floquet analysis and nonlinear simulations show that $\\phi$ fluctuations grow by parametric resonance, while $\\chi$ undergoes tachyonic bursts. The GW spectrum features two peaks: a dominant low-frequency peak from the parametric channel and a subdominant high-frequency peak from the tachyonic channel. Redshifted to today, the peak reaches $h^{2}\\Omega_{\\rm GW}^{(0)} \\sim 10^{-11}$ at $f^{(0)}_{p} \\sim 10^{7}$ Hz. This multi-peak structure is a characteristic imprint of trilinear preheating in $\\alpha$-attractors.",
      "pdf_url": "https://arxiv.org/pdf/2510.27586.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.26851",
      "title": "jFoF: GPU Cluster Finding with Gradient Propagation",
      "authors": [
        "Benjamin Horowitz",
        "Adrian E. Bayer"
      ],
      "abstract": "jFoF: GPU Cluster Finding with Gradient Propagation Benjamin Horowitz, Adrian E. Bayer Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We present jFoF, a fully GPU-native Friends-of-Friends (FoF) halo finder designed for both high-performance simulation analysis and differentiable modeling. Implemented in JAX, jFoF achieves end-to-end acceleration by performing all neighbor searches, label propagation, and group construction directly on GPUs, eliminating costly host--device transfers. We introduce two complementary neighbor-search strategies, a standard k-d tree and a novel linked-cell grid, and demonstrate that jFoF attains up to an order-of-magnitude speedup compared to optimized CPU implementations while maintaining consistent halo catalogs. Beyond performance, jFoF enables gradient propagation through discrete halo-finding operations via both frozen-assignment and topological optimization modes. Using a topological optimization approach via a REINFORCE-style estimator, our approach allows smooth optimization of halo connectivity and membership, bridging continuous simulation fields with discrete structure catalogs. These capabilities make jFoF a foundation for differentiable inference, enabling end-to-end, gradient-based optimization of structure formation models within GPU-accelerated astrophysical pipelines. We make our code publicly available at this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2510.26851.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26885",
      "title": "High$-z$ [OI] emission lines: ColdSIM simulations and ALMA observations",
      "authors": [
        "Massimiliano Parente",
        "Manuela Bischetti",
        "Umberto Maio",
        "Francesco Salvestrini",
        "Chiara Feruglio",
        "Gian Luigi Granato",
        "Cinthia Ragone-Figueroa",
        "Roberta Tripodi",
        "Carlos De Breuck",
        "Carl Ferkinhoff",
        "Luca Tornatore"
      ],
      "abstract": "High$-z$ [OI] emission lines: ColdSIM simulations and ALMA observations Massimiliano Parente, Manuela Bischetti, Umberto Maio, Francesco Salvestrini, Chiara Feruglio, Gian Luigi Granato, Cinthia Ragone-Figueroa, Roberta Tripodi, Carlos De Breuck, Carl Ferkinhoff, Luca Tornatore 16 pages, 14 figures - accepted in A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Neutral-oxygen [OI] far-infrared emission lines at $63\\mu$m and $145\\mu$m are powerful probes of the physical conditions in the interstellar medium, although they have not been fully exploited in high-redshift studies. We investigate the connection between [OI] emission lines and key galaxy properties, such as star formation rate (SFR) and H$_2$ content. Our predictions are compared with existing observations and new data analysed in this work. We post-process the outputs of the ColdSIM cosmological simulations with the DESPOTIC model, taking into account [OI]$63\\mu$m self-absorption by cold foreground material. A Random Forest algorithm is employed to accelerate computations and new observational ALMA data for galaxies at redshift $z\\simeq 5-7$ are used to validate our model. Our predictions show significant [OI]$63\\mu$m luminosities ($\\approx 10^8\\,\\rm L_\\odot$) for galaxies with SFRs of $\\approx 10^2\\,\\rm M_\\odot\\,{\\rm yr}^{-1}$. The $145\\mu$m line luminosity is typically $15 \\%$ the [OI]$63\\mu$m one and is a factor $\\approx 2-20$ below high-$z$ observations. Both [OI] lines correlate with SFR and molecular mass, but exhibit flattening in scaling relations with metallicity and stellar mass. Foreground self-absorption reduces the [OI] flux by a factor of $2-4$, consistent with empirical corrections in observational studies. We find typical line ratios of [OI]$63\\mu$m / [CII]$158\\mu$m $\\approx 1$ and [OI]$145\\mu$m / [CII]$158\\mu$m $ \\approx 0.2 \\, -$ consistent with $z\\gtrsim 6$ observations, but only when [OI]$63\\mu$m self-absorption is included. Both [OI]$63\\mu$m and [OI]$145\\mu$m lines serve as tracers of star formation and molecular gas at high redshift. Their joint detection can provide constraints on the properties of the early interstellar medium and self-absorption of the [OI]$63\\mu$m line.",
      "pdf_url": "https://arxiv.org/pdf/2510.26885.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26947",
      "title": "Detecting the IGM metal enrichment with the 2-point correlation function of the flux. Application to the UVES deep spectrum",
      "authors": [
        "Simona Di Stefano",
        "Valentina D'Odorico",
        "Guido Cupani",
        "Dinko Milakovic",
        "Andrea Trost",
        "Stefano Cristiani",
        "Matteo Viel",
        "Robert F. Carswell"
      ],
      "abstract": "Detecting the IGM metal enrichment with the 2-point correlation function of the flux. Application to the UVES deep spectrum Simona Di Stefano, Valentina D'Odorico, Guido Cupani, Dinko Milakovic, Andrea Trost, Stefano Cristiani, Matteo Viel, Robert F. Carswell 15 pages, 10 figures, accepted for publication in A&A, abstract abridged Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The distribution and the abundance of metals in the intergalactic medium (IGM) have strong implications on galaxy formation and evolution models. The ionic transitions of heavy elements in quasar spectra can probe both the mechanisms and the sources of chemical pollution, but high resolution, high signal-to-noise ratio (S/N) spectra are required, as the IGM absorbers can be too weak for direct detection. In this work, we investigate the IGM metallicity, focusing on the detection of the weak absorption lines. We exploited the cosmological tool of the two-point correlation function (TPCF) and applied it to the transmitted flux in the CIV forest of the ultra-high S/N UVES spectrum of the quasar HE0940-1050 (z~3). We also \"deabsorbed\" the strongest circum-galactic medium (CGM) systems to reveal the underlying IGM signal. For each test, we generated 1000 mock spectra with shuffled line positions to derive an estimate for the TPCF noise level. The TPCF shows a clear peak at the characteristic velocity separation of the CIV doublet, but when deabsorbing the CGM contribution (i.e. all metal lines and CIV lines associated with logN(HI)>14.0), the peak is no longer significant at 1$\\sigma$, although 7 weak CIV systems remain visible. Even adding up to 135 additional weak mock CIV systems (logN(HI)<14.0) to the spectrum does not produce a significant CIV peak. Eventually, when we create a synthetic spectrum with gaussian distributed noise and same S/N as the complete spectrum, we remove the signal caused by the spectral intrinsic features and thus find a peak compatible with a metallicity of -3.80<[C/H]<-3.50. We conclude that the TPCF method is not sensitive to the presence of the weakest systems in the real spectrum, despite the extremely high S/N and high resolution of the data. However, the results of this statistical technique would possibly change when combining more than one line of sight.",
      "pdf_url": "https://arxiv.org/pdf/2510.26947.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27604",
      "title": "DiffstarPop: A generative physical model of galaxy star formation history",
      "authors": [
        "Alex Alarcon",
        "Andrew P. Hearin",
        "Matthew R. Becker",
        "Gillian Beltz-Mohrmann",
        "Andrew Benson",
        "Sachi Weerasooriya"
      ],
      "abstract": "DiffstarPop: A generative physical model of galaxy star formation history Alex Alarcon, Andrew P. Hearin, Matthew R. Becker, Gillian Beltz-Mohrmann, Andrew Benson, Sachi Weerasooriya 11 pages of main body text with 10 figures, plus 4 appendices Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present DiffstarPop, a differentiable forward model of cosmological populations of galaxy star formation histories (SFH). In the model, individual galaxy SFH is parametrized by Diffstar, which has parameters $\\theta_{\\rm SFH}$ that have a direct interpretation in terms of galaxy formation physics, such as star formation efficiency and quenching. DiffstarPop is a model for the statistical connection between $\\theta_{\\rm SFH}$ and the mass assembly history (MAH) of dark matter halos. We have formulated DiffstarPop to have the minimal flexibility needed to accurately reproduce the statistical distributions of galaxy SFH predicted by a diverse range of simulations, including the IllustrisTNG hydrodynamical simulation, the Galacticus semi-analytic model, and the UniverseMachine semi-empirical model. Our publicly available code written in JAX includes Monte Carlo generators that supply statistical samples of galaxy assembly histories that mimic the populations seen in each simulation, and can generate SFHs for $10^6$ galaxies in 1.1 CPU-seconds, or 0.03 GPU-seconds. We conclude the paper with a discussion of applications of DiffstarPop, which we are using to generate catalogs of synthetic galaxies populating the merger trees in cosmological N-body simulations.",
      "pdf_url": "https://arxiv.org/pdf/2510.27604.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27644",
      "title": "Probing cosmic isotropy with Gamma-ray bursts: A dipole and quadrupole analysis of BATSE and Fermi GBM data",
      "authors": [
        "Debosi Mondal",
        "Biswajit Pandey",
        "Amit Mondal"
      ],
      "abstract": "Probing cosmic isotropy with Gamma-ray bursts: A dipole and quadrupole analysis of BATSE and Fermi GBM data Debosi Mondal, Biswajit Pandey, Amit Mondal 25 pages, 17 figures, 2 tables, comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The cosmological principle, asserting large-scale homogeneity and isotropy, underpins the standard model of cosmology. Testing its validity using independent astronomical probes remains crucial for understanding the global structure of the Universe. We investigate the angular distribution of Gamma-Ray Bursts (GRBs) using two of the most comprehensive all-sky datasets available, the BATSE (CGRO) and Fermi GBM catalog to test the isotropy of the GRB sky at large angular scales. We perform spherical harmonic decomposition of the GRB sky maps and estimate the dipole and quadrupole amplitudes. Statistical significance is evaluated by comparing the observed multipole amplitudes against distributions derived from 500 Monte Carlo realizations of isotropic skies. Our results show that the observed dipole amplitudes for both BATSE and Fermi GBM datasets lie within $1\\sigma$ region of their respective null distributions. However, the quadrupole amplitude in the raw BATSE and Fermi skies appears elevated at $3.7\\sigma$ and $3\\sigma$ respectively. After incorporating the BATSE sky exposure function, this apparent quadrupole anisotropy vanishes, indicating that instrumental non-uniformities fully account for the signal. Our method's reliability is validated through controlled simulations, which show it can detect the injected dipoles in BATSE-sized isotropic skies. These findings reinforce the statistical isotropy of the GRB sky and underscore the importance of accurate exposure corrections in cosmological anisotropy analyses.",
      "pdf_url": "https://arxiv.org/pdf/2510.27644.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.12637",
      "title": "Testing inhomogeneous cosmography in our cosmic neighborhood using CosmicFlows-4",
      "authors": [
        "S. M. Koksbang"
      ],
      "abstract": "Testing inhomogeneous cosmography in our cosmic neighborhood using CosmicFlows-4 S. M. Koksbang Submitted to PRD. v2: Analysis significantly extended but no changes in overall conclusions. 21 pages. Matches version accepted for publication in PRD. v3: Minor clarifying note (footnote 2) added after publication. No changes to results or conclusions Phys. Rev. D 111, 123516 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO) The convergence of the third order general cosmographic expansion of the luminosity distance is examined using several versions of a semi-realistic model of our local cosmic neighborhood, based on publicly available density and velocity fields from CosmicFlows-4. The study supports earlier findings that the general cosmographic expansion diverges at surprisingly low redshifts, often well before z = 0.1. By being based on a realistically placed observer within a data-informed cosmic environment, the results underscore that convergence must be a central concern when applying the general cosmographic expansion. By showing all-sky maps of kinematic parameters, the study also highlights the substantial information we lose when relying solely on standard FLRW-based cosmography. Poor convergence does not necessarily render the information extracted by fitting data to the general cosmographic expansion meaningless. Rather, it calls for caution in interpreting this information, particularly regarding the physical meaning of the fitting coefficients, the physical scales they probe and the implicit smoothing introduced by the fit.",
      "pdf_url": "https://arxiv.org/pdf/2412.12637.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.02574",
      "title": "Probing large-scale structures with the two-point function and the power spectrum: insights into cosmic clustering evolution",
      "authors": [
        "Camila Franco",
        "Felipe Avila",
        "Armando Bernui"
      ],
      "abstract": "Probing large-scale structures with the two-point function and the power spectrum: insights into cosmic clustering evolution Camila Franco, Felipe Avila, Armando Bernui 24 pages, 21 figures, published in ApJ Cosmology and Nongalactic Astrophysics (astro-ph.CO) Understanding the large-scale structure of the Universe requires analyses of cosmic clustering and its evolution over time. In this work, we investigate the clustering properties of SDSS blue galaxies, which are excellent tracers of dark matter, along two distinct epochs of the Universe, utilizing estimators like the two-point angular correlation function (2PACF), the angular power spectra, among others. Considering a model-independent approach, we perform analyses in two disjoint redshift shells, $0 \\leq z < 0.06$ and $0.06 \\leq z < 0.12$, to investigate the distribution of large cosmic structures. Using Bayesian inference methods, we constrain the parameter that quantifies the galaxy clustering in the 2PACF, enabling us to perform comparisons among different regions on the sky and between different epochs in the Universe regarding the gravitational action on matter structures. Our analyses complement previous efforts to map large-scale structures in the Local Universe. In addition, this study reveals differences regarding the clustering of large cosmic structures comparing two epochs of the Universe, analyses done with diverse estimators. Results reveal, clearly, distinct evolutionary signatures between the two redshift shells. Moreover, we had the opportunity to test the concordance cosmological model under extreme conditions in the highly non-linear Local Universe, computing the amplitude of the angular power spectrum at very small scales. Ultimately, all our analyses serve as a set of consistency tests of the concordance cosmological model, the $\\Lambda$CDM.",
      "pdf_url": "https://arxiv.org/pdf/2502.02574.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.15336",
      "title": "On DESI's DR2 exclusion of $Λ$CDM",
      "authors": [
        "Marina Cortês",
        "Andrew R Liddle"
      ],
      "abstract": "On DESI's DR2 exclusion of $Λ$CDM Marina Cortês, Andrew R Liddle 6 pages with two figures, updated to match version accepted by MNRAS Cosmology and Nongalactic Astrophysics (astro-ph.CO) The DESI collaboration, combining their Baryon Acoustic Oscillation (BAO) data with cosmic microwave background (CMB) anisotropy and supernovae data, have found significant indication against the $\\Lambda$CDM cosmology. This can also be interpreted as the significance of the detection of the $w_a$ parameter that measures variation of the dark energy equation of state. DESI's DR2 article quotes exclusion of $\\Lambda$CDM for combinations of BAO and CMB data with each of three different and overlapping supernovae compilations (at 2.8-sigma for Pantheon+, 3.8-sigma for Union3, and 4.2-sigma for DESY5). We show that one can neither choose amongst nor average over these three different significances. We demonstrate how a principled statistical combination yields a combined exclusion significance of 3.1-sigma. Further we argue that, faced with these competing significances, the most secure inference from the DESI DR2 results is the 3.1-sigma level exclusion of $\\Lambda$CDM obtained from combining DESI+CMB alone, omitting supernovae.",
      "pdf_url": "https://arxiv.org/pdf/2504.15336.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.16669",
      "title": "FLRW Kinematic-Induced Measurement of the Hubble Constant from Cosmic Chronometer and Redshift Drift Observations",
      "authors": [
        "Kang Jiao",
        "Tong-Jie Zhang",
        "Liang Gao",
        "Yun Chen"
      ],
      "abstract": "FLRW Kinematic-Induced Measurement of the Hubble Constant from Cosmic Chronometer and Redshift Drift Observations Kang Jiao, Tong-Jie Zhang, Liang Gao, Yun Chen Updated to match the version published in Physics of the Dark Universe Physics of the Dark Universe 50 (2025) 102143 Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a geometric embedding method that exploits the exact kinematic relation $\\dot{z} = H_0(1 + z) - H(z)$ to transform redshift misalignment between Cosmic Chronometer (CC) and Sandage-Loeb (SL) datasets into fundamental constraints in observable space. The approach recognizes that $H_0$ encodes the orientation of the FLRW observational plane defined by $(z, H(z), \\dot{z})$ coordinates, enabling direct algebraic determination without parametric assumptions or interpolation schemes. Validation using available CC measurements and forecasted redshift drift data from FAST, CHIME, SKA, and ELT demonstrates 1.9\\% precision for optimal data combinations, yielding $H_0 = 66.26 \\pm 1.26$ km s$^{-1}$ Mpc$^{-1}$ while maintaining complete cosmological model independence. While no actual SL measurements currently exist, requiring us to rely on simulations for validation, our geometric constraints show superior resilience against sparse redshift coverage compared to Gaussian Process (GP) methods, which exhibit systematic biases and large uncertainties when datasets lack substantial overlap. This kinematic framework establishes geometric embedding as a robust tool for precision cosmological measurements, offering a fundamentally different approach to $H_0$ determination through pure observational analysis based on FLRW kinematic principles. The full potential of this method awaits implementation with real SL measurements from next-generation facilities.",
      "pdf_url": "https://arxiv.org/pdf/2506.16669.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.20648",
      "title": "Cosmological bounds on dark matter annihilation using dark ages 21-cm signal",
      "authors": [
        "Vivekanand Mohapatra"
      ],
      "abstract": "Cosmological bounds on dark matter annihilation using dark ages 21-cm signal Vivekanand Mohapatra 30 pages, 3 figures. Matches the Published version; Comments are welcome Physics of the Dark Universe (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We investigate the impact of dark matter (DM) annihilation on the global 21-cm signal during the dark ages and cosmic dawn eras. The 21-cm line provides a complementary probe for studying the nature of dark matter beyond standard cosmological observables. In the standard $\\Lambda$CDM framework, the expected absorption amplitude of the dark ages global 21-cm signal is approximately $-42\\, \\rm mK$. However, energy injection from DM annihilation can significantly heat and ionize the intergalactic medium, potentially altering or even erasing this absorption feature. We evaluate the thermal and ionization history of the gas to derive an upper bound on $f_\\chi^2 \\langle \\sigma v \\rangle / M_\\chi$ using the dark ages signal, which is free from astrophysical uncertainties. After incorporating observational and theoretical uncertainties arising from future lunar-based experiments and variations in cosmological parameters, respectively -- we obtain a conservative upper limit of $f_\\chi^2\\langle\\sigma v\\rangle/M_\\chi \\lesssim 10^{-27}~\\rm cm^3\\,s^{-1}\\,\\rm GeV^{-1}$. This constraint is stronger than the bounds derived from Planck (2018) data for mass $\\lesssim 10~\\rm GeV$.",
      "pdf_url": "https://arxiv.org/pdf/2506.20648.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.20667",
      "title": "An iterative CMB lensing estimator minimizing instrumental noise bias",
      "authors": [
        "Louis Legrand",
        "Blake Sherwin",
        "Anthony Challinor",
        "Julien Carron",
        "Gerrit S. Farren"
      ],
      "abstract": "An iterative CMB lensing estimator minimizing instrumental noise bias Louis Legrand, Blake Sherwin, Anthony Challinor, Julien Carron, Gerrit S. Farren 10 pages, 5 figures, version accepted for publication Cosmology and Nongalactic Astrophysics (astro-ph.CO) Noise maps from CMB experiments are generally statistically anisotropic, due to scanning strategies, atmospheric conditions, or instrumental effects. Any mis-modeling of this complex noise can bias the reconstruction of the lensing potential and the measurement of the lensing power spectrum from the observed CMB maps. We introduce a new CMB lensing estimator based on the maximum a posteriori (MAP) reconstruction that is minimally sensitive to these instrumental noise biases. By modifying the likelihood to rely exclusively on correlations between CMB map splits with independent noise realizations, we minimize auto-correlations that contribute to biases. In the regime of many independent splits, this maximum closely approximates the optimal MAP reconstruction of the lensing potential. In simulations, we demonstrate that this method is able to determine lensing observables that are immune to any noise mis-modeling with a negligible cost in signal-to-noise ratio. Our estimator enables unbiased and nearly optimal lensing reconstruction for next-generation CMB surveys.",
      "pdf_url": "https://arxiv.org/pdf/2506.20667.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.24669",
      "title": "Towards constraining cosmological parameters with SPT-3G observations of 25% of the sky",
      "authors": [
        "A. Vitrier",
        "K. Fichman",
        "L. Balkenhol",
        "E. Camphuis",
        "F. Guidi",
        "A. R. Khalife",
        "A. J. Anderson",
        "B. Ansarinejad",
        "M. Archipley",
        "K. Benabed",
        "A. N. Bender",
        "B. A. Benson",
        "F. Bianchini",
        "L. E. Bleem",
        "F. R. Bouchet",
        "L. Bryant",
        "M. G. Campitiello",
        "J. E. Carlstrom",
        "C. L. Chang",
        "P. Chaubal",
        "P. M. Chichura",
        "A. Chokshi",
        "T.-L. Chou",
        "A. Coerver",
        "T. M. Crawford",
        "C. Daley",
        "T. de Haan",
        "K. R. Dibert",
        "M. A. Dobbs",
        "M. Doohan",
        "A. Doussot",
        "D. Dutcher",
        "W. Everett",
        "C. Feng",
        "K. R. Ferguson",
        "N. C. Ferree",
        "A. Foster",
        "S. Galli",
        "A. E. Gambrel",
        "R. W. Gardner",
        "F. Ge",
        "N. Goeckner-Wald",
        "R. Gualtieri",
        "S. Guns",
        "N. W. Halverson",
        "E. Hivon",
        "G. P. Holder",
        "W. L. Holzapfel",
        "J. C. Hood",
        "A. Hryciuk",
        "N. Huang",
        "F. Kéruzoré",
        "L. Knox",
        "M. Korman",
        "K. Kornoelje",
        "C.-L. Kuo",
        "K. Levy",
        "Y. Li",
        "A. E. Lowitz",
        "C. Lu",
        "G. P. Lynch",
        "A. Maniyar",
        "E. S. Martsen",
        "F. Menanteau",
        "M. Millea",
        "J. Montgomery",
        "Y. Nakato",
        "T. Natoli",
        "G. I. Noble",
        "Y. Omori",
        "A. Ouellette",
        "Z. Pan",
        "P. Paschos",
        "K. A. Phadke",
        "A. W. Pollak",
        "K. Prabhu",
        "W. Quan",
        "M. Rahimi",
        "A. Rahlin",
        "C. L. Reichardt",
        "M. Rouble",
        "J. E. Ruhl",
        "E. Schiappucci",
        "A. C. Silva Oliveira",
        "A. Simpson",
        "J. A. Sobrin",
        "A. A. Stark",
        "J. Stephen",
        "C. Tandoi",
        "B. Thorne",
        "C. Trendafilova",
        "C. Umilta",
        "J. D. Vieira",
        "Y. Wan",
        "N. Whitehorn",
        "W. L. K. Wu",
        "M. R. Young",
        "J. A. Zebrowski"
      ],
      "abstract": "Towards constraining cosmological parameters with SPT-3G observations of 25% of the sky A. Vitrier, K. Fichman, L. Balkenhol, E. Camphuis, F. Guidi, A. R. Khalife, A. J. Anderson, B. Ansarinejad, M. Archipley, K. Benabed, A. N. Bender, B. A. Benson, F. Bianchini, L. E. Bleem, F. R. Bouchet, L. Bryant, M. G. Campitiello, J. E. Carlstrom, C. L. Chang, P. Chaubal, P. M. Chichura, A. Chokshi, T.-L. Chou, A. Coerver, T. M. Crawford, C. Daley, T. de Haan, K. R. Dibert, M. A. Dobbs, M. Doohan, A. Doussot, D. Dutcher, W. Everett, C. Feng, K. R. Ferguson, N. C. Ferree, A. Foster, S. Galli, A. E. Gambrel, R. W. Gardner, F. Ge, N. Goeckner-Wald, R. Gualtieri, S. Guns, N. W. Halverson, E. Hivon, G. P. Holder, W. L. Holzapfel, J. C. Hood, A. Hryciuk, N. Huang, F. Kéruzoré, L. Knox, M. Korman, K. Kornoelje, C.-L. Kuo, K. Levy, Y. Li, A. E. Lowitz, C. Lu, G. P. Lynch, A. Maniyar, E. S. Martsen, F. Menanteau, M. Millea, J. Montgomery, Y. Nakato, T. Natoli, G. I. Noble, Y. Omori, A. Ouellette, Z. Pan, P. Paschos, K. A. Phadke, A. W. Pollak, K. Prabhu, W. Quan, M. Rahimi, A. Rahlin, C. L. Reichardt, M. Rouble, J. E. Ruhl, E. Schiappucci, A. C. Silva Oliveira, A. Simpson, J. A. Sobrin, A. A. Stark, J. Stephen, C. Tandoi, B. Thorne, C. Trendafilova, C. Umilta, J. D. Vieira, Y. Wan, N. Whitehorn, W. L. K. Wu, M. R. Young, J. A. Zebrowski (SPT-3G Collaboration) The manuscript contains 21 pages, 10 figures, and 4 tables Cosmology and Nongalactic Astrophysics (astro-ph.CO) The South Pole Telescope (SPT), using its third-generation camera, SPT-3G, is conducting observations of the cosmic microwave background (CMB) in temperature and polarization across approximately 10 000 deg$^2$ of the sky at 95, 150, and 220 GHz. This comprehensive dataset should yield stringent constraints on cosmological parameters. In this work, we explore its potential to address the Hubble tension by forecasting constraints from temperature, polarization, and CMB lensing on Early Dark Energy (EDE) and the variation in electron mass in spatially flat and curved universes. For this purpose, we investigate first whether analyzing the distinct SPT-3G observation fields independently, as opposed to as a single, unified region, results in a loss of information relevant to cosmological parameter estimation. We develop a realistic temperature and polarization likelihood pipeline capable of analyzing these fields in these two ways, and subsequently forecast constraints on cosmological parameters. Our findings indicate that any loss of constraining power from analyzing the fields separately is primarily concentrated at low multipoles ($\\ell$ < 50) and the overall impact on the relative uncertainty on standard $\\Lambda$CDM parameters is minimal (< 3%). Our forecasts suggest that SPT-3G data should improve by more than a factor of 300 and 3000 the Figure of Merit (FoM) of the EDE and the varying electron mass models, respectively, when combined with Planck data. The likelihood pipeline developed and used in this work is made publicly available online.",
      "pdf_url": "https://arxiv.org/pdf/2510.24669.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26767",
      "title": "Unbiased Primordial Gravitational Wave Inference from the CMB with SMICA",
      "authors": [
        "Alexander Steier",
        "Shamik Ghosh",
        "Jacques Delabrouille"
      ],
      "abstract": "Unbiased Primordial Gravitational Wave Inference from the CMB with SMICA Alexander Steier, Shamik Ghosh, Jacques Delabrouille 17 pages, 9 figures, submitted to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) The detection of primordial gravitational waves in Cosmic Microwave Background B-mode polarization observations requires accurate and robust subtraction of astrophysical contamination. We show, using a blind Spectral Matching Independent Component Analysis, that it is possible to infer unbiased estimates of the primordial B-mode signal from ground-based observations of a small patch of sky even for highly complex foreground contamination. This work, originally performed in the context of configuration studies for a future CMB-S4 observatory, is highly relevant for the analysis of observations by the current generation of CMB experiments.",
      "pdf_url": "https://arxiv.org/pdf/2510.26767.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.26881",
      "title": "Shooting for the stars: Jet-mode feedback and AGN jet deceleration from stellar mass-loading",
      "authors": [
        "Talia M. O'Shea",
        "Sebastian Heinz",
        "Melinda Soares-Furtado",
        "Zsofi Igo",
        "Andrea Merloni"
      ],
      "abstract": "Shooting for the stars: Jet-mode feedback and AGN jet deceleration from stellar mass-loading Talia M. O'Shea, Sebastian Heinz, Melinda Soares-Furtado, Zsofi Igo, Andrea Merloni 22 pages, 9 figures. Accepted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) AGN jets are thought to be vital ingredients in galaxy evolution through the action of kinetic feedback; however, how narrow, relativistic outflows couple to galaxies remains an open question. Jet deceleration, which is often attributed to the entrainment of material, such as stellar winds, is thought to be necessary for efficient coupling. We present a simple model of jet deceleration due to stellar mass-loading to investigate the energy budget of direct jet feedback in the local Universe. To this end, we produce models of stellar mass-loss, including deriving a prescription for main sequence mass-loss rates as a function of stellar population age. We pair this mass-loss data with a parametric fit for radio AGN incidence, predicting that a majority of jets are decelerated within their hosts, and generally replicate the expected FR-II fraction in LERGs. We calculate that $\\gtrsim$25\\% of the jet power in the local Universe is efficiently decelerated and available for direct feedback within galaxies for any stellar population age. This fraction is largely invariant to the shape of the radio AGN incidence function at low jet Eddington fractions. The stellar mass-loss rate evolves significantly over time, approximately following $\\tau^{-1.1}$, leading to corresponding decreases in decelerated jet power in older stellar populations. Although asymptotic giant branch (AGB) stars dominate mass-loss at all ages, we find that their stochasticity is important in low-mass galaxies, and derive a critical jet power below which main sequence stars alone are sufficient to decelerate the jet.",
      "pdf_url": "https://arxiv.org/pdf/2510.26881.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27007",
      "title": "Revisiting the unification of tidal disruption events with polarimetry",
      "authors": [
        "H. C. I. Wichern",
        "G. Leloudas",
        "M. Pursiainen",
        "A. Cikota",
        "G. K. Jaisawal",
        "P. Charalampopoulos",
        "M. Bulla",
        "L. Dai",
        "J. P. Anderson",
        "M. Gromadzki",
        "C. P. Gutiérrez",
        "T. E. Müller-Bravo",
        "M. Nicholl"
      ],
      "abstract": "Revisiting the unification of tidal disruption events with polarimetry H. C. I. Wichern, G. Leloudas, M. Pursiainen, A. Cikota, G. K. Jaisawal, P. Charalampopoulos, M. Bulla, L. Dai, J. P. Anderson, M. Gromadzki, C. P. Gutiérrez, T. E. Müller-Bravo, M. Nicholl 27 pages, 15 figures. Accepted for publication in A&A on 29/10/2025 High Energy Astrophysical Phenomena (astro-ph.HE) Tidal disruptions of stars by supermassive black holes produce multi-wavelength emission, of which the optical emission is of ambiguous origin. A unification scenario of tidal disruption events (TDEs) has been proposed to explain the different classes of X-ray and optically selected events by introducing a dependence on the viewing angle and geometry. This work aims to test the unification scenario among optically bright TDEs using polarimetry. By studying the optical linear polarisation of 19 TDEs (of which 9 newly analysed in this work), we place constraints on their photosphere geometry, inclination, and the emission process responsible for the optical radiation. We study how these properties correlate with the relative X-ray brightness. We find that 14/16 non-relativistic events can be accommodated by the unification model. Continuum polarisation levels of optical TDEs lie most often in the range P ~ 1-2% (13 events), and for all except one event, remain below 6%. For those optical TDEs that have multi-epoch polarimetry, the continuum polarisation decreases after peak light for 5/10 events, increases for 3/10 events, and stays nearly constant for 2/10 events. When observed after +70 days (7/16 events), they become consistent with P = 0% within uncertainties (5/7 events). This implies the photosphere geometries of TDEs are at least initially asymmetric and evolve rapidly which, if tracing the formation of the accretion disk, suggests efficient circularisation. The polarisation signatures of emission lines of 7 TDEs directly support a scenario in which optical light is reprocessed in an electron-scattering photosphere. [...] However, a subset of events deviates from the unification model to some extent, suggesting this model may not fully capture the diverse behaviour of TDEs. Multi-epoch polarimetry plays a key role in understanding the evolution and emission mechanisms of TDEs.",
      "pdf_url": "https://arxiv.org/pdf/2510.27007.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27399",
      "title": "Simulating the late stages of WD-BH/NS mergers: an origin for fast X-ray transients and GRBs with periodic modulations",
      "authors": [
        "Jun-Ping Chen , Rong-Feng Shen , Jin-Hong Chen SYSU, HKU)"
      ],
      "abstract": "Simulating the late stages of WD-BH/NS mergers: an origin for fast X-ray transients and GRBs with periodic modulations Jun-Ping Chen (1), Rong-Feng Shen (1), Jin-Hong Chen (2) ((1) SYSU, (2) HKU) High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Recent studies indicate that mergers of a white dwarf (WD) with a neutron star (NS) or a stellar-mass black hole (BH) may be a potential progenitor channel for certain merger-kind, but long-duration $\\gamma$-ray bursts (GRBs), e.g., GRBs 230307A and 211211A. The relatively large tidal disruption radius of the WD can result in non-negligible residual orbital eccentricity ($0 \\lesssim e \\lesssim 0.2$), causing episodic mass transfer, i.e., repeated tidal disruptions (RPDs) of the WD. We perform smoothed-particle-hydrodynamics simulations of RPDs in sixteen WD-BH/NS systems, capturing the subsequent mass transfer and accretion. The WD undergoes RPDs near the orbital periastron, modulating the ensuing accretion process, leading to variations of the accretion rate on the orbital period. Across all simulations, the peak accretion rates range from $4 \\times10^{-4}$ to 0.2 $M_{\\odot} \\rm \\ s^{-1}$, while the RPD duration spans from $\\sim$ 10 s to an hour. More compact systems, i.e., those with a higher mass ratio (higher WD mass and lower accretor mass), tend to undergo fewer RPD cycles, resulting in shorter durations and higher accretion rates. If such events can launch relativistic jets, three categories of non-thermal X/$\\gamma$-ray transients are predicted, in decreasing order of their mean accretion rates: (1) an X-ray transient with a simultaneous GRB, both lasting for $10^{1-2}$ s; (2) a longer X-ray transient lasting up to $10^{2-3}$ s that has a GRB appearing only at its later phase ; (3) an ultra-long X-ray transient lasting for $\\sim 10^{3}$ s without a GRB. A generic feature of these transients is that their prompt emission light curves are probably periodically modulated with periods of a few to tens of seconds.",
      "pdf_url": "https://arxiv.org/pdf/2510.27399.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27431",
      "title": "From Shock to Synchrotron: a mini-review on magnetic turbulence in Supernova Remnants",
      "authors": [
        "Emanuele Greco"
      ],
      "abstract": "From Shock to Synchrotron: a mini-review on magnetic turbulence in Supernova Remnants Emanuele Greco Invited mini-review in the Frontiers Research Topic: \"The Role of plasmas and Cosmic Magnetism in High-energy Astroparticle Physics\", accepted for publication High Energy Astrophysical Phenomena (astro-ph.HE) Magnetic turbulence plays a crucial role in confining charged particles near the shock front of Supernova Remnants, enabling them to reach energies up to hundreds of TeV through a process known as Diffusive Shock Acceleration (DSA). These high-energy electrons spiral along magnetic field lines, emitting X-ray synchrotron radiation. The launch of the Imaging X-ray Polarimetry Explorer (IXPE) has opened a new window into the study of magnetic fields in SNRs through X-ray polarization measurements. For the first time, IXPE allows us to resolve the polarization degree (PD) and angle (PA) in the X-ray band across different areas of SNRs, offering direct insight into the geometry and coherence of magnetic fields on different scales. In this mini-review, I summarize the key observational results on SNRs obtained with IXPE over the past four years and discuss their implications for our understanding of magnetic turbulence in synchrotron-emitting regions. I also show how we can combine polarization parameters and standard X-ray spectral/imaging analysis to better constrain the structure and scale of magnetic turbulence immediately downstream of the shock and understand the particle acceleration occurring in SNRs.",
      "pdf_url": "https://arxiv.org/pdf/2510.27431.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27619",
      "title": "Equation-of-state-informed pulse profile modeling",
      "authors": [
        "Mariska Hoogkamer",
        "Nathan Rutherford",
        "Daniela Huppenkothen",
        "Benjamin Ricketts",
        "Anna L. Watts",
        "Melissa Mendes",
        "Isak Svensson",
        "Achim Schwenk",
        "Michael Kramer",
        "Kai Hebeler",
        "Tuomo Salmi",
        "Devarshi Choudhury"
      ],
      "abstract": "Equation-of-state-informed pulse profile modeling Mariska Hoogkamer, Nathan Rutherford, Daniela Huppenkothen, Benjamin Ricketts, Anna L. Watts, Melissa Mendes, Isak Svensson, Achim Schwenk, Michael Kramer, Kai Hebeler, Tuomo Salmi, Devarshi Choudhury High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); Nuclear Theory (nucl-th) NICER has enabled mass-radius inferences for pulsars using pulse profile modeling, providing constraints on the equation of state (EOS) of cold, dense matter. To date, PPM and EOS inference have been carried out as two separate steps, with the former using EOS-agnostic priors. This approach has several drawbacks. Ideally, one would perform a fully hierarchical Bayesian inference where the pulse profile and EOS model parameters are jointly fit, but implementing such a framework is complex and computationally demanding. Here, we present an intermediate solution introducing an EOS-informed prior on mass-radius into the existing PPM pipeline using normalizing flows. By focusing on the parameter space consistent with certain EOSs, this approach both tightens constraints on neutron star parameters while reducing computational costs and requiring minimal additional implementation effort. We test this approach on two pulsars, PSR J0740+6620 and PSR J0437-4715, and with two EOS model families: a model based on the speed of sound inside the neutron star interior (CS) and a piecewise-polytropic (PP) model. Both EOS models implement constraints from chiral effective field theory calculations of dense matter. For both pulsar datasets, the inferred radius credible intervals are narrower than in the EOS-agnostic case, with CS favoring smaller radii and PP favoring larger radii. For PSR J0437-4715, the EOS-informed priors reveal a new, more extreme geometric mode that is statistically favored but physically questionable. Including the PPM posteriors in the subsequent EOS inference further tightens the mass-radius posteriors through the chiral effective field theory constraints. However, there is also a sensitivity to the high-density extensions, where the PP (CS) model produces a shift towards larger (smaller) radii and corresponding stiffening (softening) of the pressure-energy density relation.",
      "pdf_url": "https://arxiv.org/pdf/2510.27619.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "nucl-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27631",
      "title": "SN 2024cld: unveiling the complex mass-loss histories of evolved supergiant progenitors to core collapse supernovae",
      "authors": [
        "T. L. Killestein",
        "M. Pursiainen",
        "R. Kotak",
        "P. Charalampopoulos",
        "J. Lyman",
        "K. Ackley",
        "S. Belkin",
        "D. L. Coppejans",
        "B. Davies",
        "M. J. Dyer",
        "L. Galbany",
        "B. Godson",
        "D. Jarvis",
        "N. Koivisto",
        "A. Kumar",
        "M. Magee",
        "M. Mitchell",
        "D. O'Neill",
        "A. Sahu",
        "B. Warwick",
        "R. P. Breton",
        "T. Butterley",
        "Y.-Z. Cai",
        "J. Casares",
        "V. S. Dhillon",
        "N. Elias-Rosa",
        "M. Fraser",
        "D.K. Galloway",
        "B. Gompertz",
        "M. González-Bañuelos",
        "C. P. Gutiérrez",
        "T. Kangas",
        "E. Kankare",
        "L. Kelsey",
        "T. Kravtsov",
        "G. Leloudas",
        "S.P. Littlefair",
        "K. Matilainen",
        "S. Mattila",
        "T. Nagao",
        "K. Noysena",
        "L. K. Nuttall",
        "P. O'Brien",
        "D. Pollacco",
        "G. Ramsay",
        "A. Reguitti",
        "T. M. Reynolds",
        "I. Salmaso",
        "R. L. C. Starling",
        "D. Steeghs",
        "M. Stritzinger",
        "K. Ulaczyk",
        "G. Valerin",
        "Z.-Y. Wang",
        "R. Wilson"
      ],
      "abstract": "SN 2024cld: unveiling the complex mass-loss histories of evolved supergiant progenitors to core collapse supernovae T. L. Killestein, M. Pursiainen, R. Kotak, P. Charalampopoulos, J. Lyman, K. Ackley, S. Belkin, D. L. Coppejans, B. Davies, M. J. Dyer, L. Galbany, B. Godson, D. Jarvis, N. Koivisto, A. Kumar, M. Magee, M. Mitchell, D. O'Neill, A. Sahu, B. Warwick, R. P. Breton, T. Butterley, Y.-Z. Cai, J. Casares, V. S. Dhillon, N. Elias-Rosa, M. Fraser, D.K. Galloway, B. Gompertz, M. González-Bañuelos, C. P. Gutiérrez, T. Kangas, E. Kankare, L. Kelsey, T. Kravtsov, G. Leloudas, S.P. Littlefair, K. Matilainen, S. Mattila, T. Nagao, K. Noysena, L. K. Nuttall, P. O'Brien, D. Pollacco, G. Ramsay, A. Reguitti, T. M. Reynolds, I. Salmaso, R. L. C. Starling, D. Steeghs, M. Stritzinger, K. Ulaczyk, G. Valerin, Z.-Y. Wang, R. Wilson 21 pages, 19 figures, 2 tables - submitted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Pre-explosion mass loss in supernova (SN) progenitors is a crucial unknown factor in stellar evolution, yet has been illuminated recently by the diverse zoo of interacting transients. We present SN2024cld, a transitional core-collapse SN at a distance of 39 Mpc, straddling the boundary between SN II and SN IIn, showing persistent interaction with circumstellar material (CSM) similar to H-rich SN1998S and PTF11iqb. The SN was discovered and classified just 12h post-explosion via the GOTO-FAST high-cadence program. Optical spectroscopy, photometry, and polarimetry over 220d chart the complex, long-lived interaction in this transient. Early evolution is dominated by CSM interaction, showing a 14d rise to a peak absolute magnitude of g=-17.6 mag, with clear flash-ionisation signatures. SN2024cld also shows a marked double-plateau light curve powered by CSM interaction, with high-velocity (6000 km/s) shoulders on a strong multi-component H-alpha profile. Dense polarimetric coverage reveals marked evolution in the photospheric geometry -- peaking at p=2% 10 days post-explosion, and rotating approx. 60 deg as the ejecta sweep more distant CSM. We observe a narrow 60 km/s H-alpha P Cygni feature throughout, associated with pre-shock CSM. SN2024cld represents among the best-observed 98S-like SNe to date, revealing a multi-component CSM structure: a dense, inner aspherical envelope, CSM disk/torus, and tenuous, extended wind. We propose this SN arose from an evolved supergiant progenitor experiencing multiple mass loss episodes in its terminal years, with binary interaction plausibly generating the CSM disk. SN2024cld constrains the progenitors and mass-loss paradigms of 98S-like SNe, unveiling the chaotic ends of evolved supergiant stars from afar.",
      "pdf_url": "https://arxiv.org/pdf/2510.27631.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.06965",
      "title": "Black Hole Envelopes in Little Red Dots",
      "authors": [
        "Daisaburo Kido",
        "Kunihito Ioka",
        "Kenta Hotokezaka",
        "Kohei Inayoshi",
        "Christopher M. Irwin"
      ],
      "abstract": "Black Hole Envelopes in Little Red Dots Daisaburo Kido, Kunihito Ioka, Kenta Hotokezaka, Kohei Inayoshi, Christopher M. Irwin 10 pages, 5 figures, accepted to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) Recent observations by the James Webb Space Telescope have uncovered a population of compact, red object ($z\\sim 4\\text{--}7$) known as little red dots (LRDs). The presence of broad Balmer emission lines indicates active galactic nuclei powered by supermassive black holes (BHs), while LRDs exhibit unusually weak X-ray and radio emission and low variability, suggesting super-Eddington accretion that obscures the central engine. We suggest that such an extreme accretion disc inevitably drives strong outflows, which would disrupt the LRDs themselves unless confined within the nuclear region -- posing a general feedback problem for overmassive BHs. To resolve this, we propose that the BH is embedded in a massive, optically thick envelope that gravitationally confines the outflow, making any outflow a no-go. This envelope, powered by accretion on to the BH, radiates at nearly the Eddington limit, and is sustained by an infall of the interstellar medium at a rate on the order of $\\sim 1 M_{\\odot}~{\\rm yr}^{-1}$. A photosphere emerges either within the envelope or in the infalling medium, with a characteristic temperature of $5000$ - $7000 {\\rm K}$, near the Hayashi limit. The resulting blackbody emission naturally explains the red optical continuum of the distinct V-shaped spectrum observed in most LRDs. Furthermore, the dynamical time-scale at the photosphere, $\\sim 0.01~{\\rm pc}$, is consistent with the observed year-scale variabilities. The nuclear structure and spectral features of LRDs are shaped by this envelope, which not only regulates feedback but also acts as a gas reservoir that sustains rapid BH growth in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2505.06965.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.10551",
      "title": "Tracing the Physical Lineage of GRB 211211A: Population Constraints on NS-WD Merger Gamma-Ray Bursts",
      "authors": [
        "Xiao-Tian Xu",
        "Bin-Bin Zhang",
        "Yun-Lang Guo",
        "Xiang-Dong Li"
      ],
      "abstract": "Tracing the Physical Lineage of GRB 211211A: Population Constraints on NS-WD Merger Gamma-Ray Bursts Xiao-Tian Xu, Bin-Bin Zhang, Yun-Lang Guo, Xiang-Dong Li accepted by ApJ after adding more details and discussion according to the referee's feedback High Energy Astrophysical Phenomena (astro-ph.HE) The peculiar long gamma-ray burst (GRB) event, GRB 211211A, is known for it is association with a kilonova feature. Whereas most long GRBs are thought to originate in the core collapse of massive stars, the presence of kilonova suggests GRB 211211A was instead produced by a merger of a compact object binary. Building on the interpretation put forward by \\citet{Yang2022Natur.612..232Y}--who argue that GRB 211211A was powered by a massive white-dwarf + neutron-star (WD-NS) merger--we adopt this WD-NS scenario as our observationally supported starting point. If the burst truly originates from that channel, its rarity must mirror the formation and merger rate of WD-NS binaries--a rate still largely unexplored in conventional massive-binary population studies. In this letter, we present a qualitative analysis based on binary evolution physics in order to understand the fraction of GRB 211211A in short GRBs (NS-WD/NS-NS fraction). Since the progenitors of massive WD-NS binaries occupy the initial mass function-preferred regime, where the zero-age main-sequence mass range of the assumed WD mass range (1.2-1.4$\\,M_\\odot$) is comparable to that of NSs, the NS-WD/NS-NS fraction emerging from our standard evolutionary path is expected to be $\\sim$14--37\\%, far higher than the observed fraction ($\\sim5$\\%). This discrepancy might imply a large, still-unidentified population of GRB 211211A-like events or an unusual origin of the NS-such as being hypernova-born or accretion-induced-collapse-born. Placing these results in a broader compact-binary context, implications for black-hole systems are also discussed.",
      "pdf_url": "https://arxiv.org/pdf/2508.10551.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26561",
      "title": "A Star's Death by a Thousand Cuts: The Runaway Periodic Eruptions of AT2023uqm",
      "authors": [
        "Yibo Wang",
        "Tingui Wang",
        "Shifeng Huang",
        "Jiazheng Zhu",
        "Ning Jiang",
        "Wenbin Lu",
        "Rongfeng Shen",
        "Shiyan Zhong",
        "Dong Lai",
        "Yi Yang",
        "Xinwen Shu",
        "Tianyu Xia",
        "Di Luo",
        "Jianwei Lyu",
        "Thomas Brink",
        "Alex Filippenko",
        "Weikang Zheng",
        "Minxuan Cai",
        "Zelin Xu",
        "Mingxin Wu",
        "Xiaer Zhang",
        "Weiyu Wu",
        "Lulu Fan",
        "Ji-an Jiang",
        "Xu Kong",
        "Bin Li",
        "Feng Lin",
        "Ming Liang",
        "Wentao Luo",
        "Jinlong Tang",
        "Zhen Wan",
        "Hairen Wang",
        "Jian Wang",
        "Yongquan Xue",
        "Dazhi Yao",
        "Hongfei Zhang",
        "Wen Zhao",
        "Xianzhong Zheng",
        "Qingfeng Zhu",
        "Yingxi Zuo"
      ],
      "abstract": "A Star's Death by a Thousand Cuts: The Runaway Periodic Eruptions of AT2023uqm Yibo Wang, Tingui Wang, Shifeng Huang, Jiazheng Zhu, Ning Jiang, Wenbin Lu, Rongfeng Shen, Shiyan Zhong, Dong Lai, Yi Yang, Xinwen Shu, Tianyu Xia, Di Luo, Jianwei Lyu, Thomas Brink, Alex Filippenko, Weikang Zheng, Minxuan Cai, Zelin Xu, Mingxin Wu, Xiaer Zhang, Weiyu Wu, Lulu Fan, Ji-an Jiang, Xu Kong, Bin Li, Feng Lin, Ming Liang, Wentao Luo, Jinlong Tang, Zhen Wan, Hairen Wang, Jian Wang, Yongquan Xue, Dazhi Yao, Hongfei Zhang, Wen Zhao, Xianzhong Zheng, Qingfeng Zhu, Yingxi Zuo Submitted. Comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) Stars on bound orbits around a supermassive black hole may undergo repeated partial tidal disruption events (rpTDEs), producing periodic flares. While several candidates have been suggested, definitive confirmation of these events remains elusive. We report the discovery of AT2023uqm, a nuclear transient that has exhibited at least five periodic optical flares, making it only the second confirmed case of periodicity after ASASSN-14ko. Uniquely, the flares from AT2023uqm show a nearly exponential increase in energy--a \"runaway\" phenomenon signaling the star's progressive destruction. This behavior is consistent with rpTDEs of low-mass, main-sequence stars or evolved giant stars. Multiwavelength observations and spectroscopic analysis of the two most recent flares reinforce its interpretation as an rpTDE. Intriguingly, each flare displays a similar double-peaked structure, potentially originating from a double-peaked mass fallback rate or two discrete collisions per orbit. The extreme ratio of peak separation to orbital period draws attention to the possibility of a giant star being disrupted, which could be distinguished from a low-mass main-sequence star by its future mass-loss evolution. Our analysis demonstrates the power of rpTDEs to probe the properties of disrupted stars and the physical processes of tidal disruption, though it is currently limited by our knowledge of these events. AT2023uqm emerges as the most compelling rpTDE thus far, serving as a crucial framework for modeling and understanding these phenomena.",
      "pdf_url": "https://arxiv.org/pdf/2510.26561.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26666",
      "title": "The 2024 July 16 Solar Event: A Challenge To The Coronal Mass Ejection Origin Of Long-Duration Gamma-Ray Flares",
      "authors": [
        "Alessandro Bruno",
        "Melissa Pesce-Rollins",
        "Silvia Dalla",
        "Nicola Omodei",
        "Ian G. Richardson",
        "James M. Ryan"
      ],
      "abstract": "The 2024 July 16 Solar Event: A Challenge To The Coronal Mass Ejection Origin Of Long-Duration Gamma-Ray Flares Alessandro Bruno, Melissa Pesce-Rollins, Silvia Dalla, Nicola Omodei, Ian G. Richardson, James M. Ryan Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We present a multi-spacecraft analysis of the 2024 July 16 Long-Duration Gamma-Ray Flare (LDGRF) detected by the Large Area Telescope on the Fermi satellite. The measured >100 MeV $\\gamma$-ray emission persisted for over seven hours after the flare impulsive phase, and was characterized by photon energies exceeding 1 GeV and a remarkably-hard parent-proton spectrum. In contrast, the phenomena related to the coronal mass ejection (CME)-driven shock linked to this eruption were modest, suggesting an inefficient proton acceleration unlikely to achieve the energies well-above the 300 MeV pion-production threshold to account for the observed $\\gamma$-ray emission. Specifically, the CME was relatively slow (~600 km/s) and the accompanying interplanetary type-II/III radio bursts were faint and short-duration, unlike those typically detected during large events. In particular, the type-II emission did not extend to kHz frequencies and disappeared ~5.5 hours prior to the LDGRF end time. Furthermore, the associated solar energetic particle (SEP) event was very weak, short-duration, and limited to a few tens of MeV, even at magnetically well-connected spacecraft. These findings demonstrate that a very-fast CME resulting in a high-energy SEP event is not a necessary condition for the occurrence of LDGRFs, challenging the idea that the high-energy $\\gamma$-ray emission is produced by the back-precipitation of shock-accelerated ions into the solar surface. The alternative origin scenario based on local particle trapping and acceleration in large-scale coronal loops is instead favored by the observation of giant arch-like structures of hot plasma over the source region persisting for the entire duration of this LDGRF.",
      "pdf_url": "https://arxiv.org/pdf/2510.26666.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26774",
      "title": "Compact Accretion Disks in the Aftermath of Tidal Disruption Events: Parameter Inference from Joint X-ray Spectra and UV/Optical Photometry Fitting",
      "authors": [
        "M. Guolo",
        "A. Mummery",
        "S. van Velzen",
        "S. Gezari",
        "M. Nicholl",
        "Y. Yao",
        "M. Karmen",
        "Y. Ajay",
        "T. Wevers",
        "N. LeBaron",
        "R. Chornock"
      ],
      "abstract": "Compact Accretion Disks in the Aftermath of Tidal Disruption Events: Parameter Inference from Joint X-ray Spectra and UV/Optical Photometry Fitting M. Guolo, A. Mummery, S. van Velzen, S. Gezari, M. Nicholl, Y. Yao, M. Karmen, Y. Ajay, T. Wevers, N. LeBaron, R. Chornock Submitted to ApJ. 25 Pages, 14 Fig, + Appendix High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We present a multi-wavelength analysis of 14 tidal disruption events (TDEs)-including an off-nuclear event associated with an ultra-compact dwarf galaxy-selected for having available thermal X-ray spectra during their late-time UV/optical plateau phase. We show that at these stages, the full spectral energy distribution - X-ray spectra and UV/optical photometry - is well described by a compact, yet standard accretion disk, the same disk which powers the X-rays at all times. By fitting up to three epochs per source with a fully relativistic disk model, we show that many system properties can be reliably recovered, including importantly the black hole mass ($M_{\\bullet}$). These accretion-based $M_{\\bullet}$ values, which in this sample span nearly three orders of magnitude, are consistent with galactic scaling relations but are significantly more precise (68\\% credible interval $ < \\pm 0.3$ dex) and physically motivated. Expected accretion scaling relations (e.g., $L_{Bol}^{ disk} / L_{Edd} \\propto T_p^4 \\propto M_{\\bullet}^{-1}$), TDE-specific physics correlations ($L_{plat} \\propto M_{\\bullet}^{2/3}$ and $R_{out}/r_g \\propto M_{\\bullet}^{-2/3}$) and black hole-host galaxy correlations ($M_{\\bullet}$-$M_{gal}$ and $M_{\\bullet}$-$\\sigma_{\\star}$) naturally emerge from the data and, for the first time, are self-consistently extended into the intermediate-mass (IMBH, $M_{\\bullet} < 10^{5}$) regime. We discuss the implications of these results for TDE physics and modeling. We also review and discuss different methods for $M_{\\bullet}$ inference in TDEs, and find that approaches based on physical models of the early-time UV/optical emission are not able to recover (at a statistically significant level) black hole-host galaxy scalings.",
      "pdf_url": "https://arxiv.org/pdf/2510.26774.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20828",
      "title": "A Classification Scheme for X-ray Bright Type Ia Supernova Remnants Based on Their Circumstellar Interaction",
      "authors": [
        "Travis Court",
        "Carles Badenes",
        "Shiu-Hang Lee",
        "Daniel Patnaude",
        "Eduardo Bravo"
      ],
      "abstract": "A Classification Scheme for X-ray Bright Type Ia Supernova Remnants Based on Their Circumstellar Interaction Travis Court, Carles Badenes, Shiu-Hang Lee, Daniel Patnaude, Eduardo Bravo 20 pages, 10 figures, title changed and other minor changes after review, accepted by AAS journals Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The parameter space for mass loss in Type Ia supernova progenitors is large, with different progenitor scenarios favoring different mass loss regimes. Here we focus on the impact that uniform and isotropic outflows have on the circumstellar environment of Type Ia supernova progenitors. We vary mass loss rate, wind velocity, and outflow duration, and evolve supernova remnant (SNR) models in this grid of circumstellar structures in order to compare the bulk properties of these models (ages, radii, and \\feka\\ centroids and luminosities) to observations. We find that roughly 55\\% (7/13) of young X-ray bright Type Ia SNRs in the Milky Way and the Large Magellanic Cloud had progenitors that did not substantially modify their surroundings on $\\sim$pc scales. This group includes SN Ia with a range of luminosities, and at least one likely product of a double detonation explosion in a sub-Chandrasekhar white dwarf. The other half of our sample can be divided in two distinct classes. A small subset of SNRs ($\\sim$15\\%, 2/13) have large radii and low \\feka\\ centroids and are likely expanding into large cavities that might have been excavated by fast ($\\sim$1000 km/s), sustained progenitor outflows. The majority of the SNRs that are expanding into a modified medium ($\\sim30\\%$, 4/13) show evidence for dense material, likely associated with slow ($\\sim$10 km/s) progenitor outflows, possibly a byproduct of accretion processes in near-Chandrasekhar white dwarfs spawned by younger stellar populations.",
      "pdf_url": "https://arxiv.org/pdf/2507.20828.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26875",
      "title": "Disk Formation and the Size-sSFR Relation of Dwarf Galaxies",
      "authors": [
        "Robel Geda",
        "Akaxia Cruz",
        "Anna C. Wright",
        "Jenny E. Greene",
        "Alyson Brooks",
        "Thomas Quinn",
        "James Wadsley",
        "Ben Keller"
      ],
      "abstract": "Disk Formation and the Size-sSFR Relation of Dwarf Galaxies Robel Geda, Akaxia Cruz, Anna C. Wright, Jenny E. Greene, Alyson Brooks, Thomas Quinn, James Wadsley, Ben Keller Astrophysics of Galaxies (astro-ph.GA) Dwarf galaxies are dark matter-dominated systems that are sensitive to feedback and display a diversity of baryonic morphologies. This makes them excellent probes for understanding dark matter and galaxy evolution. This work investigates the physical processes that influence the sizes of isolated dwarf galaxies using high-resolution cosmological zoom-in simulations of $39$ dwarf galaxies drawn from the Marvelous Massive Dwarfs simulation suite ($7.5 < \\log(M_{\\star}/M_{\\odot}) < 9.1$). Our simulations show that dwarf galaxies initially form as compact galaxies ($R_e < 2$ kpc). However, several of these galaxies ($54\\%$) experience periods of gradual size growth at relatively stable sSFR, allowing them to become extended galaxies. We find that the growth of rotation-supported stellar disks is the primary means by which isolated dwarfs become extended in size. These stellar disks are formed by mergers with high orbital angular momentum satellites on high angular momentum (spiraling-in) orbits, which spin up the gas surrounding the central galaxy and contribute $\\approx 30 \\%$ of the cold gas mass at $z=0$. For these systems, star formation in the angular momentum supported gas and the gradual build up of stars in the disk result in secular size growth.",
      "pdf_url": "https://arxiv.org/pdf/2510.26875.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26877",
      "title": "Metallicity Gradients in Modern Cosmological Simulations II: The Role of Bursty Versus Smooth Feedback at High-Redshift",
      "authors": [
        "Alex M. Garcia",
        "Paul Torrey",
        "Aniket Bhagwat",
        "Xuejian Shen",
        "Mark Vogelsberger",
        "William McClymont",
        "Jaya Nagarajan-Swenson",
        "Sophia G. Ridolfo",
        "Peixin Zhu",
        "Dhruv T. Zimmerman",
        "Oliver Zier",
        "Sarah Biddle",
        "Arnab Sarkar",
        "Priyanka Chakraborty",
        "Ruby J. Wright",
        "Kathryn Grasha",
        "Tiago Costa",
        "Laura Keating",
        "Rahul Kannan",
        "Aaron Smith",
        "Enrico Garaldi",
        "Ewald Puchwein",
        "Benedetta Ciardi",
        "Lars Hernquist",
        "Lisa J. Kewley"
      ],
      "abstract": "Metallicity Gradients in Modern Cosmological Simulations II: The Role of Bursty Versus Smooth Feedback at High-Redshift Alex M. Garcia, Paul Torrey, Aniket Bhagwat, Xuejian Shen, Mark Vogelsberger, William McClymont, Jaya Nagarajan-Swenson, Sophia G. Ridolfo, Peixin Zhu, Dhruv T. Zimmerman, Oliver Zier, Sarah Biddle, Arnab Sarkar, Priyanka Chakraborty, Ruby J. Wright, Kathryn Grasha, Tiago Costa, Laura Keating, Rahul Kannan, Aaron Smith, Enrico Garaldi, Ewald Puchwein, Benedetta Ciardi, Lars Hernquist, Lisa J. Kewley 16 pages, 6 figures, comments welcome. See also Paper I of series arXiv.2503.03804 Astrophysics of Galaxies (astro-ph.GA) The distribution of gas-phase metals within galaxies encodes the impact of stellar feedback on galactic evolution. At high-redshift, when galaxies are rapidly assembling, feedback-driven outflows and turbulence can strongly reshape radial metallicity gradients. In this work, we use the FIRE-2, SPICE, Thesan and Thesan Zoom cosmological simulations -- spanning a range of stellar feedback from bursty (time-variable) to smooth (steady) -- to investigate how these feedback modes shape gas-phase metallicity gradients at $3<z\\lesssim11$. Across all models, we find that galaxies with bursty feedback (FIRE-2, SPICE Bursty, and Thesan Zoom) develop systematically flatter (factors of $\\sim2-10$) metallicity gradients than those with smooth feedback (SPICE Smooth and Thesan Box), particularly at stellar masses $M_\\star > 10^{9}~{\\rm M_\\odot}$. These results demonstrate that bursty stellar feedback provides sufficient turbulence to prevent strong negative gradients from forming, while smooth stellar feedback does not generically allow for efficient radial redistribution of metals thereby keeping gradients steep. Finally, we compare with recent observations, finding that the majority -- but, notably, not all -- of the observed gradients may favor a bursty stellar feedback scenario. In all, these results highlight the utility of high-resolution observations of gas-phase metallicity at high-redshift as a key discriminator of these qualitatively different feedback types.",
      "pdf_url": "https://arxiv.org/pdf/2510.26877.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26884",
      "title": "Constraining the AGN tori at cosmic noon using high-resolution JWST imaging and simultaneous SED fitting",
      "authors": [
        "Devang H. Liya",
        "David J. Rosario",
        "Matthaios Charidis"
      ],
      "abstract": "Constraining the AGN tori at cosmic noon using high-resolution JWST imaging and simultaneous SED fitting Devang H. Liya, David J. Rosario, Matthaios Charidis Accepted for publication in MNRAS, 21 pages (27 including appendix and bibliography), 13 figures (15 including figures in appendix) Astrophysics of Galaxies (astro-ph.GA) There is evidence for significant evolution in the gaseous and dust properties of galaxies since the era of cosmic noon ($1\\lesssim z\\lesssim 2.5$). The well known co-evolution of supermassive black holes with their host galaxies suggests a constant connection between the small-scale (nuclear) and large-scale regions of galaxies. A fundamental component of Active Galactic Nuclei (AGN) is the \"torus\", a dense, dusty structure that acts as the interface between the accretion disc and the ISM of the host galaxy. The transitional nature of the torus makes it a prime subject to search for evolution since cosmic noon. We use high-resolution near- and mid-IR imaging from the JWST CEERS program to disentangle the emission from the torus in unprecedented detail for 88 X-ray selected AGN at $z\\sim2$. We employ a novel SED fitting technique that combines archival low-resolution multi-band photometry at UV to FIR wavelengths with the new high-resolution JWST photometry to constrain essential AGN and torus parameters, such as accretion disc luminosity, torus opening angle, and inclination angle. We demonstrate that this SED fitting approach leads to better AGN characterisation and tighter constraints on AGN parameters. The population-level analysis finds that the Covering Fraction ($CF$) distribution peaks at $\\approx0.25$ with a long tail towards higher $CF$. Despite the well-known evolution of the ISM and structural properties of AGN hosts to these redshifts, the $CF$ distribution of our sample does not show any strong statistical difference with that found in local AGN of equivalent luminosity, or with those at intermediate redshifts.",
      "pdf_url": "https://arxiv.org/pdf/2510.26884.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26889",
      "title": "Galaxy Luminosity Function of the Coma Cluster from Deep $u'-g'-r'$ Wendelstein Imaging Data",
      "authors": [
        "Raphael Zöller",
        "Matthias Kluge",
        "Ralf Bender",
        "Jan-Niklas Pippert",
        "Benjamin Seidel",
        "Claus Gössl",
        "Ulrich Hopp",
        "Hanna Kellermann",
        "Christoph Ries",
        "Arno Riffeser",
        "Michael Schmidt",
        "Luis Thomas"
      ],
      "abstract": "Galaxy Luminosity Function of the Coma Cluster from Deep $u'-g'-r'$ Wendelstein Imaging Data Raphael Zöller, Matthias Kluge, Ralf Bender, Jan-Niklas Pippert, Benjamin Seidel, Claus Gössl, Ulrich Hopp, Hanna Kellermann, Christoph Ries, Arno Riffeser, Michael Schmidt, Luis Thomas 25 pages, 16 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) We derive the $g'$ band galaxy luminosity function (GLF) of quenched red sequence in the Coma cluster from a deep-imaging survey with $\\approx1.5\\,\\mathrm{deg^2}$ around the cluster center. The dataset comprises deep $u'$-, $g'$-, and $r'$-band data obtained with the Wendelstein Wide Field Imager on the 2.1\\,m Fraunhofer Wendelstein Telescope reaching median $3\\sigma$ surface brightness limits in $10\"\\times10\"$ boxes of $\\mathrm{ (30.0\\,u',\\,\\,29.6\\,g',\\,\\,28.7\\,r')\\,mag\\,arcsec^{-2}}$. We measure structural parameters across a large dynamic range in galaxy brightness ($-24.5\\,g'\\,\\mathrm{mag} \\lessapprox M\\lessapprox-11.3\\,g'\\,\\mathrm{mag}$), from the brightest cluster galaxy to low-luminosity dwarfs, including compact dwarf galaxies and ultra-diffuse galaxies. We automatically identify 5161 cluster member candidates based on their membership on the quiescent sequence in the $u'-g'$ versus $g'-r'$ color--color diagram and their red sequence membership. The structural parameters of bright galaxies are obtained via isophotal modeling, and fully automated parametric image fitting for faint ones. Injection-recovery tests and two identically analyzed reference fields provide statistical corrections for completeness and contamination, yielding a representative GLF that reliably probes the faint end and may serve as a benchmark for future studies. We report a best-fit double Schechter $g'$ band GLF with a comparatively steep faint-end slope $\\alpha_2=-1.539^{+0.024}_{-0.024}$. We perform an apples-to-apples comparison with the Coma counterpart in the SLOW simulations, finding overall agreement but a deficit of bright and an excess of dwarf galaxies in the simulation, despite its shallower faint-end slope, highlighting the need for true apples-to-apples comparisons that consider both normalization and slope for a consistent interpretation of the GLF.",
      "pdf_url": "https://arxiv.org/pdf/2510.26889.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26952",
      "title": "Identifying substructure associations in the Milky Way halo using chemo-kinematic tagging",
      "authors": [
        "Kris Youakim",
        "Karin Lind"
      ],
      "abstract": "Identifying substructure associations in the Milky Way halo using chemo-kinematic tagging Kris Youakim, Karin Lind 24 pages, 7 figures, 4 tables, accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The Milky Way halo has been built-up over cosmic time through the accretion and dissolution of star clusters and dwarf galaxies as well as through their complex interactions with the Galactic disc. Traces of these accreted structures persist to the present day in the chemical and kinematic properties of stars and their orbits and allow for the disentangling of the accretion history of the Galaxy through observations of Milky Way stars. We utilised 6D phase-space information in combination with [Fe/H] measurements to facilitate a clustering analysis of stars using their kinematics and chemistry simultaneously, a technique known as chemo-kinematic tagging. Using t-distributed stochastic neighbour embedding (t-SNE), we performed dimensionality reduction and identify stars from clusters and streams that are co-localised in the kinematic and chemical parameter space. We included E, Jr, Jz, Lz, r_apo, r_peri, and eccentricity as well as [Fe/H] as input into the algorithm, and used a sample of 5347 stars from 229 individual Milky Way substructures compiled from various sources in the literature. Most notably, we recovered several large-scale structures that have been reported in the literature, including GSE, Thamnos, Sequoia, I'itoi, LMS-1/Wukong, Sagittarius, Kraken/Koala, the splashed disc, and a candidate structure recently found in another work. We find that 44\\% of Milky Way globular clusters are consistent with having an accreted origin. We also find that the chemo-dynamic properties of omega cen are consistent with a common accretion with the Thamnos structure. In addition, we identified many stream-progenitor associations, most notably a connection between the Orphan-Chenab stream and the Grus II ultra-faint dwarf galaxy, which supports previous findings that these two objects were brought into the Galaxy in the same accretion event.",
      "pdf_url": "https://arxiv.org/pdf/2510.26952.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26970",
      "title": "A Critical Examination of the PAH Hypothesis",
      "authors": [
        "Alan T. Tokunaga",
        "Lawrence S. Bernstein",
        "Takashi Onaka"
      ],
      "abstract": "A Critical Examination of the PAH Hypothesis Alan T. Tokunaga, Lawrence S. Bernstein, Takashi Onaka accepted for publication by MNRAS Astrophysics of Galaxies (astro-ph.GA) The polycyclic aromatic hydrocarbon (PAH) hypothesis proposes that the aromatic infrared bands (AIBs) observed at 3.3, 6.2, 7.7, 8.6, 11.3, and 12.7 mic originate from gas-phase PAH molecules. These bands exhibit consistent peak wavelengths and profiles in diverse sources, and ISO SWS and JWST spectra show a nearly identical red wing of the 3.3 mic AIB and blue wing of the 11.2 mic AIB in the dominant Class A sources. This spectral uniformity suggests that the AIBs arise from a small, well-defined set of gas phase PAH species, regardless of the excitation conditions or the nature of the source such as HII regions, reflection nebulae, planetary nebula, young stellar objects, or the diffuse interstellar medium. However, a small number of gas phase PAH species is inconsistent with current modeling of the AIBs that require a wide range of PAH types and sizes. It is also inconsistent with the lack of observed UV and optical absorption bands from gas phase PAH molecules. Furthermore, there is no plausible formation pathway to produce only a small number of specific PAH molecules in the interstellar medium. These issues require quantitative investigation in order to definitively establish gas-phase PAH molecules as the carrier of the AIBs.",
      "pdf_url": "https://arxiv.org/pdf/2510.26970.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26976",
      "title": "Connecting Star Formation in the Milky Way and Nearby Galaxies. I. Comparability of Molecular Cloud Physical Properties",
      "authors": [
        "J. W. Zhou",
        "Sami Dib"
      ],
      "abstract": "Connecting Star Formation in the Milky Way and Nearby Galaxies. I. Comparability of Molecular Cloud Physical Properties J. W. Zhou, Sami Dib accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We used CO (2-1) and CO (1-0) data cubes to identify molecular clouds and study their kinematics and dynamics in three nearby galaxies and the inner Milky Way. When observed at similar spatial and velocity resolutions, molecular clouds in the same mass range across these galaxies show broadly comparable physical properties and similar star formation rates (SFRs). However, this comparability depends on smoothing Milky Way clouds to match the resolution of the extragalactic observations. The beam effect can artificially inflate cloud sizes, leading to inaccurate estimates of radius, density, and virial parameters. By comparing high-resolution and smoothed Milky Way data, we established criteria to exclude beam-affected clouds in the extragalactic sample. After applying this filter, cloud properties remain consistent across galaxies, though some clouds in NGC 5236 show elevated velocity dispersions, likely due to environmental effects. In the inner Milky Way, molecular clouds fall into two groups: those with clumps and those without. Clump-associated clouds are more massive, denser, have higher velocity dispersions, lower virial parameters, and stronger 8~\\(\\mu\\)m emission, suggesting more intense feedback. Strong correlations are found between cloud mass and total clump mass, clump number, and the mass of the most massive clump. These results suggest that a cloud's physical conditions regulate its internal clump properties and, in turn, its star-forming potential.",
      "pdf_url": "https://arxiv.org/pdf/2510.26976.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26979",
      "title": "Supplementing the 2MRS survey: The 2MZoA catalogue",
      "authors": [
        "A. C. Schröder"
      ],
      "abstract": "Supplementing the 2MRS survey: The 2MZoA catalogue A. C. Schröder 15 pages, 14 figures; accepted by A&A; electronic versions of the catalogue and other tables are available through CDS or by request from the main author Astrophysics of Galaxies (astro-ph.GA) We present a homogeneous 2MASX galaxy catalogue at low Galactic latitudes (|b| <= 10.0 deg, called Zone of Avoidance, ZoA) which is complete to a Galactic extinction-corrected magnitude of Ko <= 11.75 mag. Also included are galaxies at higher latitudes in areas of high foreground extinctions (E(B-V) > 0.95). This catalogue supersedes the previously presented bright 2MZoA catalogue which was only complete to Ko < 11.25 mag. It fully complements the 2MASS Redshift Survey (2MRS) galaxy catalogue, which has the same magnitude limit but excludes high extinction regions. The combination of the two catalogues, the extended 2MRS or e2MRS, is is a uniquely whole sky redshift survey and forms a sound basis for studies of large-scale structures, flow fields and extinction across the ZoA. The here presented catalogue comprises 6899 galaxies with 6757 galaxies at low latitudes and 142 galaxies in highly obscured high-latitude areas. The completion rate in redshifts is almost 75%. The catalogue is complete up to star density levels of at least log N_*/deg^2 < 4.3, but the completion rate of the fainter part is affected by foreground extinction at all levels. This can be rectified by using a diameter-dependent extinction correction, adding 1083 highly obscured but apparently faint galaxies (with Ko > 11.75 mag and Ko,d <= 11.75 mag) to the sample. This extended sample shows good completion rates with extinction up to at least AK < 1.3 mag. Omission of such a diameter-dependent extinction correction may lead to a biased flow field even at intermediate extinction values as found in the 2MRS survey. As in our previous investigations, we do not find a dependence of the correction factor f=0.86 to the extinction maps on Galactic longitudes or latitudes, but note a possible influence by cosmic variance.",
      "pdf_url": "https://arxiv.org/pdf/2510.26979.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26990",
      "title": "Faint active galactic nuclei supplied 31-75% of hydrogen-ionizing photons at z>5",
      "authors": [
        "Mainak Singha",
        "Sangeeta Malhotra",
        "James Ely Rhoads"
      ],
      "abstract": "Faint active galactic nuclei supplied 31-75% of hydrogen-ionizing photons at z>5 Mainak Singha, Sangeeta Malhotra, James Ely Rhoads Submitted to ApJ. Comments are welcome Astrophysics of Galaxies (astro-ph.GA) The origin of the ionizing photons that completed hydrogen reionization remains debated. Using recent JWST and ground-based surveys at 4.5 <= z <= 6.5, we construct a unified rest-UV AGN luminosity function that separates unobscured Type I and obscured Type II populations, and show that \"little red dots\" and X-ray selected sources are magnitude-filtered subsets of Type I with a mixture fraction eta = 0.10 +/- 0.02. We anchor the Lyman-continuum (LyC) escape fraction to outflow incidence and geometric clearing rather than assuming quasar-like values for all classes, and propagate uncertainties through a joint fit. Integrating over -27 < M_UV < -17, AGN inject Ndot_ion,AGN = (3.77 +1.08/-0.95) x 10^51 s^-1 Mpc^-3, nearly twice earlier estimates and comparable to the Ly-alpha inferred requirement at z ~ 6. When combined with the JWST galaxy UV luminosity function and a harder stellar ionizing efficiency of log10(xi_ion) = 25.7, AGN contribute 31-75% of the total ionizing photons for representative galaxy escape fractions f_esc,gal = 0.03-0.20. The resulting hydrogen photoionization rate, Gamma_HI ~ (0.5-2) x 10^-12 s^-1 at z ~ 5-6, lies squarely within the Ly-alpha forest constraints once mean free paths and IGM clumpiness are accounted for, remaining consistent for combined AGN-galaxy models up to f_esc,gal <= 5%. These results suggest that AGN and galaxies jointly sustained the ionizing background during the final stages of reionization, with AGN remaining a major but not exclusive contributor.",
      "pdf_url": "https://arxiv.org/pdf/2510.26990.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27019",
      "title": "Baryonic Masses and Properties of Gaseous Satellite Galaxies",
      "authors": [
        "Jingyao Zhu",
        "Yasmeen Asali",
        "Mary Putman",
        "Tobias Westmeier",
        "W.J.G de Blok",
        "Barbara Catinella",
        "Nathan Deg",
        "Bi-Qing For",
        "Dane Kleiner",
        "Karen Lee-Waddell",
        "Filippo Maccagni",
        "D.J. Pisano",
        "Austin X. Shen",
        "Kristine Spekkens",
        "Lister Staveley-Smith"
      ],
      "abstract": "Baryonic Masses and Properties of Gaseous Satellite Galaxies Jingyao Zhu, Yasmeen Asali, Mary Putman, Tobias Westmeier, W.J.G de Blok, Barbara Catinella, Nathan Deg, Bi-Qing For, Dane Kleiner, Karen Lee-Waddell, Filippo Maccagni, D.J. Pisano, Austin X. Shen, Kristine Spekkens, Lister Staveley-Smith Submitted to AAS journals. Comments welcome Astrophysics of Galaxies (astro-ph.GA) We present a sample of 127 gas-bearing dwarf galaxies around 56 late-type host galaxies within 30 Mpc using 21-cm HI data from the WALLABY, MHONGOOSE, and ALFALFA surveys. We characterize the environment of each dwarf galaxy based on its host galaxy halo and derive optical properties using the DESI Legacy Surveys for 110. The gaseous satellites span $\\log (M_{\\rm HI}/M_{\\odot}) = 5.7-9.7$ and $\\log (M_{\\star}/M_{\\odot}) = 5.6-10.0$, with a median velocity line-width of $W_{50}=37$ km/s, comparable to the Local Group gaseous dwarf galaxies. We assess the HI mass sensitivity of the data by injecting model dwarf galaxies and find $M_{\\rm HI,lim} = 10^{6.7} M_{\\odot}$ for WALLABY and $M_{\\rm HI,lim} = 10^{5.4} M_{\\odot}$ for MHONGOOSE at 10 Mpc. With this sensitivity, our sample shows lower average gas-to-stellar mass ratios ($M_{\\rm HI}/M_{\\star}$) than literature dwarf galaxy samples. The abundance of gaseous satellites per host is low and increases with host mass: $0-2$ for isolated dwarf galaxy hosts and $0-5$ for Milky Way-mass spiral hosts. These numbers are consistent with the Milky Way, M31, and star-forming satellite abundances from recent deep optical surveys. The inferred quenched fractions and gas-depleted satellites indicate that environmental quenching is effective in Milky Way-mass hosts, likely driven by gas stripping processes.",
      "pdf_url": "https://arxiv.org/pdf/2510.27019.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27036",
      "title": "Quantifying Spectroscopic Flux Variations Between JWST NIRISS and NIRSpec: Slit Losses in Emission Line Measurements of z$\\sim$1-3 Galaxies",
      "authors": [
        "Nicolò Dalmasso",
        "Peter J. Watson",
        "Tommaso Treu",
        "Michele Trenti",
        "Benedetta Vulcani",
        "Themiya Nanayakkara",
        "Maruša Bradač",
        "Tucker Jones",
        "Kristan Boyett",
        "Xin Wang",
        "Sara Mascia",
        "Laura Pentericci"
      ],
      "abstract": "Quantifying Spectroscopic Flux Variations Between JWST NIRISS and NIRSpec: Slit Losses in Emission Line Measurements of z$\\sim$1-3 Galaxies Nicolò Dalmasso, Peter J. Watson, Tommaso Treu, Michele Trenti, Benedetta Vulcani, Themiya Nanayakkara, Maruša Bradač, Tucker Jones, Kristan Boyett, Xin Wang, Sara Mascia, Laura Pentericci Published on MNRAS-Monthly Notices of the Royal Astronomical Society; 11 pages, 8 figures, 2 tables Astrophysics of Galaxies (astro-ph.GA); Instrumentation and Methods for Astrophysics (astro-ph.IM) We analyze JWST NIRISS and NIRSpec spectroscopic observations in the Abell 2744 galaxy cluster field. From approximately 120 candidates, we identify 12 objects with at least a prominent emission lines among \\Oii, \\Hb, \\Oiiia, \\Oiiib, and \\Ha that are spectroscopically confirmed by both instruments. Our key findings reveal systematic differences between the two spectrographs based on source morphology and shutter aperture placement. Compact objects show comparable or higher integrated flux in NIRSpec relative to NIRISS (within 1$\\sigma$ uncertainties), while extended sources consistently display higher flux in NIRISS measurements. This pattern reflects NIRSpec's optimal coverage for compact objects while potentially undersampling extended sources. Quantitative analysis demonstrates that NIRSpec recovers at least $63\\%$ of NIRISS-measured flux when the slit covers $>15\\%$ of the source or when $R_e<1$kpc. For lower coverage or larger effective radii, the recovered flux varies from $24\\%$ to $63\\%$. When studying the \\Ha/\\Oiiib emission line ratio, we observe that measurements from these different spectrographs can vary by up to $\\sim$0.3 dex, with significant implications for metallicity and star formation rate characterizations for individual galaxies. These results highlight the importance of considering instrumental effects when combining multi-instrument spectroscopic data and demonstrate that source morphology critically influences flux recovery between slit-based and slitless spectroscopic modes in JWST observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.27036.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27214",
      "title": "AGN--Host Galaxy Image Decomposition with JWST",
      "authors": [
        "Callum Dewsnap , Pauline Barmby , Sarah C. Gallagher Department of Physics &amp; Astronomy, The University of Western Ontario, Institute for Earth &amp; Space Exploration, The University of Western University)"
      ],
      "abstract": "AGN--Host Galaxy Image Decomposition with JWST Callum Dewsnap (1), Pauline Barmby (1 and 2), Sarah C. Gallagher (1 and 2) ((1) Department of Physics &amp; Astronomy, The University of Western Ontario, (2) Institute for Earth &amp; Space Exploration, The University of Western University) 20 pages, 11 figures. Accepted to be published in the Publications of the Astronomical Society of the Pacific Astrophysics of Galaxies (astro-ph.GA) The ability to disentangle the light of an AGN from its host galaxy is strongly dependent on the spatial resolution and depth of the imaging. As the capabilities of imaging systems improve with time, confirming that our standard techniques adequately model the increasingly complex structures unveiled is essential. With JWST providing unprecedented image quality, we can test how measurements of galaxy morphology vary with the choice of point-spread function (PSF) and fitting software. We perform two-component Sérsic+PSF fits of the surface brightness profiles of 87 X-ray AGNs $(0.1 < z < 4)$ from the CEERS survey. We create model PSFs for NIRCam F115W imaging using both photutils and PSFEx. We find that PSFEx models consistently fail to match the radial profile of typical point sources within our sample. We then perform AGN--host decompositions on each source by creating Sérsic+PSF models using both Galfit and AstroPhot. We find that Galfit and AstroPhot converge to different regions of the parameter space, providing consistently differing host galaxy properties. While we can measure the AGN and host magnitudes accurately, we find that the host galaxy morphological parameters are not well-determined -- the Sérsic index and effective radius are strongly covariant. Significant changes in the host galaxy parameters do not correspond to changes in the statistical quality of fit, nor to significant changes in the model's radial profile. These results indicate that the Sérsic profile does not uniquely well-represent typical AGN host galaxies in extragalactic survey fields. We also provide recommendations for studies of AGN hosts comparable to ours.",
      "pdf_url": "https://arxiv.org/pdf/2510.27214.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27300",
      "title": "Fluorine Evolution in the Galactic Halo",
      "authors": [
        "Valeria Grisoni",
        "Federico Rizzuti",
        "Gabriele Cescutti"
      ],
      "abstract": "Fluorine Evolution in the Galactic Halo Valeria Grisoni, Federico Rizzuti, Gabriele Cescutti Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The chemical evolution of fluorine is still a matter of debate in Galactic archaeology, especially at low metallicities, where it is particularly challenging to obtain the corresponding chemical abundances from observations. We present here the first detailed theoretical study of the chemical evolution of fluorine at low metallicity by means of a stochastic chemical evolution model for the Galactic halo, in light of the most recent data for fluorine, which further pushed observations to lower metallicities down to [Fe/H]$\\sim$-4 dex, more than a factor of 10 lower in metallicity than previous detections. We employ a state-of-the-art stochastic chemical evolution model to follow the evolution in the Galactic halo, which has been shown to reproduce well the main observables in this Galactic component and the abundance patterns of CNO and neutron-capture elements, and we implement nucleosynthesis prescriptions for fluorine, focusing on the chemical evolution of this element. By comparing recent observations with model predictions, we confirm the importance of rotating massive stars at low metallicities to explain both the [F/Fe] vs [Fe/H] and [F/O] vs [O/H] diagrams. In particular, we showed that we can reach high [F/Fe]$\\sim$2 dex at [Fe/H]$\\sim$-4 dex, in agreement with recent observations at the lowest metallicity. With a stochastic chemical evolution model for the Galactic halo, we confirm the importance of rotating massive stars as fluorine producers, as hinted by previous studies using chemical evolution models for the Galactic disc. We also expect an important production of F at high redshift, in agreement with recent detections of supersolar N by JWST. Further data for fluorine at low metallicities and also at high redshift would be needed to put further constraints on the chemical evolution of fluorine and be compared to our theoretical predictions.",
      "pdf_url": "https://arxiv.org/pdf/2510.27300.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27332",
      "title": "Jacobi capture as a pathway to off-center massive black hole binaries in dwarf galaxies",
      "authors": [
        "Thibaut L. François"
      ],
      "abstract": "Jacobi capture as a pathway to off-center massive black hole binaries in dwarf galaxies Thibaut L. François Conference proceedings, 4 pages, 4 figures Astrophysics of Galaxies (astro-ph.GA) The recent detection of high-redshift supermassive black holes with JWST has renewed interest in the processes driving black hole growth. At the same time, both simulations and observations point to a widespread population of off-center intermediate-mass black holes in dwarf galaxies. Their ability to merge outside galactic centers may play a key role in shaping black hole mass assembly. Here, we investigate the dynamics of off-center black holes in dwarf galaxies hosting cored dark matter haloes, where long dynamical friction timescales and core stalling naturally arise. By embedding off-center black holes into an idealized galactic potential and scanning a wide range of orbital configurations, we assess the likelihood of close interactions through Jacobi capture. We find that captures occur in about 13% of cases. Such captures, possibly sustained within compact stellar systems like stripped nuclei or globular clusters, represent a crucial first step toward assembling massive black hole binaries beyond galactic centers.",
      "pdf_url": "https://arxiv.org/pdf/2510.27332.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27422",
      "title": "UV irradiation of ethanol-containing interstellar ice analogs: Photostability in CH3CH2OH:CO mixtures",
      "authors": [
        "J. A. DeVine",
        "J. Terwisscha van Scheltinga",
        "S. Ioppolo",
        "K.-J. Chuang",
        "E. F. van Dishoeck",
        "T. Lamberts"
      ],
      "abstract": "UV irradiation of ethanol-containing interstellar ice analogs: Photostability in CH3CH2OH:CO mixtures J. A. DeVine, J. Terwisscha van Scheltinga, S. Ioppolo, K.-J. Chuang, E. F. van Dishoeck, T. Lamberts Astrophysics of Galaxies (astro-ph.GA) Ethanol (CH3CH2OH) has been detected in interstellar ices within regions associated with the early stages of star and planet formation. Its solid-phase pathways can lead to diverse conditions that can significantly influence its photostability and -chemistry. Laboratory studies have explored the effects of energetic processing on pure ethanol ices, there is a gap in understanding how ethanol behaves in astrophysically relevant mixed ices. This proof-of-principle study aims to quantify how the ice composition influences the photostability of ethanol mixed with CO, from both physical and chemical perspectives. It also seeks to highlight the importance of balancing constructive and destructive processes. Mixtures with ethanol to CO ratios ranging from 1:0 to 1:11 are exposed to UV irradiation from a microwave discharge H lamp under UHV conditions, at 16 K. The evolution of the solid phase is tracked using reflection-absorption infrared spectroscopy, and changes in the gas phase are monitored with a quadrupole mass spectrometer. Temperature-programmed desorption experiments aid in the identification of infrared spectral features. A radiative-transfer model has been developed to account for the influence of ice composition on the effective photon flux. The model reveals that, during later stages of irradiation, photoproducts play a significant role in the absorbing of incident photons, highlighting the complex cascade of processes initiated by single-photon absorption in ethanol-containing ices. By evaluating photodestruction cross sections as a function of the initial ice composition, we found that CO exerts a stabilizing effect on ethanol. For highly dilute ethanol:CO mixtures, representative of astronomical ices, the photodestruction cross section of ethanol is estimated to ~1.6E-17 cm2/photon after correcting for the effective absorbed UV fluence of the studied interstellar ice analogs.",
      "pdf_url": "https://arxiv.org/pdf/2510.27422.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27459",
      "title": "Ultra-diffuse Galaxy Analogues in the Subaru Hyper-Suprime Cam Wide-field Clusters",
      "authors": [
        "N. A. Makda",
        "S. L. Blyth",
        "R. E. Skelton"
      ],
      "abstract": "Ultra-diffuse Galaxy Analogues in the Subaru Hyper-Suprime Cam Wide-field Clusters N. A. Makda, S. L. Blyth, R. E. Skelton 24 pages, 21 figures and 3 tables. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) We perform a systematic statistical study of ultra-diffuse galaxy analogues (NUDGEs) in a large sample of galaxy clusters to investigate their properties with respect to the host clusters. We used data from the Hyper Suprime-Cam Subaru Strategic Program wide field survey and find a total of 5057 NUDGEs exceeding the background counts in 51 out of 66 galaxy clusters. The clusters span the redshift range 0.08$\\,<\\,$z$\\,<\\,$0.15 and they have a mass range of $0.95\\times10^{14}\\,\\text{M}_\\odot - 8.34\\times10^{14}\\,\\text{M}_\\odot$. The properties of these NUDGEs are found to be similar to UDGs studied in previous works and reaffirm that they are an extension of a continuous galaxy distribution. The number of NUDGEs as a function of cluster halo mass for our sample follows the power law: $N\\propto M_{200}^{0.78\\pm\\,0.28} $. This fit is consistent with previous UDG studies and, together with our NUDGE sizes distributions, matches well with the simulations of UDGs in cored dark matter haloes formed by tidal stripping. The NUDGE density distribution with respect to clustercentric radius of our sample is flatter than previous UDG studies, although the red NUDGEs in this sample show a statistically significant decrease in density with respect to clustercentric radius, indicating that red UDGs may be more affected by their environment than blue UDGs.",
      "pdf_url": "https://arxiv.org/pdf/2510.27459.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27501",
      "title": "Ion-molecule routes towards cycles in TMC-1. An automated study of the C2H4 + CH2CCH+ reaction",
      "authors": [
        "María Mallo",
        "Marcelino Agúndez",
        "Carlos Cabezas",
        "Octavio Roncero",
        "José Cernicharo",
        "Germán Molpeceres"
      ],
      "abstract": "Ion-molecule routes towards cycles in TMC-1. An automated study of the C2H4 + CH2CCH+ reaction María Mallo, Marcelino Agúndez, Carlos Cabezas, Octavio Roncero, José Cernicharo, Germán Molpeceres Accepted for publication in Astronomy and Astrophysics Astrophysics of Galaxies (astro-ph.GA) Cyclopentadiene (c-C5H6) is considered a key molecule in the formation of polycyclic aromatic hydrocarbons (PAHs) in the interstellar medium (ISM). The synthesis of PAHs from simpler precursors is known as the \"bottom-up\" theory, which, so far, has been dominated by reactions between organic radicals. However, this mechanism struggles to account for the origin of the smallest cycles themselves. Ion-molecule reactions emerge as promising alternative pathways to explain the formation of these molecules. In the present work, we investigate the reaction network of the main ionic precursor of cyclopentadiene c-C5H7+ . To this end, we establish an integrated protocol that combines astrochemical modelling to identify viable formation routes under cold interstellar medium conditions, automated reaction path search and kinetic simulations to obtain accurate descriptions of the reaction pathways and reliable rate constants. In particular, we examine the reaction between ethylene (C2H4) and the linear propargyl cation (CH2CCH+). Our results reveal that the formation of c-C5H7+ by radiative association turns out to be inefficient, contrary to our initial expectations. Instead, the system predominantly evolves through bimolecular channels yielding c-C5H5+ and CH3CCH2+ with the formation of c-C5H5+ offering new insights into reactivity that supports molecular growth in the ISM.",
      "pdf_url": "https://arxiv.org/pdf/2510.27501.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27678",
      "title": "Accretion-Driven Turbulence in the Circumgalactic Medium",
      "authors": [
        "Roy Goldner",
        "Jonathan Stern",
        "Drummond Fielding",
        "Claude-André Faucher-Giguère",
        "Yakov Faerman",
        "Aharon Kakoly"
      ],
      "abstract": "Accretion-Driven Turbulence in the Circumgalactic Medium Roy Goldner, Jonathan Stern, Drummond Fielding, Claude-André Faucher-Giguère, Yakov Faerman, Aharon Kakoly 20 pages, 14 figures, submitted to MNRAS Astrophysics of Galaxies (astro-ph.GA) Both observations and hydrodynamic simulations suggest that turbulence is ubiquitous in the circumgalactic medium (CGM). We study the development and properties of CGM turbulence driven by accretion in halo masses of $10^{10}-10^{13}\\,{\\rm M}_\\odot$ at redshifts $0\\leq z\\lesssim 2$, thus providing a baseline for additional turbulence driving processes such as galaxy feedback. Using analytic considerations and idealized hydrodynamical simulations we demonstrate that in halos with mass up to $\\sim10^{12}\\,{\\rm M}_\\odot$, even mild turbulent velocities near the virial radius of $\\sigma_{\\rm t}(R_{\\rm vir})\\sim 10\\,{\\rm km \\, s^{-1}}$ are enhanced by the accretion process so that turbulent velocities are comparable to the virial velocity at inner CGM radii, with $\\sigma_{\\rm t}(0.1\\,R_{\\rm vir})\\approx v_{\\rm vir}\\sim 100\\,{\\rm km \\, s^{-1}}$. Rapid cooling at these inner radii further implies that thermal pressure support is small, and the gas is dominated by the cool and warm ($\\sim10^4-10^5\\,{\\rm K}$) phases. Inner CGM energetics are thus dominated by turbulence, with gas density distributions and velocity structure functions similar to those seen in simulations of isothermal supersonic ISM turbulence, rather than those seen in subsonically turbulent stratified media such as the ICM. The gas accretion rate in these systems is regulated by the turbulence dissipation rate rather than by the cooling rate as in more massive halos. We argue that galaxy feedback is unlikely to qualitatively change our conclusions unless it continuously injects high specific energy material ($\\gg v^2_{\\rm vir}$) into the CGM. Such `turbulence-dominated' CGM can be identified in observations via the predicted wide lognormal ionization distributions and large velocity dispersions in UV absorption spectra, particularly in the inner CGM of $\\sim L^\\star$ and lower-mass halos.",
      "pdf_url": "https://arxiv.org/pdf/2510.27678.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26927",
      "title": "Evolved stars with inconsistent age estimates: Abundance outliers or mass transfer products?",
      "authors": [
        "Polly Frazer",
        "Emily J. Griffith",
        "David W. Hogg",
        "Amaya Sinha",
        "Jamie Tayar"
      ],
      "abstract": "Evolved stars with inconsistent age estimates: Abundance outliers or mass transfer products? Polly Frazer, Emily J. Griffith, David W. Hogg, Amaya Sinha, Jamie Tayar Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) In the Milky Way disk there is a strong trend linking stellar age to surface element abundances. Here we explore this relationship with a dataset of 8,803 red-giant and red-clump stars with both asteroseismic data from NASA Kepler Mission and surface abundances from the SDSS-V MWM. We find, with a k-nearest-neighbors approach, that the [Mg/H] and [Fe/Mg] abundance ratios predict asteroseismic ages to an accuracy of about 2 Gyr for the majority of stars. That said, there are substantial outlier stars whose surface abundances do not match their asteroseismic ages. Because asteroseismic ages for these stars are fundamentally based on density or mass, these outliers are mass-transfer candidates. Stars whose surface abundances predict a younger age (higher mass) than what's seen in the asteroseismology are mass accretor candidates (MAC); stars whose abundances predict an older age (lower mass) than the asteroseismology age are mass donor candidates (MDC). We create precise control samples, matched according to (1) surface abundances and (2) asteroseismic ages, for both the MAC and MDC stars; we use these to find slight differences in rotational velocity, [C/N], and [Na/Mg] between the mass-transfer candidates and their abundance neighbors. We find no drastic differences in kinematics, orbital invariants, UV excess, or other stellar abundances between outliers and their abundance neighbors. We deliver 377 mass-transfer candidates for follow-up observations. This project implicitly suggests a fundamental limit on the reliability of asteroseismic ages, and supports existing evidence that age-abundance outliers are products of binary mass transfer.",
      "pdf_url": "https://arxiv.org/pdf/2510.26927.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.22717",
      "title": "Stellar Mass Segregation in Dark Matter Halos",
      "authors": [
        "Raphaël Errani",
        "Jorge Peñarrubia",
        "Matthew G. Walker"
      ],
      "abstract": "Stellar Mass Segregation in Dark Matter Halos Raphaël Errani, Jorge Peñarrubia, Matthew G. Walker 11 pages, 8 figures; updated to match published version Astrophysics of Galaxies (astro-ph.GA) We study the effect of stellar mass segregation driven by collisional relaxation within the potential well of a smooth dark matter halo. This effect is of particular relevance for old stellar systems with short crossing times, where small collisional perturbations accumulate over many dynamical timescales. We run collisional $N$-body simulations tailored to the ambiguous stellar systems Ursa Major 3/Unions 1, Delve 1 and Eridanus 3, modelling their stellar populations as two-component systems of high- and low-mass stars, respectively. For Ursa Major 3/Unions 1 (Delve 1), assuming a dynamical-to-stellar mass ratio of 10, we find that after 10 Gyr of evolution, the radial extent of its low-mass stars will be twice as large as (40 per cent larger than) that of its high-mass stars. We show that weak tides do not alter this relative separation of half-light radii, whereas for the case of strong tidal fields, mass segregation facilitates the tidal stripping of low-mass stars. We further find that as the population of high-mass stars contracts and cools, the number of dynamically formed binaries within that population increases. Our results call for caution when using stellar mass segregation as a criterion to separate star clusters from dwarf galaxies, and suggest that mass segregation increases the abundance of massive binaries in the central regions of dark matter-dominated dwarf galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2505.22717.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02517",
      "title": "Impact of AGN and nuclear star formation on the ISM turbulence of galaxies: Insights from JWST/MIRI spectroscopy",
      "authors": [
        "Rogemar A. Riffel",
        "Luis Colina",
        "José Henrique Costa-Souza",
        "Vincenzo Mainieri",
        "Miguel Pereira Santaella",
        "Oli L. Dors",
        "Ismael García-Bernete",
        "Almudena Alonso-Herrero",
        "Anelise Audibert",
        "Enrica Bellocchi",
        "Andrew J. Bunker",
        "Steph Campbell",
        "Françoise Combes",
        "Richard I. Davies",
        "Tanio Díaz-Santos",
        "Fergus R. Donnan",
        "Federico Esposito",
        "Santiago García-Burillo",
        "Begoña García-Lorenzo",
        "Omaira González Martín",
        "Houda Haidar",
        "Erin K. S. Hicks",
        "Sebastian F. Hoenig",
        "Masatoshi Imanishi",
        "Alvaro Labiano",
        "Enrique Lopez-Rodriguez",
        "Christopher Packham",
        "Cristina Ramos Almeida",
        "Dimitra Rigopoulou",
        "David Rosario",
        "Gabriel Luan Souza-Oliveira",
        "Montserrat Villar Martín",
        "Oscar Veenema",
        "Lulu Zhang"
      ],
      "abstract": "Impact of AGN and nuclear star formation on the ISM turbulence of galaxies: Insights from JWST/MIRI spectroscopy Rogemar A. Riffel, Luis Colina, José Henrique Costa-Souza, Vincenzo Mainieri, Miguel Pereira Santaella, Oli L. Dors, Ismael García-Bernete, Almudena Alonso-Herrero, Anelise Audibert, Enrica Bellocchi, Andrew J. Bunker, Steph Campbell, Françoise Combes, Richard I. Davies, Tanio Díaz-Santos, Fergus R. Donnan, Federico Esposito, Santiago García-Burillo, Begoña García-Lorenzo, Omaira González Martín, Houda Haidar, Erin K. S. Hicks, Sebastian F. Hoenig, Masatoshi Imanishi, Alvaro Labiano, Enrique Lopez-Rodriguez, Christopher Packham, Cristina Ramos Almeida, Dimitra Rigopoulou, David Rosario, Gabriel Luan Souza-Oliveira, Montserrat Villar Martín, Oscar Veenema, Lulu Zhang 18 pages, accepted for publication by Astronomy and Astrophysics Astrophysics of Galaxies (astro-ph.GA) Active galactic nuclei (AGN), star formation (SF), and galaxy interactions can drive turbulence in the gas of the ISM, which in turn plays a role in the SF within galaxies. The impact on molecular gas is of particular importance, as it serves as the primary fuel for SF. Our goal is to investigate the origin of turbulence and the emission of molecular gas, as well as low- and intermediate-ionization gas, in the inner few kpc of both AGN hosts and SF galaxies. We use JWST MIRI/MRS observations of a sample consisting of 54 galaxies at z<0.1. We present fluxes of the H2 S(5)6.9091, [Ar II]6.9853, [FeII]5.3403, and [Ar III]8.9914 lines, along with velocity dispersion from W80. For galaxies with coronal emission, [Mg V]5.6098 is also included. Line ratios are compared to photoionization and shock models to explore the origin of the gas emission. AGNs exhibit broader emission lines than SFGs, with the largest velocity dispersions observed in radio-strong (RS) AGNs. H2 gas is less turbulent compared to ionized gas, while coronal gas presents higher velocity dispersions. The W80 values for the ionized gas exhibits a decrease from the nucleus out to radii of approximately 0.5--1 kpc, followed by an outward increase up to 2-3 kpc. In contrast, the H2 line widths generally display increasing profiles with distance from the center. Correlations W80 and line ratios such as H2 S(5)/[ArII] and [FeII]/[ArII] indicate that the most turbulent gas is associated with shocks, enhancing H2 and [FeII] emissions. We speculate that these shocked gas regions are produced by AGN outflows and jet-cloud interactions in AGN-dominated sources, while in SFGs, they may be created by stellar winds and mergers. This shock-induced gas heating may be an important mechanism of AGN (or stellar) feedback, preventing the gas from cooling and forming new stars.",
      "pdf_url": "https://arxiv.org/pdf/2510.02517.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.20919",
      "title": "SPHEREx: Aromatics, Aliphatics and PAH Size across the Iris Nebula",
      "authors": [
        "Christiaan Boersma",
        "Alexandros Maragkoudakis",
        "Louis J. Allamandola",
        "Jesse D. Bregman",
        "Pasquale Temi",
        "Vincent J. Esposito",
        "Ryan C. Fortenberry"
      ],
      "abstract": "SPHEREx: Aromatics, Aliphatics and PAH Size across the Iris Nebula Christiaan Boersma, Alexandros Maragkoudakis, Louis J. Allamandola, Jesse D. Bregman, Pasquale Temi, Vincent J. Esposito, Ryan C. Fortenberry Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Observations by the SpectroPhotometer for the History of the Universe, Epoch of Reionization, and Ices Explorer (SPHEREx) are combined with Spitzer spectral map data to study the aromatic, aliphatic, and PAH size evolution across the northwest photo-dissociation region (PDR) of the Iris Nebula (NGC7023). The 3.3-3.4 $\\mu$m complex (I$_{3.3}$) and 11.2 $\\mu$m (I$_{11.2}$) PAH band strength are determined through direct integration. In addition, the former is decomposed into a 3.3 (I'$_{3.3}$) and 3.4 $\\mu$m (I'$_{3.4}$) sub-feature by fitting SPHEREx bandpass-integrated photometry using a modeled, highly sampled, multi-component spectrum. I$_{3.3}$, I$_{11.2}$, I'$_{3.3}$, and I'$_{3.4}$ all peak at the PDR. The NASA Ames PAH IR Spectroscopic Database is used to obtain the average number of carbon atoms ($\\overline{\\rm N_{C}}$) and small PAH fraction ($f_{\\rm small}$) by fitting the isolated PAH component of the Spitzer segment; $70\\lesssim\\overline{N_{C}}\\lesssim76$ and $0.24\\lesssim\\text{f}_{\\rm small}\\lesssim0.36$. I'$_{3.4}$/I'$_{3.4}$, I$_{11.2}$/I$_{3.3}$, $\\overline{\\rm N_{C}}$, and $f_{\\rm small}$ all show a demarcation that matches the large-scale morphology of the region. For I'$_{3.3}$ and I'$_{3.4}$ this is reflected by two distinct trends when plotted against each other, one associated with the dense, the other with the diffuse medium; $[N_{\\rm H,ali}/N_{\\rm H,aro}]_{\\rm dense}$ = 0.42$\\pm$0.01 and $[N_{\\rm H,ali}/N_{\\rm H,aro}]_{\\rm diffuse}$ = 0.10$\\pm$0.01. $\\overline{\\rm N_{C}}$ and $f_{\\rm small}$ are tentatively correlated with I$_{11.2}$/I$_{3.3}$ (R=0.54$\\pm$0.05 and -0.45$\\pm$0.05, respectively). A wider variety of large(r) extended interstellar medium objects is required to tighten the correlations, turn them into quantitative calibrators for PAH size, and pin down the discrepancy of correlations with I'$_{3.3}$ involved.",
      "pdf_url": "https://arxiv.org/pdf/2510.20919.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26405",
      "title": "XRISM Observations of The Prototypical Cold Front in Abell 3667",
      "authors": [
        "Yuki Omiya",
        "Yuto Ichinohe",
        "Kazuhiro Nakazawa",
        "Hisamitsu Awaki",
        "Dominique Eckert",
        "Yutaka Fujita",
        "Isamu Hatsukade",
        "Maxim Markevitch",
        "François Mernier",
        "Ikuyuki Mitsuishi",
        "Naomi Ota",
        "Aurora Simionescu",
        "Yuusuke Uchida",
        "Shutaro Ueda",
        "Irina Zhuravleva",
        "John Zuhone"
      ],
      "abstract": "XRISM Observations of The Prototypical Cold Front in Abell 3667 Yuki Omiya, Yuto Ichinohe, Kazuhiro Nakazawa, Hisamitsu Awaki, Dominique Eckert, Yutaka Fujita, Isamu Hatsukade, Maxim Markevitch, François Mernier, Ikuyuki Mitsuishi, Naomi Ota, Aurora Simionescu, Yuusuke Uchida, Shutaro Ueda, Irina Zhuravleva, John Zuhone Astrophysics of Galaxies (astro-ph.GA) We present high-resolution X-ray spectroscopy of the merging galaxy cluster Abell 3667 with \\textit{XRISM}/Resolve. Two observations, targeting the cluster X-ray core and the prototypical cold front, were performed with exposures of 105 ks and 276 ks, respectively. We find that the gas in the core is blueshifted by $v_z\\sim-200$ km s$^{-1}$ relative to the brightest cluster galaxy, while the low-entropy gas inside the cold front is redshifted by $v_z\\sim 200$ km s$^{-1}$. As one moves further off-center across the front, the line-of-sight (LoS) velocity changes significantly, by $\\Delta v_z=535^{+167}_{-154}$ km s$^{-1}$, back to the value similar to that in the core. There are no significant LoS velocity gradients perpendicular to the cluster symmetry axis. These features suggest that the gas forming the cold front is flowing in the plane oriented along the LoS, supporting an offset merger scenario in which the main cluster has passed in front of the subcluster and induced rotation of the core gas in the plane perpendicular to the sky. The region just inside the front exhibits the largest LoS velocity dispersion seen across two pointings, $\\sigma_z\\sim420$ km s$^{-1}$, which can be interpreted as a developing turbulence or a projection of the LoS velocity shear within the front. The large LoS velocity jump across the cold front, combined with the lack of Kelvin-Helmholtz instability on the surface of the front, suggests some mechanism to suppress it. For example, a magnetic field with $B>5\\,\\mu$G is required if the cold front is stabilized by magnetic draping.",
      "pdf_url": "https://arxiv.org/pdf/2510.26405.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26943",
      "title": "Observation and Modeling of Shear Evolution of Post-reconnection Flare Loops",
      "authors": [
        "Drake Osaben",
        "Jiong Qiu",
        "Dana W. Longcope"
      ],
      "abstract": "Observation and Modeling of Shear Evolution of Post-reconnection Flare Loops Drake Osaben, Jiong Qiu, Dana W. Longcope 16 pages, 10 figures, accepted in ApJ Solar and Stellar Astrophysics (astro-ph.SR) A solar flare releases magnetic energy by reconnecting field lines across a current sheet, thereby allowing their relaxation to a lower energy state. The maximum possible energy is released if all field lines relax to a current-free (potential) state. The progress of a flare's reconnection is often measured as the angle-complement between the observed post-reconnection flare loops and the polarity inversion line of the photospheric magnetic field: shear angle. Many observations have shown strong-to-weak shear evolution over the course of a flare. A field line's shear angle is, however, an imperfect measure of its relaxation. We develop a new technique for observationally inferring the three-dimensional structure of post-reconnection field lines, including their local twist, $\\alpha$, which will vanish for potential fields. Our method fits loops in EUV images to extrapolations subject to constraints such as matching the feet of model field lines to observed flare ribbons. We apply the new method to an eruptive two-ribbon flare (SOL2014-12-18T22) which exhibits strong-to-weak shear-angle evolution. We find that, as the flare progresses, $\\alpha$ decreases in post reconnection loops anchored to newly brightened ribbons. Our study demonstrates that post-reconnection magnetic field is neither potential nor linear force-free. The method quantifies, for the first time, the time-history of a flare's energetic relaxation. It also quantifies the increasing height of subsequently reconnected field, and the time delay between reconnection forming a flare loop and its appearance in EUV passbands. These results promise to enable improvements in both magnetic modeling and hydrodynamic modeling of flares.",
      "pdf_url": "https://arxiv.org/pdf/2510.26943.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26973",
      "title": "Zeeman Doppler mapping deconstructed",
      "authors": [
        "M.J. Stift",
        "F. Leone"
      ],
      "abstract": "Zeeman Doppler mapping deconstructed M.J. Stift, F. Leone Solar and Stellar Astrophysics (astro-ph.SR) Aims. Magnetic and abundance maps of chemically peculiar (CP) stars, derived with the help of Zeeman Doppler mapping, have invariably been used as arguments against theories, in particular atomic diffusion theory. We intend to expose the fallacy of these claims. Methods. We have identified in the literature those (5) CP stars for which multiple maps have been published, all based on the same Zeeman Doppler mapping strategy. For each of these stars we have then carried out inter comparisons between the recovered distributions of magnetic field and of abundances. Results. Agreement between maps often turns out to be quite poor in regard to both abundances, field topology and absolute field strengths. Maps based on the same set of observations can differ considerably, even when they are coming from the same authors. Conclusions. It becomes clear that Zeeman Doppler mapping cannot be guaranteed to yield unique results. When a number of physically impossible magnetic geometries all provide good fits to the observed Stokes $IQUV$ profiles, these solutions must necessarily be spurious and cannot be used as constraints to diffusion theory.",
      "pdf_url": "https://arxiv.org/pdf/2510.26973.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27024",
      "title": "When Magnetic Field Lines Stretch, Snap, and Expand: A New Look at Solar Flares with L-maps",
      "authors": [
        "Maria D. Kazachenko",
        "Yuhong Fan",
        "Andrey N. Afanasyev"
      ],
      "abstract": "When Magnetic Field Lines Stretch, Snap, and Expand: A New Look at Solar Flares with L-maps Maria D. Kazachenko, Yuhong Fan, Andrey N. Afanasyev 11 pages, 5 figures, submitted to Astrophysical Journal on October 23, 2025 Solar and Stellar Astrophysics (astro-ph.SR) Understanding the three-dimensional evolution of coronal magnetic fields during solar flares remains challenging due to the lack of direct coronal field measurements. Here we combine data-driven MHD simulations of NOAA AR 11158 (Fan et al., 2024) with flare-ribbon and coronal-dimming observations to investigate realistic coronal magnetic-field evolution during an X-class flare. We introduce L-maps, maps of the logarithm of magnetic field line lengths, as a diagnostic tool to track the dynamics of simulated coronal magnetic structures. Variations in L-maps identify flare ribbons through field-line shortening and coronal dimmings through field-line lengthening. Comparison with SDO/AIA observations demonstrates strong morphological and temporal agreement, validating the simulated field evolution. Applying K-means clustering to the L-map temporal profiles, we distinguish three stages of coronal evolution: (1) slow pre-flare rise phase, (2) flare reconnection accompanied by CME rise, and (3) post-reconnection CME expansion. We detect a slow pre-flare rise phase of magnetic field lines rooted in ribbon footpoints and identify a new phenomenon, reconnection dimming, a rapid expansion of reconnected inner flux-rope field lines during the impulsive phase. Our results show that L-maps provide a powerful and physically intuitive framework for bridging simulations and observations and for tracking the full three-dimensional evolution of coronal magnetic fields during flares.",
      "pdf_url": "https://arxiv.org/pdf/2510.27024.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27059",
      "title": "The He I D3 Line as a Proxy for Magnetic Activity using EXPRES Solar Observations",
      "authors": [
        "Momo Ellwarth",
        "Joe Llama",
        "Lily L. Zhao",
        "John M. Brewer",
        "Andrew Szymkowiak",
        "Rachael M. Roettenbacher",
        "James T. Sikora",
        "Alex S. Polanski",
        "Steven H. Saar"
      ],
      "abstract": "The He I D3 Line as a Proxy for Magnetic Activity using EXPRES Solar Observations Momo Ellwarth, Joe Llama, Lily L. Zhao, John M. Brewer, Andrew Szymkowiak, Rachael M. Roettenbacher, James T. Sikora, Alex S. Polanski, Steven H. Saar Solar and Stellar Astrophysics (astro-ph.SR) Stellar activity remains one of the primary challenges in the detection and characterization of low-mass exoplanets, as it can induce radial velocity (RV) variations that mask or mimic planetary signals. Identifying reliable activity proxies is essential in order to distinguish stellar variability from genuine planetary signatures. In this study, we examine the variability of the chromospheric He I D3 line in high-resolution solar spectra and assess its potential as an activity indicator. We find a strong correlation between the He I D3 line intensity variation and the Sun's unsigned magnetic flux derived from SDO HMI data as well as with the solar RVs. Our results suggest that the He I D3 line offers a promising and straightforward proxy for magnetic activity, which may complement existing stellar activity indicators. Its inclusion could help disentangle stellar signals in RV measurements and ultimately improve the detection of Earth-like exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2510.27059.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27149",
      "title": "The Physical Origin of Periodic Density Structures in the Solar Wind: Coronal Streamers as Magnetohydrodynamic Resonators",
      "authors": [
        "Olena Podladchikova"
      ],
      "abstract": "The Physical Origin of Periodic Density Structures in the Solar Wind: Coronal Streamers as Magnetohydrodynamic Resonators Olena Podladchikova Solar and Stellar Astrophysics (astro-ph.SR) We present a comprehensive physical model explaining the origin of Periodic Density Structures (PDS) observed in white-light coronagraphs with characteristic periods of approximately 45, 80, and 120 minutes. Through systematic investigation of potential resonant cavities in the solar atmosphere, we demonstrate that traditional large-scale cavities yield fundamentally incompatible periods: photosphere-transition region (3.3 minutes), transition region-sonic point (10.3 hours), and transition region-heliopause (7.7 years). We establish that coronal streamers act as natural magnetohydrodynamic resonators, with calculated harmonic periods of 122, 61, and 41 minutes that precisely match observations. The physical mechanism involves slow magnetoacoustic standing waves that create periodic density enhancements through wave compression, with the streamer resonator having quality factor Q ~ 10-100, enabling natural amplification of broadband coronal noise. At streamer cusps, these density enhancements trigger magnetic reconnection, releasing plasma blobs into the solar wind at resonant periods. The model provides complete energy budget calculations, wave amplitude estimates, and explains all key observational features including spatial localization, period coherence, and the relationship between remote sensing and in situ measurements. This work establishes streamer resonators as fundamental structures shaping solar wind variability and provides a new framework for understanding the emergence of coherent structures in turbulent astrophysical plasmas.",
      "pdf_url": "https://arxiv.org/pdf/2510.27149.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27162",
      "title": "Two-Stage Nature of a Solar Flare with Parallel and Semi-Circular Ribbons",
      "authors": [
        "Ruifei Huang",
        "Hao Ning",
        "Ze Zhong",
        "Ye Qiu",
        "Zhenyong Hou",
        "Yang Su",
        "Chuan Li",
        "Xiangliang Kong",
        "Yao Chen"
      ],
      "abstract": "Two-Stage Nature of a Solar Flare with Parallel and Semi-Circular Ribbons Ruifei Huang, Hao Ning, Ze Zhong, Ye Qiu, Zhenyong Hou, Yang Su, Chuan Li, Xiangliang Kong, Yao Chen 13 pages, 8 figures; Accepted for publication in ApJ Solar and Stellar Astrophysics (astro-ph.SR); Plasma Physics (physics.plasm-ph); Space Physics (physics.space-ph) Flare ribbons with parallel and circular morphologies are typically associated with different magnetic reconnection models, and the simultaneous observation of both types in a single event remains rare. Using multi-wavelength observations from a tandem of instruments, we present an M8.2-class flare that occurred on 2023 September 20, which produced quasi-parallel and semi-circular ribbons. The complex evolution of the flare includes two distinct brightening episodes in the quasi-parallel ribbons, corresponding to the two major peaks in the hard X-ray (HXR) light curve. In contrast, the brightening of semi-circular ribbons temporally coincides with the local minimum between the two peaks. Using potential field extrapolation, we reconstruct an incomplete dome-like magnetic structure with a negative polarity embedded within the northwestern part of the semi-circular positive polarity. Consequently, the magnetic configuration comprises two sets of field lines with distinct magnetic connectivities. We suggest that the standard flare reconnection accounts for the two-stage brightening of quasi-parallel ribbons associated with the two HXR peaks. Between the two stages, this process is constrained by the interaction of eruptive structures with the dome. The interaction drives the quasi-separatrix layer reconnection, leading to the brightening of semi-circular ribbons. It also suppresses the standard flare reconnection, resulting in a delayed second HXR peak.",
      "pdf_url": "https://arxiv.org/pdf/2510.27162.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27189",
      "title": "Dense Circumstellar Medium around Pulsating Massive Stars Powering Interacting Supernovae",
      "authors": [
        "Sutirtha Sengupta",
        "Das Sujit",
        "Arkaprabha Sarangi"
      ],
      "abstract": "Dense Circumstellar Medium around Pulsating Massive Stars Powering Interacting Supernovae Sutirtha Sengupta, Das Sujit, Arkaprabha Sarangi 3 pages, submitted to Proceedings of the IAU, poster presented in IAUS 402: Massive Stars Across Redshifts in the Era of JWST and Large-Scale Surveys Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Theory (hep-th); Computational Physics (physics.comp-ph) We investigate the evolution of red supergiant (RSG) progenitors of core-collapse (CC) supernovae (SNe) with initial masses between $12-20~M_\\odot$ focusing on the effects of enhanced mass loss due to pulsation-driven instabilities in their envelopes and subsequent dynamical ejections during advanced stages of nuclear burning. Using time-dependent mass loss from detailed MESA stellar evolution models, including a parameterized prescription for pulsation-driven superwinds and time-averaged mass loss rates attributed to resulting shock-induced ejections, we construct the circumstellar medium (CSM) before the SN explosion. We calculate resulting CSM density profiles and column densities considering the acceleration of the stellar wind. Our models produce episodes of enhanced mass loss $10^{-4}-10^{-2}~M_\\odot~\\rm{yr}^{-1}$ in the last centuries-decades before explosion forming dense CSM ($>10^{-15}~\\rm{gcm}^{-3}$ at distances $<10^{15}$ cm) -- consistent with those inferred from multi-wavelength observations of Type II SNe such as SN~2023ixf and SN~2020ywx.",
      "pdf_url": "https://arxiv.org/pdf/2510.27189.pdf",
      "categories": [
        "astro-ph.SR",
        "hep-th"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27295",
      "title": "Evolution of stellar magnetic activity: probing planet engulfment by red giants",
      "authors": [
        "Charlotte Gehan"
      ],
      "abstract": "Evolution of stellar magnetic activity: probing planet engulfment by red giants Charlotte Gehan Accepted for publication in A&A. 13 pages, 9 figures. Abstract shortened to match arxiv's requirements Solar and Stellar Astrophysics (astro-ph.SR) The fraction of low-mass (LM) stars (M <= 1.5 Msun) showing photospheric activity in their light curve is larger on the horizontal branch (HB) than during the previous red giant branch (RGB) phase, while the opposite trend has been observed for intermediate-mass (IM) stars (M > 1.5 Msun). One hypothesis is that LM red giants (RGs) engulf more planets than IM RGs, which results in a faster surface rotation and a higher magnetic activity. Indeed, LM stars reach a maximum radius at the RGB tip that is much larger than for IM stars, making them more likely to engulf planets. However, we need to study the evolution of the active star fraction along the RGB to firmly check this hypothesis. I use independent indicators tracing the activity level in the chromosphere based on the Ca II H&K, Halpha, Mg I and infrared Ca II spectral lines from LAMOST data for about 3000 RGs whose evolutionary stage has been identified by asteroseismology with the Kepler mission. I find that the fraction of active stars decreases for IM stars along the RGB but unexpectedly increases for LM stars. Such an increase is not explained by models of single-star evolution and is consistent with the fact that LM stars are more susceptible than IM stars of engulfing planets. Indeed, data shows that IM main-sequence stars exhibit a dearth of planets, consistently with predictions from planet formation theory. I also observe that the fraction of active stars tends to increase for both LM and IM stars on the HB, in partial contrast with previous findings. Finally, I discover that the IM RGB star KIC 9780154 may have engulfed one or more planet(s) as its surface rotation from photometry is twice faster than its envelope rotation from asteroseismology. Characterizing planet engulfment by RGs provides insights into the evolution and fate of most planetary systems, since about 97 % of stars pass through the RG evolution stage.",
      "pdf_url": "https://arxiv.org/pdf/2510.27295.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27389",
      "title": "Rediscussion of eclipsing binaries. Paper XXVII. The totally-eclipsing system UZ Draconis",
      "authors": [
        "John Southworth"
      ],
      "abstract": "Rediscussion of eclipsing binaries. Paper XXVII. The totally-eclipsing system UZ Draconis John Southworth Accepted for publication in The Observatory. 16 pages, 5 tables, 6 colour figures Solar and Stellar Astrophysics (astro-ph.SR) UZ Dra is a detached and totally-eclipsing binary containing two late-F stars in a circular orbit of period 3.261 d. It has been observed by the Transiting Exoplanet Survey Satellite in 41 sectors, yielding a total of 664,809 high-quality flux measurements. We model these data and published radial velocities to determine the physical properties of the system to high precision. The masses of the stars are 1.291 +/- 0.012 Msun and 1.193 +/- 0.009 Msun, and their radii are 1.278 +/- 0.004 Rsun and 1.122 +/- 0.003 Rsun. The high precision of the radius measurements is made possible by the (previously unrecorded) total eclipses and the extraordinary amount of data available. The light curves show spot modulation at the orbital period, and both stars rotate synchronously. Our determination of the distance to the system, 185.7 +/- 2.4 pc, agrees very well with the parallax distance of 185.39 +/- 0.39 pc from Gaia DR3. The properties of the system are consistent with theoretical predictions for an age of 600 +/- 200 Myr and a slightly super-solar metallicity.",
      "pdf_url": "https://arxiv.org/pdf/2510.27389.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27441",
      "title": "Solar Polar Field Reversals as the Result of the Global Magnetic field Meridional Flows",
      "authors": [
        "Irina A. Bilenko"
      ],
      "abstract": "Solar Polar Field Reversals as the Result of the Global Magnetic field Meridional Flows Irina A. Bilenko Solar and Stellar Astrophysics (astro-ph.SR) Based on data obtained from Wilcox Solar Observatiry the solar polar magnetic fields reversals in cycles 21\\,--\\,25 were considered. The results indicate that the polarity reversal occurs at the maximum of sunspot activity of each cycle, but the beginning, end, and duration of the reversals did not demonstrate any association with the Wolf numbers, which are characteristics of local magnetic fields. Moreover, during the periods of polarity reversal, the correlation between global magnetic field (GMF) parameters and Wolf numbers decreased and even moved into anti-correlation mode. The polar field reversals are determined by the GMF flows of positive- and negative-polarity magnetic fields, which cyclically migrate from one pole to the opposite pole. The new polarity magnetic fields are delivered to the poles by a certain flow, and then carried away by the same flow to the opposite pole. The increase in the polar magnetic field strength to its maximal values at the solar activity minimum and following decrees to the next cycle maximum coincides with the latitudinal changes in corresponding magnetic field flow. Formulas for calculating the meridional circulation of positive- and negative-polarity magnetic field flows were proposed. They allow predict the time of polarity reversals, and since polarity reversals occur at the maxima of cycles, then also the time of maxima of both the future and past cycles.",
      "pdf_url": "https://arxiv.org/pdf/2510.27441.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27470",
      "title": "52 Eclipsing Quadruple Star Candidates Discovered in TESS Full Frame Images",
      "authors": [
        "Veselin B. Kostov",
        "Brian P. Powell",
        "Saul A. Rappaport",
        "Tamas Borkovits",
        "Robert Gagliano",
        "Mark Omohundro",
        "Thomas L. Jacobs",
        "Martti H. Kristiansen",
        "Guillermo Torres",
        "Gerald Handler",
        "Allan R. Schmitt",
        "Hans M. Schwengeler",
        "Tibor Mitnyan",
        "Ivan A. Terentev",
        "Daryll M. LaCourse",
        "Andrew Vanderburg",
        "Svetoslav D. Alexandrov",
        "Cledison Marcos da Silva",
        "Marco Z. Di Fraia",
        "Aline U. Fornear",
        "Marc Huten",
        "Davide Iannone",
        "Julien S. de Lambilly",
        "Sam Lee",
        "Jerome Orosz",
        "Rafael Rodrigues",
        "Allan Tarr",
        "William Welsh"
      ],
      "abstract": "52 Eclipsing Quadruple Star Candidates Discovered in TESS Full Frame Images Veselin B. Kostov, Brian P. Powell, Saul A. Rappaport, Tamas Borkovits, Robert Gagliano, Mark Omohundro, Thomas L. Jacobs, Martti H. Kristiansen, Guillermo Torres, Gerald Handler, Allan R. Schmitt, Hans M. Schwengeler, Tibor Mitnyan, Ivan A. Terentev, Daryll M. LaCourse, Andrew Vanderburg, Svetoslav D. Alexandrov, Cledison Marcos da Silva, Marco Z. Di Fraia, Aline U. Fornear, Marc Huten, Davide Iannone, Julien S. de Lambilly, Sam Lee, Jerome Orosz, Rafael Rodrigues, Allan Tarr, William Welsh 33 pages, 24 figures, 18 tables, AJ accepted Solar and Stellar Astrophysics (astro-ph.SR) We present the discovery of 52 eclipsing quadruple star candidates detected in TESS Full Frame Image eleanor data by machine learning and citizen scientists. The uniformly-vetted and -validated targets exhibit two sets of eclipses following two distinct periods, representing quadruple systems with a 2+2 hierarchical configuration. Detailed photocenter measurements confirmed that both sets of eclipses originate within ~0.1-0.2 pixels (~2-4 arcsec) of the corresponding target, and ruled out resolved nearby field stars. The catalog includes a number of systems producing prominent eclipse timing variations and/or apsidal motion, a quadruple with an outer period of ~1,400 days, and even a 2+2 quadruple in a likely wide quintuple with a resolved co-moving star. Additionally, two systems have complete astrometric solutions for the outer orbits from Gaia. We provide the measured ephemerides, eclipse depths and durations, overall statistical properties, and highlight potentially interesting systems that merit further investigations.",
      "pdf_url": "https://arxiv.org/pdf/2510.27470.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27553",
      "title": "Uniturbulence and Alfvén Wave Solar Model in MPI-AMRVAC",
      "authors": [
        "M. McMurdo",
        "T. Van Doorsselaere",
        "N. Magyar",
        "L. Banovic",
        "D. Lim"
      ],
      "abstract": "Uniturbulence and Alfvén Wave Solar Model in MPI-AMRVAC M. McMurdo, T. Van Doorsselaere, N. Magyar, L. Banovic, D. Lim Solar and Stellar Astrophysics (astro-ph.SR) The coronal heating problem remains a fundamental challenge in solar physics. While AWSoM-type models (Alfvén Wave Solar Model) have proven highly successful in reproducing the large-scale structure of the solar corona, they inherently neglect contributions from additional wave modes that arise when the effects of transverse structuring is fully incorporated into the magnetohydrodynamic (MHD) equations. In this paper, we compare the roles of kink wave- and Alfvén wave-driven heating in sustaining a region of the solar atmosphere, using newly developed physics and radiative cooling modules within MPI-AMRVAC. We extend the existing MHD physics module in MPI-AMRVAC by incorporating additional Alfvén and kink wave energy contributions to the MHD equations. We examine their roles in heating the solar atmosphere and driving the solar wind. To validate our approach, we compare numerical results from Python-based simulations with those obtained using the UAWSoM module in MPI-AMRVAC. Furthermore, we assess the heating efficiency of kink waves relative to that of pure Alfvén waves through two parameter studies: (1) exploring how different Alfvén wave reflection rates impact the simulated atmosphere, and (2) varying the relative magnitudes of Alfvén and kink wave energy injections. Finally, we present results from a larger-scale domain, sustained entirely by kink wave-driven heating. Our results show that kink wave-driven (UAWSoM) models are able to sustain a stable atmosphere without requiring any artificial background heating terms, unlike traditional Alfvén-only models. We attribute this to the increased heating rate associated with kink waves compared with Alfvén waves, given the same energy injection. Kink waves can sustain a model plasma with temperature and density values representative of coronal conditions without resorting to ad hoc heating terms.",
      "pdf_url": "https://arxiv.org/pdf/2510.27553.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27591",
      "title": "Multi-band infrared imaging reveals dusty spiral arcs around the binary B[e] star 3 Puppis",
      "authors": [
        "M. Abello",
        "J. Drevon",
        "A. Meilland",
        "A. Domiciano de Souza",
        "F. Millour",
        "R. Flor",
        "J. H. Leftley",
        "C. Paladini",
        "Ph. Stee",
        "A. Matter",
        "S. Lagarde",
        "B. Lopez",
        "P. Ábrahám",
        "J.-C. Augereau",
        "P. Cruzalèbes",
        "W. Danchi",
        "T. Henning",
        "T. Juhász",
        "F. Kerschbaum",
        "F. Lykou",
        "P. Priolet",
        "S. Robbe-Dubois",
        "J. Varga",
        "L.B.F.M. Waters",
        "G. Weigelt",
        "S.Wolf",
        "MATISSE collaboration"
      ],
      "abstract": "Multi-band infrared imaging reveals dusty spiral arcs around the binary B[e] star 3 Puppis M. Abello, J. Drevon, A. Meilland, A. Domiciano de Souza, F. Millour, R. Flor, J. H. Leftley, C. Paladini, Ph. Stee, A. Matter, S. Lagarde, B. Lopez, P. Ábrahám, J.-C. Augereau, P. Cruzalèbes, W. Danchi, T. Henning, T. Juhász, F. Kerschbaum, F. Lykou, P. Priolet, S. Robbe-Dubois, J. Varga, L.B.F.M. Waters, G. Weigelt, S.Wolf, MATISSE collaboration 19 pages, 11 figures, 11 tables Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) 3 Puppis is the brightest known B[e] star. Recent work classifies this A-type object as a supergiant, yet the impact of its binarity on the circumstellar environment (CE) remains hard to characterize. To resolve its dusty region at 5-10 mas, we obtained mid-IR interferometric observations with VLTI/MATISSE over 3-12 {\\mu}m. Because the (u,v) coverage supports imaging, we introduce a statistical interferometric-imaging workflow based on MiRA to generate averaged images: this systematic approach enables the selection of an optimal set of reconstructions, improving the robustness and fidelity of the recovered features. We also use SPARCO, an independent tool well suited to bright central objects embedded in fainter extended emission. Images from both tools in the L, M, and N bands agree and reveal an asymmetric, elongated feature ~17 mas (~10 au at 631 pc) southeast of the star with ~20% density contrast. A second northwest asymmetry and a skewed inner rim are detected. Simple geometric modelling, guided by the MATISSE images, constrains the morphology, location, and flux of the CE and its asymmetries. The images are consistent with earlier VLTI measurements but expose a more complex CE with large-scale clumps in the southeast and northwest parts of the disc. Hydrodynamic modelling indicates that tidal spiral-wake perturbations from the central binary, dynamically excited at Lindblad resonances in the circumbinary disc, best explain the radial extent and curvature of the elongated structures seen in all bands.",
      "pdf_url": "https://arxiv.org/pdf/2510.27591.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27635",
      "title": "A Decade of Solar High-Fidelity Spectroscopy and Precise Radial Velocities from HARPS-N",
      "authors": [
        "X. Dumusque",
        "K. Al Moulla",
        "M. Cretignier",
        "N. Buchschacher",
        "D. Segransan",
        "D. F. Phillips",
        "L. Affer",
        "S. Aigrain",
        "A. Anna John",
        "A. S. Bonomo",
        "V. Bourrier",
        "L. A. Buchhave",
        "A. Collier Cameron",
        "H. M. Cegla",
        "P. Cortes-Zuleta",
        "R. Cosentino",
        "J. Costes",
        "M. Damasso",
        "Z. L de Beurs",
        "D. Ehrenreich",
        "A. Ghedina",
        "M. Gonzales",
        "R. D. Haywood",
        "B. Klein",
        "B. S. Lakeland",
        "N. Langellier",
        "D. W. Latham",
        "A. Leleu",
        "M. Lodi",
        "M. Lopez-Morales",
        "C. Lovis",
        "L. Malavolta",
        "J. Maldonado",
        "G. Mantovan",
        "A. F. Matinez Fiorenzano",
        "G. Micela",
        "T. Milbourne",
        "E. Molinari",
        "A. Mortier",
        "L. Naponiello",
        "B. A. Nicholson",
        "N. K. O'Sullivan",
        "F. Pepe",
        "M. Pinamonti",
        "G. Piotto",
        "F. Rescigno",
        "K. Rice",
        "S. Dimitar",
        "A. M. Silva",
        "A. Sozzetti",
        "M. Stalport",
        "S. Tavella",
        "S. Udry",
        "A. Vanderburg",
        "S. Vissapragada",
        "C. A. Watson"
      ],
      "abstract": "A Decade of Solar High-Fidelity Spectroscopy and Precise Radial Velocities from HARPS-N X. Dumusque, K. Al Moulla, M. Cretignier, N. Buchschacher, D. Segransan, D. F. Phillips, L. Affer, S. Aigrain, A. Anna John, A. S. Bonomo, V. Bourrier, L. A. Buchhave, A. Collier Cameron, H. M. Cegla, P. Cortes-Zuleta, R. Cosentino, J. Costes, M. Damasso, Z. L de Beurs, D. Ehrenreich, A. Ghedina, M. Gonzales, R. D. Haywood, B. Klein, B. S. Lakeland, N. Langellier, D. W. Latham, A. Leleu, M. Lodi, M. Lopez-Morales, C. Lovis, L. Malavolta, J. Maldonado, G. Mantovan, A. F. Matinez Fiorenzano, G. Micela, T. Milbourne, E. Molinari, A. Mortier, L. Naponiello, B. A. Nicholson, N. K. O'Sullivan, F. Pepe, M. Pinamonti, G. Piotto, F. Rescigno, K. Rice, S. Dimitar, A. M. Silva, A. Sozzetti, M. Stalport, S. Tavella, S. Udry, A. Vanderburg, S. Vissapragada, C. A. Watson 22 pages, 13 figures, version after first reviewing round Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) We recently released 10 years of HARPS-N solar telescope and the goal of this manuscript is to present the different optimisations made to the data reduction, to describe data curation, and to perform some analyses that demonstrate the extreme RV precision of those data. By analysing all the HARPS-N wavelength solutions over 13 years, we bring to light instrumental systematics at the 1 m/s level. After correction, we demonstrate a peak-to-peak precision on the HARPS-N wavelength solution better than 0.75 m/s over 13 years. We then carefully curate the decade of HARPS-N re-reduced solar observations by rejecting 30% of the data affected either by clouds, bad atmospheric conditions or well-understood instrumental systematics. Finally, we correct the curated data for spurious sub-m/s RV effects caused by erroneous instrumental drift measurements and by changes in the spectral blaze function over time. After curation and correction, a total of 109,466 HARPS-N solar spectra and respective RVs over a decade are available. The median photon-noise precision of the RV data is 0.28 m/s and, on daily timescales, the median RV rms is 0.49 m/s, similar to the level imposed by stellar granulation signals. On 10-year timescales, the large RV rms of 2.95 m/s results from the RV signature of the Sun's magnetic cycle. When modelling this long-term effect using the Magnesium II activity index, we demonstrate a long-term RV precision of 0.41 m/s. We also analysed contemporaneous HARPS-N and NEID solar RVs and found the data from both instruments to be of similar quality and precision, with an overall RV differece rms of 0.79 m/s. This decade of high-cadence HARPS-N solar observations with short- and long-term precision below 1 m/s represents a crucial dataset to further understand stellar activity signals in solar-type stars , and to advance other science cases requiring such an extreme precision.",
      "pdf_url": "https://arxiv.org/pdf/2510.27635.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27639",
      "title": "X-ray and UV Observations of the Young Sun HIP~67522: Evidence of Lyman-alpha Absorption Within the Planetary System",
      "authors": [
        "Cynthia S. Froning",
        "Allison Youngblood",
        "David J. Wilson",
        "Girish M. Duvvuri",
        "Kevin France",
        "P. Christian Schneider",
        "J. Sebastian Pineda",
        "Alexander Brown",
        "Angeli Sandoval",
        "Thomas Ayres"
      ],
      "abstract": "X-ray and UV Observations of the Young Sun HIP~67522: Evidence of Lyman-alpha Absorption Within the Planetary System Cynthia S. Froning, Allison Youngblood, David J. Wilson, Girish M. Duvvuri, Kevin France, P. Christian Schneider, J. Sebastian Pineda, Alexander Brown, Angeli Sandoval, Thomas Ayres Solar and Stellar Astrophysics (astro-ph.SR) We present ultraviolet (UV) spectroscopy of the 17 Myr, G0V star, HIP 67522. The UV spectrum is characterized by strong chromospheric and transition region emission lines. There was moderate spectral variability during the observations consisting of 15% stochastic fluctuation and two small flares releasing $E_{UV} \\simeq 2-4\\times10^{32}$ ergs in each event. We compare the broadband spectral energy distribution (SED; 4.7 A - 13.0~$\\mu$m) of the star first presented in Thao et al. (2024) to the solar SED and show that X-ray/UV (XUV) flux density at 1 AU is $10^{2}-10^{5}$ stronger (from 1000 A down to 5 A) in the young star compared to the present-day Sun. Attempts to reconstruct the intrinsic Ly-alpha emission of the star failed to return physically realistic results. The discrepancy appears to arise from a population of neutral hydrogen within the system itself, extending to $> \\pm500$ km/s. The absorption could be due to outflow from exoplanet atmospheric loss or from a stellar component; such a picture would require high spectral resolution observations and/or UV transit spectroscopy to confirm. Finally, we examine the evolution of the XUV emission from solar-type stars from ages of 17 Myr to 9.4 Gyr and derive a scaling relation between FUV Ly-alpha and EUV emission as a function of stellar age. X-ray (1--100 A) and EUV (100--900 A) contributions to high energy emission are 329 and 672 ergs/cm^2/s at 1 AU, respectively, suggesting that both may contribute to exoplanet heating at this epoch. The XUV emission levels at 17 Myr combined with the low density of the planet HIP67522b are consistent with models that predict that solar type stars born with high rotation and activity levels will drive substantial heating and escape on close-in, gaseous planets.",
      "pdf_url": "https://arxiv.org/pdf/2510.27639.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27372",
      "title": "Ionospheric responses over the Antarctic region to Intense Space Weather events: Plasma Convection vs. Auroral Precipitation",
      "authors": [
        "Sumanjit Chakraborty",
        "Gopi K. Seemala"
      ],
      "abstract": "Ionospheric responses over the Antarctic region to Intense Space Weather events: Plasma Convection vs. Auroral Precipitation Sumanjit Chakraborty, Gopi K. Seemala Accepted for publication in the Advances in Space Research (ASR) Space Physics (physics.space-ph); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR); Geophysics (physics.geo-ph); Plasma Physics (physics.plasm-ph) The present investigation is directed at exploring southern polar ionospheric responses to intense space weather events and their correlations with plasma convection and auroral precipitation. The main phases of six geomagnetic storms occurring in the year 2023 (ascending phase of the present solar cycle) are considered for this study. The ionospheric Total Electron Content (TEC) measurements derived from GPS receivers covering the Antarctic region are used for probing the electron density perturbations during these events. Auroral precipitation maps are shown to illustrate the locations of the GPS stations relative to particle precipitation. SuperDARN maps are shown to understand the effects of plasma convection over these locations. Correlation between the enhanced TEC observations with the auroral precipitation (R $\\sim$ 0.31) and the plasma convection (R $\\sim$ 0.88) reveals that the latter is more responsible for causing significant enhancements in the diurnal maximum values of TEC over the Antarctic region in comparison to the former. Therefore, this work shows correlation studies between two physical processes and ionospheric density enhancements over the under-explored south polar region under strong levels of geomagnetic activity during 2023.",
      "pdf_url": "https://arxiv.org/pdf/2510.27372.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.03561",
      "title": "Modelling $δ$ Scuti pulsations: A new grid of p, g, and f modes across pre-main-sequence to post-main-sequence evolution",
      "authors": [
        "Anuj Gautam",
        "Simon J. Murphy",
        "Timothy R. Bedding"
      ],
      "abstract": "Modelling $δ$ Scuti pulsations: A new grid of p, g, and f modes across pre-main-sequence to post-main-sequence evolution Anuj Gautam, Simon J. Murphy, Timothy R. Bedding 28 pages, 17 figures. This revision adds material on mode eigenfunctions, mode inertia, and propagation diagrams; expands discussion of mixed-mode behaviour; includes $f_{Δν}$ vs. mean-density scaling; addresses MNRAS referee comments; and includes other minor corrections Solar and Stellar Astrophysics (astro-ph.SR) Space-based photometry reveals regular high-frequency patterns in many young $\\delta$ Scuti stars. These pulsations provide a powerful means of inferring stellar properties, particularly ages, for young $\\delta$ Scuti stars for which traditional age-dating methods are poorly constrained. Realising this potential requires theoretical models that capture the complexities of stellar structure and evolution. We present a comprehensive grid of 25 million stellar pulsation models, computed using the mesa stellar evolution code and the gyre stellar oscillation code, tailored to $\\delta$ Scuti stars. The grid spans a wide range of masses, metallicities and rotation velocities, and covers evolutionary phases from the early pre-main-sequence through the main sequence and into the post-main sequence contraction phase. For each model, we computed adiabatic pulsation frequencies for degrees $\\ell$ = 0 to 3, capturing p modes, g modes, f modes and their interactions through avoided crossings. We find that f and low-order g modes have mode inertias comparable to or lower than the fundamental radial mode during the late pre-MS and early MS, implying that these modes should be observable. We revisit $\\delta$ Scuti scaling relations and map asteroseismic observables, including the large frequency separation ($\\Delta\\nu$) and phase offset parameter ($\\varepsilon$), across age, mass, metallicity, and rotation. This new model grid, which is publicly available, improves upon previous such model grids by facilitating interpretation of $\\delta$ Scuti pulsations, allowing for more reliable age estimates and tighter constraints on stellar evolutionary pathways, and planet formation in A- and F-type stars.",
      "pdf_url": "https://arxiv.org/pdf/2507.03561.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.14801",
      "title": "A new photometric ephemeris for the 2M1510 AB double brown dwarf eclipsing binary system",
      "authors": [
        "Seb T. Millward",
        "Vedad Kunovac"
      ],
      "abstract": "A new photometric ephemeris for the 2M1510 AB double brown dwarf eclipsing binary system Seb T. Millward, Vedad Kunovac 7 pages and 3 figures, accepted to MNRAS Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Eclipsing brown dwarfs are important calibrators of sub-stellar evolution models used to infer the characteristics of directly imaged brown dwarfs and giant exoplanets. Only two double brown dwarf eclipsing binary systems are known, among them 2MASS J15104786-2818174 (2M1510 AB), published in 2020 with a poorly constrained orbital period. Here we analyse TESS full-frame image (FFI) photometry of this faint ($T=15.9$) binary and detect a significant (${>}10\\sigma$) periodic signal spanning TESS Cycles 1-7, consistent with previous data. We refine the orbital period to $20.897782 \\pm 0.000036$ d, reducing its present-day uncertainty from 18 h to 8 min. Our work is crucial for scheduling follow-up observations of this system for detailed study with other photometric facilities. We also find that a recent orbital solution from Doppler data is inconsistent with existing photometry. A timing offset in the Doppler data may have produced a spurious signal mimicking retrograde apsidal precession, from which the claimed circumbinary planet 2M1510 ABb was inferred. From our best attempt at correcting the data we were unable to reconcile the radial velocity data with the photometry, suggesting that the radial velocity uncertainties are underestimated, and that the circumbinary planet 2M1510 ABb may be a false positive.",
      "pdf_url": "https://arxiv.org/pdf/2510.14801.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.21042",
      "title": "Uncovering Solar Wind Phenomena with iSAX, HDBSCAN, Human-in-the-loop and PSP Observations",
      "authors": [
        "Valmir P Moraes Filho",
        "Daniela Martin",
        "Jasmine R. Kobayashi",
        "Connor O'Brien",
        "Jinsu Hong",
        "Evangelia Samara",
        "Joseph Gallego"
      ],
      "abstract": "Uncovering Solar Wind Phenomena with iSAX, HDBSCAN, Human-in-the-loop and PSP Observations Valmir P Moraes Filho, Daniela Martin, Jasmine R. Kobayashi, Connor O'Brien, Jinsu Hong, Evangelia Samara, Joseph Gallego Solar and Stellar Astrophysics (astro-ph.SR) The solar wind is a dynamic plasma outflow that shapes heliospheric conditions and drives space weather. Identifying its large-scale phenomena is crucial, yet the increasing volume of high-cadence Parker Solar Probe (PSP) observations poses challenges for scalable, interpretable analysis. We present a pipeline combining symbolic compression, density-based clustering, and human-in-the-loop validation. Applied to 2018-2024 PSP data, it efficiently processes over 150 GB of magnetic and plasma measurements, recovering known structures, detecting uncatalogued CMEs and transient events, and demonstrating robustness across multiple time scales. A key outcome is the systematic use of the magnetic deflection angle ($\\theta_B$) as a unifying metric across solar wind phenomena. This framework provides a scalable, interpretable, expert-validated approach to solar wind analysis, producing expanded event catalogs and supporting improved space weather forecasting. The code and configuration files used in this study are publicly available to support reproducibility.",
      "pdf_url": "https://arxiv.org/pdf/2510.21042.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26964",
      "title": "IrisML: Neural Posterior Estimation for the Spectral Energy Distribution fitting",
      "authors": [
        "Mateusz Kapusta"
      ],
      "abstract": "IrisML: Neural Posterior Estimation for the Spectral Energy Distribution fitting Mateusz Kapusta Accepted at the 2025 ICML Workshop on Machine Learning for Astrophysics. Github code: this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM) Over the past 30 years, numerous large-scale photometric astronomical surveys have been conducted, including SDSS, Pan-STARRS, Gaia,2MASS, WISE, and others. These surveys provide extensive photometric measurements that can be used to infer a wide range of physical parameters of astronomical objects. Traditionally, Bayesian approaches, such as Markov Chain Monte Carlo (MCMC) sampling have been employed for such inference tasks. However, these methods tend to be computationally intensive and often require manual tuning or expert supervision. In this work, we propose a novel machine learning model designed to perform automatic and robust inference from photometric data, offering a scalable and efficient alternative to conventional techniques.",
      "pdf_url": "https://arxiv.org/pdf/2510.26964.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27032",
      "title": "Photometric Redshifts in JWST Deep Fields: A Pixel-Based Alternative with DeepDISC",
      "authors": [
        "Grant Merz",
        "Ming-Yang Zhuang",
        "Junyao Li",
        "Qian Yang",
        "Yue Shen",
        "Xin Liu",
        "John Franklin Crenshaw"
      ],
      "abstract": "Photometric Redshifts in JWST Deep Fields: A Pixel-Based Alternative with DeepDISC Grant Merz, Ming-Yang Zhuang, Junyao Li, Qian Yang, Yue Shen, Xin Liu, John Franklin Crenshaw 17 pages, 16 figures, catalog available at this https URL code available at this https URL Instrumentation and Methods for Astrophysics (astro-ph.IM) Photo-z algorithms that utilize SED template fitting have matured, and are widely adopted for use on high-redshift near-infrared data that provides a unique window into the early universe. Alternative photo-z methods have been developed, largely within the context of low-redshift optical surveys. Machine learning based approaches have gained footing in this regime, including those that utilize raw pixel information instead of aperture photometry. However, the efficacy of image-based algorithms on high-redshift, near-infrared data remains underexplored. Here, we test the performance of Detection, Instance Segmentation and Classification with Deep Learning (DeepDISC) on photometric redshift estimation with NIRCam images from the JWST Advanced Deep Extragalactic Survey (JADES) program. DeepDISC is designed to produce probabilistic photometric redshift estimates directly from images, after detecting and deblending sources in a scene. Using NIRCam-only images and a compiled catalog of spectroscopic redshifts, we show that DeepDISC produces reliable photo-zs and uncertainties comparable to those estimated from template fitting using HST+JWST filters; DeepDISC even outperforms template fitting (lower scatter/fewer outliers) when the input photometric filters are matched. Compared with template fitting, DeepDISC does not require measured photometry from images, and can produce a catalog of 94000 photo-zs in ~4 minutes on a single NVIDIA A40 GPU. While current spectroscopic training samples are small and incomplete in color-magnitude space, this work demonstrates the potential of DeepDISC for increasingly larger image volumes and spectroscopic samples from ongoing and future programs. We discuss the impact of the training data on applications to broader samples and produce a catalog of photo-zs for all JADES DR2 photometric sources in the GOOD-S field, with quality flags indicating caveats.",
      "pdf_url": "https://arxiv.org/pdf/2510.27032.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27146",
      "title": "SERVIMON: AI-Driven Predictive Maintenance and Real-Time Monitoring for Astronomical Observatories",
      "authors": [
        "Emilio Mastriani",
        "Alessandro Costa",
        "Federico Incardona",
        "Kevin Munari",
        "Sebastiano Spinello"
      ],
      "abstract": "SERVIMON: AI-Driven Predictive Maintenance and Real-Time Monitoring for Astronomical Observatories Emilio Mastriani, Alessandro Costa, Federico Incardona, Kevin Munari, Sebastiano Spinello Accepted for publication in IAU Symposium 397: Exploring the Universe with Artificial Intelligence (UniversAI 2025), Cambridge University Press. Editors: C. Sterken, J. Hearnshaw & D. Valls-Gabaud Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Objective: ServiMon is designed to offer a scalable and intelligent pipeline for data collection and auditing to monitor distributed astronomical systems such as the ASTRI Mini-Array. The system enhances quality control, predictive maintenance, and real-time anomaly detection for telescope operations. Methods: ServiMon integrates cloud-native technologies-including Prometheus, Grafana, Cassandra, Kafka, and InfluxDB-for telemetry collection and processing. It employs machine learning algorithms, notably Isolation Forest, to detect anomalies in Cassandra performance metrics. Key indicators such as read/write latency, throughput, and memory usage are continuously monitored, stored as time-series data, and preprocessed for feature engineering. Anomalies detected by the model are logged in InfluxDB v2 and accessed via Flux for real-time monitoring and visualization. Results: AI-based anomaly detection increases system resilience by identifying performance degradation at an early stage, minimizing downtime, and optimizing telescope operations. Additionally, ServiMon supports astrostatistical analysis by correlating telemetry with observational data, thus enhancing scientific data quality. AI-generated alerts also improve real-time monitoring, enabling proactive system management. Conclusion: ServiMon's scalable framework proves effective for predictive maintenance and real-time monitoring of astronomical infrastructures. By leveraging cloud and edge computing, it is adaptable to future large-scale experiments, optimizing both performance and cost. The combination of machine learning and big data analytics makes ServiMon a robust and flexible solution for modern and next-generation observational astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2510.27146.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27308",
      "title": "Moonlit sky polarization patterns from Cerro Paranal",
      "authors": [
        "B. Pereira",
        "S. Gonzalez-Gaitan",
        "A. M. Mourao",
        "J. Rino-Silvestre",
        "A. Paulino-Afonso",
        "J. P. Anderson",
        "A. Cikota",
        "A. Morales-Garoffolo"
      ],
      "abstract": "Moonlit sky polarization patterns from Cerro Paranal B. Pereira, S. Gonzalez-Gaitan, A. M. Mourao, J. Rino-Silvestre, A. Paulino-Afonso, J. P. Anderson, A. Cikota, A. Morales-Garoffolo Instrumentation and Methods for Astrophysics (astro-ph.IM) We investigate the polarization patterns from the moonlit sky as observed from the European Southern Observatory at Cerro Paranal. The moonlit sky background can be significant in astronomical observations and thus be a source of contamination in polarimetric studies. Based on sky observations during full Moon with FORS2 in imaging polarimetric mode, we measure the polarization degree and intensity at different wavelengths and scattering angles from the Moon, and compare them to theoretical and phenomenological single and multiple scattering models. Single scattering Rayleigh models are able to reproduce the wavelength dependence of the polarization as long as strong depolarization factors that increase with wavelength are introduced. Intensity data, however, require the inclusion of single Mie scattering from larger aerosol particles. The best models that simultaneously fit polarization and intensity data, are a combination of both single scattering processes, Rayleigh and Mie, plus an unpolarized multiple scattering component. Both Mie and multiple scattering become more dominant at longer wavelengths. Other factors like cloud depolarization and the sunlight contribution during the twilight were also investigated. The present study underscores the importance of accounting for moonlight scattering to enhance the accuracy of polarimetric observations of astronomical targets.",
      "pdf_url": "https://arxiv.org/pdf/2510.27308.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27050",
      "title": "Accelerating Radiative Transfer for Planetary Atmospheres by Orders of Magnitude with a Transformer-Based Machine Learning Model",
      "authors": [
        "Isaac Malsky",
        "Tiffany Kataria",
        "Natasha E. Batalha",
        "Matthew Graham"
      ],
      "abstract": "Accelerating Radiative Transfer for Planetary Atmospheres by Orders of Magnitude with a Transformer-Based Machine Learning Model Isaac Malsky, Tiffany Kataria, Natasha E. Batalha, Matthew Graham Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG) Radiative transfer calculations are essential for modeling planetary atmospheres. However, standard methods are computationally demanding and impose accuracy-speed trade-offs. High computational costs force numerical simplifications in large models (e.g., General Circulation Models) that degrade the accuracy of the simulation. Radiative transfer calculations are an ideal candidate for machine learning emulation: fundamentally, it is a well-defined physical mapping from a static atmospheric profile to the resulting fluxes, and high-fidelity training data can be created from first principles calculations. We developed a radiative transfer emulator using an encoder-only transformer neural network architecture, trained on 1D profiles representative of solar-composition hot Jupiter atmospheres. Our emulator reproduced bolometric two-stream layer fluxes with mean test set errors of ~1% compared to the traditional method and achieved speedups of 100x. Emulating radiative transfer with machine learning opens up the possibility for faster and more accurate routines within planetary atmospheric models such as GCMs.",
      "pdf_url": "https://arxiv.org/pdf/2510.27050.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27223",
      "title": "A Next-Generation Exoplanet Atmospheric Retrieval Framework NEXOTRANS for Emission Spectroscopy: New Constraints and Atmospheric Characterization of WASP-69b Using JWST NIRCam and MIRI Observations",
      "authors": [
        "Tonmoy Deka",
        "Liton Majumdar",
        "Tasneem Basra Khan",
        "Swastik Dewan",
        "Priyankush Ghosh",
        "Debayan Das",
        "Mithun Patra"
      ],
      "abstract": "A Next-Generation Exoplanet Atmospheric Retrieval Framework NEXOTRANS for Emission Spectroscopy: New Constraints and Atmospheric Characterization of WASP-69b Using JWST NIRCam and MIRI Observations Tonmoy Deka, Liton Majumdar, Tasneem Basra Khan, Swastik Dewan, Priyankush Ghosh, Debayan Das, Mithun Patra Accepted for publication in The Astrophysical Journal; 25 pages, 12 figures, and 4 tables Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Thermal emission spectra provide key insights into the atmospheric composition and especially the temperature structure of an exoplanet. With broader wavelength coverage, sensitivity and higher resolution, JWST has enabled robust constraints on these properties, including detections of photochemical products. This advances the need for retrieval frameworks capable of navigating complex parameter spaces for accurate data interpretation. In this work, we introduce the emission retrieval module of NEXOTRANS, which employs both one- and two-stream radiative transfer approximations and leverages Bayesian and machine learning techniques for retrievals. It also incorporates approximate disequilibrium chemistry models to infer photochemical species like SO2. We applied NEXOTRANS to the JWST NIRCam and MIRI emission observations of WASP-69b, covering the 2-12 microns range. The retrievals place robust constraints on the volume mixing ratios (VMR) of H2O, CO2, CO, CH4, and potential SO2. The best-fit model, i.e, free chemistry combined with non-uniform aerosol coverage, yields a log(VMR) = -3.78 (+0.15/-0.17) for H2O and -5.77 (+0.09/-0.10) for CO2 which has a sharp absorption at 4.3 micron. The second best-fit model, the hybrid equilibrium chemistry (utilizing equilibrium chemistry-grids) combined with non-uniform aerosol yields a C/O of 0.42 (+0.17/-0.13) and a metallicity of log[M/H] = 1.24 (+0.17/-0.14), corresponding to approximately 17.38 times the solar value. This hybrid chemistry retrieval also constrain SO2 with a log(VMR) = -4.85 (+0.28/-0.29), indicating possible absorption features in the 7-8 microns range. These results highlight NEXOTRANS's capability to significantly advance JWST emission spectra interpretation, offering broader insights into exoplanetary atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2510.27223.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27386",
      "title": "Stacking transmission spectra of different exoplanets",
      "authors": [
        "James Kirk",
        "James E. Owen"
      ],
      "abstract": "Stacking transmission spectra of different exoplanets James Kirk, James E. Owen 15 pages, 14 figures, submitted to MNRAS Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) In many areas of astronomy, spectra of different objects are co-added or stacked to improve signal-to-noise and reveal population-level characteristics. As the number of exoplanets with measured transmission spectra grows, it becomes important to understand when stacking spectra from different exoplanets is appropriate and what stacked spectra represent physically. Stacking will be particularly valuable for long-period planets, where repeated observations of the same planet are time-consuming. Here, we show that stacked exoplanet transmission spectra are approximately mathematically equivalent to spectra generated from the geometric mean of each planet's abundance ratios. We test this by comparing stacked and geometric mean spectra across grids of forward models over JWST's NIRSpec/G395H wavelength range (2.8-5.2$\\mu$m). For two dominant species (e.g., H$_2$O and CO$_2$), the geometric mean accurately reflects the stacked spectrum if abundance ratios are self-similar across planets. Introducing a third species (e.g., CH$_4$) makes temperature a critical factor, with stacking becoming inappropriate across the CO/CH$_4$ boundary. Surface gravity exerts only a minor influence when stacking within comparable planetary regimes. We further assess the number of stacked, distinct sub-Neptunes with high-metallicity atmospheres and low-pressure cloud decks required to rule out a flat spectrum at $>5\\sigma$, as a function of both cloud deck pressure and per-planet spectral precision. These results provide guidance on when stacking is useful and on how to interpret stacked exoplanet spectra in the era of population studies of exoplanets.",
      "pdf_url": "https://arxiv.org/pdf/2510.27386.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27673",
      "title": "Diurnal Variations of Lee Wave Clouds on Mars using Emirates eXploration Imager (EXI)",
      "authors": [
        "Mariam R. Alshamsi",
        "Mashhoor A. Al-Wardat"
      ],
      "abstract": "Diurnal Variations of Lee Wave Clouds on Mars using Emirates eXploration Imager (EXI) Mariam R. Alshamsi, Mashhoor A. Al-Wardat Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Understanding the diurnal behavior of lee wave clouds on Mars provides critical insight into the planet's mesoscale atmospheric dynamics and their interaction with surface topography. Lee wave clouds exhibit distinct spatial and temporal patterns that vary over the Martian day. In this study, we investigate the diurnal distribution and frequency of lee wave cloud activity during Martian Year (MY) 36 using observations from the EXI instrument aboard the Emirates Mars Mission (EMM) \"Hope\" spacecraft. A total of 50 lee wave events were identified, with a pronounced peak in activity during afternoon hours between solar longitudes (Ls) 270 deg and 360 deg. Our analysis reveals a seasonal and local-time dependence for these clouds, providing a comparative framework with previous mission datasets. These findings not only enhance the current understanding of Martian weather processes but also support future efforts to model and predict terrain-induced cloud dynamics across key locations on Mars.",
      "pdf_url": "https://arxiv.org/pdf/2510.27673.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.15167",
      "title": "Pointing Accuracy Improvements for the South Pole Telescope with Machine Learning",
      "authors": [
        "P. M. Chichura",
        "A. Rahlin",
        "A. J. Anderson",
        "B. Ansarinejad",
        "M. Archipley",
        "L. Balkenhol",
        "K. Benabed",
        "A. N. Bender",
        "B. A. Benson",
        "F. Bianchini",
        "L. E. Bleem",
        "F. R. Bouchet",
        "L. Bryant",
        "E. Camphuis",
        "J. E. Carlstrom",
        "C. L. Chang",
        "P. Chaubal",
        "A. Chokshi",
        "T.-L. Chou",
        "A. Coerver",
        "T. M. Crawford",
        "C. Daley",
        "T. de Haan",
        "K. R. Dibert",
        "M. A. Dobbs",
        "M. Doohan",
        "A. Doussot",
        "D. Dutcher",
        "W. Everett",
        "C. Feng",
        "K. R. Ferguson",
        "K. Fichman",
        "A. Foster",
        "S. Galli",
        "A. E. Gambrel",
        "R. W. Gardner",
        "F. Ge",
        "N. Goeckner-Wald",
        "R. Gualtieri",
        "F. Guidi",
        "S. Guns",
        "N. W. Halverson",
        "E. Hivon",
        "G. P. Holder",
        "W. L. Holzapfel",
        "J. C. Hood",
        "A. Hryciuk",
        "N. Huang",
        "F. Kéruzoré",
        "A. R. Khalife",
        "J. Kim",
        "L. Knox",
        "M. Korman",
        "K. Kornoelje",
        "C.-L. Kuo",
        "K. Levy",
        "A. E. Lowitz",
        "C. Lu",
        "A. Maniyar",
        "D. P. Marrone",
        "E. S. Martsen",
        "F. Menanteau",
        "M. Millea",
        "J. Montgomery",
        "Y. Nakato",
        "T. Natoli",
        "G. I. Noble",
        "Y. Omori",
        "S. Padin",
        "Z. Pan",
        "P. Paschos",
        "K. A. Phadke",
        "A. W. Pollak",
        "K. Prabhu",
        "W. Quan",
        "M. Rahimi",
        "C. L. Reichardt",
        "M. Rouble",
        "J. E. Ruhl",
        "E. Schiappucci",
        "J. A. Sobrin",
        "A. A. Stark",
        "J. Stephen",
        "C. Tandoi",
        "B. Thorne",
        "C. Trendafilova",
        "C. Umilta",
        "J. Veitch-Michaelis",
        "J. D. Vieira",
        "A. Vitrier",
        "Y. Wan",
        "N. Whitehorn",
        "W. L. K. Wu",
        "M. R. Young",
        "K. Zagorski",
        "J. A. Zebrowski"
      ],
      "abstract": "Pointing Accuracy Improvements for the South Pole Telescope with Machine Learning P. M. Chichura, A. Rahlin, A. J. Anderson, B. Ansarinejad, M. Archipley, L. Balkenhol, K. Benabed, A. N. Bender, B. A. Benson, F. Bianchini, L. E. Bleem, F. R. Bouchet, L. Bryant, E. Camphuis, J. E. Carlstrom, C. L. Chang, P. Chaubal, A. Chokshi, T.-L. Chou, A. Coerver, T. M. Crawford, C. Daley, T. de Haan, K. R. Dibert, M. A. Dobbs, M. Doohan, A. Doussot, D. Dutcher, W. Everett, C. Feng, K. R. Ferguson, K. Fichman, A. Foster, S. Galli, A. E. Gambrel, R. W. Gardner, F. Ge, N. Goeckner-Wald, R. Gualtieri, F. Guidi, S. Guns, N. W. Halverson, E. Hivon, G. P. Holder, W. L. Holzapfel, J. C. Hood, A. Hryciuk, N. Huang, F. Kéruzoré, A. R. Khalife, J. Kim, L. Knox, M. Korman, K. Kornoelje, C.-L. Kuo, K. Levy, A. E. Lowitz, C. Lu, A. Maniyar, D. P. Marrone, E. S. Martsen, F. Menanteau, M. Millea, J. Montgomery, Y. Nakato, T. Natoli, G. I. Noble, Y. Omori, S. Padin, Z. Pan, P. Paschos, K. A. Phadke, A. W. Pollak, K. Prabhu, W. Quan, M. Rahimi, C. L. Reichardt, M. Rouble, J. E. Ruhl, E. Schiappucci, J. A. Sobrin, A. A. Stark, J. Stephen, C. Tandoi, B. Thorne, C. Trendafilova, C. Umilta, J. Veitch-Michaelis, J. D. Vieira, A. Vitrier, Y. Wan, N. Whitehorn, W. L. K. Wu, M. R. Young, K. Zagorski, J. A. Zebrowski 25 pages, 10 figures, accepted in Journal of Astronomical Instrumentation (JAI) J.Astron.Instrum. 14:1n02 (2025) 2550001 Instrumentation and Methods for Astrophysics (astro-ph.IM) We present improvements to the pointing accuracy of the South Pole Telescope (SPT) using machine learning. The ability of the SPT to point accurately at the sky is limited by its structural imperfections, which are impacted by the extreme weather at the South Pole. Pointing accuracy is particularly important during SPT participation in observing campaigns with the Event Horizon Telescope (EHT), which requires stricter accuracy than typical observations with the SPT. We compile a training dataset of historical observations of astronomical sources made with the SPT-3G and EHT receivers on the SPT. We train two XGBoost models to learn a mapping from current weather conditions to two telescope drive control arguments -- one which corrects for errors in azimuth and the other for errors in elevation. Our trained models achieve root mean squared errors on withheld test data of $2.14''$ in cross-elevation and $3.57''$ in elevation, well below our goal of $5''$ along each axis. We deploy our models on the telescope control system and perform further in situ test observations during the EHT observing campaign in 2024 April. Our models result in significantly improved pointing accuracy: for sources within the range of input variables where the models are best trained, average combined pointing error improved 33%, from $15.9''$ to $10.6''$. These improvements, while significant, fall shy of our ultimate goal, but they serve as a proof of concept for the development of future models. Planned upgrades to the EHT receiver on the SPT will necessitate even stricter pointing accuracy which will be achievable with our methods.",
      "pdf_url": "https://arxiv.org/pdf/2412.15167.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.15315",
      "title": "Neural Posterior Estimation for Cataloging Astronomical Images from the Legacy Survey of Space and Time",
      "authors": [
        "Yicun Duan",
        "Xinyue Li",
        "Camille Avestruz",
        "Jeffrey Regier"
      ],
      "abstract": "Neural Posterior Estimation for Cataloging Astronomical Images from the Legacy Survey of Space and Time Yicun Duan, Xinyue Li, Camille Avestruz, Jeffrey Regier Instrumentation and Methods for Astrophysics (astro-ph.IM); Computer Vision and Pattern Recognition (cs.CV); Applications (stat.AP) The Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST) will commence full-scale operations in 2026, yielding an unprecedented volume of astronomical images. Constructing an astronomical catalog, a table of imaged stars, galaxies, and their properties, is a fundamental step in most scientific workflows based on astronomical image data. Traditional deterministic cataloging methods lack statistical coherence as cataloging is an ill-posed problem, while existing probabilistic approaches suffer from computational inefficiency, inaccuracy, or the inability to perform inference with multiband coadded images, the primary output format for LSST images. In this article, we explore a recently developed Bayesian inference method called neural posterior estimation (NPE) as an approach to cataloging. NPE leverages deep learning to achieve both computational efficiency and high accuracy. When evaluated on the DC2 Simulated Sky Survey -- a highly realistic synthetic dataset designed to mimic LSST data -- NPE systematically outperforms the standard LSST pipeline in light source detection, flux measurement, star/galaxy classification, and galaxy shape measurement. Additionally, NPE provides well-calibrated posterior approximations. These promising results, obtained using simulated data, illustrate the potential of NPE in the absence of model misspecification. Although some degree of model misspecification is inevitable in the application of NPE to real LSST images, there are a variety of strategies to mitigate its effects.",
      "pdf_url": "https://arxiv.org/pdf/2510.15315.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.CV",
        "stat.AP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.26882",
      "title": "Saving Doomed Planets: Mass Loss and Angular Momentum Return Boost Hot Jupiter Survival Rates",
      "authors": [
        "Grant C. Weldon",
        "Bradley M. S. Hansen",
        "Smadar Naoz"
      ],
      "abstract": "Saving Doomed Planets: Mass Loss and Angular Momentum Return Boost Hot Jupiter Survival Rates Grant C. Weldon, Bradley M. S. Hansen, Smadar Naoz Earth and Planetary Astrophysics (astro-ph.EP) The existence of giant extrasolar planets on short-period orbits (\"hot Jupiters\") represents a challenge to theories of planet formation. A leading explanation invokes perturbations from distant companions, i.e., the Eccentric Kozai-Lidov (EKL) mechanism, which can excite the eccentricities of initially wide-orbiting planets to values of order unity. The resulting tidal dissipation at periastron shrinks and circularizes the orbits to their observed configurations. While observations of orbital misalignment and distant companions support this scenario, theoretical models have struggled to reproduce the observed hot Jupiter occurrence rate. Population synthesis studies often predict that many source \"cold Jupiters\" are destroyed by tidal disruption during highly eccentric passages. We revisit this question with improved treatments of the mass loss and angular momentum return experienced by tidally perturbed planets. Numerical studies are performed by combining secular dynamical evolution with planetary structural evolution using Modules for Experiments in Stellar Astrophysics (MESA). We also use an analytical approach to estimate rates of tidal disruption and hot Jupiter survival. Our new population synthesis studies of giant planets in stellar binaries show that improved treatment of tidal mass loss enhances hot Jupiter survival by a factor of $\\sim2-3$, yielding occurrence rates ($\\gtrsim 0.5\\%$ around FGK stars) consistent with observations. Angular momentum return from mass accreted onto the star may also produce a pileup of hot Jupiters near three-day orbital periods that is in statistical agreement with observations. These results suggest that EKL-driven high-eccentricity migration, when combined with realistic planetary mass loss, may be a dominant channel for hot Jupiter formation.",
      "pdf_url": "https://arxiv.org/pdf/2510.26882.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27092",
      "title": "Micrometeoroid Impacts: Dual Pathways for Iron Reduction and Oxidation on Lunar and Asteroidal Surfaces",
      "authors": [
        "Ziyu Huang",
        "Masatoshi Hirabayashi",
        "Thomas M. Orlando"
      ],
      "abstract": "Micrometeoroid Impacts: Dual Pathways for Iron Reduction and Oxidation on Lunar and Asteroidal Surfaces Ziyu Huang, Masatoshi Hirabayashi, Thomas M. Orlando 10 pages, 4 figures. Accepted for publication in The Astrophysical Journal Earth and Planetary Astrophysics (astro-ph.EP); Geophysics (physics.geo-ph) Nanophase metallic iron ( $\\mathrm{npFe}^0$ ) is a key indicator of space weathering on the lunar surface, primarily attributed to solar wind irradiation and micrometeoroid impacts. Recent discoveries of hematite ( $\\mathrm{Fe}_2 \\mathrm{O}_3$ ), a highly oxidized form of iron, in the lunar polar regions challenge the prevailing understanding of the Moon's reducing environment. This study, using ReaxFF molecular dynamics simulations of micrometeoroid impacts on fayalite ( $\\mathrm{Fe}_2 \\mathrm{SiO}_4$ ), investigates the atomistic mechanisms leading to both reduced and oxidized iron species. Our simulations reveals that the high-temperature and pressure conditions at the impact crater surface produces a reduced iron environment while providing a transient oxygen-rich environment in the expanding plume. Our findings bridge previously disparate observations-linking impact-driven $\\mathrm{npFe}^0$ formation to the puzzling presence of oxidized iron phases on the Moon, completing the observed strong dichotomous distribution of hematite between the nearside and farside of the Moon. These findings highlight that micrometeoroid impacts, by simultaneously generating spatially distinct redox environments, provide a formation mechanism that reconciles the ubiquitous identification of nanophase metallic iron ( $\\mathrm{npFe}^0$ ) in returned lunar samples with $\\mathrm{Fe}^{3+}$ signatures detected by remote sensing. This underscores the dynamic nature of space weathering processes. For a more nuanced understanding of regolith evolution, we should also consider the presence of different generations or types of $\\mathrm{npFe}{ }^0$, such as those formed from solar wind reduction versus impact disproportionation.",
      "pdf_url": "https://arxiv.org/pdf/2510.27092.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27373",
      "title": "Assessing the metal and rare earth element mining potential of undifferentiated asteroids through the study of carbonaceous chondrites",
      "authors": [
        "Josep M. Trigo-Rodríguez",
        "Pau Grèbol-Tomàs",
        "Jordi Ibáñez-Insa",
        "Jacinto Alonso-Azcárate",
        "Maria Gritsevich"
      ],
      "abstract": "Assessing the metal and rare earth element mining potential of undifferentiated asteroids through the study of carbonaceous chondrites Josep M. Trigo-Rodríguez, Pau Grèbol-Tomàs, Jordi Ibáñez-Insa, Jacinto Alonso-Azcárate, Maria Gritsevich 15 pages, 8 figures. Accepted for publication in Monthly Notices of the Royal Astronomical Society Earth and Planetary Astrophysics (astro-ph.EP) Undifferentiated asteroids, particularly the parent bodies of carbon-rich chondrite groups, might be promising candidates for future space resource utilization due to their primitive composition and potential to host valuable metals and rare earth elements. However, our understanding of their bulk elemental composition remains limited, as most data are derived from reflectance spectra with low mineralogical resolution. Sample return missions have started to change that, as returned materials are already available to study. Still the available meteorites provide a valuable source of information about the diversity of undifferentiated asteroids in the interplanetary space. To improve compositional insights, we conducted Inductively Coupled Plasma Mass Spectrometry (ICP-MS) and ICP-AES (Inductively coupled Plasma Atomic Emission Spectroscopy) analyses on a representative suite of carbonaceous chondrites. These meteorites, considered analogs of undifferentiated asteroids, preserve materials from the early solar system and provide a geochemical record of their parent bodies. Our results highlight the abundance and distribution of transition metals, siderophile elements, and rare earth elements across several chondrite groups. These findings support the view that C-type asteroids may serve as viable sources of critical materials, while also informing future mission planning, extraction strategies, and the development of new technologies for low-gravity resource operations.",
      "pdf_url": "https://arxiv.org/pdf/2510.27373.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27390",
      "title": "Brightness variability in polar circumbinary disks",
      "authors": [
        "Ian Rabago",
        "Giuseppe Lodato",
        "Stefano Facchini",
        "Zhaohuan Zhu"
      ],
      "abstract": "Brightness variability in polar circumbinary disks Ian Rabago, Giuseppe Lodato, Stefano Facchini, Zhaohuan Zhu 10 pages, 9 figures, 2 tables. Accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) In binary systems with a strongly misaligned disk, the central binary stars can travel a significant vertical distance above and below the disk's orbital plane. This can cause large changes in illumination of the disk over the course of the binary orbital period. We use both analytic and radiative transfer models to examine the effect of changes in stellar illumination on the appearance of the disk, particularly in the case of the polar disk HD 98800B. We find that the observed flux from the disk can vary significantly over the binary orbital period, producing a periodically varying lightcurve which peaks twice each binary orbit. The amount of flux variation is strongly influenced by the disk geometry. We suggest that these flux variations produce several observable signatures, and that these observables may provide constraints on different properties of the disk such as its vertical structure, geometry, and cooling rate.",
      "pdf_url": "https://arxiv.org/pdf/2510.27390.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27468",
      "title": "Dust and Water in V883 Ori: Relics of a Retreating Snowline",
      "authors": [
        "Yu Wang",
        "Chris W. Ormel",
        "Hao-Chang Jiang",
        "Sebastiaan Krijt",
        "Adrien Houge",
        "Enrique Macías"
      ],
      "abstract": "Dust and Water in V883 Ori: Relics of a Retreating Snowline Yu Wang, Chris W. Ormel, Hao-Chang Jiang, Sebastiaan Krijt, Adrien Houge, Enrique Macías Accepted for publication in A&A Letter Earth and Planetary Astrophysics (astro-ph.EP) V883 Ori is an FU-Orionis-type outburst system characterized by a shoulder at 50-70 au in its ALMA band 6 and 7 intensity profiles. Previously, this feature was attributed to dust pile-up from pebble disintegration at the water snowline. However, recent multi-wavelength observations show continuity in the spectral index across the expected snowline region, disfavoring abrupt changes in grain properties. Moreover, extended water emission is detected beyond 80 au, pointing to a snowline further out. This Letter aims to explain both features with a model in which the snowline is receding. We construct a 2D disk model that solves the cooling and subsequent vapor recondensation during the post-outburst dimming phase. Our results show that both the intensity shoulder and the extended water emission are natural relics of a retreating snowline: the shoulder arises from excess surface density generated by vapor recondensation at the moving condensation front, while the outer water vapor reservoir persists due to the long recondensation timescales of $10^{2}-10^{3}$ yr at the disk atmosphere. As V883 Ori continues to fade, we predict that the intensity shoulder will migrate inward by an observationally significant amount of 10 au over about 25 years.",
      "pdf_url": "https://arxiv.org/pdf/2510.27468.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}