{
  "date": "2025-11-11",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.IM",
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.SR",
    "astro-ph.CO",
    "astro-ph.EP"
  ],
  "total_papers": 108,
  "gw_related_papers": 6,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2411.12026",
      "title": "Modified Gravity Constraints from the Full Shape Modeling of Clustering Measurements from DESI 2024",
      "authors": [
        "M. Ishak",
        "J. Pan",
        "R. Calderon",
        "K. Lodha",
        "G. Valogiannis",
        "A. Aviles",
        "G. Niz",
        "L. Yi",
        "C. Zheng",
        "C. Garcia-Quintero",
        "A. de Mattia",
        "L. Medina-Varela",
        "J. L. Cervantes-Cota",
        "U. Andrade",
        "D. Huterer",
        "H. E. Noriega",
        "G. Zhao",
        "A. Shafieloo",
        "W. Fang",
        "S. Ahlen",
        "D. Bianchi",
        "D. Brooks",
        "E. Burtin",
        "E. Chaussidon",
        "T. Claybaugh",
        "S. Cole",
        "A. de la Macorra",
        "Arjun Dey",
        "K. Fanning",
        "S. Ferraro",
        "A. Font-Ribera",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "H. Gil-Marín",
        "S. Gontcho A Gontcho",
        "G. Gutierrez",
        "C. Hahn",
        "K. Honscheid",
        "C. Howlett",
        "S. Juneau",
        "D. Kirkby",
        "T. Kisner",
        "A. Kremin",
        "M. Landriau",
        "L. Le Guillou",
        "A. Leauthaud",
        "M. E. Levi",
        "A. Meisner",
        "R. Miquel",
        "J. Moustakas",
        "J. A. Newman",
        "N. Palanque-Delabrouille",
        "W. J. Percival",
        "C. Poppett",
        "F. Prada",
        "I. Pérez-Ràfols",
        "A. J. Ross",
        "G. Rossi",
        "E. Sanchez",
        "D. Schlegel",
        "M. Schubnell",
        "H. Seo",
        "D. Sprayberry",
        "G. Tarlé",
        "M. Vargas-Magana",
        "B. A. Weaver",
        "R. H. Wechsler",
        "C. Yèche",
        "P. Zarrouk",
        "R. Zhou",
        "H. Zou"
      ],
      "abstract": "Modified Gravity Constraints from the Full Shape Modeling of Clustering Measurements from DESI 2024 M. Ishak, J. Pan, R. Calderon, K. Lodha, G. Valogiannis, A. Aviles, G. Niz, L. Yi, C. Zheng, C. Garcia-Quintero, A. de Mattia, L. Medina-Varela, J. L. Cervantes-Cota, U. Andrade, D. Huterer, H. E. Noriega, G. Zhao, A. Shafieloo, W. Fang, S. Ahlen, D. Bianchi, D. Brooks, E. Burtin, E. Chaussidon, T. Claybaugh, S. Cole, A. de la Macorra, Arjun Dey, K. Fanning, S. Ferraro, A. Font-Ribera, J. E. Forero-Romero, E. Gaztañaga, H. Gil-Marín, S. Gontcho A Gontcho, G. Gutierrez, C. Hahn, K. Honscheid, C. Howlett, S. Juneau, D. Kirkby, T. Kisner, A. Kremin, M. Landriau, L. Le Guillou, A. Leauthaud, M. E. Levi, A. Meisner, R. Miquel, J. Moustakas, J. A. Newman, N. Palanque-Delabrouille, W. J. Percival, C. Poppett, F. Prada, I. Pérez-Ràfols, A. J. Ross, G. Rossi, E. Sanchez, D. Schlegel, M. Schubnell, H. Seo, D. Sprayberry, G. Tarlé, M. Vargas-Magana, B. A. Weaver, R. H. Wechsler, C. Yèche, P. Zarrouk, R. Zhou, H. Zou (DESI Collaboration) 57 pages, 14 figures. This DESI Collaboration Publication is part of the 2024 publication series using the first year of observations and the full shape modeling (see this https URL). Expanded discussions; added comments about EFT MG results. JCAP published version Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) We present cosmological constraints on deviations from general relativity (GR) from the first-year of clustering observations from Dark Energy Spectroscopic Instrument (DESI) in combination with other datasets. We first consider $\\mu(a,k)$-$\\Sigma(a,k)$ modified gravity (MG) parametrization (as well as $\\eta(a,k)$) in flat $\\Lambda$CDM and $w_0 w_a$CDM backgrounds. Using a functional form for time-only evolution gives $\\mu_0=0.11^{+0.44}_{-0.54}$ from DESI(FS+BAO)+BBN and a wide prior on $n_{s}$. Using DESI(FS+BAO)+CMB+DESY3+DESY5-SN, we obtain $\\mu_0=0.05\\pm 0.22$ and $\\Sigma_0=0.008\\pm 0.045$ in the $\\Lambda$CDM background. In $w_0 w_a$CDM, we obtain $\\mu_0=-0.24^{+0.32}_{-0.28}$ and $\\Sigma_0=0.006\\pm 0.043$, consistent with GR, and still find a preference for dynamical dark energy with $w_0>-1$ and $w_a<0$. We then use binned forms in the 2 backgrounds starting with 2 bins in redshift and then adding 2 bins in scale for a total of 4 and 8 MG parameters, respectively. All MG parameters are found consistent with GR. We also find that the tension reported for $\\Sigma_0$ with GR from Planck PR3 goes away when using LoLLiPoP+HiLLiPoP likelihoods. As noted previously, this seems to indicate the tension is related to CMB lensing anomaly in PR3 which is also resolved when using these likelihoods. We then constrain the class of Horndeski theory in both EFT-basis and $\\alpha$-basis. Assuming a power law for the non-minimal coupling function $\\Omega$, we obtain $\\Omega_0=0.012^{+0.001}_{-0.012}$ and $s_0=0.996^{+0.54}_{-0.20}$ from DESI(FS+BAO)+DESY5SN+CMB in a $\\Lambda$CDM background, consistent with GR. Using the $\\alpha$-basis with no-braiding ($\\alpha_B=0$) gives $c_M<1.14$, in agreement with GR. However, we see a mild yet consistent indication for $c_B>0$ when $\\alpha_B$ is varied which will require further study to determine whether this is due to systematics or new physics. [Abridged]",
      "pdf_url": "https://arxiv.org/pdf/2411.12026.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04730",
      "title": "SGNL: Scalable Low-Latency Gravitational Wave Detection Pipeline for Compact Binary Mergers",
      "authors": [
        "Yun-Jing Huang",
        "Chad Hanna",
        "Leo Tsukada",
        "Amanda Baylor",
        "Patrick Godwin",
        "Prathamesh Joshi",
        "James Kennington",
        "Cody Messick",
        "Surabhi Sachdev",
        "Ron Tapia",
        "Zach Yarbrough"
      ],
      "abstract": "SGNL: Scalable Low-Latency Gravitational Wave Detection Pipeline for Compact Binary Mergers Yun-Jing Huang, Chad Hanna, Leo Tsukada, Amanda Baylor, Patrick Godwin, Prathamesh Joshi, James Kennington, Cody Messick, Surabhi Sachdev, Ron Tapia, Zach Yarbrough Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) We present SGNL, a scalable, low-latency gravitational-wave search pipeline. It reimplements the core matched-filtering principles of the GstLAL pipeline within a modernized framework. The Streaming Graph Navigator library, a lightweight Python streaming framework, replaces GstLAL's GStreamer infrastructure, simplifying pipeline construction and enabling flexible, modular graph design. The filtering core is reimplemented in PyTorch, allowing SGNL to leverage GPU acceleration for improved computational scalability. We describe the pipeline architecture and introduce a novel implementation of the Low-Latency Online Inspiral Detection algorithm in which components are pre-synchronized to reduce latency. Results from a 40-day Mock Data Challenge show that SGNL's event recovery and sensitivity are consistent with GstLAL's within statistical and systematic uncertainties. Notably, SGNL achieves a median latency of 5.4 seconds, a 42\\% reduction compared to GstLAL's 9.3 seconds.",
      "pdf_url": "https://arxiv.org/pdf/2511.04730.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.04786",
      "title": "How Low Can You Go: Constraining the Effects of Catalog Incompleteness on Dark Siren Cosmology",
      "authors": [
        "Madison VanWyngarden",
        "Maya Fishbach",
        "Aditya Vijaykumar",
        "Alexandra G. Guerrero",
        "Daniel E. Holz"
      ],
      "abstract": "How Low Can You Go: Constraining the Effects of Catalog Incompleteness on Dark Siren Cosmology Madison VanWyngarden, Maya Fishbach, Aditya Vijaykumar, Alexandra G. Guerrero, Daniel E. Holz To be submitted to ApJ, 12 pages, 7 figures Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) Gravitational waves (GWs) serve as standard sirens by directly encoding the luminosity distance to their source. When the host galaxy redshift is known, for example, through observation of an electromagnetic (EM) counterpart, GW detections can provide an independent measurement of the Hubble constant, $H_0$. However, even in the absence of an EM counterpart, inferring $H_0$ is possible through the dark siren method. In this approach, every galaxy in the GW localization volume is considered a potential host that contributes to a measurement of $H_0$, with redshift information supplied by galaxy catalogs. Using mock galaxy catalogs, we explore the effect of catalog incompleteness on dark siren measurements of $H_0$. We find that in the case of well-localized GW events, if GW hosts are found in all galaxies with host halo masses $M_h > 2 \\times10^{11} M_{\\odot}h^{-1}$, catalogs only need to be complete down to the 1% brightest magnitude $M_i < -22.43$ to draw an unbiased, informative posterior on H0. We demonstrate that this is a direct result of the clustering of fainter galaxies around brighter and more massive galaxies. For a mock galaxy catalog without clustering, or for GW localization volumes that are too large, using only the brightest galaxies results in a biased $H_0$ posterior. These results are important for informing future dark siren analyses with LIGO-Virgo-KAGRA as well as next-generation detectors.",
      "pdf_url": "https://arxiv.org/pdf/2511.04786.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.05062",
      "title": "Probing Lorentz Invariance Violation at High Energies Using LHAASO Observations of GRB221009A via DisCan Algorithm",
      "authors": [
        "Yu-Chen Hua",
        "Xiao-Jun Bi",
        "Yu-Ming Yang",
        "Peng-Fei Yin"
      ],
      "abstract": "Probing Lorentz Invariance Violation at High Energies Using LHAASO Observations of GRB221009A via DisCan Algorithm Yu-Chen Hua, Xiao-Jun Bi, Yu-Ming Yang, Peng-Fei Yin High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The Lorentz invariance violation (LIV) predicted by some quantum gravity theories would manifest as an energy-dependent speed of light, which may potentially distort the observed temporal profile of photons from astrophysical sources at cosmological distances. The dispersion cancellation (DisCan) algorithm offers a powerful methodology for investigating such effects by employing quantities such as Shannon entropy, which reflects the initial temporal characteristics. In this study, we apply the DisCan algorithm to search for LIV effects in the LHAASO observations of GRB 221009A, combining data from both the WCDA and KM2A detectors that collectively span an energy range of $\\sim 0.2-13$ TeV. Our analysis accounts for the uncertainties from both energy resolution and temporal binning. We derive $95\\%$ confidence level lower limits on the LIV energy scale of $E_{\\rm{QG}}/10^{19}~\\text{GeV}>21.1$ (13.8) for the first-order subluminal (superluminal) scenario, and $E_{\\rm{QG}}/10^{11}~\\text{GeV}> 14.9$ (13.7) for the second-order subluminal (superluminal) scenario.",
      "pdf_url": "https://arxiv.org/pdf/2511.05062.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05279",
      "title": "Focus Point on Tensions in Cosmology from Early to Late Universe: Part II: New Directions in the Light of Observations from the Most Modern Astronomical Facilities",
      "authors": [
        "S. Capozziello",
        "E. Di Valentino",
        "V.G. Gurzadyan"
      ],
      "abstract": "Focus Point on Tensions in Cosmology from Early to Late Universe: Part II: New Directions in the Light of Observations from the Most Modern Astronomical Facilities S. Capozziello, E. Di Valentino, V.G. Gurzadyan Eur. Phys. J. Plus 140, 1011 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc) The papers included in this Focus Point collection are devoted to the studies on the cosmological tensions and challenges stimulated by the latest observational data. The first results of the LARES-2 laser ranging satellite on the high precision testing of the frame-dragging effect predicted by General Relativity are presented. The data on the S-stars monitoring in the Galactic center obtained by GRAVITY collaboration were analysed within the Physics-informed neural network (PINN) approach. The results enabled to probe the role of the cosmological constant, of the dark matter, the star cluster in the core of the Galaxy obtaining an upper limit for the star density. The topics include the conversion of high-frequency relic gravitational waves into photons in cosmological magnetic field, cosmological gravitational waves stochastic background generation through the spontaneous breaking of a global baryon number symmetry, observational predictions of the Starobinsky inflation model and other studies.",
      "pdf_url": "https://arxiv.org/pdf/2511.05279.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.05316",
      "title": "A subpopulation of low-mass, spinning black holes: signatures of dynamical assembly",
      "authors": [
        "Hui Tong",
        "Thomas A. Callister",
        "Maya Fishbach",
        "Eric Thrane",
        "Fabio Antonini",
        "Simon Stevenson",
        "Isobel M. Romero-Shaw",
        "Fani Dosopoulou"
      ],
      "abstract": "A subpopulation of low-mass, spinning black holes: signatures of dynamical assembly Hui Tong, Thomas A. Callister, Maya Fishbach, Eric Thrane, Fabio Antonini, Simon Stevenson, Isobel M. Romero-Shaw, Fani Dosopoulou High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Gravitational-wave observations of massive, rapidly spinning binary black holes mergers provide increasing evidence for the dynamical origin of some mergers. Previous studies have interpreted the mergers with primary mass $\\gtrsim45\\,M_\\odot$ as being dominated by hierarchical, second-generation mergers, with rapidly spinning primaries being the products of previous black hole mergers assembled in dense stellar clusters. In this work, we reveal confident evidence of another subpopulation with rapid and isotropic spins at low mass containing the two exceptional events GW241011 and GW241110, consistent with a hierarchical merger hypothesis. Our result suggests the mass distribution of the second-generation black holes is peaked at low primary masses of $\\sim16\\,M_\\odot$ rather than $\\gtrsim45\\,M_\\odot$ in the pair-instability gap. Such low-mass second-generation black holes must be formed from the merger of even lighter first-generation black holes, implying that dense, metal-rich stellar environments contribute to the binary black hole population. By separating the contamination of higher-generation black holes, our result reveals the primary mass distribution of first-generation black holes formed from stellar collapse, which shows a significant dip between $\\sim12\\,M_\\odot$ to $\\sim20\\,M_\\odot$. This may indicate a dearth of black holes due to variation in the core compactness of the progenitor.",
      "pdf_url": "https://arxiv.org/pdf/2511.05316.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2502.13644",
      "title": "Dynamics of $Z_N$ domain walls with bias directions",
      "authors": [
        "Yuan-Jie Li",
        "Jing Liu",
        "Zong-Kuan Guo"
      ],
      "abstract": "Dynamics of $Z_N$ domain walls with bias directions Yuan-Jie Li, Jing Liu, Zong-Kuan Guo Phys. Rev. D 112, 103510 (2025) Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The spontaneous breaking of a discrete symmetry can lead to the formation of domain walls in the early Universe. In this work, we explore the impact of bias directions on the dynamics of $Z_N$ domain walls, mainly focusing on the $N = 3$ model with a biased potential. Utilizing the Press-Ryden-Spergel method, we numerically investigate the dynamics of domain walls with lattice simulations. We find notable differences in the dynamics of domain walls due to bias directions. Our results indicate that the annihilation time depends not only on the vacuum energy difference $\\delta V$ but also on bias directions described by the relative potential difference $ \\zeta $.",
      "pdf_url": "https://arxiv.org/pdf/2502.13644.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.09426",
      "title": "Jet-environment interaction after delayed collapse in binary neutron star mergers",
      "authors": [
        "Jay V. Kalinani",
        "Riccardo Ciolfi",
        "Manuela Campanelli",
        "Bruno Giacomazzo",
        "Andrea Pavan",
        "Allen Wen",
        "Yosef Zlochower"
      ],
      "abstract": "Jet-environment interaction after delayed collapse in binary neutron star mergers Jay V. Kalinani, Riccardo Ciolfi, Manuela Campanelli, Bruno Giacomazzo, Andrea Pavan, Allen Wen, Yosef Zlochower 9 pages, 11 figures (including supplemental material) High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc) We present general relativistic magnetohydrodynamic simulations of binary neutron star (BNS) mergers, where the collapse of the metastable massive neutron star (MNS) remnant leads to the production of an incipient jet having terminal Lorentz factor and Poynting-flux luminosity compatible with a short gamma-ray burst (GRB). We consider different MNS lifetimes of about 25 and 50 ms, long enough for massive polar outflows to emerge before black hole (BH) formation. The interaction of the following BH-driven jet with such polar outflows, responsible for shock heating and possible electromagnetic signatures, is self-consistently captured for the first time. Exploiting an unprecedentedly low numerical density floor scaling as r^-6, we explore the jet propagation up to distances of ~10^4 km. Comparing the outcome of different MNS lifetimes, we find that the latter, by strongly affecting the propagation environment, plays a major role in determining the final properties of the escaping jet. Finally, we consider a non-collapsing case, where the MNS-driven outflow is found too dense and slow to be compatible with a GRB jet, thus favoring a BH central engine scenario.",
      "pdf_url": "https://arxiv.org/pdf/2505.09426.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.10811",
      "title": "On the calculation of p-values for quadratic statistics in Pulsar Timing Arrays",
      "authors": [
        "Rutger van Haasteren"
      ],
      "abstract": "On the calculation of p-values for quadratic statistics in Pulsar Timing Arrays Rutger van Haasteren Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Pulsar Timing Array (PTA) projects have reported various lines of evidence suggesting the presence of a stochastic gravitational wave (GW) background in their data. One key line of evidence involves a detection statistic sensitive to inter-pulsar correlations, such as those induced by GWs. A $p$-value is then calculated to assess how unlikely it is for the observed signal to arise under the null hypothesis $H_0$, purely by chance. However, PTAs cannot empirically draw samples from $H_0$. As a workaround, various techniques are used in the literature to approximate $p$-values under $H_0$. One such technique, which has been heralded as a model-independent method, is the use of \"scrambling\" transformations that modify the data to cancel out pulsar correlations, thereby simulating realizations from $H_0$. In this work, scrambling methods and the detection statistic are investigated from first principles. The $p$-value methodology that is discussed is general, but the discussions regarding a specific detection statistic apply to the detection of a stochastic background of gravitational waves with PTAs. All methods in the literature to calculate $p$-values for such a detection statistic are rigorously analyzed, and many analytical expressions are derived. All this leads to the conclusion that scrambling methods are not model-independent and thus not completely empirical. Rigorous Bayesian and Frequentist $p$-value calculation methods are advocated, the evaluation of which depend on the generalized $\\chi^2$ distribution. This view is consistent with the posterior predictive $p$-value approach that is already in the literature. Efficient expressions are derived to evaluate the generalized $\\chi^2$ distribution of the detection statistic on real data. It is highlighted that no Frequentist $p$-values have been calculated correctly in the PTA literature to date.",
      "pdf_url": "https://arxiv.org/pdf/2506.10811.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.04733",
      "title": "Combining CMB datasets with consistent foreground modelling",
      "authors": [
        "M. Tristram",
        "M. Douspis",
        "A. Gorce",
        "S. Henrot-Versillé",
        "L. T. Hergt",
        "S. Ilic",
        "L. McBride",
        "M. Muñoz-Echeverría",
        "E. Pointecouteau",
        "L. Salvati"
      ],
      "abstract": "Combining CMB datasets with consistent foreground modelling M. Tristram, M. Douspis, A. Gorce, S. Henrot-Versillé, L. T. Hergt, S. Ilic, L. McBride, M. Muñoz-Echeverría, E. Pointecouteau, L. Salvati 12 pages, 17 figures, 5 appendix pages. submitted to A&A Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a joint cosmological analysis combining data from the Planck satellite, the Atacama Cosmology Telescope, and the South Pole Telescope, constructing a unified likelihood that reproduces the measured temperature and polarisation power spectra by jointly modelling the cosmic microwave background (CMB) signal, galactic and extragalactic foregrounds, and instrumental systematics across all datasets. This approach reduces reliance on external priors and improves the robustness of parameter estimation. Within this joint analysis, $\\Lambda$CDM parameters exhibit remarkable stability with respect to variations in foreground modelling. Extended cosmological parameters are more sensitive to these assumptions, with uncertainties increasing by up to 35%. Despite this, the combined constraints show no significant deviation from $\\Lambda$CDM expectations, and several previously reported tensions -- such as the preference for non-zero curvature or the excess of lensing amplitude A_L -- are significantly reduced or resolved. In contrast, the determination of foreground parameters more severely depends on the assumptions made about the underlying models. Overall, this work demonstrates the feasibility and reliability of a fully joint analysis of current CMB experiments, and emphasizes the importance of consistent and accurate foreground modelling for the scientific goals of next-generation, high-sensitivity CMB surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.04733.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04734",
      "title": "Large-Scale Structure Probes of the Post-Inflationary Axiverse",
      "authors": [
        "Marco Gorghetto",
        "Sokratis Trifinopoulos",
        "Georgios Valogiannis"
      ],
      "abstract": "Large-Scale Structure Probes of the Post-Inflationary Axiverse Marco Gorghetto, Sokratis Trifinopoulos, Georgios Valogiannis Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We study the cosmology of axions in the post-inflationary scenario, where random initial conditions and the ensuing string-domain-wall network generate an isocurvature power spectrum. Axions radiated from strings behave as warm, wave-like dark matter: when they constitute the full dark matter abundance, free streaming sets the strongest bounds on their mass. For subdominant fractions, despite being warm, they still lead to an overall enhancement of structure growth in the dominant component, seeded by the axion white-noise fluctuations. We search for this effect using the ultraviolet luminosity function (UVLF) of galaxies at $z=4$-$10$, probing $k\\simeq0.5$-$10\\,\\mathrm{Mpc}^{-1}$. Combining the UVLF analysis with Lyman-$\\alpha$ and CMB data yields the leading cosmological limits on post-inflationary axion dark matter, sensitive to tiny fractions for $m_a\\lesssim10^{-21}\\,\\mathrm{eV}$. As a byproduct, we obtain new constraints on generic white-noise power spectra from the UVLF. These results apply broadly to scenarios that generate similar isocurvature perturbations, linking early-universe field dynamics to high-redshift structure formation.",
      "pdf_url": "https://arxiv.org/pdf/2511.04734.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04748",
      "title": "Dents in the Mirror: A Novel Probe of Dark Matter Substructure in Galaxy Clusters from the Astrometric Asymmetry of Lensed Arcs",
      "authors": [
        "Derek Perera",
        "Daniel Gilman",
        "Liliya L. R. Williams",
        "Liang Dai",
        "Xiaolong Du",
        "Gregor Rihtarsic",
        "Joaquin Becerra-Espinoza",
        "Allison Keen"
      ],
      "abstract": "Dents in the Mirror: A Novel Probe of Dark Matter Substructure in Galaxy Clusters from the Astrometric Asymmetry of Lensed Arcs Derek Perera, Daniel Gilman, Liliya L. R. Williams, Liang Dai, Xiaolong Du, Gregor Rihtarsic, Joaquin Becerra-Espinoza, Allison Keen Submitted. 21 pages, 14 figures. All comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Astrometric perturbations of lensed arcs behind galaxy clusters have been recently suggested as promising probes of small-scale ($\\lesssim10^9 M_{\\odot}$) dark matter substructure. Populations of cold dark matter (CDM) subhalos, predicted in hierarchical structure formation theory, can break the symmetry of arcs near the critical curve, leading to positional shifts in the observed images. We present a novel statistical method to constrain the average subhalo mass fraction ($f_{\\rm sub}$) in clusters that takes advantage of this induced positional asymmetry. Focusing on CDM, we extend a recent semi-analytic model of subhalo tidal evolution to accurately simulate realistic subhalos within a cluster-scale host. We simulate the asymmetry of lensed arcs from these subhalo populations using Approximate Bayesian Computation. Using mock data, we demonstrate that our method can reliably recover the simulated $f_{\\rm sub}$ to within 68\\% CI in 73\\% of cases, regardless of the lens model, astrometric precision, and image morphology. We show that the constraining power of our method is optimized for larger samples of well observed arcs, ideal for recent JWST observations of cluster lenses. As a preliminary test, we apply our method to the MACSJ0416 Warhol arc and AS1063 System 1. For Warhol we constrain the upper limit on $\\log f_{\\rm sub} < -3.40^{+1.06}_{-0.97}$, while for AS1063 System 1 we constrain $\\log f_{\\rm sub} = -2.36^{+0.56}_{-0.89}$ (both at 68\\% CI), consistent with CDM predictions. We elaborate on our method's limitations and its future potential to place stringent constraints on dark matter properties in cluster environments.",
      "pdf_url": "https://arxiv.org/pdf/2511.04748.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04770",
      "title": "Machine Learning-Driven Analysis of kSZ Maps to Predict CMB Optical Depth $τ$",
      "authors": [
        "Farshid Farhadi Khouzani",
        "Abinash Kumar Shaw",
        "Paul La Plante",
        "Bryar Mustafa Shareef",
        "Laxmi Gewali"
      ],
      "abstract": "Machine Learning-Driven Analysis of kSZ Maps to Predict CMB Optical Depth $τ$ Farshid Farhadi Khouzani, Abinash Kumar Shaw, Paul La Plante, Bryar Mustafa Shareef, Laxmi Gewali 12 pages, 5 figures, submitted to PASP Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG) Upcoming measurements of the kinetic Sunyaev-Zel'dovich (kSZ) effect, which results from Cosmic Microwave Background (CMB) photons scattering off moving electrons, offer a powerful probe of the Epoch of Reionization (EoR). The kSZ signal contains key information about the timing, duration, and spatial structure of the EoR. A precise measurement of the CMB optical depth $\\tau$, a key parameter that characterizes the universe's integrated electron density, would significantly constrain models of early structure formation. However, the weak kSZ signal is difficult to extract from CMB observations due to significant contamination from astrophysical foregrounds. We present a machine learning approach to extract $\\tau$ from simulated kSZ maps. We train advanced machine learning models, including swin transformers, on high-resolution seminumeric simulations of the kSZ signal. To robustly quantify prediction uncertainties of $\\tau$, we employ the Laplace Approximation (LA). This approach provides an efficient and principled Gaussian approximation to the posterior distribution over the model's weights, allowing for reliable error estimation. We investigate and compare two distinct application modes: a post-hoc LA applied to a pre-trained model, and an online LA where model weights and hyperparameters are optimized jointly by maximizing the marginal likelihood. This approach provides a framework for robustly constraining $\\tau$ and its associated uncertainty, which can enhance the analysis of upcoming CMB surveys like the Simons Observatory and CMB-S4.",
      "pdf_url": "https://arxiv.org/pdf/2511.04770.pdf",
      "categories": [
        "astro-ph.CO",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05093",
      "title": "Sym-EFT: Accelerating Effective Field Theory of Large Scale Structure with Symbolic Regression",
      "authors": [
        "Despoina Farakou",
        "Constantinos Skordis"
      ],
      "abstract": "Sym-EFT: Accelerating Effective Field Theory of Large Scale Structure with Symbolic Regression Despoina Farakou, Constantinos Skordis Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present an emulator suite for the one- and two-loop cold dark matter power spectrum from the Effective Field Theory of Large Scale Structures (EFTofLSS). Specifically, we emulate separately the various contributions to the one- and two-loop parts of the power spectrum, leaving out the possible counterterms which can be added as multiplicative prefactors. By leaving the time-dependence of the counterterms unspecified at the emulation stage, our technique has the advantage of being extremely versatile in fitting any type of counterterm parametrisation to data, or to simulations, without having to change the emulator. We construct our emulators using the method of symbolic regression which results in functions that can be used directly in computer code, while achieving errors of better than $0.5\\%$ within the $k$-range of validity of EFT and maintaining ultra-fast computational evaluation of less than $\\sim5\\times10^{-4}s$ on a single core.",
      "pdf_url": "https://arxiv.org/pdf/2511.05093.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05341",
      "title": "Reviving Quadratic Inflation: Minimal Deformation for CMB Compatibility and Reheating Consistency",
      "authors": [
        "Khedidja Djeha"
      ],
      "abstract": "Reviving Quadratic Inflation: Minimal Deformation for CMB Compatibility and Reheating Consistency Khedidja Djeha 14 pages, 2 figures, LaTeX source included, submitted to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) We revisit the quadratic inflationary potential by introducing a minimal higher-order correction obtained through a simple field redefinition, leading to the potential V(chi) = (1/2) m^2 * (chi - (gamma/14) * chi^7)^2. While the uncorrected quadratic model predicts n_s approximately 0.967 and r approximately 0.13, in strong tension with CMB data, the corrected potential yields n_s approximately 0.965 and r approximately 0.036, fully consistent with Planck 2018 constraints. Beyond inflationary observables, the deformation also impacts the reheating phase. In the quadratic case, reheating corresponds to a matter-like regime with w_reh = 0, whereas the corrected potential gives w_reh approximately -0.011, a slightly softer equation of state. This modification raises the reheating temperature by a factor of about 3.4 (for N_reh = 10), or equivalently extends the reheating duration at fixed temperature. Our results demonstrate that even a minimal higher-order correction is sufficient to reconcile the quadratic model with observations while providing a more consistent post-inflationary history, highlighting the relevance of controlled deformations of simple inflationary scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2511.05341.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05484",
      "title": "Non-Gaussian Galaxy Stochasticity and the Noise-Field Formulation",
      "authors": [
        "Henrique Rubira",
        "Fabian Schmidt"
      ],
      "abstract": "Non-Gaussian Galaxy Stochasticity and the Noise-Field Formulation Henrique Rubira, Fabian Schmidt 33 pages, 2 figures; comments welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO) We revisit the stochastic, or noise, contributions to the galaxy density field within the effective field theory (EFT) of large-scale structure. Starting from the general, all-order expression of the EFT partition function, we elucidate how the stochastic contributions can be described by local nonlinear couplings of a single Gaussian noise field. We introduce an alternative formulation of the partition function in terms of such a noise field, and derive the corresponding field-level likelihood for biased tracers. This noise-field formulation can capture the complete set of stochastic contributions to the galaxy density at the field level in a normalized, positive-definite probability density which is suitable for numerical sampling. We illustrate this by presenting the first results of EFT-based field-level inference with non-Gaussian and density-dependent stochasticity on dark matter halos using LEFTfield.",
      "pdf_url": "https://arxiv.org/pdf/2511.05484.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04780",
      "title": "Synthetic JWST galaxy images in the TNG50 simulation - I. Model validation and comparison to observations",
      "authors": [
        "Alejandro Guzmán-Ortega",
        "Gustavo Bruzual",
        "Vicente Rodriguez-Gomez",
        "Lars Hernquist"
      ],
      "abstract": "Synthetic JWST galaxy images in the TNG50 simulation - I. Model validation and comparison to observations Alejandro Guzmán-Ortega, Gustavo Bruzual, Vicente Rodriguez-Gomez, Lars Hernquist 20 pages, 13 figures. Accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We use the TNG50 cosmological simulation and three-dimensional radiative transfer post-processing to generate dust-aware synthetic observations of galaxies at $ 3 \\leq z \\leq 6 $ and $ \\log_{10}(M_\\ast/\\mathrm{M}_\\odot) \\geq 8.5 $, tailored to match the depth and resolution of current deep JWST surveys (NGDEEP and JADES). We analyse the performance of spectral energy distribution (SED) fitting on the simulated sample, focusing on the recovery of photometric redshift and stellar mass. At $ z \\leq 5 $, we find that 90 per cent of redshifts are recovered within $ \\pm0.2 $, but performance declines at $ z = 6 $. Stellar masses are generally well-recovered within a factor of 2, but are systematically underestimated regardless of redshift, a trend that is more pronounced at the high-mass end $ ( \\log_{10}(M_\\ast/\\mathrm{M}_\\odot) \\geq 10 ) $. In addition, we study the observer-frame colours of galaxies in this redshift range as well as the SED-inferred $UVJ$ diagram. We find that TNG50 galaxies broadly follow the tendencies marked by observations, but tend to be slightly redder at lower masses and bluer at higher masses, regardless of redshift. Finally, using a colour-based definition of quiescence, we determine the fraction of quiescent galaxies as a function of stellar mass at $ 3 \\leq z \\leq 6 $, which we find to be broadly consistent with observations.",
      "pdf_url": "https://arxiv.org/pdf/2511.04780.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04792",
      "title": "Blind Strong Gravitational Lensing Inversion: Joint Inference of Source and Lens Mass with Score-Based Models",
      "authors": [
        "Gabriel Missael Barco",
        "Ronan Legin",
        "Connor Stone",
        "Yashar Hezaveh",
        "Laurence Perreault-Levasseur"
      ],
      "abstract": "Blind Strong Gravitational Lensing Inversion: Joint Inference of Source and Lens Mass with Score-Based Models Gabriel Missael Barco, Ronan Legin, Connor Stone, Yashar Hezaveh, Laurence Perreault-Levasseur 18 pages, 9 figures, 1 table. Accepted to the NeurIPS 2025 Workshop on Machine Learning and the Physical Sciences Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG) Score-based models can serve as expressive, data-driven priors for scientific inverse problems. In strong gravitational lensing, they enable posterior inference of a background galaxy from its distorted, multiply-imaged observation. Previous work, however, assumes that the lens mass distribution (and thus the forward operator) is known. We relax this assumption by jointly inferring the source and a parametric lens-mass profile, using a sampler based on GibbsDDRM but operating in continuous time. The resulting reconstructions yield residuals consistent with the observational noise, and the marginal posteriors of the lens parameters recover true values without systematic bias. To our knowledge, this is the first successful demonstration of joint source-and-lens inference with a score-based prior.",
      "pdf_url": "https://arxiv.org/pdf/2511.04792.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "cs.LG"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05439",
      "title": "Unsupervised Discovery of High-Redshift Galaxy Populations with Variational Autoencoders",
      "authors": [
        "Aayush Saxena"
      ],
      "abstract": "Unsupervised Discovery of High-Redshift Galaxy Populations with Variational Autoencoders Aayush Saxena 5 Pages, 2 Figures, Accepted at the Machine Learning and the Physical Sciences Workshop at Neural Information Processing Systems 2025 (NeurIPS 2025) Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We apply variational autoencoders to automatically discover galaxy populations using publicly available high-redshift \\textit{JWST} spectra without prior classification knowledge. Our unsupervised method identifies distinct astrophysical classes of unique and exciting galaxy types, demonstrating automated discovery capabilities for large spectroscopic surveys.",
      "pdf_url": "https://arxiv.org/pdf/2511.05439.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05470",
      "title": "$\\texttt{unimpeded}$: A Public Nested Sampling Database for Bayesian Cosmology",
      "authors": [
        "Dily Duan Yi Ong",
        "Will Handley"
      ],
      "abstract": "$\\texttt{unimpeded}$: A Public Nested Sampling Database for Bayesian Cosmology Dily Duan Yi Ong, Will Handley Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Bayesian inference is central to modern cosmology. While parameter estimation is achievable with unnormalised posteriors traditionally obtained via MCMC methods, comprehensive model comparison and tension quantification require Bayesian evidences and normalised posteriors, which remain computationally prohibitive for many researchers. To address this, we present $\\texttt{unimpeded}$, a publicly available Python library and data repository providing DiRAC-funded (DP192 and 264) pre-computed nested sampling and MCMC chains with their normalised posterior samples, computed using $\\texttt{Cobaya}$ and the Boltzmann solver $\\texttt{CAMB}$. $\\texttt{unimpeded}$ delivers systematic analysis across a grid of eight cosmological models (including $\\Lambda$CDM and seven extensions) and 39 modern cosmological datasets (comprising individual probes and their pairwise combinations). The built-in tension statistics calculator enables rapid computation of six tension quantification metrics. All chains are hosted on Zenodo with permanent access via the unimpeded API, analogous to the renowned Planck Legacy Archive but utilising nested sampling in addition to traditional MCMC methods.",
      "pdf_url": "https://arxiv.org/pdf/2511.05470.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2406.17985",
      "title": "One Galaxy Sample to Rule Them All: Halo Occupation Distribution Modeling of DES Year 3 Source Galaxies",
      "authors": [
        "Andrés N. Salcedo",
        "Tim Eifler",
        "Peter Behroozi"
      ],
      "abstract": "One Galaxy Sample to Rule Them All: Halo Occupation Distribution Modeling of DES Year 3 Source Galaxies Andrés N. Salcedo, Tim Eifler, Peter Behroozi 15 pages, 7 figures, 1 table. Accepted by The Astrophysical Journal (Vol. 983 Iss. 2, id. 183) Cosmology and Nongalactic Astrophysics (astro-ph.CO) For the joint analysis of second-order weak lensing and galaxy clustering statistics, so-called $3{\\times}2$ analyses, the selection and characterization of optimal galaxy samples is a major area of research. One promising choice is to use the same galaxy sample as lenses and sources, which reduces the systematics parameter space that describes uncertainties related to galaxy samples. Such a ``lens-equal-source'' analysis significantly improves self-calibration of photo-z systematics leading to improved cosmological constraints. With the aim to enable a lens-equal-source analysis on small scales we investigate the halo-galaxy connection of DES-Y3 source galaxies. We develop a technique to construct mock source galaxy populations by matching COSMOS/UltraVISTA photometry onto {\\sc{UniverseMachine}} galaxies. These mocks predict a source halo occupation distribution (HOD) that exhibits significant redshift evolution, non-trivial central incompleteness and galaxy assembly bias. We produce multiple realizations of mock source galaxies drawn from the {\\sc{UniverseMachine}} posterior with added uncertainties in measured DES photometry and galaxy shapes. We fit a modified HOD formalism to these realizations to produce priors on the galaxy-halo connection for cosmological analyses. We additionally train an emulator that predicts this HOD to $\\sim2\\%$ accuracy from redshift $z = 0.1 - 1.3$ that models the dependence of this HOD on 1) observational uncertainties in galaxy size and photometry, and 2) uncertainties in the {\\sc{UniverseMachine}} predictions.",
      "pdf_url": "https://arxiv.org/pdf/2406.17985.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2409.18714",
      "title": "Spectral Imaging with QUBIC: building astrophysical components from Time-Ordered-Data using Bolometric Interferometry",
      "authors": [
        "M. Regnier",
        "T. Laclavere",
        "J-Ch. Hamilton",
        "E. Bunn",
        "V. Chabirand",
        "P. Chanial",
        "L. Goetz",
        "L. Kardum",
        "P. Masson",
        "N. Miron Granese",
        "C.G. Scóccola",
        "S.A. Torchinsky",
        "E. Battistelli",
        "M. Bersanelli",
        "F. Columbro",
        "A. Coppolecchia",
        "B. Costanza",
        "P. De Bernardis",
        "G. De Gasperis",
        "S. Ferazzoli",
        "A. Flood",
        "K. Ganga",
        "M. Gervasi",
        "L. Grandsire",
        "E .Manzan",
        "S. Masi",
        "A. Mennella",
        "L. Mousset",
        "C. O'Sullivan",
        "A. Paiella",
        "F. Piacentini",
        "M. Piat",
        "L. Piccirillo",
        "E. Rasztocky",
        "M. Stolpovskiy",
        "M. Zannoni"
      ],
      "abstract": "Spectral Imaging with QUBIC: building astrophysical components from Time-Ordered-Data using Bolometric Interferometry M. Regnier, T. Laclavere, J-Ch. Hamilton, E. Bunn, V. Chabirand, P. Chanial, L. Goetz, L. Kardum, P. Masson, N. Miron Granese, C.G. Scóccola, S.A. Torchinsky, E. Battistelli, M. Bersanelli, F. Columbro, A. Coppolecchia, B. Costanza, P. De Bernardis, G. De Gasperis, S. Ferazzoli, A. Flood, K. Ganga, M. Gervasi, L. Grandsire, E .Manzan, S. Masi, A. Mennella, L. Mousset, C. O'Sullivan, A. Paiella, F. Piacentini, M. Piat, L. Piccirillo, E. Rasztocky, M. Stolpovskiy, M. Zannoni Cosmology and Nongalactic Astrophysics (astro-ph.CO) The detection of B-modes in the CMB polarization pattern is a major issue in modern cosmology and must therefore be handled with analytical methods that produce reliable results. We describe a method that uses the frequency dependency of the QUBIC synthesized beam to perform component separation at the map-making stage, to obtain more precise results. We aim to demonstrate the feasibility of component separation during the map-making stage in time domain space. This new technique leads to a more accurate description of the data and reduces the biases in cosmological analysis. The method uses a library for highly parallel computation which facilitates the programming and permits the description of experiments as easily manipulated operators. These operators can be combined to obtain a joint analysis using several experiments leading to maximized precision. The results show that the method works well and permits end-to-end analysis for the CMB experiments, and in particular, for QUBIC. The method includes astrophysical foregrounds, and also systematic effects like gain variation in the detectors. We developed a software pipeline that produces uncertainties on tensor-to-scalar ratio at the level of $\\sigma(r) \\sim 0.023$ using only QUBIC simulated data.",
      "pdf_url": "https://arxiv.org/pdf/2409.18714.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.20178",
      "title": "Updated cosmological constraints on axion dark energy with DESI",
      "authors": [
        "L. A. Ureña-López",
        "F. Lozano-Rodríguez",
        "J. O. Román-Herrera",
        "J. Aguilar",
        "S. Ahlen",
        "D. Bianchi",
        "D. Brooks",
        "T. Claybaugh",
        "A. de la Macorra",
        "Arjun Dey",
        "S. Ferraro",
        "J. E. Forero-Romero",
        "E. Gaztañaga",
        "S. Gontcho A Gontcho",
        "G. Gutierrez",
        "K. Honscheid",
        "C. Howlett",
        "M. Ishak",
        "R. Kehoe",
        "D. Kirkby",
        "T. Kisner",
        "A. Lambert",
        "M. Landriau",
        "L. Le Guillou",
        "M. Manera",
        "A. Meisner",
        "R. Miquel",
        "J. Moustakas",
        "F. Prada",
        "I. Pérez-Ràfols",
        "G. Rossi",
        "E. Sanchez",
        "M. Schubnell",
        "J. Silber",
        "D. Sprayberry",
        "G. Tarlé",
        "B. A. Weaver",
        "H. Zou"
      ],
      "abstract": "Updated cosmological constraints on axion dark energy with DESI L. A. Ureña-López, F. Lozano-Rodríguez, J. O. Román-Herrera, J. Aguilar, S. Ahlen, D. Bianchi, D. Brooks, T. Claybaugh, A. de la Macorra, Arjun Dey, S. Ferraro, J. E. Forero-Romero, E. Gaztañaga, S. Gontcho A Gontcho, G. Gutierrez, K. Honscheid, C. Howlett, M. Ishak, R. Kehoe, D. Kirkby, T. Kisner, A. Lambert, M. Landriau, L. Le Guillou, M. Manera, A. Meisner, R. Miquel, J. Moustakas, F. Prada, I. Pérez-Ràfols, G. Rossi, E. Sanchez, M. Schubnell, J. Silber, D. Sprayberry, G. Tarlé, B. A. Weaver, H. Zou 9 pages, 1 figure, accepted for publication in Physical Review D Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present updated constraints on the parameters of an axion dark energy model, for which we took into account the properties of its characteristic potential and its full cosmological evolution. We show that the values of the axion parameters appear sufficiently constrained by the data, including the latest DESI DR1, and are consistent with the theoretical expectations of a field mass $m_a$ in the ultralight regime $\\log (m_a c^2/~\\mathrm{eV}) \\simeq -32.60~\\pm~0.12$, and an effective energy scale $f_a$ close to the reduced Planck energy $\\log (f_a/~ M_\\mathrm{Pl}) \\simeq -0.28~\\pm~0.19$. Our results also support the idea of dynamical dark energy, although Bayesian evidence still favors the phenomenological dark energy model $w_0w_a$ over the axion dark energy, with the Bayes factor indicating moderate and weak strength of the evidence, respectively, when the models are compared to the cosmological constant $\\Lambda$. However, the results suggest that axion dark energy remains a well-motivated model and its parameters may be better constrained if the upcoming DESI data show further evidence for dynamical dark energy.",
      "pdf_url": "https://arxiv.org/pdf/2503.20178.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.16767",
      "title": "One-loop kernels in scale-dependent Horndeski theory",
      "authors": [
        "Ziyang Zheng",
        "Hanqiong Jia",
        "Bilal Tüdes",
        "Anton Chudaykin",
        "Martin Kunz",
        "Luca Amendola"
      ],
      "abstract": "One-loop kernels in scale-dependent Horndeski theory Ziyang Zheng, Hanqiong Jia, Bilal Tüdes, Anton Chudaykin, Martin Kunz, Luca Amendola 40 pages, 2 figures, version 2; Version accepted for publication in JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO) We investigate the nonlinear evolution of cosmological perturbations in theories with scale-dependent perturbation growth, first in general and then focusing on Horndeski gravity. Within the framework of standard perturbation theory, we derive the second- and third-order kernels and show that they are fully determined by two effective functions, \\( h_1 \\) and \\( h_c \\), which parametrize deviations from general relativity. Using the Wronskian method, we obtain solutions for the nonlinear growth functions and present explicit expressions for the resulting kernels, including bias and redshift space distortions, valid in the limit in which the $k$-dependent part is subdominant. We show that the kernels are entirely dependent on the linear growing mode: once this is calculated, the kernels are analytic up to a time integral. We also include redshift-space distortions (RSD) and scale-dependent bias. Our approach provides a physically motivated framework for evaluating the one-loop galaxy power spectrum in scale-dependent theories, suitable for the forecasts and actual data analysis.",
      "pdf_url": "https://arxiv.org/pdf/2505.16767.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.04142",
      "title": "Renormalization-Free Galaxy Bias in Unified Lagrangian Perturbation Theory",
      "authors": [
        "Naonori Sugiyama"
      ],
      "abstract": "Renormalization-Free Galaxy Bias in Unified Lagrangian Perturbation Theory Naonori Sugiyama Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a renormalization-free framework for modeling galaxy bias based on Unified Lagrangian Perturbation Theory (ULPT). In this approach, the biased density fluctuation is built solely from Galileon-type operators associated with the intrinsic nonlinear growth of dark matter. This ensures the bias expansion is well defined at the field level, automatically satisfies statistical conditions of vanishing ensemble and volume averages, and removes the need for ad hoc renormalization. We derive analytic one-loop expressions for the galaxy-galaxy and galaxy-matter power spectra and implement an efficient numerical algorithm using \\texttt{FFTLog} and \\texttt{FAST-PT}, enabling rapid and accurate evaluation. The model requires only a minimal set of bias parameters: three parameters are sufficient to describe correlation functions in configuration space, while four parameters are needed for power spectra in Fourier space. To test accuracy, we jointly fit halo auto- and cross-spectra from the \\textit{Dark Emulator}, covering nine redshift-mass combinations with 100 cosmologies each. A single set of bias parameters reproduces both spectra within $\\sim1\\%$ up to $k \\simeq 0.3\\,h\\,\\mathrm{Mpc}^{-1}$ for typical linear bias $b_1 \\sim 0.8$-2, and to $k \\simeq 0.2\\,h\\,\\mathrm{Mpc}^{-1}$ for $b_1 \\sim 3$. The same parameters also match two-point correlation functions down to $r \\simeq 15\\,h^{-1}\\mathrm{Mpc}$. Moreover, ULPT predicts the relation $b_{K^2}^{\\mathrm{E}} = -\\tfrac{3}{4} b_2^{\\mathrm{E}}$, validated against $N$-body results. These results demonstrate that ULPT provides a physically consistent and efficient model for nonlinear galaxy bias, with applications to redshift-space distortions, bispectra, and reconstruction. The numerical implementation is released as the open-source Python package this https URL.",
      "pdf_url": "https://arxiv.org/pdf/2509.04142.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.17454",
      "title": "The Hubble Tension resolved by the DESI Baryon Acoustic Oscillations Measurements",
      "authors": [
        "X. D. Jia",
        "J. P. Hu",
        "D. H. Gao",
        "S. X. Yi",
        "F. Y. Wang"
      ],
      "abstract": "The Hubble Tension resolved by the DESI Baryon Acoustic Oscillations Measurements X. D. Jia, J. P. Hu, D. H. Gao, S. X. Yi, F. Y. Wang 15 pages, 6 figures, 2 tables. Accepted by ApJL Cosmology and Nongalactic Astrophysics (astro-ph.CO) The $\\Lambda$ cold dark matter ($\\Lambda$CDM) cosmological model provides a good description of a wide range of astrophysical and cosmological observations. However, severe challenges to the phenomenological $\\Lambda$CDM model have emerged recently, including the Hubble constant tension and the significant deviation from the $\\Lambda$CDM model reported by the Dark Energy Spectroscopic Instrument (DESI) collaboration. Despite many explanations for the two challenges have been proposed, the origins of them are still intriguing mysteries. Here, we investigate the DESI Baryon Acoustic Oscillations (BAOs) measurements to interpret the Hubble constant tension. Employing a non-parametric method, we find that the dark energy equation of state $w(z)$ evolves with redshift from DESI BAO data and type Ia supernovae. From the Friedmann equations, the Hubble constant ($H_0$) is derived from $w(z)$ model-independently. We find that the values of $H_0$ show a descending trend as a function of redshift, and can effectively resolve the Hubble constant tension. Our study finds that the two unexpected challenges to the $\\Lambda$CDM model can be understood in one physical framework, e.g., dynamical dark energy.",
      "pdf_url": "https://arxiv.org/pdf/2509.17454.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2408.15615",
      "title": "Narrow line AGN selection in CEERS: spectroscopic selection, physical properties, X-ray and radio analysis",
      "authors": [
        "Giovanni Mazzolari",
        "Jan Scholtz",
        "Roberto Maiolino",
        "Roberto Gilli",
        "Alberto Traina",
        "Ivan E. López",
        "Hannah Übler",
        "Bartolomeo Trefoloni",
        "Francesco D'Eugenio",
        "Xihan Ji",
        "Marco Mignoli",
        "Fabio Vito",
        "Cristian Vignali",
        "Marcella Brusa"
      ],
      "abstract": "Narrow line AGN selection in CEERS: spectroscopic selection, physical properties, X-ray and radio analysis Giovanni Mazzolari, Jan Scholtz, Roberto Maiolino, Roberto Gilli, Alberto Traina, Ivan E. López, Hannah Übler, Bartolomeo Trefoloni, Francesco D'Eugenio, Xihan Ji, Marco Mignoli, Fabio Vito, Cristian Vignali, Marcella Brusa Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this work, we spectroscopically select narrow-line AGNs (NLAGNs) among the ~300 publicly available medium-resolution spectra of the Cosmic Evolution Early Release Science Survey (CEERS). Using both traditional and newly identified emission line NLAGN diagnostics diagrams, we identified 52 NLAGNs at 2<z<9, on which we performed a detailed multiwavelength analysis. We also identified four new z<2 broad-line AGNs (BLAGNs), in addition to the eight previously reported z>4.5 BLAGNs. We found that most of the high-z NLAGN were selected using the recently proposed AGN diagnostic diagrams based on the [Oiii] $\\lambda$4363 auroral line or high-ionization emission lines. We compared the emission line velocity dispersion and the obscuration levels of the sample of NLAGNs with those of the parent sample without finding significant differences between the two distributions, suggesting a population of AGNs heavily buried and not significantly impacting the host galaxies physical properties, as was further confirmed by spectral energy distribution fitting. The bolometric luminosities of the high-z NLAGNs selected in this work are ~1.5dex below the ones sampled by surveys before JWST, potentially explaining the weak impact of these AGNs. Finally, we investigated the X-ray properties of the selected NLAGNs and of the sample of high-z BLAGNs. We found that all but four NLAGNs are undetected in the deep X-ray image of the field, as well as all the high-z BLAGNs. We did not obtain a detection even by stacking the undetected sources, resulting in an X-ray weakness of ~1-2 dex from what was expected based on their bolometric luminosities. To discriminate between a heavily obscured AGN scenario or an intrinsic X-ray weakness of these sources, we performed a radio (1.4GHz) stacking analysis, which did not reveal any detection and left open the questions about the origin of the X-ray weakness.",
      "pdf_url": "https://arxiv.org/pdf/2408.15615.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.04224",
      "title": "The radio properties of the JWST-discovered AGN",
      "authors": [
        "G. Mazzolari",
        "R. Gilli",
        "R. Maiolino",
        "I. Prandoni",
        "I. Delvecchio",
        "C. Norman",
        "E.F. Jimenez-Andrade",
        "S. Belladitta",
        "F. Vito",
        "E. Momjian",
        "M. Chiaberge",
        "B. Trefoloni",
        "M. Signorini",
        "X. Ji",
        "Q. D'Amato",
        "G. Risaliti",
        "R.D. Baldi",
        "A. Fabian",
        "H. Übler",
        "F. D'Eugenio",
        "J. Scholtz",
        "I. Juodžbalis",
        "M. Mignoli",
        "M. Brusa",
        "E. Murphy",
        "T.W.B. Muxlow"
      ],
      "abstract": "The radio properties of the JWST-discovered AGN G. Mazzolari, R. Gilli, R. Maiolino, I. Prandoni, I. Delvecchio, C. Norman, E.F. Jimenez-Andrade, S. Belladitta, F. Vito, E. Momjian, M. Chiaberge, B. Trefoloni, M. Signorini, X. Ji, Q. D'Amato, G. Risaliti, R.D. Baldi, A. Fabian, H. Übler, F. D'Eugenio, J. Scholtz, I. Juodžbalis, M. Mignoli, M. Brusa, E. Murphy, T.W.B. Muxlow Accepted for publication on A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We explore the radio emission of JWST-selected Broad Line AGN (BLAGN, or type 1) in the GOODS-N field. We use deep radio data at different frequencies (144\\,MHz, 1.5\\,GHz, 3\\,GHz, 5.5\\,GHz, 10\\,GHz), and we find that none of the {37} sources investigated is detected at any of the aforementioned frequencies. Similarly, the radio stacking analysis does not reveal any detection down to an rms of ${\\sim 0.15}\\mu$Jy beam$^{-1}$, corresponding to a $3\\sigma$ upper limit at rest frame 5 GHz of $L_{5GHz}=2\\times10^{39}$ erg s$^{-1}$ at the mean redshift of the sample $z\\sim 5.1$. We compared this and individual sources upper limits with expected radio luminosities estimated assuming different AGN scaling relations, {to check whether these are consistent with the standard BLAGN spectral energy distribution}. For most of the sources the radio luminosity upper limits are still compatible with expectations for radio-quiet (RQ) AGN; nevertheless, the more stringent stacking upper limits and the fact that no detection is found {might suggest} that JWST-selected BLAGN are weaker than standard AGN even at radio frequencies. Indeed, the probability of having none of the BLAGN detected in none of the investigated radio images is expected to be on average very low ($P<10^{-4}$). We discuss some scenarios that could explain the possible radio weakness, such as free-free absorption from a dense medium, or the lack of either magnetic field or a corona, possibly as a consequence of super-Eddington accretion. These scenarios would also explain the observed X-ray weakness. We also conclude that $\\sim$1 dex more sensitive radio observations are needed to better constrain the level of radio emission (or lack thereof) for the bulk of these sources. The Square Kilometer Array Observatory (SKAO) will likely play a crucial role in assessing the properties of this AGN population.",
      "pdf_url": "https://arxiv.org/pdf/2412.04224.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.05556",
      "title": "Super-Eddington accretion in high-redshift quasar hosts: Black-hole driven outflows, galaxy quenching, and the nature of little red dots",
      "authors": [
        "Giada Quadri",
        "Alessandro Trinca",
        "Alessandro Lupi",
        "Monica Colpi",
        "Marta Volonteri"
      ],
      "abstract": "Super-Eddington accretion in high-redshift quasar hosts: Black-hole driven outflows, galaxy quenching, and the nature of little red dots Giada Quadri, Alessandro Trinca, Alessandro Lupi, Monica Colpi, Marta Volonteri 23 pages (including appendix), 14 figures, accepted Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The advent of the James Webb Space Telescope has revolutionised our understanding of the high-redshift Universe through its detection of bright, massive galaxies up to $z\\gtrsim 10$ and its identification of peculiar sources called `little red dots' (LRDs). The origin of both classes of objects remains uncertain but is likely linked to the formation and early growth of the first massive black holes (MBHs), which may be more easily explained by invoking phases of super-Eddington accretion. In this study, we used a state-of-the-art zoom-in cosmological simulation of a quasar host to investigate whether these objects could resemble any of the peculiar sources observed with JWST during their assembly. We find that the impact of MBH feedback on star formation is typically moderate, with outflows preferentially escaping perpendicular to the galactic disc. However, for approximately ten percent of the galaxy's lifetime, the system enters a distinct quenched phase following rapid MBH growth driven by super-Eddington accretion. This phase culminates in a powerful feedback event, during which the MBH jet and disc-driven winds interact directly with the galactic disc and carve out a central cavity. We also find that, during the history of the quasar host progenitor, the spectral properties of the system can resemble both LRDs and quenched galaxies, depending on the specific evolutionary stage considered. These findings suggest that both conditions may represent transient phases in the life cycle of high-redshift galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2505.05556.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04738",
      "title": "SRGt 062340.2-265751 confirmed as a nova-like cataclysmic variable with a possible magnetic nature",
      "authors": [
        "V. A. Cúneo",
        "A. D. Schwope",
        "J. Kurpas",
        "A. Avakyan",
        "J. Brink",
        "D. A. H. Buckley",
        "C. Maitra",
        "M. Veresvarska"
      ],
      "abstract": "SRGt 062340.2-265751 confirmed as a nova-like cataclysmic variable with a possible magnetic nature V. A. Cúneo, A. D. Schwope, J. Kurpas, A. Avakyan, J. Brink, D. A. H. Buckley, C. Maitra, M. Veresvarska Accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) SRGt 062340.2-265751, a cataclysmic variable identified by SRG/eROSITA due to its significant X-ray variability, remains poorly characterised despite multi-wavelength follow-up. We present spectral and timing analyses from the first dedicated X-ray and ultraviolet observations with XMM-Newton, complemented by SRG/eROSITA data from four all-sky surveys (eRASS1-4) and ASAS-SN optical photometry. Our timing analysis reveals a >8$\\sigma$-significant modulation at 3.6 $\\pm$ 0.5 hours, likely representing the orbital period. Long-term ASAS-SN monitoring confirms the source as a VY Sculptoris-type nova-like system, while short-timescale X-ray and ultraviolet variability, down to a few minutes, suggests a possible underlying magnetic white dwarf. Two additional significant X-ray modulations at 43 $\\pm$ 1 min and 36.0 $\\pm$ 0.7 min tentatively point to the spin period of an intermediate polar. The best-fit XMM-Newton energy spectra reveal a multi-temperature thermal plasma ($kT$ = 0.23, 0.94, and 5.2 keV), while the SRG/eROSITA spectra are consistent with a single-temperature thermal plasma of a few keV. We estimate unabsorbed X-ray luminosities of $\\gtrsim$$10^{32}$ erg s$^{-1}$ (0.2-12 keV). Broadband spectral energy distribution modelling, from near-ultraviolet to infrared, indicates a disc-dominated system consistent with a nova-like classification. We discuss these results in the context of the source's confirmed nova-like classification and its possible magnetic nature, a scenario increasingly supported by discoveries of intermediate polars exhibiting VY Sculptoris-type nova-like features.",
      "pdf_url": "https://arxiv.org/pdf/2511.04738.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04810",
      "title": "FermiPhased: A tool for phase-resolved likelihood analysis of Fermi-LAT data",
      "authors": [
        "Alexander Lange",
        "B.B. K"
      ],
      "abstract": "FermiPhased: A tool for phase-resolved likelihood analysis of Fermi-LAT data Alexander Lange, B.B. K 8 pages, 7 figures. To be submitted to the Open Journal of Astrophysics High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Fermi Large Area Telescope has enabled detailed studies of high-energy astrophysical sources. To support analysis, we present FermiPhased, a flexible, open-source tool for phase-resolved studies of pulsars, binaries, and other periodically variable sources. Built on the Fermipy framework, FermiPhased offers three modes: standard, adaptive (fixed counts), and joint phase-resolved analysis, enabling users to flexibly bin data based on phase, count statistics, or jointly fit different epochs of interest. FermiPhased is optimized for parallel execution and use on computing clusters. It enables parallelized extraction of phase-resolved fluxes, spectra, and intermediary data products, with tutorials and documentation available on GitHub.",
      "pdf_url": "https://arxiv.org/pdf/2511.04810.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04896",
      "title": "On the Energetic Role of Forward Neutrino Scattering in Core-Collapse Supernovae",
      "authors": [
        "Tatsushi Shima"
      ],
      "abstract": "On the Energetic Role of Forward Neutrino Scattering in Core-Collapse Supernovae Tatsushi Shima High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) We revisit neutrino-matter coupling in the post-shock region of core-collapse supernovae by restoring nuclear recoil in coherent neutrino-nucleus scattering (CEvNS). The resulting local energy transfer (a few keV per ~10 MeV neutrino) accumulates across the ~100 km stalled-shock layer, yielding a total heating of 10^49-10^50 erg, comparable within an order of magnitude to the increment required to trigger shock revival in current multidimensional simulations. This indicates that the long-standing failure of isoenergetic transport schemes to revive the shock originates from their neglect of recoil kinematics. Because the momentum exchange in each scattering is tiny, the emergent neutrino spectra and lepton-number balance remain essentially unchanged. The result highlights nuclear recoil as a minimal yet physically grounded correction to standard neutrino transport, providing a self-consistent route toward reliable explosion modeling.",
      "pdf_url": "https://arxiv.org/pdf/2511.04896.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04966",
      "title": "Detecting FRB by DANCE: a method based on DEnsity ANalysis and Cluster Extraction",
      "authors": [
        "Mao Yuan",
        "Jiarui Niu",
        "Yi Feng",
        "Xu-ning Lv",
        "Chenchen Miao",
        "Lingqi Meng",
        "Bo Peng",
        "Li Deng",
        "Jingye Yan",
        "Weiwei Zhu"
      ],
      "abstract": "Detecting FRB by DANCE: a method based on DEnsity ANalysis and Cluster Extraction Mao Yuan, Jiarui Niu, Yi Feng, Xu-ning Lv, Chenchen Miao, Lingqi Meng, Bo Peng, Li Deng, Jingye Yan, Weiwei Zhu High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) Fast radio bursts (FRBs) are transient signals exhibiting diverse strengths and emission bandwidths. Traditional single-pulse search techniques are widely employed for FRB detection; yet weak, narrow-band bursts often remain undetectable due to low signal-to-noise ratios (SNR) in integrated profiles. We developed DANCE, a detection tool based on cluster analysis of the original spectrum. It is specifically designed to detect and isolate weak, narrow-band FRBs, providing direct visual identification of their emission properties. This method performs density clustering on reconstructed, RFI-cleaned observational data, enabling the extraction of targeted clusters in time-frequency domain that correspond to the genuine FRB emission range. Our simulations show that DANCE successfully extracts all true signals with SNR~>5 and achieves a detection precision exceeding 93%. Furthermore, through the practical detection of FRB 20201124A, DANCE has demonstrated a significant advantage in finding previously undetectable weak bursts, particularly those with distinct narrow-band features or occurring in proximity to stronger bursts.",
      "pdf_url": "https://arxiv.org/pdf/2511.04966.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05013",
      "title": "Precise Measurement of Cosmic Ray Light and Helium Spectra above 0.1 Peta-electron-Volt",
      "authors": [
        "LHAASO collaboration"
      ],
      "abstract": "Precise Measurement of Cosmic Ray Light and Helium Spectra above 0.1 Peta-electron-Volt LHAASO collaboration High Energy Astrophysical Phenomena (astro-ph.HE) We report a measurement of the cosmic ray helium energy spectrum in the energy interval 0.16 -- 13 PeV, derived by subtracting the proton spectrum from the light component (proton and helium) spectrum obtained with observations made by the Large High Altitude Air Shower Observatory (LHAASO) under a consistent energy scale. The helium spectrum shows a significant hardening centered at $E \\simeq$ 1.1 PeV, followed by a softening at $\\sim$ 7 PeV, indicating the appearance of a helium `knee'. Comparing the proton and helium spectra in the LHAASO energy range reveals some remarkable facts. In the lower part of this range, in contrast to the behavior at lower energies, the helium spectrum is significantly softer than the proton spectrum. This results in protons overtaking helium nuclei and becoming the largest cosmic ray component at $E \\simeq$ 0.7 PeV. A second crossing of the two spectra is observed at $E \\simeq$ 5 PeV, above the proton knee, when helium nuclei overtake protons to become the largest cosmic ray component again. These results have important implications for our understanding of the Galactic cosmic ray sources.",
      "pdf_url": "https://arxiv.org/pdf/2511.05013.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05015",
      "title": "LHAASO Detection of Ultra-High-Energy Gamma-Ray Emission toward the Giant Molecular Clouds",
      "authors": [
        "The LHAASO Collaboration"
      ],
      "abstract": "LHAASO Detection of Ultra-High-Energy Gamma-Ray Emission toward the Giant Molecular Clouds The LHAASO Collaboration High Energy Astrophysical Phenomena (astro-ph.HE) The $\\gamma$-ray from Giant molecular clouds (GMCs) is regarded as the most ideal tool to perform in-situ measurement of cosmic ray (CR) density and spectra in our Galaxy. We report the first detection of $\\gamma$-ray emissions in the very-high-energy (VHE) domain from the five nearby GMCs with a stacking analysis based on a 4.5-year $\\gamma$-ray observation with the Large High Altitude Air Shower Observatory (LHAASO) experiment. The spectral energy distributions derived from the GMCs are consistent with the expected $\\gamma$-ray flux produced via CR interacting with the ISM in the energy interval 1 - 100 $~\\rm$ TeV. In addition, we investigate the presence of the CR spectral `knee' by introducing a spectral break in the $\\gamma$-ray data. While no significant evidence for the CR knee is found, the current KM2A measurements from GMCs strongly favor a proton CR knee located above 0.9$~\\rm$ PeV, which is consistent with the latest measurement of the CR spectrum by ground-based experiments.",
      "pdf_url": "https://arxiv.org/pdf/2511.05015.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05016",
      "title": "Unveiling the Nature of Superorbital Modulation of SMC X-1 using NinjaSat",
      "authors": [
        "Chin-Ping Hu",
        "Naoyuki Ota",
        "Takuya Takahashi",
        "Tomoshi Takeda",
        "Teruaki Enoto",
        "Toru Tamagawa",
        "Biswajit Paul",
        "Sota Watanabe",
        "Wataru Iwakiri",
        "Tatehiro Mihara",
        "Amira Aoyama",
        "Satoko Iwata",
        "Kaede Yamasaki",
        "Takayuki Kita",
        "Soma Tsuchiya",
        "Mayu Ichibakase"
      ],
      "abstract": "Unveiling the Nature of Superorbital Modulation of SMC X-1 using NinjaSat Chin-Ping Hu, Naoyuki Ota, Takuya Takahashi, Tomoshi Takeda, Teruaki Enoto, Toru Tamagawa, Biswajit Paul, Sota Watanabe, Wataru Iwakiri, Tatehiro Mihara, Amira Aoyama, Satoko Iwata, Kaede Yamasaki, Takayuki Kita, Soma Tsuchiya, Mayu Ichibakase 14 pages, 7 figures, accepted for publication in ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We report a long-term, high-cadence timing and spectral observation of the X-ray pulsar SMC X-1 using NinjaSat, a 6U CubeSat in low-Earth orbit, covering nearly a full superorbital cycle. SMC X-1 is a high-mass X-ray binary exhibiting a 0.7 s X-ray pulsar and a non-stationary superorbital modulation with periods ranging from approximately 40 to 65 days. Its peak luminosity of $1.3\\times10^{39}$~\\lumcgs\\ makes it a local analogue of ultraluminous X-ray pulsars powered by supercritical accretion. We find that the spin-up rate during the high state remains consistent with the long-term average, with no significant correlation between spin-up rate and flux. This result indicates that the modulation is primarily geometric rather than accretion-driven. The hardness ratio and spectral shape are stable throughout the entire superorbital cycle, supporting obscuration by optically thick material or energy-independent scattering. In addition, the 2--20 keV pulse profile varies with superorbital phase, which may be explained either by variable covering fraction due to geometric obscuration, or by free precession of the neutron star. This represents the first complete measurement of spin-up rate and spectral evolution across a single superorbital cycle in SMC X-1, highlighting the scientific capability of CubeSat-based observatories.",
      "pdf_url": "https://arxiv.org/pdf/2511.05016.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05075",
      "title": "Formation of millisecond pulsar-helium star binaries",
      "authors": [
        "Zhu-Ling Deng",
        "Xiang-Dong Li",
        "Yong Shao",
        "Ying-Han Mao",
        "Long Jiang"
      ],
      "abstract": "Formation of millisecond pulsar-helium star binaries Zhu-Ling Deng, Xiang-Dong Li, Yong Shao, Ying-Han Mao, Long Jiang Accepted by A&A. 12 pages, including 6 figures High Energy Astrophysical Phenomena (astro-ph.HE) PSR J1928+1815, the first recycled pulsar-helium (He) star binary discovered by the Five-hundred-meter Aperture Spherical radio Telescope, consists of a 10.55 ms pulsar and a companion star with mass $1-1.6\\,M_{\\sun}$ in a 0.15-day orbit. Theoretical studies suggest that this system originated from a neutron star (NS) intermediate-mass or high-mass X-ray binary that underwent common envelope (CE) evolution, leading to the successful ejection of the giant envelope. The traditional view is that hypercritical accretion during the CE phase may have recycled the NS. However, the specific mechanism responsible for accelerating its spin period remains uncertain due to the complex processes involved in CE this http URL this study, we investigate the influence of Roche lobe overflow (RLO) accretion that takes place prior to the CE phase on the spin evolution of NSs. Our primary objective is to clarify how this process affects the spin characteristics of pulsars. We utilized the stellar evolution code \\texttt{MESA} and the binary population synthesis code \\texttt{BSE} to model the formation and evolution of NS-He star binaries. We calculated the distributions of the orbital period, He star mass, NS spin period, and magnetic field for NS + He star systems in the Galaxy. Our results indicate that RLO accretion preceding the CE phase could spin up NSs to millisecond periods through super-Eddington accretion. Considering a range of CE efficiencies $\\alpha_{\\rm CE}$ from 0.3 to 3, we estimate the birthrate (total number) of NS + He star systems in our Galaxy to be 9.0$\\times 10^{-5}$ yr$^{-1}$ (626 systems) to 1.9$\\times 10^{-4}$ yr$^{-1}$ (2684 systems).",
      "pdf_url": "https://arxiv.org/pdf/2511.05075.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05123",
      "title": "The most distant optically polarised GRB afterglow: GRB 240419A at z = 5.178",
      "authors": [
        "R. Brivio",
        "S. Covino",
        "M. Ferro",
        "A. Saccardi",
        "A. Martin-Carrillo",
        "A. Kuwata",
        "K. Toma",
        "P. D'Avanzo",
        "Y.-D. Hu",
        "L. Izzo",
        "S. Kobayashi",
        "T. Laskar",
        "G. Leloudas",
        "D. B. Malesani",
        "M. Pursiainen",
        "S. Vergani",
        "K. Wiersema",
        "S. Bloemen",
        "S. Campana",
        "V. D'Elia",
        "S. de Wet",
        "M. de Pasquale",
        "P. J. Groot",
        "P. Jakobsson",
        "J. Mao",
        "A. Melandri",
        "G. Pugliese",
        "A. Rossi",
        "R. Salvaterra",
        "B. Schneider",
        "N. R. Tanvir",
        "J. van Roestel",
        "P. M. Vreeswijk",
        "T. Zafar"
      ],
      "abstract": "The most distant optically polarised GRB afterglow: GRB 240419A at z = 5.178 R. Brivio, S. Covino, M. Ferro, A. Saccardi, A. Martin-Carrillo, A. Kuwata, K. Toma, P. D'Avanzo, Y.-D. Hu, L. Izzo, S. Kobayashi, T. Laskar, G. Leloudas, D. B. Malesani, M. Pursiainen, S. Vergani, K. Wiersema, S. Bloemen, S. Campana, V. D'Elia, S. de Wet, M. de Pasquale, P. J. Groot, P. Jakobsson, J. Mao, A. Melandri, G. Pugliese, A. Rossi, R. Salvaterra, B. Schneider, N. R. Tanvir, J. van Roestel, P. M. Vreeswijk, T. Zafar High Energy Astrophysical Phenomena (astro-ph.HE) Gamma-ray bursts (GRBs) are extremely bright phenomena powered by relativistic jets arising from explosive events at cosmological distances. The nature of the jet and the configuration of the local magnetic fields are still unclear, with the distinction between different models possibly provided by the detection of early-time polarisation. Past observations do not agree on a universal scenario describing early-time polarisation in GRB afterglows, and new studies are necessary to investigate this open question. We present here the discovery of GRB\\,240419A, its redshift determination of $z=5.178$, its early-time optical polarimetry observations, and the multi-wavelength monitoring of its afterglow. We analysed three epochs of polarimetric data to derive the early-time evolution of the polarisation. The multi-wavelength light curve from the X-rays to the near-infrared band was also investigated to give a broader perspective on the whole event. We find a high level of polarisation, $P=6.97^{+1.84}_{-1.52}$\\,\\%, at 1740~s after the GRB trigger, followed by a slight decrease up to $P=4.81^{+1.87}_{-1.53}$\\,\\% at 3059~s. On the same timescale, the polarisation position angle is nearly constant. The multi-band afterglow at the time of the polarisation measurements is consistent with a forward shock (FS), while the earlier evolution at $t-t_0\\lesssim700$ s can be associated with the interplay between the forward and the reverse shocks or with energy injection. The detected polarised radiation when the afterglow is FS-dominated and the stable position angle are consistent with an ordered magnetic field plus a turbulent component driven by large-scale magnetohydrodynamic instabilities. The lack of a jet break in the light curve prevents a comparison of the polarisation temporal evolution with theoretical expectations from magnetic fields amplified by microscopic-scale turbulence, limiting ...",
      "pdf_url": "https://arxiv.org/pdf/2511.05123.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05144",
      "title": "Searching for Electromagnetic Counterpart Candidates to GW231123",
      "authors": [
        "Lei He",
        "Liang-Gui Zhu",
        "Zheng-Yan Liu",
        "Rui Niu",
        "Chao Wei",
        "Bing-Zhou Gao",
        "Ming-Shen Zhou",
        "Run-Duo Liang",
        "Ken Chen",
        "Jian-Min Wang",
        "Ning Jiang",
        "Zhen-Yi Cai",
        "Ji-an Jiang",
        "Zi-Gao Dai",
        "Ye-Fei Yuan",
        "Jian Li",
        "Wen Zhao"
      ],
      "abstract": "Searching for Electromagnetic Counterpart Candidates to GW231123 Lei He, Liang-Gui Zhu, Zheng-Yan Liu, Rui Niu, Chao Wei, Bing-Zhou Gao, Ming-Shen Zhou, Run-Duo Liang, Ken Chen, Jian-Min Wang, Ning Jiang, Zhen-Yi Cai, Ji-an Jiang, Zi-Gao Dai, Ye-Fei Yuan, Jian Li, Wen Zhao 10 pages, 3 figures, comments are welcome High Energy Astrophysical Phenomena (astro-ph.HE) The detection of GW231123, a gravitational-wave (GW) event with exceptionally massive and rapidly spinning black holes, suggests the possible formation within an active galactic nucleus (AGN) disk, which provides a favorable environment for potentially generating an observable electromagnetic (EM) counterpart. We conduct a search for such a counterpart by crossmatching the GW localization with a comprehensive catalog of AGN flares from the Zwicky Transient Facility. Our analysis yields six plausible optical flare candidates that are spatially and temporally coincident with GW231123 and exhibit significant deviations from their AGN baseline flux. Although these candidates represent a crucial first step, their true nature remains inconclusive. Confirming any one of these flares via future observations would provide a landmark validation of the AGN formation channel and unlock the multi-messenger potential of this extraordinary merger.",
      "pdf_url": "https://arxiv.org/pdf/2511.05144.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.05268",
      "title": "A Mass-Independent Damping Timescale in Black Hole Accretion Systems",
      "authors": [
        "Haoyang Zhang",
        "Shenbang Yang",
        "Li Zhang",
        "Benzhong Dai"
      ],
      "abstract": "A Mass-Independent Damping Timescale in Black Hole Accretion Systems Haoyang Zhang, Shenbang Yang, Li Zhang, Benzhong Dai High Energy Astrophysical Phenomena (astro-ph.HE) The scaling laws reveal the underlying structural similarities shared by astrophysical systems across vastly different scales. In black hole accretion systems, the scaling relations between the characteristic damping timescales (CDTs) of light curves and black hole mass offer valuable insights into the underlying physical structure of accretion disks. We investigate, for the first time, the long-term hard X-ray variability of black hole and neutron star accretion systems using light curves from the \\textit{Swift} Burst Alert Telescope 157-month catalog. Applying a damped random walk model, we measure CDTs for 39 Seyfert galaxies, 17 blazars, 82 X-ray binaries, and one tidal disruption event. Unexpectedly, these CDTs span months to years but with a mass-independent feature, in contrast to well-established scaling laws. This puzzling phenomenon can be attributed to conductive timescales arising from disk--corona interactions, instead of the intrinsic accretion disk processes characterized by scaling laws, and it may further modulate jet emission in blazars. This result demonstrates thermal conduction as a key mechanism driving hard X-ray variability and offers new observational evidence for the disk--corona--jet connection.",
      "pdf_url": "https://arxiv.org/pdf/2511.05268.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05284",
      "title": "Spectrum of PeV Cosmic-Ray Protons and Helium Nuclei with IceCube",
      "authors": [
        "Julian Saffer"
      ],
      "abstract": "Spectrum of PeV Cosmic-Ray Protons and Helium Nuclei with IceCube Julian Saffer (for the IceCube Collaboration) Presented at the 39th International Cosmic Ray Conference (ICRC2025) High Energy Astrophysical Phenomena (astro-ph.HE) The IceCube Observatory comprises a cubic-kilometer particle detector deep in the Antarctic ice and the cosmic-ray air-shower array IceTop at the surface above. Previous analyses of the cosmic-ray composition have used coincident events with IceTop detecting the electromagnetic shower footprint as well as GeV muons, while the sensors submerged in the ice measure the TeV muons from the same events. The energy range of previous composition analyses, however, has been limited to 3 PeV primary energy and above, whereas the IceTop all-particle energy spectrum has been extended down to 250 TeV. This contribution presents a method to reconstruct the combined spectrum of cosmic-ray protons and helium nuclei, starting at 200 TeV primary energy. The resulting H+He spectrum closes the gap in the measurements of light cosmic rays between IceCube as well as KASCADE and experiments measuring in the TeV energy range, such as DAMPE and HAWC.",
      "pdf_url": "https://arxiv.org/pdf/2511.05284.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05409",
      "title": "Charge-dependent spectral softenings of primary cosmic-rays from proton to iron below the knee",
      "authors": [
        "DAMPE Collaboration: Francesca Alemanno",
        "Qi An",
        "Philipp Azzarello",
        "Felicia-Carla-Tiziana Barbato",
        "Paolo Bernardini",
        "Xiao-Jun Bi",
        "Hugo Valentin Boutin",
        "Irene Cagnoli",
        "Ming-Sheng Cai",
        "Elisabetta Casilli",
        "Jin Chang",
        "Deng-Yi Chen",
        "Jun-Ling Chen",
        "Zhan-Fang Chen",
        "Zi-Xuan Chen",
        "Paul Coppin",
        "Ming-Yang Cui",
        "Tian-Shu Cui",
        "Ivan De Mitri",
        "Francesco de Palma",
        "Adriano Di Giovanni",
        "Tie-Kuang Dong",
        "Zhen-Xing Dong",
        "Giacinto Donvito",
        "Jing-Lai Duan",
        "Kai-Kai Duan",
        "Rui-Rui Fan",
        "Yi-Zhong Fan",
        "Fang Fang",
        "Kun Fang",
        "Chang-Qing Feng",
        "Lei Feng",
        "Sara Fogliacco",
        "Jennifer-Maria Frieden",
        "Piergiorgio Fusco",
        "Min Gao",
        "Fabio Gargano",
        "Essna Ghose",
        "Ke Gong",
        "Yi-Zhong Gong",
        "Dong-Ya Guo",
        "Jian-Hua Guo",
        "Shuang-Xue Han",
        "Yi-Ming Hu",
        "Guang-Shun Huang",
        "Xiao-Yuan Huang",
        "Yong-Yi Huang",
        "Maria Ionica",
        "Lu-Yao Jiang",
        "Wei Jiang",
        "Yao-Zu Jiang",
        "Jie Kong",
        "Andrii Kotenko",
        "Dimitrios Kyratzis",
        "Shi-Jun Lei",
        "Bo Li",
        "Manbing Li",
        "Wei-Liang Li",
        "Wen-Hao Li",
        "Xiang Li",
        "Xian-Qiang Li",
        "Yao-Ming Liang",
        "Cheng-Ming Liu",
        "Hao Liu",
        "Jie Liu",
        "Shu-Bin Liu",
        "Yang Liu",
        "Francesco Loparco",
        "Miao Ma",
        "Peng-Xiong Ma",
        "Tao Ma",
        "Xiao-Yong Ma",
        "Giovanni Marsella",
        "Mario-Nicola Mazziotta",
        "Dan Mo",
        "Yu Nie",
        "Xiao-Yang Niu",
        "Andrea Parenti",
        "Wen-Xi Peng",
        "Xiao-Yan Peng",
        "Chiara Perrina",
        "Enzo Putti-Garcia",
        "Rui Qiao",
        "Jia-Ning Rao",
        "Yi Rong",
        "Andrea Serpolla",
        "Ritabrata Sarkar",
        "Pierpaolo Savina",
        "Zhi Shangguan",
        "Wei-Hua Shen",
        "Zhao-Qiang Shen",
        "Zhong-Tao Shen",
        "Leandro Silveri",
        "Jing-Xing Song",
        "Hong Su",
        "Meng Su",
        "Hao-Ran Sun",
        "Zhi-Yu Sun",
        "Antonio Surdo"
      ],
      "abstract": "Charge-dependent spectral softenings of primary cosmic-rays from proton to iron below the knee DAMPE Collaboration: Francesca Alemanno, Qi An, Philipp Azzarello, Felicia-Carla-Tiziana Barbato, Paolo Bernardini, Xiao-Jun Bi, Hugo Valentin Boutin, Irene Cagnoli, Ming-Sheng Cai, Elisabetta Casilli, Jin Chang, Deng-Yi Chen, Jun-Ling Chen, Zhan-Fang Chen, Zi-Xuan Chen, Paul Coppin, Ming-Yang Cui, Tian-Shu Cui, Ivan De Mitri, Francesco de Palma, Adriano Di Giovanni, Tie-Kuang Dong, Zhen-Xing Dong, Giacinto Donvito, Jing-Lai Duan, Kai-Kai Duan, Rui-Rui Fan, Yi-Zhong Fan, Fang Fang, Kun Fang, Chang-Qing Feng, Lei Feng, Sara Fogliacco, Jennifer-Maria Frieden, Piergiorgio Fusco, Min Gao, Fabio Gargano, Essna Ghose, Ke Gong, Yi-Zhong Gong, Dong-Ya Guo, Jian-Hua Guo, Shuang-Xue Han, Yi-Ming Hu, Guang-Shun Huang, Xiao-Yuan Huang, Yong-Yi Huang, Maria Ionica, Lu-Yao Jiang, Wei Jiang, Yao-Zu Jiang, Jie Kong, Andrii Kotenko, Dimitrios Kyratzis, Shi-Jun Lei, Bo Li, Manbing Li, Wei-Liang Li, Wen-Hao Li, Xiang Li, Xian-Qiang Li, Yao-Ming Liang, Cheng-Ming Liu, Hao Liu, Jie Liu, Shu-Bin Liu, Yang Liu, Francesco Loparco, Miao Ma, Peng-Xiong Ma, Tao Ma, Xiao-Yong Ma, Giovanni Marsella, Mario-Nicola Mazziotta, Dan Mo, Yu Nie, Xiao-Yang Niu, Andrea Parenti, Wen-Xi Peng, Xiao-Yan Peng, Chiara Perrina, Enzo Putti-Garcia, Rui Qiao, Jia-Ning Rao, Yi Rong, Andrea Serpolla, Ritabrata Sarkar, Pierpaolo Savina, Zhi Shangguan, Wei-Hua Shen, Zhao-Qiang Shen, Zhong-Tao Shen, Leandro Silveri, Jing-Xing Song, Hong Su, Meng Su, Hao-Ran Sun, Zhi-Yu Sun, Antonio Surdo High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Experiment (hep-ex) In most particle acceleration mechanisms, the maximum energy of the cosmic rays can achieve is charge dependent. However, the observational verification of such a fundamental relation is still lack due to the difficulty of measuring the spectra of individual particles from one (kind of) source(s) up to very high energies. This work reports direct measurements of the carbon, oxygen, and iron spectra from ~ 20 gigavolts to ~ 100 teravolts (~ 60 teravolts for iron) with 9 years of on-orbit data collected by the Dark Matter Particle Explorer (DAMPE). Distinct spectral softenings have been directly detected in these spectra for the first time. Combined with the updated proton and helium spectra, the spectral softening appears universally at a rigidity of ~ 15 teravolts. A nuclei mass dependent softening is rejected at a confidence level of > 99.999%. Taking into account the correlated structures at similar energies in the large-scale anisotropies of cosmic rays, one of the most natural interpretations of the spectral structures is the presence of a nearby cosmic ray source. In this case, the softening energies correspond to the acceleration upper limits of such a source, forming the so-called Peters cycle of the spectra. The results thus offer observational verification of the long-standing prediction of the charge-dependent energy limit of cosmic ray acceleration.",
      "pdf_url": "https://arxiv.org/pdf/2511.05409.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ex"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05419",
      "title": "Crossing the veil of the brightest radio relic in the sky MACS J0717.6+3745",
      "authors": [
        "A. Pasetto",
        "O. Vilchis",
        "A. Bonafede",
        "E. F. Jiménez-Andrade",
        "K. Rajpurohit",
        "E. Murphy"
      ],
      "abstract": "Crossing the veil of the brightest radio relic in the sky MACS J0717.6+3745 A. Pasetto, O. Vilchis, A. Bonafede, E. F. Jiménez-Andrade, K. Rajpurohit, E. Murphy Accepted for publication to MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) We present high-frequency, full-polarisation Jansky Very Large Array (VLA) radio data at X-band of the radio relic: MACS J0717.5+3745. Radio relics trace shock waves in the intracluster medium (ICM) produced during mergers. Understanding the physical characteristics of relics is important for determining their nature, whether for example they are thermal ICM electrons that are accelerated, or whether they are fossil electrons re-accelerated by a merger event. Radio spectropolarimetric analysis, such as the Stokes QU-fitting, provides a diagnostic of the nature and structure of the magnetized plasma internal or external to the source, with important implications for theoretical models. The high-frequency polarisation analysis presented here shows, for the first time, a change in the magneto-ionic structure compared to the low-frequency data available in the literature. These high-frequency, polarised data could be interpreted also with an internal depolarisation behaviour and this new finding may be used to investigate possible particle acceleration mechanism. If that is true, the change in the behaviour of the polarised signal could be tracing physical properties of a population of non-thermal particles that are undergoing to a re-acceleration of particles in the relic by large-scale internal shocks of Active Galactic Nuclei jet fossil particles ejected from the central Narrow Angle Tail radio galaxy. New upcoming broad-band VLA X- and Ku-bands data will clarify this. Finally, we conclude that high-frequency, high-sensitive, spectropolarimetric radio data should be explored further, as they can effectively trace shock fronts and thereby provide insights into the intrinsic magneto-ionic properties of radio components.",
      "pdf_url": "https://arxiv.org/pdf/2511.05419.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05473",
      "title": "Chemical Evolution and Kilonova Implications of Post-Merger Accretion Disk Winds",
      "authors": [
        "Agnieszka Janiuk",
        "Joseph Saji",
        "Gerardo Urrutia"
      ],
      "abstract": "Chemical Evolution and Kilonova Implications of Post-Merger Accretion Disk Winds Agnieszka Janiuk, Joseph Saji, Gerardo Urrutia (CTP PAS) 16 pages, 15 figures; submitted High Energy Astrophysical Phenomena (astro-ph.HE) Several gamma ray bursts have recently been associated with a kilonova emission. We study the mechanisms which could account for this effect, by means of radioactive decay of elements synthesized in accretion disk wind. We model the r-process nucleosynthesis in the accretion disk wind system, asscociated with the prompt GRB phase. We compute the time-dependent GR MHD evolution of a GRB central engine where the newly formed black hole is accreting the mass from post-merger remnant. We explore the wind properties, for a range of the initial parameters of the system, and study representative cases for compact binary merger progenitors. We compute a suite of 2D and 3D time-dependent General Relativistic numerical simulations with a tabulated 3-parameter equation of state that allows for evolution of chemical composition evolution of the accretion flow. The neutrino emission is accounted for by incorporating the leakage scheme, where neutrino optical depth is calculated along the radial rays. We parameterize the optically thick and thin tori with different values of the pressure maximum and entropy in the disk, while the strength of large-scale poloidal magnetic fields is parameterized according to the chosen gas-to-magnetic pressure ratio. To probe the winds, we follow the particle trajectories. Upon this, we derive the nucleosynthetic yields of heavy elements in the outflows, and we map the regions of Lanthanide rich and poor ejecta. We find that the outflow carries high mass of neutron rich material expanding with mildly relativistic velocities. Our accretion disks operating under the SANE mode can power the GRB jets via neutrino annihilation, if the disk to BH mass ratio is larger than about 0.01 and the black hole is spinning. Slowly spinning black holes surrounded by massive post-merger disks can power these jets, and also be the sites of efficient nucleosynthesis of Lanthanides.",
      "pdf_url": "https://arxiv.org/pdf/2511.05473.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04736",
      "title": "Heavy black hole seed survivors in dwarf galaxies: a case study of Leo I",
      "authors": [
        "Matthew T. Scoggins",
        "Zoltan Haiman",
        "Fabio Pacucci"
      ],
      "abstract": "Heavy black hole seed survivors in dwarf galaxies: a case study of Leo I Matthew T. Scoggins, Zoltan Haiman, Fabio Pacucci 9 pages, 4 figures, 2 tables. Submitted to MNRAS. Comments are welcome Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) The supermassive black holes (SMBHs) with mass $M_\\bullet > 10^9 \\, \\rm M_\\odot$ hosted by high-redshift galaxies have challenged our understanding of black hole formation and growth, as several pathways have emerged attempting to explain their existence. The \"heavy-seed\" pathway eases the problem with the progenitors of these SMBHs having birth masses up to ${\\sim} 10^5~{\\rm M_\\odot}$. Here, we investigate the possibility that a local dwarf galaxy, Leo I, harbors a heavy-seed descendant. Using Monte-Carlo merger trees to generate the merger histories of 1,000 dark matter halos similar to the Milky Way (MW; with a mass of ${\\sim} 10^{12}~{\\rm M_\\odot}$ at redshift $z{=}0$). We search for Leo-like satellite halos among these merger trees, and investigate the probability that the progenitors of some of these satellites formed a heavy seed. We derive the likelihood of such \"heavy seed survivors\" (HSSs) across various formation and survival criteria as well as Leo-similarity criteria. We find that the virial temperature for the onset of atomic cooling and rapid gas infall that yields heavy seeds, $T_{\\rm act}$, has the largest impact on the number of HSSs. We find HSSs in a fraction $0.7\\%$, $18.1\\%$, and $96.5\\%$ of MW-like halos when $T_{\\rm act}$ is set to $9,000$K, $7,000$K, and $5,000$K respectively. This suggests that Leo I could be hosting a heavy seed and could provide an opportunity to disentangle heavy seeds from other SMBH formation mechanisms.",
      "pdf_url": "https://arxiv.org/pdf/2511.04736.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04857",
      "title": "SCATTER Common Envelope Formalism for Triples",
      "authors": [
        "Rosanne Di Stefano",
        "Amaan Khwaja",
        "Chiaki Kobayashi"
      ],
      "abstract": "SCATTER Common Envelope Formalism for Triples Rosanne Di Stefano, Amaan Khwaja, Chiaki Kobayashi 22 pages, 10 figures, submitted to MNRAS Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Many stars are components of triple-star systems, or of higher-order multiples. In such systems mass transfer is common, and when the transfer is dynamically unstable, a common envelope forms. As such, it is important to be able to compute the post-common-envelope orbital separations among the various stars comprising the system, and to determine whether the common envelope induces mergers and/or makes later mergers inevitable. In this paper we compute the results of common-envelope evolution for triples. We employ the SCATTER formalism, a new approach to the computation of post-common-envelope separations. This work has applications to gravitational mergers, Type Ia supernovae, and a broad range of highly energetic phenomena.",
      "pdf_url": "https://arxiv.org/pdf/2511.04857.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05029",
      "title": "Discovery of an X-ray Luminous Radio-Loud Quasar at $z=3.4$: A Possible Transitional Super-Eddington Phase",
      "authors": [
        "Sakiko Obuchi",
        "Kohei Ichikawa",
        "Satoshi Yamada",
        "Nozomu Kawakatu",
        "Teng Liu",
        "Naoki Matsumoto",
        "Andrea Merloni",
        "Kosuke Takahashi",
        "Ingyin Zaw",
        "Xiaoyang Chen",
        "Kazuhiro Hada",
        "Zsofi Igo",
        "Hyewon Suh",
        "Julien Wolf"
      ],
      "abstract": "Discovery of an X-ray Luminous Radio-Loud Quasar at $z=3.4$: A Possible Transitional Super-Eddington Phase Sakiko Obuchi, Kohei Ichikawa, Satoshi Yamada, Nozomu Kawakatu, Teng Liu, Naoki Matsumoto, Andrea Merloni, Kosuke Takahashi, Ingyin Zaw, Xiaoyang Chen, Kazuhiro Hada, Zsofi Igo, Hyewon Suh, Julien Wolf 20 pages, 11 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) We report the multiwavelength properties of eFEDS J084222.9+001000 (hereafter ID830), a quasar at $z=3.4351$, identified as the most X-ray luminous radio-loud quasar in the eROSITA Final Equatorial Depth Survey (eFEDS) field. ID830 shows a rest-frame 0.5-2 keV luminosity of $\\log (L_\\mathrm{0.5-2\\,keV}/\\mathrm{erg}~\\mathrm{s}^{-1}) = 46.20 \\pm 0.12$, with a steep X-ray photon index ($\\Gamma =2.43 \\pm 0.21$), and a significant radio counterpart detected with VLA/FIRST 1.4 GHz and VLASS 3 GHz bands. The rest-frame UV to optical spectra from SDSS and Subaru/MOIRCS $J$-band show a dust reddened quasar feature with $A_\\mathrm{V} = 0.39 \\pm 0.08$ mag and the expected bolometric AGN luminosity from the dust-extinction-corrected UV luminosity reaches $L_\\mathrm{bol,3000}= (7.62 \\pm 0.31) \\times 10^{46}$ erg s$^{-1}$. We estimate the black hole mass of $M_\\mathrm{BH} = (4.40 \\pm 0.72) \\times 10^{8} M_{\\odot}$ based on the MgII$\\lambda$2800 emission line width, and an Eddington ratio from the dust-extinction-corrected UV continuum luminosity reaches $\\lambda_\\mathrm{Edd,UV}=1.44 \\pm 0.24$ and $\\lambda_{\\mathrm{Edd,X}} = 12.8 \\pm 3.9$ from the X-ray luminosity, both indicating the super-Eddington accretion. ID830 shows a high ratio of UV-to-X-ray luminosities, $\\alpha_\\mathrm{OX}=-1.20 \\pm 0.07$ (or $\\alpha_\\mathrm{OX}=-1.42 \\pm 0.07$ after correcting for jet-linked X-ray excess), higher than quasars and little red dots in super-Eddington phase with similar UV luminosities, with $\\alpha_\\mathrm{OX}<-1.8$. Such a high $\\alpha_\\mathrm{OX}$ suggests the coexistence of a prominent radio jet and X-ray corona, in this high Eddington accretion phase. We propose that ID830 may be in a transitional phase after an accretion burst, evolving from a super-Eddington to a sub-Eddington state, which could naturally describe the high $\\alpha_\\mathrm{OX}$.",
      "pdf_url": "https://arxiv.org/pdf/2511.05029.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2407.06874",
      "title": "The distribution of ultra-high-energy cosmic rays along the supergalactic plane measured at the Pierre Auger Observatory",
      "authors": [
        "The Pierre Auger Collaboration: A. Abdul Halim",
        "P. Abreu",
        "M. Aglietta",
        "I. Allekotte",
        "K. Almeida Cheminant",
        "A. Almela",
        "R. Aloisio",
        "J. Alvarez-Muñiz",
        "J. Ammerman Yebra",
        "G.A. Anastasi",
        "L. Anchordoqui",
        "B. Andrada",
        "L. Andrade Dourado",
        "S. Andringa",
        "L. Apollonio",
        "C. Aramo",
        "P.R. Araújo Ferreira",
        "E. Arnone",
        "J.C. Arteaga Velázquez",
        "P. Assis",
        "G. Avila",
        "E. Avocone",
        "A. Bakalova",
        "F. Barbato",
        "A. Bartz Mocellin",
        "J.A. Bellido",
        "C. Berat",
        "M.E. Bertaina",
        "G. Bhatta",
        "M. Bianciotto",
        "P.L. Biermann",
        "V. Binet",
        "K. Bismark",
        "T. Bister",
        "J. Biteau",
        "J. Blazek",
        "C. Bleve",
        "J. Blümer",
        "M. Boháčová",
        "D. Boncioli",
        "C. Bonifazi",
        "L. Bonneau Arbeletche",
        "N. Borodai",
        "J. Brack",
        "P.G. Brichetto Orchera",
        "F.L. Briechle",
        "A. Bueno",
        "S. Buitink",
        "M. Buscemi",
        "M. Büsken",
        "A. Bwembya",
        "K.S. Caballero-Mora",
        "S. Cabana-Freire",
        "L. Caccianiga",
        "F. Campuzano",
        "R. Caruso",
        "A. Castellina",
        "F. Catalani",
        "G. Cataldi",
        "L. Cazon",
        "M. Cerda",
        "B. Čermáková",
        "A. Cermenati",
        "J.A. Chinellato",
        "J. Chudoba",
        "L. Chytka",
        "R.W. Clay",
        "A.C. Cobos Cerutti",
        "R. Colalillo",
        "M.R. Coluccia",
        "R. Conceição",
        "A. Condorelli",
        "G. Consolati",
        "M. Conte",
        "F. Convenga",
        "D. Correia dos Santos",
        "P.J. Costa",
        "C.E. Covault",
        "M. Cristinziani",
        "C.S. Cruz Sanchez",
        "S. Dasso",
        "K. Daumiller",
        "B.R. Dawson",
        "R.M. de Almeida",
        "B. de Errico",
        "J. de Jesús",
        "S.J. de Jong",
        "J.R.T. de Mello Neto",
        "I. De Mitri",
        "J. de Oliveira",
        "D. de Oliveira Franco",
        "F. de Palma",
        "V. de Souza",
        "E. De Vito",
        "A. Del Popolo",
        "O. Deligny",
        "N. Denner",
        "L. Deval",
        "A. di Matteo"
      ],
      "abstract": "The distribution of ultra-high-energy cosmic rays along the supergalactic plane measured at the Pierre Auger Observatory The Pierre Auger Collaboration: A. Abdul Halim, P. Abreu, M. Aglietta, I. Allekotte, K. Almeida Cheminant, A. Almela, R. Aloisio, J. Alvarez-Muñiz, J. Ammerman Yebra, G.A. Anastasi, L. Anchordoqui, B. Andrada, L. Andrade Dourado, S. Andringa, L. Apollonio, C. Aramo, P.R. Araújo Ferreira, E. Arnone, J.C. Arteaga Velázquez, P. Assis, G. Avila, E. Avocone, A. Bakalova, F. Barbato, A. Bartz Mocellin, J.A. Bellido, C. Berat, M.E. Bertaina, G. Bhatta, M. Bianciotto, P.L. Biermann, V. Binet, K. Bismark, T. Bister, J. Biteau, J. Blazek, C. Bleve, J. Blümer, M. Boháčová, D. Boncioli, C. Bonifazi, L. Bonneau Arbeletche, N. Borodai, J. Brack, P.G. Brichetto Orchera, F.L. Briechle, A. Bueno, S. Buitink, M. Buscemi, M. Büsken, A. Bwembya, K.S. Caballero-Mora, S. Cabana-Freire, L. Caccianiga, F. Campuzano, R. Caruso, A. Castellina, F. Catalani, G. Cataldi, L. Cazon, M. Cerda, B. Čermáková, A. Cermenati, J.A. Chinellato, J. Chudoba, L. Chytka, R.W. Clay, A.C. Cobos Cerutti, R. Colalillo, M.R. Coluccia, R. Conceição, A. Condorelli, G. Consolati, M. Conte, F. Convenga, D. Correia dos Santos, P.J. Costa, C.E. Covault, M. Cristinziani, C.S. Cruz Sanchez, S. Dasso, K. Daumiller, B.R. Dawson, R.M. de Almeida, B. de Errico, J. de Jesús, S.J. de Jong, J.R.T. de Mello Neto, I. De Mitri, J. de Oliveira, D. de Oliveira Franco, F. de Palma, V. de Souza, E. De Vito, A. Del Popolo, O. Deligny, N. Denner, L. Deval, A. di Matteo High Energy Astrophysical Phenomena (astro-ph.HE) Ultra-high-energy cosmic rays are known to be mainly of extragalactic origin, and their propagation is limited by energy losses, so their arrival directions are expected to correlate with the large-scale structure of the local Universe. In this work, we investigate the possible presence of intermediate-scale excesses in the flux of the most energetic cosmic rays from the direction of the supergalactic plane region using events with energies above 20 EeV recorded with the surface detector array of the Pierre Auger Observatory up to 31 December 2022, with a total exposure of 135,000 km^2 sr yr. The strongest indication for an excess that we find, with a post-trial significance of 3.1{\\sigma}, is in the Centaurus region, as in our previous reports, and it extends down to lower energies than previously studied. We do not find any strong hints of excesses from any other region of the supergalactic plane at the same angular scale. In particular, our results do not confirm the reports by the Telescope Array collaboration of excesses from two regions in the Northern Hemisphere at the edge of the field of view of the Pierre Auger Observatory. With a comparable integrated exposure over these regions, our results there are in good agreement with the expectations from an isotropic distribution.",
      "pdf_url": "https://arxiv.org/pdf/2407.06874.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.02381",
      "title": "Search for a diffuse flux of photons with energies above tens of PeV at the Pierre Auger Observatory",
      "authors": [
        "The Pierre Auger Collaboration: A. Abdul Halim",
        "P. Abreu",
        "M. Aglietta",
        "I. Allekotte",
        "K. Almeida Cheminant",
        "A. Almela",
        "R. Aloisio",
        "J. Alvarez-Muñiz",
        "A. Ambrosone",
        "J. Ammerman Yebra",
        "G.A. Anastasi",
        "L. Anchordoqui",
        "B. Andrada",
        "L. Andrade Dourado",
        "S. Andringa",
        "L. Apollonio",
        "C. Aramo",
        "E. Arnone",
        "J.C. Arteaga Velázquez",
        "P. Assis",
        "G. Avila",
        "E. Avocone",
        "A. Bakalova",
        "F. Barbato",
        "A. Bartz Mocellin",
        "J.A. Bellido",
        "C. Berat",
        "M.E. Bertaina",
        "M. Bianciotto",
        "P.L. Biermann",
        "V. Binet",
        "K. Bismark",
        "T. Bister",
        "J. Biteau",
        "J. Blazek",
        "J. Blümer",
        "M. Boháčová",
        "D. Boncioli",
        "C. Bonifazi",
        "L. Bonneau Arbeletche",
        "N. Borodai",
        "J. Brack",
        "P.G. Brichetto Orchera",
        "F.L. Briechle",
        "A. Bueno",
        "S. Buitink",
        "M. Buscemi",
        "M. Büsken",
        "A. Bwembya",
        "K.S. Caballero-Mora",
        "S. Cabana-Freire",
        "L. Caccianiga",
        "F. Campuzano",
        "J. Caraça-Valente",
        "R. Caruso",
        "A. Castellina",
        "F. Catalani",
        "G. Cataldi",
        "L. Cazon",
        "M. Cerda",
        "B. Čermáková",
        "A. Cermenati",
        "J.A. Chinellato",
        "J. Chudoba",
        "L. Chytka",
        "R.W. Clay",
        "A.C. Cobos Cerutti",
        "R. Colalillo",
        "R. Conceição",
        "A. Condorelli",
        "G. Consolati",
        "M. Conte",
        "F. Convenga",
        "D. Correia dos Santos",
        "P.J. Costa",
        "C.E. Covault",
        "M. Cristinziani",
        "C.S. Cruz Sanchez",
        "S. Dasso",
        "K. Daumiller",
        "B.R. Dawson",
        "R.M. de Almeida",
        "E.-T. de Boone",
        "B. de Errico",
        "J. de Jesús",
        "S.J. de Jong",
        "J.R.T. de Mello Neto",
        "I. De Mitri",
        "J. de Oliveira",
        "D. de Oliveira Franco",
        "F. de Palma",
        "V. de Souza",
        "E. De Vito",
        "A. Del Popolo",
        "O. Deligny",
        "N. Denner",
        "L. Deval",
        "A. di Matteo",
        "C. Dobrigkeit"
      ],
      "abstract": "Search for a diffuse flux of photons with energies above tens of PeV at the Pierre Auger Observatory The Pierre Auger Collaboration: A. Abdul Halim, P. Abreu, M. Aglietta, I. Allekotte, K. Almeida Cheminant, A. Almela, R. Aloisio, J. Alvarez-Muñiz, A. Ambrosone, J. Ammerman Yebra, G.A. Anastasi, L. Anchordoqui, B. Andrada, L. Andrade Dourado, S. Andringa, L. Apollonio, C. Aramo, E. Arnone, J.C. Arteaga Velázquez, P. Assis, G. Avila, E. Avocone, A. Bakalova, F. Barbato, A. Bartz Mocellin, J.A. Bellido, C. Berat, M.E. Bertaina, M. Bianciotto, P.L. Biermann, V. Binet, K. Bismark, T. Bister, J. Biteau, J. Blazek, J. Blümer, M. Boháčová, D. Boncioli, C. Bonifazi, L. Bonneau Arbeletche, N. Borodai, J. Brack, P.G. Brichetto Orchera, F.L. Briechle, A. Bueno, S. Buitink, M. Buscemi, M. Büsken, A. Bwembya, K.S. Caballero-Mora, S. Cabana-Freire, L. Caccianiga, F. Campuzano, J. Caraça-Valente, R. Caruso, A. Castellina, F. Catalani, G. Cataldi, L. Cazon, M. Cerda, B. Čermáková, A. Cermenati, J.A. Chinellato, J. Chudoba, L. Chytka, R.W. Clay, A.C. Cobos Cerutti, R. Colalillo, R. Conceição, A. Condorelli, G. Consolati, M. Conte, F. Convenga, D. Correia dos Santos, P.J. Costa, C.E. Covault, M. Cristinziani, C.S. Cruz Sanchez, S. Dasso, K. Daumiller, B.R. Dawson, R.M. de Almeida, E.-T. de Boone, B. de Errico, J. de Jesús, S.J. de Jong, J.R.T. de Mello Neto, I. De Mitri, J. de Oliveira, D. de Oliveira Franco, F. de Palma, V. de Souza, E. De Vito, A. Del Popolo, O. Deligny, N. Denner, L. Deval, A. di Matteo, C. Dobrigkeit High Energy Astrophysical Phenomena (astro-ph.HE) Diffuse photons of energy above 0.1 PeV, produced through the interactions between cosmic rays and either interstellar matter or background radiation fields, are powerful tracers of the distribution of cosmic rays in the Galaxy. Furthermore, the measurement of a diffuse photon flux would be an important probe to test models of super-heavy dark matter decaying into gamma-rays. In this work, we search for a diffuse photon flux in the energy range between 50 PeV and 200 PeV using data from the Pierre Auger Observatory. For the first time, we combine the air-shower measurements from a 2 km$^2$ surface array consisting of 19 water-Cherenkov surface detectors, spaced at 433 m, with the muon measurements from an array of buried scintillators placed in the same area. Using 15 months of data, collected while the array was still under construction, we derive upper limits to the integral photon flux ranging from 13.3 to 13.8 km$^{-2}$ sr$^{-1}$ yr$^{-1}$ above tens of PeV. We extend the Pierre Auger Observatory photon search program towards lower energies, covering more than three decades of cosmic-ray energy. This work lays the foundation for future diffuse photon searches: with the data from the next 10 years of operation of the Observatory, this limit is expected to improve by a factor of $\\sim$20.",
      "pdf_url": "https://arxiv.org/pdf/2502.02381.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.12762",
      "title": "Testing the Shock-cooling Emission Model from Star-disk Collisions for Quasi-periodic Eruptions",
      "authors": [
        "Wenyuan Guo",
        "Rong-Feng Shen"
      ],
      "abstract": "Testing the Shock-cooling Emission Model from Star-disk Collisions for Quasi-periodic Eruptions Wenyuan Guo (SYSU), Rong-Feng Shen (SYSU) 10 pages, 4 figures, 1 table, Revised version submitted to ApJ after peer review. Added Section 5 for additional effects and possible scenarios. Comments welcome High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph) Quasi-periodic eruptions (QPEs), the repeated outbursts observed in soft X-ray bands, have attracted broad interest, but their physical origin is under debate. One of the popular models, the star-disk collision model, suggests that QPEs can be produced through periodic collisions of an orbiting star with the accretion disk of a central black hole (BH). However, previous tests of the star-disk collision model mainly focus on the timing analysis. Other observed properties, such as peak luminosities $L_{\\rm{p}}$, durations $t_{\\rm{e}}$, and radiation temperatures $T_{\\rm{p}}$ of the eruptions, are not systematically investigated. For a sample of six QPE sources and two QPE-like sources, we test \\textbf{the shock-cooling emission model from star-disk collisions} by using these observables to derive the constraints on the stellar radius $R_\\star$. We find that, except for two sources (eRo-QPE3 and eRo-QPE4), the rest of the sample either has no allowed $R_\\star$ to simultaneously reproduce the observed $L_{\\rm{p}}$ and $t_{\\rm{e}}$, or the required $R_\\star$ is too large to avoid being disrupted by the central BH. For the two exceptions, a stellar radius of the order of $1\\ R_{\\rm{\\odot}}$ is necessary to satisfy all the constraints. Another issue with the simplest version of this model is that it predicts $k T_{\\rm{p}} \\sim 10\\ \\rm{eV}$, one order of magnitude lower than the observed value.",
      "pdf_url": "https://arxiv.org/pdf/2504.12762.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA",
        "astro-ph.SR",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.03689",
      "title": "On the Efficiency of Producing Gamma-Ray Bursts from Isolated Population III Stars",
      "authors": [
        "Gibran Morales-Rivera",
        "Ramandeep Gill",
        "S. Jane Arthur",
        "Paz Beniamini",
        "Jonathan Granot"
      ],
      "abstract": "On the Efficiency of Producing Gamma-Ray Bursts from Isolated Population III Stars Gibran Morales-Rivera, Ramandeep Gill, S. Jane Arthur, Paz Beniamini, Jonathan Granot Accepted for publication in MNRAS High Energy Astrophysical Phenomena (astro-ph.HE) The rate of long-duration gamma-ray bursts (GRBs) from isolated Pop III stars is not well known, as it depends on our poor understanding of their initial mass function (IMF), rotation rates, stellar evolution, and mass loss. Some massive ($M_{\\rm ZAMS}\\gtrsim20M_\\odot$) Pop III stars are expected to suffer core-collapse and launch a relativistic jet that would power a GRB. In the collapsar scenario, a key requirement is that the pre-supernova star imparts sufficient angular momentum to the remnant black hole to form an accretion disc and launch a relativistic jet, which demands rapid initial rotation of the progenitor star and suppression of line-driven mass loss during its chemically homogeneous evolution. Here we explore a grid of stellar evolution models of Pop III stars with masses $20\\leq M_{\\rm ZAMS}/M_\\odot \\leq 100$, which are initially rotating with surface angular velocities $0.6\\leq \\Omega_0/\\Omega_{\\rm crit}\\leq 0.9$, where centrifugally-driven mass loss ensues for $\\Omega>\\Omega_{\\rm crit}$. Realistic accretion and jet propagation models are used to derive the initial black hole masses and spins, and jet breakout times for these stars. The GRB production efficiency is obtained over a phase space comprising progenitor initial mass, rotation, and wind efficiency. For modest wind efficiency of $\\eta_{\\rm wind}=0.45-0.35$, the Pop III GRB production efficiency is $\\eta_{\\rm GRB}\\sim10^{-5}-3\\times10^{-4}\\,M_\\odot^{-1}$, respectively, for a top-heavy IMF. This yields an observable all-sky equivalent rate of $\\sim2-40\\,{\\rm yr}^{-1}$ by \\textit{Swift}, with 75\\% of the GRBs located at $z\\lesssim8$. If the actual observed rate is much lower, then this would imply $\\eta_{\\rm wind}>0.45$, which leads to significant loss of mass and angular momentum that renders isolated Pop III stars incapable of producing GRBs and favors a binary scenario instead.",
      "pdf_url": "https://arxiv.org/pdf/2508.03689.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.10573",
      "title": "Constraints on the progenitor and explosion of SN 2024ggi in harmony with pre-explosion detection and hydrodynamic simulations",
      "authors": [
        "Amar Aryan",
        "Erin Higgins",
        "Matt Nicholl",
        "Ting-Wan Chen",
        "Yu-Hsuan Liu"
      ],
      "abstract": "Constraints on the progenitor and explosion of SN 2024ggi in harmony with pre-explosion detection and hydrodynamic simulations Amar Aryan, Erin Higgins, Matt Nicholl, Ting-Wan Chen, Yu-Hsuan Liu 11 pages, 5 figures, 1 table. Accepted for publication in the Astrophysical Journal (ApJ). Current version matches the accepted version. All the MESA-inlist-files, pre-SN models, STELLA input files to generate luminosity, velocity evolution, and the final STELLA result files, are available on: this https URL and this https URL High Energy Astrophysical Phenomena (astro-ph.HE) Supernova (SN) 2024ggi is a nearby Type II SN discovered by ATLAS, showing early flash-ionization features. The pre-explosion images reveal a red supergiant (RSG) progenitor with an initial mass of 10-17 M$_\\odot$. In the present work, we perform detailed hydrodynamic modeling to refine and put robust constraints on the progenitor and explosion parameters of SN 2024ggi. Among the progenitor models in our study, the pre-SN properties of the 11 M$_{\\odot}$ match the pre-explosion detected progenitor well. However, we find it difficult to completely rule out the 10 M$_{\\odot}$ and 12 M$_{\\odot}$ models. Thus, we provide a constraint of 11$^{+1}_{-1}$ M$_{\\odot}$ on the initial mass of the progenitor. To match the observed bolometric light curve and velocity evolution of SN 2024ggi, the favored model with an initial mass of 11 M$_{\\odot}$ has a pre-SN radius of 800 R$_{\\odot}$. This model requires an explosion energy of [0.7-0.8]$\\times$10$^{51}$ erg, nickel mass of 0.049 M$_{\\odot}$, ejecta mass of 9.1 M$_{\\odot}$, and an amount of $\\sim$ 0.5 M$_{\\odot}$ of steady-wind CSM extended up to $\\sim1.2\\times10^{14}$ cm resulting from an eruptive mass-loss rate of 1.0 M$_{\\odot}$ yr$^{-1}$. We also incorporate the accelerated-wind CSM scenario, which suggests a mass-loss rate of 1.0$\\times10^{-2}$ M$_{\\odot}$ yr$^{-1}$ and a CSM mass of $\\sim$ 0.7 M$_{\\odot}$ extended up to $\\sim1.1\\times10^{14}$ cm. This mass-loss rate falls within the range constrained observationally. Additionally, due to the constraint of 11$^{+1}_{-1}$ M$_{\\odot}$ on the initial mass, the range of pre-SN radius and ejecta mass would be [690-900] R$_{\\odot}$, and [8.2-9.6] M$_{\\odot}$, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2508.10573.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19132",
      "title": "Evidence of Energy Injection in the Short and Distant GRB 250221A",
      "authors": [
        "Camila Angulo-Valdez",
        "Rosa L. Becerra",
        "Ramandeep Gill",
        "Noémie Globus",
        "William H. Lee",
        "Diego López-Cámara",
        "Cassidy Mihalenko",
        "Enrique Moreno-Méndez",
        "Roberto Ricci",
        "Karelle Siellez",
        "Alan M. Watson",
        "Muskan Yadav",
        "Yu-han Yang",
        "Dalya Akl",
        "Sarah Antier",
        "Jean-Luc Atteia",
        "Stéphane Basa",
        "Nathaniel R. Butler",
        "Simone Dichiara",
        "Damien Dornic",
        "Jean-Grégoire Ducoin",
        "Francis Fortin",
        "Leonardo García-García",
        "Kin Ocelotl López",
        "Francesco Magnani",
        "Brendan O'Connor",
        "Margarita Pereyra",
        "Ny Avo Rakotondrainibe",
        "Fredd Sánchez-Álvarez",
        "Benjamin Schneider",
        "Eleonora Troja",
        "Antonio de Ugarte Postigo"
      ],
      "abstract": "Evidence of Energy Injection in the Short and Distant GRB 250221A Camila Angulo-Valdez, Rosa L. Becerra, Ramandeep Gill, Noémie Globus, William H. Lee, Diego López-Cámara, Cassidy Mihalenko, Enrique Moreno-Méndez, Roberto Ricci, Karelle Siellez, Alan M. Watson, Muskan Yadav, Yu-han Yang, Dalya Akl, Sarah Antier, Jean-Luc Atteia, Stéphane Basa, Nathaniel R. Butler, Simone Dichiara, Damien Dornic, Jean-Grégoire Ducoin, Francis Fortin, Leonardo García-García, Kin Ocelotl López, Francesco Magnani, Brendan O'Connor, Margarita Pereyra, Ny Avo Rakotondrainibe, Fredd Sánchez-Álvarez, Benjamin Schneider, Eleonora Troja, Antonio de Ugarte Postigo 19 pages, 13 figures. Fixed typo in Table 1 High Energy Astrophysical Phenomena (astro-ph.HE) We present the photometric and spectroscopic analysis of the short-duration GRB 250221A ($T_{90}=1.80\\pm0.32$ s), using a data set from the optical facilities COLIBRÍ, the Harlingten 50 cm Telescope, and the Very Large Telescope. We complement these observations with data from the \\textit{Neil Gehrels Swift Observatory} and the \\textit{Einstein Probe}, as well as radio observations from the Very Large Array. GRB 250221A is among the few short GRBs with direct afterglow spectroscopy, which gives a secure redshift determination of $z=0.768$ and allows the unambiguous identification of the host as a galaxy with a star-formation rate of $\\sim3\\,M_\\odot\\,{\\rm yr}^{-1}$. The X-ray and optical light curves up to $T_0+10$ ks (where $T_0$ refers to the GRB trigger time) are well described by forward-shock synchrotron emission in the slow-cooling regime within the standard fireball framework. However, at $T_0+0.6$ days, both the X-ray and optical bands exhibit an excess over the same interval, which we interpret as evidence of energy injection into a jet with a half-opening angle of $\\theta_j=11.5^{\\circ}$ through a refreshed shock powered by late central engine activity or a radially stratified ejecta. The burst properties (duration, spectral hardness, peak energy, and location in the Amati plane) all favour a compact binary merger origin. However, our modelling of the afterglow suggests a dense circumburst medium ($n\\sim80$ cm$^{-3}$), which is more typical of a Collapsar environment. This tension over the classification of this burst (short-hard vs. long-soft) as inferred from the prompt and afterglow emissions makes GRB~250221A an unusual event and underscores the limitations of duration-based classifications and the importance of multi-wavelength, time-resolved follow-up observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.19132.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.07215",
      "title": "AppleCiDEr II: SpectraNet -- A Deep Learning Network for Spectroscopic Data",
      "authors": [
        "Maojie Xu",
        "Argyro Sasli",
        "Alexandra Junell",
        "Felipe Fontinele Nunes",
        "Yu-Jing Qin",
        "Christoffer Fremling",
        "Sam Rose",
        "Theophile Jegou Du Laz",
        "Benny Border",
        "Antoine Le Calloch",
        "Sushant Sharma Chaudhary",
        "Hailey Markoff",
        "Avyukt Raghuvanshi",
        "Nabeel Rehemtulla",
        "Jesper Sollerman",
        "Yashvi Sharma",
        "Niharika Sravan",
        "Judy Adler",
        "Tracy X. Chen",
        "Richard Dekany",
        "Reed Riddle",
        "Mansi M. Kasliwal",
        "Matthew J. Graham",
        "Michael W. Coughlin"
      ],
      "abstract": "AppleCiDEr II: SpectraNet -- A Deep Learning Network for Spectroscopic Data Maojie Xu, Argyro Sasli, Alexandra Junell, Felipe Fontinele Nunes, Yu-Jing Qin, Christoffer Fremling, Sam Rose, Theophile Jegou Du Laz, Benny Border, Antoine Le Calloch, Sushant Sharma Chaudhary, Hailey Markoff, Avyukt Raghuvanshi, Nabeel Rehemtulla, Jesper Sollerman, Yashvi Sharma, Niharika Sravan, Judy Adler, Tracy X. Chen, Richard Dekany, Reed Riddle, Mansi M. Kasliwal, Matthew J. Graham, Michael W. Coughlin Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) Time-domain surveys such as the Zwicky Transient Facility (ZTF) have opened a new frontier in the discovery and characterization of transients. While photometric light curves provide broad temporal coverage, spectroscopic observations remain crucial for physical interpretation and source classification. However, existing spectral analysis methods -- often reliant on template fitting or parametric models -- are limited in their ability to capture the complex and evolving spectra characteristic of such sources, which are sometimes only available at low resolution. In this work, we introduce SpectraNet, a deep convolutional neural network designed to learn robust representations of optical spectra from transients. Our model combines multi-scale convolution kernels and multi-scale pooling to extract features from preprocessed spectra in a hierarchical and interpretable manner. We train and validate SpectraNet on low-resolution time-series spectra obtained from the Spectral Energy Distribution Machine (SEDM) and other instruments, demonstrating state-of-the-art performance in classification. Furthermore, in redshift prediction tasks, SpectraNet achieves a root mean squared relative redshift error of 0.02, highlighting its effectiveness in precise regression tasks as well.",
      "pdf_url": "https://arxiv.org/pdf/2510.07215.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04745",
      "title": "Sub-Gyr variability around the SFMS and its contribution to the scatter",
      "authors": [
        "A. Camps-Fariña",
        "M. Chamorro-Cazorla",
        "S. F. Sánchez"
      ],
      "abstract": "Sub-Gyr variability around the SFMS and its contribution to the scatter A. Camps-Fariña, M. Chamorro-Cazorla, S. F. Sánchez Astrophysics of Galaxies (astro-ph.GA) We aim to measure the evolution of individual galaxies around the Star Formation Main Sequence (SFMS) during the last Gyr as a function of their stellar mass to quantify how much of its scatter is due to short-term this http URL derived star formation histories using full spectral fitting for a sample of 8,960 galaxies from the MaNGA survey to track the position of the galaxies in the SFMS during the last this http URL variability correlates with both the stellar mass of the galaxies and their current position in both the SFMS and the mass-metallicity relation (MZR), with the position in the latter strongly affecting variability in SFR. While most of the fluctuations are compatible with stochasticity, there is a very weak but statistically significant preference for $\\sim135-150$ Myr time-scales. These results support a strong self-regulation of SFR within galaxies, establishing characteristic intensities and time-scales for bursts of star formation and quenching episodes. We also find that short-term variability cannot account for the entirety of the scatter in the SFMS. It appears to originate to a similar degree in short-term variability and long-term (halo-level) differentiation and fits predictions from models.",
      "pdf_url": "https://arxiv.org/pdf/2511.04745.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04750",
      "title": "The essential elements of dust evolution: a-C(:H) nanoparticle sub-structures and photo-fragmentation",
      "authors": [
        "A.P. Jones",
        "N. Ysard"
      ],
      "abstract": "The essential elements of dust evolution: a-C(:H) nanoparticle sub-structures and photo-fragmentation A.P. Jones, N. Ysard 12 pages, 4 figures, 4 tables, accepted Astrophysics of Galaxies (astro-ph.GA) Hydrogenated amorphous carbon materials, a-C(:H), are heterogeneous structures consisting of carbon atoms in different hybridisation states and bonding configurations and are thought to constitute a significant and observationally important fraction of the interstellar dust material. This work aims to characterise semi-conducting a-C(:H) nanoparticle structures and, in particular, their property-characterising aromatic domain size distribution and so predict how they will behave in intense UV radiation fields that can fragment them through dissociative and charge effects as a result of carbon-carbon bond-breaking. Using a statistical approach we determine the typical sizes of the aromatic domains, their size distribution, how they are network-bonded, and where they are to be found within the structure. We consider the effects of thermal excitation, photo-dissociation and charging of a-C(:H) nanoparticles, and the products of their fragmentation. The derived UV photon-induced fragmentation lifetimes for nanometre-sized a-C(:H) nanoparticles, with radii ~0.4-0.5nm radius and containing ~40-60 carbon atoms, are of the order of 10^6-10^7yr in the diffuse interstellar medium and likely 10^2-10^4 times shorter in photodissociation regions, depending on the local radiation field intensity. Grains larger than this are stable against photodissociation. In H{\\footnotesize II} regions only a-C(:H) nanoparticles with radii greater than 0.7nm (> 150 carbon atoms) are likely to survive. The photon-driven fragmentation of sub-nanometre a-C(:H) particles was determined to be important in the diffuse interstellar medium and also in high excitation regions, such as photodissociation and HII regions. However, in these same regions Coulomb fragmentation is unlikely to be an important dust destruction process.",
      "pdf_url": "https://arxiv.org/pdf/2511.04750.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04772",
      "title": "ALMA Sub-parsec Resolution Dense Molecular Line Observations of the NGC 1068 Nucleus",
      "authors": [
        "Masatoshi Imanishi , Bernd Vollmer , Yoshiaki Hagiwara , Kouichiro Nakanishi , Takuma Izumi , Nozomu Kawakatu NAOJ, Universite de Strasbourg, Toyo University, Kure college)"
      ],
      "abstract": "ALMA Sub-parsec Resolution Dense Molecular Line Observations of the NGC 1068 Nucleus Masatoshi Imanishi (1), Bernd Vollmer (2), Yoshiaki Hagiwara (3), Kouichiro Nakanishi (1), Takuma Izumi (1), Nozomu Kawakatu (4) ((1) NAOJ, (2) Universite de Strasbourg, (3) Toyo University, (4) Kure college) 21 pages, 13 figures. ApJ accepted Astrophysics of Galaxies (astro-ph.GA) We present the results of our ALMA observations of the dense molecular HCN J=4-3 and HCO$^{+}$ J=4-3 lines at $\\lesssim$1 pc ($\\lesssim$14 mas) resolution in the nuclear region of the nearby ($\\sim$14 Mpc) well-studied AGN NGC 1068. Both emission lines are clearly detected around the AGN along an almost east-west direction, which we ascribe to the dusty molecular torus. The HCN J=4-3 emission is brighter than the HCO$^{+}$ J=4-3 emission in the compact ($\\lesssim$3-5 pc) torus region. Apparent counter-rotation between the inner ($\\lesssim$2 pc) and outer ($\\gtrsim$2 pc) parts of the western torus, previously seen in $\\sim$1.5 pc-resolution HCN J=3-2 and HCO$^{+}$ J=3-2 data, is also confirmed in our new $\\lesssim$1 pc-resolution HCN J=4-3 and HCO$^{+}$ J=4-3 data. We apply a physically counter-rotating torus model, in which a compact dense gas clump collided with the western side of the existing rotating torus from the opposite direction, and we find that this model largely reproduces the observed properties of the combined new $\\lesssim$1 pc-resolution HCN J=4-3 and HCO$^{+}$ J=4-3 data, and the previously obtained $\\lesssim$1.5 pc-resolution HCN J=3-2 and HCO$^{+}$ J=3-2 data.",
      "pdf_url": "https://arxiv.org/pdf/2511.04772.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04778",
      "title": "Kinematic and extinction analysis of a potential spiral arm beyond the Galactic bar",
      "authors": [
        "Simran Joharle",
        "Francisco Nogueras-Lara",
        "Karl Fiteni"
      ],
      "abstract": "Kinematic and extinction analysis of a potential spiral arm beyond the Galactic bar Simran Joharle, Francisco Nogueras-Lara, Karl Fiteni Accepted for publication in A&A. 11 pages, 9 figures. Abstract abridged to satisfy arXiv requirements Astrophysics of Galaxies (astro-ph.GA) Determining the structure of the Milky Way is essential for understanding its morphology, dynamics, and evolution. However, studying its innermost regions is challenging due to high extinction and crowding. The detection of a double red clump (RC; core-helium-burning stars) feature at very low Galactic latitudes suggests the presence of a spiral arm beyond the Galactic bar, providing new insights into the Galaxy's structure along this complex line of sight. We evaluate this possibility by analysing the proper motion and extinction distributions of the detected RC features. We constructed proper motion and extinction difference maps to investigate the kinematic and reddening properties of the RC populations, and the kinematic differences were validated using N-body simulations of a Milky Way-like galaxy. We find that the two RC features are kinematically distinct, with a relative proper motion difference of $-0.16\\pm0.02\\, mas/yr$ in the component parallel to the Galactic plane. This difference can be explained by Galactic rotation if the two RCs lie at different distances, consistent with the simulations. The extinction towards the secondary RC is also $\\sim0.05$ mag higher than that of the primary RC. Additionally, we estimate that the extinction difference between the RC features corresponds to only $\\sim5\\%$ of the total extinction from Earth to the first RC, suggesting little interstellar material between the farthest edge of the Galactic bar and the kinematically distinct structure traced by the secondary RC. Using $JK_s$ photometry, we derive $A_J/A_{K_s}=3.34\\pm0.07$, consistent with previous results and showing no significant variation across fields or along the line of sight. The results support the secondary clump tracing a distant structure, possibly a spiral arm, although we cannot exclude that the population belongs to the disc.",
      "pdf_url": "https://arxiv.org/pdf/2511.04778.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04843",
      "title": "JWST provides a new view of cosmic dawn: latest developments in studies of early galaxies",
      "authors": [
        "Jorryt Matthee"
      ],
      "abstract": "JWST provides a new view of cosmic dawn: latest developments in studies of early galaxies Jorryt Matthee Original manuscript of an invited review to be published by Taylor & Francis in Contemporary Physics in Winter 2025. 34 pages, 18 figures Astrophysics of Galaxies (astro-ph.GA) Studies of the distant Universe are providing key insights into our understanding of the formation of galaxies. The advent of the James Webb Space Telescope (JWST) has significantly enhanced our observational capabilities, leading to an expanded redshift frontier, providing unprecedented detail in the characterization of early galaxies and enabling the discovery of new populations of accreting black holes. This review aims to provide an introduction to the basic processes and components that shape the observed spectra of galaxies, with a focus on their relevance to techniques with which high-redshift galaxies are selected. The review further introduces specific topics that have attracted significant attention in recent literature, including the discovery of highly efficient galaxy formation in the early Universe, the relation between galaxies and the process of reionization, new insights into the formation of the first stars and the enrichment of interstellar gas with heavy elements, and breakthroughs in our understanding of the origins of supermassive black holes.",
      "pdf_url": "https://arxiv.org/pdf/2511.04843.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05036",
      "title": "A deep X-ray look to the most obscured quasar at z~3.6 and its environment",
      "authors": [
        "I. Villani",
        "L. Zappacosta",
        "E. Piconcelli",
        "M. Ginolfi",
        "F. Ricci",
        "F. La Franca",
        "F. Arrigoni-Battaia",
        "A. Bongiorno",
        "S. Cantalupo",
        "S. Carniani",
        "F. Civano",
        "A. Comastri",
        "F. Fiore",
        "R. Maiolino",
        "L. Pentericci",
        "C. Ricci",
        "R. Schneider",
        "R. Valiante",
        "C. Vignali",
        "F. Vito"
      ],
      "abstract": "A deep X-ray look to the most obscured quasar at z~3.6 and its environment I. Villani, L. Zappacosta, E. Piconcelli, M. Ginolfi, F. Ricci, F. La Franca, F. Arrigoni-Battaia, A. Bongiorno, S. Cantalupo, S. Carniani, F. Civano, A. Comastri, F. Fiore, R. Maiolino, L. Pentericci, C. Ricci, R. Schneider, R. Valiante, C. Vignali, F. Vito 11 pages, 10 figures, 3 tables. Accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The most luminous and obscured quasars (QSOs) detected in infrared all-sky surveys could represent a key co-evolutionary phase from nuclear to circum-galactic (CG) scales in the formation of massive galaxies. In this context, Hot Dust Obscured Galaxies (Hot DOGs) at z ~2-4 provide a unique opportunity to study the link between cosmic mass assembly and nuclear accretion in high-z luminous QSOs/galaxies. W0410-0913 (hereafter W0410-09) is a luminous ($\\rm ~L_{\\rm bol} \\sim 6.4 \\times10^{47} \\rm erg\\ s^{-1}$) obscured QSO at z = 3.631, with a 30 kpc CG Ly$\\alpha$ nebula (CGLAN), smaller than the ~ 100 kpc nebulae around unobscured Type-I QSOs, and an exceptional overdense environment of ~ 19 Ly$\\alpha$ emitters (LAEs) within 300 kpc and $\\pm$ 200 $\\rm km ~s^{-1}$ of the Hot DOG. We aim to detect and characterize nuclear accretion in W0410-09 and its environment. Exploiting a deep proprietary ~280 ks Chandra observation, using empirical and physically motivated models for obscured sources, we show that W0410-09 exhibits Compton-thick obscuration ($\\rm~ N_H > 10^{24} \\rm cm^{-2}$) and high intrinsic luminosity ($\\rm ~L_{2-10} > 10^{45} \\rm erg ~s^{-1}$), making it one of the most luminous obscured QSOs at z $>$ 3.5. With the exclusion of W0410-09 we do not detect X-ray emission from any of the 19 LAEs, except for a 3$\\sigma$ signal in the 6-7 keV rest-frame band, interpreted as Fe K$\\alpha$ emission, suggesting the presence of heavily obscured yet undetected AGN emission in several LAEs. Including W0410-09, the estimated AGN fraction is $f_{\\rm AGN}^{\\rm LAE} = 5^{+12}_{-4}$%, potentially up to ~35% if unresolved obscured AGN are considered as suggested by the Fe K$\\alpha$ line detection. We conclude that W0410-09 is in a critical transitional blow-out phase, during which powerful QSO-driven outflows are clearing the nuclear obscuration, ultimately leading to an unobscured luminous quasar.",
      "pdf_url": "https://arxiv.org/pdf/2511.05036.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05056",
      "title": "Quokka-based understanding of outflows (QED) - IV. Limitations of H$α$ as an outflow diagnostic",
      "authors": [
        "Rongjun Huang",
        "Aditi Vijayan",
        "Mark R. Krumholz"
      ],
      "abstract": "Quokka-based understanding of outflows (QED) - IV. Limitations of H$α$ as an outflow diagnostic Rongjun Huang, Aditi Vijayan, Mark R. Krumholz 12 pages, 8 figures. Submitted. Comments are welcome Astrophysics of Galaxies (astro-ph.GA) The presence of broad wings in the H$\\alpha$} line is commonly used as a diagnostic of the presence and properties of galactic winds from star-forming galaxies. However, the accuracy of this approach has not been subjected to extensive testing. In this paper, we use high-resolution simulations of galactic wind launching to calibrate the extent to which broad H$\\alpha$} wings can be used to infer the properties of galactic outflows. For this purpose, we analyse a series of high-resolution wind simulations from the QED suite spanning two orders of magnitude in star formation surface density ($\\Sigma_\\mathrm{SFR}$). We show that the broad component of H$\\alpha$} emission correlates well with the wind mass flux at heights $\\sim1$ kpc above the galactic plane, but that the correlation is poor at larger distances from the plane, and that even at 1 kpc the relationship between mass flux and surface brightness of broad H$\\alpha$} is significantly sub-linear. The sub-linear scaling suggests that the electron column density in the wind increases systematically with outflow strength, and that the conventional assumption of constant electron density in the wind leads to a systematic overestimate of how steeply mass loading factors depend on $\\Sigma_\\mathrm{SFR}$. We provide empirical scaling relations that observers can apply to correct for this effect when converting H$\\alpha$} measurements to mass outflow rates. Finally, we use synthetic observations of the density-diagnostic $[\\mathrm{S_{II}}]\\,\\lambda\\lambda6716,6731$ doublet to show that using this diagnostic only slightly improves estimates of wind outflow rates compared to the naive assumption of constant electron density, and performs significantly worse than the empirical correlation we provide.",
      "pdf_url": "https://arxiv.org/pdf/2511.05056.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05068",
      "title": "NGC 6860, Mrk 915, and MCG -01-24-012. II. Inflowing and outflowing cold molecular gas and the connection with ionized gas in Seyfert galaxies",
      "authors": [
        "Bruno Dall'Agnol de Oliveira",
        "Thaisa Storchi-Bergmann",
        "Neil Nagar",
        "Santiago Garcia-Burillo",
        "Rogemar A. Riffel",
        "Dominika Wylezalek",
        "Pranav Kukreti",
        "Venkatessh Ramakrishnan"
      ],
      "abstract": "NGC 6860, Mrk 915, and MCG -01-24-012. II. Inflowing and outflowing cold molecular gas and the connection with ionized gas in Seyfert galaxies Bruno Dall'Agnol de Oliveira, Thaisa Storchi-Bergmann, Neil Nagar, Santiago Garcia-Burillo, Rogemar A. Riffel, Dominika Wylezalek, Pranav Kukreti, Venkatessh Ramakrishnan Astrophysics of Galaxies (astro-ph.GA) We present a study of the cold molecular gas kinematics in the inner ~ 4-7 kpc (projected sizes) of three nearby Seyfert galaxies, with AGN luminosities of ~ 10$^{44}$ erg/s, using observations of the CO(2-1) emission line, obtained with the Atacama Large Millimeter/submillimeter Array (ALMA) at ~ 0.5-0.8$^{\\prime\\prime}$ (~ 150-400 pc) spatial resolutions. After modeling the CO profiles with multiple Gaussian components, we detected regions with double-peak profiles that exhibit kinematics distinct from the dominant rotational motion. In NGC 6860, a molecular outflow surrounding the bipolar emission of the [O III] ionized gas is observed extending up to $R_{out}$ ~ 560 pc from the nucleus. There is evidence of molecular inflows along the stellar bar, although an alternative scenario, involving a decoupled rotation in a circumnuclear disk (CND) can also explain the observed kinematics. Mrk 915 shows double-peak CO profiles along one of its spiral arms. Due to its ambiguous disk orientation, part of the CO emission can be interpreted as a molecular gas inflow or an outflow reaching $R_{out}$ ~ 2.8 kpc. MCG -01-24-012 has double-peak profiles associated with a CND, perpendicular to the [O III] bipolar emission. The CO in the CND is rotating while outflowing within $R_{out}$ ~ 3 kpc, with the disturbances possibly being caused by the passage of the ionized gas outflow. Overall, the mass inflow rates are larger than the accretion rate needed to produce the observed luminosities, suggesting that only a fraction of the inflowing gas ends up feeding the central black holes. Although we found signatures of AGN feedback on the cold molecular phase, the mass outflow rates of ~ 0.09-3 M$_\\odot$/yr indicate an overall weak impact at these AGN luminosities. Nonetheless, we may be witnessing the start of the depletion and ejection of the molecular gas reservoir that has accumulated over time.",
      "pdf_url": "https://arxiv.org/pdf/2511.05068.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05113",
      "title": "Spatially-resolved PAH_3.3 emission and stellar ages in ram pressure stripped clumps at z~0.3",
      "authors": [
        "Pietro Benotto",
        "Benedetta Vulcani",
        "Peter J. Watson",
        "Giulia Rodighiero",
        "Bianca M. Poggianti",
        "Marco Gullieuszik",
        "Jacopo Fritz",
        "Thomas S.-Y. Lai",
        "Augusto E. Lassen",
        "Matthew A. Malkan",
        "Alessia Moretti"
      ],
      "abstract": "Spatially-resolved PAH_3.3 emission and stellar ages in ram pressure stripped clumps at z~0.3 Pietro Benotto (INAF OAPd - Unipd), Benedetta Vulcani, Peter J. Watson, Giulia Rodighiero, Bianca M. Poggianti, Marco Gullieuszik, Jacopo Fritz, Thomas S.-Y. Lai, Augusto E. Lassen, Matthew A. Malkan, Alessia Moretti Submitted to A&A, 17 pages plus appendices Astrophysics of Galaxies (astro-ph.GA) Ram pressure stripping (RPS) plays a crucial role in shaping galaxy evolution in dense environments, yet its impact on the molecular and dusty phases of the interstellar medium remains poorly understood. We present JWST/NIRCam 3.3 micrometres PAH emission maps for the nine most striking RPS galaxies in the Abell 2744 cluster at redshift z_cl = 0.306, tracing the effects of environmental processes on small dust grains. Exploiting multi-band JWST/NIRCam and HST photometry, we perform spatially-resolved UV to mid-infrared spectral energy distribution (SED) fitting, characterising stellar populations in both galactic disks and clumps detected in the stripped tails. We detect PAH_3.3 mission in eight of the nine galaxies at 5 sigma, with morphologies revealing disk truncation and elongation along the RPS direction. In three galaxies, PAH_3.3 emission is also found in star-forming clumps embedded in the stripped tails up to a distance of 40 kpc. Star formation rates inferred from PAH_3.3 emission agree with those derived from SED fitting averaged over the past 100 Myr within an intrinsic scatter of 0.4 dex, but the relation appears to be age dependent. The spatial correlation between PAH strength, stellar age, and SFR - consistent across disks and tails - demonstrates that PAH-carrying molecules can survive and be stripped by ram pressure. Finally, age gradients revealed by the SED fitting provide the first observational evidence outside the Local Universe for the fireball model of star formation in stripped clumps. This work represents the first detailed study of PAH emission in cluster galaxies, offering new insights into the fate of dust and star formation in extreme environments.",
      "pdf_url": "https://arxiv.org/pdf/2511.05113.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05115",
      "title": "Stellar Population Astrophysics (SPA) with the TNG 23 IR elemental abundances of 114 giant stars in 41 Open Clusters",
      "authors": [
        "Shilpa Bijavara Seshashayana",
        "Henrik Jönsson",
        "Valentina D'Orazi",
        "Angela Bragaglia",
        "Mingjie Jian",
        "Gloria Andreuzzi",
        "Marina Dal Ponte"
      ],
      "abstract": "Stellar Population Astrophysics (SPA) with the TNG 23 IR elemental abundances of 114 giant stars in 41 Open Clusters Shilpa Bijavara Seshashayana, Henrik Jönsson, Valentina D'Orazi, Angela Bragaglia, Mingjie Jian, Gloria Andreuzzi, Marina Dal Ponte Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) Open clusters have been extensively used as tracers of Galactic chemical evolution, as their constituent stars possess shared characteristics, including age, Galactocentric radius, metallicity, and chemical composition. By examining the trends of elemental abundances with metallicity, age, and Galactocentric radius, valuable insights can be gained into the distribution and nucleosynthetic origins of chemical elements across the Galactic disc. The infrared domain in particular facilitates the observation of some elemental abundances that can be challenging or impossible to discern in the optical, for example K and F. The objective of this study is to derive the stellar parameters and elemental abundances of up to 23 elements in 114 stars spanning 41 open clusters using high-resolution infrared spectroscopy. In addition, the present study aims to examine the chemical evolution of the Galactic disc. This is achieved by investigating radial abundance gradients, variations in abundance between clusters, and the dependence of chemical abundances on cluster age.",
      "pdf_url": "https://arxiv.org/pdf/2511.05115.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05259",
      "title": "The stellar mass function of quiescent and star-forming galaxies and its dependence on morphology in COSMOS-Web",
      "authors": [
        "Marko Shuntov",
        "Olivier Ilbert",
        "Claudia del P. Lagos",
        "Sune Toft",
        "Francesco Valentino",
        "Wilfried Mercier",
        "Hollis B. Akins",
        "Nguyen Binh",
        "Malte Brinch",
        "Caitlin M. Casey",
        "Maximilien Franco",
        "Fabrizio Gentile",
        "Ghassem Gozaliasl",
        "Aryana Haghjoo",
        "Santosh Harish",
        "Michaela Hirschmann",
        "Marc Huertas-Company",
        "Shuowen Jin",
        "Jeyhan S. Kartaltepe",
        "Anton M. Koekemoer",
        "Clotilde Laigle",
        "Joseph S. W. Lewis",
        "Georgios E. Magdis",
        "Henry Joy McCracken",
        "Bahram Mobasher",
        "Thibaud Moutard",
        "Pascal A. Oesch",
        "Louise Paquereau",
        "Alvio Renzini",
        "Michael R. Rich",
        "David B. Sanders",
        "Greta Toni",
        "Laurence Tresse",
        "Andrea Weibel",
        "John R. Weaver",
        "Lilan Yang"
      ],
      "abstract": "The stellar mass function of quiescent and star-forming galaxies and its dependence on morphology in COSMOS-Web Marko Shuntov, Olivier Ilbert, Claudia del P. Lagos, Sune Toft, Francesco Valentino, Wilfried Mercier, Hollis B. Akins, Nguyen Binh, Malte Brinch, Caitlin M. Casey, Maximilien Franco, Fabrizio Gentile, Ghassem Gozaliasl, Aryana Haghjoo, Santosh Harish, Michaela Hirschmann, Marc Huertas-Company, Shuowen Jin, Jeyhan S. Kartaltepe, Anton M. Koekemoer, Clotilde Laigle, Joseph S. W. Lewis, Georgios E. Magdis, Henry Joy McCracken, Bahram Mobasher, Thibaud Moutard, Pascal A. Oesch, Louise Paquereau, Alvio Renzini, Michael R. Rich, David B. Sanders, Greta Toni, Laurence Tresse, Andrea Weibel, John R. Weaver, Lilan Yang Astrophysics of Galaxies (astro-ph.GA) We study the stellar mass function (SMF) of quiescent and star-forming galaxies and its dependence on morphology in 10 redshift bins at $0.2<z<5.5$ using the COSMOS2025 catalog built from $0.54 \\, {\\rm deg}^2$ JWST imaging from COSMOS-Web. Galaxies are selected by type using the $NUVrJ$ rest-frame color diagram and classified morphologically by bulge-to-total light ratio ($B/T$). The quiescent SMF shows rapid early build-up, with the most massive systems (${\\rm log}(M_{\\star}/{\\rm M_{\\odot}})\\gtrsim11$) assembled by $z\\sim1$ and evolving little since. The star-forming SMF evolves more slowly, following a mass-evolution scenario where galaxies grow via star formation and quench at the characteristic mass $\\log(M^{*}/{\\rm M}_{\\odot})\\sim10.6$. Bulge systems ($B/T>0.6$) dominate the quiescent SMF at ${\\rm log}(M_{\\star}/{\\rm M_{\\odot}})>10$ at all redshifts, while disks ($B/T<0.2$) dominate at ${\\rm log}(M_{\\star}/{\\rm M_{\\odot}})<9$. However, most bulge-dominated galaxies are star-forming, with their fraction increasing with redshift and decreasing mass, consistent with being progenitors of quiescent bulges. We find evidence for environmental quenching onset at $z\\sim3$ from the upturn in the quiescent SMF at ${\\rm log}(M_{\\star}/{\\rm M_{\\odot}})<9.5$, contributed by disk-dominated galaxies consistent with satellite quenching that retains disk morphologies. Number densities of ${\\rm log}(M_{\\star}/{\\rm M_{\\odot}})>10$ quiescent galaxies are lower than recent literature by $0.1-0.7$ dex, but agree well with simulations at $2<z<3$. At $z>3$, simulations increasingly underpredict observations. Finally, we build an empirical model describing galaxy number density evolution by parametrizing quenching rates, baryon conversion efficiency, and bulge formation. Our model supports a scenario where star-forming galaxies grow central bulges before quenching in massive halos.",
      "pdf_url": "https://arxiv.org/pdf/2511.05259.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05342",
      "title": "Intensive X-ray/UVOIR continuum reverberation mapping of the Seyfert AGN MCG+08-11-11",
      "authors": [
        "D. Kynoch",
        "I. M. McHardy",
        "E. M. Cackett",
        "J. Gelbord",
        "J. V. Hernández Santisteban",
        "K. Horne",
        "J. A. Miller",
        "H. Netzer",
        "C. Done",
        "R. Edelson",
        "M. M. Fausnaugh",
        "M. R. Goad",
        "B. M. Peterson",
        "F. M. Vincentelli"
      ],
      "abstract": "Intensive X-ray/UVOIR continuum reverberation mapping of the Seyfert AGN MCG+08-11-11 D. Kynoch, I. M. McHardy, E. M. Cackett, J. Gelbord, J. V. Hernández Santisteban, K. Horne, J. A. Miller, H. Netzer, C. Done, R. Edelson, M. M. Fausnaugh, M. R. Goad, B. M. Peterson, F. M. Vincentelli 24 pages, 13 figures (including appendices). Revised following referee's report Astrophysics of Galaxies (astro-ph.GA) We present results from intensive (x3 daily), three-month-long X-ray, UV and optical monitoring of the bright Seyfert active galactic nucleus (AGN) MCG+08-11-11 with Swift, supported by optical-infrared ground-based monitoring. The 12 resultant, well-sampled, lightcurves are highly correlated; in particular, the X-ray to UV correlation r_max = 0.85 is, as far as we know, the highest yet recorded in a Seyfert galaxy. The lags increase with wavelength, as expected from reprocessing of central high-energy emission by surrounding material. Our lag spectrum is much shallower than that obtained from an optical monitoring campaign conducted a year earlier when MCG+08-11-11 was approximately 4 times brighter. After filtering out long-term trends in the earlier optical lightcurves we recover shorter lags consistent with our own - demonstrating concurrent reverberation signals from different spatial scales and the luminosity dependence of the measured lags. We use our lag spectrum to test several physical models, finding that disc reprocessing models cannot account for the observed 'excess' lags in the u and r-i-bands that are highly indicative of the Balmer and Paschen continua produced by reprocessing in the broad line region (BLR) gas. The structure seen in both the variable (rms) and lag spectra, and the large time delay between X-ray and UV variations (approximately 2 days) all suggest that the BLR is the dominant reprocessor. The hard X-ray spectrum (Gamma approximately 1.7) and faint, red, UV-optical spectrum both indicate that the Eddington accretion ratio is low: approximately 0.03. The bolometric luminosity then requires that the black hole mass is substantially greater than current reverberation mapping derived estimates.",
      "pdf_url": "https://arxiv.org/pdf/2511.05342.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05367",
      "title": "Linking Warm Dark Matter to Merger Tree Histories via Deep Learning Networks",
      "authors": [
        "Ilem Leisher",
        "Paul Torrey",
        "Alex M. Garcia",
        "Jonah C. Rose",
        "Francisco Villaescusa-Navarro",
        "Zachary Lubberts",
        "Arya Farahi",
        "Stephanie O'Neil",
        "Xuejian Shen",
        "Olivia Mostow",
        "Nitya Kallivayalil",
        "Dhruv Zimmerman",
        "Desika Narayanan",
        "Mark Vogelsberger"
      ],
      "abstract": "Linking Warm Dark Matter to Merger Tree Histories via Deep Learning Networks Ilem Leisher, Paul Torrey, Alex M. Garcia, Jonah C. Rose, Francisco Villaescusa-Navarro, Zachary Lubberts, Arya Farahi, Stephanie O'Neil, Xuejian Shen, Olivia Mostow, Nitya Kallivayalil, Dhruv Zimmerman, Desika Narayanan, Mark Vogelsberger 20 pages, 9 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Dark matter (DM) halos form hierarchically in the Universe through a series of merger events. Cosmological simulations can represent this series of mergers as a graph-like ``tree'' structure. Previous work has shown these merger trees are sensitive to cosmology simulation parameters, but as DM structures, the outstanding question of their sensitivity to DM models remains unanswered. In this work, we investigate the feasibility of deep learning methods trained on merger trees to infer Warm Dark Matter (WDM) particles masses from the DREAMS simulation suite. We organize the merger trees from 1,024 zoom-in simulations into graphs with nodes representing the merger history of galaxies and edges denoting hereditary links. We vary the complexity of the node features included in the graphs ranging from a single node feature up through an array of several galactic properties (e.g., halo mass, star formation rate, etc.). We train a Graph Neural Network (GNN) to predict the WDM mass using the graph representation of the merger tree as input. We find that the GNN can predict the mass of the WDM particle ($R^2$ from 0.07 to 0.95), with success depending on the graph complexity and node features. We extend the same methods to supernovae and active galactic nuclei feedback parameters $A_\\text{SN1}$, $A_\\text{SN2}$, and $A_\\text{AGN}$, successfully inferring the supernovae parameters. The GNN can even infer the WDM mass from merger tree histories without any node features, indicating that the structure of merger trees alone inherits information about the cosmological parameters of the simulations from which they form.",
      "pdf_url": "https://arxiv.org/pdf/2511.05367.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05424",
      "title": "Investigating the imprints of tidal features on simulated galaxy outskirts in LSST-like mock observations",
      "authors": [
        "Aman Khalid",
        "Sarah Brough",
        "Garreth Martin",
        "Lucas C. Kimmig",
        "Rhea-Silvia Remus",
        "Claudia del P. Lagos",
        "Louisa Canepa",
        "Alice Desmons"
      ],
      "abstract": "Investigating the imprints of tidal features on simulated galaxy outskirts in LSST-like mock observations Aman Khalid, Sarah Brough, Garreth Martin, Lucas C. Kimmig, Rhea-Silvia Remus, Claudia del P. Lagos, Louisa Canepa, Alice Desmons 27 pages, 22 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA) Tidal features provide signatures of recent galaxy mergers, offering insights into the role of mergers in galaxy evolution. The Vera C. Rubin Observatory's upcoming Legacy Survey of Space and Time (LSST) will allow for an unprecedented study of tidal features around millions of galaxies. We use mock images of galaxies at $z\\sim0$ ($z\\sim0.2$ for \\textsc{NewHorizon}) from \\textsc{NewHorizon}, \\textsc{eagle}, \\textsc{IllustrisTNG}, and \\textsc{Magneticum Pathfinder} simulations to predict the properties of tidal features in LSST-like images. We find that tidal features are more prevalent around blue galaxies with intrinsic colours $(g-i)\\leq0.5$, compared to redder ones, at fixed stellar mass. This trend correlates with elevated specific star formation rates ($\\mathrm{sSFR}>10^{-10}\\mathrm{\\:yr}^{-1}$), suggesting that merger-induced star formation contributes to the bluer colours. Tidal feature hosts in the red sequence appear to exhibit colour profiles offset to bluer colours for galaxies with stellar masses $10^{10}<M_{\\star\\mathrm{,\\:30\\:pkpc}}/\\mathrm{M}_\\odot<10^{11}$, similarly blue cloud tidal feature host galaxies appear to have their colour profiles offset to bluer colours for $10^{9.5}<M_{\\star\\mathrm{,\\:30\\:pkpc}}/\\mathrm{M}_\\odot<10^{10.5}$. However, the differences in colour profiles in either the red sequence or the blue cloud are not statistically robust and larger samples are needed to test if these differences are real. The predictions across the simulations are quantitatively distinct; therefore, LSST observations will allow us to further constrain the differences between different subgrid physics models.",
      "pdf_url": "https://arxiv.org/pdf/2511.05424.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.15091",
      "title": "Constraining the potential of the Milky Way using stellar streams and the Inverse Time Integration method",
      "authors": [
        "C. G. Palau",
        "W. Wang",
        "J. Han"
      ],
      "abstract": "Constraining the potential of the Milky Way using stellar streams and the Inverse Time Integration method C. G. Palau, W. Wang, J. Han Astrophysics of Galaxies (astro-ph.GA) We develop a method for constraining the potential of the Milky Way using stellar streams with a known progenitor. The method expresses the stream in angle-action coordinates and integrates the orbits of the stars backwards in time to obtain the stripping point positions of the stream stars relative to the cluster. In the potential that generated the stream, the stars return approximately to the cluster centre. In a different potential, they are redirected to different locations. The free parameters of the model are estimated by maximising the degree of clustering of the stripping point distribution. We test this method with the stellar stream of the globular cluster M68 (NGC 4590). We use an N-body code to simulate the stream and generate a realistic star sample using a model of the Gaia selection function. We also simulate the expected observational uncertainties, and estimate the heliocentric distances and radial velocities of the stream stars from the cluster orbit. Using this sample of stars, we recover the values of four free parameters characterising the potential of the disc and the dark halo to an accuracy of about 10 per cent of the correct values. We show that this accuracy is improved up to about 2 per cent using the expected end-of-mission Gaia data. In addition, we obtain a strong correlation between the mass of the disc and the dark halo axis ratio, which is explained by the fact that the stream flows close and parallel to the disc plane.",
      "pdf_url": "https://arxiv.org/pdf/2412.15091.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20684",
      "title": "A deep dive down the broad-line region: permitted OI, CaII and FeII emission in an AGN Little Red Dot at z=5.3",
      "authors": [
        "Roberta Tripodi",
        "Maruša Bradač",
        "Francesco D'Eugenio",
        "Nicholas Martis",
        "Gregor Rihtaršič",
        "Chris Willott",
        "Laura Pentericci",
        "Bianca Moreschini",
        "Maxim Markevitch",
        "Yoshihisa Asada",
        "Antonello Calabrò",
        "Guillaume Desprez",
        "Giordano Felicioni",
        "Gaia Gaspar",
        "Anthony H. Gonzalez",
        "Anishya Harshan",
        "Xihan Ji",
        "Jon Judež",
        "Brian C. Lemaux",
        "Alessandro Marconi",
        "Vladan Markov",
        "Rosa M. Merida",
        "Lorenzo Napolitano",
        "Gaël Noirot",
        "Massimiliano Parente",
        "Annika H. G. Peter",
        "Luke Robbins",
        "Andrew Robertson",
        "Ghassan T. E. Sarrouh",
        "Marcin Sawicki"
      ],
      "abstract": "A deep dive down the broad-line region: permitted OI, CaII and FeII emission in an AGN Little Red Dot at z=5.3 Roberta Tripodi, Maruša Bradač, Francesco D'Eugenio, Nicholas Martis, Gregor Rihtaršič, Chris Willott, Laura Pentericci, Bianca Moreschini, Maxim Markevitch, Yoshihisa Asada, Antonello Calabrò, Guillaume Desprez, Giordano Felicioni, Gaia Gaspar, Anthony H. Gonzalez, Anishya Harshan, Xihan Ji, Jon Judež, Brian C. Lemaux, Alessandro Marconi, Vladan Markov, Rosa M. Merida, Lorenzo Napolitano, Gaël Noirot, Massimiliano Parente, Annika H. G. Peter, Luke Robbins, Andrew Robertson, Ghassan T. E. Sarrouh, Marcin Sawicki 16 pages, 7 figures, 2 tables. Accepted for publication in ApJL Astrophysics of Galaxies (astro-ph.GA) We present a spectroscopic analysis of a broad-line active galactic nucleus (AGN) selected as little red dot at $z = 5.3$ behind the Bullet cluster (Bz5.3), based on JWST/NIRCam and NIRSpec data. The detection of strong FeII, OI, and CaII triplet emission lines, along with the evidence of broad Balmer lines, provides strong evidence of a broad-line region (BLR) and an accreting supermassive black hole. Notably, we report the first detection of the $\\lambda1304$ bump (i.e., blend of OI$\\lambda$1304 and SiII) at high redshift, a feature commonly seen in local AGNs but not yet reported in the early Universe. The OI$\\lambda$1304/$\\lambda8446$ photon ratio provides an independent measurement of dust attenuation in galaxies. In Bz5.3, this ratio is highly suppressed (0.1--0.3), implying significant internal dust extinction, with estimated dust attenuation $A_V \\sim 0.4$--$1.0$. We identify Ly$\\beta$ fluorescence as the dominant excitation mechanism of the low-ionization lines, with additional contributions from collisional excitation. High OI$\\lambda$8446 equivalent width and weak OI$\\lambda$7774 support this interpretation. The detection of iron emission, whether from broad permitted or narrow forbidden lines, supports the presence of a stratified BLR, as also recently proposed in local LRDs. Photoionization modeling of OI$\\lambda$8446 and CaII further suggests the coexistence of multiple gas phases with distinct densities and ionization states, highlighting the complexity of the BLR. Bz5.3 thus offers a rare window into early AGN activity and BLR physics at early times.",
      "pdf_url": "https://arxiv.org/pdf/2507.20684.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.21408",
      "title": "Modelling the M68 stellar stream with realistic mass loss and frequency distributions in angle-action coordinates",
      "authors": [
        "Carles G. Palau",
        "Wenting Wang",
        "Jiaxin Han"
      ],
      "abstract": "Modelling the M68 stellar stream with realistic mass loss and frequency distributions in angle-action coordinates Carles G. Palau, Wenting Wang, Jiaxin Han Astrophysics of Galaxies (astro-ph.GA) We develop a new method for simulating stellar streams generated by globular clusters using angle-action coordinates. This method reproduces the variable mass-loss and variable frequency of the stripped stars caused by the changing tidal forces acting on the cluster as it moves along an eccentric orbit. The model incorporates realistic distributions for the stripping angle and frequency of the stream stars both along and perpendicular to the stream. The stream is simulated by generating random samples of stripped stars and integrating them forward in time in angle-frequency space. Once the free parameters are calibrated, this method can be used to simulate the internal structure of stellar streams more quickly than N-body simulations, while achieving a similar level of accuracy. We use this model to study the surface density of the stellar stream produced by the globular cluster M68 (NGC 4590). We select $291$ stars from the Gaia-DR3 catalogue along the observable section that are likely to be members of the stream. We find that the width of the stream is too large to be explained by stars stripped from the cluster alone. We simulate the stream using the present method and include the Gaia selection function and observational errors, and the process of separating the stream stars from the foreground. By comparing these results with the observed data, we estimate the age of the stream, or equivalently the cluster accretion time, to be $3.04_{-0.29}^{+5.63}$ Gyr, and the mass-loss of the cluster to be $0.496 \\pm 0.030$ M$_{\\odot}$ Myr$^{-1}$ arm$^{-1}$.",
      "pdf_url": "https://arxiv.org/pdf/2508.21408.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.17459",
      "title": "Estimating Orbital Parameters of Direct Imaging Exoplanet Using Neural Network",
      "authors": [
        "Bo Liang",
        "Hanlin Song",
        "Chang Liu",
        "Tianyu Zhao",
        "Yuxiang Xu",
        "Zihao Xiao",
        "Manjia Liang",
        "Minghui Du",
        "Wei-Liang Qian",
        "Li-e Qiang",
        "Peng Xu",
        "Ziren Luo"
      ],
      "abstract": "Estimating Orbital Parameters of Direct Imaging Exoplanet Using Neural Network Bo Liang, Hanlin Song, Chang Liu, Tianyu Zhao, Yuxiang Xu, Zihao Xiao, Manjia Liang, Minghui Du, Wei-Liang Qian, Li-e Qiang, Peng Xu, Ziren Luo Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Machine Learning (cs.LG) In this work, we propose a new flow-matching Markov chain Monte Carlo (FM-MCMC) algorithm for estimating the orbital parameters of exoplanetary systems, especially for those only one exoplanet is involved. Compared to traditional methods that rely on random sampling within the Bayesian framework, our approach first leverages flow matching posterior estimation (FMPE) to efficiently constrain the prior range of physical parameters, and then employs MCMC to accurately infer the posterior distribution. For example, in the orbital parameter inference of beta Pictoris b, our model achieved a substantial speed-up while maintaining comparable accuracy-running 77.8 times faster than Parallel Tempered MCMC (PTMCMC) and 365.4 times faster than nested sampling. Moreover, our FM-MCMC method also attained the highest average log-likelihood among all approaches, demonstrating its superior sampling efficiency and accuracy. This highlights the scalability and efficiency of our approach, making it well-suited for processing the massive datasets expected from future exoplanet surveys. Beyond astrophysics, our methodology establishes a versatile paradigm for synergizing deep generative models with traditional sampling, which can be adopted to tackle complex inference problems in other fields, such as cosmology, biomedical imaging, and particle physics.",
      "pdf_url": "https://arxiv.org/pdf/2510.17459.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "cs.LG"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04759",
      "title": "HiSAXy: A fast methodology for solar wind structure identification in millions of time series",
      "authors": [
        "Hala Lamdouar",
        "Sairam Sundaresan",
        "Anna Jungbluth",
        "Sudeshna Boro Saikia",
        "Amanda Joy Camarata",
        "Nathan Miles",
        "Marcella Scoczynski",
        "Mavis Stone",
        "Andrés Muñoz-Jaramillo",
        "Ayris Narock",
        "Adam Szabo"
      ],
      "abstract": "HiSAXy: A fast methodology for solar wind structure identification in millions of time series Hala Lamdouar, Sairam Sundaresan, Anna Jungbluth, Sudeshna Boro Saikia, Amanda Joy Camarata, Nathan Miles, Marcella Scoczynski, Mavis Stone, Andrés Muñoz-Jaramillo, Ayris Narock, Adam Szabo Solar and Stellar Astrophysics (astro-ph.SR) We present a hybridized unsupervised clustering algorithm Hisaxy as a novel way to identify frequently occurring magnetic structures embedded in the interplanetary magnetic field (IMF) carried by the solar wind. The Hisaxy algorithm utilizes a combination of indexable Symbolic Aggregate approXimation (iSAX) and Hierarchical Density-Based Spatial Clustering of Applications with Noise (HDBSCAN) to efficiently identify clusters of patterns embedded in time series data. We utilized Hisaxy to identify small-scale structures, known as discontinuities, embedded in time series measurements of the IMF. In doing so, we demonstrate the capability of the algorithm to significantly reduce the amount of human analysis hours required to identify these structures, all the while maintaining a high degree of self similarity within a given cluster of time series data.",
      "pdf_url": "https://arxiv.org/pdf/2511.04759.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04764",
      "title": "Secondary small-scale dynamics of a Rayleigh-Taylor unstable solar prominence",
      "authors": [
        "Madhurjya Changmai",
        "Jack M. Jenkins",
        "Rony Keppens"
      ],
      "abstract": "Secondary small-scale dynamics of a Rayleigh-Taylor unstable solar prominence Madhurjya Changmai, Jack M. Jenkins, Rony Keppens 15 pages, 12 figures, Accepted for publication in Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR); Fluid Dynamics (physics.flu-dyn); Plasma Physics (physics.plasm-ph) Quiescent solar prominences show distinct small-scale dynamics in observations. Their internal density contrasts with the surrounding corona make them susceptible to Rayleigh-Taylor (RT) instabilities, leading to vertically structured prominence morphologies when observed at the solar limb. As a result, prominences develop bubbles and plumes, along with secondary Kelvin-Helmholtz (KH) roll-ups along their edges. Recent observations also suggest magnetic reconnection events within the RT-driven turbulent flows. We perform high-resolution 2.5D resistive magnetohydrodynamic simulations using the open-source MPI-AMRVAC code, reaching a spatial resolution of $\\sim 11.7$ km in a 2D domain of size 30 Mm$\\times$30 Mm and evolving the system for approximately 10 minutes of solar time. A dense, magnetic pressure supported prominence serves as the initial state, which becomes unstable at the prominence-corona interface. The resulting interaction between RT and KH instabilities leads to the formation of current sheets and localized reconnection events. The reconnection-driven outflows form energetic jets that enhance energy transport and dissipation across the prominence. We analyze our high-resolution prominence simulation using synthetic images of the broadband SDO/AIA 094, 171, and 193 Å and narrowband H$\\alpha$ filters, to compare the developing fine-scale structures with their observational counterparts. Most secondary instabilities emerge in the hotter coronal regions surrounding the cooler prominence core. While our simulated features match observed scales, speeds, and duration, the simulated activity remains concentrated in hot, surrounding coronal plasma rather then the cool prominence material, implying that key physical ingredients may be missing. Future 3D studies in more realistic magnetic configurations are required to address these limitations.",
      "pdf_url": "https://arxiv.org/pdf/2511.04764.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04787",
      "title": "Comprehensive Listing of 208 Nova White Dwarf Masses As the Primary Determinant of Spectral-Class and Light-Curve-Class",
      "authors": [
        "Bradley E. Schaefer"
      ],
      "abstract": "Comprehensive Listing of 208 Nova White Dwarf Masses As the Primary Determinant of Spectral-Class and Light-Curve-Class Bradley E. Schaefer (Louisiana State University) Published in Schaefer (2025, ApJ, 993, 232), 29 pages Solar and Stellar Astrophysics (astro-ph.SR) For Galactic novae, I calculate and collect a comprehensive catalog of 208 measures of white dwarf (WD) masses ($M_{\\rm WD}$) and 232 measures of average $V$ magnitudes in quiescence ($V_q$). These are collected into a comprehensive catalog of most fundamental properties of all 402 known Galactic novae. The nova light curve and spectral classes are determined primarily by $M_{\\rm WD}$. With an apparently clean cutoff, nova with light curve shapes in the S, P, O, and C classes have $>$0.95 $M_{\\odot}$, while the J, D, and F class novae have $<$0.95 $M_{\\odot}$. The speed class of the light curves is $t_3$=$10^{(-1.73M_{\\rm WD})}$$\\times$1900 days. The spectral class of novae is Fe II below 1.15 $M_{\\odot}$, is He/N above 1.15 $M_{\\odot}$, and the Hybrid novae are spread around this division. Neon novae have WD masses ranging from 0.53--1.37 $M_{\\odot}$, with 76\\% being measured to be below their minimum formation mass of 1.2 $M_{\\odot}$, demonstrating that most are losing mass over each eruption cycle. The FWHM velocity of the Balmer line profiles is close to 0.23 times the WD escape velocity, or roughly $10^{(M_{\\rm WD}/2)}$$\\times$500 km s$^{-1}$ for $<$1.3 $M_{\\odot}$. And all the known Galactic recurrent novae are $>$1.2 $M_{\\odot}$. For issues involving the late expansion of the ejecta, I find that the visibility of shells is strongly biased towards novae with orbital periods $<$0.33 days, and that the visibility of $\\gamma$-rays from the shells are strongly biased towards novae with fast declines, with $t_3$ a proxy for the $\\gamma$-ray luminosity.",
      "pdf_url": "https://arxiv.org/pdf/2511.04787.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04793",
      "title": "Comparative Analysis of 10 - 50 MeV Solar Proton Events at Lagrange Point 1 and the Geostationary Orbit",
      "authors": [
        "Aatiya Ali",
        "Viacheslav Sadykov"
      ],
      "abstract": "Comparative Analysis of 10 - 50 MeV Solar Proton Events at Lagrange Point 1 and the Geostationary Orbit Aatiya Ali, Viacheslav Sadykov Solar and Stellar Astrophysics (astro-ph.SR); Geophysics (physics.geo-ph) Solar proton events (SPEs) pose radiation hazards, disrupt technology, and impact operations on Earth and in space, making continuous monitoring essential. We compare 10-50 MeV proton flux measurements from SOHO/EPHIN at Lagrange Point 1 (L1) with those from NOAA/GOES in geostationary orbit (GEO) during Solar Cycle 23 and most of Cycle 24. We identify 83 >=10 pfu SPEs observed at both locations and classify them into S1-S4 categories (comparable to NOAA's solar radiation storm scales). EPHIN detected earlier onsets and longer durations across all categories, along with earlier peaks and ends for S1-S3, while GOES recorded slightly earlier peak and end times for S4. S1 median timing offsets (EPHIN relative to GOES) were -20 +/- 50 min (onsets), -1.00 +/- 1.42 hr (peaks), and -1.08 +/- 2.21 hr (ends), with similar trends for S2-S3 and near-simultaneity for S4 (peaks ~ -0.17 +/- 1.62 hr; ends ~ +0.04 +/- 3.33 hr). Flux comparisons show that EPHIN measurements modestly exceed GOES for S1 (median ratios ~1.11 for peaks and ~1.06 for fluence) and are lower than GOES for stronger events (peaks ~0.97 +/- 0.29, 0.84 +/- 0.21; fluence ~0.84 +/- 0.16, 0.75 +/- 0.16 for S2-S3). The EPHIN-to-GOES peak flux and fluence ratios reach 0.16 +/- 0.03 and 0.29 +/- 0.07, respectively, for S4 events, originating from contamination of lower-energy GOES channels. Correlation analyses show no significant flux dependence on geomagnetic indices, field strength, or spacecraft position, suggesting minimal near-Earth modulation of >=10 MeV proton access at GEO. These results highlight systematic differences in how SPEs manifest at L1 versus GEO and offer practical guidance for forecasting beyond Earth's magnetosphere, supporting mission planning for near-Earth and cislunar exploration, including Artemis.",
      "pdf_url": "https://arxiv.org/pdf/2511.04793.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04821",
      "title": "Using ML-based Regression Techniques to Mitigate GOES Energetic Proton Flux Data Contamination and Magnetospheric Effects",
      "authors": [
        "Aatiya Ali",
        "Viacheslav Sadykov"
      ],
      "abstract": "Using ML-based Regression Techniques to Mitigate GOES Energetic Proton Flux Data Contamination and Magnetospheric Effects Aatiya Ali, Viacheslav Sadykov Solar and Stellar Astrophysics (astro-ph.SR) Positioned at geostationary orbit (GEO) ~36,000 km above Earth, NOAA's GOES series has recorded real-time energetic proton flux measurements crucial for space weather monitoring for over three decades. Although machine learning models have advanced solar energetic particle (SEP) event prediction using GOES data, the sudden yet sparse nature of SEP events necessitates high-quality proton flux measurements. Previous studies have identified contamination issues in GOES data, when the presence of higher-energy protons can cause parasitic signals in lower-energy GOES channels and lead to artificially elevated fluxes in lower energy ranges (e.g., 10 - 50 MeV). As of now, no universal correction method has been implemented for the publicly available NOAA data. In addition, the effects of Earth's magnetosphere on the 10 - 50 MeV particles are not fully understood yet. This study assesses a reconstruction method using concurrent solar proton event (SPE) measurements from SOHO-EPHIN, which align well with GOES measurements of SPEs across solar cycles 23 and the bulk of cycle 24, but represent the off-magnetospheric environment of the Lagrange 1 point. We train regression models on GOES proton fluxes across multiple energy bins, employing EPHIN fluxes as prediction targets. We expect that similar approaches can allow us to derive non-contaminated flux proxies that preserve valuable data and more accurately capture the characteristics of SPEs, providing a more stable dataset for analyzing SEP behavior and potentially improving SEP event prediction models.",
      "pdf_url": "https://arxiv.org/pdf/2511.04821.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04832",
      "title": "Empirical measures of the largest amounts of magnetically-induced radius inflation in low-mass stars",
      "authors": [
        "D. J. Mullan",
        "J. MacDonald"
      ],
      "abstract": "Empirical measures of the largest amounts of magnetically-induced radius inflation in low-mass stars D. J. Mullan, J. MacDonald Solar and Stellar Astrophysics (astro-ph.SR) Access to precise empirical estimates of stellar radii in recent decades has revealed that the radii of certain low-mass stars are inflated relative to stellar structure predictions. The largest inflations are found in magnetically active stars. Although various attempts have been made to incorporate magnetic effects into stellar structure codes, a major source of uncertainty is associated with our lack of knowledge as to how the field strength varies inside the star. Here, we point out that a recent study of 44 eclipsing binaries in the Kepler field by Cruz et al. may enable us for the first time to set an upper limit Bc on the field strengths inside the 88 stars in the sample. According to our magneto-convective model, the largest empirical inflations reported by Cruz et al. can be replicated if Bc is about 10 kG inside stars with masses greater than 0.65 MSun. On the other hand, in lower mass stars, especially those with masses less than 0.4 MSun, our model predicts that the largest empirical inflations may require significantly stronger fields, i.e. Bc approximately 100-300 kG.",
      "pdf_url": "https://arxiv.org/pdf/2511.04832.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04850",
      "title": "The Dual Nature of Solar Wind Structuring: Resonant Standing Waves and Laval Nozzle Dynamics in Coronal Streamers",
      "authors": [
        "Olena Podladchikova"
      ],
      "abstract": "The Dual Nature of Solar Wind Structuring: Resonant Standing Waves and Laval Nozzle Dynamics in Coronal Streamers Olena Podladchikova 9 Pages, 4 figures, submitted to Astrophysical Journal, November 2025 Solar and Stellar Astrophysics (astro-ph.SR) Periodic Density Structures (PDS) observed in white-light coronagraphs represent a fundamental challenge to conventional solar wind paradigms. Through systematic analysis of multi-instrument observations and theoretical modeling, we demonstrate that coronal streamers operate as dual-nature systems: magnetohydrodynamic resonators that establish global periodicity through standing waves (122, 61, 41 minutes) and Laval nozzles that generate local flow structures through shock-driven oscillations (93, 47, 31, 23 minutes). The resonant mechanism dominates PDS formation, explaining their universal occurrence across 85\\% of streamers, coherence over 10+ cycles, and persistence to 1 AU with only 0.1\\% energy loss. Nozzle oscillations, while limited to 35\\% of overexpanded streamers and maintaining only 1-2 cycle coherence, play crucial secondary roles in vortex formation and provide the essential converging-diverging geometry for supersonic solar wind acceleration. This dual-mechanism framework resolves longstanding puzzles in solar wind structuring while revealing the hierarchical organization of standing-wave and flow processes in astrophysical plasmas.",
      "pdf_url": "https://arxiv.org/pdf/2511.04850.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04874",
      "title": "Calcium Excess in Novae: Beyond Nuclear Physics Uncertainties",
      "authors": [
        "Mallory Loria",
        "Pavel Denissenkov",
        "Chris Ruiz",
        "Falk Herwig"
      ],
      "abstract": "Calcium Excess in Novae: Beyond Nuclear Physics Uncertainties Mallory Loria, Pavel Denissenkov, Chris Ruiz, Falk Herwig Solar and Stellar Astrophysics (astro-ph.SR) We examine Ca abundances in classical novae from spectroscopic observations spanning 65 years and investigate whether they are systematically high compared to those predicted by nova models. For the first time, we perform Monte Carlo simulations assessing the impact of nuclear reaction rate uncertainties on abundances predicted by multi-zone nova models. While the Ca abundances in the models are sensitive to variations of rates of the reactions 37Ar(p,gamma)38K and 38K(p,gamma)39Ca, the nuclear physics uncertainties of these reactions cannot account for the discrepancy between the observed and predicted Ca abundances in novae. Furthermore, the overabundance of Ca has important implications for measuring 7Be in nova ejecta, as Ca lines are used to estimate 7Be abundances. If the Ca abundance is incorrectly determined, it could lead to inaccurate 7Be abundance estimates. Possible alternative explanations for the observed Ca overabundance are discussed.",
      "pdf_url": "https://arxiv.org/pdf/2511.04874.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04955",
      "title": "Investigation on the Predictive Potentiality of Photospheric Magnetic Parameters for Distinguishing Confined from Eruptive Solar Flares",
      "authors": [
        "Jinhui Pan",
        "Rui Liu"
      ],
      "abstract": "Investigation on the Predictive Potentiality of Photospheric Magnetic Parameters for Distinguishing Confined from Eruptive Solar Flares Jinhui Pan, Rui Liu Solar and Stellar Astrophysics (astro-ph.SR) A question often arises as to why some solar flares are confined in the lower corona while others, termed eruptive flares, are associated with coronal mass ejections (CMEs). Here we intend to rank the importance of pre-flare magnetic parameters of active regions in their potentiality to predict whether an imminent flare will be eruptive or confined. We compiled a dataset comprising 277 solar flares of GOES-class M1.0 and above, taking place within 45 deg from the disk center between 2010 and 2023, involving 94 active regions. Among the 277 flares, 135 are confined and 142 are eruptive. Our statistical analysis reveals that the magnetic parameters that are most relevant to the flare category are: total unsigned magnetic flux $\\Phi$, mean magnetic shear angle $\\Theta$ along the polarity inversion line (PIL), photospheric free magnetic energy $E_f$, and centroid distance $d$ between opposite polarities. These four parameters are not independent of each other, but in combination, might be promising in distinguishing confined from eruptive flares. For a subset of 77 flares with high-gradient PILs, the area of high free energy regions ($A_{\\mathrm{Hi}}$) becomes the most effective parameter related to the flare type, with confined flares possessing larger $A_{\\mathrm{Hi}}$ than eruptive ones. Our results corroborate the general concept that the eruptive behavior of solar flares is regulated by an interplay between the constraining overlying flux, which is often dominant in both $\\Phi$ and $E_f$ and related to $d$, and the current-carrying core flux, which is related to $\\Theta$.",
      "pdf_url": "https://arxiv.org/pdf/2511.04955.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05174",
      "title": "High-spectral Resolution, Multi-wavelength Center-to-limb Observations of the Sun",
      "authors": [
        "Meetu Verma",
        "Carsten Denker",
        "Alexander G. M. Pietrow",
        "Robert Kamlah",
        "Dominique J. M. Petit dit de la Roche"
      ],
      "abstract": "High-spectral Resolution, Multi-wavelength Center-to-limb Observations of the Sun Meetu Verma, Carsten Denker, Alexander G. M. Pietrow, Robert Kamlah, Dominique J. M. Petit dit de la Roche Published in Research Notes of the AAS (RNAAS) Meetu Verma et al 2025 Res. Notes AAS 9 294 Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) The center-to-limb variations (CLVs) of photospheric and chromospheric spectral lines were obtained in 2025 July and August using drift scans from the echelle spectrograph of the 0.7 m Vacuum Tower Telescope at the Observatorio del Teide (ODT) in Tenerife, Spain. This instrument can observe four spectral regions simultaneously, enabling multi-line spectroscopy with high spectral resolution of various activity features and the quiet Sun in the lower solar atmosphere. The initial results of Halpha observations demonstrate the diagnostic potential of drift scans obtained with a ground-based, high-resolution telescope. Data products include spectroheliograms and maps of physical parameters such as line-of-sight velocity, line width, and line-core intensity. The combination of the CLV from photospheric and chromospheric lines, as well as the wide range of formation heights of the selected lines, renders this dataset ideal for characterizing stellar and exoplanet atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2511.05174.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05175",
      "title": "On the possibility of using decayless kink oscillations of coronal loops to forecast powerful solar flares and coronal mass ejections",
      "authors": [
        "A.B. Nechaeva",
        "I.V. Zimovets",
        "I.N. Sharykin",
        "S.A. Anfinogentov"
      ],
      "abstract": "On the possibility of using decayless kink oscillations of coronal loops to forecast powerful solar flares and coronal mass ejections A.B. Nechaeva, I.V. Zimovets, I.N. Sharykin, S.A. Anfinogentov 25 pages, 5 figures, 2 tables. Accepted in \"Geomagnetism and Aeronomy\" Solar and Stellar Astrophysics (astro-ph.SR) This work investigates the decayless kink oscillations of solar coronal loops and examines possible changes in their behaviour in active regions (ARs) before powerful solar flares (M- and X-class) and in the absence of powerful flares. To this end, we analysed 14 ARs with powerful flares and 14 ARs without powerful flares. For each event, images obtained in the 171 Åand 94 ÅAIA/SDO channels with 12-second cadence for 4 hours before the flare were retrieved and analysed. For ARs without powerful flares, arbitrary time intervals of similar duration were considered for comparison. Since the decayless oscillations have a very low amplitude (1-2 AIA/SDO pixels), we used the Motion Magnification technique to amplify the amplitude of these oscillations. Time-distance maps were constructed from the processed images in the 171 Åchannel, from which oscillatory patterns were extracted 'manually'. Wavelet analysis was performed to check for changes in the oscillation period. No systematic changes were found. No obvious differences in the behaviour of oscillations in ARs with and without powerful flares were detected either. Additional information was obtained on coronal mass ejections (CMEs) from ARs in the vicinity of the time intervals under consideration. Based on the results of the analysis of a small sample of events, we came to the preliminary conclusion that the registration and analysis of decayless kink oscillations of high (~ 100-600 Mm) coronal loops based on this methodology is not promising for predicting powerful flares and CMEs.",
      "pdf_url": "https://arxiv.org/pdf/2511.05175.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05181",
      "title": "Co-existence of Internal Gravity Waves and Tayler-Spruit Magnetic Fields in the Radiative Core of Low-mass Stars",
      "authors": [
        "L. Amard",
        "S. Mathis"
      ],
      "abstract": "Co-existence of Internal Gravity Waves and Tayler-Spruit Magnetic Fields in the Radiative Core of Low-mass Stars L. Amard, S. Mathis 11 pages, 6 figures, Re-Submitted to A&A (version after 1st review by the referee) Solar and Stellar Astrophysics (astro-ph.SR) The Tayler-Spruit dynamo (TSD) is able to generate a small-scale magnetic field in the differentially rotating stably stratified layers of stars and was recently observed in numerical simulations. In parallel, the propagation of internal gravity waves in stars can be modified in the presence of a magnetic field. Here we first want to estimate the interaction between a magnetic field generated by the TSD and internal gravity waves in the radiative core of low-mass stars. This allows us to then characterise the effect of this interplay on the observed standing modes spectrum and on the internal transport of angular momentum by progressive waves. To do this, we use the STAREVOL evolution code to compute the structure of low-mass rotating stars along their evolution. In particular, we implement a formalism to describe the TSD and estimate the regions where the generated magnetic field is strong enough to change the identity of internal gravity waves to magneto-gravity waves. In addition, we evaluate the possible limitation of angular momentum transport by the combined action of rotation and magnetism. We show that along the pre-main sequence and main-sequence evolution, the lowest frequencies of the excited gravity wave spectrum could be converted to magneto-gravity waves by the magnetic field generated by the TSD. During the red-giant branch we find that most of the excited spectrum of progressive internal gravity waves could be converted into magneto-gravity waves in the very central region.",
      "pdf_url": "https://arxiv.org/pdf/2511.05181.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05248",
      "title": "Multiplicity of stellar systems in the solar neighbourhood, wide binaries, and planet-hosting stars",
      "authors": [
        "Javier González-Payo"
      ],
      "abstract": "Multiplicity of stellar systems in the solar neighbourhood, wide binaries, and planet-hosting stars Javier González-Payo PhD thesis at Universidad Complutense de Madrid. 360 pages. Chapters have been published independently in A&A and MNRAS journals Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) This doctoral thesis studies stellar multiplicity in the solar neighborhood (d < 10 pc) and in systems hosting planets (d < 100 pc). Using data from the Washington Double Star Catalogue, Gaia DR3, and a comprehensive literature review, it builds the most complete and homogeneous sample of multiple systems within 10 pc. Multiplicity and companion fractions are derived with reduced uncertainties, providing improved statistical reliability. The analysis of orbital periods from one day to millions of years shows that the log-normal cumulative distribution can be seen as a modern revision of Öpik's law. A key contribution is the study of wide binaries ({\\rho} > 1000 arcsec) with Gaia DR3, expanding the known sample by over an order of magnitude and improving astrometric precision. Newly identified companions, including ultracool dwarfs at the M-L boundary and a hot white dwarf, refine the distinction between true binaries and unrelated young moving-group members. The thesis also explores the effect of multiplicity on exoplanetary systems within 100 pc. New stellar companions are found in known planetary systems, with separations for over 200 pairs and parameters compiled for 276 exoplanets. Compared to single-star systems, multiple systems host more massive, short-period, and high-eccentricity planets. About 22% of exoplanetary systems have stellar companions, with significant (> 4 {\\sigma}) correlations between high eccentricities and small projected separations, and a weaker (> 2 {\\sigma}) trend showing that massive planets (M > 40 M_Earth) orbit closer in multiple systems. Finally, a review of Giovanni Battista Hodierna's 17th-century catalogues shows he compiled the first list of multiple systems over a century earlier than previously believed, advancing the understanding of stellar multiplicity and its influence on planetary formation.",
      "pdf_url": "https://arxiv.org/pdf/2511.05248.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05314",
      "title": "Near-degeneracy effects in Quadrupolar Mixed Modes. From an Asymptotic Description to Data Fitting",
      "authors": [
        "B. Liagre",
        "A. Desai",
        "L. Einramhof",
        "L. Bugnet"
      ],
      "abstract": "Near-degeneracy effects in Quadrupolar Mixed Modes. From an Asymptotic Description to Data Fitting B. Liagre, A. Desai, L. Einramhof, L. Bugnet submitted to A&A, 19 pages, 10 figures Solar and Stellar Astrophysics (astro-ph.SR) Dipolar (l=1) mixed modes revealed surprisingly weak differential rotation between the core and the envelope of evolved solar-like stars. Quadrupolar (l=2) mixed modes also contain information on the internal dynamics, but are very rarely characterised due to their low amplitude and the challenging identification of adjacent or overlapping rotationally split multiplets affected by near-degeneracy effects. We aim to extend broadly used asymptotic seismic diagnostics beyond l=1 mixed modes by developing an analogue asymptotic description of l=2 mixed modes, explicitly accounting for near-degeneracy effects that distort their rotational multiplets. We derive a new asymptotic formulation of near-degenerate mixed l=2 modes that describes off-diagonal terms representing the interaction between modes of adjacent radial orders. We implement the formalism within a global Bayesian mode-fitting framework, for a direct fit of all l=0,1,2 modes in the power spectrum density. We are able to asymptotically model the asymmetric rotational splitting present in various radial orders of l=2 modes observed in young red giant stars without the need for any numerical stellar modelling. Applied to the Kepler target KIC 7341231, our formalism yields core and envelope rotation rates consistent with previous numerical modelling, while providing improved constraints from the global and model-independent approach. We also characterise the new target KIC 8179973, measuring its rotation rate and mixed-mode parameters for the first time. The global fit allows for much better precision than standard methods, yielding better constraints for rotation inversions. We place the first observational constraints on the asymptotic l=2 mixed mode parameters (DPi_2,q_2,eps_g2), paving the way towards the use of asymptotic seismology beyond l=1 mixed modes.",
      "pdf_url": "https://arxiv.org/pdf/2511.05314.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05378",
      "title": "A scaling relationship for non-thermal radio emission from ordered magnetospheres - II. Investigating the efficiency of relativistic electron production in magnetospheres of BA-type stars",
      "authors": [
        "P. Leto",
        "S. Owocki",
        "C. Trigilio",
        "F. Cavallaro",
        "B. Das",
        "M.E. Shultz",
        "C.S. Buemi",
        "G. Umana",
        "L. Fossati",
        "R. Ignace",
        "J. Krticka",
        "L.M. Oskinova",
        "I. Pillitteri",
        "C. Bordiu",
        "F. Bufano",
        "L. Cerrigone",
        "A. Ingallinera",
        "S. Loru",
        "S. Riggi",
        "A.C. Ruggeri",
        "A. ud-Doula",
        "F. Leone"
      ],
      "abstract": "A scaling relationship for non-thermal radio emission from ordered magnetospheres - II. Investigating the efficiency of relativistic electron production in magnetospheres of BA-type stars P. Leto, S. Owocki, C. Trigilio, F. Cavallaro, B. Das, M.E. Shultz, C.S. Buemi, G. Umana, L. Fossati, R. Ignace, J. Krticka, L.M. Oskinova, I. Pillitteri, C. Bordiu, F. Bufano, L. Cerrigone, A. Ingallinera, S. Loru, S. Riggi, A.C. Ruggeri, A. ud-Doula, F. Leone Under review for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) Magnetic BA stars host dipole-like magnetospheres. When detected as radio sources, their luminosities correlate with the magnetic field and rotation. Rotation is crucial because the mechanism undergirding the relativistic electron production is powered by centrifugal breakouts. CBOs occur wherever magnetic tension does not balance centrifugal force; the resulting magnetic reconnection provides particle acceleration. To investigate how physical conditions at the site of the CBOs affect the efficiency of the acceleration mechanism, we broadly explore the parameter space governing radio emission by increasing the sample of radio-loud magnetic stars. High-sensitivity VLA observations of 32 stars were performed in the hope of identifying new centrifugal magnetospheres and associated CBOs. We calculated gyro-synchrotron spectra using 3D modeling of a dipole-shaped magnetosphere. We evaluated combinations of parameters. The number of relativistic electrons was constrained by the need to produce the emission level predicted by the scaling relationship for the radio emission from magnetic BA stars. About half of the observed stars were detected, with luminosities in agreement with the expected values, reinforcing the robust nature of the scaling relationship for CBO-powered radio emission. Comparing the competing centrifugal and magnetic effects on plasma locked in a rigidly rotating magnetosphere, we located the site of CBOs and inferred the local plasma density. We then estimated the efficiency of the acceleration mechanism needed to produce enough non-thermal electrons to support the radio emission level. Given a constant acceleration efficiency, relativistic electrons represent a fixed fraction of the local thermal plasma. Thus, dense magnetospheres host more energetic particles than less dense ones; consequently, with other parameters similar, they are intrinsically brighter radio sources.",
      "pdf_url": "https://arxiv.org/pdf/2511.05378.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05380",
      "title": "Modeling Solar Atmosphere Dynamics with MAGEC",
      "authors": [
        "Anamaría Navarro",
        "E. Khomenko",
        "N. Vitas",
        "T. Felipe"
      ],
      "abstract": "Modeling Solar Atmosphere Dynamics with MAGEC Anamaría Navarro, E. Khomenko, N. Vitas, T. Felipe Solar and Stellar Astrophysics (astro-ph.SR) Modeling the solar atmosphere is challenging due to its layered structure and multi-scale dynamics. We aim to validate the new radiative MHD code MAGEC, which combines the MANCHA and MAGNUS codes into a finite-volume, shock-capturing framework, and to test its performance through 2D simulations of magneto-convection. MAGEC is MPI-parallelized and includes improvements for coronal modeling, such as LTE radiative losses and a hyperbolic treatment of thermal conduction that mitigates restrictive time steps. We also estimated its numerical viscosity and resistivity. To assess robustness, we performed 2D simulations covering a domain from 2 Mm below the surface to 18.16 Mm into the corona, using both open and closed magnetic-field configurations. For each case, we analyzed steady-state temperature profiles and the contributions to the internal-energy balance at different heights. A separate experiment examined the role of perpendicular thermal conduction. MAGEC reproduced the expected temperature stratification set by boundary conditions and magnetic geometry, and all simulations reached thermal equilibrium. Open-field cases produced higher coronal temperatures than closed, arcade-like fields. Analysis of the explicit and implicit energy terms clarified their relative effects on heating and cooling. Perpendicular thermal conduction, often neglected in coronal models, was found to influence plasma dynamics near reconnection; although local effects are small, they can cumulatively modify the average coronal temperature. These results show that MAGEC is a reliable and efficient tool for radiative MHD simulations, well suited to capturing the shocks and dynamic processes of the solar atmosphere.",
      "pdf_url": "https://arxiv.org/pdf/2511.05380.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05415",
      "title": "Recovering Ion Distribution Functions: II. Gyrotropic Slepian Reconstruction of Solar Wind Electrostatic Analyzer Measurements",
      "authors": [
        "Srijan Bharati Das",
        "Michael Terres"
      ],
      "abstract": "Recovering Ion Distribution Functions: II. Gyrotropic Slepian Reconstruction of Solar Wind Electrostatic Analyzer Measurements Srijan Bharati Das, Michael Terres 22 pages, 10 figures, Accepted for publication in ApJ. Publicly available package (gdf) with documentation provided with the paper. Interested parties are encouraged to get in touch with authors with feedback or request to contribute to package Solar and Stellar Astrophysics (astro-ph.SR) Velocity distribution functions (VDF) are an essential observable for studying kinetic and wave-particle processes in solar wind plasmas. To experimentally distinguish modes of heating, acceleration, and turbulence in the solar wind, precise representations of particle phase space VDFs are needed. In the first paper of this series, we developed the Slepian Basis Reconstruction (SBR) method to approximate fully agyrotropic continuous distributions from discrete measurements of electrostatic analyzers (ESAs). The method enables accurate determination of plasma moments, preserves kinetic features, and prescribes smooth gradients in phase space. In this paper, we extend the SBR method by imposing gyrotropic symmetry (g-SBR). Incorporating this symmetry enables high-fidelity reconstruction of VDFs that are partially measured, as from an ESA with a limited field-of-view (FOV). We introduce three frameworks for g-SBR, the gyrotropic Slepian Basis Reconstruction: (A) 1D angular Slepian functions on a polar-cap, (B) 2D Slepian functions in a Cartesian plane, and (C) a hybrid method. We employ model distributions representing multiple anisotropic ion populations in the solar wind to benchmark these methods, and we show that the g-SBR method produces a reconstruction that preserves kinetic structures and plasma moments, even with a strongly limited FOV. For our choice of model distribution, g-SBR can recover $\\geq90\\%$ of the density when only $20\\%$ is measured. We provide the package \\texttt{gdf} for open-source use and contribution by the heliophysics community. This work establishes direct pathways to bridge particle observations with kinetic theory and simulations, facilitating the investigation of gyrotropic plasma heating phenomena across the heliosphere.",
      "pdf_url": "https://arxiv.org/pdf/2511.05415.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05427",
      "title": "Upper Limits on Radio Emission from the K2-18 System",
      "authors": [
        "Kelvin Wandia",
        "Chenoa Tremblay",
        "Michael A. Garrett",
        "Alex Andersson",
        "Megan G. Li",
        "Vishal Gajjar",
        "Robert J. Beswick",
        "Jack F. Radcliffe",
        "David R. DeBoer",
        "P.B. Demorest",
        "Daniel Czech",
        "Wael Farah",
        "Ian Heywood",
        "Andrew Siemion"
      ],
      "abstract": "Upper Limits on Radio Emission from the K2-18 System Kelvin Wandia, Chenoa Tremblay, Michael A. Garrett, Alex Andersson, Megan G. Li, Vishal Gajjar, Robert J. Beswick, Jack F. Radcliffe, David R. DeBoer, P.B. Demorest, Daniel Czech, Wael Farah, Ian Heywood, Andrew Siemion Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP) Stellar and planetary magnetic fields play a crucial role in the habitability of a planet and the integrity of its atmosphere. The recently claimed detection of biosignatures, methane, carbon dioxide and dimethyl sulfide/disulfide, in the atmosphere of K2-18 b, a sub-Neptune orbiting an M dwarf star present an intriguing question regarding the stellar magnetic environment and the resistance of the planet's magnetosphere (if it exists) to erosion by magnetic activity from the host. To probe for radio emission from the system, we have conducted observations using the Karl G. Jansky Very Large Array (VLA) at S, C and X-bands (2-4, 4.5-7.5 and 8-10 GHz respectively) to search for coherent and incoherent radio emission. We detect no radio emission associated with incoherent emission mechanisms. We report $3\\sigma$ Stokes I upper limits of $49.8\\ \\mu\\rm{Jybeam}^{-1}$ at S-band, $17.7\\ \\mu\\rm{Jybeam}^{-1}$at C-band and $18.0\\ \\mu\\rm{Jybeam}^{-1}$ at X-band and an upper limit of the ratio of the radio to the total bolometric luminosity of $\\log L_\\text{R}/\\log L_\\text{bol}<-8.8$. We have also searched for short duration bursts associated with coherent emission mechanisms at C and X-bands . No signals above a $3\\sigma$ significance threshold are detected. Although no signals are detected our radio observations offer constraints, albeit limited, on the stellar magnetic environment supporting recent X-ray observations indicating K2-18 is a very faint emitter. Our results also contextualise any planetary transmission spectra by providing constraints on the activity level of the host.",
      "pdf_url": "https://arxiv.org/pdf/2511.05427.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.17146",
      "title": "Role of sunspot latitude versus tilt in determining the polar field and amplitude of the next cycle: Cause of the weak Solar Cycle 20",
      "authors": [
        "Bidisha Dey",
        "Anu Sreedevi",
        "Bidya Binay Karak"
      ],
      "abstract": "Role of sunspot latitude versus tilt in determining the polar field and amplitude of the next cycle: Cause of the weak Solar Cycle 20 Bidisha Dey, Anu Sreedevi, Bidya Binay Karak Accepted for publication in ApJ. Comments are welcome Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM) One prominent feature of solar cycle is its irregular variation in its cycle strength, making it challenging to predict the amplitude of the next cycle. Studies show that fluctuations and nonlinearity in generating poloidal field throughout the decay and dispersal of tilted sunspots produce variation in the solar cycle. The flux, latitudinal position, and tilt angle of sunspots are the primary parameters that determine the polar field and, thus, the next solar cycle strength. By analysing the observed sunspots and polar field proxy, we show that the nonlinearity in the poloidal field generation becomes important for strong cycles. Except for strong cycles, we can reasonably predict the polar field at the end of the cycle (and thus the next cycle strength) using the total sunspot area alone. Combining the mean tilt angle and latitude positions with the sunspot area, we can predict the polar field of Cycles 15 -- 24 (or the amplitude of sunspot Cycles 16-25) with reasonable accuracy except for Cycle 23 for which the average tilt angle cannot predict the polar field. For Cycles 15--22, we show that the average tilt angle variation dominates over the latitude variation in determining the polar field of a cycle. In particular, the reduction of tilt in Cycle 19 was the primary cause of the following weak cycle (Cycle 20). Thus, we conclude that tilt quenching is essential in regulating the solar cycle strength in the solar dynamo.",
      "pdf_url": "https://arxiv.org/pdf/2509.17146.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.00320",
      "title": "Solar limb faculae: intensity contrast from two vantage points",
      "authors": [
        "K. Albert",
        "J. Hirzberger",
        "N. A. Krivova",
        "X. Li",
        "D. Calchetti",
        "G. Valori",
        "J. Sinjan",
        "S. K. Solanki",
        "A. Gandorfer",
        "J. Woch",
        "D. Orozco Suárez",
        "S. Parenti"
      ],
      "abstract": "Solar limb faculae: intensity contrast from two vantage points K. Albert, J. Hirzberger, N. A. Krivova, X. Li, D. Calchetti, G. Valori, J. Sinjan, S. K. Solanki, A. Gandorfer, J. Woch, D. Orozco Suárez, S. Parenti Accepted to Astronomy and Astrophysics Solar and Stellar Astrophysics (astro-ph.SR) Small-scale magnetic flux concentrations contribute significantly to the brightness variations of the Sun, yet observing them - particularly their magnetic field - near the solar limb remains challenging. Solar Orbiter offers an unprecedented second vantage point for observing the Sun. When combined with observations from the perspective of Earth, this enables simultaneous dual-viewpoint measurements of these magnetic structures, thereby helping to mitigate observational limitations. Using such a dual-viewpoint geometry, we characterise the brightness contrast of faculae near the limb as a function of both their associated magnetic field strength and the observation angle. We analyse data from Polarimetric and Helioseismic Imager on board Solar Orbiter (SO/PHI), obtained during an observation program conducted in near-quadrature configuration with Earth, in combination with data from the Helioseismic and Magnetic Imager on the Solar Dynamics Observatory (SDO/HMI). The High Resolution Telescope of SO/PHI observed a facular region located near disc centre as seen from its vantage point, while the same region was simultaneously observed near the solar limb by SDO/HMI. We identify faculae and determine their magnetic field strength from the disc-centre observations, and combine these with continuum intensity measurements at the limb to derive dual-viewpoint contrast curves. We then compare these with contrast curves derived from SDO/HMI alone. Using two viewpoints, we consistently find higher facular contrast near the limb than from a single-viewpoint.",
      "pdf_url": "https://arxiv.org/pdf/2510.00320.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.10340",
      "title": "Picoflares in the Quiet Solar Corona: Solar Orbiter Observations Halfway to the Sun",
      "authors": [
        "O. Podladchikova",
        "A. Warmuth",
        "L. Harra",
        "L. Dolla",
        "C. Verbeeck",
        "M. Mierla",
        "L. Rodriguez",
        "S. Parenti",
        "M. K. Georgoulis",
        "S. J. Hofmeister",
        "N. Engler",
        "M. J. West",
        "R. Aznar Cuadrado",
        "A. M. Veronig",
        "P. Antolin",
        "S. Purkhart",
        "D. M. Long",
        "E. Buchlin",
        "M. Haberreiter",
        "M. Velli",
        "A. N. Zhukov",
        "H. Safari",
        "U. Schuhle",
        "L. Teriaca",
        "A. F. Battaglia",
        "E. Soubrie",
        "V. Buchel",
        "L. P. Chitta",
        "S. Gissot",
        "A. De Groof",
        "M. Gyo",
        "J. P. Halain",
        "B. Inhester",
        "E. Kraaikamp",
        "D. Mueller",
        "D. Pfiffner",
        "P. Rochus",
        "F. Schuller",
        "P. J. Smith",
        "W. Schmutz",
        "K. Stegen"
      ],
      "abstract": "Picoflares in the Quiet Solar Corona: Solar Orbiter Observations Halfway to the Sun O. Podladchikova, A. Warmuth, L. Harra, L. Dolla, C. Verbeeck, M. Mierla, L. Rodriguez, S. Parenti, M. K. Georgoulis, S. J. Hofmeister, N. Engler, M. J. West, R. Aznar Cuadrado, A. M. Veronig, P. Antolin, S. Purkhart, D. M. Long, E. Buchlin, M. Haberreiter, M. Velli, A. N. Zhukov, H. Safari, U. Schuhle, L. Teriaca, A. F. Battaglia, E. Soubrie, V. Buchel, L. P. Chitta, S. Gissot, A. De Groof, M. Gyo, J. P. Halain, B. Inhester, E. Kraaikamp, D. Mueller, D. Pfiffner, P. Rochus, F. Schuller, P. J. Smith, W. Schmutz, K. Stegen 13 pages, 7 figures, submitted to Astronomy & Astrophysics (A&A) Solar and Stellar Astrophysics (astro-ph.SR) X-ray observations of the Sun led Eugene Parker to propose nanoflares as the basic energy-release units that heat the solar corona. Decades later, Solar Orbiter's Extreme Ultraviolet Imager (HRIEUV), operating halfway between Earth and the Sun, revealed thousands of even smaller brightenings in the quiet corona - tiny \"campfires\" that are smaller and far more frequent than the fundamental nanoflares observed from 1 AU. We analyze over 12,000 of these events, deriving their thermal energies using multiple geometric models to account for volume uncertainties. Although absolute values vary, all models yield consistent power-law energy distributions and ranges, confirming their flare-like behavior. These picoflares, spanning $10^{20}$--$10^{24}$ erg, were detected by the Solar Orbiter EUI Imager while the spacecraft was at 0.56 AU from the Sun. They occur up to sixty times more often than nanoflares seen from Earth orbit and supply about 1\\% of the quiet-Sun coronal heating power. This previously unseen energy source may be a missing component in the solar energy balance. Their discovery extends the flare energy spectrum to smaller scales, and future Solar Orbiter observations at 0.28 AU may reveal the most fundamental flare events that sustain the million-degree solar corona.",
      "pdf_url": "https://arxiv.org/pdf/2510.10340.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.22822",
      "title": "The Missing Mechanism: Picoflare Heating in the Solar Corona",
      "authors": [
        "Olena Podladchikova"
      ],
      "abstract": "The Missing Mechanism: Picoflare Heating in the Solar Corona Olena Podladchikova 4 pages, 3 figures, submitted to Astronomy and Astrophysics Letters Solar and Stellar Astrophysics (astro-ph.SR) The coronal heating problem has been explored through wave heating and impulsive nanoflare paradigms. Solar Orbiter observations reveal picoflares (10^20-10^24 erg) extending below the Parker-Aschwanden minimal coronal nanoflare limit. These events involve two distinct mechanisms: short-duration looptop tearing-mode reconnection and long-duration footpoint anomalous resistivity. This dual-mechanism framework resolves the long-standing energy partition paradox and bridges photospheric energy injection with coronal thermalization.",
      "pdf_url": "https://arxiv.org/pdf/2510.22822.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.27149",
      "title": "The Physical Origin of Periodic Density Structures in the Solar Wind: Coronal Streamers as Magnetohydrodynamic Resonators",
      "authors": [
        "Olena Podladchikova"
      ],
      "abstract": "The Physical Origin of Periodic Density Structures in the Solar Wind: Coronal Streamers as Magnetohydrodynamic Resonators Olena Podladchikova 13 pages, 4 figures, submitted to Astrophysical Journal, November 2025 Solar and Stellar Astrophysics (astro-ph.SR) We present a comprehensive physical model explaining the origin of Periodic Density Structures (PDS) observed in white-light coronagraphs with characteristic periods of approximately 45, 80, and 120 minutes. Through systematic investigation of potential resonant cavities in the solar atmosphere, we demonstrate that traditional large-scale cavities yield fundamentally incompatible periods: photosphere-transition region (3.3 minutes), transition region-sonic point (10.3 hours), and transition region-heliopause (7.7 years). We establish that coronal streamers act as natural magnetohydrodynamic resonators, with calculated harmonic periods of 122, 61, and 41 minutes that precisely match observations. The physical mechanism involves slow magnetoacoustic standing waves that create periodic density enhancements through wave compression, with the streamer resonator having quality factor Q ~ 10-100, enabling natural amplification of broadband coronal noise. At streamer cusps, these density enhancements trigger magnetic reconnection, releasing plasma blobs into the solar wind at resonant periods. The model provides complete energy budget calculations, wave amplitude estimates, and explains all key observational features including spatial localization, period coherence, and the relationship between remote sensing and in situ measurements. This work establishes streamer resonators as fundamental structures shaping solar wind variability and provides a new framework for understanding the emergence of coherent structures in turbulent astrophysical plasmas.",
      "pdf_url": "https://arxiv.org/pdf/2510.27149.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.23287",
      "title": "On the Interpretation of Velocity Residuals in Protoplanetary Disks",
      "authors": [
        "Masataka Aizawa",
        "Ryuta Orihara"
      ],
      "abstract": "On the Interpretation of Velocity Residuals in Protoplanetary Disks Masataka Aizawa, Ryuta Orihara 16 pages, 4 figures, accepted for publication in AJ Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) We present a first-order analytical model for line-of-sight velocity residuals, defined as the difference between observed velocities and those predicted by a fiducial model, assuming a flared, nearly axisymmetric disk with the perturbations in disk surface height $\\delta h(r)$, inclination $\\delta i(r)$, and position angle $\\delta\\mathrm{PA}(r)$. Introducing projection-deprojection mapping between sky-plane and disk-frame coordinates, we demonstrate that the normalized velocity residuals exhibit Fourier components up to the third harmonic ($\\sin3\\phi$ and $\\cos3\\phi$). Moreover, we show that the radial profiles of $\\delta h(r)$, $\\delta i(r)$, and $\\delta\\mathrm{PA}(r)$ can be uniquely recovered from the data by solving a linear inverse problem. For comparison, we highlight factors that are not considered in previous models. We also outline how our framework can be extended beyond the first-order residuals and applied to additional observables, such as line intensities and widths.",
      "pdf_url": "https://arxiv.org/pdf/2507.23287.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05309",
      "title": "Optimizing broadband microwave absorbers for applications in the 70-200 GHz range",
      "authors": [
        "Gaganpreet Singh",
        "Rustam Balafendiev",
        "Mahesh Singh Bist",
        "Thomas J.L.J. Gascard",
        "Gagandeep Kaur",
        "Vid Primožič",
        "Jon E. Gudmundsson"
      ],
      "abstract": "Optimizing broadband microwave absorbers for applications in the 70-200 GHz range Gaganpreet Singh, Rustam Balafendiev, Mahesh Singh Bist, Thomas J.L.J. Gascard, Gagandeep Kaur, Vid Primožič, Jon E. Gudmundsson 9 pages, 10 figures to be submitted to Applied Optics Instrumentation and Methods for Astrophysics (astro-ph.IM); Optics (physics.optics) We present results of an extensive suite of numerical simulations that probe square-tiled microwave absorber performance as a function of material properties, frequency, geometry, and unit cell size. The work, which probes both specular reflection and total absorption, highlights the critical importance of the absorber scale size relative to the incidence wavelength while suggesting that material properties have a comparatively weaker impact on overall performance. We show that some absorber designs can achieve 99.5-99.9% frequency-averaged absorption across the 70 to 200 GHz range for normal incidence and that low specular reflectance does not necessarily guarantee optimal absorption performance. Our results indicate that exponential, Klopfenstein, and linear impedance tapers provide comparable performance as long as a unit cell size of 1 to 4 mm is chosen. Simulation results are validated against measurements of specular reflectance.",
      "pdf_url": "https://arxiv.org/pdf/2511.05309.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04725",
      "title": "CATS: Empowering the next generation of rocket scientists through educational flight computers",
      "authors": [
        "Jonas Binz",
        "Nemanja Stojoski",
        "Luca Jost"
      ],
      "abstract": "CATS: Empowering the next generation of rocket scientists through educational flight computers Jonas Binz, Nemanja Stojoski, Luca Jost Was accepted to the 26th ESA Symposium on european Rocket and Balloon programmes and related research in Luzern from 19.5.2024 to 23.5.2024 Physics Education (physics.ed-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Computers and Society (cs.CY) This paper presents an in-depth analysis of the Vega flight computer, and its corresponding ground station developed by CATS, a company producing open-source flight computers and tracking systems tailored for student-made rockets. These flight computers, designed to support rockets reaching altitudes of up to 30 km and possibly higher, play a crucial role in advancing educational rocketry and facilitating hands-on learning experiences in aerospace engineering. As the official sponsor of the European Rocketry Challenge (EuRoC), these flight computers have become integral to the competition, providing reliable and sophisticated telemetry and control capabilities that enhance both safety and performance. The paper delves into the technical specifications and educational impact of these systems, highlighting their contribution to the broader European rocketry programmes. Through comprehensive field data and case studies from the recent European Rocketry Challenge, this study underscores the potential of open-source flight computers to inspire the next generation of aerospace professionals.",
      "pdf_url": "https://arxiv.org/pdf/2511.04725.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.CY"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04740",
      "title": "Micrometeoroid Impact Rate Analysis for an Artemis-Era Lunar Base",
      "authors": [
        "Daniel A. Yahalomi",
        "Matthew T. Scoggins",
        "Nasiah Anderson",
        "Mark Driker",
        "Kokoro Onuma",
        "Kwamena T. Awotwi",
        "Justin M. Donovan",
        "Priyan Sathianathan"
      ],
      "abstract": "Micrometeoroid Impact Rate Analysis for an Artemis-Era Lunar Base Daniel A. Yahalomi, Matthew T. Scoggins, Nasiah Anderson, Mark Driker, Kokoro Onuma, Kwamena T. Awotwi, Justin M. Donovan, Priyan Sathianathan 11 pages, 6 figures, submitted to PSJ. Code available at this https URL Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) NASA's Artemis Mission aims to return astronauts to the Moon and establish a base at the lunar south pole. A key challenge is understanding the threat from micrometeoroid impacts, which are too small to monitor directly. Using NASA's Meteoroid Engineering Model 3 (\\texttt{MEM~3}), we estimate micrometeoroid impact rates on a base comparable in size to the International Space Station (100\\,m $\\times$ 100\\,m $\\times$ 10\\,m). We find that a lunar base would experience $\\sim$15,000--23,000 incident impacts per year by micrometeoroids with a mass range of $10^{-6}$--$10^{1}$~g, depending on location -- with minima at the lunar poles, a maximum near the sub-Earth longitude, and a factor of $\\sim$1.6 variation between the two. To assess the mitigating effect of protection systems, we present a functional relationship describing the number of impacts that penetrate the shielding as a function of the minimum meteoroid mass capable of penetrating the shield -- the ``critical mass.'' We estimate that state-of-the-art Whipple shields protect against $\\sim$99.9997\\% of micrometeoroids. By re-running \\texttt{MEM~3} with a minimum mass equal to the critical mass of modern Whipple shields, we determine that a shielded lunar base would experience $\\sim$0.024--0.037 penetrating impacts per year -- again with minima at the poles and a maximum near the sub-Earth longitude. These results indicate that (1) the lunar poles are optimal for sustained habitation, (2) gravitational focusing by Earth dominates over its geometric shielding for this micrometeoroid flux, and (3) current shielding technology can reduce micrometeoroid threats by nearly five orders of magnitude, making long-duration lunar habitation feasible.",
      "pdf_url": "https://arxiv.org/pdf/2511.04740.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05154",
      "title": "Upper limits on atmospheric abundances of KELT-11b and WASP-69b from a retrieval approach",
      "authors": [
        "F. Lesjak",
        "L. Nortmann",
        "D. Cont",
        "P. J. Amado",
        "M. Azzaro",
        "J. A. Caballero",
        "S. Czesla",
        "A. Hatzes",
        "Th. Henning",
        "M. López-Puertas",
        "K. Molaverdikhani",
        "D. Montes",
        "J. Orell-Miquel",
        "E. Pallé",
        "A. Peláez-Torres",
        "A. Quirrenbach",
        "A. Reiners",
        "I. Ribas",
        "A. Sánchez-López",
        "A. Schweitzer",
        "F. Yan"
      ],
      "abstract": "Upper limits on atmospheric abundances of KELT-11b and WASP-69b from a retrieval approach F. Lesjak, L. Nortmann, D. Cont, P. J. Amado, M. Azzaro, J. A. Caballero, S. Czesla, A. Hatzes, Th. Henning, M. López-Puertas, K. Molaverdikhani, D. Montes, J. Orell-Miquel, E. Pallé, A. Peláez-Torres, A. Quirrenbach, A. Reiners, I. Ribas, A. Sánchez-López, A. Schweitzer, F. Yan Accepted for publication in Astronomy & Astrophysics, 18 pages, 17 figures Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) WASP-69b and KELT-11b are two low-density hot Jupiters, which are expected to show strong atmospheric features in their transmission spectra. Such features offer valuable insights into the chemical composition, thermal structure, and cloud properties of exoplanet atmospheres. High-resolution spectroscopic observations can be used to study the line-forming regions in exoplanet atmospheres and potentially detect signals despite the presence of clouds. We aimed to detect various molecular species and constrain the chemical abundances and cloud deck pressures using high-resolution spectroscopy. We observed multiple transits of these planets with CARMENES and applied the cross-correlation method to detect atmospheric signatures. Further, we used an injection-recovery approach and retrievals to place constraints on the atmospheric properties. We detected a tentative H$_2$O signal for KELT-11b but not for WASP-69b, and searches for other molecules such as H$_2$S and CH$_4$ resulted in non-detections for both planets. By investigating the signal strength of injected synthetic models, we constrained which atmospheric abundances and cloud deck pressures are consistent with our cross-correlation results. In addition, we show that a retrieval-based approach leads to similar constraints of these parameters.",
      "pdf_url": "https://arxiv.org/pdf/2511.05154.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05331",
      "title": "EMPEROR I. Exoplanet MCMC parallel tempering for RV orbit retrieval",
      "authors": [
        "Pablo A. Peña R.",
        "James S. Jenkins"
      ],
      "abstract": "EMPEROR I. Exoplanet MCMC parallel tempering for RV orbit retrieval Pablo A. Peña R., James S. Jenkins Accepted for publication in A&A Sect. 15. Numerical methods and codes. The official acceptance date is 19/10/2025 Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present \\texttt{EMPEROR}, an open-source Python framework designed for efficient exoplanet detection and characterisation with radial velocities (RV). \\texttt{EMPEROR} integrates Dynamic Nested Sampling (DNS) and Adaptive Parallel Tempering (APT) Markov Chain Monte Carlo (MCMC), supporting multiple noise models such as Gaussian Processes (GPs) and Moving Averages (MA). The framework enables systematic model comparison using statistical metrics, including Bayesian evidence ($\\ln{\\mathcal{Z}}$) and Bayesian Information Criterion (BIC), while providing automated, publish-ready visualisations. \\texttt{EMPEROR} is evaluated across three distinct systems to assess its capabilities in different detection scenarios. Sampling performance, model selection, and the search for Earth-mass planets are evaluated in data for 51 Pegasi, HD 55693 and Barnard's Star (GJ 699). For 51 Pegasi, APT achieves an effective sampling increase over DNS by a factor 3.76, while retrieving tighter parameter estimates. For HD 55693 the stellar rotation $P_{\\text{rot}}=29.72^{+0.01}_{-0.02}$ and magnetic cycle $P_{\\text{mag}}=2557.0^{+70.1}_{-36.7}$ are recovered, while demonstrating the sensitivity of $\\ln{\\mathcal{Z}}$ to prior selection. For Barnard's star, several noise models are compared, and the confirmed planet parameters are successfully retrieved with all of them. The best model shows a period of 3.1536$\\pm$0.0003~d, minimum mass of 0.38$\\pm$0.03 M$_{\\rm{\\oplus}}$, and semi-major axis of 0.02315$\\pm$0.00039~AU. Purely statistical inference might be insufficient on its own for robust exoplanet detection. Effective methodologies must integrate domain knowledge, heuristic criteria, and multi-faceted model comparisons. The versatility of \\texttt{EMPEROR} in handling diverse noise structures, its systematic model selection, and its improved performance make it a valuable tool for RV exoplanetary studies.",
      "pdf_url": "https://arxiv.org/pdf/2511.05331.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02016",
      "title": "Design and Scientific Prospects of the POLAR-2 Mission",
      "authors": [
        "Merlin Kole",
        "Nicolas de Angelis",
        "Jiang He",
        "Hongbang Liu",
        "Jianchao Sun",
        "Fei Xie",
        "Jimmy Zaid"
      ],
      "abstract": "Design and Scientific Prospects of the POLAR-2 Mission Merlin Kole, Nicolas de Angelis, Jiang He, Hongbang Liu, Jianchao Sun, Fei Xie, Jimmy Zaid Accepted for Publication in Innovations in Space Research Technology Instrumentation and Methods for Astrophysics (astro-ph.IM) The POLAR-2 mission consists of 3 instruments designed with the combined aim of producing a deeper understanding of Gamma-Ray Bursts. To achieve this, POLAR-2 relies on polarisation measurements and, for the first time will provide these using 2 separate polarimeter detectors. The first of these is a payload optimised to perform Compton polarimetry measurements in the 40-1000 keV energy range using a combination of plastic scintillators and SiPMs. The development of this payload, the design of which is based on lessons learned from the POLAR mission, included optimization of plastic scintillator design. In addition, its development included detailed characterization, space qualification and radiation damage and mitigation strategies for the large number of silicon photo-multipliers included in the design. We will present these along with an overview of the readout electronics. These electronics were developed with flexibility in mind, as well as low cost and low power consumption. As such, its design is of interest beyond this polarimeter and is also used on the spectrometer instrument of POLAR-2 where it is used to read out an array of GAGG:Ce scintillators. This readout, in combination with a coded mask, allows this secondary instrument to provide detailed spectral and localization measurements. The final instrument used in the mission aims to use gas-based detectors to perform polarization measurements in the keV energy region. The novelty of this design is that it will be optimized to use these for wide field of view observations. The combination of the three instruments will allow to perform detailed spectral, localization and polarization measurements of these transient phenomena together for the first time. Here we provide an overview of the technologies employed in the mission along with detailed predictions on its capabilities after its launch currently foreseen in 2027.",
      "pdf_url": "https://arxiv.org/pdf/2510.02016.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22021",
      "title": "Background stability and annual modulation test using PICOLON ultra-pure NaI(Tl) detector",
      "authors": [
        "PICOLON Collaboration: K. Kotera",
        "D. Chernyak",
        "H. Ejiri",
        ".K. Fushimi",
        "K. Hata",
        "R. Hazama",
        "T. Iida",
        "H. Ikeda",
        "K. Imagawa",
        "K. Inoue",
        "H. Ito",
        "T. Kishimoto",
        "M. Koga",
        "A. Kozlov",
        "K. Nakamura",
        "R. Orito",
        "T. Shima",
        "Y. Takemoto",
        "S. Umehara",
        "Y. Urano",
        "K. Yasuda",
        "S. Yoshida"
      ],
      "abstract": "Background stability and annual modulation test using PICOLON ultra-pure NaI(Tl) detector PICOLON Collaboration: K. Kotera, D. Chernyak, H. Ejiri, .K. Fushimi, K. Hata, R. Hazama, T. Iida, H. Ikeda, K. Imagawa, K. Inoue, H. Ito, T. Kishimoto, M. Koga, A. Kozlov, K. Nakamura, R. Orito, T. Shima, Y. Takemoto, S. Umehara, Y. Urano, K. Yasuda, S. Yoshida Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) The dark matter observation claimed by the DAMA/LIBRA experiment has been a long-standing puzzle within the particle physics community. NaI(Tl) crystals with radiopurity comparable to DAMA/LIBRA's are essential for adequate verification. Existing experiments using NaI(Tl) target have been hampered by the high radioactivity concentration of NaI(Tl) crystals. PICOLON experiment conducts an independent search for Weakly Interacting Massive Particles using highest purity NaI(Tl) crystals. In 2020, the NaI(Tl) crystal (Ingot#85) reached the same purity level as DAMA/LIBRA crystals. The DAMA/LIBRA group has stressed that verifying their signal requires high-purity NaI(Tl) crystals with long-term stability. Based on a six-month measurement, we have confirmed the long-term stability of its radiopurity. This stability provides a significant advantage for future efforts to adequately verify the DAMA/LIBRA result using NaI(Tl) crystal. In this paper, we present the background stability of purity in the Ingot#94 NaI(Tl) detector, which was produced using the Ingot#85 purification method, along with the first annual modulation search conducted by the PICOLON experiment.",
      "pdf_url": "https://arxiv.org/pdf/2509.22021.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.23857",
      "title": "Wind-AE: A Fast, Open-source 1D Photoevaporation Code with Metal and Multi-frequency X-ray Capabilities",
      "authors": [
        "Madelyn Broome",
        "Ruth Murray-Clay",
        "John McCann",
        "James E Owen"
      ],
      "abstract": "Wind-AE: A Fast, Open-source 1D Photoevaporation Code with Metal and Multi-frequency X-ray Capabilities Madelyn Broome, Ruth Murray-Clay, John McCann, James E Owen Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) Throughout their lives, short period exoplanets (<100 days) experience X-ray and extreme-UV (XUV) stellar irradiation that can heat and photoionize planets' upper atmospheres, driving transonic outflows. This photoevaporative mass loss plays a role in both evolution and observed demographics; however, mass loss rates are not currently directly observable and can only be inferred from models. To that end, we present an open-source fast 1D, XUV multi-frequency, multispecies, steady-state, hydrodynamic Parker Wind photoevaporation relaxation model based on Murray-Clay et al. (2009,arXiv:0811.0006). The model can move smoothly between high and low flux regimes and accepts custom multi-frequency stellar spectra. While the inclusion of high-energy X-rays increases mass loss rates ($\\dot{M}$), metals decrease $\\dot{M}$, and the net result for a typical hot Jupiter is a similar $\\dot{M}$, but a hotter, faster, and more gradually ionized wind. We find that mulitfrequency photons (e.g., 13.6-2000eV) are absorbed over a broader range of heights in the atmosphere resulting in a wind-launch radius, $R_{XUV}$, that is of order 10 nanobars for all but the highest surface gravity planets. Grids of H/He solar metallicity atmospheres reveal that, for typical hot Jupiters like HD 209458b, $R_{XUV}$~1.1-1.8$R_P$ for low-fluxes, meaning that the energy-limited mass loss rate, $\\dot{M}_{Elim}(R)$, computed at $R=R_P$ is a good approximation. However, for planets with low escape velocities, like many sub-Neptunes and super-Earths, $R_{XUV}$ can be >>$R_P$, making it necessary to use $\\dot{M}_{Elim}(R=R_{XUV})$ to avoid significantly underestimating mass loss rates. For both high escape velocities and large incident fluxes, radiative cooling is significant and energy-limited mass loss overestimates $\\dot{M}$.",
      "pdf_url": "https://arxiv.org/pdf/2510.23857.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.02021",
      "title": "Computing the Full Earth System at 1 km Resolution",
      "authors": [
        "Daniel Klocke",
        "Claudia Frauen",
        "Jan Frederik Engels",
        "Dmitry Alexeev",
        "René Redler",
        "Reiner Schnur",
        "Helmuth Haak",
        "Luis Kornblueh",
        "Nils Brüggemann",
        "Fatemeh Chegini",
        "Manoel Römmer",
        "Lars Hoffmann",
        "Sabine Griessbach",
        "Mathis Bode",
        "Jonathan Coles",
        "Miguel Gila",
        "William Sawyer",
        "Alexandru Calotoiu",
        "Yakup Budanaz",
        "Pratyai Mazumder",
        "Marcin Copik",
        "Benjamin Weber",
        "Andreas Herten",
        "Hendryk Bockelmann",
        "Torsten Hoefler",
        "Cathy Hohenegger",
        "Bjorn Stevens"
      ],
      "abstract": "Computing the Full Earth System at 1 km Resolution Daniel Klocke, Claudia Frauen, Jan Frederik Engels, Dmitry Alexeev, René Redler, Reiner Schnur, Helmuth Haak, Luis Kornblueh, Nils Brüggemann, Fatemeh Chegini, Manoel Römmer, Lars Hoffmann, Sabine Griessbach, Mathis Bode, Jonathan Coles, Miguel Gila, William Sawyer, Alexandru Calotoiu, Yakup Budanaz, Pratyai Mazumder, Marcin Copik, Benjamin Weber, Andreas Herten, Hendryk Bockelmann, Torsten Hoefler, Cathy Hohenegger, Bjorn Stevens Atmospheric and Oceanic Physics (physics.ao-ph); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM) We present the first-ever global simulation of the full Earth system at 1.25 km grid spacing, achieving highest time compression with an unseen number of degrees of freedom. Our model captures the flow of energy, water, and carbon through key components of the Earth system: atmosphere, ocean, and land. To achieve this landmark simulation, we harness the power of 8192 GPUs on Alps and 20480 GPUs on JUPITER, two of the world's largest GH200 superchip installations. We use both the Grace CPUs and Hopper GPUs by carefully balancing Earth's components in a heterogeneous setup and optimizing acceleration techniques available in ICON's codebase. We show how separation of concerns can reduce the code complexity by half while increasing performance and portability. Our achieved time compression of 145.7 simulated days per day enables long studies including full interactions in the Earth system and even outperforms earlier atmosphere-only simulations at a similar resolution.",
      "pdf_url": "https://arxiv.org/pdf/2511.02021.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.05147",
      "title": "Mass determination of the three long-period Neptune- and sub-Neptune-sized planets transiting TOI-282",
      "authors": [
        "A. Barone",
        "F. Rodler",
        "D. Gandolfi",
        "A. Bonfanti",
        "P. Leonardi",
        "L. Visca",
        "M. Fridlund",
        "M. Brogi",
        "L. Fossati",
        "P. E. Cubillos",
        "W. D. Cochran",
        "S. Csizmadia",
        "J. Livingston",
        "G. Nowak",
        "E. Pallé",
        "C. M. Persson",
        "S. Redfield",
        "H. Schmerling",
        "A. M. S. Smith"
      ],
      "abstract": "Mass determination of the three long-period Neptune- and sub-Neptune-sized planets transiting TOI-282 A. Barone, F. Rodler, D. Gandolfi, A. Bonfanti, P. Leonardi, L. Visca, M. Fridlund, M. Brogi, L. Fossati, P. E. Cubillos, W. D. Cochran, S. Csizmadia, J. Livingston, G. Nowak, E. Pallé, C. M. Persson, S. Redfield, H. Schmerling, A. M. S. Smith Earth and Planetary Astrophysics (astro-ph.EP) TOI-282 is a bright (V=9.38) F8 main-sequence star known to host three transiting long-period ($P_b$=22.9 d, $P_c$=56.0 d, and $P_d$=84.3 d) small ($R_p\\approx$ 2-4 $R_{\\oplus}$) planets. The orbital period ratio of the two outermost planets, namely TOI-282 c and d, is close to the 3:2 commensurability, suggesting that the planets might be trapped in a mean motion resonance. We combined space-borne photometry from the TESS telescope with high-precision HARPS and ESPRESSO Doppler measurements to refine orbital parameters, measure the planetary masses, and investigate the architecture and evolution of the system. We performed a Markov chain Monte Carlo joint analysis of the transit light curves and radial velocity time series, and carried out a dynamical analysis to model transit timing variations and Doppler measurements along with N-body integration. In agreement with previous results, we found that TOI-282 b, c, and d have radii of $R_b=2.69 \\pm 0.23 \\ R_{\\oplus}$, $R_c=4.13^{+0.16}_{-0.14} \\ R_{\\oplus}$, and $R_d=3.11 \\pm 0.15 \\ R_{\\oplus}$, respectively. We measured planetary masses of $M_b=6.2\\pm1.6 \\ M_{\\oplus}$, $M_c=9.2\\pm2.0 \\ M_{\\oplus}$, and $M_d=5.8^{+0.9}_{-1.1} \\ M_{\\oplus}$, which imply mean densities of $\\rho_b=1.8^{+0.7}_{-0.6} \\ \\text{g cm}^{-3}$, $\\rho_c=0.7 \\pm 0.2 \\ \\text{g cm}^{-3}$, and $\\rho_d=1.1^{+0.3}_{-0.2} \\ \\text{g cm}^{-3}$, respectively. The three planets may be water worlds, making TOI-282 an interesting system for future atmospheric follow-up observations with JWST and ELT.",
      "pdf_url": "https://arxiv.org/pdf/2511.05147.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.15487",
      "title": "DiskMINT: Self-Consistent Thermochemical Disk Models with Radially Varying Gas and Dust -- Application to the Massive, CO-Rich Disk of IM Lup",
      "authors": [
        "Dingshan Deng",
        "Uma Gorti",
        "Ilaria Pascucci",
        "Maxime Ruaud"
      ],
      "abstract": "DiskMINT: Self-Consistent Thermochemical Disk Models with Radially Varying Gas and Dust -- Application to the Massive, CO-Rich Disk of IM Lup Dingshan Deng, Uma Gorti, Ilaria Pascucci, Maxime Ruaud Accepted for publication in ApJ. 25 pages, 15 figures. Typos in Table 5 and Appendix B are corrected in this updated version Earth and Planetary Astrophysics (astro-ph.EP) Disks around young stars are the birthplaces of planets, and the spatial distribution of their gas and dust masses is critical for understanding where and what types of planets can form. We present self-consistent thermochemical disk models built with DiskMINT, which extends its initial framework to allow for spatially decoupled gas and dust distributions. DiskMINT calculates the gas temperature based on thermal equilibrium with dust grains, solves vertical gas hydrostatic equilibrium, and includes key processes for the CO chemistry, specifically selective photodissociation, and freeze-out with conversion CO/CO$_2$ ice. We apply DiskMINT to study the IM Lup disk, a large massive disk, yet with an inferred CO depletion of up to 100 based on earlier thermochemical models. By fitting the multi-wavelength SED along with the millimeter continuum, ${\\rm C^{18}O}$ radial emission profiles, we find $0.02-0.08\\,{\\rm M_\\odot}$ for the gas disk mass, which are consistent with the dynamical-based mass within the uncertainties. We further compare the derived surface densities for dust and gas and find that the outer disk is drift-dominated, with a dust-to-gas mass ratio of approximately 0.01-0.02, which is likely insufficient to meet the conditions for the streaming instability to occur. Our results suggest that when interpreted with self-consistent thermochemical models, ${\\rm C^{18}O}$ alone can serve as a reliable tracer of both the total gas mass and its radial distribution. This approach enables gas mass estimates in lower-mass disks, where dynamical constraints are not available, and in fainter systems where rare species like ${\\rm N_2H^+}$ are too weak to detect.",
      "pdf_url": "https://arxiv.org/pdf/2509.15487.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20429",
      "title": "Not All Sub-Neptune Exoplanets Have Magma Oceans",
      "authors": [
        "Bodie Breza",
        "Matthew C. Nixon",
        "Eliza M.-R. Kempton"
      ],
      "abstract": "Not All Sub-Neptune Exoplanets Have Magma Oceans Bodie Breza, Matthew C. Nixon, Eliza M.-R. Kempton 15 pages, 4 figures, 2 tables. Published in ApJ Letters, updated to reflect proofs Bodie Breza et al 2025 ApJL 993 L46 Earth and Planetary Astrophysics (astro-ph.EP) The evolution and structure of sub-Neptunes may be strongly influenced by interactions between the outer gaseous envelope of the planet and a surface magma ocean. However, given the wide variety of permissible interior structures of these planets, it is unclear whether conditions at the envelope-mantle boundary will always permit a molten silicate layer, or whether some sub-Neptunes might instead host a solid silicate surface. In this work, we use internal structure modeling to perform an extensive exploration of surface conditions within the sub-Neptune population across a range of bulk and atmospheric parameters. We find that a significant portion of the population may lack present-day magma oceans. In particular, planets with a high atmospheric mean molecular weight and large envelope mass fraction are likely to instead have a solid silicate surface, since the pressure at the envelope-mantle boundary is high enough that the silicates will be in solid post-perovskite phase. This result is particularly relevant given recent inferences of high-mean molecular weight atmospheres from JWST observations of several sub-Neptunes. We apply this approach to a number of sub-Neptunes with existing or upcoming JWST observations, and find that in almost all cases, a range of solutions exist which do not possess a present-day magma ocean. Our analysis provides critical context for interpreting sub-Neptunes and their atmospheres.",
      "pdf_url": "https://arxiv.org/pdf/2509.20429.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}