{
  "date": "2025-10-04",
  "category": "astro-ph",
  "subcategories": [
    "astro-ph.HE",
    "astro-ph.EP",
    "astro-ph.SR",
    "astro-ph.GA",
    "astro-ph.IM",
    "astro-ph.CO"
  ],
  "total_papers": 106,
  "gw_related_papers": 10,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2510.01316",
      "title": "Expectations for the first supermassive black-hole binary resolved by PTAs II: Milestones for binary characterization",
      "authors": [
        "Polina Petrov",
        "Levi Schult",
        "Stephen R. Taylor",
        "Nihan Pol",
        "Nima Laal",
        "Maria Charisi",
        "Chung-Pei Ma"
      ],
      "abstract": "Expectations for the first supermassive black-hole binary resolved by PTAs II: Milestones for binary characterization Polina Petrov, Levi Schult, Stephen R. Taylor, Nihan Pol, Nima Laal, Maria Charisi, Chung-Pei Ma Instrumentation and Methods for Astrophysics (astro-ph.IM); General Relativity and Quantum Cosmology (gr-qc) Following the recent evidence for a gravitational wave (GW) background found by pulsar timing array (PTA) experiments, the next major science milestone is resolving individual supermassive black hole binaries (SMBHBs). The detection of these systems could arise via searches using a power-based GW anisotropy model or a deterministic template model. In Schult et al. 2025, we compared the efficacy of these models in constraining the GW signal from a single SMBHB using realistic, near-future PTA datasets, and found that the full-signal deterministic continuous wave (CW) search may achieve detection and characterization first. Here, we continue our analyses using only the CW model given its better performance, focusing now on characterization milestones. We examine the order in which CW parameters are constrained as PTA data are accumulated and the signal-to-noise ratio (S/N) grows. We also study how these parameter constraints vary across sources of different sky locations and GW frequencies. We find that the GW frequency and strain are generally constrained at the same time (or S/N), closely followed by the sky location, and later the chirp mass (if the source is highly evolving) and inclination angle. At fixed S/N, sources at higher frequencies generally achieve better precision on the GW frequency, chirp mass, and sky location. The time (and S/N) at which the signal becomes constrained is dependent on the sky location and frequency of the source, with the effects of pulsar terms and PTA geometry playing crucial roles in source detection and localization.",
      "pdf_url": "https://arxiv.org/pdf/2510.01316.pdf",
      "categories": [
        "astro-ph.IM",
        "gr-qc"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.01597",
      "title": "Realistic Oscillon Interactions",
      "authors": [
        "Angela Xue",
        "Kyle Chen",
        "Baylee Verzyde",
        "Peter Hayman",
        "Richard Easther"
      ],
      "abstract": "Realistic Oscillon Interactions Angela Xue, Kyle Chen, Baylee Verzyde, Peter Hayman, Richard Easther 10 pages, 11 figures. Videos this https URL Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Oscillons are long-lived nonlinear pseudo-solitonic configurations of scalar fields and many plausible inflationary scenarios predict an oscillon-dominated phase in the early universe. Many possible aspects of this phase remain unexplored, particularly oscillon-oscillon interactions and interactions between oscillons and their environment. However the primary long range forces between oscillons are gravitational and thus slow-acting relative to the intrinsic timescales of the oscillons themselves. Given that simulations with local gravity are computationally expensive we explore these effects by extracting individual specimens from simulations and then engineering interactions. We find that oscillons experience friction when moving in an inhomogeneous background and, because oscillons in non-relativistic collisions bounce or merge as a function of their relative phases, the outcomes of interactions between ``wild'' oscillons depend on their specific trajectories.",
      "pdf_url": "https://arxiv.org/pdf/2510.01597.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-th"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01614",
      "title": "Dedicated-frequency analysis of gravitational-wave bursts from core-collapse supernovae with minimal assumptions",
      "authors": [
        "Yi Shuen C. Lee",
        "Marek J Szczepańczyk",
        "Tanmaya Mishra",
        "Margaret Millhouse",
        "Andrew Melatos"
      ],
      "abstract": "Dedicated-frequency analysis of gravitational-wave bursts from core-collapse supernovae with minimal assumptions Yi Shuen C. Lee, Marek J Szczepańczyk, Tanmaya Mishra, Margaret Millhouse, Andrew Melatos 19 pages, 9 figures, accepted for publication in Physical Review D High Energy Astrophysical Phenomena (astro-ph.HE); General Relativity and Quantum Cosmology (gr-qc) Gravitational-wave (GW) emissions from core-collapse supernovae (CCSNe) provide insights into the internal processes leading up to their explosions. Theory predicts that CCSN explosions are driven by hydrodynamical instabilities like the standing accretion shock instability (SASI) or neutrino-driven convection, and simulations show that these mechanisms emit GWs at low frequencies ($\\lesssim 0.25 \\,{\\rm kHz}$). Thus the detection of low-frequency GWs, or lack thereof, is useful for constraining explosion mechanisms in CCSNe. This paper introduces the dedicated-frequency framework, which is designed to follow-up GW burst detections using bandpass analyses. The primary aim is to study whether low-frequency (LF) follow-up analyses, limited to $\\leq 256 \\,{\\rm Hz}$, constrain CCSN explosion models in practical observing scenarios. The analysis dataset comprises waveforms from five CCSN models with different strengths of low-frequency GW emissions induced by SASI and/or neutrino-driven convection, injected into the Advanced LIGO data from the Third Observing Run (O3). Eligible candidates for the LF follow-up must satisfy a benchmark detection significance and are identified using the coherent WaveBurst (cWB) algorithm. The LF follow-up analyses are performed using the BayesWave algorithm. Both cWB and BayesWave make minimal assumptions about the signal's morphology. The results suggest that the successful detection of a CCSN in the LF follow-up analysis constrains its explosion mechanism. The dedicated-frequency framework also has other applications. As a demonstration, the loudest trigger from the SN 2019fcn supernova search is followed-up using a high-frequency (HF) analysis, limited to $\\geq 256 \\,{\\rm Hz}$. The trigger has negligible power below $256 \\, {\\rm Hz}$, and the HF analysis successfully enhances its detection significance.",
      "pdf_url": "https://arxiv.org/pdf/2510.01614.pdf",
      "categories": [
        "astro-ph.HE",
        "gr-qc"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.01974",
      "title": "BAO miscalibration cannot rescue late-time solutions to the Hubble tension",
      "authors": [
        "Davide Pedrotti",
        "Luis A. Escamilla",
        "Valerio Marra",
        "Leandros Perivolaropoulos",
        "Sunny Vagnozzi"
      ],
      "abstract": "BAO miscalibration cannot rescue late-time solutions to the Hubble tension Davide Pedrotti, Luis A. Escamilla, Valerio Marra, Leandros Perivolaropoulos, Sunny Vagnozzi 41 pages, 22 sub-figures arranged into 15 figures, many references Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Baryon Acoustic Oscillation (BAO) measurements play a key role in ruling out post-recombination solutions to the Hubble tension. However, because the data compression leading to these measurements assumes a fiducial $\\Lambda$CDM cosmology, their reliability in testing late-time modifications to $\\Lambda$CDM has at times been called into question. We play devil's advocate and posit that fiducial cosmology assumptions do indeed affect BAO measurements in such a way that low-redshift acoustic angular scales (proportional to the Hubble constant $H_0$) are biased low, and test whether such a rescaling can rescue post-recombination solutions. The answer is no. Firstly, strong constraints on the shape of the $z \\lesssim 2$ expansion history from unanchored Type Ia Supernovae (SNeIa) prevent large deviations from $\\Lambda$CDM. In addition, unless $\\Omega_m$ is significantly lower than $0.3$, the rescaled BAO measurements would be in strong tension with geometrical information from the Cosmic Microwave Background. We demonstrate this explicitly on several dark energy (DE) models ($w$CDM, CPL DE, phenomenologically emergent DE, holographic DE, $\\Lambda_s$CDM, and the negative cosmological constant model), finding that none can address the Hubble tension once unanchored SNeIa are included. We argue that the $\\Lambda_s$CDM sign-switching cosmological constant model possesses interesting features which make it the least unpromising one among those tested. Our results demonstrate that possible fiducial cosmology-induced BAO biases cannot be invoked as loopholes to the Hubble tension \"no-go theorem\", and highlight the extremely important but so far underappreciated role of unanchored SNeIa in ruling out post-recombination solutions.",
      "pdf_url": "https://arxiv.org/pdf/2510.01974.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.12105",
      "title": "Can asteroid-mass PBHDM be compatible with catalyzed phase transition interpretation of PTA?",
      "authors": [
        "Jiahang Zhong",
        "Chao Chen",
        "Yi-Fu Cai"
      ],
      "abstract": "Can asteroid-mass PBHDM be compatible with catalyzed phase transition interpretation of PTA? Jiahang Zhong, Chao Chen, Yi-Fu Cai 27 pages,7 figures; comments are welcome Cosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Primordial black holes (PBHs) can catalyze first-order phase transitions (FOPTs) in their vicinity, potentially modifying the gravitational wave (GW) signals from PTs. In this study, we investigate the GWs from strong PTs catalyzed by PBHs. We consider high PBH number densities, corresponding to asteroid-mass PBH dark matter (DM) when the GWs from FOPTs peak in the nanohertz band. We calculate the PBH-catalyzed FOPT GWs from both bubble collision GWs and scaler-induced gravitational waves (SIGWs). We find that while low PBH number densities amplify the GW signals due to the formation of large bubbles, high PBH number densities suppress them, as the accelerated phase transition proceeds too rapidly. This suppression renders the signals unable to explain pulsar timing array (PTA) observations. By conducting data fitting with the NANOGrav 15-year dataset, we find that the PBH catalytic effect significantly alters the estimation of PT parameters. Notably, our analysis of the bubble collision GWs reveals that, the asteroid-mass PBHs ($10^{-16} - 10^{-12} M_\\odot$) as the whole dark matter is incompatible with the PT interpretation of pulsar timing array signals. However, incorporating SIGWs can reduce this incompatibility for PBHs in the mass range $10^{-14} - 10^{-12} M_\\odot$.",
      "pdf_url": "https://arxiv.org/pdf/2504.12105.pdf",
      "categories": [
        "astro-ph.CO",
        "gr-qc",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.14712",
      "title": "Lie Group Theory of Multipole Moments and Shape of Stationary Rotating Fluid Bodies",
      "authors": [
        "Sergei M. Kopeikin"
      ],
      "abstract": "Lie Group Theory of Multipole Moments and Shape of Stationary Rotating Fluid Bodies Sergei M. Kopeikin (University of Missouri-Columbia, USA) Classical Physics (physics.class-ph); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR); General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph); Fluid Dynamics (physics.flu-dyn); Geophysics (physics.geo-ph) We present a rigorous framework for determining equilibrium configurations of uniformly rotating self-gravitating fluid bodies. This work addresses the longstanding challenge of modeling rotational deformation in celestial objects such as stars and planets. By integrating classical Newtonian potential theory with modern mathematical tools, we develop a unified formalism that improves both the precision and generality of shape modeling in astrophysical contexts. Our method employs Lie group theory and exponential mapping to characterize vector flows associated with rotational deformations. We derive functional equations for perturbations in density and gravitational potential, resolved analytically using the shift operator and Neumann series. This extends Clairaut's classical linear theory into the nonlinear regime. The resulting formulation yields an exact nonlinear differential equation for the shape function, describing hydrostatic equilibrium under rotation without assuming slow rotation. This generalized Clairaut equation incorporates nonlinear effects and accommodates large rotational speeds. We validate the theory by deriving exact solutions, including the Maclaurin spheroid, Jacobi ellipsoid, and the unit-index polytrope. We also introduce spectral decomposition techniques to analyze radial harmonics of the shape function and gravitational perturbations. Using Wigner's formalism for angular momentum addition, we compute higher-order spectral corrections and derive boundary conditions for radial harmonics. This enables accurate computation of Love numbers and gravitational multipole moments, offering a comprehensive, non-perturbative approach to modeling rotational deformations in astrophysical systems.",
      "pdf_url": "https://arxiv.org/pdf/2505.14712.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR",
        "gr-qc",
        "math-ph"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01309",
      "title": "Cosmological Constraints on Secluded Dark Radiation",
      "authors": [
        "Jae Hyeok Chang",
        "Peizhi Du",
        "Subhajit Ghosh",
        "Soubhik Kumar"
      ],
      "abstract": "Cosmological Constraints on Secluded Dark Radiation Jae Hyeok Chang, Peizhi Du, Subhajit Ghosh, Soubhik Kumar Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Dark radiation (DR) is ubiquitous in physics beyond the Standard Model (SM), and its interactions with the SM and dark matter (DM) lead to a variety of interesting effects on cosmological observables. However, even in scenarios where DR is 'secluded', i.e., only gravitationally interacting with SM and DM, it can leave discernible signatures. We present a comprehensive study of four different types of DR: free-streaming, self-interacting (coupled), decoupling, and recoupling DR, and vary initial conditions to include both adiabatic and isocurvature perturbations. In addition to these properties, we also vary neutrino energy density, DR energy density, and the SM neutrino masses to perform a general analysis and study degeneracies among neutrino and DR properties. We derive constraints using the cosmic microwave background, large-scale structure, and supernova datasets. We find no significant preference for physics beyond the $\\Lambda$CDM model, but data exhibit interesting interplays between different physical quantities. When the neutrino energy density is allowed to vary, we find that the cosmological dataset prefers massless free-streaming DR over massive neutrinos, leading to a significant relaxation of the neutrino mass bound. Although we do not find any evidence of DR isocurvature, the data show support for a strong blue tilt of the isocurvature power spectrum. Our analysis also highlights the degeneracy of various DR parameters with the Hubble constant $H_0$ resulting in a mild relaxation of the $H_0$ tension.",
      "pdf_url": "https://arxiv.org/pdf/2510.01309.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01430",
      "title": "13 Billion Years of MgII Absorber Evolution",
      "authors": [
        "Christopher W. Churchill , Asif Abbas , Glenn G. Kapcrzak , Nikole M. Nielsen New Mexico State University, Swinburne University of Technology, University of Oklahoma)"
      ],
      "abstract": "13 Billion Years of MgII Absorber Evolution Christopher W. Churchill (1), Asif Abbas (1), Glenn G. Kapcrzak (2), Nikole M. Nielsen (2,3) ((1) New Mexico State University, (2) Swinburne University of Technology, (3) University of Oklahoma) 16 pages, 8 figures, submitted to AAS Journals Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) Applying \"apportioned integrals,\" we use dN/dX measurements to determine the MgII absorber equivalent width distribution function for Wr > 0.03 [angstroms] and 0 < z < 7. Adopting a Schechter distribution, f(z,W)dW = Phi* (W/W*)^alpha e^{-W/W*} dW/W*, we present the normalization, Phi*(z), the characteristic equivalent width, W*(z), and the weak-end slope, alpha(z), as smooth functions of redshift. Measurements of dN/dX are robust for z < 4 but less so at z > 4 for weaker absorbers (Wr < 0.3 [angstroms]). We bracketed two data-driven scenarios: from z ~ 7 to z ~ 4, dN/dX of weak absorbers is (1) constant, or (2) decreasing. For scenario #1, the evolution of Phi*(z), W*(z), and alpha(z) show that in the post-reionization universe, weak systems are nonevolving while the incidence of the strongest systems increases until Cosmic Noon; following Cosmic Noon, the strongest absorbers slowly evolve away while the incidence of weak absorbers rapidly increases. For scenario #2, the parameter evolution is such that, in the post-reionization universe, weak systems evolve away while the incidence of the strongest systems increases until Cosmic Noon; following Cosmic Noon, the behavior tracks the same as scenario #1. We argue in favor of scenario #2 based on corroborating OI, CII, and SiII measurements at z > 4. Our results provide a unified, quantitative description for MgII absorber evolution spanning 13 billion years of cosmic time and offer deeper insights into galactic baryon cycle physics. They also highlight the need for deep z > 5 MgII surveys and have implications for detectability of a MgII forest at z > 7.",
      "pdf_url": "https://arxiv.org/pdf/2510.01430.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01491",
      "title": "Strong Lensing Perturbers from the SIDM Concerto Suite",
      "authors": [
        "Demao Kong",
        "Ethan O. Nadler",
        "Hai-Bo Yu"
      ],
      "abstract": "Strong Lensing Perturbers from the SIDM Concerto Suite Demao Kong, Ethan O. Nadler, Hai-Bo Yu 14 pages, 13 figures, submitted to PRD Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph) Motivated by recent detections of low-mass perturbers in strong gravitational lensing systems, we investigate analogs of these objects in the Concerto suite, a set of cosmological N-body zoom-in simulations of self-interacting dark matter (SIDM) with high-amplitude, velocity-dependent cross sections. We investigate characteristic halo properties relevant to gravitational imaging measurements, focusing on the projected enclosed mass and the central density slope. In SIDM, these quantities evolve continuously through gravothermal processes, spanning core-expansion and core-collapse phases, in sharp contrast to cold dark matter, where they remain nearly static after halo formation. This SIDM evolution further depends on tidal environment and merger history, which can be probed through strong lensing. We also identify simulated SIDM halos whose properties are consistent with the properties of low-mass perturbers inferred from recent observations, and we demonstrate that the core-collapse mechanism offers a compelling explanation for their observed high densities. Our results highlight the potential of strong gravitational lensing as a powerful probe of dark matter self-interactions.",
      "pdf_url": "https://arxiv.org/pdf/2510.01491.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.GA",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02061",
      "title": "Strong-lensing rates of massive black hole binaries in LISA",
      "authors": [
        "Juan Gutiérrez",
        "Macarena Lagos"
      ],
      "abstract": "Strong-lensing rates of massive black hole binaries in LISA Juan Gutiérrez, Macarena Lagos Cosmology and Nongalactic Astrophysics (astro-ph.CO) Similarly to electromagnetic (EM) signals, gravitational lensing by intervening galaxies can also affect gravitational waves (GWs). In this paper, we estimate the strong-lensing rate of massive black hole mergers observed with LISA. Given the uncertainties in the source populations as well as in the population of galaxies at high redshift, we consider: six different source population models, including light and heavy seeds, as well as three lens population models, including redshift-independent and redshift-dependent evolution properties. Among all the scenarios explored, the expected number of strong lensed events detected in a 4-year observation time in LISA ranges between 0.13-231 with most of them having two (one) images detectable in the heavy (light) seed scenarios. The event numbers obtained correspond to 0.2%-0.9% of all detected unlensed events. Out of all the detectable strong-lensed events, up to 61% (in the light-seed scenario) and 1% (in the heavy-seed scenario) of them are above the detectability threshold solely due to strong lensing effects and would otherwise be undetectable. For detectable pairs of strong-lensed events by galaxy lenses, we also find between 72%-81% of them to have time delays from 1 week to 1 year.",
      "pdf_url": "https://arxiv.org/pdf/2510.02061.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.02106",
      "title": "Scalar-induced gravitational waves including isocurvature perturbations with lattice simulations",
      "authors": [
        "Xiang-Xi Zeng"
      ],
      "abstract": "Scalar-induced gravitational waves including isocurvature perturbations with lattice simulations Xiang-Xi Zeng Cosmology and Nongalactic Astrophysics (astro-ph.CO) Scalar-induced gravitational waves (SIGWs) open a unique window into early-universe physics. While their generation from adiabatic perturbations has been extensively studied, the contribution from isocurvature perturbations remains poorly understood. In this work, we develop a lattice simulation framework to compute the stochastic gravitational wave background from both pure isocurvature and mixed initial conditions. Our numerical results show excellent agreement with semi-analytical predictions in the pure isocurvature case. We further analyze multi-peak structures under general initial conditions and find that they closely match those produced in purely adiabatic scenarios. Additionally, we examine SIGWs in early matter-dominated eras, revealing that the peak amplitude and spectral slope are sensitive to the microphysical properties of the dominant field, such as the primordial black hole mass, abundance, or soliton decay rate. This study establishes lattice simulations as a robust tool for predicting SIGW spectra from complex primordial perturbations, with important implications for interpreting current and future gravitational wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2510.02106.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.02144",
      "title": "Angular BAO Measurements with the DESI DR1 BGS Sample",
      "authors": [
        "Paula S. Ferreira",
        "Ulisses Ribeiro",
        "Pedro da Silveira Ferreira",
        "Clécio R. Bom",
        "Armando Bernui"
      ],
      "abstract": "Angular BAO Measurements with the DESI DR1 BGS Sample Paula S. Ferreira, Ulisses Ribeiro, Pedro da Silveira Ferreira, Clécio R. Bom, Armando Bernui Cosmology and Nongalactic Astrophysics (astro-ph.CO) We employ a model-independent approach in both the correlation function estimation and the angular BAO feature estimation by computing the angular two-point correlation function. First, we conducted a series of tests to the available DESI tracers to check their representativeness to angular clustering; the result was that, considering the completeness of the first data release across the footprint, we could only make use of the BGS sample for the effective redshifts 0.21 (BGS1) and 0.25 (BGS2). For a reliable analysis in such low redshift, we consider Lagrangian Perturbation Theory at first order on our mocks, which approximately reproduces the expected non-linearities, and generate the corresponding random catalogues. We use a purely statistical method to correct the projection effects and find that our results show reasonable agreement with the $\\theta_{\\rm BAO}$ expected by the CPL parameters obtained by DESI DR1, being BGS1 $11.78 \\pm 1.12$ degrees and BGS2 $11.81 \\pm 1.20$ degrees. This means a tension at the $1.5\\sigma$ ($2.6\\sigma$) level for BGS1 (BGS2) CPL parametrization, while a $2\\sigma$ ($3.3\\sigma$) discrepancy within the predicted by $\\Lambda$CDM. We conclude that, with the current sample available, the use of an angular correlation function serving as the BAO probe, although prefers the CPL parametrization, does not provide conclusive results regarding the best cosmological model.",
      "pdf_url": "https://arxiv.org/pdf/2510.02144.pdf",
      "categories": [
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01318",
      "title": "Planes of satellites, at once transient and persistent",
      "authors": [
        "Till Sawala University of Helsinki)"
      ],
      "abstract": "Planes of satellites, at once transient and persistent Till Sawala (1) ((1) University of Helsinki) Code and additional data: this https URL Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The appearance of highly anisotropic planes of satellites around the Milky Way and other galaxies was long considered a challenge to the standard cosmological model. Recent simulations have shown such planes to be common, but they have been described as either \"transient\", short-lived alignments, or \"persistent\", long-lived structures. Here we analyse Milky Way analogue systems in the cosmological simulation TNG-50 to resolve this apparent contradiction. We show that, as the satellite populations of individual hosts rapidly change, the observed anisotropies of their satellite systems are invariably short-lived, with lifetimes of no more than a few hundred million years. However, when the progenitors of the same satellites are traced backwards, we find examples where those identified to form a plane at the present day have retained spatial coherence over several Gyr. The two ostensibly conflicting predictions for the lifetimes of satellite planes can be reconciled as two perspectives on the same phenomenon.",
      "pdf_url": "https://arxiv.org/pdf/2510.01318.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01410",
      "title": "Simulating Spectral Confusion in SPHEREx Photometry and Redshifts",
      "authors": [
        "Zhaoyu Huai",
        "James J. Bock",
        "Yun-Ting Cheng",
        "Jean Choppin de Janvry",
        "Sean Bruton",
        "James R. Cheshire IV",
        "Brendan P. Crill",
        "Olivier Doré",
        "Spencer W. Everett",
        "Andreas L. Faisst",
        "Richard M. Feder",
        "Woong-Seob Jeong",
        "Yongjung Kim",
        "Bomee Lee",
        "Daniel C. Masters"
      ],
      "abstract": "Simulating Spectral Confusion in SPHEREx Photometry and Redshifts Zhaoyu Huai, James J. Bock, Yun-Ting Cheng, Jean Choppin de Janvry, Sean Bruton, James R. Cheshire IV, Brendan P. Crill, Olivier Doré, Spencer W. Everett, Andreas L. Faisst, Richard M. Feder, Woong-Seob Jeong, Yongjung Kim, Bomee Lee, Daniel C. Masters 20 pages with 19 figures, submitted to ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We model the impact of source confusion on photometry and the resulting spectrophotometric redshifts for SPHEREx, a NASA Medium-Class Explorer that is carrying out an all-sky near-infrared spectral survey. Spectral confusion from untargeted background galaxies degrades sensitivity and introduces a spectral bias. Using interpolated spectral energy distributions (SEDs) from the COSMOS2020 catalog, we construct a Monte Carlo library of confusion spectra that captures the cumulative impact from faint galaxies. By injecting confusion realizations into galaxy SEDs and performing forced photometry at known source positions, we quantify photometric and redshift error and bias. For our current expected selection of sources for the cosmology analysis, we find typical 1-$\\sigma$ confusion levels range from $0.8-3.8\\ \\mu\\mathrm{Jy}$ across $0.75-5.0\\ \\mu\\mathrm{m}$. While negligible at full-sky survey depth, spectral confusion becomes significant in the SPHEREx deep fields, reducing the number of intermediate-precision redshifts and inducing a small systematic overestimation in redshift. In parallel, we also model targeted source blending from beam overlaps, which contributes additional photometric noise without systematic redshift bias, provided that positions are known exactly. Together, confusion and blending vary with the depth of the selected reference sample, revealing a trade-off, where deeper selections reduce confusion but increase blending-induced noise. Our methodology informs optimization of the SPHEREx deep-field selection strategy and future treatments of stellar source blending and confusion.",
      "pdf_url": "https://arxiv.org/pdf/2510.01410.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01486",
      "title": "Feeding frenzy in the mighty black holes: what we could learn from them?",
      "authors": [
        "Swayamtrupta Panda",
        "Hygor Benati Gonçalves",
        "Thaisa Storchi-Bergmann",
        "Marzena Śniegowska",
        "Bożena Czerny",
        "Edi Bon",
        "Paola Marziani",
        "Nataša Bon",
        "Alberto Rodríguez Ardila",
        "Daniel May",
        "Marcos Fonseca Faría",
        "Luciano Fraga",
        "Francisco Pozo Nuñez",
        "Eduardo Bañados",
        "Jochen Heidt",
        "Karla Garnica",
        "Deborah Dultzin"
      ],
      "abstract": "Feeding frenzy in the mighty black holes: what we could learn from them? Swayamtrupta Panda, Hygor Benati Gonçalves, Thaisa Storchi-Bergmann, Marzena Śniegowska, Bożena Czerny, Edi Bon, Paola Marziani, Nataša Bon, Alberto Rodríguez Ardila, Daniel May, Marcos Fonseca Faría, Luciano Fraga, Francisco Pozo Nuñez, Eduardo Bañados, Jochen Heidt, Karla Garnica, Deborah Dultzin 30 pages, 8 figures, review based on the invited talk at the 15th Serbian Conference on Spectral Line Shapes in Astrophysics Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) Eddington ratio is a paramount parameter governing the accretion history and life cycles of Active Galactic Nuclei (AGNs). This short review presents a multi-faceted view of the importance of the Eddington ratio spanning varied AGN studies. We find that the Eddington ratio is crucial for standardizing the Radius-Luminosity (R-L) relation - a necessary step for employing quasars (QSOs) as standardizable cosmological probes to help clarify the standing of the Hubble tension. In this data-driven era, we consolidated disparate aspects by developing novel relations borne out of large datasets, such as the robust, nearly universal anti-correlation between fractional variability and Eddington ratio derived from Zwicky Transient Facility (ZTF) data, which is vital for interpreting forthcoming high-cadence surveys like Rubin Observatory's LSST. Addressing the conundrum where JWST results suggest an overabundance of massive high-redshift black holes, we demonstrate that local AGNs offer clarification: Changing-Look AGNs (CLAGNs), driven by rapid Eddington ratio shifts, cluster in the low-accretion regime, a rate independently confirmed by our integral field spectroscopy and photoionization modeling of a well-known Seyfert 2 galaxy, rich in high-ionization, forbidden, coronal lines. Conversely, for the high-redshift, high-luminosity population where traditional reverberation mapping (RM) is highly impractical, photometric reverberation mapping (PRM) offers a rapid alternative to constrain accretion disk sizes, enabling efficient estimates of black hole masses and Eddington ratios. Finally, we developed tailored semi-empirical spectral energy distributions (SEDs) for extremely high-accretion quasars, successfully validating their characteristic extreme physical conditions.",
      "pdf_url": "https://arxiv.org/pdf/2510.01486.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01972",
      "title": "The Disk Plus (Failed) Wind System of 3C 47: A Story of Accretion Disks and Binary Black Holes",
      "authors": [
        "P. Marziani",
        "S. Terefe Mengistue",
        "A. del Olmo",
        "M. Povič",
        "J. Perea",
        "S. Komossa",
        "E. Bon",
        "N. Bon",
        "L. Č. Popovič",
        "A. Deconto-Machado",
        "I. Marquez",
        "M. A. Martínez Carballo"
      ],
      "abstract": "The Disk Plus (Failed) Wind System of 3C 47: A Story of Accretion Disks and Binary Black Holes P. Marziani, S. Terefe Mengistue, A. del Olmo, M. Povič, J. Perea, S. Komossa, E. Bon, N. Bon, L. Č. Popovič, A. Deconto-Machado, I. Marquez, M. A. Martínez Carballo 16 pages, 7 figures, accepted by AISR Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) [Abridged] Optically thick, geometrically thin accretion disks around supermassive black holes are thought to contribute to broad-line emission in type-1 active galactic nuclei (AGN). However, observed emission line profiles most often deviate from those expected from a rotating disk. This report examines the role of accretion disks in broad-line emission of Population B AGN characterized by relatively low accretion rates in which broad lines show large redward asymmetry both in H$\\beta$ and Mg II$\\lambda$ 2800. An unbiased comparison matching black hole mass and Eddington ratio suggests that the most powerful radio-loud quasars show the highest red-ward asymmetries in H$\\beta$. These shifts can be accounted for by gravitational and transverse redshift effects, especially for black hole masses larger than $\\approx$10$^{8.7}$ M$_\\odot$. The analysis of the extremely jetted quasar 3C 47 adds another piece to the puzzle: not only are the low ionization profiles of 3C 47 well-described by a relativistic Keplerian accretion disk model, with line emission in the range 100 - 1,000 gravitational radii, but also the high-ionization line profiles can be understood as a combination of disk plus a failed wind contribution that is in turn hiding the disk emission. Constraints on radio properties and line profile variability suggest that 3C 47 might involve the presence of a second black hole with secondary-to-primary mass ratio $\\sim$ 0.5. We conjecture that the double peakers - type-1 AGN with Balmer line profiles consistent with accretion disk emission - might have their emission truncated by the sweeping effect of a second black hole. In non-starving systems, the disk signal is plausibly masked by additional line emission, rendering the disk contribution harder to detect.",
      "pdf_url": "https://arxiv.org/pdf/2510.01972.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02130",
      "title": "In-situ globular clusters in alternative dark matter Milky Way galaxies: a first approach to fuzzy and core-like dark matter theories",
      "authors": [
        "Pierre Boldrini",
        "Paola Di Matteo"
      ],
      "abstract": "In-situ globular clusters in alternative dark matter Milky Way galaxies: a first approach to fuzzy and core-like dark matter theories Pierre Boldrini, Paola Di Matteo 14 pages, 9 figures. Submitted to A&A Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We present a first analysis of the dynamics of in-situ globular clusters (GCs) in Milky Way (MW)-like galaxies embedded in fuzzy dark matter (FDM) halos, combining cosmological assembly histories from the TNG50 simulation with dedicated orbital integrations and analytical models. GC populations are initialized with identical distributions in normalized $E$-$L_{z}$ in matched CDM and FDM halos. In a universe dominated by FDM, we identify three distinct regimes for the in-situ GC population depending on the particle mass $m_{22} \\equiv m_{\\chi}/ 10^{-22}~\\mathrm{eV}$. For $m_{22} < 7$, baryons dominate the inner potential, which remains steep and centrally concentrated, confining GC orbits to a narrow region and producing less massive, more compact systems than in CDM. For $m_{22} \\sim 7$, GC properties resemble those in CDM, with similar mass and spatial distributions. For $m_{22} > 7$, the dark matter becomes both compact and globally dominant, generating a deeper and more extended gravitational potential that supports a wider range of stable GC orbits, resulting in more massive and spatially extended GC systems. Finally, we extend our framework to make predictions for GC populations in alternative DM models, including warm dark matter and self-interacting dark matter, in both MW-like and dwarf galaxies. Our findings demonstrate that in-situ GC systems offer a sensitive and independent probe of the underlying DM physics, opening new avenues for observational constraints with upcoming Euclid.",
      "pdf_url": "https://arxiv.org/pdf/2510.02130.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02247",
      "title": "Measurement of Dark Matter Substructure from the Kinematics of the GD-1 Stellar Stream",
      "authors": [
        "Jacob Nibauer",
        "Ana Bonaca",
        "Adrian M. Price-Whelan",
        "David N. Spergel",
        "Jenny E. Greene"
      ],
      "abstract": "Measurement of Dark Matter Substructure from the Kinematics of the GD-1 Stellar Stream Jacob Nibauer, Ana Bonaca, Adrian M. Price-Whelan, David N. Spergel, Jenny E. Greene 20 pages, 12 figures. Submitted. Comments welcome Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Stellar streams are sensitive tracers of low-mass dark matter subhalos and provide a means to test the Cold Dark Matter (CDM) paradigm on small scales. In this work, we connect the intrinsic velocity dispersion of the GD-1 stream to the number density and internal structure of dark matter subhalos in the mass range $10^5$-$10^9\\ M_\\odot$. We measure the radial velocity dispersion of GD-1 based on 160 identified member stars across four different spectroscopic catalogs. We use repeat observations of the same stars to constrain binarity. We find that the stream's intrinsic radial velocity dispersion ranges from approximately 2-5 km/s across its length. The region of GD-1 with the highest velocity dispersion represents a $4\\sigma$ deviation from unperturbed stream models formed in a smooth Milky Way potential, which are substantially colder. We use perturbation theory to model the stream's velocity dispersion as a function of dark matter subhalo population parameters, including the number of low-mass subhalos in the Milky Way, the dark matter half-mode mass, and the mass-concentration relation of subhalos. We find that the observed velocity dispersion can be explained by numerous impacts with low-mass dark matter subhalos, or by a single impact with a very compact subhalo with $M \\gtrsim 10^8\\ M_\\odot$. Our constraint on the fraction of mass in subhalos is $f_{\\mathrm{sub}} = 0.05^{+0.08}_{-0.03}$ (68\\% confidence). In both scenarios, our model prefers subhalos that are more compact compared to CDM mass-size expectations. These results suggest a possible deviation from CDM at low subhalo masses, which may be accounted for by dark matter self-interactions that predict higher concentrations in lower-mass subhalos.",
      "pdf_url": "https://arxiv.org/pdf/2510.02247.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.02663",
      "title": "The three phases of self-gravitating scalar field ground states",
      "authors": [
        "Anthony E. Mirasola",
        "Nathan Musoke",
        "Mark C. Neyrinck",
        "Chanda Prescod-Weinstein",
        "J. Luna Zagorac"
      ],
      "abstract": "The three phases of self-gravitating scalar field ground states Anthony E. Mirasola, Nathan Musoke, Mark C. Neyrinck, Chanda Prescod-Weinstein, J. Luna Zagorac Longer version for submission to JCAP Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) It is generally assumed that scalar field dark matter halos would contain solitonic cores -- spherically symmetric ground state configurations -- at their centers. This is especially interesting in the case of ultralight dark matter (ULDM), where the solitons sizes are on the order of galaxies. In this work, we show that the paradigm of a spherically symmetric soliton embedded in the center of each halo is not universally valid in a scenario with multiple interacting scalar fields. In particular, sufficiently strong repulsive interspecies interactions make the fields immiscible. In such models, the ground state configuration can fall into a number of different phases that depend on the fields' relative densities, masses, and interaction strengths. This raises the possibility that the inner regions of ULDM halos are more complex and diverse than previously assumed.",
      "pdf_url": "https://arxiv.org/pdf/2410.02663.pdf",
      "categories": [
        "astro-ph.CO",
        "hep-ph"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.15486",
      "title": "Cosmic curl -- Features and convergence of the vorticity power spectrum in $N$-body simulations",
      "authors": [
        "Camilla T. G. Sørensen",
        "Steen Hannestad",
        "Thomas Tram"
      ],
      "abstract": "Cosmic curl -- Features and convergence of the vorticity power spectrum in $N$-body simulations Camilla T. G. Sørensen, Steen Hannestad, Thomas Tram Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Observations of the cosmic velocity field could become an important cosmological probe in the near future. To take advantage of future velocity-flow surveys we must however have the theoretical predictions under control. In many respects, the velocity field is easier to simulate than the density field because it is less severely affected by small-scale clustering. Therefore, as we also show in this paper, a particle-mesh (PM) based simulation approach is usually sufficient, yielding results within a few percent of a corresponding P$^3$M simulation in which short-range forces are properly accounted for, but which also carry a much larger computational cost. However, in other respects the velocity field is much more challenging to deal with than the density field: Interpolating the velocity field onto a grid is significantly more complicated, and the vorticity field (the curl-part of the velocity field) is severely affected by both sample variance and discretisation effects. While the former can be dealt with using fixed amplitude initial conditions, the former makes it infeasible to run fully converged simulations in a cosmological volume. However, using the $N$-body code CONCEPT we show that one can robustly extrapolate the cosmic vorticity power spectrum from just 4 simulations with different number of particles. We expect our extrapolated vorticity power spectra to be correct within 5\\% of the fully converged result across three orders of magnitude in $k$. Finally, we have also investigated the time dependence of the vorticity as well as the ratio of vorticity to divergence.",
      "pdf_url": "https://arxiv.org/pdf/2506.15486.pdf",
      "categories": [
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.CO",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2411.14383",
      "title": "Not Just a Dot: the complex UV morphology and underlying properties of Little Red Dots",
      "authors": [
        "P. Rinaldi",
        "N. Bonaventura",
        "G. H. Rieke",
        "S. Alberts",
        "K. I. Caputi",
        "W. M. Baker",
        "S. Baum",
        "R. Bhatawdekar",
        "A. J. Bunker",
        "S. Carniani",
        "E. Curtis-Lake",
        "F. D'Eugenio",
        "E. Egami",
        "Z. Ji",
        "K. Hainline",
        "J. M. Helton",
        "X. Lin",
        "J. Lyu",
        "B. D. Johnson",
        "Z. Ma",
        "R. Maiolino",
        "P. G. Pérez-González",
        "M. Rieke",
        "B. E. Robertson",
        "I. Shivaei",
        "M. Stone",
        "Y. Sun",
        "S. Tacchella",
        "H. Übler",
        "C. C. Williams",
        "C. N. A. Willmer",
        "C. Willott",
        "J. Zhang",
        "Y. Zhu"
      ],
      "abstract": "Not Just a Dot: the complex UV morphology and underlying properties of Little Red Dots P. Rinaldi, N. Bonaventura, G. H. Rieke, S. Alberts, K. I. Caputi, W. M. Baker, S. Baum, R. Bhatawdekar, A. J. Bunker, S. Carniani, E. Curtis-Lake, F. D'Eugenio, E. Egami, Z. Ji, K. Hainline, J. M. Helton, X. Lin, J. Lyu, B. D. Johnson, Z. Ma, R. Maiolino, P. G. Pérez-González, M. Rieke, B. E. Robertson, I. Shivaei, M. Stone, Y. Sun, S. Tacchella, H. Übler, C. C. Williams, C. N. A. Willmer, C. Willott, J. Zhang, Y. Zhu 28 pages, 10 figures, 3 tables. Accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We analyze 99 photometrically selected Little Red Dots (LRDs) at $z \\approx 4-8$ in the GOODS fields, leveraging ultra-deep JADES NIRCam short-wavelength (SW) data. We examine the morphology of 30 LRDs, while the remaining 69 appear predominantly compact, with sizes $\\leq 400$ pc and no extended components even in stacked SW images. However, their unresolved nature may partly reflect current depth limitations, which could prevent the detection of faint diffuse components. Among the 30 morphologically analyzed LRDs, 50% show multiple associated components, while the rest exhibit highly asymmetric structures, despite appearing as single sources. This diversity in rest-frame UV morphologies may point to interactions or strong internal feedback. We find median stellar masses of $\\log_{10}(M_{\\star}/M_{\\odot}) = 9.07_{-0.08}^{+0.11}$ for pure stellar models with $A_{V} \\approx 1.16^{+0.11}{-0.21}$ mag, and $\\log{10}(M_{\\star}/M_{\\odot}) = 9.67^{+0.17}{-0.27}$ for models including AGNs with $A{V} \\approx 2.74^{+0.55}_{-0.71}$ mag, in line with recent studies suggesting higher masses and dust content for AGN-fitted LRDs. NIRSpec spectra are available for 15 sources, six of which are also in the morphological sample. Broad H$\\alpha$ is detected in 40% (FWHM = 1200-2900 km/s), and one source shows broad H$\\beta$ emission. Emission line ratios indicate a composite nature, consistent with both AGN and stellar processes. Altogether, these results suggest that LRDs are a mixed population, and their rest-frame UV morphology reflects this complexity. Morphological studies of larger samples could provide a new way to understand what drives their properties and evolution.",
      "pdf_url": "https://arxiv.org/pdf/2411.14383.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.18618",
      "title": "ΛCDM is still not broken: empirical constraints on the star formation efficiency at z ~ 12-30",
      "authors": [
        "L. Y. Aaron Yung",
        "Rachel S. Somerville",
        "Kartheik G. Iyer"
      ],
      "abstract": "ΛCDM is still not broken: empirical constraints on the star formation efficiency at z ~ 12-30 L. Y. Aaron Yung, Rachel S. Somerville, Kartheik G. Iyer 12 pages, 9 figures, accepted for publication in MNRAS Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The James Webb Space Telescope continues to push back the redshift frontier to ever earlier cosmic epochs, with recent announcements of galaxy candidates at redshifts of $15 \\lesssim z \\lesssim 30$. We leverage the recent GUREFT suite of dissipationless $N$-body simulations, which were designed for interpreting observations in the high redshift Universe, and provide predictions of dark matter halo mass functions and halo growth rates for a state-of-the-art cosmology over a wide range of halo masses from $6 < z< 30$. We combine these results with an empirical framework that maps halo growth rate to galaxy star formation rate and then to rest-frame UV luminosity. We find that even if all of the photometrically selected $15 \\lesssim z \\lesssim 30$ galaxy candidates are real and actually at these extreme redshifts, there is no fundamental tension with $\\Lambda$CDM, nor are exotic explanations required. With stellar light-to-mass ratios similar to those in well-studied lower redshift galaxies, our simple model can account for the observed extreme ultra-high redshift populations with star formation efficiencies that peak at values of 20-65 percent. Bursty star formation, or higher light-to-mass ratios such as are expected for lower metallicity stellar populations or a top-heavy Initial Mass Function, would result in even lower required star formation efficiencies, comparable to values predicted by high resolution numerical simulations of high-surface density star forming clouds.",
      "pdf_url": "https://arxiv.org/pdf/2504.18618.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.02284",
      "title": "The dark matter content of Milky Way dwarf spheroidal galaxies: Draco, Sextans and Ursa Minor",
      "authors": [
        "Hao Yang",
        "Wenting Wang",
        "Ling Zhu",
        "Ting S. Li",
        "Sergey E. Koposov",
        "Jiaxin Han",
        "Songting Li",
        "Rui Shi",
        "Monica Valluri",
        "Alexander H. Riley",
        "Arjun Dey",
        "Constance Rockosi",
        "Carles G. Palau",
        "Jessica Nicole Aguilar",
        "Steven Ahlen",
        "David Brooks",
        "Todd Claybaugh",
        "Andrew Cooper",
        "Axel de la Macorra",
        "Peter Doel",
        "Simone Ferraro",
        "Jaime E. Forero-Romero",
        "Enrique Gaztañaga",
        "Satya Gontcho A Gontcho",
        "Alma Xochitl Gonzalez Morales",
        "Gaston Gutierrez",
        "Julien Guy",
        "Klaus Honscheid",
        "Mustapha Ishak",
        "Dick Joyce",
        "Robert Kehoe",
        "Theodore Kisner",
        "Namitha Kizhuprakkat",
        "Anthony Kremin",
        "Ofer Lahav",
        "Martin Landriau",
        "Laurent Le Guillou",
        "Gustavo E. Medina",
        "Aaron Meisner",
        "Ramon Miquel",
        "Nathalie Palanque-Delabrouille",
        "Francisco Prada",
        "Ignasi Pérez-Ràfols",
        "Graziano Rossi",
        "Eusebio Sanchez",
        "David Schlegel",
        "Michael Schubnell",
        "Joseph Harry Silber",
        "David Sprayberry",
        "Gregory Tarlé",
        "Benjamin Alan Weaver",
        "Rongpu Zhou",
        "Hu Zou"
      ],
      "abstract": "The dark matter content of Milky Way dwarf spheroidal galaxies: Draco, Sextans and Ursa Minor Hao Yang, Wenting Wang, Ling Zhu, Ting S. Li, Sergey E. Koposov, Jiaxin Han, Songting Li, Rui Shi, Monica Valluri, Alexander H. Riley, Arjun Dey, Constance Rockosi, Carles G. Palau, Jessica Nicole Aguilar, Steven Ahlen, David Brooks, Todd Claybaugh, Andrew Cooper, Axel de la Macorra, Peter Doel, Simone Ferraro, Jaime E. Forero-Romero, Enrique Gaztañaga, Satya Gontcho A Gontcho, Alma Xochitl Gonzalez Morales, Gaston Gutierrez, Julien Guy, Klaus Honscheid, Mustapha Ishak, Dick Joyce, Robert Kehoe, Theodore Kisner, Namitha Kizhuprakkat, Anthony Kremin, Ofer Lahav, Martin Landriau, Laurent Le Guillou, Gustavo E. Medina, Aaron Meisner, Ramon Miquel, Nathalie Palanque-Delabrouille, Francisco Prada, Ignasi Pérez-Ràfols, Graziano Rossi, Eusebio Sanchez, David Schlegel, Michael Schubnell, Joseph Harry Silber, David Sprayberry, Gregory Tarlé, Benjamin Alan Weaver, Rongpu Zhou, Hu Zou 24 pages, 13 figures. v2: Accepted for publication in ApJ. v3: References updated Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The Milky Way Survey of the Dark Energy Spectroscopic Instrument (DESI) has so far observed three classical dwarf spheroidal galaxies (dSphs): Draco, Sextans and Ursa Minor. Based on the observed line-of-sight velocities and metallicities of their member stars, we apply the axisymmetric Jeans Anisotropic Multi-Gaussian Expansion modeling (JAM) approach to recover their inner dark matter distributions. In particular, both the traditional single-population Jeans model and the multiple population chemodynamical model are adopted. With the chemodynamical model, we divide member stars of each dSph into metal-rich and metal-poor populations. The metal-rich populations are more centrally concentrated and dynamically colder, featuring lower velocity dispersion profiles than the metal-poor populations. We find a diversity of the inner density slopes $\\gamma$ of dark matter halos, with the best constraints by single-population or chemodynamical models consistent with each other. The inner density slopes are $0.71^{+0.34}_{-0.35}$, $0.26^{+0.22}_{-0.12}$ and $0.33^{+0.20}_{-0.16}$ for Draco, Sextans and Ursa Minor, respectively. We also present the measured astrophysical J and D factors of the three dSphs. Our results indicate that the study of the dark matter content of dSphs through stellar kinematics is still subject to uncertainties behind both the methodology and the observed data, through comparisons with previous measurements and data sets.",
      "pdf_url": "https://arxiv.org/pdf/2507.02284.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.19581",
      "title": "Efficient semi-analytic modelling of Pop III star formation from Cosmic Dawn to Reionization",
      "authors": [
        "Sahil Hegde",
        "Steven R. Furlanetto"
      ],
      "abstract": "Efficient semi-analytic modelling of Pop III star formation from Cosmic Dawn to Reionization Sahil Hegde, Steven R. Furlanetto 23+3 pages, 15+3 figures; Published in the Open Journal of Astrophysics Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The quest to find the first stars has driven astronomers across cosmic time, from hopes to identify their signatures in their heyday at cosmic dawn to deep searches for their remnants in our local neighborhood. Such work crucially relies on robust theoretical modelling to understand when and where we expect pristine star formation to have occurred and survived. To that end, here we introduce an analytic bathtub for cosmic dawn, the abcd model, to efficiently trace the formation of the first stars from their birth through the first billion years of our universe's history, jointly following star formation out of pristine and metal-enriched gas over time. Informed by the latest theoretical developments in our understanding of star formation in molecular cooling halos, metal mixing, and early galaxies, we expand pre-existing minimal models for galaxy formation to include Population III stars and many of the processes - both internal and environmental - affecting their evolution, while remaining fast and interpretable. With this framework, we can bridge the gap between numerical simulations and previous semi-analytic models, as we self-consistently follow star formation in dark matter halos from the minihalo era through the epoch of reionization, finding that, under plausible physical conditions, pristine star formation can persist at a high level in the presence of Pop II star formation down to $z\\sim 5$, but is limited to the most massive halos. We highlight areas of theoretical uncertainty in the physics underpinning Pop III star formation and demonstrate the effects of this uncertainty first on individual star formation histories and subsequently bracketing the range of global star formation levels we expect. Finally, we leverage this model to make preliminary observable predictions, generating forecasts for high-$z$ luminosity functions, transient rates, and the 21-cm global signal.",
      "pdf_url": "https://arxiv.org/pdf/2507.19581.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.CO"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01207",
      "title": "Probing the accreting millisecond X-ray pulsar SAX J1808.4-3658 using the evolution of its spectral and aperiodic timing properties",
      "authors": [
        "Aman Kaushik",
        "Yash Bhargava",
        "Sudip Bhattacharyya",
        "Maurizio Falanga"
      ],
      "abstract": "Probing the accreting millisecond X-ray pulsar SAX J1808.4-3658 using the evolution of its spectral and aperiodic timing properties Aman Kaushik (TIFR, India), Yash Bhargava (TIFR, India), Sudip Bhattacharyya (TIFR, India), Maurizio Falanga (ISSI, Switzerland and University of Bern, Switzerland) Accepted for publication in ApJ, 19 pages, 3 tables, 8 figures High Energy Astrophysical Phenomena (astro-ph.HE) Understanding accretion components in neutron star (NS) low mass X-ray binary (LMXB) systems is important to probe fundamental aspects of accretion mechanism and evolution of the system constraining its physical properties. Here, we present spectral and aperiodic timing analyses of the NICER and AstroSat data from the accretion powered millisecond X-ray pulsar (AMXP) SAX J1808.4-3658 during its 2022 outburst. We find that emissions from a softer accretion disk and a harder, centrally located, compact, partially covering, Comptonizing corona explains the continuum spectra from the source throughout the outburst. The disk inner edge temperature, the coronal electron temperature and photon index are found to be around ~ 0.5-0.9 keV, a few keV and ~ 1.1-1.8, respectively, during the entire outburst. We also find an intrinsic atomic hydrogen medium in the system, which substantially and systematically evolved throughout the outburst. We detect two broadband aperiodic features (~ 0.004-2 Hz; ~ 10-100 Hz), with the former having a significant hard lag of ~ 11 ms between 1.5-10.0 keV and 0.5-1.5 keV photons. We conclude that both the disk photons and the photons up-scattered by the corona contributed to each aperiodic feature, with the disk and the corona contributing more to the low and high frequency ones, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2510.01207.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01208",
      "title": "Spin period evolution and X-ray spectral characteristics of the SMC pulsar SXP 46.6",
      "authors": [
        "Aman Kaushik",
        "Sayantan Bhattacharya",
        "Sudip Bhattacharyya"
      ],
      "abstract": "Spin period evolution and X-ray spectral characteristics of the SMC pulsar SXP 46.6 Aman Kaushik (TIFR, India), Sayantan Bhattacharya (TIFR, India), Sudip Bhattacharyya (TIFR, India and MIT, USA) Accepted for publication in PRD, 10 pages, 8 figures, 1 table High Energy Astrophysical Phenomena (astro-ph.HE) We characterize the Small Magellanic Cloud (SMC) pulsar SXP 46.6 using NuSTAR observations conducted in 2017. The spin period (P) of this neutron star decreased from its discovered value of 46.6 s to a value of 45.984(1) s, indicating a spin-up at the rate of \\dot{P} = -1.13 x 10^{-9} s s^{-1}. This spin-up rate is used to calculate a high pulsar magnetic field value of 2.25 x 10^{13} G. This process also gives a low magnetic field value, which we rule out here by constraining the inner accretion disk radius to be less than the radius of the innermost stable circular orbit. The pulse profile, analyzed in soft, hard, and broad X-ray bands, shows a double-peaked structure, consistent with pencil beam emission from two antipodal hot spots on the neutron star surface. We also perform spin phase-resolved spectroscopy for the first time, revealing spectral variations across different phases of the pulsar's rotation. These results offer new insights into the long-term spin evolution and emission properties of SXP 46.6.",
      "pdf_url": "https://arxiv.org/pdf/2510.01208.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01338",
      "title": "Infrared Synchrotron Emission in the Soft State of GX 339-4 and the Mid-Infrared/X-ray Luminosity Plane of Black Hole X-ray Binaries",
      "authors": [
        "P. Gandhi",
        "D.M. Russell",
        "M.C. Baglio",
        "Y. Bhargava",
        "R. Duncan",
        "A. Gúrpide",
        "C.O. Heinke",
        "C. Knigge",
        "K.S. Long",
        "T.J. Maccarone",
        "G. Mastroserio",
        "T.D. Russell",
        "A.W. Shaw",
        "A.J. Tetarenko",
        "F.M. Vincentelli",
        "E.S. Borowski",
        "D.A.H. Buckley",
        "P. Casella",
        "C. Dashwood Brown",
        "G.C. Dewangan",
        "R.I. Hynes",
        "S. Markoff",
        "J.A. Tomsick",
        "K. Alabarta",
        "F. Carotenuto",
        "E. Carver",
        "N. Castro-Segura",
        "P. Charles",
        "F. Lewis",
        "J.A. Paice",
        "D. Pawar",
        "M.E. Ressler",
        "S.K. Rout",
        "P. Saikia",
        "T. Shahbaz",
        "G.R. Sivakoff"
      ],
      "abstract": "Infrared Synchrotron Emission in the Soft State of GX 339-4 and the Mid-Infrared/X-ray Luminosity Plane of Black Hole X-ray Binaries P. Gandhi, D.M. Russell, M.C. Baglio, Y. Bhargava, R. Duncan, A. Gúrpide, C.O. Heinke, C. Knigge, K.S. Long, T.J. Maccarone, G. Mastroserio, T.D. Russell, A.W. Shaw, A.J. Tetarenko, F.M. Vincentelli, E.S. Borowski, D.A.H. Buckley, P. Casella, C. Dashwood Brown, G.C. Dewangan, R.I. Hynes, S. Markoff, J.A. Tomsick, K. Alabarta, F. Carotenuto, E. Carver, N. Castro-Segura, P. Charles, F. Lewis, J.A. Paice, D. Pawar, M.E. Ressler, S.K. Rout, P. Saikia, T. Shahbaz, G.R. Sivakoff High Energy Astrophysical Phenomena (astro-ph.HE) Progress in understanding the growth of accreting black holes remains hampered by a lack of sensitive coordinated multiwavelength observations. In particular, the mid-infrared (MIR) regime remains ill-explored except for jet-dominant states. Here, we present comprehensive follow-up of the black hole X-ray binary GX 339-4 during a disc-dominated state in its 2023/24 outburst as part of a multi-wavelength campaign coordinated around JWST/MIRI. The X-ray properties are fairly typical of soft accretion states, with a high-energy Comptonised tail. The source is significantly detected between 5-10$\\mu$m, albeit at a faint flux level requiring MIR compact jet emission to be quenched by a factor of $\\sim$300 or more relative to previous hard-state detections. The MIRI spectrum can be described as a simple power-law with slope $\\alpha$ = +0.39$\\pm$0.07 ($F_\\nu$ $\\propto$ $\\nu^\\alpha$), but surprisingly matches neither the radio/sub-mm nor the optical broadband slopes. Significant MIR stochastic variability is detected. Synchrotron radiation from the same medium responsible for high-energy Comptonisation can self-consistently account for the observed MIRI spectral-timing behaviour, offering new constraints on the physical conditions in the soft-state accretion disc atmosphere/corona. Alternative explanations, including a circumbinary disc or emission from a warm wind, fail to cleanly explain either the spectral properties or the variability. Multiwavelength timing cross-correlations show a puzzlingly long MIR lag relative to the optical, though at limited significance. We compile archival MIR and X-ray luminosities of transient black hole systems, including previously unreported detections of GX 339-4. These trace the evolution of the MIR-to-X-ray flux ratio with accretion state, and also reveal high MIR luminosities for GX 339-4 across all states. (abridged)",
      "pdf_url": "https://arxiv.org/pdf/2510.01338.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01340",
      "title": "Discovery of diffuse gamma-ray emission in the vicinity of G172.8+1.5: An old supernova remnant with different turbulence properties",
      "authors": [
        "Yuan Li",
        "Gwenael Giacinti",
        "Siming Liu"
      ],
      "abstract": "Discovery of diffuse gamma-ray emission in the vicinity of G172.8+1.5: An old supernova remnant with different turbulence properties Yuan Li, Gwenael Giacinti, Siming Liu 14 pages, 7 figures. Submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We report the detection of high-energy $\\gamma$-ray emission in the vicinity of G172.8+1.5, which is debated as a Supernova remnant (SNR) or an ionized hydrogen (H$_{\\rm{II}}$) region. Using 16-yr Pass 8 data from Fermi Large Area Telescope (Fermi-LAT), we found the GeV emission can be described by two extended sources with different photon spectra. Among them, the much more extended $\\gamma$-ray source SrcA with a Power-law spectrum is spatially coincident with a giant neutral Hydrogen shell structure and several OB stars inside a huge H$_{\\rm{II}}$ region. The softer Log-Parabola spectra $\\gamma$-ray source SrcB is spatially coincident with a star-forming region with several OB stars, maser sources and IR sources. Gas observation results display a dense molecular cloud surrounding SrcB in the velocity range of [-25,-5] km s$^{-1}$. The possible origins of $\\gamma$-ray emission are discussed, including CRs escaped from SNR shock surface and illuminated nearby MC, the young massive star clusters associated with the star-forming region and a pulsar halo generated by an invisible energetic pulsar inside the SNR. Furthermore, under the hadronic scenario, the measured diffusion coefficient in the compact SrcB region is significantly lower than that of the more extended SrcA. This suppression is likely attributed to cosmic-ray-driven instabilities, which reduce the diffusion efficiency in the vicinity of the source relative to the standard conditions in the interstellar medium (ISM). Future advanced analysis from LHAASO observation results would help distinguish the origins of $\\gamma$-ray emission in this region and clarify the nature of this source.",
      "pdf_url": "https://arxiv.org/pdf/2510.01340.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01369",
      "title": "Microquasars as the major contributors to Galactic cosmic rays around the \"knee\"",
      "authors": [
        "Samy Kaci",
        "Gwenael Giacinti",
        "Felix Aharonian",
        "Jie-Shuang Wang"
      ],
      "abstract": "Microquasars as the major contributors to Galactic cosmic rays around the \"knee\" Samy Kaci, Gwenael Giacinti, Felix Aharonian, Jie-Shuang Wang High Energy Astrophysical Phenomena (astro-ph.HE) Recently, LHAASO detected a gamma-ray emission extending beyond $100\\,\\rm{TeV}$ from 4 sources associated to powerful microquasars. We propose that such sources are the main Galactic PeVatrons and investigate their contribution to the proton and gamma-ray fluxes by modeling their entire population. We find that the presence of only $\\sim10$ active powerful microquasars in the Galaxy at any given time is sufficient to account for the proton flux around the knee and to provide a very good explanation of cosmic-ray and gamma-ray data in a self-consistent picture. The $10\\,\\rm{TeV}$ bump and the $300\\,\\rm{TeV}$ hardening in the cosmic-ray spectrum naturally appear, and the diffuse background measured by LHAASO above a few tens of $\\rm{TeV}$ is accounted for. This supports the paradigm in which cosmic rays around the knee are predominantly accelerated in a very limited number of powerful microquasars.",
      "pdf_url": "https://arxiv.org/pdf/2510.01369.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01476",
      "title": "Pinpointing the location of the gamma-ray emitting region in the FSRQ 4C+01.28",
      "authors": [
        "F. Rösch",
        "M. Kadler",
        "E. Ros",
        "L. Ricci",
        "M. A. Gurwell",
        "T. Hovatta",
        "N. R. MacDonald",
        "A. C. S. Readhead"
      ],
      "abstract": "Pinpointing the location of the gamma-ray emitting region in the FSRQ 4C+01.28 F. Rösch, M. Kadler, E. Ros, L. Ricci, M. A. Gurwell, T. Hovatta, N. R. MacDonald, A. C. S. Readhead High Energy Astrophysical Phenomena (astro-ph.HE) The FSRQ 4C+01.28 is a bright and highly variable radio and $\\gamma$-ray emitter. We aim to pinpoint the location of the $\\gamma$-ray emitting region within its jet in order to derive strong constraints on $\\gamma$-ray emission models for blazar jets. We use radio and $\\gamma$-ray data obtained with ALMA, OVRO, SMA and Fermi/LAT to study the cross-correlation between $\\gamma$-ray and multi-frequency radio light curves. Moreover, we employ VLBA observations at 43 GHz over a period of around nine years to study the parsec-scale jet kinematics. To pinpoint the location of the $\\gamma$-ray emitting region, we use a model in which outbursts shown in the $\\gamma$-ray and radio light curves are produced when moving jet components pass through the $\\gamma$-ray emitting and the radio core regions. We find two bright and compact newly ejected jet components that are likely associated with a high activity period visible in the $\\gamma$-ray and radio light curves. The kinematic analysis of the VLBA observations leads to a maximum apparent jet speed of $\\beta_{app}=19\\pm10$ and an upper limit on the viewing angle of $\\phi$ < 4 deg. We determine the power law indices that are characterizing the jet geometry, brightness temperature distribution, and core shift to be $l=0.974\\pm0.098$, $s=-3.31\\pm0.31$, and $k_r=1.09\\pm0.17$, which are in agreement with a conical jet in equipartition. A cross-correlation analysis shows that the radio light curves follow the $\\gamma$-ray light curve. We pinpoint the location of the $\\gamma$-ray emitting region with respect to the jet base to the range of $2.6\\,\\mathrm{pc}\\leq d_\\gamma\\leq20\\,\\mathrm{pc}$. Our derived observational limits places the location of $\\gamma$-ray production in 4C+01.28 beyond the expected extent of the broad-line region (BLR) and therefore challenges blazar-emission models that rely on inverse Compton up-scattering of seed photons from the BLR.",
      "pdf_url": "https://arxiv.org/pdf/2510.01476.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01739",
      "title": "Exploring GRB Afterglows in the TeV Era: New Diagnostics of Particle Acceleration",
      "authors": [
        "L. Foffano",
        "M. Tavani"
      ],
      "abstract": "Exploring GRB Afterglows in the TeV Era: New Diagnostics of Particle Acceleration L. Foffano, M. Tavani Proceedings of the 39th International Cosmic Ray Conference -ICRC2025-, Geneva, Switzerland High Energy Astrophysical Phenomena (astro-ph.HE) The TeV gamma-ray band is essential for probing the most extreme particle acceleration processes in the Universe. The recent detections of gamma-ray bursts (GRBs) at these energies offer an incredible opportunity to investigate the origins of such transient events in an unprecedented way. In this presentation, we analyze the afterglows of these GRBs by modeling their synchrotron and inverse Compton emission within an optimized relativistic fireball framework. By comparing observational data with theoretical predictions, we constrain key model parameters and track their temporal evolution. The comparison of different TeV-detected GRBs reveals an intriguing variety among them, potentially reflecting differences in the particle acceleration processes that have to be very fast and able to accelerate to large energies. We discuss how late-time afterglow observations of X-ray and GeV-TeV emissions are crucial for providing diagnostics into the physics of GRBs. At this scope, we also present the most updated results of the AGILE telescope, which support our interpretation. Finally, we highlight theoretical predictions for future TeV observations and their implications for understanding these extreme cosmic explosions.",
      "pdf_url": "https://arxiv.org/pdf/2510.01739.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01742",
      "title": "Instabilities at recollimation shocks in MHD jets",
      "authors": [
        "Stella Boula",
        "Fabrizio Tavecchio",
        "Gianluigi Bodo",
        "Nektarios Vlahakis",
        "Paolo Coppi",
        "Agnese Costa",
        "Alberto Sciaccaluga"
      ],
      "abstract": "Instabilities at recollimation shocks in MHD jets Stella Boula, Fabrizio Tavecchio, Gianluigi Bodo, Nektarios Vlahakis, Paolo Coppi, Agnese Costa, Alberto Sciaccaluga 16 pages, 19 figures, submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE) AGN jet structure and stability remain uncertain; recollimation shocks are linked to morphology and variability, but the role of downstream instabilities is still unclear. We aim to investigate how jet magnetization and other physical parameters influence the development of instabilities beyond the first recollimation shock. In particular, we focus on identifying the conditions under which the centrifugal instability (CFI) is effective. We perform high-resolution 2D and 3D simulations using the relativistic magnetohydrodynamics code PLUTO. The jets are initialized with a conical geometry and propagate into an ambient medium, and we follow by axisymmetric simulations how they evolve towards a steady-state. In 2D we explore a range of magnetizations (from 0 to 1), pressure contrasts, and inertia ratios to characterize the formation and evolution of recollimation shocks. The results are further evaluated using linear stability analysis to assess the growth and suppression of CFI. Finally, we perform 3D simulations of unstable and stable jets. We discuss how the different parameters of the axisymmetric steady solutions influence the location and strength of recollimation. We find that, even in moderately magnetized jets, $\\sigma$=0.1, the CFI can still develop under suitable local conditions and disrupt the jet structure. This instability is governed by the jet radius, curvature, Lorentz factor, and magnetization, and is not always predictable from injection conditions. While magnetization can delay or locally suppress instability growth, it does not guarantee long-term jet stability. Our 3D results highlight the limitations of 2D models in capturing non-axisymmetric and nonlinear effects, and underline the complex interplay between magnetic confinement and destabilizing mechanisms. These findings have implications for interpreting variability, and polarization structure in AGN jets.",
      "pdf_url": "https://arxiv.org/pdf/2510.01742.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01773",
      "title": "Identifying tidal disruption events among radio transient galaxies",
      "authors": [
        "M. Kunert-Bajraszewska",
        "D. Kozieł-Wierzbowska",
        "D. Stern",
        "A. Krauze",
        "N. Zafar",
        "T. Connor",
        "M. J. Graham"
      ],
      "abstract": "Identifying tidal disruption events among radio transient galaxies M. Kunert-Bajraszewska, D. Kozieł-Wierzbowska, D. Stern, A. Krauze, N. Zafar, T. Connor, M. J. Graham 21 pages, 7 figures, 5 tables; accepted for publication in A&A High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) We present the optical and infrared properties of a sample of 24 radio transient sources discovered in the Very Large Array Sky Survey (VLASS). Previous studies of their radio emission showed that these sources resemble young gigahertz-peaked spectrum (GPS) radio sources, but are less powerful and characterized by low-power jets. The bursts of radio activity in most cases are likely due to intrinsic changes in the accretion processes. However, for a few sources in this sample, we cannot rule out the possibility that their radio variability results from a tidal disruption event (TDE). In this work, we extend our analysis to the optical and infrared regimes, confirming that our sample of radio transients is not homogeneous in terms of their optical and infrared properties either. The host galaxies of most of these sources are massive ellipticals with emission dominated by active galactic nuclei (AGN). They host supermassive black holes (SMBHs) with masses typical of radio-loud AGNs ($\\rm >10^7\\,M_{\\odot}$), but exhibit very low accretion activity. In contrast, the sources for which a TDE origin is suspected are either pure star-forming galaxies or show significant ongoing star formation, similar to radio-selected optically-detected TDEs. Additionally, two of them exhibit infrared flares characteristic of TDEs, while the remaining sources do not display significant variability outside the radio regime. Moreover, the evolution of their radio brightness in the W3/radio diagnostic diagram, which we employ in our analysis, also sets our TDE candidates apart from the rest of the sample and resembles the radio variability seen in optically discovered TDEs with radio emission. Finally, based on our findings, we hypothesize that the mid-IR/radio relation can serve as a tool to distinguish between radio transients caused by TDEs and those originating from intrinsic AGN variability.",
      "pdf_url": "https://arxiv.org/pdf/2510.01773.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01872",
      "title": "Constraining the Neutron-Star Equation of State via Short Gamma-Ray Burst X-ray Afterglows",
      "authors": [
        "R. Moradi",
        "Y. Wang",
        "F. Rastegarnia",
        "E. S. Yorgancioglu",
        "Shu-Xu Yi",
        "B. Eslam Panah",
        "S. N. Zhang"
      ],
      "abstract": "Constraining the Neutron-Star Equation of State via Short Gamma-Ray Burst X-ray Afterglows R. Moradi, Y. Wang, F. Rastegarnia, E. S. Yorgancioglu, Shu-Xu Yi, B. Eslam Panah, S. N. Zhang Accepted for publication in The Astrophysical Journal (ApJ) High Energy Astrophysical Phenomena (astro-ph.HE) Recent observations from NICER in X-rays and LIGO/Virgo in gravitational waves have provided critical constraints on the mass, radius, and tidal deformability of neutron stars, imposing stringent limits on the equation of state (EOS) and the behavior of ultra-dense matter. However, several key parameters influencing the EOS, such as the maximum mass of neutron stars, spin-down rates, and the potential role of exotic matter in their cores, remain subject of ongoing debate. Here we present a new approach to constraining the EOS by analyzing the X-ray afterglows of some short gamma-ray bursts, focusing on \"the internal plateau\" phase and its abrupt decay, which reflect the spin-down and possible collapse of a supra-massive neutron star into a black hole. By linking critical neutron star masses with black hole formation criteria and the observational data from Swift's BAT and XRT instruments with compact object models, we explore three representative EOSs that range from \"soft\" to \"stiff\". Our result supports a maximum mass for neutron stars of approximately 2.39 solar masses at the threshold of black hole formation. This conclusion holds under assumptions of magnetar-powered X-ray plateaus, constant radiative efficiency, isotropic emission, and full Kerr black hole energy extraction; deviations could influence the inferred results. Our results demonstrate the critical role of neutron star/black hole physics in probing dense nuclear matter and provide a novel framework for exploring extreme astrophysical environments.",
      "pdf_url": "https://arxiv.org/pdf/2510.01872.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.02079",
      "title": "The Very Faint X-ray Transient 4XMM J174610.7-290020 at the Galactic center",
      "authors": [
        "Giovanni Stel",
        "Gabriele Ponti",
        "Nathalie Degenaar",
        "Lara Sidoli",
        "Sandro Mereghetti",
        "Kaya Mori",
        "Tong Bao",
        "Giulia Illiano",
        "Samaresh Mondal",
        "Mark Reynolds",
        "Chichuan Jin",
        "Tianying Lian",
        "Shifra Mandel",
        "Simone Scaringi",
        "Shuo Zhang",
        "Grace Sanger-Johnson",
        "Rudy Wijnands",
        "Jon M. Miller",
        "Jamie Kennea",
        "Zhenlin Zhu"
      ],
      "abstract": "The Very Faint X-ray Transient 4XMM J174610.7-290020 at the Galactic center Giovanni Stel, Gabriele Ponti, Nathalie Degenaar, Lara Sidoli, Sandro Mereghetti, Kaya Mori, Tong Bao, Giulia Illiano, Samaresh Mondal, Mark Reynolds, Chichuan Jin, Tianying Lian, Shifra Mandel, Simone Scaringi, Shuo Zhang, Grace Sanger-Johnson, Rudy Wijnands, Jon M. Miller, Jamie Kennea, Zhenlin Zhu 11 pages, 9 figures. Recently submitted to A&A High Energy Astrophysical Phenomena (astro-ph.HE) Very Faint X-ray Transients (VFXTs) are a class of X-ray binary systems that exhibit occasional outbursts with peak X-ray luminosities (L_X< 1e36 erg s^-1) much lower than typical X-ray transients. On 22nd February 2024, during its daily Galactic center monitoring, Swift-XRT detected a VFXT, 7 arcmin from Sgr A* dubbing it Swift J174610--290018. We aim to characterize the outburst that occurred in 2024, and a second, distinct outburst in 2025, to understand the nature and accretion flow properties of this new VFXT. Swift-XRT light curves are used to constrain the duration of the two events. We carried out X-ray spectral analysis exploiting XMM and NuSTAR data. We used Chandra and XMM observations of the last 25 years to constrain the quiescent luminosity of the source. During the 2024 outburst, which lasted about 50 days, the source reached a luminosity in the 2-10 keV band of L_X = 1.2e35 erg s^-1 (assuming it is located at the Galactic center). The 2025 outburst is shorter (about 5 days), and reached L_X = 9e34 erg s^-1. The spectral features of the source include an excess at 6.5-7 keV, which can be associated either with a single reflection line or with the ionized Fe XXV and XXVI lines. The same source was identified in both the XMM and Chandra catalogs of point sources (known as 4XMM J174610.7--290020). During previous detections, the source displayed luminosity levels ranging from L_X= 2e32 to L_X = 3e34 erg s^-1 between 2000 and 2010. Moreover, it exhibited a potential type I X-ray burst in 2004. The analysis of the outbursts and the potential type I burst strongly suggests the neutron star low mass X-ray binary (NS-LMXB) nature of the VFXT. The source can be described by an accretion disk corona (as has been recently proposed by the XRISM/Xtend analysis). This scenario explains the overall low luminosity of this transient and the peculiar iron lines in the spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2510.02079.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02132",
      "title": "The Progenitor of the S147 Supernova Remnant",
      "authors": [
        "Elvira Cruz-Cruz",
        "Christopher S. Kochanek"
      ],
      "abstract": "The Progenitor of the S147 Supernova Remnant Elvira Cruz-Cruz, Christopher S. Kochanek 13 pages, 13 figures, submitted to ApJ October 1st, 2025 High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The supernova remnant (SNR) S147 contains the pulsar PSR J0538+2817 and a likely unbound binary companion, HD 37424. It is the only good Galactic candidate for a binary unbound by a core-collapse supernova (SN). Using Gaia DR3 parallaxes and photometry, we select the stars local to SNR S147 in a cylinder with a projected radius of $100$ pc and a parallax range of $0.614 < \\varpi < 0.787$ mas (a length of $\\simeq 360$ pc). We individually model the most luminous of these stars. The two most luminous single stars are the unbound binary companion, HD 37424, and HD 37367, with estimated masses of $(13.51\\pm0.05) M_{\\odot}$ and $(14.30\\pm0.09) M_{\\odot}$, respectively. The two most luminous binary systems are the spectroscopic binary HD 37366 and the eclipsing binary ET Tau that have primary masses of $(20.9\\pm0.12) M_{\\odot}$ and $(16.7\\pm0.09) M_{\\odot}$, respectively. We model the Gaia color-magnitude diagram (CMD) of this local stellar population using both single stars and a model consisting of noninteracting binaries using Solar metallicity PARSEC isochrones. For both models, the estimated age distributions of the $439$ $M_{G} < 0$ mag stars favor a high mass progenitor of $21.5M_{\\odot}-41.1M_{\\odot}$ for the SN.",
      "pdf_url": "https://arxiv.org/pdf/2510.02132.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02203",
      "title": "Jittering jets in stripped-envelope core-collapse supernovae",
      "authors": [
        "Nikki Yat Ning Wang",
        "Dmitry Shishkin",
        "Noam Soker"
      ],
      "abstract": "Jittering jets in stripped-envelope core-collapse supernovae Nikki Yat Ning Wang, Dmitry Shishkin, Noam Soker (Technion, Israel) It will be submitted in two days to allow for comments (including missing references) High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) Using the one-dimensional stellar evolution code MESA, we find that all our models in the initial mass range of 12-40 Mo, regardless of whether they have hydrogen-rich, hydrogen-stripped, or helium+hydrogen-stripped envelopes, have at least one significant strong convective zone in the inner core, which can facilitate the jittering-jets explosion mechanism (JJEM). We focus on stripped-envelope CCSN progenitors that earlier studies of the JJEM did not study, and examine the angular momentum parameter j=rVconv, where r is the radius of the layer and Vconv is the convective velocity according to the mixing length theory. In all models, there is at least one prominent convective zone with j>2e15 cm^2/s inside the mass coordinate that is the maximum baryonic mass of a neutron star (NS), m=2.65 Mo. According to the JJEM, convection in these zones seeds instabilities above the newly born NS, leading to the formation of intermittent accretion disks that launch pairs of jittering jets, which in turn explode the star. Our finding is encouraging for the JJEM, although it does not show that the intermittent accretion disks indeed form. We strengthen the claim that, according to the JJEM, there are no failed CCSNe and that all massive stars explode. In demonstrating the robust convection in the inner core of stripped-envelope CCSN progenitors, we add to the establishment of the JJEM as the primary explosion mechanism of CCSNe.",
      "pdf_url": "https://arxiv.org/pdf/2510.02203.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02233",
      "title": "Noisy Timing Behavior is a Feature of Central Compact Object Pulsars",
      "authors": [
        "K. I. Perez",
        "E. V. Gotthelf",
        "J. P. Halpern"
      ],
      "abstract": "Noisy Timing Behavior is a Feature of Central Compact Object Pulsars K. I. Perez, E. V. Gotthelf, J. P. Halpern 14 pages, 6 figures, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE) We present a timing study of the three known central compact object (CCO) pulsars, isolated cooling neutron stars in supernova remnants, using Chandra, XMM-Newton and NICER observations spanning two decades. Relative to canonical young pulsars, CCOs are spinning down at a very slow rate $|\\dot f| <10^{-15}$ s$^{-2}$, implying a surface dipole magnetic field strength $B_s < 10^{11}$ G that is too weak to account for their X-ray emitting hot spots. Two CCO pulsars with sufficiently long monitoring, 1E 1207.4$-$5209 and PSR J0821$-$4300, are seen to deviate from steady spin-down; their timing residuals can be modeled by one or more glitches in $f$ and $\\dot f$, or alternatively by extreme timing noise. For the third CCO pulsar, PSR J1852+0400, the sparse temporal coverage was insufficient to detect such effects. Glitch activity and timing noise in large samples of rotation-powered pulsars correlate best with $\\dot f$, while the timing irregularities of the first two CCOs are extreme compared to pulsars of the same $\\dot f$. Nevertheless, timing activity in CCOs may arise from properties that they share with other young but more energetic pulsars: high internal temperature, strong buried magnetic field and superfluid behavior. Alternatively, continuing low-level accretion of supernova debris is not ruled out as a source of timing noise in CCOs.",
      "pdf_url": "https://arxiv.org/pdf/2510.02233.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02301",
      "title": "Relativistic Jets and Winds in Radio-Identified Supermassive Black Hole Binary Candidates",
      "authors": [
        "Andrew G. Sullivan",
        "Roger D. Blandford",
        "Anna Synani",
        "Philipe V. de la Parra",
        "Noémie Globus",
        "Mitchell C. Begelman",
        "Anthony C.S. Readhead"
      ],
      "abstract": "Relativistic Jets and Winds in Radio-Identified Supermassive Black Hole Binary Candidates Andrew G. Sullivan, Roger D. Blandford, Anna Synani, Philipe V. de la Parra, Noémie Globus, Mitchell C. Begelman, Anthony C.S. Readhead 13 pages, 8 figures, submitted to ApJ High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA); Plasma Physics (physics.plasm-ph) Supermassive black hole binary systems (SMBHBs) are thought to emit the recently discovered nHz gravitational wave background; however, not a single individual nHz source has been confirmed to date. Long-term radio-monitoring at the Owens Valley Radio Observatory has revealed two potential SMBHB candidates: blazars PKS 2131-021 and PKS J0805-0111. These sources show periodic flux density variations across the electromagnetic spectrum, signaling the presence of a good clock. To explain the emission, we propose a generalizable jet model, where a mildly relativistic wind creates an outward-moving helical channel, along which the ultra-relativistic jet propagates. The observed flux variation from the jet is mostly due to aberration. The emission at lower frequency arises at larger radius and its variation is consequently delayed, as observed. Our model reproduces the main observable features of both sources and can be applied to other sources as they are discovered. We make predictions for radio polarization, direct imaging, and emission line variation, which can be tested with forthcoming observations. Our results motivate future numerical simulations of jetted SMBHB systems and have implications for the fueling, structure, and evolution of blazar jets.",
      "pdf_url": "https://arxiv.org/pdf/2510.02301.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.01317",
      "title": "Expectations for the first supermassive black-hole binary resolved by PTAs I: Model efficacy",
      "authors": [
        "Levi Schult",
        "Polina Petrov",
        "Stephen R. Taylor",
        "Nihan Pol",
        "Nima Laal",
        "Maria Charisi",
        "Chung-Pei Ma"
      ],
      "abstract": "Expectations for the first supermassive black-hole binary resolved by PTAs I: Model efficacy Levi Schult, Polina Petrov, Stephen R. Taylor, Nihan Pol, Nima Laal, Maria Charisi, Chung-Pei Ma 25 pages, 6 figures, 3 tables. Submitted to Physical Review D Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE) One of the most promising targets for Pulsar Timing Arrays (PTAs) is identifying an individual supermassive black hole binary (SMBHB) out of the population of binaries theorized to produce a gravitational wave background (GWB). In this work, we emulate an evolving PTA dataset, complete with an increasing number of pulsars and timing baseline, into which we inject a single binary on top of a Gaussian GWB signal. We vary the binary's source parameters, including sky position and frequency, and create an ensemble of simulated datasets with which we assess current Bayesian binary search techniques. We apply two waveform-based template models and a frequency-resolved anisotropy search to these simulations to understand how they compare in their detection and characterization abilities. We find that a template-based search including the full gravitational-wave signal structure (i.e., both Earth and pulsar effects of an incident GW) returns the highest Bayes Factors (BF), exceeding our estimator's capabilities by (S/N)~9-19, and has the most robust parameter estimation. Our anisotropy model attains a realization-median BF>10 at 7<(S/N)<15. Interestingly, despite being a deterministic model, the Earth-term template struggles to detect and characterize low-frequency binaries (5 nHz). These binaries require higher (S/N)~16-19 to reach the same BF threshold. This is likely due to neglected confusion effects between the pulsar and Earth terms. By contrast, the frequency-resolved anisotropy model shows promise for parameter estimation despite treating a binary's GW signal as excess directional GW power without phase modeling. Sky location and frequency parameter constraints returned by the anisotropy model are only surpassed by the Earth term template model at (S/N)~12-13. Milestones for a first detection using the full-signal GW model are included in a companion paper (Petrov et al. 2025).",
      "pdf_url": "https://arxiv.org/pdf/2510.01317.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.01321",
      "title": "The Spatially Resolved Hot Gas Properties of NGC 1266's AGN-Driven Outflow",
      "authors": [
        "Sebastian Lopez",
        "Laura A. Lopez",
        "Lauranne Lanz",
        "Justin A. Otter",
        "Katherine Alatalo"
      ],
      "abstract": "The Spatially Resolved Hot Gas Properties of NGC 1266's AGN-Driven Outflow Sebastian Lopez, Laura A. Lopez, Lauranne Lanz, Justin A. Otter, Katherine Alatalo 13 pages, 7 Figures; submitted to ApJ (30 September 2025) Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE) Galactic winds play a critical role in galaxy evolution, yet their structure and driving mechanisms remain poorly understood, especially in low-luminosity AGN (LLAGN) systems. NGC 1266 hosts one such LLAGN, embedded in a massive molecular gas reservoir that is not forming stars, likely due to AGN feedback. We analyze deep archival \\textit{Chandra} data to constrain the properties of its hot gas and compare them to other wind systems. We find temperatures of $0.24$--$1.85$ keV and notably high electron densities of $0.33$--$4.2$ cm$^{-3}$, suggesting significant mass loading, further supported by charge exchange emission in the southern lobe, one of the few AGN systems where it has been detected. We measure pressures and thermal energies of $10^6$--$10^8$~K cm$^{-3}$ and $10^{54}$--$10^{56}$ erg, exceeding the minimum energy needed for the radio jet to power the outflow and implying the hot phase comprises a large fraction of the energy budget. Archival MUSE data reveal a cavity-like feature in the southern outflow, potentially associated with the far side of the outflow cone. At the maximum outflow extent, the warm and hot phases appear to be in pressure equilibrium. Coupled with short cooling timescales of $\\sim$1 Myr, comparable to the advection time, this suggests the outflow is undergoing radiative cooling and may have stalled. Finally, we compare NGC 1266 to other local AGN and starburst galaxies, finding NGC 1266 to be the densest wind in the sample.",
      "pdf_url": "https://arxiv.org/pdf/2510.01321.pdf",
      "categories": [
        "astro-ph.GA",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01573",
      "title": "Suppression of inverse magnetic energy transfer in collisionless marginally magnetized plasmas",
      "authors": [
        "Zhuo Liu",
        "Muni Zhou",
        "Nuno F.G. Loureiro"
      ],
      "abstract": "Suppression of inverse magnetic energy transfer in collisionless marginally magnetized plasmas Zhuo Liu, Muni Zhou, Nuno F.G. Loureiro Plasma Physics (physics.plasm-ph); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the inverse cascade of magnetic energy in decaying, collisionless plasmas with moderate to high-$\\beta$ values via first-principles numerical simulations and analytical theory. We find that pressure-anisotropy-driven instabilities, in particular the firehose instability, suppress reconnection-driven coalescence of magnetic structures (i.e., inverse transfer) by nullifying magnetic tension. This suppression leaves such structures elongated and confined to scales comparable to the Larmor radius of the particles. The presence of a magnetic guide field of sufficient strength, or a greater scale separation between the initial size of the magnetic structures and the Larmor radius, restores the system's ability to inverse transfer magnetic energy. These results reveal that inverse energy transfer in collisionless plasmas is not guaranteed, but instead sensitively depends on magnetization. In the astrophysical context, this identifies a kinetic mechanism by which Weibel-generated seed fields may fail to merge consistently, potentially limiting their role in cosmic magnetogenesis.",
      "pdf_url": "https://arxiv.org/pdf/2510.01573.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01587",
      "title": "Orbital Period Changes in Recurrent Nova T Corona Borealis Prove That It Is Not a Type Ia Supernovae Progenitor",
      "authors": [
        "Bradley E. Schaefer"
      ],
      "abstract": "Orbital Period Changes in Recurrent Nova T Corona Borealis Prove That It Is Not a Type Ia Supernovae Progenitor Bradley E. Schaefer (Louisiana State University) This is third in a series of papers evaluating exemplar systems for Single-Degenerate Supernova models. First paper is on V445 Pup (Schaefer 2025, ApJ, 980, 156), and second paper is on U Sco (Schaefer & Myers 2025, ApJ, 991, 110) Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) T Corona Borealis (T CrB) is a recurrent nova and a symbiotic star that is commonly highlighted as the best case for being a progenitor of a Type Ia supernova (SNIa) within the framework of single-degenerate models. This exemplar can be tested by measuring whether the white dwarf (WD) mass ($M_{\\rm WD}$) is increasing over each eruption cycle. This is a balance between the mass ejected during each nova event ($M_{\\rm ejecta}$) and the mass accreted onto the WD between the nova events ($M_{\\rm accreted}$). I have used all 206 radial velocities from 1946--2024 to measure the orbital period just after the 1946 eruption to be $P_{\\rm post}$=227.6043 days, while the steady orbital period change ($\\dot{P}$) is ($-$3.1$\\pm$1.6)$\\times$10$^{-6}$. I have used my full 213,730 magnitude $B$ and $V$ light curve from 1842--2025 to measure the times of maximum brightness in the ellipsoidal modulations to construct the $O-C$ from 1866--1946. I fit the broken parabola shape, to find the orbital period immediately before the 1946 eruption to be $P_{\\rm pre}$=227.4586 days. The orbital period changed by $\\Delta P$=$+$0.146$\\pm$0.019 days. With Kepler's Law, conservation of angular momentum, and the well-measured binary properties, the ejecta mass in 1946 is 0.00074$\\pm$0.00009 M$_{\\odot}$. $M_{\\rm accreted}$ is reliably measured to be 1.38$\\times$10$^{-6}$ M$_{\\odot}$ from the accretion luminosity. $M_{\\rm ejecta}$ is larger than $M_{\\rm accreted}$ by 540$\\times$, so $M_{\\rm WD}$ is {\\it decreasing} every eruption cycle. T CrB can never become a SNIa.",
      "pdf_url": "https://arxiv.org/pdf/2510.01587.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01589",
      "title": "Orbital Period Changes of Recurrent Nova U Scorpii Demonstrate that M$_{\\rm ejecta}$=26$\\times$M$_{\\rm accreted}$ and Is Not a Type Ia Supernova Progenitor",
      "authors": [
        "Bradley E. Schaefer",
        "Gordon Myers"
      ],
      "abstract": "Orbital Period Changes of Recurrent Nova U Scorpii Demonstrate that M$_{\\rm ejecta}$=26$\\times$M$_{\\rm accreted}$ and Is Not a Type Ia Supernova Progenitor Bradley E. Schaefer (Louisiana State University), Gordon Myers (AAVSO) This is second in a series of papers evaluating exemplar systems for Single-Degenerate Supernova models. First paper is on V445 Pup (Schaefer 2025, ApJ, 980, 156), and third paper is on T CrB (Schaefer 2025, ApJ, 991, 111) Solar and Stellar Astrophysics (astro-ph.SR); High Energy Astrophysical Phenomena (astro-ph.HE) Recurrent nova U Scorpii (U Sco) is one of the prototypes for a Type Ia supernova progenitor. The logic is that the white dwarf is near the Chandrasekhar mass and gas is accumulating onto its surface at a near-maximal accretion rate, so it will soon increase its mass to the supernova trigger. But the white dwarf loses mass every nova eruption, so the issue is balancing the mass ejected ($M_{\\rm ejecta}$) against the mass accreted between eruptions ($M_{\\rm accreted}$). Measuring $M_{\\rm accreted}$ can be done in several ways to useable accuracy. But the old methods for measuring $M_{\\rm ejecta}$ (involving the flux in hydrogen emission lines) are all with real error bars of 2--3 orders of magnitude. The only solution is to measure the change of the orbital period across the nova eruption ($\\Delta P$). But this solution requires a vast photometric program of eclipse timings stretching decades. For U Sco, a program started in 1989, now reaches its culmination with measures of $\\Delta P$ for the eruptions of 1999, 2010, 2016, and 2022. This paper reports on 52 new eclipse times (for a total of 218 eclipses 1945--2025), plus a new theory result allowing for the confident calculation of $M_{\\rm ejecta}$ from $\\Delta P$. The four eruptions ejected a total of (103$\\pm$14)$\\times$$10^{-6}$ $M_{\\odot}$, while the white dwarf accreted 4$\\times$$10^{-6}$ $M_{\\odot}$ over the four previous eruption cycles. With M$_{\\rm ejecta}$=26$\\times$M$_{\\rm accreted}$, the U Sco white dwarf is losing large masses each eruption cycle, so U Sco can never produce a Type Ia supernova.",
      "pdf_url": "https://arxiv.org/pdf/2510.01589.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.16606",
      "title": "Looking for the γ-Ray Cascades of the KM3-230213A Neutrino Source",
      "authors": [
        "Milena Crnogorčević",
        "Carlos Blanco",
        "Tim Linden"
      ],
      "abstract": "Looking for the γ-Ray Cascades of the KM3-230213A Neutrino Source Milena Crnogorčević, Carlos Blanco, Tim Linden 14 pages (excl. references), 7 figures. Accepted to JCAP High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) The extreme energy of the KM3-230213A event could transform our understanding of the most energetic sources in the Universe. However, it also reveals an inconsistency between the KM3NeT detection and strong IceCube constraints on the ultra-high energy neutrino flux. The most congruous explanation for the KM3NeT and IceCube data requires KM3-230213A to be produced by a (potentially transient) source fortuitously located in a region where the KM3NeT acceptance is maximized. In hadronic models of ultra-high-energy neutrino production, such a source would also produce a bright {\\gamma}-ray signal, which would cascade to GeV--TeV energies due to interactions with extragalactic background light. We utilize the {\\gamma}-Cascade package to model the spectrum, spatial extension, and time-delay of such a source, and scan a region surrounding the KM3NeT event to search for a consistent {\\gamma}-ray signal. We find no convincing evidence for a comparable \\textit{Fermi}-LAT source and place constraints on a combination of the source redshift and the intergalactic magnetic field strength between the source and Earth.",
      "pdf_url": "https://arxiv.org/pdf/2503.16606.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-ph"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.19570",
      "title": "What Determines the Maximum Mass of AGN-assisted Black Hole Mergers?",
      "authors": [
        "LingQin Xue",
        "Hiromichi Tagawa",
        "Zoltan Haiman",
        "Imre Bartos"
      ],
      "abstract": "What Determines the Maximum Mass of AGN-assisted Black Hole Mergers? LingQin Xue, Hiromichi Tagawa, Zoltan Haiman, Imre Bartos Phys. Rev. D (2025) 112, 063034 High Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA) The origin of merging binary black holes detected through gravitational waves remains a fundamental question in astrophysics. While stellar evolution imposes an upper mass limit of about 50 solar mass for black holes, some observed mergers--most notably GW190521--involve significantly more massive components, suggesting alternative formation channels. Here we investigate the maximum masses attainable by black hole mergers within active galactic nucleus (AGN) disks. Using a comprehensive semi-analytic model incorporating 27 binary and environmental parameters, we explore the role of AGN disk conditions in shaping the upper end of the black hole mass spectrum. We find that AGN disk lifetime is the dominant factor, with high-mass mergers (>200 solar mass) only possible if disks persist for ~40 Myr. The joint electromagnetic observation of an AGN-assisted merger could therefore lead to a direct measurement of the age of an AGN disk.",
      "pdf_url": "https://arxiv.org/pdf/2504.19570.pdf",
      "categories": [
        "astro-ph.HE",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.04546",
      "title": "Gamma/hadron discriminant variables in application to high-energy cosmic-ray air showers",
      "authors": [
        "Nataliia Borodai"
      ],
      "abstract": "Gamma/hadron discriminant variables in application to high-energy cosmic-ray air showers Nataliia Borodai Proceeding, presented on the ICRC2025 conference High Energy Astrophysical Phenomena (astro-ph.HE) Identification of primary cosmic rays on an event-by-event basis is a much-desired capability of cosmic-ray observatories. Several cosmic-ray air-shower experiments use so-called photon tags for gamma hadron primary particle discrimination. These photon tag variables are derived from the total signals measured by an array of detectors and are correlated with the total number of muons in the air shower. In this work, variables based on time distribution of signals in detectors (trace-based discriminant variables) are studied and compared to total-signal-based variables. This study relies on simulated high-energy cosmic-ray air showers with energies around 10^17.5eV. Since the variables discussed are derived from total signals and their time traces, which can be directly measured in real data, they are suitable for use as discriminant variables in the real ground-based cosmic ray experiments.",
      "pdf_url": "https://arxiv.org/pdf/2507.04546.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.18837",
      "title": "Return of the Clocked Burster: Exceptionally Short Recurrence Time in GS 1826-238",
      "authors": [
        "Tomoshi Takeda",
        "Toru Tamagawa",
        "Teruaki Enoto",
        "Wataru Iwakiri",
        "Akira Dohi",
        "Tatehiro Mihara",
        "Hiromitsu Takahashi",
        "Chin-Ping Hu",
        "Amira Aoyama",
        "Naoyuki Ota",
        "Satoko Iwata",
        "Takuya Takahashi",
        "Kaede Yamasaki",
        "Takayuki Kita",
        "Soma Tsuchiya",
        "Yosuke Nakano",
        "Mayu Ichibakase",
        "Nobuya Nishimura"
      ],
      "abstract": "Return of the Clocked Burster: Exceptionally Short Recurrence Time in GS 1826-238 Tomoshi Takeda, Toru Tamagawa, Teruaki Enoto, Wataru Iwakiri, Akira Dohi, Tatehiro Mihara, Hiromitsu Takahashi, Chin-Ping Hu, Amira Aoyama, Naoyuki Ota, Satoko Iwata, Takuya Takahashi, Kaede Yamasaki, Takayuki Kita, Soma Tsuchiya, Yosuke Nakano, Mayu Ichibakase, Nobuya Nishimura 11 pages, 4 figures, 2 tables; accepted for publication in ApJL High Energy Astrophysical Phenomena (astro-ph.HE) We report the discovery of an exceptionally short burst recurrence time in the well-known clocked burster GS 1826$-$238, observed with the CubeSat X-ray observatory NinjaSat. In 2025 May, GS 1826$-$238 underwent a soft-to-hard state transition for the first time in 10 years. On June 23, NinjaSat began monitoring GS 1826$-$238 in the hard state and continued until it returned to a steady soft state. During this period, we detected 19 X-ray bursts: 14 during the hard state, 4 in the transitional state, and 1 in the soft state. In the hard state, we identified a new clocked bursting epoch, during which the burst recurrence time remained highly stable and unprecedentedly short among the clocked bursting phases of GS 1826$-$238, with $t_{\\rm rec} = 1.603 \\pm 0.040$ hr ($1\\sigma$ error). Previous observations showed that the burst recurrence time in GS 1826$-$238 decreased with increasing mass accretion rate, reached its minimum value of $t_{\\rm rec} \\sim 3$ hr, and then increased again. The observed 1.6 hr recurrence time is therefore exceptionally short, indicating anomalous ignition conditions. We propose that this phenomenon reflects fuel accumulation over a smaller fraction of the neutron star surface, resulting in a higher local accretion rate compared to earlier epochs. This scenario naturally accounts for the exceptionally short recurrence time, together with the observed reductions during bursts in blackbody normalization (proportional to the emitting area) and fluence. We also discuss possible contributions from residual heat in the neutron star crust or the presence of an additional soft spectral component.",
      "pdf_url": "https://arxiv.org/pdf/2508.18837.pdf",
      "categories": [
        "astro-ph.HE"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.26418",
      "title": "Dynamical equilibria of fast neutrino flavor conversion",
      "authors": [
        "Jiabao Liu",
        "Lucas Johns",
        "Hiroki Nagakura",
        "Masamichi Zaizen",
        "Shoichi Yamada"
      ],
      "abstract": "Dynamical equilibria of fast neutrino flavor conversion Jiabao Liu, Lucas Johns, Hiroki Nagakura, Masamichi Zaizen, Shoichi Yamada High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) Dense neutrino systems, which display collectivity mediated by the weak interaction, have deep parallels with mean-field kinetic systems governed by other fundamental forces. We identify analogues in fast flavor conversion (FFC) of some time-honored nonlinear phenomena in plasmas and self-gravitating systems. We focus in particular on nonlinear Landau damping and collisionless equilibria, which are likely important pieces of the unsolved puzzle of neutrino oscillations in core-collapse supernovae and neutron star mergers. Our analysis additionally reveals the previously unexplored phenomenon of flavor-wave synchronization.",
      "pdf_url": "https://arxiv.org/pdf/2509.26418.pdf",
      "categories": [
        "astro-ph.HE",
        "hep-th"
      ],
      "primary_category": "astro-ph.HE",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01307",
      "title": "A comprehensive radio study of narrow-line Seyfert 1 galaxies",
      "authors": [
        "I. Varglund",
        "E. Järvelä",
        "M.J. Hardcastle",
        "S. Varglund",
        "A. Lähteenmäki"
      ],
      "abstract": "A comprehensive radio study of narrow-line Seyfert 1 galaxies I. Varglund, E. Järvelä, M.J. Hardcastle, S. Varglund, A. Lähteenmäki Astrophysics of Galaxies (astro-ph.GA) Narrow-line Seyfert 1 (NLS1) galaxies are a type of active galactic nuclei (AGN) that were originally classified as sources with little to no radio emission. Although the class is rather unified from an optical perspective, their radio characteristics are diverse. One of the biggest curiosities found in these sources is their ability to form and maintain powerful relativistic jets. We studied the radio properties of a sample of 3998 NLS1 galaxies which is the largest clean sample available, thus allowing us to study the population-wide characteristics. We used both historical and ongoing surveys: the LOw-Frequency ARray (LOFAR) Two-metre Sky Survey (LoTSS; 144~MHz), the Faint Images of the Radio Sky at Twenty-centimeters (FIRST; 1.4~GHz), the National Radio Astronomy Observatory (NRAO) Very Large Array (VLA) Sky Survey (NVSS; 1.4~GHz), and the VLA Sky Survey (VLASS; 3~GHz). We were able to obtain a radio detection for $\\sim40\\%$ of our sources, with the most detections by LoTSS. The majority of the detected NLS1 galaxies are faint ($\\sim1-2$ mJy) and non-variable, suggesting considerable contributions from star formation activities, especially at 144~MHz. However, we identified samples of extreme sources, for example, in fractional variability and radio luminosity, indicating significant AGN activity. Our results highlight the heterogeneity of the NLS1 galaxy population in radio and lays the foundation for targeted future studies.",
      "pdf_url": "https://arxiv.org/pdf/2510.01307.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01314",
      "title": "JWST Observations of Starbursts: PAHs Closely Trace the Cool Phase of M82's Galactic Wind",
      "authors": [
        "Sebastian Lopez",
        "Colton Ring",
        "Adam K. Leroy",
        "Serena A. Cronin",
        "Alberto D. Bolatto",
        "Laura A. Lopez",
        "Vicente Villanueva",
        "Deanne B. Fisher",
        "Todd A. Thompson",
        "Lee Armus",
        "Torsten Boeker",
        "Leindert A. Boogaard",
        "Martha L. Boyer",
        "Ryan Chown",
        "Daniel A. Dale",
        "Keaton Donaghue",
        "Kimberly Emig",
        "Simon C. O. Glover",
        "Rodrigo Herrera-Camus",
        "Ralf S. Klessen",
        "Thomas S.-Y. Lai",
        "Laura Lenkic",
        "Rebecca C. Levy",
        "David S. Meier",
        "Elisabeth Mills",
        "Juergen Ott",
        "Evan D. Skillman",
        "J.D. T. Smith",
        "Elizabeth J. Tarantino",
        "Sylvain Veilleux",
        "Fabian Walter",
        "Paul P. van der Werf"
      ],
      "abstract": "JWST Observations of Starbursts: PAHs Closely Trace the Cool Phase of M82's Galactic Wind Sebastian Lopez, Colton Ring, Adam K. Leroy, Serena A. Cronin, Alberto D. Bolatto, Laura A. Lopez, Vicente Villanueva, Deanne B. Fisher, Todd A. Thompson, Lee Armus, Torsten Boeker, Leindert A. Boogaard, Martha L. Boyer, Ryan Chown, Daniel A. Dale, Keaton Donaghue, Kimberly Emig, Simon C. O. Glover, Rodrigo Herrera-Camus, Ralf S. Klessen, Thomas S.-Y. Lai, Laura Lenkic, Rebecca C. Levy, David S. Meier, Elisabeth Mills, Juergen Ott, Evan D. Skillman, J.D. T. Smith, Elizabeth J. Tarantino, Sylvain Veilleux, Fabian Walter, Paul P. van der Werf 14 pages, 7 figures, submitted to ApJ Letters (01 October 2025) Astrophysics of Galaxies (astro-ph.GA) Stellar feedback drives multiphase gas outflows from starburst galaxies, but the interpretation of dust emission in these winds remains uncertain. To investigate this, we analyze new JWST mid-infrared images tracing polycyclic aromatic hydrocarbon (PAH) emission at 7.7 and 11.3~$\\mu$m from the outflow of the prototypical starburst M82 out to $3.2$ kpc. We find that PAH emission shows significant correlations with CO, H$\\alpha$, and X-ray emission within the outflow, though the strengths and behaviors of these correlations vary with gas phase and distance from the starburst. PAH emission correlates strongly with cold molecular gas, with PAH--CO scaling relations in the wind nearly identical to those in galaxy disks despite the very different conditions. The H$\\alpha$--PAH correlation indicates that H$\\alpha$ traces the surfaces of PAH-bearing clouds, consistent with arising from ionized layers produced by shocks. Meanwhile the PAH--X-ray correlation disappears once distance effects are controlled for past 2~kpc, suggesting that PAHs are decoupled from the hot gas and the global correlation merely reflects the large-scale structure of the outflow. The PAH-to-neutral gas ratio remains nearly flat to 2~kpc, with variations following changes in the radiation field. This implies that the product of PAH abundance and dust-to-gas ratio does not change significantly over the inner portion of the outflow. Together, these results demonstrate that PAHs robustly trace the cold phase of M82's wind, surviving well beyond the starburst and providing a powerful, high-resolution proxy for mapping the life cycle of entrained cold material in galactic outflows.",
      "pdf_url": "https://arxiv.org/pdf/2510.01314.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01315",
      "title": "Neutral hydrogen in and around galaxies during the Epoch of Reionization",
      "authors": [
        "V. Gelli",
        "C. Mason",
        "A. Pallottini",
        "K. E. Heintz",
        "Z. Chen",
        "V. D'Odorico",
        "A. Ferrara",
        "J. Fynbo",
        "M. Kohandel",
        "C. L. Pollock",
        "C. Robinson",
        "S. Salvadori"
      ],
      "abstract": "Neutral hydrogen in and around galaxies during the Epoch of Reionization V. Gelli, C. Mason, A. Pallottini, K. E. Heintz, Z. Chen, V. D'Odorico, A. Ferrara, J. Fynbo, M. Kohandel, C. L. Pollock, C. Robinson, S. Salvadori 12 pages, 7 figures. Submitted to A&A Astrophysics of Galaxies (astro-ph.GA) JWST spectra revealing Lyman-$\\alpha$ (Ly$\\alpha$) absorption in $z\\sim 5-14$ galaxies offer a unique probe of reionization's earliest stages. However, disentangling absorption by the increasingly neutral intergalactic medium (IGM) from that in galaxies' interstellar and circumgalactic medium (ISM, CGM) remains challenging due to the poorly constrained nature of neutral hydrogen (HI) in and around galaxies at these redshifts. We use the SERRA high-resolution cosmological zoom-in simulations to characterize the HI distribution and its evolution along sightlines to star-forming regions during reionization, to interpret the contribution of local HI (ISM+CGM) to Ly$\\alpha$ absorption in $z>5$ spectra. We analyze $\\sim 100$ $z=6-9.5$ galaxies, generating mock sightlines from each galaxy's star formation peak. We study the sightline distribution of HI column densities ($N_{\\rm HI}$) and its variation with radius, halo mass and redshift. We find broad sightline variation in $N_{\\rm HI}$ (0.5-1.5dex) due to complex ISM morphology driven by bursty star formation, with median $\\log(N_{\\rm HI}/{\\rm cm}^{-2}) \\simeq 21-22$. Dense ISM gas is the dominant origin of damped Ly$\\alpha$ absorption (DLA) systems along sightlines towards star-forming regions, outweighing gas in the CGM, filaments and proximate absorbers. Median $N_{\\rm HI}$ increases with halo mass, scaling roughly with the virial radius, as expected due to larger potentials and more extended CGM, but shows negligible redshift evolution at fixed halo mass. This suggests post-reionization $N_{\\rm HI}$ distributions may provide useful priors to interpret IGM damping wings at higher redshifts. To interpret strong $z>5$ DLA candidates found by JWST, we investigate $N_{\\rm HI}>10^{22}{\\rm cm}^{-2}$ sightlines. These trace dense, metal-enriched ISM within <1 kpc of massive halos, a scenario testable with higher-resolution spectroscopy.",
      "pdf_url": "https://arxiv.org/pdf/2510.01315.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01322",
      "title": "Heavy seeds and the first black holes: Insights from the BRAHMA simulations",
      "authors": [
        "Aklant K. Bhowmick",
        "Laura Blecha",
        "Paul Torrey",
        "Luke Zoltan Kelley",
        "Priyamvada Natarajan",
        "Rachel S. Somerville",
        "Rainer Weinberger",
        "Alex M. Garcia",
        "Lars Hernquist",
        "Tiziana Di Matteo",
        "Jonathan Kho",
        "Mark Vogelsberger"
      ],
      "abstract": "Heavy seeds and the first black holes: Insights from the BRAHMA simulations Aklant K. Bhowmick, Laura Blecha, Paul Torrey, Luke Zoltan Kelley, Priyamvada Natarajan, Rachel S. Somerville, Rainer Weinberger, Alex M. Garcia, Lars Hernquist, Tiziana Di Matteo, Jonathan Kho, Mark Vogelsberger Astrophysics of Galaxies (astro-ph.GA) From the luminous quasars at $z \\sim 6$ to the recent $z \\sim 9-11$ AGNs revealed by JWST, observations of the earliest black hole (BH) populations can provide unique constraints on BH formation and growth models. We use the BRAHMA simulations with constrained initial conditions to investigate BH assembly in extreme overdense regions. The simulations implement heavy seeds ($\\sim 10^4-10^5 M_{\\odot})$ forming in dense, metal-poor gas exposed to sufficient Lyman-Werner flux. With gas accretion modeled via Bondi-Hoyle formalism and BH dynamics and mergers using a subgrid dynamical friction scheme, we isolate the impact of seeding, dynamics, accretion, and feedback on early BH growth. With fiducial stellar and AGN feedback inherited from IllustrisTNG, accretion is strongly suppressed at $z \\gtrsim 9$, leaving mergers as the dominant growth channel. Gas accretion dominates at $z \\lesssim 9$, where permissive models (super-Eddington or low radiative efficiency) build $\\sim 10^9\\ M_{\\odot}$ BHs powering quasars by $z \\sim 6$, while stricter IllustrisTNG-based prescriptions yield much lower BH masses ($\\sim 10^6-10^8\\ M_{\\odot}$). Our seed models strongly affect merger-driven growth at $z \\gtrsim 9$: only the most lenient models (with $\\sim 10^5\\ M_{\\odot}$ seeds) produce enough BH mergers to reach $\\gtrsim 10^6\\ M_{\\odot}$ by $z \\sim 10$, consistent with current estimates for GN-z11. Our dynamical friction model gives low merger efficiencies, hindering the buildup of $\\gtrsim 10^7\\ M_{\\odot}$ BHs by $z \\sim 9-10$, as currently inferred for GHZ9, UHZ1, and CAPERS-LRD-z9. If the BH-to-stellar mass ratios of these sources are indeed as extreme as currently inferred, they would require either very short BH merger timescales or reduced AGN thermal feedback. Weaker stellar feedback boosts both star formation and BH accretion and cannot raise these ratios.",
      "pdf_url": "https://arxiv.org/pdf/2510.01322.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01323",
      "title": "Multiphase gas offsets in the atmospheres of central galaxies and their consequences for SMBH activation I. The hot and warm ionized gas phases",
      "authors": [
        "Francesco Ubertosi",
        "Fabrizio Brighenti",
        "Ewan O'Sullivan",
        "Gerrit Schellenberger",
        "Myriam Gitti",
        "Simona Giacintucci",
        "Pasquale Temi",
        "Laurence P. David",
        "Jan Vrtilek",
        "Tiziana Venturi",
        "Elisabetta Liuzzo",
        "Marcella Massardi",
        "Kamlesh Rajpurohit"
      ],
      "abstract": "Multiphase gas offsets in the atmospheres of central galaxies and their consequences for SMBH activation I. The hot and warm ionized gas phases Francesco Ubertosi, Fabrizio Brighenti, Ewan O'Sullivan, Gerrit Schellenberger, Myriam Gitti, Simona Giacintucci, Pasquale Temi, Laurence P. David, Jan Vrtilek, Tiziana Venturi, Elisabetta Liuzzo, Marcella Massardi, Kamlesh Rajpurohit Under review in The Astrophysical Journal Astrophysics of Galaxies (astro-ph.GA) We investigate the spatial relationships between multi-phase gas components and supermassive black hole (SMBH) activity in a sample of 25 cool core galaxy groups and clusters. Using high angular resolution observations from \\textit{Chandra}, VLT/MUSE, and VLBA, we robustly locate the position, respectively, of the X-ray peak of the intracluster medium (ICM), of the H$\\alpha$ peak of the warm ionized gas, and of the SMBH radio core on parsec scales. We identify spatial offsets between the X-ray peak of the hot gas and the SMBH in 80% of the systems, with an average displacement of $\\langle\\Delta^{\\text{SMBH}}_{\\text{X-ray}}\\rangle = 4.8$ kpc (dispersion of $3.8$ kpc). In contrast, the peak of warm ionized gas traced by H$\\alpha$ exhibits much smaller offsets ($\\langle\\Delta^{\\text{SMBH}}_{\\text{H}\\alpha}\\rangle = 0.6$ kpc; dispersion of $1.4$ kpc) and a lower incidence of displacement (15%). Our findings suggest that hot gas sloshing primarily drives the observed spatial offsets, with AGN-driven uplift contributing in some this http URL, systems with H$\\alpha$ - SMBH offsets of $\\geq$1 kpc uniformly lack detectable radio cores on VLBA scales, with upper limits on the 5~GHz power of $P_{5\\,\\text{GHz}} \\leq 10^{21-22}$ W Hz$^{-1}$, while those without such offsets exhibit radio powerful AGN with pc-scale radio emission up to $P_{5\\,\\text{GHz}} \\sim 10^{24-25}$ W Hz$^{-1}$. This correlation indicates that centrally concentrated warm gas is critical for sustaining radio-loud SMBH activity, possibly supporting scenarios of cold-mode accretion. Overall, our results highlight the importance of high-angular-resolution, multi-wavelength observations for understanding the interplay between multiphase gas cooling and AGN fueling in central galaxies.",
      "pdf_url": "https://arxiv.org/pdf/2510.01323.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.01327",
      "title": "Lessons Learned from Studying H$α$ Galaxy Kinematics with Mock JWST/NIRSpec IFU Observations at $z > 6$",
      "authors": [
        "Siân Phillips",
        "Francesca Rizzo",
        "Mahsa Kohandel",
        "Renske Smit",
        "Andrea Pallottini"
      ],
      "abstract": "Lessons Learned from Studying H$α$ Galaxy Kinematics with Mock JWST/NIRSpec IFU Observations at $z > 6$ Siân Phillips, Francesca Rizzo, Mahsa Kohandel, Renske Smit, Andrea Pallottini 19 pages, 14 figures, accepted for publication in Monthly Notices of the Royal Astronomical Society Astrophysics of Galaxies (astro-ph.GA) Galaxies with a disk morphology have been established at $z > 9$ with the James Webb Space Telescope (JWST). However, confirming their disky nature requires studying their gas kinematics, which can be challenging when relying solely on the warm gas observed by JWST. Unlike the cold gas traced by the Atacama Large Millimetre/Submillimetre Array (ALMA), warm gas is sensitive to outflows, complicating the interpretation of the disk dynamics. This elicits the question of how to compare information obtained from varied tracers, as well as how to physically interpret the low angular and spectral resolution observations generally available at high redshift. We address these challenges through comparative kinematic analysis of idealised and realistic NIRSpec/IFU mock observations derived from two galaxies in the SERRA suite of cosmological zoom-in simulations. With these synthetic data, we determine the robustness of dynamical information recovered from typical IFU observations, and test widely-used criteria for identifying disks and gaseous outflows at high redshift. We find that at the typical NIRSpec/IFU spectral and angular resolution ($\\sim$ 0.05\"/pixel), non-circular motions due to inflows or outflows can mimic the smooth velocity gradient indicative of a disk, and bias measured velocity dispersion upwards by a factor of $2-3\\times$. As a result, the level of rotational support may be underestimated in the NIRSpec/IFU observations. However, the recovered dynamical mass appears to be relatively robust despite biases in $v_\\text{rot}$ and $\\sigma$.",
      "pdf_url": "https://arxiv.org/pdf/2510.01327.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01403",
      "title": "A Compact Symmetric Object Discovered by the VLA Low-band Ionosphere and Transient Experiment",
      "authors": [
        "Kristina Nyland",
        "Mary Rachelle Barrett",
        "Genna Crom",
        "Pallavi Patil",
        "Emil Polisensky",
        "Wendy Peters",
        "Simona Giacintucci",
        "Tracy Clarke",
        "Mark Lacy",
        "Shyaam Mukundan",
        "Dillon Z. Dong",
        "Andy Goulding",
        "Amy E Kimball",
        "Magdalena Kunert-Bajraszewska"
      ],
      "abstract": "A Compact Symmetric Object Discovered by the VLA Low-band Ionosphere and Transient Experiment Kristina Nyland, Mary Rachelle Barrett, Genna Crom, Pallavi Patil, Emil Polisensky, Wendy Peters, Simona Giacintucci, Tracy Clarke, Mark Lacy, Shyaam Mukundan, Dillon Z. Dong, Andy Goulding, Amy E Kimball, Magdalena Kunert-Bajraszewska 10 pages, 8 figures, accepted to ApJ Astrophysics of Galaxies (astro-ph.GA) We present new Very Long Baseline Array (VLBA) imaging of a MHz-peaked spectrum (MPS) source that was found using commensal low-frequency data taken with the Karl G. Jansky Very Large Array (VLA). The source, J0330-2730, was identified in multi-epoch data from the VLA Low-band Ionosphere and Transient Experiment (VLITE). VLITE continuously collects low-frequency data at 340 MHz during regular VLA observations. Our analysis of the VLITE light curve demonstrates that J0330-2730 has significant 340 MHz flux variability at the ~20% level over a timescale of approximately one year. Our VLBA images reveal a resolved, double-lobed morphology with a projected linear size of 64 pc. We consider plausible mechanisms that could explain the observed 340 MHz variability and the source properties on milliarcsecond scales. We rule-out variable Doppler boosting and conclude that refractive interstellar scintillation or variable free-free absorption are the most likely explanations. We argue that the properties of J0330-2730 are consistent with the class of compact symmetric objects (CSOs) and consider the evolutionary stage of the source. The extent of the resolved lobes revealed by the VLBA is significantly smaller than predictions based on the turnover-size relation for a standard synchrotron self-absorbed jet model. We discuss possible explanations for the departure from the turnover-size relation, including jet formation by a transient phenomenon such as a tidal disruption event or a \"frustrated jet\" impeded by the presence of dense gas or a high-pressure environment. This study highlights the potential of VLITE for the identification of compact and young radio sources.",
      "pdf_url": "https://arxiv.org/pdf/2510.01403.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01421",
      "title": "Ly-alpha emission reveals two satellite halos around massive groups at z ~ 3: the puzzling case of a quiescent central galaxy",
      "authors": [
        "Sicen Guo",
        "Emanuele Daddi",
        "Raphael Gobat",
        "Nikolaj B. Sillassen",
        "Chiara D'Eugenio",
        "R. Michael Rich",
        "Guillaume Elias",
        "Manuel Aravena",
        "Franziska Bruckmann",
        "Camila Correa",
        "Ivan Delvecchio",
        "David Elbaz",
        "Sofia G. Gallego",
        "Fabrizio Gentile",
        "Shuowen Jin",
        "Boris S. Kalita",
        "James D. Neill",
        "Manuel Solimano",
        "Francesco Valentino",
        "Tao Wang"
      ],
      "abstract": "Ly-alpha emission reveals two satellite halos around massive groups at z ~ 3: the puzzling case of a quiescent central galaxy Sicen Guo, Emanuele Daddi, Raphael Gobat, Nikolaj B. Sillassen, Chiara D'Eugenio, R. Michael Rich, Guillaume Elias, Manuel Aravena, Franziska Bruckmann, Camila Correa, Ivan Delvecchio, David Elbaz, Sofia G. Gallego, Fabrizio Gentile, Shuowen Jin, Boris S. Kalita, James D. Neill, Manuel Solimano, Francesco Valentino, Tao Wang Resubmitted to A&A after addressing referee comments Astrophysics of Galaxies (astro-ph.GA) We present the discovery and characterisation of two Ly$\\alpha$ nebulae (LANs), RO-1001-Sat and RO-0959-Sat, as satellite structures of two giant LANs at $z=2.920$ and 3.092. They are found neighbouring two out of four known giant LANs at $z\\sim3$ in our MUSE follow-up observations, reinforcing the idea that Ly$\\alpha$ emission can be used to trace massive dark matter halos at high-$z$. This high occurrence of massive satellite halos agrees with simulations. With sizes of $\\simeq80\\times160$ and $80\\times100~\\mathrm{pkpc}^2$, the two nebulae are both $\\sim$300pkpc from the main LANs. The Ly$\\alpha$ emission is only shifted by $\\simeq100-300$ km s$^{-1}$ between each of the two pairs, suggesting connections via large-scale structure. RO-1001-Sat and RO-0959-Sat are estimated to have log$(M_\\mathrm{h}/M_\\odot)\\simeq13.2\\pm0.3$ and $12.8\\pm0.3$, putting them potentially close to the regime of cold-mode accretion. The central brightest galaxies in the two halos are morphologically distinct despite having similar stellar mass $\\sim10^{11}M_\\odot$, one being an elliptical quiescent galaxy in RO-1001-Sat and the other being a dusty star-forming spiral in RO-0959-Sat. Intriguingly, the quiescent galaxy aligns well with the peak of the LAN as well as the potential well of the host halo, making it the first clear-cut case where the cold gas ought to be accreting onto the galaxy but with no observable star formation, either due to morphological quenching or, more likely, radio-mode feedback from an active galactic nucleus. Finally, we show a tentative detection of a Ly$\\alpha$ filament connecting RO-1001 and RO-1001-Sat. This work shows how panoramic MUSE (and in the future, BlueMUSE) observations of massive halo seeds can be used to efficiently search for additional halos, unveiling their large-scale structure and enabling the study of Ly$\\alpha$-selected galaxy groups.",
      "pdf_url": "https://arxiv.org/pdf/2510.01421.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01904",
      "title": "Impact of AGB stars on the chemical evolution of neutron-capture elements",
      "authors": [
        "Gabriele Cescutti",
        "Francesca Matteucci"
      ],
      "abstract": "Impact of AGB stars on the chemical evolution of neutron-capture elements Gabriele Cescutti, Francesca Matteucci 12 pages, 8 figures, accepted on the MDPI journal Universe Astrophysics of Galaxies (astro-ph.GA) In this paper we discuss the impact of the s-process nucleosynthesis in Asymptotic Giant Branch stars on the enrichment of heavy elements. We review the main steps made on this subject in the last 40 years and discuss the importance of modelling the evolution of the abundances of such elements in our Milky Way. From the comparison between model results and observations, we can impose strong constraints on stellar nucleosynthesis as well as on the evolution of the Milky Way.",
      "pdf_url": "https://arxiv.org/pdf/2510.01904.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01999",
      "title": "RAD@home discovery of extragalactic radio rings and odd radio circles: clues to their origins",
      "authors": [
        "Ananda Hota",
        "Pratik Dabhade",
        "Prasun Machado",
        "Joydeep Das",
        "Aarti Muley",
        "Arundhati Purohit"
      ],
      "abstract": "RAD@home discovery of extragalactic radio rings and odd radio circles: clues to their origins Ananda Hota, Pratik Dabhade, Prasun Machado, Joydeep Das, Aarti Muley, Arundhati Purohit 9 pages with 6 figures and one table. Published in MNRAS. Associated Press Releases are at this https URL and this https URL Astrophysics of Galaxies (astro-ph.GA) We present three rare and striking extragalactic radio sources discovered through visual inspection of low-frequency continuum maps from LoTSS DR2 and TGSS by the RAD@home citizen-science collaboratory. The first, RAD J131346.9+500320, is the first clear Odd Radio Circle (ORC) identified in LoTSS. At photometric $z \\sim$ 0.94, it hosts a pair of intersecting rings of ~300 kpc diameter, embedded in diffuse emission extending over ~800 kpc, making it both the most distant and most powerful ORC reported to date. Its steep spectrum $\\alpha_{54}^{144}=1.22\\pm0.15$) points to a relic synchrotron origin. The second object, RAD J122622.6+640622, is a ~865 kpc giant radio galaxy whose southern jet is abruptly deflected, inflating a ~100 kpc limb-brightened ring, while the northern jet terminates in a compact hotspot-like feature. The third, RAD J142004.0+621715 (~440 kpc), shows a comparable ring at the end of its northern filamentary jet, along with a secondary filament parallel to its southern jet. All three systems lie in $\\sim10^{14}M_\\odot$ clusters or group-scale haloes, suggesting that environmental density gradients and possible jet-galaxy interactions play a central role in shaping these ring morphologies. These discoveries expand the zoo of extragalactic radio morphologies, highlight the diversity of pathways that can generate ring-like synchrotron structures, and demonstrate the continuing importance of human pattern recognition in identifying rare sources that escape current automated pipelines.",
      "pdf_url": "https://arxiv.org/pdf/2510.01999.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02045",
      "title": "Improved Radiative Transfer Corrections in Helium Emission Lines",
      "authors": [
        "Oleg Kurichin",
        "Alexandre Ivanchik"
      ],
      "abstract": "Improved Radiative Transfer Corrections in Helium Emission Lines Oleg Kurichin, Alexandre Ivanchik Astrophysics of Galaxies (astro-ph.GA) We present a new detailed model of the He I collisional-recombination spectrum based on the most up-to-date atomic data. The model accounts for radiative transfer effects and the influence of a non-zero optical depth in He I lines arising from transitions to the metastable 2^3S state. The model reveals substantial deviations in the emissivities of the lambda3889 and lambda7065 lines in the case of a non-zero optical depth, with previous models systematically underestimating and overestimating them by 5 to 20 percent, respectively. In the optically thin case, however, our results show good agreement with previous studies. Using the new model, we compute optically thin emissivities for a wide set of UV, optical, and IR He I recombination lines over a fine grid of electron densities and temperatures typical for H II regions and planetary nebulae (1 <= ne <= 10^4 cm^-3, 8000 <= Te <= 22000 K). In addition, we present new fitting formulae for radiative transfer corrections for several He I lines relevant to optical and near-infrared observations, covering 0 <= tau_3889 <= 10 within the same density and temperature ranges. The accuracy of the obtained approximations is <= 0.1 percent within the specified parameter range. These results can be readily implemented in modern codes for determining the primordial 4He abundance and are also applicable to a broader range of spectroscopic analyses of He I emission lines.",
      "pdf_url": "https://arxiv.org/pdf/2510.02045.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02054",
      "title": "Investigating the need for a robust ultraviolet filter set aboard the Habitable Worlds Observatory",
      "authors": [
        "Kyle Cook",
        "Benne Holwerda",
        "Clayton Robertson"
      ],
      "abstract": "Investigating the need for a robust ultraviolet filter set aboard the Habitable Worlds Observatory Kyle Cook, Benne Holwerda, Clayton Robertson 19 pages. Accepted for publication in JATIS Astrophysics of Galaxies (astro-ph.GA) High resolution, ultraviolet imaging is often unavailable across the sky, even in heavily studied fields such as the Chandra Deep Field - South. The Habitable Worlds Observatory is one of two upcoming missions with the possibility of significant UV capabilities, and the only one early enough in development to consider suggestions to its design. In this paper, we conduct an initial study of how current common UV filter sets affect the results of spectral energy distribution fitting for the estimation of galaxy parameter. This initial look is intended to motivate the need for future, more robust, SED fitting of mock galaxies. We compare the broad near UV and far UV filters used by the GALEX mission to the three more narrow Swift UVOT filters. We find that the GALEX filters result in larger errors when calculating the UV beta parameter compared to UVOT, and provide little constraint on the star formation age of a galaxy. We further note the ability of the UVOT filters to investigate the 2175Å attenuation bump; GALEX has a reduced capacity to trace this same feature. Ultimately, we recommend that in order to optimize the effectiveness of HWO's ultraviolet capacity for transformative astrophysics, a minimum of a FUV filter with three medium band NUV filters should be adopted. This will combine the power of GALEX's wavelength range with the finer sampling of UVOT around an important dust feature.",
      "pdf_url": "https://arxiv.org/pdf/2510.02054.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02193",
      "title": "The role of environment in triggering AGN -- evidence for a change at $z\\sim$1",
      "authors": [
        "Jason Reeves",
        "Anna Sajina",
        "Henry Adair",
        "Duncan Farrah",
        "Mark Lacy"
      ],
      "abstract": "The role of environment in triggering AGN -- evidence for a change at $z\\sim$1 Jason Reeves (Tufts University), Anna Sajina (Tufts University), Henry Adair (Drexel University), Duncan Farrah (University of Hawaii, Manoa), Mark Lacy (NRAO) 14 pages, 9 figures, accepted for publication in ApJ Astrophysics of Galaxies (astro-ph.GA) What triggers AGN in some galaxies and what role does this brief period of activity play in the overall evolution of galaxies are still open questions. This paper explores whether or not the local, on scales of $\\approx$1\\,Mpc, galaxy density plays a role in triggering AGN when controlling for stellar mass. We consider this question as a function of redshift and AGN selection in the X-ray vs. in the IR. We use available density maps within the 4.8\\,this http URL. XMM-LSS field in the redshift range $0.1 < z < 1.6$. Our key result is that the environment may play a role in triggering IR AGN. In particular, at $z > 1.2$ the incidence of AGN increases in higher density environments, controlling for stellar mass. However, this dependence reverses at $z < 1.2$ where the incidence of IR AGN is higher in lower density environments. By contrast, among X-ray selected AGN there is no significant local density dependence. Bootstraping analysis confirms these conclusions. While these results agree with previous work on both obscured and unobscured AGN this is the first study to use a consistent methodology across IR and X-ray samples, as well as study IR dependence in this full redshift range. Upcoming large spectroscopic surveys such as the Prime Focus Spectrograph (PFS) galaxy evolution survey will be critical in further elucidating how the environment affects AGN triggering across different cosmic epochs.",
      "pdf_url": "https://arxiv.org/pdf/2510.02193.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02238",
      "title": "Chronology of our Galaxy from Gaia colour-magnitude diagram fitting (ChronoGal): IV. On the inner Milky Way stellar age distribution",
      "authors": [
        "Tomás Ruiz-Lara",
        "David Mirabal",
        "Carme Gallart",
        "Robert Grand",
        "Francesca Fragkoudi",
        "Isabel Pérez",
        "Santi Cassisi",
        "Emma Fernández-Alvar",
        "Anna B. Queiroz",
        "Guillem Aznar-Menargues",
        "Yllari K. González-Koda",
        "Alicia Rivero",
        "Francisco Surot",
        "Guillaume F. Thomas",
        "Rebekka Bieri",
        "Facundo A. Gomez",
        "Rüdiger Pakmor",
        "Freeke van de Voort"
      ],
      "abstract": "Chronology of our Galaxy from Gaia colour-magnitude diagram fitting (ChronoGal): IV. On the inner Milky Way stellar age distribution Tomás Ruiz-Lara, David Mirabal, Carme Gallart, Robert Grand, Francesca Fragkoudi, Isabel Pérez, Santi Cassisi, Emma Fernández-Alvar, Anna B. Queiroz, Guillem Aznar-Menargues, Yllari K. González-Koda, Alicia Rivero, Francisco Surot, Guillaume F. Thomas, Rebekka Bieri, Facundo A. Gomez, Rüdiger Pakmor, Freeke van de Voort 10 pages, 6 figures, accepted for publication in A&A Astrophysics of Galaxies (astro-ph.GA) The Milky Way's inner region is dominated by a stellar bar and a boxy-peanut shaped bulge. However, which stellar populations inhabit the inner Galaxy or how star formation proceeded there is still unknown. The difficulty in studying these stars stems from their location in dense regions that are strongly impacted by extinction and crowding effects. In this work, we use star formation histories computed in the solar neighbourhood using Gaia Colour-Magnitude Diagram fitting to shed light onto the evolution of the central regions of our Galaxy. For that, we have obtained precise age distributions for the non-negligible amount of super metal-rich stars ([M/H] $\\sim$ 0.5) in the solar neighbourhood (more than 5$\\%$ of the total stars within 400 pc of the plane). Assuming that these stars were born in the inner Galaxy and migrated outwards, those distributions should be indicative of the true stellar age distribution in the inner Galaxy. Surprisingly, we find that these age distributions are not continuous but show clear signs of episodic star formation ($\\sim$~13.5, 10.0, 7.0, 4.0, 2.0 and less than 1~Gyr ago). Interestingly, with the exception of the 4~Gyr event, the timings of the detected events coincide with the formation of the primitive Milky Way and with known merging events or satellite encounters (Gaia-Enceladus-Sausage, Sagittarius dwarf galaxy, and the Magellanic Clouds), suggesting that these could have induced enhanced and global star-forming episodes. These results are compatible with a scenario in which Gaia-Enceladus-Sausage is responsible for the formation of the bar 10 Gyr ago. However, we cannot associate any accretion counterpart with the 4-Gyr-ago event, leaving room for a late formation of the bar, as previously proposed. A qualitative comparison with the Auriga Superstars simulations suggesting a possible link to bar dynamics and satellite accretion. [Abridged]",
      "pdf_url": "https://arxiv.org/pdf/2510.02238.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02257",
      "title": "Photometric stellar masses for galaxies in DESI Legacy Imaging Surveys",
      "authors": [
        "Ivana Ebrová",
        "Michal Bílek",
        "Jiří Eliášek"
      ],
      "abstract": "Photometric stellar masses for galaxies in DESI Legacy Imaging Surveys Ivana Ebrová, Michal Bílek, Jiří Eliášek 11 pages, 6 figurs, and appendices; to appear in A&A; script for stellar-mass estimates of galaxies in DESI Legacy Imaging Surveys: this https URL Astrophysics of Galaxies (astro-ph.GA) In many areas of extragalactic astrophysics, we need to convert the luminosity of a galaxy into its stellar mass. In this work, we aim to find a simple and effective formula to estimate the stellar mass from the images of galaxies delivered by the currently popular DESI Legacy Imaging Surveys. This survey provides an unsurpassed combination of a deep imaging with an extensive sky coverage in up to four photometric bands. We calibrated the sought formula against a sample of local galaxies observed by the Spitzer Survey of Stellar Structure in Galaxies (S$^4$G) that was directly dedicated to measure the stellar masses. For the absolute magnitudes $M_g$ and $M_r$ of a galaxy in the Legacy Surveys $g$ and $r$ bands, we find that the stellar masses can be estimated as $0.673M_g - 1.108M_r + 0.996$ with the scatter of 25\\%. Employing more complex functions does not improve the estimate appreciably, even after including the galaxy ellipticity, Sérsic index, or the magnitudes in different Legacy Surveys bands. Generally, measurements in $r$ band were the most helpful ones, while adding $z$-band measurements did not improve the mass estimate much. We provide a Python-based script \\texttt{photomass\\this http URL} to automatically download images of any galaxy from the Legacy Surveys database, create image masks, generate GALFIT input files with well-assessed initial values, perform the GALFIT photometry, and calculate the stellar mass estimate. Additionally, we tuned another version of the formula to the magnitudes provided by the Siena Galaxy Atlas 2020 (SGA-2020) with a scatter of 29\\%. For both\\,--\\,our default and SGA-2020 formula, we offer two alternatives derived from different calibrations of S$^4$G masses that were based on different methods and assumptions.",
      "pdf_url": "https://arxiv.org/pdf/2510.02257.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02303",
      "title": "ALMA Deep Field in SSA22: Reconstructed [CII] Luminosity Function at z = 6",
      "authors": [
        "Natsuki H. Hayatsu",
        "Rob J. Ivison",
        "Paola Andreani",
        "Fabrizia Guglielmetti",
        "Zhi-Yu Zhang",
        "Andy Biggs",
        "Hideki Umehata",
        "Yuichi Matsuda",
        "Naoki Yoshida",
        "Mark A. Swinbank",
        "Kotaro Kohno",
        "Yoichi Tamura",
        "Bunyo Hatsukade",
        "Kouichiro Nakanishi",
        "Yiping Ao",
        "Tohru Nagao",
        "Mariko Kubo",
        "Tsutomu T. Takeuchi",
        "Minju Lee",
        "Takuma Izumi",
        "Soh Ikarashi",
        "Tohru Yamada"
      ],
      "abstract": "ALMA Deep Field in SSA22: Reconstructed [CII] Luminosity Function at z = 6 Natsuki H. Hayatsu, Rob J. Ivison, Paola Andreani, Fabrizia Guglielmetti, Zhi-Yu Zhang, Andy Biggs, Hideki Umehata, Yuichi Matsuda, Naoki Yoshida, Mark A. Swinbank, Kotaro Kohno, Yoichi Tamura, Bunyo Hatsukade, Kouichiro Nakanishi, Yiping Ao, Tohru Nagao, Mariko Kubo, Tsutomu T. Takeuchi, Minju Lee, Takuma Izumi, Soh Ikarashi, Tohru Yamada Accepted to PASJ. 20pages, 20figures Astrophysics of Galaxies (astro-ph.GA) The ADF22 line survey reported detections of two high-$z$ line-emitting source candidates above 6-$\\sigma$, both of which were shown to be spurious after follow-up observations. We investigate the detectability of far-infrared emitters in ALMA deep fields using mock observations by injecting artificial line-emitting sources into the visibility planes. We also discuss our investigation, conducted together with the ALMA operations team, of a possible technical problem in the original observations. Finally, we devise a method to estimate the [CII] luminosity function (LF) at $z \\sim 6$, including a full analysis of signal contamination and sample completeness. The comparison of pixel distributions between the real and mock datacubes does not show significant differences, confirming that the effect of non-Gaussian noise is negligible for the ADF22 datacube. Using 100 blank mock-mosaic datasets, we show 0.43 $\\pm$ 0.67 false detections per datacube with the previous source-finding method. We argue that the underestimation of the contamination rate in the previous work is caused by the smaller number of datacubes, using only 4 real ADF22 datacubes. We compare the results of clump-finding between the time division mode and frequency division mode correlator datacubes and confirm that the velocity widths of the clumps in the TDM case are up to 3 times wider than in the FDM case. The LF estimation using our model shows that a correction for the number count is required, up to one order of magnitude, in the luminosity range of $\\geq 5 \\times 10^8 L_\\odot$. Our reconstruction method for the line LF can be applied to future blind line surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.02303.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01373",
      "title": "Detection of OH maser emission in the 71-year periodic comet 12P/Pons-Brooks using the 40-m Thai National Radio Telescope (TNRT)",
      "authors": [
        "Nobuyuki Sakai",
        "Saran Poshyachinda",
        "Koichiro Sugiyama",
        "Wiphu Rujopakarn",
        "Boonrucksar Soonthornthum",
        "Apichat Leckngam",
        "Busaba Kramer",
        "Phrudth Jaroenjittichai",
        "Bannawit Pimpanuwat",
        "Dan Singwong",
        "Kitipoom Kanjana",
        "Nikom Prasert",
        "Songklod Punyawarin",
        "Spiro Sarris",
        "Teep Chairin",
        "Kamorn Bandudej",
        "Chalunthon Nuchur",
        "Haseng Sani",
        "Nattawit Chanwedchasart",
        "Pathit Chatuphot",
        "Prachayapan Jiraya",
        "Saharat Sathipjan",
        "Adirake Eakwan",
        "Chayanin Larkaew",
        "Settasak Naewchan",
        "Pichate Pha-Kham",
        "Siritida Duangbuppha",
        "Thodsawat Chaichana",
        "Attapon Bunwong",
        "Panupan Doomcome",
        "Anya Poonnawatt",
        "Warakorn Noisapung",
        "Pathorn Sathapornvajana",
        "Naphat Yawilerng",
        "Thita Dilokthanakul",
        "Kritsada Angkaew",
        "Nattawut Chaiwongwan",
        "Jittimat Khanchaiyapoom",
        "Hideyuki Kobayashi",
        "Yu-An Chen",
        "Nawamin Intrarat",
        "Gundolf Wieching",
        "Ewan Barr",
        "Jason Wu",
        "Niclas Esser",
        "Tobias Winchen",
        "Pablo Vicente"
      ],
      "abstract": "Detection of OH maser emission in the 71-year periodic comet 12P/Pons-Brooks using the 40-m Thai National Radio Telescope (TNRT) Nobuyuki Sakai, Saran Poshyachinda, Koichiro Sugiyama, Wiphu Rujopakarn, Boonrucksar Soonthornthum, Apichat Leckngam, Busaba Kramer, Phrudth Jaroenjittichai, Bannawit Pimpanuwat, Dan Singwong, Kitipoom Kanjana, Nikom Prasert, Songklod Punyawarin, Spiro Sarris, Teep Chairin, Kamorn Bandudej, Chalunthon Nuchur, Haseng Sani, Nattawit Chanwedchasart, Pathit Chatuphot, Prachayapan Jiraya, Saharat Sathipjan, Adirake Eakwan, Chayanin Larkaew, Settasak Naewchan, Pichate Pha-Kham, Siritida Duangbuppha, Thodsawat Chaichana, Attapon Bunwong, Panupan Doomcome, Anya Poonnawatt, Warakorn Noisapung, Pathorn Sathapornvajana, Naphat Yawilerng, Thita Dilokthanakul, Kritsada Angkaew, Nattawut Chaiwongwan, Jittimat Khanchaiyapoom, Hideyuki Kobayashi, Yu-An Chen, Nawamin Intrarat, Gundolf Wieching, Ewan Barr, Jason Wu, Niclas Esser, Tobias Winchen, Pablo Vicente Accepted for publication in the Planetary Science Journal (PSJ), 4 figures, 5 tables Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) Although the optical cometary database is extensive, the radio database is limited. The 18-cm OH maser observations of comets allow us to determine (i) the production rate of OH ($Q_{\\rm{OH}}$) and (ii) the water expansion velocity, for each comet. To reveal the physical properties of the periodic comet 12P/Pons-Brooks, we conducted the OH maser observations of the comet using the 40-m TNRT (Thai National Radio Telescope) on March 22nd, 27th and 29th, 2024 before the perihelion passage on April 21st, 2024. We successfully detected 1665 and 1667 MHz OH maser emissions from the comet. The average OH production rates of 12P/Pons-Brooks were determined as 4.28$\\pm$0.30 $\\times$ 10$^{29}$ sec$^{-1}$, 5.21$\\pm$0.42 $\\times$ 10$^{29}$ sec$^{-1}$, and 3.36$\\pm$0.43 $\\times$ 10$^{29}$ sec$^{-1}$ for March 22nd, 27th and 29th, respectively. Combining our results with previous estimates, we find that the OH production rate of 12P/Pons-Brooks shows some fluctuations on timescales of a few days, but gradually increases on longer timescales as the comet approaches the last perihelion. The water expansion velocities of the comet were determined to be 1.55$\\pm$0.14 km s$^{-1}$, 1.55$\\pm$0.35 km s$^{-1}$, and 2.02$^{+0.47}_{-0.45}$ km s$^{-1}$ for the observations on March 22nd, 27th and 29th, respectively. The reason why the errors are different is because the signal to noise ratio is different for each OH maser emission. All expansion velocities are consistent with the individual results of the heuristic law (Tseng et al. 2007) within errors.",
      "pdf_url": "https://arxiv.org/pdf/2510.01373.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01405",
      "title": "Advancing Interstellar Science: A Global Framework for Comprehensive Study of Interstellar Objects",
      "authors": [
        "Omer Eldadi",
        "Gershon Tenenbaum",
        "Abraham Loeb"
      ],
      "abstract": "Advancing Interstellar Science: A Global Framework for Comprehensive Study of Interstellar Objects Omer Eldadi, Gershon Tenenbaum, Abraham Loeb Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR) The operation of the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) marks a transformative moment in humanity's capacity to detect and characterize interstellar objects (ISOs). With projections indicating an increase from a few detections per decade to potentially one every few months, humanity stands at the threshold of unprecedented scientific opportunity offering revolutionary insights into the nature of rocky materials, building blocks of life and technological products from other star systems. This white paper proposes the establishment of the United Nations Committee on Interstellar Objects (UNCIO), a specialized body designed to coordinate global scientific research, maximize observational coverage, and ensure optimal scientific return from these extraordinary objects from outside the solar system through systematic investigation in cosmochemistry, astrobiology, planetary sciences, fundamental physics, advanced technologies and materials science. The proposed framework addresses critical gaps in our current international infrastructure: the absence of coordinated detection, classification and intercept capabilities, insufficient protocols for rapid scientific response and international policy decisions to time-sensitive observations, and the need for effective science communication to maintain government and public support for these ambitious investigations and global threats to Earth. Drawing from successful international collaborations in areas such as the International Space Station (ISS) and the European Organization for Nuclear Research (CERN), UNCIO would operate through a dual structure: an executive board for time-critical scientific decisions and an expanded committee for comprehensive stakeholder representation. This initiative is not merely aspirational but urgently practical.",
      "pdf_url": "https://arxiv.org/pdf/2510.01405.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01747",
      "title": "Discovery of an Accretion Burst in a Free-Floating Planetary-Mass Object",
      "authors": [
        "V. Almendros-Abad",
        "A. Scholz",
        "B. Damian",
        "R. Jayawardhana",
        "A. Bayo",
        "L. Flagg",
        "K. Muzic",
        "A. Natta",
        "P. Pinilla",
        "L. Testi"
      ],
      "abstract": "Discovery of an Accretion Burst in a Free-Floating Planetary-Mass Object V. Almendros-Abad, A. Scholz, B. Damian, R. Jayawardhana, A. Bayo, L. Flagg, K. Muzic, A. Natta, P. Pinilla, L. Testi Solar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We report the discovery of a long-lasting burst of disk accretion in Cha J11070768-7626326 (Cha 1107-7626), a young, isolated, 5-10 M$_{\\mathrm{Jupiter}}$ object. In spectra taken with XSHOOTER at ESO's Very Large Telescope as well as NIRSPEC and MIRI on the James Webb Space Telescope, the object transitions from quiescence in April-May 2025 to a strongly enhanced accretion phase in June-August 2025. The line flux changes correspond to a 6-8-fold increase in the mass accretion rate, reaching $10^{-7}$ M$_{\\mathrm{Jupiter}}$yr$^{-1}$, the highest measured in a planetary-mass object. During the burst, the H$\\alpha$ line develops a double-peaked profile with red-shifted absorption, as observed in stars and brown dwarfs undergoing magnetospheric accretion. The optical continuum increases by a factor of 3-6; the object is $\\sim$1.5-2 mag brighter in the R-band during the burst. Mid-infrared continuum fluxes rise by 10-20%, with clear changes in the hydrocarbon emission lines from the disk. We detect water vapour emission at 6.5-7 $\\mu m$, which were absent in quiescence. By the end of our observing campaign, the burst was still ongoing, implying a duration of at least two months. A 2016 spectrum also shows high accretion levels, suggesting that this object may undergo recurring bursts. The observed event is inconsistent with typical variability in accreting young stars and instead matches the duration, amplitude and line spectrum of an EXor-type burst, making Cha1107-7626 the first substellar object with evidence of a potentially recurring EXor burst.",
      "pdf_url": "https://arxiv.org/pdf/2510.01747.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01856",
      "title": "Low- and high-velocity `water fountains': different evolutionary stages",
      "authors": [
        "Roldán A. Cala",
        "Luis F. Miranda",
        "José F. Gómez",
        "Keiichi Ohnaka"
      ],
      "abstract": "Low- and high-velocity `water fountains': different evolutionary stages Roldán A. Cala, Luis F. Miranda, José F. Gómez, Keiichi Ohnaka 6 pages, 2 figures, 2 tables. Accepted for publication in A&A Letter Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) `Water fountains' (WFs) are optically obscured evolved stars, most of them thought to be in the post-asymptotic giant branch (post-AGB) phase, characterized by H$_{2}$O maser emission tracing molecular jets. Interestingly, four WFs (IRAS 15445$-$5449, IRAS 18019$-$2216, IRAS 18443$-$0231, and IRAS 18464$-$0140) and one WF candidate (IRAS 18480+0008) are potential planetary nebulae (PNe) because they exhibit radio continuum emission, suggesting the presence of a photoionized region characteristic of PNe. To classify these objects, we obtained K-band (2.0-2.3 $\\mu$m) spectra of these WFs, including the only WF PN known (IRAS 15103$-$5754) for comparison. Our spectra reveal two group of sources: (i) `low-velocity' WFs with H$_2$O maser velocity spread of $\\lesssim$50 km s$^{-1}$ (IRAS 18019$-$2216, IRAS 18464$-$0140, and IRAS 18480+0008) showing the CO band at 2.29 $\\mu$m in absorption, typical of cool giant stars, and no emission lines; and (ii) `high-velocity' WFs, velocity spread of $\\gtrsim$50 km s$^{-1}$ (IRAS 15103$-$5754, IRAS 15445$-$5449, and IRAS 18443$-$0231), exhibiting emission lines of Br$\\gamma$, He I, and H$_2$, consistent with hotter central stars and/or shock-excited emission. The emission line ratios of these lines in IRAS 18443$-$0231 indicates that it may be a nascent PN. The spectrum of IRAS 15445$-$5449 also shows a CO band and Na I doublet in emission, suggesting the presence of a compact circumstellar disk and/or active mass loss. These results favor the previously suggested notion that the difference between low- and high-velocity WFs is not simply a projection effect but reflects intrinsically different evolutionary stages. Moreover, the results are also consistent with the idea of an increase in the jet ejection velocity as the post-AGB evolution proceeds.",
      "pdf_url": "https://arxiv.org/pdf/2510.01856.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02179",
      "title": "Near-infrared photometry of the central stars of planetary nebulae with the VVVX survey",
      "authors": [
        "Dante Minniti , Vasiliki Fragkou , Javier Alonso-García , Daniel Majaess , Arianna Cortesi Instituto de Astrofísica, Depto. de. Física y Astronomía, Facultad de Ciencias Exactas, Universidad Andrés Bello, Santiago, Chile, Vatican Observatory, V00120 Vatican City State, Italy, Observatório do Valongo, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brasil, Centro de Astronomía , Universidad de Antofagasta, Antofagasta, Chile, Mount Saint Vincent University, Halifax, Canada, Instituto de Física, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brasil)"
      ],
      "abstract": "Near-infrared photometry of the central stars of planetary nebulae with the VVVX survey Dante Minniti (1 and 2), Vasiliki Fragkou (3), Javier Alonso-García (4), Daniel Majaess (5), Arianna Cortesi (3 and 6) ((1) Instituto de Astrofísica, Depto. de. Física y Astronomía, Facultad de Ciencias Exactas, Universidad Andrés Bello, Santiago, Chile, (2) Vatican Observatory, V00120 Vatican City State, Italy, (3) Observatório do Valongo, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brasil, (4) Centro de Astronomía (CITEVA), Universidad de Antofagasta, Antofagasta, Chile, (5) Mount Saint Vincent University, Halifax, Canada, (6) Instituto de Física, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brasil) Solar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA) Achieving accurate photometric characterizations of central stars of planetary nebulae (CSPNe) toward the galactic plane is significantly hindered by the high levels of interstellar extinction in these regions. However, near-infrared (NIR) observations offer a more effective alternative, as extinction is substantially reduced at these wavelengths. By mitigating the effects of interstellar extinction via NIR observations of the Galactic disk and bulge, we seek to improve the identification and characterization of CSPNe in these regions, enabling a deeper understanding of their properties and evolutionary status. We used NIR photometry from the VISTA Variables in the Vía Láctea (VVV) survey and its extension VVVX to define the NIR photometry of a large sample of CSPNe recently identified with Gaia EDR3 data. We explored the optical and NIR properties of all CSPNe in our sample and searched for eclipsing binary candidates among them by employing relevant catalogs. We present a homogeneous catalog of 1274 CSPNe, including their Z, Y, H, J, and K NIR magnitudes and errors. We also include our findings on the photometric properties of our sample. We report 14 CSPNe with a large IR excess indicating cool companions and/or surrounding discs and 56 eclipsing binary candidates. Based on the present VVVX CSPN catalog, we conclude that NIR photometry can prove valuable for further and in-depth studies of CSPNe. Subsequent studies ought to focus on exploring the true nature of the CSPNe that present IR excess as well as eclipsing-binary CSPNe candidates.",
      "pdf_url": "https://arxiv.org/pdf/2510.02179.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.02090",
      "title": "The brightest X-ray AGNs at redshift $3\\lesssim z \\lesssim 6$",
      "authors": [
        "Cameron Heather",
        "Teeraparb Chantavat",
        "Siri Chongchitnan",
        "Poemwai Chainakun"
      ],
      "abstract": "The brightest X-ray AGNs at redshift $3\\lesssim z \\lesssim 6$ Cameron Heather, Teeraparb Chantavat, Siri Chongchitnan, Poemwai Chainakun 9 pages, 6 figures, MNRAS accepted Astrophysics of Galaxies (astro-ph.GA) Given recent X-ray observations of high-redshift active galactic nuclei (AGNs), we consider whether the extreme luminosities of these AGNs are consistent with current semi-analytical models. In particular, we apply extreme-value statistics (EVS) to obtain predictions of extreme X-ray luminosities of AGNs in the redshift range $3\\lesssim z\\lesssim 6$. We apply this formalism using different X-ray luminosity functions and compare the predicted extreme luminosities to AGNs in the Stripe 82 X-ray catalogue. We find a general consistency between data and the EVS predictions although there is some tension with certain luminosity functions. We discuss possible extensions to this model, including extrapolating our results to even higher redshifts ($z\\gtrsim10$) where AGNs have recently been observed.",
      "pdf_url": "https://arxiv.org/pdf/2503.02090.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.05720",
      "title": "The AGORA High-resolution Galaxy Simulations Comparison Project. VIII: Disk Formation and Evolution of Simulated Milky Way Mass Galaxy Progenitors at $1<z<5$",
      "authors": [
        "Minyong Jung",
        "Ji-hoon Kim",
        "Thinh H. Nguyen",
        "Ramon Rodriguez-Cardoso",
        "Santi Roca-Fàbrega",
        "Joel R. Primack",
        "Kirk Barrow",
        "Anna Genina",
        "Pablo Granizo",
        "Hyeonyong Kim",
        "Kentaro Nagamine",
        "Yuri Oku",
        "Johnny W. Powell",
        "Yves Revaz",
        "Héctor Velázquez",
        "Alessandro Lupi",
        "Ikkoh Shimizu",
        "Tom Abel",
        "Oscar Agertz",
        "Renyue Cen",
        "Daniel Ceverino",
        "Avishai Dekel",
        "Chaerin Jeong",
        "Lucio Mayer",
        "Boon Kiat Oh",
        "Thomas Quinn",
        "Hyunmi Song"
      ],
      "abstract": "The AGORA High-resolution Galaxy Simulations Comparison Project. VIII: Disk Formation and Evolution of Simulated Milky Way Mass Galaxy Progenitors at $1<z<5$ Minyong Jung, Ji-hoon Kim, Thinh H. Nguyen, Ramon Rodriguez-Cardoso, Santi Roca-Fàbrega, Joel R. Primack, Kirk Barrow, Anna Genina, Pablo Granizo, Hyeonyong Kim, Kentaro Nagamine, Yuri Oku, Johnny W. Powell, Yves Revaz, Héctor Velázquez, Alessandro Lupi, Ikkoh Shimizu, Tom Abel, Oscar Agertz, Renyue Cen, Daniel Ceverino, Avishai Dekel, Chaerin Jeong, Lucio Mayer, Boon Kiat Oh, Thomas Quinn, Hyunmi Song (for The AGORA Collaboration) Accepted for publication in ApJ, 22 pages, 12 figures (main text), Visit the AGORA Collaboration website (this https URL) for more information. For summary video, please see this https URL Astrophysics of Galaxies (astro-ph.GA) We investigate how differences in the stellar feedback produce disks with different morphologies in Milky Way-like progenitors over 1 $\\leq z \\leq 5$, using eight state-of-the-art cosmological hydrodynamics simulation codes in the \\textit{AGORA} project. In three of the participating codes, a distinct, rotation-dominated inner core emerges with a formation timescale of $\\lesssim 300$ Myr, largely driven by a major merger event, while two other codes exhibit similar signs of wet compaction -- gaseous shrinkage into a compact starburst phase -- at earlier epochs. The remaining three codes show only weak evidence of wet compaction. Consequently, we divide the simulated galaxies into two groups: those with strong compaction signatures and those with weaker ones. Galaxies in these two groups differ in size, stellar age gradients, and disk-to-total mass ratios. Specifically, codes with strong wet compaction build their outer disks in an inside-out fashion, leading to negative age gradients, whereas codes with weaker compaction feature flat or positive age gradients caused primarily by outward stellar migration. Although the stellar half-mass radii of these two groups diverge at $z \\sim 3$, the inclusion of dust extinction brings their sizes and shapes in mock observations closer to each other and to observed galaxies. We attribute the observed morphological differences primarily to variations in the stellar feedback implementations -- such as delayed cooling timescales, and feedback strengths -- that regulate both the onset and duration of compaction. Overall, our results suggest that disk assembly at high redshifts is highly sensitive to the details of the stellar feedback prescriptions in simulations.",
      "pdf_url": "https://arxiv.org/pdf/2505.05720.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.11664",
      "title": "From FFB Starbursts at Cosmic Dawn to Quenching at Cosmic Morning: Hi-z Galaxy Bimodality",
      "authors": [
        "Avishai Dekel",
        "Nir Mandelker",
        "Zhaozhou Li",
        "Zhiyuan Yao",
        "Bocheng Zhu",
        "Sharon Lapiner",
        "Dhruba Dutta Chowdhury",
        "Omri Ginzburg"
      ],
      "abstract": "From FFB Starbursts at Cosmic Dawn to Quenching at Cosmic Morning: Hi-z Galaxy Bimodality Avishai Dekel, Nir Mandelker, Zhaozhou Li, Zhiyuan Yao, Bocheng Zhu, Sharon Lapiner, Dhruba Dutta Chowdhury, Omri Ginzburg Astrophysics of Galaxies (astro-ph.GA) We propose a mass-dependent bimodality in the early evolution of galaxies. The massive track connects the super-bright galaxies at cosmic dawn ($z > 8$) to the super-massive quiescent galaxies and black holes (BHs) at cosmic morning ($z \\sim 4 - 7$). The dark-matter halos $> 10^{10.5} {\\rm M}_\\odot$ at $z = 10$ are expected to undergo feedback-free starbursts (FFB) with high star-formation efficiency in dense star clusters within compact galaxies. The less massive halos avoid FFB and form stars gradually under stellar feedback, possibly leading to the peak star-forming galaxies at cosmic noon ($z \\sim 1-3$). The FFB and non-FFB halos originate from $>4\\sigma$ and $2-3\\sigma$ density peaks, respectively. The post-FFB galaxies quench their star formation soon after the FFB phase and remain quiescent due to (a) gas depletion by the FFB starbursts and outflows, (b) compaction events driven by angular-momentum loss in colliding streams within the high-sigma-peak FFB halos, (c) turbulent circum-galactic medium (CGM) that suppresses feeding by cold streams, and (d) BH feedback, being a key for complete quenching. BH feedback is enhanced by FFB-driven BH seeding and growth. It seems capable of disrupting the streams by generating CGM turbulence or photo-heating, but this remains an open challenge. The cosmic-morning quiescent galaxies are expected to be massive, compact, showing signatures of compaction, outflows and AGN, with a comoving number density $\\sim 10^{-5} {\\rm Mpc}^{-3}$, comparable to the super-bright galaxies at cosmic dawn and the AGN at cosmic morning. Their UV luminosity function is predicted to peak about $M_ {\\rm uv} \\sim -22$ and contribute $\\sim 10\\%$ of the galaxies there.",
      "pdf_url": "https://arxiv.org/pdf/2506.11664.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.22863",
      "title": "Formation of over-massive black holes in high-redshift disk galaxies via globular cluster accretion",
      "authors": [
        "Hidenobu Yajima"
      ],
      "abstract": "Formation of over-massive black holes in high-redshift disk galaxies via globular cluster accretion Hidenobu Yajima Astrophysics of Galaxies (astro-ph.GA) Recent observations with the James Webb Space Telescope (JWST) have suggested the existence of over-massive black holes (OMBHs) in high-redshift galaxies. In this paper, we propose a new mechanism for the formation of OMBHs, based on the accretion of globular clusters (GCs) in compact disk galaxies. We derive the conditions under which OMBHs can form, focusing on key parameters such as halo mass, redshift, and halo spin parameter. Our results show that at redshift $z = 10$, a halo with mass $10^{11}~M_{\\odot}$ and a spin parameter of $\\sim 0.02$ can form a black hole of $2.3 \\times 10^{8}~M_{\\odot}$ through GC migration and accretion via tidal disruption events (TDEs). The resulting black hole-to-stellar mass ratio can reach $\\sim 0.1$, corresponding to the fraction of GC mass accreted onto the black hole. This mechanism thus provides a plausible explanation for the OMBHs observed by JWST. Furthermore, by combining our model with the halo mass function and the spin-parameter distribution, we construct black hole mass functions that reproduce the number densities of the massive BH candidates UHZ1 and GHZ9 at $z \\approx 10$, as well as the abundances of BHs with masses $\\gtrsim 10^{8}~\\rm{M_\\odot}$ at $z \\approx 5$ inferred from JWST observations. However, our model overpredicts the abundance of BHs with masses $ < 10^{8}~\\rm{M_\\odot}$, suggesting that moderately massive, inactive BHs are more frequent.",
      "pdf_url": "https://arxiv.org/pdf/2507.22863.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.02027",
      "title": "The ALPINE-CRISTAL-JWST Survey: Revealing Less Massive Black Holes in High-Redshift Galaxies",
      "authors": [
        "Wenke Ren",
        "John D. Silverman",
        "Andreas L. Faisst",
        "Seiji Fujimoto",
        "Lin Yan",
        "Zhaoxuan Liu",
        "Akiyoshi Tsujita",
        "Manuel Aravena",
        "Rebecca L. Davies",
        "Ilse De Looze",
        "Miroslava Dessauges-Zavadsky",
        "Rodrigo Herrera-Camus",
        "Edo Ibar",
        "Gareth C. Jones",
        "Jeyhan S. Kartaltepe",
        "Anton M. Koekemoer",
        "Yu-Heng Lin",
        "Ikki Mitsuhashi",
        "Juan Molina",
        "Ambra Nanni",
        "Monica Relano",
        "Michael Romano",
        "David B. Sanders",
        "Manuel Solimano",
        "Enrico Veraldi",
        "Vicente Villanueva",
        "Wuji Wang",
        "Giovanni Zamorani"
      ],
      "abstract": "The ALPINE-CRISTAL-JWST Survey: Revealing Less Massive Black Holes in High-Redshift Galaxies Wenke Ren, John D. Silverman, Andreas L. Faisst, Seiji Fujimoto, Lin Yan, Zhaoxuan Liu, Akiyoshi Tsujita, Manuel Aravena, Rebecca L. Davies, Ilse De Looze, Miroslava Dessauges-Zavadsky, Rodrigo Herrera-Camus, Edo Ibar, Gareth C. Jones, Jeyhan S. Kartaltepe, Anton M. Koekemoer, Yu-Heng Lin, Ikki Mitsuhashi, Juan Molina, Ambra Nanni, Monica Relano, Michael Romano, David B. Sanders, Manuel Solimano, Enrico Veraldi, Vicente Villanueva, Wuji Wang, Giovanni Zamorani 23 pages, 13 figures, MNRAS accepted Astrophysics of Galaxies (astro-ph.GA) We present a systematic search for broad-line active galactic nuclei (AGNs) in the ALPINE-CRISTAL-JWST sample of 18 star-forming galaxies ($M_\\star>10^{9.5}~M_{\\odot}$) at redshifts $z=4.4-5.7$. Using JWST/NIRSpec IFU, we identify 7 AGN candidates through the detection of broad \\Ha\\ emission lines from 33 aperture spectra centred on photometric peaks. These candidates include one highly robust AGN detection with FWHM $\\sim$ 2800 \\kms\\ and six showing broad components with FWHM $\\sim 600-1600$ \\kms, with two in a merger system. We highlight that only broad-line detection is effective since these candidates uniformly lie within narrow emission-line ratio diagnostic diagrams where star-forming galaxies and AGNs overlap. The broad-line AGN fraction ranges from 5.9\\% to 33\\%, depending on the robustness of the candidates. Assuming that the majority are AGNs, the relatively high AGN fraction is likely due to targeting high-mass galaxies, where simulations demonstrate that broad-line detection is more feasible. Their black hole masses range from $10^6$ to $10^{7.5}~M_{\\odot}$ with $0.1 \\lesssim L_{\\rm bol}/L_{\\rm Edd}\\lesssim 1$. Counter to previous JWST studies at high redshift that found overmassive black holes relative to their host galaxies, our candidates lie close to or below the local $M_{\\rm BH}-M_\\star$ scaling relations, thus demonstrating the effect of selection biases. This study provides new insights into AGN-host galaxy co-evolution at high redshift by identifying faint broad-line AGNs in galaxy samples, highlighting the importance of considering mass-dependent selection biases and the likelihood of a large population of AGNs being undermassive and just now being tapped by JWST.",
      "pdf_url": "https://arxiv.org/pdf/2509.02027.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.02690",
      "title": "The Interstellar Medium in I Zw 18 seen with JWST/MIRI: II. Warm Molecular Hydrogen and Warm Dust",
      "authors": [
        "L. K. Hunt",
        "B. T. Draine",
        "M. G. Navarro",
        "A. Aloisi",
        "R. J. Rickards Vaught",
        "A. Adamo",
        "F. Annibali",
        "D. Calzetti",
        "S. Hernandez",
        "B. L. James",
        "M. Mingozzi",
        "R. Schneider",
        "M. Tosi",
        "B. Brandl",
        "M. G. del Valle-Espinosa",
        "F. Donnan",
        "A. S. Hirschauer",
        "M. Meixner",
        "D. Rigopoulou"
      ],
      "abstract": "The Interstellar Medium in I Zw 18 seen with JWST/MIRI: II. Warm Molecular Hydrogen and Warm Dust L. K. Hunt, B. T. Draine, M. G. Navarro, A. Aloisi, R. J. Rickards Vaught, A. Adamo, F. Annibali, D. Calzetti, S. Hernandez, B. L. James, M. Mingozzi, R. Schneider, M. Tosi, B. Brandl, M. G. del Valle-Espinosa, F. Donnan, A. S. Hirschauer, M. Meixner, D. Rigopoulou 27 pages, 2 appendices, 14 figures, accepted for publication in ApJ. Updated to correct Figure 1 Astrophysics of Galaxies (astro-ph.GA) We present JWST/MIRI spectra from the Medium-Resolution Spectrometer of IZw18, a nearby dwarf galaxy with a metallicity of $\\sim 3$% Solar. Here, we investigate warm molecular hydrogen, H2, observed in spectra extracted in $\\sim 120$ pc apertures centered on eleven regions of interest. We detect 7 H2 rotational lines, some of which are among the weakest ever measured. The H2 population diagrams are fit with local-thermodynamic-equilibrium models and models of photodissociation regions. We also fit the ortho-/para-H2 ratios (OPRs); in three of the six regions for which it was possible to fit the OPR, we find values significantly greater than 3, the maximum value for local thermodynamic equilibrium. To our knowledge, although predicted theoretically, this is the first time that OPR significantly $> 3$ has been measured in interstellar gas. We find that OPR tends to increase with decreasing H2 column density, consistent with the expected effects of self-shielding in advancing photodissociation fronts. The population diagrams are consistent with H nucleon densities of $\\sim 10^5$ cm$^{-3}$, and an interstellar radiation field scaling factor, G0, of $\\sim 10^3$. This warm, dense H2 gas co-exists with the same highly ionized gas that emits [OIV] and [NeV]. Emission from T $\\geq 50$K dust is detected, including an as-yet unidentified dust emission feature near 14 $\\mu$m; possible identification as Al$_2$O$_3$ is discussed. The continuum emission from several regions requires that a considerable fraction of the refractory elements be incorporated in dust. Despite stacking spectra in the SE where H2 is found, no significant emission from polycyclic aromatic hydrocarbons is detected.",
      "pdf_url": "https://arxiv.org/pdf/2509.02690.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.08045",
      "title": "The JWST Emission Line Survey (JELS): The sizes and merger fraction of star-forming galaxies during the Epoch of Reionization",
      "authors": [
        "H. M. O. Stephenson",
        "J. P. Stott",
        "C. A. Pirie",
        "K. J. Duncan",
        "D. J. McLeod",
        "P. N. Best",
        "M. Brinch",
        "M. Clausen",
        "R. K. Cochrane",
        "J. S. Dunlop",
        "S. R. Flury",
        "J. E. Geach",
        "C. L. Hale",
        "E. Ibar",
        "Zefeng Li",
        "J. Matthee",
        "R. J. McLure",
        "L. Ossa-Fuentes",
        "A. L. Patrick",
        "D. Sobral",
        "A. M. Swinbank"
      ],
      "abstract": "The JWST Emission Line Survey (JELS): The sizes and merger fraction of star-forming galaxies during the Epoch of Reionization H. M. O. Stephenson (Lancaster), J. P. Stott, C. A. Pirie, K. J. Duncan, D. J. McLeod, P. N. Best, M. Brinch, M. Clausen, R. K. Cochrane, J. S. Dunlop, S. R. Flury, J. E. Geach, C. L. Hale, E. Ibar, Zefeng Li, J. Matthee, R. J. McLure, L. Ossa-Fuentes, A. L. Patrick, D. Sobral, A. M. Swinbank 21 pages, 11 figures. This paper has been resubmitted to MNRAS after one round of minor referee comments Astrophysics of Galaxies (astro-ph.GA) We used observations from the JWST Emission Line Survey (JELS) to measure the half-light radii ($r_{e}$) of 23 H$\\alpha$-emitting star-forming (SF) galaxies at $z=6.1$ in the PRIMER/COSMOS field. Galaxy sizes were measured in JWST Near-infrared Camera observations in rest-frame H$\\alpha$ (tracing recent star formation) with the F466N and F470N narrowband filters from JELS, and compared against rest-$R$-band, $V$-band (tracing established stellar populations) and near-ultraviolet sizes. We find a size-stellar mass ($r_{e}-M_{*}$) relationship with a slope that is consistent with literature values at lower redshifts, though offset to lower sizes. We observe a large scatter in $r_{e}$ at low stellar mass ($M_{*}<10^{8.4}$ M$_{\\odot}$) which we believe is the result of bursty star formation histories (SFHs) of SF galaxies at the Epoch of Reionization (EoR). We find that the stellar and ionised gas components are similar in size at $z=6.1$. The evidence of already-established stellar components in these H$\\alpha$ emitters (HAEs) indicates previous episodes of star formation have occurred. As such, following other JELS studies finding our HAEs are undergoing a current burst of star formation, we believe our results indicate that SF galaxies at the end of the EoR have already experienced a bursty SFH. From our $r_{e}-M_{*}$ relationship, we find $r_{e, \\text{F444W}}=0.76\\pm0.46$ kpc for fixed stellar mass $M_{*}=10^{9.25}$ M$_{\\odot}$, which is in agreement with other observations and simulations of star forming galaxies in the literature. We find a close-pair (major) merger fraction of ($f_{\\text{maj. merger}}=0.44\\pm0.22$) $f_{\\text{merger}}=0.43\\pm0.11$ for galaxy separations $d\\lesssim25$ kpc, which is in agreement with other $z\\approx6$ studies.",
      "pdf_url": "https://arxiv.org/pdf/2509.08045.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19184",
      "title": "Lyman-$α$ Escape through Anisotropic Media",
      "authors": [
        "Silvia Almada Monter",
        "Max Gronke",
        "Seok-Jun Chang"
      ],
      "abstract": "Lyman-$α$ Escape through Anisotropic Media Silvia Almada Monter, Max Gronke, Seok-Jun Chang Astrophysics of Galaxies (astro-ph.GA) The escape of Lyman-$\\alpha$ (Ly$\\alpha$) radiation encodes valuable information on the neutral interstellar medium and is often used as a proxy for the escape of ionizing photons. Yet, the theory of Ly$\\alpha$ transfer through anisotropic gas distributions remains underdeveloped. We present Monte Carlo radiative transfer simulations of Ly$\\alpha$ propagation through porous, inhomogeneous neutral gas, systematically exploring the effects of channel geometry, outflows, dust, and lognormally distributed column densities. We find that Ly$\\alpha$ photons do not preferentially escape through the lowest-column-density pathways, but instead traverse channels of substantial optical depth, leading to suppressed central flux and the absence of strongly beamed escape. Subdividing channels has little impact, indicating that geometry and covering fraction are more important than porosity. Channels containing moderate amounts of neutral hydrogen alter escape in characteristic ways, including the appearance of quadruple-peaked spectra, which can be captured by a simple flux-channel relation. Outflows reshape the spectra by facilitating escape through dense media, redshifting photons and blending central features, while dust modulates the visibility of small channels by suppressing flux at line center; in both cases, we develop an analytical model that predicts the resulting central fluxes. Extending to lognormal column density fields, we show that Ly$\\alpha$ photons probe a broad range of optical depths, producing skewed spectra that can be approximated by weighted sums of homogeneous models. Our results have direct implications for using Ly$\\alpha$ as a tracer of gas properties and ionizing photon escape; for instance, spectra suggestive of high column densities may nonetheless allow LyC leakage through narrow channels.",
      "pdf_url": "https://arxiv.org/pdf/2509.19184.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20444",
      "title": "SAGAbg III: Environmental Stellar Mass Functions, Self-Quenching, and the Stellar-to-Halo Mass Relation in the Dwarf Galaxy Regime",
      "authors": [
        "Erin Kado-Fong",
        "Yao-Yuan Mao",
        "Yasmeen Asali",
        "Marla Geha",
        "Risa H. Wechsler",
        "Mithi A. C. de los Reyes",
        "Yunchong Wang",
        "Ethan O. Nadler",
        "Nitya Kallivayalil",
        "Erik J. Tollerud",
        "Benjamin Weiner"
      ],
      "abstract": "SAGAbg III: Environmental Stellar Mass Functions, Self-Quenching, and the Stellar-to-Halo Mass Relation in the Dwarf Galaxy Regime Erin Kado-Fong, Yao-Yuan Mao, Yasmeen Asali, Marla Geha, Risa H. Wechsler, Mithi A. C. de los Reyes, Yunchong Wang, Ethan O. Nadler, Nitya Kallivayalil, Erik J. Tollerud, Benjamin Weiner 34 pages, 12 figures, 6 pages; submitted to ApJ Astrophysics of Galaxies (astro-ph.GA) Recent efforts have extended our view of the number and properties of satellite galaxies beyond the Local Group firmly down to $\\rm M_\\star\\sim 10^6 M_\\odot$. A similarly complete view of the field dwarf population has lagged behind. Using the background galaxies sample from the Satellites Around Galactic Analogs (SAGA) Survey at $z<0.05$, we take inventory of the dwarf population down to $\\rm M_\\star \\sim 5\\times10^6 M_\\odot$ using three metrics: the stellar mass function (SMF) as function of environment, the stellar-to-halo mass relation (SHMR) of dwarf galaxies inferred via abundance matching, and the quenched fraction of highly isolated dwarfs. We find that the low-mass SMF shape shows minimal environmental dependence, with the field dwarf SMF described by a low-mass power-law index of $\\alpha_1=-1.44\\pm0.09$ down to $\\rm M_\\star \\sim 5\\times10^6 M_\\odot$, and that the quenched fraction of isolated dwarfs drops monotonically to $f_{q} \\sim 10^{-3}$ at $\\rm M_\\star \\sim \\rm 10^{8.5} M_\\odot$. Though slightly steeper than estimates from \\HI{} kinematic measures, our inferred SHMR agrees with literature measurements of satellite systems, consistent with minimal environmental dependence of the SHMR in the probed mass range. Finally, although most contemporary cosmological simulations against which we compare accurately predict the \\sagalocal{} SHMR, we find that big-box cosmological simulations largely over-predict isolated galaxy quenched fractions via a turnaround in $f_q(\\rm M_\\star)$ at $\\rm 10^8\\lesssim M_\\star/M_\\odot\\lesssim 10^9$, underscoring the complexities in disentangling the drivers of galaxy formation and the need for systematic multidimensional observations of the dwarf population across environments.",
      "pdf_url": "https://arxiv.org/pdf/2509.20444.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25362",
      "title": "Machine Learning the Dark Matter Halo Mass of the Milky Way",
      "authors": [
        "Elaheh Hayati",
        "Peter Behroozi",
        "Ekta Patel",
        "Yunchong Wang",
        "Stefan Gottlöber",
        "Gustavo Yepes"
      ],
      "abstract": "Machine Learning the Dark Matter Halo Mass of the Milky Way Elaheh Hayati, Peter Behroozi, Ekta Patel, Yunchong Wang, Stefan Gottlöber, Gustavo Yepes Astrophysics of Galaxies (astro-ph.GA) Although numerous dynamical techniques have been developed to estimate the total dark matter halo mass of the Milky Way, it remains poorly constrained, with typical systematic uncertainties of 0.3 dex. In this study, we apply a neural network-based approach that achieves high mass precision without several limitations that have affected past approaches; for example, we do not assume dynamical equilibrium, nor do we assume that neighboring galaxies are bound satellites. Additionally, this method works for a broad mass range, including for halos that differ significantly from the Milky Way. Our model relies solely on observable dynamical quantities, such as satellite orbits, distances to larger nearby halos, and the maximum circular velocity of the most massive satellite. In this paper, we measure the halo mass of the Milky Way to be log_10 M_vir / M_Sun = 12.20^{+0.163}_{-0.138}. Future studies in this series will extend this methodology to estimate the dark matter halo mass of M31, and develop new neural networks to infer additional halo properties including concentration, assembly history, and spin axis.",
      "pdf_url": "https://arxiv.org/pdf/2509.25362.pdf",
      "categories": [
        "astro-ph.GA"
      ],
      "primary_category": "astro-ph.GA",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01441",
      "title": "Diffusion Modeling of the Three-Dimensional Magnetic Field in the Sun's Corona",
      "authors": [
        "Daniel E. da Silva",
        "Michael Kirk",
        "Nat Mathews",
        "Andrés Muñoz-Jaramillo"
      ],
      "abstract": "Diffusion Modeling of the Three-Dimensional Magnetic Field in the Sun's Corona Daniel E. da Silva, Michael Kirk, Nat Mathews, Andrés Muñoz-Jaramillo Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) In this work, we introduce a novel generative denoising diffusion model for synthesizing the Sun's three-dimensional coronal magnetic field, a complex and dynamic region characterized by evolving magnetic structures. Despite daily variability, these structures exhibit recurring patterns and long-term cyclic trends, presenting unique modeling challenges and opportunities at the intersection of physics and machine learning. Our generative approach employs an innovative architecture influenced by Spherical Fourier Neural Operators (SFNO), operating within the spherical harmonic domain, where the scalar field corresponds directly to the magnetic potential under physical constraints. We trained this model using an extensive dataset comprising 11.7 years of daily coupled simulations from the Air Force Data Assimilative Photospheric Flux Transport-Wang Sheeley Arge (ADAPT-WSA) model, further enhanced by data augmentation. Initial results demonstrate the model's capability to conditionally generate physically realistic magnetic fields reflective of distinct phases within the 11-year solar cycle: from solar minimum ($S = 0$) to solar maximum ($S = 1$). This approach represents a significant step toward advanced generative three-dimensional modeling in Heliophysics, with potential applications in solar forecasting, data assimilation, inverse problem-solving, and broader impacts in areas such as procedural generation of physically-informed graphical assets.",
      "pdf_url": "https://arxiv.org/pdf/2510.01441.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01799",
      "title": "PRESOL: a web-based computational setting for feature-based flare forecasting",
      "authors": [
        "Chiara Curletto",
        "Paolo Massa",
        "Valeria Tagliafico",
        "Cristina Campi",
        "Federico Benvenuto",
        "Michele Piana",
        "Andrea Tacchino"
      ],
      "abstract": "PRESOL: a web-based computational setting for feature-based flare forecasting Chiara Curletto, Paolo Massa, Valeria Tagliafico, Cristina Campi, Federico Benvenuto, Michele Piana, Andrea Tacchino Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG); Space Physics (physics.space-ph) Solar flares are the most explosive phenomena in the solar system and the main trigger of the events' chain that starts from Coronal Mass Ejections and leads to geomagnetic storms with possible impacts on the infrastructures at Earth. Data-driven solar flare forecasting relies on either deep learning approaches, which are operationally promising but with a low explainability degree, or machine learning algorithms, which can provide information on the physical descriptors that mostly impact the prediction. This paper describes a web-based technological platform for the execution of a computational pipeline of feature-based machine learning methods that provide predictions of the flare occurrence, feature ranking information, and assessment of the prediction performances.",
      "pdf_url": "https://arxiv.org/pdf/2510.01799.pdf",
      "categories": [
        "astro-ph.SR",
        "astro-ph.IM",
        "cs.LG"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02026",
      "title": "A Large Sample of JWST/NIRSpec Brown Dwarfs: New Distant Discoveries",
      "authors": [
        "Zhijun Tu",
        "Shu Wang",
        "Xiaodian Chen",
        "Jifeng Liu"
      ],
      "abstract": "A Large Sample of JWST/NIRSpec Brown Dwarfs: New Distant Discoveries Zhijun Tu, Shu Wang, Xiaodian Chen, Jifeng Liu 22 pages, 6 figures. Accepted for publication in ApJS Solar and Stellar Astrophysics (astro-ph.SR) Brown dwarfs are essential probes of stellar and planetary formation, yet their low luminosities pose challenges for detection at large Galactic distances. The James Webb Space Telescope (JWST), with its unprecedented near-infrared sensitivity, enables the discovery and characterization of distant substellar objects, including those in the Milky Way's thick disk and halo. We conducted a systematic search using over 40,000 publicly available JWST/NIRSpec PRISM/CLEAR spectra and identified 68 brown dwarfs through spectral template matching and visual inspection. Among them, 12 are newly identified candidates, including 8 T dwarfs and 4 M/L dwarfs, most at distances exceeding 1 kpc. Remarkably, two sources -- JWST J001418.22-302223.2 and JWST J033240.07-274907.8 -- are found at distances greater than 5 kpc, making them the most distant brown dwarfs within the Milky Way. Spectral fits were performed using a nested sampling Monte Carlo algorithm with three model grids: Sonora Elf Owl, LOWZ, and SAND. The analysis reveals that cloud-free models are unable to reproduce L/T transition spectra, whereas the SAND model provides a more accurate representation of cloud effects in metal-poor environments. With the newly identified distant brown dwarfs, we also investigated the vertical metallicity gradient of brown dwarfs. Overall, the metallicities do not show an evident trend with Galactic height $|Z|$, due to the limited sample size and the uncertainties in metallicity measurements.",
      "pdf_url": "https://arxiv.org/pdf/2510.02026.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02031",
      "title": "Chemical transport by weakly nonlinear internal gravity waves in stars",
      "authors": [
        "Yifeng Mao",
        "Daniel Lecoanet"
      ],
      "abstract": "Chemical transport by weakly nonlinear internal gravity waves in stars Yifeng Mao, Daniel Lecoanet Solar and Stellar Astrophysics (astro-ph.SR); Fluid Dynamics (physics.flu-dyn); Geophysics (physics.geo-ph) While it is well-known that internal gravity waves (IGWs) transport chemicals in the radiative zones of stars, there remains substantial uncertainty on the amount of, and physical mechanism behind, this transport. Most previous studies have relied on heuristic theories, or numerical simulations that may be hard to extrapolate to stellar parameters. In this work, we present the first rigorous asymptotic calculation of (passive) chemical transport by IGWs, in the limit of small wave amplitude. We find that the net transport by a coherent packet of waves scales like wave amplitude to the fourth power, and verify these analytic calculations with numerical simulations. Because the transport is equally likely to be positive as negative, the transport by a random superposition of waves is expected to scale as wave amplitude to the eighth power. These results show that closer comparisons between theoretical arguments and numerical calculations are essential for interpreting numerical simulations of chemical transport by IGWs, and making accurate predictions of this process for stellar evolution modeling.",
      "pdf_url": "https://arxiv.org/pdf/2510.02031.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02052",
      "title": "Observations of a Faint Nonthermal Onset before a GOES C-class Flare",
      "authors": [
        "Natália Bajnoková",
        "Iain G. Hannah",
        "Hannah Collier",
        "Stephen M. White",
        "Lindsay Glesener",
        "Reed B. Masek",
        "Marianne S. Peterson",
        "Säm Krucker",
        "Hugh S. Hudson"
      ],
      "abstract": "Observations of a Faint Nonthermal Onset before a GOES C-class Flare Natália Bajnoková, Iain G. Hannah, Hannah Collier, Stephen M. White, Lindsay Glesener, Reed B. Masek, Marianne S. Peterson, Säm Krucker, Hugh S. Hudson Solar and Stellar Astrophysics (astro-ph.SR) We present analysis of a GOES C1-class flare from 2022 September 6, which was jointly observed as occulted by Nuclear Spectroscopic Telescope ARray (NuSTAR) and on-disk by Spectrometer/Telescope for Imaging X-rays (STIX). NuSTAR observed faint coronal nonthermal emission as well as plasma heating > 10 MK, starting 7 minutes prior to the flare. This onset emission implies that during this time, there is a continuous electron acceleration in the corona which could also be responsible for the observed heating. The nonthermal model parameters remained consistent throughout the entire onset, indicating that the electron acceleration process persisted during this time. Furthermore, the onset coincided with a series of type III radio bursts observed by Long Wavelength Array-1, further supporting the presence of electron acceleration before the flare began. We also performed spectral analysis of the impulsive flare emission with STIX (thermal and footpoint emission). STIX footpoints and the onset coronal source were found to have similar electron distribution power-law indices, but with increased low-energy cut-off during the flare time. This could suggest that the nonthermal onset is an early signature of the acceleration mechanism that occurs during the main phase of the flare.",
      "pdf_url": "https://arxiv.org/pdf/2510.02052.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02102",
      "title": "Flare-Driven Plasma Dynamics and Elemental Abundance Redistribution",
      "authors": [
        "Biswajit Mondal",
        "Amy R. Winebarger"
      ],
      "abstract": "Flare-Driven Plasma Dynamics and Elemental Abundance Redistribution Biswajit Mondal, Amy R. Winebarger Solar and Stellar Astrophysics (astro-ph.SR) Since the advent of X-ray and EUV spectroscopy, the discovery of the First Ionization Potential (FIP) effect--where coronal elemental compositions diverge from their photospheric values based on the element's FIP--has remained a key puzzle in solar and stellar astrophysics. These deviations exhibit significant fluctuations during flares, yet their connection to plasma dynamics has remained unclear. Here, we report a clear correlation between temperature-sensitive flaring plasma emission and element-specific abundance changes for a solar flare. These findings indicate that energy deposition in the chromosphere drives plasma evaporation from different chromospheric heights, modulating elemental abundances. Hydrodynamic simulations support these observations, showing that varying energy deposition magnitudes generate plasma upflows from different chromospheric heights, leading to element-specific FIP fractionation. These results provide new insights into the dynamic coupling of flare energy, plasma flows, and abundance variability, with implications for understanding coupling between different atmospheric layers.",
      "pdf_url": "https://arxiv.org/pdf/2510.02102.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02255",
      "title": "Rotation Periods for Stars in Open Cluster NGC 6819 From Kepler IRIS Light Curves",
      "authors": [
        "Sabina Sagynbayeva",
        "Isabel L. Colman",
        "Will M. Farr"
      ],
      "abstract": "Rotation Periods for Stars in Open Cluster NGC 6819 From Kepler IRIS Light Curves Sabina Sagynbayeva, Isabel L. Colman, Will M. Farr Solar and Stellar Astrophysics (astro-ph.SR) We present an updated catalog of stellar rotation periods for the 2.5 Gyr open cluster NGC 6819 using the Kepler IRIS light curves from superstamp data. Our analysis uses Gaussian Process modeling to extract robust rotation signals from image subtraction light curves, allowing us unprecedented data access and measurement precision in the crowded cluster field. After applying stringent quality and contamination cuts, we identify 271 reliable rotation periods, representing by far the largest sample of rotators measured in a single intermediate-age cluster. Compared to previous work, which relied on only ~30 stars, our catalog extends the gyrochronological sequence of NGC 6819 with an order of magnitude more measurements and improved precision. The expanded dataset reveals both the expected temperature-dependent spin-down trend and substantial scatter at fixed effective temperature, including a bimodal distribution of fast and slow rotators. We also identify a distinct ``pile-up'' sequence consistent with predictions of weakened magnetic braking at critical Rossby numbers. These results strengthen this cluster's role as a benchmark for stellar spin evolution, while also highlighting the limitations of traditional gyrochronology at older ages. The final catalog and the model implementations are all available on Zenodo.",
      "pdf_url": "https://arxiv.org/pdf/2510.02255.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01215",
      "title": "Solar Hegemony: M-Dwarfs Are Unlikely to Host Observers Such as Ourselves",
      "authors": [
        "David Kipping"
      ],
      "abstract": "Solar Hegemony: M-Dwarfs Are Unlikely to Host Observers Such as Ourselves David Kipping Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) With no firm evidence for life beyond our solar system, inferences about the population observers such as ourselves rests upon the Earth as a single input, at least for now. Whilst the narrative of our home as a 'humdrum' system has become ingrained in the public psyche via Sagan, there are at least two striking facts about our existence which we know are certainly unusual. First, the stelliferous period spans ~10Tyr - yet here we are living in the first 0.1% of that volume. Second, over three-quarters of all stars are low-mass M-dwarfs, stars with no shortage of rocky habitable-zone planets - and yet, again, our existence defies this trend, previously dubbed the Red Sky Paradox. Two plausible resolutions are that a) stars below a certain mass, $M_{crit}$, do not produce observers, and, b) planets have a truncated temporal window for observers, $T_{win}$, negating the longevity advantage of M-dwarfs. We develop a Bayesian model that encompasses both datums and jointly explores the two resolutions covariantly. Our analysis reveals that 1) the hypothesis that these observations are mere luck is disfavored with an overwhelming Bayes factor of ~1600; 2) some truncation of low-mass stars is indispensable, lowering $T_{win}$ alone cannot well-explain the observations; and, 3) the most conservative limit on $M_{crit}$ occurs when fixing $T_{win}=10$Gyr, yielding $M_{crit}>0.34 M_{\\odot}$ [$0.74 M_{\\odot}$] to 2$\\sigma$ [1$\\sigma$]. Our work challenges the tacit assumption of M-dwarfs being viable seats for observers and, indirectly, even life.",
      "pdf_url": "https://arxiv.org/pdf/2510.01215.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02260",
      "title": "Mapping the Cloud-Driven Atmospheric Dynamics & Chemistry of an Isolated Exoplanet Analog with Harmonic Signatures",
      "authors": [
        "Michael K. Plummer",
        "Francis P. Cocchini",
        "Peter A. Kearns",
        "Allison McCarthy",
        "Étienne Artigau",
        "Nicolas B. Cowan",
        "Roman Akhmetshyn",
        "Johanna Vos",
        "Evert Nasedkin",
        "Channon Visscher",
        "Björn Benneke",
        "René Doyon",
        "Stanimir A. Metchev",
        "Jason F. Rowe",
        "Genaro Suárez"
      ],
      "abstract": "Mapping the Cloud-Driven Atmospheric Dynamics & Chemistry of an Isolated Exoplanet Analog with Harmonic Signatures Michael K. Plummer, Francis P. Cocchini, Peter A. Kearns, Allison McCarthy, Étienne Artigau, Nicolas B. Cowan, Roman Akhmetshyn, Johanna Vos, Evert Nasedkin, Channon Visscher, Björn Benneke, René Doyon, Stanimir A. Metchev, Jason F. Rowe, Genaro Suárez Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR); Atmospheric and Oceanic Physics (physics.ao-ph); Geophysics (physics.geo-ph) Young planetary-mass objects and brown dwarfs near the L/T spectral transition exhibit enhanced spectrophotometric variability over field brown dwarfs. Patchy clouds, auroral processes, stratospheric hot spots, and complex carbon chemistry have all been proposed as potential sources of this variability. Using time-resolved, low-to-mid-resolution spectroscopy collected with the JWST/NIRISS and NIRSpec instruments, we apply harmonic analysis to SIMP J0136, a highly variable, young, isolated planetary-mass object. Odd harmonics (k=3) at pressure levels (> 1 bar) corresponding to iron and forsterite cloud formation suggest North/South hemispheric asymmetry in the cloudy, and likely equatorial, regions. We use the inferred harmonics, along with 1-D substellar atmospheric models, to map the flux variability by atmospheric pressure level. These vertical maps demonstrate robust interaction between deep convective weather layers and the overlying stratified and radiative atmosphere. We identify distinct time-varying structures in the near-infrared that we interpret as planetary-scale wave (e.g., Rossby or Kelvin)-associated cloud modulation. We detect variability in water (S/N = 14.0), carbon monoxide (S/N = 13.0), and methane (S/N = 14.9) molecular signatures. Forsterite cloud modulation is anti-correlated with overlying carbon monoxide and water abundances and correlated with deep methane absorption, suggesting complex interaction between cloud formation, atmospheric chemistry, and temperature structure. Furthermore, we identify distinct harmonic behavior between methane and carbon monoxide absorption bands, providing evidence for time-resolved disequilibrium carbon chemistry. At the lowest pressures (< 100 mbar), we find that the mapped methane lines transition from absorption to emission, supporting evidence of high-altitude auroral heating via electron precipitation.",
      "pdf_url": "https://arxiv.org/pdf/2510.02260.pdf",
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.12762",
      "title": "Apsidal motion and proximity effects in the massive binary BD+60 497",
      "authors": [
        "Gregor Rauw",
        "Piotr A. Kolaczek-Szymanski",
        "Yael Naze",
        "Lucas Nys"
      ],
      "abstract": "Apsidal motion and proximity effects in the massive binary BD+60 497 Gregor Rauw, Piotr A. Kolaczek-Szymanski, Yael Naze, Lucas Nys Accepted for publication in A&A Solar and Stellar Astrophysics (astro-ph.SR) The eccentric short-period O-star binary BD+60 497 is an interesting laboratory in which to study tidal interactions in massive binary systems, notably via the detection and characterisation of apsidal motion. The rate of apsidal motion in such systems can help constrain their age and provide insight into the degree of mass concentration in the interior of massive stars. We used spectroscopic data collected over two decades to reconstruct the individual spectra of the stars and to establish their epoch-dependent radial velocities. An orbital solution, explicitly accounting for apsidal motion was adjusted to the data. Space-borne photometric time series were analysed with Fourier methods and with binary models. We derived a rate of apsidal motion of $6.15^{+1.05}_{-1.65}$ degree/yr, which suggests an age of $4.13^{+0.42}_{-1.37}$ Myr. The disentangled spectra unveiled a curious change in the spectral properties of the secondary star between the epochs 2002-2003 and 2018-2022 with the secondary spectrum appearing to be of an earlier spectral type over recent years. Photometric data show variability at the 6 mmag level on the period of the binary system, which is hard to explain in terms of proximity effects. Whilst the rate of apsidal motion agrees well with theoretical expectations, the changes in the reconstructed secondary spectrum hint at a highly non-uniform surface temperature distribution for this star. Different effects are discussed that could contribute to the photometric variations. The current most-likely explanation is a mix of proximity effects and tidally excited oscillations",
      "pdf_url": "https://arxiv.org/pdf/2509.12762.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16477",
      "title": "Constraining the Mass Loss and the Kinetic Energy of Solar Coronal Mass Ejections with Far-Ultraviolet Flares",
      "authors": [
        "Nuri Park",
        "Evgenya L. Shkolnik",
        "Joe Llama"
      ],
      "abstract": "Constraining the Mass Loss and the Kinetic Energy of Solar Coronal Mass Ejections with Far-Ultraviolet Flares Nuri Park, Evgenya L. Shkolnik, Joe Llama Solar and Stellar Astrophysics (astro-ph.SR) Stellar eruptive events, such as flares and coronal mass ejections (CMEs), can affect planetary habitability by disturbing the stability of their atmospheres. For instance, strong stellar flares and CMEs can trigger atmospheric escape and, in extreme cases, may strip away the atmosphere completely. While stellar flares have been observed and explored at a wide range of wavelengths, the physical properties of stellar CMEs remain unconstrained due to the difficulty in observing them. In this context, the Sun provides our only window on the potential characteristics of CMEs on Sun-like stars. A correlation between solar X-ray flare peak flux and the mass of flare-associated solar CMEs has been reported using solar data collected during Solar Cycle 23 (Aarnio et al. 2011). Here, we build upon that work. We extend the correlation into the far-UV (FUV), where stellar flares are, and will continue to be, routinely detected with existing and future FUV observatories by incorporating data spanning two entire Solar Cycles (23 and 24; 1996-2019). Using three different space missions (CMEs from LASCO/SOHO, X-ray flare events from XRS/GOES, and FUV flares from AIA/SDO), we report a correlation between FUV flare peak flux and energy centered at 1600 Å and mass, kinetic energy, and linear speed of flare-associated CMEs. These empirical relations enable estimates of CME masses and kinetic energies from FUV flares on Sun-like stars. While direct stellar CME detections remain elusive, the correlations derived here are likely applicable to Sun-like stars and provide a working framework for evaluating exoplanet atmospheric erosion.",
      "pdf_url": "https://arxiv.org/pdf/2509.16477.pdf",
      "categories": [
        "astro-ph.SR"
      ],
      "primary_category": "astro-ph.SR",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01299",
      "title": "Enhancing the development of Cherenkov Telescope Array control software with Large Language Models",
      "authors": [
        "Dmitriy Kostunin",
        "Elisa Jones",
        "Vladimir Sotnikov",
        "Valery Sotnikov",
        "Sergo Golovachev",
        "Alexandre Strube"
      ],
      "abstract": "Enhancing the development of Cherenkov Telescope Array control software with Large Language Models Dmitriy Kostunin, Elisa Jones, Vladimir Sotnikov, Valery Sotnikov, Sergo Golovachev, Alexandre Strube Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI) We develop AI agents based on instruction-finetuned large language models (LLMs) to assist in the engineering and operation of the Cherenkov Telescope Array Observatory (CTAO) Control and Data Acquisition Software (ACADA). These agents align with project-specific documentation and codebases, understand contextual information, interact with external APIs, and communicate with users in natural language. We present our progress in integrating these features into CTAO pipelines for operations and offline data analysis.",
      "pdf_url": "https://arxiv.org/pdf/2510.01299.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.AI"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01371",
      "title": "An improved algorithm for separating clock delays from ionospheric effects in radio astronomy",
      "authors": [
        "C.M. Cordun",
        "M.A. Brentjens",
        "H.K. Vedantham",
        "M. Mevius"
      ],
      "abstract": "An improved algorithm for separating clock delays from ionospheric effects in radio astronomy C.M. Cordun, M.A. Brentjens, H.K. Vedantham, M. Mevius Instrumentation and Methods for Astrophysics (astro-ph.IM) Context: Low-frequency radio observations are heavily impacted by the ionosphere, where dispersive delays can outpace even instrumental clock offsets, posing a serious calibration challenge. Especially below 100 MHz, phase unwrapping difficulties and higher-order dispersion effects can complicate the separation of ionospheric and clock delays. Aims: We address this challenge by introducing a method for reliably separating clock delays from ionospheric effects, even under mediocre to poor ionospheric conditions encountered near solar maximum. Methods: The approach employs a key technique: we modelled our likelihood space using the circular Gaussian distribution (von Mises random variable) rather than non-circular distributions that suffer from $2\\pi$ phase ambiguities. This ensures that noisier data are weighted less heavily than cleaner data during the fitting process. Results: The method reliably separates clock delays and ionospheric terms that vary smoothly in time whilst providing a good fit to the data. A comparison with the clock-ionosphere separation approach used in standard LOFAR data processing shows that our technique achieves significant improvements. In contrast to the old algorithm, which often fails to return reliable results below 100 MHz even under good ionospheric conditions, the new algorithm consistently provides reliable solutions across a wider range of conditions. Conclusions: This new algorithm represents a significant advance for large-scale surveys, offering a more dependable way to study ionospheric effects and furthering research in ionospheric science and low-frequency radio astronomy.",
      "pdf_url": "https://arxiv.org/pdf/2510.01371.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01785",
      "title": "cuHPX: GPU-Accelerated Differentiable Spherical Harmonic Transforms on HEALPix Grids",
      "authors": [
        "Xiaopo Cheng",
        "Akshay Subramaniam",
        "Shixun Wu",
        "Noah Brenowitz"
      ],
      "abstract": "cuHPX: GPU-Accelerated Differentiable Spherical Harmonic Transforms on HEALPix Grids Xiaopo Cheng, Akshay Subramaniam, Shixun Wu, Noah Brenowitz Instrumentation and Methods for Astrophysics (astro-ph.IM); Mathematical Software (cs.MS) HEALPix (Hierarchical Equal Area isoLatitude Pixelization) is a widely adopted spherical grid system in astrophysics, cosmology, and Earth sciences. Its equal-area, iso-latitude structure makes it particularly well-suited for large-scale data analysis on the sphere. However, implementing high-performance spherical harmonic transforms (SHTs) on HEALPix grids remains challenging due to irregular pixel geometry, latitude-dependent alignments, and the demands for high-resolution transforms at scale. In this work, we present cuHPX, an optimized CUDA library that provides functionality for spherical harmonic analysis and related utilities on HEALPix grids. Beyond delivering substantial performance improvements, cuHPX ensures high numerical accuracy, analytic gradients for integration with deep learning frameworks, out-of-core memory-efficient optimization, and flexible regridding between HEALPix, equiangular, and other common spherical grid formats. Through evaluation, we show that cuHPX achieves rapid spectral convergence and delivers over 20 times speedup compared to existing libraries, while maintaining numerical consistency. By combining accuracy, scalability, and differentiability, cuHPX enables a broad range of applications in climate science, astrophysics, and machine learning, effectively bridging optimized GPU kernels with scientific workflows.",
      "pdf_url": "https://arxiv.org/pdf/2510.01785.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.MS"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01882",
      "title": "Cross-Polarization Reduction in Kinetic Inductance Detectors Based on Quasi-Lumped Resonators",
      "authors": [
        "Victor Rollano",
        "Martino Calvo",
        "Alejandro Pascual Laguna",
        "David Rodriguez",
        "Maria Teresa Magaz",
        "Beatriz Aja",
        "Luisa de la Fuente",
        "Daniel Granados",
        "Alessandro Monfardini",
        "Alicia Gomez"
      ],
      "abstract": "Cross-Polarization Reduction in Kinetic Inductance Detectors Based on Quasi-Lumped Resonators Victor Rollano, Martino Calvo, Alejandro Pascual Laguna, David Rodriguez, Maria Teresa Magaz, Beatriz Aja, Luisa de la Fuente, Daniel Granados, Alessandro Monfardini, Alicia Gomez Instrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det) Kinetic Inductance Detectors (KIDs) have emerged as a leading technology for millimeter- and submillimeter-wave astronomy due to their high sensitivity, natural multiplexing capabilities and scalable fabrication. In polarization-sensitive applications-such as Cosmic Microwave Background (CMB) studies-cross-polarization, or unintended response to the orthogonal polarization, poses a significant limitation to measurement fidelity. This work investigates the origin of cross-polarization in meandered Lumped Element KIDs (LEKIDs), with particular emphasis on the role of parasitic currents in the interdigitated capacitor. A comparative study between conventional LEKIDs and a quasi-lumped resonator design is presented, demonstrating that removing the capacitive element may improve cross-polarization discrimination, confirming the capacitor's contribution to polarization leakage.",
      "pdf_url": "https://arxiv.org/pdf/2510.01882.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02016",
      "title": "Design and Scientific Prospects of the POLAR-2 Mission",
      "authors": [
        "Merlin Kole",
        "Nicolas de Angelis",
        "Jiang He",
        "Hongbang Liu",
        "Jianchao Sun",
        "Fei Xie",
        "Jimmy Zaid"
      ],
      "abstract": "Design and Scientific Prospects of the POLAR-2 Mission Merlin Kole, Nicolas de Angelis, Jiang He, Hongbang Liu, Jianchao Sun, Fei Xie, Jimmy Zaid Submitted for Publication to Innovations in Space Research Technology Instrumentation and Methods for Astrophysics (astro-ph.IM) The POLAR-2 mission consists of 3 instruments designed with the combined aim of producing a deeper understanding of Gamma-Ray Bursts. To achieve this, POLAR-2 relies on polarisation measurements and, for the first time will provide these using 2 separate polarimeter detectors. The first of these is a payload optimised to perform Compton polarimetry measurements in the 40-1000 keV energy range using a combination of plastic scintillators and SiPMs. The development of this payload, the design of which is based on lessons learned from the POLAR mission, included optimization of plastic scintillator design. In addition, its development included detailed characterization, space qualification and radiation damage and mitigation strategies for the large number of silicon photo-multipliers included in the design. We will present these along with an overview of the readout electronics. These electronics were developed with flexibility in mind, as well as low cost and low power consumption. As such, its design is of interest beyond this polarimeter and is also used on the spectrometer instrument of POLAR-2 where it is used to read out an array of GAGG:Ce scintillators. This readout, in combination with a coded mask, allows this secondary instrument to provide detailed spectral and localization measurements. The final instrument used in the mission aims to use gas-based detectors to perform polarization measurements in the keV energy region. The novelty of this design is that it will be optimized to use these for wide field of view observations. The combination of the three instruments will allow to perform detailed spectral, localization and polarization measurements of these transient phenomena together for the first time. Here we provide an overview of the technologies employed in the mission along with detailed predictions on its capabilities after its launch currently foreseen in 2027.",
      "pdf_url": "https://arxiv.org/pdf/2510.02016.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01913",
      "title": "Dark characterization of Ti/Al LEKIDs for the search of axions in the W-band",
      "authors": [
        "Victor Rollano",
        "Alejandro Pascual Laguna",
        "David Rodriguez",
        "Martino Calvo",
        "Maria Teresa Magaz",
        "Daniel Granados",
        "Alessandro Monfardini",
        "Alicia Gomez"
      ],
      "abstract": "Dark characterization of Ti/Al LEKIDs for the search of axions in the W-band Victor Rollano, Alejandro Pascual Laguna, David Rodriguez, Martino Calvo, Maria Teresa Magaz, Daniel Granados, Alessandro Monfardini, Alicia Gomez Instrumentation and Detectors (physics.ins-det); Instrumentation and Methods for Astrophysics (astro-ph.IM) We report the electrical (dark) characterization of lumped-element kinetic inductance detectors (LEKIDs) fabricated from a Titanium/Aluminum bilayer and designed for broadband absorption in the W-band (75-110 GHz). These detectors are prototypes for future QCD axion search experiments within the Canfranc Axion Detection Experiment (CADEx), which demand sub 1e-19 W/Hz^0.5 sensitivities under low optical backgrounds. We combine a Mattis-Bardeen analysis to the temperature dependence of the detector parameters with noise spectroscopy to determine the electrical noise equivalent power (NEP). The minimum measured value for the electrical NEP is 3e-19 W/Hz0.5. Across the measured temperature range, we find that quasiparticle lifetime deviates from the expected BCS recombination law. Our analysis suggests that non-equilibrium relaxation is governed by spatial inhomogeneities in the superconducting gap and phonon diffusion effects. This work sets the road-map to achieve suitable and ultra-sensitive detectors in the W-band for dark matter axion search experiments.",
      "pdf_url": "https://arxiv.org/pdf/2510.01913.pdf",
      "categories": [
        "astro-ph.IM"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.17173",
      "title": "Model Evaluation of a Transformable CubeSat for Nonholonomic Attitude Reorientation Using a Drop Tower",
      "authors": [
        "Yuki Kubo",
        "Tsubasa Ando",
        "Hirona Kawahara",
        "Shu Miyata",
        "Naoya Uchiyama",
        "Kazutoshi Ito",
        "Yoshiki Sugawara"
      ],
      "abstract": "Model Evaluation of a Transformable CubeSat for Nonholonomic Attitude Reorientation Using a Drop Tower Yuki Kubo, Tsubasa Ando, Hirona Kawahara, Shu Miyata, Naoya Uchiyama, Kazutoshi Ito, Yoshiki Sugawara Instrumentation and Methods for Astrophysics (astro-ph.IM); Robotics (cs.RO) This paper presents a design for a drop tower test to evaluate a numerical model for a structurally reconfigurable spacecraft with actuatable joints, referred to as a transformable spacecraft. A mock-up robot for a 3U-sized transformable spacecraft is designed to fit in a limited time and space of the microgravity environment available in the drop tower. The robot performs agile reorientation, referred to as nonholonomic attitude control, by actuating joints in a particular manner. To adapt to the very short duration of microgravity in the drop tower test, a successive joint actuation maneuver is optimized to maximize the amount of attitude reorientation within the time constraint. The robot records the angular velocity history of all four bodies, and the data is analyzed to evaluate the accuracy of the numerical model. We confirm that the constructed numerical model sufficiently replicates the robot's motion and show that the post-experiment model corrections further improve the accuracy of the numerical simulations. Finally, the difference between this drop tower test and the actual orbit demonstration is discussed to show the prospect.",
      "pdf_url": "https://arxiv.org/pdf/2501.17173.pdf",
      "categories": [
        "astro-ph.IM",
        "cs.RO"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.06496",
      "title": "Identification of Likely Methane Absorption Features in the Optical Spectra of Titan",
      "authors": [
        "Sirinrat Sithajan",
        "Lalita Kaewbiang",
        "Hugh R. A. Jones",
        "Pakakaew Rittipruk",
        "Sukanya Meethong"
      ],
      "abstract": "Identification of Likely Methane Absorption Features in the Optical Spectra of Titan Sirinrat Sithajan, Lalita Kaewbiang, Hugh R. A. Jones, Pakakaew Rittipruk, Sukanya Meethong Instrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP) The optical spectra of Titan reveal a rich set of absorption features, most of which are likely associated with methane (CH$_4$). Methane is a key molecule in planetary and exoplanetary atmospheres, yet a comprehensive high-resolution linelist at optical wavelengths remains incomplete. This study identified and characterized potential CH$_4$ absorption features in high-resolution optical spectra of Titan, providing essential data for linelist development and improving CH$_4$ detection and characterization. We analyzed Titan spectra from the ESPRESSO spectrograph (R $\\approx$ 190,000), identifying intrinsic features and measuring their relative strengths. A conservative detection approach was employed, slightly overestimating solar and telluric contributions to distinguish them from Titan's intrinsic features. To assess the impact of spectral resolution, we compared the ESPRESSO data with Titan UVES data (R $\\approx$ 110,000). We identified 6,195 absorption features in the ESPRESSO spectra potentially associated with CH$_4$, of which 5,436 are newly reported. ESPRESSO detected twice as many features as UVES in overlapping regions, highlighting the advantage of higher-resolution data. Most detected lines remained unresolved, so our reported features are primarily blended absorption structures. We estimated the detection limit for feature identification to correspond to a CH$_4$ absorption coefficient of approximately 0.02 km-am$^{-1}$. Comparison of our results with a previous analysis of Titan UVES spectra and with experimental CH$_4$ data at a similar temperature showed good agreement, while some discrepancies were observed when compared with data acquired at a different temperature. We provide a comprehensive list of Titan absorption features with key reliability metrics, along with Titan's intrinsic spectra, to support future studies.",
      "pdf_url": "https://arxiv.org/pdf/2509.06496.pdf",
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.IM",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01332",
      "title": "Dynamical Excitation as a probe of planetary origins",
      "authors": [
        "Brad M. S. Hansen",
        "Tze-Yeung Yu",
        "Neel Nagarajan",
        "Yasuhiro Hasegawa"
      ],
      "abstract": "Dynamical Excitation as a probe of planetary origins Brad M. S. Hansen, Tze-Yeung Yu, Neel Nagarajan, Yasuhiro Hasegawa 16 pages, 20 figures, to be submitted to The Open Journal of Astrophysics Earth and Planetary Astrophysics (astro-ph.EP) We present a set of numerical simulations of the dynamical evolution of compact planetary systems migrating in a protoplanetary disk whose inner edge is sculpted by the interaction with the stellar magnetic field, as described in Yu et al. (2023). We demonstrate that the resulting final distribution of neighbouring planet period ratios contains only a small surviving fraction of resonant systems, in accordance with observations. The resulting planetary architectures are largely in place by the end of the protoplanetary disk phase (within a few Myr), and do not require significant later dynamical evolution. The divergence of planetary pairs during gas disk dispersal also leads to the excitation of eccentricities when pairs cross mean motion resonances in a divergent fashion. The resulting distribution of remnant free eccentricities is consistent with the values inferred from the observation of transit durations and transit timing variations. We furthermore demonstrate that this conclusion is not significantly altered by tides, assuming standard values for tidal dissipation in Earth or Neptune-class planets. These results demonstrate that the observed spacing and residual dynamical excitation of compact planetary systems can be reproduced by migration through a protoplanetary disk, as long as the inner disk boundary is modelled as a gradual rollover, instead of a sharp transition. Such an effect can be achieved when the model accounts for the diffusion of the stellar magnetic field into the disk. The resulting divergence of planetary pairs during the magnetospheric rebound phase breaks the resonant chains, resulting in a better match to observations than disk models with more traditional inner boundaries.",
      "pdf_url": "https://arxiv.org/pdf/2510.01332.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01725",
      "title": "High Five From ASTEP: Three Validated Planets and Two Eclipsing Binaries in a Diverse Set of Long-Period Candidates",
      "authors": [
        "Erika Rea",
        "Maximilian N. Günther",
        "George Dransfield",
        "Tristan Guillot",
        "Amaury H.M.J. Triaud",
        "Keivan G. Stassun",
        "Juan I. Espinoza-Retamal",
        "Rafael Brahm",
        "Solène Ulmer-Moll",
        "Matteo Beltrame",
        "Vincent Deloupy",
        "Mathilde Timmermans",
        "Lyu Abe",
        "Karim Agabi",
        "Philippe Bendjoya",
        "Djamel Mekarnia",
        "Francois-Xavier Schmider",
        "Olga Suarez",
        "Ana M. Heras",
        "Bruno Merín",
        "François Bouchy",
        "Andrés Jordán",
        "Monika Lendl",
        "Marcelo Tala-Pinto",
        "Trifon Trifonov",
        "Khalid Barkaoui",
        "Luke G. Bouma",
        "Gavin Boyle",
        "César Briceño",
        "Amadeo Castro-González",
        "Alastair Claringbold",
        "Karen A. Collins",
        "Keith Horne",
        "Steve Howell",
        "Andrew W. Mann",
        "Felipe Murgas",
        "Enric Palle",
        "Samuel Quinn",
        "Joseph E. Rodriguez",
        "Richard P. Schwarz",
        "T.G. Tan",
        "George Zhou",
        "Carl Ziegler",
        "Joshua N. Winn"
      ],
      "abstract": "High Five From ASTEP: Three Validated Planets and Two Eclipsing Binaries in a Diverse Set of Long-Period Candidates Erika Rea, Maximilian N. Günther, George Dransfield, Tristan Guillot, Amaury H.M.J. Triaud, Keivan G. Stassun, Juan I. Espinoza-Retamal, Rafael Brahm, Solène Ulmer-Moll, Matteo Beltrame, Vincent Deloupy, Mathilde Timmermans, Lyu Abe, Karim Agabi, Philippe Bendjoya, Djamel Mekarnia, Francois-Xavier Schmider, Olga Suarez, Ana M. Heras, Bruno Merín, François Bouchy, Andrés Jordán, Monika Lendl, Marcelo Tala-Pinto, Trifon Trifonov, Khalid Barkaoui, Luke G. Bouma, Gavin Boyle, César Briceño, Amadeo Castro-González, Alastair Claringbold, Karen A. Collins, Keith Horne, Steve Howell, Andrew W. Mann, Felipe Murgas, Enric Palle, Samuel Quinn, Joseph E. Rodriguez, Richard P. Schwarz, T.G. Tan, George Zhou, Carl Ziegler, Joshua N. Winn Please note that this submission is coordinated with a complementary paper by Espinoza-Retamal et al. (submitted to AAS journals), which focuses in detail on one of the targets (TOI-4507) with additional radial velocity and Rossiter-McLaughlin analysis Earth and Planetary Astrophysics (astro-ph.EP) We present the analysis of five long-period TESS Objects of Interest (TOIs), each with orbital periods exceeding one month. Initially identified by the Transiting Exoplanet Survey Satellite (TESS), we extensively monitored these targets with the Antarctic Search for Transiting Exoplanets (ASTEP), supported by other facilities in the TESS Follow-Up (TFOP) network. These targets occupy a relatively underexplored region of the period-radius parameter space, offering valuable primordial probes for planetary formation and migration as warm planets better maintain their evolutionary fingerprints. To characterise these systems, we leverage high-resolution speckle imaging to search for nearby stellar companions, and refine stellar parameters using both reconnaissance spectroscopy and spectral energy distribution (SED) fitting. We combine TESS photometry with high-precision ground-based observations from ASTEP, and when available, include additional photometry and radial velocity data. We apply statistical validation to assess the planetary nature of each candidate and use to jointly model the photometric and spectroscopic datasets with Markov Chain Monte Carlo (MCMC) sampling to derive robust posterior distributions. With this, we validate the planetary nature of three TOIs, including the two warm Saturns TOI-4507 b (104 d) and TOI-3457 b (32.6 d), as well as the warm sub-Neptune TOI-707 b (52.8 d). The remaining two candidates are identified as eclipsing binaries, namely TOI-2404 and TOI-4404. These results help populate the sparse regime of warm planets, which serve as key tracers of planetary evolution, and demonstrate ASTEP's effectiveness as a ground-based follow-up instrument for long-period systems.",
      "pdf_url": "https://arxiv.org/pdf/2510.01725.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01975",
      "title": "Impact Plasma Amplification of the Ancient Mercury Magnetic Field",
      "authors": [
        "Isaac S. Narrett",
        "Rona Oran",
        "Yuxi Chen",
        "Katarina Miljković",
        "Gábor Tóth",
        "Catherine L. Johnson",
        "Benjamin P. Weiss"
      ],
      "abstract": "Impact Plasma Amplification of the Ancient Mercury Magnetic Field Isaac S. Narrett, Rona Oran, Yuxi Chen, Katarina Miljković, Gábor Tóth, Catherine L. Johnson, Benjamin P. Weiss Earth and Planetary Astrophysics (astro-ph.EP); Space Physics (physics.space-ph) Spacecraft measurements of Mercury indicate it has a core dynamo with a surface field of 200-800 nT. These data also indicate that the crust contains remanent magnetization likely produced by an ancient magnetic field. The inferred magnetization intensity is consistent with a wide range of paleofield strengths (0.2-50 uT), possibly indicating that Mercury once had a dynamo field much stronger than today. Recent modeling of ancient lunar impacts has demonstrated that plasma generated during basin-formation can transiently amplify a planetary dynamo field near the surface. Simultaneous impact-induced pressure waves can then record these fields in the form of crustal shock remanent magnetization (SRM). Here, we present impact hydrocode and magnetohydrodynamic simulations of a Caloris-size basin (~1,550 km diameter) formation event. Our results demonstrate that the ancient magnetospheric field (~0.5-0.9 uT) created by the interaction of the ancient interplanetary magnetic field (IMF) and Mercury's dynamo field can be amplified by the plasma up to ~13 uT and, via impact pressure waves, be recorded as SRM in the basin antipode. Such magnetization could produce ~5 nT crustal fields at 20-km altitude antipodal to Caloris detectable by future spacecraft like BepiColombo. Furthermore, impacts in the southern hemisphere that formed ~1,000 km diameter basins (e.g., Andal-Coleridge, Matisse-Repin, Eitkou-Milton, and Sadi-Scopus) could impart crustal magnetization in the northern hemisphere, contributing to the overall remanent field measured by MESSENGER. Overall, the impact plasma amplification process can contribute to crustal magnetization on airless bodies and should be considered when reconstructing dynamo history from crustal anomaly measurements.",
      "pdf_url": "https://arxiv.org/pdf/2510.01975.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.01985",
      "title": "A decade of transit photometry for K2-19: Revised system architecture",
      "authors": [
        "J.M. Almenara",
        "R. Mardling",
        "A. Leleu",
        "R.F. Díaz",
        "X. Bonfils",
        "Ing-Guey Jiang",
        "Li-Chin Yeh",
        "Ming Yang",
        "Keivan G. Stassun",
        "Napaporn A-thano",
        "Billy Edwards",
        "F. Bouchy",
        "V. Bourrier",
        "A. Deline",
        "D. Ehrenreich",
        "E. Fontanet",
        "T. Forveille",
        "J.M. Jenkins",
        "L.K.W. Kwok",
        "M. Lendl",
        "A. Psaridi",
        "S. Udry",
        "J. Venturini",
        "J. Winn"
      ],
      "abstract": "A decade of transit photometry for K2-19: Revised system architecture J.M. Almenara, R. Mardling, A. Leleu, R.F. Díaz, X. Bonfils, Ing-Guey Jiang, Li-Chin Yeh, Ming Yang, Keivan G. Stassun, Napaporn A-thano, Billy Edwards, F. Bouchy, V. Bourrier, A. Deline, D. Ehrenreich, E. Fontanet, T. Forveille, J.M. Jenkins, L.K.W. Kwok, M. Lendl, A. Psaridi, S. Udry, J. Venturini, J. Winn 22 pages, 26 figures, accepted for publication in A&A Earth and Planetary Astrophysics (astro-ph.EP) The star K2-19 hosts a pair of Neptunian planets deep inside the 3:2 resonance. They induce strong transit-timing variations with two incommensurate frequencies. Previous photodynamical modeling of 3.3 years of transit and radial velocity data produced mass estimates of 32.4 +/- 1.7 M_E and 10.8 +/- 0.6 M_E for planets b and c, respectively, and corresponding eccentricity estimates of 0.20 +/- 0.03 and 0.21 +/- 0.03. These high eccentricities raise questions about the formation origin of the system, and this motivated us to extend the observing baseline in an attempt to better constrain their values. We present a photodynamical analysis of 10 years of transit data that confirms the previous mass estimates (30.8 +/- 1.3 M_E and 11.1 +/- 0.4 M_E), but reduces the median eccentricities to 0.04 +/- 0.02 and 0.07 +/- 0.02 for b and c, respectively. These values are more consistent with standard formation models, but still involve nonzero free eccentricity. The previously reported high eccentricities appear to be due to a single transit for which measurements taken at twilight mimicked ingress. This resulted in a 12-minute error in the midtransit time. The data that covered 1.3 and 5 so-called super and resonant periods were used to match a Fourier analysis of the transit-timing variation signal with simple analytic expressions for the frequencies and amplitudes to obtain planet mass estimates within 2% of the median photodynamical values, regardless of the eccentricities. Theoretical details of the analysis are presented in a companion paper. Additionally, we identified a possible planet candidate situated exterior to the b-c pair. Finally, in contrast to a previous study, our internal structure modeling of K2-19 b yields a metal mass fraction that is consistent with core accretion.",
      "pdf_url": "https://arxiv.org/pdf/2510.01985.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02003",
      "title": "Mercury Crustal Magnetization Indicates a Stronger Ancient Dynamo",
      "authors": [
        "Isaac S. Narrett",
        "Benjamin P. Weiss",
        "Sarah C. Steele",
        "John B. Biersteker"
      ],
      "abstract": "Mercury Crustal Magnetization Indicates a Stronger Ancient Dynamo Isaac S. Narrett, Benjamin P. Weiss, Sarah C. Steele, John B. Biersteker Earth and Planetary Astrophysics (astro-ph.EP) Mercury is the only other terrestrial planet in the solar system with an active dynamo magnetic field (~200 nT at the equatorial surface). Furthermore, Mercury's ~3.9-3.7 billion-year old (Ga) crust is strongly magnetized (~10 nT at ~30-km altitude), indicating the presence of a past dynamo. However, the source and strength of the field that magnetized this crust are unknown. To address this, we performed three-dimensional magnetohydrodynamic simulations of the ancient solar wind interaction with the planetary field and coupled them with thermal cooling and magnetization models. We show that the crustal magnetization was likely produced by a surface field of at least ~2,000 nT, likely >10,000 nT (i.e., ~10x or ~50-100x stronger than at present). Such strong fields likely exclude both the solar wind feedback and thermoelectric mechanisms for driving the dynamo at 3.7 Ga ago. Instead, our results are compatible with the past dynamo being powered by an enhanced energy flux that drove strong core convection.",
      "pdf_url": "https://arxiv.org/pdf/2510.02003.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02176",
      "title": "Investigating the Sulfur Mystery in Protoplanetary Disks Through Chemical Modeling",
      "authors": [
        "Becky J. Williams",
        "L. Ilsedore Cleeves",
        "Rachel E. Gross",
        "Jackson Baker"
      ],
      "abstract": "Investigating the Sulfur Mystery in Protoplanetary Disks Through Chemical Modeling Becky J. Williams, L. Ilsedore Cleeves, Rachel E. Gross, Jackson Baker 14 pages, 8 figures, accepted for publication in ApJ Earth and Planetary Astrophysics (astro-ph.EP) Sulfur is a critical element to life on Earth, and with detections of sulfur-bearing molecules in exoplanets and comets, questions arise as to how sulfur is incorporated into planets in the first place. In order to understand sulfur's journey from molecular clouds to planets, we need to understand the molecular forms that sulfur takes in protoplanetary disks, where the rotational emission from sulfur-bearing molecules in the gas phase indicates a very low abundance. To address this question, we have updated the 2D time-dependent disk chemical modeling framework of Fogel et al. (2011) to incorporate several new sulfur species and hundreds of new sulfur reactions from the literature. Specifically, we investigate the main molecular forms that sulfur takes in a disk orbiting a solar mass young T Tauri star. We explore the effects of different volatile (reactive) sulfur abundances, C/O ratios, initial sulfur molecular forms, and cosmic-ray ionization rates. We find that a high C/O ratio can explain both the prevalence of CS observed in disks and the lack of SO detections, consistent with previous results. Additionally, initial sulfur form greatly affects the ice abundances in the lower layers of the disk, which has implications for comet formation and future observations with JWST.",
      "pdf_url": "https://arxiv.org/pdf/2510.02176.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02201",
      "title": "Understanding the Origins of Super-Puff Planets: A New Mass-Loss Regime Coupled to Planetary Evolution",
      "authors": [
        "Yao Tang",
        "Jonathan J. Fortney",
        "Ruth Murray-Clay",
        "Madelyne Broome"
      ],
      "abstract": "Understanding the Origins of Super-Puff Planets: A New Mass-Loss Regime Coupled to Planetary Evolution Yao Tang, Jonathan J. Fortney, Ruth Murray-Clay, Madelyne Broome 22 pages, 12 figures; second revision with minor comments under review at ApJ Earth and Planetary Astrophysics (astro-ph.EP) Super-puffs are a class of low-mass, large-radius planets that have challenged planet formation and evolution models. Their high inferred H/He mass fractions, required to explain their physical sizes, would lead to rapid atmospheric escape, raising questions about their long-term retention. Recent modeling work indicates that low-mass planets typically require 50\\% less H/He mass to match their observed radius, due to significant roles of the radiative atmosphere and interior heating from the rock/iron core. Here, through a new quantitative analysis of XUV-driven escape in sub-Neptunes, we find that previous studies overestimated mass loss, as scaling laws in low-gravity regimes deviate greatly from the widely used energy-limited regime. We define a new regime, thermal-energy-mediated photoevaporation (TEMP), in which thermal energy conversion critically sets the mass-loss rate. These effects make super-puffs more resilient to mass loss than previously thought. We develop a coupled evolution model integrating this updated thermal evolution framework with a 1D hydrodynamic photoevaporation model. Applying this novel, joint model to observed super-puffs and young low-density planets, we find that their masses, radii and transit pressures align with predictions assuming either a clear or hazy atmosphere. This indicates that super-puffs have undergone a combination of boil-off and photoevaporative mass loss, with boil-off dominating the process. Our results indicate that low-density planets typically possess both a thick convective envelope and substantial radiative atmosphere, which contribute to their large radii. For this to occur, these planets must have intermediate masses of 5-10$M_\\oplus$ and receive stellar insolation $\\lesssim 30F_\\oplus$, favoring FG-type stars over M-dwarfs.",
      "pdf_url": "https://arxiv.org/pdf/2510.02201.pdf",
      "categories": [
        "astro-ph.EP"
      ],
      "primary_category": "astro-ph.EP",
      "is_gw_related": false
    }
  ]
}