{
  "date": "2025-10-01",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 66,
  "gw_related_papers": 16,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2509.22730",
      "title": "Canonical Quantization of Spherically Symmetric Einstein-Scalar Field Solutions",
      "authors": [
        "Jiří Černý"
      ],
      "abstract": "Canonical Quantization of Spherically Symmetric Einstein-Scalar Field Solutions Jiří Černý General Relativity and Quantum Cosmology (gr-qc) We investigate canonical quantization of a general spherically symmetric spacetimes with a massless scalar-field source and examine the associated constraint algebra. The spacetimes are quantized using Dirac's quantization method for constrained systems, producing a set of Wheeler-DeWitt equations. A general solution for some of these equations, specifically the momentum constraint, is found and discussed. A complete solution to the whole set of equations (namely the Hamiltonian constraint) remains yet to be found, however. A full solution can be recovered for a static version of these spacetimes.",
      "pdf_url": "https://arxiv.org/pdf/2509.22730.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.22880",
      "title": "Strong lensing by GUP-improved black holes",
      "authors": [
        "Javier Chagoya",
        "I. Díaz-Saldaña",
        "Benito Rodríguez",
        "Wilfredo Yunpanqui"
      ],
      "abstract": "Strong lensing by GUP-improved black holes Javier Chagoya, I. Díaz-Saldaña, Benito Rodríguez, Wilfredo Yunpanqui General Relativity and Quantum Cosmology (gr-qc) We employ Bozza's method to calculate the deflection angle of light in the presence of the strong gravitational field generated by an improved Schwarzschild-like black hole whose metric, regular throughout the entire spacetime, was derived using the improved Generalized Uncertainty Principle (GUP). This framework incorporates effective quantum gravity corrections that resolve the physical singularity inside the black hole, quantified by a model parameter $\\vert \\tilde{Q}_{c}\\vert$. In addition, the event horizon, the photon sphere, and the shadow radius receive modifications characterized by a second model parameter $\\tilde{Q}_{b}$. Using observational properties of the supermassive black holes Messier~87$\\ast$ and Sagittarius~A$\\ast$ reported by the Event Horizon Telescope, we derive constraints on the parameter $\\vert \\tilde{Q}_{b}\\vert$, namely $0 \\leq \\vert \\tilde{Q}_{b}\\vert \\leq 0.3$. To the best of our knowledge, these are the first constraints reported in the literature for this improved GUP parameter. Since $\\vert \\tilde{Q}_{c}\\vert$ does not play a significant role in the correction of the shadow radius, it was not possible to impose restrictions on its allowed values. However, it is important to consider a non-zero $\\vert \\tilde{Q}_{c}\\vert$ in order to avoid a black hole singularity.",
      "pdf_url": "https://arxiv.org/pdf/2509.22880.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23028",
      "title": "Error quantification and comparison of binary neutron star gravitational waveforms from numerical relativity codes",
      "authors": [
        "Sarah Habib",
        "Elias R. Most",
        "Nils Deppe",
        "Francois Foucart",
        "Mark A. Scheel",
        "Saul Teukolsky",
        "Michael Boyle",
        "Matthew Duez",
        "Larry Kidder",
        "Jordan Moxon",
        "Kyle C. Nelli",
        "Harald Pfeiffer",
        "William Throwe",
        "Nils Vu"
      ],
      "abstract": "Error quantification and comparison of binary neutron star gravitational waveforms from numerical relativity codes Sarah Habib, Elias R. Most, Nils Deppe, Francois Foucart, Mark A. Scheel, Saul Teukolsky, Michael Boyle, Matthew Duez, Larry Kidder, Jordan Moxon, Kyle C. Nelli, Harald Pfeiffer, William Throwe, Nils Vu General Relativity and Quantum Cosmology (gr-qc) Future gravitational wave detections of merging binary neutron star systems have the possibility to tightly constrain the equation of state of dense nuclear matter. In order to extract such constraints, gravitational waveform models need to be calibrated to accurate numerical relativity simulations of the late inspiral and merger. In this work, we take an essential step toward classifying the error and potential systematics in current generation numerical relativity simulations of merging binary neutron stars. To this end, we perform a direct comparison of two codes (FIL, SpEC), which differ in many aspects, including the numerical methods and discretizations used and equations solved. We find that despite these different approaches, the codes are -- within current numerical resolution bounds -- fully consistent, and broadly comparable in cost for a given accuracy level. Our results indicate that the error in the waveforms is primarily dominated by the hydrodynamic evolution, consistent with earlier findings in the literature. We also discuss current limitations and cost estimates for numerical relativity simulations to reach the accuracies required in the era of next-generation gravitational wave detectors.",
      "pdf_url": "https://arxiv.org/pdf/2509.23028.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.23029",
      "title": "Mass and distance of AGN black holes from warped accretion disks",
      "authors": [
        "Adriana González-Juárez",
        "Alfredo Herrera-Aguilar"
      ],
      "abstract": "Mass and distance of AGN black holes from warped accretion disks Adriana González-Juárez, Alfredo Herrera-Aguilar General Relativity and Quantum Cosmology (gr-qc) Along the last ten years, a general relativistic method has been developed to generate analytical expressions for the black hole (BH) parameters in terms of observations, namely the frequency shift of photons emitted by orbiting test particles and their positions on the sky. Applications of the method to astrophysical systems such as Active Galactic Nuclei (AGNs), in particular to megamaser systems orbiting the central BH on their flat accretion disks, showed a coupling behavior in the mass-to-distance ratio $M/D$. Estimates for the ratio $M/D$ of a sample of BHs hosted at the core of several AGNs have been performed in recent years with the help of this method. However, both analytical expressions and statistical estimations depend only on the $M/D$ ratio rather than on independent parameters. It is of current general interest to work with decoupled parameters in order to safeguard the intrinsic physical information encoded in each of them, given their high scientific relevance in understanding the structure of our Universe. The purpose of this work is to find analytical expressions for the mass and distance of a Schwarzschild BH in terms of astrophysical observations by introducing a slight warping in the accretion disk of the orbiting megamasers. As a result, independent analytical formulas for the mass and distance of AGN supermassive BHs are presented in terms of astrophysical observations: maser frequency shifts, disk parameters, and the galaxy's peculiar redshift.",
      "pdf_url": "https://arxiv.org/pdf/2509.23029.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23134",
      "title": "Vector Horndeski black holes in nonlinear electrodynamics",
      "authors": [
        "Che-Yu Chen",
        "Antonio De Felice",
        "Shinji Tsujikawa",
        "Taishi Sano"
      ],
      "abstract": "Vector Horndeski black holes in nonlinear electrodynamics Che-Yu Chen, Antonio De Felice, Shinji Tsujikawa, Taishi Sano General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) On a spherically symmetric and static background, we study the existence of linearly stable black hole (BH) solutions in nonlinear electrodynamics (NED) with a Horndeski vector-tensor (HVT) coupling, with and without curvature singularities at the center ($r=0$). Incorporating the electric charge $q_E$ and the magnetic charge $q_M$, we first show that nonsingular BHs can exist only if $q_M = 0$. We then study the stability of purely electric BHs by analyzing the behavior of perturbations in the metric and the vector field. Nonsingular electric BHs are unstable due to a Laplacian instability in the vector perturbation near the regular center. In the absence of the HVT coupling ($\\beta=0$), singular BHs in power-law NED theories can be consistent with all linear stability conditions, while Born-Infeld BHs encounter strong coupling due to a vanishing propagation speed as $r \\to 0$. In power-law NED and Born-Infeld theories with $\\beta \\neq 0$, the electric fields for singular BHs are regular near $r=0$, while the metric functions behave as $\\propto r^{-1}$. Nevertheless, we show that Laplacian instabilities occur for regions inside the outer horizon $r_h$, unless the HVT coupling constant $\\beta$ is significantly smaller than $r_h^2$. For $\\beta \\neq 0$, we also reconstruct the NED Lagrangian so that one of the metric functions takes the Reissner-Nordström form. In this case, there exists a branch where all squared propagation speeds are positive, but the ghost and strong coupling problems are present around the BH center. Thus, the dominance of the HVT coupling generally leads to BH instability in the high-curvature regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.23134.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23187",
      "title": "The characteristics of circular motion and quasiperiodic oscillations around accelerating black hole",
      "authors": [
        "Tao-Tao Sui",
        "Xin-Yang Wang"
      ],
      "abstract": "The characteristics of circular motion and quasiperiodic oscillations around accelerating black hole Tao-Tao Sui, Xin-Yang Wang General Relativity and Quantum Cosmology (gr-qc) {This study explores the motion of massive test particles and associated quasi-periodic oscillations (QPOs) around an accelerating black hole. The acceleration factor $A$ suppresses the radial effective potential $V_{\\text{eff}}$, thereby lowering the energy $E$ and angular momentum $L$ required for stable circular orbits. Stability demands $\\partial_r^2 V_{\\text{eff}} \\geq 0$, setting an upper bound $AM$ $\\leq 0.0161$. As $A$ increases, the innermost stable circular orbit (ISCO) radius grows, while $L_{\\text{ISCO}}$ and $E_{\\text{ISCO}}$ decrease. Radiative efficiency $\\epsilon$ rises with $A$, peaking at $6.9\\%$. Fundamental frequencies show that $A$ accelerates the decay of the Keplerian $\\Omega_{\\phi}$ and vertical $\\Omega_{\\theta}$ frequencies, while suppressing the radial frequency. The divergence between $\\Omega_{\\theta}$ and $\\Omega_{\\phi}$ increases with $A$, differing from spherical black hole behavior. Using the RP, ER3, ER4, and WD QPO models, the WD model predicts the highest frequencies. The resonant radius of ER4 model remains fixed across frequency ratios, unlike ER3. Although $A$ suppresses twin-peak QPO frequencies, it enhances the nodal precession frequency $\\nu_{\\text{nod}}$. Fitting observational data from GRO J1655-40 and XTE J1859+226 and applying the TOV limit, the ER4 model uniquely fits GRO J1655-40 with $(10^3A, M, r/M) \\approx (4.31, 3.43 M_\\odot, 8.08)$. For XTE J1859+226, three models yield $10^3A \\approx 1.4$, excluding ER3, suggesting stronger acceleration in GRO J1655-40.}",
      "pdf_url": "https://arxiv.org/pdf/2509.23187.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23215",
      "title": "Echoes from the Minkowski-core spacetime",
      "authors": [
        "Dan Zhang",
        "Qin Tan",
        "Guoyang Fu",
        "Huajie Gong",
        "Jian-Pin Wu",
        "Qiyuan Pan"
      ],
      "abstract": "Echoes from the Minkowski-core spacetime Dan Zhang, Qin Tan, Guoyang Fu, Huajie Gong, Jian-Pin Wu, Qiyuan Pan General Relativity and Quantum Cosmology (gr-qc) In this study, we construct a class of horizonless exotic compact objects (ECOs) with Minkowski core, classifying them as either photon sphere ECOs (PS ECOs) or photon sphere lacking ECOs (PL ECOs) based on photon sphere topology. Time domain analysis reveals that the dynamical evolution can be divided into three phases: the initial ringdown, the echo phase, and the final ringdown. The echo signals exhibit the periodic damping, with quantum effects significantly accelerating the echo dissipation and prompting an earlier transition to the long lived mode dominated phase. Furthermore, the QNM spectrum of the PS ECO exhibits fundamentally different behavior from that of BHs including the presence of long lived modes and the absence of overtone outbursts providing a clear spectroscopic signature distinguishing PS ECOs from BHs. This work is significant in providing new theoretical foundations and waveform features for identifying such quantum corrected ECOs, contributing critically to the understanding of quantum gravity effects.",
      "pdf_url": "https://arxiv.org/pdf/2509.23215.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23318",
      "title": "Gravitational waveforms from periodic orbits around a novel regular black hole",
      "authors": [
        "Huajie Gong",
        "Sheng Long",
        "Xi-Jing Wang",
        "Zhongwu Xia",
        "Jian-Pin Wu",
        "Qiyuan Pan"
      ],
      "abstract": "Gravitational waveforms from periodic orbits around a novel regular black hole Huajie Gong, Sheng Long, Xi-Jing Wang, Zhongwu Xia, Jian-Pin Wu, Qiyuan Pan General Relativity and Quantum Cosmology (gr-qc) The detection of gravitational waves (GWs) by LIGO and Virgo has ushered in a new era of strong-field tests of general relativity. We explore potential quantum gravity signatures by studying periodic orbits and their GW emissions around a novel regular black hole featuring a Minkowski core. Using a rational number $q$, periodic orbits are classified, revealing that the deviation parameter $\\alpha_0$ reshapes the bound-orbit region while preserving characteristic \"zoom-whirl\" structures. Numerical kludge waveforms reveal detectable phase shifts and amplitude modulations induced by quantum gravity effects. Faithfulness analysis demonstrates that larger $\\alpha_0$ and $q$ enhance distinguishability from the Schwarzschild case, suggesting that large-$q$ periodic orbits in extreme mass ratio inspirals serve as sensitive probes for quantum gravity effects.",
      "pdf_url": "https://arxiv.org/pdf/2509.23318.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.23329",
      "title": "ACT Constraints on Marginally Deformed Starobinsky Inflation",
      "authors": [
        "Jureeporn Yuennan",
        "Farruh Atamurotov",
        "Phongpichit Channuie"
      ],
      "abstract": "ACT Constraints on Marginally Deformed Starobinsky Inflation Jureeporn Yuennan, Farruh Atamurotov, Phongpichit Channuie General Relativity and Quantum Cosmology (gr-qc) We investigate the inflationary phenomenology of a marginally deformed Starobinsky model, motivated by quantum corrections to the $R^{2}$ term, in light of the latest cosmological observations. In this framework, the inflationary potential acquires a small deformation parameter, $\\gamma$, which shifts predictions away from the exact Starobinsky limit. Using the slow-roll formalism, we derive analytic expressions for the spectral index $n_{s}$ and tensor-to-scalar ratio $r$ and confront them with constraints from Planck, ACT, and DESI data. Our analysis shows that nonzero values of $\\gamma$ raise both $n_{s}$ and $r$, thereby alleviating the $\\gtrsim 2\\sigma$ tension between the Starobinsky $R^{2}$ scenario and the ACT+DESI (P-ACT-LB) measurements, which favor $n_{s} \\simeq 0.9743 \\pm 0.0034$. For $N \\sim 60$ $e$-foldings, the model consistently reproduces the observed amplitude of primordial perturbations while predicting tensor contributions within current observational bounds. We also demonstrate that the deformation softens the otherwise severe fine-tuning of the quartic self-coupling in minimally coupled inflation. The parameter range $\\gamma \\sim \\mathcal{O}(10^{-3})$-$\\mathcal{O}(10^{-2})$ emerges as phenomenologically viable, providing a natural extension of Starobinsky inflation compatible with present data. We conclude that marginally deformed $R^{2}$ inflation remains a compelling and testable candidate for the primordial dynamics of the Universe, with future CMB and gravitational-wave observations expected to further probe its parameter space.",
      "pdf_url": "https://arxiv.org/pdf/2509.23329.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.23372",
      "title": "Black hole spectral instability triggered by deterministic and random metric perturbations",
      "authors": [
        "Shui-Fa Shen",
        "Guan-Ru Li",
        "Ramin G. Daghigh",
        "Jodin C. Morey",
        "Michael D. Green",
        "Wei-Liang Qian",
        "Rui-Hong Yue"
      ],
      "abstract": "Black hole spectral instability triggered by deterministic and random metric perturbations Shui-Fa Shen, Guan-Ru Li, Ramin G. Daghigh, Jodin C. Morey, Michael D. Green, Wei-Liang Qian, Rui-Hong Yue General Relativity and Quantum Cosmology (gr-qc) Owing to its substantial implications for black hole spectroscopy, spectral instability has attracted considerable attention in the literature. While the emergence of such instability is attributed to the non-Hermitian nature of the gravitational system, it remains sensitive to various factors. About the spatial scale of the metric deformation, spectral instability is particularly susceptible to ``ultraviolet'' metric perturbations. In this work, we conduct a comprehensive analysis of black hole spectral instability triggered by random and deterministic metric perturbations. We investigate the dependence on the magnitude, spatial scale, and localization of the metric perturbations in the Pöschl-Teller effective potential, and discuss the underlying physical interpretations. It is observed that small metric perturbations initially have a limited impact on the less damped black hole quasinormal modes, and deviations typically around their unperturbed values, a phenomenon first derived by Skakala and Visser in a more restrictive context. In the higher overtone region, the deformation propagates, amplifies, and eventually gives rise to spectral instability and, inclusively, bifurcation in the quasinormal mode spectrum. While deterministic metric perturbations give rise to a deformed but well-defined quasinormal spectrum, random perturbations lead to uncertainties in the resulting spectrum. Nonetheless, the primary trend of the spectral instability remains consistent, being sensitive to both the strength and location of the perturbation. However, we demonstrate that the observed spectral instability might be suppressed for metric perturbations that are physically appropriate.",
      "pdf_url": "https://arxiv.org/pdf/2509.23372.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23388",
      "title": "Adiabatic and point-splitting regularization of spin-1/2 field in de Sitter space",
      "authors": [
        "Xuan Ye",
        "Yang Zhang"
      ],
      "abstract": "Adiabatic and point-splitting regularization of spin-1/2 field in de Sitter space Xuan Ye, Yang Zhang General Relativity and Quantum Cosmology (gr-qc) We study the regularization of a spin-1/2 fieldin the vacuum state in de Sitter space. We find that the 2nd order adiabatic regularization is sufficient to remove all UV divergences for the spectral stress tensor, as well as for the power spectrum. The regularized vacuum stress tensors of the massive field is maximally symmetric with the energy density remaining negative, and behaves as a ``negative\" cosmological constant. In the massless limit it reduces smoothly to the zero stress tensor of the massless field, and there is no trace anomaly. We also perform the point-splitting regularization in coordinate space, and obtain the analytical, regularized correlation function and stress tensor, which agree with those from the adiabatic regularization. In contrast, the 4th order regularization is an oversubtraction, and changes the sign of the vacuum energy density. In the massless limit the 4th order regularized auto-correlation becomes singular and the regularized stress tensor does not reduce to the zero stress tensor of the massless field. These difficulties tell that the 4th order regularization is inadequate for the spin-1/2 massive field.",
      "pdf_url": "https://arxiv.org/pdf/2509.23388.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23432",
      "title": "Null integrability and photon phenomenology in the accelerated Schwarzschild black hole",
      "authors": [
        "Shokoufe Faraji",
        "Eva Hackmann"
      ],
      "abstract": "Null integrability and photon phenomenology in the accelerated Schwarzschild black hole Shokoufe Faraji, Eva Hackmann General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this study we analyse null geodesics in an accelerated Schwarzschild black hole sustained by a cosmic string/strut (C-metric) in the sub-extremal regime. Using dimensionless variables and a Mino-type parameter we cast the equations into a complete first order form. For photons the conformal Hamilton-Jacobi equation separates and the radial and polar motion reduce to Bierman-Weierstrass form, yielding new closed analytic solutions. This provides a clean classification of photon trajectories, identifies a fixed photon cone that replaces equatorial symmetry when the acceleration is nonzero, and locates a single spherical photon surface shared by all latitudes. On the observational side, we prove that the shadow seen by any static observer is an exact circle: its screen radius depends on the acceleration and observer location but not on the conicity, so the local shadow cannot bound the string tension. We provide compact expressions for the photon ring orbital frequency and Lyapunov exponent and use them to obtain eikonal quasinormal estimates; we also show how a single shadow measurement at known position uniquely infers the dimensionless acceleration. As diagnostics of the background, we compute the (generally unequal) surface gravities of the black hole and acceleration horizons and derive an exact redshift law between static worldlines.",
      "pdf_url": "https://arxiv.org/pdf/2509.23432.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23490",
      "title": "The mechanism for creating\"dynamical gravastar'' black hole mimickers can also explain formation of \"little red dots''",
      "authors": [
        "Stephen L. Adler"
      ],
      "abstract": "The mechanism for creating\"dynamical gravastar'' black hole mimickers can also explain formation of \"little red dots'' Stephen L. Adler General Relativity and Quantum Cosmology (gr-qc) We argue that a high pressure phase transition of relativistic matter to a state with negative energy density, which leads to the formation of horizonless black hole mimickers, can also give rise to the appearance of ``little red dots''. The energy source for the dots is the release of latent energy from the phase transition, and their redness is a result of this release taking place in a central region of exponentially small positive $g_{00}$, and hence very high gravitational redshift.",
      "pdf_url": "https://arxiv.org/pdf/2509.23490.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23600",
      "title": "Geodesic deviation to all orders via a tangent bundle formalism",
      "authors": [
        "Joon-Hwi Kim"
      ],
      "abstract": "Geodesic deviation to all orders via a tangent bundle formalism Joon-Hwi Kim 5 pages (+ 11 pages appendices and references), 2 figures; General Relativity and Quantum Cosmology (gr-qc) We establish an in-in formalism for geodesic deviation as an alternative to Synge calculus, based on a covariant calculus of differential forms in tangent bundle. This derives the exact Lagrangian and equations governing the finite geodesic deviation between a free-falling test particle and an arbitrary observer, in terms of infinite sums whose coefficients are products of binomial coefficients. Explicit expressions are provided up to tenth order, finding agreements with the previous fourth-order result.",
      "pdf_url": "https://arxiv.org/pdf/2509.23600.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23732",
      "title": "Quasinormal modes of an electrically charged Kalb-Ramond black hole",
      "authors": [
        "Yun-Tao Gu",
        "Wen-Di Guo",
        "Yu-Xiao Liu"
      ],
      "abstract": "Quasinormal modes of an electrically charged Kalb-Ramond black hole Yun-Tao Gu, Wen-Di Guo, Yu-Xiao Liu General Relativity and Quantum Cosmology (gr-qc) Lorentz violation serves as a significant feature in many modified theories of gravity. In particular, spontaneous Lorentz violation induced by the Kalb-Ramond field has attracted considerable attention. Recently, an electrically charged black hole solution within the Kalb-Ramond framework was proposed. In this study, we investigate the quasinormal modes of the resulting ``undecouplable'' system using both the matrix-valued continued fraction method and the matrix-valued direct integration method. Additionally, we develop a new approach to distinguish between different modes in such ``undecouplable'' systems. An error analysis is performed, and the influence of Lorentz violation on the fundamental quasinormal modes is systematically analyzed within a suitable parameter range.",
      "pdf_url": "https://arxiv.org/pdf/2509.23732.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23845",
      "title": "Thermoelectric conduction in General Relativity: a causal, stable, and well-posed theory",
      "authors": [
        "Lorenzo Gavassino"
      ],
      "abstract": "Thermoelectric conduction in General Relativity: a causal, stable, and well-posed theory Lorenzo Gavassino 6 pages and 5 figures (main text) + 6 pages and 1 figure (supplementary material), comments welcome! General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Nuclear Theory (nucl-th) We present a covariantly stable first-order framework for describing charge and heat transport in isotropic rigid solids embedded in curved spacetime. Working in the Lorenz gauge, we show that the associated initial value problem is both causal and locally well-posed in the fully nonlinear regime. We then apply such framework to explore a range of gravitothermoelectric effects in metals undergoing relativistic acceleration. These include (1) the separation of charge through acceleration, (2) the non-uniformity of Joule heating across accelerating circuits due to time dilation, and (3) the effect of redshift on magnetic diffusion. As an astrophysical application, we derive a relativistic Thomas-Fermi equation governing the charge distribution inside a compact object, also accounting for Seebeck charge displacements driven by cooling.",
      "pdf_url": "https://arxiv.org/pdf/2509.23845.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "nucl-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23934",
      "title": "Quasibound States and Superradiant Instability of Black Hole in Analog Gravity",
      "authors": [
        "Hang Liu",
        "Hong Guo"
      ],
      "abstract": "Quasibound States and Superradiant Instability of Black Hole in Analog Gravity Hang Liu, Hong Guo General Relativity and Quantum Cosmology (gr-qc) In this paper, we adopt continued fraction method (CFM) associated with VBK approach, which is recently developed by Vieira, Bezerra and Kokkotas, to investigate the spectrum of quasibound states (QBS) and superradiant instability of massive scalar perturbation imposed on analog rotating black hole in photon-fluid model. We analyze the effects of black hole angular velocity $\\Omega_H$ and scalar field mass $\\mu$ on QBS spectrum with positive and negative winding number $m=\\pm1$, respectively. In addition to the fundamental frequency, we also investigate the overtones in order to disclose more distinctions of spectrum between the states of $m=\\pm 1$. We show that the sign of winding number can produce notable impacts on the spectrum, particularly to the imaginary part of the spectrum. We study the superradiant instability and find that the maximum instability for a given $\\Omega_H$ is not in monotonic relationship with angular velocity, which is in contrast to the case in Kerr black hole spacetime. As expected, the strength of superradiant instability can be significantly weakened by increasing the winding number. These findings imply that there exists a critical angular velocity under which the instability is strongest in parameter space, and we are supposed to find it out at $m=1$. Indeed, this max instability is found to be $\\omega_{Imax}\\approx 1.13374\\times 10^{-5}$ related to the critical angular velocity $\\Omega_H\\approx1.22$.",
      "pdf_url": "https://arxiv.org/pdf/2509.23934.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.23987",
      "title": "Inflation from entropy",
      "authors": [
        "Udaykrishna Thattarampilly",
        "Yunlong Zheng"
      ],
      "abstract": "Udaykrishna Thattarampilly, Yunlong Zheng General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We investigate cosmological solutions for the modified gravity theory obtained from quantum relative entropy between the metric of spacetime and the metric induced by the geometry and matter fields. The vacuum equations admit inflationary solutions, hinting at an entropic origin for inflation. Equations also admit a regime of phantom like behavior. Assuming that the relation between slow roll parameters and CMB observables holds for entropic gravity, the theory predicts a viable spectrum.",
      "pdf_url": "https://arxiv.org/pdf/2509.23987.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24041",
      "title": "Interaction of exact gravitational waves with matter",
      "authors": [
        "Morteza Mohseni",
        "Saurya Das"
      ],
      "abstract": "Interaction of exact gravitational waves with matter Morteza Mohseni, Saurya Das Phys. Lett. B 870 (2025) 139897 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We consider interactions of exact (i.e., solutions of full nonlinear field equations) gravitational waves with matter by using the Einstein-Boltzmann equation. For a gravitational wave interacting with a system of massless particles, we compute the perturbed energy-momentum tensor and obtain explicit form of a set of Einstein-Boltzmann equations. We find solution to this system of equations to obtain the gravitational wave profile. The interaction superposes a static term on the gravitational wave profile which depends on the difference between square of the temperatures of the system in the absence and in the presence of the wave. We compute this perturbed term when the states of the system obey Bose-Einstein, Fermi-Dirac, and Maxwell-Boltzmann distributions, respectively. The relative strength of this term is roughly half for the Fermi-Dirac, and one-third for the Maxwell-Boltzmann distributions compared with that of the Bose-Einstein distribution. We consider both Minkowski and flat Friedmann-Robertson-Walker backgrounds.",
      "pdf_url": "https://arxiv.org/pdf/2509.24041.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.24052",
      "title": "Regular Bardeen black holes within non-minimal scalar-linear electrodynamic couplings",
      "authors": [
        "Daniela S. J. Cordeiro",
        "Ednaldo L. B. Junior",
        "José Tarciso S. S. Junior",
        "Francisco S. N. Lobo",
        "Jorde A. A. Ramos",
        "Manuel E. Rodrigues",
        "Diego Rubiera-Garcia",
        "Luís F. Dias da Silva",
        "Henrique A. Vieira"
      ],
      "abstract": "Regular Bardeen black holes within non-minimal scalar-linear electrodynamic couplings Daniela S. J. Cordeiro, Ednaldo L. B. Junior, José Tarciso S. S. Junior, Francisco S. N. Lobo, Jorde A. A. Ramos, Manuel E. Rodrigues, Diego Rubiera-Garcia, Luís F. Dias da Silva, Henrique A. Vieira General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) In this paper, we demonstrate that a linear electromagnetic matter source can be constructed for regular black hole solutions, illustrated by the case of the Bardeen black hole. Our method relies on coupling a scalar field and its potential to General Relativity (GR) alongside electrodynamics. Both fields are minimally coupled to GR but interact with each other. We validate this approach by interpreting the Bardeen solution either as a purely magnetic or as a purely electric configuration for a spherically symmetric metric with an arbitrary electrodynamics Lagrangian $\\mathcal{L}(F)$ and a coupling function $W(\\varphi)$. By choosing an appropriate form of $W$, the electromagnetic Lagrangian can be rendered linear. We then analyze the behavior of the coupling function and the scalar field potential, emphasizing their relation to the magnetic or electric charge. Finally, we compare the advantages and disadvantages of this framework with the conventional formalism, in which regular charged black holes are supported solely by nonlinear electrodynamics.",
      "pdf_url": "https://arxiv.org/pdf/2509.24052.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24053",
      "title": "Black bounce solutions via nonminimal scalar-electrodynamic couplings",
      "authors": [
        "Daniela S. J. Cordeiro",
        "Ednaldo L. B. Junior",
        "José Tarciso S. S. Junior",
        "Francisco S. N. Lobo",
        "Jorde A. A. Ramos",
        "Manuel E. Rodrigues",
        "Luís F. Dias da Silva",
        "Henrique A. Vieira"
      ],
      "abstract": "Black bounce solutions via nonminimal scalar-electrodynamic couplings Daniela S. J. Cordeiro, Ednaldo L. B. Junior, José Tarciso S. S. Junior, Francisco S. N. Lobo, Jorde A. A. Ramos, Manuel E. Rodrigues, Luís F. Dias da Silva, Henrique A. Vieira General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) Black-bounce (BB) solutions generalize the spacetimes of black holes, regular black holes, and wormholes, depending on the values of certain characteristic parameters. In this work, we investigate such solutions within the framework of General Relativity (GR), assuming spherical symmetry and static geometry. It is well established in the literature that, in order to sustain such geometries, the source of Einstein's equations in the BB context can be composed of a scalar field $\\varphi$ and a nonlinear electrodynamics (NLED). In our model, in addition to the Lagrangian associated with the scalar field in the action, we also include an interaction term of the form $W(\\varphi)\\mathcal{L}(F)$, which introduces a nonminimal coupling between the scalar field and the electromagnetic sector. Notably, the usual minimal coupling configuration is recovered by setting $W(\\varphi)=1$. In contrast to approaches where the function $W(\\varphi)$ is assumed a priori, here we determine its functional form by modeling the radial dependence of the derivative of the electromagnetic Lagrangian as a power law, namely $\\mathcal{L}_F(r) \\sim F^n$. This approach enables us to determine $W(r)$ directly from the obtained solutions. We apply this procedure to two specific geometries: the Simpson-Visser-type BB solution and the Bardeen-type BB solution, both analyzed in the purely magnetic ($q_m \\neq 0$, $q_e=0$) and purely electric ($q_m=0$, $q_e \\neq 0$) cases. In all scenarios, we find that these BB spacetime solutions can be described with a linear electrodynamics, which is a noteworthy result. Furthermore, we examine the regularity of the spacetime through the Kretschmann scalar and briefly discuss the associated energy conditions for the solutions obtained.",
      "pdf_url": "https://arxiv.org/pdf/2509.24053.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24113",
      "title": "Scalarizations of qOS-extremal black hole and Aretakis instability",
      "authors": [
        "Yun Soo Myung"
      ],
      "abstract": "Scalarizations of qOS-extremal black hole and Aretakis instability Yun Soo Myung General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We study scalarization of quantum Oppenheimer-Snyder (qOS)-extremal black hole in the Einstein-Gauss-Bonnet-scalar theory. This black hole is described by mass ($M=4\\sqrt{\\alpha}/3\\sqrt{3}$) with $\\alpha$ quantum parameter. From studying onset of scalarization, we find the appearance of the single branch of scalarized qOS-extremal black holes. To obtain the tachyonic scalar cloud being a seed to generate the single branch of scalarized qOS-extremal black holes, we consider the near-horizon geometry of the Bertotti-Bobinson (BR) spacetime. In this case, we find that the appearance of a large scalar cloud at the horizon ($\\rho=0$) is a new feature to represent onset scalarization of extremal black holes for tachyon with negative mass, but it is not related to the Aretakis instability of a propagating scalar with standard mass around the BR spacetime, showing polynomial instability of the ingoing time $v$. The Aretakis instability is connected to the scalar cloud with standard mass, indicating the blow-up at the horizon.",
      "pdf_url": "https://arxiv.org/pdf/2509.24113.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24114",
      "title": "Telling apart black holes and naked singularities with trajectories of massive particles",
      "authors": [
        "Angelos Karakonstantakis",
        "Włodek Kluźniak",
        "Maciek Wielgus"
      ],
      "abstract": "Telling apart black holes and naked singularities with trajectories of massive particles Angelos Karakonstantakis, Włodek Kluźniak, Maciek Wielgus 8 pages, 10 figures, submitted to MNRAS General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We performed a numerical study of the dynamics of massive particles orbiting black holes and naked singularities in the Reissner-Nordström geometry. We modeled a stream of particles with a constant angular momentum and with a range of energies. We then solved the geodesic equation of motion and compared the trajectories around black holes and naked singularities by tuning the charge parameter of the metric. The setup that we used can approximate astrophysical scenarios such as tidal disruption events. We discussed differences and similarities in the orbital dynamics and deflection angles. We found that particles reflected by a black hole follow a stream-like family of orbits within a narrow range of deflection angles, whereas in case of naked singularities particles are scattered in all directions on the plain of motion. We explained this behavior as an interplay between the presence of a centrifugal barrier at the location of the unstable circular orbit and an absorbing event horizon in case of a black hole or a reflective zero-gravity sphere in case of a naked singularity. These qualitative differences are expected to impact the observable signatures of tidal disruption events.",
      "pdf_url": "https://arxiv.org/pdf/2509.24114.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24339",
      "title": "de Sitter Corrections to Gravitational Wave Memory",
      "authors": [
        "Anthi Voulgari Revof",
        "Shubhanshu Tiwari"
      ],
      "abstract": "de Sitter Corrections to Gravitational Wave Memory Anthi Voulgari Revof, Shubhanshu Tiwari General Relativity and Quantum Cosmology (gr-qc) In this work, we compute the gravitational wave displacement and spin memory effects in de Sitter spacetime. Gravitational waves in asymptotically flat spacetimes are described by the Bondi-Sachs framework, where radiation at null infinity is tied to the BMS group, and memory appears as permanent changes in the geometry. This formalism becomes more complicated when asymptotic flatness is not guaranteed. With a positive cosmological constant, future infinity is spacelike rather than null, and the decay of the fields differs qualitatively from the flat case. The Bondi-Sachs methods adapted to a positive cosmological constant show that the asymptotic symmetry algebra reduces to time translations and rotations, and that the balance equations for charges and fluxes take a modified form. Our calculation at leading order yields flux-balance relations for displacement and spin memory directly in terms of the cosmological constant Lambda and Bondi-Sachs data. We also find that the cosmological constant mixes spherical-harmonic modes of the memory potentials, producing a (3,0) component in displacement memory and a (2,0) component in spin memory.",
      "pdf_url": "https://arxiv.org/pdf/2509.24339.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.24379",
      "title": "Non-perturbative results for a massive scalar field during de Sitter inflation",
      "authors": [
        "G. Karakaya"
      ],
      "abstract": "Non-perturbative results for a massive scalar field during de Sitter inflation G. Karakaya General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We consider an infrared truncated massive minimally coupled scalar field with an asymmetric self-interaction $\\frac{m^2}{2}\\varphi^2\\!+\\!\\frac{\\lambda\\varphi^4}{4!}\\!+\\!\\frac{\\beta\\varphi^3}{3!}(\\lambda\\!>\\!0)$ during a cosmological constant driven de Sitter inflation with a constant expansion rate, $H$. The Fokker-Planck equation for the evolution of the massive scalar field is obtained and solved for this asymmetric potential. Firstly we compute the vacuum expectation values of $\\varphi$ and $\\varphi^2$ using the normalized late-time probability distribution $\\rho(\\varphi,t)$. Secondly, we evaluate the two-point correlation function and the vacuum expectation value of the massive scalar field at tree and one-loop order following Starobinsky's approach and applying the techniques of perturbative quantum field theory. Lastly, we compare the results obtained via these two different methods. Although these results give consistent qualitative behavior at tree and one-loop order, they differ numerically.",
      "pdf_url": "https://arxiv.org/pdf/2509.24379.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24392",
      "title": "The causal structure of the c-completion of warped spacetimes",
      "authors": [
        "Luis Aké Hau",
        "Saul Burgos",
        "Didier A. Solis"
      ],
      "abstract": "The causal structure of the c-completion of warped spacetimes Luis Aké Hau, Saul Burgos, Didier A. Solis General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph); Differential Geometry (math.DG); Metric Geometry (math.MG) In this work we study the structure of the future causal completion $\\hat{M}$ of a globally hyperbolic GRW spacetime $\\mathbb{R}\\times_\\alpha M$ using the novel notion of Lorentzian pre-length spaces. As our main result, we prove that the causal completion of a GRW spacetime is a globally hyperbolic pre-length space provided the chronological topology is Hausdorff.",
      "pdf_url": "https://arxiv.org/pdf/2509.24392.pdf",
      "categories": [
        "gr-qc",
        "math-ph",
        "math.DG",
        "math.MG"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24461",
      "title": "Accounting for Tidal Deformability in Binary Neutron Star Template Banks",
      "authors": [
        "Lorenzo Piccari",
        "Francesco Pannarale"
      ],
      "abstract": "Accounting for Tidal Deformability in Binary Neutron Star Template Banks Lorenzo Piccari, Francesco Pannarale 10 pages, 4 figures. Will be submitted to Physical Review D General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Modelled searches for gravitational waves emitted by compact binary coalescences currently filter the data with template signals that ignore all effects related to the physics of dense-matter in neutron stars interiors, even when the masses in the template are compatible with a binary neutron star or a neutron star-black hole binary source. The leading neutron star finite-size effect is an additional phase contribution due to tidal deformations induced by the gravitational coupling between the two inspiralling objects in the binary. We show how neglecting this effect in the templates reduces the search sensitivity close to the detection threshold. This is particularly true for binary neutron stars systems, where tidal effects are larger. In this work we therefore propose a new technique for the construction of binary neutron star template banks that accounts for neutron star tidal deformabilities as degrees of freedom of the parameter space to be searched over. A first attempt in this direction was carried out by Harry & Lundgren [Physical Review D 104, 043008 (2021)], who proposed to extract randomly the tidal deformabilities of the stars over a uniform interval, regardless of the binary neutron star component masses. We show that this approach yields 33% additional templates with respect to the equivalent point-like template bank. Our proposed approach, instead, adopts a more physically motivated tidal deformability prior with a support that is informed by the value of the neutron star mass and compatible with the neutron star equation of state constraint provided by the observation of GW170817. This method significantly reduces the needed additional templates to 8.2%.",
      "pdf_url": "https://arxiv.org/pdf/2509.24461.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.24562",
      "title": "Cosmological Scenarios in $f(Q,C)$ gravity with a dynamical degree of freedom",
      "authors": [
        "Hamid Shabani",
        "Avik De"
      ],
      "abstract": "Cosmological Scenarios in $f(Q,C)$ gravity with a dynamical degree of freedom Hamid Shabani, Avik De General Relativity and Quantum Cosmology (gr-qc) The $f(Q,C)$ theory, which extends symmetric teleparallel gravity by including the boundary term $C$ in addition to the non-metricity scalar $Q$, provides a unifying framework that encompasses both $f(Q)$ and $f(\\mathring{R})$ gravities. In this work, we develop a comprehensive dynamical system analysis of $f(Q,C)$ cosmology formulated within the non-coincident affine connection branches. Unlike the coincident case, these branches introduce a dynamical degree of freedom that significantly enriches the cosmological phase space. We show that even for simple power-law forms of the Lagrangian, the theory accommodates a broad spectrum of cosmic scenarios, including successive pressureless matter eras, stiff-matter phases between early inflation and dark matter domination, and late-time acceleration. Our analysis demonstrates that the Universe can naturally evolve from an initial de Sitter phase to a matter-dominated epoch and subsequently to a final de Sitter attractor, consistent with the observed thermal history. These results highlight the role of the dynamical connection in shaping cosmic evolution and underline the potential of $f(Q,C)$ gravity as a viable alternative framework for addressing outstanding issues in modern cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2509.24562.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24578",
      "title": "A Five-dimensional Kaluza-Klein Approach to Unimodular Gravity",
      "authors": [
        "Júlio C. Fabris",
        "Richard Kerner"
      ],
      "abstract": "A Five-dimensional Kaluza-Klein Approach to Unimodular Gravity Júlio C. Fabris, Richard Kerner Latex file, 24 pages, 1 figure. Text for the proceedings of the conference PIRT 2025, 7-10 July 2025, Moscow, Russia. arXiv admin note: substantial text overlap with arXiv:2403.17278 General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) In this article we present a possibility of imposing the unimodular condition within the 5-dimensional Kaluza-Klein theory including the scalar field. Unimodular gravity became an object of increasing interest in the late 80-ties; and was recently used in primordial Universe modeling with cosmological constant, in the context of the Brans-Dicke gravity including scalar field. A generalization of the unimodularity principle to the 5-dimensional Kaluza-Klein model was discussed in our recent paper, in which variational principle is formulated in 5 dimensions first, and dimensional reduction is applied to the resulting set of equations. A cosmological model based on these equations was then presented and discussed. Here we present further developments of this approach, focussing our attention at perturbative aspects and stability of solutions.",
      "pdf_url": "https://arxiv.org/pdf/2509.24578.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24586",
      "title": "Polymer Bianchi-I with polymer matter",
      "authors": [
        "Aleena Zulfiqar",
        "Syed Moeez Hassan"
      ],
      "abstract": "Polymer Bianchi-I with polymer matter Aleena Zulfiqar, Syed Moeez Hassan General Relativity and Quantum Cosmology (gr-qc) We analyze the effective dynamics of a polymer quantized homogeneous and anisotropic Bianchi-I universe coupled to a polymer quantized scalar field. We use a pressureless dust field as an internal clock, and work with the gravitational Misner variables. We find that for a consistent polymer quantization of the anisotropies, the volume variable has to be polymerized first, and that a choice of different polymer scales for the two leads to substantially different dynamics. We derive an effective Friedmann equation for this model, and also compute the shear scalar. We show that polymer quantizing the scalar field leads to significant differences in the evolution of various cosmological quantities as compared to standard quantization. Furthermore, there is asymmetric evolution across the bounce for both the volume variable and the anisotropies. The amount of these variations and asymmetry, as well as the location of the quantum bounce, depends on the matter polymer scale.",
      "pdf_url": "https://arxiv.org/pdf/2509.24586.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24622",
      "title": "Prospect on constraining string-theory-inspired model from gravitational redshift measurements",
      "authors": [
        "Li Hu",
        "Rong-Gen Cai",
        "Song He",
        "Li-Fang Li",
        "Tong Liu",
        "Peng Xu",
        "Shao-Jiang Wang"
      ],
      "abstract": "Prospect on constraining string-theory-inspired model from gravitational redshift measurements Li Hu, Rong-Gen Cai, Song He, Li-Fang Li, Tong Liu, Peng Xu, Shao-Jiang Wang two columns, 10 pages, 7 figures, 1 table General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) Scalar-tensor gravity represents a natural extension of general relativity. Testing such models experimentally provides a crucial pathway to probing physics at high-energy scales, particularly in the context of string theory. This paper investigates a string-theory-inspired scalar-tensor gravity -- the dilaton model -- and identifies regions of its parameter space potentially constrained by gravitational redshift experiments in future. By further modeling the mass distribution in low-density environments with a discrete representation, we go beyond the standard continuous approximation. Despite limitations inherent to specific experimental configurations, our analysis reveals that a significant portion of the parameter space remains accessible. Consequently, high-precision gravitational redshift experiments hold the potential to exclude significant regions of this parameter space in future.",
      "pdf_url": "https://arxiv.org/pdf/2509.24622.pdf",
      "categories": [
        "gr-qc",
        "hep-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24633",
      "title": "Gravitational quasinormal modes of Dymnikova black holes",
      "authors": [
        "Bekir Can Lütfüoğlu",
        "Erdinç Ulaş Saka",
        "Abubakir Shermatov",
        "Inomjon Ibragimov",
        "Javlon Rayimbaev",
        "Sokhibjan Muminov"
      ],
      "abstract": "Gravitational quasinormal modes of Dymnikova black holes Bekir Can Lütfüoğlu, Erdinç Ulaş Saka, Abubakir Shermatov, Inomjon Ibragimov, Javlon Rayimbaev, Sokhibjan Muminov 8 pages, 4 figures, and 4 tables General Relativity and Quantum Cosmology (gr-qc) We investigate gravitational quasinormal modes of the Dymnikova black hole, a regular spacetime in which the central singularity is replaced by a de Sitter core. This geometry, originally proposed as a phenomenological model, also arises naturally in the framework of Asymptotically Safe gravity, where quantum corrections lead to a scale-dependent modification of the Schwarzschild solution. Focusing on axial gravitational perturbations, we compute the dominant quasinormal frequencies using the WKB method with Padé approximants and verify the results with time-domain integration. We find that the introduction of the quantum parameter $l_{\\rm cr}$ leads to systematic deviations from the Schwarzschild spectrum: the real oscillation frequency decreases as $l_{\\rm cr}$ increases, while the damping rate also becomes smaller, implying longer-lived modes. In the limit of large $l_{\\rm cr}$, the quasinormal spectrum smoothly approaches the Schwarzschild case. These results suggest that even though the corrections are localized near the horizon, they leave imprints in the gravitational-wave ringdown which may become accessible to observation with future high-precision detectors.",
      "pdf_url": "https://arxiv.org/pdf/2509.24633.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.24724",
      "title": "The generalized second law for fermionic and bosonic fields",
      "authors": [
        "Koray Düztaş"
      ],
      "abstract": "The generalized second law for fermionic and bosonic fields Koray Düztaş General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We evaluate the validity of the generalied second law for Kerr black holes perturbed by fermionic and bosonic fields. We derive that the critical frequency for a test field below which the area of a Kerr black hole would decrease, coincides with the superradiance limit which pertains to bosonic fields. The fact that the absorption of fermionic fields with arbitrarily low frequencies is allowed, leads to a generic violation of the generalized second law as both the black hole and the environment lose entropy. The result does not contradict the proof of the area theorem which pre-assumes the validity of the null energy condition. We also construct a thought experiment involving bosonic fields to check whether the minimum increase in the area can compensate for the decrease in the entropy of the environment. We minimize the entropy increase by considering a black hole at the extremal limit, perturbed by a bosonic field at the superradiance limit. We show that the generalized second law remains valid for bosonic fields that satisfy the null energy condition. The result does not require the employment of entropy bounds when one assigns von Neumann entropy to test fields.",
      "pdf_url": "https://arxiv.org/pdf/2509.24724.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24774",
      "title": "Understanding the Nature of Scalar-Induced Gravitational Waves",
      "authors": [
        "A.J. Iovino",
        "G. Perna",
        "D. Perrone",
        "D. Racco",
        "A. Riotto"
      ],
      "abstract": "Understanding the Nature of Scalar-Induced Gravitational Waves A.J. Iovino, G. Perna, D. Perrone, D. Racco, A. Riotto General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We offer a physical interpretation of the origin of the scalar-induced gravitational wave background, showing that it is mainly produced around the peaks of the scalar perturbations. We also provide a compact expression to estimate the amount of scalar-induced gravitational waves generated by peaks.",
      "pdf_url": "https://arxiv.org/pdf/2509.24774.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.24777",
      "title": "Comment on \"Strong lensing and shadow of Ayon-Beato-Garcia (ABG) nonsingular black hole\"",
      "authors": [
        "M. Fahmi Fauzi"
      ],
      "abstract": "Comment on \"Strong lensing and shadow of Ayon-Beato-Garcia (ABG) nonsingular black hole\" M. Fahmi Fauzi 3 pages, 2 figures. Comment on arXiv:2303.10921 General Relativity and Quantum Cosmology (gr-qc) It was suggested by Ramadhan et al. (Eur Phys J C 83:465, 2023) that the Sagittarius A* black hole cannot be modeled by an Ayón-Beato-Garcìa regular black hole due to the incompatible shadow radius. However, they overlooked the distant-observer limit of the correction term in the effective geometry, which renders their calculation invalid. When evaluated correctly, the result reverses the conclusion of the paper. This comment highlights the flaw and demonstrates how to properly compute the shadow radius of such a black hole model using elementary geometry.",
      "pdf_url": "https://arxiv.org/pdf/2509.24777.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24833",
      "title": "Black Hole Solution in Anti-de Sitter Space with a New Cloud of Strings Surrounded by Dark Matter Halo",
      "authors": [
        "Faizuddin Ahmed",
        "Edilberto O. Silva"
      ],
      "abstract": "Black Hole Solution in Anti-de Sitter Space with a New Cloud of Strings Surrounded by Dark Matter Halo Faizuddin Ahmed, Edilberto O. Silva General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) This paper presents a comprehensive theoretical study of a Schwarzschild-like Anti-de Sitter (AdS) black hole (BH) influenced by a new cloud of strings (NCS) and a dark matter halo (DMH) characterized by a Dehnen-type density profile. We analyze the geodesic motion of both massless and massive test particles, highlighting how the NCS and DMH parameters affect the effective potentials, photon spheres, circular orbits, BH shadow, and the innermost stable circular orbit (ISCO) of test particles. Additionally, we investigate the thermodynamic behavior of the BH in an extended phase space by deriving key quantities, such as the Hawking temperature, the equation of state (EoS), Gibbs free energy, internal energy, and the specific heat capacity. Our results show that the presence of NCS and DMH induces significant modifications in both the dynamical and thermodynamical behavior of the BH, including shifts in the Hawking-Page transition and divergences in heat capacity, thereby reshaping the phase structure of the BH.",
      "pdf_url": "https://arxiv.org/pdf/2509.24833.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24835",
      "title": "Constraints on quantum Oppenheimer-Snyder black holes with eccentric extreme mass-ratio inspirals",
      "authors": [
        "Sen Yang",
        "Yu-Peng Zhang",
        "Li Zhao",
        "Yu-Xiao Liu"
      ],
      "abstract": "Constraints on quantum Oppenheimer-Snyder black holes with eccentric extreme mass-ratio inspirals Sen Yang, Yu-Peng Zhang, Li Zhao, Yu-Xiao Liu General Relativity and Quantum Cosmology (gr-qc) We investigate the potential of extreme mass-ratio inspirals to constrain quantum Oppenheimer-Snyder black holes within the framework of loop quantum gravity. We consider a stellar-mass object orbiting a supermassive Oppenheimer-Snyder black hole in an equatorial eccentric trajectory. To explore the dynamical behavior of the system, we analyze its orbital evolution under gravitational radiation within the adiabatic approximation and the mass-quadrupole formula for different initial orbital configurations. Our results show that the quantum correction parameter $\\hat{\\alpha}$ slows down the evolution of the orbital semi-latus rectum and eccentricity. We then employ the numerical kludge method to generate the corresponding time-domain gravitational waveforms. To assess detectability, we include Doppler modulation due to the motion of space-based detectors and compute the frequency-domain characteristic strain. By evaluating mismatches between response signals for different values of $\\hat{\\alpha}$, we show that even small corrections $(\\hat{\\alpha} \\sim 10^{-5})$ produce distinguishable effects. Our analysis suggests that future space-based detectors such as LISA can probe quantum gravitational corrections in the strong-field regime and place constraints significantly stronger than those from black hole shadow observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.24835.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.24843",
      "title": "Consistent energy-momentum trace couplings of fluids",
      "authors": [
        "Christian G. Boehmer",
        "Eissa Al-Nasrallah"
      ],
      "abstract": "Consistent energy-momentum trace couplings of fluids Christian G. Boehmer, Eissa Al-Nasrallah General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph) Gravitational models with non-minimal couplings involving the trace of the energy-momentum tensor have become increasingly popular. The idea of coupling the trace of the matter tensor to the geometry can be applied to various matter models, including relativistic perfect fluids. However, it is well-known that the variational formulation of perfect fluids involves some technicalities. We carefully derive the field equations including the trace coupling of a perfect fluid using two different approaches, namely, that given by Brown using Lagrange multipliers, and that given by Schutz using velocity potentials. We show that previous results involving such trace couplings do not match the results presented here. We demonstrate that our fluid's equations of motion are consistent with the gravitational field equations. Moreover, we present a simple on-shell argument which further supports the correctness of our results. Our work implies that a vast amount of the $f(R,T)$ literature using perfect fluids needs to be revisited.",
      "pdf_url": "https://arxiv.org/pdf/2509.24843.pdf",
      "categories": [
        "gr-qc",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.24890",
      "title": "On energy-momentum conservation in non-minimal geometry-matter coupling theories",
      "authors": [
        "Gonzalo J. Olmo",
        "Miguel A. S. Pinto"
      ],
      "abstract": "On energy-momentum conservation in non-minimal geometry-matter coupling theories Gonzalo J. Olmo, Miguel A. S. Pinto General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this work, we discuss the conditions that allow the establishment of an equivalence between $f(R,T)=R+\\lambda h(T)$ gravity models and General Relativity coupled to a modified matter sector. We do so by considering a $D$-dimensional spacetime and the matter sector described by nonlinear electrodynamics and/or a scalar field.",
      "pdf_url": "https://arxiv.org/pdf/2509.24890.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25007",
      "title": "Gravitational entropy of fluids with energy flux",
      "authors": [
        "Roberto A. Sussman",
        "Sebastián Nájera",
        "Fernando A. Pizaña",
        "Juan Carlos Hidalgo"
      ],
      "abstract": "Gravitational entropy of fluids with energy flux Roberto A. Sussman, Sebastián Nájera, Fernando A. Pizaña, Juan Carlos Hidalgo General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We examine gravitational entropy growth within the formalism of Clifton, Ellis and Tavakol (CET) applied to a class of spherically symmetric exact solutions whose source is a shear-free fluid with energy flux in a comoving frame. By considering these solutions as potential cosmological models, we update previous literature that considered them only as restricted toy models of radiating spheres collapsing in a Vaidya background. In the present paper we examine the integrability of the CET entropy form in connection with Einstein's equations in the fluid flow approach, proving as well that all expanding configurations comply with the growth of CET gravitational entropy. Finally, we examine the connection between the CET gravitational entropy and the notion of a gravitational ``arrow of time'' based on the ratio of Weyl to Ricci curvature. Some of the solutions also provide potentially useful and viable inhomogeneous generalizations of FLRW models, thus suggesting an appealing potential for applications to current cosmological research.",
      "pdf_url": "https://arxiv.org/pdf/2509.25007.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25039",
      "title": "Effective Free Energy Landscapes and Hawking-Page Transitions",
      "authors": [
        "Choon-Lin Ho"
      ],
      "abstract": "Effective Free Energy Landscapes and Hawking-Page Transitions Choon-Lin Ho General Relativity and Quantum Cosmology (gr-qc); Statistical Mechanics (cond-mat.stat-mech); Mathematical Physics (math-ph) A recent interesting development on the dynamics of black hole phase transitions, the Hawking-Page transition, has been the so-called Gibbs free energy landscape approach. In this formalism, it is assumed that there exists a canonical ensemble of a series of black hole spacetimes with arbitrary horizon radius at a given ensemble temperature. An off-shell Gibbs free energy is defined for every spacetime state in the ensemble, with the horizon radius treated as the order parameter. The minima (maxima) of this function correspond to the various stable (unstable) black hole states. This off-shell Gibbs free energy is then treated as a classical effective drift potential of an associated Fokker-Planck equation used to study the stochastic dynamics of black hole phase transition under thermal fluctuations. Additive noise, which is independent of the black hole size, is assumed in obtaining the Fokker-Planck equation. In this work we extend the previous treatment by considering the effects of multiplicative noise, namely, noise that could scale with black hole size. This leads to an effective free energy function that can be used to study the modification of the Hawking-Page transition of a black hole system. It is realized that it is generally difficult to form black holes under a multiplicative noise, unless the effective and the original free energy become extremal at the same horizon radius. For this latter situation some theoretical noise profiles which are monotonically increasing/deceasing functions of the horizon radius are considered. It is found that stronger noise disfavors the formation of black hole.",
      "pdf_url": "https://arxiv.org/pdf/2509.25039.pdf",
      "categories": [
        "gr-qc",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25125",
      "title": "Monte Carlo quantum cosmology with a modified Euclidean action",
      "authors": [
        "Malaik Kabir",
        "Syed Moeez Hassan"
      ],
      "abstract": "Monte Carlo quantum cosmology with a modified Euclidean action Malaik Kabir, Syed Moeez Hassan General Relativity and Quantum Cosmology (gr-qc) We numerically study the Euclidean quantum cosmology of a closed, homogeneous and isotropic universe with a cosmological constant. A dust field acts as a clock, and we compute the ground state wavefunction, correlation function, and mean volume of the universe by performing path integral Monte Carlo simulations. To make the path integral convergent, the argument of the exponent in the weight of the path integral is chosen to be either the absolute value of the Euclidean action, or its square. We compare our results to the standard case (with a hard cutoff at zero action), and find that the absolute value produces similar results, whereas the squared method gives substantially different results. We detail two different methods of `fixing' the squared case, and test them for the simple harmonic oscillator, and for this cosmological model. We also find that for a large positive cosmological constant, the universe undergoes multiple cycles of expansion and contraction for all three weights, and reaches much larger sizes with the squared weight.",
      "pdf_url": "https://arxiv.org/pdf/2509.25125.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.25141",
      "title": "Quasinormal spectra of higher dimensional regular black holes in theories with infinite curvature corrections",
      "authors": [
        "Juan Pablo Arbelaez"
      ],
      "abstract": "Quasinormal spectra of higher dimensional regular black holes in theories with infinite curvature corrections Juan Pablo Arbelaez General Relativity and Quantum Cosmology (gr-qc) We investigate the quasinormal modes of several families of higher-dimensional regular black holes arising in gravitational theories that incorporate an infinite tower of higher-curvature corrections to Einstein gravity. Our analysis focuses on how the ringdown phase of gravitational waves for such regular black holes deviates from the predictions of General Relativity. We employ the Wentzel-Kramers-Brillouin (WKB) method to calculate the quasinormal modes and to derive compact analytic expressions in the eikonal approximation. Our results contribute to understanding how possible quantum-gravity-motivated corrections and regularity conditions can manifest in gravitational-wave signals.",
      "pdf_url": "https://arxiv.org/pdf/2509.25141.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2403.01910",
      "title": "Status of Birkhoff's theorem in polymerized semiclassical regime of Loop Quantum Gravity",
      "authors": [
        "Luca Cafaro",
        "Jerzy Lewandowski"
      ],
      "abstract": "Status of Birkhoff's theorem in polymerized semiclassical regime of Loop Quantum Gravity Luca Cafaro, Jerzy Lewandowski 13 pages, 3 figures. Correction to the grant number. An erratum has been submitted to Phys. Rev. D to correct the grant number Phys.Rev.D 110 (2024) 2, 024072 General Relativity and Quantum Cosmology (gr-qc) The collapse of a spherically symmetric ball of dust has been intensively studied in Loop Quantum Gravity (LQG). From a quantum theory, it is possible to recover a semiclassical regime through a polymerization procedure. In this setting, general solutions to the polymerized Einstein field equations (PEFE) will be discussed both for the interior and the exterior of the dust cloud. Exterior solutions are particularly interesting since they may lead to a semiclassical version of the Birkhoff's theorem. It is seen that if time independence of the vacuum is imposed, there exists a unique class of solutions depending on two parameters. Nevertheless, the possibility of more intricate time dependent solutions is not ruled out completely. Ultimately, these results will be compared to a model of spherical collapse obtained independently from the Einstein equations.",
      "pdf_url": "https://arxiv.org/pdf/2403.01910.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.02411",
      "title": "Gravitational Lensing of Euler-Heisenberg Black Hole Surrounded by Perfect Fluid Dark Matter",
      "authors": [
        "Ping Su",
        "Chen-Kai Qiao"
      ],
      "abstract": "Gravitational Lensing of Euler-Heisenberg Black Hole Surrounded by Perfect Fluid Dark Matter Ping Su, Chen-Kai Qiao 25 pages, 8 figures, 1 table, 1 appendix. V2: major revision, some unphysical parameter choices are removed. V3: a new appendix is added, some errors are corrected. V4: results for negative nonlinear electrodynamics parameter a<0 are added General Relativity and Quantum Cosmology (gr-qc) In this work, we study the gravitational lensing of Euler-Heisenberg black hole surrounded by perfect fluid dark matter. This kind of black hole solution enables us to investigate the nontrivial interplay between the dark matter effects and nonlinear electrodynamics effects (or quantum electrodynamics effects) on charged black hole systems. The important observables in gravitational lensings are calculated and discussed in our work, including the gravitational deflection angle of light and time delay of light. Additionally, we also explore the massive orbit's bound orbits (and their precession angles) and black hole shadow radius for Euler-Heisenberg black hole in the presence of dark matter. The results indicate that the Euler-Heisenberg black hole with a larger perfect fluid dark matter parameter could greatly reduce the gravitational deflection angle of light, time delay of light, and precession angle of massive object's bound orbit, while the nonlinear electrodynamics effects do not have large influences on these observables. Keywords: Euler Heisenberg Black Hole; Gravitational Lensing; Perfect Fluid Dark Matter; Nonlinear Electrodynamics",
      "pdf_url": "https://arxiv.org/pdf/2410.02411.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2412.17678",
      "title": "Stellar collapse with pressure in effective loop quantum gravity",
      "authors": [
        "Luca Cafaro",
        "Lorenzo Cipriani",
        "Francesco Fazzini",
        "Farshid Soltani"
      ],
      "abstract": "Stellar collapse with pressure in effective loop quantum gravity Luca Cafaro, Lorenzo Cipriani, Francesco Fazzini, Farshid Soltani 32 pages, 14 figures, v3: Correction to the grant number. An erratum has been submitted to Phys. Rev. D to correct the grant number Phys. Rev. D 111 (2025), 124006 General Relativity and Quantum Cosmology (gr-qc) We explore semiclassical stellar collapse scenarios with pressure within the framework of effective loop quantum gravity. The objective of this work is to generalize existent models of semiclassical dust collapse and examine the role of pressure in the formation of shell-crossing singularities in a semiclassical context. Numerical investigations show that the shell-focusing singularity characterizing the end state of any classical stellar collapse is here resolved by quantum gravitational effects and replaced by a bounce of the star. However, they also show that shell-crossing singularities remain a general feature of these models and that the inclusion of pressure does not alter the qualitative picture emerging from semiclassical models of inhomogeneous dust collapse. Given the absence of a shell-focusing singularity and the possibility of extending spacetime in the future of the trapped region formed by gravitational collapse, the investigation of the causal structure of the spacetime describing the semiclassical collapse of a star is inevitably tied to a better understanding of the physics of these shell-crossing singularities.",
      "pdf_url": "https://arxiv.org/pdf/2412.17678.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.06947",
      "title": "Gravitational signatures beyond Newton: exploring hierarchical three-body dynamics",
      "authors": [
        "Pietro Farina",
        "Mariafelicia De Laurentis",
        "Hideki Asada",
        "Ivan De Martino",
        "Riccardo Della Monica"
      ],
      "abstract": "Gravitational signatures beyond Newton: exploring hierarchical three-body dynamics Pietro Farina, Mariafelicia De Laurentis, Hideki Asada, Ivan De Martino, Riccardo Della Monica 11 pages, 8 figures, Accepted in Physical Review D General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Hierarchical three-body systems offer a compelling framework to explore the subtle interplay between Newtonian and relativistic gravitational effects in astrophysical environments. In this work, we investigate post-Newtonian corrections to the periastron shift within such systems, focusing on the impact of orbital eccentricity. Modeling the secondary body's influence as a quadrupolar perturbation, we compare Newtonian, Schwarzschild, and post-Newtonian quadrupolar contributions to orbital precession. Our analysis demonstrates that Newtonian quadrupolar effects could be observable, for a long monitoring time, in the orbit of the S87 star around Sagittarius A* if an intermediate-mass black hole is present, under the assumptions of our model. Additionally, post-Newtonian quadrupolar corrections may influence the dynamics of small Solar System bodies in the presence of massive companions. Although the predicted effects are minute and require long monitoring periods to be measurable, our analysis clarifies how relativistic corrections enter the dynamics of the third body and outlines the conditions under which future observations could reveal them.",
      "pdf_url": "https://arxiv.org/pdf/2501.06947.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2502.01733",
      "title": "Resonant Locking Between Binary Systems Induced by Gravitational Waves",
      "authors": [
        "Charlie Sharpe",
        "Yonadav Barry Ginat",
        "Zeyuan Xuan",
        "Bence Kocsis"
      ],
      "abstract": "Resonant Locking Between Binary Systems Induced by Gravitational Waves Charlie Sharpe, Yonadav Barry Ginat, Zeyuan Xuan, Bence Kocsis General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) The interaction of gravitational waves (GWs) with matter is thought to be typically negligible in the Universe. We identify an exception in the case of resonant interactions, where GWs emitted by a background binary system, such as an inspiraling supermassive black hole (SMBH) binary, cause a resonant response in a stellar-mass foreground binary and the frequencies of the two systems become, and remain, synchronized. We point out that this previously unexplored dynamical phenomenon is not only possible, but can lead to $\\mathcal{O}(30)$ binary systems becoming resonantly locked in the host galaxy of merging SMBHs of mass $10^{8.5-11}\\Msun$, each of which has a significantly reduced merger time. We predict $\\mathcal{O}(10^{10})$ binary systems have been locked in the Universe's history. Resonant locking could be detected through anomalous inspiral of binary systems.",
      "pdf_url": "https://arxiv.org/pdf/2502.01733.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2502.13397",
      "title": "Thermodynamic analysis and shadow bound of black holes surrounded by a dark matter halo",
      "authors": [
        "Yun Soo Myung"
      ],
      "abstract": "Thermodynamic analysis and shadow bound of black holes surrounded by a dark matter halo Yun Soo Myung 19 pages, 6 figures, accepted for publication in EPJC General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We perform the thermodynamic analysis of a black hole (BH) immersed in a dark matter halo (DMH). It is shown that the BH could not be in thermal equilibrium with the DMH in any regions outside the event horizon. This means that the thermodynamic influence of the environment (DMH) is relatively small on the BH. Importantly, it does not alter the nature of the negative heat capacity for the BH. We stress that the Newtonian ($1/a_0$) approximation gives us a correct thermodynamic description for the BH surrounded by DMH because the first law of thermodynamics and Smarr formula are satisfied. Hence, the Newtonian Helmholtz free energy is employed to reveal that there is the absence of phase transition to other BH with a positive heat capacity. Finally, we investigate the shadow bound of favored region for the BH immersed in the DMH by comparing EHT observations.",
      "pdf_url": "https://arxiv.org/pdf/2502.13397.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.14606",
      "title": "Tidal dissipation in binary neutron star inspirals from hyperon bulk viscosity: Phase modeling and parameter estimation bias",
      "authors": [
        "Suprovo Ghosh",
        "Samanwaya Mukherjee",
        "Sukanta Bose",
        "Debarati Chatterjee"
      ],
      "abstract": "Tidal dissipation in binary neutron star inspirals from hyperon bulk viscosity: Phase modeling and parameter estimation bias Suprovo Ghosh, Samanwaya Mukherjee, Sukanta Bose, Debarati Chatterjee 10 pages, 8 figures, matches accepted version in MNRAS General Relativity and Quantum Cosmology (gr-qc) During the inspiral of a binary neutron star, viscous processes in the neutron star matter can damp out the tidal energy induced by its companion and convert it to thermal energy. This tidal dissipation/heating process introduces a net phase shift in the gravitational wave signal. In our recent work, we showed based on a Newtonian estimate that tidal dissipation from bulk viscosity originating from the non-leptonic weak interactions involving hyperons could have a detectable phase shift in the gravitational-wave (GW) signal in the next-generation GW detectors. Using simulated signals, we demonstrate that not accounting for this physical effect in waveform models can result in systematic biases in tidal deformability measurements of high-mass neutron star ($\\geq 1.8M_{\\odot}$) binary observations in next-generation GW detectors. By employing Newtonian orbital dynamics, we model this tidal dissipation induced dephasing as a phenomenological function of the characteristic velocity. We incorporate its effect in gravitational waveforms of equal-mass binary neutron stars. Those waveforms are used to perform a full Bayesian parameter estimation, which confirms that our model can alleviate possible biases in tidal deformability estimation. We also illustrate that the model can accurately measure the additional phase due to tidal dissipation in a $2M_{\\odot}$ neutron star in observations with next-generation GW detectors and discuss its significance in extreme matter studies.",
      "pdf_url": "https://arxiv.org/pdf/2503.14606.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2503.21243",
      "title": "Exploring the Rastall Gravity Cosmological Model using Gong-Zhang parameterization with Latest Observational Data and Deep Learning Techniques",
      "authors": [
        "Vinod Kumar Bhardwaj",
        "Manish Kalra",
        "Anil Kumar Yadav"
      ],
      "abstract": "Exploring the Rastall Gravity Cosmological Model using Gong-Zhang parameterization with Latest Observational Data and Deep Learning Techniques Vinod Kumar Bhardwaj, Manish Kalra, Anil Kumar Yadav General Relativity and Quantum Cosmology (gr-qc) In this study, we have explored the cosmological dynamics of an isotropic, homogeneous universe in Rastall gravity. For this purpose, we use the parameterization of the EoS parameter in the form $\\omega(z) = \\frac{\\omega_{0}}{(z+1)} $ to derive the explicit solution of the field equations in Rastall gravity. We constrained the cosmological parameters for the derived model by the Markov Chain Monte Carlo (MCMC) approach utilizing OHD, BAO, and Pantheon plus compilation of SN Ia datasets. We also constrained the model parameters using deep learning techniques and the CoLFI Python package. This paper introduces an innovative deep-learning approach for parameter inference. The deep learning method significantly surpasses the MCMC technique regarding optimal fit values, parameter uncertainties, and relationships among parameters. This conclusion is drawn from a comparative analysis of the two methodologies. Additionally, we determined the transition redshift $z_t = 0.941$, which signifies the shift in the Universe's model from an early deceleration phase to the present acceleration phase. The diagnosis of the model with diagnostic tools like statefinders, jerk parameter, and $O_m$ diagnostics are presented and analyzed. The validation of the model's energy conditions is also examined.",
      "pdf_url": "https://arxiv.org/pdf/2503.21243.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.00465",
      "title": "Leveraging cross-detector parameter consistency measures to enhance sensitivities of gravitational wave searches",
      "authors": [
        "Sayantan Ghosh",
        "Leigh Smith",
        "Jiyoon Sun",
        "Archana Pai",
        "Ik Siong Heng",
        "V. Gayathri"
      ],
      "abstract": "Leveraging cross-detector parameter consistency measures to enhance sensitivities of gravitational wave searches Sayantan Ghosh, Leigh Smith, Jiyoon Sun, Archana Pai, Ik Siong Heng, V. Gayathri General Relativity and Quantum Cosmology (gr-qc) All-sky searches for generic short-duration astrophysical GW transients are often challenging because of noise transients. Developing novel signal-noise discriminators is crucial for GW transient searches with LIGO Scientific, Virgo, and KAGRA (LVK) detectors. In this work, we adapt a recently developed Jensen Shannon divergence (JSD)-based measure, which assesses the cross-detector parameter consistency to distinguish between weakly modeled or unmodelled astrophysical GW signals and loud noise triggers. We first extend a 2-detector JSD-based measure, developed in an earlier work, to a 3-detector network. We leverage this to modify the test statistic of the existing Coherent Waveburst (cWB)-Gaussian Mixture Modelling (GMM) algorithm for short-duration transients towards improving the search sensitivity to ad-hoc waveforms like Sine-Gaussians, Gaussian Pulses, and White Noise Bursts. We find that with the new method, which we term cWB-GMM-JSD, the sensitivity to the ad-hoc waveforms, given by $h_{\\mathrm{rss50}}$, improves by $\\sim 10-20 \\%$ at an IFAR of 10 years for the 2-detector network consisting of LHO and LLO detectors, and by $\\sim 5-10 \\%$ at the same IFAR for the 3-detector network consisting of LHO, LLO and Virgo detectors. Finally, we apply the modified statistic in the revised data analysis pipeline on the publicly available data from the third observing run (O3) of the LIGO and Virgo detectors. Although we do not find any new event in the O3 data, we see a notable rise in the statistical significance of most of the known GW events, which further testifies to the enhancement in sensitivities.",
      "pdf_url": "https://arxiv.org/pdf/2504.00465.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2504.00915",
      "title": "Towards Model Agnostic $F(R)$ Gravity Inflation",
      "authors": [
        "V.K. Oikonomou"
      ],
      "abstract": "Towards Model Agnostic $F(R)$ Gravity Inflation V.K. Oikonomou General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) In this work we construct a formalism that can reveal the general characteristics of classes of viable $F(R)$ inflationary theories. The assumptions we make is that the slow-roll era occurs, and that the de Sitter scalaron mass $m^2(R)$ of the $F(R)$ gravity is positive or zero, for both the inflationary and late-time quasi de Sitter eras, a necessary condition for the stability of the de Sitter spacetime. In addition, we require that the de Sitter scalaron mass is also a monotonically increasing function of the Ricci scalar, or it has an extremum. Also the $F(R)$ gravity function is required to depend on the two known fundamental scales in cosmology, the cosmological constant $\\Lambda$ and the mass scale $m_s^2=\\frac{\\kappa^2 \\rho_m^{(0)}}{3}$, with $\\rho_m^{(0)}$ denoting the energy density of the cold dark matter at the present epoch, that is $F(R)=F(R,\\Lambda,m_s^2)$. Using these general assumptions we provide the general features of viable classes of $F(R)$ gravity inflationary theories which remarkably can also simultaneously describe successfully the dark energy era. This unique feature of a unified description of the dark energy and inflationary eras stems from the requirement of the monotonicity of the de Sitter scalaron mass $m^2(R)$. These viable classes are either deformations of the $R^2$ model or $\\alpha$-attractors type theories. The analysis of the viability of a general $F(R)$ gravity inflationary theory is reduced in evaluating the parameter $x=\\frac{R F_{RRR}}{F_{RR}}$ and the first slow-roll index of the theory, either numerically or approximately. We also disentangle the power-law $F(R)$ gravities from power-law evolution.",
      "pdf_url": "https://arxiv.org/pdf/2504.00915.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.07215",
      "title": "Universal Horizons without Hypersurface Orthogonality",
      "authors": [
        "Francesco Del Porro",
        "Stefano Liberati",
        "Jacopo Mazza"
      ],
      "abstract": "Universal Horizons without Hypersurface Orthogonality Francesco Del Porro, Stefano Liberati, Jacopo Mazza 28+ pages, no figures. (v2) Two clarifying comments added below eq.s (2.1) and (2.3) after review, no substantial changes; matches published version Phys. Rev. D 112 (2025) 4, 044018 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) A key consequence of Lorentz-violating gravity is the emergence of modified dispersion relations implying the absence of a universal maximum propagation speed. This challenges the conventional notion of the event horizon as a causal boundary common to all degrees of freedom. However, certain solutions in these theories exhibit \\emph{universal horizons} -- surfaces capable of trapping signals of arbitrarily high speed, thereby restoring the notion of black hole. Previous studies have extensively characterised universal horizons in settings where Lorentz violation is encoded via a hypersurface-orthogonal æther. In this work, we explore the possibility of extending this concept to more general cases where hypersurface orthogonality is relaxed. To do so, we construct a candidate trapping surface and analyse its causal properties using a general model for Lorentz-violating matter. We find that, in addition to the standard conditions associated to universal horizons, a local vanishing of the æther's twist is also necessary. We then provide an explicit example of such a universal horizon by suitably deforming the æther flow in a stealth Kerr solution recently found in Einstein--æther theory. Moreover, we analyse the behaviour of trajectories which are not analytical at the universal horizon and discuss the implications of our findings for Hawking radiation. While our analysis is motivated by Einstein-æ{t}her gravity, our results apply to broader classes of Lorentz-violating theories, further supporting the relevance of black hole phenomenology in these frameworks.",
      "pdf_url": "https://arxiv.org/pdf/2504.07215.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.17587",
      "title": "Enhancing gravitational-wave detection: a machine learning pipeline combination approach with robust uncertainty quantification",
      "authors": [
        "Gregory Ashton",
        "Ann-Kristin Malz",
        "Nicolo Colombo"
      ],
      "abstract": "Enhancing gravitational-wave detection: a machine learning pipeline combination approach with robust uncertainty quantification Gregory Ashton, Ann-Kristin Malz, Nicolo Colombo 9 pages, 5 figures, 2 tables, under review in Phys Rev (version updated following initial comments) General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Gravitational-wave data from advanced-era interferometric detectors consists of background Gaussian noise, frequent transient artefacts, and rare astrophysical signals. Multiple search algorithms exist to detect the signals from compact binary coalescences, but their varying performance complicates interpretation. We present a machine learning-driven approach that combines results from individual pipelines and utilises conformal prediction to provide robust, calibrated uncertainty quantification. Using simulations, we demonstrate improved detection efficiency and apply our model to GWTC-3, enhancing confidence in multi-pipeline detections, such as the sub-threshold binary neutron star candidate GW200311_103121.",
      "pdf_url": "https://arxiv.org/pdf/2504.17587.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.15399",
      "title": "A Falsifiable Alternative to General Relativity",
      "authors": [
        "Daniel Coumbe",
        "Aria Rahmaty"
      ],
      "abstract": "A Falsifiable Alternative to General Relativity Daniel Coumbe, Aria Rahmaty 22 pages, 11 figures. Minor comments and corrections added. Conclusions remain unchanged. Conforms with the version published in Phys. Rev. D General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Asymptotically Weyl-invariant gravity (AWIG) is further developed within the Palatini formalism as a power-counting renormalizable alternative to general relativity (GR). An expression for the dimensionless exponent n(R) is derived based on dynamical dimensional reduction. We show that this version of AWIG naturally resolves several theoretical issues normally associated with the Palatini formalism. A falsifiable prediction regarding the frequency of gravitational waves from binary black hole mergers is made. A preliminary analysis of gravitational wave GW150914 yields a maximum tension of 0.9{\\sigma} with GR and marginally favours AWIG. A similar analysis of gravitational wave GW151226 yields a maximum tension of 2.7{\\sigma} with GR and favours AWIG more significantly.",
      "pdf_url": "https://arxiv.org/pdf/2505.15399.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.05467",
      "title": "Hyperboloidal neutron star and black hole initial data in spherical symmetry",
      "authors": [
        "Alex Vañó-Viñuales"
      ],
      "abstract": "Hyperboloidal neutron star and black hole initial data in spherical symmetry Alex Vañó-Viñuales Class.Quant.Grav. 42 (2025) 19, 195001 General Relativity and Quantum Cosmology (gr-qc) The focus of this work is on the construction of initial data including a neutron star on a hyperboloidal slice. As simplest scenario for this first step, spherical symmetry is considered together with a polytropic-like equation of state for the neutron star. Constraint-satisfying hyperboloidal initial data are obtained for a single neutron star and for a combination of neutron star with a black hole in its center. To the author's best knowledge this is the first time that full hyperboloidal slices of a neutron star spacetime are constructed. The obtained initial data are suitable for evolutions of the Einstein and relativistic hydrodynamic equations on hyperboloidal slices.",
      "pdf_url": "https://arxiv.org/pdf/2506.05467.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.09310",
      "title": "Wormhole Solutions and Pre-inflationary Epoch in $F(R, T)$ Gravity with Axion Fields",
      "authors": [
        "Guo-He Li",
        "Yeqi Fang",
        "Yuchi Wu",
        "Jun Tao"
      ],
      "abstract": "Wormhole Solutions and Pre-inflationary Epoch in $F(R, T)$ Gravity with Axion Fields Guo-He Li, Yeqi Fang, Yuchi Wu, Jun Tao General Relativity and Quantum Cosmology (gr-qc) In this study, we investigate wormhole solutions within the framework of $F(R,T)$ gravity coupled to an axion-dilaton system and explore the inflation. Based on the Giddings-Strominger (GS) and expanding wormhole solutions in asymptotically flat Euclidean spacetime, the matter-geometry coupling term induces complex dynamical oscillations and reduces the Euclidean action, which enhances the nucleation probability of wormholes. Furthermore, we apply this theoretical setup to a \"wineglass\" half-wormhole model in Euclidean Anti-de Sitter (EAdS) spacetime and derive a constraint on the coupling parameter. This constraint introduces an unstable maximum in scalar potential, altering the probability distribution of initial states and the evolution of universes from high-potential regions. This method increases the probability of long-lasting inflation, offering a potential pathway to reconciling the no-boundary proposal with astronomical observations.",
      "pdf_url": "https://arxiv.org/pdf/2506.09310.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.08345",
      "title": "Defining eccentricity for spin-precessing binaries",
      "authors": [
        "Md Arif Shaikh",
        "Vijay Varma",
        "Antoni Ramos-Buades",
        "Harald P. Pfeiffer",
        "Michael Boyle",
        "Lawrence E. Kidder",
        "Mark A. Scheel"
      ],
      "abstract": "Defining eccentricity for spin-precessing binaries Md Arif Shaikh, Vijay Varma, Antoni Ramos-Buades, Harald P. Pfeiffer, Michael Boyle, Lawrence E. Kidder, Mark A. Scheel Md Arif Shaikh et al 2025 Class. Quantum Grav. 42 195012 General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Standardizing the definition of eccentricity is necessary for unambiguous inference of the orbital eccentricity of compact binaries from gravitational wave observations. In previous works, we proposed a definition of eccentricity for systems without spin-precession that relies solely on the gravitational waveform, is applicable to any waveform model, and has the correct Newtonian limit. In this work, we extend this definition to spin-precessing systems. This simple yet effective extension relies on first transforming the waveform from the inertial frame to the coprecessing frame, and then adopting an amplitude and a phase with reduced spin-induced effects. Our method includes a robust procedure for filtering out spin-induced modulations, which become non-negligible in the small eccentricity and large spin-precession regime. Finally, we apply our method to a set of Numerical Relativity and Effective One Body waveforms to showcase its robustness for generic eccentric spin-precessing binaries. We make our method public via Python implementation in \\texttt{gw\\_eccentricity}.",
      "pdf_url": "https://arxiv.org/pdf/2507.08345.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.11174",
      "title": "Thermal scalar field stress tensor on a two dimensional black hole and its near horizon properties",
      "authors": [
        "Saurav Samanta",
        "Bibhas Ranjan Majhi"
      ],
      "abstract": "Thermal scalar field stress tensor on a two dimensional black hole and its near horizon properties Saurav Samanta, Bibhas Ranjan Majhi Corrections made, to appear in JHEP General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We calculate the thermal renormalized energy-momentum tensor components of a massless scalar field, leading to trace anomaly, on a $(1+1)$ dimensional static black hole spacetime. Using these, the energy density and flux, seen by both static and freely-falling observers, are evaluated. Interestingly for both these observers the aforementioned quantities in the thermal version of Unruh and Boulware states are finite at the horizon when the scalar field is in thermal equilibrium with the horizon temperature (given by the Hawking expression). Whereas in Hartle-Hawking thermal state both the observers see finite energy-density and flux at the horizon, irrespective of the value of field temperature. Particularly in the case of Schwarzschild spacetime a freely falling observer, starts with initial zero velocity, finds its initial critical position $r^c_i = (3/2)r_H$, where $r_H$ is the horizon radius for which energy-density vanishes.",
      "pdf_url": "https://arxiv.org/pdf/2507.11174.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.12698",
      "title": "Quantum spacetime from constraints: wave equations and fields",
      "authors": [
        "Tommaso Favalli"
      ],
      "abstract": "Quantum spacetime from constraints: wave equations and fields Tommaso Favalli General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) In previous works, we showed that both time and space can emerge from entanglement within a globally constrained quantum Universe, with no background coordinates. By extending the Page and Wootters quantum time formalism to include both quantum clocks and rods, and imposing global constraints on total energy and momentum, we constructed a fully relational model of quantum spacetime. Here we take a further step: working in 1+1 dimensions, we show that the standard wave equations governing quantum particles (the Schrödinger, Klein-Gordon and Dirac equations) emerge naturally from this framework. The solutions of the equations are derived directly from the constraints, without assuming any external spacetime structure. The second quantization formalism is also implemented and discussed. Our results provide further support for the idea that quantum dynamics in spacetime may emerge from entanglement and constraints.",
      "pdf_url": "https://arxiv.org/pdf/2508.12698.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.00630",
      "title": "Lensing in matched exterior and interior Kottler solutions",
      "authors": [
        "Mourad Guenouche"
      ],
      "abstract": "Lensing in matched exterior and interior Kottler solutions Mourad Guenouche General Relativity and Quantum Cosmology (gr-qc) We analyze gravitational lensing in a matched Kottler spacetime with cosmological constant $\\Lambda$, where a uniform-density fluid sphere described by the interior Kottler solution is smoothly joined to the exterior Kottler region. We derive an analytic expression for the deflection angle of light rays traversing both regions, isolating the corrections induced by the interior mass distribution relative to the vacuum Kottler case. The interior terms systematically reduce the bending angle and tangential magnification while enhancing the radial one, leading to a scale-dependent effect on the total magnification. Numerical evaluation shows a mild amplification for galaxy lenses and a demagnification for clusters, reflecting the contrast between compact and diffuse configurations. The induced $\\Lambda$-contribution from the interior corrections further reduces the bending, but only slightly, consistent with its role in the vacuum Kottler case. These results demonstrate that lensing observables retain a measurable imprint of interior structure in SdS-like lenses, crucial for refining realistic strong-lensing models.",
      "pdf_url": "https://arxiv.org/pdf/2509.00630.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.10701",
      "title": "Probing For Non-Gravitational Long-Range Dark Matter Interactions",
      "authors": [
        "M.P. Ross",
        "E.A. Shaw",
        "C. Gettings",
        "S.K. Apple",
        "I.A. Paulson",
        "J.H. Gundlach"
      ],
      "abstract": "Probing For Non-Gravitational Long-Range Dark Matter Interactions M.P. Ross, E.A. Shaw, C. Gettings, S.K. Apple, I.A. Paulson, J.H. Gundlach General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph) Dark matter remains a mystery in fundamental physics. The only evidence for dark matter's existence is from gravitational interactions. We constructed a precision torsion balance experiment to search for non-gravitational, long-range interactions between ordinary matter in our lab and the Milky Way's dark matter. We find no evidence of such interaction and set strict upper bounds on its strength. These results suggest that dark matter only interacts gravitationally over long distances and constrains a variety of dark matter theories.",
      "pdf_url": "https://arxiv.org/pdf/2509.10701.pdf",
      "categories": [
        "gr-qc",
        "hep-ex",
        "hep-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19381",
      "title": "Quantum interference in the Einstein-Maxwell-Scalar spacetime",
      "authors": [
        "Yingdong Wu",
        "Weiqiang Chen"
      ],
      "abstract": "Quantum interference in the Einstein-Maxwell-Scalar spacetime Yingdong Wu, Weiqiang Chen General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate gravitationally induced interference within the framework of teleparallel gravity, deriving a general expression for the gravitational phase difference and applying it to an EMS spacetime. We then analyze how this phase difference is affected by the presence or absence of black hole charge. Our results show that, irrespective of charge, the dominant contribution to the gravitational phase difference arises from the black hole mass. Nevertheless, while the influence of charge is negligible under standard astrophysical conditions, we identify a possible amplification mechanism through its interplay with the coupling parameter $\\alpha$ in the case of extremal charged black holes. This finding not only offers new theoretical insights but also suggests experimental opportunities for probing charged black hole parameters via quantum interferometric techniques.",
      "pdf_url": "https://arxiv.org/pdf/2509.19381.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.19822",
      "title": "Axion boson stars with wormhole topology",
      "authors": [
        "Chen-Hao Hao",
        "Yong-Qiang Wang",
        "Jieci Wang"
      ],
      "abstract": "Axion boson stars with wormhole topology Chen-Hao Hao, Yong-Qiang Wang, Jieci Wang General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate a novel gravitational configuration formed by a massless real phantom field and an axion scalar field, minimally coupled to gravity. This system describes an Ellis-type wormhole situated at the center of an axion star. By normalizing the mass of the axion field to unity, the physical properties of the model are determined by three independent parameters: the potential's decay constant, the frequency of the axion field, and the wormhole's throat parameter. We assess the traversability of this wormhole by examining the curvature scalars and energy conditions of the static solution. Our analysis of the wormhole's embedding diagrams indicates that, although the wormhole typically exhibits a single-throat geometry, a double-throat configuration featuring an equatorial plane may arise under specific conditions. Finally, an analysis of the null-geodesics reveals the existence of at least one unstable light ring at the wormhole throat.",
      "pdf_url": "https://arxiv.org/pdf/2509.19822.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20344",
      "title": "Polarimetry imprints of exotic compact objects: relativistic fluid spheres and gravastars",
      "authors": [
        "Hanna Liis Tamm",
        "Nicolas Aimar",
        "João Luís Rosa"
      ],
      "abstract": "Polarimetry imprints of exotic compact objects: relativistic fluid spheres and gravastars Hanna Liis Tamm, Nicolas Aimar, João Luís Rosa General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Recent observations of polarimetric parameters of active galactic nuclei motivate the study of polarization in the spacetime of exotic compact objects which can mimic the features of black holes in the strong field regime of gravity. In this work, we study the properties of two models for ultra-compact objects containing light rings - relativistic fluid spheres and gravastars. We have simulated the orbit of a hot spot around the considered objects in the polarization ray-tracing software GYOTO, and extracted observables, namely integrated images of the Stokes parameters I, Q, U; their evolution during the orbit in the QU-plane, and the electric vector position angle (EVPA). Our models resemble the black hole qualitatively, with slight additional imprints which provide a useful tool to constrain the spacetime metric of supermassive compact objects with current and future observations, and probe the fundamental properties of these objects. We have found that one fluid star model with a pressure singularity resembles the black hole entirely, while another gravastar features notable differences in the EVPA curve in the low-inclination case. Since differences between the models become more pronounced for a higher inclination, our results could potentially restrict the adequateness of ECO classes with future high-inclination observations.",
      "pdf_url": "https://arxiv.org/pdf/2509.20344.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": false
    }
  ]
}