{
  "date": "2026-02-25",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 56,
  "gw_related_papers": 10,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2602.18491",
      "title": "Canonical Vielbeins for General Relativity: D + 1 Decomposition and Constraint Analysis",
      "authors": [
        "Joakim Flinckman",
        "Daniel Blixt"
      ],
      "abstract": "Canonical Vielbeins for General Relativity: D + 1 Decomposition and Constraint Analysis Joakim Flinckman, Daniel Blixt General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We provide a self-contained derivation of the Hamiltonian formulation of General Relativity in vielbein variables in $d=D+1$ dimensions. Starting from the Einstein--Hilbert action in a standard metric $D+1$ decomposition, we derive Lorentz- and $\\mathrm{SO}(D)$-covariant phase-space actions, identify the primary Lorentz constraints, and obtain the Hamiltonian and momentum constraints. We compute the resulting first-class constraint algebra, relate the vielbein and metric phase-space formulations, and discuss the rotation/boost decomposition. In particular, we construct the boost generator in the $\\mathrm{SO}(D)$-covariant formulation, thereby recovering full local Lorentz symmetry.",
      "pdf_url": "https://arxiv.org/pdf/2602.18491.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18499",
      "title": "Null hypersurfaces in general relativity: Intrinsic symmetries and differential invariants",
      "authors": [
        "G. Dautcourt"
      ],
      "abstract": "Null hypersurfaces in general relativity: Intrinsic symmetries and differential invariants G. Dautcourt General Relativity and Quantum Cosmology (gr-qc) This paper investigates intrinsic Killing symmetries of null hypersurfaces $\\mathcal{N}_3$ within the framework of general relativity. To this end we consider $\\mathcal{N}_3$ as detached from the embedding spacetime and equipped with a degenerate metric of signature (0,+,+). As geometrical tools we use a triad calculus and differential invariants. Extending prior work, we present a classification of null hypersurfaces according to groups of motion up to the fourth order. For each type certain normal forms of the metric are given, and their invariants are listed. A discussion of horizons - defined as null hypersurfaces with vanishing shear and divergence - is included.",
      "pdf_url": "https://arxiv.org/pdf/2602.18499.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18503",
      "title": "Population-coherence routes to purity in Page-type models of black-hole evaporation",
      "authors": [
        "José J. Gil"
      ],
      "abstract": "Population-coherence routes to purity in Page-type models of black-hole evaporation José J. Gil General Relativity and Quantum Cosmology (gr-qc) We revisit the black-hole information problem from the viewpoint of a population-coherence decomposition of density-matrix purity. Building on a previously developed formalism for ndimensional density matrices, we characterize each state by a normalized global purity index and two complementary indices, which quantify the contributions of level populations and coherences. This yields a simple quadratic relation and a geometric representation in a population-coherence plane, where different routes to purity can be distinguished. In the two-level case we construct explicit families of states with identical spectra and global purity but opposite internal structure, realizing population-dominated and coherence-dominated routes. We then apply this framework to a standard Page-type evaporation model without an explicit Hamiltonian, in which a black hole and its Hawking radiation form a bipartite pure state with varying Hilbert-space dimensions. Using known results for typical reduced states in large dimensions, we analyze the behavior of population and coherence components of purity along the evaporation process. Under the physically motivated requirement that, in this energy-free setting, the radiation populations remain nearly uniform in the chosen basis, we show that the late-time recovery of purity must be coherence-dominated: the global purity of the radiation approaches unity while the population index stays small and the coherence index carries essentially all the purity.",
      "pdf_url": "https://arxiv.org/pdf/2602.18503.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18615",
      "title": "Two Parameter Deformation of Embedding Class-I Compact Stars in Linear $f(Q)$ Gravity",
      "authors": [
        "Samstuti Chanda",
        "Ranjan Sharma"
      ],
      "abstract": "Two Parameter Deformation of Embedding Class-I Compact Stars in Linear $f(Q)$ Gravity Samstuti Chanda, Ranjan Sharma General Relativity and Quantum Cosmology (gr-qc) Recent multi-messenger observations, including gravitational wave detections of compact objects in the neutron star-black hole mass-gap region and precise measurements of high-mass pulsars, motivate mechanisms capable of enlarging the stellar mass window without arbitrarily stiffening the equation of state (EOS) toward the causal limit. In linear $f(Q)$ gravity of the form $f(Q)=\\beta_1 Q+\\beta_2$, the theory is dynamically equivalent to General Relativity at the geometric level and modifies stellar structure solely through a uniform rescaling of the matter sector governed by $\\beta_1$. Consequently, linear $f(Q)$ alone does not introduce new geometric families of stellar solutions or alter classical compactness bounds. To overcome this structural limitation, we incorporate gravitational decoupling within an embedding class-I (Karmarkar) Vaidya-Tikekar configuration in linear $f(Q)$ gravity. While similar VT-based decoupling constructions exist in GR, the present framework introduces a controlled two-parameter deformation characterized by $(\\epsilon,\\beta_1)$: the decoupling parameter $\\epsilon$ governs geometric deformation and EOS stiffness, whereas $\\beta_1$ independently rescales the matter sector without altering the metric structure. This separation permits a direct comparison between GR and linear $f(Q)$ gravity at fixed geometric deformation, thereby isolating pure coupling-driven mass enhancement. We determine the admissible parameter domain from regularity, matching, causality and compactness requirements and derive an analytic compactness bound for the decoupled embedding class-I configuration. The combined action of $\\epsilon$ and $\\beta_1$ enlarges the accessible stellar mass window while preserving physical acceptability, allowing configurations compatible with recent high-mass pulsars and mass-gap candidates without exceeding causal limits.",
      "pdf_url": "https://arxiv.org/pdf/2602.18615.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.18665",
      "title": "Ultraviolet Fixed Point in Covariant Loop Quantum Gravity",
      "authors": [
        "Muxin Han"
      ],
      "abstract": "Ultraviolet Fixed Point in Covariant Loop Quantum Gravity Muxin Han 6 pages non-technical overview of of main results, 26 pages detailed discussions, 17 pages appendix General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph) We investigate the ultraviolet behavior of 4-dimensional Lorentzian covariant Loop Quantum Gravity (LQG) and address the problem of infinite ambiguities relating to the triangulation dependence of spinfoam amplitudes. We consider the complete LQG amplitude that summing spinfoam amplitudes over 2-complexes. By introducing spin-network stacks and their covariant extension, spinfoam stacks, the summation over complexes is partitioned into distinct families. We demonstrate that the theory exhibits a condensation phenomenon, where quantum geometry condenses to a dominant small spin configuration. We identify a candidate fixed point controlling the ultraviolet (small spin) regime of covariant LQG. At this fix point, the complete LQG amplitude dynamically reduces to a topological theory at leading order, and the infinite ambiguities of triangulation dependence reduces to a finite set of boundary coefficients associated with a finite basis of 3-dimensional boundary blocks. These results provide a definition for the continuum limit of spinfoam theory at the fundamental level.",
      "pdf_url": "https://arxiv.org/pdf/2602.18665.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18732",
      "title": "New Black hole Solutions in $f(\\mathbb{Q})$ Gravity",
      "authors": [
        "A. Dehyadegari",
        "A. Sheykhi"
      ],
      "abstract": "New Black hole Solutions in $f(\\mathbb{Q})$ Gravity A. Dehyadegari, A. Sheykhi General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate static and spherically symmetric vacuum solutions in the symmetric teleparallel $f(\\mathbb{Q})$ modified theory of gravity. Starting from a recently proposed classification of affine connections compatible with both the symmetries of spacetime and the constraints of symmetric teleparallel geometry, we develop a systematic approach to solve the full field equations. We first identify two distinct classes of connections that satisfy the off-diagonal metric field equations and the connection constraints. For an arbitrary $f(\\mathbb{Q})$ function when the non-metricity scalar $\\mathbb{Q}$ vanishes, we recover exact analytical solutions equivalent to those of general relativity, including the Schwarzschild and Schwarzschild (anti)de-Sitter metrics. We then extend our analysis beyond general relativity by considering the quadratic model $f(\\mathbb{Q})=\\mathbb{Q}+\\alpha~\\mathbb{Q}^2$ with a small parameter $\\alpha$. Using a perturbative approach, we derive asymptotically flat, analytical solutions up to second order in $\\alpha$. These solutions exhibit corrections to the standard Schwarzschild metric, characterized by new integration constants that can be interpreted as connection hair. We explore the asymptotic behavior of these solutions and disclose that the horizon radius receives corrections that can be expressed compactly using the Lambert $\\mathcal{W}$ function. Our results provide new, non-trivial vacuum solutions within $f(\\mathbb{Q})$ gravity and highlight the rich structure introduced by the non-metricity connection.",
      "pdf_url": "https://arxiv.org/pdf/2602.18732.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18790",
      "title": "Generalized Carter & Rüdiger Constants of $\\sqrt{\\text{Kerr}}$",
      "authors": [
        "Christopher de Firmian",
        "Justin Vines"
      ],
      "abstract": "Generalized Carter & Rüdiger Constants of $\\sqrt{\\text{Kerr}}$ Christopher de Firmian, Justin Vines General Relativity and Quantum Cosmology (gr-qc) We consider the motion of a charged spinning test/probe particle -- governed by the Mathisson-Papapetrou-Dixon equations with generic, adiabatic, and conservative spin- and field-induced multipole moments -- in a background $\\sqrt{\\text{Kerr}}$ field on flat spacetime: the electromagnetic field of a charged spinning ring-disk singularity obtained from the $G\\to 0$ limit of the Kerr-Newman solution for a charged spinning black hole. We investigate the existence of two extra hidden constants of motion, analogous to the Carter constant (for geodesic motion in a Kerr spacetime, or for its spinning-probe generalization) and Rüdiger's linear-in-spin constant for a spinning probe in a Kerr background. We find that these two constants exist only when the Wilson coefficients parameterizing the probe's multipole structure take the particular values corresponding to spin-exponentiation of the effective Compton amplitudes through second order in spin.",
      "pdf_url": "https://arxiv.org/pdf/2602.18790.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18877",
      "title": "Hernquist distribution of matter as a source of black-hole geometry",
      "authors": [
        "Erdinç Ulaş Saka"
      ],
      "abstract": "Hernquist distribution of matter as a source of black-hole geometry Erdinç Ulaş Saka General Relativity and Quantum Cosmology (gr-qc) It was recently demonstrated that imposing the condition $P_{r} = -\\rho$ on the radial pressure of a galactic halo can lead to regular black-hole solutions for certain density profiles, such as the Dehnen and Einasto models. In the present work, we show that some of the most commonly used halo profiles, including the Hernquist model, do not yield regular geometries under the same condition, but instead support black-hole solutions that retain a central singularity",
      "pdf_url": "https://arxiv.org/pdf/2602.18877.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18945",
      "title": "Thermal aspects and particle dynamics of Euler-Heisenberg AdS black hole in 4D Einstein Gauss-Bonnet gravity",
      "authors": [
        "Bilel Hamil",
        "Faisal Javed"
      ],
      "abstract": "Thermal aspects and particle dynamics of Euler-Heisenberg AdS black hole in 4D Einstein Gauss-Bonnet gravity Bilel Hamil, Faisal Javed General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We construct charged AdS black hole solutions in four dimensional Einstein Gauss Bonnet gravity coupled to Euler Heisenberg nonlinear electrodynamics and investigate their physical properties. The modified field equations admit black hole solutions whose horizon structure is significantly affected by higher-curvature and nonlinear electromagnetic corrections, allowing for multiple horizons depending on the model parameters. In the extended phase space, where the cosmological constant is interpreted as thermodynamic pressure, we analyze the thermodynamic behavior and show that both the Gauss Bonnet coupling and the Euler Heisenberg parameter induce notable modifications in the equation of state, critical behavior, and thermal stability. Interpreting the black hole mass as enthalpy, we study the Joule-Thomson expansion and determine the inversion temperature and pressure, demonstrating that higher curvature and nonlinear electrodynamic effects substantially influence the cooling and heating regions. Finally, we examine time-like geodesics and show that Gauss Bonnet corrections significantly modify the effective potential, orbital stability, and particle motion in the strong-field regime",
      "pdf_url": "https://arxiv.org/pdf/2602.18945.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18972",
      "title": "Inertial Frame Dragging as a Probe to Differentiate Kerr-Newman Naked Singularities from Black Holes",
      "authors": [
        "Arindam Kumar Chatterjee",
        "Parthapratim Pradhan"
      ],
      "abstract": "Inertial Frame Dragging as a Probe to Differentiate Kerr-Newman Naked Singularities from Black Holes Arindam Kumar Chatterjee, Parthapratim Pradhan General Relativity and Quantum Cosmology (gr-qc) We investigate inertial frame dragging and relativistic precession in the Kerr--Newman spacetime and show how gyroscopic observables can operationally discriminate between Kerr--Newman black holes and Kerr--Newman naked singularities. We study a test gyroscope attached to a stationary observer and derive closed-form expressions for the Lense--Thirring, geodetic, and general spin-precession frequencies. A sharp qualitative distinction emerges: for Kerr--Newman black holes, the spin-precession frequency generically diverges as the horizon is approached (remaining finite only for the ZAMO family), whereas for Kerr--Newman naked singularities, the precession remains finite throughout the spacetime, with divergences confined to the ring singularity on the equatorial plane. Working with physically admissible stationary observers (including ZAMOs), we first construct the timelike geodesic motion and the fundamental orbital frequencies for equatorial circular orbits. Using these, we analyse the radial and vertical epicyclic frequencies, the ISCO shift induced by the charge parameter $Q$, and the associated periastron and nodal precession frequencies relevant to quasi-periodic oscillations (QPOs). We demonstrate that nonzero $Q$ produces systematic, and in rapidly rotating regimes nontrivial, modifications to the frequency hierarchy: $\\nu_{\\rm nod}$ can develop a finite maximum at $r=r_p=\\mathcal{O}(M)$, its peak amplitude decreases with increasing $Q$, and sign reversals may occur for sufficiently large charge and high spin, signalling a reversal of nodal-precession orientation. These results establish spin-precession behaviour as a robust strong-field probe of horizons versus exposed singularities, with potential implications for testing cosmic censorship using future high-precision precession/QPO measurements.",
      "pdf_url": "https://arxiv.org/pdf/2602.18972.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18994",
      "title": "Testing the Spacetime Geometry of Sgr A* with the Relativistic Orbit of S2 star",
      "authors": [
        "Parth Bambhaniya",
        "Preet Dalal",
        "Giovani H. Vicentin",
        "Riccardo Della Monica",
        "Elisabete M. de Gouveia Dal Pino",
        "Bina Patel"
      ],
      "abstract": "Testing the Spacetime Geometry of Sgr A* with the Relativistic Orbit of S2 star Parth Bambhaniya, Preet Dalal, Giovani H. Vicentin, Riccardo Della Monica, Elisabete M. de Gouveia Dal Pino, Bina Patel General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA) In this work, we perform a relativistic test of the spacetime geometry of Sagittarius A* (Sgr A*) using the orbit of the S2 star. We consider a broad class of compact object models, including Schwarzschild, Reissner-Nordström, Bardeen, Hayward, and Simpson-Visser black holes, as well as the Janis-Newman-Winicour naked singularity spacetime. For each geometry, we integrate the timelike geodesic equations and consistently project the resulting trajectories onto astrometric and spectroscopic observables, incorporating Rømer time delay and relativistic redshift effects. The theoretical predictions are tested with current Very Large Telescope (VLT) observations of the S2 star, while simultaneously imposing constraints from the Event Horizon Telescope shadow size. We find that several spacetimes that are degenerate at the level of shadow imaging, most notably Schwarzschild, Reissner-Nordström, and Bardeen regular black hole geometries, remain statistically indistinguishable when tested against present S2 data. We further carry out a statistical model comparison based on the Akaike and Bayesian information criteria (AIC and BIC) to evaluate the relative performance of the alternative spacetime models. Our analysis also constrains the generalized charge like parameter $q/M$ in non-Schwarzschild spacetimes based on current S2 star observations, and identifies specific black hole and horizonless geometries that can be further tested with forthcoming high precision astrometric observations from the VLT and Keck telescopes.",
      "pdf_url": "https://arxiv.org/pdf/2602.18994.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.GA"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19015",
      "title": "Unitary and finite self-energy of a single classical point charge and naked point singularity spacetimes",
      "authors": [
        "Daxx W. Delucchi"
      ],
      "abstract": "Unitary and finite self-energy of a single classical point charge and naked point singularity spacetimes Daxx W. Delucchi 72 pages, 0 figures. Comments welcome. Submitted to Classical and Quantum Gravity General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph) We analyze linear Einstein--Maxwell perturbations of the superextremal Reissner--Nordström geometry in its static Kerr--Schild rest frame, viewing it as the nonlinear self-field of a single static point charge. In optical radial coordinates, and using the Kodama--Ishibashi gauge-invariant formalism, each radiative multipole is encoded by a single scalar master field on the half-line. The resulting master equation is of Regge--Wheeler type, with an inverse-square potential core at the optical apex (controlled by a Hardy inequality) and a short-range tail at infinity. The spatial-plus-potential part of the Einstein--Maxwell $T$-energy is closable and bounded below, which defines a positive quadratic form on the natural energy space. Its Friedrichs extension then gives the canonical self-adjoint realization of the master operator. The static Coulomb field and its nonlinear gravitational backreaction are treated as the exact background. All linear Einstein--Maxwell perturbations with finite spatial $T$-energy evolve unitarily on the energy space. The naked singularity at finite optical distance is ``silent'' in the technical sense that it carries no $T$-energy flux. We also construct the forward radiation field at future null infinity, obtaining a translation representation of the self-field dynamics in which the conserved $T$-energy coincides with the $L^2$ norm of the radiation profile in retarded time.",
      "pdf_url": "https://arxiv.org/pdf/2602.19015.pdf",
      "categories": [
        "gr-qc",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19104",
      "title": "The Role of Inhomogeneities in the Turbulent Accretion of Black Holes",
      "authors": [
        "Giuseppe Ficarra",
        "Michele Arcuri",
        "Rita Megale",
        "Sergio Servidio"
      ],
      "abstract": "The Role of Inhomogeneities in the Turbulent Accretion of Black Holes Giuseppe Ficarra, Michele Arcuri, Rita Megale, Sergio Servidio General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Plasma Physics (physics.plasm-ph) Observations of supermassive black holes by the Event Horizon Telescope reveal significant inhomogeneities, most likely related to density and magnetic field perturbations. To model these features, we conduct high-resolution 2D general-relativistic magnetohydrodynamics (GRMHD) simulations of a Fishbone-Moncrief torus around a Kerr black hole using the Black Hole Accretion Code $\\texttt{BHAC}$. We compare unperturbed accretion with a case featuring plasma density bubbles with pressure balanced magnetic islands of different amplitudes. Power spectrum analysis of accretion time series, performed via the Blackman-Tukey method, shows that the perturbed case exhibits (1) steeper spectral indices compared to the unperturbed case, deviating from the characteristic $1/\\omega$ noise spectrum, and (2) increased correlation times, providing evidence for absorption of macro-structures at the event horizon. Spatial auto-correlation analysis of near-horizon turbulence confirms larger energy-containing coherent structures in the perturbed case altering the accretion rate. These results provide new insights for interpreting observations of supermassive black hole environments, where near-horizon turbulence may play a key role in the accretion process.",
      "pdf_url": "https://arxiv.org/pdf/2602.19104.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19145",
      "title": "A New Perspective on the Cosmological Constant and Its Core Problems",
      "authors": [
        "H. R. Fazlollahi"
      ],
      "abstract": "A New Perspective on the Cosmological Constant and Its Core Problems H. R. Fazlollahi General Relativity and Quantum Cosmology (gr-qc) One of the most enduring and unresolved challenges in modern theoretical and observational cosmology is the fine-tuning and coincidence problems associated with the cosmological constant. Rather than attempting to reconcile these issues within the standard LCDM framework where they remain effectively frozen, we adopt a fundamentally different viewpoint based on alternative theories of gravity. We argue that the root of these problems lies in a deep misinterpretation of the cosmological constant, particularly its identification with the quantum ground-state energy of spacetime. In this work, we propose a novel physical interpretation of the cosmological constant and introduce a new mechanism, termed Breaking Energy-Momentum Symmetry. This framework provides a natural and unified route toward alleviating, and potentially resolving, both the fine-tuning and coincidence problems, offering a compelling alternative to the conventional cosmological paradigm.",
      "pdf_url": "https://arxiv.org/pdf/2602.19145.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19150",
      "title": "Gauss-Bonnet Gravity and Spacetime Singularities",
      "authors": [
        "Tariq Allaithy",
        "Adel Awad",
        "Mohamed Hany Radwan",
        "Mohsen Zahran"
      ],
      "abstract": "Gauss-Bonnet Gravity and Spacetime Singularities Tariq Allaithy, Adel Awad, Mohamed Hany Radwan, Mohsen Zahran General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate the effect of higher-order curvature terms, specifically Gauss-Bonnet terms, on spacetime singularities in five dimensions. For FLRW cosmologies, we demonstrate that Gauss-Bonnet terms can replace the Big Bang/Crunch with a \"sudden\" singularity, characterized by a finite scale factor and Hubble rate but diverging higher-order derivatives. Investigating various branches of solutions shows the possibility of explicit extension of non-spacelike geodesics beyond the singular point. Furthermore, we employ the Gauss-Bonnet junction conditions to verify the consistency of the extension with the field equations. The whole solution describes a contracting phase prior to the expansion phase with a well-defined surface stress-energy tensor. Regarding the Boulware-Deser black hole, we find that Gauss-Bonnet terms soften the central singularity for radial geodesics--rendering them \"weak\" according to the Tipler and Krolak criteria--whereas non-radial geodesics remain strongly singular. Junction condition analysis of this solution shows that although higher-curvature corrections alter the nature of the singularity, geodesics are still inextendible as a result of divergent extrinsic curvature. Our results are consistent with the Penrose-Hawking singularity theorems since in Gauss-Bonnet black holes, geodesics suffer from focusing (expansion parameter diverges), while in cosmology, there is no focusing since the expansion parameter remains finite at the singularity.",
      "pdf_url": "https://arxiv.org/pdf/2602.19150.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19186",
      "title": "Propagation effects of Lorentz violation in gravitational waves",
      "authors": [
        "A. A. Araújo Filho",
        "N. Heidari",
        "Iarley P. Lobo"
      ],
      "abstract": "Propagation effects of Lorentz violation in gravitational waves A. A. Araújo Filho, N. Heidari, Iarley P. Lobo General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate the propagation of gravitational waves in the presence of Lorentz- and diffeomorphism-violating operators within the linearized gravitational sector of the Standard Model Extension. Focusing on isotropic contributions, we analyze the combined effects of the nondispersive CPT-even dimension-four coefficient $\\mathring{k}^{(4)}_{(I)}$ and the CPT-odd dimension-five coefficient $\\mathring{k}^{(5)}_{(V)}$ on tensorial gravitational radiation. The modified dispersion relation induces both a rescaling of the propagation speed and helicity-dependent dispersive corrections, leading to birefringence and polarization mixing without introducing additional propagating degrees of freedom. We derive the retarded Green function associated with the modified wave operator and obtain explicit expressions for the gravitational waveform generated by matter sources. As a concrete application, we examine a binary black hole system and show how Lorentz violation alters the observed strain through shifted retarded times, amplitude rescaling, and higher derivative corrections to the quadrupole formula. The CPT-odd term produces characteristic attenuation and distortions in the waveform, which can be interpreted as energy exchange between the gravitational wave and the Lorentz-violating background rather than a violation of energy conservation. Using published LIGO-Virgo-KAGRA propagation tests and polarization consistency arguments, we translate current observational constraints into bounds on $\\mathring{k}^{(4)}_{(I)}$ and $\\mathring{k}^{(5)}_{(V)}$.",
      "pdf_url": "https://arxiv.org/pdf/2602.19186.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.19194",
      "title": "The early history of symmetric teleparallel gravity: An overlooked period",
      "authors": [
        "Muzaffer Adak"
      ],
      "abstract": "The early history of symmetric teleparallel gravity: An overlooked period Muzaffer Adak General Relativity and Quantum Cosmology (gr-qc); History and Philosophy of Physics (physics.hist-ph) It is noteworthy that symmetric teleparallel gravity has attracted considerable attention in recent years. A survey of the literature indicates that this surge of interest became particularly prominent around 2017 and 2018. However, together with my students and collaborators, we published a series of systematic and pioneering papers on this subject between 2004 and 2013. In this letter, we will summarize our overlooked contributions to symmetric teleparallel gravity produced during that period. For the sake of completeness and coherence, we will also briefly review our work on this topic carried out after 2018. In the final paragraph, we will write our personal perspectives on the future of symmetric teleparallel geometry.",
      "pdf_url": "https://arxiv.org/pdf/2602.19194.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19245",
      "title": "The linearised conformal Einstein field equations around a Petrov-type~D spacetime: the conformal Teukolsky equation",
      "authors": [
        "Edgar Gasperin",
        "Rodrigo Panosso Macedo",
        "Justin Feng"
      ],
      "abstract": "The linearised conformal Einstein field equations around a Petrov-type~D spacetime: the conformal Teukolsky equation Edgar Gasperin, Rodrigo Panosso Macedo, Justin Feng General Relativity and Quantum Cosmology (gr-qc) While the Teukolsky equation plays a central role in traditional treatments of perturbations of algebraically special spacetimes, its relation to Friedrich's conformal Einstein field equations (CEFEs) remains largely unexplored. Here we develop a conformal formulation of black-hole perturbation theory based on the CEFEs and derive the conformal Teukolsky equation. Starting from a transparent review of Friedrich's regularisation strategy, this work establishes a direct connection between mainstream curvature-based linear perturbation theory and conformal formulations of general relativity. This perspective is timely given the growing relevance of hyperboloidal frameworks in black-hole perturbation theory, where conformal compactification is introduced at the level of an already linearised effective wave equation. Here instead, the conformal factor is a dynamical variable within the field equations. In the non-linear equations there is a coupling between conformal and curvature perturbations; however, when linearised around a Petrov-type D background, the conformal factor decouples from the equations governing the Newman-Penrose components $\\phi_0$ and $\\phi_4$ of the rescaled Weyl tensor. The resulting equation preserves the structural form of the classical Teukolsky equation while remaining regular at the conformal boundary. This provides a geometric interpretation of the hyperboloidal master variable and an entry point into the CEFE framework. We further derive the conformal Teukolsky equation for a conformal representation of Kerr spacetime where spatial infinity is realised as a blown-up cylinder. By bridging conformal and traditional approaches to black-hole perturbation theory, the framework highlights a geometrically regular representation of perturbative dynamics that may inform extensions beyond the linear regime.",
      "pdf_url": "https://arxiv.org/pdf/2602.19245.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19361",
      "title": "The extremely-tilted fluid regime near asymptotically Kasner big bang singularities",
      "authors": [
        "Florian Beyer"
      ],
      "abstract": "The extremely-tilted fluid regime near asymptotically Kasner big bang singularities Florian Beyer General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph); Analysis of PDEs (math.AP) In this paper, we solve the relativistic Euler equations with a linear barotropic equation of state on a large class of background spacetimes with Kasner big bang asymptotics. Building on previous work in the asymptotically non-tilted regime, which applies when the speed of sound of the fluid is large in comparison to the Kasner exponents, we now consider the asymptotically extremely-tilted regime when the speed of sound is small. We solve the Cauchy problem for the Euler equations towards the big bang singularity and prove, without any symmetry assumptions or smallness conditions on the Cauchy data, that the solutions exist globally in time provided the mean curvature of the initial hypersurface is sufficiently large. Finally, we prove that the solutions exhibit the asymptotics expected from standard heuristic arguments in this regime; in particular, fluid particles are driven towards the speed of light in the direction of the largest Kasner exponent as the big bang singularity is approached.",
      "pdf_url": "https://arxiv.org/pdf/2602.19361.pdf",
      "categories": [
        "gr-qc",
        "math-ph",
        "math.AP"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19436",
      "title": "Improving calibration accuracy with torque coupled gravity field calibrator for sub-Hz gravitational wave observation in CHRONOS",
      "authors": [
        "Yuki Inoue",
        "Daiki Tanabe",
        "Vivek Kumar"
      ],
      "abstract": "Improving calibration accuracy with torque coupled gravity field calibrator for sub-Hz gravitational wave observation in CHRONOS Yuki Inoue, Daiki Tanabe, Vivek Kumar General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) A fundamental challenge in low-frequency gravitational-wave detectors is the limited signal-to-noise ratio (SNR) of calibration lines, particularly in torsion-bar systems where the response is governed by rotational dynamics. In this work, we resolve this issue by optimizing the geometrical configuration of a torque-coupled gravity field calibrator (GCal), achieving an improvement in calibration-line SNR by more than an order of magnitude compared to conventional layouts. For the Cryogenic sub-Hz cROss torsion-bar detector with quantum NOn-demolition Speed-meter (CHRONOS), the calibration signal appears as a monochromatic line within the $0.1$--$10~\\mathrm{Hz}$ band. At $1~\\mathrm{Hz}$, the strain-equivalent calibration amplitude reaches $|h_{\\rm GCal}| = 1.18 \\times 10^{-14}$, corresponding to an SNR density of $|h_{\\rm GCal}|/S_h = 4.25 \\times 10^{3}$. This demonstrates for the first time that a high-SNR calibration line can be directly injected into the sub-Hz band of a torsion-bar detector. A first-order perturbative error propagation analysis yields a total fractional systematic uncertainty of $\\delta h_{\\rm GCal}/h_{\\rm GCal} = 0.24\\%$, dominated by geometric alignment uncertainties, while contributions from mass uncertainties and the gravitational constant remain subdominant. The corresponding absolute systematic uncertainty is $\\delta h_{\\rm GCal} \\sim 10^{-17}$ at $1~\\mathrm{Hz}$. These results establish torque-coupled gravitational calibration as a practical solution to the longstanding low-SNR problem in sub-Hz torsion-bar detectors and provide a robust pathway toward precision absolute calibration in the low-frequency regime.",
      "pdf_url": "https://arxiv.org/pdf/2602.19436.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.19495",
      "title": "The Kerr two-twistor particle",
      "authors": [
        "Joon-Hwi Kim"
      ],
      "abstract": "General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Differential Geometry (math.DG) An all-orders worldline effective action for Kerr black hole is achieved in twistor particle theory.",
      "pdf_url": "https://arxiv.org/pdf/2602.19495.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "math.DG"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19541",
      "title": "Chaotic imprints of dark matter in extreme mass-ratio inspirals",
      "authors": [
        "Mustapha Azreg-Aïnou",
        "Mubasher Jamil",
        "Emmanuel N. Saridakis"
      ],
      "abstract": "Chaotic imprints of dark matter in extreme mass-ratio inspirals Mustapha Azreg-Aïnou, Mubasher Jamil, Emmanuel N. Saridakis General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Extreme mass-ratio inspirals (EMRIs) are among the most powerful probes of strong-field gravity and of the environments surrounding supermassive compact objects. Motivated by the expected presence of dark matter near galactic centers, we investigate the emergence and gravitational-wave imprints of chaotic dynamics in EMRIs evolving in non-vacuum spacetimes. Within a unified dynamical framework, we analyze test-particle motion in a broad class of dark-matter-embedded geometries, including singular black holes, regular black holes, naked singularities, and Einstein-cluster configurations. We show that environmental perturbations generically break integrability in the strong-field regime, giving rise to chaotic motion whose onset, duration, and termination depend sensitively on horizon structure, core regularization, and matter distribution. Using the numerical Kludge approach, we demonstrate that chaotic trajectories produce systematic qualitative modifications of the emitted gravitational radiation, such as irregular amplitude modulation and loss of phase coherence, in contrast to the smooth, quasi-periodic waveforms generated by regular motion. Our results establish the robustness of chaos in environmentally perturbed EMRIs and provide a clear conceptual link between nonlinear orbital dynamics, spacetime structure, and observable gravitational-wave signatures.",
      "pdf_url": "https://arxiv.org/pdf/2602.19541.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.19576",
      "title": "Boltzmann Dynamics in K-essence Cosmology: Photon Propagation in an Emergent Spacetime",
      "authors": [
        "Krishnendu Roy",
        "Debashis Gangopadhyay",
        "Chiranjeeb Singha",
        "Goutam Manna"
      ],
      "abstract": "Boltzmann Dynamics in K-essence Cosmology: Photon Propagation in an Emergent Spacetime Krishnendu Roy, Debashis Gangopadhyay, Chiranjeeb Singha, Goutam Manna 32 pages, no figures, no tables, and comments are warmly welcome, as they help to improve the quality of the work, not only references General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Recent cosmological tensions, notably the Hubble and $S_{8}$ tensions, necessitate extensions of the conventional $\\Lambda$CDM framework, wherein additional dynamical fields alter the effective spacetime encountered by matter and radiation. In K-essence cosmology, the scalar field induces an emergent FLRW geometry that is disformally linked to the gravitational metric, resulting in a \\emph{tilted causal structure} where the light cone propagation differs from that of gravity. This study develops a covariant Boltzmann formalism inside a homogeneous K-essence framework and derives the modified mass-shell condition, geodesic equations, and collision integrals for both massless and massive particles. We demonstrate that the photon distribution retains its thermal properties in the emergent frame, while it seems geometrically rescaled in the gravitational frame. The Thomson and Compton processes maintain their microscopic structure while obtaining effective masses and interaction rates governed by the scalar field. During the tightly coupled epoch, the photon-baryon fluid experiences acoustic oscillations characterized by a modified sound horizon. For the kinetic K-essence DBI-type Lagrangian, the interaction rate scales as $n_{e}\\sigma_{T}^{\\rm eff}a\\propto a^{-8}$, indicating a strong coupling in the early universe. Additionally, the diffusion damping scale scales as $k_{D}^{-2}\\propto a^{29/2}$, indicating that small-scale anisotropies become increasingly sensitive to the evolving geometry. The results provide a coherent kinetic description of particle transport in a tilted spacetime and demonstrate that CMB propagation effects may serve as an observational probe of K-essence and emergent gravity frameworks.",
      "pdf_url": "https://arxiv.org/pdf/2602.19576.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19704",
      "title": "Unimodular quantum cosmology in the connection representation: A minimal model",
      "authors": [
        "Shinji Yamashita"
      ],
      "abstract": "Unimodular quantum cosmology in the connection representation: A minimal model Shinji Yamashita General Relativity and Quantum Cosmology (gr-qc) We present a quantization of unimodular gravity in the connection representation for a homogeneous, isotropic, and spatially flat cosmological model without matter. In this model, the wave function is governed by a Schrödinger-type equation derived from a reduced phase space approach. Our analysis suggests that, within this minimal setting, the regularity of the operators and the self-adjointness of the Hamiltonian operator are incompatible with a negative cosmological constant. For a positive cosmological constant, the wave functions vanish at zero spatial volume. This behavior emerges as a consequence of enforcing the unimodular condition at the quantum level. Semiclassical fluctuations of the geometry are evaluated and discussed in relation to the cosmological constant problem.",
      "pdf_url": "https://arxiv.org/pdf/2602.19704.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19737",
      "title": "Analytic Solutions for Geodesic Motion in Static Axially Symmetric Spacetime",
      "authors": [
        "R. Chan",
        "M.F.A. da Silva",
        "N.O. Santos"
      ],
      "abstract": "Analytic Solutions for Geodesic Motion in Static Axially Symmetric Spacetime R. Chan, M.F.A. da Silva, N.O. Santos General Relativity and Quantum Cosmology (gr-qc) A procedure to find static axially symmetric solutions to the Einstein field equations is presented. We obtained two general solutions and five particular solutions, which depend on the existence conditions for circular and $z$ direction motion. Our endeavour consists making a thoroughrowly analysis of all the possible geodesics solutions stemming from this spacetime.",
      "pdf_url": "https://arxiv.org/pdf/2602.19737.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19833",
      "title": "Spectral Analysis of Quasinormal Modes of Planck Stars",
      "authors": [
        "Davide Batic",
        "Denys Dutykh",
        "Fabio Scardigli"
      ],
      "abstract": "Spectral Analysis of Quasinormal Modes of Planck Stars Davide Batic, Denys Dutykh, Fabio Scardigli General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate the quasinormal modes (QNMs) of Planck stars within the framework of scale-dependent gravity (SDG). In our setup, the running parameter $\\alpha$ is fixed to a negative value by matching the effective Newtonian potential to the one-loop EFT result. As a consequence, the associated running Newton coupling does not realise the ultraviolet fixed point of asymptotically safe gravity, and the geometry should be interpreted as an SDG-inspired effective metric rather than a realisation of asymptotically safe gravity itself. We focus on the resulting renormalisation-group-improved Schwarzschild metric, which naturally yields a finite-size Planck-density core. Building on this background, we compute the QNM spectrum for scalar, electromagnetic, and gravitational perturbations using the Spectral Method (SM). This approach, known for its superior accuracy over high-order WKB schemes, enables the detection of fundamental modes, large families of overtones, and purely imaginary overdamped modes that are entirely missed in previous analysis. Our results reveal a robust Martini glass morphology of the oscillatory spectrum across perturbation sectors, nearly equally spaced overdamped modes with characteristic anomalous gaps, and the emergence, in the gravitational sector, of isolated overdamped modes separated from the main sequence by exceptionally large frequency intervals. These features, resolved here for the first time in the Planck-star context, underscore the importance of high-precision spectral techniques in probing subtle signatures of quantum-gravity-inspired black hole models.",
      "pdf_url": "https://arxiv.org/pdf/2602.19833.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.19975",
      "title": "Axially symmetric wormholes",
      "authors": [
        "I. A. Sarmiento-Alvarado",
        "Leonel Bixano",
        "Tonatiuh Matos"
      ],
      "abstract": "I. A. Sarmiento-Alvarado, Leonel Bixano, Tonatiuh Matos General Relativity and Quantum Cosmology (gr-qc) In this work, we derive an exact vacuum solution to the Einstein field equations that depends on three constant parameters: the throat radius $r_0$, a parameter $q$, which is closely associated with the Komar mass, and a parameter $s$, which introduces axial topological defect while avoiding the emergence of conical singularities. We employ the cut-and-paste construction to generate wormhole geometries from this solution for $q \\neq 0$. In addition, we perform a detailed analysis of the embedding diagrams, the wormhole throat, the occurrence and structure of trapped surfaces, the behavior of geodesics, the associated tidal forces, the Petrov algebraic classification, the Newman-Penrose spin coefficients, and the corresponding invariant conserved charges.",
      "pdf_url": "https://arxiv.org/pdf/2602.19975.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.20004",
      "title": "New modified cosmology from a new generalized entropy",
      "authors": [
        "G. G. Luciano",
        "E. N. Saridakis"
      ],
      "abstract": "New modified cosmology from a new generalized entropy G. G. Luciano, E. N. Saridakis General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We develop new modified cosmological scenarios by applying the first law of thermodynamics at the Universe horizon, utilizing a new entropic functional that generalizes the standard Boltzmann-Gibbs-Shannon entropy. In particular, starting from the general theory of entropy in terms of the probability distribution over the accessible microstates, and by imposing violation of the separability requirement and thus considering a generalized microstate scaling, we result to a generalized entropy expression, which applied in systems with boundaries yields a generalized holographic-like area-law scaling with two exponents. Hence, incorporating it within the gravity-thermodynamics framework, we result to a modified cosmological scenario with additional terms, which eventually give rise to an effective dark energy sector. We extract analytical expressions for the dark energy density and equation-of-state parameters, and we show that the Universe experiences the usual thermal history, with the sequence of matter and dark-energy eras. Additionally, depending on the values of the entropic exponents, the dark energy can be quintessence-like, phantom-like or experience the phantom-divide crossing during its evolution, ultimately stabilizing at the cosmological constant value in the asymptotic far future, a behavior richer than other entropic modified cosmologies.",
      "pdf_url": "https://arxiv.org/pdf/2602.20004.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.20072",
      "title": "Dynamics of the Bianchi~V cosmological model inspired by quintessential $α$-attractors",
      "authors": [
        "Genly Leon",
        "Amare Abebe",
        "Andronikos Paliathanasis"
      ],
      "abstract": "Dynamics of the Bianchi~V cosmological model inspired by quintessential $α$-attractors Genly Leon, Amare Abebe, Andronikos Paliathanasis 32 pages, 8 compound figures, 3 tables General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph) We investigate scalar-field cosmologies in the Bianchi V spacetime using a dynamical-systems framework. Motivated by representative $\\alpha$-attractor potentials - the E-model and T-model - we apply averaging theorems and amplitude--phase reductions to monomial potentials $\\sim \\phi^{2n}$ of the scalar field, which approximate the attractor models near their minima, in the presence of matter with barotropic index $\\gamma$. The reduced averaged system admits five generic isolated equilibria: Kasner vacua $\\mathcal{K}_0^\\pm$, the matter FLRW point $\\mathcal{F}$, the scalar FLRW point $\\mathcal{S}$, and the curvature Milne-type point $\\mathcal{K}$, together with special families for tuned $(n,\\gamma)$. We find that $\\mathcal{K}_0^\\pm$ are always sources, $\\mathcal{F}$ is generically a saddle but can act as a sink for $\\gamma<\\min\\{\\tfrac{2n}{n+1},\\tfrac{2}{3}\\}$, $\\mathcal{S}$ is a sink if $0<n<\\tfrac{1}{2}$ and $\\tfrac{2n}{n+1}<\\gamma\\leq 2$, while $\\mathcal{K}$ becomes a sink whenever $\\gamma>\\tfrac{2}{3}$ and $n>\\tfrac{1}{2}$. These results demonstrate that isotropic FLRW $\\alpha$-attractor models extend naturally to anisotropic Bianchi~V cosmologies: inflationary attractors remain robust, while the Milne-type curvature solution emerges as the late-time state.",
      "pdf_url": "https://arxiv.org/pdf/2602.20072.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.20075",
      "title": "Addressing leakage and mode suppression in angular power spectrum estimation for gravitational-wave backgrounds using pulsar timing arrays",
      "authors": [
        "Deepali Agarwal",
        "Joseph D. Romano",
        "Yacine Ali-Haïmoud",
        "Tristan L. Smith"
      ],
      "abstract": "Addressing leakage and mode suppression in angular power spectrum estimation for gravitational-wave backgrounds using pulsar timing arrays Deepali Agarwal, Joseph D. Romano, Yacine Ali-Haïmoud, Tristan L. Smith General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Mapping gravitational-wave background (GWB) anisotropy with pulsar timing arrays (PTAs) is affected by harmonic-space mode suppression and mode coupling arising from an array's nonuniform sky response. Spherical harmonic expansions must be truncated at finite multipole l_max^rec, often set to l_max^N_pair$\\equiv {\\rm int}\\left[\\sqrt{\\text{N_pair}}-1\\right]$, where N_pair is the number of distinct pulsar pairs in an array. This choice is motivated by the counting argument that cross-correlations provide at most N_pair independent constraints. We obtain the multipole l_max^res corresponding to the maximum informative angular scale of a PTA. It is defined such that expansions to l_max^res (approximately) span the space of \"observable skies\" encoded in the N_pair eigenmaps of the Fisher information matrix, and therefore depends on the array configuration. We explicitly show that GWB power contained in multipoles l$\\gtrsim$l_max^res do not significantly affect analyses that use expansions out to l_max^res, because the PTA response acts as a low-pass filter. In contrast, truncating at l_max^rec< l_max^res leads to leakage of small-scale angular power from l_max^rec<l$\\leq$l_max^res. Even choosing l_max^rec=l_max^res, the standard frequentist estimator of the angular power spectrum C_l remains biased by the modes unobservable by the array. Although we can (partially) debias the standard estimator -- improving its agreement with an injected spectrum -- this reduction in bias comes at the expense of an increase in variance, particularly for poorly constrained modes with l$\\gg$l_eff. We therefore recommend: (i) using l_max^res for PTA analyses involving spherical harmonic expansions, and (ii) using the debiased standard estimator for C_l recovery, but only out to multipoles l<l_eff ($\\ll$l_max^res) corresponding to sufficiently constrained modes.",
      "pdf_url": "https://arxiv.org/pdf/2602.20075.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2602.20081",
      "title": "The Spacetime Positive Mass Theorem with Multiple Time Dimensions",
      "authors": [
        "Sven Hirsch",
        "Alec Payne",
        "Yiyue Zhang"
      ],
      "abstract": "The Spacetime Positive Mass Theorem with Multiple Time Dimensions Sven Hirsch, Alec Payne, Yiyue Zhang General Relativity and Quantum Cosmology (gr-qc); Analysis of PDEs (math.AP); Differential Geometry (math.DG) We generalize the spacetime positive mass theorem to include multiple time dimensions. In particular, we show that the mass remains nonnegative in the sense that the energy $E$ is bounded from below by the trace norm of the linear momenta $J^1,...,J^m$. Equality in this energy inequality implies a foliation by flat submanifolds of a generalized initial data set. Moreover, under an additional umbilicity assumption, we find that the initial data set isometrically embeds into a generalized pp-wave.",
      "pdf_url": "https://arxiv.org/pdf/2602.20081.pdf",
      "categories": [
        "gr-qc",
        "math.AP",
        "math.DG"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.20099",
      "title": "Spherically symmetric solutions to the Einstein-scalar field conformal constraint equations",
      "authors": [
        "Philippe Castillon",
        "The-Cang Nguyen"
      ],
      "abstract": "Spherically symmetric solutions to the Einstein-scalar field conformal constraint equations Philippe Castillon, The-Cang Nguyen General Relativity and Quantum Cosmology (gr-qc); Analysis of PDEs (math.AP); Differential Geometry (math.DG) Recent works by the second author and Dilts et al. have shown that the Einstein-scalar field conformal constraint equations are highly complex and generally intractable, even in the vacuum case. In this article, to gain a clearer understanding and offer a new perspective, we study these equations under special assumptions: the manifold $(M,g)$ is harmonic and data is radial. In this setting, the system reduces to a single nonlinear equation and is completely resolved in the standard cases. In particular, on the sphere, our results reveal phenomena that contrast with the well-known achievements on compact manifolds without conformal Killing vector fields, including nonexistence of solutions in the near-CMC regime and instability when the mean curvature is non-constant. By contrast, on Euclidean or hyperbolic manifolds, the equations are always solvable, with all expected properties of solutions satisfied. These findings support the view that, although the conformal method appears to present some drawbacks on compact manifolds, it remains a promising tool for parametrizing solutions to the constraint equations on asymptotically flat and hyperbolic manifolds in arbitrary mean curvature regimes. In this article, we also investigate the sign of mass, showing that the ADM and asymptotically hyperbolic mass can take arbitrary sign when the decay rate of symmetric $(0,2)$-tensor $k$ at infinity is critical. Finally, most solution classes in our framework are explicit, providing a variety of models in general relativity and offering insights into the structure and behavior of initial data, particularly in numerical applications.",
      "pdf_url": "https://arxiv.org/pdf/2602.20099.pdf",
      "categories": [
        "gr-qc",
        "math.AP",
        "math.DG"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.20147",
      "title": "Exotic spherically-symmetric Lambda-vacuum in the four-dimensional Starobinsky model",
      "authors": [
        "Andrei Galiautdinov"
      ],
      "abstract": "Exotic spherically-symmetric Lambda-vacuum in the four-dimensional Starobinsky model Andrei Galiautdinov General Relativity and Quantum Cosmology (gr-qc) We introduce an exact, two-parameter family of static, spherically-symmetric, constant-curvature $\\Lambda$-vacuum solutions within the four-dimensional Starobinsky $f(R)=R+\\alpha R^2$ model. When the bare cosmological constant is precisely fine-tuned to $\\Lambda = 1/(8\\alpha)$, the scalar curvature is fixed such that the derivative $f'(R)=1+2\\alpha R$ identically vanishes, demonstrating that the family represents a pathological $R_0$-degenerate boundary of the viable physical states. This mathematical degeneracy decouples the modified field equations, permitting the existence of an arbitrary $1/r^2$ integration constant in the metric, which functions as a purely geometric, Reissner-Nordström hair mimicker. However, any infinitesimal deviation from this exact boundary instantaneously destroys the degeneracy, rigorously forcing the geometric hair to vanish and collapsing the spacetime back into the standard Schwarzschild-de Sitter family. We provide the exact algebraic derivation of this spacetime and highlight its physical pathologies, including the identically vanishing Wald entropy of the associated black hole horizons, the divergence of the effective gravitational coupling, the resulting backreaction catastrophe, and the onset of severe ghost instabilities. Ultimately, this exact solution functions as a rigorous no-go theorem within the Starobinsky model, pedagogically illustrating the extreme fragility and physical hostility of degenerate, purely mathematical solutions in highly non-linear $f(R)$ gravity theories.",
      "pdf_url": "https://arxiv.org/pdf/2602.20147.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.18488",
      "title": "Thermal Analysis, Joule-Thomson Expansion and Hawking Sparsity of Mod(A)Max-AdS Black Hole Immersed in a Cloud of Strings",
      "authors": [
        "Faizuddin Ahmed",
        "Ahmad Al-Badawi",
        "Edilberto O. Silva"
      ],
      "abstract": "Thermal Analysis, Joule-Thomson Expansion and Hawking Sparsity of Mod(A)Max-AdS Black Hole Immersed in a Cloud of Strings Faizuddin Ahmed, Ahmad Al-Badawi, Edilberto O. Silva General Physics (physics.gen-ph); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate the thermodynamic behavior of a spherically symmetric Anti-de Sitter black hole in Mod(A)Max electrodynamics surrounded by a cloud of strings. Within the extended phase-space framework, we treat the cosmological constant as a pressure and interpret the black-hole mass as enthalpy, which enables a unified discussion of local stability, global phase structure, and Joule--Thomson expansion. We analyze the Hawking temperature, Gibbs free energy, and heat capacity, and show how the string-cloud parameter, the Mod(A)Max deformation, and the electric charge reshape the physical domain, the stability windows, and the small/large black-hole transition pattern. We further characterize the critical behavior and demonstrate that a van der Waals--like phase structure arises only in the physical sector, while the alternate branch does not admit a genuine critical point. For the Joule-Thomson process, we determine the inversion curve and the corresponding isenthalpic trajectories, highlighting how the model parameters control the cooling/heating regimes and can generate terminating isenthalpic behavior at sufficiently large charge. Finally, we examine the sparsity of Hawking radiation and discuss how the underlying parameters influence the temporal discreteness of the emitted flux, particularly near extremality and in the large-radius AdS regime.",
      "pdf_url": "https://arxiv.org/pdf/2602.18488.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2405.05884",
      "title": "A meta inspiral-merger-ringdown consistency test of general relativity with gravitational wave signals from compact binaries",
      "authors": [
        "Sakshi Satish Madekar",
        "Nathan K Johnson-McDaniel",
        "Anuradha Gupta",
        "Abhirup Ghosh"
      ],
      "abstract": "A meta inspiral-merger-ringdown consistency test of general relativity with gravitational wave signals from compact binaries Sakshi Satish Madekar, Nathan K Johnson-McDaniel, Anuradha Gupta, Abhirup Ghosh 31 pages, 32 figures, version accepted by CQG, Abstract shortened due to word limit Classical and Quantum Gravity 42 (16), 165011, 2025 General Relativity and Quantum Cosmology (gr-qc) The observation of gravitational waves from compact binary coalescences is a promising tool to test the validity of general relativity (GR) in a highly dynamical strong-field regime. There are now a variety of tests of GR performed on the observed compact binary signals. In this paper, we propose a new test of GR that compares the results of these individual tests. This meta inspiral-merger-ringdown consistency test (IMRCT) involves inferring the final mass and spin of the remnant black hole obtained from the analyses of two different tests of GR and checking for consistency. If there is a deviation from GR, we expect that different tests of GR will recover different values for the final mass and spin, in general. We check the performance of the meta IMRCT using a standard set of null tests used in various gravitational-wave analyses: the original IMRCT, parameterized phasing tests (TIGER and FTI) and the modified dispersion test. However, the meta IMRCT is applicable to any tests of GR that infer the initial masses and spins or the final mass and spin, including ones that are applied to binary neutron star or neutron star--black hole signals. We apply the meta IMRCT to simulated quasi-circular GR and non-GR binary black hole (BBH) signals as well as to eccentric BBH signals in GR (analyzed with quasicircular waveforms). We find that the meta IMRCT gives consistency with GR for the quasi-circular GR signals and picks up a deviation from GR in the other cases, as do other tests. In some cases, the meta IMRCT finds a significant GR deviation for a given pair of tests (and specific testing parameters) while the individual tests do not, showing that it is more sensitive than the individual tests to certain types of deviations. In addition, we also apply this test to a few selected real compact binary signals and find them consistent with GR.",
      "pdf_url": "https://arxiv.org/pdf/2405.05884.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.13035",
      "title": "Probing Dark Matter's Gravitational Effects Locally with TianQin",
      "authors": [
        "Zheng-Cheng Liang",
        "Fa-Peng Huang",
        "Xuefeng Zhang",
        "Yi-Ming Hu"
      ],
      "abstract": "Probing Dark Matter's Gravitational Effects Locally with TianQin Zheng-Cheng Liang, Fa-Peng Huang, Xuefeng Zhang, Yi-Ming Hu General Relativity and Quantum Cosmology (gr-qc) In this study, we explore the potential of using TianQin missions to probe the local gravitational effects of dark matter. The TianQin project plans to launch satellites at both low and high orbits. High-precision orbit determination is expected to aid in detecting Earth's gravity or gravitational waves. By comparing the derived masses in low and high orbits, it is possible to constrain the amount of dark matter between the two spheres, hence placing a local constraint on dark matter's gravitational effect. Our results show the capability of TianQin in detecting the density of dark matter around Earth, with an ultimate sensitivity to a value of $10^{-8}\\,\\,{\\rm kg\\,\\,m^{-3}}$. This detection limit surpasses the estimated bounds for the solar system and the observation results for our Galaxy by approximately 7 and 14 orders of magnitude, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2506.13035.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.22545",
      "title": "Quantum Uncertainties of Static Spherically Symmetric Spacetimes",
      "authors": [
        "Benjamin Koch",
        "Ali Riahinia"
      ],
      "abstract": "Quantum Uncertainties of Static Spherically Symmetric Spacetimes Benjamin Koch, Ali Riahinia 24 Pages, (Accepted to the Universe Journal - Special Issue: Quantum Gravity Phenomenology: Insights and Advances) ArXiv paper pitch this https URL General Relativity and Quantum Cosmology (gr-qc) We present a canonical quantization framework for static spherically symmetric spacetimes described by the Einstein-Hilbert action with a cosmological constant. In addition to recovering the classical Schwarzschild-(Anti)-de Sitter solutions via the Ehrenfest theorem, we investigate the quantum uncertainty relations that arise among the geometric operators in this setup. Our analysis uncovers an intriguing relation to black hole thermodynamics and opens a new angle towards generalized uncertainty relations. We further obtain an upper and a lower limit of the mass that is allowed in our model, for a given value of the cosmological constant. Both limits, when evaluated for the known value of the cosmological constant, have a stunning relation to observed bounds. These findings open a promising avenue for deeper insights into how quantum effects manifest in spacetime geometry and gravitational systems.",
      "pdf_url": "https://arxiv.org/pdf/2506.22545.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.02410",
      "title": "Estimation of gravitational production uncertainties",
      "authors": [
        "Jose A. R. Cembranos",
        "Luis J. Garay",
        "Álvaro Parra-López",
        "Javier Ortega del Río"
      ],
      "abstract": "Estimation of gravitational production uncertainties Jose A. R. Cembranos, Luis J. Garay, Álvaro Parra-López, Javier Ortega del Río Journal of Cosmology and Astroparticle Physics, Volume 2026, January 2026 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Cosmological production of scalar, non-minimally coupled dark matter depends on the specifics of the inflationary model under consideration. We analyze both Starobinsky inflation and a quadratic potential, solve the full background dynamics, study pair production during inflation and reheating, and find that the observed dark matter abundance can be explained solely by this mechanism, regardless of the inflationary model. Qualitative differences between the two cases only appear for dark matter masses close to the inflationary scale. In addition, we identify a large region in parameter space in which cosmological production of dark matter is mostly independent of the chosen inflationary potential, highlighting the robustness of this dark matter production mechanism and its independence of the unknown particular details of inflation. In the region of masses lower than the scale of inflation, and sufficiently away from the conformal limit, the total comoving number density of produced particles becomes a function of the coupling to the geometry alone. This allows us to provide an approximated analytic expression for fitting the resulting abundance.",
      "pdf_url": "https://arxiv.org/pdf/2507.02410.pdf",
      "categories": [
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.09543",
      "title": "Distinguishing gravity theories with networks of space-based gravitational-wave detectors",
      "authors": [
        "Bo Mu",
        "Zong-Kuan Guo"
      ],
      "abstract": "Distinguishing gravity theories with networks of space-based gravitational-wave detectors Bo Mu, Zong-Kuan Guo General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We propose a method for separating and detecting the non-tensor modes of stochastic gravitational-wave backgrounds (SGWBs) using networks of space-based gravitational-wave detectors. We consider four distinct data-reconstruction schemes for the co-inclination and anti-inclination orbital configurations of the LISA-Taiji network. We find that the co-inclination configuration offers its advantages over the anti-inclination one and can achieve signal-to-noise ratios up to 17.3 for the vector modes and 10.4 for the scalar modes with the energy density spectrum as $\\Omega_{GW}^p(f)=10^{-12}$. Our method can be used to measure beyond-general-relativity polarization modes of SGWBs at mHz frequency band, opening a new avenue for testing alternative gravity theories.",
      "pdf_url": "https://arxiv.org/pdf/2507.09543.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.11524",
      "title": "Quantum modified inertia: an application to galaxy rotation curves",
      "authors": [
        "Jonathan Gillot"
      ],
      "abstract": "Quantum modified inertia: an application to galaxy rotation curves Jonathan Gillot General Relativity and Quantum Cosmology (gr-qc) This work explores modified inertia in the context of galactic dynamics by investigating the consequences of introducing quantum-motivated bounds on acceleration. Building on earlier ideas related to maximal acceleration and quantum speed limits, an effective framework is developed in which both upper and lower acceleration bounds are incorporated within special relativity through a correspondence between the proper time of an accelerated object and the quantum speed limit. The resulting modified inertia model is applied to galaxy rotation curves, taking into account the baryonic contributions from stellar disks, gas, and bulges. An analytic expression for the radial acceleration relation is derived within this framework. When confronted with observations, the model provides a good description of several galactic systems, including the Milky Way and the dwarf galaxy DDO 52. It also successfully recovers the Tully-Fisher relation linking the baryonic mass and the terminal speed, with $\\mathrm{log}(M) = 4 \\, \\mathrm{log}(v) + 2.62$. A characteristic minimal acceleration of order $1.8 \\times 10^{-11}$ m s$^{-2}$ naturally emerges from the analysis and proves effective in reproducing a wide range of rotation curves. The resulting radial acceleration relation is consistent with Solar System constraints, including the Cassini quadrupole bound, and remains compatible with recent observational results on dwarf spheroidals and ultra-wide binaries. Within this effective description, the presence of a lower acceleration bound significantly reduces the amount of dark matter required to account for galactic rotation curves. Possible implications for the redshift evolution of this minimal acceleration, and for galaxy formation and evolution, are briefly discussed.",
      "pdf_url": "https://arxiv.org/pdf/2507.11524.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.15920",
      "title": "Master field equations for spherically symmetric gravitational fields beyond general relativity",
      "authors": [
        "Raúl Carballo-Rubio"
      ],
      "abstract": "Master field equations for spherically symmetric gravitational fields beyond general relativity Raúl Carballo-Rubio v2: 12 pages + references; v1: 8 pages + references General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) According to general relativity, black holes are incomplete, which prevents developing a complete physical description of their dynamical formation and evolution once quantum effects are taken into account. Theories beyond general relativity may provide a more complete description of black hole interiors. In this work, the most general form of the field equations for spherically symmetric gravitational fields, in which the Einstein tensor is deformed into a conserved tensor constructed from up to second-order derivatives of the metric, is described. These equations set up the stage for the study of the dynamics of spherically symmetric spacetimes beyond general relativity, providing tools for the theoretical exploration of a paradigm of black hole physics free of the incompleteness characteristic of Einstein's theory. A general proof of the Birkhoff--Jebsen theorem for vacuum solutions, and the construction of field equations describing the effective geometrodynamics of regular black holes interacting with matter, are discussed.",
      "pdf_url": "https://arxiv.org/pdf/2507.15920.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.00516",
      "title": "Probing scalar field with generic extreme mass-ratio inspirals around Kerr black holes",
      "authors": [
        "Tieguang Zi",
        "Shailesh Kumar"
      ],
      "abstract": "Probing scalar field with generic extreme mass-ratio inspirals around Kerr black holes Tieguang Zi, Shailesh Kumar V2: 21 Pages, 8 Figures, 3 Table, Updated interpolation validation and new results on FIM, Version accepted to appear in JCAP General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) The future space-based gravitational wave observatories are expected to provide unprecedented opportunities to explore intricate characteristics of black hole binaries, particularly for extreme mass-ratio inspirals (EMRIs), in which a stellar-mass compact object slowly inspirals into a supermassive black hole. These systems are very prominent sources for testing gravity in the strong gravity fields and for probing potential deviations from general relativity, including those arising from the presence of fundamental scalar fields. In this work, we examine the impact of a scalar charge carried by the inspiraling object within the context of EMRIs. We focus on generic orbits that present both eccentricity and inclination to evaluate how these parameters affect the modifications induced by the scalar charge to the gravitational wave signal. Our results demonstrate that the inclusion of orbital inclination, in particular, enhances the detectability of scalar field effects by introducing richer waveform features that deviate from the purely general relativistic case. The interplay among scalar charge, eccentricity and inclination provides a more complete sampling of the black hole spacetime, suggesting that EMRIs with such generic orbits represent compelling systems for stringently constraining or discovering new fundamental fields through future gravitational wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2508.00516.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.21652",
      "title": "A User-Friendly Python Interface for the Numerical Relativity Code AMSS-NCKU",
      "authors": [
        "Chen-Kai Qiao",
        "Yi Zheng",
        "Zhou-Jian Cao"
      ],
      "abstract": "A User-Friendly Python Interface for the Numerical Relativity Code AMSS-NCKU Chen-Kai Qiao, Yi Zheng, Zhou-Jian Cao 14 pages, 4 figures, 1 appendix. V2: minor revisions; V3: formulas used to exact gravitational waves were added; V4: modifying some background discussions and figures General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Numerical relativity has brought about profound and wide-ranging influences on modern astrophysics and gravitational-wave astronomy. In this study, we present a user-friendly Python interface for the numerical relativity code AMSS-NCKU. This interface facilitates the automation of initializing and executing the AMSS-NCKU simulations, as well as the automatic visualization of the output data. The Python interface can significantly reduce the operational complexity of the AMSS-NCKU simulation workflow, lowering the technical barriers for new users. To show the utility of this Python interface, we present two representative examples of numerical relativity simulations (the binary black hole and triple black hole merger processes), obtaining stable numerical results and the expected physical behaviors for black hole systems. Keywords: Numerical Relativity, Gravitational Waves, Black Holes, Python",
      "pdf_url": "https://arxiv.org/pdf/2509.21652.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.11849",
      "title": "Lorentz Covariant Supertranslation Frames for the Angular Momentum Aspect",
      "authors": [
        "Reza Javadinezhad",
        "Massimo Porrati"
      ],
      "abstract": "Lorentz Covariant Supertranslation Frames for the Angular Momentum Aspect Reza Javadinezhad, Massimo Porrati Additional references, to appear in MPLA General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this letter, we review the well known ambiguity in defining angular momentum (and mass dipole) fluxes in general relativity and we reinterpret recent works that resolve the ambiguity by defining invariant charges. We resolve the ambiguity by finding the conditions that fix a frame for supertranslation and for space-time translation. We also present an elementary method for measuring the angular momentum aspect and work out explicitly the supertranslation frame-fixing conditions for the metric created by point particles to first nontrivial order in the Newton constant.",
      "pdf_url": "https://arxiv.org/pdf/2510.11849.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.18022",
      "title": "Constraining a de Broglie--Bohm quantum bounce cosmology with Planck data",
      "authors": [
        "Micol Benetti",
        "Rudnei O. Ramos",
        "Renato Silva",
        "Gustavo S. Vicente"
      ],
      "abstract": "Constraining a de Broglie--Bohm quantum bounce cosmology with Planck data Micol Benetti, Rudnei O. Ramos, Renato Silva, Gustavo S. Vicente 12 pages, 5 figures. Replaced with the version matching the published one in the PRD Phys. Rev. D 113, 023543 (2026) General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) This work investigates a singularity-free early Universe within the paradigm of quantum cosmology. We develop a bouncing model where the singularity is resolved via the de Broglie--Bohm interpretation of quantum mechanics, which provides a deterministic trajectory for the scale factor through a quantum bounce. The primordial power spectrum for scalar perturbations is derived, incorporating a characteristic modulation (distortion function) imprinted by the nonstandard quantum gravitational dynamics near the bounce. We confront this model with the Planck 2018 cosmic microwave background data, establishing its strong compatibility with observations. Our analysis places a stringent upper bound on the fundamental scale of the bounce $k_B$, constraining the parameter space of such quantum cosmological scenarios. {}Furthermore, the model's specific scale-dependent anticorrelation between the spectral index and amplitude of perturbations offers a potential mechanism for mitigating the $H_0$-$\\sigma_8$ tension, presenting a testable signature for future cosmological surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.18022.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17304",
      "title": "Two descriptions of dark matter around a black hole: photon sphere, shadow, and lensing",
      "authors": [
        "M. F. Fauzi",
        "H. S. Ramadhan",
        "A. Sulaksono"
      ],
      "abstract": "Two descriptions of dark matter around a black hole: photon sphere, shadow, and lensing M. F. Fauzi, H. S. Ramadhan, A. Sulaksono 6 pages, 4 figures + supplementary material General Relativity and Quantum Cosmology (gr-qc) We examine observational discrepancies of two widely used models describing anisotropic (dark) matter distributions around a black hole, focusing on their photon spheres, shadow radii, and lensing observables. The models considered are the vacuum and Einstein cluster dark matter model, characterized by negative and zero radial pressure, respectively. The analysis reveals that these models display contrasting photon sphere behavior. In particular, the Einstein cluster results in a more pronounced deviation in the shadow radius relative to the standard Schwarzschild black hole. Additionally, a distinctive lensing phenomenon associated with the matter halo is identified in both models.",
      "pdf_url": "https://arxiv.org/pdf/2512.17304.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.01451",
      "title": "Bounds on the photon sphere radius for spherically symmetric black holes in n-dimensional Einstein gravity",
      "authors": [
        "Yong Song",
        "Jiaqi Fu",
        "Yiting Cen"
      ],
      "abstract": "Bounds on the photon sphere radius for spherically symmetric black holes in n-dimensional Einstein gravity Yong Song, Jiaqi Fu, Yiting Cen 9 pages, no figures, including the lower bound result General Relativity and Quantum Cosmology (gr-qc) The photon sphere, a hypersurface of circular null geodesics, plays a fundamental role in characterizing black hole spacetimes, influencing phenomena such as black hole shadows, gravitational lensing, and quasinormal modes. In this work, we derive both upper and lower bounds on the photon sphere radius for static, spherically symmetric, asymptotically flat black holes within $n$-dimensional Einstein gravity ($n\\ge 4$), assuming an anisotropic matter field satisfying the weak energy condition and a non-positive trace of the energy-momentum tensor. For the upper bound we obtain $r_\\gamma\\le [(n-1)M]^{\\frac{1}{n-3}}$, where $M$ is the ADM mass, which reduces to $r_\\gamma\\le 3M$ for $n=4$ in agreement with Hod's result. For the lower bound, under the additional assumption that $|r^{n-1}p_r(r)|$ is monotonically decreasing, we prove $r_\\gamma\\ge (\\frac{n-1}{2})^{1/(n-3)}r_H$, where $r_H$ is the radius of the outer event horizon; for $n=4$ this gives $r_\\gamma\\ge \\frac{3}{2}r_H$, also consistent with Hod's four-dimensional theorem. These results provide dimension-dependent geometric constraints that generalize well-known four-dimensional bounds to a specific class of higher-dimensional black holes (described by a Tangherlini-type metric) and deepen our understanding of spacetime structure in higher-dimensional gravitational theories.",
      "pdf_url": "https://arxiv.org/pdf/2601.01451.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07289",
      "title": "A universal lower bound on the photon sphere radius in higher-dimensional black holes",
      "authors": [
        "Yong Song",
        "Jiaqi Fu",
        "Yiting Cen"
      ],
      "abstract": "A universal lower bound on the photon sphere radius in higher-dimensional black holes Yong Song, Jiaqi Fu, Yiting Cen Merge into a single article with \"A universal upper bound on the photon sphere radius in higher-dimensional black holes\" [arXiv:2601.01451] General Relativity and Quantum Cosmology (gr-qc) The photon sphere, a hypersurface of circular null geodesics, plays a fundamental role in characterizing black hole spacetimes, influencing phenomena such as black hole shadows, gravitational lensing, and quasinormal modes. While universal upper bounds on the photon sphere radius have been established for both four-dimensional and higher-dimensional black holes, the question of a corresponding lower bound in higher-dimensional black holes remains less explored. In this work, we derive a universal lower bound for the photon sphere radius in static, spherically symmetric, asymptotically flat black hole spacetimes of arbitrary dimension $n\\ge 4$. Under the assumptions of the weak energy condition, a non-positive trace of the energy-momentum tensor, and a monotonicity condition on the radial pressure function $|r^{n-1}p_r(r)|$, we prove that the photon sphere radius $r_\\gamma$ satisfies $r_\\gamma\\ge (\\frac{n-1}{2})^{1/(n-3)}r_H$, where $r_H$ is the radius of the outer event horizon. For $n=4$, this reduces to the known result $r_\\gamma\\ge \\frac{3}{2}r_H$. Our result generalizes Hod's four-dimensional theorem to higher dimensions, and provides a new geometric constraint on the structure of black holes in extended theories of gravity.",
      "pdf_url": "https://arxiv.org/pdf/2601.07289.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07879",
      "title": "Ghost-free non-local $F(R)$ Gravity Compatible with ACT",
      "authors": [
        "Shin'ichi Nojiri",
        "S.D. Odintsov",
        "V.K. Oikonomou"
      ],
      "abstract": "Ghost-free non-local $F(R)$ Gravity Compatible with ACT Shin'ichi Nojiri, S.D. Odintsov, V.K. Oikonomou General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We confront the ghost-free non-local $F(R)$ gravity theories with the latest Atacama Cosmology Telescope (ACT) constraints on the spectral index of the scalar perturbations and the updated constraints of Planck/BICEP on the tensor-to-scalar ratio. After reviewing how the ghost-free non-local version of $F(R)$ gravity can be obtained, we show that the de Sitter solution can be obtained in this framework. Also, we show that the resulting theory can be cast in terms of an $F(R,\\phi)$ theory of gravity. We analyze two models of non-local $F(R)$ gravity, one power-law and the $R^2$ model, and we show that both models can be compatible with the ACT and updated Planck/BICEP constraints.",
      "pdf_url": "https://arxiv.org/pdf/2601.07879.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22219",
      "title": "When inflationary perturbations refuse to classicalise: the role of non-Gaussianity in Wigner negativity",
      "authors": [
        "Aurora Ireland",
        "Vincent Vennin"
      ],
      "abstract": "When inflationary perturbations refuse to classicalise: the role of non-Gaussianity in Wigner negativity Aurora Ireland, Vincent Vennin 43 pages, 7 figures; v2 added citations General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Inflationary perturbations are quantum in origin. Yet, when computing cosmological observables, they are often treated as classical stochastic fields. Do they nevertheless retain quantum birthmarks? A hallmark of genuinely quantum behaviour is quantum interferences, arising from phase coherence between distinct branches of the wavefunction. Such interference is diagnosed by the non-positivity of the Wigner function, and according to Hudson's theorem, the only pure states with positive Wigner functions are Gaussian states. Consequently, any departure from Gaussianity necessarily implies a non-positive Wigner function, precluding a description in terms of a classical distribution. This motivates us to compute the Wigner function of curvature perturbations, accounting for primordial non-Gaussianities, using the EFT of inflation. We find that the Wigner function develops pronounced interference fringes on super-Hubble scales, and in particular, its negativity grows as $a^2$ in ultra-slow-roll backgrounds. These results demonstrate that quantum effects can remain significant at late times, and that squeezing alone does not ensure classicality, contrary to standard lore. This suggests that the prospects for detecting genuinely quantum signatures of the universe's origins in cosmological observables may be less bleak than previously thought.",
      "pdf_url": "https://arxiv.org/pdf/2601.22219.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.00902",
      "title": "$δN$ formalism with gradient interactions",
      "authors": [
        "S. Mohammad Ahmadi",
        "Nahid Ahmadi"
      ],
      "abstract": "$δN$ formalism with gradient interactions S. Mohammad Ahmadi, Nahid Ahmadi General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The standard $\\delta N$ formalism is a cornerstone technique for calculating nonlinear curvature perturbations on super-Hubble scales. However, its validity relies heavily on the separate universe assumption, in which spatial gradients are neglected. This approximation is known to break down in scenarios that are critical for primordial black hole formation, such as transitions to an ultra-slow-roll phase, where gradient interactions induce a significant non-conservation of the comoving curvature perturbation. In this paper, we introduce a framework that systematically incorporates gradient corrections into the $\\delta N$ formalism at a desired order by adding an effective source term to the background Klein--Gordon equation. This approach allows for a fully nonlinear treatment of curvature perturbations at the end of inflation considering initial conditions at the time of horizon exit. By computing the equilateral non-Gaussianity parameter $f_{\\mathrm{NL}}^{\\mathrm{eq}}$, we demonstrate that our method captures essential physical features missed by the standard $\\delta N$ approach, offering a simple yet rigorous pathway to determine the nonlinear evolution expected from full cosmological perturbation theory.",
      "pdf_url": "https://arxiv.org/pdf/2602.00902.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.10311",
      "title": "The measurable impact of the 2pN spin-dependent accelerations on the jet precession of M87$^\\ast$",
      "authors": [
        "Lorenzo Iorio"
      ],
      "abstract": "The measurable impact of the 2pN spin-dependent accelerations on the jet precession of M87$^\\ast$ Lorenzo Iorio LaTex2e, 28 pages, no tables, 3 figures. Figure added General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA) Motivated by recent accurate measurements of disk/jet coprecessions around some galactic supermassive black holes, the accelerations experienced by an uncharged, spinless object in the Kerr metric, written in harmonic coordinates, are analytically calculated up to the formal second post-Newtonian order. To such a level, some new accelerations make their appearance. They are proportional to even and odd powers of the hole's angular momentum. Their counterparts are not known where the primary is a material body. After expressing them in a coordinate-independent, vector form valid for any orientations of the hole's spin axis in space, their orbital effects are perturbatively worked out in terms of the particle's Keplerian orbital elements. The resulting expressions, averaged over one orbital revolution, are valid for generic shapes and inclinations of the orbit. The orbital plane's precession proportional to the first power of the hole's angular momentum and to the reciprocal of the fourth power of the speed of light amounts to about twenty per cent of the corresponding Lense-Thirring effect. The latter is believed to be the cause of the accurately measured disk/jet precessional phenomenology, currently measured to a few per cent accuracy. Although at a lesser extent, also the precession proportional to the second power of the hole's spin and to the reciprocal of the fourth power of the speed of light is measurable. Allowed domains in the parameter space of the jet precession around M87$^\\ast$ are displayed.",
      "pdf_url": "https://arxiv.org/pdf/2602.10311.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.GA"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.16076",
      "title": "The most general four-derivative Unitary String Effective Action with Torsion and Stringy-Running-Vacuum-Model Inflation: Old ideas from a modern perspective",
      "authors": [
        "Nick E. Mavromatos",
        "George Panagopoulos"
      ],
      "abstract": "The most general four-derivative Unitary String Effective Action with Torsion and Stringy-Running-Vacuum-Model Inflation: Old ideas from a modern perspective Nick E. Mavromatos, George Panagopoulos 28 pages Revtex, no figures (a typo was corrected, no effects on the analysis or the conclusions) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The string-inspired running vacuum model (StRVM) of inflation is based on a Chern-Simons (CS) gravity effective action, in which the only four-spacetime-derivative-order term is a gravitational anomalous CS Pontryagin density coupled to an axion. In this work, we revisit curvature-squared string-inspired effective actions, from the point of view of appropriate local field redefinitions, leaving the perturbative string scattering matrices invariant. We require simultaneously unitarity and torsion interpretation of the field strength of the Kalb-Ramond antisymmetric tensor, features characterising the (3+1)-dimensional StRVM Cosmology. Unlike the higher dimensional case, the above feature is possible in the context of (3+1)-dimensional spacetimes, obtained after string compactification. We demonstrate that the unitarity and torsion-interpretation requirements lead to a single-type of extra four-derivative terms in the effective gravitational action, not discussed in the previous literature of StRVM, which however is shown to be subleading by many orders of magnitude, compared to the terms of the StRVM framework. Hence, its presence has no practical implications for the relevant inflationary (and, hence, postinflationary) physics of the StRVM. This demonstrates the phenomenological completeness of the StRVM cosmological scenario, which is thus fully embeddable in the UV complete (quantum-gravity compatible) string theory framework.",
      "pdf_url": "https://arxiv.org/pdf/2602.16076.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.07718",
      "title": "Sagnac and Mashhoon effects in graphene",
      "authors": [
        "Yu.V. Shtanov",
        "T.-H.O. Pokalchuk",
        "S.G. Sharapov"
      ],
      "abstract": "Sagnac and Mashhoon effects in graphene Yu.V. Shtanov, T.-H.O. Pokalchuk, S.G. Sharapov 30 pages, 3 figures; final version published in SciPost Phys Mesoscale and Nanoscale Physics (cond-mat.mes-hall); General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) We investigate the Sagnac and Mashhoon effects in graphene, taking into account both the pseudospin and intrinsic spin of electrons, within a simplified model of a rotating nanotube or infinitesimally narrow ring. Based on considerations of the relativistic phase of the wave function and employing the effective Larmor theorem, we demonstrate that the Sagnac fringe shift retains a form analogous to that for free electrons, governed by the electron's vacuum mass. In the case of a narrow ring, an additional $\\pi$-phase shift arises due to the Berry phase associated with the honeycomb graphene lattice. The Mashhoon fringe shift retains its conventional form, with its dependence on the Fermi velocity.",
      "pdf_url": "https://arxiv.org/pdf/2508.07718.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.13053",
      "title": "Adiabatic Elimination in Relativistic Stochastic Mechanics",
      "authors": [
        "Tao Wang",
        "Yu Shi"
      ],
      "abstract": "Adiabatic Elimination in Relativistic Stochastic Mechanics Tao Wang, Yu Shi Accepted version. Published in Physica A Physica A: Statistical Mechanics and its Applications, Vol. 688, 131404 (2026) Statistical Mechanics (cond-mat.stat-mech); General Relativity and Quantum Cosmology (gr-qc) We investigate the adiabatic elimination of fast variables in relativistic stochastic mechanics, which is analyzed by using the equation of motion and the distribution function, with relativistic corrections explicitly derived. A new dimensionless parameter is introduced to characterize the timescale. The adiabatic elimination is compared with the path integral coarse graining, which is more general yet computationally demanding.",
      "pdf_url": "https://arxiv.org/pdf/2510.13053.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2602.17884",
      "title": "Improved constraints on modified Newtonian gravity from Cassini radio tracking data",
      "authors": [
        "R. S. Park",
        "A. Hees",
        "B. Famaey",
        "H. Desmond",
        "A. Durakovic"
      ],
      "abstract": "Improved constraints on modified Newtonian gravity from Cassini radio tracking data R. S. Park, A. Hees, B. Famaey, H. Desmond, A. Durakovic General Relativity and Quantum Cosmology (gr-qc); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA) We report an updated constraint on the Solar System quadrupole parameter $Q_2$, which encodes the external field effect predicted by modified gravity versions of the MOND paradigm. Using the dataset employed to compute the DE440 planetary ephemerides, and estimating it simultaneously with other parameters included in the planetary ephemerides, we find $Q_2 = (1.6 \\pm 1.8) \\times 10^{-27}\\,\\mathrm{s}^{-2}$ (1-$\\sigma$), representing an improvement of 40% over previous estimates. We also show explicitly that the contribution to the MOND prediction of $Q_2$ from the Solar System's largest planet, Jupiter, is at the 0.05% level, validating the approximation of retaining only the Sun in theoretical calculations. With this new constraint on $Q_2$, we update previously acknowledged tensions with external galaxy rotation curves, now leading to discrepancies at the $3$-$15\\sigma$ level depending on the detailed mass modeling or the subset of galaxies considered. Within the Milky Way itself, the $Q_2$ constraint imposes an upper bound of only 2% (at 95% confidence) on the MOND boost to the galactic radial acceleration (i.e., the ratio of the observed over baryonic Newtonian acceleration) at the position of the Sun, in strong tension with current observational limits. The updated $Q_2$ posterior finally confirms that Solar System measurements provide stronger constraints than current wide-binary data on classical modified gravity versions of MOND.",
      "pdf_url": "https://arxiv.org/pdf/2602.17884.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "is_gw_related": false
    }
  ]
}