{
  "date": "2026-02-03",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 27,
  "gw_related_papers": 5,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.22219",
      "title": "When inflationary perturbations refuse to classicalise: the role of non-Gaussianity in Wigner negativity",
      "authors": [
        "Aurora Ireland",
        "Vincent Vennin"
      ],
      "abstract": "When inflationary perturbations refuse to classicalise: the role of non-Gaussianity in Wigner negativity Aurora Ireland, Vincent Vennin General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Inflationary perturbations are quantum in origin. Yet, when computing cosmological observables, they are often treated as classical stochastic fields. Do they nevertheless retain quantum birthmarks? A hallmark of genuinely quantum behaviour is quantum interferences, arising from phase coherence between distinct branches of the wavefunction. Such interference is diagnosed by the non-positivity of the Wigner function, and according to Hudson's theorem, the only pure states with positive Wigner functions are Gaussian states. Consequently, any departure from Gaussianity necessarily implies a non-positive Wigner function, precluding a description in terms of a classical distribution. This motivates us to compute the Wigner function of curvature perturbations, accounting for primordial non-Gaussianities, using the EFT of inflation. We find that the Wigner function develops pronounced interference fringes on super-Hubble scales, and in particular, its negativity grows as $a^2$ in ultra-slow-roll backgrounds. These results demonstrate that quantum effects can remain significant at late times, and that squeezing alone does not ensure classicality, contrary to standard lore. This suggests that the prospects for detecting genuinely quantum signatures of the universe's origins in cosmological observables may be less bleak than previously thought.",
      "pdf_url": "https://arxiv.org/pdf/2601.22219.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22225",
      "title": "Modified Teleparallel $f(T)$ Gravity, DESI BAO and the $H_0$ Tension",
      "authors": [
        "Mariam Bouhmadi-López",
        "Carlos G. Boiza",
        "Maria Petronikolou",
        "Emmanuel N. Saridakis"
      ],
      "abstract": "Modified Teleparallel $f(T)$ Gravity, DESI BAO and the $H_0$ Tension Mariam Bouhmadi-López, Carlos G. Boiza, Maria Petronikolou, Emmanuel N. Saridakis 17 pages, 5 figures, 3 tables, RevTex 4-2. To be submitted to Universe as an invited contribution to the Research Topic: Exploring and Constraining Alternative Theories of Gravity General Relativity and Quantum Cosmology (gr-qc) We investigate whether late-time modifications of gravity in the teleparallel framework can impact the current tension in the Hubble constant $H_0$, focusing on $f(T)$ cosmology as a minimal and well-controlled extension of General Relativity. We consider three representative $f(T)$ parametrisations that recover the teleparallel equivalent of General Relativity at early times and deviate from it only at late epochs. The models are confronted with unanchored Pantheon+ Type~Ia supernovae, DESI DR2 baryon acoustic oscillations, compressed Planck cosmic microwave background distance priors, and redshift-space distortion data, allowing us to jointly probe the background expansion and the growth of cosmic structures. Two of the three models partially shift the inferred value of $H_0$ towards local measurements, while the third worsens the discrepancy. This behaviour is directly linked to the effective torsional dynamics, with phantom-like regimes favouring higher $H_0$ and quintessence-like regimes producing the opposite effect. A global statistical comparison shows that the minimal $f(T)$ extensions considered here are not favoured over $\\Lambda$CDM by the combined data. Nevertheless, our results demonstrate that late-time torsional modifications can non-trivially redistribute current cosmological tensions among the background and growth sectors.",
      "pdf_url": "https://arxiv.org/pdf/2601.22225.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22299",
      "title": "Scattering sections from regular black holes immersed in perfect fluid dark matter",
      "authors": [
        "Omar Pedraza",
        "L. A. López",
        "Isaac Fernández"
      ],
      "abstract": "Scattering sections from regular black holes immersed in perfect fluid dark matter Omar Pedraza, L. A. López, Isaac Fernández General Relativity and Quantum Cosmology (gr-qc) In this contribution, we investigate the scattering cross sections of black holes immersed in perfect fluid dark matter (PFDM). We present both the classical and semi-classical scattering cross sections for different values of the parameter that characterizes the PFDM contribution. Our results show that the presence of dark matter increases the classical scattering cross section and modifies the width of the interference fringes in the semi-classical regime. In addition, the scattering cross section is also computed using the partial wave method for the black holes considered, exhibiting similar qualitative behavior. These findings suggest that the effects of dark matter surrounding black holes may play an important role in black holes phenomenology, particularly in certain regions near the black hole.",
      "pdf_url": "https://arxiv.org/pdf/2601.22299.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22332",
      "title": "Photon-graviton polarization entanglement induced by a classical electromagnetic wave",
      "authors": [
        "Alessandro Ferreri"
      ],
      "abstract": "Photon-graviton polarization entanglement induced by a classical electromagnetic wave Alessandro Ferreri General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) We study the photon-graviton pair production induced by the propagation of a classical electromagnetic (EM) wave in a Minkowskian spacetime. In our model, the gravitational field is described in terms of the quantized graviton field, whereas the electromagnetic field is split into a classical drive (a linearly or circularly polarized electromagnetic wave) and a quantum fluctuation field. We analyze the time evolution of the quantum state showing that, among other outcomes, the propagation of the EM wave can generate Bell states in the photon-graviton polarization basis. We finally discuss the possibility to observe entangled photons in artificial and natural scenarios.",
      "pdf_url": "https://arxiv.org/pdf/2601.22332.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22333",
      "title": "Revisiting the energy-momentum squared gravity",
      "authors": [
        "Mihai Marciu"
      ],
      "abstract": "Revisiting the energy-momentum squared gravity Mihai Marciu General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Computational Physics (physics.comp-ph) In this paper we have revisited the energy-momentum squared gravity theory, by taking into account the second derivative of the matter Lagrangian with respect to the metric, encapsulating relations originated from thermodynamical grounds. After obtaining the scalar tensor representation of the energy-momentum squared gravity with the new corrections, we have analyzed the physical implications by relying on the linear stability theory. The results show that the current cosmological system is compatible with the expansion of the Universe for some specific matter Lagrangians, explaining the emergence of matter domination era, approaching the late time accelerated expansion era close to the de-Sitter phenomenology.",
      "pdf_url": "https://arxiv.org/pdf/2601.22333.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22340",
      "title": "Grey-body factors of higher dimensional regular black holes in quasi-topological theories",
      "authors": [
        "Juan Pablo Arbelaez"
      ],
      "abstract": "Grey-body factors of higher dimensional regular black holes in quasi-topological theories Juan Pablo Arbelaez General Relativity and Quantum Cosmology (gr-qc) We study grey-body factors and Hawking radiation of higher-dimensional regular black holes arising in quasi-topological gravity. These spacetimes incorporate infinite-curvature corrections that remove the central singularity while preserving an event horizon and a well-defined semiclassical description. We show that, for all considered regular black hole models, the transmission of radiation and the corresponding Hawking evaporation are significantly suppressed compared to the singular black hole solutions of General Relativity.",
      "pdf_url": "https://arxiv.org/pdf/2601.22340.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22388",
      "title": "A Maximum Entropy Conjecture for Black Hole Mergers",
      "authors": [
        "Monica Rincon-Ramirez",
        "Nathan K. Johnson-McDaniel",
        "Eugenio Bianchi",
        "Ish Gupta",
        "Vaishak Prasad",
        "B. S. Sathyaprakash"
      ],
      "abstract": "A Maximum Entropy Conjecture for Black Hole Mergers Monica Rincon-Ramirez, Nathan K. Johnson-McDaniel, Eugenio Bianchi, Ish Gupta, Vaishak Prasad, B. S. Sathyaprakash General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) The final state of a binary black hole merger is predicted with high precision by numerical relativity, but could there be a simple thermodynamic principle within general relativity that governs the selection of the remnant? Using post-Newtonian relations between the mass M (including the binding energy) and angular momentum J of quasi-circular, nonspinning binaries, we uncover a puzzling result: When the binary's instantaneous M and J are mapped to those of a hypothetical Kerr black hole, the corresponding entropy exhibits a maximum during the evolution. This maximum occurs at values of M and J strikingly close to those of the final remnant predicted by numerical relativity. Consistent behavior is observed when using the relation between M and J obtained from numerical relativity evolution. Although this procedure is somewhat ad hoc, the agreement between the masses and spins of the final state obtained from numerical relativity and the results of this maximum entropy procedure is remarkable, with agreement to within a few percent when using either post-Newtonian or numerical relativity results for M and J. These findings allow us to propose an entropy maximization conjecture for binary black hole mergers, hinting that thermodynamic principles may govern the selection of the final black hole state.",
      "pdf_url": "https://arxiv.org/pdf/2601.22388.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22565",
      "title": "Thermodynamics and Stability of Ultraspinning Black Holes",
      "authors": [
        "Zhenbo Di"
      ],
      "abstract": "Thermodynamics and Stability of Ultraspinning Black Holes Zhenbo Di General Relativity and Quantum Cosmology (gr-qc) Ultraspinning black holes have attracted considerable attention due to their super-entropic nature, and previous analyses -- mostly restricted to neutral cases and high-temperature regimes -- have suggested that such black holes are always thermodynamically unstable. In this work, we revisit the thermodynamic stability of ultraspinning black holes by performing a systematic analysis of the heat capacity in different ensembles over the full range of the horizon radius $r_H$, which were missed in earlier temperature-based analyses. We demonstrate for the first time that, contrary to earlier claims, ultraspinning black holes can admit thermodynamically stable regions, whose existence crucially depends on the spacetime dimension, the solution branch, and the presence of charge. In addition, we present the first application of the revised reverse isoperimetric inequality to ultraspinning black holes. Despite the violation of the original reverse isoperimetric inequality in this super-entropic regime, we find that the revised inequality remains applicable and imposes nontrivial constraints on the allowed parameter space, including an upper bound on the ultraspinning parameter $\\mu$, strengthened lower bounds on the mass $m$, and upper bounds on both the charge $q$ and the AdS radius $l$. To ensure the consistency of the thermodynamic description, the conserved charges and the first law in the ultraspinning limit are derived using the Iyer-Wald formalism together with integrability conditions.",
      "pdf_url": "https://arxiv.org/pdf/2601.22565.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22577",
      "title": "Holographic Dark Energy as a Source for Wormholes in Modified Gravity",
      "authors": [
        "G.G.L. Nashed",
        "A. Eid"
      ],
      "abstract": "Holographic Dark Energy as a Source for Wormholes in Modified Gravity G.G.L. Nashed, A. Eid 18 pages, 5 figures and two tables General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Traversable wormhole solutions are explored in $f(\\mathcal{R},\\mathbb{T})$ gravity, a curvature--matter extension in which $\\mathcal{R}$ is the Ricci scalar and $\\mathbb{T}$ denotes the trace of the energy--momentum tensor. To generate explicit wormhole models, we prescribe holographic dark-energy densities based on entropy formalism proposed by Rényi, Moradpour, and Bekenstein--Hawking, namely \\[ \\rho_{\\textit{R}} = \\frac{\\alpha}{4\\alpha_1 r^4 c^2 \\kappa}\\ln\\!\\left(1+\\pi \\alpha_1 r^2\\right), \\qquad \\rho_{\\textit{M}} = \\frac{\\alpha}{4\\pi r^2 c^2 \\kappa \\left(\\pi \\alpha_1 r^2 + 1\\right)}, \\qquad \\rho_{\\textit{BH}} = \\frac{\\alpha}{4 c^2 \\kappa r^2}, \\] with $\\alpha$ and $\\beta$ carrying dimensions of $L^{-2}$. The corresponding shape functions obtained from the field equations satisfy the standard throat and flare-out requirements for traversability. We then study how varying $\\alpha$ and $\\beta$ affects (i) the balance of forces associated with equilibrium and (ii) the status of the energy conditions. In particular, the null energy condition is found to be violated, indicating that exotic matter (or an effective exotic sector) is required to support the wormhole geometry. The spatial structure of the solutions is further visualized through embedding surfaces.",
      "pdf_url": "https://arxiv.org/pdf/2601.22577.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22644",
      "title": "Nonlocal Corrections to Scalar Field Effective Action in de Sitter spacetime",
      "authors": [
        "Will Cerne",
        "Teruaki Suyama"
      ],
      "abstract": "Nonlocal Corrections to Scalar Field Effective Action in de Sitter spacetime Will Cerne, Teruaki Suyama 15 pages, 4 figures. Comments welcome General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We investigate the one-loop effective action for a test scalar field in a general Friedmann-Lemaître-Robertson-Walker (FLRW) background, specifically focusing on quantum corrections up to the second order in the interaction strength. By employing the Schwinger-Keldysh formalism, we derive the equation of motion for the field expectation value, which incorporates not only the standard local radiative corrections but also novel nonlocal features: a memory term and a stochastic noise term. We identify all ultraviolet divergent structures within these nonlocal terms and provide a consistent renormalization procedure. To analyze the physical impact of these terms, we apply a local approximation under the assumption of slowly-varying fields, by which the memory term acts as a negative contribution to the drift coefficient. As a concrete application, we consider a massive $\\phi^4$ theory and show that these one-loop corrections lead to a suppression of the field variance in the infrared regime compared to the tree-level results.",
      "pdf_url": "https://arxiv.org/pdf/2601.22644.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22739",
      "title": "Geometric Selection Rules for Singularity Formation in Modified Gravity",
      "authors": [
        "Soumya Chakrabarti"
      ],
      "abstract": "Geometric Selection Rules for Singularity Formation in Modified Gravity Soumya Chakrabarti General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph) We argue that the polynomial degeneracies of curvature invariants can act as geometric selection rules for spacetime singularities in modified theories of gravity. The degeneracies arise purely from the algebraic structure of Riemannian geometry and impose non-trivial constraints on the effective energy-momentum tensor. We derive these constraints for metric $f(R)$ gravity and a wide class of scalar-tensor theories to show that a singularity formation is generally occluded by curvature and/or scalar-induced anisotropies. Therefore, formation of a singularity in modified theories of gravity is not always a generic outcome but can occur only along algebraically admissible branches selected by Riemannian curvature invariants.",
      "pdf_url": "https://arxiv.org/pdf/2601.22739.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.22780",
      "title": "Cosmological Dynamics of Hyperbolic Evolution Models in $f(Q,L_m)$ Gravity",
      "authors": [
        "V. A. Kshirsagar",
        "S. A. Kadam",
        "Vishwajeet S. Goswami"
      ],
      "abstract": "Cosmological Dynamics of Hyperbolic Evolution Models in $f(Q,L_m)$ Gravity V. A. Kshirsagar, S. A. Kadam, Vishwajeet S. Goswami General Relativity and Quantum Cosmology (gr-qc) This paper highlights cosmologically viable sine and cosine hyperbolic evolution functions in the framework of $f(Q,\\mathcal{L}_m)$ gravity. The models have been tested to check the behavior of the equation of state (EoS) parameter under the variation of parametric values. The EoS parameter experiences a quintessence phase, and is approaching to $-1$ at late time. The models are showing inclined behaviour with the $\\Lambda$CDM model at the late time. The viability of both the models is retested using the widely accepted energy conditions in both cases. The violation of the strong energy condition admits the accelerating behaviour of the models. The same has been explained through the analysis of the profile of deceleration parameter, which concretely supports the evidence that the models explain early deceleration to late time acceleration phenomena.",
      "pdf_url": "https://arxiv.org/pdf/2601.22780.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.23012",
      "title": "Scalar-tensor-vector gravity theory is tested by black hole photon rings",
      "authors": [
        "Qiao Yue"
      ],
      "abstract": "Scalar-tensor-vector gravity theory is tested by black hole photon rings Qiao Yue General Relativity and Quantum Cosmology (gr-qc) This paper investigates the photon ring and shadow structure of the Reissner-Nordström black hole in the scalar-tensor-vector gravitational framework. The black hole is characterized by the ( MOG) parameter (\\alpha) and the charge (Q). The study finds that as (\\alpha) increases, the event horizon radius (r_h), photon sphere radius (r_{ph}), and critical impact parameter (b_{ph}) all increase, while these decrease as (Q) increases. The innermost stable circular orbit radius (r_{isco}) exhibits similar monotonic behavior. Ray-tracing shows that as (Q) increases, the impact parameter (b) interval between the lensing ring and photon ring widens; (b_{\\text{ph}}) is non-degenerate, and the photon ring radius is uniquely determined by (\\alpha) and (Q). Using $EHT$ constraints on (SgrA^*) and (M87^*), the bounds on (\\alpha) and (Q) are derived. For (Q = 0), (0.5), and (1), the allowed ranges are (\\alpha \\in [0, 0.06]), ([0, 0.11]), and ([0.19, 0.36]), respectively. Radiative simulations show that for fixed (Q), larger (\\alpha) leads to a larger, non-degenerate photon ring. The Schwarzschild case is approached only when both (\\alpha) and (Q) are small. This provides a computational basis for testing modified black holes and offers a non-degenerate observational criterion for distinguishing quantum gravity models, consistent with current $EHT$ data. Future observations with $ngEHT$ and multi-band polarization can further test this. The results suggest that studying the photon ring structure of a Reissner-Nordström black hole in scalar-tensor-vector gravity provides a unique optical diagnostic for potential quantum-gravity tests and black hole properties.",
      "pdf_url": "https://arxiv.org/pdf/2601.23012.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.23019",
      "title": "Towards Claiming a Detection of Gravitational Memory",
      "authors": [
        "Jann Zosso",
        "Lorena Magaña Zertuche",
        "Silvia Gasparotto",
        "Adrien Cogez",
        "Henri Inchauspé",
        "Milo Jacobs"
      ],
      "abstract": "Towards Claiming a Detection of Gravitational Memory Jann Zosso, Lorena Magaña Zertuche, Silvia Gasparotto, Adrien Cogez, Henri Inchauspé, Milo Jacobs General Relativity and Quantum Cosmology (gr-qc) Gravitational memory is a zero-frequency effect associated with a permanent change in the asymptotic spacetime metric induced by radiation. While its universal manifestation is a net change of proper distances, gravitational-wave detectors are intrinsically insensitive to the final offset and can only probe the associated transition. A central challenge for any claim of detection therefore lies in defining a physically meaningful and operationally robust model of this time-dependent signal, which is uniquely attributable to gravitational memory and distinguishable from purely oscillatory radiation. In this work, we propose a general solution to this challenge. Building on a self-contained review of the theory of gravitational memory, we discuss a theoretical framework for defining and modeling a gravitational memory rise, in particular applicable to compact binary coalescences. Specializing to space-based detectors, we analyze the response of LISA to gravitational radiation including a memory contribution, with particular emphasis on mergers of supermassive black hole binaries, which offer the most promising prospects for a first single-event detection. The framework developed here provides the theoretical foundation for statistically well-defined hypothesis testing between memory-free and memory-full radiation and quantitative assessments of detection prospects. As such, these results establish a principled pathway toward a future observational claim of gravitational memory.",
      "pdf_url": "https://arxiv.org/pdf/2601.23019.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.23162",
      "title": "Causal spinfoam vertex for 4d Lorentzian quantum gravity",
      "authors": [
        "Eugenio Bianchi",
        "Chaosong Chen",
        "Mauricio Gamonal"
      ],
      "abstract": "Causal spinfoam vertex for 4d Lorentzian quantum gravity Eugenio Bianchi, Chaosong Chen, Mauricio Gamonal General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph) We introduce a new causal spinfoam vertex for $4$d Lorentzian quantum gravity. The causal data are encoded in Toller $T$-matrices, which add to Wigner $D$-matrices $T^{(+)}+T^{(-)}=D$, and for which we provide a Feynman $\\mathrm{i}\\varepsilon$ representation. We discuss how the Toller poles cancel in the EPRL vertex, how the Livine-Oriti model is obtained in the Barrett-Crane limit, and how spinfoam causal data are distinct from Regge causal data. In the large-spin limit, we show that only Lorentzian Regge geometries with causal data compatible with the spinfoam data are selected, resulting in a single exponential $\\exp(+\\mathrm{i}\\, S_{\\mathrm{Regge}}/\\hbar)$ and a new form of causal rigidity.",
      "pdf_url": "https://arxiv.org/pdf/2601.23162.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.23230",
      "title": "Detectability of Gravitational-Wave Memory with LISA: A Bayesian Approach",
      "authors": [
        "Adrien Cogez",
        "Silvia Gasparotto",
        "Jann Zosso",
        "Henri Inchauspé",
        "Chantal Pitte",
        "Lorena Magaña Zertuche",
        "Antoine Petiteau",
        "Marc Besancon"
      ],
      "abstract": "Detectability of Gravitational-Wave Memory with LISA: A Bayesian Approach Adrien Cogez, Silvia Gasparotto, Jann Zosso, Henri Inchauspé, Chantal Pitte, Lorena Magaña Zertuche, Antoine Petiteau, Marc Besancon General Relativity and Quantum Cosmology (gr-qc) Gravitational wave (GW) astronomy opens a new venue to explore the universe. Future observatories such as LISA, the Laser Interferometer Space Antenna, are expected to observe previously undetectable fundamental physics effects in signals predicted by General Relativity (GR).One particularly interesting such signal is associated to the displacement memory effect, which corresponds to a permanent deformation of spacetime due to the passage of gravitational radiation. In this work, we explore the ability of LISA to observe and characterize this effect. In order to do this, we use state-of-the-art simulations of the LISA instrument, and we perform a Bayesian analysis to assess the detectability and establish general conditions to claim detection of the displacement memory effect from individual massive black hole binary (MBHB) merger events in LISA. We perform parameter estimation both to explore the impact of the displacement memory effect and to reconstruct its amplitude. We discuss the precision at which such a reconstruction can be obtained thus opening the way to tests of GR and alternative theories. To provide astrophysical context, we apply our analysis to black hole binary populations models and estimate the rates at which the displacement memory effect could be observed within the LISA planned lifetime.",
      "pdf_url": "https://arxiv.org/pdf/2601.23230.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.23256",
      "title": "Slow-roll approximations for Gauss-Bonnet inflation revisited",
      "authors": [
        "Bogdan A. Rudenko",
        "Maria A. Skugoreva",
        "Alexey V.Toporensky"
      ],
      "abstract": "Slow-roll approximations for Gauss-Bonnet inflation revisited Bogdan A. Rudenko, Maria A. Skugoreva, Alexey V.Toporensky General Relativity and Quantum Cosmology (gr-qc) In our paper we consider the validity of slow-roll approximations for Gauss-Bonnet inflation introduced in [1]. In contrast to the cited paper where the coupling function before the Gauss-Bonnet term have been chosen as a decaying function of the scalar field, here we consider growing coupling functions. We have found that while in [1] new slow-roll approximations work considerably better, now they do not increase the precision. Moreover, we identify some cases where more involved approximations work worse than the standard one. Corresponding explanations of such a situation are given.",
      "pdf_url": "https://arxiv.org/pdf/2601.23256.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.03745",
      "title": "Strong Gravitational Lensing by Compact Object without Cauchy Horizons in Effective Quantum Gravity",
      "authors": [
        "Suvankar Paul"
      ],
      "abstract": "Strong Gravitational Lensing by Compact Object without Cauchy Horizons in Effective Quantum Gravity Suvankar Paul Major Revision. Changes are made in abstract, introduction, figures, references, section-2 and a few other places of the body. Acknowledgment and Appendix are added. Accepted version in EPJC. 25 pages, 9 figures, 2 tables General Relativity and Quantum Cosmology (gr-qc) In this work, we theoretically investigate strong gravitational lensing effects and evaluate various lensing observables of a static, spherically symmetric solution in the context of effective quantum gravity (EQG). Among the three types of solutions proposed in EQG backgrounds, this is the third type without having Cauchy horizons. This solution gives rise to black hole as well as horizonless wormhole solutions depending on the range of values of the parameters of the theory. Based on the data from SgrA* and M87* observations, possible bounds on the parameter are obtained. It is found that the horizonless wormhole solution is ruled out by SgrA* observations, but is allowed by M87* observations. We analyze and provide estimates of the lensing observables, some of which can potentially be detected by observational tools.",
      "pdf_url": "https://arxiv.org/pdf/2501.03745.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.15597",
      "title": "Higgs Inflation Model with Small Non-Minimal Coupling Constant",
      "authors": [
        "Alexander B. Kaganovich"
      ],
      "abstract": "Higgs Inflation Model with Small Non-Minimal Coupling Constant Alexander B. Kaganovich 53 pages, 8 figures, 1 table. Revised version accepted for publication in JCAP General Relativity and Quantum Cosmology (gr-qc) The Higgs sector of the Two-Measure Theory (TMT) extension of the electroweak SM (TMSM) is studied in the context of cosmology, where the only non-zero component \\varphi(t) of the cosmologically averaged Higgs field plays the role of the inflaton. The self-consistency of the system of equations has the form of an algebraic constraint defining the scalar \\zeta equal to the ratio of two volume measures, as a function of \\varphi. The \\zeta is present in all equations of motion and has a significant effect on the dynamics. After the transition in the equations of motion to the Einstein frame, the resulting system of equations is described by the TMT-effective action S_{eff} and Lagrangian L_{eff}. Due to the constraint, the original model parameters are converted into \\varphi-dependent classical effective parameters. The effective potential is U_{eff}=\\frac{\\lambda{4\\xi^2}M_P^4\\cdotF(\\varphi)\\cdot\\tanh^4\\bigl(\\frac{\\sqrt{\\xi}\\varphi}{M_P}\\bigr), where F(\\varphi)\\approx \\frac{1}{2} for \\varphi >\\sqrt{6}M_P. If \\xi=1/6, then to ensure agreement with CMB observational data, the Higgs field self-coupling model parameter \\lambda must be \\sim10^{-11}. After the end of inflation, the decrease of \\varphi leads to a change in the sign of the effective Higgs mass term, that leads to SSB. As \\varphi approaches VEV, \\zeta changes in such a way that the TMT-effective \\lambda increases by 10 orders of magnitude to the value in the GWS theory. Applying the model to the very beginning of the classical evolution of the Universe shows that cosmological dynamics can begin with a \"pathological\" and even phantom regime. However, if evolution begins with normal dynamics, then it proceeds only as inflation, and the problem of initial conditions for the onset of inflation does not arise. The fermion preheating model is described as a preliminary study of preheating after inflation.",
      "pdf_url": "https://arxiv.org/pdf/2501.15597.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.05487",
      "title": "A novel Lagrange-multiplier approach to the effective-one-body dynamics of binary systems in post-Minkowskian gravity",
      "authors": [
        "Thibault Damour",
        "Alessandro Nagar",
        "Andrea Placidi",
        "Piero Rettegno"
      ],
      "abstract": "A novel Lagrange-multiplier approach to the effective-one-body dynamics of binary systems in post-Minkowskian gravity Thibault Damour, Alessandro Nagar, Andrea Placidi, Piero Rettegno 40 pages, 13 figures, matches published version General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We present a new approach to the conservative dynamics of binary systems, within the effective one-body (EOB) framework, based on the use of a Lagrange multiplier to impose the mass-shell constraint. When applied to the post-Minkowskian (PM) description of the two-body problem in Einsteinian gravity, this Lagrange-EOB (LEOB) approach allows for a new formulation of the conservative dynamics that avoids the drawbacks of the recursive definition of EOB-PM Hamiltonians. Using state-of-the-art expressions of the resummed waveform and radiation reaction, we apply our new formalism to the construction of an aligned-spin, quasi-circular, inspiraling EOB waveform model, called {\\tt LEOB-PM}, that incorporates analytical information up to the 4PM level, completed by 4PN contributions up to the sixth order in eccentricity, in the orbital sector, and by 4.5PN contributions, in the spin-orbit sector. In the nonspinning case, we find that an uncalibrated LEOB-PM model delivers maximum EOB/NR unfaithfulness ${\\bar{F}}_{\\rm EOBNR}$ (with the Advanced LIGO noise in the total mass range $10-200M_\\odot$) varying between $0.2\\%$ and $1\\%$ over all the nonspinning dataset of the Simulating eXtreme Spacetime (SXS) Numerical Relativity (NR) catalog up to mass ratio $q=15$. It also delivers excellent phasing agreement with the $q=32$ configuration of the RIT catalog. We also found consistency between binding energies within a few percent at the NR merger location. Then, when NR-informing the dynamics of the model (both orbital and spinning sectors) by using 17 SXS dataset, we find that the EOB/NR unfaithfulness (compared to 530 spin-aligned SXS waveforms) has a median value of $5.39\\times 10^{-4}$, or $6.13\\times 10^{-4}$ (depending on the spin-spin interactions), reaching at most $\\sim 1\\%$ in some of the high-spin corners.",
      "pdf_url": "https://arxiv.org/pdf/2503.05487.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.20484",
      "title": "Fitting NANOGrav 15-year data and ACT data with modified inflation in entropic cosmology",
      "authors": [
        "Simone D'Onofrio",
        "Sergei Odintsov",
        "Tanmoy Paul"
      ],
      "abstract": "Fitting NANOGrav 15-year data and ACT data with modified inflation in entropic cosmology Simone D'Onofrio, Sergei Odintsov, Tanmoy Paul General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Recent evidences of stochastic gravitational wave background (SGWB) through Pulsar Time Array (PTA) observations hint towards an alternative inflationary scenario, compared to the usual inflation, for describing the early stage of the universe in order to be compatible with the PTA data. Moreover, currently the Atacama Cosmology Telescope (combined with the Planck 2018 and BAO) refines the constraint on inflationary observables, compared to the only-Planck 2018 measurements. In the present work, we simultaneously address these two issues by incorporating certain modification during inflation over the usual inflationary scenario. Such modification amplifies the primordial tensor perturbation over the modes that are sensitive to the NANOGrav frequency region. For this purpose, we take the thermodynamic route of cosmology where the entropy of the apparent horizon is given by a generalized form of entropy that is able to generalize the other known form of horizon entropies for suitable representations. The constraints on the model parameters coming from the ACT data also fit the NANOGrav 15-year data (based on numerical analysis), which reveal the model's compatibility with both the ACT and the PTA data.",
      "pdf_url": "https://arxiv.org/pdf/2510.20484.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.03529",
      "title": "Multi-probe analysis of strong-field effects in $f(Q)$ gravity",
      "authors": [
        "Mohsen Khodadi",
        "Behnam Pourhassan",
        "Emmanuel N. Saridakis"
      ],
      "abstract": "Multi-probe analysis of strong-field effects in $f(Q)$ gravity Mohsen Khodadi, Behnam Pourhassan, Emmanuel N. Saridakis 15 pages(two columns), 4 figures, 5 tables. v2: accepted for publication in PRD General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Covariant $f(Q)$ gravity is a viable extension of General Relativity, however its strong-field predictions remain largely untested. Using the static, spherically symmetric black-hole solutions of the theory, we confront it with the most stringent probes available: black-hole shadows, Event Horizon Telescope (EHT) measurements, S2-star precession, and strong gravitational lensing. We show that the two admissible solution branches behave very differently: Case~I produces negligible deviations from Schwarzschild solution, whereas Case~II yields significant, potentially observable corrections to the photon sphere and shadow size. From the EHT shadow diameters of M87* and Sgr~A*, we obtain tight bounds, which are further strengthened by strong-lensing coefficients. These results provide the sharpest strong-field constraints on covariant $f(Q)$ gravity to date, and point toward future tests using next-generation horizon-scale imaging and precision Galactic-center astrometry.",
      "pdf_url": "https://arxiv.org/pdf/2512.03529.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.16815",
      "title": "Exponential plateaus and inflation in metric-affine gravity",
      "authors": [
        "Antonio Racioppi"
      ],
      "abstract": "Exponential plateaus and inflation in metric-affine gravity Antonio Racioppi 12 pages, analysis expanded, extends the results of arXiv:2411.08031 to a larger class of models General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We propose a new mechanism for inflationary model building in the framework of metric-affine gravity. Such a mechanism involves an inflaton non-minimally coupled with the Holst invariant. If the non-minimal coupling function has a zero point and it is very steep at that same point, then the canonically normalized inflaton potential always features an exponential plateau, regardless of the shape of the original inflaton potential. The inflationary predictions in such a region are equivalent to the ones of Starobinsky inflation.",
      "pdf_url": "https://arxiv.org/pdf/2512.16815.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.04168",
      "title": "A framework for LISA population inference",
      "authors": [
        "Alexandre Toubiana",
        "Jonathan Gair"
      ],
      "abstract": "A framework for LISA population inference Alexandre Toubiana, Jonathan Gair General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); Solar and Stellar Astrophysics (astro-ph.SR) The Laser Interferometer Space Antenna (LISA) is expected to have a source rich data stream containing signals from large numbers of many different types of source. This will include both individually resolvable signals and overlapping stochastic backgrounds, a regime intermediate between current ground-based detectors and pulsar timing arrays. The resolved sources and backgrounds will be fitted together in a high dimensional Global Fit. To extract information about the astrophysical populations to which the sources belong, we need to decode the information in the Global Fit, which requires new methodology that has not been required for the analysis of current gravitational wave detectors. Here, we %start that development, presenting present a hierarchical Bayesian framework to infer the properties of astrophysical populations directly from the output of a LISA Global Fit, consistently accounting for information encoded in both the resolved sources and the unresolved background. Using a simplified model of the Global Fit, we illustrate how the interplay between resolved and unresolved components affects population inference and highlight the impact of data analysis choices, such as the signal-to-noise threshold for resolved sources, on the results. Our approach provides a practical foundation for population inference using LISA data.",
      "pdf_url": "https://arxiv.org/pdf/2601.04168.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.GA",
        "astro-ph.HE",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.16037",
      "title": "Exact Kerr-Newman-(A)dS and other spacetimes in bumblebee gravity: employing a novel generating technique",
      "authors": [
        "Hryhorii Ovcharenko"
      ],
      "abstract": "Exact Kerr-Newman-(A)dS and other spacetimes in bumblebee gravity: employing a novel generating technique Hryhorii Ovcharenko 40 pages, 5 figure; Supplementary Wolfram Mathematica file with derivations added to the source archive (some changes concerning the electromagnetic field were done and several new references were added in version 2) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this work, we show that if the bumblebee field in the Einstein-bumblebee theory is given by its vacuum expectation value ($B_{\\mu}=b_{\\mu}$) and it is not dynamical ($\\partial_{\\mu}B_{\\nu}-\\partial_{\\nu}B_{\\mu}=0$), then these conditions uniquely provide a generating technique, allowing us to construct exact solutions to bumblebee gravity from the vacuum solutions by adding a term $\\sim b_{\\mu}b_{\\nu}$ to the metric tensor. Also, we show that the bumblebee field within this technique is proportional to the tangential vector of the (timelike or spacelike) geodesic curve in the background vacuum spacetime, and can be easily found knowing the solution to the Hamilton-Jacobi equation. Moreover, we prove that this technique can be extended to the case of any non-zero cosmological constant and the presence of the electromagnetic field. We apply this generating technique and obtain the bumblebee extension of the Kerr-Newman-Taub-NUT-(anti-)de Sitter spacetime. We show that this extension is not unique, as it depends on the exact geodesic curve one chooses to associate a bumblebee field with. Then, by considering various special cases of this generic solution, we demonstrate that the condition of the global reality of the bumblebee field limits the set of geodesics with which we can associate it.",
      "pdf_url": "https://arxiv.org/pdf/2601.16037.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.13521",
      "title": "Navigating permanent underdetermination in dark energy and inflationary cosmology",
      "authors": [
        "William J. Wolf",
        "James Read"
      ],
      "abstract": "Navigating permanent underdetermination in dark energy and inflationary cosmology William J. Wolf, James Read Updated version. Accepted in Philosophy of Physics History and Philosophy of Physics (physics.hist-ph); General Relativity and Quantum Cosmology (gr-qc) We identify troubling cases of so-called `permanent underdetermination' in both dark energy and inflationary cosmology. We bring to bear (a) a taxonomy of possible responses to underdetermination, and (b) an understanding of both dark energy and inflationary cosmology from an effective field theory point of view. We argue that, under certain conditions, there are viable responses which can arguably alleviate at least some of the concerns about underdetermination in the dark energy and inflationary sectors. However, the epistemic threat of permanent underdetermination remains a significant challenge.",
      "pdf_url": "https://arxiv.org/pdf/2501.13521.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.01715",
      "title": "Comparison of MOND and Verlinde's emergent gravity in dwarf spheroidals",
      "authors": [
        "Youngsub Yoon",
        "Sanghyeon Han",
        "Ho Seong Hwang"
      ],
      "abstract": "Comparison of MOND and Verlinde's emergent gravity in dwarf spheroidals Youngsub Yoon, Sanghyeon Han, Ho Seong Hwang General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA) We apply Modified Newtonian Dynamics (MOND) and Verlinde's emergent gravity separately to calculate the radial accelerations in 23 dwarf spheroidals. Then, we compare them with the observed radial accelerations. In our earlier work, we determined that, when the data set is considered in its entirety without isolating individual dwarf spheroidal, Verlinde's emergent gravity is in close agreement with the observed values. In the present work, we additionally confirm that, for 21 of the 23 samples examined, Verlinde's emergent gravity follows the trend of the observed values within each dwarf spheroidal more closely than MOND. Combining the statistical significance of all the 23 samples, ranging from $-0.25\\sigma$ to 3.41$\\sigma$, we conclude that Verlinde's emergent gravity is favored over MOND at 5.2$\\sigma$.",
      "pdf_url": "https://arxiv.org/pdf/2601.01715.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.GA"
      ],
      "is_gw_related": false
    }
  ]
}